
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ЗалоговыйБилет") Тогда
		ЗалоговыйБилет = Параметры.ЗалоговыйБилет;
	КонецЕсли; 
	Если Параметры.Свойство("Клиент") Тогда
		Клиент = Параметры.Клиент;   
		ДатаСмерти = ЛБ_ОбщийМодуль.ПроверитьЕстьДатаСмерти(Клиент, ТекущаяДата());
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗалоговыйБилет) Тогда
		Сообщить("Не выбран залоговый билет!");
		Отказ = Истина;  
	Иначе          
		СтатусЗалоговогоБилета = ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(ТекущаяДата(), ЗалоговыйБилет);
		ОбновитьТаблицу();
	КонецЕсли;
	ЭтаФорма.Заголовок = "Доверенности по залоговому билету № " + СокрЛП(ЗалоговыйБилет.НомерЗалоговогоБилета) + " доверитель " + СокрЛП(Клиент);
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицу()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДоверенностиСрезПоследних.Доверенность КАК Доверенность,
	               |	ЛБ_ДоверенностиСрезПоследних.Доверенность.ВидДоверенности КАК ВидДоверенности,
	               |	ЛБ_ДоверенностиСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_ДоверенностиСрезПоследних.СтатусДоверенности КАК СтатусДоверенности,
	               |	НаличиеФайлов.ЕстьФайлы КАК ЕстьФайлы,
	               |	ЛБ_ДоверенностиСрезПоследних.ВидОперации КАК ВидОперации
	               |ИЗ
	               |	РегистрСведений.ЛБ_Доверенности.СрезПоследних(, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_ДоверенностиСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеФайлов КАК НаличиеФайлов
	               |		ПО ЛБ_ДоверенностиСрезПоследних.Доверенность = НаличиеФайлов.ОбъектСФайлами
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ДоверенностиСрезПоследних.Период
	               |АВТОУПОРЯДОЧИВАНИЕ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	ТаблицаДоверенностей.Загрузить(ТаблицаЗапроса);  
	Для каждого Стр Из ТаблицаДоверенностей Цикл
		Если Стр.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.ДоверенностьОформлена Тогда
			Если  Стр.Доверенность.СрокДействияДоверенности >= НачалоДня(ТекущаяДата()) Тогда 
				Если НЕ ЛБ_ОбщийМодуль.ПроверитьЕстьДатаСмерти(Стр.Доверенность.Клиент, ТекущаяДата()) = неопределено Тогда  
					Стр.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.СмертьДоверителя;  
				ИначеЕсли НЕ ЛБ_ОбщийМодуль.ПроверитьЕстьДатаСмерти(Стр.Доверенность.ПредставительКлиента, ТекущаяДата()) = неопределено Тогда  
					Стр.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.СмертьДоверенногоЛица;	
				Иначе	
				    Стр.Действует = Истина;  
				КонецЕсли;	
			ИначеЕсли Стр.Доверенность.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Наследство Тогда
				Если НЕ ЛБ_ОбщийМодуль.ПроверитьЕстьДатаСмерти(Стр.Доверенность.ПредставительКлиента, ТекущаяДата()) = неопределено Тогда  
					Стр.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.СмертьДоверенногоЛица;	
				Иначе	
				    Стр.Действует = Истина; 
				КонецЕсли;	
			Иначе	
				Стр.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.ДействиеПрекращено;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда) 
	Если СтатусЗалоговогоБилета = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыЗалоговыхБилетов.Закрыт") Тогда 
		Сообщить("Нельзя создавать доверенности по закрытому залоговому билету.");
		Возврат;
	КонецЕсли;	         
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗалоговыйБилет",  ЗалоговыйБилет);
	ПараметрыФормы.Вставить("Клиент",  Клиент);   
	Если ЗначениеЗаполнено(ДатаСмерти) Тогда 
		ПараметрыФормы.Вставить("ВидОперации",  ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийДоверенность.Наследство"));
	Иначе	
	    ПараметрыФормы.Вставить("ВидОперации",  ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийДоверенность.Оформление"));
	КонецЕсли;	

    ОбработкаВыбора = Новый ОписаниеОповещения("ПослеДобавленияДоверенности",ЭтаФорма);
	ОткрытьФорму("Документ.ЛБ_Доверенности.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры 

&НаКлиенте
Процедура ПослеДобавленияДоверенности(Результат, ДопПараметры) Экспорт
	ОбновитьТаблицу(); 
	Если ВладелецФормы.ИмяФормы = "ОбщаяФорма.ЛБ_РабочееМестоПриемщикаЛомбарда" Тогда
        ФормаРМП = ВладелецФормы;  
		Если ФормаРМП.Залогодатель = Клиент Тогда
            ФормаРМП.ПослеВыбораТекущееСостояниеЗБ(Истина, неопределено); 
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Анулировать(Команда)  
	ТекСтрока = Элементы.ТаблицаДоверенностей.ТекущиеДанные;  
	Если НЕ ТекСтрока = неопределено Тогда
		Если НЕ ТекСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийДоверенность.Оформление") Тогда
			Возврат;
		КонецЕсли;	

		СписокВыбора = Новый СписокЗначений; 		
		СписокВыбора.Добавить("Отзыв", "Отзыв доверенности"); 
		СписокВыбора.Добавить("Ошибка", "Ошибка"); 

		ВыбранноеЗначение = ВыбратьИзМеню(СписокВыбора, Элементы.ТаблицаДоверенностей.ТекущаяСтрока); 
		
		Если НЕ ВыбранноеЗначение = неопределено Тогда 
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Доверенность",  ТекСтрока.Доверенность);  
			Если ВыбранноеЗначение.Значение = "Отзыв" Тогда
			    ПараметрыФормы.Вставить("ВидОперации",  ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийДоверенность.Отзыв"));
			Иначе
				ПараметрыФормы.Вставить("ВидОперации",  ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийДоверенность.Ошибка")); 
			КонецЕсли;	

		    ОбработкаВыбора = Новый ОписаниеОповещения("ПослеДобавленияДоверенности",ЭтаФорма);
			ОткрытьФорму("Документ.ЛБ_Доверенности.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;  
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	ТекСтрока = Элементы.ТаблицаДоверенностей.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено И ТекСтрока.ВидДоверенности = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыДоверенностей.Письменная") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ИменаМакетов", ?(ТекСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийДоверенность.Оформление"), "Доверенность", "ДоверенностьОтмена")); 
		ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_Доверенности");
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(ТекСтрока.Доверенность);
		ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
		ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,);  
	КонецЕсли;	
КонецПроцедуры
	

&НаКлиенте
Процедура ПрисединитьСкан(Команда)  
	ТекСтрока = Элементы.ТаблицаДоверенностей.ТекущиеДанные;  
	//Если НЕ ТекСтрока = неопределено И ТекСтрока.ВидДоверенности = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыДоверенностей.Письменная") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВладелецФайла",  ТекСтрока.Доверенность);
		ПараметрыФормы.Вставить("ТолькоПросмотр", ложь);
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеПрисоединенияСкана",ЭтаФорма);

		ОткрытьФорму("Обработка.РаботаСФайлами.Форма.ПрисоединенныеФайлы", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.Независимый);
	//КонецЕсли;	
КонецПроцедуры  

&НаКлиенте
Процедура ПослеПрисоединенияСкана(Результат, ДопПараметры) Экспорт
	ОбновитьТаблицу();
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаДоверенностейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтрока = Элементы.ТаблицаДоверенностей.ТекущиеДанные;  
	Если НЕ ТекСтрока = неопределено Тогда
		СсылкаНаЭлемент = ТекСтрока.Доверенность;
		ПараметрыФормы = Новый Структура("Ключ", СсылкаНаЭлемент);
		ОткрытьФорму("Документ.ЛБ_Доверенности.ФормаОбъекта", ПараметрыФормы); 
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьИсториюДоверенности(ИдентификаторСтроки)
	СтрокаТаблицы = ТаблицаДоверенностей.НайтиПоИдентификатору(ИдентификаторСтроки);
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Доверенность", СтрокаТаблицы.Доверенность);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_Доверенности.Период КАК Период,
	               |	ЛБ_Доверенности.Ответственный КАК Ответственный,
	               |	ЛБ_Доверенности.СтатусДоверенности КАК СтатусДоверенности
	               |ИЗ
	               |	РегистрСведений.ЛБ_Доверенности КАК ЛБ_Доверенности
	               |ГДЕ
	               |	ЛБ_Доверенности.Доверенность = &Доверенность
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Результат = "";
	Пока Выборка.Следующий() Цикл 
		 Результат = Результат + ?(ПустаяСтрока(Результат), "", "; ") + Формат(Выборка.Период, "ДЛФ=DDT") + " " + Строка(Выборка.СтатусДоверенности);
		 Если Выборка.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.ДоверенностьОформлена ИЛИ 
			  Выборка.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.ДоверенностьОтозвана ИЛИ
			  Выборка.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.ДоверенностьОшибка Тогда 
		     Результат = Результат + " " + СокрЛП(Выборка.Ответственный);
		 ИначеЕсли Выборка.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.ДействиеПрекращено Тогда
			 Результат = Результат + " (закрытие залоговог билета)";
		 КонецЕсли;  
	 КонецЦикла;	 
	 Возврат Результат;
КонецФункции	

&НаКлиенте
Процедура ТаблицаДоверенностейПриАктивизацииСтроки(Элемент) 
	ТекСтрока = Элементы.ТаблицаДоверенностей.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда
		ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
		ИсторияДоверенности = ПолучитьИсториюДоверенности(ИдентификаторСтроки); 
	КонецЕсли;	
КонецПроцедуры

