#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Процедура формирует таблицы по табличным частям документа.
//
Процедура ПодготовитьТаблицыДокумента(ТаблицаСтавок) Экспорт
    Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_АкцииПроцентныеСтавкиСтавкиПроцентов.Ссылка.Акция КАК Акция,
	               |	ЛБ_АкцииПроцентныеСтавкиСтавкиПроцентов.ПричинаПрименения КАК ПричинаПрименения,
	               |	ЛБ_АкцииПроцентныеСтавкиСтавкиПроцентов.СхемаКредитования КАК СхемаКредитования,
	               |	ЛБ_АкцииПроцентныеСтавкиСтавкиПроцентов.СтатусЗалогодателя КАК СтатусЗалогодателя,
	               |	ЛБ_АкцииПроцентныеСтавкиСтавкиПроцентов.ДиапазонСумм КАК ДиапазонСумм,
	               |	ЛБ_АкцииПроцентныеСтавкиСтавкиПроцентов.СхемаРасчетаПроцентов КАК СхемаРасчетаПроцентов,
	               |	ЛБ_АкцииПроцентныеСтавкиСтавкиПроцентов.УстановитьЗначениеИлиОтконение КАК УстановитьЗначениеИлиОтконение,
	               |	ЛБ_АкцииПроцентныеСтавкиСтавкиПроцентов.Ставка КАК Ставка,
	               |	ЛБ_АкцииПроцентныеСтавкиСтавкиПроцентов.Отклонение КАК Отклонение,
	               |	ЛБ_АкцииПроцентныеСтавкиСтавкиПроцентов.ЗначениеОтклонения КАК ЗначениеОтклонения
	               |ИЗ
	               |	Документ.ЛБ_АкцииПроцентныеСтавки.УсловияСтавкиПроцентов КАК ЛБ_АкцииПроцентныеСтавкиСтавкиПроцентов
	               |ГДЕ
	               |	ЛБ_АкцииПроцентныеСтавкиСтавкиПроцентов.Ссылка = &Ссылка";
		
	РезультатЗапроса = Запрос.Выполнить();

	// Подготовим таблицу товаров для проведения.
	ТаблицаСтавок = ПодготовитьТаблицуСтавок(РезультатЗапроса);

КонецПроцедуры // ПодготовитьТаблицыДокумента()

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  СтруктураШапкиДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблиица значений.
//
Функция ПодготовитьТаблицуСтавок(РезультатЗапроса) Экспорт

	ТаблицаЗапроса = РезультатЗапроса.Выгрузить();

	ТаблицаСтавок = ТаблицаЗапроса.Скопировать();
	ТаблицаСтавок.Очистить();
	ТаблицаСтавок.Колонки.Добавить("Ломбард");

	Если Ломбарды.Количество() = 0 Тогда
		ВыборкаЛ = Справочники.ЛБ_Ломбарды.Выбрать();
		Пока ВыборкаЛ.Следующий() Цикл
			Если ВыборкаЛ.ЭтоГруппа тогда
				Продолжить;
			ИначеЕсли ВыборкаЛ.ПометкаУдаления Тогда
				Продолжить;
			КонецЕсли;	

			Для каждого Стр Из  ТаблицаЗапроса Цикл
				Если НЕ ЗначениеЗаполнено(Стр.Ставка) И НЕ ЗначениеЗаполнено(Стр.ЗначениеОтклонения) Тогда
					Продолжить;
				КонецЕсли;	     
				НоваяСтр = ТаблицаСтавок.Добавить();
				НоваяСтр.Ломбард = ВыборкаЛ.Ссылка;  
				НоваяСтр.Акция = Стр.Акция;
				НоваяСтр.ПричинаПрименения = Стр.ПричинаПрименения;
				НоваяСтр.СхемаКредитования = Стр.СхемаКредитования;
				НоваяСтр.СтатусЗалогодателя = Стр.СтатусЗалогодателя;
	            НоваяСтр.ДиапазонСумм = Стр.ДиапазонСумм; 
				НоваяСтр.СхемаРасчетаПроцентов = Стр.СхемаРасчетаПроцентов; 
				НоваяСтр.Ставка = Стр.Ставка;
				НоваяСтр.Отклонение = Стр.Отклонение;
				НоваяСтр.ЗначениеОтклонения = Стр.ЗначениеОтклонения;  
			КонецЦикла;	
		КонецЦикла;	
    Иначе
		Для каждого СтрЛ Из Ломбарды Цикл		
			Для каждого Стр Из  ТаблицаЗапроса Цикл
				Если НЕ ЗначениеЗаполнено(Стр.Ставка) И НЕ ЗначениеЗаполнено(Стр.ЗначениеОтклонения) Тогда
					Продолжить;
				КонецЕсли;	  
				НоваяСтр = ТаблицаСтавок.Добавить();
				НоваяСтр.Ломбард = СтрЛ.Ломбард.Ссылка;  
				НоваяСтр.Акция = Стр.Акция;
				НоваяСтр.ПричинаПрименения = Стр.ПричинаПрименения;
				НоваяСтр.СхемаКредитования = Стр.СхемаКредитования;
				НоваяСтр.СтатусЗалогодателя = Стр.СтатусЗалогодателя;
	            НоваяСтр.ДиапазонСумм = Стр.ДиапазонСумм;  
				НоваяСтр.СхемаРасчетаПроцентов = Стр.СхемаРасчетаПроцентов;
				НоваяСтр.Ставка = Стр.Ставка;   
				НоваяСтр.Отклонение = Стр.Отклонение;
				НоваяСтр.ЗначениеОтклонения = Стр.ЗначениеОтклонения; 
			КонецЦикла;	
		КонецЦикла;	
	КонецЕсли;	
	
	Возврат ТаблицаСтавок;

КонецФункции // ПодготовитьТаблицуТоваров()

// По результату запроса по шапке документа формируем движения по регистрам.
//
// Параметры: 
//  РежимПроведения           - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента   - выборка из результата запроса по шапке документа,
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары,
//  ТаблицаПоСкидкам          - таблица значений, содержащая данные для проведения и проверки ТЧ Скидки,
//  ТаблицаПоУслугам          - таблица значений, содержащая данные для проведения и проверки ТЧ "Услуги",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(РежимПроведения, ТаблицаСтавок, Отказ)
	
	Движения.ЛБ_АкцииПроцентныеСтавки.Записывать = Истина;
    Для Каждого ТекСтрокаС Из ТаблицаСтавок Цикл
		Движение = Движения.ЛБ_АкцииПроцентныеСтавки.Добавить();
		Движение.Период = Дата;
		Движение.ДатаНачалаДействия = ?(ДатаНачалаДействия = Дата(1,1,1), Дата, ?(ДатаНачалаДействия < Дата, Дата, ДатаНачалаДействия));
		Движение.ДатаОкончанияДействия = ДатаОкончанияДействия; 
		Движение.Акция = ТекСтрокаС.Акция;
		Движение.Ломбард = ТекСтрокаС.Ломбард;
		Движение.ПричинаПрименения = ТекСтрокаС.ПричинаПрименения;
		Движение.СхемаКредитования = ТекСтрокаС.СхемаКредитования;
		Движение.СтатусЗалогодателя = ТекСтрокаС.СтатусЗалогодателя;
        Движение.ДиапазонСуммЗайма = ТекСтрокаС.ДиапазонСумм;
		Движение.СхемаРасчетаПроцентов = ТекСтрокаС.СхемаРасчетаПроцентов;
		Движение.ПроцентнаяСтавка = ТекСтрокаС.Ставка;   
		Движение.Отклонение = ТекСтрокаС.Отклонение; 
		Движение.ЗначениеОтклонения = ТекСтрокаС.ЗначениеОтклонения;
	КонецЦикла;
		
КонецПроцедуры // ДвиженияПоРегистрам()

#Область ОбработчикиСобытий
// Процедура - обработчик события "ОбработкаУдаленияПроведения".
//
Процедура ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	ЛБ_ОбщийМодуль.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

 Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Перем ТаблицаСтавок;
	
	ПодготовитьТаблицыДокумента(ТаблицаСтавок);
		
	// Движения по документу.
	Если НЕ Отказ Тогда
		
		ДвиженияПоРегистрам(РежимПроведения, ТаблицаСтавок, Отказ);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#КонецЕсли
