
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Вид") Тогда
		Вид = Параметры.Вид;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	СтруктураВозврата = Новый структура; 
	Если НЕ Вид = 0 Тогда  
		СтруктураВозврата.Вставить("СхемаКредитования", СхемаКредитования); 
	КонецЕсли;	
	СтруктураВозврата.Вставить("Металл", Металл); 
	СтруктураВозврата.Вставить("Проба", Проба);
	СтруктураВозврата.Вставить("Категория", Категория);
	СтруктураВозврата.Вставить("Отклонение", Отклонение); 
	
	Этаформа.Закрыть(СтруктураВозврата);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Этаформа.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	Если Вид = 0 Тогда
		Элементы.СхемаКредитования.Видимость = Ложь;
	Иначе   
		Элементы.СхемаКредитования.Видимость = Истина;
	КонецЕсли;	
КонецПроцедуры	