// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда  
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ПКО) Тогда 
			ТекстСообщения = "Не выбран отменяемый приходный кассовый ордер!";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения );
			Отказ = Истина;  
		ИначеЕсли ЭтотОбъект.ПКО.Дата >	ЭтотОбъект.Дата Тогда
			ТекстСообщения = "Дата отменяемого приходного кассового ордера " + Формат(ЭтотОбъект.ПКО.Дата, "ДЛФ=DT") + " больше дата документа отмены " + Формат(ЭтотОбъект.Дата, "ДЛФ=DT") +  "!";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения );
			Отказ = Истина;  
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	НаборЗаписей = РегистрыНакопления.ЛБ_ДенежныеСредства.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ПКО);
	НаборЗаписей.Прочитать();  
	
	Движения.ЛБ_ДенежныеСредства.Записывать = Истина; 
	Для каждого Запись Из НаборЗаписей Цикл   
		Движение = Движения.ЛБ_ДенежныеСредства.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Запись.Организация;
		Движение.ВидДенежныхСредств = Запись.ВидДенежныхСредств;
		Движение.Ломбард = Запись.Ломбард;	
        Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Сумма = -Запись.Сумма;
	КонецЦикла;	
	
	НаборЗаписей = РегистрыНакопления.ЛБ_ДвиженияДенежныхСредств.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ПКО);
	НаборЗаписей.Прочитать(); 

	Движения.ЛБ_ДвиженияДенежныхСредств.Записывать = Истина;
	Для каждого Запись Из НаборЗаписей Цикл				
		Движение = Движения.ЛБ_ДвиженияДенежныхСредств.Добавить();
		Движение.Период = Дата;  
		Движение.Номер = Запись.Номер;
		Движение.Организация = Запись.Организация;
		Движение.ВидДенежныхСредств = Запись.ВидДенежныхСредств;
		Движение.Ломбард = Запись.Ломбард;	
		Движение.ВидДвиженияДС = Перечисления.ЛБ_ВидыДвиженияДС.Приход;
		Движение.КассоваяОперация = Запись.КассоваяОперация;  
		СтруктураКС = ЛБ_ОбщийМодуль.ПолучитьОткрытуюКассовуюСмену(Дата, Организация, Ломбард);
		Если НЕ СтруктураКС = неопределено Тогда
		    Движение.КассоваяСмена = СтруктураКС.КассоваяСмена; 
		КонецЕсли;	
		Движение.Сумма = -Запись.Сумма; 
		Движение.БанковскаяКарта = Запись.БанковскаяКарта;
		Движение.ВидОперации = Запись.ВидОперации;
		Движение.ДополнительнаяИнформация = Запись.ДополнительнаяИнформация;
		Движение.Дт = Запись.Дт;
		Движение.Кт = Запись.Кт;
		Движение.ДУЛ = Запись.ДУЛ;
		Движение.Контрагент = Запись.Контрагент;
		Движение.Основание = Запись.Основание;
		Движение.ФизическоеЛицо = Запись.ФизическоеЛицо;
		Движение.ФИО = Запись.ФИО;
	КонецЦикла;
КонецПроцедуры

