
Процедура ПередЗаписью(Отказ)
	Наименование = "1"; 
	
	Если ЗначениеЗаполнено(ВремяНачала) и ЗначениеЗаполнено(ВремяОкончания) Тогда
		Если ВремяНачала >= ВремяОкончания Тогда
			Отказ = Истина;
			Сообщить("Время окончания не может быть раньше времени начала");
		КонецЕсли;
	КонецЕсли;   
	Если ЗначениеЗаполнено(ВремяНачала) и НЕ ЗначениеЗаполнено(ВремяОкончания) Тогда
		Отказ = Истина;
		Сообщить("Не указано время окончания работы");
	КонецЕсли;  
	Если НЕ ЗначениеЗаполнено(ВремяНачала) и ЗначениеЗаполнено(ВремяОкончания) Тогда
		Отказ = Истина;
		Сообщить("Не указано время начала работы");
	КонецЕсли;   		
	
	
	Если Выходной > 1 И ЧасовСокращено> 0 Тогда
		Отказ = Истина;
		Сообщить("Выходной и часов сокращено не может быть в один день");
	КонецЕсли; 
	Если Выходной > 0 И РабочийДень > 0 Тогда
		Отказ = Истина;
		Сообщить("Выходной и Рабочий день не может быть в один день");
	КонецЕсли;
	
	Если ЧасовСокращено > 0 И ЗначениеЗаполнено(ВремяНачала) Тогда
		Отказ = Истина;
		//+МАН 20.01.26 Изменил сообщение
		//Было: Сообщить("Выходной и Рабочий день не может быть в один день");
		Сообщить("Установка времени начала и окончания рабочего времени не может быть в один день с сокращением часов.");
		//-МАН
	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПраздничныеСокращенныеДни.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЛБ_ПраздничныеСокращенныеДни КАК ЛБ_ПраздничныеСокращенныеДни
	               |ГДЕ
	               |	ЛБ_ПраздничныеСокращенныеДни.Дата = &Дата
	               |	И ЛБ_ПраздничныеСокращенныеДни.Ссылка <> &ТекСсылка
	               |	И ЛБ_ПраздничныеСокращенныеДни.ПометкаУдаления = Ложь";
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ТекСсылка", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Отказ = Истина;
		Сообщить("Уже есть элемент в справочнике с такой датой");	
	КонецЕсли;
КонецПроцедуры
