&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Организация") Тогда
		Организация = Параметры.Организация; 
	КонецЕсли;	
	Если Параметры.Свойство("Ломбард") Тогда
		Ломбард = Параметры.Ломбард; 
	КонецЕсли;	  
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить();
	КонецЕсли;	
КонецПроцедуры
				
&НаКлиенте
Процедура ОК(Команда)  
	СписокЗБ.Очистить();
	СтрокаОшибок = "";
	КоличествоОшибок = 0;
	Для сч = 1 По Текст.КоличествоСтрок() Цикл  
		НомерЗБ = Текст.ПолучитьСтроку(сч);
		ЗБ = ПолучитьЗБ(НомерЗБ);
		Если ЗБ = неопределено Тогда 
			СтрокаОшибок = СтрокаОшибок + ?(ПустаяСтрока(СтрокаОшибок), "", ", ") + "№ " +  СокрЛП(НомерЗБ); 
			КоличествоОшибок = КоличествоОшибок + 1;
		Иначе 
			СписокЗБ.Добавить(ЗБ);
		КонецЕсли;	
	КонецЦикла;	
	Если КоличествоОшибок = 0 Тогда
	    ЭтаФорма.закрыть(СписокЗБ); 
	Иначе	
		Если ЗначениеЗаполнено(Ломбард) Тогда		 
			Если КоличествоОшибок = 1 Тогда    
				Предупреждение("Залоговый билет " + СтрокаОшибок + " в " + сокрЛП(Ломбард) + " не найден.");
			Иначе
				Предупреждение("Залоговые билеты " + СтрокаОшибок + " в " + сокрЛП(Ломбард) + " не найдены.");
			КонецЕсли;	  
		Иначе 
			Если КоличествоОшибок = 1 Тогда    
				Предупреждение("Залоговый билет " + СтрокаОшибок + " в базе не найден.");
			Иначе
				Предупреждение("Залоговые билеты " + СтрокаОшибок + " в базе не найдены.");
			КонецЕсли;	  
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.закрыть();
КонецПроцедуры

&НаСервере
Функция ПолучитьЗБ(НомерЗалоговогоБилета)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номер", СокрЛП(НомерЗалоговогоБилета));
	Запрос.УстановитьПараметр("Организация", Организация); 
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(
	               |			,
	               |			НомерЗалоговогоБилета = &Номер
	               |				И ЗалоговыйБилет.Организация = &Организация";
	Если ЗначениеЗаполнено(Ломбард) Тогда
		Запрос.Текст = Запрос.Текст + "
	               |				И ЗалоговыйБилет.Ломбард = &Ломбард";
	КонецЕсли;	
	Запрос.Текст = Запрос.Текст + ") КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.Период УБЫВ";	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		Возврат Выборка.ЗалоговыйБилет;
	КонецЕсли;	
    Возврат неопределено;
КонецФункции;	

