&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ЗалоговыйБилет") Тогда 
		ЗалоговыйБилет = Параметры.ЗалоговыйБилет; 
		Если Параметры.Свойство("Плательщик") Тогда  
			Плательщик = Параметры.Плательщик;
		КонецЕсли;	
		Если Параметры.Свойство("ФИОПлательщика") Тогда  
			ФИОПлательщика = Параметры.ФИОПлательщика;
		КонецЕсли;	
		Если Параметры.Свойство("ДоверенностьПлательщика") Тогда  
			ДоверенностьПлательщика = Параметры.ДоверенностьПлательщика;
		КонецЕсли;	
		Если Параметры.Свойство("Доверенность") Тогда  
			Доверенность = Параметры.Доверенность;
		КонецЕсли;	 
		Если Параметры.Свойство("СтатусЗБ") Тогда  
			СтатусЗБ = Параметры.СтатусЗБ;
		КонецЕсли;
		Если Параметры.Свойство("Ломбард") Тогда  
			Ломбард = Параметры.Ломбард;
		КонецЕсли;	  
		Если Параметры.Свойство("СписокНельзяВыкупить") Тогда  
			СписокНельзяВыкупить = Параметры.СписокНельзяВыкупить;
		КонецЕсли;	 
		Если Параметры.Свойство("ЕстьВНакладной") Тогда  
			ЕстьВНакладной = Параметры.ЕстьВНакладной;
		КонецЕсли;	

		Элементы.ДекорацияЗБ.Заголовок = "Залоговый билет № " + СокрЛП(ЗалоговыйБилет.НомерЗалоговогоБилета) + ", " + ?(ЗначениеЗаполнено(Ломбард.НомерЛомбарда), "ломбард № " + СокрЛП(Ломбард.НомерЛомбарда), сокрЛП(Ломбард));  
		Элементы.ДекорацияЗаемщик.Заголовок = "Заемщик: " + СокрЛП(ЗалоговыйБилет.Залогодатель.Фамилия) + " " + СокрЛП(ЗалоговыйБилет.Залогодатель.Имя) + ?(НЕ ПустаяСтрока(ЗалоговыйБилет.Залогодатель.Отчество), " " + СокрЛП(ЗалоговыйБилет.Залогодатель.Отчество), ""); 
		Если ЗалоговыйБилет.Залогодатель = Плательщик Тогда
			Элементы.ДекорацияПлательщик.Заголовок = "Плательщик: тот же";
		Иначе	
		    Элементы.ДекорацияПлательщик.Заголовок = "Плательщик: " + ФИОПлательщика + ?(Не Пустаястрока(Доверенность), " (" + СокрЛП(Доверенность) + ")", "");  
		КонецЕсли;	
		Если Параметры.Свойство("Выкуп") Тогда
		    Выкуп = Параметры.Выкуп;
		КонецЕсли;
		Если Выкуп Тогда  
			Элементы.ГруппаОсн1.Заголовок = "Полный выкуп";
		КонецЕсли;	 
		Если Параметры.Свойство("СуммаОплаты") Тогда  
			СуммаОплаты = Параметры.СуммаОплаты;
		КонецЕсли;
		Если Параметры.Свойство("СуммаПроценты") Тогда  
			СуммаПроценты = Параметры.СуммаПроценты;
		КонецЕсли;	 
		Если Параметры.Свойство("СуммаЗайм") Тогда  
			СуммаЗайм = Параметры.СуммаЗайм;
		КонецЕсли;	 
		СуммаРуб = Цел(СуммаОплаты);
		СуммаКоп = (СуммаОплаты - Цел(СуммаОплаты))*100;
		Элементы.ДекорацияОплата.Заголовок = "Сумма оплаты " + СокрЛП(Формат(СуммаРуб, "ЧЦ=15; ЧРГ=' '")) + " руб. " +  СокрЛП(Формат(СуммаКоп, "ЧЦ=10; ЧН=00")) + " коп.";   
		СтрокаОплатаРасш = "(в т.ч. проценты " + сокрЛП(Формат(СуммаПроценты, "ЧЦ=15; ЧДЦ=2; ЧН='0, 00'")) + " руб., тело займа " + сокрЛП(Формат(СуммаЗайм, "ЧЦ=15; ЧДЦ=2; ЧН='0, 00'")) + " руб.)";
		Элементы.ДекорацияОплатаРасшифровка.Заголовок = СтрокаОплатаРасш;
		
		Если Параметры.Свойство("ДатаДок") Тогда  
			ДатаДок = Параметры.ДатаДок;
		КонецЕсли;   
		Если Параметры.Свойство("ДатаПЗС") Тогда  
			ДатаПЗС = Параметры.ДатаПЗС;
		КонецЕсли;
        Если Параметры.Свойство("ДатаВозврата") Тогда  
			ДатаВозврата = Параметры.ДатаВозврата;
		КонецЕсли;
		Если НЕ ДатаПЗС = Дата(1,1,1) Тогда
			Если ДатаПЗС <= НачалоДня(ДатаДок) Тогда 
				Элементы.ДекорацияПЗС.Заголовок = "Достигнут предельный срок займа " + Формат(ДатаПЗС, "ДФ=dd.MM.yyyy");  
			ИначеЕсли НЕ Выкуп И ДатаПЗС < ДатаВозврата Тогда 
				Элементы.ДекорацияПЗС.Заголовок = "После оплаты процентов расчетная дата возврата займа " + Формат(ДатаВозврата, "ДФ=dd.MM.yyyy") + " превысит предельный срок займа " + Формат(ДатаПЗС, "ДФ=dd.MM.yyyy"); 
			ИначеЕсли НЕ Выкуп И ДатаПЗС = ДатаВозврата Тогда 
				Элементы.ДекорацияПЗС.Заголовок = "После оплаты процентов расчетная дата возврата займа достигнет предельного срока займа " + Формат(ДатаПЗС, "ДФ=dd.MM.yyyy"); 	
			Иначе
				Элементы.ДекорацияПЗС.Видимость = Ложь;
			КонецЕсли;	 
		Иначе
			Элементы.ДекорацияПЗС.Видимость = Ложь;
		КонецЕсли;	  
				
		МожноПереоформить = ПроверитьВозможностьПереоформления();  
		Если МожноПереоформить Тогда
			Элементы.ГруппаВнимание.Видимость = Ложь;
			Элементы.ГруппаПереоформитьВыбор.Видимость = Истина;
			Элементы.Переоформить.Доступность = Истина;  
			Если ЗалоговыйБилет.Залогодатель = Плательщик Тогда   
				Элементы.СпособПереоформления1.Видимость = Истина; 
				Элементы.СпособПереоформления.Видимость = Ложь; 
				Элементы.СпособПереоформления2.Видимость = Ложь; 
			ИначеЕсли НЕ ЛБ_ОбщийМодуль.ПроверитьЕстьДатаСмерти(ЗалоговыйБилет.Залогодатель, ДатаДок) = неопределено Тогда 
				Элементы.СпособПереоформления2.Видимость = Истина;
				Элементы.СпособПереоформления1.Видимость = Ложь; 
				Элементы.СпособПереоформления.Видимость = Ложь;
				СпособПереоформления = 1;
			Иначе           
				Элементы.СпособПереоформления2.Видимость = Ложь;
				Элементы.СпособПереоформления1.Видимость = Ложь; 
				Элементы.СпособПереоформления.Видимость = Истина;
			КонецЕсли;	
		Иначе   
			Элементы.ГруппаВнимание.Видимость = Истина; 
			Элементы.ГруппаПереоформитьВыбор.Видимость = Ложь;  
			Элементы.Переоформить.Доступность = Ложь;
		КонецЕсли;	
	Иначе
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры   

&НаСервере
Функция ПроверитьВозможностьПереоформления()
	СтрокаСообщения = "";   
	Если НЕ (Плательщик = ЗалоговыйБилет.Залогодатель) И НЕ ЗначениеЗаполнено(ДоверенностьПлательщика) Тогда
		СтрокаСообщения = СтрокаСообщения + ?(ПустаяСтрока(СтрокаСообщения), "", Символы.ПС) + " Операция ""Переоформление займа"" доступна только для заемщика и доверенного лица заемщика";
        Элементы.ДекорацияВнимание.Заголовок = СтрокаСообщения;
	    Возврат ложь;
	ИначеЕсли НЕ (СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Оформлен ИЛИ СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Продлен ИЛИ
		      СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ВключенВНакладную ИЛИ СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОбъявленТорг) Тогда
		СтрокаСообщения = СтрокаСообщения + ?(ПустаяСтрока(СтрокаСообщения), "", Символы.ПС) + " Залоговый билет в статусе """ + Строка(ЭтаФорма.СтатусЗБ) + """";
		Элементы.ДекорацияВнимание.Заголовок = СтрокаСообщения;
	    Возврат ложь;
	ИначеЕсли НЕ СписокНельзяВыкупить.Количество() = 0 Тогда
		Для каждого Эл Из СписокНельзяВыкупить цикл 
			СтрокаСообщения = СтрокаСообщения + ?(ПустаяСтрока(СтрокаСообщения), "", Символы.ПС) + " - " + Эл.Значение;
		Конеццикла;	  
	КонецЕсли;	
	Элементы.ДекорацияВнимание.Заголовок = СтрокаСообщения;
	 Возврат ?(ПустаяСтрока(СтрокаСообщения), Истина, ложь);
КонецФункции

&НаКлиенте
Процедура Оплатить(Команда)  
	Результат = Новый Структура;
	Результат.Вставить("Операция", 1); 
	Результат.Вставить("ЕстьВНакладной", ЕстьВНакладной);
	Закрыть(Результат);
КонецПроцедуры

&НаКлиенте
Процедура Переоформить(Команда)
	Результат = Новый Структура;
	Результат.Вставить("Операция", 2); 
	Результат.Вставить("СпособПереоформления", СпособПереоформления);
	Результат.Вставить("ЕстьВНакладной", ЕстьВНакладной);
	Закрыть(Результат);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

