
// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)  
	Движения.ЛБ_НастройкиЗаймаВерхнегоУровня.Записывать = Истина;
	Движение = Движения.ЛБ_НастройкиЗаймаВерхнегоУровня.Добавить();
	Движение.Период = Дата;
    Движение.Организация = Организация; 
	Движение.ОкруглятьСуммуПроценты = ОкруглятьСуммуПроценты;
	Движение.ВидОкругленияСуммыПроцентов = ВидОкругленияСуммыПроцентов;	    
	Движение.ПорядокОкругленияПроценты = ПорядокОкругленияПроценты;
	Движение.ОкруглятьВБольшуюСторонуПроценты = ОкруглятьВБольшуюСторонуПроценты;	
	Движение.ОкруглятьСуммуОценка = ОкруглятьСуммуОценка;
	Движение.ПорядокОкругленияОценка = ПорядокОкругленияОценка;
	Движение.ОкруглятьВБольшуюСторонуОценка	= ОкруглятьВБольшуюСторонуОценка;
	Движение.СчитатьПроцентыДеньВыдачиРавенДеньВыкупа = СчитатьПроцентыДеньВыдачиРавенДеньВыкупа;
	Движение.НачислятьПроцентыЗаДеньЗалога = НачислятьПроцентыЗаДеньЗалога;
	Движение.НеНачислятьПроцентыЗаПоследнийДень = НеНачислятьПроцентыЗаПоследнийДень;

КонецПроцедуры	