
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокЗаявлений.Параметры.УстановитьЗначениеПараметра("Клиент", Параметры.Клиент);
	Клиент = Параметры.Клиент;
	
	Если Параметры.Печать Тогда
		Элементы.Печать.Видимость = Истина;
	Иначе
		Элементы.Отменить.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	
	Если Не Элементы.СписокЗаявлений.ТекущиеДанные = Неопределено Тогда 
		Период = Элементы.СписокЗаявлений.ТекущиеДанные.Период;
		Ответственный = Элементы.СписокЗаявлений.ТекущиеДанные.Ответственный;
		ОтветОтмена = Вопрос("Запись о подписании заявления об изменении контактных данных от " + Строка(Период) + " будет отменена.",
		РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да);
		
		Если ОтветОтмена = КодВозвратаДиалога.Да Тогда
			ЛБ_СогласияНаИнформированиеКлиент.ОтменитьИзменениеКонтактныхДанных(Клиент, Период, Ответственный);
			Элементы.СписокЗаявлений.Обновить();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	Если Не Элементы.СписокЗаявлений.ТекущиеДанные = Неопределено Тогда
		Период = Элементы.СписокЗаявлений.ТекущиеДанные.Период;
		
		ТабличныйДокумент = ЛБ_СоглашенияЭДОСервер.ПечатьЗаявлениеИзменениеКонтактныхДанных(Клиент, Период, Истина);
		КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЛБ_ИзменениеКонтактныхДанных");    
		КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
		КоллекцияПечатныхФорм[0].СинонимМакета = "Заявление об изменении контактных данных"; 
		КоллекцияПечатныхФорм[0].Экземпляров = 1;
		УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено, ЭтаФорма);
	КонецЕсли;

КонецПроцедуры
