
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард Тогда
		
		массивОтделений = СформироватьМассивОтделений();    
		
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отделение");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
		ЭлементОтбора.ПравоеЗначение = массивОтделений;
		
		
		
	КонецЕсли;

КонецПроцедуры


Функция СформироватьМассивОтделений() 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
	|ИЗ
	|	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(
	|			,
	|			Ломбард = &Ломбард
	|				И Ломбард.Закрыт = ЛОЖЬ) КАК ЛБ_ОтделенияЛомбардовСрезПоследних"; 
	Запрос.УстановитьПараметр("Ломбард", ПараметрыСеанса.ТекущийЛомбард);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Отделение");
	
КонецФункции

