&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("РКО") тогда
		Объект.РКО = Параметры.РКО;  
		Объект.Организация = Объект.РКО.Организация;
		Объект.Ломбард = Объект.РКО.Ломбард;
	КонецЕсли;	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда  
		Объект.Организация = ?(Не ЗначениеЗаполнено(Объект.Организация), Константы.ЛБ_ОсновнаяОрганизация.Получить(), Объект.Организация);    
		ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
		Если НЕ ЗначениеЗаполнено(Объект.Ломбард) Тогда
		    Объект.Ломбард = ЛБ_ОбщийМодуль.ПолучитьЛомбардПользователя(ТекПользователь); 
		КонецЕсли;	
		Объект.Дата = ТекущаяДатаСеанса();
		Если НЕ ТекПользователь.ЭтоЛомбард Тогда
       		Объект.Ответственный = ТекПользователь;
		Иначе
			Объект.Ответственный = ПараметрыСеанса.ТекущийСотрудник;
		КонецЕсли;	   
	Иначе
		Элементы.Дата.ТолькоПросмотр = Истина;
		ЭтаФорма.ИспользоватьРежимПроведения = ИспользованиеРежимаПроведения.Неоперативный;
	КонецЕсли;	             
	Если ЗначениеЗаполнено(Объект.РКО) Тогда 
		Объект.ВидОперации = "Отмена: " + Строка(Объект.РКО.ВидОперации);
        ЗаполнитьИнформациюРКО();   
	КонецЕсли;	       
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект); 
	УстановитьВидимость(); 
	ДатаДок = Объект.Дата;
КонецПроцедуры 

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


&НаСервере
Процедура УстановитьВидимость()
	Если ЗначениеЗаполнено(Объект.РКО) Тогда
        Элементы.ГруппаИнф.Видимость = Истина; 
		ЭтаФорма.Заголовок = "Отмена операции РКО № " + СокрЛП(Объект.РКО.ПредставлениеНомераРКО) + " от " + Формат(Объект.Дата, "ДЛФ=DT");
	Иначе
		Элементы.ГруппаИнф.Видимость = Ложь;
		ЭтаФорма.Заголовок = "Отмена операции РКО";
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Не ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда  
		ТекущийОбъект.Дата = ТекущаяДата();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьРКО(Команда)                
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Ломбард", Объект.Ломбард);
	ПараметрыОтбора.Вставить("Организация", Объект.Организация);  
	ПараметрыОтбора.Вставить("Проведен", Истина);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора); ///Добавляем отбор в параметры формы
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораРКО", ЭтаФорма);
	ОткрытьФорму("Документ.ЛБ_РасходныйКассовыйОрдер.ФормаВыбора", ПараметрыФормы,ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Функция ДокументПроведен(Документ)
	Возврат ?(Документ.Проведен, Истина, Ложь);
КонецФункции	

&НаСервере
Процедура ПослеВыбораРКО(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;	 
	
	Объект.РКО = Результат;  
	Объект.ВидОперации = "Отмена: " + Строка(Объект.РКО.ВидОперации);
	ЗаполнитьИнформациюРКО(); 
	УстановитьВидимость();  
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнформациюРКО() 
	РКОНомер = "Расходный кассовый ордер № " + СокрЛП(Объект.РКО.ПредставлениеНомераРКО) + " от " + Формат(Объект.РКО.Дата, "ДЛФ=DT");
	РКОВидОперации = "Операция: " + Строка(Объект.РКО.ВидОперации);  
	РКООснование = "Основание: " + СокрЛП(Объект.РКО.Основание);
	РКОФИО = "Выдано: " + СокрЛП(Объект.РКО.Выдано);
	РКОСумма = "Сумма: " + Формат(Объект.РКО.Сумма, "ЧЦ=15; ЧДЦ=2; ЧН=0,00; ЧФ='Ч руб.'");
КонецПроцедуры	


&НаКлиенте
Процедура ОткрытьРКО(Команда)
    Если ЗначениеЗаполнено(Объект.РКО) Тогда
		ПараметрыФормы = Новый Структура("Ключ", Объект.РКО);
		ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
		ОткрытьФорму("Документ.ЛБ_РасходныйКассовыйОрдер.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры





