
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Залогодатель") Тогда
		Залогодатель = Параметры.Залогодатель; 
		Элементы.Залогодатель.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("ВидДокументаЗалогодателя") Тогда
		ВидДокументаЗалогодателя = Параметры.ВидДокументаЗалогодателя; 
		Элементы.ВидДокументаЗалогодателя.ТолькоПросмотр = Истина;
	КонецЕсли;	
	
	Если Параметры.Свойство("Дата") Тогда
	    ДатаПроверки = Параметры.Дата;
	КонецЕсли;
	
	Если ДатаПроверки = Дата(1,1,1) Тогда
		ДатаПроверки = ТекущаяДата();
	КонецЕсли;
	
	ПолучитьДатуРождения();
	ЗаполнитьТаблицуДокументов();
КонецПроцедуры   

&НаСервере
Процедура ПолучитьДатуРождения()
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", ДатаПроверки);
    Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения
	               |ИЗ
	               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		ДатаРождения = Выборка.ДатаРождения;
	КонецЕсли;	
КонецПроцедуры 	

&НаСервере
Процедура ЗаполнитьТаблицуДокументов() 
	ТаблицаДокументов.Очистить();
	Если НЕ ЗначениеЗаполнено(Залогодатель) ИЛИ НЕ ЗначениеЗаполнено(ВидДокументаЗалогодателя) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаПроверки);
	Запрос.УстановитьПараметр("ВидДокументаЗалогодателя", ВидДокументаЗалогодателя);
    Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя КАК ДокументЗалогодателя
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(
	               |			&Дата,
	               |			ДокументЗалогодателя.Владелец = &Залогодатель
	               |				И ВидДокументаЗалогодателя = &ВидДокументаЗалогодателя
	               |				И ДатаСмерти = &ПустаяДата
	               |				И ДокументНеДействителен = ЛОЖЬ) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";   
	ТаблицаДокументов.Загрузить(Запрос.Выполнить().Выгрузить());
	ЕстьСвидетельствоОРождении = ложь;
	Для каждого Стр из ТаблицаДокументов цикл 		
		Если (Стр.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.СвидетельствоОРождении) Тогда
			ЕстьСвидетельствоОРождении = Истина;	
		КонецЕсли;	
		ЛБ_ОбщийМодуль.ПроверитьДействительностьДокумента(Стр, ДатаРождения,,ДатаПроверки);
	КонецЦикла;
	
	Если ЕстьСвидетельствоОРождении Тогда
		//проверим недействительность свидетельства о рождении если есть паспорт
        ЛБ_ОбщийМодуль.ПроверитьДействительностьСвидетельствоОРождении(ТаблицаДокументов);
	КонецЕсли;		
	
	Удстроки = Новый списокЗначений;
	Для каждого Стр из ТаблицаДокументов цикл
		Если Стр.ПроверкаНеДействителен Тогда
			УдСтроки.Добавить(Стр);
		КонецЕсли;	
	КонецЦикла;	
	
	Для каждого эл Из УдСтроки Цикл
		ТаблицаДокументов.Удалить(эл.Значение);
	Конеццикла;	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыборДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ЗалогодательПриИзменении(Элемент)
	ЗаполнитьТаблицуДокументов();
	ПолучитьДатуРождения();
КонецПроцедуры

&НаКлиенте
Процедура ВидДокументаЗалогодателяПриИзменении(Элемент)
	ЗаполнитьТаблицуДокументов();
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	ВыборДокумента();
КонецПроцедуры 

&НаКлиенте
Процедура ВыборДокумента()
	ТекСтрока = Элементы.ТаблицаДокументов.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("ДокументЗалогодателя", ТекСтрока.ДокументЗалогодателя);
		Этаформа.Закрыть(СтруктураВозврата);
    КонецЕсли;
КонецПроцедуры

