#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Процедура формирует таблицы по табличным частям документа.
//
Процедура ПодготовитьТаблицыДокумента(ТаблицаСтавок) Экспорт
    Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПрейскурантПроцентныхСтавокСтавкиПроцентов.ПричинаПрименения КАК ПричинаПрименения,
	               |	ЛБ_ПрейскурантПроцентныхСтавокСтавкиПроцентов.СхемаКредитования КАК СхемаКредитования,
	               |	ЛБ_ПрейскурантПроцентныхСтавокСтавкиПроцентов.СтатусЗалогодателя КАК СтатусЗалогодателя,
	               |	ЛБ_ПрейскурантПроцентныхСтавокСтавкиПроцентов.ДиапазонСумм КАК ДиапазонСумм,
	               |	ЛБ_ПрейскурантПроцентныхСтавокСтавкиПроцентов.СхемаРасчетаПроцентов КАК СхемаРасчетаПроцентов,
	               |	ЛБ_ПрейскурантПроцентныхСтавокСтавкиПроцентов.Ставка КАК Ставка
	               |ИЗ
	               |	Документ.ЛБ_ПрейскурантПроцентныхСтавок.СтавкиПроцентов КАК ЛБ_ПрейскурантПроцентныхСтавокСтавкиПроцентов
	               |ГДЕ
	               |	ЛБ_ПрейскурантПроцентныхСтавокСтавкиПроцентов.Ссылка = &Ссылка";
		
	РезультатЗапроса = Запрос.Выполнить();

	// Подготовим таблицу товаров для проведения.
	ТаблицаСтавок = ПодготовитьТаблицуСтавок(РезультатЗапроса);

КонецПроцедуры // ПодготовитьТаблицыДокумента()  

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  СтруктураШапкиДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблиица значений.
//
Функция ПодготовитьТаблицуСтавок(РезультатЗапроса) Экспорт

	ТаблицаЗапроса = РезультатЗапроса.Выгрузить();

	ТаблицаСтавок = ТаблицаЗапроса.Скопировать();
	ТаблицаСтавок.Очистить();
	ТаблицаСтавок.Колонки.Добавить("Ломбард");

	Если Ломбарды.Количество() = 0 Тогда
		ВыборкаЛ = Справочники.ЛБ_Ломбарды.Выбрать();
		Пока ВыборкаЛ.Следующий() Цикл
			Если ВыборкаЛ.ЭтоГруппа тогда
				Продолжить;
			ИначеЕсли ВыборкаЛ.ПометкаУдаления Тогда
				Продолжить;
			КонецЕсли;	

			Для каждого Стр Из  ТаблицаЗапроса Цикл
				Если НЕ ЗначениеЗаполнено(Стр.Ставка) Тогда
					Продолжить;
				КонецЕсли;	        
				НоваяСтр = ТаблицаСтавок.Добавить();
				НоваяСтр.Ломбард = ВыборкаЛ.Ссылка;
				НоваяСтр.ПричинаПрименения = Стр.ПричинаПрименения;
				НоваяСтр.СхемаКредитования = Стр.СхемаКредитования;
				НоваяСтр.СтатусЗалогодателя = Стр.СтатусЗалогодателя;
	            НоваяСтр.ДиапазонСумм = Стр.ДиапазонСумм; 
				НоваяСтр.СхемаРасчетаПроцентов = Стр.СхемаРасчетаПроцентов;
				НоваяСтр.Ставка = Стр.Ставка;
			КонецЦикла;	
		КонецЦикла;	
    Иначе
		Для каждого СтрЛ Из Ломбарды Цикл		
			Для каждого Стр Из  ТаблицаЗапроса Цикл
				Если НЕ ЗначениеЗаполнено(Стр.Ставка) Тогда
					Продолжить;
				КонецЕсли;	 
				НоваяСтр = ТаблицаСтавок.Добавить();
				НоваяСтр.Ломбард = СтрЛ.Ломбард.Ссылка;
				НоваяСтр.ПричинаПрименения = Стр.ПричинаПрименения;
				НоваяСтр.СхемаКредитования = Стр.СхемаКредитования;
				НоваяСтр.СтатусЗалогодателя = Стр.СтатусЗалогодателя;
	            НоваяСтр.ДиапазонСумм = Стр.ДиапазонСумм;  
				НоваяСтр.СхемаРасчетаПроцентов = Стр.СхемаРасчетаПроцентов;
				НоваяСтр.Ставка = Стр.Ставка; 
			КонецЦикла;	
		КонецЦикла;	
	КонецЕсли;	
	
	Возврат ТаблицаСтавок;

КонецФункции // ПодготовитьТаблицуТоваров()

// По результату запроса по шапке документа формируем движения по регистрам.
//
// Параметры: 
//  РежимПроведения           - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента   - выборка из результата запроса по шапке документа,
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары,
//  ТаблицаПоСкидкам          - таблица значений, содержащая данные для проведения и проверки ТЧ Скидки,
//  ТаблицаПоУслугам          - таблица значений, содержащая данные для проведения и проверки ТЧ "Услуги",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(РежимПроведения, ТаблицаСтавок, Отказ)
	
	Движения.ЛБ_ПрейскурантПроцентныхСтавок.Записывать = Истина;
    Для Каждого ТекСтрокаС Из ТаблицаСтавок Цикл
		Движение = Движения.ЛБ_ПрейскурантПроцентныхСтавок.Добавить();
		Движение.Период = Дата;
		Движение.ДатаНачалаДействия = ?(ДатаНачалаДействия = Дата(1,1,1), Дата, ?(ДатаНачалаДействия < Дата, Дата, ДатаНачалаДействия));
		Движение.Ломбард = ТекСтрокаС.Ломбард;
		Движение.ПричинаПрименения = ТекСтрокаС.ПричинаПрименения;
		Движение.СхемаКредитования = ТекСтрокаС.СхемаКредитования;
		Движение.СтатусЗалогодателя = ТекСтрокаС.СтатусЗалогодателя;
        Движение.ДиапазонСуммЗайма = ТекСтрокаС.ДиапазонСумм;
		Движение.СхемаРасчетаПроцентов = ТекСтрокаС.СхемаРасчетаПроцентов;
		Движение.ПроцентнаяСтавка = ТекСтрокаС.Ставка;
		Движение.Приказ = ЭтотОбъект.Приказ;
	КонецЦикла;
		
КонецПроцедуры // ДвиженияПоРегистрам()

Процедура ЗаполнитьНаОсновании(ДанныеЗаполнения) Экспорт 
	// Заполнение шапки
	Приказ = ДанныеЗаполнения.Ссылка;
	ДатаНачалаДействия = ДанныеЗаполнения.ДатаНачалаДействияПриказа;
	ОтветственныйПользователь = ПараметрыСеанса.ТекущийПользователь; 
	ОтветственныйСотрудник = ПараметрыСеанса.ТекущийСотрудник;

	СтрокаЛомбарды = ДанныеЗаполнения.СтрокаЛомбарды;  
	Ломбарды.Очистить();
	Для Каждого ТекСтрокаЛомбарды Из ДанныеЗаполнения.Ломбарды Цикл
		НоваяСтрока = Ломбарды.Добавить();
		НоваяСтрока.Ломбард = ТекСтрокаЛомбарды.Ломбард;
	КонецЦикла;    
	СтавкиПроцентов.Очистить();
	Для Каждого ТекСтрокаС Из ДанныеЗаполнения.СтавкиПроцентов Цикл
		НоваяСтр = СтавкиПроцентов.Добавить();
		НоваяСтр.ПричинаПрименения = ТекСтрокаС.ПричинаПрименения;
		НоваяСтр.СхемаКредитования = ТекСтрокаС.СхемаКредитования;
		НоваяСтр.СтатусЗалогодателя = ТекСтрокаС.СтатусЗалогодателя;
        НоваяСтр.ДиапазонСумм = ТекСтрокаС.ДиапазонСумм;  
		НоваяСтр.СхемаРасчетаПроцентов = ТекСтрокаС.СхемаРасчетаПроцентов;
		НоваяСтр.Ставка = ТекСтрокаС.Ставка;
    КонецЦикла;
 КонецПроцедуры

#Область ОбработчикиСобытий
// Процедура - обработчик события "ОбработкаУдаленияПроведения".
//
Процедура ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	ЛБ_ОбщийМодуль.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Перем ТаблицаСтавок;
	
	ПодготовитьТаблицыДокумента(ТаблицаСтавок);
		
	// Движения по документу.
	Если НЕ Отказ Тогда
		
		ДвиженияПоРегистрам(РежимПроведения, ТаблицаСтавок, Отказ);
		
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если (ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЛБ_ПриказУсловияПредоставленияЗаймов")) И (ДанныеЗаполнения.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.Базовый) Тогда 
		Если НЕ ДанныеЗаполнения.Проведен Тогда 
			ЭтотОбъект.ВводПоПриказуОтказ = Истина;
			Сообщить("Ошибка! Прейскуранта процентных ставок не может быть введен на основании не проведенного документа!", СтатусСообщения.Важное);
			Возврат; 	
		ИначеЕсли ДанныеЗаполнения.ВидПриказа = Перечисления.ЛБ_ВидыПриказа.Проект Тогда
			ЭтотОбъект.ВводПоПриказуОтказ = Истина;
			Сообщить("Ошибка! Прейскуранта процентных ставок не может быть введен на основании проекта приказа!", СтатусСообщения.Важное);
			Возврат; 	
		КонецЕсли;
		ЗаполнитьНаОсновании(ДанныеЗаполнения);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#КонецЕсли
