
Процедура ОбработкаКоманд(ИмяКоманды, ПараметрыОтчета) Экспорт
	Если ИмяКоманды = "ПечатьКассовыйЛист" Тогда
		ТабличныйДокумент = ЛБ_ЖурналКассовыхДокументовСервер.ПечатьКассовыйЛистСервер(ПараметрыОтчета);
		КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЛБ_КассовыйЛист");    
		КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
		КоллекцияПечатныхФорм[0].СинонимМакета = "Лист кассовой книги";
		УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено, Новый Структура("ЗаголовокФормы", "Лист кассовой книги"));
	ИначеЕсли ИмяКоманды = "ПечатьОтчетДДС" Тогда
		ТабличныйДокумент = ЛБ_ЖурналКассовыхДокументовСервер.ПечатьОтчетДДССервер(ПараметрыОтчета);
		КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЛБ_ОтчетДДС");    
		КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
		КоллекцияПечатныхФорм[0].СинонимМакета = "Отчёт о движении денежных средств";
		УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено, Новый Структура("ЗаголовокФормы", "Отчет о движении денежных средств за период"));
	ИначеЕсли ИмяКоманды = "ПечатьОтчетОплатаБилетовВДругихЛомбардах" Тогда
		ТабличныйДокумент = ЛБ_ЖурналКассовыхДокументовСервер.ПечатьОтчетОплатаБилетовВДругихЛомбардахСервер(ПараметрыОтчета);
		КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЛБ_ОтчетОплатаБилетовВДругихЛомбардах");    
		КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
		КоллекцияПечатныхФорм[0].СинонимМакета = "Отчет по оплатам билетов ломбарда в других ломбардах";
		УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено, Новый Структура("ЗаголовокФормы", "Отчет по оплатам билетов ломбарда в других ломбардах"));
	ИначеЕсли ИмяКоманды = "ПечатьОтчетВыданныеСОХ" Тогда
		ТабличныйДокумент = ЛБ_ЖурналКассовыхДокументовСервер.ПечатьОтчетВыданныеСОХСервер(ПараметрыОтчета);
		КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЛБ_ОтчетВыданныеСОХ");    
		КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
		КоллекцияПечатныхФорм[0].СинонимМакета = "Отчет о выданных предметах залога с ответственного хранения";
		УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено, Новый Структура("ЗаголовокФормы", "Отчет о выданных предметах залога с ОХ"));
	ИначеЕсли ИмяКоманды = "ПечатьЖурналДвиженияДМ" Тогда
		ТабличныйДокумент = ЛБ_ЖурналКассовыхДокументовСервер.ПечатьЖурналДвиженияДМ(ПараметрыОтчета);
		КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЛБ_ЖурналДвиженияДМ");    
		КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
		КоллекцияПечатныхФорм[0].СинонимМакета = "Журнал движения ДМ";
		УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено, Новый Структура("ЗаголовокФормы", "Журнал контроля за движением ювелирных изделий из ДМ и ДК"));
	ИначеЕсли ИмяКоманды = "ПечатьПакетОтчетов" Тогда
		ПечатьПакетОтчетов(ПараметрыОтчета);
	ИначеЕсли ИмяКоманды = "ПечатьПакетОтчетовПросмотр" Тогда
		ПечатьПакетОтчетовПросмотр(ПараметрыОтчета)
	КонецЕсли;
КонецПроцедуры

Процедура ПечатьПакетОтчетовПросмотр(ПараметрыОтчета)
	 
	//+МАН 02.12.25 Добавлены печатные формы в пакетную печать
	Если НачалоДня(ПараметрыОтчета.НачалоПериода) = НачалоДня(ПараметрыОтчета.КонецПериода) Тогда
		
		ТабличныйДокумент = ЛБ_ЖурналКассовыхДокументовСервер.СформироватьТабличныйДокументПКО(ПараметрыОтчета);
		
		КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЛБ_СводныйПКО");    
		КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
		КоллекцияПечатныхФорм[0].СинонимМакета = "Сводный ПКО";
		УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено, Новый Структура("ЗаголовокФормы", "Сводный ПКО"));
		
		ТабличныйДокумент = ЛБ_ЖурналКассовыхДокументовСервер.СформироватьТабличныйДокументРКО(ПараметрыОтчета);
		
		КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЛБ_СводныйРКО");    
		КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
		КоллекцияПечатныхФорм[0].СинонимМакета = "Сводный РКО";
		УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено, Новый Структура("ЗаголовокФормы", "Сводный РКО"));
	Иначе
		Сообщить("Печать сводных ПКО И РКО за период невозможна! Выберите нужную дату и запустите печать отчета за дату.");
	КонецЕсли;
	//-МАН
	
	Если НачалоДня(ПараметрыОтчета.НачалоПериода) = НачалоДня(ПараметрыОтчета.КонецПериода) Тогда
		ТабличныйДокумент = ЛБ_ЖурналКассовыхДокументовСервер.ПечатьКассовыйЛистСервер(ПараметрыОтчета);
		КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЛБ_КассовыйЛист");    
		КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
		КоллекцияПечатныхФорм[0].СинонимМакета = "Лист кассовой книги";
		УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено, Новый Структура("ЗаголовокФормы", "Лист кассовой книги"));
	Иначе
		Сообщить("Печать кассового листа за период невозможна! Выберите нужную дату и запустите печать отчета за дату.");
	КонецЕсли;
	
	ТабличныйДокумент = ЛБ_ЖурналКассовыхДокументовСервер.ПечатьОтчетДДССервер(ПараметрыОтчета);
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЛБ_ОтчетДДС");    
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
	КоллекцияПечатныхФорм[0].СинонимМакета = "Отчет о движении денежных средств за период";
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено, Новый Структура("ЗаголовокФормы", "Отчет о движении денежных средств за период"));
	
	ТабличныйДокумент = ЛБ_ЖурналКассовыхДокументовСервер.ПечатьОтчетОплатаБилетовВДругихЛомбардахСервер(ПараметрыОтчета);
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЛБ_ОтчетОплатаБилетовВДругихЛомбардах");    
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
	КоллекцияПечатныхФорм[0].СинонимМакета = "Отчет по оплатам билетов ломбарда в других ломбардах";
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено, Новый Структура("ЗаголовокФормы", "Отчет по оплатам билетов ломбарда в других ломбардах"));
	
	ТабличныйДокумент = ЛБ_ЖурналКассовыхДокументовСервер.ПечатьОтчетВыданныеСОХСервер(ПараметрыОтчета);
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЛБ_ОтчетВыданныеСОХ");    
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
	КоллекцияПечатныхФорм[0].СинонимМакета = "Отчет о выданных предметах залога с ОХ";
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено, Новый Структура("ЗаголовокФормы", "Отчет о выданных предметах залога с ОХ"));
	
	ТабличныйДокумент = ЛБ_ЖурналКассовыхДокументовСервер.ПечатьЖурналДвиженияДМ(ПараметрыОтчета);
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЛБ_ЖурналДвиженияДМ");    
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
	КоллекцияПечатныхФорм[0].СинонимМакета = "Журнал контроля за движением ювелирных изделий из ДМ и ДК";
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено, Новый Структура("ЗаголовокФормы", "Журнал контроля за движением ювелирных изделий из ДМ и ДК"));
	
	//+МАН 02.12.25 Добавлены печатные формы в пакетную печать
	ТабличныйДокумент = ЛБ_СоглашенияЭДОСервер.ПечатьОтчетОбЭДОСервер(ПараметрыОтчета);
	
    КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЛБ_ОтчетОбЭДО");    
    КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
    КоллекцияПечатныхФорм[0].СинонимМакета = "Отчет о заключенных / расторгнутых соглашениях об электронном взаимодействии, полученных заявлениях об изменении контактных данных";  // используется для формирования имени файла при сохранении из общей формы печати документов
    УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, Новый Структура("ЗаголовокФормы", "Отчет о заключенных / расторгнутых соглашениях об ЭДО"));
	
	ТабличныйДокумент = ЛБ_СогласияНаИнформированиеСервер.ПечатьОтчетОСогласияхНаИнформированиеСервер(ПараметрыОтчета);
    
    КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЛБ_ОтчетОСогласияхНаИнформирование");    
    КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
    КоллекцияПечатныхФорм[0].СинонимМакета = "Отчет о согласиях на информирование";
    УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, Новый Структура("ЗаголовокФормы", "Отчет о согласиях на информирование"));
	//-МАН
КонецПроцедуры

Процедура ПечатьПакетОтчетов(ПараметрыОтчета)
	
	//+МАН 02.12.25 Добавлены печатные формы в пакетную печать
	Если НачалоДня(ПараметрыОтчета.НачалоПериода) = НачалоДня(ПараметрыОтчета.КонецПериода) Тогда
		ТабличныйДокумент = ЛБ_ЖурналКассовыхДокументовСервер.СформироватьТабличныйДокументПКО(ПараметрыОтчета);
		ТабличныйДокумент.Напечатать();
		
		ТабличныйДокумент = ЛБ_ЖурналКассовыхДокументовСервер.СформироватьТабличныйДокументРКО(ПараметрыОтчета);
		ТабличныйДокумент.Напечатать();
	Иначе
		Сообщить("Печать сводных ПКО И РКО за период невозможна! Выберите нужную дату и запустите печать отчета за дату.");
	КонецЕсли;
	//-МАН
	
	Если НачалоДня(ПараметрыОтчета.НачалоПериода) = НачалоДня(ПараметрыОтчета.КонецПериода) Тогда
		ТабличныйДокумент = ЛБ_ЖурналКассовыхДокументовСервер.ПечатьКассовыйЛистСервер(ПараметрыОтчета);
		ТабличныйДокумент.Напечатать();
	Иначе
		Сообщить("Печать кассового листа за период невозможна! Выберите нужную дату и запустите печать отчета за дату.");
	КонецЕсли;
	
	ТабличныйДокумент = ЛБ_ЖурналКассовыхДокументовСервер.ПечатьОтчетДДССервер(ПараметрыОтчета);
	ТабличныйДокумент.Напечатать();
	
	ТабличныйДокумент = ЛБ_ЖурналКассовыхДокументовСервер.ПечатьОтчетОплатаБилетовВДругихЛомбардахСервер(ПараметрыОтчета);
	ТабличныйДокумент.Напечатать();
	
	ТабличныйДокумент = ЛБ_ЖурналКассовыхДокументовСервер.ПечатьОтчетВыданныеСОХСервер(ПараметрыОтчета);
	ТабличныйДокумент.Напечатать();
	
	ТабличныйДокумент = ЛБ_ЖурналКассовыхДокументовСервер.ПечатьЖурналДвиженияДМ(ПараметрыОтчета);
	ТабличныйДокумент.Напечатать();
	
	//+МАН 02.12.25 Добавлены печатные формы в пакетную печать
	ТабличныйДокумент = ЛБ_СоглашенияЭДОСервер.ПечатьОтчетОбЭДОСервер(ПараметрыОтчета);
	ТабличныйДокумент.Напечатать();
	
	ТабличныйДокумент = ЛБ_СогласияНаИнформированиеСервер.ПечатьОтчетОСогласияхНаИнформированиеСервер(ПараметрыОтчета);
	ТабличныйДокумент.Напечатать();
	//-МАН
КонецПроцедуры

