#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Процедура формирует таблицы по табличным частям документа.
//
Процедура ПодготовитьТаблицыДокумента(ТаблицаЦен, ТаблицаНастроек) Экспорт
    Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниЦены.ВидВставки КАК ВидВставки,
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниЦены.ФормаОгранки КАК ФормаОгранки,
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниЦены.ВидОгранки КАК ВидОгранки,
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниЦены.КачествоОгранки КАК КачествоОгранки,
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниЦены.ВесоваяГруппа КАК ВесоваяГруппа,
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниЦены.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниЦены.Цена КАК Цена
	               |ИЗ
	               |	Документ.ЛБ_ПрейскурантЦенНаДрагоценныеКамни.Цены КАК ЛБ_ПрейскурантЦенНаДрагоценныеКамниЦены
	               |ГДЕ
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниЦены.Ссылка = &Ссылка";
		
	РезультатЗапросаПоЦенам = Запрос.Выполнить();

	// Подготовим таблицу товаров для проведения.
	ТаблицаЦен = ПодготовитьТаблицуЦен(РезультатЗапросаПоЦенам);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниНастройкаОтклоненийОтБазовыхЦен.КатегорияОбъектаЗалога КАК КатегорияОбъектаЗалога,	             
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниНастройкаОтклоненийОтБазовыхЦен.ВидВставки КАК ВидВставки,
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниНастройкаОтклоненийОтБазовыхЦен.ОтклонениеОтБазовойЦены КАК ОтклонениеОтБазовойЦены,
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниНастройкаОтклоненийОтБазовыхЦен.ЗначениеОтклонения КАК ЗначениеОтклонения
	               |ИЗ
	               |	Документ.ЛБ_ПрейскурантЦенНаДрагоценныеКамни.НастройкаОтклоненийОтБазовыхЦен КАК ЛБ_ПрейскурантЦенНаДрагоценныеКамниНастройкаОтклоненийОтБазовыхЦен
	               |ГДЕ
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниНастройкаОтклоненийОтБазовыхЦен.Ссылка = &Ссылка";
		
	РезультатЗапросаПоНастройкам = Запрос.Выполнить();

	// Подготовим таблицу товаров для проведения.
	ТаблицаНастроек = ПодготовитьТаблицуНастроек(РезультатЗапросаПоНастройкам);

КонецПроцедуры // ПодготовитьТаблицыДокумента()

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  СтруктураШапкиДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблиица значений.
//
Функция ПодготовитьТаблицуЦен(РезультатЗапросаПоЦенам) Экспорт

	ТаблицаЗапроса = РезультатЗапросаПоЦенам.Выгрузить();

	ТаблицаЦен = ТаблицаЗапроса.Скопировать();
	ТаблицаЦен.Очистить();
	ТаблицаЦен.Колонки.Добавить("Ломбард");

	Если Ломбарды.Количество() = 0 Тогда
		ВыборкаЛ = Справочники.ЛБ_Ломбарды.Выбрать();
		Пока ВыборкаЛ.Следующий() Цикл
			Если ВыборкаЛ.ЭтоГруппа тогда
				Продолжить;
			ИначеЕсли ВыборкаЛ.ПометкаУдаления Тогда
				Продолжить;
			КонецЕсли;	
			Для каждого Стр Из  ТаблицаЗапроса Цикл
				Если ЭтотОбъект.НеПроводитьНулевыеЗначения И (Стр.Цена = 0) Тогда
					Продолжить;
				КонецЕсли;	
				НоваяСтр = ТаблицаЦен.Добавить();
				НоваяСтр.Ломбард = ВыборкаЛ.Ссылка;
				НоваяСтр.ВидВставки = Стр.ВидВставки;
				НоваяСтр.ФормаОгранки = Стр.ФормаОгранки;
				НоваяСтр.ВидОгранки = Стр.ВидОгранки;
				НоваяСтр.КачествоОгранки = Стр.КачествоОгранки;
				НоваяСтр.ВесоваяГруппа = Стр.ВесоваяГруппа;
				НоваяСтр.ЕдиницаИзмерения = Стр.ЕдиницаИзмерения;
	            НоваяСтр.Цена = Стр.Цена;
			КонецЦикла;	
		Конеццикла;	
	Иначе	
		Для каждого СтрЛ Из Ломбарды Цикл		
			Для каждого Стр Из  ТаблицаЗапроса Цикл
				Если ЭтотОбъект.НеПроводитьНулевыеЗначения И (Стр.Цена = 0) Тогда
					Продолжить;
				КонецЕсли;	
				НоваяСтр = ТаблицаЦен.Добавить();
				НоваяСтр.Ломбард = СтрЛ.Ломбард;
				НоваяСтр.ВидВставки = Стр.ВидВставки;
				НоваяСтр.ФормаОгранки = Стр.ФормаОгранки;
				НоваяСтр.ВидОгранки = Стр.ВидОгранки;
				НоваяСтр.КачествоОгранки = Стр.КачествоОгранки;
				НоваяСтр.ВесоваяГруппа = Стр.ВесоваяГруппа;
				НоваяСтр.ЕдиницаИзмерения = Стр.ЕдиницаИзмерения;
	            НоваяСтр.Цена = Стр.Цена;
			КонецЦикла;	
		КонецЦикла;	
	КонецЕсли;	

	Возврат ТаблицаЦен;

КонецФункции // ПодготовитьТаблицуТоваров()

Функция ПодготовитьТаблицуНастроек(РезультатЗапросаПоНастройкам) Экспорт

	ТаблицаЗапроса = РезультатЗапросаПоНастройкам.Выгрузить();

	ТаблицаНастроек = ТаблицаЗапроса.Скопировать();
	ТаблицаНастроек.Очистить();
	ТаблицаНастроек.Колонки.Добавить("Ломбард");

	Если Ломбарды.Количество() = 0 Тогда
		ВыборкаЛ = Справочники.ЛБ_Ломбарды.Выбрать();
		Пока ВыборкаЛ.Следующий() Цикл
			Если ВыборкаЛ.ЭтоГруппа тогда
				Продолжить;
			ИначеЕсли ВыборкаЛ.ПометкаУдаления Тогда
				Продолжить;
			КонецЕсли;	

			Для каждого Стр Из  ТаблицаЗапроса Цикл
				НоваяСтр = ТаблицаНастроек.Добавить();
				НоваяСтр.Ломбард = ВыборкаЛ.Ссылка;
				НоваяСтр.ВидВставки = Стр.ВидВставки;
				НоваяСтр.КатегорияОбъектаЗалога = Стр.КатегорияОбъектаЗалога;
	            НоваяСтр.ОтклонениеОтБазовойЦены = Стр.ОтклонениеОтБазовойЦены; 
				НоваяСтр.ЗначениеОтклонения = Стр.ЗначениеОтклонения;
			КонецЦикла;	
		КонецЦикла;	
    Иначе
		Для каждого СтрЛ Из Ломбарды Цикл		
			Для каждого Стр Из  ТаблицаЗапроса Цикл
				НоваяСтр = ТаблицаНастроек.Добавить();
				НоваяСтр.Ломбард = СтрЛ.Ломбард;
				НоваяСтр.ВидВставки = Стр.ВидВставки;
				НоваяСтр.КатегорияОбъектаЗалога = Стр.КатегорияОбъектаЗалога;
	            НоваяСтр.ОтклонениеОтБазовойЦены = Стр.ОтклонениеОтБазовойЦены; 
				НоваяСтр.ЗначениеОтклонения = Стр.ЗначениеОтклонения;
			КонецЦикла;	
		КонецЦикла;	
	КонецЕсли;	
	
	Возврат ТаблицаНастроек;

КонецФункции // ПодготовитьТаблицуНастроек()

// По результату запроса по шапке документа формируем движения по регистрам.
//
// Параметры: 
//  РежимПроведения           - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента   - выборка из результата запроса по шапке документа,
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары,
//  ТаблицаПоСкидкам          - таблица значений, содержащая данные для проведения и проверки ТЧ Скидки,
//  ТаблицаПоУслугам          - таблица значений, содержащая данные для проведения и проверки ТЧ "Услуги",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(РежимПроведения, ТаблицаЦен, ТаблицаНастроек, Отказ)
	
	Движения.ЛБ_ПрейскурантЦенНаДрагоценныеКамни.Записывать = Истина;
    Для Каждого ТекСтрокаЦены Из ТаблицаЦен Цикл
		Движение = Движения.ЛБ_ПрейскурантЦенНаДрагоценныеКамни.Добавить();
		Движение.Период = Дата;
		Движение.ДатаНачалаДействия = ?(ДатаНачалаДействия = Дата(1,1,1), Дата, ?(ДатаНачалаДействия < Дата, Дата, ДатаНачалаДействия));
		Движение.Ломбард = ТекСтрокаЦены.Ломбард;
		Движение.ВидВставки = ТекСтрокаЦены.ВидВставки;
		Движение.ФормаОгранки = ТекСтрокаЦены.ФормаОгранки;
		Движение.ВидОгранки = ТекСтрокаЦены.ВидОгранки;
		Движение.КачествоОгранки = ТекСтрокаЦены.КачествоОгранки;
		Движение.ВесоваяГруппа = ТекСтрокаЦены.ВесоваяГруппа;
		Движение.ЕдиницаИзмерения = ТекСтрокаЦены.ЕдиницаИзмерения;
		Движение.Цена = ТекСтрокаЦены.Цена;
		Движение.Приказ = ЭтотОбъект.Приказ;
	КонецЦикла;
	
	Движения.ЛБ_НастройкаОценкиДрагоценныхВставок.Записывать = Истина;
	Для Каждого ТекСтрокаН Из ТаблицаНастроек Цикл
		Движение = Движения.ЛБ_НастройкаОценкиДрагоценныхВставок.Добавить();
		Движение.Период = Дата;
		Движение.ДатаНачалаДействия = ?(ДатаНачалаДействия = Дата(1,1,1), Дата, ?(ДатаНачалаДействия < Дата, Дата, ДатаНачалаДействия));
		Движение.Ломбард = ТекСтрокаН.Ломбард; 
		Движение.ВидВставки = ТекСтрокаН.ВидВставки;
		Движение.КатегорияОбъектаЗалога = ТекСтрокаН.КатегорияОбъектаЗалога;
		Движение.ОтклонениеОтБазовойЦены = ТекСтрокаН.ОтклонениеОтБазовойЦены;
		Движение.ЗначениеОтклонения = ТекСтрокаН.ЗначениеОтклонения;
		Движение.Приказ = ЭтотОбъект.Приказ;
	КонецЦикла;   		

КонецПроцедуры // ДвиженияПоРегистрам()

#Область ОбработчикиСобытий
	
// Процедура - обработчик события "ОбработкаУдаленияПроведения".
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
КонецПроцедуры // ОбработкаУдаленияПроведения()


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Перем ТаблицаЦен, ТаблицаНастроек;
	
	ПодготовитьТаблицыДокумента(ТаблицаЦен, ТаблицаНастроек);
		
	// Движения по документу.
	Если НЕ Отказ Тогда
		
		ДвиженияПоРегистрам(РежимПроведения, ТаблицаЦен, ТаблицаНастроек, Отказ);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#КонецЕсли
