
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ЗалоговыйБилет") тогда         
		ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
		Если НЕ ТекПользователь.ЭтоЛомбард Тогда 
			Если УправлениеДоступом.ЕстьРоль("ЛБ_СотрудникЦО") Тогда
				СотрудникЦО = Истина;
			КонецЕсли;	 
		КонецЕсли;  
		
		Если Пользователи.ТекущийПользователь().ЭтоЛомбард Тогда
	        ТекущийЛомбард = ПараметрыСеанса.ТекущийЛомбард; 
		Иначе
			ТекущийЛомбард = ЛБ_ОбщийМодуль.ПолучитьЛомбардПользователя(Пользователи.ТекущийПользователь());
		КонецЕсли;	

		ЗалоговыйБилет = Параметры.ЗалоговыйБилет; 
		Залогодатель = ЗалоговыйБилет.Залогодатель; 
		НомерЗалоговогоБилета = ЗалоговыйБилет.НомерЗалоговогоБилета;
		ПолучитьУсловияКредита(); 
		ПолучитьСостояниеЗБНач();
		ПолучитьСостояниеЗБ();
		ЗаполнитьПоЗБ();    		
		ТаблицыЗалоговогоБилета = ЗаполнитьИнформациюПоЗБ();
	Иначе     
		ОбщегоНазначения.СообщитьПользователю("Залоговый билет не выбран");
	КонецЕсли;	
КонецПроцедуры    

&НаСервере
Процедура ПолучитьСостояниеЗБНач()
	Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
	Запрос.УстановитьПараметр("Дата", ЗалоговыйБилет.Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПричинаПрименения КАК ПричинаПрименения,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаНачалаРасчетаПроцентов КАК ДатаНачалаРасчетаПроцентов,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.НомерДопСоглашения КАК НомерДопСоглашения,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаВыкупа КАК ДатаВыкупа,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаВыкупаЛьготныйСрок КАК ДатаВыкупаЛьготныйСрок,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаПроцентовДень КАК СуммаПроцентовДень,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаПроцентовСрок КАК СуммаПроцентовСрок,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПредельныйСрокЗайма КАК ПредельныйСрокЗайма,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПредельныйСрокЗаймаДни КАК ПредельныйСрокЗаймаДни
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&Дата, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда  
		СуммаЗаймаНач = Выборка.СуммаЗайма;
		ДатаНачалаРасчетаПроцентовНач = Выборка.ДатаНачалаРасчетаПроцентов;
		ДатаВыкупаНач = Выборка.ДатаВыкупа;
		ДатаВыкупаЛьготныйСрокНач = Выборка.ДатаВыкупаЛьготныйСрок;
		СуммаПроцентовДень = Выборка.СуммаПроцентовДень;
        СуммаПроцентовСрок = Выборка.СуммаПроцентовСрок;
        ПредельныйСрокЗайма = Выборка.ПредельныйСрокЗайма;
		ПредельныйСрокЗаймаДни = Выборка.ПредельныйСрокЗаймаДни;
    КонецЕсли;
КонецПроцедуры 

&НаСервере
Процедура ПолучитьСостояниеЗБ()
	Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПричинаПрименения КАК ПричинаПрименения,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаНачалаРасчетаПроцентов КАК ДатаНачалаРасчетаПроцентов,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.НомерДопСоглашения КАК НомерДопСоглашения,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаВыкупа КАК ДатаВыкупа,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаВыкупаЛьготныйСрок КАК ДатаВыкупаЛьготныйСрок,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаПроцентовДень КАК СуммаПроцентовДень,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаПроцентовСрок КАК СуммаПроцентовСрок,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаОстановкиНачислений КАК ДатаОстановкиНачислений
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		ПричинаПрименения = Выборка.ПричинаПрименения;
		СуммаЗайма = Выборка.СуммаЗайма;
		ДатаНачалаРасчетаПроцентов = Выборка.ДатаНачалаРасчетаПроцентов;
		ДатаВыкупа = Выборка.ДатаВыкупа;
		ДатаВыкупаЛьготныйСрок = Выборка.ДатаВыкупаЛьготныйСрок; 
		ДатаОстановкиНачислений = Выборка.ДатаОстановкиНачислений;
    КонецЕсли;
КонецПроцедуры 

&НаСервере
Процедура ПолучитьУсловияКредита() 
	Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("Организация", ЗалоговыйБилет.Организация);
	Запрос.Текст = "ВЫБРАТЬ
	               |	УсловияПредоставленияКредита.НачислятьПроцентыЗаДеньЗалога КАК НачислятьПроцентыЗаДеньЗалога,
	               |	УсловияПредоставленияКредита.НеНачислятьПроцентыЗаПоследнийДень КАК НеНачислятьПроцентыЗаПоследнийДень,
	               |	УсловияПредоставленияКредита.ОкруглятьСуммуПроценты КАК ОкруглятьПроценты,
	               |	УсловияПредоставленияКредита.ПорядокОкругленияПроценты КАК ПорядокОкругления,
	               |	УсловияПредоставленияКредита.ОкруглятьВБольшуюСторонуПроценты КАК ОкруглятьВБольшуюСторону,
	               |	УсловияПредоставленияКредита.ВидОкругленияСуммыПроцентов КАК ВидОкругленияСуммыПроцентов,
	               |	УсловияПредоставленияКредита.СчитатьПроцентыДеньВыдачиРавенДеньВыкупа КАК СчитатьПроцентыДеньВыдачиРавенДеньВыкупа,
	               |	УсловияПредоставленияКредита.ОкруглятьСуммуОценка КАК ОкруглятьОценка
	               |ИЗ
	               |	РегистрСведений.ЛБ_НастройкиЗаймаВерхнегоУровня.СрезПоследних(, Организация = &Организация) КАК УсловияПредоставленияКредита";
	Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда  
		НачислятьПроцентыЗаДеньЗалога = Выборка.НачислятьПроцентыЗаДеньЗалога;
		НеНачислятьПроцентыЗаПоследнийДень = Выборка.НеНачислятьПроцентыЗаПоследнийДень;
		СчитатьПроцентыДеньВыдачиРавенДеньВыкупа = Выборка.СчитатьПроцентыДеньВыдачиРавенДеньВыкупа;
		ОкруглятьПроценты = Выборка.ОкруглятьПроценты;
		ПорядокОкругления = Выборка.ПорядокОкругления;
        ОкруглятьВБольшуюСторону = Выборка.ОкруглятьВБольшуюСторону;
        ВидОкругленияСуммыПроцентов = Выборка.ВидОкругленияСуммыПроцентов;
		ОкруглятьЦены = Выборка.ОкруглятьОценка;
    КонецЕсли;
КонецПроцедуры 

&НаСервере
Функция ПолучитьПроцентнуюСхему()   
	ПроцентнаяСтавка = 0;
	
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", ЗалоговыйБилет);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ГрафикПлатежей.ПричинаПрименения КАК ПричинаПрименения,
	               |	ЛБ_ГрафикПлатежей.ДеньНачалаПрименения КАК ДеньНачалаПрименения,
	               |	ЛБ_ГрафикПлатежей.ВидПроцентнойСтавки КАК ВидПроцентнойСтавки,
	               |	ЛБ_ГрафикПлатежей.ПроцентнаяСтавкаБазовая КАК ПроцентнаяСтавкаБазовая,
	               |	ЛБ_ГрафикПлатежей.ПроцентнаяСтавкаАкция КАК ПроцентнаяСтавкаАкция,
	               |	ЛБ_ГрафикПлатежей.ОтклонениеАкцияОтностельное КАК ОтклонениеАкцияОтностельное,
	               |	ЛБ_ГрафикПлатежей.ОтклонениеАкцияАбсолютное КАК ОтклонениеАкцияАбсолютное
	               |ИЗ
	               |	РегистрСведений.ЛБ_ГрафикПлатежей КАК ЛБ_ГрафикПлатежей
	               |ГДЕ
	               |	ЛБ_ГрафикПлатежей.Регистратор = &Регистратор"; 
	ГрафикПлатежей = Запрос.Выполнить().Выгрузить();
	ОтборС = Новый Структура;
	ОтборС.Вставить("ПричинаПрименения", Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма);
	СтрокиС = ГрафикПлатежей.НайтиСтроки(ОтборС); 
	Если НЕ СтрокиС.Количество() = 0 Тогда 
		СтрС = СтрокиС.Получить(0);	
		Если СтрС.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Базовая Тогда 
			ПроцентнаяСтавка = СтрС.ПроцентнаяСтавкаБазовая;
		ИначеЕсли СтрС.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Акционная Тогда	
			Если НЕ СтрС.ПроцентнаяСтавкаАкция = 0 Тогда 
				ПроцентнаяСтавка = СтрС.ПроцентнаяСтавкаАкция;
			ИначеЕсли НЕ СтрС.ОтклонениеАкцияАбсолютное = 0 Тогда
				ПроцентнаяСтавка = СтрС.ПроцентнаяСтавкаБазовая + СтрС.ОтклонениеАкцияАбсолютное;
			ИначеЕсли НЕ СтрС.ОтклонениеАкцияОтносительное = 0 Тогда
				ПроцентнаяСтавка = СтрС.ПроцентнаяСтавкаБазовая + СтрС.ПроцентнаяСтавка*СтрС.ОтклонениеАкцияОтносительное/100;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
	Возврат ПроцентнаяСтавка;
КонецФункции

&НаСервере
Функция ПолучитьСуммуПроцентов()   
	СуммаПроцентов = 0;  
	Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);  
	Запрос.УстановитьПараметр("Дата", ЗалоговыйБилет.Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаПроцентовСрок КАК СуммаПроцентов
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&Дата, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда  
		Возврат Выборка.СуммаПроцентов;
    КонецЕсли;
  	Возврат СуммаПроцентов;
КонецФункции	

&НаСервере
Функция ПолучитьПСКГод()
    СрокРасчета = (ДатаВыкупаНач - НачалоДня(ЗалоговыйБилет.Дата))/(24*60*60);  
	СуммаПроцентовЗБ = ПолучитьСуммуПроцентов();
	Возврат ЛБ_УправлениеЛомбардом.РасчетПСКГод(ЗалоговыйБилет.Дата, СрокРасчета, ЗалоговыйБилет.СуммаСсуды, СуммаПроцентовЗБ);
КонецФункции   

&НаСервере
Функция ПолучитьСуммуЗаймовДень()
	 СуммироватьЗаймыЗаДень = ЛОЖЬ;
	 Запрос = новый Запрос;  
	 Запрос.УстановитьПараметр("Дата", ЗалоговыйБилет.Дата);
	 Запрос.Текст = "ВЫБРАТЬ
	                |	ЛБ_НастройкаЗаймаСрезПоследних.Настройка КАК Настройка,
	                |	ЛБ_НастройкаЗаймаСрезПоследних.Значение КАК Значение
	                |ИЗ
	                |	РегистрСведений.ЛБ_НастройкаЗайма.СрезПоследних(&Дата, ) КАК ЛБ_НастройкаЗаймаСрезПоследних";
	 НастройкиЗайма = Запрос.Выполнить().Выгрузить();
	 Отбор = новый структура;
	 Отбор.Вставить("Настройка", Перечисления.ЛБ_ТипыНастроекЗайма.СуммироватьЗаймыЗаДень);
	 СтрокиН = НастройкиЗайма.НайтиСтроки(Отбор);
	 Если НЕ СтрокиН.Количество() = 0 Тогда
	    Если СтрокиН.Получить(0).Значение Тогда 
		    СуммироватьЗаймыЗаДень = Истина;
		КонецЕсли;	 
	 КонецЕсли;	    
	
	 СтруктураВ = Новый структура;
	 СтруктураВ.Вставить("Сумма", 0);
	 СтруктураВ.Вставить("НомераЗБ", "");    
	 
	 Если СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтказОтОформления Тогда
		 Возврат СтруктураВ;
     КонецЕсли;
	 
	 СписокОпераций = Новый СписокЗначений; 
	 СписокОпераций.Добавить(Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог);
	 СписокОпераций.Добавить(Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление);
	 
	 Запрос = новый Запрос; 
	 Запрос.УстановитьПараметр("Залогодатель", ЗалоговыйБилет.Залогодатель); 
	 Запрос.УстановитьПараметр("Дата1", НачалоДня(ЗалоговыйБилет.Дата)); 
	 Запрос.УстановитьПараметр("Дата2", ЗалоговыйБилет.Дата);  
	 Запрос.УстановитьПараметр("СписокОпераций", СписокОпераций);
	 
	 Запрос.Текст = "ВЫБРАТЬ
	                |	ЛБ_ОборотыПоОперациямЗаймаОбороты.Регистратор КАК Регистратор,
	                |	ЛБ_ОборотыПоОперациямЗаймаОбороты.ЗалоговыйБилет КАК ЗалоговыйБилет,
	                |	СУММА(ЛБ_ОборотыПоОперациямЗаймаОбороты.СуммаСсудыОборот) КАК СуммаСсуды
	                |ИЗ
	                |	РегистрНакопления.ЛБ_ОборотыПоОперациямЗайма.Обороты(
	                |			&Дата1,
	                |			&Дата2,
	                |			Регистратор,
	                |			ВидОперации В (&СписокОпераций)
	                |				И Залогодатель = &Залогодатель) КАК ЛБ_ОборотыПоОперациямЗаймаОбороты
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ЛБ_ОборотыПоОперациямЗаймаОбороты.Регистратор,
	                |	ЛБ_ОборотыПоОперациямЗаймаОбороты.ЗалоговыйБилет";  
     Выборка = Запрос.Выполнить().Выбрать();

	 СуммаСсуды = 0;  
	 НомераЗБ = "";
	 Пока Выборка.Следующий() Цикл 
		Если (Выборка.Регистратор.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление) И НЕ (Выборка.ЗалоговыйБилет = ЗалоговыйБилет) Тогда
			Продолжить;
		КонецЕсли;  
		СтатусЗБДень = ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(ТекущаяДатаСеанса(), Выборка.ЗалоговыйБилет);   
		Если СтатусЗБДень = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтказОтОформления Тогда
			 Продолжить;
	    КонецЕсли;

		СуммаСсуды = СуммаСсуды + Выборка.СуммаСсуды;  
		Если НЕ Выборка.Регистратор = ЗалоговыйБилет Тогда
		    НомераЗБ = НомераЗБ + ?(ПустаяСтрока(НомераЗБ), "", ", ") + СокрЛП(Выборка.Регистратор.НомерЗалоговогоБилета);
		КонецЕсли;	
	 КонецЦикла; 
		 
	 СтруктураВ.Сумма = СуммаСсуды;
	 СтруктураВ.НомераЗБ = НомераЗБ; 
	 Возврат СтруктураВ;
КонецФункции	

&НаСервере
Функция СоздатьНовуюОплатуПроцентов(Дата)
	ДокументОбъект = Документы.ЛБ_ОперацияПоЗалогу.СоздатьДокумент(); 
	ДокументОбъект.ПредыдущаяОперация = ЗалоговыйБилет; 
	ДокументОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов;
	ДокументОбъект.Дата = Дата; 
	ДокументОбъект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить();
	ДокументОбъект.ПроцентнаяСхема = ЗалоговыйБилет.ПроцентнаяСхема;  
	Возврат ДокументОбъект; 
КонецФункции

&НаСервере
Функция РасчитатьДолгПоПроцентам(Дата, СуммаЗайма, ПричинаПримененияПроцентнойСхемы, ДатаНачалаРасчета)
	ДокументОбъект = СоздатьНовуюОплатуПроцентов(Дата); 	    
	
	СтруктураП = ЛБ_УправлениеЛомбардом.ПолучитьПредельныеЗначенияПроцентов(ЗалоговыйБилет.Дата, ЗалоговыйБилет.Организация);
	Если НЕ СтруктураП = неопределено Тогда
	    ПланкаПроцентов = СтруктураП.ПланкаПроцентов;
		ПредельноеЗначениеПроцентов = ЗалоговыйБилет.СуммаСсуды*СтруктураП.ПланкаПроцентов; 
	Иначе
		ПредельноеЗначениеПроцентов = 0;
	КонецЕсли;   
	СтруктураОкр = ЛБ_УправлениеЛомбардом.ПолучитьУсловияОкругленияПроцентов(ЗалоговыйБилет);
	Установки = ЛБ_УправлениеЛомбардом.ПолучитьУсловияПоДоговору(ЗалоговыйБилет); 
	Результат = ЛБ_ОбщийМодуль.РассчитатьСуммуПроцентовОплата(ДокументОбъект, ДатаНачалаРасчета, ПредельноеЗначениеПроцентов, ПричинаПримененияПроцентнойСхемы, Установки, СтруктураОкр); 
	
	Возврат ДокументОбъект.НачислениеПроцентовДетально;
КонецФункции

&НаСервере
Функция ПолучитьДокументОтмены(Ссылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&Период, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
		|ГДЕ
		|	ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент В(&ЗБ)";
	
	Запрос.УстановитьПараметр("ЗБ", Ссылка);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция  ПолучитьДатуПоследнейОплатыЗБ()
	 Запрос = новый Запрос; 
	 Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
     Запрос.Текст = "ВЫБРАТЬ
                    |	ЛБ_ОборотыПоОперациямЗаймаОбороты.Период КАК Период,
                    |	ЛБ_ОборотыПоОперациямЗаймаОбороты.Регистратор КАК Регистратор
                    |ИЗ
                    |	РегистрНакопления.ЛБ_ОборотыПоОперациямЗайма.Обороты(
                    |			,
                    |			,
                    |			Регистратор,
                    |			ЗалоговыйБилет = &ЗалоговыйБилет
                    |				И (ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов)
                    |					ИЛИ ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление))) КАК ЛБ_ОборотыПоОперациямЗаймаОбороты
                    |ГДЕ
                    |	НЕ ЛБ_ОборотыПоОперациямЗаймаОбороты.Регистратор = &ЗалоговыйБилет
                    |
                    |УПОРЯДОЧИТЬ ПО
                    |	Период УБЫВ";
	 Выборка = Запрос.Выполнить().Выбрать();
	 Пока Выборка.Следующий() Цикл 
		 Если ПолучитьДокументОтмены(Выборка.Регистратор) тогда 
			 Продолжить;
		 КонецЕсли;	 
		 Возврат Выборка.Период;
	 КонецЦикла;
	 Возврат неопределено;
КонецФункции  

&НаСервере
Функция  ПолучитьНачислениеОплатуЗБ()
	Запрос = новый Запрос; 
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.Текст ="ВЫБРАТЬ
	              |	ЛБ_РасчетыСКлиентамиОбороты.ВидРасчета КАК ВидРасчета,
	              |	СУММА(ЛБ_РасчетыСКлиентамиОбороты.СуммаПриход) КАК Начислено,
	              |	СУММА(ЛБ_РасчетыСКлиентамиОбороты.СуммаРасход) КАК Оплачено
	              |ИЗ
	              |	РегистрНакопления.ЛБ_РасчетыСКлиентами.Обороты(, , , ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_РасчетыСКлиентамиОбороты
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	ЛБ_РасчетыСКлиентамиОбороты.ВидРасчета"; 
	Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции 

&НаСервере
Процедура ЗаполнитьТовары() 
	Запрос = Новый Запрос;   
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаОплаты КАК СуммаОплаты,
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаДолгаЗайма КАК СуммаДолга
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.Период УБЫВ";
	ТаблицаСостоянийОЗ = Запрос.Выполнить().Выгрузить();
	
	Товары.Очистить();
	Для каждого стр Из ЗалоговыйБилет.Товары Цикл
		НоваяСтр = Товары.Добавить(); 
		ЗаполнитьЗначенияСвойств(НоваяСтр, стр);  
		НоваяСтр.Артикул = ЛБ_УправлениеЛомбардом.АртикулОбъектаЗалога(ЗалоговыйБилет, стр.НомерСтроки); 
		Отбор = новый Структура;
		Отбор.Вставить("ОбъектЗалога", Стр.ОбъектЗалога); 
		СтрокиОЗ = ТаблицаСостоянийОЗ.НайтиСтроки(Отбор);
		Если НЕ СтрокиОЗ.Количество() = 0 Тогда    
			СтрОЗ = СтрокиОЗ.Получить(0);
			НоваяСтр.Статус = СтрОЗ.СтатусОбъектаЗалога;   
			НоваяСтр.Оплачено = СтрОЗ.СуммаОплаты; 
			НоваяСтр.Долг = СтрОЗ.СуммаДолга;
		КонецЕсли;	
	Конеццикла;	 

КонецПроцедуры   	

&НаСервере
Функция ПолучитьТекущийПриказ() 
	Приказ = Документы.ЛБ_ПриказУсловияПредоставленияЗаймов.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Залоговыйбилет.Дата);
	Запрос.УстановитьПараметр("Ломбард", Залоговыйбилет.Ломбард); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПрейскурантПроцентныхСтавок.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПрейскурантПроцентныхСтавок КАК ЛБ_ПрейскурантПроцентныхСтавок
	               |ГДЕ
	               |	ЛБ_ПрейскурантПроцентныхСтавок.Ломбард = &Ломбард
	               |	И ЛБ_ПрейскурантПроцентныхСтавок.ДатаНачалаДействия <= &Дата
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ПрейскурантПроцентныхСтавок.Период УБЫВ"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Регистратор;
    КонецЕсли;
	Возврат Приказ;
Конецфункции

&НаСервере
Функция ПолучитьДатуВыкупаРеализации() 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОборотыПоОперациямЗайма.Период КАК Период
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОборотыПоОперациямЗайма КАК ЛБ_ОборотыПоОперациямЗайма
	               |ГДЕ
	               |	ЛБ_ОборотыПоОперациямЗайма.ЗалоговыйБилет = &ЗалоговыйБилет
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ";  
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Период;
	КонецЕсли;	
	Возврат неопределено;
КонецФункции

&НаСервере
Функция ЗаполнитьИнформациюПоЗБ()       
	НачисленияОстановлены = Ложь;
	Если СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят ИЛИ 
		 СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен ИЛИ
		 СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Остановлен Тогда   
		НачисленияОстановлены = Истина;
	КонецЕсли;	

	Если НЕ ДатаСмерти = Дата(1,1,1) Тогда   
		ПредыдущийСтатусЗБ = ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(ДатаСмерти-1, ЗалоговыйБилет); 
		Если ПредыдущийСтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят ИЛИ 
		     ПредыдущийСтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен ИЛИ
		     ПредыдущийСтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Остановлен Тогда 
			НачисленияОстановлены = Истина; 
		КонецЕсли; 
	КонецЕсли;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;  
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщиеМакеты.ЛБ_ТекущееСостояниеЗБ");  
    ОбластьМакета = Макет.ПолучитьОбласть("Основная"); 
	ОбластьМакета.Параметры.СхемаКредитования = ?(Не ПустаяСтрока(ЗалоговыйБилет.СхемаКредитования.НаименованиеДляПечати), ЗалоговыйБилет.СхемаКредитования.НаименованиеДляПечати, ЗалоговыйБилет.СхемаКредитования);  
	ОбластьМакета.Параметры.Продление = ?(ЗалоговыйБилет.СхемаКредитования.БезПродленияДоговора, "Нет", "Да");
	ОбластьМакета.Параметры.СККратко = ЗалоговыйБилет.СхемаКредитования.НаименованиеКраткое;     
	СтавкаПроцентовНач  = ПолучитьПроцентнуюСхему();
	ОбластьМакета.Параметры.ПроцентнаяСтавка = СтавкаПроцентовНач; 
	Если СотрудникЦО Тогда
	    СтруктураП = Новый структура;
	    СтруктураП.Вставить("Вид", 1);  
	 	ОбластьМакета.Параметры.СтруктураП = СтруктураП;                                                 
	КонецЕсли;	
	//Если НЕ ЗалоговыйБилет.СхемаКредитования.БезПродленияДоговора Тогда
	    ОбластьМакета.Параметры.ПСК = ПолучитьПСКГод(); 
	//КонецЕсли;	
	ОбластьМакета.Параметры.ПСЗ = Формат(Этаформа.ПредельныйСрокЗайма, "ДФ=dd.MM.yyyy") + " (" + Строка(Этаформа.ПредельныйСрокЗаймаДни) + ")";
    ОбластьМакета.Параметры.Дата = Формат(ЗалоговыйБилет.Дата, "ДФ=dd.MM.yyyy"); 
	ОбластьМакета.Параметры.СрокЗайма = ЗалоговыйБилет.СрокЗалога;  
	ОбластьМакета.Параметры.СуммаОценки = ЗалоговыйБилет.Товары.Итог("СуммаОценкиМаксимальная");
	ОбластьМакета.Параметры.ДатаВозврата = Формат(ДатаВыкупаНач, "ДФ=dd.MM.yyyy"); 
	ОбластьМакета.Параметры.ДатаВозвратаЛьготная = Формат(ДатаВыкупаЛьготныйСрокНач, "ДФ=dd.MM.yyyy"); 
	ОбластьМакета.Параметры.СуммаСсуды = Формат(СуммаЗаймаНач, "ЧЦ=15; ЧДЦ=2");  
	СуммаПроцентовДеньНач = СуммаЗаймаНач*СтавкаПроцентовНач/100; 
	Если ВидОкругленияСуммыПроцентов = Перечисления.ЛБ_ВидыОкругленияСуммыПроцентов.ОкруглениеПослеУмноженияНаКоличествоДней Тогда
	    ОбластьМакета.Параметры.ПроцентыДень = Формат(СуммаПроцентовДеньНач, "ЧЦ=15; ЧДЦ=5");  
	Иначе  
		ОбластьМакета.Параметры.ПроцентыДень = Формат(СуммаПроцентовДеньНач, "ЧЦ=15; ЧДЦ=2"); 
	КонецЕсли;	
	ОбластьМакета.Параметры.ПроцентыСрок = Формат(СуммаПроцентовСрок, "ЧЦ=15; ЧДЦ=2");  
	ОбластьМакета.Параметры.СуммаВсего = Формат(СуммаЗаймаНач + СуммаПроцентовСрок, "ЧЦ=15; ЧДЦ=2");
	ОбластьМакета.Параметры.Акция = ЗалоговыйБилет.Акция;
	ОбластьМакета.Параметры.Промокод = ЗалоговыйБилет.Промокод;
	ОбластьМакета.Параметры.Предъявитель = ?(ЗалоговыйБилет.Предъявитель, "V", ""); 
	СтруктураВ = ПолучитьСуммуЗаймовДень();   
	Если НЕ СтруктураВ = неопределено Тогда 
		ОбластьМакета.Параметры.СуммаДень = СтруктураВ.Сумма; 
		ОбластьМакета.Параметры.ЗБДень = СтруктураВ.НомераЗБ;
	КонецЕсли;	
	ДатаОплаты = ПолучитьДатуПоследнейОплатыЗБ();
	Если НЕ ДатаОплаты = неопределено тогда
		ОбластьМакета.Параметры.ДатаОплатыЗБ = Формат(ДатаОплаты , "ДФ=dd.MM.yyyy"); 
		Если НЕ (СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт ИЛИ СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Реализован) Тогда
		    ОбластьМакета.Параметры.ДатаОплКолДней = (НачалоДня(ТекущаяДатаСеанса()) - НачалоДня(ДатаОплаты)) / (60 * 60 * 24); 
		КонецЕсли;	
	КонецЕсли;	
	
	Если НЕ (СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт ИЛИ СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Реализован ИЛИ СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтказОтОформления) Тогда 
		ЗаймДни = (НачалоДня(ТекущаяДатаСеанса()) - НачалоДня(ЗалоговыйБилет.Дата)) / (60 * 60 * 24);  
		Если (ЗаймДни < ПредельныйСрокЗаймаДни) Тогда
			ОбластьМакета.Параметры.ЗаймДни = Строка(ЗаймДни); 	
        Иначе
			Если НЕ (статусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтвественноеХранение ИЛИ
			         статусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ВПутиОХ ИЛИ
				     статусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ГотовКОтправкеОХ) тогда 
			    ОбластьМакета.Параметры.ЗаймДни = Строка(ЗаймДни) + " (достигнут ПСЗ)"; 	
			Иначе     
				ОбластьМакета.Параметры.ЗаймДни = Строка(ЗаймДни);
			КонецЕсли;	
		КонецЕсли;
	ИначеЕсли НЕ СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтказОтОформления Тогда
	    ДатаВыкупаРеализации = ПолучитьДатуВыкупаРеализации();   
		Если НЕ ДатаВыкупаРеализации = неопределено Тогда
			ЗаймДни = (НачалоДня(ДатаВыкупаРеализации) - НачалоДня(ЗалоговыйБилет.Дата)) / (60 * 60 * 24); 
			ОбластьМакета.Параметры.ЗаймДни = Строка(ЗаймДни);
		КонецЕсли;	
	КонецЕсли;	    
	Если НЕ ЗалоговыйБилет.СхемаКредитования.БезПродленияДоговора Тогда
		ОбластьМакета.Параметры.ТекДатаВозврата = Формат(ДатаВыкупа, "ДФ=dd.MM.yyyy"); 
		ОбластьМакета.Параметры.ТекДатаВозвратаЛьготная = Формат(ДатаВыкупаЛьготныйСрок, "ДФ=dd.MM.yyyy");  
	КонецЕсли;	
	ОбластьМакета.Параметры.ТекСуммаСсуды = Формат(СуммаЗайма, "ЧЦ=15; ЧДЦ=2"); 
	Если НЕ (СуммаЗайма = 0 ИЛИ СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Реализован) Тогда 
		Если НачисленияОстановлены Тогда
			НачисленоВозврат = ЛБ_ОбщийМодуль.ПолучитьОстатокПроцентов(, ЗалоговыйБилет); 
			ОбластьМакета.Параметры.ТекПроцентыСрок = НачисленоВозврат;  
			ОбластьМакета.Параметры.ТекПроцентыДень = "0,00";
		Иначе	
			ТаблицаНачислений = РасчитатьДолгПоПроцентам(ДатаВыкупа, СуммаЗайма, ПричинаПрименения, ДатаНачалаРасчетаПроцентов); 
			НачисленоВозврат = ТаблицаНачислений.Итог("СуммаПроцентов");
			ОбластьМакета.Параметры.ТекПроцентыСрок = НачисленоВозврат;
			СтрДоп = ТаблицаНачислений.Получить(0);
			СтавкаП = СтрДоп.ПроцентнаяСтавкаБазовая;
			Если НЕ СтавкаП = 0 Тогда
				Если СтрДоп.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Акционная Тогда
					Если НЕ СтрДоп.ПроцентнаяСтавкаАкция = 0 Тогда
						СтавкаП = СтрДоп.ПроцентнаяСтавкаАкция;
					ИначеЕсли НЕ СтрДоп.ОтклонениеАкцияОтносительное = 0 Тогда	 
						СтавкаП = СтрДоп.ПроцентнаяСтавкаБазовая + СтрДоп.ПроцентнаяСтавкаБазовая*СтрДоп.ОтклонениеАкцияОтносительное/100;
					ИначеЕсли НЕ СтрДоп.ОтклонениеАкцияАбсолютное = 0 Тогда
						СтавкаП = СтрДоп.ПроцентнаяСтавкаБазовая + СтрДоп.ОтклонениеАкцияАбсолютное;
				    КонецЕсли; 
				КонецЕсли;	   
				Если ВидОкругленияСуммыПроцентов = Перечисления.ЛБ_ВидыОкругленияСуммыПроцентов.ОкруглениеПослеУмноженияНаКоличествоДней Тогда
			        ОбластьМакета.Параметры.ТекПроцентыДень = Формат(СуммаЗайма*СтавкаП/100, "ЧЦ=15; ЧДЦ=5");  
				Иначе  
					ОбластьМакета.Параметры.ТекПроцентыДень = Формат(СуммаЗайма*СтавкаП/100, "ЧЦ=15; ЧДЦ=2");
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;		
		ОбластьМакета.Параметры.ТекСуммаВсего = СуммаЗайма + НачисленоВозврат; 
	КонецЕсли;	
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Если НЕ СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтказОтОформления Тогда  
		ОбластьМакета = Макет.ПолучитьОбласть("Расчет");
		ТаблицаОплат = ПолучитьНачислениеОплатуЗБ();
		НачисленоПроценты = 0; 
		ОплаченоПроценты = 0;

		Отбор = Новый Структура;
		Отбор.Вставить("ВидРасчета", Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам);
		Строки = ТаблицаОплат.Найтистроки(Отбор);
		Если НЕ Строки.Количество() = 0 Тогда 
			Стр = строки.получить(0);
			НачисленоПроценты = Стр.Начислено; 
			ОплаченоПроценты = Стр.Оплачено;
		КонецЕсли;	
		
		Если НЕ СуммаЗайма = 0 И НЕ НачисленияОстановлены Тогда
			ТаблицаНачислений = РасчитатьДолгПоПроцентам(ТекущаяДатаСеанса(), СуммаЗайма, ПричинаПрименения, ДатаНачалаРасчетаПроцентов); 
			НачисленоПроценты = НачисленоПроценты + ТаблицаНачислений.Итог("СуммаПроцентов");
		КонецЕсли;	
		
		ОплаченоЗайм = 0;

		Отбор = Новый Структура;
		Отбор.Вставить("ВидРасчета", Перечисления.ЛБ_ВидыРасчетов.ПоОсновномуДолгу);
		Строки = ТаблицаОплат.Найтистроки(Отбор);
		Если НЕ Строки.Количество() = 0 Тогда 
			Стр = строки.получить(0);
			ОплаченоЗайм = Стр.Оплачено;
		КонецЕсли;	
		
		ОбластьМакета.Параметры.НачисленоЗайм = СуммаЗаймаНач;
		ОбластьМакета.Параметры.ОплаченоЗайм = ОплаченоЗайм;
		ДолгЗайм = СуммаЗаймаНач - ОплаченоЗайм;
		ОбластьМакета.Параметры.ДолгЗайм = ДолгЗайм;
		
		ОбластьМакета.Параметры.НачисленоПроценты = НачисленоПроценты; 
		ОбластьМакета.Параметры.ОплаченоПроценты = ОплаченоПроценты; 
		ДолгПроценты = НачисленоПроценты - ОплаченоПроценты;
		ОбластьМакета.Параметры.ДолгПроценты = ДолгПроценты; 
		
		ОбластьМакета.Параметры.НачисленоВсего = СуммаЗаймаНач + НачисленоПроценты;
		ОбластьМакета.Параметры.ОплаченоВсего = ОплаченоЗайм + ОплаченоПроценты;
		ОбластьМакета.Параметры.ДолгВсего = ДолгЗайм + ДолгПроценты;
		
		ТабличныйДокумент.Вывести(ОбластьМакета); 
	КонецЕсли;	
	
	ЗаполнитьТовары();
	ОбластьМакета = Макет.ПолучитьОбласть("ПредметыЗалогаШапка"); 
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Дефекты.Очистить();
	Для каждого стр Из ЗалоговыйБилет.Дефекты Цикл
		НоваяСтрД = Дефекты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрД, стр);
	Конеццикла;	 
		
	Для каждого Стр Из Товары Цикл    	
        ОбластьМакета = Макет.ПолучитьОбласть("ПредметыЗалогаСтрока");
		ОбластьМакета.Параметры.Артикул = Стр.Артикул; 
		ОбластьМакета.Параметры.Статус = Стр.Статус;
		ОбластьМакета.Параметры.Изделие = Стр.ВидИзделия; 
		ОбластьМакета.Параметры.Проба = Стр.Проба; 
		ОбластьМакета.Параметры.Категория = Стр.Категория;	
        ОбластьМакета.Параметры.Клеймо = Стр.Клеймо;
		ОбластьМакета.Параметры.Состояние = Стр.СостояниеИзделия; 
		//ОбластьМакета.Параметры.Вставки = Стр.ЕстьВставки;
		//ОбластьМакета.Параметры.ДопМеталлы = Стр.ЕстьДопМеталлы;
		//ОбластьМакета.Параметры.Дефекты = Стр.ЕстьДеффекты;  
		Если Стр.ЕстьДеффекты Тогда
			ВидыДефектов = "";
			
			ОтборД = Новый Структура;
			ОтборД.Вставить("КлючСтроки", Стр.КлючСтроки);
			СтрокиД = Дефекты.НайтиСтроки(ОтборД);
			
			Для каждого СтрД Из СтрокиД Цикл
			    ВидыДефектов = ВидыДефектов + ?(Пустаястрока(ВидыДефектов), "", "; ") + сокрЛП(СтрД.Дефект);
			КонецЦикла;	  
			ОбластьМакета.Параметры.ВидыДефектов = ВидыДефектов;
		КонецЕсли;	   
		ОбластьМакета.Параметры.Описание = Стр.Описание;
		ОбластьМакета.Параметры.Кол = Стр.Количество;
		ОбластьМакета.Параметры.Вес = Стр.Вес;
		ОбластьМакета.Параметры.ВесМет = Стр.ВесЧистый;	
		ОбластьМакета.Параметры.Цена = Стр.Цена; 
		Если СотрудникЦО Тогда
			СтруктураМ = Новый структура;
		    СтруктураМ.Вставить("Вид", 2);  
		 	ОбластьМакета.Параметры.СтруктураМ = СтруктураМ;  
		КонецЕсли;	
		ОбластьМакета.Параметры.ОценкаМеталл = Стр.СуммаОценкиМеталлы;	
		ОбластьМакета.Параметры.ОценкаВставки = Стр.СуммаОценкиКамни;	
		ОбластьМакета.Параметры.ОценкаВсего = Стр.СуммаОценки;	
		ОбластьМакета.Параметры.ОценкаМакс = Стр.СуммаОценкиМаксимальная;
		Если НЕ СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтказОтОформления Тогда
			ОбластьМакета.Параметры.СуммаЗайма = Стр.СуммаСсуды;	
			ОбластьМакета.Параметры.Оплачено = Стр.Оплачено;	
			ОбластьМакета.Параметры.Долг = Стр.Долг;			 
	    КонецЕсли;
		Если ЗначениеЗаполнено(Стр.Этикетка) Тогда 
		    СтруктураЭ = Новый структура;
		    СтруктураЭ.Вставить("Вид", 10);  
		    СтруктураЭ.Вставить("Этикетка", Стр.Этикетка);
		    ОбластьМакета.Параметры.СтруктураЭ = СтруктураЭ; 
		КонецЕсли;   
		ТабличныйДокумент.Вывести(ОбластьМакета);
		Если НЕ Стр.ЕстьВставки Тогда 
			ТабличныйДокумент.Области.ПредметыЗалогаСтрока.ЦветФона = webЦвета.Белый; 
			ТабличныйДокумент.Области.Вставки.Картинка = неопределено;
		КонецЕсли;	     
		Если НЕ Стр.ЕстьДеффекты Тогда 
			ТабличныйДокумент.Области.Дефекты.Картинка = неопределено;
		КонецЕсли;  
		Если НЕ Стр.ЕстьЭтикетка Тогда 
			ТабличныйДокумент.Области.Этикетка.Картинка = неопределено;
		КонецЕсли;
		Если НЕ Стр.ЕстьДопМеталлы Тогда 
			ТабличныйДокумент.Области.ДопМеталлы.Картинка = неопределено;
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(Стр.Этикетка) Тогда 
			ТабличныйДокумент.Области.Скан.Картинка = неопределено;
		КонецЕсли;
	КонецЦикла;	                        
		
	ОбластьМакета = Макет.ПолучитьОбласть("ПредметыЗалогаИтого");
	ОбластьМакета.Параметры.Кол = Товары.Итог("Количество");
	ОбластьМакета.Параметры.Вес = Товары.Итог("Вес");
	ОбластьМакета.Параметры.ВесМет = Товары.Итог("ВесЧистый");	
	ОбластьМакета.Параметры.ОценкаМеталл = Товары.Итог("СуммаОценкиМеталлы");	
	ОбластьМакета.Параметры.ОценкаВставки = Товары.Итог("СуммаОценкиКамни");
	ОбластьМакета.Параметры.ОценкаВсего = Товары.Итог("СуммаОценки");
	ОбластьМакета.Параметры.ОценкаМакс = Товары.Итог("СуммаОценкиМаксимальная");
	Если НЕ СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтказОтОформления Тогда
		ОбластьМакета.Параметры.СуммаЗайма = Товары.Итог("СуммаСсуды");	
		ОбластьМакета.Параметры.Оплачено = Товары.Итог("Оплачено");	
		ОбластьМакета.Параметры.Долг = Товары.Итог("Долг");	
	КонецЕсли;	

	ТабличныйДокумент.Вывести(ОбластьМакета);    
	
	Вставки.Очистить();
	Для каждого стр Из ЗалоговыйБилет.Вставки Цикл
		НоваяСтр = Вставки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтр, стр);
	Конеццикла;	   
	ДополнительныеМеталлы.Очистить();
    Для каждого стр Из ЗалоговыйБилет.ДополнительныеМеталлы Цикл
		НоваяСтр = ДополнительныеМеталлы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтр, стр);
	Конеццикла;

	Если НЕ Вставки.Количество() = 0 Тогда  
		ОбластьМакета = Макет.ПолучитьОбласть("ВставкиШапка"); 
	    ТабличныйДокумент.Вывести(ОбластьМакета); 
		
		ОбластьМакета = Макет.ПолучитьОбласть("ВставкиСтрока"); 
		Для каждого Стр Из Вставки Цикл  
			Отбор = Новый Структура;
		    Отбор.Вставить("КлючСтроки", стр.КлючСтроки); 
			СтрокиТ = Товары.НайтиСтроки(Отбор);
			Если НЕ СтрокиТ.Количество() = 0 Тогда 
				ОбластьМакета.Параметры.Артикул = СтрокиТ.Получить(0).Артикул; 
			КонецЕсли;                                                        
			ОбластьМакета.Параметры.НеОценивать = стр.НеОценивать;
			ОбластьМакета.Параметры.ВидВставки = стр.ВидВставки;
			ОбластьМакета.Параметры.ФормаОгранки = стр.ФормаОгранки;
			ОбластьМакета.Параметры.ВидОгранки = стр.ВидОгранки;
			ОбластьМакета.Параметры.КачествоОгранки = стр.КачествоОгранки;
			ОбластьМакета.Параметры.Размер = Стр.ОписаниеРазмера;
			ОбластьМакета.Параметры.Ед = Стр.ЕдиницаИзмерения;
			ОбластьМакета.Параметры.Кол  = Стр.Количество;	
			ОбластьМакета.Параметры.ВесКар = Стр.Вес;	
			ОбластьМакета.Параметры.ВесГр = Стр.ВесГраммы;	
			ОбластьМакета.Параметры.Оценка = Стр.Цена; 
			Если НЕ Стр.Цена = 0 И СотрудникЦО Тогда
				СтруктураВ = Новый структура;
			    СтруктураВ.Вставить("Вид", 3);  
			 	ОбластьМакета.Параметры.СтруктураВ = СтруктураВ;  
			КонецЕсли;	
			ОбластьМакета.Параметры.ОценкаВсего = Стр.Сумма;
			ТабличныйДокумент.Вывести(ОбластьМакета);   
		КонецЦикла;    
		ОбластьМакета = Макет.ПолучитьОбласть("ВставкиИтого"); 
		ОбластьМакета.Параметры.Кол  = Вставки.Итог("Количество");	
		ОбластьМакета.Параметры.ВесКар = Вставки.Итог("Вес");	
		ОбластьМакета.Параметры.ВесГр = Вставки.Итог("ВесГраммы");		
		ОбластьМакета.Параметры.ОценкаВсего = Вставки.Итог("Сумма"); 
		ТабличныйДокумент.Вывести(ОбластьМакета); 
	КонецЕсли;
	
	Если НЕ ДополнительныеМеталлы.Количество() = 0 Тогда  
		ОбластьМакета = Макет.ПолучитьОбласть("ДопМетШапка"); 
	    ТабличныйДокумент.Вывести(ОбластьМакета); 
		
		ОбластьМакета = Макет.ПолучитьОбласть("ДопМетСтрока"); 
		Для каждого Стр Из ДополнительныеМеталлы Цикл  
			Отбор = Новый Структура;
		    Отбор.Вставить("КлючСтроки", стр.КлючСтроки); 
			СтрокиТ = Товары.НайтиСтроки(Отбор);
			Если НЕ СтрокиТ.Количество() = 0 Тогда 
				ОбластьМакета.Параметры.Артикул = СтрокиТ.Получить(0).Артикул; 
			КонецЕсли;                                                        
			ОбластьМакета.Параметры.Проба = Стр.Проба;
			ОбластьМакета.Параметры.Ед = Стр.ЕдиницаИзмерения;
			ОбластьМакета.Параметры.ВесМет = Стр.ВесЧистый;	
			ОбластьМакета.Параметры.Оценка = Стр.Цена;	
			Если СотрудникЦО Тогда
				СтруктураМДоп = Новый структура;
			    СтруктураМДоп.Вставить("Вид", 4);                 
			 	ОбластьМакета.Параметры.СтруктураМДоп = СтруктураМДоп;  
			КонецЕсли;	
			ОбластьМакета.Параметры.ОценкаВсего = Стр.СуммаОценкиМеталлы;
			ТабличныйДокумент.Вывести(ОбластьМакета);   
		КонецЦикла;    
		ОбластьМакета = Макет.ПолучитьОбласть("ДопМетИтого"); 
		ОбластьМакета.Параметры.ВесМет = ДополнительныеМеталлы.Итог("ВесЧистый");		
		ОбластьМакета.Параметры.ОценкаВсего = ДополнительныеМеталлы.Итог("СуммаОценкиМеталлы"); 
		ТабличныйДокумент.Вывести(ОбластьМакета); 
	КонецЕсли;

	ТабличныйДокумент.Защита = Истина;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	Возврат ТабличныйДокумент;
КонецФункции	

&НаСервере
Процедура ЗаполнитьПоЗБ()
	ИнформацияЗБ = "№ " + СокрЛП(ЗалоговыйБилет.НомерЗалоговогоБилета) + " от " + Формат(ЗалоговыйБилет.Дата, "ДФ=dd.MM.yyyy");  
	Ломбард = ?(НЕ Пустаястрока(ЗалоговыйБилет.Ломбард.НаименованиеПолное), СокрЛП(ЗалоговыйБилет.Ломбард.НаименованиеПолное), СокрЛП(ЗалоговыйБилет.Ломбард.Наименование));   
	ОтказОтВыкупа = ЗалоговыйБилет.ОтказОтВыкупа;
	ОтказОтСМС = НЕ ЛБ_УправлениеЛомбардом.ПолучитьСогласиеНаСМСРассылки(ТекущаяДатаСеанса(), ЗалоговыйБилет.Залогодатель);
	СтатусЗБ = ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(ТекущаяДатаСеанса(), ЗалоговыйБилет); 
	ЗаполнитьИнформациюПоЗаемщику();
	СтатусКлиента = ЛБ_УправлениеЛомбардом.ПолучитьТекущийСтатусКлиента(ТекущаяДатаСеанса(), ЗалоговыйБилет.Залогодатель);  
	ПолучитьДопСтатусыКлиента();  
	СтатусыЗалогодателя = ""; 
	Для каждого СтрС Из ТаблицаДопСтатусов Цикл 
		Если СтрС.Используется Тогда 
		    СтатусыЗалогодателя = СтатусыЗалогодателя + ?(ПустаяСтрока(СтатусыЗалогодателя), "", ", ") + СокрЛП(СтрС.Статус);
		конецЕсли;	
	КонецЦикла;	  
	СтатусыЗалогодателя = СтатусыЗалогодателя + ?(ПустаяСтрока(СтатусыЗалогодателя), "", ", ") + сокрЛП(СтатусКлиента);
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьИнформациюПоЗаемщику()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Залогодатель", ЗалоговыйБилет.Залогодатель);
    Запрос.Текст = "ВЫБРАТЬ
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Пол КАК Пол,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК Телефон,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПрописке КАК АдресПоПрописке,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ФактическийАдрес КАК ФактическийАдрес,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаСмерти КАК ДатаСмерти
                   |ИЗ
                   |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда    
		Фамилия = СокрЛП(Выборка.Фамилия);
		Имя = СокрЛП(Выборка.Имя);
		Отчество = СокрЛП(Выборка.Отчество);
		ФиоЗаемщика = СокрЛП(Фамилия) + " " + СокрЛП(Имя) + ?(НЕ ПустаяСтрока(Отчество), " " + СокрЛП(Отчество), ""); 
		ДатаРождения = Выборка.ДатаРождения;
		СтрокаДатаРождения = Формат(ДатаРождения, "ДЛФ=DD"); 
		Пол = Выборка.Пол;  
		Телефон = Выборка.Телефон;
		АдресПоПрописке = Выборка.АдресПоПрописке;
		ФактическийАдрес = Выборка.ФактическийАдрес; 
		ДатаСмерти = Выборка.ДатаСмерти;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуДопСтатусовКлиента() 		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СтатусыЗалогодателей.Ссылка КАК Статус
	               |ИЗ
	               |	Справочник.ЛБ_СтатусыЗалогодателей КАК ЛБ_СтатусыЗалогодателей
	               |ГДЕ
	               |	ЛБ_СтатусыЗалогодателей.ПометкаУдаления = ЛОЖЬ
	               |	И ЛБ_СтатусыЗалогодателей.ЭтоГруппа = ЛОЖЬ
	               |	И ЛБ_СтатусыЗалогодателей.ДоступенДляВыбораВручную = ИСТИНА
	               |АВТОУПОРЯДОЧИВАНИЕ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	ТаблицаДопСтатусов.Загрузить(ТаблицаЗапроса); 
	Новаястр = ТаблицаДопСтатусов.Добавить();
	НоваяСтр.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Почетный;
КонецПроцедуры	

&НаСервере
Процедура ПолучитьДопСтатусыКлиента() 
	ЗаполнитьТаблицуДопСтатусовКлиента(); 
	ЭтоСотрудник = Ложь;
	
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Залогодатель", ЗалоговыйБилет.Залогодатель);  
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса()); 
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1)); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус,
	               |	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Используется КАК Используется
	               |ИЗ
	               |	РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(
	               |			&Дата,
	               |			Залогодатель = &Залогодатель
	               |				И Статус = &Статус
	               |				И ВЫБОР
	               |					КОГДА СрокДействия = &ПустаяДата
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА КОНЕЦПЕРИОДА(СрокДействия, ДЕНЬ) < &Дата
	               |								ТОГДА ЛОЖЬ
	               |							ИНАЧЕ ИСТИНА
	               |						КОНЕЦ
	               |				КОНЕЦ) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Период УБЫВ";
	Для каждого Стр Из ТаблицаДопСтатусов Цикл  
		Запрос.УстановитьПараметр("Статус", Стр.Статус);  
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Стр.Используется = Выборка.Используется; 
			Если Выборка.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Сотрудник Тогда  
				Если стр.Используется Тогда 
					ЭтоСотрудник = Истина;
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	   
	
	Если ЛБ_УправлениеЛомбардом.ПроверитьСтатусПочетный(ДатаРождения, Пол) Тогда 
		Отбор = Новый Структура;
		Отбор.Вставить("Статус", Справочники.ЛБ_СтатусыЗалогодателей.Почетный);
		СтрокиС = ТаблицаДопСтатусов.НайтиСтроки(Отбор);
		Если НЕ СтрокиС.Количество() = 0 Тогда
			СтрокиС.Получить(0).Используется = Истина;
		КонецЕсли;	
	КонецЕсли;   
	
	Если ЭтоСотрудник Тогда 
		Отбор = Новый Структура;
		Отбор.Вставить("Статус", Справочники.ЛБ_СтатусыЗалогодателей.Сотрудник);
		СтрокиС = ТаблицаДопСтатусов.НайтиСтроки(Отбор);
		Если НЕ СтрокиС.Количество() = 0 Тогда
			СтрокиС.Получить(0).Используется = Истина;
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗалогодателя()
	Возврат  ЗалоговыйБилет.Залогодатель;
КонецФункции

&НаСервере
Функция ПолучитьТекДату()
	Возврат ТекущаяДатаСеанса();
КонецФункции
	
&НаКлиенте
Процедура КарточкаКлиента(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Залогодатель", ПолучитьЗалогодателя());
	ПараметрыФормы.Вставить("Дата", ПолучитьТекДату());	
	//ПараметрыФормы.Вставить("ТолькоПросмотр", истина); 
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеИзмененияКарточки",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_КарточкаЗалогодателя", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры 

&НаСервере
Процедура ПослеИзмененияКарточки(Результат, ДопПараметры) Экспорт
	ОтказОтСМС = НЕ ЛБ_УправлениеЛомбардом.ПолучитьСогласиеНаСМСРассылки(ТекущаяДатаСеанса(), ЗалоговыйБилет.Залогодатель);
    ЗаполнитьИнформациюПоЗаемщику();
    СтатусКлиента = ЛБ_УправлениеЛомбардом.ПолучитьТекущийСтатусКлиента(ТекущаяДатаСеанса(), ЗалоговыйБилет.Залогодатель);  
	ПолучитьДопСтатусыКлиента();  
	СтатусыЗалогодателя = "";
	Для каждого СтрС Из ТаблицаДопСтатусов Цикл 
		Если СтрС.Используется Тогда 
		    СтатусыЗалогодателя = СтатусыЗалогодателя + ?(ПустаяСтрока(СтатусыЗалогодателя), "", ", ") + СокрЛП(СтрС.Статус);
		конецЕсли;	
	КонецЦикла;	  
	СтатусыЗалогодателя = СтатусыЗалогодателя + ?(ПустаяСтрока(СтатусыЗалогодателя), "", ", ") + сокрЛП(СтатусКлиента);
КонецПроцедуры	


&НаКлиенте
Процедура СтатистикаОбращений(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Клиент", ПолучитьЗалогодателя());
	ПараметрыФормы.Вставить("Дата", ПолучитьТекДату());	 
							
	ОткрытьФорму("Отчет.ЛБ_СтатистикаОбращенийКлиента.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура Доверенность(Команда)   
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("Клиент", ПолучитьЗалогодателя());  
	ПараметрыВыбора.Вставить("ЗалоговыйБилет", ЗалоговыйБилет);
     
	ОткрытьФорму("ОбщаяФорма.ЛБ_Доверенности", ПараметрыВыбора,ЭтаФорма, Истина,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетОНачисленныхПроцентах(Команда)
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("Клиент", ПолучитьЗалогодателя());  
	ПараметрыВыбора.Вставить("ЗалоговыйБилет", ЗалоговыйБилет); 
	ПараметрыВыбора.Вставить("Детально", Истина);
     
	ОткрытьФорму("Отчет.ЛБ_НачисленныеПроцентыПоДоговоруЗайма.ФормаОбъекта", ПараметрыВыбора,ЭтаФорма, Истина,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаСервере
Процедура ПроверкаПоПеречням(Клиент)
	ЛБ_УправлениеЛомбардом.ПроверкаКлиентаПоПеречням(ТекущаяДатаСеанса(), Клиент); 
КонецПроцедуры

&НаСервере
Функция ПроверитьКлиента()
	СтруктураПроверки = ЛБ_ОбщегоНазначения.ПроверитьКлиентаПоПеречням(Залогодатель);

	Возврат СтруктураПроверки.Совпадение;
КонецФункции

&НаСервере
Функция ПроверитьПоПеречнюНедружественныхСтран(Гражданство)
	Возврат ЛБ_УправлениеЛомбардом.ПроверитьПоПеречнюНедружественныхСтран(Гражданство);
КонецФункции 

&НаСервере
Функция ПроверитьПаспортВСпискеНеДействительных(ДокументСерия, ДокументНомер)
	Парам = Новый Структура("Серия, Номер", СокрЛП(ДокументСерия), СокрЛП(ДокументНомер));
	Возврат ЛБ_ОбменLX.ПаспортНедействителен(Парам);
КонецФункции

&НаСервере
Процедура ПолучитьОсновнойДУЛ()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);  
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя КАК ДокументЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНачалоДействия КАК ДокументНачалоДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНеДействителен КАК ДокументНеДействителен,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДатаСмерти КАК ДатаСмерти,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДействителен КАК ДокументДействителен,
	               |	ЛОЖЬ КАК ПроверкаНеДействителен
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(
	               |			,
	               |			ДокументЗалогодателя.Владелец = &Залогодатель
	               |				И ОсновнойДУЛ = ИСТИНА) КАК ЛБ_ДокументыЗалогодателейСрезПоследних"; 
	ДокументыЗалогодателя = Запрос.Выполнить().Выгрузить(); 
	ЕстьСвидетельствоОРождении = Ложь; 
	ЕстьПаспорт = Ложь;   
	Дата = ТекущаяДатаСеанса();
	Для каждого Стр Из ДокументыЗалогодателя Цикл
		Если Стр.ДокументНЕДействителен Тогда
			Продолжить; 
		ИначеЕсли (Стр.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.СвидетельствоОРождении) Тогда
			ЕстьСвидетельствоОРождении = Истина;	
		КонецЕсли;	
		Стр.ПроверкаНеДействителен = ПроверитьПаспортВСпискеНеДействительных(Стр.ДокументСерия, стр.ДокументНомер);
		Если НЕ Стр.ПроверкаНеДействителен Тогда
			ЛБ_ОбщийМодуль.ПроверитьДействительностьДокумента(Стр, ДатаРождения, ложь, Дата);
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Стр.Гражданство) И 
			Не Стр.Гражданство = Справочники.СтраныМира.Россия И
			Стр.ВидДокументаЗалогодателя = 	Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийПравоПребыванияРФ И
			Стр.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ВидНаЖительство Тогда
			
			Стр.ПроверкаНеДействителен = НЕ ЛБ_ОбщийМодуль.ПроверитьДействительностьВидаНаЖительство(Стр, ДатаРождения, Дата);
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьСвидетельствоОРождении Тогда
		//проверим недействительность свидетельства о рождении если есть паспорт
		ЛБ_ОбщийМодуль.ПроверитьДействительностьСвидетельствоОРождении(ДокументыЗалогодателя);
	КонецЕсли;
	
	Для каждого Стр Из ДокументыЗалогодателя Цикл
		Если (Стр.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ) И НЕ Стр.ДокументНЕДействителен Тогда
		    ЕстьПаспорт = Истина;  
			Прервать;
	    КонецЕсли;
	КонецЦикла;	
	
	//проверим недействительность свидетельства о рождении если есть паспорт
	Если ЕстьПаспорт Тогда
		ОтборД = Новый структура;
		ОтборД.Вставить("ВидДокумента", Справочники.ВидыДокументовФизическихЛиц.СвидетельствоОРождении);
		ОтборД.Вставить("ДокументНеДействителен", Ложь);
		СтрокиД = ДокументыЗалогодателя.НайтиСтроки(ОтборД);
		Для каждого СтрД Из СтрокиД цикл
			СтрД.ДокументНеДействителен = Истина;
		Конеццикла;	
	КонецЕсли;  
	
	ОсновнойДУЛ = Справочники.ЛБ_ДокументыЗалогодателя.ПустаяСсылка();
	Удстроки = Новый списокЗначений;
	Для каждого Стр Из ДокументыЗалогодателя Цикл
		Если Стр.ДокументНЕДействителен ИЛИ Стр.ПроверкаНеДействителен Тогда  
			Продолжить; 
		Иначе
			ОсновнойДУЛ = Стр.ДокументЗалогодателя; 
			ОсновнойДУЛГражданство = Стр.Гражданство; 
			Прервать;
		КонецЕсли;	
	КонецЦикла;   	

КонецПроцедуры 

&НаСервере
Функция ПроверитьДокументыПравоПребыванияРФ(Клиент, ГражданствоКлиента)
	ЕстьДопДокумент = Ложь;
	Запрос = Новый Запрос;    
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса()); 
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("Гражданство", ГражданствоКлиента);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя КАК ДокументЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНеДействителен КАК ДокументНеДействителен,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(
	               |			&Дата,
	               |			ДокументЗалогодателя.Владелец = &Клиент
	               |				И Гражданство = &Гражданство
	               |				И ВидДокументаЗалогодателя = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийПравоПребыванияРФ)
	               |				И ОсновнойДоп = ИСТИНА) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() цикл
		Если Выборка.ДокументНЕДействителен Тогда
			Продолжить;
		КонецЕсли;	
		Если ЛБ_ОбщийМодуль.ДокументСоСрокомДействия(ГражданствоКлиента, Выборка.ВидДокументаЗалогодателя, Выборка.ВидДокумента) Тогда
			Если Выборка.ДокументСрокДействия < НачалоДня(ТекущаяДатаСеанса()) Тогда
				Продолжить;
			КонецЕсли;	
            ЕстьДопДокумент = Истина;
			Прервать;
		Иначе	
			ЕстьДопДокумент = Истина;
			Прервать;
		КонецЕсли;	
	Конеццикла;	  
	Возврат ЕстьДопДокумент;
КонецФункции

&НаКлиенте
Процедура ВыдачаЗайма(Команда)
	Если НЕ ДатаСмерти = Дата(1,1,1) Тогда
		Сообщить("Дата смерти клиента " + Формат(ДатаСмерти, "ДФ=dd.MM.yyyy") + ". Выдача займа не возможна.");
		Возврат;
	КонецЕсли; 
	
	ПолучитьОсновнойДУЛ();
	
	Если Не ЗначениеЗаполнено(ОсновнойДУЛ) Тогда
		Сообщить("Основной документ удостоверяющий личность клиента по которому возможна выдача займа не найден!", 60); 
		Возврат; 
	ИначеЕсли НЕ ОсновнойДУЛГражданство = ПредопределенноеЗначение("Справочник.СтраныМира.Россия") Тогда
		Если ПроверитьПоПеречнюНедружественныхСтран(ОсновнойДУЛГражданство) Тогда
			Сообщить("Клиент предъявил документ государства не дружественного по отношению к России. Выдача ссуды по этому документу не возможна.");
			Возврат;
		КонецЕсли;	
		Если НЕ ПроверитьДокументыПравоПребыванияРФ(Залогодатель, ОсновнойДУЛГражданство) Тогда 
			Сообщить("Не найдены основные документы, подверждающие право клиента на пребывание В РФ!");
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	
	ЕстьСовпадение = ПроверитьКлиента();
	Если ЕстьСовпадение Тогда 
		Возврат;
	КонецЕсли;	
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Залогодатель", Залогодатель); 
	СтруктураПараметров.Вставить("ДатаРождения", ЭтаФорма.ДатаРождения);
	СтруктураПараметров.Вставить("ДокументЗалогодателя", ОсновнойДУЛ);
			
	ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаВыдачиЗайма", СтруктураПараметров, ЭтаФорма, Истина,,,);
КонецПроцедуры

&НаКлиенте
Процедура ПослеСозданияДокумента(Результат,Параметры) Экспорт	
	ПолучитьСостояниеЗБ();
	ЗаполнитьПоЗБ();  
	ТаблицыЗалоговогоБилета = ЗаполнитьИнформациюПоЗБ();  
КонецПроцедуры

&НаКлиенте
Процедура ОплатаПроцентов(Команда)
	ПараметрыФормы = Новый Структура; 
	ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов"));
	ПараметрыФормы.Вставить("Номер", НомерЗалоговогоБилета);
	ОписаниеОповещения = новый ОписаниеОповещения("ПослеВыбораЗалогодателяОплатаПроцентов",ЭтотОбъект, );	
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателяПоНомеруБилета",ПараметрыФормы,ЭтотОбъект,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры   

&НаКлиенте
Процедура ПослеВыбораЗалогодателяОплатаПроцентов(Результат,Параметры) Экспорт	
	Если НЕ ТипЗнч(Результат) = Тип("Структура") Тогда
		Возврат; 
	Иначе              
		Если НЕ Результат.Плательщик = Залогодатель Тогда
		    ПроверкаПоПеречням(Результат.Плательщик);  
		КонецЕсли;	
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗалоговыйБилет", Результат.ПредыдущаяОперация); 
		ПараметрыФормы.Вставить("Плательщик", Результат.Плательщик);
		ПараметрыФормы.Вставить("ДокументПлательщика", Результат.ДокументЗалогодателя);
		ПараметрыФормы.Вставить("Доверенность", Результат.Доверенность);
		ОписаниеОповещения = новый ОписаниеОповещения("ПослеСозданияДокумента", ЭтотОбъект);
		ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаОплатыПроцентов", ПараметрыФормы, ЭтаФорма, Истина,,,ОписаниеОповещения);
	КонецЕсли;	
КонецПроцедуры  

&НаКлиенте
Процедура Переоформление(Команда)   
	СтруктураПараметров = Новый Структура("ВидОперации");
	СтруктураПараметров.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление");
	
	ПараметрыФормы = Новый Структура; 
	ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление"));
	ПараметрыФормы.Вставить("Номер", НомерЗалоговогоБилета);
	ОписаниеОповещения = новый ОписаниеОповещения("ПослеВыбораЗалогодателяПереоформление",Этаформа,СтруктураПараметров);	
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателяПоНомеруБилета",ПараметрыФормы,Этаформа,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЗалогодателяПереоформление(Результат,Параметры) Экспорт
	Если НЕ ТипЗнч(Результат) = Тип("Структура") Тогда
		Возврат;		
	Иначе             
		Если НЕ Результат.Представитель = Залогодатель Тогда
		    ПроверкаПоПеречням(Результат.Представитель); 
		КонецЕсли;   
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ПредыдущаяОперация", Результат.ПредыдущаяОперация); 
		ПараметрыФормы.Вставить("Залогодатель", Результат.Залогодатель);
		ПараметрыФормы.Вставить("ДокументЗалогодателя", Результат.ДокументЗалогодателя); 
		Если Результат.Свойство("Представитель") Тогда  
			ПроверкаПоПеречням(Результат.Представитель);
			ПараметрыФормы.Вставить("Представитель", Результат.Представитель);
			ПараметрыФормы.Вставить("ДокументПредставителя", Результат.ДокументПредставителя);  
		КонецЕсли;	  
		Если Результат.Свойство("ДоверенностьПредставителя") Тогда 
			ПараметрыФормы.Вставить("ДоверенностьПредставителя", Результат.ДоверенностьПредставителя);  
		КонецЕсли;
		ОписаниеОповещения = новый ОписаниеОповещения("ПослеСозданияДокумента", Этаформа);
		ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаПереоформленияЗайма", ПараметрыФормы, ЭтаФорма, Истина,,,ОписаниеОповещения);
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура СоздатьОтменуОперацииПоЗайму(Команда)
    ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаОплаты")); 
	ПараметрыФормы.Вставить("Номер", НомерЗалоговогоБилета);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораОтменаОперацииПоЗайму", Этаформа); 
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателяПоНомеруБилета", ПараметрыФормы, Этаформа,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораОтменаОперацииПоЗайму(Результат,Параметры) Экспорт
	
	Если НЕ ТипЗнч(Результат) = Тип("Структура") Тогда
		Возврат; 
	Иначе
		
		ОтменяемаяОперация = ПолучитьИнформациюОЗБ(Результат.НомерЗалоговогоБилета, ТекущаяДата());
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеСозданияДокумента", Этаформа);
		
		Если ОтменяемаяОперация.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов") Тогда 
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Документ", ОтменяемаяОперация.Документ);    
			ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаОплатыПроцентов", ПараметрыФормы, ЭтаФорма, Истина,,,ОписаниеОповещения);
		ИначеЕсли ОтменяемаяОперация.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ИзъятиеОбъектовЗалога") Тогда 
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Документ", ОтменяемаяОперация.Документ);    
			ОткрытьФорму("ОбщаяФорма.ЛБ_ИзъятиеОбъектовЗалога", ПараметрыФормы, ЭтаФорма, Истина,,,ОписаниеОповещения);
		ИначеЕсли ОтменяемаяОперация.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога") Тогда 
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Документ", ОтменяемаяОперация.Документ);    
			ОткрытьФорму("ОбщаяФорма.ЛБ_ВозвратОбъектовЗалога", ПараметрыФормы, ЭтаФорма, Истина,,,ОписаниеОповещения);
		ИначеЕсли ОтменяемаяОперация.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОстановкаПроцентов") Тогда 
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Документ", ОтменяемаяОперация.Документ);    
			ОткрытьФорму("ОбщаяФорма.ЛБ_ОстановкаНачисленияПроцентов", ПараметрыФормы, ЭтаФорма, Истина,,,ОписаниеОповещения);
		ИначеЕсли ОтменяемаяОперация.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление") Тогда 
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ЗалоговыйБилет", ОтменяемаяОперация.Документ); //ЗалоговыйБилет или Документ
			ОткрытьФорму("ОбщаяФорма.ЛБ_ОтменаПереоформленияЗайма", ПараметрыФормы, ЭтаФорма, Истина,,,ОписаниеОповещения);
		ИначеЕсли ОтменяемаяОперация.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог") Тогда 
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ЗалоговыйБилет", ОтменяемаяОперация.Документ);
			ОткрытьФорму("ОбщаяФорма.ЛБ_ОтменаВыдачиЗайма", ПараметрыФормы, ЭтаФорма, Истина,,,ОписаниеОповещения);
		ИначеЕсли ОтменяемаяОперация.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога") Тогда 
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Документ", ОтменяемаяОперация.Документ);
			ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаВыдачиЗалога", ПараметрыФормы, ЭтаФорма, Истина,,,ОписаниеОповещения);
		Иначе                           
			СтандартнаяОбработка = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИнформациюОЗБ(НомерЗалоговогоБилета, Дата)
	
	Результат = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(НомерЗалоговогоБилета, Дата, Истина);
	
	ИнформацияОЗБ = Новый Структура;
	ИнформацияОЗБ.Вставить("Документ", Результат.Регистратор);
	ИнформацияОЗБ.Вставить("ВидОперации", Результат.Регистратор.ВидОперации);
	
	Возврат ИнформацияОЗБ;
	
КонецФункции

&НаКлиенте
Процедура ВыдачаОХ(Команда)    
	Если НЕ СтатусЗБ = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыЗалоговыхБилетов.ОтвественноеХранение") И
		 НЕ СтатусЗБ = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыЗалоговыхБилетов.Наследство") Тогда  
		ТекстПредупреждения = "Залоговый билет № " + СокрЛП(НомерЗалоговогоБилета) + " в статусе " + Строка(СтатусЗБ) + ". Выполнение операции невозможно.";  
		Предупреждение(ТекстПредупреждения, 60);
		Возврат;
	ИначеЕсли СтатусЗБ = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыЗалоговыхБилетов.Наследство") Тогда  
	     Если НЕ СуммаЗайма = 0 Тогда
			 ТекстПредупреждения = "Долг по залоговому билету № " + СокрЛП(НомерЗалоговогоБилета) + " в статусе " + Строка(СтатусЗБ) +
			      СокрЛП(Формат(СуммаЗайма, "ЧЦ=15; ЧДЦ=2")) + " рублей. Выполнение операции невозможно.";  
			 Предупреждение(ТекстПредупреждения, 60);
			 Возврат;
		 КонецЕсли;	 
	КонецЕсли;	 

	СообщениеМ = ПроверитьМестонахождениеОЗ();
	Если НЕ ПустаяСтрока(СообщениеМ) Тогда 
		Предупреждение(СообщениеМ, 60);
		Возврат;
	КонецЕсли;	
	
	СтруктураПараметров = Новый Структура("ВидОперации");
	СтруктураПараметров.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога");
	
	ПараметрыФормы = Новый Структура; 
	ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога"));
	ПараметрыФормы.Вставить("Номер", НомерЗалоговогоБилета);
	ОписаниеОповещения = новый ОписаниеОповещения("ПослеВыбораЗалогодателяВыдачаЗалога",ЭтотОбъект,СтруктураПараметров);	
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателяПоНомеруБилета",ПараметрыФормы,ЭтотОбъект,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЗалогодателяВыдачаЗалога(Результат,Параметры) Экспорт
	Если НЕ ТипЗнч(Результат) = Тип("Структура") Тогда
		Возврат; 
	Иначе     
		Если НЕ Результат.Получатель = Залогодатель Тогда
		    ПроверкаПоПеречням(Результат.Получатель);
		КонецЕсли;	
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗалоговыйБилет", Результат.ПредыдущаяОперация); 
		ПараметрыФормы.Вставить("Получатель", Результат.Получатель);
		ПараметрыФормы.Вставить("ДокументПолучателя", Результат.ДокументЗалогодателя);
		ПараметрыФормы.Вставить("Доверенность", Результат.Доверенность);
		ОписаниеОповещения = новый ОписаниеОповещения("ПослеСозданияДокумента", ЭтотОбъект);
		ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаВыдачиЗалога", ПараметрыФормы, ЭтаФорма, Истина,,,ОписаниеОповещения);
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Функция ПроверитьСтатусНакладной() 
	Возврат ЛБ_УправлениеЛомбардом.ПолучитьСтатусНакладнойПоЗБИзм(ТекущаяДатаСеанса(), ЗалоговыйБилет);
КонецФункции  

&НаСервере
Функция ПолучитьРеквизитыНакладной(НакладнаяНаОтгрузку)  
	СтруктураВ = Новый Структура;
	СтруктураВ.Вставить("Номер", НакладнаяНаОтгрузку.ПредставлениеНомераНакладной); 
	СтруктураВ.Вставить("Дата", НакладнаяНаОтгрузку.Дата);
	Возврат СтруктураВ; 
КонецФункции

&НаСервере
Функция ПроверитьМестонахождениеОЗ() 
	СообщениеМ = ЛБ_УправлениеЛомбардом.ПроверитьМестонахождениеОЗ(ЗалоговыйБилет, ТекущийЛомбард);
	Если НЕ ПустаяСтрока(СообщениеМ) Тогда
		СообщениеМ = СообщениеМ + символы.ПС + "Выполнение операции невозможно!"; 
	КонецЕсли;
	Возврат СообщениеМ;
КонецФункции

&НаКлиенте
Процедура Изъятие(Команда)    	
	Если СтатусЗБ = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыЗалоговыхБилетов.Закрыт") ИЛИ
		 СтатусЗБ = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыЗалоговыхБилетов.ОтказОтОформления") ИЛИ
		 СтатусЗБ = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыЗалоговыхБилетов.Реализован") Тогда  
		ТекстПредупреждения = "Залоговый билет № " + СокрЛП(НомерЗалоговогоБилета) + " в статусе " + Строка(СтатусЗБ) + ". Выполнение операции невозможно.";  
		Предупреждение(ТекстПредупреждения, 60);
		Возврат;
	КонецЕсли;	 
	
	СообщениеМ = ПроверитьМестонахождениеОЗ();
	Если НЕ ПустаяСтрока(СообщениеМ) Тогда 
		Предупреждение(СообщениеМ, 60);
		Возврат;
	КонецЕсли;	
	
	СтруктураНакладной = ПроверитьСтатусНакладной(); 
	Если СтруктураНакладной = неопределено Тогда
		ЕстьВНакладной = Ложь;
	Иначе	         
		ЕстьВНакладной = Истина;
	    НакладнаяНаОтгрузку = СтруктураНакладной.НакладнаяНаОтгрузку; 
		СтатусНакладной = СтруктураНакладной.СтатусНакладной;
	КонецЕсли;
	Если ЕстьВНакладной Тогда    
	    СтруктураН = ПолучитьРеквизитыНакладной(НакладнаяНаОтгрузку);
        ТекстПредупреждения = "Внимание! Изделия по ЗБ № " + СокрЛП(НомерЗалоговогоБилета) + " в накладной № " + СокрЛП(СтруктураН.Номер)+ " от " + Формат(СтруктураН.Дата, "ДЛФ=DT");
	    Если СтатусНакладной = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыНакладнойНаОтгрузку.Отгружена") Тогда	
			ТекстПредупреждения = ТекстПредупреждения + " в статусе «Отгружено»." + Символы.ПС + "Для согласования возможности изъятия обратитесь в ЦО.";  
			Предупреждение(ТекстПредупреждения, 60);
			Возврат;
		ИначеЕсли СтатусНакладной = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыНакладнойНаОтгрузку.СумкаОткрыта") 
			ИЛИ  СтатусНакладной = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыНакладнойНаОтгрузку.СумкаЗакрыта") Тогда 
		   ТекстПредупреждения = ТекстПредупреждения + " в сумке." + Символы.ПС + "Для изъятия изделий из ЗБ измените статус накладной и вскройте сумку.";	  
		   Предупреждение(ТекстПредупреждения, 60);
		   Возврат;
        КонецЕсли;	   
	КонецЕсли;		  
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗалоговыйБилет", ЗалоговыйБилет); 
	ОписаниеОповещения = новый ОписаниеОповещения("ПослеСозданияДокумента", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ИзъятиеОбъектовЗалога", ПараметрыФормы, ЭтаФорма, Истина,,,ОписаниеОповещения);
КонецПроцедуры   


&НаСервере
Функция ПолучитьЛомбардЗБ() 
	Возврат ЗалоговыйБилет.Ломбард;
КонецФункции

&НаСервере
Функция ПолучитьНомерЛомбардаЗБ() 
	Возврат ЗалоговыйБилет.Ломбард.НомерЛомбарда;
КонецФункции

&НаКлиенте
Процедура ВозвратИзъятого(Команда)  
	Если НЕ СтатусЗБ = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыЗалоговыхБилетов.Изъят") Тогда
		 //НЕ СтатусЗБ = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыЗалоговыхБилетов.Наследство") Тогда  
		ТекстПредупреждения = "Залоговый билет № " + СокрЛП(НомерЗалоговогоБилета) + " в статусе " + Строка(СтатусЗБ) + ". Выполнение операции невозможно.";  
		Предупреждение(ТекстПредупреждения, 60);
		Возврат;
	КонецЕсли;	
	
	Если НЕ ТекущийЛомбард = ПолучитьЛомбардЗБ() Тогда
		ТекстПредупреждения =  " Договор займа по ЗБ № " + СокрЛП(НомерЗалоговогоБилета) + " оформлен в ломбарде № " + ПолучитьНомерЛомбардаЗБ() + ". Выполнение операции невозможно!";  
		Предупреждение(ТекстПредупреждения, 60);
		Возврат;
	КонецЕсли;	

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗалоговыйБилет", ЗалоговыйБилет);
	ОписаниеОповещения = новый ОписаниеОповещения("ПослеСозданияДокумента", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ВозвратОбъектовЗалога", ПараметрыФормы, ЭтаФорма, Истина,,,ОписаниеОповещения);
КонецПроцедуры	

&НаКлиенте
Процедура ИсторияЗБ(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Клиент", ПолучитьЗалогодателя());
	ПараметрыФормы.Вставить("ЗалоговыйБилет", ЗалоговыйБилет);	 
							
	ОткрытьФорму("Отчет.ЛБ_ИсторияЗалоговогоБилета.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура Расчеты(Команда)
	ПараметрыФормы = Новый Структура;  
	ПараметрыФормы.Вставить("Клиент", ПолучитьЗалогодателя());
	ПараметрыФормы.Вставить("ЗалоговыйБилет", ЗалоговыйБилет);	
	ПараметрыФормы.Вставить("Дата", ПолучитьТекДату());	
							
	ОткрытьФорму("Отчет.ЛБ_НачисленныеПроцентыПоДоговоруЗайма.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицыЗалоговогоБилетаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;    
		Если Расшифровка.Вид = 1 Тогда 
			ПараметрыФормы = Новый Структура;   
			ПараметрыФормы.Вставить("ЗалоговыйБилет", ЗалоговыйБилет); 
			ПараметрыФормы.Вставить("Установить", ПредопределенноеЗначение("Перечисление.ЛБ_УстановитьВПриказе.Ставки")); 
			ОткрытьФорму("РегистрСведений.ЛБ_ПриказыВОперацияхЗайма.Форма.ФормаПросмотра", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		ИначеЕсли Расшифровка.Вид = 2 Тогда 
			ПараметрыФормы = Новый Структура;   
			ПараметрыФормы.Вставить("ЗалоговыйБилет", ЗалоговыйБилет); 
			ПараметрыФормы.Вставить("Установить", ПредопределенноеЗначение("Перечисление.ЛБ_УстановитьВПриказе.Металлы")); 
			ОткрытьФорму("РегистрСведений.ЛБ_ПриказыВОперацияхЗайма.Форма.ФормаПросмотра", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		ИначеЕсли Расшифровка.Вид = 3 Тогда 
			ПараметрыФормы = Новый Структура;   
			ПараметрыФормы.Вставить("ЗалоговыйБилет", ЗалоговыйБилет); 
			ПараметрыФормы.Вставить("Установить", ПредопределенноеЗначение("Перечисление.ЛБ_УстановитьВПриказе.Вставки")); 
			ОткрытьФорму("РегистрСведений.ЛБ_ПриказыВОперацияхЗайма.Форма.ФормаПросмотра", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		ИначеЕсли Расшифровка.Вид = 4 Тогда 
			ПараметрыФормы = Новый Структура;   
			ПараметрыФормы.Вставить("ЗалоговыйБилет", ЗалоговыйБилет); 
			ПараметрыФормы.Вставить("Установить", ПредопределенноеЗначение("Перечисление.ЛБ_УстановитьВПриказе.Металлы")); 
			ОткрытьФорму("РегистрСведений.ЛБ_ПриказыВОперацияхЗайма.Форма.ФормаПросмотра", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
		ИначеЕсли Расшифровка.Вид = 10 Тогда 
			Если ЗначениеЗаполнено(Расшифровка.Этикетка) тогда
				СсылкаНаЭтикетку = Расшифровка.Этикетка;
				ПараметрыФормы = Новый Структура;
				ПараметрыФормы.Вставить("Ключ", СсылкаНаЭтикетку); 
				ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
				ОткрытьФорму("Справочник.ЛБ_ХранилищеЭтикеток.ФормаОбъекта", Параметрыформы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьИзмененныйМакет(ИмяМакета, ИсходныйМакет = "")
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛБ_МакетыПечатныхФормСрезПоследних.Макет КАК Макет
		|ИЗ
		|	РегистрСведений.ЛБ_МакетыПечатныхФорм.СрезПоследних(&Период, ИсходныйМакет = &ИсходныйМакет) КАК ЛБ_МакетыПечатныхФормСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_МакетыПечатныхФормСрезПоследних.Период УБЫВ";
		
		Запрос.УстановитьПараметр("Период", ТекущаяУниверсальнаяДата());
		Запрос.УстановитьПараметр("ИсходныйМакет", ИсходныйМакет);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Макет = Выборка.Макет.Получить();
			
		Иначе
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПользовательскиеМакетыПечати.Макет КАК Макет,
			|	ПользовательскиеМакетыПечати.Использование КАК Использование
			|ИЗ
			|	РегистрСведений.ПользовательскиеМакетыПечати КАК ПользовательскиеМакетыПечати
			|ГДЕ
			|	ПользовательскиеМакетыПечати.ИмяМакета = &ИмяМакета";
			
			Запрос.УстановитьПараметр("ИмяМакета", ИмяМакета);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				
				Если Выборка.Использование Тогда
					Макет = Выборка.Макет.Получить();
				Иначе	
					Макет = ПолучитьОбщийМакет(ИмяМакета);
				КонецЕсли;
			Иначе
				Макет = ПолучитьОбщийМакет(ИмяМакета);
			КонецЕсли;
			
		КонецЕсли;
		
		Возврат Макет;
		
КонецФункции 

&НаСервере
Функция НаименованиеОрганизации()
	
	Результат = Новый Структура("НаименованиеПолное, НаименованиеСокращенное", "", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛБ_ОсновнаяОрганизация.Значение.НаименованиеПолное КАК НаименованиеПолное,
	|	ЛБ_ОсновнаяОрганизация.Значение.НаименованиеСокращенное КАК НаименованиеСокращенное
	|ИЗ
	|	Константа.ЛБ_ОсновнаяОрганизация КАК ЛБ_ОсновнаяОрганизация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ЛБ_ОсновнаяОрганизация.Значение = Организации.Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат.НаименованиеПолное      = Выборка.НаименованиеПолное;
		Результат.НаименованиеСокращенное = Выборка.НаименованиеСокращенное;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ФИОДиректора()
	
	Результат = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.Директор.Представление КАК Директор
	|ИЗ
	|	Константа.ЛБ_ОсновнаяОрганизация КАК ЛБ_ОсновнаяОрганизация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ЛБ_ОсновнаяОрганизация.Значение = Организации.Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.Директор;	
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПаспортныеДанныеКлиента(ДокументСПрописнойБуквы = Ложь)
	
	Результат = Новый Структура("ПаспортныеДанные, ВидДокумента, Серия, Номер, КемВыдан, ДатаВыдачи, КодПодразделения", "", "", "", "", "", "", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента.Представление КАК ВидДокумента,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК Серия,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК Номер,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК КемВыдан,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА """"
	|		ИНАЧЕ ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи
	|	КОНЕЦ КАК ДатаВыдачи,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК КодПодразделения
	|ИЗ
	|	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(, ДокументЗалогодателя.Владелец = &Залогодатель) КАК ЛБ_ДокументыЗалогодателейСрезПоследних
	|ГДЕ
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя = &ДУЛ
	|	И НЕ ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНеДействителен
	|	И ЛБ_ДокументыЗалогодателейСрезПоследних.ОсновнойДУЛ";
	
	Запрос.УстановитьПараметр("ДУЛ", Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий(); 
		
		ВидДокументаВыборка = ?(ДокументСПрописнойБуквы, СтрШаблон("%1%2", НРег(Лев(Выборка.ВидДокумента, 1)), Сред(Выборка.ВидДокумента, 2)), Выборка.ВидДокумента);
		
		ВидДокумента     = ?(ПустаяСтрока(ВидДокументаВыборка),      "", СтрШаблон(" %1:",                    ВидДокументаВыборка));
		Серия            = ?(ПустаяСтрока(Выборка.Серия),            "", СтрШаблон(" серия %1",              Выборка.Серия));
		Номер            = ?(ПустаяСтрока(Выборка.Номер),            "", СтрШаблон(" номер %1,",              Выборка.Номер));
		КемВыдан         = ?(ПустаяСтрока(Выборка.КемВыдан),         "", СтрШаблон(" выдан: %1,",             Выборка.КемВыдан));
		ДатаВыдачи       = ?(ПустаяСтрока(Выборка.ДатаВыдачи),       "", СтрШаблон(" дата выдачи: %1,",       Формат(Выборка.ДатаВыдачи,"ДФ=dd.MM.yyyy")));
		КодПодразделения = ?(ПустаяСтрока(Выборка.КодПодразделения), "", СтрШаблон(" код подразделения: %1,", Выборка.КодПодразделения)); 
		
		Результат.Вставить("ПаспортныеДанные", СтрШаблон("%1%2%3%4%5%6", ВидДокумента, Серия, Номер, КемВыдан, ДатаВыдачи, КодПодразделения));
		Результат.Вставить("ВидДокумента",     Выборка.ВидДокумента);
		Результат.Вставить("Серия",            Выборка.Серия);
		Результат.Вставить("Номер",            Выборка.Номер);
		Результат.Вставить("КемВыдан",         Выборка.КемВыдан);
		Результат.Вставить("ДатаВыдачи",       Выборка.ДатаВыдачи);
		Результат.Вставить("КодПодразделения", Выборка.КодПодразделения);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 
	
&НаСервере
Функция ПечатьЗаявлениеНаВозвратБезналичнойОплаты_ТабДок()
		
		ТабДок = Новый ТабличныйДокумент;
		ТабДок.АвтоМасштаб         = Истина;
		ТабДок.ОтображатьСетку     = Ложь;
		ТабДок.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
		ТабДок.ТолькоПросмотр      = Истина; 
		
		Если Не РольДоступна("ПолныеПрава") Тогда
			ТабДок.Защита = Истина;
		КонецЕсли;
		
		ИсходныйМакет = Справочники.ЛБ_ШаблоныМакетов.ЗаявлениеНаВозвратБезналичнойОплаты.Наименование;
		Макет = ПолучитьИзмененныйМакет("ЛБ_ЗаявлениеНаВозвратБезналичнойОплаты", ИсходныйМакет);
		
		ОбластьМакетаШапка  = Макет.ПолучитьОбласть("Шапка"); 
		ОбластьМакетаТекст  = Макет.ПолучитьОбласть("Текст");                                          
		ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
		
		ЗаемщикОтчество = ?(ПустаяСтрока(Отчество), "", СтрШаблон(" %1", Отчество));
		ЗаемщикТекстом  = СтрШаблон("%1 %2%3", Фамилия, Имя, ЗаемщикОтчество);
		
		ОбластьМакетаШапка.Параметры.Директор = ПолучитьСклоненияСтроки(ФИОДиректора(), , "ПД=Дательный")[0]; 
		ОбластьМакетаШапка.Параметры.Заемщик  = ПолучитьСклоненияСтроки(ЗаемщикТекстом, , "ПД=Родительный")[0];
		ОбластьМакетаШапка.Параметры.Телефон  = ?(ПустаяСтрока(Телефон), "", Телефон);
		ОбластьМакетаШапка.Параметры.ОрганизацияНаименованиеСокращенное = НаименованиеОрганизации().НаименованиеСокращенное;
		
		ТабДок.Вывести(ОбластьМакетаШапка);
		
		УдостоверяющийДокументЗаемщика =СокрЛП(ПаспортныеДанныеКлиента(Истина).ПаспортныеДанные); 
		
		ОбластьМакетаТекст.Параметры.Заемщик                        = ЗаемщикТекстом;
		ОбластьМакетаТекст.Параметры.ДатаРожденияЗаемщика           = Формат(ДатаРождения, "ДФ=dd.MM.yyyy");
		ОбластьМакетаТекст.Параметры.УдостоверяющийДокументЗаемщика = УдостоверяющийДокументЗаемщика;
		ОбластьМакетаТекст.Параметры.АдресРегистрацииЗаемщика       = ?(Не ПустаяСтрока(АдресПоПрописке), АдресПоПрописке, ФактическийАдрес);
		
		ТабДок.Вывести(ОбластьМакетаТекст);
		
		ОбластьМакетаПодвал.Параметры.Дата = Формат(ТекущаяДатаСеанса(),"ДЛФ=ДД");
		
		ТабДок.Вывести(ОбластьМакетаПодвал);
		
		Возврат ТабДок;
		
КонецФункции	

&НаСервере
Функция ПечатьШаблонЗаявленияНаВозвратБезналичнойОплаты_ТабДок()
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб         = Истина;
	ТабДок.ОтображатьСетку     = Ложь;
	ТабДок.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ТабДок.ТолькоПросмотр      = Истина;
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		ТабДок.Защита = Истина;
	КонецЕсли;
	
	ИсходныйМакет = Справочники.ЛБ_ШаблоныМакетов.ШаблонЗаявленияНаВозвратБезналичнойОплаты.Наименование;
	Макет = ПолучитьИзмененныйМакет("ЛБ_ШаблонЗаявленияНаВозвратБезналичнойОплаты", ИсходныйМакет);
	
	ОбластьМакетаШапка  = Макет.ПолучитьОбласть("Шапка"); 
	ОбластьМакетаТекст  = Макет.ПолучитьОбласть("Текст");
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьМакетаШапка.Параметры.ОрганизацияНаименованиеСокращенное = НаименованиеОрганизации().НаименованиеСокращенное;
	
	ТабДок.Вывести(ОбластьМакетаШапка);
	ТабДок.Вывести(ОбластьМакетаТекст);
	ТабДок.Вывести(ОбластьМакетаПодвал);
	
	Возврат ТабДок;
	
КонецФункции	

&НаСервере
Функция ПечатьЗаявлениеОПредоставленииСведенийОНаличииОбязательствИмущественногоХарактера_ТабДок()
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб         = Истина;
	ТабДок.ОтображатьСетку     = Ложь;
	ТабДок.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ТабДок.ТолькоПросмотр      = Истина; 
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		ТабДок.Защита = Истина;
	КонецЕсли;
	
	ИсходныйМакет = Справочники.ЛБ_ШаблоныМакетов.ЗаявлениеОПредоставленииСведенийОНаличииОбязательствИмущХарактера.Наименование;
	Макет = ПолучитьИзмененныйМакет("ЛБ_ЗаявлениеОПредоставленииСведенийОНаличииОбязательствИмущХарактера", ИсходныйМакет);
	
	ОбластьМакетаШапка  = Макет.ПолучитьОбласть("Шапка"); 
	ОбластьМакетаТекст  = Макет.ПолучитьОбласть("Текст");         
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ЗаемщикОтчество = ?(ПустаяСтрока(Отчество), "", СтрШаблон(" %1", Отчество));
	ЗаемщикТекстом  = СтрШаблон("%1 %2%3", Фамилия, Имя, ЗаемщикОтчество);
	ОбластьМакетаШапка.Параметры.Заемщик                            = ПолучитьСклоненияСтроки(ЗаемщикТекстом, , "ПД=Родительный")[0];
	ОбластьМакетаШапка.Параметры.ДатаРожденияЗаемщика               = Формат(ДатаРождения, "ДФ=dd.MM.yyyy");
	ОбластьМакетаШапка.Параметры.УдостоверяющийДокументЗаемщика     = СокрЛП(ПаспортныеДанныеКлиента().ПаспортныеДанные);
	ОбластьМакетаШапка.Параметры.АдресРегистрацииЗаемщика           = ?(Не ПустаяСтрока(АдресПоПрописке), АдресПоПрописке, ФактическийАдрес);
	ОбластьМакетаШапка.Параметры.Телефон                            = ?(ПустаяСтрока(Телефон), "", Телефон);
	ОбластьМакетаШапка.Параметры.ОрганизацияНаименованиеСокращенное = НаименованиеОрганизации().НаименованиеСокращенное;
	
	ТабДок.Вывести(ОбластьМакетаШапка);
	
	ТабДок.Вывести(ОбластьМакетаТекст);
	
	ОбластьМакетаПодвал.Параметры.НаименованиеЛомбардаИНомерОтделения = "";    
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	Если НЕ ТекПользователь.ЭтоЛомбард Тогда
		Сотрудник = ТекПользователь.Сотрудник;
	Иначе
		Сотрудник = ПараметрыСеанса.ТекущийСотрудник;
	КонецЕсли;	
	ОбластьМакетаПодвал.Параметры.Работник                            = Сотрудник;
	ОбластьМакетаПодвал.Параметры.Дата                                = Формат(ТекущаяДатаСеанса(),"ДЛФ=ДД");
	
	ТабДок.Вывести(ОбластьМакетаПодвал);
	
	Возврат ТабДок;
	
КонецФункции  

&НаСервере
Функция ПечатьАктОПолученииИзделийНаследниками_ТабДок()  
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб         = Истина;
	ТабДок.ОтображатьСетку     = Ложь;
	ТабДок.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ТабДок.ТолькоПросмотр      = Истина; 
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		ТабДок.Защита = Истина;
	КонецЕсли;
	
	ИсходныйМакет = Справочники.ЛБ_ШаблоныМакетов.АктОПолученииИзделийНаследниками.Наименование;
	Макет = ПолучитьИзмененныйМакет("ЛБ_АктОПолученииИзделийНаследниками", ИсходныйМакет);
	
	ОбластьМакетаШапка  = Макет.ПолучитьОбласть("Шапка"); 
	ОбластьМакетаТекст  = Макет.ПолучитьОбласть("Текст");
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьМакетаШапка.Параметры.АдресЛомбарда                      = "";
	ОбластьМакетаШапка.Параметры.Дата                               = Формат(ТекущаяДатаСеанса(),"ДЛФ=ДД"); 
	ОбластьМакетаШапка.Параметры.ОрганизацияНаименованиеСокращенное = НаименованиеОрганизации().НаименованиеСокращенное;
	
	ТабДок.Вывести(ОбластьМакетаШапка);
	
	ЗаемщикОтчество = ?(ПустаяСтрока(Отчество), "", СтрШаблон(" %1", Отчество));
	ЗаемщикТекстом  = СтрШаблон("%1 %2%3", Фамилия, Имя, ЗаемщикОтчество);
	ОбластьМакетаТекст.Параметры.Заемщик                        = ПолучитьСклоненияСтроки(ЗаемщикТекстом, , "ПД=Родительный")[0];
	ОбластьМакетаТекст.Параметры.УдостоверяющийДокументЗаемщика = СокрЛП(ПаспортныеДанныеКлиента(Истина).ПаспортныеДанные);
	
	ТабДок.Вывести(ОбластьМакетаТекст);
	
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	Если НЕ ТекПользователь.ЭтоЛомбард Тогда
		Сотрудник = ТекПользователь.Сотрудник;
	Иначе
		Сотрудник = ПараметрыСеанса.ТекущийСотрудник;
	КонецЕсли;	
	ОбластьМакетаПодвал.Параметры.Сотрудник = Сотрудник; 
	
	ТабДок.Вывести(ОбластьМакетаПодвал);
	
	Возврат ТабДок;
	
КонецФункции	

&НаСервере
Функция ПечатьЗаявлениеВСвободнойФорме_ТабДок()
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб         = Истина;
	ТабДок.ОтображатьСетку     = Ложь;
	ТабДок.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ТабДок.ТолькоПросмотр      = Истина; 
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		ТабДок.Защита = Истина;
	КонецЕсли;
	
	ИсходныйМакет = Справочники.ЛБ_ШаблоныМакетов.ЗаявлениеВСвободнойФорме.Наименование;
	Макет = ПолучитьИзмененныйМакет("ЛБ_ЗаявлениеВСвободнойФорме", ИсходныйМакет);
	
	ОбластьМакетаШапка  = Макет.ПолучитьОбласть("Шапка"); 
	ОбластьМакетаТекст  = Макет.ПолучитьОбласть("Текст");
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал"); 
	
	ЗаемщикОтчество = ?(ПустаяСтрока(Отчество), "", СтрШаблон(" %1", Отчество));
	ЗаемщикТекстом  = СтрШаблон("%1 %2%3", Фамилия, Имя, ЗаемщикОтчество);
	
	ОбластьМакетаШапка.Параметры.Директор                           = ПолучитьСклоненияСтроки(ФИОДиректора(), , "ПД=Дательный")[0]; 
	ОбластьМакетаШапка.Параметры.Заемщик                            = ПолучитьСклоненияСтроки(ЗаемщикТекстом, , "ПД=Родительный")[0];
	ОбластьМакетаШапка.Параметры.ДатаРожденияЗаемщика               = Формат(ДатаРождения, "ДФ=dd.MM.yyyy");
	ОбластьМакетаШапка.Параметры.УдостоверяющийДокументЗаемщика     = СокрЛП(ПаспортныеДанныеКлиента().ПаспортныеДанные);
	ОбластьМакетаШапка.Параметры.АдресРегистрацииЗаемщика           = ?(Не ПустаяСтрока(АдресПоПрописке), АдресПоПрописке, ФактическийАдрес);
	ОбластьМакетаШапка.Параметры.Телефон                            = ?(ПустаяСтрока(Телефон), "", Телефон);
	ОбластьМакетаШапка.Параметры.ОрганизацияНаименованиеСокращенное = НаименованиеОрганизации().НаименованиеСокращенное;
	
	ТабДок.Вывести(ОбластьМакетаШапка);
	ТабДок.Вывести(ОбластьМакетаТекст);
	ТабДок.Вывести(ОбластьМакетаПодвал);
	
	Возврат ТабДок;
	
КонецФункции	


&НаКлиенте
Процедура ЗаявлениеНаВозврат(Команда)
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Макет");
	ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "Макет");
	
	// Формирование табличного документа
	ПечатнаяФорма.ТабличныйДокумент = ПечатьЗаявлениеНаВозвратБезналичнойОплаты_ТабДок();
	
	КлючУникальности = Строка(Новый УникальныйИдентификатор);
	ПараметрыОткрытия = Новый Структура("ИмяМенеджераПечати,ИменаМакетов,ПараметрКоманды,ПараметрыПечати");
	ПараметрыОткрытия.ПараметрКоманды = Новый Массив;
	ПараметрыОткрытия.ПараметрыПечати = Новый Структура;
	ПараметрыОткрытия.Вставить("КоллекцияПечатныхФорм", КоллекцияПечатныхФорм);
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ВладелецФормы, КлючУникальности);
КонецПроцедуры

&НаКлиенте
Процедура ШаблонЗаявления(Команда)
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Макет");
	ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "Макет");
	
	// Формирование табличного документа
	ПечатнаяФорма.ТабличныйДокумент = ПечатьШаблонЗаявленияНаВозвратБезналичнойОплаты_ТабДок();
	
	КлючУникальности = Строка(Новый УникальныйИдентификатор);
	ПараметрыОткрытия = Новый Структура("ИмяМенеджераПечати,ИменаМакетов,ПараметрКоманды,ПараметрыПечати");
	ПараметрыОткрытия.ПараметрКоманды = Новый Массив;
	ПараметрыОткрытия.ПараметрыПечати = Новый Структура;
	ПараметрыОткрытия.Вставить("КоллекцияПечатныхФорм", КоллекцияПечатныхФорм);
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ВладелецФормы, КлючУникальности);
КонецПроцедуры

&НаКлиенте
Процедура ЗаявлениеОПредоставленииСведений(Команда)
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Макет");
	ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "Макет");
	
	// Формирование табличного документа
	ПечатнаяФорма.ТабличныйДокумент = ПечатьЗаявлениеОПредоставленииСведенийОНаличииОбязательствИмущественногоХарактера_ТабДок();
	
	КлючУникальности = Строка(Новый УникальныйИдентификатор);
	ПараметрыОткрытия = Новый Структура("ИмяМенеджераПечати,ИменаМакетов,ПараметрКоманды,ПараметрыПечати");
	ПараметрыОткрытия.ПараметрКоманды = Новый Массив;
	ПараметрыОткрытия.ПараметрыПечати = Новый Структура;
	ПараметрыОткрытия.Вставить("КоллекцияПечатныхФорм", КоллекцияПечатныхФорм);
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ВладелецФормы, КлючУникальности);
КонецПроцедуры

&НаКлиенте
Процедура АктНаследник(Команда)
	Если ДатаСмерти = Дата(1, 1, 1) Тогда
		Возврат;
	КонецЕсли;
	
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Макет");
	ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "Макет");
	
	// Формирование табличного документа
	ПечатнаяФорма.ТабличныйДокумент = ПечатьАктОПолученииИзделийНаследниками_ТабДок();
	
	КлючУникальности = Строка(Новый УникальныйИдентификатор);
	ПараметрыОткрытия = Новый Структура("ИмяМенеджераПечати,ИменаМакетов,ПараметрКоманды,ПараметрыПечати");
	ПараметрыОткрытия.ПараметрКоманды = Новый Массив;
	ПараметрыОткрытия.ПараметрыПечати = Новый Структура;
	ПараметрыОткрытия.Вставить("КоллекцияПечатныхФорм", КоллекцияПечатныхФорм);
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ВладелецФормы, КлючУникальности);

КонецПроцедуры

&НаКлиенте
Процедура СвободнаяФорма(Команда)
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Макет");
	ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "Макет");
	
	// Формирование табличного документа
	ПечатнаяФорма.ТабличныйДокумент = ПечатьЗаявлениеВСвободнойФорме_ТабДок();
	
	КлючУникальности = Строка(Новый УникальныйИдентификатор);
	ПараметрыОткрытия = Новый Структура("ИмяМенеджераПечати,ИменаМакетов,ПараметрКоманды,ПараметрыПечати");
	ПараметрыОткрытия.ПараметрКоманды = Новый Массив;
	ПараметрыОткрытия.ПараметрыПечати = Новый Структура;
	ПараметрыОткрытия.Вставить("КоллекцияПечатныхФорм", КоллекцияПечатныхФорм);
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ВладелецФормы, КлючУникальности);
КонецПроцедуры

&НаСервере
Функция ПолучитьВидОперацииЗБ(ЗалоговыйБилет)
	Возврат ЗалоговыйБилет.ВидОперации;
КонецФункции

&НаКлиенте
Процедура ПечатьЗБ(Команда)
	ПараметрыФормы = Новый Структура;  
	ВидОперации = ПолучитьВидОперацииЗБ(ЗалоговыйБилет); 
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление") Тогда 
		ПараметрыФормы.Вставить("ИменаМакетов", "Переоформление");
	Иначе	
	    ПараметрыФормы.Вставить("ИменаМакетов", "ЗалоговыйБилет");  
	КонецЕсли;	 
	ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_ОперацияПоЗалогу");
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(ЗалоговыйБилет);
	ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,);   
КонецПроцедуры

&НаКлиенте
Процедура ПечатьДубликатаЗБ(Команда)
	Предупреждение("Эта печ. форма пока в работе.", 60);
КонецПроцедуры

&НаСервере
Функция НайтиПоследнийДокументОплатыДС()  
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилета.Регистратор КАК ОперацияОплаты,
	               |	ЛБ_СостояниеЗалоговогоБилета.НомерДопСоглашения КАК НомерДС
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета КАК ЛБ_СостояниеЗалоговогоБилета
	               |ГДЕ
	               |	ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет = &ЗалоговыйБилет
	               |	И ЛБ_СостояниеЗалоговогоБилета.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
	               |	И ЛБ_СостояниеЗалоговогоБилета.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_СостояниеЗалоговогоБилета.Период УБЫВ";  
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	НомерДС = 0; 
	ОперацияОплаты = Документы.ЛБ_ОперацияПоЗалогу.ПустаяСсылка();
	Для каждого стр Из ТаблицаЗапроса цикл 
		Если ПолучитьДокументОтмены(стр.ОперацияОплаты) Тогда
			Продолжить;
		КонецЕсли;	
		Если Стр.НомерДС = 0 Тогда 
			Возврат ОперацияОплаты;
		КонецЕсли;	
		Если ЗначениеЗаполнено(ОперацияОплаты) Тогда
			Если НЕ НомерДС = Стр.НомерДС Тогда
				Возврат ОперацияОплаты;
			КонецЕсли;	
		Иначе	
		    НомерДС = Стр.НомерДС; 
			ОперацияОплаты = стр.ОперацияОплаты;
		КонецЕсли;	
	КонецЦикла;
	Возврат ОперацияОплаты;
КонецФункции

&НаКлиенте
Процедура ПечатьДС(Команда)
	ДокументОплаты = НайтиПоследнийДокументОплатыДС();
	Если ЗначениеЗаполнено(ДокументОплаты) Тогда	
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ИменаМакетов", "ДополнительноеСоглашение"); 
		ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_ОперацияПоЗалогу");
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(ДокументОплаты);
		ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
		ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,); 
	Иначе     
		Предупреждение("У залогового билета нет доп. соглашений.", 60);
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ПечатьДубликатаДС(Команда)
	Предупреждение("Эта печ. форма пока в работе.", 60);
КонецПроцедуры

&НаКлиенте
Процедура РеестрДС(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗалоговыйБилет", ЗалоговыйБилет);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаРеестраПлатежей", ПараметрыФормы, Этаформа,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
КонецПроцедуры
