
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;    
	Если УправлениеДоступом.ЕстьРоль("ЛБ_Суперпользователь") Тогда 
		ЭтоСуперпользователь = Истина;
	КонецЕсли;
	Если ТекПользователь.ЭтоЛомбард Тогда
		ОбщегоНазначения.СообщитьПользователю("Документ «Установка цены» доступен только сотрудникам ЦО.");
		Отказ = Истина;  
	ИначеЕсли НЕ УправлениеДоступом.ЕстьРоль("ЛБ_СотрудникЦО") И НЕ ЭтоСуперпользователь Тогда 
		ОбщегоНазначения.СообщитьПользователю("Документ «Установка цены» доступен только сотрудникам ЦО.");
		Отказ = Истина; 
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Ответственный = ТекПользователь;
		Объект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить(); 
		Объект.Дата = ТекущаяДатаСеанса(); 
		ЭтаФорма.Заголовок = "Установка цены объектов залога (создание)"; 
		Если Параметры.Свойство("Склад") Тогда
			Объект.Склад = Параметры.Склад;
			Объект.Ломбард = Объект.Склад.Владелец;  
			ПолучитьТоварыПоОстаткам();
		КонецЕсли;	
	Иначе
		ЭтаФорма.Заголовок = "Установка цены объектов залога № " + СокрЛП(Объект.ПредставлениеНомера) + " от " + Формат(Объект.Дата, "ДЛФ=DT"); 
	КонецЕсли;
	УстановитьСостояниеДокумента();    
	ЗаполнитьТаблицуТоваров();                
				
	Если Объект.Проведен Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;   
		Элементы.ТаблицаТоваров.ТолькоПросмотр = Истина;
		Элементы.ТаблицаТоваровДобавить.Доступность = Ложь; 
		Элементы.ТаблицаТоваровГруппаСкидки.Доступность = Ложь;
	КонецЕсли;	
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);

КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры   
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект);
	
КонецПроцедуры          

&НаСервере
Процедура ЗаполнитьТаблицуДокумента()
	Объект.Товары.Загрузить(ТаблицаТоваров.Выгрузить());
КонецПроцедуры

&НаСервере
Функция ПолучитьНовыйНомерУстановкиЦены()   
	СтруктураВозврата = Новый Структура;  
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	    НомерУстановкиЦены = ЛБ_УправлениеЛомбардом.ПолучитьНовыйНомерУстановкиЦены(Объект.Дата, Объект.Организация, Объект.Ломбард, Объект.Ссылка); 
	Иначе   
		НомерУстановкиЦены = ЛБ_УправлениеЛомбардом.ПолучитьНовыйНомерУстановкиЦены(Объект.Дата, Объект.Организация, Объект.Ломбард);
	КонецЕсли;	
	СтруктураВозврата.Вставить("НомерУстановкиЦены", НомерУстановкиЦены);	
	Если Объект.Ломбард = ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис") Тогда
		ПредставлениеНомера = СокрЛП(НомерУстановкиЦены);
	Иначе	
        ПредставлениеНомера = СокрЛП(Объект.Ломбард.НомерЛомбарда) + "/" +  СокрЛП(НомерУстановкиЦены);  
	КонецЕсли;	  
	СтруктураВозврата.Вставить("ПредставлениеНомера", ПредставлениеНомера);
    Возврат СтруктураВозврата;
КонецФункции	

&НаСервере
Функция ПроверкаОстатков() 
	ЕстьОшибки = Ложь;
	ТаблицаОстатков = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбарда(Объект.Дата, Объект.Организация, Объект.Ломбард, Объект.Склад);   
		
	Для каждого Стр Из ТаблицаТоваров Цикл  
		Отбор = новый структура;
		Отбор.Вставить("ЗалоговыйБилет", Стр.ЗалоговыйБилет); 
		Отбор.Вставить("ОбъектЗалога", Стр.ОбъектЗалога);
		СтрокиОст = ТаблицаОстатков.НайтиСтроки(Отбор);
		Если СтрокиОст.Количество() = 0 Тогда 
			Сообщить("Изделие с артикулом " + СокрЛП(Стр.Артикул) + " не найдено на складе " + СокрЛП(Объект.Склад));  
			ЕстьОшибки = Истина;
		Конецесли;    
	Конеццикла;  
		
	Возврат ?(ЕстьОшибки, Ложь, Истина);
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ЗаполнитьТаблицуДокумента();
	Если ЗначениеЗаполнено(Объект.Ломбард) И (Объект.НомерУстановкиЦены = 0) Тогда
		Результат = ПолучитьНовыйНомерУстановкиЦены();
		Объект.НомерУстановкиЦены = Результат.НомерУстановкиЦены;
		Объект.ПредставлениеНомера = Результат.ПредставлениеНомера;
	КонецЕсли;
	Если НЕ ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		Если ТаблицаТоваров.Количество() = 0 Тогда
			Сообщить("Не выбраны изделия для которых устанавливается цена.", статуссообщения.Важное);
			Отказ = Истина; 
		Иначе
			Для каждого Стр Из ТаблицаТоваров Цикл
				Если Стр.ФактическаяЦена = 0 Тогда 
					Сообщить("Для изделия " + СокрЛП(Стр.Артикул) + " не установлена фактическая цена.", статуссообщения.Важное);
			        Отказ = Истина; 
					Прервать;
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;    
		//Если НЕ Отказ Тогда
		//	Если НЕ ПроверкаОстатков() Тогда  
		//		Отказ = Истина;
		//	КонецЕсли; 
		//КонецЕсли;	
	КонецЕсли;		
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьИтоги()
	ИтогКоличество = ТаблицаТоваров.Итог("Количество");
	ИтогВес = ТаблицаТоваров.Итог("ВесИзделия"); 
	ИтогВесМеталла = ТаблицаТоваров.Итог("ВесМеталла");
    ИтогСуммаОценки = ТаблицаТоваров.Итог("СуммаОценки");
	ИтогСуммаОценкиМакс = ТаблицаТоваров.Итог("СуммаОценкиМакс"); 
	ИтогСуммаОценкиМеталлы = ТаблицаТоваров.Итог("СуммаОценкиМеталлы");
	ИтогСуммаОценкиВставки = ТаблицаТоваров.Итог("СуммаОценкиВставки");
	ИтогСуммаСсуды = ТаблицаТоваров.Итог("СуммаСсуды"); 
	ИтогУчетнаяЦена = ТаблицаТоваров.Итог("УчетнаяЦена");
	ИтогФактическаяЦена = ТаблицаТоваров.Итог("ФактическаяЦена");
КонецПроцедуры	  


&НаСервере
Процедура ЗаполнитьТаблицуТоваров()  
	Запрос = Новый Запрос;  
	СписокОЗ = Новый СписокЗначений;
	СписокЗБ = Новый СписокЗначений;
	Для каждого Стр Из Объект.Товары Цикл 
		Если СписокЗБ.НайтиПоЗначению(Стр.ЗалоговыйБилет) = неопределено Тогда 
			СписокЗБ.Добавить(Стр.ЗалоговыйБилет);
		КонецЕсли;	
		Если СписокОЗ.НайтиПоЗначению(Стр.ОбъектЗалога) = неопределено Тогда 
			СписокОЗ.Добавить(Стр.ОбъектЗалога);
		КонецЕсли;	
	КонецЦикла;	       
    Если Объект.Проведен Тогда
	    Запрос.УстановитьПараметр("Дата", Новый Граница(Объект.Ссылка.МоментВремени(), ВидГраницы.Исключая));
	Иначе 
		Запрос.УстановитьПараметр("Дата", Объект.Дата);
	КонецЕсли;	 
	Запрос.УстановитьПараметр("ЗалоговыеБилеты", СписокЗБ); 
	Запрос.УстановитьПараметр("ОбъектыЗалога", СписокОЗ);  
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК ВесИзделия,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесМеталла,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценки,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМакс КАК СуммаОценкиМакс,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиКамни КАК СуммаОценкиВставки,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаСсуды КАК СуммаСсуды,
	               |	1 КАК Количество,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вставки КАК Вставки,
	               |	ЛБ_ГруппыОбъектовЗалогаСрезПоследних.Группа КАК Группа,
	               |	ЕСТЬNULL(ЛБ_ЦеныОбъектовЗалогаСрезПоследних.Цена, 0) КАК УчетнаяЦена,
	               |	ЕСТЬNULL(ЛБ_ЦеныОбъектовЗалогаСрезПоследних.Цена, 0) КАК ФактическаяЦена
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
	               |			&Дата,
	               |			ОбъектЗалога В (&ОбъектыЗалога)
	               |				И ЗалоговыйБилет В (&ЗалоговыеБилеты)) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ГруппыОбъектовЗалога.СрезПоследних(&Дата, ) КАК ЛБ_ГруппыОбъектовЗалогаСрезПоследних
	               |		ПО ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет = ЛБ_ГруппыОбъектовЗалогаСрезПоследних.ЗалоговыйБилет
	               |			И ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога = ЛБ_ГруппыОбъектовЗалогаСрезПоследних.ОбъектЗалога
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ЦеныОбъектовЗалога.СрезПоследних(&Дата, ) КАК ЛБ_ЦеныОбъектовЗалогаСрезПоследних
	               |		ПО ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет = ЛБ_ЦеныОбъектовЗалогаСрезПоследних.ЗалоговыйБилет
	               |			И ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога = ЛБ_ЦеныОбъектовЗалогаСрезПоследних.ОбъектЗалога";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	ТаблицаТоваров.Загрузить(ТаблицаЗапроса); 
	Для каждого Стр Из Объект.Товары Цикл
		Отбор = Новый структура;
		Отбор.Вставить("ЗалоговыйБилет", стр.ЗалоговыйБилет); 
		Отбор.Вставить("ОбъектЗалога", стр.ОбъектЗалога);   
		
		СтрокиТ = ТаблицаТоваров.НайтиСтроки(Отбор);
		Если НЕ СтрокиТ.Количество() = 0 Тогда 
			СтрТ = СтрокиТ.Получить(0); 
			СтрТ.ФактическаяЦена = Стр.ФактическаяЦена; 
			СтрТ.Скидка = Стр.Скидка;
		КонецЕсли;	
	Конеццикла;	
	ЗаполнитьИтоги();
КонецПроцедуры	

&НаСервере
Функция ПолучитьЗаемщика(ЗБ) 
	Возврат ЗБ.Залогодатель;
КонецФункции

&НаКлиенте
Процедура ИсторияЗБ(Команда)
	ТекСтрока = Элементы.ТаблицаТоваров.ТекущиеДанные;
	Если ТекСтрока = неопределено Тогда
		Возврат;
	КонецЕсли;	
	Если ЗначениеЗаполнено(ТекСтрока.ЗалоговыйБилет) Тогда 
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Клиент", ПолучитьЗаемщика(ТекСтрока.ЗалоговыйБилет));
		ПараметрыФормы.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет);	 
								
		ОткрытьФорму("Отчет.ЛБ_ИсторияЗалоговогоБилета.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);   
	КонецЕсли;	 
КонецПроцедуры

&НаСервере
Функция ПолучитьСклад()  
	Если Объект.Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис Тогда
	    ВидСклада = Перечисления.ЛБ_ВидыСкладов.ВитринаОбщая;
	Иначе    
		ВидСклада = Перечисления.ЛБ_ВидыСкладов.Витрина;
	КонецЕсли;	
    Возврат ЛБ_Общиймодуль.ПолучитьСклад(Объект.Ломбард, ВидСклада);
КонецФункции

&НаКлиенте
Процедура ЛомбардПриИзменении(Элемент)
	Если Значениезаполнено(Объект.Ломбард) Тогда  
		Объект.Склад = ПолучитьСклад();
		ТаблицаТоваров.Очистить();
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура Расчеты(Команда)
	ТекСтрока = Элементы.ТаблицаТоваров.ТекущиеДанные;
	Если ТекСтрока = неопределено Тогда
		Возврат;
	КонецЕсли;	
	Если ЗначениеЗаполнено(ТекСтрока.ЗалоговыйБилет) Тогда 
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Клиент", ПолучитьЗаемщика(ТекСтрока.ЗалоговыйБилет));
		ПараметрыФормы.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет);		
		ПараметрыФормы.Вставить("Дата", Объект.Дата);	 
		ПараметрыФормы.Вставить("Детально", Истина);
					
        ОткрытьФорму("Отчет.ЛБ_НачисленныеПроцентыПоДоговоруЗайма.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПолучитьТоварыПоОстаткам()  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбарда(Объект.Дата, Объект.Организация, Объект.Ломбард, Объект.Склад);  
	Объект.Товары.Загрузить(ТаблицаЗапроса); 
	Объект.Товары.Сортировать("ЗалоговыйБилет");
КонецПроцедуры	
	 
&НаКлиенте
Процедура Заполнить(Команда) 
	Если НЕ ЗначениеЗаполнено(Объект.Ломбард) Тогда  
		Сообщить("Выберите подразделение.", СтатусСообщения.Внимание);
		Возврат; 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Склад) Тогда  
		Сообщить("Выберите склад.", СтатусСообщения.Внимание);
		Возврат;	
	КонецЕсли;	
	ПолучитьТоварыПоОстаткам();
	ЗаполнитьТаблицуТоваров();
КонецПроцедуры 

&НаСервере
Процедура ДобавитьВТаблицуТоваров(ТаблицаОЗ)  
	Запрос = Новый Запрос;  
	СписокОЗ = Новый СписокЗначений;
	СписокЗБ = Новый СписокЗначений;
	Для каждого Стр Из ТаблицаОЗ Цикл 
		Если СписокЗБ.НайтиПоЗначению(Стр.ЗалоговыйБилет) = неопределено Тогда 
			СписокЗБ.Добавить(Стр.ЗалоговыйБилет);
		КонецЕсли;	
		Если СписокОЗ.НайтиПоЗначению(Стр.ОбъектЗалога) = неопределено Тогда 
			СписокОЗ.Добавить(Стр.ОбъектЗалога);
		КонецЕсли;	
	КонецЦикла;	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);  
	Запрос.УстановитьПараметр("ЗалоговыеБилеты", СписокЗБ); 
	Запрос.УстановитьПараметр("ОбъектыЗалога", СписокОЗ);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК ВесИзделия,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесМеталла,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценки,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМакс КАК СуммаОценкиМакс,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиКамни КАК СуммаОценкиВставки,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаСсуды КАК СуммаСсуды,
	               |	1 КАК Количество,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вставки КАК Вставки,
	               |	ЛБ_ГруппыОбъектовЗалогаСрезПоследних.Группа КАК Группа,
	               |	ЕСТЬNULL(ЛБ_ЦеныОбъектовЗалогаСрезПоследних.Цена, 0) КАК УчетнаяЦена
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
	               |			&Дата,
	               |			ОбъектЗалога В (&ОбъектыЗалога)
	               |				И ЗалоговыйБилет В (&ЗалоговыеБилеты)) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ГруппыОбъектовЗалога.СрезПоследних(&Дата, ) КАК ЛБ_ГруппыОбъектовЗалогаСрезПоследних
	               |		ПО ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет = ЛБ_ГруппыОбъектовЗалогаСрезПоследних.ЗалоговыйБилет
	               |			И ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога = ЛБ_ГруппыОбъектовЗалогаСрезПоследних.ОбъектЗалога
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ЦеныОбъектовЗалога.СрезПоследних(&Дата, ) КАК ЛБ_ЦеныОбъектовЗалогаСрезПоследних
	               |		ПО ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет = ЛБ_ЦеныОбъектовЗалогаСрезПоследних.ЗалоговыйБилет
	               |			И ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога = ЛБ_ЦеныОбъектовЗалогаСрезПоследних.ОбъектЗалога";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для каждого Стр Из ТаблицаЗапроса Цикл 
		Отбор = Новый структура;
		Отбор.Вставить("ЗалоговыйБилет", стр.ЗалоговыйБилет);
		Отбор.Вставить("ОбъектЗалога", стр.ОбъектЗалога);
		СтрокиТ = ТаблицаТоваров.НайтиСтроки(Отбор);
		Если СтрокиТ.Количество() = 0 Тогда
		    НоваяСтр = ТаблицаТоваров.Добавить(); 
			НоваяСтр.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
			НоваяСтр.ОбъектЗалога = Стр.ОбъектЗалога;
			НоваяСтр.Артикул = Стр.Артикул;
			НоваяСтр.ВидИзделия = Стр.ВидИзделия;
			НоваяСтр.Проба = Стр.Проба;
			НоваяСтр.Категория = Стр.Категория;
			НоваяСтр.ВесИзделия = Стр.ВесИзделия;
			НоваяСтр.ВесМеталла = Стр.ВесМеталла;
			НоваяСтр.СуммаОценки = Стр.СуммаОценки;
			НоваяСтр.СуммаОценкиМакс = Стр.СуммаОценкиМакс;
			НоваяСтр.СуммаОценкиМеталлы = Стр.СуммаОценкиМеталлы;
			НоваяСтр.СуммаОценкиВставки = Стр.СуммаОценкиВставки;
			НоваяСтр.СуммаСсуды = Стр.СуммаСсуды;
			НоваяСтр.Количество = Стр.Количество;
			НоваяСтр.Вставки = Стр.Вставки;  
			НоваяСтр.Группа = Стр.Группа; 
			НоваяСтр.УчетнаяЦена = Стр.УчетнаяЦена;
			НоваяСтр.ФактическаяЦена = Стр.УчетнаяЦена;
		КонецЕсли;	
	Конеццикла;    
	ЗаполнитьИтоги();
КонецПроцедуры	

&НаСервере
Функция ПолучитьТоварыПоОстаткамАртикул(Артикул)  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоАртикулу(Объект.Дата, Объект.Организация, Объект.Ломбард, Объект.Склад, Артикул);
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
	    ДобавитьВТаблицуТоваров(ТаблицаЗапроса); 
		Возврат "";
	Иначе          
		Возврат "Изделие с артикулом " + сокрЛП(Артикул) + " на складе не найдено.";
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьПоАртикулу(Команда) 
	Если НЕ ЗначениеЗаполнено(Объект.Ломбард) Тогда  
		Сообщить("Выберите подразделение.", СтатусСообщения.Внимание);
		Возврат; 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Склад) Тогда  
		Сообщить("Выберите склад.", СтатусСообщения.Внимание);
		Возврат;	
	КонецЕсли;	

	Артикул = "";
	Если ВвестиЗначение(Артикул, "Введите артикул") Тогда
	    СтрокаСообщение = ПолучитьТоварыПоОстаткамАртикул(Артикул);
		Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
			Предупреждение(СтрокаСообщение, 60);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьТоварыПоОстаткамНомерЗБ(НомерЗБ)  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоНомеруЗБ(Объект.Дата, Объект.Организация, Объект.Ломбард, Объект.Склад, НомерЗБ);
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
	    ДобавитьВТаблицуТоваров(ТаблицаЗапроса); 
		Возврат "";
	Иначе          
		Возврат "Изделия из залогогового билета № " + сокрЛП(НомерЗБ) + " на складе не найдены.";
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьПоНомеруЗБ(Команда) 
	Если НЕ ЗначениеЗаполнено(Объект.Ломбард) Тогда  
		Сообщить("Выберите подразделение.", СтатусСообщения.Внимание);
		Возврат; 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Склад) Тогда  
		Сообщить("Выберите склад.", СтатусСообщения.Внимание);
		Возврат;	
	КонецЕсли;	

	НомерЗБ = "";
	Если ВвестиЗначение(НомерЗБ, "Введите номер ЗБ") Тогда
	    СтрокаСообщение = ПолучитьТоварыПоОстаткамНомерЗБ(НомерЗБ);
		Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
			Предупреждение(СтрокаСообщение, 60);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Функция ПолучитьТоварыПоОстаткамПроба(Проба)  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоПробе(Объект.Дата, Объект.Организация, Объект.Ломбард, Объект.Склад, Проба);
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
	    ДобавитьВТаблицуТоваров(ТаблицаЗапроса); 
		Возврат "";
	Иначе          
		Возврат "Изделия из металла " + сокрЛП(Проба) + " на складе не найдены.";
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьПоПробе(Команда)   
	Если НЕ ЗначениеЗаполнено(Объект.Ломбард) Тогда  
		Сообщить("Выберите подразделение.", СтатусСообщения.Внимание);
		Возврат; 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Склад) Тогда  
		Сообщить("Выберите склад.", СтатусСообщения.Внимание);
		Возврат;	
	КонецЕсли;	

	Проба = ПредопределенноеЗначение("Справочник.ЛБ_Пробы.ПустаяСсылка");
	Если ВвестиЗначение(Проба, "Выберите пробу", Тип("СправочникСсылка.ЛБ_Пробы")) Тогда
	    СтрокаСообщение = ПолучитьТоварыПоОстаткамПроба(Проба);
		Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
			Предупреждение(СтрокаСообщение, 60);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьТоварыПоОстаткамКатегория(Категория)  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоКатегории(Объект.Дата, Объект.Организация, Объект.Ломбард, Объект.Склад, Категория);
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
	    ДобавитьВТаблицуТоваров(ТаблицаЗапроса); 
		Возврат "";
	Иначе          
		Возврат "Изделия категории " + сокрЛП(Категория) + " на складе не найдены.";
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьПоКатегории(Команда)   
	Если НЕ ЗначениеЗаполнено(Объект.Ломбард) Тогда  
		Сообщить("Выберите подразделение.", СтатусСообщения.Внимание);
		Возврат; 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Склад) Тогда  
		Сообщить("Выберите склад.", СтатусСообщения.Внимание);
		Возврат;	
	КонецЕсли;	

	Категория = ПредопределенноеЗначение("Справочник.ЛБ_КатегорииОбъектовЗалога.ПустаяСсылка");
	Если ВвестиЗначение(Категория, "Выберите категорию", Тип("СправочникСсылка.ЛБ_КатегорииОбъектовЗалога")) Тогда
	    СтрокаСообщение = ПолучитьТоварыПоОстаткамКатегория(Категория);
		Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
			Предупреждение(СтрокаСообщение, 60);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьТоварыПоОстаткамБриллианты()  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоВставкамБриллианты(Объект.Дата, Объект.Организация, Объект.Ломбард, Объект.Склад);
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
	    ДобавитьВТаблицуТоваров(ТаблицаЗапроса); 
		Возврат "";
	Иначе          
		Возврат "Изделия с бриллиантами на складе не найдены.";
	КонецЕсли;	
КонецФункции	


&НаКлиенте
Процедура ЗаполнитьПоВставкамБриллианты(Команда)   
	Если НЕ ЗначениеЗаполнено(Объект.Ломбард) Тогда  
		Сообщить("Выберите подразделение.", СтатусСообщения.Внимание);
		Возврат; 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Склад) Тогда  
		Сообщить("Выберите склад.", СтатусСообщения.Внимание);
		Возврат;	
	КонецЕсли;	

	СтрокаСообщение = ПолучитьТоварыПоОстаткамБриллианты();
	Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
		Предупреждение(СтрокаСообщение, 60);
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Функция ПолучитьТоварыПоОстаткамБезВставок()  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаБезВставок(Объект.Дата, Объект.Организация, Объект.Ломбард, Объект.Склад);
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
	    ДобавитьВТаблицуТоваров(ТаблицаЗапроса); 
		Возврат "";
	Иначе          
		Возврат "Изделия с без вставок на складе не найдены.";
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьБезВставок(Команда) 
	Если НЕ ЗначениеЗаполнено(Объект.Ломбард) Тогда  
		Сообщить("Выберите подразделение.", СтатусСообщения.Внимание);
		Возврат; 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Склад) Тогда  
		Сообщить("Выберите склад.", СтатусСообщения.Внимание);
		Возврат;	
	КонецЕсли;	

	СтрокаСообщение = ПолучитьТоварыПоОстаткамБезВставок();
	Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
		Предупреждение(СтрокаСообщение, 60);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьТоварыПоОстаткамДопМеталлы()  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоДопМеталлам(Объект.Дата, Объект.Организация, Объект.Ломбард, Объект.Склад);
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
	    ДобавитьВТаблицуТоваров(ТаблицаЗапроса); 
		Возврат "";
	Иначе          
		Возврат "Изделия с несколькими металлами на складе не найдены.";
	КонецЕсли;	
КонецФункции	


&НаКлиенте
Процедура ЗаполнитьПоДопМатериалам(Команда) 
	Если НЕ ЗначениеЗаполнено(Объект.Ломбард) Тогда  
		Сообщить("Выберите подразделение.", СтатусСообщения.Внимание);
		Возврат; 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Склад) Тогда  
		Сообщить("Выберите склад.", СтатусСообщения.Внимание);
		Возврат;	
	КонецЕсли;	

	СтрокаСообщение = ПолучитьТоварыПоОстаткамДопМеталлы();
	Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
		Предупреждение(СтрокаСообщение, 60);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьТоварыПоОстаткамГруппа(Группа)  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоГруппе(Объект.Дата, Объект.Организация, Объект.Ломбард, Объект.Склад, Группа);
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
	    ДобавитьВТаблицуТоваров(ТаблицаЗапроса); 
		Возврат "";
	Иначе          
		Возврат "Изделия с группой " + сокрЛП(Группа) + " на складе не найдены.";
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьПоГруппе(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ломбард) Тогда  
		Сообщить("Выберите подразделение.", СтатусСообщения.Внимание);
		Возврат; 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Склад) Тогда  
		Сообщить("Выберите склад.", СтатусСообщения.Внимание);
		Возврат;	
	КонецЕсли;	

	Группа = ПредопределенноеЗначение("Справочник.ЛБ_ГруппыОбъектовЗалога.ПустаяСсылка");
	Если ВвестиЗначение(Группа, "Введите группу") Тогда
	    СтрокаСообщение = ПолучитьТоварыПоОстаткамГруппа(Группа);
		Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
			Предупреждение(СтрокаСообщение, 60);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьСкидку() 
	Возврат ЛБ_УправлениеЛомбардом.ПолучитьСкидку(Объект.Дата, Перечисления.ЛБ_СкидкаВДокументах.УстановкаЦены, Объект.Ломбард);
КонецФункции	

&НаКлиенте
Процедура СкидкаУстановить(Команда)
	РезультатС = ПолучитьСкидку(); 
	Если РезультатС = неопределено Тогда  
		Предупреждение("Для документа «Установка цены» скидка не установлена", 60);
	Иначе	 
		Для каждого Стр Из ТаблицаТоваров Цикл 
			Если Стр.УчетнаяЦена = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Стр.ОтклонениеСкидки = РезультатС.Отклонение; 
			Стр.Скидка = РезультатС.Скидка;
			Если Стр.ОтклонениеСкидки = ПредопределенноеЗначение("Перечисление.ЛБ_ОтклонениеОтБазовойЦены.Абсолютное") Тогда  
				 Стр.ФактическаяЦена = Стр.УчетнаяЦена + Стр.Скидка;        
			ИначеЕсли Стр.ОтклонениеСкидки = ПредопределенноеЗначение("Перечисление.ЛБ_ОтклонениеОтБазовойЦены.Относительное") Тогда
				 Стр.ФактическаяЦена = Стр.УчетнаяЦена + Стр.УчетнаяЦена*Стр.Скидка/100;
			КонецЕсли;	
		КонецЦикла;	 
		ЗаполнитьИтоги();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СкидкаОтменить(Команда)
	Для каждого Стр Из ТаблицаТоваров Цикл 		
		Стр.ОтклонениеСкидки = ПредопределенноеЗначение("Перечисление.ЛБ_ОтклонениеОтБазовойЦены.ПустаяСсылка"); 
		Стр.Скидка = 0;  
		Стр.ФактическаяЦена = Стр.УчетнаяЦена;
	КонецЦикла;	
	ЗаполнитьИтоги();
КонецПроцедуры


&НаКлиенте
Процедура ПересчитатьФактическуюЦену()
	ТекСтрока = Элементы.ТаблицаТоваров.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда 
		Если ТекСтрока.ОтклонениеСкидки = ПредопределенноеЗначение("Перечисление.ЛБ_ОтклонениеОтБазовойЦены.Абсолютное") Тогда  
			 ТекСтрока.ФактическаяЦена = ТекСтрока.УчетнаяЦена + ТекСтрока.Скидка;        
		ИначеЕсли ТекСтрока.ОтклонениеСкидки = ПредопределенноеЗначение("Перечисление.ЛБ_ОтклонениеОтБазовойЦены.Относительное") Тогда
			 ТекСтрока.ФактическаяЦена = ТекСтрока.УчетнаяЦена + ТекСтрока.УчетнаяЦена*ТекСтрока.Скидка/100;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоваровОтклонениеСкидкиПриИзменении(Элемент)
	ПересчитатьФактическуюЦену();
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаТоваровСкидкаПриИзменении(Элемент)
	ПересчитатьФактическуюЦену();
КонецПроцедуры


&НаКлиенте
Процедура ОчиститьТаблицу(Команда)   
	ТаблицаТоваров.Очистить();   
	ЗаполнитьИтоги();
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаТоваровПослеУдаления(Элемент)
	ЗаполнитьИтоги();
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаТоваровПриИзменении(Элемент)
	ЗаполнитьИтоги();
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьСостояниеДокумента(); 
	ЭтаФорма.Заголовок = "Установка цены объектов залога № " + СокрЛП(Объект.ПредставлениеНомера) + " от " + Формат(Объект.Дата, "ДЛФ=DT");
КонецПроцедуры


&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЭтаФорма.Заголовок = "Установка цены объектов залога № " + СокрЛП(Объект.ПредставлениеНомера) + " от " + Формат(Объект.Дата, "ДЛФ=DT");
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если НЕ ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда 
		Если НЕ НачалоДня(ТекущийОбъект.Дата) = НачалоДня(ТекущаяДатаСеанса()) Тогда
			Если НЕ ЭтоСуперпользователь Тогда 
				 Сообщить("Пользователь имеет право проводить документ только текущей датой. Измените дату документа.", статуссообщения.Важное);
			     Отказ = Истина;
				 Возврат;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

