#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

/// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор  = "ПриказУстановкиВИП";
	КомандаПечати.Представление  = НСтр("ru = 'Приказ установки статуса ""ВИП""'");
	//КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати"; 
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор  = "ПриказОтмены";
	КомандаПечати.Представление  = НСтр("ru = 'Приказ отмены установки статуса ""ВИП""'");
КонецПроцедуры	

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// Устанавливаем признак доступности печати покомплектно.
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	// Проверяем, нужно ли для макета ЗаключениеОбОценке формировать табличный документ.
	//Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приказ") Тогда
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПриказУстановкиВИП") Тогда
		
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		//УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Приказ", "Приказ", 
		//ПечатьПриказа(МассивОбъектов, ОбъектыПечати));  
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПриказУстановкиВИП", "Приказ установки статуса ""ВИП""", 
		ПечатьПриказаУстановкиВИП(МассивОбъектов, ОбъектыПечати));  
    ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПриказОтмены") Тогда
	//ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Акция") Тогда
	//	
	//	// Формируем табличный документ и добавляем его в коллекцию печатных форм.
	//	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Акция", "Акция", 
	//	ПечатьАкции(МассивОбъектов, ОбъектыПечати)); 
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПриказОтмены", "Приказ отмены установки статуса ""ВИП""", 
		ПечатьПриказаОтменыВИП(МассивОбъектов, ОбъектыПечати));  
	КонецЕсли;
	
	//ОбщегоНазначенияБП.ЗаполнитьДополнительныеПараметрыПечати(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);	
	
КонецПроцедуры

Функция ПечатьПриказа(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_Приложение_К_Приказу"; 
		
	ВыборкаДанныеДокументов = ПолучитьВыборкуДанныхДокумента(МассивОбъектов);
	
	НаименованияОрганизации = НаименованиеОрганизации();
	НаименованиеОрганизацииСокращенное = НаименованияОрганизации.НаименованиеСокращенное;
	НаименованиеОрганизацииПолное      = НаименованияОрганизации.НаименованиеПолное;
	ДиректорФИО = ФИОДиректора();
		
	Если ВыборкаДанныеДокументов.Следующий() Тогда  
		
		ТаблицаРегистраторов = ПолучитьТаблицуРегистраторов(ВыборкаДанныеДокументов.СсылкаНаДокумент);   
		РегистраторыПоГруппам = ТаблицаРегистраторов.Скопировать();
		РегистраторыПоГруппам.Свернуть("Группа, РегистраторМеталлы, РегистраторВставки, РегистраторСтавки"); 
		Регистраторы = РегистраторыПоГруппам.Скопировать();
		Регистраторы.Свернуть("РегистраторМеталлы, РегистраторВставки, РегистраторСтавки"); 
		НомерПриложения = 0;      
		РегистраторыМеталлы = Новый СписокЗначений;  
		РегистраторыВставки = Новый СписокЗначений;
        РегистраторыСтавки = Новый СписокЗначений;
		
		Для каждого СтрР Из Регистраторы Цикл
			Если РегистраторыМеталлы.НайтиПоЗначению(СтрР.РегистраторМеталлы) = неопределено Тогда 
				РегистраторыМеталлы.Добавить(СтрР.РегистраторМеталлы);
			КонецЕсли;
			
			Если РегистраторыВставки.НайтиПоЗначению(СтрР.РегистраторВставки) = неопределено Тогда 
				РегистраторыВставки.Добавить(СтрР.РегистраторВставки);
			КонецЕсли;
			
			Если РегистраторыСтавки.НайтиПоЗначению(СтрР.РегистраторСтавки) = неопределено Тогда 
				РегистраторыСтавки.Добавить(СтрР.РегистраторСтавки);
			КонецЕсли;	
		КонецЦикла;	
		
		ТаблицаМеталловОбщая = ПолучитьВыборкуПрейскурантаЦен(РегистраторыМеталлы);
		ТаблицаМеталлов = ТаблицаМеталловОбщая.СкопироватьКолонки();
		ТаблицаВставкиОбщая = ПолучитьВыборкуПрейскурантаЦенВставки(РегистраторыВставки); 
		ТаблицаВставки = ТаблицаВставкиОбщая.СкопироватьКолонки();
		ТаблицаСтавокОбщая = ПолучитьВыборкуПрейскурантаСтавок(РегистраторыСтавки, ВыборкаДанныеДокументов.СсылкаНаДокумент.Дата);
		ТаблицаСтавок = ТаблицаСтавокОбщая.СкопироватьКолонки();
		
		СтруктураБазоваяЦенаМ = ПолучитьБазовыеЦеныМеталлы(ВыборкаДанныеДокументов.СсылкаНаДокумент.Дата);
		БазоваяКатегория = СтруктураБазоваяЦенаМ.Категория; 
		БазоваяПроба = СтруктураБазоваяЦенаМ.Проба;  

		Для каждого СтрРег Из Регистраторы Цикл  
			Если НЕ НомерПриложения = 0 Тогда
			    ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			НомерПриложения = НомерПриложения + 1;  
			ПриказНомер = ВыборкаДанныеДокументов.НомерПриказа + ?(Регистраторы.Количество() = 1, "", "-" + Строка(НомерПриложения));
			ПриказДата  = СтрШаблон("%1г.", Формат(ВыборкаДанныеДокументов.ДатаНачалаДействияПриказа, "ДЛФ = Д"));
			
			ОтборГ = новый Структура;  
			ОтборГ.Вставить("РегистраторМеталлы", СтрРег.РегистраторМеталлы);
			ОтборГ.Вставить("РегистраторВставки", СтрРег.РегистраторВставки); 
			ОтборГ.Вставить("РегистраторСтавки", СтрРег.РегистраторСтавки); 
			СтрокиГ = РегистраторыПоГруппам.НайтиСтроки(ОтборГ); 
			
			СтрокаЛомбардов = "";
			Для каждого СтрГ Из СтрокиГ Цикл
				ОтборР = новый Структура;  
				ОтборР.Вставить("Группа", СтрГ.Группа);
				ОтборР.Вставить("РегистраторМеталлы", СтрРег.РегистраторМеталлы);
				ОтборР.Вставить("РегистраторВставки", СтрРег.РегистраторВставки); 
				ОтборР.Вставить("РегистраторСтавки", СтрРег.РегистраторСтавки); 
				СтрокиР = ТаблицаРегистраторов.НайтиСтроки(ОтборР);   
				
				ГородЛомбардов = ?(ЗначениеЗаполнено(СтрГ.Группа), СокрЛП(СтрГ.Группа), "Вне групп"); 
				СтрокаЛомбардов = СтрокаЛомбардов + ?(ПустаяСтрока(СтрокаЛомбардов), "", "; ") + ГородЛомбардов;
				Ном = 0;   
				СтрокаЛомбарды = "";
				Для каждого СтрР из СтрокиР Цикл  
					СтрокаЛомбарды = СтрокаЛомбарды + ?(Ном = 0, "", ", ") + ?(ЗначениеЗаполнено(СтрР.Ломбард.НомерЛомбарда), "№ " +  СокрЛП(СтрР.Ломбард.НомерЛомбарда), СокрЛП(СтрР.Ломбард)); 
					Ном = Ном + 1;
				конеццикла;   
				СтрокаЛомбардов = СтрокаЛомбардов + " (" + СтрокаЛомбарды + ")"; 
			КонецЦикла;
			
			//СписокЛомбардов = новый СписокЗначений;
			//Для каждого СтрР из СтрокиР Цикл  
			//	СписокЛомбардов.Добавить(СтрР.Ломбард);
			//конеццикла;      
			//СтрокаЛомбарды = ПолучитьСтрокуЛомбардов(ВыборкаДанныеДокументов.СсылкаНаДокумент.Дата, СписокЛомбардов);
						
			//приказ
			Макет = ПолучитьМакет("ПФ_MXL_ШапкаПриказа");
			ПриказНомер = ВыборкаДанныеДокументов.НомерПриказа;
			ПриказДата  = СтрШаблон("%1г.", Формат(ВыборкаДанныеДокументов.ДатаНачалаДействияПриказа, "ДЛФ = Д"));
			Ломбарды    = ВыборкаДанныеДокументов.СтрокаЛомбарды;
			ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
			ОбластьТекст  = Макет.ПолучитьОбласть("Текст");         
			ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
			
			ОбластьШапка.Параметры.СокращенноеНаименованиеОрганизации = НаименованиеОрганизацииСокращенное;
			ОбластьШапка.Параметры.ПолноеНаименованиеОрганизации      = НаименованиеОрганизацииПолное; 
			ОбластьШапка.Параметры.НомерПриказа = ПриказНомер; 
			ОбластьШапка.Параметры.ДатаПриказа = ПриказДата;
					
			ТабличныйДокумент.Вывести(ОбластьШапка);
			
			ОбластьТекст.Параметры.НачальникОДО = ВыборкаДанныеДокументов.СсылкаНаДокумент.НачальникОДО;
			ОбластьТекст.Параметры.СокращенноеНаименованиеОрганизации          = НаименованиеОрганизацииСокращенное;
			ОбластьТекст.Параметры.НачальникОРБ              = ВыборкаДанныеДокументов.СсылкаНаДокумент.НачальникОРБ;  
			//ОбластьТекст.Параметры.ГородЛомбардов                              = ГородЛомбардов;
			ОбластьТекст.Параметры.СписокЛомбардовСАдресами                    = СтрокаЛомбардов;
			ОбластьТекст.Параметры.ДатаПриказа   = ПриказДата;
			ОбластьТекст.Параметры.Программа     = "Будет название программы";
			ОбластьТекст.Параметры.Ответственный = ВыборкаДанныеДокументов.Ответственный;
			
			ТабличныйДокумент.Вывести(ОбластьТекст);
			
			ОбластьПодвал.Параметры.Директор = ДиректорФИО;
			
			ТабличныйДокумент.Вывести(ОбластьПодвал);
			
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			//приложение к приказу
			Макет = ПолучитьМакет("ПФ_MXL_Приказ");
			
			ОтборМ = Новый Структура;
			ОтборМ.Вставить("Регистратор", СтрРег.РегистраторМеталлы); 
			СтрокиМ = ТаблицаМеталловОбщая.НайтиСтроки(ОтборМ); 
			ТаблицаМеталлов.Очистить();
			Для каждого стрМ из СтрокиМ Цикл
				НоваяСтрМ = ТаблицаМеталлов.Добавить();
			    ЗаполнитьЗначенияСвойств(НоваяСтрМ, стрМ);
			Конеццикла;	
       		//ТаблицаМеталлов = ПолучитьВыборкуПрейскурантаЦен(СтрРег.РегистраторМеталлы);  
			ТаблицаМеталлов.Сортировать("Категория, Металл, ГруппаМеталл Убыв");
			ТаблицаМ = ТаблицаМеталлов.Скопировать();
			ТаблицаМ.Свернуть("Металл");    
			ТаблицаГрупп = ТаблицаМеталлов.Скопировать();
			ТаблицаГрупп.Свернуть("Металл, ГруппаМеталл");
			КолГруппМ = ТаблицаГрупп.Количество();  
			
			
			ОтборВ = Новый Структура;
			ОтборВ.Вставить("Регистратор", СтрРег.РегистраторВставки); 
			СтрокиВ = ТаблицаВставкиОбщая.НайтиСтроки(ОтборВ); 
			ТаблицаВставки.Очистить();
			Для каждого стрВ из СтрокиВ Цикл
				НоваяСтрВ = ТаблицаВставки.Добавить();
			    ЗаполнитьЗначенияСвойств(НоваяСтрВ, стрВ);
			Конеццикла;	
			//ТаблицаВставки = ПолучитьВыборкуПрейскурантаЦенВставки(СтрРег.РегистраторВставки);  
			ТаблицаВ = ТаблицаВставки.Скопировать();  
			Отбор0 = Новый Структура;
			Отбор0.Вставить("ОбособленныйВыводПечать", Истина);    
			Строки0 = ТаблицаВ.НайтиСтроки(Отбор0);
			Для каждого Стр0 Из Строки0 Цикл 
				ТаблицаВ.Удалить(Стр0);
			Конеццикла;	
			ТаблицаВ.Свернуть("ВидОгранки, ФормаОгранки, КачествоОгранки");
			ТаблицаВ.Сортировать("ВидОгранки Убыв, КачествоОгранки");
            КолГруппВ = ТаблицаВ.Количество()*2;
			
			ОтборС = Новый Структура;
			ОтборС.Вставить("Регистратор", СтрРег.РегистраторСтавки); 
			СтрокиС = ТаблицаСтавокОбщая.НайтиСтроки(ОтборС); 
			ТаблицаСтавок.Очистить();
			Для каждого стрС из СтрокиС Цикл
				НоваяСтрС = ТаблицаСтавок.Добавить();
			    ЗаполнитьЗначенияСвойств(НоваяСтрС, стрС);
			Конеццикла;	
			//ТаблицаСтавок = ПолучитьВыборкуПрейскурантаСтавок(СтрРег.РегистраторСтавки);
			ТаблицаСК = ТаблицаСтавок.Скопировать();
			ТаблицаСК.Свернуть("СхемаКредитования, Срок");
			ТаблицаСК.Сортировать("СхемаКредитования, Срок");
			ТаблицаПоказатели = ТаблицаСтавок.Скопировать();   
			ТаблицаПоказатели.Сортировать("Категория, ПричинаПрименения, ДеньНачалаПрименения");
			Если СтрРег.РегистраторСтавки.НеВыводитьНаПечатьПричиныПрименения Тогда 
				ТаблицаПоказатели.Свернуть("СхемаКредитования, Срок, Категория, ДеньНачалаПрименения");
			Иначе	
			    ТаблицаПоказатели.Свернуть("СхемаКредитования, Срок, Категория, ПричинаПрименения, ДеньНачалаПрименения");
			КонецЕсли;	
			ТаблицаД = ТаблицаСтавок.Скопировать();
			ТаблицаД.Свернуть("ДиапазонСумм"); 
            КолГруппС = ТаблицаД.Количество() + 3; 
			
			
			КолГрупп = Макс(КолГруппМ, КолГруппВ, КолГруппС);
			Если КолГрупп = 0 Тогда
			    КолГрупп = 10;
			КонецЕсли;			
				
			// Формируем основную часть. 
			ОбластьШапка = Макет.ПолучитьОбласть("Шапка|КолонкаОсновная"); 
			ОбластьШапкаПусто = Макет.ПолучитьОбласть("Шапка|КолонкаШапкаПусто"); 
			ОбластьШапкаУтверждаю = Макет.ПолучитьОбласть("Шапка|КолонкаШапкаУтверждаю");  
			НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
			
			ОбластьШапка.Параметры.ДатаПриказа                        = ПриказДата;
			ОбластьШапка.Параметры.НомерПриказа                       = ПриказНомер; 
			ОбластьШапка.Параметры.СокращенноеНаименованиеОрганизации = НаименованиеОрганизацииСокращенное; 
			//ОбластьШапка.Параметры.ГородЛомбардов                     = ГородЛомбардов;
			ОбластьШапка.Параметры.НомераАдресовЛомбардов             = СтрокаЛомбардов;
			ТабличныйДокумент.Вывести(ОбластьШапка); 
			
			Для Сч = 1 По КолГрупп-1 Цикл  
				ТабличныйДокумент.Присоединить(ОбластьШапкаПусто);
			Конеццикла;        
			ОбластьШапкаУтверждаю.Параметры.Организация = НаименованиеОрганизацииСокращенное;
			ОбластьШапкаУтверждаю.Параметры.Директор     = ДиректорФИО;
			ТабличныйДокумент.Присоединить(ОбластьШапкаУтверждаю); 
						
			ТабличныйДокумент.Область(НомерСтр + 5, 1, НомерСтр + 5, КолГрупп).Объединить();
			ТабличныйДокумент.Область(НомерСтр + 6, 1, НомерСтр + 6, КолГрупп).Объединить();
			ТабличныйДокумент.Область(НомерСтр + 7, 1, НомерСтр + 7, КолГрупп).Объединить();
			ТабличныйДокумент.Область(НомерСтр + 8, 1, НомерСтр + 8, КолГрупп).Объединить();  
					
			//металлы    
			Если НЕ ТаблицаМеталлов.Количество() = 0  Тогда
				ОбластьШапкаОсн = Макет.ПолучитьОбласть("ШапкаОценкиМеталлов|КолонкаОсновная");
				ОбластьШапкаДоп = Макет.ПолучитьОбласть("ШапкаОценкиМеталлов|КолонкаДоп"); 
						
				НомерСтр = ТабличныйДокумент.ВысотаТаблицы + 1;
				НомерКолонкиНач = 3;
				ТабличныйДокумент.Вывести(ОбластьШапкаОсн);
				
				Ном = 0;
				Для каждого СтрМ Из ТаблицаМ Цикл          
					НомерКолонкиКон = НомерКолонкиНач;
					ОбластьШапкаДоп.Параметры.Металл = СтрМ.Металл;
					
					ОтборМ = Новый структура;
					ОтборМ.Вставить("Металл", СтрМ.Металл); 
					Строки = ТаблицаГрупп.НайтиСтроки(ОтборМ);
					Для каждого стр Из Строки Цикл  
						Ном = Ном + 1;
						ОбластьШапкаДоп.Параметры.Проба = Стр.ГруппаМеталл; 
						ТабличныйДокумент.Присоединить(ОбластьШапкаДоп);
						НомерКолонкиКон = НомерКолонкиКон + 1; 
						
						ОтборМ.Вставить("ГруппаМеталл", Стр.ГруппаМеталл);
						ТаблицаМеталлов.Найтистроки(ОтборМ);             
		 			КонецЦикла;
					
					ТабличныйДокумент.Область(НомерСтр, НомерКолонкиНач, НомерСтр, НомерКолонкиКон-1).Объединить(); 
					ТабличныйДокумент.Область(НомерСтр + 1, НомерКолонкиНач, НомерСтр + 1, НомерКолонкиКон-1).Объединить(); 
					НомерКолонкиНач = НомерКолонкиКон; 
				КонецЦикла;
				
				ОбластьСтрокаОсн = Макет.ПолучитьОбласть("СтрокаОценки|КолонкаОсновная");
				ОбластьСтрокаДоп = Макет.ПолучитьОбласть("СтрокаОценки|КолонкаДоп"); 
				ОбластьСтрокаБаза = Макет.ПолучитьОбласть("СтрокаОценки|КолонкаБаза");
				
				ТаблицаК = ТаблицаМеталлов.Скопировать();
				ТаблицаК.Свернуть("Категория");
						  
				Для каждого СтрК из ТаблицаК Цикл 
					ОтборК = Новый структура;  
					ОтборК.Вставить("Категория", СтрК.Категория); 
					ОбластьСтрокаОсн.Параметры.Категория = СтрК.Категория;
					ТабличныйДокумент.Вывести(ОбластьСтрокаОсн);

					Для каждого СтрМ Из ТаблицаМ Цикл  
						ОтборМ = Новый структура; 
						ОтборМ.Вставить("Металл", СтрМ.Металл);
						Строки = ТаблицаГрупп.НайтиСтроки(ОтборМ);
					    Для каждого стр Из Строки Цикл  
							ОтборК.Вставить("ГруппаМеталл", Стр.ГруппаМеталл);					
							СтрокиОсн = ТаблицаМеталлов.НайтиСтроки(ОтборК); 
							Если СтрокиОсн.Количество() = 0 Тогда
							    Цена = 0; 
								ЭтоБазоваяЦена = Ложь;
							Иначе
								Цена = СтрокиОсн.Получить(0).Цена; 
								Если БазоваяКатегория = СтрК.Категория И БазоваяПроба = СтрокиОсн.Получить(0).Проба Тогда
									ЭтоБазоваяЦена = Истина;
								Иначе
									ЭтоБазоваяЦена = Ложь;
								КонецЕсли;	
							КонецЕсли; 	
							Если ЭтоБазоваяЦена Тогда 
								ОбластьСтрокаБаза.Параметры.Цена = Цена; 
								ТабличныйДокумент.Присоединить(ОбластьСтрокаБаза);  
							Иначе	
								ОбластьСтрокаДоп.Параметры.Цена = Цена; 
								ТабличныйДокумент.Присоединить(ОбластьСтрокаДоп);  
							КонецЕсли;	
						КонецЦикла;	
					КонецЦикла;	
				Конеццикла;	 
				
				ОбластьПодвалМеталлы = Макет.ПолучитьОбласть("ПодвалМеталлы|КолонкаОсновная");
				
				ТекстМеталлы = "";   
				Если ЗначениеЗаполнено(ВыборкаДанныеДокументов.СсылкаНаДокумент.ШаблонМеталлы) Тогда
					ШаблонМеталлы = ВыборкаДанныеДокументов.СсылкаНаДокумент.ШаблонМеталлы;
				Иначе	                 
					СписокЛ = Новый СписокЗначений; 
					СписокЛ.Добавить(Справочники.ЛБ_Ломбарды.ПустаяСсылка());
					Для каждого Стр Из ВыборкаДанныеДокументов.СсылкаНаДокумент.Ломбарды цикл 
						СписокЛ.Добавить(Стр.Ломбард);
					Конеццикла;	
				    ШаблонМеталлы = ЛБ_ОбщийМодуль.ПолучитьТекущийШаблон(ВыборкаДанныеДокументов.СсылкаНаДокумент.Дата, Перечисления.ЛБ_ВидыПрейскурантов.Металлы, СписокЛ); 
				КонецЕсли;	
			    Если ЗначениеЗаполнено(ШаблонМеталлы) Тогда
			    	ИнформацияМеталлы = ШаблонМеталлы.ДопИнформацияМеталлы.Получить(); 
			    	
			    	ТекстHTML = "";
			    	Вложения = Новый Структура;
			    	ИнформацияМеталлы.ПолучитьHTML(ТекстHTML, Вложения);
			    	
			    	ТекстМеталлы = СтроковыеФункцииКлиентСервер.ИзвлечьТекстИзHTML(ТекстHTML); 			
				КонецЕсли;    	
				Если ПустаяСтрока(ТекстМеталлы) Тогда 
					ТабличныйДокумент.Вывести(ОбластьПодвалМеталлы);
				Иначе            
					Для Счетчик = 1 По СтрЧислоСтрок(ТекстМеталлы) Цикл
					   ТекСтрока = СтрПолучитьСтроку(ТекстМеталлы, Счетчик);
					   ОбластьПодвалМеталлы.Параметры.ИнформацияМеталлы = ТекСтрока;
				       ТабличныйДокумент.Вывести(ОбластьПодвалМеталлы);	
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;	
			
			//вставки   			
			ОбластьШапка = Макет.ПолучитьОбласть("ШапкаВставки");
			ТабличныйДокумент.Вывести(ОбластьШапка);
			
			Если НЕ ТаблицаВставки.Количество() = 0 Тогда
				ОбластьШапкаОсн = Макет.ПолучитьОбласть("ШапкаОценкиВставки|КолонкаОсновная");
				ОбластьШапкаДоп = Макет.ПолучитьОбласть("ШапкаОценкиВставки|КолонкаДопВ"); 
						
				ОбластьШапкаОсн.Параметры.ТекстВставки = "Качественные природные бриллианты круглой огранки (КР-57, КР-17) в изделиях 1 и 2 категории, а также некоторые виды бриллиантов фантазийной огранки:" + Символы.ПС +
				       "овал, груша, сердце, маркиз, принцесса, радиант, триллиант в юверирных изделиях 1, 2 и 3 категории оцениваются по следующим расценкам:";
				НомерСтр = ТабличныйДокумент.ВысотаТаблицы + 2;
				НомерКолонкиНач = 3;  
				НомерКолонкиКон = НомерКолонкиНач;
				
				Ном = 0;  
				ТабличныйДокумент.Вывести(ОбластьШапкаОсн);
				Для каждого СтрВ Из ТаблицаВ Цикл   
					Если ЗначениеЗаполнено(СтрВ.ВидОгранки) Тогда
					    ОбластьШапкаДоп.Параметры.ВидОгранки = СокрЛП(СтрВ.ВидОгранки) + символы.ПС + "(руб/карат)";
					Иначе
						ОбластьШапкаДоп.Параметры.ВидОгранки = СокрЛП(СтрВ.ФормаОгранки) + символы.ПС + "(руб/карат)";
					КонецЕсли;	
					ОбластьШапкаДоп.Параметры.КачествоОгранки = СтрВ.КачествоОгранки;
					ТабличныйДокумент.Присоединить(ОбластьШапкаДоп);
					НомерКолонкиКон = НомерКолонкиКон + 2; 
		      	КонецЦикла;   
				ТабличныйДокумент.Область(НомерСтр, НомерКолонкиНач, НомерСтр, НомерКолонкиКон-1).Объединить();
				
				ОбластьСтрокаОсн = Макет.ПолучитьОбласть("СтрокаВставки|КолонкаОсновная");
				ОбластьСтрокаДоп = Макет.ПолучитьОбласть("СтрокаВставки|КолонкаДопВ"); 
				
				ТаблицаК = ТаблицаВставки.Скопировать();
				ТаблицаК.Свернуть("ВесоваяГруппа");
						  
				Для каждого СтрК из ТаблицаК Цикл 
					ОбластьСтрокаОсн.Параметры.ВесоваяГруппа = СтрК.ВесоваяГруппа;
					ТабличныйДокумент.Вывести(ОбластьСтрокаОсн);
					
					Для каждого СтрВ Из ТаблицаВ Цикл  
						ОтборК = Новый структура;  
					    ОтборК.Вставить("ВесоваяГруппа", СтрК.ВесоваяГруппа); 
						//Если ЗначениеЗаполнено(СтрВ.ВидОгранки) Тогда
						//    ОтборК.Вставить("ВидОгранки", СтрВ.ВидОгранки);  
						//Иначе  
						//	ОтборК.Вставить("ФормаОгранки", СтрВ.ФормаОгранки); 
						//КонецЕсли;	
						ОтборК.Вставить("ВидОгранки", СтрВ.ВидОгранки);  
						ОтборК.Вставить("ФормаОгранки", СтрВ.ФормаОгранки); 
						ОтборК.Вставить("КачествоОгранки", СтрВ.КачествоОгранки);
						Строки = ТаблицаВставки.НайтиСтроки(ОтборК);
				  		Если Строки.Количество() = 0 Тогда
						    Цена = 0; 
						Иначе
							Цена = Строки.Получить(0).Цена; 
						КонецЕсли; 	
						ОбластьСтрокаДоп.Параметры.Цена = Цена; 
						ТабличныйДокумент.Присоединить(ОбластьСтрокаДоп);  
					КонецЦикла;	
				Конеццикла;	 
				
				ОбластьПодвалВставки = Макет.ПолучитьОбласть("ПодвалВставки|КолонкаОсновная");
				
				//ТекстВставки = ""; 
				ЦенаОбособленныйУчет = 0;
				Отбор0 = Новый Структура;
				Отбор0.Вставить("ОбособленныйВыводПечать", Истина);    
				Строки0 = ТаблицаВставки.НайтиСтроки(Отбор0);
				Для каждого Стр0 Из Строки0 Цикл 
					Если НЕ стр0.Цена = 0 Тогда
						ЦенаОбособленныйУчет = стр0.Цена;
						Прервать;
					КонецЕсли;	
				Конеццикла;	
             	ТекстЦенаВ = Формат(ЦенаОбособленныйУчет, "ЧЦ=10; ЧДЦ=2; ЧРД=-; ЧН=00");
				ТекстВставки = "Природные бриллианты круглой формы огранки в виде вставок в ювелирные изделия 3 категории РФ, а также в изделиях 1,2,3 категории иностранного " + Символы.ПС + 
				   " производства (""импорт"") оцениваются, как ""граненые"", в размере " + ТекстЦенаВ +  " рублей за карат.";
				ОбластьПодвалВставки.Параметры.ИнформацияВставки = ТекстВставки;
				ТабличныйДокумент.Вывести(ОбластьПодвалВставки);
				//ШаблонВставки = ЛБ_ОбщийМодуль.ПолучитьТекущийШаблон(ВыборкаДанныеДокументов.СсылкаНаДокумент.Дата, Перечисления.ЛБ_ВидыПрейскурантов.Вставки);  
				//Если НЕ ШаблонВставки = неопределено Тогда
				//	ИнформацияВставки = ШаблонВставки.ДопИнформацияВставки.Получить(); 
				//	
				//	ТекстHTML = "";
				//	Вложения = Новый Структура;
				//	ИнформацияВставки.ПолучитьHTML(ТекстHTML, Вложения);
				//	
				//	ТекстВставки = СтроковыеФункцииКлиентСервер.ИзвлечьТекстИзHTML(ТекстHTML); 			
				//КонецЕсли;    	
				//Если ПустаяСтрока(ТекстВставки) Тогда 
				//	ТабличныйДокумент.Вывести(ОбластьПодвалВставки);
				//Иначе            
				//	Для Счетчик = 1 По СтрЧислоСтрок(ТекстВставки) Цикл
				//	   ТекСтрока = СтрПолучитьСтроку(ТекстВставки, Счетчик);
				//	   ОбластьПодвалВставки.Параметры.ИнформацияВставки = ТекСтрока;
				//       ТабличныйДокумент.Вывести(ОбластьПодвалВставки);	
				//	КонецЦикла;
				//КонецЕсли;	
			КонецЕсли;	
			
			//процентные ставки  
			ОбластьШапка = Макет.ПолучитьОбласть("ШапкаСтавки");
			ТабличныйДокумент.Вывести(ОбластьШапка);
			
			Если НЕ ТаблицаСтавок.Количество() = 0 Тогда
				НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
				
				ОбластьШапкаОсн = Макет.ПолучитьОбласть("ШапкаОценкиСтавки|КолонкаОсновная");
				ОбластьШапкаДоп = Макет.ПолучитьОбласть("ШапкаОценкиСтавки|КолонкаДоп");	
				ОбластьШапкаСтавка = Макет.ПолучитьОбласть("ШапкаОценкиСтавки|КолонкаСтавка"); 
				
				ТабличныйДокумент.Вывести(ОбластьШапкаОсн); 
				
				ОбластьШапкаДоп.Параметры.Показатель = "Срок";
				ТабличныйДокумент.Присоединить(ОбластьШапкаДоп);
				
				Если НЕ СтрРег.РегистраторСтавки.НеВыводитьНаПечатьПричиныПрименения Тогда 
					ОбластьШапкаДоп.Параметры.Показатель = "Причина применения";
					ТабличныйДокумент.Присоединить(ОбластьШапкаДоп);    
				КонецЕсли;	
				
				ОбластьШапкаДоп.Параметры.Показатель = "День начала применения";
				ТабличныйДокумент.Присоединить(ОбластьШапкаДоп);
				
				Для каждого СтрД из ТаблицаД Цикл
					ОбластьШапкаСтавка.Параметры.Диапазон = СтрД.ДиапазонСумм;
				    ТабличныйДокумент.Присоединить(ОбластьШапкаСтавка);
				Конеццикла;  
				
				НомерСтр = НомерСтр + 1;  
				НомерКолонкиНач = 3;
				НомерКолонкиКон = НомерКолонкиНач + ТаблицаД.Количество() + ?(СтрРег.РегистраторСтавки.НеВыводитьНаПечатьПричиныПрименения, 1, 2);
				ТабличныйДокумент.Область(НомерСтр, НомерКолонкиНач, НомерСтр, НомерКолонкиКон).Объединить();   
				
				ОбластьЗайм = Макет.ПолучитьОбласть("Займ|КолонкаОсновная");
				ОбластьСтрокаОсн = Макет.ПолучитьОбласть("СтрокаСтавка|КолонкаОсновная");
				ОбластьСтрокаДоп = Макет.ПолучитьОбласть("СтрокаСтавка|КолонкаДоп");	
				ОбластьСтрокаСтавка = Макет.ПолучитьОбласть("СтрокаСтавка|КолонкаСтавка"); 
				
				Ном = 0;
				Для каждого СтрК из ТаблицаСК Цикл
					Ном = Ном + 1;
					ОбластьЗайм.Параметры.Ном = Строка(Ном);
					ОбластьЗайм.Параметры.Займ = СокрЛП(СтрК.СхемаКредитования);
					ТабличныйДокумент.Вывести(ОбластьЗайм);   
					
					НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
					НомерКолонкиКон = ТаблицаД.Количество() + ?(СтрРег.РегистраторСтавки.НеВыводитьНаПечатьПричиныПрименения, 4, 5); 
					ТабличныйДокумент.Область(НомерСтр, 1, НомерСтр, НомерКолонкиКон).Объединить();
					ТабличныйДокумент.Область(НомерСтр, 1, НомерСтр, НомерКолонкиКон).ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
					
					Отбор = Новый Структура;
					Отбор.Вставить("СхемаКредитования", СтрК.СхемаКредитования);
					СтрокиП = ТаблицаПоказатели.НайтиСтроки(Отбор);
					Для каждого СтрП Из СтрокиП Цикл 
						ОбластьСтрокаОсн.Параметры.Категория = СтрП.Категория; 
						ТабличныйДокумент.Вывести(ОбластьСтрокаОсн);
						
						ОбластьСтрокаДоп.Параметры.ЗначениеП = СтрП.Срок; 
						ТабличныйДокумент.Присоединить(ОбластьСтрокаДоп);
						
						Если НЕ СтрРег.РегистраторСтавки.НеВыводитьНаПечатьПричиныПрименения Тогда 
							ОбластьСтрокаДоп.Параметры.ЗначениеП = СтрП.ПричинаПрименения; 
							ТабличныйДокумент.Присоединить(ОбластьСтрокаДоп);   
						КонецЕсли;	
						
						ОбластьСтрокаДоп.Параметры.ЗначениеП = СтрП.ДеньНачалаПрименения; 
						ТабличныйДокумент.Присоединить(ОбластьСтрокаДоп);
						
						Отбор.Вставить("Категория", СтрП.Категория);  
						Если СтрРег.РегистраторСтавки.НеВыводитьНаПечатьПричиныПрименения Тогда 
							Отбор.Вставить("ПричинаПрименения", Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма);
						Иначе	
						    Отбор.Вставить("ПричинаПрименения", СтрП.ПричинаПрименения);  
						КонецЕсли;	
						Отбор.Вставить("ДеньНачалаПрименения", СтрП.ДеньНачалаПрименения);
						
						Для каждого СтрД из ТаблицаД Цикл 
							Отбор.Вставить("ДиапазонСумм", СтрД.ДиапазонСумм); 
							Строки  = ТаблицаСтавок.НайтиСтроки(Отбор);
							Если Строки.Количество() = 0 Тогда
								Ставка = 0;
							Иначе     
								Ставка = Строки.Получить(0).Ставка;
							КонецЕсли;	
							ОбластьСтрокаСтавка.Параметры.Ставка = Ставка;
						    ТабличныйДокумент.Присоединить(ОбластьСтрокаСтавка);
						Конеццикла;  

					Конеццикла;	
				КонецЦикла;	
			КонецЕсли;	
		Конеццикла;	
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции     

Функция ПечатьАкции(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_Акция"; 
		
	ВыборкаДанныеДокументов = ПолучитьВыборкуДанныхДокумента(МассивОбъектов);
	
	НаименованияОрганизации = НаименованиеОрганизации();
	НаименованиеОрганизацииСокращенное = НаименованияОрганизации.НаименованиеСокращенное;
	НаименованиеОрганизацииПолное      = НаименованияОрганизации.НаименованиеПолное;
			
	Если ВыборкаДанныеДокументов.Следующий() Тогда  
		
		ТаблицаСтавок = ПолучитьВыборкуПрейскурантаСтавокАкция(ВыборкаДанныеДокументов.СсылкаНаДокумент);
		ТаблицаСК = ТаблицаСтавок.Скопировать();
		ТаблицаСК.Свернуть("СхемаКредитования");
		ТаблицаСК.Сортировать("СхемаКредитования");
		ТаблицаПоказатели = ТаблицаСтавок.Скопировать();
		ТаблицаПоказатели.Свернуть("СхемаКредитования, Категория, ПричинаПрименения");
		ТаблицаПоказатели.Сортировать("Категория, ПричинаПрименения");
		ТаблицаД = ТаблицаСтавок.Скопировать();
		ТаблицаД.Свернуть("ДиапазонСумм"); 
		
		СписокЛомбардов = Новый СписокЗначений;  
		Для каждого Стр Из ВыборкаДанныеДокументов.СсылкаНаДокумент.Ломбарды Цикл 
			СписокЛомбардов.Добавить(Стр.Ломбард);
		Конеццикла;	           
		Если ВыборкаДанныеДокументов.СсылкаНаДокумент.ВыводитьЛомбарды = 0 Тогда 
			ЛомбардыОтделения = "ломбардах";
		    СтрокаЛомбарды = ПолучитьСтрокуЛомбардов(ВыборкаДанныеДокументов.СсылкаНаДокумент.Дата, СписокЛомбардов); 
		Иначе    
			ЛомбардыОтделения = "отделениях ломбардов";
			СтрокаЛомбарды = ПолучитьСтрокуОтделенийЛомбардов(ВыборкаДанныеДокументов.СсылкаНаДокумент.Дата, СписокЛомбардов);
		КонецЕсли;	
		
		Макет = ПолучитьМакет("ПФ_MXL_Акция");
		ПриказНомер = ВыборкаДанныеДокументов.НомерПриказа;
		ПриказДата  = СтрШаблон("%1 г.", Формат(ВыборкаДанныеДокументов.ДатаНачалаДействияПриказа, "ДЛФ=Д"));
		Ломбарды    = ВыборкаДанныеДокументов.СтрокаЛомбарды; 
		Акция = ВыборкаДанныеДокументов.Акция;
		ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
		ОбластьТекст  = Макет.ПолучитьОбласть("ТекстПриказаЧасть1"); 
		ОбластьТекст2  = Макет.ПолучитьОбласть("ТекстПриказаЧасть2"); 
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		
		ОбластьШапка.Параметры.СокращенноеНаименованиеОрганизации = НаименованиеОрганизацииСокращенное;
		ОбластьШапка.Параметры.ПолноеНаименованиеОрганизации      = НаименованиеОрганизацииПолное; 
		ОбластьШапка.Параметры.НомерПриказа = ПриказНомер; 
		ОбластьШапка.Параметры.ДатаПриказа = ПриказДата;  
		ОбластьШапка.Параметры.Акция = Акция;
				
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		ОбластьТекст.Параметры.Акция = Акция;
		ОбластьТекст.Параметры.ЛомбардыОтделения = ЛомбардыОтделения;
	    ОбластьТекст.Параметры.СписокЛомбардовСАдресами                    = СтрокаЛомбарды;
		ОбластьТекст.Параметры.ДатаПриказа   = ПриказДата; 
		ОбластьТекст.Параметры.НачальникОРБ = ВыборкаДанныеДокументов.СсылкаНаДокумент.НачальникОРБ; 
					
		ТабличныйДокумент.Вывести(ОбластьТекст);
		
		//процентные ставки  
		Если НЕ ТаблицаСтавок.Количество() = 0 Тогда
			НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
			
			ОбластьШапкаОсн = Макет.ПолучитьОбласть("ШапкаОценкиСтавки|КолонкаОсновная");
			ОбластьШапкаДоп = Макет.ПолучитьОбласть("ШапкаОценкиСтавки|КолонкаДоп");	
			ОбластьШапкаСтавка = Макет.ПолучитьОбласть("ШапкаОценкиСтавки|КолонкаСтавка"); 
			
			ТабличныйДокумент.Вывести(ОбластьШапкаОсн);
			ОбластьШапкаДоп.Параметры.Показатель = "Причина применения";
			ТабличныйДокумент.Присоединить(ОбластьШапкаДоп);
							
			Для каждого СтрД из ТаблицаД Цикл
				ОбластьШапкаСтавка.Параметры.Диапазон = СтрД.ДиапазонСумм;
			    ТабличныйДокумент.Присоединить(ОбластьШапкаСтавка);
			Конеццикла;  
			
			НомерСтр = НомерСтр + 1;  
			НомерКолонкиНач = 4;
			НомерКолонкиКон = НомерКолонкиНач + ТаблицаД.Количество();
			ТабличныйДокумент.Область(НомерСтр, НомерКолонкиНач, НомерСтр, НомерКолонкиКон).Объединить(); 
						
			ОбластьЗайм = Макет.ПолучитьОбласть("Займ|КолонкаОсновная");
			ОбластьСтрокаОсн = Макет.ПолучитьОбласть("СтрокаСтавка|КолонкаОсновная");
			ОбластьСтрокаДоп = Макет.ПолучитьОбласть("СтрокаСтавка|КолонкаДоп");	
			ОбластьСтрокаСтавка = Макет.ПолучитьОбласть("СтрокаСтавка|КолонкаСтавка"); 
			
			Ном = 0;
			Для каждого СтрК из ТаблицаСК Цикл
				Ном = Ном + 1;
				ОбластьЗайм.Параметры.Ном = Строка(Ном);
				ОбластьЗайм.Параметры.Займ = СокрЛП(СтрК.СхемаКредитования);
				ТабличныйДокумент.Вывести(ОбластьЗайм);   
				
				НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
				НомерКолонкиКон = ТаблицаД.Количество() + 4; 
				ТабличныйДокумент.Область(НомерСтр, 2, НомерСтр, НомерКолонкиКон).Объединить();  
				
				Отбор = Новый Структура;
				Отбор.Вставить("СхемаКредитования", СтрК.СхемаКредитования);
				СтрокиП = ТаблицаПоказатели.НайтиСтроки(Отбор);
				Для каждого СтрП Из СтрокиП Цикл 
					ОбластьСтрокаОсн.Параметры.Категория = СтрП.Категория; 
					ТабличныйДокумент.Вывести(ОбластьСтрокаОсн);  
					
					ОбластьСтрокаДоп.Параметры.ЗначениеП = СтрП.ПричинаПрименения; 
					ТабличныйДокумент.Присоединить(ОбластьСтрокаДоп);
											
					Отбор.Вставить("Категория", СтрП.Категория);
					Отбор.Вставить("ПричинаПрименения", СтрП.ПричинаПрименения);
					Для каждого СтрД из ТаблицаД Цикл 
						Отбор.Вставить("ДиапазонСумм", СтрД.ДиапазонСумм); 
						Строки  = ТаблицаСтавок.НайтиСтроки(Отбор);
						Если Строки.Количество() = 0 Тогда
							Ставка = 0;
						Иначе     
							Ставка = Строки.Получить(0).Ставка;
						КонецЕсли;	
						ОбластьСтрокаСтавка.Параметры.Ставка = Ставка;
					    ТабличныйДокумент.Присоединить(ОбластьСтрокаСтавка);
					Конеццикла;  

				Конеццикла;	
			КонецЦикла;	
		КонецЕсли;	 
				
		ОбластьТекст2.Параметры.ДатаПриказа = ПриказДата;
		ОбластьТекст2.Параметры.ДатаНачалаДействияПриказа = СтрШаблон("%1 г.", Формат(ВыборкаДанныеДокументов.ДатаНачалаДействияПриказа, "ДФ=dd.MM.yyyy"));
		ОбластьТекст2.Параметры.ДатаОкончанияДействияПриказа = СтрШаблон("%1 г.", Формат(ВыборкаДанныеДокументов.ДатаОкончанияДействияПриказа, "ДФ=dd.MM.yyyy"));  
		ОбластьТекст2.Параметры.ОтветственноеЛицоОРБ = ВыборкаДанныеДокументов.СсылкаНаДокумент.ОтветственноеЛицоОРБ;
		ОбластьТекст2.Параметры.ОтветственноеЛицоРеклама = ВыборкаДанныеДокументов.СсылкаНаДокумент.ОтветственноеЛицоРеклама; 
		ТабличныйДокумент.Вывести(ОбластьТекст2); 
		
		ОбластьПодвал.Параметры.ПодписантДолжность = ВыборкаДанныеДокументов.СсылкаНаДокумент.ПодписантДолжность;
		ОбластьПодвал.Параметры.ПодписантФИО = ВыборкаДанныеДокументов.СсылкаНаДокумент.ПодписантФИО;
		ТабличныйДокумент.Вывести(ОбластьПодвал);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции     

Функция ПечатьПриказаУстановкиВИП(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ПриказУстановкиВИП";
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	//ТабличныйДокумент.Защита = Истина;
		
	ВыборкаДанныеДокументов = ПолучитьВыборкуДанныхДокумента(МассивОбъектов);
	
	ТЗЗалогодателиБезУсловий = Новый ТаблицаЗначений;
	ТЗЗалогодателиБезУсловий.Колонки.Добавить("Залогодатель");
	
	ТЗЗалогодателиСУсловиями = Новый ТаблицаЗначений;
	ТЗЗалогодателиСУсловиями.Колонки.Добавить("Залогодатель");
	ТЗЗалогодателиСУсловиями.Колонки.Добавить("ИспользуютсяСтавки");
	ТЗЗалогодателиСУсловиями.Колонки.Добавить("ИспользуютсяМаталлы");
	ТЗЗалогодателиСУсловиями.Колонки.Добавить("ИспользуютсяВставки");
	ТЗЗалогодателиСУсловиями.Колонки.Добавить("ДокументСтавки");
	ТЗЗалогодателиСУсловиями.Колонки.Добавить("ДокументМеталлы");
	ТЗЗалогодателиСУсловиями.Колонки.Добавить("ДокументВставки");
	
	МассивУдаления = Новый Массив;
	
	Если ВыборкаДанныеДокументов.Следующий() Тогда  
		
		ТЗЗалогодатели = ВыборкаДанныеДокументов.Залогодатели.Выгрузить();

		Для каждого СтрЗ Из ТЗЗалогодатели Цикл
			//СтруктураВозврата = ПроверитьСтатусКлиентаВИП(НачалоДня(ВыборкаДанныеДокументов.СсылкаНаДокумент.Дата), СтрЗ.Залогодатель);
			СтруктураВозврата = ПроверитьСтатусКлиентаВИП(ВыборкаДанныеДокументов.СсылкаНаДокумент.Дата - 1, СтрЗ.Залогодатель);
			
			Если НЕ СтруктураВозврата.ИспользуютсяСтавки И НЕ СтруктураВозврата.ИспользуютсяМаталлы И НЕ СтруктураВозврата.ИспользуютсяВставки Тогда
				НоваяСтрБез = ТЗЗалогодателиБезУсловий.Добавить();
				НоваяСтрБез.Залогодатель = СтрЗ.Залогодатель;
			КонецЕсли;
			
			Если СтруктураВозврата.ИспользуютсяСтавки ИЛИ СтруктураВозврата.ИспользуютсяМаталлы ИЛИ СтруктураВозврата.ИспользуютсяВставки Тогда

				НоваяСтрБез = ТЗЗалогодателиСУсловиями.Добавить();
				НоваяСтрБез.Залогодатель = СтрЗ.Залогодатель;
				НоваяСтрБез.ИспользуютсяСтавки = СтруктураВозврата.ИспользуютсяСтавки;
				НоваяСтрБез.ИспользуютсяМаталлы = СтруктураВозврата.ИспользуютсяМаталлы;
				НоваяСтрБез.ИспользуютсяВставки = СтруктураВозврата.ИспользуютсяВставки;
				НоваяСтрБез.ДокументСтавки = СтруктураВозврата.ДокументСтавки;
				НоваяСтрБез.ДокументМеталлы = СтруктураВозврата.ДокументМеталлы;
				НоваяСтрБез.ДокументВставки = СтруктураВозврата.ДокументВставки;
			
			КонецЕсли;
		КонецЦикла;
		
		ТЗСтавки = ВыборкаДанныеДокументов.СтавкиПроцентов.Выгрузить();
		ТЗМеталлы = ВыборкаДанныеДокументов.НастройкаОтклоненийОтБазовыхЦенМеталлы.Выгрузить();
		ТЗВставки = ВыборкаДанныеДокументов.НастройкаОтклоненийОтБазовыхЦенВставки.Выгрузить();
		ТЗСК = ВыборкаДанныеДокументов.СхемыКредитования.Выгрузить();
		
		ТЗСК.Сортировать("СхемаКредитования Возр");
		
		//Удаляем строки без отклонений
		МассивУдаленияСтрокТЗМ = Новый Массив;
		
		Для каждого СтрМ Из ТЗМеталлы Цикл
			Если НЕ ЗначениеЗаполнено(СтрМ.ОтклонениеОтБазовойЦены) Тогда
				МассивУдаленияСтрокТЗМ.Добавить(СтрМ);
			КонецЕсли;
		КонецЦикла;
		
		Если МассивУдаленияСтрокТЗМ.Количество() > 0 Тогда
			Для каждого СтрМ Из МассивУдаленияСтрокТЗМ Цикл
				ТЗМеталлы.Удалить(СтрМ);
			КонецЦикла;
		КонецЕсли;
		
		МассивУдаленияСтрокТЗМ.Очистить();
		
		Для каждого СтрС Из ТЗСтавки Цикл
			Если СтрС.Ставка = 0 Тогда
				МассивУдаленияСтрокТЗМ.Добавить(СтрС);
			КонецЕсли;			
		КонецЦикла;

		Если МассивУдаленияСтрокТЗМ.Количество() > 0 Тогда
			Для каждого СтрМ Из МассивУдаленияСтрокТЗМ Цикл
				ТЗСтавки.Удалить(СтрМ);
			КонецЦикла;
		КонецЕсли;
		
		МаксКолСтавки = 0;
		МаксКолВставки = 0;
		
		ТЗКолСтавки = ТЗСтавки.Скопировать(, "СхемаКредитования");
		ТЗКолСтавки.Свернуть("СхемаКредитования");
		ТЗКолСтавки.Сортировать("СхемаКредитования Возр");
		
		ТЗКолВставки = ТЗВставки.Скопировать(, "СхемаКредитования");
		ТЗКолВставки.Свернуть("СхемаКредитования");
		ТЗКолВставки.Сортировать("СхемаКредитования Возр");
		
		Для каждого СтрКолС Из ТЗКолСтавки Цикл
			Отбор = Новый Структура;
			Отбор.Вставить("СхемаКредитования", СтрКолС.СхемаКредитования);
			
			МСтрокС = ТЗСтавки.НайтиСтроки(Отбор);
			
			МаксКолСтавки = Макс(МаксКолСтавки, МСтрокС.Количество());
		КонецЦикла;
		
		Для каждого СтрКолВ Из ТЗКолВставки Цикл
			Отбор = Новый Структура;
			Отбор.Вставить("СхемаКредитования", СтрКолВ.СхемаКредитования);
			
			МСтрокВ = ТЗВставки.НайтиСтроки(Отбор);
			
			МаксКолВставки = Макс(МаксКолВставки, МСтрокВ.Количество());
		КонецЦикла;
		
		//КолКолонок = Макс(ТЗСтавки.Количество(), ТЗВставки.Количество());
		КолКолонок = Макс(МаксКолСтавки, МаксКолВставки);
		ДобавитьКолонок = ?(МаксКолВставки > 4, 4, 3);
		
		Если КолКолонок < 10 Тогда
			КолКолонок = 10;
		КонецЕсли;
		
		ПорядковыйНомер = 0;
		
		Если ТЗЗалогодателиБезУсловий.Количество() > 0 Тогда
			
			ТЗДанныеЗалогодателя = ПолучитьДанныеЗалогодателя(ТЗЗалогодателиБезУсловий.Скопировать(, "Залогодатель"), НачалоДня(ВыборкаДанныеДокументов.СсылкаНаДокумент.Дата));
			
			Макет = ПолучитьМакет("ПФ_MXL_ПриказУстановкиВИП");
			
			// Формируем основную часть. 
			ОбластьШапка = Макет.ПолучитьОбласть("Шапка|КолонкаОсновная");
			ОбластьШапкаПусто = Макет.ПолучитьОбласть("Шапка|КолонкаШапкаПусто");
			ОбластьШапкаНомер = Макет.ПолучитьОбласть("Шапка|КолонкаШапкаНомер");
			ОбластьШапкаТекст = Макет.ПолучитьОбласть("ТекстЗаемщик|КолонкаОсновная");
			ОбластьШапкаЗ = Макет.ПолучитьОбласть("ШапкаЗаемщик|КолонкаОсновная");
			НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
			
			ОбластьШапка.Параметры.ДатаПриказа = Формат(ВыборкаДанныеДокументов.СсылкаНаДокумент.Дата, "ДФ=dd.MM.yyyy") + " г.";
			СклонениеОтделения = ПолучитьСклоненияСтроки(ВыборкаДанныеДокументов.Отделение.Наименование, "Л=ru_RU", "ПД=Родительный");

			Если СклонениеОтделения.Количество() > 0 Тогда
				ОбластьШапка.Параметры.Отделение = СклонениеОтделения[0];
			КонецЕсли;
			
			//ПолНачальника = ПолучитьДанныеЗалогодателя(ВыборкаДанныеДокументов.НачальникОтделения, НачалоДня(ВыборкаДанныеДокументов.СсылкаНаДокумент.Дата));
			ОбластьШапка.Параметры.ФИОНачальника = СклонениеПредставленийОбъектов.ПросклонятьФИО(
				ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаДанныеДокументов.НачальникОтделения.Наименование), 2,,);
				
			//Убрал пол т.к. по сотрудникам нет этой информации.
				//ВыборкаДанныеДокументов.НачальникОтделения, ?(ПолНачальника = Перечисления.ПолФизическогоЛица.Мужской, 1, 2));
			//
			
			ОбластьШапка.Параметры.ПериодДействия = ?(ВыборкаДанныеДокументов.ДатаОкончанияДействияПриказа = Дата(1,1,1),
			"с " + Формат(ВыборкаДанныеДокументов.ДатаНачалаДействияПриказа, "ДФ=dd.MM.yyyy") + " г.",
			"на период с " + Формат(ВыборкаДанныеДокументов.ДатаНачалаДействияПриказа, "ДФ=dd.MM.yyyy") + " г."
			+ " по " + Формат(ВыборкаДанныеДокументов.ДатаОкончанияДействияПриказа, "ДФ=dd.MM.yyyy") + " г.");
			
			Если ТЗДанныеЗалогодателя.Количество() > 1 Тогда
				ОбластьШапка.Параметры.ТекстКлиент = "клиентам";
				ОбластьШапка.Параметры.ТекстКлиент2 = "клиенты";
			Иначе
				ОбластьШапка.Параметры.ТекстКлиент = "клиенту";
				ОбластьШапка.Параметры.ТекстКлиент2 = "клиент";
			КонецЕсли;	
			
			ТабличныйДокумент.Вывести(ОбластьШапка); 
			
			Для Сч = 1 По КолКолонок - ?(МаксКолВставки > 4, 0, 1) Цикл //- 1 Цикл
				ТабличныйДокумент.Присоединить(ОбластьШапкаПусто);
			Конеццикла;
			
			ОбластьШапкаНомер.Параметры.НомерПриказа = ВыборкаДанныеДокументов.НомерПриказа; 
			ТабличныйДокумент.Присоединить(ОбластьШапкаНомер); 
			
			ТабличныйДокумент.Область(НомерСтр + 2, 1, НомерСтр + 2, КолКолонок + ДобавитьКолонок).Объединить(); // Было КолКолонок + 3 во всех строках
			ТабличныйДокумент.Область(НомерСтр + 3, 1, НомерСтр + 3, КолКолонок + ДобавитьКолонок).Объединить();
			ТабличныйДокумент.Область(НомерСтр + 5, 1, НомерСтр + 5, КолКолонок + ДобавитьКолонок).Объединить();
			ТабличныйДокумент.Область(НомерСтр + 9, 1, НомерСтр + 9, КолКолонок + ДобавитьКолонок).Объединить();
			ТабличныйДокумент.Область(НомерСтр + 10, 1, НомерСтр + 10, КолКолонок + ДобавитьКолонок).Объединить();
			ТабличныйДокумент.Область(НомерСтр + 12, 1, НомерСтр + 12, КолКолонок + ДобавитьКолонок).Объединить();
			ТабличныйДокумент.Область(НомерСтр + 14, 1, НомерСтр + 14, КолКолонок + ДобавитьКолонок).Объединить();
			
			ТабличныйДокумент.Вывести(ОбластьШапкаТекст);
			
			НомерСтр = ТабличныйДокумент.ВысотаТаблицы;

			ТабличныйДокумент.Область(НомерСтр, 1, НомерСтр, КолКолонок + ДобавитьКолонок).Объединить();
			
			Нпп = 1;
			
			Для каждого СтрЗ Из ТЗДанныеЗалогодателя Цикл
				ОбластьШапкаЗаемщик = Макет.ПолучитьОбласть("ШапкаЗаемщик|КолонкаОсновная");
				
				ОбластьШапкаЗаемщик.Параметры.Нпп = ?(ТЗДанныеЗалогодателя.Количество() > 1, "2." + Нпп + " ", "");
				ОбластьШапкаЗаемщик.Параметры.Залогодатель = СтрЗ.Залогодатель.Наименование;
				ОбластьШапкаЗаемщик.Параметры.Датарождения = Формат(СтрЗ.ДатаРождения, "ДФ=dd.MM.yyyy");
				//ОбластьШапкаЗаемщик.Параметры.ПаспортныеДанные = "" + СтрЗ.ДокументЗалогодателя // + ", выдан "
				////+ Формат(СтрЗ.ДокументДатаВыдачи, "ДФ=dd.MM.yyyy")
				//+ ", " + СтрЗ.ДокументКемВыдан + " " + СтрЗ.ДокументКодПодразделения;
				ОбластьШапкаЗаемщик.Параметры.ПаспортныеДанные = "" + СтрЗ.ВидДокумента
				+ ?(ЗначениеЗаполнено(СтрЗ.Серия), " серия " + СтрЗ.Серия, "")
				+ " №" + СтрЗ.Номер + ", выдан " + Формат(СтрЗ.ДатаВыдачи, "ДФ=dd.MM.yyyy") + " г. "
				+ СтрЗ.КемВыдан + ?(ЗначениеЗаполнено(СтрЗ.КодПодразделения), ", код подразделения " + СтрЗ.КодПодразделения, "")
				+ ?(ЗначениеЗаполнено(СтрЗ.СрокДействия), ", срок действия " + Формат(СтрЗ.СрокДействия, "ДФ=dd.MM.yyyy") + " г. ", "");
				
				ТабличныйДокумент.Вывести(ОбластьШапкаЗаемщик);
				
				НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
				
				ТабличныйДокумент.Область(НомерСтр - 1, 1, НомерСтр - 1, КолКолонок + ДобавитьКолонок).Объединить(); //Было КолКолонок + 2
				ТабличныйДокумент.Область(НомерСтр, 1, НомерСтр, КолКолонок + ДобавитьКолонок).Объединить();
				
				Нпп = Нпп + 1;
			КонецЦикла;
			
			ОбластьШапкаПодвал = Макет.ПолучитьОбласть("ШапкаПодвал|КолонкаОсновная");
			ТабличныйДокумент.Вывести(ОбластьШапкаПодвал);
			
			НомПП = 1;
			
			//Заполняем ставки
			Если ТЗСК.Количество() > 0 Тогда
				
				Если ТЗСтавки.Количество() > 0 Тогда
					ОбластьТекстСтавки = Макет.ПолучитьОбласть("ТекстСтавки|КолонкаОсновная");
					
					Если ПорядковыйНомер = 0 Тогда
						ОбластьТекстСтавки.Параметры.Нпп = "3.1 ";
						ПорядковыйНомер = 1;
					КонецЕсли;
					
					ТабличныйДокумент.Вывести(ОбластьТекстСтавки);
				КонецЕсли;
				
				Для каждого СтрСК Из ТЗСК Цикл
					ОтборСК = Новый Структура;
					ОтборСК.Вставить("СхемаКредитования", СтрСК.СхемаКредитования);
					
					СтрокиС = ТЗСтавки.НайтиСтроки(ОтборСК);
					
					Если СтрокиС.Количество() > 0 Тогда
						
						//Добавляем колонки заголовка
						Инд = 1;
						
						Для каждого СтрС Из СтрокиС Цикл
							Если Инд = 1 Тогда
								ОбластьЗаголовокСтавки = Макет.ПолучитьОбласть("ЗаголовокСтавки|НачалоТаблицы");
								ОбластьЗаголовокСтавки.Параметры.НомерПП = НомПП;
								ОбластьЗаголовокСтавки.Параметры.СК = СтрС.СхемаКредитования.НаименованиеДляПечати;
								ОбластьЗаголовокСтавки.Параметры.Диапазон = СтрС.ДиапазонСумм;
								ТабличныйДокумент.Вывести(ОбластьЗаголовокСтавки);
								Инд = Инд + 1;
								НомПП = НомПП + 1;
							Иначе
								ОбластьЗаголовокСтавки = Макет.ПолучитьОбласть("ЗаголовокСтавки|КолонкаСтавка");
								ОбластьЗаголовокСтавки.Параметры.Диапазон = СтрС.ДиапазонСумм;
								ТабличныйДокумент.Присоединить(ОбластьЗаголовокСтавки);
							КонецЕсли;
						КонецЦикла;
						
						//Обединяем заголовок
						НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
						ТабличныйДокумент.Область(НомерСтр - 2, 1, НомерСтр - 2, СтрокиС.Количество()).Объединить();
						
						//Добавляем колонки строк
						Инд = 1;
						
						Для каждого СтрС Из СтрокиС Цикл
							Если Инд = 1 Тогда
								ОбластьСтрокаСтавки = Макет.ПолучитьОбласть("СтрокаСтавки|НачалоТаблицы");
								ОбластьСтрокаСтавки.Параметры.Ставка = СтрС.Ставка;
								ТабличныйДокумент.Вывести(ОбластьСтрокаСтавки);
								Инд = Инд + 1;
							Иначе
								ОбластьСтрокаСтавки = Макет.ПолучитьОбласть("СтрокаСтавки|КолонкаСтавка");
								ОбластьСтрокаСтавки.Параметры.Ставка = СтрС.Ставка;
								ТабличныйДокумент.Присоединить(ОбластьСтрокаСтавки);
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
				
				//+МАН 04.08.25
				//Обрабатываем металлы
				Для каждого СтрСК Из ТЗСК Цикл
					ОтборСК = Новый Структура;
					ОтборСК.Вставить("СхемаКредитования", СтрСК.СхемаКредитования);
					
					ТЗМетСК = ТЗМеталлы.Скопировать(ОтборСК,);
					
					Если ТЗМетСК.Количество() > 0 Тогда
						ОтборОтклонение = Новый Структура;
						ОтборОтклонение.Вставить("ОтклонениеОтБазовойЦены", Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Относительное);
						
						ТЗОтн = ТЗМетСК.Скопировать(ОтборОтклонение,);
						
						ТаблицаМеталловОтн = ТЗОтн.Скопировать();
						ТаблицаМеталловОтн.Свернуть("КатегорияОбъектаЗалога, Металл, ЗначениеОтклонения, СхемаКредитования");
						
						ОтборОтклонение = Новый Структура;
						ОтборОтклонение.Вставить("ОтклонениеОтБазовойЦены", Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Абсолютное);
						
						ТЗАбс = ТЗМетСК.Скопировать(ОтборОтклонение,);
						
						ТаблицаМеталловАбс = ТЗАбс.Скопировать();
						ТаблицаМеталловАбс.Свернуть("КатегорияОбъектаЗалога, Металл, ЗначениеОтклонения, СхемаКредитования");
						
						Если ТЗОтн.Количество() > 0 Тогда
							ТЗОтнМет = ТЗОтн.Скопировать();
							ТЗОтнМет.Свернуть("Металл");
							ТЗОтнМет.Сортировать("Металл Возр");
							
							Инд = 1;
							
							Если Инд = 1 Тогда
								ОбластьТекстМеталлыСК = Макет.ПолучитьОбласть("ТекстМеталлСК|КолонкаОсновная");
								
								Если ПорядковыйНомер = 1 Тогда
									ОбластьТекстМеталлыСК.Параметры.Нпп = "3.2 ";
									ПорядковыйНомер = 2;
								ИначеЕсли ПорядковыйНомер = 0 Тогда
									ОбластьТекстМеталлыСК.Параметры.Нпп = "3.1 ";
									ПорядковыйНомер = 2;
								КонецЕсли;
								
								ОбластьТекстМеталлыСК.Параметры.НаименованиеСК = СтрСК.СхемаКредитования.НаименованиеДляПечати;
								ТабличныйДокумент.Вывести(ОбластьТекстМеталлыСК);
								Инд = Инд + 1;
							КонецЕсли;
							
							НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
							
							ТабличныйДокумент.Область(НомерСтр, 1, НомерСтр, КолКолонок + ДобавитьКолонок).Объединить();
							
							ТекстМет = "";
							Для каждого СтрМетОтн Из ТЗОтнМет Цикл
								МассивСклонения = ПолучитьСклоненияСтроки(НРег(СтрМетОтн.Металл.Наименование), "Л=ru_RU", "ПД=Родительный");
								ТекстМет = ?(ТекстМет = "", МассивСклонения[0], ТекстМет + ", " + МассивСклонения[0]);
							КонецЦикла;
							
							ОбластьТекстМеталл = Макет.ПолучитьОбласть("ТекстМеталл|КолонкаОсновная");
							ОбластьТекстМеталл.Параметры.Металл = ТекстМет;
							ТабличныйДокумент.Вывести(ОбластьТекстМеталл);
							
							ОбластьЗаголовокМеталлы = Макет.ПолучитьОбласть("ЗаголовокМеталлы|КолонкаОсновная");
							
							//Определяем влазиет на страницу или нет
							//СтрокаМетДляПроверки = Макет.ПолучитьОбласть("СтрокаМеталлы|КолонкаОсновная");

							//СтрокиДокумента = Новый Массив;
							//СтрокиДокумента.Добавить(ОбластьТекстМеталл);
							//СтрокиДокумента.Добавить(ОбластьЗаголовокМеталлы);
							//СтрокиДокумента.Добавить(СтрокаМетДляПроверки);
							//СтрокиДокумента.Добавить(СтрокаМетДляПроверки);
							//
							//Если НЕ ТабличныйДокумент.ПроверитьВывод(СтрокиДокумента) Тогда
							//	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
							//КонецЕсли;
							//
							
							ТабличныйДокумент.Вывести(ОбластьЗаголовокМеталлы);
							
							//Заполняем шапку заголовка таблицы
							НомерКолонки = 2;
							Для каждого СтрМетОтн Из ТЗОтнМет Цикл
								ОбластьЗаголовокМеталлыДоп = Макет.ПолучитьОбласть("ЗаголовокМеталлы|КолонкаДопВ");
								
								Если НомерКолонки = 2 Тогда
									ОбластьЗаголовокМеталлыДоп.Параметры.Отклонение = "Увеличение суммы оценки за грамм драгоценного металла в % от базовой оценки";
								КонецЕсли;
								
								ОбластьЗаголовокМеталлыДоп.Параметры.Металл = СтрМетОтн.Металл.Наименование;
								ТабличныйДокумент.Присоединить(ОбластьЗаголовокМеталлыДоп);
								
								НомерКолонки = НомерКолонки + 1;
							КонецЦикла;
							
							НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
							
							//Подготавливаем ТЗ для заполнения строк
							Если ТЗОтнМет.Количество() > 1 Тогда
								ТабличныйДокумент.Область(НомерСтр - 2, 3, НомерСтр - 1, НомерКолонки + ТЗОтнМет.Количество()).Объединить();
								
								ПромежуточнаяТабМет = ТаблицаМеталловОтн.Скопировать();
								КоличествоМеталлов = ТЗОтнМет.Количество();
								
								ТЗРезультат = ПромежуточнаяТабМет.Скопировать(,"КатегорияОбъектаЗалога, ЗначениеОтклонения");
								ТЗРезультат.Очистить();
								
								Для Сч = 0 По КоличествоМеталлов - 1 Цикл
									Отбор = Новый Структура;
									Отбор.Вставить("Металл", ТЗОтнМет[Сч].Металл);
									
									Если ТЗРезультат.Количество() = 0 Тогда
										ТЗРезультат = ПромежуточнаяТабМет.Скопировать(Отбор,);
										ТЗРезультат.Сортировать("КатегорияОбъектаЗалога Возр");
									Иначе
										ПромежуточнаяТабМет2 = ПромежуточнаяТабМет.Скопировать(Отбор,);
										ПромежуточнаяТабМет2.Сортировать("КатегорияОбъектаЗалога Возр");
										
										//Добавляем колонку в которую потом загрузим данные нового металла
										ТЗРезультат.Колонки.Добавить("ЗначениеОтклонения" + ТЗОтнМет[Сч].Металл.Наименование);
										
										Для каждого СтрПромежуточная Из ПромежуточнаяТабМет2 Цикл
											НайденнаяСтр = ТЗРезультат.Найти(СтрПромежуточная.КатегорияОбъектаЗалога, "КатегорияОбъектаЗалога");
											
											Если НайденнаяСтр = Неопределено Тогда
												НаяСтр = ТЗРезультат.Добавить();
												НаяСтр.КатегорияОбъектаЗалога = СтрПромежуточная.КатегорияОбъектаЗалога;
												НаяСтр["ЗначениеОтклонения" + ТЗОтнМет[Сч].Металл.Наименование] = СтрПромежуточная.ЗначениеОтклонения;
											Иначе
												НайденнаяСтр["ЗначениеОтклонения" + ТЗОтнМет[Сч].Металл.Наименование] = СтрПромежуточная.ЗначениеОтклонения;
											КонецЕсли;
										КонецЦикла;
									КонецЕсли;
								КонецЦикла;
							Иначе
								ТЗРезультат = ТаблицаМеталловОтн.Скопировать();
							КонецЕсли;
							
							//Заполняем строки
							Для каждого СтрРез Из ТЗРезультат Цикл
								ОбластьСтрокаМеталлы = Макет.ПолучитьОбласть("СтрокаМеталлы|КолонкаОсновная");
								ОбластьСтрокаМеталлыДоп = Макет.ПолучитьОбласть("СтрокаМеталлы|КолонкаДопВ");
								
								//Определяем влазиет на страницу или нет
								//СтрокиДокумента = Новый Массив;
								//СтрокиДокумента.Добавить(ОбластьСтрокаМеталлы);
								//
								//Если НЕ ТабличныйДокумент.ПроверитьВывод(СтрокиДокумента) Тогда
								//	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
								//	
								//	ОбластьЗаголовокМеталлы = Макет.ПолучитьОбласть("ЗаголовокМеталлы|КолонкаОсновная");
								//	ТабличныйДокумент.Вывести(ОбластьЗаголовокМеталлы);
								//	
								//	//Заполняем шапку заголовка таблицы
								//	НомерКолонки = 2;
								//	Для каждого СтрМетОтн Из ТЗОтнМет Цикл
								//		ОбластьЗаголовокМеталлыДоп = Макет.ПолучитьОбласть("ЗаголовокМеталлы|КолонкаДопВ");
								//		
								//		Если НомерКолонки = 2 Тогда
								//			ОбластьЗаголовокМеталлыДоп.Параметры.Отклонение = "Увеличение суммы оценки за грамм драгоценного металла в % от базовой оценки";
								//		КонецЕсли;
								//		
								//		ОбластьЗаголовокМеталлыДоп.Параметры.Металл = СтрМетОтн.Металл.Наименование;
								//		ТабличныйДокумент.Присоединить(ОбластьЗаголовокМеталлыДоп);
								//		
								//		НомерКолонки = НомерКолонки + 1;
								//	КонецЦикла;
								//	
								//	Если ТЗОтнМет.Количество() > 1 Тогда
								//		НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
								//		ТабличныйДокумент.Область(НомерСтр - 2, 3, НомерСтр - 1, НомерКолонки + ТЗОтнМет.Количество()).Объединить();
								//	КонецЕсли;
								//КонецЕсли;
								//
							
								ОбластьСтрокаМеталлы.Параметры.Категория = СтрРез.КатегорияОбъектаЗалога;
								ТабличныйДокумент.Вывести(ОбластьСтрокаМеталлы);					
								
								Если ТЗОтнМет.Количество() > 1 Тогда
									КоличествоМеталлов = ТЗОтнМет.Количество();
									Для Сч = 0 По КоличествоМеталлов - 1 Цикл
										Если Сч = 0 Тогда
											ОбластьСтрокаМеталлыДоп.Параметры.ЗнчОтклонения = СтрРез.ЗначениеОтклонения;
										Иначе
											ОбластьСтрокаМеталлыДоп.Параметры.ЗнчОтклонения = СтрРез["ЗначениеОтклонения" + ТЗОтнМет[Сч].Металл.Наименование];
										КонецЕсли;
										
										ТабличныйДокумент.Присоединить(ОбластьСтрокаМеталлыДоп);
									КонецЦикла;
								Иначе
									ОбластьСтрокаМеталлыДоп.Параметры.ЗнчОтклонения = СтрРез.ЗначениеОтклонения;
									ТабличныйДокумент.Присоединить(ОбластьСтрокаМеталлыДоп);
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;

						Если ТЗАбс.Количество() > 0 Тогда
							
							ТЗАбсМет = ТЗАбс.Скопировать();
							ТЗАбсМет.Свернуть("Металл");
							ТЗАбсМет.Сортировать("Металл Возр");
							
							Инд = 1;
							
							Если Инд = 1 Тогда
								ОбластьТекстМеталлыСК = Макет.ПолучитьОбласть("ТекстМеталлСК|КолонкаОсновная");

								Если ПорядковыйНомер = 1 Тогда
									ОбластьТекстМеталлыСК.Параметры.Нпп = "3.2 ";
									ПорядковыйНомер = 2;
								ИначеЕсли ПорядковыйНомер = 2 Тогда
									ОбластьТекстМеталлыСК.Параметры.Нпп = "";
									ПорядковыйНомер = 2;
								ИначеЕсли ПорядковыйНомер = 0 Тогда
									ОбластьТекстМеталлыСК.Параметры.Нпп = "3.1 ";
									ПорядковыйНомер = 2;
								КонецЕсли;
								
								ОбластьТекстМеталлыСК.Параметры.НаименованиеСК = СтрСК.СхемаКредитования.НаименованиеДляПечати;
								ТабличныйДокумент.Вывести(ОбластьТекстМеталлыСК);
								Инд = Инд + 1;
							КонецЕсли;
							
							НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
							
							ТабличныйДокумент.Область(НомерСтр, 1, НомерСтр, КолКолонок + ДобавитьКолонок).Объединить();
							
							ТекстМет = "";
							Для каждого СтрМетАбс Из ТЗАбсМет Цикл
								МассивСклонения = ПолучитьСклоненияСтроки(НРег(СтрМетАбс.Металл.Наименование), "Л=ru_RU", "ПД=Родительный");
								ТекстМет = ?(ТекстМет = "", МассивСклонения[0], ТекстМет + ", " + МассивСклонения[0]);
							КонецЦикла;
							
							ОбластьТекстМеталл = Макет.ПолучитьОбласть("ТекстМеталл|КолонкаОсновная");
							ОбластьТекстМеталл.Параметры.Металл = ТекстМет;
							ТабличныйДокумент.Вывести(ОбластьТекстМеталл);
							
							ОбластьЗаголовокМеталлы = Макет.ПолучитьОбласть("ЗаголовокМеталлы|КолонкаОсновная");
							
							//Определяем влазиет на страницу или нет
							//СтрокаМетДляПроверки = Макет.ПолучитьОбласть("СтрокаМеталлы|КолонкаОсновная");

							//СтрокиДокумента = Новый Массив;
							//СтрокиДокумента.Добавить(ОбластьТекстМеталл);
							//СтрокиДокумента.Добавить(ОбластьЗаголовокМеталлы);
							//СтрокиДокумента.Добавить(СтрокаМетДляПроверки);
							//СтрокиДокумента.Добавить(СтрокаМетДляПроверки);
							//
							//Если НЕ ТабличныйДокумент.ПроверитьВывод(СтрокиДокумента) Тогда
							//	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
							//КонецЕсли;
							//
							
							ТабличныйДокумент.Вывести(ОбластьЗаголовокМеталлы);
							
							//Заполняем шапку заголовка таблицы
							НомерКолонки = 2;
							Для каждого СтрМетАбс Из ТЗАбсМет Цикл
								ОбластьЗаголовокМеталлыДоп = Макет.ПолучитьОбласть("ЗаголовокМеталлы|КолонкаДопВ");
								
								Если НомерКолонки = 2 Тогда
									ОбластьЗаголовокМеталлыДоп.Параметры.Отклонение = "Увеличение суммы оценки за грамм драгоценного металла в руб. от базовой оценки";
								КонецЕсли;
								
								ОбластьЗаголовокМеталлыДоп.Параметры.Металл = СтрМетАбс.Металл.Наименование;
								ТабличныйДокумент.Присоединить(ОбластьЗаголовокМеталлыДоп);
								
								НомерКолонки = НомерКолонки + 1;
							КонецЦикла;
							
							НомерСтр = ТабличныйДокумент.ВысотаТаблицы;

							//Подготавливаем ТЗ для заполнения строк
							Если ТЗАбсМет.Количество() > 1 Тогда
								ТабличныйДокумент.Область(НомерСтр - 2, 3, НомерСтр - 1, НомерКолонки + ТЗАбсМет.Количество()).Объединить();
								
								ПромежуточнаяТабМет = ТаблицаМеталловАбс.Скопировать();

								КоличествоМеталлов = ТЗАбсМет.Количество();
								
								ТЗРезультат = ПромежуточнаяТабМет.Скопировать(,"КатегорияОбъектаЗалога, ЗначениеОтклонения");
								ТЗРезультат.Очистить();
								
								Для Сч = 0 По КоличествоМеталлов - 1 Цикл
									Отбор = Новый Структура;
									Отбор.Вставить("Металл", ТЗАбсМет[Сч].Металл);
									
									Если ТЗРезультат.Количество() = 0 Тогда
										ТЗРезультат = ПромежуточнаяТабМет.Скопировать(Отбор,);
										ТЗРезультат.Сортировать("КатегорияОбъектаЗалога Возр");
									Иначе
										ПромежуточнаяТабМет2 = ПромежуточнаяТабМет.Скопировать(Отбор,);
										ПромежуточнаяТабМет2.Сортировать("КатегорияОбъектаЗалога Возр");
										
										//Добавляем колонку в которую потом загрузим данные нового металла
										ТЗРезультат.Колонки.Добавить("ЗначениеОтклонения" + ТЗАбсМет[Сч].Металл.Наименование);
										
										Для каждого СтрПромежуточная Из ПромежуточнаяТабМет2 Цикл
											НайденнаяСтр = ТЗРезультат.Найти(СтрПромежуточная.КатегорияОбъектаЗалога, "КатегорияОбъектаЗалога");
											
											Если НайденнаяСтр = Неопределено Тогда
												НаяСтр = ТЗРезультат.Добавить();
												НаяСтр.КатегорияОбъектаЗалога = СтрПромежуточная.КатегорияОбъектаЗалога;
												НаяСтр["ЗначениеОтклонения" + ТЗАбсМет[Сч].Металл.Наименование] = СтрПромежуточная.ЗначениеОтклонения;
											Иначе
												НайденнаяСтр["ЗначениеОтклонения" + ТЗАбсМет[Сч].Металл.Наименование] = СтрПромежуточная.ЗначениеОтклонения;
											КонецЕсли;
										КонецЦикла;
									КонецЕсли;
								КонецЦикла;
							Иначе
								ТЗРезультат = ТаблицаМеталловАбс.Скопировать();
							КонецЕсли;
							
							//Заполняем строки
							Для каждого СтрРез Из ТЗРезультат Цикл
								ОбластьСтрокаМеталлы = Макет.ПолучитьОбласть("СтрокаМеталлы|КолонкаОсновная");
								ОбластьСтрокаМеталлыДоп = Макет.ПолучитьОбласть("СтрокаМеталлы|КолонкаДопВ");
								
								//Определяем влазиет на страницу или нет
								//СтрокиДокумента = Новый Массив;
								//СтрокиДокумента.Добавить(ОбластьСтрокаМеталлы);
								//
								//Если НЕ ТабличныйДокумент.ПроверитьВывод(СтрокиДокумента) Тогда
								//	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
								//	
								//	ОбластьЗаголовокМеталлы = Макет.ПолучитьОбласть("ЗаголовокМеталлы|КолонкаОсновная");
								//	ТабличныйДокумент.Вывести(ОбластьЗаголовокМеталлы);
								//	
								//	//Заполняем шапку заголовка таблицы
								//	НомерКолонки = 2;
								//	Для каждого СтрМетАбс Из ТЗАбсМет Цикл
								//		ОбластьЗаголовокМеталлыДоп = Макет.ПолучитьОбласть("ЗаголовокМеталлы|КолонкаДопВ");
								//		
								//		Если НомерКолонки = 2 Тогда
								//			ОбластьЗаголовокМеталлыДоп.Параметры.Отклонение = "Увеличение суммы оценки за грамм драгоценного металла в руб. от базовой оценки";
								//		КонецЕсли;
								//		
								//		ОбластьЗаголовокМеталлыДоп.Параметры.Металл = СтрМетАбс.Металл.Наименование;
								//		ТабличныйДокумент.Присоединить(ОбластьЗаголовокМеталлыДоп);
								//		
								//		НомерКолонки = НомерКолонки + 1;
								//	КонецЦикла;
								//	
								//	Если ТЗАбсМет.Количество() > 1 Тогда
								//		НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
								//		ТабличныйДокумент.Область(НомерСтр - 2, 3, НомерСтр - 1, НомерКолонки + ТЗАбсМет.Количество()).Объединить();
								//	КонецЕсли;
								//КонецЕсли;
								//
								
								ОбластьСтрокаМеталлы.Параметры.Категория = СтрРез.КатегорияОбъектаЗалога;
								ТабличныйДокумент.Вывести(ОбластьСтрокаМеталлы);					
								
								Если ТЗАбсМет.Количество() > 1 Тогда
									КоличествоМеталлов = ТЗАбсМет.Количество();
									Для Сч = 0 По КоличествоМеталлов - 1 Цикл
										Если Сч = 0 Тогда
											ОбластьСтрокаМеталлыДоп.Параметры.ЗнчОтклонения = СтрРез.ЗначениеОтклонения;
										Иначе
											ОбластьСтрокаМеталлыДоп.Параметры.ЗнчОтклонения = СтрРез["ЗначениеОтклонения" + ТЗАбсМет[Сч].Металл.Наименование];
										КонецЕсли;
										
										ТабличныйДокумент.Присоединить(ОбластьСтрокаМеталлыДоп);
									КонецЦикла;
								Иначе
									ОбластьСтрокаМеталлыДоп.Параметры.ЗнчОтклонения = СтрРез.ЗначениеОтклонения;
									ТабличныйДокумент.Присоединить(ОбластьСтрокаМеталлыДоп);
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;

				//Обрабатываем камни
				Для каждого СтрСК Из ТЗСК Цикл

					Отбор = Новый Структура;
					Отбор.Вставить("ВидВставки", Справочники.ЛБ_ДрагоценныеКамни.Бриллиант);
					Отбор.Вставить("СхемаКредитования", СтрСК.СхемаКредитования);
					Отбор.Вставить("ОтклонениеОтБазовойЦены", Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Относительное);

					ТЗОтнСК = ТЗВставки.Скопировать(Отбор,);
					
					ТЗОтн = ТЗОтнСК.Скопировать();
			
					ТЗОтнСК.Свернуть("СхемаКредитования");
					ТЗОтнСК.Сортировать("СхемаКредитования Возр");
					
					Отбор.Вставить("ОтклонениеОтБазовойЦены", Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Абсолютное);
					
					ТЗАбсСК = ТЗВставки.Скопировать(Отбор,);
					
					ТЗАбс = ТЗАбсСК.Скопировать();
					
					ТЗАбсСК.Свернуть("СхемаКредитования");
					ТЗАбсСК.Сортировать("СхемаКредитования Возр");
					
					Если ТЗОтнСК.Количество() > 0 Тогда
					
						//Заполняем Текст и ТЧ относительно вида отклонений
						Для каждого СтрОтнСК Из ТЗОтнСК Цикл
							
							ТЗОтнВст = ТЗОтн.Скопировать();
							
							Инд = 1;
							
							Если Инд = 1 Тогда
								ОбластьТекстВставки = Макет.ПолучитьОбласть("ТекстВставка|КолонкаОсновная");
								
								Если ПорядковыйНомер = 2 Тогда
									ОбластьТекстВставки.Параметры.Нпп = "3.3 ";
									ПорядковыйНомер = 3;
								ИначеЕсли ПорядковыйНомер = 1 Тогда
									ОбластьТекстВставки.Параметры.Нпп = "3.2 ";
									ПорядковыйНомер = 3;
								ИначеЕсли ПорядковыйНомер = 0 Тогда
									ОбластьТекстВставки.Параметры.Нпп = "3.1 ";
									ПорядковыйНомер = 3;
								КонецЕсли;
								
								ОбластьТекстВставки.Параметры.НаименованиеСК = СтрОтнСК.СхемаКредитования.НаименованиеДляПечати;
								ТабличныйДокумент.Вывести(ОбластьТекстВставки);
								Инд = Инд + 1;
							КонецЕсли;
							
							НомерСтр = ТабличныйДокумент.ВысотаТаблицы;

							ТабличныйДокумент.Область(НомерСтр, 1, НомерСтр, КолКолонок + ДобавитьКолонок).Объединить(); //Было НомерКолонки-2
							
							ОбластьЗаголовокВставки = Макет.ПолучитьОбласть("ЗаголовокВставки|КолонкаОсновная");

							//Определяем влазиет на страницу или нет
							//СтрокаВстДляПроверки = Макет.ПолучитьОбласть("СтрокаВставки|КолонкаОсновная");
							//
							//СтрокиДокумента = Новый Массив;
							//СтрокиДокумента.Добавить(ОбластьЗаголовокВставки);
							//СтрокиДокумента.Добавить(СтрокаВстДляПроверки);
							//
							//Если НЕ ТабличныйДокумент.ПроверитьВывод(СтрокиДокумента) Тогда
							//	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
							//КонецЕсли;
							//
							
							ТабличныйДокумент.Вывести(ОбластьЗаголовокВставки);
							
							НомерКолонки = 2;
							Для каждого СтрВстОтн Из ТЗОтнВст Цикл
								ОбластьЗаголовокВставкиДоп = Макет.ПолучитьОбласть("ЗаголовокВставки|КолонкаДопВ");
								
								Если НомерКолонки = 2 Тогда
									ОбластьЗаголовокВставкиДоп.Параметры.Отклонение = "Увеличение суммы оценки  за 1 карат в % от базовой оценки";
								КонецЕсли;
								
								ОбластьЗаголовокВставкиДоп.Параметры.Качество = СтрВстОтн.КачествоОгранки.Наименование;
								ОбластьЗаголовокВставкиДоп.Параметры.ВидОгранки = СтрВстОтн.ВидОгранки.Наименование;
								ТабличныйДокумент.Присоединить(ОбластьЗаголовокВставкиДоп);
								
								НомерКолонки = НомерКолонки + 1;
							КонецЦикла;
							
							НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
							
							МассивУдаления.Очистить();
							
							//Подготовка данных для заполнения строк
							Если ТЗОтнВст.Количество() > 1 Тогда
								ТабличныйДокумент.Область(НомерСтр - 4, 3, НомерСтр - 3, НомерКолонки + ТЗОтнВст.Количество()).Объединить();
								
								ПромежуточнаяТабВст = ТЗОтнВст.Скопировать();
								
								КоличествоКамней = ТЗОтнВст.Количество();
								
								ТЗРезультат = ПромежуточнаяТабВст.Скопировать(,"ВидВставки, ЗначениеОтклонения");
								
								Для Сч = 1 По КоличествоКамней - 1 Цикл
									МассивУдаления.Добавить(ТЗРезультат[Сч]);						
								КонецЦикла;
								
								Если МассивУдаления.Количество() > 0 Тогда
									Для каждого СтрМ Из МассивУдаления Цикл
										ТЗРезультат.Удалить(СтрМ);
									КонецЦикла;
								КонецЕсли;
								
								Для Сч = 1 По КоличествоКамней - 1 Цикл
									ПромежуточнаяТабВст = ТЗОтнВст.Скопировать();
									ПромежуточнаяТабВст.Удалить(0);
									
									//Добавляем колонку в которую потом загрузим данные нового металла
									ТЗРезультат.Колонки.Добавить("ЗначениеОтклонения" + Сч);
									
									Для каждого СтрПромежуточная Из ПромежуточнаяТабВст Цикл
										Стр = ТЗРезультат.Получить(0);
										Стр["ЗначениеОтклонения" + Сч] = СтрПромежуточная.ЗначениеОтклонения;
									КонецЦикла;
								КонецЦикла;
							Иначе
								ТЗРезультат = ТЗОтнВст.Скопировать();
							КонецЕсли;
							
							//Заполнение строк
							Для каждого СтрРез Из ТЗРезультат Цикл
								ОбластьСтрокаВставки = Макет.ПолучитьОбласть("СтрокаВставки|КолонкаОсновная");
								ОбластьСтрокаВставкиДоп = Макет.ПолучитьОбласть("СтрокаВставки|КолонкаДопВ");
								
								ОбластьСтрокаВставки.Параметры.Камень = СтрРез.ВидВставки.Наименование;
								ТабличныйДокумент.Вывести(ОбластьСтрокаВставки);
								
								Если ТЗОтнВст.Количество() > 1 Тогда
									КоличествоКамней = ТЗОтнВст.Количество();
									Для Сч = 0 По КоличествоКамней - 1 Цикл
										Если Сч = 0 Тогда
											ОбластьСтрокаВставкиДоп.Параметры.ЗнчОтклонения = СтрРез.ЗначениеОтклонения;
										Иначе
											ОбластьСтрокаВставкиДоп.Параметры.ЗнчОтклонения = СтрРез["ЗначениеОтклонения" + Сч];
										КонецЕсли;
										
										ТабличныйДокумент.Присоединить(ОбластьСтрокаВставкиДоп);
									КонецЦикла;
								Иначе
									ОбластьСтрокаВставкиДоп.Параметры.ЗнчОтклонения = СтрРез.ЗначениеОтклонения;
									ТабличныйДокумент.Присоединить(ОбластьСтрокаВставкиДоп);
								КонецЕсли;
							КонецЦикла;
						КонецЦикла;
					КонецЕсли;
					
					Если ТЗАбсСК.Количество() > 0 Тогда
						Для каждого СтрАбсСК Из ТЗАбсСК Цикл
							
							ТЗАбсВст = ТЗАбс.Скопировать();
							
							Инд = 1;
							
							Если Инд = 1 Тогда
								ОбластьТекстВставки = Макет.ПолучитьОбласть("ТекстВставка|КолонкаОсновная");
								
								Если ПорядковыйНомер = 3 Тогда
									ОбластьТекстВставки.Параметры.Нпп = "";
									ПорядковыйНомер = 4;
								ИначеЕсли ПорядковыйНомер = 2 Тогда
									ОбластьТекстВставки.Параметры.Нпп = "3.3 ";
									ПорядковыйНомер = 4;
								ИначеЕсли ПорядковыйНомер = 1 Тогда
									ОбластьТекстВставки.Параметры.Нпп = "3.3 ";
									ПорядковыйНомер = 4;
								ИначеЕсли ПорядковыйНомер = 0 Тогда
									ОбластьТекстВставки.Параметры.Нпп = "3.1 ";
									ПорядковыйНомер = 4;
								КонецЕсли;
								
								ОбластьТекстВставки.Параметры.НаименованиеСК = СтрАбсСК.СхемаКредитования.НаименованиеДляПечати;
								ТабличныйДокумент.Вывести(ОбластьТекстВставки);
								Инд = Инд + 1;
							КонецЕсли;
							
							НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
							
							ТабличныйДокумент.Область(НомерСтр, 1, НомерСтр, КолКолонок + ДобавитьКолонок).Объединить(); //НомерКолонки-2
							
							ОбластьЗаголовокВставки = Макет.ПолучитьОбласть("ЗаголовокВставки|КолонкаОсновная");

							//Определяем влазиет на страницу или нет
							//СтрокаВстДляПроверки = Макет.ПолучитьОбласть("СтрокаВставки|КолонкаОсновная");
							//
							//СтрокиДокумента = Новый Массив;
							//СтрокиДокумента.Добавить(ОбластьЗаголовокВставки);
							//СтрокиДокумента.Добавить(СтрокаВстДляПроверки);
							//
							//Если НЕ ТабличныйДокумент.ПроверитьВывод(СтрокиДокумента) Тогда
							//	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
							//КонецЕсли;
							//
							
							ТабличныйДокумент.Вывести(ОбластьЗаголовокВставки);
							
							НомерКолонки = 2;
							Для каждого СтрВстАбс Из ТЗАбсВст Цикл
								ОбластьЗаголовокВставкиДоп = Макет.ПолучитьОбласть("ЗаголовокВставки|КолонкаДопВ");
								
								Если НомерКолонки = 2 Тогда
									ОбластьЗаголовокВставкиДоп.Параметры.Отклонение = "Увеличение суммы оценки  за 1 карат в руб. от базовой оценки";
								КонецЕсли;
								
								ОбластьЗаголовокВставкиДоп.Параметры.Качество = СтрВстАбс.КачествоОгранки.Наименование;
								ОбластьЗаголовокВставкиДоп.Параметры.ВидОгранки = СтрВстАбс.ВидОгранки.Наименование;
								ТабличныйДокумент.Присоединить(ОбластьЗаголовокВставкиДоп);
								
								НомерКолонки = НомерКолонки + 1;
							КонецЦикла;
							
							НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
							
							МассивУдаления.Очистить();
							
							Если ТЗАбсВст.Количество() > 1 Тогда
								ТабличныйДокумент.Область(НомерСтр - 4, 3, НомерСтр - 3, НомерКолонки + ТЗАбсВст.Количество()).Объединить();
								
								ПромежуточнаяТабВст = ТЗАбсВст.Скопировать();
								
								КоличествоКамней = ТЗАбсВст.Количество();
								
								ТЗРезультат = ПромежуточнаяТабВст.Скопировать(,"ВидВставки, ЗначениеОтклонения");
								
								Для Сч = 1 По КоличествоКамней - 1 Цикл
									МассивУдаления.Добавить(ТЗРезультат[Сч]);
								КонецЦикла;
								
								Если МассивУдаления.Количество() > 0 Тогда
									Для каждого СтрМ Из МассивУдаления Цикл
										ТЗРезультат.Удалить(СтрМ);
									КонецЦикла;
								КонецЕсли;
								
								Для Сч = 1 По КоличествоКамней - 1 Цикл
									ПромежуточнаяТабВст = ТЗАбсВст.Скопировать();
									ПромежуточнаяТабВст.Удалить(0);
									
									//Добавляем колонку в которую потом загрузим данные нового металла
									ТЗРезультат.Колонки.Добавить("ЗначениеОтклонения" + Сч);
									
									Для каждого СтрПромежуточная Из ПромежуточнаяТабВст Цикл
										Стр = ТЗРезультат.Получить(0);
										Стр["ЗначениеОтклонения" + Сч] = СтрПромежуточная.ЗначениеОтклонения;
									КонецЦикла;
								КонецЦикла;
							Иначе
								ТЗРезультат = ТЗАбсВст.Скопировать();
							КонецЕсли;
							
							Для каждого СтрРез Из ТЗРезультат Цикл
								ОбластьСтрокаВставки = Макет.ПолучитьОбласть("СтрокаВставки|КолонкаОсновная");
								ОбластьСтрокаВставкиДоп = Макет.ПолучитьОбласть("СтрокаВставки|КолонкаДопВ");
								
								ОбластьСтрокаВставки.Параметры.Камень = СтрРез.ВидВставки.Наименование;
								ТабличныйДокумент.Вывести(ОбластьСтрокаВставки);
								
								Если ТЗАбсВст.Количество() > 1 Тогда
									КоличествоКамней = ТЗАбсВст.Количество();
									Для Сч = 0 По КоличествоКамней - 1 Цикл
										Если Сч = 0 Тогда
											ОбластьСтрокаВставкиДоп.Параметры.ЗнчОтклонения = СтрРез.ЗначениеОтклонения;
										Иначе
											ОбластьСтрокаВставкиДоп.Параметры.ЗнчОтклонения = СтрРез["ЗначениеОтклонения" + Сч];
										КонецЕсли;
										
										ТабличныйДокумент.Присоединить(ОбластьСтрокаВставкиДоп);
									КонецЦикла;
								Иначе
									ОбластьСтрокаВставкиДоп.Параметры.ЗнчОтклонения = СтрРез.ЗначениеОтклонения;
									ТабличныйДокумент.Присоединить(ОбластьСтрокаВставкиДоп);
								КонецЕсли;
							КонецЦикла;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			//Выводим подвал
			ОбластьПодвал = Макет.ПолучитьОбласть("Подвал|КолонкаОсновная");
			ОбластьПодвалПодписант = Макет.ПолучитьОбласть("Подвал|КолонкаСтавка");
			ОбластьПодвалПусто = Макет.ПолучитьОбласть("Подвал|КолонкаШапкаПусто");
			
			ОбластьПодвал.Параметры.НачальникОРБ = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаДанныеДокументов.НачальникОРБ.Наименование);
			ОбластьПодвал.Параметры.ДатаДокумента = Формат(ВыборкаДанныеДокументов.СсылкаНаДокумент.Дата, "ДФ=dd.MM.yyyy") + " г.";
			ОбластьПодвал.Параметры.НачальникОтделения = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаДанныеДокументов.НачальникОтделения.Наименование);
			ОбластьПодвал.Параметры.ДатаНачалаДействия = ?(ВыборкаДанныеДокументов.ДатаОкончанияДействияПриказа = Дата(1,1,1),
			"постоянно, с " + Формат(ВыборкаДанныеДокументов.ДатаНачалаДействияПриказа, "ДФ=dd.MM.yyyy") + " г.",
			"на период с " + Формат(ВыборкаДанныеДокументов.ДатаНачалаДействияПриказа, "ДФ=dd.MM.yyyy") + " г."
			+ " по " + Формат(ВыборкаДанныеДокументов.ДатаОкончанияДействияПриказа, "ДФ=dd.MM.yyyy") + " г.");
			
			//ОбластьПодвал.Параметры.НачальникОДО = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаДанныеДокументов.НачальникОДО.Наименование);
			ОбластьПодвал.Параметры.НачальникОДО = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СклонениеПредставленийОбъектов.ПросклонятьФИО(
				ВыборкаДанныеДокументов.НачальникОДО.Наименование, 2,,));
				
			ОбластьПодвал.Параметры.Должность = ВыборкаДанныеДокументов.ПодписантДолжность;
			
			//СтрокиДокумента = Новый Массив;
			//СтрокиДокумента.Добавить(ОбластьПодвал);
			//
			//Если НЕ ТабличныйДокумент.ПроверитьВывод(СтрокиДокумента) Тогда
			//	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			//КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьПодвал);
			
			Для Сч = 1 По 3 Цикл
				ТабличныйДокумент.Присоединить(ОбластьПодвалПусто);
			КонецЦикла;
			
			ОбластьПодвалПодписант.Параметры.Подписал = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаДанныеДокументов.ПодписантФИО.Наименование);
			ТабличныйДокумент.Присоединить(ОбластьПодвалПодписант); 
			
			НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
			ТабличныйДокумент.Область(НомерСтр - 10, 1, НомерСтр - 10, КолКолонок + ДобавитьКолонок).Объединить();
			ТабличныйДокумент.Область(НомерСтр - 9, 1, НомерСтр - 9, КолКолонок + ДобавитьКолонок).Объединить();
			ТабличныйДокумент.Область(НомерСтр - 8, 1, НомерСтр - 8, КолКолонок + ДобавитьКолонок).Объединить();
			ТабличныйДокумент.Область(НомерСтр - 7, 1, НомерСтр - 7, КолКолонок + ДобавитьКолонок).Объединить();
			ТабличныйДокумент.Область(НомерСтр - 6, 1, НомерСтр - 6, КолКолонок + ДобавитьКолонок).Объединить();
			ТабличныйДокумент.Область(НомерСтр - 5, 1, НомерСтр - 5, КолКолонок + ДобавитьКолонок).Объединить();
			ТабличныйДокумент.Область(НомерСтр - 4, 1, НомерСтр - 4, КолКолонок + ДобавитьКолонок).Объединить();
			ТабличныйДокумент.Область(НомерСтр - 3, 1, НомерСтр - 3, КолКолонок + ДобавитьКолонок).Объединить();
			ТабличныйДокумент.Область(НомерСтр - 2, 1, НомерСтр - 2, КолКолонок + ДобавитьКолонок).Объединить();
		КонецЕсли;
		
		ПорядковыйНомер = 0;
		
		Если ТЗЗалогодателиСУсловиями.Количество() > 0 Тогда
			
			Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ТЗДанныеЗалогодателя = ПолучитьДанныеЗалогодателя(ТЗЗалогодателиСУсловиями.Скопировать(, "Залогодатель"), НачалоДня(ВыборкаДанныеДокументов.СсылкаНаДокумент.Дата));
			
			Макет = ПолучитьМакет("ПФ_MXL_ПриказУстановкиВИПНовыеУсловия");
			
			// Формируем основную часть. 
			ОбластьШапка = Макет.ПолучитьОбласть("Шапка|КолонкаОсновная");
			ОбластьШапкаПусто = Макет.ПолучитьОбласть("Шапка|КолонкаШапкаПусто");
			ОбластьШапкаНомер = Макет.ПолучитьОбласть("Шапка|КолонкаШапкаНомер");
			НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
			
			ОбластьШапка.Параметры.ДатаПриказа = Формат(ВыборкаДанныеДокументов.СсылкаНаДокумент.Дата, "ДФ=dd.MM.yyyy") + " г.";
			СклонениеОтделения = ПолучитьСклоненияСтроки(ВыборкаДанныеДокументов.Отделение.Наименование, "Л=ru_RU", "ПД=Родительный");

			Если СклонениеОтделения.Количество() > 0 Тогда
				ОбластьШапка.Параметры.Отделение = СклонениеОтделения[0];
			КонецЕсли;
			
			//ПолНачальника = ПолучитьДанныеЗалогодателя(ВыборкаДанныеДокументов.НачальникОтделения, НачалоДня(ВыборкаДанныеДокументов.СсылкаНаДокумент.Дата));
			ОбластьШапка.Параметры.ФИОНачальника = СклонениеПредставленийОбъектов.ПросклонятьФИО(
				ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаДанныеДокументов.НачальникОтделения.Наименование), 2,,);
				
			//Убрал пол т.к. по сотрудникам нет этой информации.
				//ВыборкаДанныеДокументов.НачальникОтделения, ?(ПолНачальника = Перечисления.ПолФизическогоЛица.Мужской, 1, 2));
			//
			
			ОбластьШапка.Параметры.ПериодДействия = ?(ВыборкаДанныеДокументов.ДатаОкончанияДействияПриказа = Дата(1,1,1),
			"с " + Формат(ВыборкаДанныеДокументов.ДатаНачалаДействияПриказа, "ДФ=dd.MM.yyyy") + " г.",
			"на период с " + Формат(ВыборкаДанныеДокументов.ДатаНачалаДействияПриказа, "ДФ=dd.MM.yyyy") + " г."
			+ " по " + Формат(ВыборкаДанныеДокументов.ДатаОкончанияДействияПриказа, "ДФ=dd.MM.yyyy") + " г.");
			
			ТекстЗ = "";
			
			Если ТЗДанныеЗалогодателя.Количество() > 1 Тогда
				НомПП = 1;
				
				Для каждого СтрЗ Из ТЗДанныеЗалогодателя Цикл
					ФИОПослеСклонения = СклонениеПредставленийОбъектов.ПросклонятьФИО(СтрЗ.Залогодатель.Наименование, 3, СтрЗ.Залогодатель,
					?(СтрЗ.Пол = Перечисления.ПолФизическогоЛица.Мужской, 1, 2));
					
					ТекстЗ = ?(ТекстЗ = "", "клиентам " + ФИОПослеСклонения + ", ",
					?(ТЗЗалогодателиСУсловиями.Количество() = НомПП + 1, ТекстЗ + ФИОПослеСклонения + ", ",
					ТекстЗ + ФИОПослеСклонения + " (далее - клиенты)"));
					
					НомПП = НомПП + 1;
				КонецЦикла;
			Иначе
				ФИОПослеСклонения = СклонениеПредставленийОбъектов.ПросклонятьФИО(ТЗДанныеЗалогодателя[0].Залогодатель.Наименование, 3, ТЗДанныеЗалогодателя[0].Залогодатель,
				?(ТЗДанныеЗалогодателя[0].Пол = Перечисления.ПолФизическогоЛица.Мужской, 1, 2));
				
				ТекстЗ = "клиенту " + ФИОПослеСклонения + " (далее - клиент)";
			КонецЕсли;	
			
			ОбластьШапка.Параметры.Залогодателю = ТекстЗ;
			
			ТабличныйДокумент.Вывести(ОбластьШапка);
			
			Для Сч = 1 По КолКолонок - ?(МаксКолВставки > 4, 0, 1) Цикл
				ТабличныйДокумент.Присоединить(ОбластьШапкаПусто);
			Конеццикла;
			
			ОбластьШапкаНомер.Параметры.НомерПриказа = ВыборкаДанныеДокументов.НомерПриказа; 
			ТабличныйДокумент.Присоединить(ОбластьШапкаНомер); 
			
			ТабличныйДокумент.Область(НомерСтр + 2, 1, НомерСтр + 2, КолКолонок + ДобавитьКолонок).Объединить();
			ТабличныйДокумент.Область(НомерСтр + 3, 1, НомерСтр + 3, КолКолонок + ДобавитьКолонок).Объединить();
			ТабличныйДокумент.Область(НомерСтр + 5, 1, НомерСтр + 5, КолКолонок + ДобавитьКолонок).Объединить();
			ТабличныйДокумент.Область(НомерСтр + 9, 1, НомерСтр + 9, КолКолонок + ДобавитьКолонок).Объединить();
			ТабличныйДокумент.Область(НомерСтр + 10, 1, НомерСтр + 10, КолКолонок + ДобавитьКолонок).Объединить();
			ТабличныйДокумент.Область(НомерСтр + 12, 1, НомерСтр + 12, КолКолонок + ДобавитьКолонок).Объединить();
			ТабличныйДокумент.Область(НомерСтр + 14, 1, НомерСтр + 14, КолКолонок + ДобавитьКолонок).Объединить();
			ТабличныйДокумент.Область(НомерСтр + 15, 1, НомерСтр + 15, КолКолонок + ДобавитьКолонок).Объединить();
			
			//Подготовка и вывод информации по отменяемым условиям
			ТЗСтавкиОтменяемые = ТЗЗалогодателиСУсловиями.Скопировать(, "ИспользуютсяСтавки, ДокументСтавки");
			ТЗСтавкиОтменяемые.Свернуть("ИспользуютсяСтавки, ДокументСтавки");

			ТЗМеталлОтменяемые = ТЗЗалогодателиСУсловиями.Скопировать(, "ИспользуютсяМаталлы, ДокументМеталлы");
			ТЗМеталлОтменяемые.Свернуть("ИспользуютсяМаталлы, ДокументМеталлы");

			ТЗВставкиОтменяемые = ТЗЗалогодателиСУсловиями.Скопировать(, "ИспользуютсяВставки, ДокументВставки");
			ТЗВставкиОтменяемые.Свернуть("ИспользуютсяВставки, ДокументВставки");
			
			Ставки = Ложь;
			Металлы = Ложь;
			
			Если ТЗСтавки.Количество() > 0 Тогда
				//Если один документ по предыдущим условиям
				Если ТЗСтавкиОтменяемые.Количество() = 1 И ТЗСтавкиОтменяемые[0].ИспользуютсяСтавки Тогда 
				
					ОбластьШапкаТекстОтмены = Макет.ПолучитьОбласть("ШапкаТекстОтмены|КолонкаОсновная");
					ОбластьШапкаТекстОтмены.Параметры.ДатаНачалаДействия = Формат(ВыборкаДанныеДокументов.ДатаНачалаДействияПриказа, "ДФ=dd.MM.yyyy") + " г.";
					ОбластьШапкаТекстОтмены.Параметры.Условия = "по процентным ставкам за пользование займом";
					ОбластьШапкаТекстОтмены.Параметры.НомерПриказа = ТЗСтавкиОтменяемые[0].ДокументСтавки.НомерПриказа;
					ОбластьШапкаТекстОтмены.Параметры.ДатаПриказа = Формат(ТЗСтавкиОтменяемые[0].ДокументСтавки.Дата, "ДФ=dd.MM.yyyy") + " г.";
					
					ТекстЗ = "";
					НомПП = 1;
					
					Для каждого СтрЗ Из ТЗДанныеЗалогодателя Цикл
						Если ТЗДанныеЗалогодателя.Количество() > 1 Тогда
							ФИОПослеСклонения = СклонениеПредставленийОбъектов.ПросклонятьФИО(СтрЗ.Залогодатель.Наименование, 2, СтрЗ.Залогодатель,
							?(СтрЗ.Пол = Перечисления.ПолФизическогоЛица.Мужской, 1, 2));
							
							ТекстЗ = ?(ТекстЗ = "", "клиентов " + ФИОПослеСклонения + ", ",
							?(ТЗЗалогодателиСУсловиями.Количество() = НомПП + 1, ТекстЗ + ФИОПослеСклонения + ", ",
							ТекстЗ + ФИОПослеСклонения));
							
							НомПП = НомПП + 1;
						Иначе
							ТекстЗ = "клиента " + СтрЗ.Залогодатель.Наименование;
						КонецЕсли;
					КонецЦикла;
					
					ОбластьШапкаТекстОтмены.Параметры.ТекстКлиент = ТекстЗ;
					ТабличныйДокумент.Вывести(ОбластьШапкаТекстОтмены);

					НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
					ТабличныйДокумент.Область(НомерСтр, 1, НомерСтр, КолКолонок + ДобавитьКолонок).Объединить();
				Иначе
				//Если разные документы по предыдущим условиям
					НомПП = 1;
					
					Для каждого СтрОтмен Из ТЗЗалогодателиСУсловиями Цикл
						Если СтрОтмен.ИспользуютсяСтавки Тогда
							Если НомПП = 1 Тогда
								ОбластьШапкаТекстОтмены = Макет.ПолучитьОбласть("ШапкаТекстОтмены|КолонкаОсновная");
							Иначе
								ОбластьШапкаТекстОтмены = Макет.ПолучитьОбласть("ТекстОтмены|КолонкаОсновная");							
							КонецЕсли;
							
							ОбластьШапкаТекстОтмены.Параметры.ДатаНачалаДействия = Формат(ВыборкаДанныеДокументов.ДатаНачалаДействияПриказа, "ДФ=dd.MM.yyyy") + " г.";
							ОбластьШапкаТекстОтмены.Параметры.Условия = "по процентным ставкам за пользование займом";
							ОбластьШапкаТекстОтмены.Параметры.НомерПриказа = СтрОтмен.ДокументСтавки.НомерПриказа;
							ОбластьШапкаТекстОтмены.Параметры.ДатаПриказа = Формат(СтрОтмен.ДокументСтавки.Дата, "ДФ=dd.MM.yyyy") + " г.";
							ОбластьШапкаТекстОтмены.Параметры.ТекстКлиент = "клиента " + СтрОтмен.Залогодатель.Наименование;
							ТабличныйДокумент.Вывести(ОбластьШапкаТекстОтмены);
							
							НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
							ТабличныйДокумент.Область(НомерСтр, 1, НомерСтр, КолКолонок + ДобавитьКолонок).Объединить();
						КонецЕсли;
						
						НомПП = НомПП + 1;
					КонецЦикла;
				КонецЕсли;
				
				Ставки = Истина;
			КонецЕсли;
			
			Если ТЗМеталлы.Количество() > 0 Тогда
				Если ТЗМеталлОтменяемые.Количество() = 1 И ТЗМеталлОтменяемые[0].ИспользуютсяМаталлы Тогда
					Если Ставки Тогда
						ОбластьШапкаТекстОтмены = Макет.ПолучитьОбласть("ТекстОтмены|КолонкаОсновная");
					Иначе
						ОбластьШапкаТекстОтмены = Макет.ПолучитьОбласть("ШапкаТекстОтмены|КолонкаОсновная");
					КонецЕсли;
					
					ОбластьШапкаТекстОтмены.Параметры.ДатаНачалаДействия = Формат(ВыборкаДанныеДокументов.ДатаНачалаДействияПриказа, "ДФ=dd.MM.yyyy") + " г.";
					ОбластьШапкаТекстОтмены.Параметры.Условия = "по условиям оценки драгоценных металлов";
					ОбластьШапкаТекстОтмены.Параметры.НомерПриказа = ТЗМеталлОтменяемые[0].ДокументМеталлы.НомерПриказа;
					ОбластьШапкаТекстОтмены.Параметры.ДатаПриказа = Формат(ТЗМеталлОтменяемые[0].ДокументМеталлы.Дата, "ДФ=dd.MM.yyyy") + " г.";
					
					ТекстЗ = "";
					НомПП = 1;
					
					Для каждого СтрЗ Из ТЗДанныеЗалогодателя Цикл
						Если ТЗДанныеЗалогодателя.Количество() > 1 Тогда
							ФИОПослеСклонения = СклонениеПредставленийОбъектов.ПросклонятьФИО(СтрЗ.Залогодатель.Наименование, 2, СтрЗ.Залогодатель,
							?(СтрЗ.Пол = Перечисления.ПолФизическогоЛица.Мужской, 1, 2));
							
							ТекстЗ = ?(ТекстЗ = "", "клиентов " + ФИОПослеСклонения + ", ",
							?(ТЗЗалогодателиСУсловиями.Количество() = НомПП + 1, ТекстЗ + ФИОПослеСклонения + ", ",
							ТекстЗ + ФИОПослеСклонения));
							
							НомПП = НомПП + 1;
						Иначе
							ТекстЗ = "клиента " + СтрЗ.Залогодатель.Наименование;
						КонецЕсли;
					КонецЦикла;
					
					ОбластьШапкаТекстОтмены.Параметры.ТекстКлиент = ТекстЗ;
					ТабличныйДокумент.Вывести(ОбластьШапкаТекстОтмены);
					
					НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
					ТабличныйДокумент.Область(НомерСтр, 1, НомерСтр, КолКолонок + ДобавитьКолонок).Объединить();
				Иначе
				//Если разные документы по предыдущим условиям
					НомПП = 1;
					
					Для каждого СтрОтмен Из ТЗЗалогодателиСУсловиями Цикл
						Если СтрОтмен.ИспользуютсяМаталлы Тогда
							Если Ставки Тогда
								ОбластьШапкаТекстОтмены = Макет.ПолучитьОбласть("ТекстОтмены|КолонкаОсновная");
							Иначе
								Если НомПП = 1 Тогда
									ОбластьШапкаТекстОтмены = Макет.ПолучитьОбласть("ШапкаТекстОтмены|КолонкаОсновная");
								Иначе
									ОбластьШапкаТекстОтмены = Макет.ПолучитьОбласть("ТекстОтмены|КолонкаОсновная");
								КонецЕсли;
							КонецЕсли;
							
							ОбластьШапкаТекстОтмены.Параметры.ДатаНачалаДействия = Формат(ВыборкаДанныеДокументов.ДатаНачалаДействияПриказа, "ДФ=dd.MM.yyyy") + " г.";
							ОбластьШапкаТекстОтмены.Параметры.Условия = "по условиям оценки драгоценных металлов";
							ОбластьШапкаТекстОтмены.Параметры.НомерПриказа = СтрОтмен.ДокументМеталлы.НомерПриказа;
							ОбластьШапкаТекстОтмены.Параметры.ДатаПриказа = Формат(СтрОтмен.ДокументМеталлы.Дата, "ДФ=dd.MM.yyyy") + " г.";
							ОбластьШапкаТекстОтмены.Параметры.ТекстКлиент = "клиента " + СтрОтмен.Залогодатель.Наименование;
							ТабличныйДокумент.Вывести(ОбластьШапкаТекстОтмены);
							
							НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
							ТабличныйДокумент.Область(НомерСтр, 1, НомерСтр, КолКолонок + ДобавитьКолонок).Объединить();
						КонецЕсли;
						
						НомПП = НомПП + 1;
					КонецЦикла;
				КонецЕсли;
				
				Металлы = Истина;
			КонецЕсли;
			
			Если ТЗВставки.Количество() > 0 Тогда
				Если ТЗВставкиОтменяемые.Количество() = 1 И ТЗВставкиОтменяемые[0].ИспользуютсяВставки Тогда
					Если Ставки ИЛИ Металлы Тогда
						ОбластьШапкаТекстОтмены = Макет.ПолучитьОбласть("ТекстОтмены|КолонкаОсновная");
					Иначе
						ОбластьШапкаТекстОтмены = Макет.ПолучитьОбласть("ШапкаТекстОтмены|КолонкаОсновная");
					КонецЕсли;
					
					ОбластьШапкаТекстОтмены.Параметры.ДатаНачалаДействия = Формат(ВыборкаДанныеДокументов.ДатаНачалаДействияПриказа, "ДФ=dd.MM.yyyy") + " г.";
					ОбластьШапкаТекстОтмены.Параметры.Условия = "по условиям оценки драгоценных камней";
					ОбластьШапкаТекстОтмены.Параметры.НомерПриказа = ТЗВставкиОтменяемые[0].ДокументВставки.НомерПриказа;
					ОбластьШапкаТекстОтмены.Параметры.ДатаПриказа = Формат(ТЗВставкиОтменяемые[0].ДокументВставки.Дата, "ДФ=dd.MM.yyyy") + " г.";
					
					ТекстЗ = "";
					НомПП = 1;
					
					Для каждого СтрЗ Из ТЗДанныеЗалогодателя Цикл
						Если ТЗДанныеЗалогодателя.Количество() > 1 Тогда
							ФИОПослеСклонения = СклонениеПредставленийОбъектов.ПросклонятьФИО(СтрЗ.Залогодатель.Наименование, 2, СтрЗ.Залогодатель,
							?(СтрЗ.Пол = Перечисления.ПолФизическогоЛица.Мужской, 1, 2));
							
							ТекстЗ = ?(ТекстЗ = "", "клиентов " + ФИОПослеСклонения + ", ",
							?(ТЗЗалогодателиСУсловиями.Количество() = НомПП + 1, ТекстЗ + ФИОПослеСклонения + ", ",
							ТекстЗ + ФИОПослеСклонения));
							
							НомПП = НомПП + 1;
						Иначе
							ТекстЗ = "клиента " + СтрЗ.Залогодатель.Наименование;
						КонецЕсли;
					КонецЦикла;
					
					ОбластьШапкаТекстОтмены.Параметры.ТекстКлиент = ТекстЗ;
					ТабличныйДокумент.Вывести(ОбластьШапкаТекстОтмены);
					
					НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
					ТабличныйДокумент.Область(НомерСтр, 1, НомерСтр, КолКолонок + ДобавитьКолонок).Объединить();
				Иначе
				//Если разные документы по предыдущим условиям
					НомПП = 1;
					
					Для каждого СтрОтмен Из ТЗЗалогодателиСУсловиями Цикл
						Если СтрОтмен.ИспользуютсяВставки Тогда
							Если Ставки ИЛИ Металлы Тогда
								ОбластьШапкаТекстОтмены = Макет.ПолучитьОбласть("ТекстОтмены|КолонкаОсновная");
							Иначе
								Если НомПП = 1 Тогда
									ОбластьШапкаТекстОтмены = Макет.ПолучитьОбласть("ШапкаТекстОтмены|КолонкаОсновная");
								Иначе
									ОбластьШапкаТекстОтмены = Макет.ПолучитьОбласть("ТекстОтмены|КолонкаОсновная");
								КонецЕсли;
							КонецЕсли;
							
							ОбластьШапкаТекстОтмены.Параметры.ДатаНачалаДействия = Формат(ВыборкаДанныеДокументов.ДатаНачалаДействияПриказа, "ДФ=dd.MM.yyyy") + " г.";
							ОбластьШапкаТекстОтмены.Параметры.Условия = "по условиям оценки драгоценных камней";
							ОбластьШапкаТекстОтмены.Параметры.НомерПриказа = СтрОтмен.ДокументВставки.НомерПриказа;
							ОбластьШапкаТекстОтмены.Параметры.ДатаПриказа = Формат(СтрОтмен.ДокументВставки.Дата, "ДФ=dd.MM.yyyy") + " г.";
							ОбластьШапкаТекстОтмены.Параметры.ТекстКлиент = "клиента " + СтрОтмен.Залогодатель.Наименование;
							ТабличныйДокумент.Вывести(ОбластьШапкаТекстОтмены);
							
							НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
							ТабличныйДокумент.Область(НомерСтр, 1, НомерСтр, КолКолонок + ДобавитьКолонок).Объединить();
						КонецЕсли;
						
						НомПП = НомПП + 1;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;

			//Вывод инвормации об установке новых условий
			ОбластьШапкаТекст = Макет.ПолучитьОбласть("ТекстЗаемщик|КолонкаОсновная");
			
			ТабличныйДокумент.Вывести(ОбластьШапкаТекст);
			
			НомерСтр = ТабличныйДокумент.ВысотаТаблицы;

			ТабличныйДокумент.Область(НомерСтр, 1, НомерСтр, КолКолонок + ДобавитьКолонок).Объединить();
			
			Нпп = 1;
			
			Для каждого СтрЗ Из ТЗДанныеЗалогодателя Цикл
				ОбластьШапкаЗаемщик = Макет.ПолучитьОбласть("ШапкаЗаемщик|КолонкаОсновная");
				
				ОбластьШапкаЗаемщик.Параметры.Нпп = ?(ТЗДанныеЗалогодателя.Количество() > 1, "2." + Нпп + " ", "");
				ОбластьШапкаЗаемщик.Параметры.Залогодатель = СтрЗ.Залогодатель.Наименование;
				ОбластьШапкаЗаемщик.Параметры.Датарождения = Формат(СтрЗ.ДатаРождения, "ДФ=dd.MM.yyyy");
				//ОбластьШапкаЗаемщик.Параметры.ПаспортныеДанные = "" + СтрЗ.ДокументЗалогодателя // + ", выдан "
				////+ Формат(СтрЗ.ДокументДатаВыдачи, "ДФ=dd.MM.yyyy")
				//+ ", " + СтрЗ.ДокументКемВыдан + " " + СтрЗ.ДокументКодПодразделения;
				ОбластьШапкаЗаемщик.Параметры.ПаспортныеДанные = "" + СтрЗ.ВидДокумента
				+ ?(ЗначениеЗаполнено(СтрЗ.Серия), " серия " + СтрЗ.Серия, "")
				+ " №" + СтрЗ.Номер + ", выдан " + Формат(СтрЗ.ДатаВыдачи, "ДФ=dd.MM.yyyy") + " г. "
				+ СтрЗ.КемВыдан + ?(ЗначениеЗаполнено(СтрЗ.КодПодразделения), ", код подразделения " + СтрЗ.КодПодразделения, "")
				+ ?(ЗначениеЗаполнено(СтрЗ.СрокДействия), ", срок действия " + Формат(СтрЗ.СрокДействия, "ДФ=dd.MM.yyyy") + " г. ", "");
				
				ТабличныйДокумент.Вывести(ОбластьШапкаЗаемщик);
				
				НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
				
				ТабличныйДокумент.Область(НомерСтр - 1, 1, НомерСтр - 1, КолКолонок + ДобавитьКолонок).Объединить();
				ТабличныйДокумент.Область(НомерСтр, 1, НомерСтр, КолКолонок + ДобавитьКолонок).Объединить();
				
				Нпп = Нпп + 1;
			КонецЦикла;
			
			ОбластьШапкаПодвал = Макет.ПолучитьОбласть("ШапкаПодвал|КолонкаОсновная");
			ТабличныйДокумент.Вывести(ОбластьШапкаПодвал);
			
			НомПП = 1;
			
			//Заполняем ставки
			Если ТЗСК.Количество() > 0 Тогда
				
				Если ТЗСтавки.Количество() > 0 Тогда
					ОбластьТекстСтавки = Макет.ПолучитьОбласть("ТекстСтавки|КолонкаОсновная");
					
					Если ПорядковыйНомер = 0 Тогда
						ОбластьТекстСтавки.Параметры.Нпп = "3.1 ";
						ПорядковыйНомер = 1;
					КонецЕсли;
					
					ТабличныйДокумент.Вывести(ОбластьТекстСтавки);
				КонецЕсли;
				
				Для каждого СтрСК Из ТЗСК Цикл
					Отбор = Новый Структура;
					Отбор.Вставить("СхемаКредитования", СтрСК.СхемаКредитования);
					
					СтрокиС = ТЗСтавки.НайтиСтроки(Отбор);
					
					Если СтрокиС.Количество() > 0 Тогда
						
						//Добавляем колонки заголовка
						Инд = 1;
						
						Для каждого СтрС Из СтрокиС Цикл
							Если Инд = 1 Тогда
								ОбластьЗаголовокСтавки = Макет.ПолучитьОбласть("ЗаголовокСтавки|НачалоТаблицы");
								ОбластьЗаголовокСтавки.Параметры.НомерПП = НомПП;
								ОбластьЗаголовокСтавки.Параметры.СК = СтрС.СхемаКредитования.НаименованиеДляПечати;
								ОбластьЗаголовокСтавки.Параметры.Диапазон = СтрС.ДиапазонСумм;
								ТабличныйДокумент.Вывести(ОбластьЗаголовокСтавки);
								Инд = Инд + 1;
								НомПП = НомПП + 1;
							Иначе
								ОбластьЗаголовокСтавки = Макет.ПолучитьОбласть("ЗаголовокСтавки|КолонкаСтавка");
								ОбластьЗаголовокСтавки.Параметры.Диапазон = СтрС.ДиапазонСумм;
								ТабличныйДокумент.Присоединить(ОбластьЗаголовокСтавки);
							КонецЕсли;
						КонецЦикла;
						
						//Обединяем заголовок
						НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
						ТабличныйДокумент.Область(НомерСтр - 2, 1, НомерСтр - 2, СтрокиС.Количество()).Объединить();
						
						//Добавляем колонки строк
						Инд = 1;
						
						Для каждого СтрС Из СтрокиС Цикл
							Если Инд = 1 Тогда
								ОбластьСтрокаСтавки = Макет.ПолучитьОбласть("СтрокаСтавки|НачалоТаблицы");
								ОбластьСтрокаСтавки.Параметры.Ставка = СтрС.Ставка;
								ТабличныйДокумент.Вывести(ОбластьСтрокаСтавки);
								Инд = Инд + 1;
							Иначе
								ОбластьСтрокаСтавки = Макет.ПолучитьОбласть("СтрокаСтавки|КолонкаСтавка");
								ОбластьСтрокаСтавки.Параметры.Ставка = СтрС.Ставка;
								ТабличныйДокумент.Присоединить(ОбластьСтрокаСтавки);
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
				
				//Обрабатываем металлы
				Для каждого СтрСК Из ТЗСК Цикл
					ОтборСК = Новый Структура;
					ОтборСК.Вставить("СхемаКредитования", СтрСК.СхемаКредитования);
					
					ТЗМетСК = ТЗМеталлы.Скопировать(ОтборСК,);
					
					Если ТЗМетСК.Количество() > 0 Тогда
						ОтборОтклонение = Новый Структура;
						ОтборОтклонение.Вставить("ОтклонениеОтБазовойЦены", Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Относительное);
						
						ТЗОтн = ТЗМетСК.Скопировать(ОтборОтклонение,);
						
						ТаблицаМеталловОтн = ТЗОтн.Скопировать();
						ТаблицаМеталловОтн.Свернуть("КатегорияОбъектаЗалога, Металл, ЗначениеОтклонения, СхемаКредитования");
						
						ОтборОтклонение = Новый Структура;
						ОтборОтклонение.Вставить("ОтклонениеОтБазовойЦены", Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Абсолютное);
						
						ТЗАбс = ТЗМетСК.Скопировать(ОтборОтклонение,);
						
						ТаблицаМеталловАбс = ТЗАбс.Скопировать();
						ТаблицаМеталловАбс.Свернуть("КатегорияОбъектаЗалога, Металл, ЗначениеОтклонения, СхемаКредитования");
						
						Если ТЗОтн.Количество() > 0 Тогда
							ТЗОтнМет = ТЗОтн.Скопировать();
							ТЗОтнМет.Свернуть("Металл");
							ТЗОтнМет.Сортировать("Металл Возр");
							
							Инд = 1;
							
							Если Инд = 1 Тогда
								ОбластьТекстМеталлыСК = Макет.ПолучитьОбласть("ТекстМеталлСК|КолонкаОсновная");
								
								Если ПорядковыйНомер = 1 Тогда
									ОбластьТекстМеталлыСК.Параметры.Нпп = "3.2 ";
									ПорядковыйНомер = 2;
								ИначеЕсли ПорядковыйНомер = 0 Тогда
									ОбластьТекстМеталлыСК.Параметры.Нпп = "3.1 ";
									ПорядковыйНомер = 2;
								КонецЕсли;

								ОбластьТекстМеталлыСК.Параметры.НаименованиеСК = СтрСК.СхемаКредитования.НаименованиеДляПечати;
								ТабличныйДокумент.Вывести(ОбластьТекстМеталлыСК);
								Инд = Инд + 1;
							КонецЕсли;
							
							НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
							
							ТабличныйДокумент.Область(НомерСтр, 1, НомерСтр, КолКолонок + ДобавитьКолонок).Объединить();
							
							ТекстМет = "";
							Для каждого СтрМетОтн Из ТЗОтнМет Цикл
								МассивСклонения = ПолучитьСклоненияСтроки(НРег(СтрМетОтн.Металл.Наименование), "Л=ru_RU", "ПД=Родительный");
								ТекстМет = ?(ТекстМет = "", МассивСклонения[0], ТекстМет + ", " + МассивСклонения[0]);
							КонецЦикла;
							
							ОбластьТекстМеталл = Макет.ПолучитьОбласть("ТекстМеталл|КолонкаОсновная");
							ОбластьТекстМеталл.Параметры.Металл = ТекстМет;
							ТабличныйДокумент.Вывести(ОбластьТекстМеталл);
							
							
							ОбластьЗаголовокМеталлы = Макет.ПолучитьОбласть("ЗаголовокМеталлы|КолонкаОсновная");

							//Определяем влазиет на страницу или нет
							//СтрокаМетДляПроверки = Макет.ПолучитьОбласть("СтрокаМеталлы|КолонкаОсновная");

							//СтрокиДокумента = Новый Массив;
							//СтрокиДокумента.Добавить(ОбластьТекстМеталл);
							//СтрокиДокумента.Добавить(ОбластьЗаголовокМеталлы);
							//СтрокиДокумента.Добавить(СтрокаМетДляПроверки);
							//СтрокиДокумента.Добавить(СтрокаМетДляПроверки);
							//
							//Если НЕ ТабличныйДокумент.ПроверитьВывод(СтрокиДокумента) Тогда
							//	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
							//КонецЕсли;
							//
							
							ТабличныйДокумент.Вывести(ОбластьЗаголовокМеталлы);
							
							//Заполняем шапку заголовка таблицы
							НомерКолонки = 2;
							Для каждого СтрМетОтн Из ТЗОтнМет Цикл
								ОбластьЗаголовокМеталлыДоп = Макет.ПолучитьОбласть("ЗаголовокМеталлы|КолонкаДопВ");
								
								Если НомерКолонки = 2 Тогда
									ОбластьЗаголовокМеталлыДоп.Параметры.Отклонение = "Увеличение суммы оценки за грамм драгоценного металла в % от базовой оценки";
								КонецЕсли;
								
								ОбластьЗаголовокМеталлыДоп.Параметры.Металл = СтрМетОтн.Металл.Наименование;
								ТабличныйДокумент.Присоединить(ОбластьЗаголовокМеталлыДоп);
								
								НомерКолонки = НомерКолонки + 1;
							КонецЦикла;
							
							НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
							
							//Подготавливаем ТЗ для заполнения строк
							Если ТЗОтнМет.Количество() > 1 Тогда
								ТабличныйДокумент.Область(НомерСтр - 2, 3, НомерСтр - 1, НомерКолонки + ТЗОтнМет.Количество()).Объединить();
								
								ПромежуточнаяТабМет = ТаблицаМеталловОтн.Скопировать();

								КоличествоМеталлов = ТЗОтнМет.Количество();
								
								ТЗРезультат = ПромежуточнаяТабМет.Скопировать(,"КатегорияОбъектаЗалога, ЗначениеОтклонения");
								ТЗРезультат.Очистить();
								
								Для Сч = 0 По КоличествоМеталлов - 1 Цикл
									Отбор = Новый Структура;
									Отбор.Вставить("Металл", ТЗОтнМет[Сч].Металл);
									
									Если ТЗРезультат.Количество() = 0 Тогда
										ТЗРезультат = ПромежуточнаяТабМет.Скопировать(Отбор,);
										ТЗРезультат.Сортировать("КатегорияОбъектаЗалога Возр");
									Иначе
										ПромежуточнаяТабМет2 = ПромежуточнаяТабМет.Скопировать(Отбор,);
										ПромежуточнаяТабМет2.Сортировать("КатегорияОбъектаЗалога Возр");
										
										//Добавляем колонку в которую потом загрузим данные нового металла
										ТЗРезультат.Колонки.Добавить("ЗначениеОтклонения" + ТЗОтнМет[Сч].Металл.Наименование);
										
										Для каждого СтрПромежуточная Из ПромежуточнаяТабМет2 Цикл
											НайденнаяСтр = ТЗРезультат.Найти(СтрПромежуточная.КатегорияОбъектаЗалога, "КатегорияОбъектаЗалога");
											
											Если НайденнаяСтр = Неопределено Тогда
												НаяСтр = ТЗРезультат.Добавить();
												НаяСтр.КатегорияОбъектаЗалога = СтрПромежуточная.КатегорияОбъектаЗалога;
												НаяСтр["ЗначениеОтклонения" + ТЗОтнМет[Сч].Металл.Наименование] = СтрПромежуточная.ЗначениеОтклонения;
											Иначе
												НайденнаяСтр["ЗначениеОтклонения" + ТЗОтнМет[Сч].Металл.Наименование] = СтрПромежуточная.ЗначениеОтклонения;
											КонецЕсли;
										КонецЦикла;
									КонецЕсли;
								КонецЦикла;
							Иначе
								ТЗРезультат = ТаблицаМеталловОтн.Скопировать();
							КонецЕсли;
							
							//Заполняем строки
							Для каждого СтрРез Из ТЗРезультат Цикл
								ОбластьСтрокаМеталлы = Макет.ПолучитьОбласть("СтрокаМеталлы|КолонкаОсновная");
								ОбластьСтрокаМеталлыДоп = Макет.ПолучитьОбласть("СтрокаМеталлы|КолонкаДопВ");
								
								//Определяем влазиет на страницу или нет
								//СтрокиДокумента = Новый Массив;
								//СтрокиДокумента.Добавить(ОбластьСтрокаМеталлы);
								//
								//Если НЕ ТабличныйДокумент.ПроверитьВывод(СтрокиДокумента) Тогда
								//	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
								//	
								//	ОбластьЗаголовокМеталлы = Макет.ПолучитьОбласть("ЗаголовокМеталлы|КолонкаОсновная");
								//	ТабличныйДокумент.Вывести(ОбластьЗаголовокМеталлы);
								//	
								//	//Заполняем шапку заголовка таблицы
								//	НомерКолонки = 2;
								//	Для каждого СтрМетОтн Из ТЗОтнМет Цикл
								//		ОбластьЗаголовокМеталлыДоп = Макет.ПолучитьОбласть("ЗаголовокМеталлы|КолонкаДопВ");
								//		
								//		Если НомерКолонки = 2 Тогда
								//			ОбластьЗаголовокМеталлыДоп.Параметры.Отклонение = "Увеличение суммы оценки за грамм драгоценного металла в % от базовой оценки";
								//		КонецЕсли;
								//		
								//		ОбластьЗаголовокМеталлыДоп.Параметры.Металл = СтрМетОтн.Металл.Наименование;
								//		ТабличныйДокумент.Присоединить(ОбластьЗаголовокМеталлыДоп);
								//		
								//		НомерКолонки = НомерКолонки + 1;
								//	КонецЦикла;
								//	
								//	Если ТЗОтнМет.Количество() > 1 Тогда
								//		НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
								//		ТабличныйДокумент.Область(НомерСтр - 2, 3, НомерСтр - 1, НомерКолонки + ТЗОтнМет.Количество()).Объединить();
								//	КонецЕсли;
								//КонецЕсли;
								//
								
								ОбластьСтрокаМеталлы.Параметры.Категория = СтрРез.КатегорияОбъектаЗалога;
								ТабличныйДокумент.Вывести(ОбластьСтрокаМеталлы);					
								
								Если ТЗОтнМет.Количество() > 1 Тогда
									КоличествоМеталлов = ТЗОтнМет.Количество();
									Для Сч = 0 По КоличествоМеталлов - 1 Цикл
										Если Сч = 0 Тогда
											ОбластьСтрокаМеталлыДоп.Параметры.ЗнчОтклонения = СтрРез.ЗначениеОтклонения;
										Иначе
											ОбластьСтрокаМеталлыДоп.Параметры.ЗнчОтклонения = СтрРез["ЗначениеОтклонения" + ТЗОтнМет[Сч].Металл.Наименование];
										КонецЕсли;
										
										ТабличныйДокумент.Присоединить(ОбластьСтрокаМеталлыДоп);
									КонецЦикла;
								Иначе
									ОбластьСтрокаМеталлыДоп.Параметры.ЗнчОтклонения = СтрРез.ЗначениеОтклонения;
									ТабличныйДокумент.Присоединить(ОбластьСтрокаМеталлыДоп);
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
						
						Если ТЗАбс.Количество() > 0 Тогда
							
							ТЗАбсМет = ТЗАбс.Скопировать();
							ТЗАбсМет.Свернуть("Металл");
							ТЗАбсМет.Сортировать("Металл Возр");
							
							Инд = 1;
							
							Если Инд = 1 Тогда
								ОбластьТекстМеталлыСК = Макет.ПолучитьОбласть("ТекстМеталлСК|КолонкаОсновная");

								Если ПорядковыйНомер = 1 Тогда
									ОбластьТекстМеталлыСК.Параметры.Нпп = "3.2 ";
									ПорядковыйНомер = 2;
								ИначеЕсли ПорядковыйНомер = 2 Тогда
									ОбластьТекстМеталлыСК.Параметры.Нпп = "";
									ПорядковыйНомер = 2;
								ИначеЕсли ПорядковыйНомер = 0 Тогда
									ОбластьТекстМеталлыСК.Параметры.Нпп = "3.1 ";
									ПорядковыйНомер = 2;
								КонецЕсли;
								
								ОбластьТекстМеталлыСК.Параметры.НаименованиеСК = СтрСК.СхемаКредитования.НаименованиеДляПечати;
								ТабличныйДокумент.Вывести(ОбластьТекстМеталлыСК);
								Инд = Инд + 1;
							КонецЕсли;
							
							НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
							
							ТабличныйДокумент.Область(НомерСтр, 1, НомерСтр, КолКолонок + ДобавитьКолонок).Объединить();
							
							ТекстМет = "";
							Для каждого СтрМетАбс Из ТЗАбсМет Цикл
								МассивСклонения = ПолучитьСклоненияСтроки(НРег(СтрМетАбс.Металл.Наименование), "Л=ru_RU", "ПД=Родительный");
								ТекстМет = ?(ТекстМет = "", МассивСклонения[0], ТекстМет + ", " + МассивСклонения[0]);
							КонецЦикла;
							
							ОбластьТекстМеталл = Макет.ПолучитьОбласть("ТекстМеталл|КолонкаОсновная");
							ОбластьТекстМеталл.Параметры.Металл = ТекстМет;
							ТабличныйДокумент.Вывести(ОбластьТекстМеталл);
							
							
							ОбластьЗаголовокМеталлы = Макет.ПолучитьОбласть("ЗаголовокМеталлы|КолонкаОсновная");
							
							//Определяем влазиет на страницу или нет
							//СтрокаМетДляПроверки = Макет.ПолучитьОбласть("СтрокаМеталлы|КолонкаОсновная");

							//СтрокиДокумента = Новый Массив;
							//СтрокиДокумента.Добавить(ОбластьТекстМеталл);
							//СтрокиДокумента.Добавить(ОбластьЗаголовокМеталлы);
							//СтрокиДокумента.Добавить(СтрокаМетДляПроверки);
							//СтрокиДокумента.Добавить(СтрокаМетДляПроверки);
							//
							//Если НЕ ТабличныйДокумент.ПроверитьВывод(СтрокиДокумента) Тогда
							//	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
							//КонецЕсли;
							//
							
							ТабличныйДокумент.Вывести(ОбластьЗаголовокМеталлы);
							
							//Заполняем шапку заголовка таблицы
							НомерКолонки = 2;
							Для каждого СтрМетАбс Из ТЗАбсМет Цикл
								ОбластьЗаголовокМеталлыДоп = Макет.ПолучитьОбласть("ЗаголовокМеталлы|КолонкаДопВ");
								
								Если НомерКолонки = 2 Тогда
									ОбластьЗаголовокМеталлыДоп.Параметры.Отклонение = "Увеличение суммы оценки за грамм драгоценного металла в руб. от базовой оценки";
								КонецЕсли;
								
								ОбластьЗаголовокМеталлыДоп.Параметры.Металл = СтрМетАбс.Металл.Наименование;
								ТабличныйДокумент.Присоединить(ОбластьЗаголовокМеталлыДоп);
								
								НомерКолонки = НомерКолонки + 1;
							КонецЦикла;
							
							НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
							
							//Подготавливаем ТЗ для заполнения строк
							Если ТЗАбсМет.Количество() > 1 Тогда
								ТабличныйДокумент.Область(НомерСтр - 2, 3, НомерСтр - 1, НомерКолонки + ТЗАбсМет.Количество()).Объединить();
								
								ПромежуточнаяТабМет = ТаблицаМеталловАбс.Скопировать();

								КоличествоМеталлов = ТЗАбсМет.Количество();
								
								ТЗРезультат = ПромежуточнаяТабМет.Скопировать(,"КатегорияОбъектаЗалога, ЗначениеОтклонения");
								ТЗРезультат.Очистить();
								
								Для Сч = 0 По КоличествоМеталлов - 1 Цикл
									Отбор = Новый Структура;
									Отбор.Вставить("Металл", ТЗАбсМет[Сч].Металл);
									
									Если ТЗРезультат.Количество() = 0 Тогда
										ТЗРезультат = ПромежуточнаяТабМет.Скопировать(Отбор,);
										ТЗРезультат.Сортировать("КатегорияОбъектаЗалога Возр");
									Иначе
										ПромежуточнаяТабМет2 = ПромежуточнаяТабМет.Скопировать(Отбор,);
										ПромежуточнаяТабМет2.Сортировать("КатегорияОбъектаЗалога Возр");
										
										//Добавляем колонку в которую потом загрузим данные нового металла
										ТЗРезультат.Колонки.Добавить("ЗначениеОтклонения" + ТЗАбсМет[Сч].Металл.Наименование);
										
										Для каждого СтрПромежуточная Из ПромежуточнаяТабМет2 Цикл
											НайденнаяСтр = ТЗРезультат.Найти(СтрПромежуточная.КатегорияОбъектаЗалога, "КатегорияОбъектаЗалога");
											
											Если НайденнаяСтр = Неопределено Тогда
												НаяСтр = ТЗРезультат.Добавить();
												НаяСтр.КатегорияОбъектаЗалога = СтрПромежуточная.КатегорияОбъектаЗалога;
												НаяСтр["ЗначениеОтклонения" + ТЗАбсМет[Сч].Металл.Наименование] = СтрПромежуточная.ЗначениеОтклонения;
											Иначе
												НайденнаяСтр["ЗначениеОтклонения" + ТЗАбсМет[Сч].Металл.Наименование] = СтрПромежуточная.ЗначениеОтклонения;
											КонецЕсли;
										КонецЦикла;
									КонецЕсли;
								КонецЦикла;
							Иначе
								ТЗРезультат = ТаблицаМеталловАбс.Скопировать();
							КонецЕсли;
							
							//Заполняем строки
							Для каждого СтрРез Из ТЗРезультат Цикл
								ОбластьСтрокаМеталлы = Макет.ПолучитьОбласть("СтрокаМеталлы|КолонкаОсновная");
								ОбластьСтрокаМеталлыДоп = Макет.ПолучитьОбласть("СтрокаМеталлы|КолонкаДопВ");
								
								//Определяем влазиет на страницу или нет
								//СтрокиДокумента = Новый Массив;
								//СтрокиДокумента.Добавить(ОбластьСтрокаМеталлы);
								//
								//Если НЕ ТабличныйДокумент.ПроверитьВывод(СтрокиДокумента) Тогда
								//	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
								//	
								//	ОбластьЗаголовокМеталлы = Макет.ПолучитьОбласть("ЗаголовокМеталлы|КолонкаОсновная");
								//	ТабличныйДокумент.Вывести(ОбластьЗаголовокМеталлы);
								//	
								//	//Заполняем шапку заголовка таблицы
								//	НомерКолонки = 2;
								//	Для каждого СтрМетАбс Из ТЗАбсМет Цикл
								//		ОбластьЗаголовокМеталлыДоп = Макет.ПолучитьОбласть("ЗаголовокМеталлы|КолонкаДопВ");
								//		
								//		Если НомерКолонки = 2 Тогда
								//			ОбластьЗаголовокМеталлыДоп.Параметры.Отклонение = "Увеличение суммы оценки за грамм драгоценного металла в руб. от базовой оценки";
								//		КонецЕсли;
								//		
								//		ОбластьЗаголовокМеталлыДоп.Параметры.Металл = СтрМетАбс.Металл.Наименование;
								//		ТабличныйДокумент.Присоединить(ОбластьЗаголовокМеталлыДоп);
								//		
								//		НомерКолонки = НомерКолонки + 1;
								//	КонецЦикла;
								//	
								//	Если ТЗАбсМет.Количество() > 1 Тогда
								//		НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
								//		ТабличныйДокумент.Область(НомерСтр - 2, 3, НомерСтр - 1, НомерКолонки + ТЗАбсМет.Количество()).Объединить();
								//	КонецЕсли;
								//КонецЕсли;
								//
								
								ОбластьСтрокаМеталлы.Параметры.Категория = СтрРез.КатегорияОбъектаЗалога;
								ТабличныйДокумент.Вывести(ОбластьСтрокаМеталлы);					
								
								Если ТЗАбсМет.Количество() > 1 Тогда
									КоличествоМеталлов = ТЗАбсМет.Количество();
									Для Сч = 0 По КоличествоМеталлов - 1 Цикл
										Если Сч = 0 Тогда
											ОбластьСтрокаМеталлыДоп.Параметры.ЗнчОтклонения = СтрРез.ЗначениеОтклонения;
										Иначе
											ОбластьСтрокаМеталлыДоп.Параметры.ЗнчОтклонения = СтрРез["ЗначениеОтклонения" + ТЗАбсМет[Сч].Металл.Наименование];
										КонецЕсли;
										
										ТабличныйДокумент.Присоединить(ОбластьСтрокаМеталлыДоп);
									КонецЦикла;
								Иначе
									ОбластьСтрокаМеталлыДоп.Параметры.ЗнчОтклонения = СтрРез.ЗначениеОтклонения;
									ТабличныйДокумент.Присоединить(ОбластьСтрокаМеталлыДоп);
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
				//Обрабатываем камни
				Для каждого СтрСК Из ТЗСК Цикл
					
					Отбор = Новый Структура;
					Отбор.Вставить("ВидВставки", Справочники.ЛБ_ДрагоценныеКамни.Бриллиант);
					Отбор.Вставить("СхемаКредитования", СтрСК.СхемаКредитования);
					Отбор.Вставить("ОтклонениеОтБазовойЦены", Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Относительное);
					
					ТЗОтнСК = ТЗВставки.Скопировать(Отбор,);
					
					ТЗОтн = ТЗОтнСК.Скопировать();
					
					ТЗОтнСК.Свернуть("СхемаКредитования");
					ТЗОтнСК.Сортировать("СхемаКредитования Возр");
					
					Отбор.Вставить("ОтклонениеОтБазовойЦены", Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Абсолютное);
					
					ТЗАбсСК = ТЗВставки.Скопировать(Отбор,);
					
					ТЗАбс = ТЗАбсСК.Скопировать();
					
					ТЗАбсСК.Свернуть("СхемаКредитования");
					ТЗАбсСК.Сортировать("СхемаКредитования Возр");
					
					Если ТЗОтнСК.Количество() > 0 Тогда
						
						//Заполняем Текст и ТЧ относительно вида отклонений
						Для каждого СтрОтнСК Из ТЗОтнСК Цикл
							
							ТЗОтнВст = ТЗОтн.Скопировать();
							
							Инд = 1;
							
							Если Инд = 1 Тогда
								ОбластьТекстВставки = Макет.ПолучитьОбласть("ТекстВставка|КолонкаОсновная");

								Если ПорядковыйНомер = 2 Тогда
									ОбластьТекстВставки.Параметры.Нпп = "3.3 ";
									ПорядковыйНомер = 3;
								ИначеЕсли ПорядковыйНомер = 1 Тогда
									ОбластьТекстВставки.Параметры.Нпп = "3.2 ";
									ПорядковыйНомер = 3;
								ИначеЕсли ПорядковыйНомер = 0 Тогда
									ОбластьТекстВставки.Параметры.Нпп = "3.1 ";
									ПорядковыйНомер = 3;
								КонецЕсли;
								
								ОбластьТекстВставки.Параметры.НаименованиеСК = СтрОтнСК.СхемаКредитования.НаименованиеДляПечати;
								ТабличныйДокумент.Вывести(ОбластьТекстВставки);
								Инд = Инд + 1;
							КонецЕсли;
							
							НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
							
							ТабличныйДокумент.Область(НомерСтр, 1, НомерСтр, КолКолонок + ДобавитьКолонок).Объединить(); //Было НомерКолонки-2
							
							ОбластьЗаголовокВставки = Макет.ПолучитьОбласть("ЗаголовокВставки|КолонкаОсновная");
							
							//Определяем влазиет на страницу или нет
							//СтрокаВстДляПроверки = Макет.ПолучитьОбласть("СтрокаВставки|КолонкаОсновная");
							//
							//СтрокиДокумента = Новый Массив;
							//СтрокиДокумента.Добавить(ОбластьЗаголовокВставки);
							//СтрокиДокумента.Добавить(СтрокаВстДляПроверки);
							//
							//Если НЕ ТабличныйДокумент.ПроверитьВывод(СтрокиДокумента) Тогда
							//	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
							//КонецЕсли;
							//
							
							ТабличныйДокумент.Вывести(ОбластьЗаголовокВставки);
							
							НомерКолонки = 2;
							Для каждого СтрВстОтн Из ТЗОтнВст Цикл
								ОбластьЗаголовокВставкиДоп = Макет.ПолучитьОбласть("ЗаголовокВставки|КолонкаДопВ");
								
								Если НомерКолонки = 2 Тогда
									ОбластьЗаголовокВставкиДоп.Параметры.Отклонение = "Увеличение суммы оценки  за 1 карат в % от базовой оценки";
								КонецЕсли;
								
								ОбластьЗаголовокВставкиДоп.Параметры.Качество = СтрВстОтн.КачествоОгранки.Наименование;
								ОбластьЗаголовокВставкиДоп.Параметры.ВидОгранки = СтрВстОтн.ВидОгранки.Наименование;
								ТабличныйДокумент.Присоединить(ОбластьЗаголовокВставкиДоп);
								
								НомерКолонки = НомерКолонки + 1;
							КонецЦикла;
							
							НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
							
							МассивУдаления.Очистить();
							
							//Подготовка данных для заполнения строк
							Если ТЗОтнВст.Количество() > 1 Тогда
								ТабличныйДокумент.Область(НомерСтр - 4, 3, НомерСтр - 3, НомерКолонки + ТЗОтнВст.Количество()).Объединить();
								
								ПромежуточнаяТабВст = ТЗОтнВст.Скопировать();
								
								КоличествоКамней = ТЗОтнВст.Количество();
								
								ТЗРезультат = ПромежуточнаяТабВст.Скопировать(,"ВидВставки, ЗначениеОтклонения");
								
								Для Сч = 1 По КоличествоКамней - 1 Цикл
									МассивУдаления.Добавить(ТЗРезультат[Сч]);						
								КонецЦикла;
								
								Если МассивУдаления.Количество() > 0 Тогда
									Для каждого СтрМ Из МассивУдаления Цикл
										ТЗРезультат.Удалить(СтрМ);
									КонецЦикла;
								КонецЕсли;
								
								Для Сч = 1 По КоличествоКамней - 1 Цикл
									ПромежуточнаяТабВст = ТЗОтнВст.Скопировать();
									ПромежуточнаяТабВст.Удалить(0);
									
									//Добавляем колонку в которую потом загрузим данные нового металла
									ТЗРезультат.Колонки.Добавить("ЗначениеОтклонения" + Сч);
									
									Для каждого СтрПромежуточная Из ПромежуточнаяТабВст Цикл
										Стр = ТЗРезультат.Получить(0);
										Стр["ЗначениеОтклонения" + Сч] = СтрПромежуточная.ЗначениеОтклонения;
									КонецЦикла;
								КонецЦикла;
							Иначе
								ТЗРезультат = ТЗОтнВст.Скопировать();
							КонецЕсли;
							
							//Заполнение строк
							Для каждого СтрРез Из ТЗРезультат Цикл
								ОбластьСтрокаВставки = Макет.ПолучитьОбласть("СтрокаВставки|КолонкаОсновная");
								ОбластьСтрокаВставкиДоп = Макет.ПолучитьОбласть("СтрокаВставки|КолонкаДопВ");
								
								ОбластьСтрокаВставки.Параметры.Камень = СтрРез.ВидВставки.Наименование;
								ТабличныйДокумент.Вывести(ОбластьСтрокаВставки);
								
								Если ТЗОтнВст.Количество() > 1 Тогда
									КоличествоКамней = ТЗОтнВст.Количество();
									Для Сч = 0 По КоличествоКамней - 1 Цикл
										Если Сч = 0 Тогда
											ОбластьСтрокаВставкиДоп.Параметры.ЗнчОтклонения = СтрРез.ЗначениеОтклонения;
										Иначе
											ОбластьСтрокаВставкиДоп.Параметры.ЗнчОтклонения = СтрРез["ЗначениеОтклонения" + Сч];
										КонецЕсли;
										
										ТабличныйДокумент.Присоединить(ОбластьСтрокаВставкиДоп);
									КонецЦикла;
								Иначе
									ОбластьСтрокаВставкиДоп.Параметры.ЗнчОтклонения = СтрРез.ЗначениеОтклонения;
									ТабличныйДокумент.Присоединить(ОбластьСтрокаВставкиДоп);
								КонецЕсли;
							КонецЦикла;
						КонецЦикла;
					КонецЕсли;
					
					Если ТЗАбсСК.Количество() > 0 Тогда
						Для каждого СтрАбсСК Из ТЗАбсСК Цикл
							
							ТЗАбсВст = ТЗАбс.Скопировать();
							
							Инд = 1;
							
							Если Инд = 1 Тогда
								ОбластьТекстВставки = Макет.ПолучитьОбласть("ТекстВставка|КолонкаОсновная");

								Если ПорядковыйНомер = 3 Тогда
									ОбластьТекстВставки.Параметры.Нпп = "";
									ПорядковыйНомер = 4;
								ИначеЕсли ПорядковыйНомер = 2 Тогда
									ОбластьТекстВставки.Параметры.Нпп = "3.3 ";
									ПорядковыйНомер = 4;
								ИначеЕсли ПорядковыйНомер = 1 Тогда
									ОбластьТекстВставки.Параметры.Нпп = "3.3 ";
									ПорядковыйНомер = 4;
								ИначеЕсли ПорядковыйНомер = 0 Тогда
									ОбластьТекстВставки.Параметры.Нпп = "3.1 ";
									ПорядковыйНомер = 4;
								КонецЕсли;
								
								ОбластьТекстВставки.Параметры.НаименованиеСК = СтрАбсСК.СхемаКредитования.НаименованиеДляПечати;
								ТабличныйДокумент.Вывести(ОбластьТекстВставки);
								Инд = Инд + 1;
							КонецЕсли;
							
							НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
							
							ТабличныйДокумент.Область(НомерСтр, 1, НомерСтр, КолКолонок + ДобавитьКолонок).Объединить(); //НомерКолонки-2
							
							ОбластьЗаголовокВставки = Макет.ПолучитьОбласть("ЗаголовокВставки|КолонкаОсновная");
							
							//Определяем влазиет на страницу или нет
							//СтрокаВстДляПроверки = Макет.ПолучитьОбласть("СтрокаВставки|КолонкаОсновная");
							//
							//СтрокиДокумента = Новый Массив;
							//СтрокиДокумента.Добавить(ОбластьЗаголовокВставки);
							//СтрокиДокумента.Добавить(СтрокаВстДляПроверки);
							//
							//Если НЕ ТабличныйДокумент.ПроверитьВывод(СтрокиДокумента) Тогда
							//	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
							//КонецЕсли;
							//
							
							ТабличныйДокумент.Вывести(ОбластьЗаголовокВставки);
							
							НомерКолонки = 2;
							Для каждого СтрВстАбс Из ТЗАбсВст Цикл
								ОбластьЗаголовокВставкиДоп = Макет.ПолучитьОбласть("ЗаголовокВставки|КолонкаДопВ");
								
								Если НомерКолонки = 2 Тогда
									ОбластьЗаголовокВставкиДоп.Параметры.Отклонение = "Увеличение суммы оценки  за 1 карат в руб. от базовой оценки";
								КонецЕсли;
								
								ОбластьЗаголовокВставкиДоп.Параметры.Качество = СтрВстАбс.КачествоОгранки.Наименование;
								ОбластьЗаголовокВставкиДоп.Параметры.ВидОгранки = СтрВстАбс.ВидОгранки.Наименование;
								ТабличныйДокумент.Присоединить(ОбластьЗаголовокВставкиДоп);
								
								НомерКолонки = НомерКолонки + 1;
							КонецЦикла;
							
							НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
							
							МассивУдаления.Очистить();
							
							Если ТЗАбсВст.Количество() > 1 Тогда
								ТабличныйДокумент.Область(НомерСтр - 4, 3, НомерСтр - 3, НомерКолонки + ТЗАбсВст.Количество()).Объединить();
								
								ПромежуточнаяТабВст = ТЗАбсВст.Скопировать();
								
								КоличествоКамней = ТЗАбсВст.Количество();
								
								ТЗРезультат = ПромежуточнаяТабВст.Скопировать(,"ВидВставки, ЗначениеОтклонения");
								
								Для Сч = 1 По КоличествоКамней - 1 Цикл
									МассивУдаления.Добавить(ТЗРезультат[Сч]);
								КонецЦикла;
								
								Если МассивУдаления.Количество() > 0 Тогда
									Для каждого СтрМ Из МассивУдаления Цикл
										ТЗРезультат.Удалить(СтрМ);
									КонецЦикла;
								КонецЕсли;
								
								Для Сч = 1 По КоличествоКамней - 1 Цикл
									ПромежуточнаяТабВст = ТЗАбсВст.Скопировать();
									ПромежуточнаяТабВст.Удалить(0);
									
									//Добавляем колонку в которую потом загрузим данные нового металла
									ТЗРезультат.Колонки.Добавить("ЗначениеОтклонения" + Сч);
									
									Для каждого СтрПромежуточная Из ПромежуточнаяТабВст Цикл
										Стр = ТЗРезультат.Получить(0);
										Стр["ЗначениеОтклонения" + Сч] = СтрПромежуточная.ЗначениеОтклонения;
									КонецЦикла;
								КонецЦикла;
							Иначе
								ТЗРезультат = ТЗАбсВст.Скопировать();
							КонецЕсли;
							
							Для каждого СтрРез Из ТЗРезультат Цикл
								ОбластьСтрокаВставки = Макет.ПолучитьОбласть("СтрокаВставки|КолонкаОсновная");
								ОбластьСтрокаВставкиДоп = Макет.ПолучитьОбласть("СтрокаВставки|КолонкаДопВ");
								
								ОбластьСтрокаВставки.Параметры.Камень = СтрРез.ВидВставки.Наименование;
								ТабличныйДокумент.Вывести(ОбластьСтрокаВставки);
								
								Если ТЗАбсВст.Количество() > 1 Тогда
									КоличествоКамней = ТЗАбсВст.Количество();
									Для Сч = 0 По КоличествоКамней - 1 Цикл
										Если Сч = 0 Тогда
											ОбластьСтрокаВставкиДоп.Параметры.ЗнчОтклонения = СтрРез.ЗначениеОтклонения;
										Иначе
											ОбластьСтрокаВставкиДоп.Параметры.ЗнчОтклонения = СтрРез["ЗначениеОтклонения" + Сч];
										КонецЕсли;
										
										ТабличныйДокумент.Присоединить(ОбластьСтрокаВставкиДоп);
									КонецЦикла;
								Иначе
									ОбластьСтрокаВставкиДоп.Параметры.ЗнчОтклонения = СтрРез.ЗначениеОтклонения;
									ТабличныйДокумент.Присоединить(ОбластьСтрокаВставкиДоп);
								КонецЕсли;
							КонецЦикла;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			//Выводим подвал
			ОбластьПодвал = Макет.ПолучитьОбласть("Подвал|КолонкаОсновная");
			ОбластьПодвалПодписант = Макет.ПолучитьОбласть("Подвал|КолонкаСтавка");
			ОбластьПодвалПусто = Макет.ПолучитьОбласть("Подвал|КолонкаШапкаПусто");
			
			ОбластьПодвал.Параметры.НачальникОРБ = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаДанныеДокументов.НачальникОРБ.Наименование);
			ОбластьПодвал.Параметры.ДатаДокумента = Формат(ВыборкаДанныеДокументов.СсылкаНаДокумент.Дата, "ДФ=dd.MM.yyyy") + " г.";
			ОбластьПодвал.Параметры.НачальникОтделения = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаДанныеДокументов.НачальникОтделения.Наименование);
			ОбластьПодвал.Параметры.ДатаНачалаДействия = ?(ВыборкаДанныеДокументов.ДатаОкончанияДействияПриказа = Дата(1,1,1),
			"постоянно, с " + Формат(ВыборкаДанныеДокументов.ДатаНачалаДействияПриказа, "ДФ=dd.MM.yyyy") + " г.",
			"на период с " + Формат(ВыборкаДанныеДокументов.ДатаНачалаДействияПриказа, "ДФ=dd.MM.yyyy") + " г."
			+ " по " + Формат(ВыборкаДанныеДокументов.ДатаОкончанияДействияПриказа, "ДФ=dd.MM.yyyy") + " г.");
			
			//ОбластьПодвал.Параметры.НачальникОДО = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаДанныеДокументов.НачальникОДО.Наименование);
			ОбластьПодвал.Параметры.НачальникОДО = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СклонениеПредставленийОбъектов.ПросклонятьФИО(
				ВыборкаДанныеДокументов.НачальникОДО.Наименование, 2,,));
				
			ОбластьПодвал.Параметры.Должность = ВыборкаДанныеДокументов.ПодписантДолжность;
			
			//СтрокиДокумента = Новый Массив;
			//СтрокиДокумента.Добавить(ОбластьПодвал);
			//
			//Если НЕ ТабличныйДокумент.ПроверитьВывод(СтрокиДокумента) Тогда
			//	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			//КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьПодвал);
			
			Для Сч = 1 По 3 Цикл
				ТабличныйДокумент.Присоединить(ОбластьПодвалПусто);
			КонецЦикла;
			
			ОбластьПодвалПодписант.Параметры.Подписал = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаДанныеДокументов.ПодписантФИО.Наименование);
			ТабличныйДокумент.Присоединить(ОбластьПодвалПодписант); 
			
			НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
			ТабличныйДокумент.Область(НомерСтр - 10, 1, НомерСтр - 10, КолКолонок + ДобавитьКолонок).Объединить();
			ТабличныйДокумент.Область(НомерСтр - 9, 1, НомерСтр - 9, КолКолонок + ДобавитьКолонок).Объединить();
			ТабличныйДокумент.Область(НомерСтр - 8, 1, НомерСтр - 8, КолКолонок + ДобавитьКолонок).Объединить();
			ТабличныйДокумент.Область(НомерСтр - 7, 1, НомерСтр - 7, КолКолонок + ДобавитьКолонок).Объединить();
			ТабличныйДокумент.Область(НомерСтр - 6, 1, НомерСтр - 6, КолКолонок + ДобавитьКолонок).Объединить();
			ТабличныйДокумент.Область(НомерСтр - 5, 1, НомерСтр - 5, КолКолонок + ДобавитьКолонок).Объединить();
			ТабличныйДокумент.Область(НомерСтр - 4, 1, НомерСтр - 4, КолКолонок + ДобавитьКолонок).Объединить();
			ТабличныйДокумент.Область(НомерСтр - 3, 1, НомерСтр - 3, КолКолонок + ДобавитьКолонок).Объединить();
			ТабличныйДокумент.Область(НомерСтр - 2, 1, НомерСтр - 2, КолКолонок + ДобавитьКолонок).Объединить();			
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции     

Функция ПечатьПриказаОтменыВИП(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ПриказОтмены";
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	//ТабличныйДокумент.Защита = Истина;
		
	ВыборкаДанныеДокументов = ПолучитьВыборкуДанныхОтмены(МассивОбъектов);
	
	ТЗЗалогодателиСУсловиями = Новый ТаблицаЗначений;
	ТЗЗалогодателиСУсловиями.Колонки.Добавить("Залогодатель");
	ТЗЗалогодателиСУсловиями.Колонки.Добавить("ИспользуютсяСтавки");
	ТЗЗалогодателиСУсловиями.Колонки.Добавить("ИспользуютсяМаталлы");
	ТЗЗалогодателиСУсловиями.Колонки.Добавить("ИспользуютсяВставки");
	ТЗЗалогодателиСУсловиями.Колонки.Добавить("ДокументСтавки");
	ТЗЗалогодателиСУсловиями.Колонки.Добавить("ДокументМеталлы");
	ТЗЗалогодателиСУсловиями.Колонки.Добавить("ДокументВставки");
	
	Если ВыборкаДанныеДокументов.Следующий() Тогда  
		
		ТЗЗалогодатели = ВыборкаДанныеДокументов.Залогодатели.Выгрузить();

		ТЗСтавки = ВыборкаДанныеДокументов.СтавкиПроцентов.Выгрузить();
		ТЗМеталлы = ВыборкаДанныеДокументов.НастройкаОтклоненийОтБазовыхЦенМеталлы.Выгрузить();
		ТЗВставки = ВыборкаДанныеДокументов.НастройкаОтклоненийОтБазовыхЦенВставки.Выгрузить();
		ТЗСК = ВыборкаДанныеДокументов.СхемыКредитования.Выгрузить();
		
		ТЗСК.Сортировать("СхемаКредитования Возр");
		
		//Удаляем строки без отклонений
		МассивУдаленияСтрокТЗМ = Новый Массив;
		
		Тест = Новый ТаблицаЗначений;
		
		Для каждого СтрМ Из ТЗМеталлы Цикл
			Если НЕ ЗначениеЗаполнено(СтрМ.ОтклонениеОтБазовойЦены) Тогда
				МассивУдаленияСтрокТЗМ.Добавить(СтрМ)
			КонецЕсли;
		КонецЦикла;
		
		Если МассивУдаленияСтрокТЗМ.Количество() > 0 Тогда
			Для каждого СтрМ Из МассивУдаленияСтрокТЗМ Цикл
				ТЗМеталлы.Удалить(СтрМ);
			КонецЦикла;
		КонецЕсли;
		
		КолКолонок = Макс(ТЗСтавки.Количество(), ТЗВставки.Количество());
		
		Если КолКолонок < 10 Тогда
			КолКолонок = 10;
		КонецЕсли;
			
			ТЗДанныеЗалогодателя = ПолучитьДанныеЗалогодателя(ТЗЗалогодатели.Скопировать(, "Залогодатель"), НачалоДня(ВыборкаДанныеДокументов.СсылкаНаДокумент.Дата));
			
			Макет = ПолучитьМакет("ПФ_MXL_ПриказОтмены");
			
			// Формируем основную часть. 
			ОбластьШапка = Макет.ПолучитьОбласть("Шапка|КолонкаОсновная");
			ОбластьШапкаПусто = Макет.ПолучитьОбласть("Шапка|КолонкаШапкаПусто");
			ОбластьШапкаНомер = Макет.ПолучитьОбласть("Шапка|КолонкаШапкаНомер");
			НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
			
			ОбластьШапка.Параметры.ДатаПриказа = Формат(ВыборкаДанныеДокументов.СсылкаНаДокумент.Дата, "ДФ=dd.MM.yyyy") + " г.";
			СклонениеОтделения = ПолучитьСклоненияСтроки(ВыборкаДанныеДокументов.Отделение.Наименование, "Л=ru_RU", "ПД=Родительный");

			Если СклонениеОтделения.Количество() > 0 Тогда
				ОбластьШапка.Параметры.Отделение = СклонениеОтделения[0];
			КонецЕсли;
			
			//ПолНачальника = ПолучитьДанныеЗалогодателя(ВыборкаДанныеДокументов.НачальникОтделения, НачалоДня(ВыборкаДанныеДокументов.СсылкаНаДокумент.Дата));
			ОбластьШапка.Параметры.ФИОНачальника = СклонениеПредставленийОбъектов.ПросклонятьФИО(
				ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаДанныеДокументов.НачальникОтделения.Наименование), 2,,);

			//Убрал пол т.к. по сотрудникам нет этой информации.
				//ВыборкаДанныеДокументов.НачальникОтделения, ?(ПолНачальника = Перечисления.ПолФизическогоЛица.Мужской, 1, 2));
			//
			
			ОбластьШапка.Параметры.ДатаОтмены = Формат(ВыборкаДанныеДокументов.ДатаНачалаДействияПриказа, "ДФ=dd.MM.yyyy") + " г.";
			
			ТекстУсловия = "";
			
			Если ВыборкаДанныеДокументов.СсылкаНаДокумент.ОтменаСтавок Тогда
				ТекстУсловия = "по процентным ставкам за пользование займом";
			КонецЕсли;
			
			Если ВыборкаДанныеДокументов.СсылкаНаДокумент.ОтменаМеталлов Тогда
				ТекстУсловия = ?(ТекстУсловия = "", "по условиям оценки драгоценных металлов", ТекстУсловия + ", по условиям оценки драгоценных металлов");
			КонецЕсли;
			
			Если ВыборкаДанныеДокументов.СсылкаНаДокумент.ОтменаВставкок Тогда
				ТекстУсловия = ?(ТекстУсловия = "", "по условиям оценки драгоценных камней", ТекстУсловия + ", по условиям оценки драгоценных камней");
			КонецЕсли;
			
			ОбластьШапка.Параметры.ТекстУсловия = ТекстУсловия;
			//+МАН 25.11.25 Изменил
			//ОбластьШапка.Параметры.НомерПриказаУстановкиУсловий = ВыборкаДанныеДокументов.ОтменяемыйПриказ.НомерПриказа;
			//ОбластьШапка.Параметры.ДатаПриказаУстановкиУсловий = Формат(ВыборкаДанныеДокументов.ОтменяемыйПриказ.Дата, "ДФ=dd.MM.yyyy") + " г.";
			ОбластьШапка.Параметры.НомерПриказаУстановкиУсловий = СвормироватьСтрокуОтменяемыхПриказов(ВыборкаДанныеДокументов.ОтменяемыеПриказы.Выгрузить());
			//-МАН

			Если ТЗДанныеЗалогодателя.Количество() > 1 Тогда
				ОбластьШапка.Параметры.ТекстКлиент = "клиентам";
			Иначе
				ОбластьШапка.Параметры.ТекстКлиент = "клиенту";
			КонецЕсли;	
			
			ТабличныйДокумент.Вывести(ОбластьШапка);
			
			Для Сч = 1 По КолКолонок-1 Цикл
				ТабличныйДокумент.Присоединить(ОбластьШапкаПусто);
			Конеццикла;
			
			ОбластьШапкаНомер.Параметры.НомерПриказа = ВыборкаДанныеДокументов.НомерПриказа; 
			ТабличныйДокумент.Присоединить(ОбластьШапкаНомер); 
			
			ТабличныйДокумент.Область(НомерСтр + 2, 1, НомерСтр + 2, КолКолонок + 3).Объединить();
			ТабличныйДокумент.Область(НомерСтр + 3, 1, НомерСтр + 3, КолКолонок + 3).Объединить();
			ТабличныйДокумент.Область(НомерСтр + 5, 1, НомерСтр + 5, КолКолонок + 3).Объединить();
			ТабличныйДокумент.Область(НомерСтр + 9, 1, НомерСтр + 9, КолКолонок + 3).Объединить();
			ТабличныйДокумент.Область(НомерСтр + 10, 1, НомерСтр + 10, КолКолонок + 3).Объединить();
			ТабличныйДокумент.Область(НомерСтр + 12, 1, НомерСтр + 12, КолКолонок + 3).Объединить();
			ТабличныйДокумент.Область(НомерСтр + 14, 1, НомерСтр + 14, КолКолонок + 3).Объединить();
			
			Нпп = 1;
			
			Для каждого СтрЗ Из ТЗДанныеЗалогодателя Цикл
				ОбластьШапкаЗаемщик = Макет.ПолучитьОбласть("ШапкаЗаемщик|КолонкаОсновная");
				
				ОбластьШапкаЗаемщик.Параметры.Нпп = ?(ТЗДанныеЗалогодателя.Количество() > 1, "1." + Нпп + " ", "");
				ОбластьШапкаЗаемщик.Параметры.Залогодатель = СтрЗ.Залогодатель.Наименование;
				ОбластьШапкаЗаемщик.Параметры.Датарождения = Формат(СтрЗ.ДатаРождения, "ДФ=dd.MM.yyyy");
				//ОбластьШапкаЗаемщик.Параметры.ПаспортныеДанные = "" + СтрЗ.ДокументЗалогодателя // + ", выдан "
				////+ Формат(СтрЗ.ДокументДатаВыдачи, "ДФ=dd.MM.yyyy")
				//+ ", " + СтрЗ.ДокументКемВыдан + " " + СтрЗ.ДокументКодПодразделения;
				ОбластьШапкаЗаемщик.Параметры.ПаспортныеДанные = "" + СтрЗ.ВидДокумента
				+ ?(ЗначениеЗаполнено(СтрЗ.Серия), " серия " + СтрЗ.Серия, "")
				+ " №" + СтрЗ.Номер + ", выдан " + Формат(СтрЗ.ДатаВыдачи, "ДФ=dd.MM.yyyy") + " г. "
				+ СтрЗ.КемВыдан + ?(ЗначениеЗаполнено(СтрЗ.КодПодразделения), ", код подразделения " + СтрЗ.КодПодразделения, "")
				+ ?(ЗначениеЗаполнено(СтрЗ.СрокДействия), ", срок действия " + Формат(СтрЗ.СрокДействия, "ДФ=dd.MM.yyyy") + " г. ", "");
				
				ТабличныйДокумент.Вывести(ОбластьШапкаЗаемщик);
				
				НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
				
				ТабличныйДокумент.Область(НомерСтр - 1, 1, НомерСтр - 1, КолКолонок + 2).Объединить();
				ТабличныйДокумент.Область(НомерСтр, 1, НомерСтр, КолКолонок + 2).Объединить();
				
				Нпп = Нпп + 1;
			КонецЦикла;
			
			//Выводим подвал
			ОбластьПодвал = Макет.ПолучитьОбласть("Подвал|КолонкаОсновная");
			ОбластьПодвалПодписант = Макет.ПолучитьОбласть("Подвал|КолонкаСтавка");
			ОбластьПодвалПусто = Макет.ПолучитьОбласть("Подвал|КолонкаШапкаПусто");
			
			ОбластьПодвал.Параметры.Дата = Формат(ВыборкаДанныеДокументов.ДатаНачалаДействияПриказа, "ДФ=dd.MM.yyyy") + " г.";
			
			Если ТЗДанныеЗалогодателя.Количество() > 1 Тогда
				ОбластьПодвал.Параметры.ТекстКлиент = "указанным клиентам";
			Иначе
				ОбластьПодвал.Параметры.ТекстКлиент = "указанному клиенту";
			КонецЕсли;
			
			ОбластьПодвал.Параметры.НачальникОРБ = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаДанныеДокументов.НачальникОРБ.Наименование);
			ОбластьПодвал.Параметры.ДатаДокумента = Формат(ВыборкаДанныеДокументов.СсылкаНаДокумент.Дата, "ДФ=dd.MM.yyyy") + " г.";
			ОбластьПодвал.Параметры.НачальникОтделения = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаДанныеДокументов.НачальникОтделения.Наименование);;
			ОбластьПодвал.Параметры.ДатаНачалаДействия = ?(ВыборкаДанныеДокументов.ДатаОкончанияДействияПриказа = Дата(1,1,1),
			"постоянно, с " + Формат(ВыборкаДанныеДокументов.ДатаНачалаДействияПриказа, "ДФ=dd.MM.yyyy") + " г.",
			"на период с " + Формат(ВыборкаДанныеДокументов.ДатаНачалаДействияПриказа, "ДФ=dd.MM.yyyy") + " г."
			+ " по " + Формат(ВыборкаДанныеДокументов.ДатаОкончанияДействияПриказа, "ДФ=dd.MM.yyyy") + " г.");
			
			//ОбластьПодвал.Параметры.НачальникОДО = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаДанныеДокументов.НачальникОДО.Наименование);
			ОбластьПодвал.Параметры.НачальникОДО = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СклонениеПредставленийОбъектов.ПросклонятьФИО(
				ВыборкаДанныеДокументов.НачальникОДО.Наименование, 2,,));
				
			ОбластьПодвал.Параметры.Должность = ВыборкаДанныеДокументов.ПодписантДолжность;
			
			ТабличныйДокумент.Вывести(ОбластьПодвал);
			
			Для Сч = 1 По 3 Цикл
				ТабличныйДокумент.Присоединить(ОбластьПодвалПусто);
			КонецЦикла;
			
			ОбластьПодвалПодписант.Параметры.Подписал = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаДанныеДокументов.ПодписантФИО.Наименование);
			ТабличныйДокумент.Присоединить(ОбластьПодвалПодписант); 
			
			НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
			ТабличныйДокумент.Область(НомерСтр - 10, 1, НомерСтр - 10, КолКолонок + 3).Объединить();
			ТабличныйДокумент.Область(НомерСтр - 9, 1, НомерСтр - 9, КолКолонок + 3).Объединить();
			ТабличныйДокумент.Область(НомерСтр - 8, 1, НомерСтр - 8, КолКолонок + 3).Объединить();
			ТабличныйДокумент.Область(НомерСтр - 7, 1, НомерСтр - 7, КолКолонок + 3).Объединить();
			ТабличныйДокумент.Область(НомерСтр - 6, 1, НомерСтр - 6, КолКолонок + 3).Объединить();
			ТабличныйДокумент.Область(НомерСтр - 5, 1, НомерСтр - 5, КолКолонок + 3).Объединить();
			ТабличныйДокумент.Область(НомерСтр - 4, 1, НомерСтр - 4, КолКолонок + 3).Объединить();
			ТабличныйДокумент.Область(НомерСтр - 3, 1, НомерСтр - 3, КолКолонок + 3).Объединить();
			ТабличныйДокумент.Область(НомерСтр - 2, 1, НомерСтр - 2, КолКолонок + 3).Объединить();			
		//КонецЕсли;
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции     

Функция ПолучитьБазовыеЦеныМеталлы(Дата)
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Проба");
	СтруктураВозврата.Вставить("Категория");

    Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_БазовыеЦеныНаДрагоценныеМеталлыСрезПоследних.Проба КАК Проба,
	               |	ЛБ_БазовыеЦеныНаДрагоценныеМеталлыСрезПоследних.КатегорияОбъектаЗалога КАК Категория
	               |ИЗ
	               |	РегистрСведений.ЛБ_БазовыеЦеныНаДрагоценныеМеталлы.СрезПоследних(&Дата, ) КАК ЛБ_БазовыеЦеныНаДрагоценныеМеталлыСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать(); 
	Если Выборка.Следующий() Тогда 
		СтруктураВозврата.Вставить("Проба", Выборка.Проба);
	    СтруктураВозврата.Вставить("Категория", Выборка.Категория);
	КонецЕсли;
	
	Возврат СтруктураВозврата;
КонецФункции

Функция ПолучитьТаблицуРегистраторов(Регистратор)
	ТаблицаРегистраторов = Новый ТаблицаЗначений;
	ТаблицаРегистраторов.Колонки.Добавить("Ломбард"); 
	ТаблицаРегистраторов.Колонки.Добавить("Группа");
	ТаблицаРегистраторов.Колонки.Добавить("РегистраторМеталлы");
	ТаблицаРегистраторов.Колонки.Добавить("РегистраторВставки"); 
	ТаблицаРегистраторов.Колонки.Добавить("РегистраторСтавки");
		
	Ломбарды = Регистратор.Ломбарды.ВыгрузитьКолонку("Ломбард"); 
	Если Ломбарды.Количество() = 0 Тогда 
		ЗапросЛ = Новый Запрос;
		ЗапросЛ.Текст = "ВЫБРАТЬ
		                |	ЛБ_Ломбарды.Ссылка КАК Ссылка
		                |ИЗ
		                |	Справочник.ЛБ_Ломбарды КАК ЛБ_Ломбарды
		                |ГДЕ
		                |	ЛБ_Ломбарды.ЭтоГруппа = ЛОЖЬ
		                |	И ЛБ_Ломбарды.Закрыт = ЛОЖЬ";
		ВыборкаЛ = ЗапросЛ.Выполнить().Выбрать();
		Пока ВыборкаЛ.Следующий() Цикл 
			Ломбарды.Добавить(ВыборкаЛ.Ссылка);
		КонецЦикла;	
	КонецЕсли;	
		
	ЗапросЛ = Новый Запрос; 
	ЗапросЛ.УстановитьПараметр("Дата", Регистратор.Дата);
	ЗапросЛ.УстановитьПараметр("Ломбарды", Ломбарды);
	ЗапросЛ.Текст = "ВЫБРАТЬ
	               |	ЛБ_ГруппыЛомбардовСрезПоследних.Ломбард КАК Ломбард,
	               |	ЛБ_ГруппыЛомбардовСрезПоследних.Группа КАК Группа
	               |ИЗ
	               |	РегистрСведений.ЛБ_ГруппыЛомбардов.СрезПоследних(&Дата, Ломбард В (&Ломбарды)) КАК ЛБ_ГруппыЛомбардовСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ГруппыЛомбардовСрезПоследних.Период УБЫВ";
	ТаблицаЛомбардов = ЗапросЛ.Выполнить().Выгрузить();   
		
	Для каждого СтрЛ Из ТаблицаЛомбардов Цикл
	    НоваяСтр = ТаблицаРегистраторов.Добавить();
		НоваяСтр.Ломбард = СтрЛ.Ломбард; 
		НоваяСтр.Группа = СтрЛ.Группа;
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Регистратор.Дата);
	Запрос.УстановитьПараметр("ДатаНачалаДействия", Регистратор.ДатаНачалаДействияПриказа);
	Запрос.УстановитьПараметр("Ломбарды", Ломбарды);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних.Ломбард КАК Ломбард,
	               |	ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПрейскурантЦенНаМеталлы.СрезПоследних(
	               |			&Дата,
	               |			Ломбард В (&Ломбарды)
	               |				И ДатаНачалаДействия <= &ДатаНачалаДействия) КАК ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних.Период УБЫВ"; 
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	Для каждого ЭлементМассива Из Ломбарды Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Ломбард", ЭлементМассива);
		
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор); 
		Если НЕ строки.Количество() = 0 Тогда
		    Стр = Строки.Получить(0);
		    РегистраторМеталлы = Стр.Регистратор;
			
			СтрокиР = ТаблицаРегистраторов.НайтиСтроки(Отбор); 
			Если СтрокиР.Количество() = 0 Тогда
				СтрР = ТаблицаРегистраторов.Добавить();
				СтрР.Ломбард = ЭлементМассива; 
				СтрР.Группа = Справочники.ЛБ_ГруппыЛомбардов.ПустаяСсылка();
			Иначе	
			    СтрР = СтрокиР.Получить(0);
			КонецЕсли;	
		    СтрР.РегистраторМеталлы = РегистраторМеталлы;
		КонецЕсли;	
	Конеццикла;	     
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.Ломбард КАК Ломбард,
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПрейскурантЦенНаДрагоценныеКамни.СрезПоследних(
	               |			&Дата,
	               |			Ломбард В (&Ломбарды)
	               |				И ДатаНачалаДействия <= &ДатаНачалаДействия) КАК ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.Период УБЫВ"; 
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	Для каждого ЭлементМассива Из Ломбарды Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Ломбард", ЭлементМассива);
		
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор); 
		Если НЕ строки.Количество() = 0 Тогда
		    Стр = Строки.Получить(0);
		    РегистраторВставки = Стр.Регистратор;
			
			СтрокиР = ТаблицаРегистраторов.НайтиСтроки(Отбор);  
			Если СтрокиР.Количество() = 0 Тогда
				СтрР = ТаблицаРегистраторов.Добавить();
				СтрР.Ломбард = ЭлементМассива; 
				СтрР.Группа = Справочники.ЛБ_ГруппыЛомбардов.ПустаяСсылка();
			Иначе	
			    СтрР = СтрокиР.Получить(0); 
			КонецЕсли;	
		    СтрР.РегистраторВставки = РегистраторВставки;
		КонецЕсли;	
	Конеццикла;	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.Ломбард КАК Ломбард,
	               |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПрейскурантПроцентныхСтавок.СрезПоследних(
	               |			&Дата,
	               |			Ломбард В (&Ломбарды)
	               |				И ДатаНачалаДействия <= &ДатаНачалаДействия) КАК ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.Период УБЫВ"; 
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	Для каждого ЭлементМассива Из Ломбарды Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Ломбард", ЭлементМассива);
		
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор); 
		Если НЕ строки.Количество() = 0 Тогда
		    Стр = Строки.Получить(0);
		    РегистраторСтавки = Стр.Регистратор;
			
			СтрокиР = ТаблицаРегистраторов.НайтиСтроки(Отбор); 
			Если СтрокиР.Количество() = 0 Тогда
				СтрР = ТаблицаРегистраторов.Добавить();
				СтрР.Ломбард = ЭлементМассива; 
				СтрР.Группа = Справочники.ЛБ_ГруппыЛомбардов.ПустаяСсылка();
			Иначе	
			    СтрР = СтрокиР.Получить(0);  
			КонецЕсли;	
		    СтрР.РегистраторСтавки = РегистраторСтавки;
		КонецЕсли;	
	Конеццикла;	

	Возврат ТаблицаРегистраторов;
КонецФункции

Функция ПолучитьВыборкуДанныхДокумента(МассивОбъектов)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	ЛБ_ПриказУсловияПредоставленияЗаймов.СтрокаЛомбарды КАК СтрокаЛомбарды,
		//|	ЛБ_ПриказУсловияПредоставленияЗаймов.НомерПриказа КАК НомерПриказа,
		//|	ЛБ_ПриказУсловияПредоставленияЗаймов.ДатаНачалаДействияПриказа КАК ДатаНачалаДействияПриказа,
		//|	ЛБ_ПриказУсловияПредоставленияЗаймов.ДатаОкончанияДействияПриказа КАК ДатаОкончанияДействияПриказа,
		//|	ЛБ_ПриказУсловияПредоставленияЗаймов.Ответственный.Представление КАК Ответственный,
		//|	ЛБ_ПриказУсловияПредоставленияЗаймов.Ссылка КАК СсылкаНаДокумент,
		//|	ЛБ_ПриказУсловияПредоставленияЗаймов.Акция КАК Акция
		//|ИЗ
		//|	Документ.ЛБ_ПриказУсловияПредоставленияЗаймов КАК ЛБ_ПриказУсловияПредоставленияЗаймов
		//|ГДЕ
		//|	ЛБ_ПриказУсловияПредоставленияЗаймов.Ссылка В(&МассивОбъектов)";
	
		"ВЫБРАТЬ
		|	ЛБ_ПриказИндивидуальныеУсловия.НомерПриказа КАК НомерПриказа,
		|	ЛБ_ПриказИндивидуальныеУсловия.ДатаНачалаДействияПриказа КАК ДатаНачалаДействияПриказа,
		|	ЛБ_ПриказИндивидуальныеУсловия.ДатаОкончанияДействияПриказа КАК ДатаОкончанияДействияПриказа,
		|	ЛБ_ПриказИндивидуальныеУсловия.Ответственный.Представление КАК Ответственный,
		|	ЛБ_ПриказИндивидуальныеУсловия.Ссылка КАК СсылкаНаДокумент,
		|	ЛБ_ПриказИндивидуальныеУсловия.СтавкиПроцентов.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		СхемаКредитования КАК СхемаКредитования,
		|		ПричинаПрименения КАК ПричинаПрименения,
		|		СтатусЗалогодателя КАК СтатусЗалогодателя,
		|		ДиапазонСумм КАК ДиапазонСумм,
		|		ДеньНачалаПрименения КАК ДеньНачалаПрименения,
		|		Ставка КАК Ставка
		|	) КАК СтавкиПроцентов,
		|	ЛБ_ПриказИндивидуальныеУсловия.НастройкаОтклоненийОтБазовыхЦенМеталлы.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		КатегорияОбъектаЗалога КАК КатегорияОбъектаЗалога,
		|		СхемаКредитования КАК СхемаКредитования,
		|		Металл КАК Металл,
		|		Проба КАК Проба,
		|		ОтклонениеОтБазовойЦены КАК ОтклонениеОтБазовойЦены,
		|		ЗначениеОтклонения КАК ЗначениеОтклонения
		|	) КАК НастройкаОтклоненийОтБазовыхЦенМеталлы,
		|	ЛБ_ПриказИндивидуальныеУсловия.НастройкаОтклоненийОтБазовыхЦенВставки.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		ВидВставки КАК ВидВставки,
		|		ВидОгранки КАК ВидОгранки,
		|		КачествоОгранки КАК КачествоОгранки,
		|		ОтклонениеОтБазовойЦены КАК ОтклонениеОтБазовойЦены,
		|		ЗначениеОтклонения КАК ЗначениеОтклонения,
		|		СхемаКредитования КАК СхемаКредитования
		|	) КАК НастройкаОтклоненийОтБазовыхЦенВставки,
		|	ЛБ_ПриказИндивидуальныеУсловия.Залогодатели.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		Залогодатель КАК Залогодатель,
		|		НетСтавок КАК НетСтавок,
		|		НетМеталлов КАК НетМеталлов,
		|		НетВставок КАК НетВставок
		|	) КАК Залогодатели,
		|	ЛБ_ПриказИндивидуальныеУсловия.СхемыКредитования.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		СхемаКредитования КАК СхемаКредитования,
		|		ШаблонПроцентныеСтавки КАК ШаблонПроцентныеСтавки,
		|		Ломбард КАК Ломбард
		|	) КАК СхемыКредитования,
		|	ЛБ_ПриказИндивидуальныеУсловия.НачальникОРБ КАК НачальникОРБ,
		|	ЛБ_ПриказИндивидуальныеУсловия.НачальникОДО КАК НачальникОДО,
		|	ЛБ_ПриказИндивидуальныеУсловия.ПодписантФИО КАК ПодписантФИО,
		|	ЛБ_ПриказИндивидуальныеУсловия.ПодписантДолжность КАК ПодписантДолжность,
		|	ЛБ_ПриказИндивидуальныеУсловия.Отделение КАК Отделение,
		|	ЛБ_ПриказИндивидуальныеУсловия.НачальникОтделения КАК НачальникОтделения
		|ИЗ
		|	Документ.ЛБ_ПриказИндивидуальныеУсловия КАК ЛБ_ПриказИндивидуальныеУсловия
		|ГДЕ
		|	ЛБ_ПриказИндивидуальныеУсловия.Ссылка В(&МассивОбъектов)";
	
	Возврат Запрос.Выполнить().Выбрать();	

КонецФункции

Функция ПолучитьВыборкуДанныхОтмены(МассивОбъектов)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ПриказИндивидуальныеУсловия.НомерПриказа КАК НомерПриказа,
		|	ЛБ_ПриказИндивидуальныеУсловия.ДатаНачалаДействияПриказа КАК ДатаНачалаДействияПриказа,
		|	ЛБ_ПриказИндивидуальныеУсловия.ДатаОкончанияДействияПриказа КАК ДатаОкончанияДействияПриказа,
		|	ЛБ_ПриказИндивидуальныеУсловия.Ответственный.Представление КАК Ответственный,
		|	ЛБ_ПриказИндивидуальныеУсловия.Ссылка КАК СсылкаНаДокумент,
		|	ЛБ_ПриказИндивидуальныеУсловия.ОтменяемыйПриказ КАК ОтменяемыйПриказ,
		|	ЛБ_ПриказИндивидуальныеУсловия.СтавкиПроцентов.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		СхемаКредитования КАК СхемаКредитования,
		|		ПричинаПрименения КАК ПричинаПрименения,
		|		СтатусЗалогодателя КАК СтатусЗалогодателя,
		|		ДиапазонСумм КАК ДиапазонСумм,
		|		ДеньНачалаПрименения КАК ДеньНачалаПрименения,
		|		Ставка КАК Ставка
		|	) КАК СтавкиПроцентов,
		|	ЛБ_ПриказИндивидуальныеУсловия.НастройкаОтклоненийОтБазовыхЦенМеталлы.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		КатегорияОбъектаЗалога КАК КатегорияОбъектаЗалога,
		|		СхемаКредитования КАК СхемаКредитования,
		|		Металл КАК Металл,
		|		Проба КАК Проба,
		|		ОтклонениеОтБазовойЦены КАК ОтклонениеОтБазовойЦены,
		|		ЗначениеОтклонения КАК ЗначениеОтклонения
		|	) КАК НастройкаОтклоненийОтБазовыхЦенМеталлы,
		|	ЛБ_ПриказИндивидуальныеУсловия.НастройкаОтклоненийОтБазовыхЦенВставки.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		ВидВставки КАК ВидВставки,
		|		ВидОгранки КАК ВидОгранки,
		|		КачествоОгранки КАК КачествоОгранки,
		|		ОтклонениеОтБазовойЦены КАК ОтклонениеОтБазовойЦены,
		|		ЗначениеОтклонения КАК ЗначениеОтклонения,
		|		СхемаКредитования КАК СхемаКредитования
		|	) КАК НастройкаОтклоненийОтБазовыхЦенВставки,
		|	ЛБ_ПриказИндивидуальныеУсловия.Залогодатели.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		Залогодатель КАК Залогодатель,
		|		НетСтавок КАК НетСтавок,
		|		НетМеталлов КАК НетМеталлов,
		|		НетВставок КАК НетВставок
		|	) КАК Залогодатели,
		|	ЛБ_ПриказИндивидуальныеУсловия.СхемыКредитования.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		СхемаКредитования КАК СхемаКредитования,
		|		ШаблонПроцентныеСтавки КАК ШаблонПроцентныеСтавки,
		|		Ломбард КАК Ломбард
		|	) КАК СхемыКредитования,
		|	ЛБ_ПриказИндивидуальныеУсловия.НачальникОРБ КАК НачальникОРБ,
		|	ЛБ_ПриказИндивидуальныеУсловия.НачальникОДО КАК НачальникОДО,
		|	ЛБ_ПриказИндивидуальныеУсловия.ПодписантФИО КАК ПодписантФИО,
		|	ЛБ_ПриказИндивидуальныеУсловия.ПодписантДолжность КАК ПодписантДолжность,
		|	ЛБ_ПриказИндивидуальныеУсловия.Отделение КАК Отделение,
		|	ЛБ_ПриказИндивидуальныеУсловия.НачальникОтделения КАК НачальникОтделения,
		|	ЛБ_ПриказИндивидуальныеУсловия.ОтменяемыеПриказы.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		Приказ КАК Приказ,
		|		Ставки КАК Ставки,
		|		Металлы КАК Металлы,
		|		Вставки КАК Вставки,
		|		СистемныйНомер КАК СистемныйНомер,
		|		НомерПриказа КАК НомерПриказа,
		|		ДатаНачалаДействия КАК ДатаНачалаДействия,
		|		ДатаДокумента КАК ДатаДокумента,
		|		ДатаОкончанияДействия КАК ДатаОкончанияДействия,
		|		Залогодатель КАК Залогодатель
		|	) КАК ОтменяемыеПриказы
		|ИЗ
		|	Документ.ЛБ_ПриказИндивидуальныеУсловия КАК ЛБ_ПриказИндивидуальныеУсловия
		|ГДЕ
		|	ЛБ_ПриказИндивидуальныеУсловия.Ссылка В(&МассивОбъектов)";
	
	Возврат Запрос.Выполнить().Выбрать();	

КонецФункции

Функция ПолучитьВыборкуПрейскурантаЦен(Регистраторы)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ПрейскурантЦенНаМеталлы.Регистратор КАК Регистратор,
		|	ЛБ_ПрейскурантЦенНаМеталлы.Проба.Владелец КАК Металл,
		|	ЛБ_ПрейскурантЦенНаМеталлы.Проба КАК Проба,
		|	ЛБ_ПрейскурантЦенНаМеталлы.Категория КАК Категория,
		|	ЕСТЬNULL(ЛБ_ПрейскурантЦенНаМеталлы.Цена, 0) КАК Цена
		|ИЗ
		|	РегистрСведений.ЛБ_ПрейскурантЦенНаМеталлы КАК ЛБ_ПрейскурантЦенНаМеталлы
		|ГДЕ
		|	ЛБ_ПрейскурантЦенНаМеталлы.Регистратор В(&Регистраторы)";
	
	Запрос.УстановитьПараметр("Регистраторы", Регистраторы);
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();  
	ТаблицаЗапроса.Колонки.Добавить("ГруппаМеталл"); 
	
	Для каждого стр Из ТаблицаЗапроса Цикл  
		ГруппаМ = ЛБ_ОбщийМодуль.ПолучитьГруппуПроб(стр.Проба);
		Стр.ГруппаМеталл = ?(ГруппаМ = неопределено, стр.Металл, ГруппаМ);
	Конеццикла;
	Возврат ТаблицаЗапроса;
	
КонецФункции

Функция ПолучитьВыборкуПрейскурантаЦенВставки(Регистраторы) 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛБ_ПрейскурантЦенНаДрагоценныеКамни.Регистратор КАК Регистратор,
		|	ЛБ_ПрейскурантЦенНаДрагоценныеКамни.ВидВставки КАК ВидВставки,
		|	ЛБ_ПрейскурантЦенНаДрагоценныеКамни.ФормаОгранки КАК ФормаОгранки,
		|	ЛБ_ПрейскурантЦенНаДрагоценныеКамни.ВидОгранки КАК ВидОгранки,
		|	ЛБ_ПрейскурантЦенНаДрагоценныеКамни.КачествоОгранки КАК КачествоОгранки,
		|	ЛБ_ПрейскурантЦенНаДрагоценныеКамни.ВесоваяГруппа КАК ВесоваяГруппа,
		|	ЕСТЬNULL(ЛБ_ПрейскурантЦенНаДрагоценныеКамни.Цена, 0) КАК Цена,
		|	ВЫБОР
		|		КОГДА ЛБ_ПрейскурантЦенНаДрагоценныеКамни.ФормаОгранки = &ПустаяФормаОгранки
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ЛБ_ПрейскурантЦенНаДрагоценныеКамни.ФормаОгранки.ОбособленныйВыводПечать
		|	КОНЕЦ КАК ОбособленныйВыводПечать
		|ИЗ
		|	РегистрСведений.ЛБ_ПрейскурантЦенНаДрагоценныеКамни КАК ЛБ_ПрейскурантЦенНаДрагоценныеКамни
		|ГДЕ
		|	ЛБ_ПрейскурантЦенНаДрагоценныеКамни.Регистратор В(&Регистраторы)
		|	И ЛБ_ПрейскурантЦенНаДрагоценныеКамни.ВидВставки = &ВидВставки";
	
	Запрос.УстановитьПараметр("Регистраторы", Регистраторы); 
	Запрос.УстановитьПараметр("ВидВставки", Справочники.ЛБ_ДрагоценныеКамни.Бриллиант);  
	Запрос.УстановитьПараметр("ПустаяФормаОгранки", Справочники.ЛБ_ФормыОгранки.ПустаяСсылка());
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	
	//ТаблицаЗапроса.Сортировать("ВидОгранки Убыв");
	//Для каждого стр Из ТаблицаЗапроса Цикл  
	//	Если НЕ ЗначениеЗаполнено(Стр.ВидОгранки) тогда
	//		Стр.ВидОгранки = Стр.ФормаОгранки;
	//	КонецЕсли;	
	//Конеццикла;
	ТаблицаЗапроса.Сортировать("ВидОгранки Убыв, ВесоваяГруппа");
	
	Возврат ТаблицаЗапроса;
КонецФункции   

Функция ПолучитьВыборкуПрейскурантаСтавок(Регистраторы, Дата)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ПрейскурантПроцентныхСтавок.Регистратор КАК Регистратор,
		|	ЛБ_ПрейскурантПроцентныхСтавок.СхемаКредитования КАК СхемаКредитования,
		|	ЛБ_ПрейскурантПроцентныхСтавок.СтатусЗалогодателя КАК Категория,
		|	ЛБ_ПрейскурантПроцентныхСтавок.ДиапазонСуммЗайма КАК ДиапазонСумм,
		|	ЛБ_ПрейскурантПроцентныхСтавок.ПричинаПрименения КАК ПричинаПрименения,
		|	ЛБ_ПрейскурантПроцентныхСтавок.ДеньНачалаПрименения КАК ДеньНачалаПрименения,
		|	ЛБ_УсловияПредоставленияКредитаСрезПоследних.СрокЗалога КАК Срок,
		|	ЛБ_ПрейскурантПроцентныхСтавок.ПроцентнаяСтавка КАК Ставка
		|ИЗ
		|	РегистрСведений.ЛБ_ПрейскурантПроцентныхСтавок КАК ЛБ_ПрейскурантПроцентныхСтавок
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_УсловияПредоставленияКредита.СрезПоследних(&Дата, ) КАК ЛБ_УсловияПредоставленияКредитаСрезПоследних
		|		ПО ЛБ_ПрейскурантПроцентныхСтавок.СхемаКредитования = ЛБ_УсловияПредоставленияКредитаСрезПоследних.СхемаКредитования
		|ГДЕ
		|	ЛБ_ПрейскурантПроцентныхСтавок.Регистратор В(&Регистраторы)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СхемаКредитования,
		|	Категория,
		|	ПричинаПрименения,
		|	ДеньНачалаПрименения,
		|	ЛБ_ПрейскурантПроцентныхСтавок.ДиапазонСуммЗайма.ПорядокСортировки";
	
	Запрос.УстановитьПараметр("Регистраторы", Регистраторы);
	Запрос.УстановитьПараметр("Дата", Дата);  
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();      
	
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ЛБ_ТехническиеСтавкиСрезПоследних.СхемаКредитования КАК СхемаКредитования,
	//               |	ЛБ_ТехническиеСтавкиСрезПоследних.ДеньНачалаПрименения КАК ДеньНачалаПрименения,
	//               |	ЛБ_ТехническиеСтавкиСрезПоследних.ПроцентнаяСтавка КАК Ставка
	//               |ИЗ
	//               |	РегистрСведений.ЛБ_ТехническиеСтавки.СрезПоследних(&Дата, ) КАК ЛБ_ТехническиеСтавкиСрезПоследних";
	//ТехническиеСтавки = Запрос.Выполнить().Выгрузить();
	//
	//ТаблицаСК = ТаблицаЗапроса.Скопировать();
	//ТаблицаСК.Свернуть("СхемаКредитования");
	//Для каждого СтрК Из ТаблицаСК Цикл  
	//	Отбор = Новый Структура;
	//	Отбор.Вставить("СхемаКредитования", СтрК.СхемаКредитования);
	//	
	//	СтрокиТех = ТехническиеСтавки.НайтиСтроки(Отбор);
	//	Если НЕ СтрокиТех.Количество() = 0 Тогда 
	//		ДеньНачалаПримененияТех = СтрокиТех.Получить(0).ДеньНачалаПрименения; 
	//		СтавкаТех = СтрокиТех.Получить(0).Ставка; 
	//		 
	//		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор); 
	//		Для каждого Стр Из Строки Цикл
	//			НоваяСтр = ТаблицаЗапроса.Добавить(); 
	//			НоваяСтр.СхемаКредитования = Стр.СхемаКредитования;
	//			НоваяСтр.Категория = Стр.Категория;
	//			НоваяСтр.ДиапазонСумм = Стр.ДиапазонСумм;
	//			НоваяСтр.ПричинаПрименения = Стр.ПричинаПрименения;
	//			НоваяСтр.Срок = Стр.Срок; 
	//			НоваяСтр.ДеньНачалаПрименения = ДеньНачалаПримененияТех; 
	//			НоваяСтр.Ставка = СтавкаТех;
	//		Конеццикла;	 
	//	КонецЕсли;	
	//Конеццикла;	

	Возврат ТаблицаЗапроса;	
КонецФункции	

Функция ПолучитьВыборкуПрейскурантаСтавокАкция(Регистратор)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_АкцииПроцентныеСтавки.СхемаКредитования КАК СхемаКредитования,
		|	ЛБ_АкцииПроцентныеСтавки.СтатусЗалогодателя КАК Категория,
		|	ЛБ_АкцииПроцентныеСтавки.ДиапазонСуммЗайма КАК ДиапазонСумм,
		|	ЛБ_АкцииПроцентныеСтавки.ПричинаПрименения КАК ПричинаПрименения,
		|	ЛБ_АкцииПроцентныеСтавки.ПроцентнаяСтавка КАК Ставка
		|ИЗ
		|	РегистрСведений.ЛБ_АкцииПроцентныеСтавки КАК ЛБ_АкцииПроцентныеСтавки
		|ГДЕ
		|	ЛБ_АкцииПроцентныеСтавки.Регистратор = &Регистратор
		|
		|УПОРЯДОЧИТЬ ПО
		|	СхемаКредитования,
		|	Категория,
		|	ПричинаПрименения,
		|	ЛБ_АкцииПроцентныеСтавки.ДиапазонСуммЗайма.ПорядокСортировки";
	
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	Запрос.УстановитьПараметр("Дата", Регистратор.Дата);  
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();      
	
	Возврат ТаблицаЗапроса;	
КонецФункции	

Функция ФИОДиректора()
	
	Результат = "";
	
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Организации.Директор.Представление КАК Директор
		|ИЗ
		|	Константа.ЛБ_ОсновнаяОрганизация КАК ЛБ_ОсновнаяОрганизация
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО ЛБ_ОсновнаяОрганизация.Значение = Организации.Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.Директор;	
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НаименованиеОрганизации()
	
	Результат = Новый Структура("НаименованиеПолное, НаименованиеСокращенное", "", "");
	
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОсновнаяОрганизация.Значение.НаименованиеПолное КАК НаименованиеПолное,
		|	ЛБ_ОсновнаяОрганизация.Значение.НаименованиеСокращенное КАК НаименованиеСокращенное
		|ИЗ
		|	Константа.ЛБ_ОсновнаяОрганизация КАК ЛБ_ОсновнаяОрганизация
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО ЛБ_ОсновнаяОрганизация.Значение = Организации.Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат.НаименованиеПолное      = Выборка.НаименованиеПолное;
		Результат.НаименованиеСокращенное = Выборка.НаименованиеСокращенное;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
 
Функция ПолучитьСтрокуЛомбардов(Дата, СписокЛ) 
    Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ломбарды", СписокЛ);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ГруппыЛомбардовСрезПоследних.Ломбард КАК Ломбард,
	               |	ЛБ_ГруппыЛомбардовСрезПоследних.Группа КАК Группа
	               |ИЗ
	               |	РегистрСведений.ЛБ_ГруппыЛомбардов.СрезПоследних(&Дата, Ломбард В (&Ломбарды)) КАК ЛБ_ГруппыЛомбардовСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ГруппыЛомбардовСрезПоследних.Период УБЫВ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();   
	
	ТаблицаЛомбардов = Новый ТаблицаЗначений;
	ТаблицаЛомбардов.Колонки.Добавить("Группа");
	ТаблицаЛомбардов.Колонки.Добавить("Ломбард");
	
	Для каждого Эл из СписокЛ Цикл 
		Отбор = новый структура;
		Отбор.Вставить("Ломбард", Эл.Значение);
		
		СтрокиЗапроса = ТаблицаЗапроса.НайтиСтроки(Отбор); 
		Если СтрокиЗапроса.Количество() = 0 Тогда 
			СтрЛ = ТаблицаЛомбардов.Добавить(); 
			СтрЛ.Группа = "<...> (";
			СтрЛ.Ломбард = Эл.Значение;
		Иначе   
			СтрЗапроса = СтрокиЗапроса.Получить(0); 
			СтрЛ = ТаблицаЛомбардов.Добавить(); 
			СтрЛ.Группа = сокрЛП(СтрЗапроса.Группа) + " (";
			СтрЛ.Ломбард = СтрЗапроса.Ломбард;
		КонецЕсли;	
	Конеццикла;	                             
	ТаблицаЛомбардов.Сортировать("Группа, Ломбард");
	ТаблицаГрупп = ТаблицаЛомбардов.Скопировать(); 
	ТаблицаГрупп.Свернуть("Группа");
	
	СтрокаВозврата = ""; 
	Для каждого СтрГ из ТаблицаГрупп Цикл
		СтрокаВозврата = СтрокаВозврата + ?(ПустаяСтрока(СтрокаВозврата), "", "; ") + СтрГ.Группа;
		ОтборГ = новый структура;
		ОтборГ.Вставить("Группа", стрГ.Группа);   
		
		Строки = ТаблицаЛомбардов.НайтиСтроки(ОтборГ);
		Ном = 0;
		Для каждого Стр Из Строки Цикл
			СтрокаВозврата = СтрокаВозврата + ?(Ном = 0, "", ", ") + ?(ЗначениеЗаполнено(Стр.Ломбард.НомерЛомбарда), "№ "+ СокрЛП(Стр.Ломбард.НомерЛомбарда), СокрЛП(Стр.Ломбард)); 
			Ном = Ном + 1;
		Конеццикла;	    
		СтрокаВозврата = СтрокаВозврата + ")";
	Конеццикла;	
	
	Возврат СтрокаВозврата;
КонецФункции

Функция ПолучитьСтрокуОтделенийЛомбардов(Дата, СписокЛ) 
    Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ломбарды", СписокЛ);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард,
	               |	ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
	               |ИЗ
	               |	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, Ломбард В (&Ломбарды)) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ОтделенияЛомбардовСрезПоследних.Период УБЫВ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();   
	
	ТаблицаЛомбардов = Новый ТаблицаЗначений;
	ТаблицаЛомбардов.Колонки.Добавить("Отделение");
	ТаблицаЛомбардов.Колонки.Добавить("Ломбард");
	
	Для каждого Эл из СписокЛ Цикл 
		Отбор = новый структура;
		Отбор.Вставить("Ломбард", Эл.Значение);
		
		СтрокиЗапроса = ТаблицаЗапроса.НайтиСтроки(Отбор); 
		Если СтрокиЗапроса.Количество() = 0 Тогда 
			СтрЛ = ТаблицаЛомбардов.Добавить(); 
			СтрЛ.Отделение = "<...>";
			СтрЛ.Ломбард = Эл.Значение;
		Иначе   
			СтрЗапроса = СтрокиЗапроса.Получить(0); 
			СтрЛ = ТаблицаЛомбардов.Добавить(); 
			СтрЛ.Отделение = сокрЛП(СтрЗапроса.Отделение);
			СтрЛ.Ломбард = СтрЗапроса.Ломбард;
		КонецЕсли;	
	Конеццикла;	                             
	ТаблицаЛомбардов.Сортировать("Отделение, Ломбард");
	ТаблицаОтд = ТаблицаЛомбардов.Скопировать(); 
	ТаблицаОтд.Свернуть("Отделение");
	
	СтрокаВозврата = ""; 
	Для каждого СтрГ из ТаблицаОтд Цикл
		СтрокаВозврата = СтрокаВозврата + ?(ПустаяСтрока(СтрокаВозврата), "", "; ") + СтрГ.Отделение;
	Конеццикла;	
	
	Возврат СтрокаВозврата;
КонецФункции	 

Функция ПолучитьДанныеЗалогодателя(Залогодатели, Дата)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Залогодатель КАК Залогодатель,
		//|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Пол КАК Пол,
		//|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
		//|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя КАК ДокументЗалогодателя,
		//|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
		//|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
		//|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи
		//|ИЗ
		//|	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&Дата, ДокументЗалогодателя.Владелец В (&Залогодатель)) КАК ЛБ_ДокументыЗалогодателейСрезПоследних
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, ) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних
		//|		ПО (ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Залогодатель = ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя.Владелец)";
	
		//"ВЫБРАТЬ ПЕРВЫЕ 1
		//|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Залогодатель КАК Залогодатель,
		//|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Пол КАК Пол,
		//|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
		//|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя КАК ДокументЗалогодателя,
		//|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
		//|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
		//|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
		//|	ЛБ_ДокументыЗалогодателейСрезПоследних.Период КАК Период
		//|ИЗ
		//|	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&Дата, ДокументЗалогодателя.Владелец = &Залогодатель) КАК ЛБ_ДокументыЗалогодателейСрезПоследних
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, ) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних
		//|		ПО (ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Залогодатель = ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя.Владелец)
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	Период УБЫВ";
		
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Залогодатель КАК Залогодатель,
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Пол КАК Пол,
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.Период КАК Период,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК Серия,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК Номер,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДатаВыдачи,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК КемВыдан,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК КодПодразделения,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК СрокДействия
		|ИЗ
		|	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&Дата, ДокументЗалогодателя.Владелец = &Залогодатель) КАК ЛБ_ДокументыЗалогодателейСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, ) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних
		|		ПО (ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Залогодатель = ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя.Владелец)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
		
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Нпп = 1;
	
	Если ТипЗнч(Залогодатели) = Тип("СправочникСсылка.ЛБ_Сотрудники") Тогда
		Запрос.УстановитьПараметр("Залогодатель", Залогодатели);
		
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			Возврат Результат.Пол;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		Для каждого СтрЗ Из Залогодатели Цикл
			Запрос.УстановитьПараметр("Залогодатель", СтрЗ.Залогодатель);
			
			Результат = Запрос.Выполнить().Выгрузить();
			
			Если Результат.Количество() > 0 Тогда
				Если Нпп = 1 Тогда
					ТЗВозврата = Результат.Скопировать();
				Иначе
					НоваяСтр = ТЗВозврата.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтр, Результат[0]);
				КонецЕсли;
			КонецЕсли;
			
			Нпп = Нпп + 1;
		КонецЦикла;
	КонецЕсли;
	
	Если ТЗВозврата <> Неопределено И ТЗВозврата.Количество() > 0 Тогда
		Возврат ТЗВозврата;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция ПроверитьСтатусКлиентаВИП(Дата, Залогодатель)
	
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	
	Запрос.Текст = 
	//"ВЫБРАТЬ ПЕРВЫЕ 1
	//|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК Регистратор,
	//|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор.ВидОперации КАК РегистраторВидОперации,
	//|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия КАК ДатаНачалаДействия,
	//|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	//|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор.Комментарий КАК Комментарий,
	//|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период КАК Период
	//|ИЗ
	//|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
	//|ГДЕ
	//|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель = &Залогодатель
	//|	И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
	//|	И ВЫБОР
	//|			КОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия >= &Дата
	//|				ТОГДА ИСТИНА
	//|			КОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	//|				ТОГДА ИСТИНА
	//|			ИНАЧЕ ЛОЖЬ
	//|		КОНЕЦ
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период УБЫВ
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ ПЕРВЫЕ 1
	//|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор КАК Регистратор,
	//|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор.ВидОперации КАК РегистраторВидОперации,
	//|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия КАК ДатаНачалаДействия,
	//|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	//|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор.Комментарий КАК Комментарий,
	//|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период КАК Период
	//|ИЗ
	//|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
	//|ГДЕ
	//|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель = &Залогодатель
	//|	И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
	//|	И ВЫБОР
	//|			КОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия >= &Дата
	//|				ТОГДА ИСТИНА
	//|			КОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	//|				ТОГДА ИСТИНА
	//|			ИНАЧЕ ЛОЖЬ
	//|		КОНЕЦ
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период УБЫВ
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ ПЕРВЫЕ 1
	//|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор КАК Регистратор,
	//|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор.ВидОперации КАК РегистраторВидОперации,
	//|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия КАК ДатаНачалаДействия,
	//|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	//|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор.Комментарий КАК Комментарий,
	//|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период КАК Период
	//|ИЗ
	//|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
	//|ГДЕ
	//|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель = &Залогодатель
	//|	И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
	//|	И ВЫБОР
	//|			КОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия >= &Дата
	//|				ТОГДА ИСТИНА
	//|			КОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	//|				ТОГДА ИСТИНА
	//|			ИНАЧЕ ЛОЖЬ
	//|		КОНЕЦ
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период УБЫВ";

	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК Регистратор,
	|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор.ВидОперации КАК РегистраторВидОперации,
	|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор.Комментарий КАК Комментарий,
	|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период КАК Период
	|ИЗ
	|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия >= &Дата
	|				ТОГДА ИСТИНА
	|			КОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор КАК Регистратор,
	|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор.ВидОперации КАК РегистраторВидОперации,
	|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор.Комментарий КАК Комментарий,
	|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период КАК Период
	|ИЗ
	|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия >= &Дата
	|				ТОГДА ИСТИНА
	|			КОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор КАК Регистратор,
	|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор.ВидОперации КАК РегистраторВидОперации,
	|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор.Комментарий КАК Комментарий,
	|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период КАК Период
	|ИЗ
	|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия >= &Дата
	|				ТОГДА ИСТИНА
	|			КОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период УБЫВ";

	Пакеты = Запрос.ВыполнитьПакет();
	//Запрос.ВыполнитьПакетСПромежуточнымиДанными().Получить(0).Выгрузить()
	//ИспользуютсяСтавки = Ложь;
	//ИспользуютсяМаталлы = Ложь;
	//ИспользуютсяВставки = Ложь;
	//Используется = Ложь;
	//СрокДействия = Дата(1,1,1);
	//Комментарий = "";

	Ставки = Пакеты[0].Выбрать();
	Металлы = Пакеты[1].Выбрать();
	Вставки = Пакеты[2].Выбрать();

	СтруктураВозврата = Новый Структура("ИспользуютсяСтавки, ИспользуютсяМаталлы, ИспользуютсяВставки, ДокументСтавки, ДокументМеталлы, ДокументВставки", Ложь, Ложь, Ложь);

	Если Ставки.Следующий() Тогда
		Если Ставки.Регистратор.ВидОперации <> Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП Тогда
		//	Если Ставки.ДатаОкончанияДействия >= Дата ИЛИ Ставки.ДатаОкончанияДействия = Дата(1,1,1) Тогда
		//		ИспользуютсяСтавки = Ложь;
		//	КонецЕсли;	
		//Иначе
			//Если Ставки.ДатаОкончанияДействия >= Дата ИЛИ Ставки.ДатаОкончанияДействия = Дата(1,1,1) Тогда
				СтруктураВозврата.ИспользуютсяСтавки = Истина;
				СтруктураВозврата.ДокументСтавки = Ставки.Регистратор;
			//КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	Если Металлы.Следующий() Тогда
		Если Металлы.Регистратор.ВидОперации <> Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП Тогда
		//	Если Металлы.ДатаОкончанияДействия >= Дата ИЛИ Металлы.ДатаОкончанияДействия = Дата(1,1,1) Тогда
		//		ИспользуютсяМаталлы = Ложь;
		//	КонецЕсли;	
		//Иначе
			//Если Металлы.ДатаОкончанияДействия >= Дата ИЛИ Металлы.ДатаОкончанияДействия = Дата(1,1,1) Тогда
				СтруктураВозврата.ИспользуютсяМаталлы = Истина;
				СтруктураВозврата.ДокументМеталлы = Ставки.Регистратор;
			//Иначе
			//	СтруктураВозврата.ИспользуютсяСтавки = Ложь;
			//КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	Если Вставки.Следующий() Тогда
		Если Вставки.Регистратор.ВидОперации <> Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП Тогда
		//	Если Вставки.ДатаОкончанияДействия >= Дата ИЛИ Вставки.ДатаОкончанияДействия = Дата(1,1,1) Тогда
		//		ИспользуютсяВставки = Ложь;
		//	КонецЕсли;	
		//Иначе
		//	Если Вставки.ДатаОкончанияДействия >= Дата ИЛИ Вставки.ДатаОкончанияДействия = Дата(1,1,1) Тогда
				СтруктураВозврата.ИспользуютсяВставки = Истина;
				СтруктураВозврата.ДокументВставки = Ставки.Регистратор;
			//Иначе
			//	СтруктураВозврата.ИспользуютсяСтавки = Ложь;
			//КонецЕсли;	
		КонецЕсли;
	КонецЕсли;

	//Если ИспользуютсяСтавки ИЛИ ИспользуютсяМаталлы ИЛИ ИспользуютсяВставки Тогда
	//	Используется = Истина;
	//КонецЕсли;
	
	//СтруктураВозврата.Вставить("Используется", Используется);
	//СтруктураВозврата.Вставить("СрокДействия", СрокДействия);
	//СтруктураВозврата.Вставить("Комментарий", Комментарий);
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция СвормироватьСтрокуОтменяемыхПриказов(ТЗ)
	
	ТЗНомеров = ТЗ.Скопировать(, "НомерПриказа, ДатаДокумента");
	ТЗНомеров.Свернуть("НомерПриказа, ДатаДокумента");
	
	СтрокаВозврата = "";
	НомераИДаты = "";

	Если ТЗНомеров.Количество() > 1 Тогда
		СтрокаВозврата = "ами ";
	Иначе
		СтрокаВозврата = "ом ";
	КонецЕсли;
	
	Для каждого СтрТЗ Из ТЗНомеров Цикл
		Если НомераИДаты <> "" Тогда
			НомераИДаты = НомераИДаты + ", ";
		КонецЕсли;
		
		НомераИДаты = НомераИДаты + "№ " + СтрТЗ.НомерПриказа + " от " + Формат(СтрТЗ.ДатаДокумента, "ДФ=dd.MM.yyyy") + "г.";
	КонецЦикла;
	
	Возврат СтрокаВозврата + НомераИДаты;
	
КонецФункции
#КонецЕсли 

  














