#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Перем ТаблицаСтавок Экспорт;
Перем ТаблицаЦенМеталлы Экспорт;
Перем ТаблицаЦенВставки Экспорт;
Перем ТаблицаНастроекМеталлы Экспорт;
Перем ТаблицаНастроекВставки Экспорт;
	
Процедура ПодготовитьТаблицыДокументаМеталлы(ТаблицаЦен, ТаблицаНастроекМеталлы, Док = Неопределено, Залогодатель = Неопределено) Экспорт //+МАН 25.08.25 добавил параметр
	
	//+МАН 25.08.25
	Если Док = Неопределено Тогда
		Документ = Ссылка;
	Иначе
		Документ = Док;
	КонецЕсли;
	//-МАН
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Документ); //+МАН 25.08.25 Было: Ссылка
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПриказИндивидуальныеУсловияНастройкаОтклоненийОтБазовыхЦенМеталлы.КатегорияОбъектаЗалога КАК КатегорияОбъектаЗалога,
	               |	ЛБ_ПриказИндивидуальныеУсловияНастройкаОтклоненийОтБазовыхЦенМеталлы.СхемаКредитования КАК СхемаКредитования,
	               |	ЛБ_ПриказИндивидуальныеУсловияНастройкаОтклоненийОтБазовыхЦенМеталлы.Металл КАК Металл,
	               |	ЛБ_ПриказИндивидуальныеУсловияНастройкаОтклоненийОтБазовыхЦенМеталлы.Проба КАК Проба,
	               |	ЛБ_ПриказИндивидуальныеУсловияНастройкаОтклоненийОтБазовыхЦенМеталлы.ОтклонениеОтБазовойЦены КАК ОтклонениеОтБазовойЦены,
	               |	ЛБ_ПриказИндивидуальныеУсловияНастройкаОтклоненийОтБазовыхЦенМеталлы.ЗначениеОтклонения КАК ЗначениеОтклонения
	               |ИЗ
	               |	Документ.ЛБ_ПриказИндивидуальныеУсловия.НастройкаОтклоненийОтБазовыхЦенМеталлы КАК ЛБ_ПриказИндивидуальныеУсловияНастройкаОтклоненийОтБазовыхЦенМеталлы
	               |ГДЕ
	               |	ЛБ_ПриказИндивидуальныеУсловияНастройкаОтклоненийОтБазовыхЦенМеталлы.Ссылка = &Ссылка";
		
	РезультатЗапросаПоНастройкам = Запрос.Выполнить();

	//+МАН 25.08.25 Изменил с функции на процедуру
	//ТаблицаНастроекМеталлы = ПодготовитьТаблицуНастроекМеталлы(РезультатЗапросаПоНастройкам, Док); //+МАН 25.08.25 добавил параметр
	ПодготовитьТаблицуНастроекМеталлы(РезультатЗапросаПоНастройкам, Док, Залогодатель); //+МАН 25.08.25 добавил параметр

КонецПроцедуры // ПодготовитьТаблицыДокумента()

Процедура ПодготовитьТаблицыДокументаВставки(ТаблицаЦенВставки, ТаблицаНастроекВставки, Док = Неопределено, Залогодатель = Неопределено) Экспорт //+МАН 25.08.25 добавил параметр

	//+МАН 25.08.25
	Если Док = Неопределено Тогда
		Документ = Ссылка;
	Иначе
		Документ = Док;
	КонецЕсли;
	//-МАН
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Документ); //+МАН 25.08.25 Было: Ссылка
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПриказИндивидуальныеУсловияНастройкаОтклоненийОтБазовыхЦенВставки.КачествоОгранки КАК КачествоОгранки,
	               |	ЛБ_ПриказИндивидуальныеУсловияНастройкаОтклоненийОтБазовыхЦенВставки.СхемаКредитования КАК СхемаКредитования,
	               |	ЛБ_ПриказИндивидуальныеУсловияНастройкаОтклоненийОтБазовыхЦенВставки.ВидВставки КАК ВидВставки,
	               |	ЛБ_ПриказИндивидуальныеУсловияНастройкаОтклоненийОтБазовыхЦенВставки.ВидОгранки КАК ВидОгранки,
	               |	ЛБ_ПриказИндивидуальныеУсловияНастройкаОтклоненийОтБазовыхЦенВставки.ОтклонениеОтБазовойЦены КАК ОтклонениеОтБазовойЦены,
	               |	ЛБ_ПриказИндивидуальныеУсловияНастройкаОтклоненийОтБазовыхЦенВставки.ЗначениеОтклонения КАК ЗначениеОтклонения
	               |ИЗ
	               |	Документ.ЛБ_ПриказИндивидуальныеУсловия.НастройкаОтклоненийОтБазовыхЦенВставки КАК ЛБ_ПриказИндивидуальныеУсловияНастройкаОтклоненийОтБазовыхЦенВставки
	               |ГДЕ
	               |	ЛБ_ПриказИндивидуальныеУсловияНастройкаОтклоненийОтБазовыхЦенВставки.Ссылка = &Ссылка";
		
	РезультатЗапросаПоНастройкам = Запрос.Выполнить();

	// Подготовим таблицу товаров для проведения.
	//+МАН 25.08.25 Изменил с функции на процедуру
	//ТаблицаНастроекВставки = ПодготовитьТаблицуНастроекВставки(РезультатЗапросаПоНастройкам, Док);
	ПодготовитьТаблицуНастроекВставки(РезультатЗапросаПоНастройкам, Док, Залогодатель);

КонецПроцедуры // ПодготовитьТаблицыДокумента()


// Процедура формирует таблицы по табличным частям документа.
//
Процедура ПодготовитьТаблицыДокументаПроцентныеСтавки(ТаблицаСтавок, Док = Неопределено, Залогодатель = Неопределено) Экспорт //+МАН 25.08.25 добавил параметр
	//+МАН 25.08.25
	Если Док = Неопределено Тогда
		Документ = Ссылка;
	Иначе
		Документ = Док;
	КонецЕсли;
	//-МАН
	
    Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Документ); //+МАН 25.08.25 Было: Ссылка
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПриказИндивидуальныеУсловия.СхемаКредитования КАК СхемаКредитования,
	               |	ЛБ_ПриказИндивидуальныеУсловия.ДиапазонСумм КАК ДиапазонСумм,
	               |	ЛБ_ПриказИндивидуальныеУсловия.Ставка КАК Ставка
	               |ИЗ
	               |	Документ.ЛБ_ПриказИндивидуальныеУсловия.СтавкиПроцентов КАК ЛБ_ПриказИндивидуальныеУсловия
	               |ГДЕ
	               |	ЛБ_ПриказИндивидуальныеУсловия.Ссылка = &Ссылка";
		
	РезультатЗапроса = Запрос.Выполнить();

	// Подготовим таблицу товаров для проведения.
	//+МАН 25.08.25 Изменил с функции на процедуру
	//ТаблицаСтавок = ПодготовитьТаблицуСтавок(РезультатЗапроса, Док);
	ПодготовитьТаблицуСтавок(РезультатЗапроса, Док, Залогодатель);

КонецПроцедуры // ПодготовитьТаблицыДокументаПроцентныеСтавки()  

Процедура ПодготовитьТаблицуНастроекМеталлы(РезультатЗапросаПоНастройкам, Док = Неопределено, Залогодатель = Неопределено) Экспорт //+МАН 25.08.25 добавил параметр

	ТаблицаЗапроса = РезультатЗапросаПоНастройкам.Выгрузить();

	Если ТаблицаНастроекМеталлы = Неопределено Тогда
		ТаблицаНастроекМеталлы = ТаблицаЗапроса.Скопировать();
		ТаблицаНастроекМеталлы.Очистить();
		ТаблицаНастроекМеталлы.Колонки.Добавить("Залогодатель");
		ТаблицаНастроекМеталлы.Колонки.Добавить("Приказ");
	КонецЕсли;

	Если Ссылка.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП Тогда
		//Для каждого СтрЛ Из Залогодатели Цикл		
			//Отбор = Новый Структура;
			//Отбор.Вставить("Залогодатель", СтрЛ.Залогодатель);
			
			//МПоиска = Док.Залогодатели.НайтиСтроки(Отбор);
			//
			//Если МПоиска.Количество() > 0 Тогда
				Для каждого Стр Из  ТаблицаЗапроса Цикл 
					Если Стр.ЗначениеОтклонения = 0 Тогда
						Продолжить;
					КонецЕсли;	
					НоваяСтр = ТаблицаНастроекМеталлы.Добавить();
					//НоваяСтр.Залогодатель = СтрЛ.Залогодатель;
					НоваяСтр.Залогодатель = Залогодатель;
					НоваяСтр.Приказ = Док;
					НоваяСтр.Металл = Стр.Металл;
					НоваяСтр.Проба = Стр.Проба;
					НоваяСтр.СхемаКредитования = Стр.СхемаКредитования;
					НоваяСтр.КатегорияОбъектаЗалога = Стр.КатегорияОбъектаЗалога;
					НоваяСтр.ОтклонениеОтБазовойЦены = Стр.ОтклонениеОтБазовойЦены; 
					НоваяСтр.ЗначениеОтклонения = Стр.ЗначениеОтклонения;
				КонецЦикла;
			//КонецЕсли;
		//КонецЦикла;
	Иначе
		Для каждого СтрЛ Из Залогодатели Цикл		
			Для каждого Стр Из  ТаблицаЗапроса Цикл 
				Если Стр.ЗначениеОтклонения = 0 Тогда
					Продолжить;
				КонецЕсли;	
				НоваяСтр = ТаблицаНастроекМеталлы.Добавить();
				НоваяСтр.Залогодатель = СтрЛ.Залогодатель;
				НоваяСтр.Металл = Стр.Металл;
				НоваяСтр.Проба = Стр.Проба;
				НоваяСтр.СхемаКредитования = Стр.СхемаКредитования;
				НоваяСтр.КатегорияОбъектаЗалога = Стр.КатегорияОбъектаЗалога;
	            НоваяСтр.ОтклонениеОтБазовойЦены = Стр.ОтклонениеОтБазовойЦены; 
				НоваяСтр.ЗначениеОтклонения = Стр.ЗначениеОтклонения;
			КонецЦикла;	
		КонецЦикла;	
	КонецЕсли;	
	
	//Возврат ТаблицаНастроек;

КонецПроцедуры // ПодготовитьТаблицуНастроек()

Процедура ПодготовитьТаблицуНастроекВставки(РезультатЗапросаПоНастройкам, Док = Неопределено, Залогодатель = Неопределено) Экспорт

	ТаблицаЗапроса = РезультатЗапросаПоНастройкам.Выгрузить();

	Если ТаблицаНастроекВставки = Неопределено Тогда
		ТаблицаНастроекВставки = ТаблицаЗапроса.Скопировать();
		ТаблицаНастроекВставки.Очистить();
		ТаблицаНастроекВставки.Колонки.Добавить("Залогодатель");
		ТаблицаНастроекВставки.Колонки.Добавить("Приказ");
	КонецЕсли;

	Если Ссылка.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП Тогда
		//Для каждого СтрЛ Из Залогодатели Цикл		
			//Отбор = Новый Структура;
			//Отбор.Вставить("Залогодатель", СтрЛ.Залогодатель);
			//
			//МПоиска = Док.Залогодатели.НайтиСтроки(Отбор);
			//
			//Если МПоиска.Количество() > 0 Тогда
				Для каждого Стр Из  ТаблицаЗапроса Цикл 
					Если Стр.ЗначениеОтклонения = 0 Тогда
						Продолжить;
					КонецЕсли;	
					НоваяСтр = ТаблицаНастроекВставки.Добавить();
					//НоваяСтр.Залогодатель = СтрЛ.Залогодатель;
					НоваяСтр.Залогодатель = Залогодатель;
					НоваяСтр.Приказ = Док;
					НоваяСтр.ВидВставки = Стр.ВидВставки;
					НоваяСтр.ВидОгранки = Стр.ВидОгранки;
					НоваяСтр.КачествоОгранки = Стр.КачествоОгранки;
					НоваяСтр.ОтклонениеОтБазовойЦены = Стр.ОтклонениеОтБазовойЦены; 
					НоваяСтр.ЗначениеОтклонения = Стр.ЗначениеОтклонения;
					НоваяСтр.СхемаКредитования = Стр.СхемаКредитования;
				КонецЦикла;
			//КонецЕсли;
		//КонецЦикла;
	Иначе
		Для каждого СтрЛ Из Залогодатели Цикл		
			Для каждого Стр Из  ТаблицаЗапроса Цикл 
				Если Стр.ЗначениеОтклонения = 0 Тогда
					Продолжить;
				КонецЕсли;	
				НоваяСтр = ТаблицаНастроекВставки.Добавить();
				НоваяСтр.Залогодатель = СтрЛ.Залогодатель;
				НоваяСтр.ВидВставки = Стр.ВидВставки;
				НоваяСтр.ВидОгранки = Стр.ВидОгранки;
				НоваяСтр.КачествоОгранки = Стр.КачествоОгранки;
	            НоваяСтр.ОтклонениеОтБазовойЦены = Стр.ОтклонениеОтБазовойЦены; 
				НоваяСтр.ЗначениеОтклонения = Стр.ЗначениеОтклонения;
				НоваяСтр.СхемаКредитования = Стр.СхемаКредитования;
			КонецЦикла;	
		КонецЦикла;	
	КонецЕсли;	
	
	//Возврат ТаблицаНастроек;

КонецПроцедуры // ПодготовитьТаблицуНастроек()

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  СтруктураШапкиДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблиица значений.
//
Процедура ПодготовитьТаблицуСтавок(РезультатЗапроса, Док = Неопределено, Залогодатель = Неопределено) Экспорт

	ТаблицаЗапроса = РезультатЗапроса.Выгрузить();

	Если ТаблицаСтавок = Неопределено Тогда
		ТаблицаСтавок = ТаблицаЗапроса.Скопировать();
		ТаблицаСтавок.Очистить();
		ТаблицаСтавок.Колонки.Добавить("Залогодатель");
		ТаблицаСтавок.Колонки.Добавить("Приказ");
	КонецЕсли;

	Если Ссылка.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП Тогда
		//Для каждого СтрЛ Из Залогодатели Цикл		
		//	Отбор = Новый Структура;
		//	Отбор.Вставить("Залогодатель", СтрЛ.Залогодатель);
		//	
		//	МПоиска = Док.Залогодатели.НайтиСтроки(Отбор);
		//	
		//	Если МПоиска.Количество() > 0 Тогда
				Для каждого Стр Из  ТаблицаЗапроса Цикл 
					Если НЕ ЗначениеЗаполнено(Стр.Ставка) Тогда
						Продолжить;
					КонецЕсли;	
					НоваяСтр = ТаблицаСтавок.Добавить();
					//НоваяСтр.Залогодатель = СтрЛ.Залогодатель.Ссылка;
					НоваяСтр.Залогодатель = Залогодатель;
					НоваяСтр.Приказ = Док;
					НоваяСтр.СхемаКредитования = Стр.СхемаКредитования;
					НоваяСтр.ДиапазонСумм = Стр.ДиапазонСумм;  
					НоваяСтр.Ставка = Стр.Ставка; 
				КонецЦикла;
		//	КонецЕсли;
		//КонецЦикла;
	Иначе
		Для каждого СтрЛ Из Залогодатели Цикл		
			Для каждого Стр Из  ТаблицаЗапроса Цикл
				Если НЕ ЗначениеЗаполнено(Стр.Ставка) Тогда
					Продолжить;
				КонецЕсли;	 
				НоваяСтр = ТаблицаСтавок.Добавить();
				НоваяСтр.Залогодатель = СтрЛ.Залогодатель.Ссылка;
				НоваяСтр.СхемаКредитования = Стр.СхемаКредитования;
	            НоваяСтр.ДиапазонСумм = Стр.ДиапазонСумм;  
				НоваяСтр.Ставка = Стр.Ставка; 
			КонецЦикла;	
		КонецЦикла;	
	КонецЕсли;	
	
	//Возврат ТаблицаСтавок;

КонецПроцедуры // ПодготовитьТаблицуТоваров()

// По результату запроса по шапке документа формируем движения по регистрам.
//
// Параметры: 
//  РежимПроведения           - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента   - выборка из результата запроса по шапке документа,
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары,
//  ТаблицаПоСкидкам          - таблица значений, содержащая данные для проведения и проверки ТЧ Скидки,
//  ТаблицаПоУслугам          - таблица значений, содержащая данные для проведения и проверки ТЧ "Услуги",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(РежимПроведения, ТаблицаЦенМеталлы, ТаблицаНастроекМеталлы, ТаблицаЦенВставки, ТаблицаНастроекВставки, ТаблицаСтавок, Отказ)
	ДатаНачалаДействия = ?(ЭтотОбъект.ДатаНачалаДействияПриказа = Дата(1,1,1), Дата, ?(ДатаНачалаДействияПриказа < Дата, Дата, ДатаНачалаДействияПриказа));
	
	Если ТаблицаНастроекМеталлы <> Неопределено Тогда
		Движения.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Записывать = Истина;
		
		Для Каждого ТекСтрокаН Из ТаблицаНастроекМеталлы Цикл
			
			//+МАН 25.08.25 Убрал
			//+МАН 09.12.24 Проверяем есть ли условия по залогодателю. Заявка 2792
			//СтрокаЗ = ЭтотОбъект.ОтменяемыйПриказ.Залогодатели.Найти(ТекСтрокаН.Залогодатель, "Залогодатель");
			//Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП И СтрокаЗ.НетМеталлов Тогда
			//	Продолжить;
			//КонецЕсли;
			//-МАН
			
			Движение = Движения.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Добавить();
			//+МАН 10.09.25 Сделано для проверки. Если не будет ни каких проблем, то останется так.
			//Движение.Период = Дата;
			Движение.Период = ?(НачалоДня(Дата) = НачалоДня(ДатаНачалаДействия), Дата, НачалоДня(ДатаНачалаДействия));
			//
			//+МАН 10.02.25
			//Было:Движение.ДатаНачалаДействия = ДатаНачалаДействия;
			Движение.ДатаНачалаДействия = НачалоДня(ДатаНачалаДействия);
			//-МАН
			Движение.ДатаОкончанияДействия = ДатаОкончанияДействияПриказа;
			Движение.Залогодатель = ТекСтрокаН.Залогодатель; 
			Движение.Металл = ТекСтрокаН.Металл;
			Движение.Проба = ТекСтрокаН.Проба;
			Движение.СхемаКредитования = ТекСтрокаН.СхемаКредитования;
			Движение.КатегорияОбъектаЗалога = ТекСтрокаН.КатегорияОбъектаЗалога;
			Движение.ОтклонениеОтБазовойЦены = ТекСтрокаН.ОтклонениеОтБазовойЦены;
			Движение.ЗначениеОтклонения = ТекСтрокаН.ЗначениеОтклонения;
			//Движение.ОтменяемыйПриказ = ЭтотОбъект.ОтменяемыйПриказ;
			Движение.ОтменяемыйПриказ = ?(ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП, ТекСтрокаН.Приказ, Документы.ЛБ_ПриказИндивидуальныеУсловия.ПустаяСсылка());
		КонецЦикла;
	КонецЕсли;

	Если ТаблицаНастроекВставки <> Неопределено Тогда
		Движения.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Записывать = Истина;
		
		Для Каждого ТекСтрокаН Из ТаблицаНастроекВставки Цикл
			
			//+МАН 25.08.25 Убрал
			//+МАН 09.12.24 Проверяем есть ли условия по залогодателю. Заявка 2792
			//СтрокаЗ = ЭтотОбъект.ОтменяемыйПриказ.Залогодатели.Найти(ТекСтрокаН.Залогодатель, "Залогодатель");
			//Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП И СтрокаЗ.НетВставок Тогда
			//	Продолжить;
			//КонецЕсли;
			//-МАН
			
			Движение = Движения.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Добавить();
			//+МАН 10.09.25 Сделано для проверки. Если не будет ни каких проблем, то останется так.
			//Движение.Период = Дата;
			Движение.Период = ?(НачалоДня(Дата) = НачалоДня(ДатаНачалаДействия), Дата, НачалоДня(ДатаНачалаДействия));
			//
			//+МАН 10.02.25
			//Было:Движение.ДатаНачалаДействия = ДатаНачалаДействия;
			Движение.ДатаНачалаДействия = НачалоДня(ДатаНачалаДействия);
			//-МАН
			Движение.ДатаОкончанияДействия = ДатаОкончанияДействияПриказа;
			Движение.СхемаКредитования = ТекСтрокаН.СхемаКредитования; 
			Движение.Залогодатель = ТекСтрокаН.Залогодатель; 
			Движение.ВидВставки = ТекСтрокаН.ВидВставки;
			Движение.ВидОгранки = ТекСтрокаН.ВидОгранки;
			Движение.КачествоОгранки = ТекСтрокаН.КачествоОгранки;
			Движение.ОтклонениеОтБазовойЦены = ТекСтрокаН.ОтклонениеОтБазовойЦены;
			Движение.ЗначениеОтклонения = ТекСтрокаН.ЗначениеОтклонения;
			//Движение.ОтменяемыйПриказ = ЭтотОбъект.ОтменяемыйПриказ;
			Движение.ОтменяемыйПриказ = ?(ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП, ТекСтрокаН.Приказ, Документы.ЛБ_ПриказИндивидуальныеУсловия.ПустаяСсылка());
		КонецЦикла;
	КонецЕсли;
    //-Мельников
	
	Если ТаблицаСтавок <> Неопределено Тогда
		Движения.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Записывать = Истина;
		
		Для Каждого ТекСтрокаС Из ТаблицаСтавок Цикл
			
			//+МАН 25.08.25 Убрал
			//+МАН 09.12.24 Проверяем есть ли условия по залогодателю. Заявка 2792
			//СтрокаЗ = ЭтотОбъект.ОтменяемыйПриказ.Залогодатели.Найти(ТекСтрокаС.Залогодатель, "Залогодатель");
			//Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП И СтрокаЗ.НетСтавок Тогда
			//	Продолжить;
			//КонецЕсли;
			//-МАН
			
			Движение = Движения.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Добавить();
			//+МАН 10.09.25 Сделано для проверки. Если не будет ни каких проблем, то останется так.
			//Движение.Период = Дата;
			Движение.Период = ?(НачалоДня(Дата) = НачалоДня(ДатаНачалаДействия), Дата, НачалоДня(ДатаНачалаДействия));
			//
			//+МАН 10.02.25
			//Было:Движение.ДатаНачалаДействия = ДатаНачалаДействия;
			Движение.ДатаНачалаДействия = НачалоДня(ДатаНачалаДействия);
			//-МАН
			Движение.ДатаОкончанияДействия = ДатаОкончанияДействияПриказа;
			Движение.Залогодатель = ТекСтрокаС.Залогодатель;
			Движение.СхемаКредитования = ТекСтрокаС.СхемаКредитования;
			Движение.ДиапазонСуммЗайма = ТекСтрокаС.ДиапазонСумм;
			Движение.ПроцентнаяСтавка = ТекСтрокаС.Ставка;
			//Движение.ОтменяемыйПриказ = ЭтотОбъект.ОтменяемыйПриказ;
			Движение.ОтменяемыйПриказ = ?(ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП, ТекСтрокаС.Приказ, Документы.ЛБ_ПриказИндивидуальныеУсловия.ПустаяСсылка());
		КонецЦикла;
	КонецЕсли;
		
	Движения.ЛБ_СтатусыЗалогодателейДополнительные.Записывать = Истина;
	Для Каждого СтрЗ Из ЭтотОбъект.Залогодатели Цикл
		
		//+МАН 03.02.25 Заккоментировал. При отметне так же должна делаться запись в регистр. Проверка сделана ниже. Заявка 2792
		////+МАН 09.12.24 Проверяем есть ли условия по залогодателю, чтобы не отменить статус ВИП. Заявка 2792
		////СтрокаЗ = ЭтотОбъект.ОтменяемыйПриказ.Залогодатели.Найти(СтрЗ.Залогодатель, "Залогодатель");
		//Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП И
		//	(НЕ СтрЗ.НетСтавок ИЛИ НЕ СтрЗ.НетМеталлов ИЛИ НЕ СтрЗ.НетВставок) Тогда
		//	//(НЕ СтрокаЗ.НетСтавок ИЛИ НЕ СтрокаЗ.НетМеталлов ИЛИ НЕ СтрокаЗ.НетВставок) Тогда
		//	Продолжить;
		//КонецЕсли;
		////-МАН
		
		Движение = Движения.ЛБ_СтатусыЗалогодателейДополнительные.Добавить();
		//+МАН 05.02.25 В период записывается дата начала. Заявка 2792
		//Было: Движение.Период = Дата;
		Движение.Период = НачалоДня(ДатаНачалаДействияПриказа);
		//-МАН
		Движение.СрокДействия = ДатаОкончанияДействияПриказа;
		Движение.Залогодатель = СтрЗ.Залогодатель;
		//Движение.ПричинаПрименения = ТекСтрокаС.ПричинаПрименения;
		
		//+МАН 03.02.25 Изменил проверку: если хоть один из видов условий активный, то при отмене все равно делается запись в регистр в статусе "Используется = Истина".
		//Нужно для корректного отображения в отчете "История клиента". Заявка 2792
		////+МАН 09.12.24 Исправил проведение документа отмены. Заявка 2792
		//Движение.Используется = ?(ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП, Ложь, Истина);
		////-МАН
		
		//+МАН 01.08.25 Изменил проверку.
		//Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП И
		//	(НЕ СтрЗ.НетСтавок ИЛИ НЕ СтрЗ.НетМеталлов ИЛИ НЕ СтрЗ.НетВставок) Тогда
		Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП Тогда
			
			СтруктураУсловий = Новый Структура();
			СтруктураУсловий.Вставить("Ставки", ЭтотОбъект.ОтменаСтавок);
			СтруктураУсловий.Вставить("Металлы", ЭтотОбъект.ОтменаМеталлов);
			СтруктураУсловий.Вставить("Вставки", ЭтотОбъект.ОтменаВставкок);
		//-МАН
		
			//+МАН 25.08.25
			МПриказовОтмены = Новый Массив;
			
			Для каждого СтрП Из ЭтотОбъект.ОтменяемыеПриказы Цикл
				МПриказовОтмены.Добавить(СтрП.Приказ);
			КонецЦикла;
			
			//+МАН 26.02.25
			//ДействующийПриказ = НайтиДействующийПриказ(ЭтотОбъект.Дата, СтрЗ.Залогодатель, ЭтотОбъект.ОтменяемыйПриказ, СтруктураУсловий);
			ДействующийПриказ = НайтиДействующийПриказ(ЭтотОбъект.Дата, СтрЗ.Залогодатель, МПриказовОтмены, СтруктураУсловий);
			//-МАН
			
			Если ДействующийПриказ <> Неопределено Тогда
				Движение.СрокДействия = ДействующийПриказ.ДатаОкончанияДействияПриказа;
				Движение.Используется = Истина;
			//+МАН 25.08.25 Добавил
			Иначе
				Движение.Используется = Ложь;
			//-МАН
			КонецЕсли;
			//-МАН
			
			//Движение.Используется = Истина; //+МАН 25.08.25 Убрал
		ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ВИП Тогда
			Движение.Используется = Истина;
		Иначе
			Движение.Используется = Ложь;
		КонецЕсли;
		//-МАН
		
        Движение.Комментарий = ЭтотОбъект.Комментарий;
		Движение.Статус = Справочники.ЛБ_СтатусыЗалогодателей.VIP;
		
		//-МАН
	КонецЦикла;

	//+МАН 25.08.25 Убрал для отмены. Позже можно будет вообще убрать.
	//+МАН 09.12.24 записываем, что было отменено. Заявка 2792
	//Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП Тогда
	//	Для Каждого СтрЗ Из ЭтотОбъект.Залогодатели Цикл
	//		
	//		ОтменяемыйДокОбъект = ЭтотОбъект.ОтменяемыйПриказ.ПолучитьОбъект();
	//		
	//		СтрокаЗ = ОтменяемыйДокОбъект.Залогодатели.Найти(СтрЗ.Залогодатель, "Залогодатель");
	//		Если ТаблицаСтавок.Количество() > 0 И НЕ СтрокаЗ.НетСтавок Тогда
	//			СтрокаЗ.НетСтавок = Истина;
	//		КонецЕсли;
	//		Если ТаблицаНастроекВставки.Количество() > 0 И НЕ СтрокаЗ.НетВставок Тогда
	//			СтрокаЗ.НетВставок = Истина;
	//		КонецЕсли;
	//		Если ТаблицаНастроекМеталлы.Количество() > 0 И НЕ СтрокаЗ.НетМеталлов Тогда
	//			СтрокаЗ.НетМеталлов = Истина;
	//		КонецЕсли;
	//		
	//		Попытка
	//			ОтменяемыйДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	//		Исключение
	//			Описание = ОписаниеОшибки();
	//			Инф = ИнформацияОбОшибке();
	//			Сообщить(Инф.Причина.Описание);
	//		КонецПопытки;
	//	КонецЦикла;
	////+МАН 26.02.25
	//ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ВИП Тогда
	Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ВИП Тогда
		Для Каждого СтрЗ Из ЭтотОбъект.Залогодатели Цикл
			
			Если ТаблицаСтавок.Количество() = 0 Тогда
				СтрЗ.НетСтавок = Истина;
			Иначе
				СтрЗ.НетСтавок = Ложь;
			КонецЕсли;
			
			Если ТаблицаНастроекВставки.Количество() = 0 Тогда
				СтрЗ.НетВставок = Истина;
			Иначе
				СтрЗ.НетВставок = Ложь;
			КонецЕсли;
			
			Если ТаблицаНастроекМеталлы.Количество() = 0 Тогда
				СтрЗ.НетМеталлов = Истина;
			Иначе
				СтрЗ.НетМеталлов = Ложь;
			КонецЕсли;
		КонецЦикла;
		
		Попытка
			ЭтотОбъект.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			Описание = ОписаниеОшибки();
			Инф = ИнформацияОбОшибке();
			Сообщить(Инф.Причина.Описание);
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры // ДвиженияПоРегистрам()

Функция НайтиДействующийПриказСтараяПроцедура(Дата, Залогодатель, ОтменяемыйДок, СтруктураУсловий) //+МАН Оставил пока тестирую. При необходимости убрать приписку СтараяПроцедура.

	//+МАН 28.07.25 Изменил Запрос
	Запрос = Новый Запрос;
	Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	Ставки.Регистратор КАК Регистратор,
		//|	Ставки.Период КАК Период
		//|ИЗ
		//|	(ВЫБРАТЬ ПЕРВЫЕ 1
		//|		ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК Регистратор,
		//|		ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период КАК Период
		//|	ИЗ
		//|		РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		//|	ГДЕ
		//|		ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель = &Залогодатель
		//|		И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
		//|		И ВЫБОР
		//|				КОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		//|					ТОГДА ИСТИНА
		//|				КОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия >= &Дата
		//|					ТОГДА ИСТИНА
		//|				ИНАЧЕ ЛОЖЬ
		//|			КОНЕЦ
		////|		И НЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор В
		////|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		////|						ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ОтменяемыйПриказ КАК ОтменяемыйПриказ
		////|					ИЗ
		////|						РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		////|					ГДЕ
		////|						ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель = &Залогодатель
		////|						И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
		////|						И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ОтменяемыйПриказ <> ЗНАЧЕНИЕ(Документ.ЛБ_ПриказИндивидуальныеУсловия.ПустаяСсылка))
		//|		И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ВИП)
		//|	
		//|	УПОРЯДОЧИТЬ ПО
		//|		ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период УБЫВ) КАК Ставки
		//|
		//|ОБЪЕДИНИТЬ
		//|
		//|ВЫБРАТЬ
		//|	Металлы.Регистратор,
		//|	Металлы.Период
		//|ИЗ
		//|	(ВЫБРАТЬ ПЕРВЫЕ 1
		//|		ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор КАК Регистратор,
		//|		ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период КАК Период
		//|	ИЗ
		//|		РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
		//|	ГДЕ
		//|		ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель = &Залогодатель
		//|		И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
		//|		И ВЫБОР
		//|				КОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		//|					ТОГДА ИСТИНА
		//|				КОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия >= &Дата
		//|					ТОГДА ИСТИНА
		//|				ИНАЧЕ ЛОЖЬ
		//|			КОНЕЦ
		////|		И НЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор В
		////|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		////|						ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ОтменяемыйПриказ КАК ОтменяемыйПриказ
		////|					ИЗ
		////|						РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
		////|					ГДЕ
		////|						ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель = &Залогодатель
		////|						И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
		////|						И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ОтменяемыйПриказ <> ЗНАЧЕНИЕ(Документ.ЛБ_ПриказИндивидуальныеУсловия.ПустаяСсылка))
		//|		И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ВИП)
		//|	
		//|	УПОРЯДОЧИТЬ ПО
		//|		ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период УБЫВ) КАК Металлы
		//|
		//|ОБЪЕДИНИТЬ
		//|
		//|ВЫБРАТЬ
		//|	Вставки.Регистратор,
		//|	Вставки.Период
		//|ИЗ
		//|	(ВЫБРАТЬ ПЕРВЫЕ 1
		//|		ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор КАК Регистратор,
		//|		ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период КАК Период
		//|	ИЗ
		//|		РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
		//|	ГДЕ
		//|		ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель = &Залогодатель
		//|		И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
		//|		И ВЫБОР
		//|				КОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		//|					ТОГДА ИСТИНА
		//|				КОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия >= &Дата
		//|					ТОГДА ИСТИНА
		//|				ИНАЧЕ ЛОЖЬ
		//|			КОНЕЦ
		////|		И НЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор В
		////|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		////|						ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ОтменяемыйПриказ КАК ОтменяемыйПриказ
		////|					ИЗ
		////|						РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
		////|					ГДЕ
		////|						ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель = &Залогодатель
		////|						И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
		////|						И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ОтменяемыйПриказ <> ЗНАЧЕНИЕ(Документ.ЛБ_ПриказИндивидуальныеУсловия.ПустаяСсылка))
		//|		И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ВИП)
		//|	
		//|	УПОРЯДОЧИТЬ ПО
		//|		ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период УБЫВ) КАК Вставки
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	Период УБЫВ";
		
		"ВЫБРАТЬ
		|	Ставки.Регистратор КАК Регистратор,
		|	Ставки.Период КАК Период
		|ИЗ
		|	(ВЫБРАТЬ ПЕРВЫЕ 1
		|		ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК Регистратор,
		|		ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период КАК Период
		|	ИЗ
		|		РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		|	ГДЕ
		|		ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель = &Залогодатель
		|		И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
		|		И ВЫБОР
		|				КОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА ИСТИНА
		|				КОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия >= &Дата
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ
		|		И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ВИП)
		|		И 111 = 111
		|	
		|	УПОРЯДОЧИТЬ ПО
		|		ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период УБЫВ) КАК Ставки
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Металлы.Регистратор,
		|	Металлы.Период
		|ИЗ
		|	(ВЫБРАТЬ ПЕРВЫЕ 1
		|		ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор КАК Регистратор,
		|		ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период КАК Период
		|	ИЗ
		|		РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
		|	ГДЕ
		|		ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель = &Залогодатель
		|		И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
		|		И ВЫБОР
		|				КОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА ИСТИНА
		|				КОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия >= &Дата
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ
		|		И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ВИП)
		|		И 222 = 222
		|	
		|	УПОРЯДОЧИТЬ ПО
		|		ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период УБЫВ) КАК Металлы
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Вставки.Регистратор,
		|	Вставки.Период
		|ИЗ
		|	(ВЫБРАТЬ ПЕРВЫЕ 1
		|		ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор КАК Регистратор,
		|		ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период КАК Период
		|	ИЗ
		|		РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
		|	ГДЕ
		|		ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель = &Залогодатель
		|		И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
		|		И ВЫБОР
		|				КОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА ИСТИНА
		|				КОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия >= &Дата
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ
		|		И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ВИП)
		|		И 333 = 333
		|	
		|	УПОРЯДОЧИТЬ ПО
		|		ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период УБЫВ) КАК Вставки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";

	//-МАН
	
	Если СтруктураУсловий.Ставки Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "111 = 111", "НЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор = &Регистратор");
	КонецЕсли;
	
	Если СтруктураУсловий.Металлы Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "222 = 222", "НЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор = &Регистратор");
	КонецЕсли;

	Если СтруктураУсловий.Вставки Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "333 = 333", "НЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор = &Регистратор");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.УстановитьПараметр("Регистратор", ОтменяемыйДок);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	//+МАН 28.07.25 Изменил проверку результата
	//Если Результат.Следующий() Тогда
	//	Возврат Результат.Регистратор;
	//Иначе
	//	Возврат Неопределено;
	//КонецЕсли;

	Пока Результат.Следующий() Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("Залогодатель", Залогодатель);
		
		МассивЗ = Результат.Регистратор.Залогодатели.НайтиСтроки(Отбор);
		
		Если МассивЗ.Количество() > 0 Тогда
			Если НЕ МассивЗ[0].НетСтавок ИЛИ НЕ МассивЗ[0].НетМеталлов ИЛИ НЕ МассивЗ[0].НетВставок Тогда
				Возврат Результат.Регистратор;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	//-МАН
КонецФункции

Функция НайтиДействующийПриказ(Дата, Залогодатель, ОтменяемыеДок, СтруктураУсловий)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ Ставки
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		|ГДЕ
		|	ВЫБОР
		|			КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период, ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия, ДЕНЬ) = 0
		|				ТОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период <= &Дата
		|			ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ Металлы
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
		|ГДЕ
		|	ВЫБОР
		|			КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период, ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия, ДЕНЬ) = 0
		|				ТОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период <= &Дата
		|			ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ Вставки
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
		|ГДЕ
		|	ВЫБОР
		|			КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период, ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия, ДЕНЬ) = 0
		|				ТОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период <= &Дата
		|			ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Ставки.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ СтавкиСорт
		|ИЗ
		|	Ставки КАК Ставки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ставки.Регистратор.ДатаНачалаДействияПриказа УБЫВ,
		|	Ставки.Регистратор.Дата УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Металлы.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ МеталыСорт
		|ИЗ
		|	Металлы КАК Металлы
		|
		|УПОРЯДОЧИТЬ ПО
		|	Металлы.Регистратор.ДатаНачалаДействияПриказа УБЫВ,
		|	Металлы.Регистратор.Дата УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Вставки.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВставкиСорт
		|ИЗ
		|	Вставки КАК Вставки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Вставки.Регистратор.ДатаНачалаДействияПриказа УБЫВ,
		|	Вставки.Регистратор.Дата УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтавкиСорт.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ СтавкиПерв
		|ИЗ
		|	СтавкиСорт КАК СтавкиСорт
		|ГДЕ
		|	НЕ СтавкиСорт.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|	И НЕ СтавкиСорт.Регистратор В
		|				(ВЫБРАТЬ
		|					ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ОтменяемыйПриказ КАК ОтменяемыйПриказ
		|				ИЗ
		|					РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		|				ГДЕ
		|					ВЫБОР
		|						КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период, ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия, ДЕНЬ) = 0
		|							ТОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период <= &Дата
		|						ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
		|					КОНЕЦ
		|					И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|					И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель = &Залогодатель
		|				СГРУППИРОВАТЬ ПО
		|					ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ОтменяемыйПриказ)
		|	И ВЫБОР
		|			КОГДА СтавкиСорт.Регистратор.ДатаОкончанияДействияПриказа = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ИСТИНА
		|			КОГДА СтавкиСорт.Регистратор.ДатаОкончанияДействияПриказа >= &Дата
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МеталыСорт.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ МеталыПерв
		|ИЗ
		|	МеталыСорт КАК МеталыСорт
		|ГДЕ
		|	НЕ МеталыСорт.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|	И НЕ МеталыСорт.Регистратор В
		|				(ВЫБРАТЬ
		|					ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ОтменяемыйПриказ КАК ОтменяемыйПриказ
		|				ИЗ
		|					РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
		|				ГДЕ
		|					ВЫБОР
		|						КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период, ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия, ДЕНЬ) = 0
		|							ТОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период <= &Дата
		|						ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
		|					КОНЕЦ
		|					И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|					И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель = &Залогодатель
		|				СГРУППИРОВАТЬ ПО
		|					ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ОтменяемыйПриказ)
		|	И ВЫБОР
		|			КОГДА МеталыСорт.Регистратор.ДатаОкончанияДействияПриказа = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ИСТИНА
		|			КОГДА МеталыСорт.Регистратор.ДатаОкончанияДействияПриказа >= &Дата
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВставкиСорт.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВставкиПерв
		|ИЗ
		|	ВставкиСорт КАК ВставкиСорт
		|ГДЕ
		|	НЕ ВставкиСорт.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|	И НЕ ВставкиСорт.Регистратор В
		|				(ВЫБРАТЬ
		|					ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ОтменяемыйПриказ КАК ОтменяемыйПриказ
		|				ИЗ
		|					РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
		|				ГДЕ
		|					ВЫБОР
		|						КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период, ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия, ДЕНЬ) = 0
		|							ТОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период <= &Дата
		|						ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
		|					КОНЕЦ
		|					И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|					И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель = &Залогодатель
		|				СГРУППИРОВАТЬ ПО
		|					ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ОтменяемыйПриказ)
		|	И ВЫБОР
		|			КОГДА ВставкиСорт.Регистратор.ДатаОкончанияДействияПриказа = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ИСТИНА
		|			КОГДА ВставкиСорт.Регистратор.ДатаОкончанияДействияПриказа >= &Дата
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтавкиПерв.Регистратор КАК Приказ,
		|	СтавкиПерв.Регистратор.НомерПриказа КАК НомерПриказа,
		|	СтавкиПерв.Регистратор.НомерСистемныйЧисло КАК СистемныйНомер,
		|	СтавкиПерв.Регистратор.Дата КАК ДатаДокумента,
		|	СтавкиПерв.Регистратор.ДатаНачалаДействияПриказа КАК ДатаНачалаДействия,
		|	СтавкиПерв.Регистратор.ДатаОкончанияДействияПриказа КАК ДатаОкончанияДействия,
		|	ИСТИНА КАК Ставки,
		|	ЛОЖЬ КАК Металлы,
		|	ЛОЖЬ КАК Вставки
		|ПОМЕСТИТЬ Общая
		|ИЗ
		|	СтавкиПерв КАК СтавкиПерв
		|ГДЕ
		|	111 = 111
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	МеталыПерв.Регистратор,
		|	МеталыПерв.Регистратор.НомерПриказа,
		|	МеталыПерв.Регистратор.НомерСистемныйЧисло,
		|	МеталыПерв.Регистратор.Дата,
		|	МеталыПерв.Регистратор.ДатаНачалаДействияПриказа,
		|	МеталыПерв.Регистратор.ДатаОкончанияДействияПриказа,
		|	ЛОЖЬ,
		|	ИСТИНА,
		|	ЛОЖЬ
		|ИЗ
		|	МеталыПерв КАК МеталыПерв
		|ГДЕ
		|	222 = 222
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВставкиПерв.Регистратор,
		|	ВставкиПерв.Регистратор.НомерПриказа,
		|	ВставкиПерв.Регистратор.НомерСистемныйЧисло,
		|	ВставкиПерв.Регистратор.Дата,
		|	ВставкиПерв.Регистратор.ДатаНачалаДействияПриказа,
		|	ВставкиПерв.Регистратор.ДатаОкончанияДействияПриказа,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ИСТИНА
		|ИЗ
		|	ВставкиПерв КАК ВставкиПерв
		|ГДЕ
		|	333 = 333
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Общая.Приказ КАК Приказ,
		|	Общая.НомерПриказа КАК НомерПриказа,
		|	Общая.СистемныйНомер КАК СистемныйНомер,
		|	Общая.ДатаДокумента КАК ДатаДокумента,
		|	Общая.ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	Общая.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
		|	МАКСИМУМ(Общая.Ставки) КАК Ставки,
		|	МАКСИМУМ(Общая.Металлы) КАК Металлы,
		|	МАКСИМУМ(Общая.Вставки) КАК Вставки
		|ИЗ
		|	Общая КАК Общая
		|
		|СГРУППИРОВАТЬ ПО
		|	Общая.Приказ,
		|	Общая.НомерПриказа,
		|	Общая.ДатаДокумента,
		|	Общая.ДатаНачалаДействия,
		|	Общая.ДатаОкончанияДействия,
		|	Общая.СистемныйНомер";
	
	Если СтруктураУсловий.Ставки Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "111 = 111", "НЕ СтавкиПерв.Регистратор В (&Регистратор)");
	КонецЕсли;
	
	Если СтруктураУсловий.Металлы Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "222 = 222", "НЕ МеталыПерв.Регистратор В (&Регистратор)");
	КонецЕсли;

	Если СтруктураУсловий.Вставки Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "333 = 333", "НЕ ВставкиПерв.Регистратор В (&Регистратор)");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.УстановитьПараметр("Регистратор", ОтменяемыеДок);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Приказ;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    //+МАН 25.08.25 Вынес из процедуры
	//Перем ТаблицаСтавок; 
	//Перем ТаблицаЦенМеталлы, ТаблицаНастроекМеталлы;
	//Перем ТаблицаЦенВставки, ТаблицаНастроекВставки;
	//Перем ТаблицаЦенАкцияМеталлы;
	//Перем ТаблицаСтавокАкция;
	//-МАН
	
	Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ВИП Тогда
		ПодготовитьТаблицыДокументаПроцентныеСтавки(ТаблицаСтавок); 
		ПодготовитьТаблицыДокументаМеталлы(ТаблицаЦенМеталлы, ТаблицаНастроекМеталлы); 
		ПодготовитьТаблицыДокументаВставки(ТаблицаЦенВставки, ТаблицаНастроекВставки);
				
		ДвиженияПоРегистрам(РежимПроведения, ТаблицаЦенМеталлы, ТаблицаНастроекМеталлы, ТаблицаЦенВставки, ТаблицаНастроекВставки, ТаблицаСтавок, Отказ);
	ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП Тогда
		Для каждого Стр Из Ссылка.ОтменяемыеПриказы Цикл
			Если Стр.Ставки Тогда
				ПодготовитьТаблицыДокументаПроцентныеСтавки(ТаблицаСтавок, Стр.Приказ, Стр.Залогодатель);
			КонецЕсли;
			
			Если Стр.Металлы Тогда
				ПодготовитьТаблицыДокументаМеталлы(ТаблицаЦенМеталлы, ТаблицаНастроекМеталлы, Стр.Приказ, Стр.Залогодатель);
			КонецЕсли;
			
			Если Стр.Вставки Тогда
				ПодготовитьТаблицыДокументаВставки(ТаблицаЦенВставки, ТаблицаНастроекВставки, Стр.Приказ, Стр.Залогодатель);
			КонецЕсли;
		КонецЦикла;
		
		ДвиженияПоРегистрам(РежимПроведения, ТаблицаЦенМеталлы, ТаблицаНастроекМеталлы, ТаблицаЦенВставки, ТаблицаНастроекВставки, ТаблицаСтавок, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Ответственный = Пользователи.ТекущийПользователь();
	ЭтотОбъект.ВидПриказа = Перечисления.ЛБ_ВидыПриказа.Проект;
	ЭтотОбъект.ДатаНачалаДействияПриказа = Дата(1,1,1);
	ЭтотОбъект.ДатаОкончанияДействияПриказа = Дата(1,1,1);  
	
	//Проверим кредитные схемы и процентные ставки 
	Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.Базовый Тогда 
		Если НЕ ЭтотОбъект.СтавкиПроцентов.Количество() = 0 Тогда 
			ТаблицаСтавок = ЭтотОбъект.СтавкиПроцентов.Выгрузить();
			ЭтотОбъект.СтавкиПроцентов.Очистить();
			УдСтрокиСК = Новый СписокЗначений;
			Для каждого стр Из ЭтотОбъект.СхемыКредитования цикл
				СписокЛ = Новый СписокЗначений; 
				СписокЛ.Добавить(Справочники.ЛБ_Ломбарды.ПустаяСсылка());
				Для каждого СтрЛ Из ЭтотОбъект.Ломбарды цикл 
					СписокЛ.Добавить(СтрЛ.Ломбард);
				Конеццикла;	
				ШаблонПриказа = ЛБ_ОбщийМодуль.ПолучитьТекущийШаблон(Дата, Перечисления.ЛБ_ВидыПрейскурантов.ПроцентныеСтавки, СписокЛ, Стр.СхемаКредитования);
				Отбор = Новый Структура;
				Отбор.Вставить("СхемаКредитования", Стр.СхемаКредитования);
				Если ШаблонПриказа = неопределено Тогда 
					УдСтрокиСК.Добавить(Стр);				 
				    Сообщение = Новый СообщениеПользователю;
                    Сообщение.Текст = "Для кредитной схемы " + СокрЛП(Стр.СхемаКредитования) + " не установлен шаблон процентных ставок.";
                    Сообщение.Сообщить();				
				Иначе
					Если НЕ ШаблонПриказа = Стр.ШаблонПроцентныеСтавки Тогда
					    Сообщение = Новый СообщениеПользователю;
	                    Сообщение.Текст = "Для кредитной схемы " + СокрЛП(Стр.СхемаКредитования) + " установлен новый шаблон процентных ставок, данные таблицы будут перезаполнены";
	                    Сообщение.Сообщить();
						
						Стр.ШаблонПроцентныеСтавки = ШаблонПриказа;
						Для каждого СтрШ Из Стр.ШаблонПроцентныеСтавки.СтавкиПроцентов Цикл
			                НоваяСтрП = ЭтотОбъект.СтавкиПроцентов.Добавить();
							НоваяСтрП.СхемаКредитования = Стр.СхемаКредитования;
							НоваяСтрП.ПричинаПрименения = СтрШ.ПричинаПрименения;
							НоваяСтрП.СтатусЗалогодателя = СтрШ.СтатусЗалогодателя;
							НоваяСтрП.ДиапазонСумм = СтрШ.ДиапазонСумм;
							
							ОтборП = Новый Структура;
				            ОтборП.Вставить("СхемаКредитования", НоваяСтрП.СхемаКредитования);
							ОтборП.Вставить("ПричинаПрименения", НоваяСтрП.ПричинаПрименения);
							ОтборП.Вставить("СтатусЗалогодателя", НоваяСтрП.СтатусЗалогодателя);
							ОтборП.Вставить("ДиапазонСумм", НоваяСтрП.ДиапазонСумм); 
							
							СтрокиП = ТаблицаСтавок.НайтиСтроки(ОтборП); 
							Если НЕ СтрокиП.Количество() = 0 Тогда
								СтрП = строкиП.Получить(0);
								НоваяСтрП.ДеньНачалаПрименения = СтрП.ДеньНачалаПрименения;
							    НоваяСтрП.Ставка = СтрП.ставка;
							Иначе  
								НоваяСтрП.ДеньНачалаПрименения = 1;
							    НоваяСтрП.Ставка = 0;
							КонецЕсли;	
						Конеццикла;    
					Иначе 
						СтрокиП = ТаблицаСтавок.НайтиСтроки(Отбор);
						Для каждого СтрП из СтрокиП Цикл 
							НоваяСтрП = ЭтотОбъект.СтавкиПроцентов.Добавить();
							НоваяСтрП.СхемаКредитования = СтрП.СхемаКредитования;
							НоваяСтрП.ПричинаПрименения = СтрП.ПричинаПрименения;
							НоваяСтрП.СтатусЗалогодателя = СтрП.СтатусЗалогодателя;
							НоваяСтрП.ДиапазонСумм = СтрП.ДиапазонСумм;
                            НоваяСтрП.ДеньНачалаПрименения = СтрП.ДеньНачалаПрименения;
							НоваяСтрП.Ставка = СтрП.ставка;
						Конеццикла;	
					КонецЕсли;	
				КонецЕсли;	
			Конеццикла;	 
			Для каждого Эл Из УдСтрокиСК Цикл
				ЭтотОбъект.СхемыКредитования.Удалить(Эл.Значение);
			КонецЦикла;	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		//+МАН 10.02.25
		//Было: Если ЭтотОбъект.ДатаНачалаДействияПриказа < ЭтотОбъект.Дата Тогда
		Если НачалоДня(ЭтотОбъект.ДатаНачалаДействияПриказа) < НачалоДня(ЭтотОбъект.Дата) Тогда
		//-МАН
		    ОбщегоНазначения.СообщитьПользователю("Дата начала действия приказа не может быть меньше даты прказа!"); 
			Отказ = Истина;
		КонецЕсли;			
			          		
		//проверим минусовые значения в таблицах
		ВсеОК = Истина; 
		//Для каждого Стр Из ЭтотОбъект.ЦеныМеталлы Цикл  
		//	Если стр.Цена < 0 Тогда  
		//		ОбщегоНазначения.СообщитьПользователю("Ошибка заполнения цен металлов. Цена металла не может быть отрицательной!"); 
		//		ВсеОК = Ложь; 
		//		Прервать;
		//	КонецЕсли;	
		//Конеццикла;	
		//
		//Для каждого Стр Из ЭтотОбъект.ЦеныВставки Цикл  
		//	Если стр.Цена < 0 Тогда  
		//		ОбщегоНазначения.СообщитьПользователю("Ошибка заполнения цен вставок. Цена вставки не может быть отрицательной!"); 
		//		ВсеОК = Ложь; 
		//		Прервать;
		//	КонецЕсли;	
		//Конеццикла;	  
		
		Для каждого Стр Из ЭтотОбъект.СтавкиПроцентов Цикл  
			Если стр.Ставка < 0 Тогда  
				ОбщегоНазначения.СообщитьПользователю("Ошибка заполнения процентых ставок. Процентая ставка не может быть отрицательной!"); 
				ВсеОК = Ложь; 
				Прервать;
			КонецЕсли;	
		Конеццикла;	
		
		Если Не ВсеОК тогда
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры // ПередЗаписью()

#КонецОбласти


#КонецЕсли
