
&НаКлиенте
Процедура Отправить(Команда) 
	
	Если Не ЗначениеЗаполнено(Ломбард) Тогда
		Сообщить("Выберите ломбард");
		Возврат;
	КонецЕсли;  
	
	СсылкаНаДокумент = СоздатьНовыйРКО();
    //ОткрытьЗначение(СсылкаНаДокумент); 
	
	Оповестить("ИзмененРКОПоВедомости");
	Закрыть();

КонецПроцедуры 


&НаСервере
Функция СоздатьНовыйРКО()

    НовыйДокумент = Документы.ЛБ_РасходныйКассовыйОрдер.СоздатьДокумент();
    НовыйДокумент.Дата = ТекущаяДата(); 
	НовыйДокумент.Организация  = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ОсновнаяОрганизация"); 
	НовыйДокумент.Ломбард = Ломбард;   
	НовыйДокумент.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ВыплатаЗарплаты;
	НовыйДокумент.Сумма = Сумма;
	НовыйДокумент.ФизическоеЛицо = Получатель.ФизическоеЛицо;
	НовыйДокумент.Контрагент = Получатель.ФизическоеЛицо;
	НовыйДокумент.Выдано = СокрЛП(Получатель.ФизическоеЛицо);
	НовыйДокумент.Дул = ДулПолучателя;
	НовыйДокумент.ДТ = "60305";
	НовыйДокумент.Кт = "20202";
	НовыйДокумент.ВедомостьЗП = ВедомостьЗП;
	НовыйДокумент.НомерРКО = ЛБ_УправлениеЛомбардом.ПолучитьНовыйНомерРКО(НовыйДокумент.Дата, НовыйДокумент.Организация, НовыйДокумент.Ломбард); 
	НовыйДокумент.ПредставлениеНомераРКО = СокрЛП(НовыйДокумент.Ломбард.НомерЛомбарда) + "/" + СокрЛП(НовыйДокумент.НомерРКО);
	НовыйДокумент.Основание = СокрЛП(ВедомостьЗП.Основание);
	НовыйДокумент.КтоОтправилВЛомбард = ПараметрыСеанса.ТекущийСотрудник;
    НовыйДокумент.Записать();
    Возврат НовыйДокумент.Ссылка;
КонецФункции


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отделение 	= Параметры.Отделение;
	Получатель 	= Параметры.Получатель;
	ДулПолучателя = ВернутьСтрокуДУЛ(Получатель);
	Сумма       = Параметры.Сумма;  
	ВедомостьЗП = Параметры.ВедомостьЗП; 
	НомерВедомости = ВедомостьЗП.Номер; 
	ДатаВедомости = ВедомостьЗП.Дата;  
	Ответственный = ПараметрыСеанса.ТекущийСотрудник; 
КонецПроцедуры

Функция ВернутьСтрокуДУЛ(Сотр) 
	ФЛ = Сотр.ФизическоеЛицо;
	стр = "Паспорт РФ серия "+СокрЛП(ФЛ.СерияДокумента)+ " № "+СокрЛП(ФЛ.НомерДокумента)+" выдан "+СОкрЛП(ФЛ.КемВыданДокумент)+" "+Формат(ФЛ.ДатаВыдачиДокумента, "ДФ=dd.MM.yyyy");
	
	Возврат стр;	
КонецФункции


Функция СписокЛомбардовПоОтделению()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард
	               |ИЗ
	               |	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(, Отделение = &Отделение) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
	               |ГДЕ
	               |	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.Закрыт = ЛОЖЬ";
 
	Запрос.УстановитьПараметр("Отделение", Отделение); 


	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ломбард");
	
КонецФункции

&НаКлиенте
Процедура ЛомбардНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Элементы.Ломбард.РежимВыбораИзСписка = Истина;
	Элементы.Ломбард.СписокВыбора.Очистить();
	массивЛом = СписокЛомбардовПоОтделению();    
	Элементы.Ломбард.СписокВыбора.ЗагрузитьЗначения(массивЛом); 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.Заголовок = "Ведомость № "+СокрЛП(НомерВедомости) + " от "+Формат(ДатаВедомости, "ДФ=dd.MM.yyyy");
КонецПроцедуры



