&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ВидКамня") тогда 
		ВидКамня = Параметры.ВидКамня;
	КонецЕсли;
	Если Параметры.Свойство("ФормаОгранки") тогда 
		ФормаОгранки = Параметры.ФормаОгранки;
	КонецЕсли;	
    Если Параметры.Свойство("ВидОгранки") тогда 
		ВидОгранки = Параметры.ВидОгранки;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция Проверить()
	Запрос = новый Запрос; 
	Запрос.УстановитьПараметр("ВидКамня", ВидКамня);
	Запрос.УстановитьПараметр("ФормаОгранки", ФормаОгранки);
	Запрос.УстановитьПараметр("ВидОгранки", ВидОгранки);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней.ВидКамня КАК ВидКамня,
	               |	ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней.ФормаОгранки КАК ФормаОгранки,
	               |	ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней.ВидОгранки КАК ВидОгранки
	               |ИЗ
	               |	РегистрСведений.ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней КАК ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней
	               |ГДЕ
	               |	ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней.ВидКамня = &ВидКамня
	               |	И ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней.ФормаОгранки = &ФормаОгранки
	               |	И ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней.ВидОгранки = &ВидОгранки";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции	
	
&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	Если НЕ Проверить() тогда
		Сообщить("Запись с такими измерения уже существует в регистре настройки размеров драгоценных камней!");
		Возврат;
	КонецЕсли;
	
	СтруктураВ = Новый структура;
	СтруктураВ.Вставить("ВидКамня", ВидКамня);
	СтруктураВ.Вставить("ФормаОгранки", ФормаОгранки);
	СтруктураВ.Вставить("ВидОгранки", ВидОгранки);
	ЭтаФорма.Закрыть(СтруктураВ);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

