  
Процедура УдалитьИзделияИзНакладнойНаОтгузку(ЗалоговыйБилет)  
	Движения.ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Записывать = Истина;
	Движения.ЛБ_СтатусыОбъектовЗалогаВНакладной.Записывать = Истина; 
    Движения.ЛБ_СтатусыНакладнойНаОтгрузку.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата); 
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.Организация КАК Организация,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.Ломбард КАК Ломбард,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.КоличествоОстаток КАК Количество,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.ВесОстаток КАК Вес,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.СуммаОценкиОстаток КАК СуммаОценки
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Остатки(&Дата, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	Если ТаблицаЗапроса.Количество() = 0 Тогда		
	    Накладная = Документы.ЛБ_НакладнаяНаОтгрузку.ПустаяСсылка(); 
	Иначе  
		Накладная = ТаблицаЗапроса.Получить(0).НакладнаяНаОтгрузку; 
		Запрос.УстановитьПараметр("Накладная", Накладная);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
		               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
		               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус КАК Статус
		               |ИЗ
		               |	РегистрСведений.ЛБ_СтатусыОбъектовЗалогаВНакладной.СрезПоследних(&Дата, НакладнаяНаОтгрузку = &Накладная) КАК ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних";
		ТаблицаСтатусовВНакладной = Запрос.Выполнить().Выгрузить();	
	КонецЕсли;
	
	Для каждого СтрЗапроса Из ТаблицаЗапроса Цикл  		
		Движение = Движения.ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Добавить();
		Движение.Период = Дата;
		Движение.Организация = СтрЗапроса.Организация; 
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Ломбард = СтрЗапроса.Ломбард;
		Движение.НакладнаяНаОтгрузку = СтрЗапроса.НакладнаяНаОтгрузку;
		Движение.ЗалоговыйБилет = СтрЗапроса.ЗалоговыйБилет;
		Движение.ОбъектЗалога = СтрЗапроса.ОбъектЗалога;
		Движение.Количество = СтрЗапроса.Количество;  
		Движение.Вес = СтрЗапроса.Вес; 
		Движение.СуммаОценки = СтрЗапроса.СуммаОценки; 
		
		Движение = Движения.ЛБ_СтатусыОбъектовЗалогаВНакладной.Добавить();
		Движение.Период = Дата;
		Движение.ЗалоговыйБилет = СтрЗапроса.ЗалоговыйБилет; 
        Движение.НакладнаяНаОтгрузку = СтрЗапроса.НакладнаяНаОтгрузку;
		Движение.ОбъектЗалога = СтрЗапроса.ОбъектЗалога;
		Движение.Статус = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.ИсключенИзНакладной;   
		
		Отбор = Новый Структура;
		Отбор.Вставить("НакладнаяНаОтгрузку", СтрЗапроса.НакладнаяНаОтгрузку); 
		Отбор.Вставить("ЗалоговыйБилет", СтрЗапроса.ЗалоговыйБилет);
        Отбор.Вставить("ОбъектЗалога", СтрЗапроса.ОбъектЗалога);

        Строки = ТаблицаСтатусовВНакладной.НайтиСтроки(Отбор);
		Если НЕ Строки.Количество() = 0 Тогда 
			Стр = строки.Получить(0);
			Стр.Статус = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.ИсключенИзНакладной;
		КонецЕсли;	
	КонецЦикла;	 
	
	Если НЕ Накладная.Пустая() Тогда 
		ВсеИсключенные = Истина; 
		Для каждого СтрС Из ТаблицаСтатусовВНакладной Цикл  
			Если НЕ СтрС.Статус = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.ИсключенИзНакладной Тогда 
				ВсеИсключенные = Ложь;
				Продолжить;
			КонецЕсли;	   
		КонецЦикла;
		
		Если ВсеИсключенные Тогда
			ЗапросН = Новый Запрос; 
			ЗапросН.УстановитьПараметр("Дата", ЭтотОбъект.Дата); 
			ЗапросН.УстановитьПараметр("НакладнаяНаОтгрузку", Накладная);
			ЗапросН.Текст = "ВЫБРАТЬ
			                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
			                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.НомерНакладной КАК НомерНакладной,
			                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.ДатаНакладной КАК ДатаНакладной,
			                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.ОтказОтВыкупа КАК ОтказОтВыкупа,
			                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.ПовышеннаяОценка КАК ПовышеннаяОценка,
			                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.СтатусНакладной КАК СтатусНакладной,
			                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.Получатель КАК Получатель,
			                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.Инкассатор КАК Инкассатор,
			                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.Комментарий КАК Комментарий
			                |ИЗ
			                |	РегистрСведений.ЛБ_СтатусыНакладнойНаОтгрузку.СрезПоследних(&Дата, НакладнаяНаОтгрузку = &НакладнаяНаОтгрузку) КАК ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних";
		    ВыборкаН = ЗапросН.Выполнить().Выбрать();
			Если ВыборкаН.Следующий() Тогда
				Движение = Движения.ЛБ_СтатусыНакладнойНаОтгрузку.Добавить(); 
				Движение.Период = Дата;
				Движение.НакладнаяНаОтгрузку = ВыборкаН.НакладнаяНаОтгрузку; 
				Движение.НомерНакладной = ВыборкаН.НомерНакладной;
				Движение.ДатаНакладной = ВыборкаН.ДатаНакладной;
				Движение.ОтказОтВыкупа = ВыборкаН.ОтказОтВыкупа;
				Движение.ПовышеннаяОценка = ВыборкаН.ПовышеннаяОценка;
				Движение.СтатусНакладной = ВыборкаН.СтатусНакладной;
				Движение.Комментарий = ВыборкаН.Комментарий; 				
				//+МАН 03.04.26 Исправил. Заявка 3759
				//Движение.ОтветственныйСотрудник = ЭтотОбъект.ОтветственныйСотрудник; 
				Движение.ОтветственныйСотрудник = ЭтотОбъект.Ответственный; 
				//-МАН
				Движение.ОтветственныйПользователь = ЭтотОбъект.ОтветственныйПользователь;
				Движение.Пустой = Истина;
			КонецЕсли;		
		КонецЕсли;	

	КонецЕсли;	
КонецПроцедуры	

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПрисвоитьНовыйСтатус = Ложь;
	Если ЭтотОбъект.ПричинаИзменения = Справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.НоваяКарточка Тогда
		ПрисвоитьНовыйСтатус = Истина;
	ИначеЕсли ЭтотОбъект.ПричинаИзменения = Справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.ЗагрузкаИзДругойБазы Тогда
		ТекСтатусКлиента = ЛБ_УправлениеЛомбардом.ПолучитьТекущийСтатусКлиента(Дата, Залогодатель);
		Если НЕ ЗначениеЗаполнено(ТекСтатусКлиента) Тогда   
			ПрисвоитьНовыйСтатус = Истина;
		КонецЕсли;	
	КонецЕсли;
	
	Если ПрисвоитьНовыйСтатус тогда
		Движения.ЛБ_СтатусыЗалогодателей.Записывать = Истина; 
		Движение = Движения.ЛБ_СтатусыЗалогодателей.Добавить();
		Движение.Период = Дата;
		Движение.Залогодатель = Залогодатель;
	    Движение.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Сверхновый; 
	КонецЕсли;	

	
	// регистр ЛБ_КонтактнаяИнформацияЗалогодателей
	Если НЕ ПустаяСтрока(ЭтотОбъект.ИзмененияКИ) Тогда
		Движения.ЛБ_КонтактнаяИнформацияЗалогодателей.Записывать = Истина;
		
		//Блокировка = Новый БлокировкаДанных;
		//ЭлементБлокировки = Блокировка.Добавить();
		//ЭлементБлокировки.Область = "РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей";
		//ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		//ЭлементБлокировки.УстановитьЗначение("Залогодатель", Залогодатель);
		//Блокировка.Заблокировать();

		Движение = Движения.ЛБ_КонтактнаяИнформацияЗалогодателей.Добавить();
		Движение.Период = Дата;
		Движение.Залогодатель = Залогодатель;
		Движение.Фамилия = Фамилия;
		Движение.Имя = Имя;
		Движение.Отчество = Отчество;
		Движение.ДатаРождения = ДатаРождения;
		Движение.МестоРождения = МестоРождения;
		Движение.МестоРожденияСтрана = МестоРожденияСтрана;
		Движение.МестоРожденияОбласть = МестоРожденияОбласть;
		Движение.МестоРожденияРайон = МестоРожденияРайон;
		Движение.МестоРожденияНаселенныйПункт = МестоРожденияНаселенныйПункт;
		Движение.Гражданство = Гражданство;
		Движение.Пол = Пол;
		Движение.Телефон = Телефон;
		Движение.ТелефонСтруктура = ТелефонСтруктура;
		Движение.Email = Email;
		Движение.АдресПоПрописке = АдресПоПрописке;
		Движение.АдресПоПропискеСтруктура = АдресПоПропискеСтруктура;
		Движение.АдресПоПропискеВручную = АдресПоПропискеВручную;
		Движение.ФактическийАдрес = ФактическийАдрес;
		Движение.ФактическийАдресСтруктура = ФактическийАдресСтруктура;
		Движение.ФактическийАдресВручную = ФактическийАдресВручную;
		Движение.ПочтовыйАдрес = ПочтовыйАдрес;
		Движение.ПочтовыйАдресСтруктура = ПочтовыйАдресСтруктура;
		Движение.ПочтовыйАдресВручную = ПочтовыйАдресВручную;
		Движение.ТелефонДополнительный = ТелефонДополнительный;
		Движение.ТелефонДополнительныйСтруктура = ТелефонДополнительныйСтруктура;
		Движение.КонтактноеЛицо = КонтактноеЛицо;
		Движение.ТелефонКонтактногоЛица = ТелефонКонтактногоЛица;
		Движение.ТелефонКонтактногоЛицаСтруктура = ТелефонКонтактногоЛицаСтруктура;
		Движение.ИсточникИнформации = ИсточникИнформации;
		Движение.ИсточникИнформацииДругое = ИсточникИнформацииДругое;
		Движение.Ответственный = Ответственный;
		Движение.ОтветственныйЛомбард = ОтветственныйЛомбард;	//+++ МоисеевЕС 20250526
		Движение.ПричинаИзменения = ПричинаИзменения;
		Движение.Изменения = ЭтотОбъект.ИзмененияКИ;
		Движение.ДатаСмерти = ЭтотОбъект.ДатаСмерти;
		Движение.Комментарий = ЭтотОбъект.Комментарий;
		Движение.Фамилия_А = Фамилия_А;
		Движение.Имя_А = Имя_А;
		Движение.Отчество_А = Отчество_А;
		Движение.ПричинаИзмененияФИО = ПричинаИзмененияФИО;
		Движение.ОснованиеИзмененияФИО = ОснованиеИзмененияФИО; 
		Движение.СменилсяАдресПрописки = СменилсяАдресПрописки;
		Движение.СменилсяФактическийАдрес = СменилсяФактическийАдрес;
		Движение.СменилсяПочтовыйАдрес = СменилсяПочтовыйАдрес;  
		Движение.ПричинаИзмененияАдресаПоПрописке = ПричинаИзмененияАдресаПоПрописке;
		Движение.ПричинаИзмененияФактическогоАдреса = ПричинаИзмененияФактическогоАдреса;
		Движение.ПричинаИзмененияПочтовогоАдреса = ПричинаИзмененияПочтовогоАдреса;
		//+МАН 16.01.25
		//Движение.Резиденство = Резиденство;
		//-МАН
	КонецЕсли;	 
	
	// регистр ЛБ_АнкетаЗалогодателя
	Если НЕ ПустаяСтрока(ЭтотОбъект.ИзмененияАнкета) Тогда
		Движения.ЛБ_АнкетаЗалогодателя.Записывать = Истина;
		Движение = Движения.ЛБ_АнкетаЗалогодателя.Добавить();
		Движение.Период = Дата;
		Движение.Залогодатель = Залогодатель;
		Движение.ДатаОформленияАнкеты = ДатаОформленияАнкеты;
		Движение.ДеловаяРепутацияПоложительная = ДеловаяРепутацияПоложительная;
		Движение.ДолжностьДЛПМО_РДПЛ = ДолжностьДЛПМО_РДПЛ;
		Движение.ДолжностьИПДЛ = ДолжностьИПДЛ;
		Движение.ДопИнформацияДЛПМО_РДПЛ = ДопИнформацияДЛПМО_РДПЛ;
		Движение.ДопИнформацияИПДЛ = ДопИнформацияИПДЛ;
		Движение.ЗалогодательБенефициарныйВладелец = ЗалогодательБенефициарныйВладелец;
		Движение.ИНН = ИНН;  
		Движение.СНИЛС = СНИЛС;
		Движение.ИсточникПроисхожденияДенежныхСредств = ИсточникПроисхожденияДенежныхСредств;
		Движение.ИсточникПроисхожденияДенежныхСредствИной = ИсточникПроисхожденияДенежныхСредствИной;
		Движение.ИсточникПроисхожденияИмущества = ИсточникПроисхожденияИмущества;
		Движение.ИсточникПроисхожденияИмуществаИной = ИсточникПроисхожденияИмуществаИной;
		Движение.КатегорияДЛПМО_РДПЛ = КатегорияДЛПМО_РДПЛ;
		Движение.КатегорияКлиентаИПДЛ = КатегорияКлиентаИПДЛ;
		Движение.КатегорииФизЛица = КатегорииФизЛица;
		Движение.РаботодательДЛПМО_РДПЛ = РаботодательДЛПМО_РДПЛ;
		Движение.РаботодательИПДЛ = РаботодательИПДЛ;
		Движение.РазрешениеДЛПМО_РДПЛ = РазрешениеДЛПМО_РДПЛ;
		Движение.РазрешениеИПДЛ = РазрешениеИПДЛ; 
		Движение.ОтветственноеЛицоИПДЛ = ОтветственноеЛицоИПДЛ;
		Движение.ОтветственноеЛицоДЛПМО_РДПЛ = ОтветственноеЛицоДЛПМО_РДПЛ;
		Движение.ТипФизЛица = ТипФизЛица;
		Движение.УровеньРиска = УровеньРиска;
		Движение.ФинансовоеПоложениеСтабильное = ФинансовоеПоложениеСтабильное;
		Движение.ХарактерОтношений = ХарактерОтношений;
		Движение.ЯвляетсяДЛПМО_РДПЛ = ЯвляетсяДЛПМО_РДПЛ;
		Движение.ЯвляетсяИПДЛ = ЯвляетсяИПДЛ;           
		Движение.Ответственный = Ответственный; 
		
		Движение.ПричинаИзменения = ПричинаИзменения;
		Движение.Изменения = ЭтотОбъект.ИзмененияАнкета;  
		
		Если НЕ Бенефициары.Количество() = 0 Тогда 
			Движения.ЛБ_БенефициарныеВладельцы.Записывать = Истина;
			Для каждого стрБ из Бенефициары Цикл 
		        Движение = Движения.ЛБ_БенефициарныеВладельцы.Добавить();
				Движение.Период = Дата; 
				Движение.Залогодатель = Залогодатель;
				Движение.Бенефициар = СтрБ.Бенефициар;
				Движение.ВидПолученияИнформации = стрБ.ВидПолученияИнформации;
			Конеццикла;	
		КонецЕсли;	
	КонецЕсли;	 
	
	Движения.ЛБ_ОтказыКлиентамВОбслуживании.Записывать = Истина; 
	Для каждого Стр Из ЭтотОбъект.ОтказыКлиентам Цикл 
		Движение = Движения.ЛБ_ОтказыКлиентамВОбслуживании.Добавить();
		Движение.Период = Дата;
        Движение.Залогодатель = ЭтотОбъект.Залогодатель;
		Движение.ДатаОтказа = Стр.ДатаОтказа;
		Движение.ПричинаОтказа = Стр.ПричинаОтказа;
		Движение.СуммаЗаймаОтказ = Стр.СуммаЗаймаОтказ;
		Движение.Ответственный = ЭтотОбъект.Ответственный; 
		ИзмененияОтказ = Формат(Стр.ДатаОтказа,"ДФ=dd.MM.yyyy") + ?(ПустаяСтрока(Стр.ПричинаОтказа), "", " причина отказа " + сокрЛП(Стр.ПричинаОтказа)) +
		        ?(Стр.СуммаЗаймаОтказ = 0, "", " сумма займа " + сокрЛП(Формат(Стр.СуммаЗаймаОтказ,"ЧЦ=15; ЧДЦ=2")) + " руб.");
		Движение.Изменения = ИзмененияОтказ;
	КонецЦикла;	


	//регистр ЛБ_ДокументыЗалогодателей
	Движения.ЛБ_ДокументыЗалогодателей.Записывать = Истина;
	Для каждого Стр Из ЭтотОбъект.ДокументыЗалогодателя Цикл
	    Движение = Движения.ЛБ_ДокументыЗалогодателей.Добавить();
		Движение.Период = Дата;
		Движение.ВидДокумента = Стр.ВидДокумента;
		Движение.ВидДокументаЗалогодателя = Стр.ВидДокументаЗалогодателя;
		Движение.Гражданство = Стр.Гражданство;
		// ++ Сербаев 25.05.2023 TODO: Сербаев
		Движение.ДокументСтранаЭмитент = Стр.ДокументСтранаЭмитент;    
        // -- Сербаев 25.05.2023
		// ++ Сербаев 14.06.2023 (иной документ)
		Движение.ДокументНаименованиеИногоДокумента = Стр.ДокументНаименованиеИногоДокумента;
        // -- Сербаев 14.06.2023
		Движение.ДокументДатаВыдачи = Стр.ДокументДатаВыдачи;
		Движение.ДокументЗалогодателя = Стр.ДокументЗалогодателя;
		Движение.ДокументКемВыдан = Стр.ДокументКемВыдан;
		Движение.ДокументКодПодразделения = Стр.ДокументКодПодразделения;
		Движение.ДокументНачалоДействия = ?(Стр.ПричинаИзменения = Справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.НовыйДокумент, Дата, Стр.ДокументНачалоДействия);
		Движение.ДокументСерия = Стр.ДокументСерия;
		Движение.ДокументНомер = Стр.ДокументНомер;
		Движение.ДокументСрокДействия = Стр.ДокументСрокДействия;
		Движение.ДокументНеДействителен = стр.ДокументНеДействителен; 
		Движение.ДокументДействителен = стр.ДокументДействителен;
		Движение.Ответственный = Ответственный;
	    Движение.ПричинаИзменения = Стр.ПричинаИзменения;
		Движение.Изменения = Стр.ИзмененияДок;
		Движение.ДатаСмерти = Стр.ДатаСмерти;
		Движение.ОсновнойДУЛ = Стр.ОсновнойДУЛ;  
		Движение.ОсновнойДоп = Стр.ОсновнойДоп;
		
		Если Стр.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.СвидетельствоОСмерти И ЛБ_ОбщийМодуль.ПроверитьЕстьДатаСмерти(ЭтотОбъект.Залогодатель, ЭтотОбъект.Дата) = неопределено Тогда 			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата); 
			Запрос.УстановитьПараметр("Клиент", ЭтотОбъект.Залогодатель); 			
			Запрос.Текст = "ВЫБРАТЬ
			               |	ЛБ_ДоверенностиСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
			               |	ЛБ_ДоверенностиСрезПоследних.Доверенность КАК Доверенность,
			               |	ЛБ_ДоверенностиСрезПоследних.Клиент КАК Клиент,
			               |	ЛБ_ДоверенностиСрезПоследних.ВидОперации КАК ВидОперации,
			               |	ЛБ_ДоверенностиСрезПоследних.Ломбард КАК Ломбард,
			               |	ЛБ_ДоверенностиСрезПоследних.Ответственный КАК Ответственный,
			               |	ЛБ_ДоверенностиСрезПоследних.СтатусДоверенности КАК СтатусДоверенности
			               |ИЗ
			               |	РегистрСведений.ЛБ_Доверенности.СрезПоследних(
			               |			&Дата,
			               |			Клиент = &Клиент
			               |				ИЛИ Доверенность.ПредставительКлиента = &Клиент) КАК ЛБ_ДоверенностиСрезПоследних
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	ЛБ_ДоверенностиСрезПоследних.Период";  
			Выборка = Запрос.Выполнить().Выбрать(); 
			Пока Выборка.Следующий() Цикл   
				Если НЕ Выборка.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.ДоверенностьОформлена Тогда
					Продолжить;  
				ИначеЕсли Выборка.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Наследство Тогда
					Продолжить;
				ИначеЕсли НЕ (Выборка.Доверенность.СрокДействияДоверенности = Дата(1,1,1)) И (Выборка.Доверенность.СрокДействияДоверенности < ЭтотОбъект.Дата) Тогда
					Продолжить;
				КонецЕсли;
				Движения.ЛБ_Доверенности.Записывать = Истина;
				Движение = Движения.ЛБ_Доверенности.Добавить();
	            Движение.Период = Дата; 
				Движение.Доверенность = Выборка.Доверенность;
				Движение.ЗалоговыйБилет = Выборка.ЗалоговыйБилет;  
				Движение.ВидОперации = Выборка.ВидОперации; 
				Движение.Ломбард = Выборка.Ломбард;
                Движение.Ответственный = Выборка.Ответственный;
				Движение.Клиент = ЭтотОбъект.Залогодатель;
				Если Выборка.Клиент = ЭтотОбъект.Залогодатель Тогда				
					Движение.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.СмертьДоверителя; 
				Иначе
					Движение.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.СмертьДоверенногоЛица; 
				КонецЕсли;	
			КонецЦикла; 
			
			ЗапросОЗ = Новый Запрос; 
			ЗапросОЗ.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
			ЗапросОЗ.Текст = "ВЫБРАТЬ
			                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
			                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
			                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценки,
			                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
			                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаОплаты КАК СуммаОплаты,
			                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаДолгаЗайма КАК СуммаДолгаЗайма,
			                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаОценкиНачальная КАК СуммаОценкиНач
			                 |ИЗ
			                 |	РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(&Дата, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних";
			
			Запрос.Текст = "ВЫБРАТЬ
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.НомерЗалоговогоБилета КАК НомерЗалоговогоБилета,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СхемаКредитования КАК СхемаКредитования,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПричинаПрименения КАК ПричинаПрименения,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаНачалаРасчетаПроцентов КАК ДатаНачалаРасчетаПроцентов,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.НомерДопСоглашения КАК НомерДопСоглашения,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаВыкупа КАК ДатаВыкупа,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаВыкупаЛьготныйСрок КАК ДатаВыкупаЛьготныйСрок,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаПроцентовДень КАК СуммаПроцентовДень,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаПроцентовСрок КАК СуммаПроцентовСрок,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПредельныйСрокЗайма КАК ПредельныйСрокЗайма,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПредельныйСрокЗаймаДни КАК ПредельныйСрокЗаймаДни
			               |ИЗ
			               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&Дата, Залогодатель = &Клиент) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.Период";
			Выборка = Запрос.Выполнить().Выбрать(); 
			Пока Выборка.Следующий() Цикл   
				Если Выборка.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт ИЛИ 
					 Выборка.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Отгружен ИЛИ
					 Выборка.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтказОтОформления ИЛИ
					 Выборка.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Реализован ИЛИ
					 Выборка.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят Тогда 
					Продолжить;
				КонецЕсли;	    
			    Движения.ЛБ_СостояниеЗалоговогоБилета.Записывать = Истина;  
				Движение = Движения.ЛБ_СостояниеЗалоговогоБилета.Добавить();
	            Движение.Период = Дата;
				Движение.Залогодатель = Залогодатель;
				Движение.ЗалоговыйБилет = Выборка.ЗалоговыйБилет;
				Движение.НомерЗалоговогоБилета = Выборка.НомерЗалоговогоБилета;
				Движение.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Наследство;
				Движение.СхемаКредитования = Выборка.СхемаКредитования;
				Движение.ПричинаПрименения = Выборка.ПричинаПрименения;
				Движение.ДатаВыкупа = Выборка.ДатаВыкупа;
				Движение.ДатаВыкупаЛьготныйСрок = Выборка.ДатаВыкупаЛьготныйСрок;	
				Движение.ДатаНачалаРасчетаПроцентов = Выборка.ДатаНачалаРасчетаПроцентов;
				Движение.СуммаЗайма = Выборка.СуммаЗайма;
				Движение.СуммаПроцентовДень = Выборка.СуммаПроцентовДень;
		        Движение.СуммаПроцентовСрок = Выборка.СуммаПроцентовСрок;
				Движение.ПредельныйСрокЗайма = Выборка.ПредельныйСрокЗайма;
				Движение.ПредельныйСрокЗаймаДни = Выборка.ПредельныйСрокЗаймаДни; 
				Движение.НомерДопСоглашения = Выборка.НомерДопСоглашения;  	
				
				ЗапросОЗ.УстановитьПараметр("ЗалоговыйБилет", Выборка.ЗалоговыйБилет);
				ВыборкаОЗ = ЗапросОЗ.Выполнить().Выбрать();
				Пока ВыборкаОЗ.Следующий() Цикл 
					Если НЕ ВыборкаОЗ.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.Принят И
						 НЕ ВыборкаОЗ.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.Продлен И   
						 НЕ ВыборкаОЗ.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ВключенВНакладную И
						 НЕ ВыборкаОЗ.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ОбъявленТорг И
						 НЕ ВыборкаОЗ.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение Тогда
						Продолжить;
					КонецЕсли;	
					Движения.ЛБ_СостояниеОбъектаЗалога.Записывать = Истина; 
					ДвижениеО = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить();
	                ДвижениеО.Период = Дата;
                    ДвижениеО.ЗалоговыйБилет = Выборка.ЗалоговыйБилет;
					ДвижениеО.ОбъектЗалога = ВыборкаОЗ.ОбъектЗалога;
					ДвижениеО.СуммаОценки = ВыборкаОЗ.СуммаОценки; 
					ДвижениеО.СуммаОценкиНачальная = ВыборкаОЗ.СуммаОценкиНач; 
					ДвижениеО.СуммаЗайма = ВыборкаОЗ.СуммаЗайма;
					ДвижениеО.СуммаОплаты = ВыборкаОЗ.СуммаОплаты;
					ДвижениеО.СуммаДолгаЗайма = ВыборкаОЗ.СуммаДолгаЗайма;
					ДвижениеО.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.Наследство;  					
				Конеццикла;	
				
				Если Выборка.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ВключенВНакладную ИЛИ
					 Выборка.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОбъявленТорг Тогда
					УдалитьИзделияИзНакладнойНаОтгузку(Выборка.ЗалоговыйБилет); 
				КонецЕсли;	 

            КонецЦикла;
		КонецЕсли;	
	Конеццикла;	   

	Если НЕ ЭтотОбъект.ДополнительныеСтатусы.Количество() = 0 Тогда  
		Запрос = Новый Запрос; 
		Запрос.УстановитьПараметр("Залогодатель", Залогодатель);  
		Запрос.УстановитьПараметр("Дата", Дата); 
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус,
		               |	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Используется КАК Используется
		               |ИЗ
		               |	РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних";
		ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
		Движения.ЛБ_СтатусыЗалогодателейДополнительные.Записывать = Истина;				
		Для каждого Стр Из ЭтотОбъект.ДополнительныеСтатусы Цикл 
			Отбор = Новый Структура;
			Отбор.Вставить("Статус", Стр.Статус);  
			СтрокиС = ТаблицаЗапроса.НайтиСтроки(Отбор);
			Если НЕ СтрокиС.Количество() = 0 Тогда  
				СтрС = СтрокиС.Получить(0);
				Если Стр.Используется = СтрС.Используется Тогда
					Продолжить;
				КонецЕсли;	
			КонецЕсли;
			Движение = Движения.ЛБ_СтатусыЗалогодателейДополнительные.Добавить();
			Движение.Период = Дата; 
			Движение.Залогодатель = ЭтотОбъект.Залогодатель;
			Движение.Статус = Стр.Статус;
			Движение.Используется = Стр.Используется;
			Движение.СрокДействия = Стр.СрокДействия; 
			Движение.Комментарий = Стр.Комментарий;
		Конеццикла;
				
	КонецЕсли;  
	
	Если НЕ ЭтотОбъект.СлужебныеСтатусы.Количество() = 0 Тогда 
		Запрос = Новый Запрос; 
		Запрос.УстановитьПараметр("Залогодатель", Залогодатель);  
		Запрос.УстановитьПараметр("Дата", Дата); 
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_СтатусыЗалогодателейСлужебныеСрезПоследних.Статус КАК Статус,
		               |	ЛБ_СтатусыЗалогодателейСлужебныеСрезПоследних.Используется КАК Используется
		               |ИЗ
		               |	РегистрСведений.ЛБ_СтатусыЗалогодателейСлужебные.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_СтатусыЗалогодателейСлужебныеСрезПоследних";
		ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
		Движения.ЛБ_СтатусыЗалогодателейСлужебные.Записывать = Истина;
		Для каждого Стр Из ЭтотОбъект.СлужебныеСтатусы Цикл  
			Отбор = Новый Структура;
			Отбор.Вставить("Статус", Стр.Статус);  
			СтрокиС = ТаблицаЗапроса.НайтиСтроки(Отбор);
			Если НЕ СтрокиС.Количество() = 0 Тогда  
				СтрС = СтрокиС.Получить(0);
				Если Стр.Используется = СтрС.Используется Тогда
					Продолжить;
				КонецЕсли;	
			КонецЕсли;
			Движение = Движения.ЛБ_СтатусыЗалогодателейСлужебные.Добавить();
			Движение.Период = Дата; 
			Движение.Залогодатель = ЭтотОбъект.Залогодатель;
			Движение.Статус = Стр.Статус;
			Движение.Используется = Стр.Используется; 
			Движение.Комментарий = Стр.Комментарий;
		Конеццикла;	
	КонецЕсли;
	
	Если НЕ ЭтотОбъект.СогласиеНаСМСРассылку = ЛБ_УправлениеЛомбардом.ПолучитьСогласиеНаСМСРассылки(ЭтотОбъект.Дата, ЭтотОбъект.Залогодатель) Тогда  
		Движения.ЛБ_СогласиеНаСМСРассылку.Записывать = Истина;
		Движение = Движения.ЛБ_СогласиеНаСМСРассылку.Добавить();
		Движение.Период = Дата; 
		Движение.Залогодатель = ЭтотОбъект.Залогодатель;
	    Движение.Согласен = ЭтотОбъект.СогласиеНаСМСРассылку;  
	КонецЕсли;	
	
	//+Мельников 02.07.24 Статус клиента "Банкрот"
	
	Отбор = Новый Структура;
	Отбор.Вставить("Статус", ПолучитьСсылкуНаСтатус()); //Справочники.ЛБ_СлужебныеСтатусыКлиентов.НайтиПоКоду("000000003"));
	Отбор.Вставить("Используется", Истина);
	
	мБанкрот = ЭтотОбъект.СлужебныеСтатусы.НайтиСтроки(Отбор);
	
	Если мБанкрот.Количество() > 0 Тогда 			
	
		ЗапросОЗ = Новый Запрос; 
		ЗапросОЗ.Текст = "ВЫБРАТЬ
						|	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
						|	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
						|	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
						|	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценки,
						|	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
						|	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаОплаты КАК СуммаОплаты,
						|	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаДолгаЗайма КАК СуммаДолгаЗайма,
						|	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаОценкиНачальная КАК СуммаОценкиНач
						|ИЗ
						|	РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(&Дата, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних";
		ЗапросОЗ.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
		
		Запрос.Текст = "ВЫБРАТЬ
						|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
						|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.НомерЗалоговогоБилета КАК НомерЗалоговогоБилета,
						|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СхемаКредитования КАК СхемаКредитования,
						|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПричинаПрименения КАК ПричинаПрименения,
						|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета,
						|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
						|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаНачалаРасчетаПроцентов КАК ДатаНачалаРасчетаПроцентов,
						|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.НомерДопСоглашения КАК НомерДопСоглашения,
						|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаВыкупа КАК ДатаВыкупа,
						|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаВыкупаЛьготныйСрок КАК ДатаВыкупаЛьготныйСрок,
						|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаПроцентовДень КАК СуммаПроцентовДень,
						|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаПроцентовСрок КАК СуммаПроцентовСрок,
						|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПредельныйСрокЗайма КАК ПредельныйСрокЗайма,
						|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПредельныйСрокЗаймаДни КАК ПредельныйСрокЗаймаДни
						|ИЗ
						|	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&Дата, Залогодатель = &Клиент) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних
						|
						|УПОРЯДОЧИТЬ ПО
						|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.Период";

		Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
		Запрос.УстановитьПараметр("Клиент", ЭтотОбъект.Залогодатель); 			

		Выборка = Запрос.Выполнить().Выбрать(); 
		Пока Выборка.Следующий() Цикл   
			Если Выборка.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт ИЛИ
				Выборка.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Отгружен ИЛИ
				Выборка.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтказОтОформления ИЛИ
				Выборка.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Реализован Тогда 
				Продолжить;
			КонецЕсли;	    
			
			ЗапросОЗ.УстановитьПараметр("ЗалоговыйБилет", Выборка.ЗалоговыйБилет);
			ВыборкаОЗ = ЗапросОЗ.Выполнить().Выбрать();
			Пока ВыборкаОЗ.Следующий() Цикл 
				Если НЕ ВыборкаОЗ.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.Принят И
					НЕ ВыборкаОЗ.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.Продлен И   
					НЕ ВыборкаОЗ.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ВключенВНакладную И
					НЕ ВыборкаОЗ.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ОбъявленТорг И
					НЕ ВыборкаОЗ.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение Тогда
					Продолжить;
				КонецЕсли;	
				Движения.ЛБ_СостояниеОбъектаЗалога.Записывать = Истина; 
				ДвижениеО = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить();
				ДвижениеО.Период = Дата;
				ДвижениеО.ЗалоговыйБилет = Выборка.ЗалоговыйБилет;
				ДвижениеО.ОбъектЗалога = ВыборкаОЗ.ОбъектЗалога;
				ДвижениеО.СуммаОценки = ВыборкаОЗ.СуммаОценки; 
				ДвижениеО.СуммаОценкиНачальная = ВыборкаОЗ.СуммаОценкиНач; 
				ДвижениеО.СуммаЗайма = ВыборкаОЗ.СуммаЗайма;
				ДвижениеО.СуммаОплаты = ВыборкаОЗ.СуммаОплаты;
				ДвижениеО.СуммаДолгаЗайма = ВыборкаОЗ.СуммаДолгаЗайма;
				ДвижениеО.СтатусОбъектаЗалога = ПолучитьСтатусОЗ(Дата, ВыборкаОЗ.ОбъектЗалога, Выборка.ЗалоговыйБилет);  
				
				Если ВыборкаОЗ.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ВключенВНакладную ИЛИ
					ВыборкаОЗ.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ОбъявленТорг Тогда
					УдалитьИзделияИзНакладнойНаОтгузку(Выборка.ЗалоговыйБилет); 
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	//-Мельников		

	Движения.ЛБ_ДатыОбновленияАнкеты.Записывать = Истина;  
	Движение = Движения.ЛБ_ДатыОбновленияАнкеты.Добавить();
	Движение.Период = Дата;          
	Движение.Залогодатель = Залогодатель;
    Движение.ДатаАктуальности = Дата;
		
КонецПроцедуры

//+Мельников 02.07.24
Функция ПолучитьСсылкуНаСтатус()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СлужебныеСтатусыКлиентов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЛБ_СлужебныеСтатусыКлиентов КАК ЛБ_СлужебныеСтатусыКлиентов
		|ГДЕ
		|	ЛБ_СлужебныеСтатусыКлиентов.Несостоятельный";
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;
	Иначе
		Возврат Справочники.ЛБ_СлужебныеСтатусыКлиентов.ПустаяСсылка();
	КонецЕсли;;
	
КонецФункции

Функция ПолучитьСтатусОЗ(Дата, ОЗ, ЗБ)
	
	СтатусОбъектаЗалога = Новый СписокЗначений;
	СтатусОбъектаЗалога.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ВключенВНакладную);
	СтатусОбъектаЗалога.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ОбъявленТорг);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛБ_СостояниеОбъектаЗалога.СтатусОбъектаЗалога КАК СтатусОЗ
		|ИЗ
		|	РегистрСведений.ЛБ_СостояниеОбъектаЗалога КАК ЛБ_СостояниеОбъектаЗалога
		|ГДЕ
		|	ЛБ_СостояниеОбъектаЗалога.ОбъектЗалога = &ОбъектЗалога
		|	И ЛБ_СостояниеОбъектаЗалога.ЗалоговыйБилет = &ЗалоговыйБилет
		|	И НЕ ЛБ_СостояниеОбъектаЗалога.СтатусОбъектаЗалога В (&СтатусОбъектаЗалога)
		|	И ЛБ_СостояниеОбъектаЗалога.Период <= &Дата
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_СостояниеОбъектаЗалога.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗБ);
	Запрос.УстановитьПараметр("ОбъектЗалога", ОЗ);
	Запрос.УстановитьПараметр("СтатусОбъектаЗалога", СтатусОбъектаЗалога);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СтатусОЗ;
	Иначе
		Возврат Неопределено;
	КонецЕсли;;

КонецФункции
//-Мельников