
// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АктНаличныхДС";
	КомандаПечати.Представление = НСтр("ru = 'Акт инвентаризации наличных ДС'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	
КонецПроцедуры

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	ВалютаРегламентированногоУчета = Справочники.Валюты.НайтиПоКоду("643");
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктНаличныхДС") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктНаличныхДС",  "Акт инвентаризации наличных ДС", 
		ПечатьАктаНаличныхДС(МассивОбъектов, ОбъектыПечати, ВалютаРегламентированногоУчета), , "Документ.ИнвентаризацияТоваровНаСкладе.АктНаличныхДС");
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПустойАкт") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПустойАкт",  "Пустой акт инвентаризации наличных ДС", 
		ПечатьПустойАкт(МассивОбъектов, ОбъектыПечати, ВалютаРегламентированногоУчета), , "Документ.ЛБ_ИнвентаризацияДС.ПустойАкт");
	КонецЕсли;

КонецПроцедуры  

Функция ПечатьАктаНаличныхДС(МассивОбъектов, ОбъектыПечати, ВалютаРегламентированногоУчета)

	УстановитьПривилегированныйРежим(Истина);
	
	ВалютаПечати = ВалютаРегламентированногоУчета; 
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб			= Истина;
	ТабДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	//ТабДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияТоваровНаСкладе_ПФ_MXL_ИНВ15";
    ТабДокумент.ТолькоПросмотр = Истина;
	
	ПервыйДокумент = Истина;

	Для каждого Док из МассивОбъектов Цикл
		
		Выборка = ПолучитьДанныеДокумента(Док);
		
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЛБ_ИнвентаризацияДС.ПФ_MXL_ИНВ15");
		
		Пока Выборка.Следующий() Цикл
			
			//Найдем все данные для последующего заполнения
			Если Не ПервыйДокумент Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ПервыйДокумент = Ложь;
			// Запомним номер строки, с которой начали выводить текущий документ.
			НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
			
			ЧленКомиссии = Выборка.ИнвентаризационнаяКомиссия.Выбрать();  
			
			Молы = Выборка.Молы.Выбрать();  
			МолыПодвал = Выборка.Молы.Выбрать();  
			
			МолыСтр2 = Выборка.Молы.Выбрать();  
			КассирДолжность = "";
			ФИОКассира      = "";
			
			Пока МолыСтр2.Следующий() Цикл
				КассирДолжность = МолыСтр2.Физлицо.Должность;
				ФИОКассира      = МолыСтр2.ФИзлицо.ФизическоеЛицо.Наименование;
				Прервать;
			КонецЦикла;
			
			СуммаФакт = Выборка.СуммаФактическая;
			СуммаФактРуб = Цел(СуммаФакт);
			КопФакт = (СуммаФакт - СуммаФактРуб)*100;
			СуммаФактКоп = ?(КопФакт = 0, "00", КопФакт);
			
			СуммаУчет = Выборка.СуммаУчетная;
			СуммаУчетРуб = Цел(СуммаУчет);
			КопУчет = (СуммаУчет - СуммаУчетРуб)*100;
			СуммаУчетКоп = ?(КопУчет = 0, "00", КопУчет);
			
			СуммаОткл = Выборка.Отклонение;
			СуммаОтклРуб = ?(СуммаОткл > 0, Цел(СуммаОткл), Цел(-СуммаОткл));
			КопОткл = ?(СуммаОткл > 0, (СуммаОткл - СуммаОтклРуб)*100, (-СуммаОткл - СуммаОтклРуб)*100);
			СуммаОтклКоп = ?(КопОткл = 0, "00", КопОткл);
			
			СруктураПКОРКО = ПолучитьПКОРКО(НачалоДня(Выборка.Дата), Выборка.Организация, Выборка.Ломбард);
			//Закончили поиски
			
			//Приступаем к заполнению			
			ОбластьМакетаШапка = Макет.ПолучитьОбласть("Шапка");
			ОбластьМакетаШапка.Параметры.Заполнить(Выборка);      
			ОбластьМакетаШапка.Параметры.ДатаСоставления = Формат(Выборка.ДатаПриказа, "ДФ=dd.MM.yyyy");
			ОбластьМакетаШапка.Параметры.ДатаДокумента = Формат(Выборка.Дата, "ДЛФ=DD");
			ОбластьМакетаШапка.Параметры.Организация = Выборка.Организация;
			ОбластьМакетаШапка.Параметры.Подразделение = Выборка.Ломбард;  
			ОбластьМакетаШапка.Параметры.НомерДокумента = Выборка.Номер;
			ОбластьМакетаШапка.Параметры.ДокументОснованиеДата = Формат(Выборка.ДатаПриказа, "ДФ=dd.MM.yyyy");
			ОбластьМакетаШапка.Параметры.ДокументОснованиеНомер = Выборка.НомерПриказа;
			ТабДокумент.Вывести(ОбластьМакетаШапка);
			
			ОбластьМакетаШапкаМОЛ = Макет.ПолучитьОбласть("ШапкаМОЛ");
			
			Нпп = 1;
			Пока Молы.Следующий() Цикл
				//Если Нпп = 1 Тогда
					ОбластьМакетаШапкаМОЛ.Параметры.МОЛ = "Материально ответственное лицо";
				//Иначе
				//	ОбластьМакетаШапкаМОЛ.Параметры.МОЛ = "";
				//КонецЕсли;
				ОбластьМакетаШапкаМОЛ.Параметры.КассирДолжность = Молы.Физлицо.Должность;
				//ОбластьМакетаШапкаМОЛ.Параметры.ФИОКассира = Молы.ФИзлицо;
				ОбластьМакетаШапкаМОЛ.Параметры.ФИОКассира = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Молы.ФизЛицо.ФизическоеЛицо.Наименование);
				ТабДокумент.Вывести(ОбластьМакетаШапкаМОЛ); 
				Нпп = Нпп + 1;
			КонецЦикла;    

			ОбластьМакетаШапка2 = Макет.ПолучитьОбласть("Шапка2");
			ТабДокумент.Вывести(ОбластьМакетаШапка2);
			
			ОбластьМакетаСтр = Макет.ПолучитьОбласть("СтрокаНаличныхДенег"); 
			//ОбластьМакетаСтр.Параметры.НомерПоПорядку = 1; 
			//ОбластьМакетаСтр.Параметры.НаименованиеЦенности = "наличных денег";
			ОбластьМакетаСтр.Параметры.СуммаПоФактуРубли = СуммаФактРуб;
			ОбластьМакетаСтр.Параметры.СуммаПоФактуКопейки = СуммаФактКоп;
			ТабДокумент.Вывести(ОбластьМакетаСтр);
			
			
			ОбластьМакетаИтоги = Макет.ПолучитьОбласть("Итоги");
			ОбластьМакетаИтоги.Параметры.Заполнить(ОбластьМакетаСтр.Параметры); 
			ОбластьМакетаИтоги.Параметры.СуммаПоУчетуРубли = СуммаУчетРуб;
			ОбластьМакетаИтоги.Параметры.СуммаПоУчетуКопейки = СуммаУчетКоп;
			ОбластьМакетаИтоги.Параметры.СуммаПоУчетуРеглПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(СуммаУчет, ВалютаПечати);
			ОбластьМакетаИтоги.Параметры.СуммаПоФактуРеглПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(СуммаФакт, ВалютаПечати);
			
			Если СуммаОткл > 0 Тогда
				ОбластьМакетаИтоги.Параметры.СуммаИзлишек = "" + СуммаОтклРуб + " руб. " + СуммаОтклКоп + " коп."
			ИначеЕсли СуммаОткл < 0 Тогда
				ОбластьМакетаИтоги.Параметры.СуммаНедостача = "" + СуммаОтклРуб + " руб. " + СуммаОтклКоп + " коп."
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьМакетаИтоги); 
			
			ОбластьМакетаНомера = Макет.ПолучитьОбласть("ПоследниеНомера");
			ОбластьМакетаНомера.Параметры.НомерПКО = СруктураПКОРКО.ПКО;
			ОбластьМакетаНомера.Параметры.НомерРКО = СруктураПКОРКО.РКО;
			ТабДокумент.Вывести(ОбластьМакетаНомера);

			ОбластьМакетаКомиссия = Макет.ПолучитьОбласть("ЧленыКомиссии");
			
			
			Инд = 1;
			Пока ЧленКомиссии.Следующий() Цикл
				Если ЧленКомиссии.Председатель Тогда
					ОбластьМакетаКомиссия.Параметры["ЗаголовокЧленаКомиссии"] = "Председатель комиссии";
					ОбластьМакетаКомиссия.Параметры["Должность"] = ЧленКомиссии.ФизЛицо.Должность;
					//ОбластьМакетаКомиссия.Параметры["НаименованиеЧленаКомиссии"] = ЧленКомиссии.ФизЛицо;
					ОбластьМакетаКомиссия.Параметры["НаименованиеЧленаКомиссии"] = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЧленКомиссии.ФизЛицо.ФизическоеЛицо.Наименование);
					ТабДокумент.Вывести(ОбластьМакетаКомиссия); 
				КонецЕсли;
				//Прервать;
			КонецЦикла;
			
			инд = 0;
			ЧленКомиссии = Выборка.ИнвентаризационнаяКомиссия.Выбрать();   
			Пока ЧленКомиссии.Следующий() Цикл 
				Если инд < 3 Тогда
					Если НЕ ЧленКомиссии.Председатель Тогда 				
						ОбластьМакетаКомиссия.Параметры["ЗаголовокЧленаКомиссии"] = "Член комиссии"; 
						ОбластьМакетаКомиссия.Параметры["Должность"] = ЧленКомиссии.ФизЛицо.Должность;
						//ОбластьМакетаКомиссия.Параметры["НаименованиеЧленаКомиссии"] = ЧленКомиссии.ФизЛицо; 
						ОбластьМакетаКомиссия.Параметры["НаименованиеЧленаКомиссии"] = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЧленКомиссии.ФизЛицо.ФизическоеЛицо.Наименование);
						ТабДокумент.Вывести(ОбластьМакетаКомиссия);  
						инд = инд + 1;   				
					КонецЕсли; 
				КонецЕсли;
			КонецЦикла;
			
			
			//ТабДокумент.Вывести(ОбластьМакетаКомиссия);
			
			ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
			//ОбластьМакетаПодвал.Параметры.Заполнить(ОбластьМакетаШапка.Параметры);
			ТабДокумент.Вывести(ОбластьМакетаПодвал);
			
			ОбластьМакетаПодвалМОЛ = Макет.ПолучитьОбласть("ПодвалМОЛ");
			
			Нпп = 1;
			Пока МолыПодвал.Следующий() Цикл
				//Если Нпп = 1 Тогда
					ОбластьМакетаПодвалМОЛ.Параметры.МОЛ = "Материально ответственное лицо";
				//Иначе
				//	ОбластьМакетаПодвалМОЛ.Параметры.МОЛ = "";
				//КонецЕсли;
				ОбластьМакетаПодвалМОЛ.Параметры.КассирДолжность = МолыПодвал.Физлицо.Должность;
				//ОбластьМакетаПодвалМОЛ.Параметры.ФИОКассира = МолыПодвал.ФИзлицо;
				ОбластьМакетаПодвалМОЛ.Параметры.ФИОКассира = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(МолыПодвал.ФИзлицо.ФизическоеЛицо.Наименование);
				ТабДокумент.Вывести(ОбластьМакетаПодвалМОЛ);
				Нпп = Нпп + 1;
			КонецЦикла;    
		
			ОбластьМакетаПодвал2 = Макет.ПолучитьОбласть("Подвал2");
			//ОбластьМакетаПодвал2.Параметры.Заполнить(ОбластьМакетаШапка.Параметры);
			ТабДокумент.Вывести(ОбластьМакетаПодвал2);

			ОбластьМакетаСтр2 = Макет.Получитьобласть("Страница2");
			//ОбластьМакетаСтр2.Параметры.Заполнить(ОбластьМакетаПодвал.Параметры);
			ОбластьМакетаСтр2.Параметры.КассирДолжность = КассирДолжность; 
			ОбластьМакетаСтр2.Параметры.ФИОКассира  	= ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ФИОКассира);
			ОбластьМакетаСтр2.Параметры.ФИОРуководителя = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Выборка.Организация.Директор.Наименование);
			ОбластьМакетаСтр2.Параметры.РуководительДолжность = Выборка.Организация.Директор.Должность.Наименование;
			ТабДокумент.Вывести(ОбластьМакетаСтр2);
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
			
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТабДокумент;

КонецФункции

Функция ПолучитьДанныеДокумента(МассивОбъектов)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
					"ВЫБРАТЬ
					|	ЛБ_ИнвентаризацияДС.Ссылка КАК Ссылка,
					|	ЛБ_ИнвентаризацияДС.Номер КАК Номер,
					|	ЛБ_ИнвентаризацияДС.Дата КАК Дата,
					|	ЛБ_ИнвентаризацияДС.НомерПриказа КАК НомерПриказа,
					|	ЛБ_ИнвентаризацияДС.ДатаПриказа КАК ДатаПриказа,
					|	ЛБ_ИнвентаризацияДС.Ответственный КАК Ответственный,
					|	ЛБ_ИнвентаризацияДС.Организация КАК Организация,
					|	ЛБ_ИнвентаризацияДС.Ломбард КАК Ломбард,
					|	ЛБ_ИнвентаризацияДС.ИнвентаризационнаяКомиссия.(
					|		Ссылка КАК Ссылка,
					|		НомерСтроки КАК НомерСтроки,
					|		ФизЛицо КАК ФизЛицо,
					|		Председатель КАК Председатель,
					|		Дистанционно КАК Дистанционно
					|	) КАК ИнвентаризационнаяКомиссия,
					|	ЛБ_ИнвентаризацияДС.МОЛы.(
					|		Ссылка КАК Ссылка,
					|		НомерСтроки КАК НомерСтроки,
					|		ФизЛицо КАК ФизЛицо
					|	) КАК МОЛы,
					|	ЛБ_ИнвентаризацияДС.СуммаУчетная КАК СуммаУчетная,
					|	ЛБ_ИнвентаризацияДС.СуммаФактическая КАК СуммаФактическая,
					|	ЛБ_ИнвентаризацияДС.Отклонение КАК Отклонение
					|ИЗ
					|	Документ.ЛБ_ИнвентаризацияДС КАК ЛБ_ИнвентаризацияДС
					|ГДЕ
					|	ЛБ_ИнвентаризацияДС.Ссылка В(&МассивОбъектов)";

	Возврат Запрос.Выполнить().Выбрать();

КонецФункции

Функция ПолучитьПКОРКО(Дата, Организация, Ломбард)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ПКО");
	СтруктураВозврата.Вставить("РКО");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛБ_ДвиженияДенежныхСредствОбороты.КассоваяОперация.Дата КАК КассоваяОперацияДата,
		|	ЛБ_ДвиженияДенежныхСредствОбороты.КассоваяОперация.ПредставлениеНомераПКО КАК НомерПКО
		|ИЗ
		|	РегистрНакопления.ЛБ_ДвиженияДенежныхСредств.Обороты(
		|			,
		|			&Дата,
		|			,
		|			Организация = &Организация
		|				И Ломбард = &Ломбард
		|				И КассоваяОперация ССЫЛКА Документ.ЛБ_ПриходныйКассовыйОрдер) КАК ЛБ_ДвиженияДенежныхСредствОбороты
		|
		|УПОРЯДОЧИТЬ ПО
		|	КассоваяОперацияДата УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		СтруктураВозврата.Вставить("ПКО", Результат.НомерПКО);
	КонецЕсли;

	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛБ_ДвиженияДенежныхСредствОбороты.КассоваяОперация.Дата КАК КассоваяОперацияДата,
		|	ЛБ_ДвиженияДенежныхСредствОбороты.КассоваяОперация.ПредставлениеНомераРКО КАК НомерРКО
		|ИЗ
		|	РегистрНакопления.ЛБ_ДвиженияДенежныхСредств.Обороты(
		|			,
		|			&Дата,
		|			,
		|			Организация = &Организация
		|				И Ломбард = &Ломбард
		|				И КассоваяОперация ССЫЛКА Документ.ЛБ_РасходныйКассовыйОрдер) КАК ЛБ_ДвиженияДенежныхСредствОбороты
		|
		|УПОРЯДОЧИТЬ ПО
		|	КассоваяОперацияДата УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		СтруктураВозврата.Вставить("РКО", Результат.НомерРКО);
	КонецЕсли;

	Возврат СтруктураВозврата;
КонецФункции

Функция ПечатьПустойАкт(МассивОбъектов, ОбъектыПечати, ВалютаРегламентированногоУчета)

	УстановитьПривилегированныйРежим(Истина);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб			= Истина;
	ТабДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	
	ПервыйДокумент = Истина;

	Для каждого Док из МассивОбъектов Цикл
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЛБ_ИнвентаризацияДС.ИНВ15_Пустая");
		
		//Найдем все данные для последующего заполнения
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		//Приступаем к заполнению			
		ОбластьМакетаСтр1 = Макет.ПолучитьОбласть("Страница1");
		//ОбластьМакетаСтр1.Параметры.Организация 	= Док.Организация;
		
		Ломбард = ПолучитьЛомбард(Пользователи.ТекущийПользователь());
		
		Если Ломбард <> Неопределено Тогда
			ОбластьМакетаСтр1.Параметры.Подразделение = Ломбард;
		Иначе
			//Сообщить("Невыбран ломбард пользователя");
			ОбластьМакетаСтр1.Параметры.Подразделение = "Невыбран ломбард пользователя";
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакетаСтр1);
		
		ОбластьМакетаСтр2 = Макет.Получитьобласть("Страница2");
		ТабДокумент.Вывести(ОбластьМакетаСтр2);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, Документы.ЛБ_ИнвентаризацияДС.ПустаяСсылка()); //Док);
		
	КонецЦикла;
	
	Возврат ТабДокумент;

КонецФункции

Функция ПолучитьЛомбард(Пользователь)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ТекущийЛомбардПользователя.Ломбард КАК Ломбард
		|ИЗ
		|	РегистрСведений.ЛБ_ТекущийЛомбардПользователя КАК ЛБ_ТекущийЛомбардПользователя
		|ГДЕ
		|	ЛБ_ТекущийЛомбардПользователя.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Ломбард;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции


