// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
		
	ОбменДаннымиСервер.УдалитьДвиженияУДокумента(ЭтотОбъект);
	
	Движения.ЛБ_УсловияПредоставленияКредита.Записывать = Истина;  
	Движение = Движения.ЛБ_УсловияПредоставленияКредита.Добавить(); 
	Движение.Период = Дата; 
	Движение.СхемаКредитования = ЭтотОбъект.СхемаКредитования;
	Движение.СрокЗалога = ЭтотОбъект.СрокЗалога;  
	
	Движения.ЛБ_УчастиеВРасчетеСтатусовПоСистемеЛояльности.Записывать = Истина;  
	Движение = Движения.ЛБ_УчастиеВРасчетеСтатусовПоСистемеЛояльности.Добавить(); 
	Движение.Период = Дата; 
	Движение.СхемаКредитования = ЭтотОбъект.СхемаКредитования;
	Движение.Участвует = ЭтотОбъект.УчастиеВРасчетах;
	
	Движения.ЛБ_НастройкаУвеличенияЗалогаПоСтатусамЗалогодателей.Записывать = Истина;  
	Если ЭтотОбъект.Ссуда.Количество() = 0 Тогда  
		Движение = Движения.ЛБ_НастройкаУвеличенияЗалогаПоСтатусамЗалогодателей.Добавить();
		Движение.Период = Дата; 
		Движение.СхемаКредитования = ЭтотОбъект.СхемаКредитования;;
		Движение.УвеличениеСтоимостиЗалога = 0;
	Иначе	
	    Для каждого Стр Из ЭтотОбъект.Ссуда Цикл  
			Движение = Движения.ЛБ_НастройкаУвеличенияЗалогаПоСтатусамЗалогодателей.Добавить();
			Движение.Период = Дата; 
			Движение.СхемаКредитования = ЭтотОбъект.СхемаКредитования;;
			Движение.СтатусЗалогодателя = Стр.СтатусЗалогодателя;
			Движение.УвеличениеСтоимостиЗалога = Стр.УвеличениеСтоимостиЗалога;
		Конеццикла;  
	КонецЕсли;	
	
	Движения.ЛБ_ТехническиеСтавки.Записывать = Истина;   
	Если ЭтотОбъект.ТехническиеСтавки.Количество() = 0 Тогда 
		Движение = Движения.ЛБ_ТехническиеСтавки.Добавить();
		Движение.Период = Дата; 
		Движение.СхемаКредитования = ЭтотОбъект.СхемаКредитования; 
		Движение.ДеньНачалаПрименения = 0;
		Движение.ПроцентнаяСтавка = 0;
	Иначе	
	    Для каждого Стр Из ЭтотОбъект.ТехническиеСтавки Цикл  
			Движение = Движения.ЛБ_ТехническиеСтавки.Добавить();
			Движение.Период = Дата; 
			Движение.СхемаКредитования = ЭтотОбъект.СхемаКредитования;
			Движение.ДеньНачалаПрименения = Стр.ДеньНачалаПрименения;
			Движение.ПроцентнаяСтавка = Стр.ПроцентнаяСтавка;
		Конеццикла;  
	КонецЕсли;	
		
КонецПроцедуры

// Процедура - обработчик события "ОбработкаУдаленияПроведения".
//
Процедура ОбработкаУдаленияПроведения(Отказ) 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЛБ_ОперацияПоЗалогу.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЛБ_ОперацияПоЗалогу КАК ЛБ_ОперацияПоЗалогу
	               |ГДЕ
	               |	ЛБ_ОперацияПоЗалогу.ТекущаяУстановкаУсловийПоСхемеКредитования = &Ссылка
	               |	И ЛБ_ОперацияПоЗалогу.Проведен = ИСТИНА"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		ОбщегоНазначения.СообщитьПользователю("В базе есть документы выдачи займа, использующие условия установленные в документе. Отмена проведения и удаление документа запрещены.");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры // ОбработкаУдаленияПроведения()  

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		Запрос = Новый Запрос; 
		Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);   
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка); 
		Запрос.УстановитьПараметр("СхемаКредитования", ЭтотОбъект.СхемаКредитования);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_УстановкаУсловийСхемыКредитования.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.ЛБ_УстановкаУсловийСхемыКредитования КАК ЛБ_УстановкаУсловийСхемыКредитования
		               |ГДЕ
		               |	ЛБ_УстановкаУсловийСхемыКредитования.Дата = &Дата
		               |	И ЛБ_УстановкаУсловийСхемыКредитования.Проведен = ИСТИНА
		               |	И ЛБ_УстановкаУсловийСхемыКредитования.СхемаКредитования = &СхемаКредитования
		               |	И НЕ ЛБ_УстановкаУсловийСхемыКредитования.Ссылка = &Ссылка";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ОбщегоНазначения.СообщитьПользователю("На дату документа уже есть установки по схеме кредитования " + СокрЛП(ЭтотОбъект.СхемаКредитования) + ".");
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры
	
