&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ВидОперации") Тогда 
		ВидОперации = Параметры.ВидОперации;
		//+МАН 13.11.24 Заявка 2792.
		Если ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП Тогда
			Элементы.ДатаОкончанияДействияПриказа.Видимость = Ложь;
		КонецЕсли;
		//-МАН
	КонецЕсли;	 

	Если Параметры.Свойство("НомерПриказа") Тогда
		НомерПриказа = Параметры.НомерПриказа;
	КонецЕсли; 
	
	Если Параметры.Свойство("ДатаПриказа") Тогда
		//+МАН 22.08.25 Изменил
		//ДатаПриказа = Параметры.ДатаПриказа;
		Если Параметры.ДатаПриказа <> ТекущаяДата() Тогда
			ДатаПриказа = ТекущаяДата();
		КонецЕсли;
		//-МАН
	КонецЕсли;
	
	Если Параметры.Свойство("ДатаНачалаДействияПриказа") Тогда
		Если Параметры.ДатаНачалаДействияПриказа >= НачалоДня(ТекущаяДата()) Тогда
			ДатаНачалаДействияПриказа = НачалоДня(Параметры.ДатаНачалаДействияПриказа);
		Иначе
			ДатаНачалаДействияПриказа = НачалоДня(ТекущаяДата());
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("ДатаОкончанияДействияПриказа") Тогда
		Если Параметры.ДатаОкончанияДействияПриказа <> Дата(1,1,1) Тогда
			ДатаОкончанияДействияПриказа = КонецДня(Параметры.ДатаОкончанияДействияПриказа);
		КонецЕсли;
	КонецЕсли;
	//+МАН 10.02.25
	//Было: ДатаНачалаДействияПриказа = ДатаПриказа;
	//-МАН
КонецПроцедуры

&НаКлиенте
Процедура ВвестиВДействие(Команда)  
	ВсеОК = Истина;	
	Если НЕ ПроверитьЗаполнение() Тогда
		ВсеОК = Ложь;
	Иначе    	
		Если НачалоДня(ДатаПриказа) > ДатаНачалаДействияПриказа Тогда
			Сообщить("Дата приказа не может быть больше даты начала действия приказа!");
			ВсеОК = Ложь;
		КонецЕсли;   
		//Если ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.Акция") Тогда  
		//	Если ДатаОкончанияДействияПриказа = Дата(1,1,1) Тогда
		//		Сообщить("Не выбрана дата окончания действия акции!");
		//	    ВсеОК = ложь;
		//	КонецЕсли;  

		Если ДатаНачалаДействияПриказа < НачалоДня(ТекущаяДата()) Тогда
			Сообщить("Дата начала действия приказа не может быть меньше текущей даты!");
			ВсеОК = Ложь;
		КонецЕсли;   
		
		Если ДатаОкончанияДействияПриказа <> Дата(1,1,1) Тогда
			Если ДатаОкончанияДействияПриказа <= ДатаНачалаДействияПриказа Тогда
				Сообщить("Дата окночания действия приказа не может быть меньше или равна даты начала действия приказа!");
				ВсеОК = Ложь;
			КонецЕсли;   
		КонецЕсли;	
	КонецЕсли;	
	
	Если ВсеОК Тогда
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("НомерПриказа", НомерПриказа);
		СтруктураВозврата.Вставить("ДатаПриказа", ДатаПриказа);
		СтруктураВозврата.Вставить("ДатаНачалаДействияПриказа", ДатаНачалаДействияПриказа); 
		СтруктураВозврата.Вставить("ДатаОкончанияДействияПриказа", ДатаОкончанияДействияПриказа);  
		
		Закрыть(СтруктураВозврата);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

//+МАН 05.02.25 Сделано Начало и конец дня вместо точного времени. Заявка 2792
&НаКлиенте
Процедура ДатаОкончанияДействияПриказаПриИзменении(Элемент)
	Если Элемент.ТекстРедактирования = "  .  .    " Тогда
		ДатаОкончанияДействияПриказа = Дата(1, 1, 1);
	Иначе
		ДатаОкончанияДействияПриказа = КонецДня(ДатаОкончанияДействияПриказа);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаДействияПриказаПриИзменении(Элемент)
	Если Формат(ДатаПриказа, "ДФ=dd.MM.yyyy") = Формат(ДатаНачалаДействияПриказа, "ДФ=dd.MM.yyyy") Тогда
		ДатаНачалаДействияПриказа = НачалоДня(ДатаПриказа);
	Иначе
		ДатаНачалаДействияПриказа = НачалоДня(ДатаНачалаДействияПриказа);
	КонецЕсли;
КонецПроцедуры
//-МАН
