
//Перем мПериод          Экспорт; // Период движений
//Перем мТаблицаДвижений Экспорт; // Таблица движений

//////////////////////////////////////////////////////////////////////////////////
//// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

//// Выполняет приход по регистру.
////
//// Параметры:
////  Нет.
////
//Процедура ВыполнитьПриход() Экспорт

//	ЮС_ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Приход);

//КонецПроцедуры // ВыполнитьПриход()

//// Выполняет расход по регистру.
////
//// Параметры:
////  Нет.
////
//Процедура ВыполнитьРасход() Экспорт

//	ЮС_ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Расход);

//КонецПроцедуры // ВыполнитьРасход()

//// Выполняет движения по регистру.
////
//// Параметры:
////  Нет.
////
//Процедура ВыполнитьДвижения() Экспорт

//	Загрузить(мТаблицаДвижений);

//КонецПроцедуры // ВыполнитьДвижения()
