
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.ТолькоПросмотр = Истина Тогда
		Элементы.СохранитьИЗакрыть.Доступность = Ложь;
	КонецЕсли;	
	Если Параметры.Свойство("ВидВставки") Тогда
		ВидКомплектующего = Параметры.ВидВставки;
	КонецЕсли;
    Если Параметры.Свойство("Количество") Тогда
		Количество = Параметры.Количество;
	КонецЕсли; 
	Если Параметры.Свойство("ВесГраммы") Тогда
		Вес = Параметры.ВесГраммы;
		ВесШт = ?(Количество = 0, 0, Вес/Количество);
	КонецЕсли;
	Если Параметры.Свойство("ЕдиницаИзмерения") Тогда
		ЕдиницаИзмерения = Параметры.ЕдиницаИзмерения;
	КонецЕсли;
	Если Параметры.Свойство("НоваяСтрока") Тогда
		НоваяСтрока = Параметры.НоваяСтрока;
	КонецЕсли;
	
	Если ПроверкаВидаКомплектующегоВычет() Тогда
		ЗаполнитьЗначенияСкидок();
		Если Параметры.Свойство("РазмерСкидки") Тогда
			РазмерСкидки = Параметры.РазмерСкидки;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Этаформа.Закрыть(?(НоваяСтрока, Ложь, Неопределено));
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	Если НЕ Проверить() Тогда
		Возврат;
	КонецЕсли;
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Количество", Количество);
	СтруктураВозврата.Вставить("ВидВставки", ВидКомплектующего);
	СтруктураВозврата.Вставить("ЕдиницаИзмерения", ЕдиницаИзмерения);
	СтруктураВозврата.Вставить("Вес", ВесШТ);
	
	Если ПроверкаВидаКомплектующегоВычет() Тогда
		СтруктураВозврата.Вставить("РазмерСкидки", РазмерСкидки);
	КонецЕсли;
	
	Этаформа.Закрыть(СтруктураВозврата);
КонецПроцедуры

&НаКлиенте
Функция Проверить()
	ВсеОК = Истина;

	Если НЕ ЗначениеЗаполнено(ВидКомплектующего) Тогда
		Сообщить("Не выбран вид комплектующего.");
		ВсеОК = Ложь;
	КонецЕсли;
	Если Количество = 0 Тогда
		Сообщить("Не задано количество.");
		ВсеОК = Ложь;
	КонецЕсли;
	//++ИВВ 03.2026, вычеты для часов ч.2
	//было:
	//Если ВесШт = 0 Тогда
	Если ВесШт = 0 И Не ПроверкаВидаКомплектующегоВычет() Тогда
	//--ИВВ
		Сообщить("Не задан вес.");
		ВсеОК = Ложь;
	КонецЕсли;
	
	Если ПроверкаВидаКомплектующегоВычет() Тогда
		Если Не ЗначениеЗаполнено(РазмерСкидки) Тогда
			Сообщить("Не заполнен размер скидки.");
			ВсеОК = Ложь;
		КонецЕсли;
	КонецЕсли;

	Возврат ВсеОК;
КонецФункции

&НаКлиенте
Процедура ВидКомплектующегоПриИзменении(Элемент)
	ЗаполнитьРеквизиты();
	//++ИВВ, 02.2026, вычеты для часов
	ЗаполнитьЗначенияСкидок();
	//--ИВВ
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияСкидок()
	
	Если ВидКомплектующего = Справочники.ЛБ_Настройки.ПолучитьЗначениеСправочника("ВидыКомплектующихДляВычета").ЧасовойМеханизм Тогда
		ЗначенияСкидок = Справочники.ЛБ_Настройки.ПолучитьЗначениеСправочника("ЗначенияСкидок_ЧасовойМеханизм", "ТаблицаЗначений");
	ИначеЕсли ВидКомплектующего = Справочники.ЛБ_Настройки.ПолучитьЗначениеСправочника("ВидыКомплектующихДляВычета").НикаКапсула Тогда
		ЗначенияСкидок = Справочники.ЛБ_Настройки.ПолучитьЗначениеСправочника("ЗначенияСкидок_НикаКапсула", "ТаблицаЗначений");
	Иначе
		Элементы.РазмерСкидки.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.РазмерСкидки.Видимость = Истина;
	Элементы.РазмерСкидки.СписокВыбора.Очистить();
	
	Для Каждого ТекущаяСтрока Из ЗначенияСкидок Цикл
		Элементы.РазмерСкидки.СписокВыбора.Добавить(ТекущаяСтрока.Значение, Строка(ТекущаяСтрока.Значение) + "%");
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПроверкаВидаКомплектующегоВычет()
	
	Если ВидКомплектующего = Справочники.ЛБ_Настройки.ПолучитьЗначениеСправочника("ВидыКомплектующихДляВычета").ЧасовойМеханизм 
		Или ВидКомплектующего = Справочники.ЛБ_Настройки.ПолучитьЗначениеСправочника("ВидыКомплектующихДляВычета").НикаКапсула Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьРеквизиты()
	ВесШт = ВидКомплектующего.ВесПоУмолчанию*Количество;
	ЕдиницаИзмерения = ВидКомплектующего.ЕдиницаИзмерения;
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	ЗаполнитьРеквизиты();
КонецПроцедуры

