
// Проверяет правильность заполнения полей регистра.
//
// Параметры:
//  СтруктураОбязательныхПолей - структура, содержащая имена полей,
//                 которые собственно и надо проверить
//  Отказ        - флаг отказа
//  Заголовок    - строка, заголовок сообщения об ошибке
//
Процедура ПроверитьЗаполнениеПолей(СтруктураОбязательныхПолей, Отказ) Экспорт

	ТипыПланыСчетов     = ПланыСчетов.ТипВсеСсылки();
	МетаданныеИзмерения = ЭтотОбъект.Метаданные().Измерения;
	МетаданныеРесурсы   = ЭтотОбъект.Метаданные().Ресурсы;

	Для Каждого ТекЗапись Из ЭтотОбъект Цикл

		Для Каждого КлючЗначение Из СтруктураОбязательныхПолей Цикл

			Значение = ТекЗапись[КлючЗначение.Ключ];
			МетаданныеПоля = МетаданныеРесурсы.Найти(КлючЗначение.Ключ);
			Если МетаданныеПоля = Неопределено Тогда
				МетаданныеПоля = МетаданныеИзмерения.Найти(КлючЗначение.Ключ)
			КонецЕсли;
			Если МетаданныеПоля = Неопределено Тогда
				ПредставлениеРеквизита = КлючЗначение.Ключ;
			Иначе
				ПредставлениеРеквизита = МетаданныеПоля.Представление();
			КонецЕсли;

			Если Не ЗначениеЗаполнено(Значение) Тогда // надо ругаться

				Если Не ЗначениеЗаполнено(КлючЗначение.Значение) Тогда // стандартное ругательство
					СтрокаСообщения = "Не заполнено значение реквизита """ + СокрЛП(ПредставлениеРеквизита) + """!";
				Иначе
					СтрокаСообщения = КлючЗначение.Значение;
				КонецЕсли;

				Сообщить(СтрокаСообщения);
				отказ = истина;
				
			ИначеЕсли ТипыПланыСчетов.СодержитТип(ТипЗнч(Значение)) тогда

				Если Значение.ЗапретитьИспользоватьВПроводках Тогда
					СтрокаСообщения = "Реквизит """ + СокрЛП(ПредставлениеРеквизита) + """ : счет " + СокрЛП(Значение)+" """ + Значение.Наименование + """ нельзя использовать в проводках.";
					Сообщить("СтрокаСообщения");
				КонецЕсли;
				отказ = истина;
				
			КонецЕсли;

		КонецЦикла;

	КонецЦикла;

КонецПроцедуры // ПроверитьЗаполнениеПолей()

// Проверяет правильность заполнения реквизитов.
//
// Параметры:
//  Отказ        - флаг отказа
//  Заголовок    - строка, заголовок сообщения об ошибке
//
Процедура ПроверитьЗаполнениеРеквизитов(Отказ)

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура();

	СтруктураОбязательныхПолей.Вставить("СхемаКредитования");
	
	// Теперь позовем общую процедуру проверки.
	ПроверитьЗаполнениеПолей(СтруктураОбязательныхПолей, Отказ);

КонецПроцедуры // ПроверитьЗаполнениеРеквизитов()

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, Замещение)

//	// Заголовок для сообщений об ошибках проведения.
//#Если Книент Тогда
//	СтрокаОтбора = СформироватьСтрокуОтборов(Отбор);
//	Заголовок = "Сохранение записи регистра ""Условия кредитования"" (" + СтрокаОтбора + "): ";
//#Иначе
//	Заголовок = "Сохранение записи регистра ""Условия кредитования"": ";
//#КонецЕсли

	ПроверитьЗаполнениеРеквизитов(Отказ);

КонецПроцедуры
