
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;	  
	Действует = ?(Объект.ДатаОкончанияДействия < НачалоДня(ТекущаяДата()), Ложь, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда  
		НомерВНаим = СокрЛП(Объект.НомерКарты);
		Если СтрДлина(НомерВНаим) > 4 Тогда
			НомерВНаим = "..." + Прав(НомерВНаим, 4);
		КонецЕсли;	
		Объект.Наименование = СокрЛП(Объект.ВидКарты) + " № " + НомерВНаим;
		Объект.ДатаРегистрации = ТекущаяДата();
	//КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияДействияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ДатаОкончанияДействия) Тогда  
		Если Объект.ДатаОкончанияДействия < НачалоДня(ТекущаяДата()) Тогда 
			Действует = Ложь;
		Иначе                  
			Действует = Истина;
		КонецЕсли;	
	Иначе     
		Действует = Истина;
	КонецЕсли;	
КонецПроцедуры
