
&НаКлиенте
Процедура СоздатьАкцию(Команда)
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.Акция"));
	ОткрытьФорму("Документ.ЛБ_УстановитьТекущийШаблонПриказа_Металлы.Форма.ФормаДокумента", СтруктураПараметров, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьБазовый(Команда)
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.Базовый"));
	ОткрытьФорму("Документ.ЛБ_УстановитьТекущийШаблонПриказа_Металлы.Форма.ФормаДокумента", СтруктураПараметров, ЭтаФорма);
КонецПроцедуры
