//lion 14.08.25
//убрал галочки "Изменять состав строк","Изменять порядок строк"

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Документ") Тогда 
		Дата = Параметры.Документ.Дата;  
		Организация = Параметры.Документ.Организация;
		Категория = Параметры.Документ.Категория;  
		ВидОперации = Параметры.Документ.ВидОперации;
		Если ВидОперации = Перечисления.ЛБ_ВидыПоступленияОбъектовЗалога.ОтСтороннегоКонтрагента Тогда
		    Получатель = Параметры.Документ.ЛомбардОткуда; 
			СкладПолучатель = Параметры.Документ.СкладПолучатель;
		Иначе
			Получатель = Параметры.Документ.ЛомбардКуда;  
		КонецЕсли;	
		ЗаполнитьТаблицуНакладных();
		Если Категория = Перечисления.ЛБ_КатегорииПоступленияОбъектовЗалога.Поштучно тогда  
			Элементы.ТаблицаНакладныхВПутиНакладнаяНаОтгрузкуДата.Видимость = Ложь;
			Элементы.ТаблицаНакладныхВПутиНакладнаяНаОтгрузку.Видимость = Ложь;
		КонецЕсли;	
	Иначе     
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНакладных()
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", Документ.Дата); 
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Получатель", Получатель);  
	Запрос.УстановитьПараметр("СкладПолучатель", СкладПолучатель);

	Условие = "";	
	//+МАН 07.11.25 Добавил переменную.
	Условие2 = "";
	//-МАН
	Запрос.УстановитьПараметр("ПустаяНакладная", Документы.ЛБ_НакладнаяНаОтгрузку.ПустаяСсылка());
	Если Категория = Перечисления.ЛБ_КатегорииПоступленияОбъектовЗалога.Сумка Тогда 
		Условие = Условие + " И НЕ НакладнаяНаОтгрузку = &ПустаяНакладная"; 
		//+МАН 07.11.25 Добавил условие
		Условие2 = Символы.ПС + "ГДЕ ЛБ_СтатусыНакладнойНаОтгрузку.СтатусНакладной = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыНакладнойНаОтгрузку.Отгружена)";
		//-МАН
	Иначе
		Условие = Условие + " И НакладнаяНаОтгрузку = &ПустаяНакладная";
	КонецЕсли;    
	Если ВидОперации = Перечисления.ЛБ_ВидыПоступленияОбъектовЗалога.ОтСтороннегоКонтрагента Тогда  
		Если ЗначениеЗаполнено(СкладПолучатель) Тогда 
			Условие = Условие + " И СкладОтправитель = &СкладПолучатель";
		КонецЕсли;	
	КонецЕсли;	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОбъектыЗалогаВПутиОстатки.НакладнаяНаОтгрузку.Дата КАК НакладнаяНаОтгрузкуДата,
	               |	ЛБ_ОбъектыЗалогаВПутиОстатки.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
	               |	ЛБ_ОбъектыЗалогаВПутиОстатки.Отправитель КАК Отправитель,
	               |	ЛБ_ОбъектыЗалогаВПутиОстатки.СкладОтправитель КАК СкладОтправитель,
	               |	ЛБ_ОбъектыЗалогаВПутиОстатки.Получатель КАК Получатель,
	               |	ЛБ_ОбъектыЗалогаВПутиОстатки.СкладПолучатель КАК СкладПолучатель,
	               |	СУММА(ЛБ_ОбъектыЗалогаВПутиОстатки.КоличествоОстаток) КАК Количество,
				   //lion+++ 14.08.25
	               |	МАКСИМУМ(ЛБ_СтатусыНакладнойНаОтгрузку.Период) КАК ДатаОтгрузки
				   //lion--- 14.08.25
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОбъектыЗалогаВПути.Остатки(
	               |			&Дата,
	               |			Организация = &Организация
	               |				И Получатель = &Получатель" + Условие + ") КАК ЛБ_ОбъектыЗалогаВПутиОстатки
				   //lion+++ 14.08.25
	               |			ЛЕВОЕ СОЕДИНЕНИЕ
	               |			РегистрСведений.ЛБ_СтатусыНакладнойНаОтгрузку КАК ЛБ_СтатусыНакладнойНаОтгрузку
	               |			ПО ЛБ_ОбъектыЗалогаВПутиОстатки.НакладнаяНаОтгрузку=ЛБ_СтатусыНакладнойНаОтгрузку.НакладнаяНаОтгрузку"
				   //+МАН 07.11.25 Изменил. Противоречило если накладная "Пустая ссылка".
	               //|			ГДЕ ЛБ_СтатусыНакладнойНаОтгрузку.СтатусНакладной=ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыНакладнойНаОтгрузку.Отгружена)
				   //-МАН
				   + Условие2
				   //lion--- 14.08.25
	               + "
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ОбъектыЗалогаВПутиОстатки.СкладОтправитель,
	               |	ЛБ_ОбъектыЗалогаВПутиОстатки.Получатель,
	               |	ЛБ_ОбъектыЗалогаВПутиОстатки.Отправитель,
	               |	ЛБ_ОбъектыЗалогаВПутиОстатки.СкладПолучатель,
	               |	ЛБ_ОбъектыЗалогаВПутиОстатки.НакладнаяНаОтгрузку
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ОбъектыЗалогаВПутиОстатки.НакладнаяНаОтгрузку.Дата";         
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	ТаблицаНакладныхВПути.Загрузить(ТаблицаЗапроса);
	//lion++
	//ТаблицаНакладныхВПути.Сортировать("НакладнаяНаОтгрузкуДата УБЫВ");
	ТаблицаНакладныхВПути.Сортировать("ДатаОтгрузки УБЫВ");
	//lion--
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Этаформа.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСВыбором() 
	ТекСтрока = Элементы.ТаблицаНакладныхВПути.ТекущиеДанные;
	СтруктураВозврата = Новый структура;
	СтруктураВозврата.Вставить("НакладнаяНаОтгрузку", ТекСтрока.НакладнаяНаОтгрузку); 
	СтруктураВозврата.Вставить("Отправитель", ТекСтрока.Отправитель);
	СтруктураВозврата.Вставить("Получатель", ТекСтрока.Получатель);
	СтруктураВозврата.Вставить("СкладОтправитель", ТекСтрока.СкладОтправитель);
	СтруктураВозврата.Вставить("СкладПолучатель", ТекСтрока.СкладПолучатель);  
	
	Этаформа.Закрыть(СтруктураВозврата); 
КонецПроцедуры	
	
&НаКлиенте
Процедура Выбор(Команда) 
	ТекСтрока = Элементы.ТаблицаНакладныхВПути.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда
	    ЗакрытьСВыбором();  
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНакладныхВПутиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтрока = Элементы.ТаблицаНакладныхВПути.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда
	    ЗакрытьСВыбором();  
	КонецЕсли;	
КонецПроцедуры
