
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)   
	ДатаКон = ТекущаяДатаСеанса();
	Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить(); 
	Ломбард = ЛБ_ОбщийМодуль.ПолучитьЛомбардПользователя(ПараметрыСеанса.ТекущийПользователь); 
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	Если НЕ ТекПользователь.ЭтоЛомбард Тогда
	   	Ответственный = ТекПользователь; 
		Если УправлениеДоступом.ЕстьРоль("ЛБ_СотрудникЦО") Тогда
			СотрудникЦО = Истина;
		КонецЕсли;	 
	Иначе
		Ответственный = ПараметрыСеанса.ТекущийСотрудник;
	КонецЕсли;
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;

	//+МАН 16.12.24 Изменена дата начала. Было с первого созданного документа. Будет - 2 месяца от текущей даты. Заявка 2904
	//ДатаНач = ПолучитьДатуНачалаВЛомбарде();
	ДатаНач = ТекущаяДата() - 5270400;
	//-МАН

	НакладныеНаОтгрузку.Параметры.УстановитьЗначениеПараметра("Дата1", ?(ДатаНач = Дата(1,1,1), ДатаНач, НачалоДня(ДатаНач)));
	НакладныеНаОтгрузку.Параметры.УстановитьЗначениеПараметра("Дата2", ?(ДатаКон = Дата(1,1,1), ТекущаяДатаСеанса(), КонецДня(ДатаКон)));
    НакладныеНаОтгрузку.Параметры.УстановитьЗначениеПараметра("Организация", Организация); 
	НакладныеНаОтгрузку.Параметры.УстановитьЗначениеПараметра("Ломбард", Ломбард);  
		
	СписокСтатусовНакладных.Добавить(Перечисления.ЛБ_СтатусыНакладнойНаОтгрузку.Факт); 
	СписокСтатусовНакладных.Добавить(Перечисления.ЛБ_СтатусыНакладнойНаОтгрузку.СумкаОткрыта);
	СписокСтатусовНакладных.Добавить(Перечисления.ЛБ_СтатусыНакладнойНаОтгрузку.СумкаЗакрыта);
	СписокСтатусовНакладных.Добавить(Перечисления.ЛБ_СтатусыНакладнойНаОтгрузку.Отгружена);
	
	Если СотрудникЦО Тогда
		ДатаКоррКон = ТекущаяДатаСеанса();
		//+МАН 16.12.24 Изменена дата начала. Было с первого созданного документа. Будет - начало месяца от текущей даты. Заявка 2904
		//ДатаКоррНач = ПолучитьДатуНачалаКорректировок();
		ДатаКоррНач = НачалоМесяца(ТекущаяДата());
		//-МАН
		
		ЗаполнитьТаблицуКорректировок(); 
	КонецЕсли;	

	//+МАН 15.11.24 Ограничение по добавленному полю.
	Поле = Новый Массив;
	Поле.Добавить("ДатаОтгрузки");
	
	НакладныеНаОтгрузку.УстановитьОграниченияИспользованияВГруппировке(Поле);
	НакладныеНаОтгрузку.УстановитьОграниченияИспользованияВОтборе(Поле);
	НакладныеНаОтгрузку.УстановитьОграниченияИспользованияВПорядке(Поле);
	
	//НакладныеНаОтгрузкуУсловноеОформление = НакладныеНаОтгрузку.КомпоновщикНастроек.Настройки.УсловноеОформление;
	//НакладныеНаОтгрузкуУсловноеОформление.Элементы.Очистить();
	//-МАН

	//+МАН 19.03.26 Заявка 3750
	УстановитьДоступность();
	//-МАН
КонецПроцедуры  

&НаСервере
Функция ЗаполнитьДопИнформациюТаблицыКорректировок(Документ) 
	
	СписокЛ = Новый СписокЗначений; 
	СписокН = Новый СписокЗначений;
	СписокЗБ = Новый СписокЗначений;
	Для каждого Стр из Документ.ЗалоговыеБилеты Цикл
		Если СписокЛ.НайтиПоЗначению(Стр.Ломбард) = неопределено Тогда
			СписокЛ.Добавить(Стр.Ломбард);
		КонецЕсли;
		Если СписокН.НайтиПоЗначению(Стр.НакладнаяНаОтгрузку) = неопределено Тогда
			СписокН.Добавить(Стр.НакладнаяНаОтгрузку);
		КонецЕсли;	
        Если СписокЗБ.НайтиПоЗначению(Стр.ЗалоговыйБилет) = неопределено Тогда
			СписокЗБ.Добавить(Стр.ЗалоговыйБилет);
		КонецЕсли;
	КонецЦикла;	
		
	СтрокаЛомбард = ""; 
	СтрокаНакладные = "";
	СтрокаНомераЗБ = ""; 
	Для каждого Эл Из СписокЛ Цикл
		СтрокаЛомбард = СтрокаЛомбард + ?(ПустаяСтрока(СтрокаЛомбард), "", ", ") + СокрЛП(Эл.Значение);
	КонецЦикла; 
	Для каждого Эл Из СписокН Цикл
		СтрокаНакладные = СтрокаНакладные + ?(ПустаяСтрока(СтрокаНакладные), "", ", ") + СокрЛП(Эл.Значение.ПредставлениеНомераНакладной);
	КонецЦикла;
    Для каждого Эл Из СписокЗБ Цикл
		СтрокаНомераЗБ = СтрокаНомераЗБ + ?(ПустаяСтрока(СтрокаНомераЗБ), "", ", ") + СокрЛП(Эл.Значение.НомерЗалоговогоБилета);
	КонецЦикла;
	
	СтруктураВозврата = Новый структура;
	СтруктураВозврата.Вставить("Ломбард", ?(Документ.ВидОперации = Перечисления.ЛБ_ВидыКорректировкиНакладной.ОтгрузкаНакладных, Документ.Ломбард, СтрокаЛомбард)); 
	СтруктураВозврата.Вставить("Накладные", СтрокаНакладные);
	СтруктураВозврата.Вставить("НомераЗБ", СтрокаНомераЗБ);
	Возврат СтруктураВозврата;
КонецФункции	
	
&НаСервере
Процедура ЗаполнитьТаблицуКорректировок()
	КорректировкиНакладных.Очистить();
	
	Запрос = Новый Запрос;    
	Запрос.УстановитьПараметр("Дата1", ?(ДатаКоррНач = Дата(1,1,1), ДатаКоррНач, НачалоДня(ДатаКоррНач))); 
	Запрос.УстановитьПараметр("Дата2", ?(ДатаКоррКон = Дата(1,1,1), ТекущаяДатаСеанса(), КонецДня(ДатаКоррКон))); 	
	Запрос.УстановитьПараметр("Организация", Организация); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыКорректировкиНакладной.ВключитьЗБВНакладную) КАК ВидКорректировки,
	               |	ЛБ_НакладнаяНаОтгрузку.Ссылка КАК Ссылка,
	               |	ЛБ_НакладнаяНаОтгрузку.Дата КАК Дата,
	               |	ЛБ_НакладнаяНаОтгрузку.ПредставлениеНомераНакладной КАК НомерНакладной,
	               |	ЛБ_НакладнаяНаОтгрузку.Ломбард КАК Ломбард,
	               |	ЛБ_НакладнаяНаОтгрузку.Ответственный КАК Ответственный,
	               |	ВЫБОР
	               |		КОГДА ЛБ_НакладнаяНаОтгрузку.ПометкаУдаления
	               |			ТОГДА 2
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ЛБ_НакладнаяНаОтгрузку.Проведен
	               |					ТОГДА 1
	               |				ИНАЧЕ 0
	               |			КОНЕЦ
	               |	КОНЕЦ КАК СостояниеДокумента
	               |ИЗ
	               |	Документ.ЛБ_НакладнаяНаОтгрузку КАК ЛБ_НакладнаяНаОтгрузку
	               |ГДЕ
	               |	ЛБ_НакладнаяНаОтгрузку.Организация = &Организация
	               |	И ЛБ_НакладнаяНаОтгрузку.Дата МЕЖДУ &Дата1 И &Дата2
	               |	И ЛБ_НакладнаяНаОтгрузку.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыНакладнойНаОтгрузку.Вручную)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЛБ_КорректировкаНакладной.ВидОперации,
	               |	ЛБ_КорректировкаНакладной.Ссылка,
	               |	ЛБ_КорректировкаНакладной.Дата,
	               |	"""",
	               |	"""",
	               |	ЛБ_КорректировкаНакладной.Ответственный,
	               |	ВЫБОР
	               |		КОГДА ЛБ_КорректировкаНакладной.ПометкаУдаления
	               |			ТОГДА 2
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ЛБ_КорректировкаНакладной.Проведен
	               |					ТОГДА 1
	               |				ИНАЧЕ 0
	               |			КОНЕЦ
	               |	КОНЕЦ
	               |ИЗ
	               |	Документ.ЛБ_КорректировкаНакладной КАК ЛБ_КорректировкаНакладной
	               |ГДЕ
	               |	ЛБ_КорректировкаНакладной.Организация = &Организация
	               |	И ЛБ_КорректировкаНакладной.Дата МЕЖДУ &Дата1 И &Дата2
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата УБЫВ";  
	Выборка  = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		НоваяСтр = КорректировкиНакладных.Добавить(); 
		НоваяСтр.ВидКорректировки = Выборка.ВидКорректировки; 
		НоваяСтр.Ссылка = Выборка.Ссылка;
		НоваяСтр.Дата = Выборка.Дата;   
		НоваяСтр.СостояниеДокумента = Выборка.СостояниеДокумента;
		НоваяСтр.Ответственный = Выборка.Ответственный;

		Если НоваяСтр.ВидКорректировки = Перечисления.ЛБ_ВидыКорректировкиНакладной.ВключитьЗБВНакладную Тогда  
			НоваяСтр.Ломбард = Выборка.Ломбард;
			НоваяСтр.НомераНакладных = Выборка.НомерНакладной;
			ТаблицаЗБ = Выборка.Ссылка.Залоги.Выгрузить(); 
			ТаблицаЗБ.Свернуть("ЗалоговыйБилет"); 
			НомераЗБ = "";
			Для каждого Стр из ТаблицаЗБ Цикл 
				НомераЗБ = НомераЗБ + ?(ПустаяСтрока(НомераЗБ), "", ", ") + СокрЛП(Стр.ЗалоговыйБилет.НомерЗалоговогоБилета);
			КонецЦикла;	
			НоваяСтр.НомераЗБ  = НомераЗБ;	  
		Иначе
			Результат = ЗаполнитьДопИнформациюТаблицыКорректировок(НоваяСтр.Ссылка);
			НоваяСтр.Ломбард = Результат.Ломбард;
			НоваяСтр.НомераНакладных = Результат.Накладные;
            НоваяСтр.НомераЗБ  = Результат.НомераЗБ; 
			Если НоваяСтр.ВидКорректировки = Перечисления.ЛБ_ВидыКорректировкиНакладной.ОплатаОтгруженногоЗБ Тогда	
				Если НЕ НоваяСтр.Ссылка.ЗалоговыеБилеты.Количество() = 0 Тогда
					Если НачалоДня(НоваяСтр.Ссылка.ЗалоговыеБилеты.Получить(0).ДатаОплаты) < НачалоДня(ТекущаяДатаСеанса()) Тогда 
						НоваяСтр.Архив = Истина;
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры	

&НаСервере
Функция ПолучитьДниДостунаОтгрузка(Дата) 
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Организация", Организация);  
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_НастройкиСозданияНакладныхНаОтгрузкуСрезПоследних.КоличествоДнейДоступнаОтгрузка КАК КоличествоДней
	               |ИЗ
	               |	РегистрСведений.ЛБ_НастройкиСозданияНакладныхНаОтгрузку.СрезПоследних(&Дата, Организация = &Организация) КАК ЛБ_НастройкиСозданияНакладныхНаОтгрузкуСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КоличествоДней;
	КонецЕсли;  
	Возврат 0;
КонецФункции	

&НаСервере
Функция ПолучитьДатуНачалаВЛомбарде() 
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Организация", Организация); 
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЛБ_СтатусыНакладнойНаОтгрузку.Период КАК ДатаНачала
	               |ИЗ
	               |	РегистрСведений.ЛБ_СтатусыНакладнойНаОтгрузку КАК ЛБ_СтатусыНакладнойНаОтгрузку
	               |ГДЕ
	               |	ЛБ_СтатусыНакладнойНаОтгрузку.НакладнаяНаОтгрузку.Организация = &Организация
	               |	И ЛБ_СтатусыНакладнойНаОтгрузку.НакладнаяНаОтгрузку.Ломбард = &Ломбард
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаНачала";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДатаНачала;
	КонецЕсли;
	Возврат ТекущаяДатаСеанса();
КонецФункции	

&НаСервере
Функция ПолучитьДатуНачалаКорректировок() 
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Организация", Организация); 
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЛБ_КорректировкаНакладной.Дата КАК ДатаНачала
	               |ИЗ
	               |	Документ.ЛБ_КорректировкаНакладной КАК ЛБ_КорректировкаНакладной";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДатаНачала;
	КонецЕсли;
	Возврат ТекущаяДатаСеанса();
КонецФункции	


&НаСервере
Функция СменаСтатусаНаСервере(НакладнаяНаОтгрузку, ДатаОтгрузки = неопределено, Инкассатор = неопределено, Получатель = Неопределено, СкладПолучатель = неопределено)
	НовыйДок = Документы.ЛБ_ИзменениеСтатусаНакладной.СоздатьДокумент();
	НовыйДок.Дата = ?(ДатаОтгрузки = неопределено, ТекущаяДатаСеанса(), ДатаОтгрузки); 
	НовыйДок.НакладнаяНаОтгрузку = НакладнаяНаОтгрузку;
	НовыйДок.ВидОперации = Перечисления.ЛБ_ВидыОперацийИзменениеСтатусаНакладнойНаОтгрузку.СменаСтатуса; 
	НовыйДок.Ответственный = Ответственный;  
	НовыйДок.ОтветственныйСотрудник = ПараметрыСеанса.ТекущийСотрудник;

	НовыйДок.Инкассатор = Инкассатор;  
	НовыйДок.Получатель = Получатель; 
	НовыйДок.СкладПолучатель = СкладПолучатель;
	НовыйДок.Записать(РежимЗаписиДокумента.Запись);
	
	Попытка 
		НовыйДок.Записать(РежимЗаписиДокумента.Проведение); 
		Возврат Истина;
	Исключение   
		ОбщегоНазначения.СообщитьПользователю("Не удалось провести документ " + строка(НовыйДок.Ссылка) + ". Обратитесь к разработчикам.");
		Возврат Ложь; 
	КонецПопытки;	
КонецФункции

&НаКлиенте
Функция ПроверитьДниДоОгрузки(ДатаНакладной, НомерНакладной, СтатусНакладной)
	Строкасписка = СписокСтатусовНакладных.НайтиПоЗначению(СтатусНакладной); 
    Инд = Строкасписка.ПолучитьИдентификатор();                              
	СтрокаПоиска = СписокСтатусовНакладных.НайтиПоИдентификатору(Инд+1);   
	Если СтрокаПоиска = неопределено Тогда
		Возврат Ложь;
	КонецЕсли;	
	НовыйСтатус = СтрокаПоиска.Значение; 
	
	КоличествоДнейДоступнаОтгрузка = ПолучитьДниДостунаОтгрузка(ДатаНакладной);

	Если КоличествоДнейДоступнаОтгрузка = 0 Тогда
		СтрокаВопроса = "Внимание! Накладная № " + СокрЛП(НомерНакладной) + " от " + Формат(ДатаНакладной, "ДФ=dd.MM.yyyy") + " переводится в статус «" + Строка(НовыйСтатус) + "». Продолжаем?";
        Режим = РежимДиалогаВопрос.ДаНет;
        Ответ = Вопрос(СтрокаВопроса, Режим, 0);
		Если Ответ = КодВозвратаДиалога.Да Тогда
		    Возврат Истина;
		ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
			 Возврат Ложь;
		КонецЕсли;		
	Иначе   
		ДатаОтгрузкиВозможна = КонецДня(ДатаНакладной) + 1 + КоличествоДнейДоступнаОтгрузка*86400; 
		ДатаСеанса = НачалоДня(ПолучитьДатуСеанса()); 
		Если  ДатаСеанса < ДатаОтгрузкиВозможна Тогда 
			СтрокаПредупреждения = "Внимание! Накладная на внутреннее перемещение сформирована " + Формат(ДатаНакладной, "ДФ=dd.MM.yyyy") + " и не подлежит инкассации по сроку." +
				                       "Срок возможной инкассации " + Формат(ДатаОтгрузкиВозможна, "ДФ=dd.MM.yyyy")+ "."; 
			Если СтатусНакладной = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыНакладнойНаОтгрузку.СумкаЗакрыта") Тогда  
                Предупреждение(СтрокаПредупреждения, 60);
				Возврат Ложь;
			Иначе                  
                Режим = РежимДиалогаВопрос.ДаНет;
                Ответ = Вопрос(СтрокаПредупреждения + " Переводим накладную № " + СокрЛП(НомерНакладной) + " от " + Формат(ДатаНакладной, "ДФ=dd.MM.yyyy") + " в статус «" + Строка(НовыйСтатус) + "»?", Режим, 0);
				Если Ответ = КодВозвратаДиалога.Да Тогда
				    Возврат Истина;
				ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
					 Возврат Ложь;
				КонецЕсли;			
			КонецЕсли;	
		Иначе  
			СтрокаВопроса = "Внимание! Накладная № " + СокрЛП(НомерНакладной) + " от " + Формат(ДатаНакладной, "ДФ=dd.MM.yyyy") + " переводится в статус «" + Строка(НовыйСтатус) + "». Продолжаем?";
            Режим = РежимДиалогаВопрос.ДаНет;
            Ответ = Вопрос(СтрокаВопроса, Режим, 0);
			Если Ответ = КодВозвратаДиалога.Да Тогда
			    Возврат Истина;
			ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
				 Возврат Ложь;
			КонецЕсли;			
		КонецЕсли;	
	КонецЕсли;	
КонецФункции 

&НаСервере
Функция ПроверятьДниДоОтгрузки(НакладнаяНаОтгрузку)
	Возврат ?(НакладнаяНаОтгрузку.ВидОперации = Перечисления.ЛБ_ВидыНакладнойНаОтгрузку.Автоматически, Истина, Ложь);
КонецФункции

&НаСервере
Функция ПолучитьДатуНакладной(Накладная)  
	Возврат Накладная.Дата;
КонецФункции	

&НаКлиенте
Процедура СменаСтатуса(Команда)
	ТекСтрока = Элементы.НакладныеНаОтгрузку.ТекущиеДанные;
	Если ТекСтрока = неопределено Тогда
		Возврат;
	КонецЕсли;	   
	ДатаНакладной = ПолучитьДатуНакладной(Текстрока.НакладнаяНаОтгрузку);
	Если ТекСтрока.Пустой Тогда
		Предупреждение("Внимание! Накладная № " + сокрЛП(Текстрока.НомерНакладной) + " от " + Формат(ДатаНакладной, "ДФ=dd.MM.yyyy") + 
		        " не содержит доступных к отгрузке предметов залога. Смена статусов запрещена.", 60);
		Возврат;
	КонецЕсли;	         
	Если ТекСтрока.СтатусНакладной = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыНакладнойНаОтгрузку.Отгружена") Тогда
		Предупреждение("Накладная № " + сокрЛП(Текстрока.НомерНакладной) + " от " + Формат(ДатаНакладной, "ДФ=dd.MM.yyyy") + "находится в статусе «Отгружена». Больше нет статусов доступных для изменения.", 60);
	Иначе       
		Если ПроверятьДниДоОтгрузки(ТекСтрока.НакладнаяНаОтгрузку) И НЕ ПроверитьДниДоОгрузки(ДатаНакладной, ТекСтрока.НомерНакладной, ТекСтрока.СтатусНакладной) Тогда
			Возврат;
		КонецЕсли;
		Если ТекСтрока.СтатусНакладной = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыНакладнойНаОтгрузку.СумкаЗакрыта") Тогда  
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("НакладнаяНаОтгрузку", ТекСтрока.НакладнаяНаОтгрузку);
			ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораОтгрузка",ЭтаФорма); 
			ОткрытьФорму("ОбщаяФорма.ЛБ_ОтгрузкаПоНакладной", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе	    
			Если СменаСтатусаНаСервере(ТекСтрока.НакладнаяНаОтгрузку) Тогда  
				Элементы.НакладныеНаОтгрузку.Обновить(); 
				ЗаполнитьТаблицуИзделий(ТекСтрока.НакладнаяНаОтгрузку);
				ИнформацияНакладные();  
			Иначе
				Сообщить("Ошибка проведения документа изменения статуса накладной. Обратитесь к разработчикам.", статусСообщения.Важное);
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры   

&НаКлиенте
Процедура ПослеВыбораОтгрузка(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;  	

	Если СменаСтатусаНаСервере(Результат.НакладнаяНаОтгрузку, Результат.ДатаОтгрузки, Результат.Инкассатор, Результат.Получатель, Результат.СкладПолучатель) Тогда 
		Элементы.НакладныеНаОтгрузку.Обновить(); 
		ЗаполнитьТаблицуИзделий(Результат.НакладнаяНаОтгрузку);
		ИнформацияНакладные();  
	Иначе
		Сообщить("Ошибка проведения документа изменения статуса накладной. Обратитесь к разработчикам.", статусСообщения.Важное);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ОтменаСтатусаНаСервере(НакладнаяНаОтгрузку)
	НовыйДок = Документы.ЛБ_ИзменениеСтатусаНакладной.СоздатьДокумент();
	НовыйДок.Дата = ТекущаяДатаСеанса(); 
	НовыйДок.НакладнаяНаОтгрузку = НакладнаяНаОтгрузку;
	НовыйДок.ВидОперации = Перечисления.ЛБ_ВидыОперацийИзменениеСтатусаНакладнойНаОтгрузку.ОтменаСтатуса;  
	НовыйДок.Ответственный = Ответственный; 
	НовыйДок.ОтветственныйСотрудник = ПараметрыСеанса.ТекущийСотрудник;

	НовыйДок.Записать(РежимЗаписиДокумента.Запись);
	
	Попытка 
		НовыйДок.Записать(РежимЗаписиДокумента.Проведение); 
		Возврат Истина;
	Исключение   
		ОбщегоНазначения.СообщитьПользователю("Не удалось провести документ " + строка(НовыйДок.Ссылка) + ". Обратитесь к разработчикам.");
		Возврат Ложь;
	КонецПопытки;	
КонецФункции

&НаКлиенте
Процедура ОтменаСтатуса(Команда)
	ТекСтрока = Элементы.НакладныеНаОтгрузку.ТекущиеДанные;  
	Если ТекСтрока = неопределено Тогда
		Возврат;
	КонецЕсли;	     
	ДатаНакладной = ПолучитьДатуНакладной(Текстрока.НакладнаяНаОтгрузку);
	Если ТекСтрока.Пустой Тогда 
		Предупреждение("Внимание! Накладная № " + сокрЛП(Текстрока.НомерНакладной) + " от " + Формат(ДатаНакладной, "ДФ=dd.MM.yyyy") + 
		        " не содержит доступных к отгрузке предметов залога. Смена статусов запрещена.", 60);
		Возврат;
	КонецЕсли;	             
	Если ТекСтрока.СтатусНакладной = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыНакладнойНаОтгрузку.Факт") Тогда
		Предупреждение("Накладная № " + сокрЛП(Текстрока.НомерНакладной) + " от " + Формат(ДатаНакладной, "ДФ=dd.MM.yyyy") + " находится в статусе «Факт». Больше нет статусов доступных для отмены.", 60); 
	ИначеЕсли ТекСтрока.СтатусНакладной = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыНакладнойНаОтгрузку.Отгружена") Тогда		
		Предупреждение("Для отмены отгрузки накладной  № " + СокрЛП(ТекСтрока.НомерНакладной) + " от " + Формат(ДатаНакладной, "ДФ=dd.MM.yyyy") + " необходимо обратиться в ЦО.", 60); 
	Иначе      
		Строкасписка = СписокСтатусовНакладных.НайтиПоЗначению(ТекСтрока.СтатусНакладной); 
	    Инд = Строкасписка.ПолучитьИдентификатор();                              
		СтрокаПоиска = СписокСтатусовНакладных.НайтиПоИдентификатору(Инд-1);   
		Если СтрокаПоиска = неопределено Тогда
			Возврат;
		КонецЕсли;	
		НовыйСтатус = СтрокаПоиска.Значение; 

		СтрокаВопроса = "Внимание! Накладная № " + СокрЛП(ТекСтрока.НомерНакладной) + " от " + Формат(ДатаНакладной, "ДФ=dd.MM.yyyy") + " переводится в статус «" + Строка(НовыйСтатус) + "». Продолжаем?";
        Режим = РежимДиалогаВопрос.ДаНет;
        Ответ = Вопрос(СтрокаВопроса, Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			 Возврат;
		КонецЕсли;			

		Если ОтменаСтатусаНаСервере(ТекСтрока.НакладнаяНаОтгрузку) Тогда 
			Элементы.НакладныеНаОтгрузку.Обновить(); 
			ЗаполнитьТаблицуИзделий(ТекСтрока.НакладнаяНаОтгрузку);
			ИнформацияНакладные();  
		Иначе
			Сообщить("Ошибка проведения документа изменения статуса накладной. Обратитесь к разработчикам.", статусСообщения.Важное);
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИсторияСменыСтатусов(Команда) 
	ТекСтрока = Элементы.НакладныеНаОтгрузку.ТекущиеДанные;  
	Если ТекСтрока = неопределено Тогда
		Возврат;
	КонецЕсли;	
    ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НакладнаяНаОтгрузку", ТекСтрока.НакладнаяНаОтгрузку); 	
	ОткрытьФорму("ОбщаяФорма.ЛБ_ИсторияНакладной", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ИнформацияНакладные()
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Дата1", ?(ДатаНач = Дата(1,1,1), ДатаНач, НачалоДня(ДатаНач))); 
	Запрос.УстановитьПараметр("Дата2", ?(ДатаКон = Дата(1,1,1), ТекущаяДатаСеанса(), КонецДня(ДатаКон)));  
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Ломбард", Ломбард);            
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус КАК Статус,
	               |	СУММА(1) КАК Количество,
	               |	СУММА(ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес) КАК Вес,
	               |	СУММА(ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМакс) КАК Сумма
	               |ИЗ
	               |	РегистрСведений.ЛБ_СтатусыОбъектовЗалогаВНакладной.СрезПоследних(&Дата2, ) КАК ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(&Дата2, ) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	               |		ПО ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ЗалоговыйБилет = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет
	               |			И ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ОбъектЗалога = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога
	               |ГДЕ
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.НакладнаяНаОтгрузку.Дата МЕЖДУ &Дата1 И &Дата2
	               |	И ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.НакладнаяНаОтгрузку.Организация = &Организация
	               |	И ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.НакладнаяНаОтгрузку.Ломбард = &Ломбард
	               |	И НЕ ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.ИсключенИзНакладной)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	Если ТаблицаЗапроса.Количество() = 0 Тогда 
		Элементы.ДекорацияИзделияВНакладных.Заголовок = "";
	Иначе	                                               
		ИнформацияН = "Всего включено в накладные изделий " + Строка(ТаблицаЗапроса.Итог("Количество")) + " весом " + Сокрлп(Формат(ТаблицаЗапроса.Итог("Вес"), "ЧЦ=10; ЧДЦ=3")) + 
		              " г. на сумму оценки " + Сокрлп(Формат(ТаблицаЗапроса.Итог("Сумма"), "ЧЦ=15; ЧДЦ=2")) + " руб. "; 
		
		Отбор = Новый Структура;
		Отбор.Вставить("Статус", Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.Отгружено);
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
		Если строки.Количество() = 0 Тогда  
			ИнформацияН = ИнформацияН + "Отгружено изделий 0.";
		Иначе    
			Стр = Строки.Получить(0);
			ИнформацияН = ИнформацияН + "Отгружено изделий " + Строка(Стр.Количество) + " весом " + Сокрлп(Формат(Стр.Вес, "ЧЦ=10; ЧДЦ=3")) + 
		              " г. на сумму оценки " + Сокрлп(Формат(Стр.Сумма, "ЧЦ=15; ЧДЦ=2")) + " руб. ";
		КонецЕсли;	 
		Элементы.ДекорацияИзделияВНакладных.Заголовок = ИнформацияН; 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуИзделий(Накладная)
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Дата", ?(ДатаКон = Дата(1,1,1), ТекущаяДатаСеанса(), КонецДня(ДатаКон)));  
	Запрос.УстановитьПараметр("Накладная", Накладная);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.НакладнаяНаОтгрузку.ПредставлениеНомераНакладной КАК НомерНакладной,
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус КАК Статус,
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
	               |	1 КАК Количество,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК ВесИзделия,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесМеталла,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценки,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОписаниеИзделия КАК ОписаниеИзделия,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМакс КАК СуммаОценкиМакс,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиКамни КАК СуммаОценкиВставки,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаСсуды КАК СуммаСсуды,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вставки КАК Вставки
	               |ИЗ
	               |	РегистрСведений.ЛБ_СтатусыОбъектовЗалогаВНакладной.СрезПоследних(&Дата, НакладнаяНаОтгрузку = &Накладная) КАК ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	               |		ПО ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ЗалоговыйБилет = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет
	               |			И ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ОбъектЗалога = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога";  
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	ТаблицаОбъектовЗалога.Загрузить(ТаблицаЗапроса);
	ТаблицаЗБ = ТаблицаОбъектовЗалога.Выгрузить();
	ТаблицаЗБ.Свернуть("ЗалоговыйБилет");       
	МассивЗБ = ТаблицаЗБ.ВыгрузитьКолонку("ЗалоговыйБилет");
	
	Запрос.УстановитьПараметр("ЗБ", МассивЗБ);  
	Запрос.УстановитьПараметр("ДатаОплатыПустая", Дата(1,1,1)); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_СостояниеЗалоговогоБилета.ДатаОплатыБезПродления КАК ДатаОплаты,
	               |	ЛБ_СостояниеЗалоговогоБилета.Период КАК Период
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета КАК ЛБ_СостояниеЗалоговогоБилета
	               |ГДЕ
	               |	ЛБ_СостояниеЗалоговогоБилета.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
	               |	И ЛБ_СостояниеЗалоговогоБилета.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов)
	               |	И ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет В(&ЗБ)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ";
	ТаблицаОплатБезПродления  = Запрос.Выполнить().Выгрузить(); 
	Для каждого ЗБ Из МассивЗБ Цикл  
		Отбор = Новый структура;
		Отбор.Вставить("ЗалоговыйБилет", ЗБ);
        СтрокиО = ТаблицаОплатБезПродления.НайтиСтроки(Отбор);
		Если СтрокиО.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрО = СтрокиО.Получить(0);
		Если СтрО.ДатаОплаты = Дата(1,1,1) Тогда
			Продолжить;
		КонецЕсли;	
		Строки = ТаблицаОбъектовЗалога.НайтиСтроки(Отбор);  
		Для каждого Стр Из строки Цикл 
			Стр.ДатаОплаты = СтрО.ДатаОплаты;
		КонецЦикла;	
	КонецЦикла;	
		
	//Для каждого Стр Из ТаблицаЗапроса Цикл
	//	Если стр.Статус = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.ИсключенИзНакладной Тогда
	//		стр.Количество = 0;
	//		стр.ВесИзделия = 0; 
	//		стр.ВесМеталла = 0;
	//		стр.СуммаОценки = 0;
	//		стр.СуммаОценкиМакс = 0;
	//		стр.СуммаОценкиМеталлы = 0;
	//		стр.СуммаОценкиВставки = 0;
	//		стр.СуммаСсуды = 0;
	//	КонецЕсли;	
	//КонецЦикла;	
	
	ИтогКоличество = ТаблицаЗапроса.Итог("Количество");
	ИтогВесИзделия = ТаблицаЗапроса.Итог("ВесИзделия"); 
	ИтогВесМеталла = ТаблицаЗапроса.Итог("ВесМеталла");
	ИтогСуммаОценки = ТаблицаЗапроса.Итог("СуммаОценки");
	ИтогСуммаОценкиМакс = ТаблицаЗапроса.Итог("СуммаОценкиМакс");
	ИтогСуммаОценкиМеталлы = ТаблицаЗапроса.Итог("СуммаОценкиМеталлы");
	ИтогСуммаОценкиВставки = ТаблицаЗапроса.Итог("СуммаОценкиВставки");
	ИтогСуммаСсуды = ТаблицаЗапроса.Итог("СуммаСсуды");
		
КонецПроцедуры	
	
&НаКлиенте
Процедура НакладныеНаОтгрузкуПриАктивизацииСтроки(Элемент)
	ТекСтрока = Элементы.НакладныеНаОтгрузку.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда  
		ЗаполнитьТаблицуИзделий(ТекСтрока.НакладнаяНаОтгрузку);
	Иначе
		ТаблицаОбъектовЗалога.Очистить();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)   
	ЭлементыПользовательскихНастроек = НакладныеНаОтгрузку.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
    Для Каждого НастройкаСписка Из ЭлементыПользовательскихНастроек Цикл

        Если ТипЗнч(НастройкаСписка) = ТипЗнч(НакладныеНаОтгрузку.КомпоновщикНастроек.Настройки.Порядок) Тогда

            НастройкаСписка.Элементы.Очистить();
            // Первая сортировка - по дате документа
            УсловиеСортировкиДС = НастройкаСписка.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
            УсловиеСортировкиДС.Поле = Новый ПолеКомпоновкиДанных("ДатаНакладной");
            УсловиеСортировкиДС.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв;
            УсловиеСортировкиДС.Использование = Истина;
            // Вторая сортировка - по номеру документа
			//УсловиеСортировкиДС = НастройкаСписка.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
			//УсловиеСортировкиДС.Поле = Новый ПолеКомпоновкиДанных("НомерНакладной");
			//УсловиеСортировкиДС.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв;
			//УсловиеСортировкиДС.Использование = Истина;
         КонецЕсли;
	КонецЦикла;
	
	ТекСтрока = Элементы.НакладныеНаОтгрузку.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда  
		ЗаполнитьТаблицуИзделий(ТекСтрока.НакладнаяНаОтгрузку);
	Иначе
		ТаблицаОбъектовЗалога.Очистить();	
	КонецЕсли;	 
	ИнформацияНакладные(); 
	Если НЕ СотрудникЦО Тогда
		Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьДатуСеанса()
	Возврат ТекущаяДатаСеанса();
КонецФункции

&НаКлиенте
Процедура УстановитьИнтервал(Команда)
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
    Диалог.Период = Новый СтандартныйПериод(ДатаНач, ПолучитьДатуСеанса());
	Оповещение = Новый ОписаниеОповещения("ВыборПериодаЗавершение", ЭтаФорма);
	Диалог.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериодаЗавершение(Период, ДополнительныеПараметры) Экспорт 
	Если Период = неопределено Тогда
		Возврат;
	КонецЕсли;	
	ДатаНач = Период.ДатаНачала;
    ДатаКон = Период.ДатаОкончания;
	Если НЕ ДатаКон = Дата(1,1,1) И НЕ ДатаНач = Дата(1,1,1) Тогда
		Если  ДатаКон < ДатаНач Тогда
			Предупреждение("Конечная дата выбранного периода не может быть больше начальной даты периода.", 60);
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	НакладныеНаОтгрузку.Параметры.УстановитьЗначениеПараметра("Дата1", ?(ДатаНач = Дата(1,1,1), ДатаНач, НачалоДня(ДатаНач)));
	НакладныеНаОтгрузку.Параметры.УстановитьЗначениеПараметра("Дата2", ?(ДатаКон = Дата(1,1,1), ПолучитьДатуСеанса(), КонецДня(ДатаКон)));
	Элементы.НакладныеНаОтгрузку.Обновить(); 
	ТекСтрока = Элементы.НакладныеНаОтгрузку.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда  
		ЗаполнитьТаблицуИзделий(ТекСтрока.НакладнаяНаОтгрузку);
	Иначе
		ТаблицаОбъектовЗалога.Очистить();	
	КонецЕсли;	 
	ИнформацияНакладные();
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачПриИзменении(Элемент)
	НакладныеНаОтгрузку.Параметры.УстановитьЗначениеПараметра("Дата1", ?(ДатаНач = Дата(1,1,1), ДатаНач, НачалоДня(ДатаНач)));
	Элементы.НакладныеНаОтгрузку.Обновить(); 
	ТекСтрока = Элементы.НакладныеНаОтгрузку.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда  
		ЗаполнитьТаблицуИзделий(ТекСтрока.НакладнаяНаОтгрузку);  
	Иначе
		ТаблицаОбъектовЗалога.Очистить();	
	КонецЕсли;	 
	ИнформацияНакладные();
КонецПроцедуры

&НаКлиенте
Процедура ДатаКонПриИзменении(Элемент)
	НакладныеНаОтгрузку.Параметры.УстановитьЗначениеПараметра("Дата2", ?(ДатаКон = Дата(1,1,1), ПолучитьДатуСеанса(), КонецДня(ДатаКон)));
	Элементы.НакладныеНаОтгрузку.Обновить(); 
	ТекСтрока = Элементы.НакладныеНаОтгрузку.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда  
		ЗаполнитьТаблицуИзделий(ТекСтрока.НакладнаяНаОтгрузку);
	Иначе
		ТаблицаОбъектовЗалога.Очистить();	
	КонецЕсли;	 
	ИнформацияНакладные();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	НакладныеНаОтгрузку.Параметры.УстановитьЗначениеПараметра("Организация", Организация); 
	ДатаНач = ПолучитьДатуНачалаВЛомбарде(); 
	НакладныеНаОтгрузку.Параметры.УстановитьЗначениеПараметра("Дата1", ?(ДатаНач = Дата(1,1,1), ДатаНач, НачалоДня(ДатаНач)));
	Элементы.НакладныеНаОтгрузку.Обновить(); 
	ТекСтрока = Элементы.НакладныеНаОтгрузку.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда  
		ЗаполнитьТаблицуИзделий(ТекСтрока.НакладнаяНаОтгрузку);
	Иначе
		ТаблицаОбъектовЗалога.Очистить();	
	КонецЕсли;	 
	ИнформацияНакладные();  
КонецПроцедуры

&НаКлиенте
Процедура ЛомбардПриИзменении(Элемент)
	НакладныеНаОтгрузку.Параметры.УстановитьЗначениеПараметра("Ломбард", Ломбард); 
	ДатаНач = ПолучитьДатуНачалаВЛомбарде(); 
	НакладныеНаОтгрузку.Параметры.УстановитьЗначениеПараметра("Дата1", ?(ДатаНач = Дата(1,1,1), ДатаНач, НачалоДня(ДатаНач)));
	Элементы.НакладныеНаОтгрузку.Обновить(); 
	ТекСтрока = Элементы.НакладныеНаОтгрузку.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда  
		ЗаполнитьТаблицуИзделий(ТекСтрока.НакладнаяНаОтгрузку); 
	Иначе
		ТаблицаОбъектовЗалога.Очистить();	
	КонецЕсли;	 
	ИнформацияНакладные();
КонецПроцедуры

&НаКлиенте
Процедура НайтиПоНомеруЗБ(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЭтоКасса", Истина);   
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЗБ",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателяПоНомеруБилета", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры  

&НаСервере
Функция НайтиНакладнуюНаОтгрузку(ЗалоговыйБилет)
	Запрос = Новый Запрос;    
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладной.Период КАК Период,
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладной.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку
	               |ИЗ
	               |	РегистрСведений.ЛБ_СтатусыОбъектовЗалогаВНакладной КАК ЛБ_СтатусыОбъектовЗалогаВНакладной
	               |ГДЕ
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладной.ЗалоговыйБилет = &ЗалоговыйБилет
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 	
		СтруктураВ = Новый Структура;  
		СтруктураВ.Вставить("НакладнаяНаОтгрузку", Выборка.НакладнаяНаОтгрузку); 
		СтруктураВ.Вставить("ДатаНакладной", Выборка.НакладнаяНаОтгрузку.Дата);
		Возврат СтруктураВ; 		
	КонецЕсли;	
    Возврат неопределено;
КонецФункции

&НаКлиенте
Процедура ПослеВыбораЗБ(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;  
	
	ЗалоговыйБилет = Результат.ЗалоговыйБилет; 
	Результат = НайтиНакладнуюНаОтгрузку(ЗалоговыйБилет);
	Если НЕ Результат = неопределено Тогда 
		Накладная = Результат.НакладнаяНаОтгрузку; 
		ДатаНакладной = Результат.ДатаНакладной; 
		Дата1 = ?(ДатаНач = Дата(1,1,1), ДатаНач, НачалоДня(ДатаНач));  
		Дата2 = ?(ДатаКон = Дата(1,1,1), ПолучитьДатуСеанса(), КонецДня(ДатаКон));
		Если ДатаНакладной < Дата1 ИЛИ ДатаНакладной > Дата2 Тогда 
			Если ДатаНакладной < Дата1 Тогда
				ДатаНач = ДатаНакладной;
				НакладныеНаОтгрузку.Параметры.УстановитьЗначениеПараметра("Дата1", ДатаНач);
	            Элементы.НакладныеНаОтгрузку.Обновить();
			ИначеЕсли ДатаНакладной > Дата2 Тогда
				ДатаКон = ДатаНакладной;
				НакладныеНаОтгрузку.Параметры.УстановитьЗначениеПараметра("Дата2", ДатаКон);
	            Элементы.НакладныеНаОтгрузку.Обновить();
			КонецЕсли;	
		КонецЕсли;	
		Элементы.НакладныеНаОтгрузку.ТекущаяСтрока = Накладная; 
		ТекСтрока = Элементы.НакладныеНаОтгрузку.ТекущиеДанные;
		Если НЕ ТекСтрока = неопределено Тогда  
			ЗаполнитьТаблицуИзделий(ТекСтрока.НакладнаяНаОтгрузку);
		Иначе
		    ТаблицаОбъектовЗалога.Очистить();	
		КонецЕсли;	 
		ИнформацияНакладные();
	Иначе  
		Предупреждение("Выбранный залоговый билет в накладных ломбарда не найден.", 60);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура НакладныеНаОтгрузкуВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтрока = Элементы.НакладныеНаОтгрузку.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда  
		ПараметрыФормы = Новый Структура;
	    ПараметрыФормы.Вставить("Ключ", ТекСтрока.НакладнаяНаОтгрузку); 
		ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
		
	    ОткрытьФорму("Документ.ЛБ_НакладнаяНаОтгрузку.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	Элементы.НакладныеНаОтгрузку.Обновить(); 
	ТекСтрока = Элементы.НакладныеНаОтгрузку.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда  
		ЗаполнитьТаблицуИзделий(ТекСтрока.НакладнаяНаОтгрузку); 
	Иначе
		ТаблицаОбъектовЗалога.Очистить();	
	КонецЕсли;	 
	ИнформацияНакладные();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервалКорр(Команда)
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
    Диалог.Период = Новый СтандартныйПериод(ДатаКоррНач, ПолучитьДатуСеанса());
	Оповещение = Новый ОписаниеОповещения("ВыборПериодаКоррЗавершение", ЭтаФорма);
	Диалог.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериодаКоррЗавершение(Период, ДополнительныеПараметры) Экспорт 
	Если Период = неопределено Тогда
		Возврат;
	КонецЕсли;	
	ДатаКоррНач = Период.ДатаНачала;
    ДатаКоррКон = Период.ДатаОкончания;
	Если НЕ ДатаКоррКон = Дата(1,1,1) И НЕ ДатаКоррНач = Дата(1,1,1) Тогда
		Если  ДатаКоррКон < ДатаКоррНач Тогда
			Предупреждение("Конечная дата выбранного периода не может быть больше начальной даты периода.", 60);
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	ЗаполнитьТаблицуКорректировок();
КонецПроцедуры


&НаКлиенте
Процедура ДатаКоррНачПриИзменении(Элемент)
	ЗаполнитьТаблицуКорректировок();
КонецПроцедуры

&НаКлиенте
Процедура ДатаКоррКонПриИзменении(Элемент)
	ЗаполнитьТаблицуКорректировок();
КонецПроцедуры

&НаКлиенте
Процедура ВключитьЗБВНакладную(Команда)
	ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Организация", Организация); 
	ПараметрыФормы.Вставить("Ломбард", Ломбард);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораВключитьЗБВНакладную",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаСозданияНакладнойНаОтгрузку", ПараметрыФормы ,,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВыбораВключитьЗБВНакладную(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;                      
	
    ВключитьЗБВНакладнуюНаСервере(Результат);
	ЗаполнитьТаблицуКорректировок();     
	//СтрокаТЗ = КорректировкиНакладных.Получить(КорректировкиНакладных.Количество()-1);
	//ИдентификаторСтроки = СтрокаТЗ.ПолучитьИдентификатор();
	//Элементы.КорректировкиНакладных.ТекущаяСтрока = ИдентификаторСтроки;
КонецПроцедуры    

&НаСервере
Процедура ВключитьЗБВНакладнуюНаСервере(РезультатВыбора)
	СписокЗБ = РезультатВыбора.СписокЗБ;
	ВыбранныйЛомбард = РезультатВыбора.Ломбард;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса()); 
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_НастройкиСозданияНакладныхНаОтгрузкуСрезПоследних.ЕстьОграничениеОценки КАК ЕстьОграничениеОценки,
	               |	ЛБ_НастройкиСозданияНакладныхНаОтгрузкуСрезПоследних.СуммаОценки КАК СуммаОценки
	               |ИЗ
	               |	РегистрСведений.ЛБ_НастройкиСозданияНакладныхНаОтгрузку.СрезПоследних(&Дата, Организация = &Организация) КАК ЛБ_НастройкиСозданияНакладныхНаОтгрузкуСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();  
	Если Выборка.Следующий() тогда
		ЕстьОграничениеОценки = Выборка.ЕстьОграничениеОценки;
		СуммаОценкиДляОтбора = Выборка.СуммаОценки;  
	КонецЕсли;	 
	
	СтатусыОЗ = новый СписокЗначений; 
	СтатусыОЗ.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.Возвращен); 
	СтатусыОЗ.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.Принят);
    СтатусыОЗ.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.Продлен);
	СтатусыОЗ.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.Наследство);
	СтатусыОЗ.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение);
	
	ЗапросЗБ = Новый Запрос;  
	ЗапросЗБ.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	ЗапросЗБ.УстановитьПараметр("СписокЗБ", СписокЗБ); 
	ЗапросЗБ.УстановитьПараметр("СтатусыОбъектаЗалога", СтатусыОЗ);
	ЗапросЗБ.УстановитьПараметр("Ломбард", ВыбранныйЛомбард);
	ЗапросЗБ.Текст = "ВЫБРАТЬ
	                 |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
	                 |	ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток КАК Количество,
	                 |	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток КАК СуммаОценки,
	                 |	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ОтказОтВыкупа КАК ОтказОтВыкупа,
	                 |	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ЗалоговыйБилет,
	                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
	                 |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК Вес
	                 |ИЗ
	                 |	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(
	                 |			&Дата,
	                 |			ЗалоговыйБилет В (&СписокЗБ)
	                 |				И Ломбард = &Ломбард) КАК ЛБ_ОбъектыЗалогаОстатки
	                 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(&Дата, ) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних
	                 |		ПО ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет = ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ЗалоговыйБилет
	                 |			И ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога
	                 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(&Дата, ) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	                 |		ПО ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет
	                 |			И ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога
	                 |ГДЕ
	                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога В(&СтатусыОбъектаЗалога)";         
	ТаблицаЗапроса = ЗапросЗБ.Выполнить().Выгрузить();
	ТаблицаФормированияНакладных = ТаблицаЗапроса.СкопироватьКолонки("ЗалоговыйБилет, ОтказОтВыкупа, ОбъектЗалога, Количество, Вес, СуммаОценки");
	ТаблицаФормированияНакладных.Колонки.Добавить("ПовышеннаяОценка");
	
	Для каждого Стр из ТаблицаЗапроса Цикл 		
		НоваяСтр = ТаблицаФормированияНакладных.Добавить();  
		НоваяСтр.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
		НоваяСтр.ОтказОтВыкупа = Стр.ОтказОтВыкупа;
		НоваяСтр.ОбъектЗалога = Стр.ОбъектЗалога;
		НоваяСтр.Количество = Стр.Количество;  
		НоваяСтр.Вес = Стр.Вес;
		НоваяСтр.СуммаОценки = Стр.СуммаОценки;
		НоваяСтр.ПовышеннаяОценка = Ложь;
		Если Стр.СуммаОценки > СуммаОценкиДляОтбора тогда  
			НоваяСтр.ПовышеннаяОценка = Истина;
		КонецЕсли;	
	КонецЦикла;

	Отбор = Новый Структура; 
  	
	Отбор.Вставить("ОтказОтВыкупа", Истина);
	Отбор.Вставить("ПовышеннаяОценка", Ложь);
	
	Строки = ТаблицаФормированияНакладных.НайтиСтроки(Отбор); 
	Если НЕ Строки.Количество() = 0  Тогда
		СформироватьНакладную(ВыбранныйЛомбард, Строки, Истина, Ложь);
	КонецЕсли;  
		
	Отбор.Вставить("ПовышеннаяОценка", Истина);
	Строки = ТаблицаФормированияНакладных.НайтиСтроки(Отбор); 
	Если НЕ Строки.Количество() = 0  Тогда
		СформироватьНакладную(ВыбранныйЛомбард, Строки, Истина, Истина);
	КонецЕсли;
		
	Отбор.Вставить("ОтказОтВыкупа", Ложь); 
	Отбор.Вставить("ПовышеннаяОценка", Ложь);
	
	Строки = ТаблицаФормированияНакладных.НайтиСтроки(Отбор); 
	Если НЕ Строки.Количество() = 0  Тогда
		СформироватьНакладную(ВыбранныйЛомбард, Строки, Ложь, Ложь); 
	КонецЕсли;
	
	Отбор.Вставить("ПовышеннаяОценка", Истина);
	
	Строки = ТаблицаФормированияНакладных.НайтиСтроки(Отбор); 
	Если НЕ Строки.Количество() = 0  Тогда  
		СформироватьНакладную(ВыбранныйЛомбард, Строки, Ложь, Истина);  
	КонецЕсли;
	
КонецПроцедуры    

&НаСервере
Процедура СформироватьНакладную(ВыбранныйЛомбард, СтрокиТаблицы, ОтказОтВыкупа, ПовышеннаяОценка)  		
	НовыйДок = Документы.ЛБ_НакладнаяНаОтгрузку.СоздатьДокумент();
	НовыйДок.Дата = ТекущаяДатаСеанса(); 
	НовыйДок.Организация = Организация;
	НовыйДок.Ломбард = ВыбранныйЛомбард;  
	НовыйДок.ВидОперации = Перечисления.ЛБ_ВидыНакладнойНаОтгрузку.Вручную;  
	НовыйДок.ОтказОтВыкупа = ОтказОтВыкупа;
	НовыйДок.ПовышеннаяОценка = ПовышеннаяОценка;
	НовыйДок.Ответственный = Ответственный;
	//НовыйДок.ОтветственныйСотрудник = ПараметрыСеанса.ТекущийСотрудник;
	НовыйДок.Комментарий = "Создание накладной сотрудником ЦО";

	Для каждого Стр Из СтрокиТаблицы Цикл 
		НоваяСтр = НовыйДок.Залоги.Добавить();
		НоваяСтр.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
		НоваяСтр.ОбъектЗалога = Стр.ОбъектЗалога;
		НоваяСтр.Количество = Стр.Количество;
		НоваяСтр.Вес = Стр.Вес;
		НоваяСтр.СуммаОценки = Стр.СуммаОценки;
	КонецЦикла;		
	
	НовыйДок.НомерНакладной = ЛБ_УправлениеЛомбардом.ПолучитьНовыйНомерНакладнойНаОтгрузку(НовыйДок.Дата, НовыйДок.Организация, НовыйДок.Ломбард);   
	НовыйДок.ПредставлениеНомераНакладной = СокрЛП(НовыйДок.Ломбард.НомерЛомбарда) + "/" +  СокрЛП(НовыйДок.НомерНакладной);
	
	НовыйДок.Записать(РежимЗаписиДокумента.Запись);  
	Попытка   
		НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
	Исключение     
		ОбщегоНазначения.СообщитьПользователю("Не удалось провести документ " + строка(НовыйДок.Ссылка) + ". Обратитесь к разработчикам.");
	КонецПопытки;	
КонецПроцедуры	

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница) 
	Если ТекущаяСтраница = Элементы.Страница1 Тогда 
		Элементы.НакладныеНаОтгрузку.Обновить();    
		ТекСтрока = Элементы.НакладныеНаОтгрузку.ТекущиеДанные;
		Если НЕ ТекСтрока = неопределено Тогда  
			ЗаполнитьТаблицуИзделий(ТекСтрока.НакладнаяНаОтгрузку);
		Иначе
			ТаблицаОбъектовЗалога.Очистить();	
		КонецЕсли;	 
		ИнформацияНакладные();    
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ИсключитьЗБИзНакладной(Команда)
	ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Организация", Организация); 
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораИсключитьЗБИзНакладной",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаИсключенияИзНакладнойНаОтгрузку", ПараметрыФормы ,,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВыбораИсключитьЗБИзНакладной(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;                      
	
    ИсключитьЗБИзНакладнойНаСервере(Результат);
	ЗаполнитьТаблицуКорректировок(); 
	//СтрокаТЗ = КорректировкиНакладных.Получить(КорректировкиНакладных.Количество()-1);
	//ИдентификаторСтроки = СтрокаТЗ.ПолучитьИдентификатор();
	//Элементы.КорректировкиНакладных.ТекущаяСтрока = ИдентификаторСтроки;
КонецПроцедуры    

&НаСервере
Процедура ИсключитьЗБИзНакладнойНаСервере(Результат) 
	СписокЗБ = Результат.СписокЗБВключить; 
	СписокЗББлокировать = Результат.СписокБлокировать;   
	СписокДатыБлокировки = Результат.СписокДатыБлокировки;    
	
	НовыйДок = Документы.ЛБ_КорректировкаНакладной.СоздатьДокумент();
	НовыйДок.Дата = ТекущаяДатаСеанса(); 
	НовыйДок.Организация = Организация;  
	НовыйДок.ВидОперации = Перечисления.ЛБ_ВидыКорректировкиНакладной.ИсключениеЗБИзНакладной; 
	НовыйДок.Ответственный = Ответственный; 
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("СписокЗБ", СписокЗБ);  
	Запрос.Текст = 
	//++ООВ 30.04.2026 Заявка 3757 добавлено условие выбора залога (в статусе недостача не должен попадать в корректировку накладной)
	// старый запрос закомментирован ниже
	 				"ВЫБРАТЬ
	 				|	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
	 				|	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	 				|	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет
	 				|ИЗ
	 				|	РегистрСведений.ЛБ_СтатусыОбъектовЗалогаВНакладной.СрезПоследних(, ЗалоговыйБилет В (&СписокЗБ)) КАК ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних
	 				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(, ЗалоговыйБилет В (&СписокЗБ)) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних
	 				|		ПО ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ОбъектЗалога = ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога
	 				|ГДЕ
	 				|	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога <> ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Недостача)
	 				|
	 				|УПОРЯДОЧИТЬ ПО
	 				|	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Период УБЫВ";
	//--ООВ 30.04.2026 Заявка 3757
	
	//"ВЫБРАТЬ
	//               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Период КАК Период,
	//               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
	//               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	//               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет
	//               |ИЗ
	//               |	РегистрСведений.ЛБ_СтатусыОбъектовЗалогаВНакладной.СрезПоследних(, ЗалоговыйБилет В (&СписокЗБ)) КАК ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних
	//               |
	//               |УПОРЯДОЧИТЬ ПО
	//               |	Период УБЫВ";
	ТаблицаН = Запрос.Выполнить().Выгрузить();

	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	               |	1 КАК Количество,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК Вес,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМакс КАК СуммаОценки
	               |ИЗ
	               |	РегистрСведений.ЛБ_СтатусыОбъектовЗалогаВНакладной.СрезПоследних(
	               |			,
	               |			ЗалоговыйБилет В (&СписокЗБ)
	               |				И Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.Факт)) КАК ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	               |		ПО ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ЗалоговыйБилет = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет
	               |			И ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ОбъектЗалога = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога";  
	Выборка = Запрос.Выполнить().выбрать();
	Пока Выборка.Следующий() Цикл  
		ОтборН = Новый Структура;
		ОтборН.Вставить("ЗалоговыйБилет", Выборка.ЗалоговыйБилет);
		ОтборН.Вставить("ОбъектЗалога", Выборка.ОбъектЗалога);
		СтрокиН = ТаблицаН.НайтиСтроки(ОтборН);
		Если НЕ СтрокиН.Количество() = 0 Тогда
			СтрН = строкиН.Получить(0);
			Если НЕ Выборка.НакладнаяНаОтгрузку = СтрН.НакладнаяНаОтгрузку Тогда 
			    Продолжить;
			КонецЕсли;
		Иначе
			Продолжить;
		КонецЕсли;	

		НоваяСтр = НовыйДок.ЗалоговыеБилеты.Добавить(); 
		НоваяСтр.НакладнаяНаОтгрузку = Выборка.НакладнаяНаОтгрузку;
		НоваяСтр.ЗалоговыйБилет = Выборка.ЗалоговыйБилет;
		НоваяСтр.Ломбард = Выборка.ЗалоговыйБилет.Ломбард;
		НоваяСтр.ОбъектЗалога = Выборка.ОбъектЗалога;
		НоваяСтр.Количество = Выборка.Количество;
		НоваяСтр.Вес = Выборка.Вес; 
		НоваяСтр.СуммаОценки = Выборка.СуммаОценки;     
		
		ЭлБлокировать = СписокЗББлокировать.НайтиПоЗначению(НоваяСтр.ЗалоговыйБилет);
		Если НЕ ЭлБлокировать = неопределено Тогда
			НоваяСтр.Заблокировать = Истина;   
			ЭлДатаБлокировать = СписокДатыБлокировки.НайтиПоИдентификатору(ЭлБлокировать.ПолучитьИдентификатор());
			Если НЕ ЭлДатаБлокировать = неопределено Тогда
				НоваяСтр.ДатаБлокировки = ЭлДатаБлокировать.Значение;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	    
	 
	НовыйДок.Записать(РежимЗаписиДокумента.Запись);  
	Попытка   
		НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
	Исключение   
		ОбщегоНазначения.СообщитьПользователю("Не удалось провести документ " + строка(НовыйДок.Ссылка) + ". Обратитесь к разработчикам.");
	КонецПопытки;	 
КонецПроцедуры	

&НаСервере
Процедура УдалитьКорректировкуНаСервере(Идентификатор)
	Стр = КорректировкиНакладных.НайтиПоИдентификатору(Идентификатор);
	Если НЕ Стр = неопределено Тогда
		ДокОбъект = Стр.Ссылка.ПолучитьОбъект();
		Если НЕ ДокОбъект.ПометкаУдаления Тогда
		    ДокОбъект.УстановитьПометкуУдаления(Истина);  
			
			Если ДокОбъект.ВидОперации = Перечисления.ЛБ_ВидыКорректировкиНакладной.ОтменаОтгрузкиНакладных Тогда  
				//зафиксируем удаление отмены отгрузки в документе изменение статуса (отгрузка)
				ЗапросН = Новый Запрос;   
				ЗапросН.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
				ЗапросН.Текст ="ВЫБРАТЬ
				               |	ЛБ_ОтгруженныеНакладныеСрезПоследних.Регистратор КАК Регистратор
				               |ИЗ
				               |	РегистрСведений.ЛБ_ОтгруженныеНакладные.СрезПоследних(&Дата, НакладнаяНаОтгрузку = &Накладная) КАК ЛБ_ОтгруженныеНакладныеСрезПоследних"; 
				ТаблицаН = ДокОбъект.ЗалоговыеБилеты.Выгрузить(); 
				ТаблицаН.Свернуть("НакладнаяНаОтгрузку");
				Для каждого СтрН Из ТаблицаН Цикл    
					 ЗапросН.УстановитьПараметр("Накладная", СтрН.НакладнаяНаОтгрузку); 
					 ВыборкаН  = ЗапросН.Выполнить().Выбрать();
					 Если ВыборкаН.Следующий() Тогда  
						 ДокОтгрузка = ВыборкаН.Регистратор.ПолучитьОбъект(); 
						 ДокОтгрузка.ОтгрузкаОтменена = Ложь;
						 ДокОтгрузка.Записать(РежимЗаписиДокумента.Проведение);
					 КонецЕсли;	 
				КонецЦикла;	
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьКорректировку(Команда)
	ТекСтрока = Элементы.КорректировкиНакладных.ТекущиеДанные;  
	Если НЕ ТекСтрока = неопределено Тогда  
		Если ТекСтрока.СостояниеДокумента = 2 Тогда
			Предупреждение("Документ уже помечен на удаление.", 60);
		Иначе
			Режим = РежимДиалогаВопрос.ДаНет;
			Ответ = Вопрос("Пометить документ на удаление?", Режим, 0);
			Если Ответ = КодВозвратаДиалога.Нет Тогда
			    Возврат;
			КонецЕсли;		
	        УдалитьКорректировкуНаСервере(ТекСтрока.ПолучитьИдентификатор());
			ТекСтрока.СостояниеДокумента = 2; 
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ТипКорректировки(Идентификатор)
	Стр = КорректировкиНакладных.НайтиПоИдентификатору(Идентификатор);
    Если НЕ Стр = неопределено Тогда
		Если ТипЗнч(Стр.Ссылка) = Тип("ДокументСсылка.ЛБ_НакладнаяНаОтгрузку") Тогда
			Возврат 1; 
		ИначеЕсли ТипЗнч(Стр.Ссылка) = Тип("ДокументСсылка.ЛБ_КорректировкаНакладной") Тогда
			Возврат 2;
	    КонецЕсли;
	КонецЕсли;
	Возврат 0;
КонецФункции

&НаСервере
Функция ПолучитьИмяФормыКорректировки(Ссылка)  
	Возврат ЛБ_ОбщийМодуль.ПолучитьИмяФормыКорректировкиНакладных(Ссылка);
КонецФункции	
	
&НаКлиенте
Процедура КорректировкиНакладныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтрока = Элементы.КорректировкиНакладных.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда 
		ПараметрыФормы = Новый Структура;
	    ПараметрыФормы.Вставить("Ключ", ТекСтрока.Ссылка); 
		ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);  
		
		Если ТипКорректировки(ТекСтрока.ПолучитьИдентификатор()) = 1 Тогда  
			ОткрытьФорму("Документ.ЛБ_НакладнаяНаОтгрузку.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		ИначеЕсли ТипКорректировки(ТекСтрока.ПолучитьИдентификатор()) = 2 Тогда     
			ИмяФормыК = ПолучитьИмяФормыКорректировки(ТекСтрока.Ссылка); 
			Если ИмяФормыК = неопределено Тогда
	            ОткрытьФорму("Документ.ЛБ_КорректировкаНакладной.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
			Иначе
				ПараметрыФормыДоп = Новый Структура; 
				ПараметрыФормыДоп.Вставить("Документ", ТекСтрока.Ссылка);  
				ОткрытьФорму("ОбщаяФорма." + ИмяФормыК, ПараметрыФормыДоп, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗБ(Идентификатор) 
	Стр = ТаблицаОбъектовЗалога.НайтиПоИдентификатору(Идентификатор); 
	СтруктураВ = Новый Структура;
	СтруктураВ.Вставить("ЗБ", Стр.ЗалоговыйБилет);
	СтруктураВ.Вставить("Залогодатель", Стр.ЗалоговыйБилет.Залогодатель);
	Возврат СтруктураВ;
КонецФункции	

&НаКлиенте
Процедура ИсторияЗалоговогоБилета(Команда)
	ТекСтрока = Элементы.ТаблицаОбъектовЗалога.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда
		Результат = ПолучитьЗБ(ТекСтрока.ПолучитьИдентификатор());
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Клиент", Результат.Залогодатель);
		ПараметрыФормы.Вставить("ЗалоговыйБилет", Результат.ЗБ);	 
								
		ОткрытьФорму("Отчет.ЛБ_ИсторияЗалоговогоБилета.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаблокироватьЗБ(Команда)
	ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Организация", Организация); 
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЗаблокироватьЗБ",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаБлокировкиЗалоговыхБилетов", ПараметрыФормы ,,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры   

&НаКлиенте
Процедура ПослеВыбораЗаблокироватьЗБ(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;                      
	
	ЗаблокироватьЗБНаСервере(Результат);
	ЗаполнитьТаблицуКорректировок(); 
	//СтрокаТЗ = КорректировкиНакладных.Получить(КорректировкиНакладных.Количество()-1);
	//ИдентификаторСтроки = СтрокаТЗ.ПолучитьИдентификатор();
	//Элементы.КорректировкиНакладных.ТекущаяСтрока = ИдентификаторСтроки;
КонецПроцедуры    

&НаСервере
Процедура ЗаблокироватьЗБНаСервере(Результат) 
	СписокЗББлокировать = Результат.СписокБлокировать;   
	СписокДатыБлокировки = Результат.СписокДатыБлокировки;  
	СписокОснованияБлокировки = Результат.СписокОснованияБлокировки;
	
	Если НЕ СписокЗББлокировать.Количество() = 0 Тогда
		Запрос = Новый Запрос; 
		Запрос.УстановитьПараметр("СписокЗБ", СписокЗББлокировать);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
		               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
		               |	1 КАК Количество,
		               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК Вес,
		               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМакс КАК СуммаОценки
		               |ИЗ
		               |	РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(, ) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
		               |		ПО (ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет = ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ЗалоговыйБилет)
		               |			И (ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога = ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога)";
		ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
		
		НовыйДок = Документы.ЛБ_КорректировкаНакладной.СоздатьДокумент();
		НовыйДок.Дата = ТекущаяДатаСеанса(); 
		НовыйДок.Организация = Организация;  
		НовыйДок.ВидОперации = Перечисления.ЛБ_ВидыКорректировкиНакладной.БлокировкаВключенияЗБВНакладные; 
		НовыйДок.Ответственный = Ответственный; 

		Для каждого Эл Из СписокЗББлокировать Цикл
			ЗБ = Эл.Значение;
			Отбор = Новый Структура;
			Отбор.Вставить("ЗалоговыйБилет", ЗБ);
			Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
			
			Для каждого Выборка Из Строки цикл
				НоваяСтр = НовыйДок.ЗалоговыеБилеты.Добавить(); 
				НоваяСтр.ЗалоговыйБилет = ЗБ;
				НоваяСтр.Ломбард = ЗБ.Ломбард;
				НоваяСтр.ОбъектЗалога = Выборка.ОбъектЗалога;
				НоваяСтр.Количество = Выборка.Количество;
				НоваяСтр.Вес = Выборка.Вес; 
				НоваяСтр.СуммаОценки = Выборка.СуммаОценки;     
				НоваяСтр.Заблокировать = Истина; 
				ЭлБлокировать = СписокЗББлокировать.НайтиПоЗначению(НоваяСтр.ЗалоговыйБилет);
				ЭлДатаБлокировать = СписокДатыБлокировки.НайтиПоИдентификатору(ЭлБлокировать.ПолучитьИдентификатор());
				Если НЕ ЭлДатаБлокировать = неопределено Тогда
					НоваяСтр.ДатаБлокировки = ЭлДатаБлокировать.Значение;
				КонецЕсли;
				ЭлОснованиеБлокировать = СписокОснованияБлокировки.НайтиПоИдентификатору(ЭлБлокировать.ПолучитьИдентификатор());
				Если НЕ ЭлОснованиеБлокировать = неопределено Тогда   
					Основание = ЭлОснованиеБлокировать.Значение;
					НоваяСтр.ОснованиеБлокировки = ?(Основание = "без основания", "", Основание);
				КонецЕсли;	
			КонецЦикла;
		КонецЦикла;	  
	КонецЕсли;	
	
	СписокЗБОтменитьБлокировку = Результат.СписокОтменить;   
	СписокОснованияОтменить = Результат.СписокОснованияОтменить;

	Если НЕ СписокЗБОтменитьБлокировку.Количество() = 0 Тогда
		Запрос = Новый Запрос; 
		Запрос.УстановитьПараметр("СписокЗБ", СписокЗБОтменитьБлокировку);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
		               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
		               |	1 КАК Количество,
		               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК Вес,
		               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМакс КАК СуммаОценки
		               |ИЗ
		               |	РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(, ) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
		               |		ПО (ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет = ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ЗалоговыйБилет)
		               |			И (ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога = ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога)";
		ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
		
		НовыйДок = Документы.ЛБ_КорректировкаНакладной.СоздатьДокумент();
		НовыйДок.Дата = ТекущаяДатаСеанса(); 
		НовыйДок.Организация = Организация;  
		НовыйДок.ВидОперации = Перечисления.ЛБ_ВидыКорректировкиНакладной.БлокировкаВключенияЗБВНакладные; 
		НовыйДок.Ответственный = Ответственный; 

		Для каждого Эл Из СписокЗБОтменитьБлокировку Цикл
			ЗБ = Эл.Значение;
			Отбор = Новый Структура;
			Отбор.Вставить("ЗалоговыйБилет", ЗБ);
			Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
			
			Для каждого Выборка Из Строки цикл
				НоваяСтр = НовыйДок.ЗалоговыеБилеты.Добавить(); 
				НоваяСтр.ЗалоговыйБилет = ЗБ;
				НоваяСтр.Ломбард = ЗБ.Ломбард;
				НоваяСтр.ОбъектЗалога = Выборка.ОбъектЗалога;
				НоваяСтр.Количество = Выборка.Количество;
				НоваяСтр.Вес = Выборка.Вес; 
				НоваяСтр.СуммаОценки = Выборка.СуммаОценки;     
				НоваяСтр.ОтменитьБлокировку = Истина;    
				ЭлОтменить = СписокЗБОтменитьБлокировку.НайтиПоЗначению(НоваяСтр.ЗалоговыйБилет);
				ЭлОснованиеОтменить = СписокОснованияОтменить.НайтиПоИдентификатору(ЭлОтменить.ПолучитьИдентификатор());
				Если НЕ ЭлОснованиеОтменить = неопределено Тогда   
					Основание = ЭлОснованиеОтменить.Значение;
					НоваяСтр.ОснованиеБлокировки = ?(Основание = "без основания", "", Основание);
				КонецЕсли;	
			КонецЦикла;
		КонецЦикла;	  
	КонецЕсли;	

	
	НовыйДок.Записать(РежимЗаписиДокумента.Запись);  
	Попытка   
		НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
	Исключение  
		ОбщегоНазначения.СообщитьПользователю("Не удалось провести документ " + строка(НовыйДок.Ссылка) + ". Обратитесь к разработчикам.");
	КонецПопытки;	 
КонецПроцедуры	

&НаКлиенте
Процедура ОтменаОтгрузкиНакладных(Команда)
	ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Организация", Организация); 
	ПараметрыФормы.Вставить("Ломбард", Ломбард);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораОтменаОтгрузки", ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаОтменыОтгрузкиНакладных", ПараметрыФормы ,,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораОтменаОтгрузки(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
	    Возврат;
	КонецЕсли;                      
	
	ОтменаОтгрузкиНакладныхНаСервере(Результат);
	ЗаполнитьТаблицуКорректировок(); 
	//СтрокаТЗ = КорректировкиНакладных.Получить(КорректировкиНакладных.Количество()-1);
	//ИдентификаторСтроки = СтрокаТЗ.ПолучитьИдентификатор();
	//Элементы.КорректировкиНакладных.ТекущаяСтрока = ИдентификаторСтроки;
КонецПроцедуры    

&НаСервере
Процедура ОтменаОтгрузкиНакладныхНаСервере(Результат) 
	СписокНакладных = Результат;       
	
	//зафиксируем отмену отгрузки в документе изменение статуса (отгрузка)
	ЗапросН = Новый Запрос;   
	ЗапросН.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	ЗапросН.Текст ="ВЫБРАТЬ
	               |	ЛБ_ОтгруженныеНакладныеСрезПоследних.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрСведений.ЛБ_ОтгруженныеНакладные.СрезПоследних(&Дата, НакладнаяНаОтгрузку = &Накладная) КАК ЛБ_ОтгруженныеНакладныеСрезПоследних"; 
	Для каждого Эл Из СписокНакладных Цикл    
		 ЗапросН.УстановитьПараметр("Накладная", Эл.Значение); 
		 ВыборкаН  = ЗапросН.Выполнить().Выбрать();
		 Если ВыборкаН.Следующий() Тогда  
			 ДокОтгрузка = ВыборкаН.Регистратор.ПолучитьОбъект(); 
			 ДокОтгрузка.ОтгрузкаОтменена = Истина;
			 ДокОтгрузка.Записать(РежимЗаписиДокумента.Проведение);
		 КонецЕсли;	 
	КонецЦикла;	
	
	НовыйДок = Документы.ЛБ_КорректировкаНакладной.СоздатьДокумент();
	НовыйДок.Дата = ТекущаяДатаСеанса(); 
	НовыйДок.Организация = Организация;  
	НовыйДок.ВидОперации = Перечисления.ЛБ_ВидыКорректировкиНакладной.ОтменаОтгрузкиНакладных; 
	НовыйДок.Ответственный = Ответственный; 
	
	Запрос = новый Запрос;  
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Ломбард КАК Ломбард,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Количество КАК Количество,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Вес КАК Вес,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.СуммаОценки КАК СуммаОценки
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке КАК ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке
	               |ГДЕ
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Регистратор = &Регистратор
	               |	И ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.НакладнаяНаОтгрузку = &НакладнаяНаОтгрузку";

	ЗапросДок = новый Запрос;
	ЗапросДок.УстановитьПараметр("СписокНакладных", СписокНакладных); 
	ЗапросДок.Текст = "ВЫБРАТЬ
	                  |	ЛБ_ОтгруженныеНакладныеСрезПоследних.Регистратор КАК Регистратор,
	                  |	ЛБ_ОтгруженныеНакладныеСрезПоследних.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку
	                  |ИЗ
	                  |	РегистрСведений.ЛБ_ОтгруженныеНакладные.СрезПоследних(, НакладнаяНаОтгрузку В (&СписокНакладных)) КАК ЛБ_ОтгруженныеНакладныеСрезПоследних";
	ВыборкаДок = ЗапросДок.Выполнить().Выбрать();
	Пока ВыборкаДок.Следующий() Цикл   
		Запрос.УстановитьПараметр("Регистратор", ВыборкаДок.Регистратор);
		Запрос.УстановитьПараметр("НакладнаяНаОтгрузку", ВыборкаДок.НакладнаяНаОтгрузку);
		Выборка = Запрос.Выполнить().выбрать();
		Пока Выборка.Следующий() Цикл  
			НоваяСтр = НовыйДок.ЗалоговыеБилеты.Добавить(); 
			НоваяСтр.НакладнаяНаОтгрузку = Выборка.НакладнаяНаОтгрузку;
			НоваяСтр.ЗалоговыйБилет = Выборка.ЗалоговыйБилет;
			НоваяСтр.Ломбард = Выборка.Ломбард;
			НоваяСтр.ОбъектЗалога = Выборка.ОбъектЗалога;
			НоваяСтр.Количество = Выборка.Количество;
			НоваяСтр.Вес = Выборка.Вес; 
			НоваяСтр.СуммаОценки = Выборка.СуммаОценки;     
		КонецЦикла;	 
	КонецЦикла;	
	 
	НовыйДок.Записать(РежимЗаписиДокумента.Запись);  
	Попытка   
		НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
	Исключение   
		ОбщегоНазначения.СообщитьПользователю("Не удалось провести документ " + строка(НовыйДок.Ссылка) + ". Обратитесь к разработчикам.");
	КонецПопытки;	 
КонецПроцедуры	

&НаКлиенте
Процедура ОтгрузкаНакладных(Команда)
	ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Организация", Организация); 
	ПараметрыФормы.Вставить("Ломбард", Ломбард);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораОтгрузкаНакладных", ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаОтгрузкиНакладных", ПараметрыФормы ,,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры  

&НаКлиенте
Процедура ПослеВыбораОтгрузкаНакладных(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
	    Возврат;
	КонецЕсли;                      
	
	ОтгрузкаНакладныхНаСервере(Результат);
	ЗаполнитьТаблицуКорректировок(); 
	//СтрокаТЗ = КорректировкиНакладных.Получить(КорректировкиНакладных.Количество()-1);
	//ИдентификаторСтроки = СтрокаТЗ.ПолучитьИдентификатор();
	//Элементы.КорректировкиНакладных.ТекущаяСтрока = ИдентификаторСтроки;
КонецПроцедуры     

&НаСервере
Процедура ОтгрузкаНакладныхНаСервере(Результат) 
	СписокНакладных = Результат.СписокНакладных; 
	Ломбард = Результат.Ломбард;
	Инкассатор = Результат.Инкассатор;
	Получатель = Результат.Получатель; 
	СкладПолучатель = Результат.СкладПолучатель;
	
	НовыйДок = Документы.ЛБ_КорректировкаНакладной.СоздатьДокумент();
	НовыйДок.Дата = ТекущаяДатаСеанса(); 
	НовыйДок.Организация = Организация;  
	НовыйДок.ВидОперации = Перечисления.ЛБ_ВидыКорректировкиНакладной.ОтгрузкаНакладных; 
	НовыйДок.Ломбард = Ломбард;
	НовыйДок.Инкассатор = Инкассатор;
	НовыйДок.Получатель = Получатель;
	НовыйДок.СкладПолучатель = СкладПолучатель;
	НовыйДок.Ответственный = Ответственный; 
	
    Запрос = новый Запрос;  
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.ОбъектЗалога КАК ОбъектЗалога,
	               |	СУММА(ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.КоличествоОстаток) КАК Количество,
	               |	СУММА(ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.ВесОстаток) КАК Вес,
	               |	СУММА(ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.СуммаОценкиОстаток) КАК СуммаОценки,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.Ломбард КАК Ломбард,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Остатки(, НакладнаяНаОтгрузку = &НакладнаяНаОтгрузку) КАК ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.ЗалоговыйБилет,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.ОбъектЗалога,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.Ломбард,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.НакладнаяНаОтгрузку";

	Для каждого Эл Из СписокНакладных Цикл   
		Запрос.УстановитьПараметр("НакладнаяНаОтгрузку", Эл.Значение);
		Выборка = Запрос.Выполнить().выбрать();
		Пока Выборка.Следующий() Цикл  
			НоваяСтр = НовыйДок.ЗалоговыеБилеты.Добавить(); 
			НоваяСтр.НакладнаяНаОтгрузку = Выборка.НакладнаяНаОтгрузку;
			НоваяСтр.ЗалоговыйБилет = Выборка.ЗалоговыйБилет;
			НоваяСтр.Ломбард = Выборка.Ломбард;
			НоваяСтр.ОбъектЗалога = Выборка.ОбъектЗалога;
			НоваяСтр.Количество = Выборка.Количество;
			НоваяСтр.Вес = Выборка.Вес; 
			НоваяСтр.СуммаОценки = Выборка.СуммаОценки;     
		КонецЦикла;	 
	КонецЦикла;	
	 
	НовыйДок.Записать(РежимЗаписиДокумента.Запись);  
	Попытка   
		НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
	Исключение    
		ОбщегоНазначения.СообщитьПользователю("Не удалось провести документ " + строка(НовыйДок.Ссылка) + ". Обратитесь к разработчикам.");
	КонецПопытки;	 
КонецПроцедуры	

&НаКлиенте
Процедура КорректировкиНакладныхПередУдалением(Элемент, Отказ) 
	Отказ = Истина;
КонецПроцедуры

//+МАН 15.11.24 Добавил расчет даты накладной на отгрузку. Заявка 2904
&НаСервереБезКонтекста
Процедура НакладныеНаОтгрузкуПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_НастройкиСозданияНакладныхНаОтгрузкуСрезПоследних.КоличествоДнейДоступнаОтгрузка КАК КоличествоДней
		|ИЗ
		|	РегистрСведений.ЛБ_НастройкиСозданияНакладныхНаОтгрузку.СрезПоследних(&Дата, Организация = &Организация) КАК ЛБ_НастройкиСозданияНакладныхНаОтгрузкуСрезПоследних";
	
	Запрос.УстановитьПараметр("Организация", Настройки.ПараметрыДанных.Элементы.найти("Организация").Значение);
	
	Для каждого Стр Из Строки.ПолучитьКлючи() Цикл
	
		Запрос.УстановитьПараметр("Дата", Стр.Дата);
		
		Результат = Запрос.Выполнить().Выбрать();
		
		Пока Результат.Следующий() Цикл
			
			СтрокаСписка = Строки[Стр];
			СтрокаСписка.Данные.ДатаОтгрузки = Стр.Дата + 86400 + Результат.КоличествоДней*86400;
			
			Если СтрокаСписка.Данные.ДатаОтгрузки <= НачалоДня(ТекущаяДата())
				И СтрокаСписка.Данные.СтатусНакладной <> Перечисления.ЛБ_СтатусыНакладнойНаОтгрузку.Отгружена
				И СтрокаСписка.Данные.КоличествоИзделий > 0 Тогда
				
				Для каждого СтрОформления Из СтрокаСписка.Оформление Цикл
					СтрокаСписка.Оформление[СтрОформления.Ключ].УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноЗеленый);
				КонецЦикла;
			//Иначе
			//	Для каждого СтрОформления Из СтрокаСписка.Оформление Цикл
			//		СтрокаСписка.Оформление[СтрОформления.Ключ].УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Белый);
			//	КонецЦикла;
			КонецЕсли;
			
			СтрокаСписка.Оформление["ДатаОтгрузки"].УстановитьЗначениеПараметра("Формат", "ДФ=dd.MM.yyyy");
			
		КонецЦикла;
	
	КонецЦикла;
КонецПроцедуры
//-МАН

&НаКлиенте
Процедура ОплатаОтгруженныхЗБ(Команда)
	ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Организация", Организация); 
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораОплатыОтгруженныхЗБ",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаОплатыОтгруженныхЗБ", ПараметрыФормы ,,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораОплатыОтгруженныхЗБ(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;                      
	
    РазрешитьОплатуОтгруженныхЗБНаСервере(Результат);
	ЗаполнитьТаблицуКорректировок();     
КонецПроцедуры    

&НаСервере
Процедура РазрешитьОплатуОтгруженныхЗБНаСервере(РезультатВыбора)
	СписокЗБ = РезультатВыбора.СписокЗБ; 
	СписокДаты = РезультатВыбора.СписокДаты; 
	СписокОснования = РезультатВыбора.СписокОснования;
	
	НовыйДок = Документы.ЛБ_КорректировкаНакладной.СоздатьДокумент();
	НовыйДок.Дата = ТекущаяДатаСеанса(); 
	НовыйДок.Организация = Организация;  
	НовыйДок.ВидОперации = Перечисления.ЛБ_ВидыКорректировкиНакладной.ОплатаОтгруженногоЗБ; 
	НовыйДок.Ответственный = Ответственный; 
	
	Для каждого Эл Из СписокЗБ Цикл
		НоваяСтр = НовыйДок.ЗалоговыеБилеты.Добавить(); 
		НоваяСтр.ЗалоговыйБилет = Эл.Значение;
		НоваяСтр.Ломбард = НоваяСтр.ЗалоговыйБилет.Ломбард;
		Эл = СписокЗБ.НайтиПоЗначению(НоваяСтр.ЗалоговыйБилет);
		ЭлДата = СписокДаты.НайтиПоИдентификатору(Эл.ПолучитьИдентификатор());
		Если НЕ ЭлДата = неопределено Тогда
			НоваяСтр.ДатаОплаты = ЭлДата.Значение;
		КонецЕсли; 
		ЭлОснование = СписокОснования.НайтиПоИдентификатору(Эл.ПолучитьИдентификатор());
		Если НЕ ЭлОснование = неопределено Тогда
			НоваяСтр.ОснованиеОплаты = ЭлОснование.Значение;
		КонецЕсли;
     КонецЦикла;	  
	 
	НовыйДок.Записать(РежимЗаписиДокумента.Запись);  
	Попытка   
		НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
	Исключение  
		ОбщегоНазначения.СообщитьПользователю("Не удалось провести документ " + строка(НовыйДок.Ссылка) + ". Обратитесь к разработчикам.");
	КонецПопытки;	 
КонецПроцедуры    

 //+МАН 19.03.26 Заявка 3750
&НаСервере
Процедура УстановитьДоступность()
	
	Если ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард Тогда
		Элементы.Организация.ТолькоПросмотр = Истина;
		Элементы.Ломбард.ТолькоПросмотр = Истина;
	Иначе
		Элементы.Организация.ТолькоПросмотр = Ложь;
		Элементы.Ломбард.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
КонецПроцедуры
//-МАН





