&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
		
	ТекстЗаголовока = НСтр("ru = 'Рабочее место приемщика'");
	
	текПользователь = "" + ПараметрыСеанса.ТекущийСотрудник;
	Если текПользователь = "" Тогда 
		текПользователь = "" + Пользователи.ТекущийПользователь();
	КонецЕсли;
	ТекстЗаголовока = ТекстЗаголовока + "                                                                                                                                                                       " + текПользователь;
	Заголовок = ТекстЗаголовока;   
	
	Если Пользователи.ТекущийПользователь().ЭтоЛомбард Тогда
        ТекущийЛомбард = ПараметрыСеанса.ТекущийЛомбард; 
	Иначе
		ТекущийЛомбард = ЛБ_ОбщийМодуль.ПолучитьЛомбардПользователя(Пользователи.ТекущийПользователь());
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Залогодатель) Тогда
		ФИО = "<Фамилия, имя и отчество клиента>";
		  
		Элементы.КарточкаКлиента.Доступность = Ложь;
		Элементы.СтатистикаОбращений.Доступность = Ложь;
		Элементы.ЭДО.Доступность = Ложь;
		
		//+МАН 28.01.26 Изменил. Заявка 3649
		//Элементы.ГруппаКнопки.Доступность = Ложь;  
		Элементы.СогласиеНаОпробование.Доступность = Ложь;
		Элементы.ФормаЗаявлениеНаВозврат.Доступность = Ложь;
		Элементы.ФормаЗаявлениеОПредоставленииСведений.Доступность = Ложь;
		Элементы.ФормаАктНаследник.Доступность = Ложь;
		//-МАН
		
		Элементы.КомандыТаблицыЗБ.Доступность = Ложь;  
		Элементы.ГруппаВыбораЗБ.Доступность = Ложь;
	КонецЕсли;
	
	//++ООВ 20.03.2026 Заявка 3751
	Если НЕ ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард Тогда
		Если УправлениеДоступом.ЕстьРоль("ЛБ_СотрудникЦО") Тогда
			Элементы.МаршрутныйЛист.Доступность = Истина;  
		Иначе 
			Элементы.МаршрутныйЛист.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	//--ООВ 20.03.2026
	
	ИнформацияОКлиенте = ЗаполнитьИнформациюОКлиенте(); 
	СтатусыКлиента = ЗаполнитьСтатусыКлиента(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//+МАН 28.01.26 Закомментировал. Заявка 3649
	//ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЗалогодателя", ЭтаФорма);

	//ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателя", , ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//-МАН
	//+МАН 28.01.26 Заявка 3649
	УсловноеОформлениеСрока();
	//-МАН
КонецПроцедуры

&НаСервере
Функция ПроверитьПаспортВСпискеНеДействительных(ДокументСерия, ДокументНомер)
	Парам = Новый Структура("Серия, Номер", СокрЛП(ДокументСерия), СокрЛП(ДокументНомер));
	Возврат ЛБ_ОбменLX.ПаспортНедействителен(Парам);
КонецФункции

&НаСервере
Функция ПолучитьДокументОтмены(Ссылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&Период, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
		|ГДЕ
		|	ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент В(&ЗБ)";
	
	Запрос.УстановитьПараметр("ЗБ", Ссылка);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция ЗаполнитьИнформациюОКлиенте()
	ИнформацияОКлиенте.Очистить(); 
	ДокументыЗалогодателяДоп.Очистить();
	
	Дата = ТекущаяДатаСеанса();
    ТабличныйДокумент = Новый ТабличныйДокумент;  
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщиеМакеты.ЛБ_ИнформацияОКлиенте"); 
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка"); 
	ТабличныйДокумент.Вывести(ОбластьМакета); 
	
	Если НЕ ЗначениеЗаполнено(Залогодатель) Тогда 
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаб"); 
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал"); 
		ТабличныйДокумент.Вывести(ОбластьМакета); 
		
		Возврат ТабличныйДокумент;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);  
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя КАК ДокументЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ОсновнойДУЛ КАК ОсновнойДУЛ,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ОсновнойДоп КАК ОсновнойДоп,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНачалоДействия КАК ДокументНачалоДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНеДействителен КАК ДокументНеДействителен,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДатаСмерти КАК ДатаСмерти,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДействителен КАК ДокументДействителен,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНаименованиеИногоДокумента КАК ДокументНаименованиеИногоДокумента,
	               |	ЛОЖЬ КАК ПроверкаНеДействителен
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(, ДокументЗалогодателя.Владелец = &Залогодатель) КАК ЛБ_ДокументыЗалогодателейСрезПоследних"; 
	ДокументыЗалогодателя = Запрос.Выполнить().Выгрузить(); 
	Если НЕ ДатаСмерти = Дата(1,1,1) Тогда 
		Удстроки = Новый списокЗначений;
		Для каждого Стр Из ДокументыЗалогодателя Цикл
			Если НЕ Стр.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.СвидетельствоОСмерти Тогда  
				Удстроки.Добавить(Стр);
			КонецЕсли;	
		КонецЦикла;   
		
		Для каждого Эл Из Удстроки цикл 
			ДокументыЗалогодателя.Удалить(Эл.Значение);
		Конеццикла;	                                   
	Иначе	
		ЕстьСвидетельствоОРождении = Ложь; 
		ЕстьПаспорт = Ложь;
		Для каждого Стр Из ДокументыЗалогодателя Цикл   
			Если Стр.ВидДокументаЗалогодателя = 	Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийПравоПребыванияРФ Тогда
				Продолжить;
			КонецЕсли;	
			Если Стр.ДокументНЕДействителен Тогда
				Продолжить; 
			ИначеЕсли (Стр.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.СвидетельствоОРождении) Тогда
				ЕстьСвидетельствоОРождении = Истина;	
			КонецЕсли;	
			Стр.ПроверкаНеДействителен = ПроверитьПаспортВСпискеНеДействительных(Стр.ДокументСерия, стр.ДокументНомер);
			Если НЕ Стр.ПроверкаНеДействителен Тогда
				ЛБ_ОбщийМодуль.ПроверитьДействительностьДокумента(Стр, ДатаРождения, ложь, Дата);
			КонецЕсли; 			
		КонецЦикла;
		
		Если ЕстьСвидетельствоОРождении Тогда
			//проверим недействительность свидетельства о рождении если есть паспорт
			ЛБ_ОбщийМодуль.ПроверитьДействительностьСвидетельствоОРождении(ДокументыЗалогодателя);
		КонецЕсли;
		
		Для каждого Стр Из ДокументыЗалогодателя Цикл
			Если (Стр.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ) И НЕ Стр.ДокументНЕДействителен Тогда
			    ЕстьПаспорт = Истина;  
				Прервать;
		    КонецЕсли;
		КонецЦикла;	
		
		//проверим недействительность свидетельства о рождении если есть паспорт
		Если ЕстьПаспорт Тогда
			ОтборД = Новый структура;
			ОтборД.Вставить("ВидДокумента", Справочники.ВидыДокументовФизическихЛиц.СвидетельствоОРождении);
			ОтборД.Вставить("ДокументНеДействителен", Ложь);
			СтрокиД = ДокументыЗалогодателя.НайтиСтроки(ОтборД);
			Для каждого СтрД Из СтрокиД цикл
				СтрД.ДокументНеДействителен = Истина;
			Конеццикла;	
		КонецЕсли;  
		
		ОсновнойДУЛ = Справочники.ЛБ_ДокументыЗалогодателя.ПустаяСсылка();
		Удстроки = Новый списокЗначений;
		Для каждого Стр Из ДокументыЗалогодателя Цикл
			Если Стр.ДокументНЕДействителен ИЛИ Стр.ПроверкаНеДействителен Тогда  
				Удстроки.Добавить(Стр); 
			Иначе
				Если Стр.ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДополнительныйДокумент Тогда    
					НоваяСтр = ДокументыЗалогодателяДоп.Добавить(); 
					НоваяСтр.ВидДокумента = Стр.ВидДокумента;
					НоваяСтр.ДокументСрокДействия = Стр.ДокументСрокДействия; 
				ИначеЕсли Стр.ОсновнойДУЛ Тогда
					ОсновнойДУЛ = Стр.ДокументЗалогодателя; 
					ОсновнойДУЛГражданство = Стр.Гражданство;  
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;  
		
		//проверим вид на жительство если нужно
		Для каждого Стр Из ДокументыЗалогодателя Цикл 
			Если НЕ Стр.ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийПравоПребыванияРФ Тогда
				Продолжить;
			КонецЕсли;	

			Если Стр.ДокументНЕДействителен Тогда
				Продолжить; 
			ИначеЕсли ОсновнойДУЛГражданство = Справочники.СтраныМира.Россия Тогда
				Удстроки.Добавить(Стр);
				Продолжить;
			КонецЕсли;	
						
			Если ЗначениеЗаполнено(Стр.Гражданство) И 
				Не Стр.Гражданство = Справочники.СтраныМира.Россия И
				Стр.ВидДокументаЗалогодателя = 	Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийПравоПребыванияРФ И
				Стр.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ВидНаЖительство Тогда
				
				Стр.ПроверкаНеДействителен = НЕ ЛБ_ОбщийМодуль.ПроверитьДействительностьВидаНаЖительство(Стр, ДатаРождения, Дата);
			КонецЕсли;
		КонецЦикла;

		
		Для каждого Эл Из Удстроки цикл 
			ДокументыЗалогодателя.Удалить(Эл.Значение);
		Конеццикла;	                                   
		ДокументыЗалогодателя.Сортировать("ОсновнойДУЛ УБЫВ, ОсновнойДоп УБЫВ, ДокументНачалоДействия УБЫВ, ВидДокументаЗалогодателя"); 
	КонецЕсли;	
	
	//+МАН 28.01.26 Заявка 3649
	ОбластьКомментарий = Макет.ПолучитьОбласть("СтрокаКомментарий");
	//-МАН
	
	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаб");
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК Телефон,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
				   //+МАН 28.01.26 Заявка 3649
				   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Комментарий КАК Комментарий,
				   //-МАН
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПрописке КАК АдресПоПрописке
	               |ИЗ
	               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";  
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
        ОбластьМакета.Параметры.ДатаРождения = Выборка.ДатаРождения; 
		ОбластьМакета.Параметры.Телефон = Выборка.Телефон;
		ОбластьМакета.Параметры.Адрес = Выборка.АдресПоПрописке;
	    ОбластьМакета.Параметры.Возраст = ЛБ_ОбщийМодуль.ВычислитьВозраст(ДатаРождения);
		//+МАН 28.01.26 Заявка 3649
		ОбластьКомментарий.Параметры.Комментарий = Выборка.Комментарий;
		//-МАН		
	КонецЕсли;  
	
	СписокВидовОперации = Новый списокЗначений;
	СписокВидовОперации.Добавить(Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог);
	СписокВидовОперации.Добавить(Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога);
	СписокВидовОперации.Добавить(Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов);
	СписокВидовОперации.Добавить(Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление);
	Запрос.УстановитьПараметр("СписокВидовОперации", СписокВидовОперации);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОборотыПоОперациямЗайма.Период КАК ДатаОперации,
	               |	ЛБ_ОборотыПоОперациямЗайма.ВидОперации КАК ВидОперации,
	               |	ЛБ_ОборотыПоОперациямЗайма.Ломбард КАК Ломбард,
	               |	ЛБ_ОборотыПоОперациямЗайма.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОборотыПоОперациямЗайма КАК ЛБ_ОборотыПоОперациямЗайма
	               |ГДЕ
	               |	ЛБ_ОборотыПоОперациямЗайма.Регистратор.Залогодатель = &Залогодатель
	               |	И ЛБ_ОборотыПоОперациямЗайма.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
	               |	И ЛБ_ОборотыПоОперациямЗайма.ВидОперации В(&СписокВидовОперации)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЛБ_ОборотыПоОперациямЗайма.Период,
	               |	ЛБ_ОборотыПоОперациямЗайма.ВидОперации,
	               |	ЛБ_ОборотыПоОперациямЗайма.Ломбард,
	               |	ЛБ_ОборотыПоОперациямЗайма.Регистратор
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОборотыПоОперациямЗайма КАК ЛБ_ОборотыПоОперациямЗайма
	               |ГДЕ
	               |	ЛБ_ОборотыПоОперациямЗайма.Регистратор.Контрагент = &Залогодатель
	               |	И ЛБ_ОборотыПоОперациямЗайма.Регистратор ССЫЛКА Документ.ЛБ_Реализация
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаОперации УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.ЛБ_ОперацияПоЗалогу") И ПолучитьДокументОтмены(Выборка.Регистратор) Тогда
		    Продолжить;
		КонецЕсли;	
		ОбластьМакета.Параметры.ДатаОперации = Выборка.ДатаОперации;
		ОбластьМакета.Параметры.ВидОперации = Выборка.ВидОперации;
		ОбластьМакета.Параметры.Ломбард = Выборка.Ломбард.НомерЛомбарда;
		Прервать;
	КонецЦикла;  
	
	Если НЕ ДокументыЗалогодателя.Количество() = 0 Тогда
	    Стр = ДокументыЗалогодателя.Получить(0); 
		ОбластьМакета.Параметры.ВидДок = Стр.ВидДокумента;
		ОбластьМакета.Параметры.Серия = Стр.ДокументСерия;
		ОбластьМакета.Параметры.Номер = Стр.ДокументНомер;
		ОбластьМакета.Параметры.ДатаВыдачи = Стр.ДокументДатаВыдачи;  
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьМакета); 
	
	//+МАН 28.01.26 Заявка 3649
	Если ДокументыЗалогодателя.Количество() <> 0 Тогда
		Если Стр.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.СвидетельствоОСмерти Тогда
			ТабличныйДокумент.Область("R4C4").ЦветТекста = WebЦвета.Красный;
		КонецЕсли;
	КонецЕсли;
	//-МАН
	
	Если ДокументыЗалогодателя.Количество() > 1 Тогда 
		КолСтрок = ДокументыЗалогодателя.Количество()-1;
		Для сч = 1 По КолСтрок Цикл 
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаб"); 
			Стр = ДокументыЗалогодателя.Получить(сч);
	    	ОбластьМакета.Параметры.ВидДок = Стр.ВидДокумента;
			ОбластьМакета.Параметры.Серия = Стр.ДокументСерия;
			ОбластьМакета.Параметры.Номер = Стр.ДокументНомер;
			ОбластьМакета.Параметры.ДатаВыдачи = Стр.ДокументДатаВыдачи;
				
			ТабличныйДокумент.Вывести(ОбластьМакета); 
		КонецЦикла;
		
		ТабличныйДокумент.Область(4,8,4+КолСтрок,8).Объединить();
	КонецЕсли;	
	
	//+МАН 28.01.26 Заявка 3649
	ТабличныйДокумент.Вывести(ОбластьКомментарий);
	//-МАН
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал"); 
	ТабличныйДокумент.Вывести(ОбластьМакета); 
	
	Возврат ТабличныйДокумент;
КонецФункции	

&НаСервере
Функция ЗаполнитьСтатусыКлиента()
    СтатусыКлиента.Очистить();
	
    ТабличныйДокумент = Новый ТабличныйДокумент;  
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщиеМакеты.ЛБ_СтатусыКлиента"); 
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка"); 
	ТабличныйДокумент.Вывести(ОбластьМакета); 
	
	Если ТаблицаСтатусов.Количество() = 0 Тогда 
		ОбластьМакета = Макет.ПолучитьОбласть("Строка"); 
		ТабличныйДокумент.Вывести(ОбластьМакета);
			
		Возврат ТабличныйДокумент;
	КонецЕсли;  
	
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	//+МАН 06.04.26 Подсветка служебного статуса. Заявка 3759
	ОбластьМакетаСС = Макет.ПолучитьОбласть("СтрокаСС");
	//
	Для каждого Стр Из ТаблицаСтатусов Цикл
		//+МАН 06.04.26 Подсветка служебного статуса. Добавлено условие. Заявка 3759
		Если Стр.НаименованиеСтатуса <> "Служебные статусы" Тогда
			ОбластьМакета.Параметры.Наименование = Стр.НаименованиеСтатуса; 
			ОбластьМакета.Параметры.Статус = Стр.Статус;
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Иначе
			СтрСправочника = Справочники.ЛБ_СлужебныеСтатусыКлиентов.НайтиПоНаименованию(Стр.Статус, Истина);
			Если СтрСправочника.ЗапретНаОперации.Количество() > 0 Тогда
				ОбластьМакетаСС.Параметры.Наименование = Стр.НаименованиеСтатуса; 
				ОбластьМакетаСС.Параметры.Статус = Стр.Статус;
				ТабличныйДокумент.Вывести(ОбластьМакетаСС);
			Иначе
				ОбластьМакета.Параметры.Наименование = Стр.НаименованиеСтатуса; 
				ОбластьМакета.Параметры.Статус = Стр.Статус;
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЕсли;
		КонецЕсли;
		//-МАН
	КонецЦикла;	  
	Возврат ТабличныйДокумент;
КонецФункции	

&НаСервере
Функция ПроверитьСтатусПочетный() 
	ЕстьПочетный = Ложь;
	Если ЛБ_УправлениеЛомбардом.ПроверитьСтатусПочетный(ДатаРождения, Пол) Тогда 
		ЕстьПочетный = Истина;
	КонецЕсли;  
	
	Если ЕстьПочетный Тогда
		Возврат ЕстьПочетный;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_СоответствиеДокументовИЛьготныхСтатусовСрезПоследних.ВидДокумента КАК ВидДокумента,
	|	ЛБ_СоответствиеДокументовИЛьготныхСтатусовСрезПоследних.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.ЛБ_СоответствиеДокументовИЛьготныхСтатусов.СрезПоследних(&Дата, НеАктуально = ЛОЖЬ) КАК ЛБ_СоответствиеДокументовИЛьготныхСтатусовСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Отбор = Новый структура;
		Отбор.Вставить("ВидДокумента", Выборка.ВидДокумента);
		
		СтрокиД = ДокументыЗалогодателяДоп.НайтиСтроки(Отбор); 
		Для сч = 0 По СтрокиД.Количество()- 1 Цикл			
			СтрД = строкиД.Получить(сч);   
			Если НЕ (СтрД.ДокументСрокДействия = Дата(1,1,1)) Тогда
				Если СтрД.ДокументСрокДействия < НачалоДня(ТекущаяДатаСеанса()) Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			СтатусЛояльности = ЛБ_УправлениеЛомбардом.ПолучитьСтатусПоСистемеЛояльности(ТекущаяДатаСеанса(), Выборка.статус);
			Если НЕ СтатусЛояльности = неопределено Тогда 
				ЕстьПочетный = Истина;
			КонецЕсли;	
		КонецЦикла;
	Конеццикла;	
	Возврат ЕстьПочетный;
КонецФункции 	

&НаСервере
Функция ПолучитьДопстатусыКлиента() 
	СписокДопСтатусов = Новый СписокЗначений;  
	
	Запрос = Новый Запрос; 
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Справочники.ЛБ_СтатусыЗалогодателей.Почетный);
	//+МАН 03.12.25 Закомментировал. Непонятно ... зачем его исключили.
	//МассивСтатусов.Добавить(Справочники.ЛБ_СтатусыЗалогодателей.VIP);
	//-МАН
	
	Запрос.УстановитьПараметр("Статусы", МассивСтатусов);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СтатусыЗалогодателей.Ссылка КАК Статус
	               |ИЗ
	               |	Справочник.ЛБ_СтатусыЗалогодателей КАК ЛБ_СтатусыЗалогодателей
	               |ГДЕ
	               |	ЛБ_СтатусыЗалогодателей.ПометкаУдаления = ЛОЖЬ
	               |	И ЛБ_СтатусыЗалогодателей.ЭтоГруппа = ЛОЖЬ
	               |	И ЛБ_СтатусыЗалогодателей.ДоступенДляВыбораВручную = ИСТИНА
	               |	И НЕ ЛБ_СтатусыЗалогодателей.Ссылка В (&Статусы)
	               |АВТОУПОРЯДОЧИВАНИЕ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус,
	|	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Используется КАК Используется,
	|	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.СрокДействия КАК СрокДействия,
	|	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(
	|			,
	|			Залогодатель = &Залогодатель
	|				И Статус = &Статус) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Период УБЫВ";
	Для каждого Стр Из ТаблицаЗапроса Цикл 
		Запрос.УстановитьПараметр("Залогодатель", Залогодатель);   
		Запрос.УстановитьПараметр("Статус", Стр.Статус);  
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.Используется Тогда  
				Если ЗначениеЗаполнено(Выборка.СрокДействия) Тогда
					Если Выборка.СрокДействия >= ТекущаяДатаСеанса() Тогда
						Если СписокДопСтатусов.НайтиПоЗначению(Выборка.Статус) = неопределено Тогда 
							СписокДопСтатусов.Добавить(Выборка.Статус);
						КонецЕсли;	
					КонецЕсли;    
				Иначе   
					Если СписокДопСтатусов.НайтиПоЗначению(Выборка.Статус) = неопределено Тогда 
						СписокДопСтатусов.Добавить(Выборка.Статус);
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	   
	
	Если ПроверитьСтатусПочетный() Тогда  
		Если СписокДопСтатусов.НайтиПоЗначению(Справочники.ЛБ_СтатусыЗалогодателей.Почетный) = неопределено Тогда 
			СписокДопСтатусов.Добавить(Справочники.ЛБ_СтатусыЗалогодателей.Почетный);
		КонецЕсли;	
	КонецЕсли;
	
	Возврат СписокДопСтатусов; 
КонецФункции

&НаСервере
Функция ПолучитьСлужебныеСтатусыКлиента() 
	СписокСлужебныхСтатусов = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СлужебныеСтатусы.Ссылка КАК Статус
	|ИЗ
	|	Справочник.ЛБ_СлужебныеСтатусыКлиентов КАК СлужебныеСтатусы
	|ГДЕ
	|	СлужебныеСтатусы.ПометкаУдаления = ЛОЖЬ
	|АВТОУПОРЯДОЧИВАНИЕ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СтатусыЗалогодателейСлужебныеСрезПоследних.Статус КАК Статус,
	               |	ЛБ_СтатусыЗалогодателейСлужебныеСрезПоследних.Используется КАК Используется,
	               |	ЛБ_СтатусыЗалогодателейСлужебныеСрезПоследних.Комментарий КАК Комментарий
	               |ИЗ
	               |	РегистрСведений.ЛБ_СтатусыЗалогодателейСлужебные.СрезПоследних(
	               |			,
	               |			Залогодатель = &Залогодатель
	               |				И Статус = &Статус) КАК ЛБ_СтатусыЗалогодателейСлужебныеСрезПоследних";
	Для каждого Стр Из ТаблицаЗапроса Цикл 
		Запрос.УстановитьПараметр("Залогодатель", Залогодатель);  
		Запрос.УстановитьПараметр("Статус", Стр.Статус);  
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.Используется Тогда
			    Если СписокСлужебныхСтатусов.НайтиПоЗначению(Выборка.Статус) = неопределено Тогда 
					СписокСлужебныхСтатусов.Добавить(Выборка.Статус);
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	   
	
	Возврат СписокСлужебныхСтатусов;
КонецФункции 

Функция ПолучитьКомплаенсСтатусыКлиента()
	СписокКомплаенсСтатусов = Новый СписокЗначений;
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);   	
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_КлиентыВПеречняхСрезПоследних.ВидПеречня КАК ВидПеречня,
	|	ЛБ_КлиентыВПеречняхСрезПоследних.СтатусКлиентаВПеречне КАК Статус
	|ИЗ
	|	РегистрСведений.ЛБ_КлиентыВПеречнях.СрезПоследних(, Залогодатель = &Залогодатель) КАК ЛБ_КлиентыВПеречняхСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛБ_КлиентыВПеречняхСрезПоследних.Период УБЫВ"; 
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Отбор = Новый Структура;
	Отбор.Вставить("ВидПеречня", Перечисления.ЛБ_ВидыПеречней.Террористы);
	Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);  
	Если НЕ Строки.Количество() = 0 Тогда
		Выборка = Строки.Получить(0);
		Если Выборка.Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен Тогда 
			Если СписокКомплаенсСтатусов.НайтиПоЗначению(Выборка.Статус) = неопределено Тогда 
				СписокКомплаенсСтатусов.Добавить("В перечне террористов");
			КонецЕсли;
		КонецЕсли;   
	КонецЕсли;
	
	Отбор.Вставить("ВидПеречня", Перечисления.ЛБ_ВидыПеречней.МВК);
	Строки = ТаблицаЗапроса.НайтиСтроки(Отбор); 
	Если НЕ Строки.Количество() = 0 Тогда
		Выборка = Строки.Получить(0);
		Если Выборка.Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен Тогда  
			Если СписокКомплаенсСтатусов.НайтиПоЗначению(Выборка.Статус) = неопределено Тогда 
				СписокКомплаенсСтатусов.Добавить("МВК заморожен");
			КонецЕсли;
        КонецЕсли;	
	КонецЕсли;	
	
	Отбор.Вставить("ВидПеречня", Перечисления.ЛБ_ВидыПеречней.ФРОМУ);
	Строки = ТаблицаЗапроса.НайтиСтроки(Отбор); 
	Если НЕ Строки.Количество() = 0 Тогда
		Выборка = Строки.Получить(0);
		Если Выборка.Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен Тогда 
			Если СписокКомплаенсСтатусов.НайтиПоЗначению(Выборка.Статус) = неопределено Тогда 
				СписокКомплаенсСтатусов.Добавить("В перечне ФРОМУ");
			КонецЕсли;
		КонецЕсли;  
	КонецЕсли;     
	
	Отбор.Вставить("ВидПеречня", Перечисления.ЛБ_ВидыПеречней.ООН);
	Строки = ТаблицаЗапроса.НайтиСтроки(Отбор); 
	Если НЕ Строки.Количество() = 0 Тогда
		Выборка = Строки.Получить(0);
		Если Выборка.Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен Тогда 
			Если СписокКомплаенсСтатусов.НайтиПоЗначению(Выборка.Статус) = неопределено Тогда 
				СписокКомплаенсСтатусов.Добавить("В перечне ООН");
			КонецЕсли;
		КонецЕсли;  
	КонецЕсли;
		
	Отбор.Вставить("ВидПеречня", Перечисления.ЛБ_ВидыПеречней.ЦБ);
	Строки = ТаблицаЗапроса.НайтиСтроки(Отбор); 
	Если НЕ Строки.Количество() = 0 Тогда  
		Если СписокКомплаенсСтатусов.НайтиПоЗначению(Выборка.Статус) = неопределено Тогда 
			СписокКомплаенсСтатусов.Добавить("В перечне ЦБ");
		КонецЕсли;	
	КонецЕсли;
	
	Возврат СписокКомплаенсСтатусов;
КонецФункции	

&НаСервере
Процедура ЗаполнитьИнформациюОКлиентеДополнительно()  
	ТаблицаСтатусов.Очистить();
	СтатусЗалогодателя = ЛБ_УправлениеЛомбардом.ПолучитьТекущийСтатусКлиента(ТекущаяДатаСеанса(), Залогодатель); 
	
	НоваяСтр = ТаблицаСтатусов.Добавить();
	НоваяСтр.НаименованиеСтатуса = "Статус по системе лояльности"; 
	НоваяСтр.Статус = СтатусЗалогодателя;   
	
	СписокДопСтатусов = ПолучитьДопстатусыКлиента(); 
	Если НЕ СписокДопСтатусов.Количество() = 0 Тогда
	    ДопСтатусы = ""; 
		Для каждого Эл Из СписокДопСтатусов Цикл
			ДопСтатусы = ДопСтатусы + ?(ПустаяСтрока(ДопСтатусы), "", ", ") + строка(Эл.Значение);
		Конеццикла;
		
		НоваяСтр = ТаблицаСтатусов.Добавить();
		НоваяСтр.НаименованиеСтатуса = "Дополнительные статусы"; 
		НоваяСтр.Статус = ДопСтатусы;  
	КонецЕсли;  
	
	СписокСлужебныхСтатусов = ПолучитьСлужебныеСтатусыКлиента(); 
	Если НЕ СписокСлужебныхСтатусов.Количество() = 0 Тогда
	    СтатусыСлужебные = ""; 
		Для каждого Эл Из СписокСлужебныхСтатусов Цикл
			СтатусыСлужебные = СтатусыСлужебные + ?(ПустаяСтрока(СтатусыСлужебные), "", ", ") + строка(Эл.Значение);
		Конеццикла;
		
		НоваяСтр = ТаблицаСтатусов.Добавить();
		НоваяСтр.НаименованиеСтатуса = "Служебные статусы"; 
		НоваяСтр.Статус = СтатусыСлужебные;  
	КонецЕсли; 
	
	СписокКомплаенсСтатусов = ПолучитьКомплаенсСтатусыКлиента(); 
	Если НЕ СписокКомплаенсСтатусов.Количество() = 0 Тогда
	    СтатусыКомплаенс = ""; 
		Для каждого Эл Из СписокКомплаенсСтатусов Цикл
			СтатусыКомплаенс = СтатусыКомплаенс + ?(ПустаяСтрока(СтатусыКомплаенс), "", ", ") + строка(Эл.Значение);
		Конеццикла;
		
		НоваяСтр = ТаблицаСтатусов.Добавить();
		НоваяСтр.НаименованиеСтатуса = "Комплаенс статусы"; 
		НоваяСтр.Статус = СтатусыКомплаенс;  
	КонецЕсли;  
	
	ЕстьЭДО = ЛБ_СоглашенияЭДОСервер.НаличиеДействующегоСоглашения(Залогодатель);
КонецПроцедуры

&НаКлиенте
Процедура ПоискЗалогодателя(Команда)
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЗалогодателя", ЭтаФорма);

	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателя", , ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЗалогодателя(Результат,Параметры) Экспорт
	Если НЕ ТипЗнч(Результат) = Тип("Структура") Тогда
		Возврат;		
	Иначе
		Залогодатель = Результат.Залогодатель;  
		ПолучитьКонтактнуюИнформацию();
		ИнформацияОКлиенте = ЗаполнитьИнформациюОКлиенте();  
		ЗаполнитьИнформациюОКлиентеДополнительно();   
		СтатусыКлиента = ЗаполнитьСтатусыКлиента();
		ВыборЗБ = 1; 
		ТекущийВыборЗБ = 1; 
		Если НЕ ПустаяСтрока(НомерЗБ) Тогда 
			НомерЗБ = "";
			Элементы.НомерЗБ.Видимость = Ложь;
		КонецЕсли;	
	    ПолучитьСписокЗБ(Истина);  		
		ЗаполнитьСписокЛомбардов(); 
		УстановитьОтборНаСервере();          
		Элементы.ИнформацияОКлиенте.Высота = ИнформацияОКлиенте.ВысотаТаблицы;
		Элементы.СтатусыКлиента.Высота = СтатусыКлиента.ВысотаТаблицы; 
		Элементы.КарточкаКлиента.Доступность = Истина;
		Элементы.СтатистикаОбращений.Доступность = Истина;
		Элементы.ЭДО.Доступность = Истина;  
		//+МАН 28.01.26 Изменил. Заявка 3649
		//Элементы.ГруппаКнопки.Доступность = Истина;  
		Элементы.СогласиеНаОпробование.Доступность = Истина;
		Элементы.ФормаЗаявлениеНаВозврат.Доступность = Истина;
		Элементы.ФормаЗаявлениеОПредоставленииСведений.Доступность = Истина;
		Элементы.ФормаАктНаследник.Доступность = Истина;
		//-МАН
		Элементы.КомандыТаблицыЗБ.Доступность = Истина; 
		Элементы.ГруппаВыбораЗБ.Доступность = Истина;
		
		НаличиеЭДО = ЛБ_СоглашенияЭДОСервер.НаличиеДействующегоСоглашения(Залогодатель);
		
		Если НаличиеЭДО Тогда
			Элементы.СтатусЭДО.Заголовок = "есть";
		Иначе
			Элементы.СтатусЭДО.Заголовок = "нет";
		КонецЕсли;
		
		НаличиеСогласия = ЛБ_СогласияНаИнформированиеСервер.НаличиеДействующегоСогласия(Залогодатель);
		
		Если НаличиеСогласия Тогда
			Элементы.СтатусСогласия.Заголовок = "есть";
		Иначе
			Элементы.СтатусСогласия.Заголовок = "нет";
		КонецЕсли;
		
		//+МАН 28.01.26 Заявка 3649
		ОформлениеЭДО(НаличиеЭДО);
		//-МАН
		
		ЗапуститьФоновоеЗадание();
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ЗапуститьФоновоеЗадание()
    ИдентификаторЗадания = ЗапуститьФоновоеЗаданиеНаСервере();
    ОжиданиеВыполнения = Новый ОписаниеОповещения("ПроверитьВыполнениеЗадания", ЭтаФорма);
    ПодключитьОбработчикОжидания("ПроверитьВыполнениеЗадания", 1, Ложь);
КонецПроцедуры

&НаСервере
Функция ЗапуститьФоновоеЗаданиеНаСервере()
    ПараметрыЗадания = Новый Массив;
	СписокЗБ = Новый СписокЗначений;
	Для Каждого Стр Из ТаблицаЗБ Цикл
	    СписокЗБ.Добавить(Стр.ЗалоговыйБилет);
	КонецЦикла;    
	ПараметрыЗадания.Добавить(СписокЗБ);   
	ПараметрыЗадания.Добавить(ДатаСмерти);
	ФоновоеЗадание = ФоновыеЗадания.Выполнить("ЛБ_УправлениеЛомбардом.ВыполнитьОбработкуДанныхТаблицыЗБ", ПараметрыЗадания);
    Возврат ФоновоеЗадание.УникальныйИдентификатор;
КонецФункции

&НаКлиенте
Процедура ПроверитьВыполнениеЗадания() Экспорт
    Результат = ПроверитьВыполнениеЗаданияНаСервере();
    
    Если Результат.Выполнено Тогда
        ОтключитьОбработчикОжидания("ПроверитьВыполнениеЗадания");
        //ПоказатьОповещениеПользователя("Результат обработки", , Результат.ТекстРезультата);
		//+МАН 18.03.26 Добавил установку отбора.
		УстановитьОтборНаСервере();
		//-МАН
    КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверитьВыполнениеЗаданияНаСервере()
    Результат = Новый Структура("Выполнено, ТекстРезультата", Ложь, "");
    
    ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания); 
	СообщенияИзФона = ФоновоеЗадание.ПолучитьСообщенияПользователю(Истина);
	Для Каждого Сообщ Из СообщенияИзФона Цикл
		ОбработатьСообщениеФЗ(Сообщ.Текст);
	КонецЦикла;
    
    Если ФоновоеЗадание <> Неопределено И ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
        Результат.Выполнено = Истина;
       // Результат.ТекстРезультата = ФоновоеЗадание.ПолучитьРезультат();
	   ФоновоеЗадание.Отменить();
    КонецЕсли;
    
    Возврат Результат;
КонецФункции     

&НаСервере
Процедура ОбработатьСообщениеФЗ(Сообщ)
	Поз = Найти(Сообщ, ";");
	НомерЗБ = Лев(Сообщ, Поз-1);
	Сообщ = Сред(Сообщ, Поз+1);
	
	Поз = Найти(Сообщ, ";"); 
	ПроцентнаяСтавка = СокрЛП(Лев(Сообщ, Поз-1));
	Сообщ = Сред(Сообщ, Поз+1);

	Поз = Найти(Сообщ, ";"); 
	СуммаПроцентовВДень = СокрЛП(Лев(Сообщ, Поз-1));
	Сообщ = Сред(Сообщ, Поз+1);
	
	Поз = Найти(Сообщ, ";");   
	//Попытка
	    Долг = Число(СокрЛП(Лев(Сообщ, Поз-1))); 
	//Исключение   
	//	Долг = 0;
	//КонецПопытки;   
	Сообщ = Сред(Сообщ, Поз+1);
	
	ЕстьДоверенность = СокрЛП(Сообщ);
	
	Отбор = Новый Структура;
	Отбор.Вставить("НомерЗБ", НомерЗБ);
	СтрокиЗБ = ТаблицаЗБ.НайтиСтроки(Отбор);
	Если НЕ СтрокиЗБ.Количество() = 0 Тогда 
		 СтрЗБ = СтрокиЗБ.Получить(0); 
		 СтрЗБ.ПроцентнаяСтавка = ПроцентнаяСтавка;
		 СтрЗБ.СуммаПроцентовВДень = СуммаПроцентовВДень; 
		 СтрЗБ.Долг = Долг;  
		 СтрЗБ.Доверенность = ?(ЕстьДоверенность = "да", истина, ложь);  
		 
		 //+МАН 05.12.25 Заполнение подвала
		 Элементы.ТаблицаЗБДолг.ТекстПодвала = ТаблицаЗБ.Итог("Долг");
		 //-МАН
		 
		 Элементы.ТаблицаЗБ.Обновить();
    КонецЕсли;
КонецПроцедуры 

&НаСервере
Процедура ПолучитьКонтактнуюИнформацию()  
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Пол КАК Пол,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаСмерти КАК ДатаСмерти,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК Телефон,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПрописке КАК АдресПоПрописке,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ФактическийАдрес КАК ФактическийАдрес
	               |ИЗ
	               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда   
		Фамилия = Выборка.Фамилия;
		Имя = Выборка.Имя;
		Отчество = Выборка.Отчество;
		ФИО = СокрЛП(Выборка.Фамилия) + " " + СокрЛП(Выборка.Имя) + ?(ПустаяСтрока(Выборка.Отчество), "", " " + СокрЛП(Выборка.Отчество)); 
		ДатаРождения = Выборка.ДатаРождения; 
		ДатаСмерти = Выборка.ДатаСмерти;
		Пол = Выборка.Пол; 
		Телефон = Выборка.Телефон;
		АдресПоПрописке = Выборка.АдресПоПрописке;
		ФактическийАдрес = Выборка.ФактическийАдрес;
	Иначе
		ФИО = "ФИО клиента не определено";
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ЖурналКО(Команда)
	ОткрытьФорму("ОбщаяФорма.ЛБ_ЖурналКассовыхОпераций", , ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


&НаКлиенте
Процедура ЖурналНакладных(Команда)
	ОткрытьФорму("ОбщаяФорма.ЛБ_ЖурналНакладныхНаОтгрузку", , ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЖурналПеремещений(Команда)
	ОткрытьФорму("ОбщаяФорма.ЛБ_ЖурналПеремещенийОбъектовЗалога", , ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


&НаКлиенте
Процедура УчетОтходовДМ(Команда)
	ОткрытьФорму("ЖурналДокументов.ЛБ_УчетОтходовДМ.Форма.ФормаСписка",, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


&НаКлиенте
Процедура Прейскурант(Команда) 	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Действующие", Истина); 
	Если ЗначениеЗаполнено(ТекущийЛомбард) Тогда
		ПараметрыФормы.Вставить("Ломбард", ТекущийЛомбард);
		ОткрытьФорму("ОбщаяФорма.ЛБ_ЖурналПриказов", Параметрыформы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе     
		ВыбранныйЛомбард = ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ПустаяСсылка");//ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();
		Если ВвестиЗначение(ВыбранныйЛомбард, "Выберите ломбард", Тип("СправочникСсылка.ЛБ_Ломбарды")) Тогда 
			ПараметрыФормы.Вставить("Ломбард", ВыбранныйЛомбард); 
			ОткрытьФорму("ОбщаяФорма.ЛБ_ЖурналПриказов", Параметрыформы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ИнвентризацияОЗ(Команда)
	Отбор = Новый Структура("Ломбард", ТекущийЛомбард);
	
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	
	ОткрытьФорму("Документ.ЛБ_Инвентаризация.Форма.ФормаСписка", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


&НаКлиенте
Процедура ИнвентаризацияДС(Команда)
	Отбор = Новый Структура("Ломбард", ТекущийЛомбард);
	
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	
	ОткрытьФорму("Документ.ЛБ_ИнвентаризацияДС.Форма.ФормаСписка", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


&НаКлиенте
Процедура ИнвентаризацияОтходовДМ(Команда)
	Отбор = Новый Структура("Ломбард", ТекущийЛомбард);
	
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	
	ОткрытьФорму("Документ.ЛБ_ИнвентаризацияОтходовДМ.Форма.ФормаСписка", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура КарточкаКлиента(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Залогодатель", Залогодатель);	
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеИзмененияКарточки",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_КарточкаЗалогодателя", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры 

&НаСервере
Процедура ПослеИзмененияКарточки(Результат, ДопПараметры) Экспорт
	ПолучитьКонтактнуюИнформацию();
	ИнформацияОКлиенте = ЗаполнитьИнформациюОКлиенте();  
	ЗаполнитьИнформациюОКлиентеДополнительно();   
	СтатусыКлиента = ЗаполнитьСтатусыКлиента(); 
	Элементы.ИнформацияОКлиенте.Высота = ИнформацияОКлиенте.ВысотаТаблицы;
	Элементы.СтатусыКлиента.Высота = СтатусыКлиента.ВысотаТаблицы;
КонецПроцедуры	


&НаКлиенте
Процедура СтатистикаОбращений(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Клиент", Залогодатель);
							
	ОткрытьФорму("Отчет.ЛБ_СтатистикаОбращенийКлиента.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗаключитьЭДО(Команда)
	ЛБ_СоглашенияЭДОКлиент.ОбработкаКоманд(Команда.Имя, Залогодатель,,,ЭтаФорма);
	НаличиеЭДО = ЛБ_СоглашенияЭДОСервер.НаличиеДействующегоСоглашения(Залогодатель);
	
	Если НаличиеЭДО Тогда
		Элементы.СтатусЭДО.Заголовок = "есть";
	Иначе
		Элементы.СтатусЭДО.Заголовок = "нет";
	КонецЕсли;
	
	//+МАН 28.01.26 Заявка 3649
	ОформлениеЭДО(НаличиеЭДО);
	//-МАН
КонецПроцедуры

&НаКлиенте
Процедура РасторгнутьЭДОКлиент(Команда)
	ОписаниеОповещенияРасторгнутьЭДОКлиентПродолжить = Новый ОписаниеОповещения("РасторгнутьЭДОКлиентПродолжить", Этаформа);
	//ЛБ_СоглашенияЭДОКлиент.ОбработкаКоманд(Команда.Имя, Залогодатель, ОписаниеОповещенияСтатусЭДО);
	ЛБ_СоглашенияЭДОКлиент.ОбработкаКоманд(Команда.Имя, Залогодатель,ОписаниеОповещенияРасторгнутьЭДОКлиентПродолжить,,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура РасторгнутьЭДО_ЦО(Команда)
	ЛБ_СоглашенияЭДОКлиент.ОбработкаКоманд(Команда.Имя, Залогодатель);
	НаличиеЭДО = ЛБ_СоглашенияЭДОСервер.НаличиеДействующегоСоглашения(Залогодатель);
	
	Если НаличиеЭДО Тогда
		Элементы.СтатусЭДО.Заголовок = "есть";
	Иначе
		Элементы.СтатусЭДО.Заголовок = "нет";
	КонецЕсли;
	
	//+МАН 28.01.26 Заявка 3649
	ОформлениеЭДО(НаличиеЭДО);
	//-МАН
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусЭДО(Результат, ДополнительныеПараметры) Экспорт
	НаличиеЭДО = ЛБ_СоглашенияЭДОСервер.НаличиеДействующегоСоглашения(Залогодатель);
	
	Если НаличиеЭДО Тогда
		Элементы.СтатусЭДО.Заголовок = "есть";
	Иначе
		Элементы.СтатусЭДО.Заголовок = "нет";
	КонецЕсли;
	
	//+МАН 28.01.26 Заявка 3649
	ОформлениеЭДО(НаличиеЭДО);
	//-МАН
КонецПроцедуры

&НаКлиенте
Процедура РасторгнутьЭДОКлиентПродолжить(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		Если Результат Тогда
			ОписаниеОповещенияРасторгнутьЭДОКлиентЗавершение = Новый ОписаниеОповещения("РасторгнутьЭДОКлиентЗавершение", ЭтотОбъект);
			ЛБ_СоглашенияЭДОКлиент.ОбработкаКоманд("РасторгнутьЭДОКлиентПродолжить", Залогодатель,ОписаниеОповещенияРасторгнутьЭДОКлиентЗавершение,,ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасторгнутьЭДОКлиентЗавершение(Результат, ДополнительныеПараметры) Экспорт
	ОтветРасторжениеПодписано = Вопрос("Заявление о расторжении ЭДО подписано клиентом?",
	РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да);
	Если ОтветРасторжениеПодписано = КодВозвратаДиалога.Да Тогда
		РезультатРасторженияЭДО = ЛБ_СоглашенияЭДОСервер.РасторгнутьЭДОСервер(Залогодатель);
		Если РезультатРасторженияЭДО Тогда
			Элементы.СтатусЭДО.Заголовок = "нет";
			//+МАН 28.01.26 Заявка 3649
			Элементы.СтатусЭДО.ЦветТекста = WebЦвета.Красный;
			//-МАН
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЭДО(Команда)
	ЛБ_СоглашенияЭДОКлиент.ОбработкаКоманд(Команда.Имя, Залогодатель);
	НаличиеЭДО = ЛБ_СоглашенияЭДОСервер.НаличиеДействующегоСоглашения(Залогодатель);
	
	Если НаличиеЭДО Тогда
		Элементы.СтатусЭДО.Заголовок = "есть";
	Иначе
		Элементы.СтатусЭДО.Заголовок = "нет";
	КонецЕсли;	
	
	//+МАН 28.01.26 Заявка 3649
	ОформлениеЭДО(НаличиеЭДО);
	//-МАН
КонецПроцедуры

&НаКлиенте
Процедура СтатусЭДОНажатие(Элемент)
	ЛБ_СоглашенияЭДОКлиент.ОбработкаКоманд("ИсторияЭДО", Залогодатель);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСогласиеОбЭДО(Команда)
	ЛБ_СоглашенияЭДОКлиент.ОбработкаКоманд(Команда.Имя, Залогодатель,,,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьРасторженияЭДО(Команда)
	ЛБ_СоглашенияЭДОКлиент.ОбработкаКоманд(Команда.Имя, Залогодатель,,,ЭтаФорма);
КонецПроцедуры


&НаКлиенте
Процедура СогласиеНаИнформирование(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТекущееСостояниеЗБ(Команда)
	ТекСтрока = Элементы.ТаблицаЗБ.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда 
		Параметрыформы = Новый структура;
		Параметрыформы.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет); 
		ОписаниеОповещения = новый ОписаниеОповещения("ПослеВыбораТекущееСостояниеЗБ",Этаформа, );
		ОткрытьФорму("ОбщаяФорма.ЛБ_ТекущееСостояниеЗалога", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры    

&НаКлиенте
Процедура ПослеВыбораТекущееСостояниеЗБ(Результат,Параметры) Экспорт  
	ИнформацияОКлиенте = ЗаполнитьИнформациюОКлиенте();
	ЗаполнитьИнформациюОКлиентеДополнительно();
	СтатусыКлиента = ЗаполнитьСтатусыКлиента();    
	ТекСтрока = Элементы.ТаблицаЗБ.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда
	    ПерезаполнитьСтрокуПоЗБ(ТекСтрока.ПолучитьИдентификатор());
	Иначе  
		ПерезаполнитьСтрокуПоЗБ();
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ИсторияЗБ(Команда)
	ТекСтрока = Элементы.ТаблицаЗБ.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда 
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Клиент", Залогодатель);
		ПараметрыФормы.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет);	 
								
		ОткрытьФорму("Отчет.ЛБ_ИсторияЗалоговогоБилета.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВыборЗБПриИзменении(Элемент)
	Если ВыборЗБ = 3 Тогда 
		Параметрыформы = Новый структура;
		Параметрыформы.Вставить("НомерЗБ", НомерЗБ);  
		ОбработкаВвода = Новый ОписаниеОповещения("ПослеВводаНомераЗБ", ЭтаФорма);
		ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаВводаНомераЗБ", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВвода, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе      
		Если Элементы.Ломбард.СписокВыбора.Количество() = 0 Тогда
		    ЗаполнитьСписокЛомбардов();  
		КонецЕсли;	
		УстановитьОтборНаСервере();  
		Элементы.НомерЗБ.Видимость = Ложь; 
		ТекущийВыборЗБ = ВыборЗБ;
	КонецЕсли;	
КонецПроцедуры  

&НаКлиенте
Процедура ПослеВводаНомераЗБ(Результат, ДопПараметры) Экспорт  
	Если Результат = Неопределено Тогда
		ВыборЗБ = ТекущийВыборЗБ;
		Возврат;
	КонецЕсли;
	
	НомерЗБ = Результат;
	СообщениеЗБ = ПолучитьЗБОдин();  
	Если Пустаястрока(СообщениеЗБ) Тогда
		Элементы.НомерЗБ.Видимость = Истина;   
		СтрокаНомерЗБ = "№ ЗБ " + СокрЛП(НомерЗБ); 			
		ТекущийВыборЗБ = 3; 
	Иначе      
		Предупреждение(СообщениеЗБ, 60);
		ОбработкаВвода = Новый ОписаниеОповещения("ПослеВводаНомераЗБ", ЭтаФорма);
		ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаВводаНомераЗБ", , ЭтаФорма,,,,ОбработкаВвода, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьЗБОдин() 
	ЗБ = ЛБ_ОбщийМодуль.ПолучитьЗБПоНомеру(СокрЛП(НомерЗБ), Ложь);  
	Если ЗначениеЗаполнено(ЗБ) Тогда
		Если ЗБ.Залогодатель = Залогодатель Тогда
			Элементы.Ломбард.СписокВыбора.Очистить();
			Ломбард = Справочники.ЛБ_Ломбарды.ПустаяСсылка();
		   	УстановитьОтборНаСервере(ЗБ);
	        Возврат "";  
		Иначе
			Возврат "Залоговый билет клиента № " + СокрЛП(НомерЗБ) + " не найден!";
		КонецЕсли;
	Иначе 
		Возврат "Залоговый билет клиента № " + СокрЛП(НомерЗБ) + " не найден!";
	КонецЕсли;	
КонецФункции

&НаСервере
Процедура УстановитьОтборНаСервере(ЗБ = неопределено)
   Отбор = Новый Структура;
   Если НЕ ЗБ = неопределено Тогда
	   Отбор.Вставить("ЗалоговыйБилет", ЗБ);
   Иначе
	   Если ЗначениеЗаполнено(Ломбард) Тогда
		   Отбор.Вставить("Ломбард", Ломбард);
	   КонецЕсли;	
	   Если ВыборЗБ = 2 Тогда 
		   Отбор.Вставить("Действующий", Истина);
	   КонецЕсли;	   
   КонецЕсли;	   

   Элементы.ТаблицаЗБ.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
   
   //+МАН 05.12.25 Заполнение подвала
   ЗаполнитьПодвал(Отбор);
   //-МАН
   
  Элементы.ТаблицаЗБ.Обновить();
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокЗБ(НовыйКлиент = Ложь) 	
	ТаблицаЗапроса = ЛБ_ОбщийМодуль.ПолучитьСписокЗБКлиента(Залогодатель);   
	ЗаполнитьТаблицуЗБ(ТаблицаЗапроса, НовыйКлиент)
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьСписокЛомбардов()
	Элементы.Ломбард.СписокВыбора.Очистить(); 
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	Если ТекПользователь.ЭтоЛомбард Тогда
		ТекЛомбард = ПараметрыСеанса.ТекущийЛомбард;  
		//+МАН 28.01.26 Заявка 3649
		ТЗЛомбардыОтделения = ПолучитьЛомбардыОтделения(ТекЛомбард);
		//-МАН
	Иначе
		ТекЛомбард = неопределено;
	КонецЕсли;  

	//+МАН 28.01.26 Изменение порядка ломбардов в списке выбора. Заявка 3649
	ТЗЛомбарды = ТаблицаЗБ.Выгрузить(, "Ломбард");
	ТЗЛомбарды.Свернуть("Ломбард");
			
	Если ТекЛомбард <> Неопределено Тогда
		Если ТЗЛомбардыОтделения <> Неопределено Тогда
			
			МассивУдалениИзСпискаЛомбардов = Новый Массив;
			МассивУдалениИзСпискаОтделения = Новый Массив;
			
			Для каждого СтрЛомб Из ТЗЛомбардыОтделения Цикл
				Отбор = Новый Структура;
				Отбор.Вставить("Ломбард", СтрЛомб.Ломбард);
				
				НайденныйЛомбард = ТЗЛомбарды.НайтиСтроки(Отбор);
				
				Если СтрЛомб.Ломбард = ТекЛомбард И НайденныйЛомбард.Количество() > 0 Тогда
					МассивУдалениИзСпискаЛомбардов.Добавить(НайденныйЛомбард[0]);
					МассивУдалениИзСпискаОтделения.Добавить(СтрЛомб);
				ИначеЕсли НайденныйЛомбард.Количество() > 0 Тогда
					МассивУдалениИзСпискаЛомбардов.Добавить(НайденныйЛомбард[0]);
				Иначе
					МассивУдалениИзСпискаОтделения.Добавить(СтрЛомб);
				КонецЕсли;
			КонецЦикла;
			
			Для каждого СтрМ Из МассивУдалениИзСпискаЛомбардов Цикл
				ТЗЛомбарды.Удалить(СтрМ);
			КонецЦикла;
			
			Для каждого СтрМ Из МассивУдалениИзСпискаОтделения Цикл
				ТЗЛомбардыОтделения.Удалить(СтрМ);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	//+МАН 28.01.26 Закомментировал, то что было ранее.
	//Для каждого Стр Из ТаблицаЗБ цикл  
	//	Если Элементы.Ломбард.СписокВыбора.НайтиПоЗначению(стр.Ломбард) = неопределено Тогда 
	//		Если НЕ стр.Ломбард = ТекЛомбард Тогда
	//		    Элементы.Ломбард.СписокВыбора.Добавить(стр.Ломбард, стр.Ломбард.НаименованиеПолное);  
	//		КонецЕсли;	
	//	КонецЕсли;	
	//Конеццикла;      	
	//Элементы.Ломбард.СписокВыбора.СортироватьПоПредставлению();

	ТЗЛомбарды = СортироватьТЗЛомбарды(ТЗЛомбарды);
	
	Для каждого Стр Из ТЗЛомбарды Цикл
		Если Элементы.Ломбард.СписокВыбора.НайтиПоЗначению(стр.Ломбард) = Неопределено Тогда
		    Элементы.Ломбард.СписокВыбора.Добавить(стр.Ломбард, стр.Ломбард.НаименованиеПолное);
		КонецЕсли;
	Конеццикла;
	
	//Элементы.Ломбард.СписокВыбора.СортироватьПоПредставлению();
	
	Если ТекЛомбард <> Неопределено Тогда
		Для каждого Стр Из ТЗЛомбардыОтделения Цикл
			Если Элементы.Ломбард.СписокВыбора.НайтиПоЗначению(стр.Ломбард) = Неопределено Тогда
				Элементы.Ломбард.СписокВыбора.Вставить(0, стр.Ломбард, стр.Ломбард.НаименованиеПолное); 
			КонецЕсли;
		Конеццикла;
	КонецЕсли;
	//-МАН
	
	Если НЕ ТекЛомбард = неопределено Тогда
		Элементы.Ломбард.СписокВыбора.Вставить(0, ТекЛомбард, ТекЛомбард.НаименованиеПолное); 
	КонецЕсли;	
	Если Элементы.Ломбард.СписокВыбора.Количество() > 1 Тогда 
		Элементы.Ломбард.СписокВыбора.Добавить(Справочники.ЛБ_Ломбарды.ПустаяСсылка(), "Все ломбарды");
	КонецЕсли;    
	Если НЕ ЗначениеЗаполнено(Ломбард) Тогда
		Если Элементы.Ломбард.СписокВыбора.Количество() > 0 Тогда 
			Если НЕ ТекЛомбард = неопределено Тогда
		         Ломбард = Элементы.Ломбард.СписокВыбора.Получить(0).Значение;
			Иначе
				 Ломбард = Справочники.ЛБ_Ломбарды.ПустаяСсылка();
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьСтрокуТаблицыЗБ(Стр, НоваяСтр, НовыйКлиент = Ложь)
	НоваяСтр.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
	НоваяСтр.ДатаЗБ = Стр.ЗалоговыйБилет.Дата;
	НоваяСтр.НомерЗБ = Стр.ЗалоговыйБилет.НомерЗалоговогоБилета;
	НоваяСтр.Ломбард = Стр.Ломбард;
	НоваяСтр.СтатусЗалоговогоБилета = Стр.СтатусЗалоговогоБилета;
	НоваяСтр.СуммаЗайма = Стр.ЗалоговыйБилет.СуммаСсуды;  
	НоваяСтр.СуммаОценки = Стр.ЗалоговыйБилет.Товары.Итог("СуммаОценкиМаксимальная"); 
	НоваяСтр.ДатаВозврата = стр.ДатаВыкупа; 
	НоваяСтр.ДатаВозвратаЛьготная = стр.ДатаВыкупаЛьготныйСрок; 
	НоваяСтр.Действующий = стр.Действующий;   
	Если стр.Действующий Тогда
	    НоваяСтр.ТекСрокЗайма = (НачалоДня(ТекущаяДатаСеанса()) - НачалоДня(Стр.ЗалоговыйБилет.Дата)) / (60 * 60 * 24);  
	Иначе
		НоваяСтр.ТекСрокЗайма = 0;
	КонецЕсли;	
		
	Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("ЗалоговыйБилет", Стр.ЗалоговыйБилет); 
	Запрос.УстановитьПараметр("Дата", Стр.ЗалоговыйБилет.Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПредельныйСрокЗайма КАК ПредельныйСрокЗайма,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПредельныйСрокЗаймаДни КАК ПредельныйСрокЗаймаДни
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&Дата, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда  
	    ПредельныйСрокЗайма = Выборка.ПредельныйСрокЗайма;
		ПредельныйСрокЗаймаДни = Выборка.ПредельныйСрокЗаймаДни;
		НоваяСтр.ПСЗ = Формат(ПредельныйСрокЗайма, "ДФ=dd.MM.yyyy") + " (" + Строка(ПредельныйСрокЗаймаДни) + ")";
		//+МАН 28.01.26 Заявка 3649
		НоваяСтр.ПСЗДни = ПредельныйСрокЗаймаДни;
		//-МАН
	КонецЕсли;  
	СК = ?(Не ПустаяСтрока(Стр.СхемаКредитования.НаименованиеДляПечати), Стр.СхемаКредитования.НаименованиеДляПечати, Стр.СхемаКредитования.Наименование);  
    НоваяСтр.ВидСрок = СокрЛП(СК) + "/" + Строка(Стр.ЗалоговыйБилет.срокЗалога);  
	НоваяСтр.ГибкийПроцент = Стр.СхемаКредитования.ПризнакПримененияГибкогоПроцента;   
	НоваяСтр.ПричинаПрименения = Стр.ПричинаПрименения;
	НоваяСтр.ДатаНачалаРасчетаПроцентов = Стр.ДатаНачалаРасчетаПроцентов; 
	Если НЕ НовыйКлиент Тогда
		НачисленоПроценты = 0;
		НачисленияОстановлены = Ложь;
		Если Стр.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят ИЛИ 
			 Стр.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен ИЛИ
			 Стр.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Остановлен Тогда   
			НачисленияОстановлены = Истина;
		КонецЕсли;	

		Если НЕ ДатаСмерти = Дата(1,1,1) Тогда   
			ПредыдущийСтатусЗБ = ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(ДатаСмерти-1, Стр.ЗалоговыйБилет); 
			Если ПредыдущийСтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят ИЛИ 
			     ПредыдущийСтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен ИЛИ
			     ПредыдущийСтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Остановлен Тогда 
				НачисленияОстановлены = Истина; 
			КонецЕсли; 
		КонецЕсли;

		Если НЕ Стр.СуммаЗайма = 0 Тогда 
			СтавкаП = ЛБ_УправлениеЛомбардом.ПолучитьТекущуюПроцентнуюСтавку(Стр.ЗалоговыйБилет, Стр.ПричинаПрименения); 
			НоваяСтр.ПроцентнаяСтавка = Формат(СтавкаП, "ЧЦ=10; ЧДЦ=3"); 
			Если НачисленияОстановлены Тогда  
				НачисленоПроценты = ЛБ_ОбщийМодуль.ПолучитьОстатокПроцентов(, Стр.ЗалоговыйБилет);
				НоваяСтр.СуммаПроцентовВДень = "0,00";
			Иначе	
				ВидОкругленияСуммыПроцентов = ЛБ_УправлениеЛомбардом.ПолучитьВидОкругленияСуммыПроцентов(Стр.ЗалоговыйБилет.Дата);
				Если ВидОкругленияСуммыПроцентов = Перечисления.ЛБ_ВидыОкругленияСуммыПроцентов.ОкруглениеПослеУмноженияНаКоличествоДней Тогда
			        НоваяСтр.СуммаПроцентовВДень = Формат(Стр.СуммаЗайма*СтавкаП/100, "ЧЦ=15; ЧДЦ=5");   
				Иначе
					НоваяСтр.СуммаПроцентовВДень = Формат(Стр.СуммаЗайма*СтавкаП/100, "ЧЦ=15; ЧДЦ=2");
				КонецЕсли;		
				
				НачисленоПроценты = ЛБ_УправлениеЛомбардом.РасчитатьДолгПоПроцентам(ТекущаяДатаСеанса(), Стр.ЗалоговыйБилет, Стр.СуммаЗайма, Стр.ПричинаПрименения, Стр.ДатаНачалаРасчетаПроцентов);
			КонецЕсли; 
		Иначе
			НоваяСтр.ПроцентнаяСтавка = "";
			НоваяСтр.СуммаПроцентовВДень = "";
		КонецЕсли;	
		НоваяСтр.Долг = Стр.СуммаЗайма + НачисленоПроценты;
		НоваяСтр.Доверенность = ЛБ_УправлениеЛомбардом.ЕстьДоверенности(Стр.ЗалоговыйБилет); 
	КонецЕсли;	
КонецПроцедуры    

&НаСервере
Процедура ЗаполнитьТаблицуЗБ(ТаблицаЗапроса, НовыйКлиент)
	ТаблицаЗБ.Очистить();
	Для каждого Стр Из ТаблицаЗапроса Цикл
		НоваяСтр = ТаблицаЗБ.Добавить();   
		ЗаполнитьСтрокуТаблицыЗБ(Стр, НоваяСтр, НовыйКлиент);
	КонецЦикла;	
	ТаблицаЗБ.Сортировать("ДатаЗБ Убыв"); 

	//+МАН 05.12.25 Заполнение подвала
	ЗаполнитьПодвал();
	//-МАН
	
	Элементы.ТаблицаЗБ.Обновить();
КонецПроцедуры	

&НаСервере
Процедура ПерезаполнитьСтрокуПоЗБ(Идентификатор = неопределено)  
	Если НЕ Идентификатор = неопределено Тогда 
		СтрТаб = ТаблицаЗБ.НайтиПоИдентификатору(Идентификатор);
		ТаблицаЗапроса = ЛБ_ОбщийМодуль.ПолучитьСписокЗБКлиента(Залогодатель, СтрТаб.ЗалоговыйБилет);
		Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
			Стр = ТаблицаЗапроса.Получить(0);
		    ЗаполнитьСтрокуТаблицыЗБ(Стр, СтрТаб);
			
			Если СтрТаб.ЗалоговыйБилет.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда 
				ТаблицаЗапросаП = ЛБ_ОбщийМодуль.ПолучитьСписокЗБКлиента(Залогодатель, СтрТаб.ЗалоговыйБилет.ПредыдущаяОперация);
				Если НЕ ТаблицаЗапросаП.Количество() = 0 Тогда
					Стр = ТаблицаЗапросаП.Получить(0);        
					Отбор = Новый Структура;
					Отбор.Вставить("ЗалоговыйБилет", Стр.ЗалоговыйБилет);
					СтрокиЗБ = ТаблицаЗБ.НайтиСтроки(Отбор); 
					Если НЕ СтрокиЗБ.Количество() = 0 Тогда 
						СтрТаб = СтрокиЗБ.Получить(0);
				        ЗаполнитьСтрокуТаблицыЗБ(Стр, СтрТаб);
					КонецЕсли;	
                КонецЕсли;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	
	//проверим создание нового ЗБ 
	ТаблицаЗапроса = ЛБ_ОбщийМодуль.ПолучитьСписокЗБКлиента(Залогодатель);
	Для каждого Стр из ТаблицаЗапроса Цикл  
		Отбор = Новый Структура;
		Отбор.Вставить("ЗалоговыйБилет", Стр.ЗалоговыйБилет); 
		Строки = ТаблицаЗБ.НайтиСтроки(Отбор);
		Если Строки.Количество() = 0 Тогда  
			НоваяСтр = ТаблицаЗБ.Добавить();   
		    ЗаполнитьСтрокуТаблицыЗБ(Стр, НоваяСтр);
			Элементы.ТаблицаЗБ.ТекущаяСтрока = НоваяСтр.ПолучитьИдентификатор();
		КонецЕсли;	
	КонецЦикла;	
	ТаблицаЗБ.Сортировать("ДатаЗБ Убыв");  
	
	ИнформацияОКлиенте = ЗаполнитьИнформациюОКлиенте();
	ЗаполнитьИнформациюОКлиентеДополнительно();
	СтатусыКлиента = ЗаполнитьСтатусыКлиента();    
	//+МАН 05.12.25 Заполнение подвала
	ЗаполнитьПодвал();
	//-МАН
КонецПроцедуры	

&НаКлиенте
Процедура ЛомбардПриИзменении(Элемент)
	УстановитьОтборНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗБВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтрока = Элементы.ТаблицаЗБ.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда 
		Параметрыформы = Новый структура;
		Параметрыформы.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет); 
		ОписаниеОповещения = новый ОписаниеОповещения("ПослеВыбораТекущееСостояниеЗБ",Этаформа, );
		ОткрытьФорму("ОбщаяФорма.ЛБ_ТекущееСостояниеЗалога", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Расчеты(Команда)  
	ТекСтрока = Элементы.ТаблицаЗБ.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда 
		ПараметрыФормы = Новый Структура;  
		ПараметрыФормы.Вставить("Клиент", Залогодатель);
		ПараметрыФормы.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет);	
									
		//+МАН 19.02.26 Заявка 3649
		ПараметрыФормы.Вставить("Детально", Истина);
		//-МАН
		
		ОткрытьФорму("Отчет.ЛБ_НачисленныеПроцентыПоДоговоруЗайма.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПроверкаПоПеречням(Клиент)
	ЛБ_УправлениеЛомбардом.ПроверкаКлиентаПоПеречням(ТекущаяДата(), Клиент); 
КонецПроцедуры

&НаСервере
Функция ПроверитьКлиента()
	СтруктураПроверки = ЛБ_ОбщегоНазначения.ПроверитьКлиентаПоПеречням(Залогодатель);

	Возврат СтруктураПроверки.Совпадение;
КонецФункции

&НаСервере
Функция ПроверитьПоПеречнюНедружественныхСтран(Гражданство)
	Возврат ЛБ_УправлениеЛомбардом.ПроверитьПоПеречнюНедружественныхСтран(Гражданство);
КонецФункции 

&НаСервере
Функция ПроверитьДокументыПравоПребыванияРФ(Клиент, ГражданствоКлиента)
	ЕстьДопДокумент = Ложь;
	Запрос = Новый Запрос;    
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса()); 
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("Гражданство", ГражданствоКлиента);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя КАК ДокументЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНеДействителен КАК ДокументНеДействителен,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(
	               |			&Дата,
	               |			ДокументЗалогодателя.Владелец = &Клиент
	               |				И Гражданство = &Гражданство
	               |				И ВидДокументаЗалогодателя = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийПравоПребыванияРФ)
	               |				И ОсновнойДоп = ИСТИНА) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() цикл
		Если Выборка.ДокументНЕДействителен Тогда
			Продолжить;
		КонецЕсли;	
		Если ЛБ_ОбщийМодуль.ДокументСоСрокомДействия(ГражданствоКлиента, Выборка.ВидДокументаЗалогодателя, Выборка.ВидДокумента) Тогда
			Если Выборка.ДокументСрокДействия < НачалоДня(ТекущаяДатаСеанса()) Тогда
				Продолжить;
			КонецЕсли;	
            ЕстьДопДокумент = Истина;
			Прервать;
		Иначе	
			ЕстьДопДокумент = Истина;
			Прервать;
		КонецЕсли;	
	Конеццикла;	  
	Возврат ЕстьДопДокумент;
КонецФункции

&НаКлиенте
Процедура ВыдачаЗайма(Команда) 
	Если НЕ ДатаСмерти = Дата(1,1,1) Тогда
		Сообщить("Дата смерти клиента " + Формат(ДатаСмерти, "ДФ=dd.MM.yyyy") + ". Выдача займа не возможна.");
		Возврат;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(ОсновнойДУЛ) Тогда
		Сообщить("Основной документ удостоверяющий личность клиента по которому возможна выдача займа не найден!", 60); 
		Возврат; 
	ИначеЕсли НЕ ОсновнойДУЛГражданство = ПредопределенноеЗначение("Справочник.СтраныМира.Россия") Тогда
		Если ПроверитьПоПеречнюНедружественныхСтран(ОсновнойДУЛГражданство) Тогда
			Сообщить("Клиент предъявил документ государства не дружественного по отношению к России. Выдача ссуды по этому документу не возможна.");
			Возврат;
		КонецЕсли;	
		Если НЕ ПроверитьДокументыПравоПребыванияРФ(Залогодатель, ОсновнойДУЛГражданство) Тогда 
			Сообщить("Не найдены основные документы, подверждающие право клиента на пребывание В РФ!");
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	
	ЕстьСовпадение = ПроверитьКлиента();
	Если ЕстьСовпадение Тогда 
		Возврат;
	КонецЕсли;	
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Залогодатель", Залогодатель); 
	СтруктураПараметров.Вставить("ДатаРождения", ЭтаФорма.ДатаРождения);
	СтруктураПараметров.Вставить("ДокументЗалогодателя", ОсновнойДУЛ);
			
	ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаВыдачиЗайма", СтруктураПараметров, ЭтаФорма, Истина,,,);

КонецПроцедуры

&НаСервере
Функция ПолучитьНомерЗалоговогоБилета(ЗалоговыйБилет)  
	Возврат ЗалоговыйБилет.НомерЗалоговогоБилета;
КонецФункции

&НаКлиенте
Процедура ОплатаПроцентов(Команда) 
	ТекСтрока = Элементы.ТаблицаЗБ.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда
		ПараметрыФормы = Новый Структура; 
		ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов"));
		ПараметрыФормы.Вставить("Номер", ПолучитьНомерЗалоговогоБилета(ТекСтрока.ЗалоговыйБилет));
		ОписаниеОповещения = новый ОписаниеОповещения("ПослеВыбораЗалогодателяОплатаПроцентов",Этаформа, );	
		ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателяПоНомеруБилета",ПараметрыФормы,Этаформа,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
	КонецЕсли;	
КонецПроцедуры   

&НаКлиенте
Процедура ПослеВыбораЗалогодателяОплатаПроцентов(Результат,Параметры) Экспорт	
	Если НЕ ТипЗнч(Результат) = Тип("Структура") Тогда
		Возврат; 
	Иначе          
		Если НЕ Результат.Плательщик = Залогодатель Тогда
		     ПроверкаПоПеречням(Результат.Плательщик);
		КонецЕсли;	 
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗалоговыйБилет", Результат.ПредыдущаяОперация); 
		ПараметрыФормы.Вставить("Плательщик", Результат.Плательщик);
		ПараметрыФормы.Вставить("ДокументПлательщика", Результат.ДокументЗалогодателя);
		ПараметрыФормы.Вставить("Доверенность", Результат.Доверенность);
		//ОписаниеОповещения = новый ОписаниеОповещения("ПослеВыбораТекущееСостояниеЗБ", Этаформа);
		//ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаОплатыПроцентов", ПараметрыФормы, ЭтаФорма, Истина,,,ОписаниеОповещения); 
		ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаОплатыПроцентов", ПараметрыФормы, ЭтаФорма, Истина,,,);
	КонецЕсли;	
КонецПроцедуры 

&НаСервере
Функция ПолучитьСуммуЗайма(ЗалоговыйБилет) 
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаЗайма КАК СуммаЗайма
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СуммаЗайма;
	КонецЕсли;
	Возврат 0;
КонецФункции

&НаКлиенте
Процедура ВыдачаОХ(Команда)    
	ТекСтрока = Элементы.ТаблицаЗБ.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда 
		Если НЕ ТекСтрока.СтатусЗалоговогоБилета = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыЗалоговыхБилетов.ОтвественноеХранение") И
			 НЕ ТекСтрока.СтатусЗалоговогоБилета = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыЗалоговыхБилетов.Наследство") Тогда  
			ТекстПредупреждения = "Залоговый билет № " + СокрЛП(ТекСтрока.НомерЗБ) + " в статусе " + Строка(ТекСтрока.СтатусЗалоговогоБилета) + ". Выполнение операции невозможно.";  
			Предупреждение(ТекстПредупреждения, 60);
			Возврат;
		ИначеЕсли ТекСтрока.СтатусЗалоговогоБилета = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыЗалоговыхБилетов.Наследство") Тогда  
		     СуммаЗайма = ПолучитьСуммуЗайма(ТекСтрока.ЗалоговыйБилет); 
			 Если НЕ СуммаЗайма = 0 Тогда
				 ТекстПредупреждения = "Долг по залоговому билету № " + СокрЛП(ТекСтрока.НомерЗБ) + " в статусе " + Строка(ТекСтрока.СтатусЗалоговогоБилета) +
				      СокрЛП(Формат(СуммаЗайма, "ЧЦ=15; ЧДЦ=2")) + " рублей. Выполнение операции невозможно.";  
				 Предупреждение(ТекстПредупреждения, 60);
				 Возврат;
			 КонецЕсли;	 
		 КонецЕсли;
		 
		СообщениеМ = ПроверитьМестонахождениеОЗ(ТекСтрока.ЗалоговыйБилет);
		Если НЕ ПустаяСтрока(СообщениеМ) Тогда 
			Предупреждение(СообщениеМ, 60);
			Возврат;
		КонецЕсли;	

		СтруктураПараметров = Новый Структура("ВидОперации");
		СтруктураПараметров.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога");
		
		ПараметрыФормы = Новый Структура; 
		ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога"));
		ПараметрыФормы.Вставить("Номер", ПолучитьНомерЗалоговогоБилета(ТекСтрока.ЗалоговыйБилет));
		ОписаниеОповещения = новый ОписаниеОповещения("ПослеВыбораЗалогодателяВыдачаЗалога",Этаформа,СтруктураПараметров);	
		ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателяПоНомеруБилета",ПараметрыФормы,Этаформа,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЗалогодателяВыдачаЗалога(Результат,Параметры) Экспорт
	Если НЕ ТипЗнч(Результат) = Тип("Структура") Тогда
		Возврат; 
	Иначе         
		Если НЕ Результат.Получатель = Залогодатель Тогда
		    ПроверкаПоПеречням(Результат.Получатель); 
		КонецЕсли;	 
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗалоговыйБилет", Результат.ПредыдущаяОперация); 
		ПараметрыФормы.Вставить("Получатель", Результат.Получатель);
		ПараметрыФормы.Вставить("ДокументПолучателя", Результат.ДокументЗалогодателя);
		ПараметрыФормы.Вставить("Доверенность", Результат.Доверенность);
		//ОписаниеОповещения = новый ОписаниеОповещения("ПослеВыбораТекущееСостояниеЗБ", Этаформа);
		//ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаВыдачиЗалога", ПараметрыФормы, ЭтаФорма, Истина,,,ОписаниеОповещения);
		ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаВыдачиЗалога", ПараметрыФормы, ЭтаФорма, Истина,,,);
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Функция ПроверитьСтатусНакладной(ЗалоговыйБилет) 
	Возврат ЛБ_УправлениеЛомбардом.ПолучитьСтатусНакладнойПоЗБИзм(ТекущаяДатаСеанса(), ЗалоговыйБилет);
КонецФункции  

&НаСервере
Функция ПолучитьРеквизитыНакладной(НакладнаяНаОтгрузку)  
	СтруктураВ = Новый Структура;
	СтруктураВ.Вставить("Номер", НакладнаяНаОтгрузку.ПредставлениеНомераНакладной); 
	СтруктураВ.Вставить("Дата", НакладнаяНаОтгрузку.Дата);
	Возврат СтруктураВ; 
КонецФункции

&НаСервере
Функция ПроверитьМестонахождениеОЗ(ЗалоговыйБилет) 
	СообщениеМ = ЛБ_УправлениеЛомбардом.ПроверитьМестонахождениеОЗ(ЗалоговыйБилет, ТекущийЛомбард);
	Если НЕ ПустаяСтрока(СообщениеМ) Тогда
		СообщениеМ = СообщениеМ + символы.ПС + "Выполнение операции невозможно!"; 
	КонецЕсли;
	Возврат СообщениеМ;
КонецФункции

&НаКлиенте
Процедура Изъятие(Команда)  
	ТекСтрока = Элементы.ТаблицаЗБ.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда  
		Если ТекСтрока.СтатусЗалоговогоБилета = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыЗалоговыхБилетов.Закрыт") ИЛИ
			 ТекСтрока.СтатусЗалоговогоБилета = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыЗалоговыхБилетов.ОтказОтОформления") ИЛИ
			 ТекСтрока.СтатусЗалоговогоБилета = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыЗалоговыхБилетов.Реализован") Тогда  
			ТекстПредупреждения = "Залоговый билет № " + СокрЛП(ТекСтрока.НомерЗБ) + " в статусе " + Строка(ТекСтрока.СтатусЗалоговогоБилета) + ". Выполнение операции невозможно.";  
			Предупреждение(ТекстПредупреждения, 60);
			Возврат;
		КонецЕсли;	 
		
		СообщениеМ = ПроверитьМестонахождениеОЗ(ТекСтрока.ЗалоговыйБилет);
		Если НЕ ПустаяСтрока(СообщениеМ) Тогда 
			Предупреждение(СообщениеМ, 60);
			Возврат;
		КонецЕсли;	
		
		СтруктураНакладной = ПроверитьСтатусНакладной(ТекСтрока.ЗалоговыйБилет); 
		Если СтруктураНакладной = неопределено Тогда
			ЕстьВНакладной = Ложь;
		Иначе	         
			ЕстьВНакладной = Истина;
		    НакладнаяНаОтгрузку = СтруктураНакладной.НакладнаяНаОтгрузку; 
			СтатусНакладной = СтруктураНакладной.СтатусНакладной;
		КонецЕсли;
		Если ЕстьВНакладной Тогда    
		    СтруктураН = ПолучитьРеквизитыНакладной(НакладнаяНаОтгрузку);
            ТекстПредупреждения = "Внимание! Изделия по ЗБ № " + СокрЛП(ТекСтрока.НомерЗБ) + " в накладной № " + СокрЛП(СтруктураН.Номер)+ " от " + Формат(СтруктураН.Дата, "ДЛФ=DT");
		    Если СтатусНакладной = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыНакладнойНаОтгрузку.Отгружена") Тогда	
				ТекстПредупреждения = ТекстПредупреждения + " в статусе «Отгружено»." + Символы.ПС + "Для согласования возможности изъятия обратитесь в ЦО.";  
				Предупреждение(ТекстПредупреждения, 60);
				Возврат;
			ИначеЕсли СтатусНакладной = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыНакладнойНаОтгрузку.СумкаОткрыта") 
				ИЛИ  СтатусНакладной = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыНакладнойНаОтгрузку.СумкаЗакрыта") Тогда 
			   ТекстПредупреждения = ТекстПредупреждения + " в сумке." + Символы.ПС + "Для изъятия изделий из ЗБ измените статус накладной и вскройте сумку.";	  
			   Предупреждение(ТекстПредупреждения, 60);
			   Возврат;
	        КонецЕсли;	   
		КонецЕсли;		  
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет); 
		//ОписаниеОповещения = новый ОписаниеОповещения("ПослеВыбораТекущееСостояниеЗБ", Этаформа);
		//ОткрытьФорму("ОбщаяФорма.ЛБ_ИзъятиеОбъектовЗалога", ПараметрыФормы, ЭтаФорма, Истина,,,ОписаниеОповещения);
		ОткрытьФорму("ОбщаяФорма.ЛБ_ИзъятиеОбъектовЗалога", ПараметрыФормы, ЭтаФорма, Истина,,,);
	КонецЕсли;	
КонецПроцедуры   

&НаСервере
Функция ПолучитьНомерЛомбарда(ЛомбардЗБ) 
	Возврат ЛомбардЗБ.НомерЛомбарда;
КонецФункции	

&НаКлиенте
Процедура ВозвратИзъятого(Команда)
	ТекСтрока = Элементы.ТаблицаЗБ.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда  
		Если НЕ ТекСтрока.СтатусЗалоговогоБилета = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыЗалоговыхБилетов.Изъят") Тогда 
			 //НЕ ТекСтрока.СтатусЗалоговогоБилета = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыЗалоговыхБилетов.Наследство")  
			ТекстПредупреждения = "Залоговый билет № " + СокрЛП(ТекСтрока.НомерЗБ) + " в статусе " + Строка(ТекСтрока.СтатусЗалоговогоБилета) + ". Выполнение операции невозможно.";  
			Предупреждение(ТекстПредупреждения, 60);
			Возврат;    
		КонецЕсли;	
		
		Если НЕ ТекущийЛомбард = ТекСтрока.Ломбард Тогда
			ТекстПредупреждения =  " Договор займа по ЗБ № " + СокрЛП(ТекСтрока.НомерЗБ) + " оформлен в ломбарде № " + ПолучитьНомерЛомбарда(ТекСтрока.Ломбард) + ". Выполнение операции невозможно!";  
			Предупреждение(ТекстПредупреждения, 60);
			Возврат;
		КонецЕсли;	

		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет);
		//ОписаниеОповещения = новый ОписаниеОповещения("ПослеВыбораТекущееСостояниеЗБ", Этаформа);
		//ОткрытьФорму("ОбщаяФорма.ЛБ_ВозвратОбъектовЗалога", ПараметрыФормы, ЭтаФорма, Истина,,,ОписаниеОповещения); 
		ОткрытьФорму("ОбщаяФорма.ЛБ_ВозвратОбъектовЗалога", ПараметрыФормы, ЭтаФорма, Истина,,,);
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура Переоформление(Команда)   
	ТекСтрока = Элементы.ТаблицаЗБ.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда
		СтруктураПараметров = Новый Структура("ВидОперации");
		СтруктураПараметров.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление");
		
		ПараметрыФормы = Новый Структура; 
		ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление"));
		ПараметрыФормы.Вставить("Номер", ПолучитьНомерЗалоговогоБилета(ТекСтрока.ЗалоговыйБилет));
		ОписаниеОповещения = новый ОписаниеОповещения("ПослеВыбораЗалогодателяПереоформление",Этаформа,СтруктураПараметров);	
		ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателяПоНомеруБилета",ПараметрыФормы,Этаформа,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЗалогодателяПереоформление(Результат,Параметры) Экспорт
	Если НЕ ТипЗнч(Результат) = Тип("Структура") Тогда
		Возврат;		
	Иначе              
		//Если НЕ Результат.Представитель = Залогодатель Тогда
		//    ПроверкаПоПеречням(Результат.Представитель);
		//КонецЕсли;	
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ПредыдущаяОперация", Результат.ПредыдущаяОперация); 
		ПараметрыФормы.Вставить("Залогодатель", Результат.Залогодатель);
		ПараметрыФормы.Вставить("ДокументЗалогодателя", Результат.ДокументЗалогодателя); 
		Если Результат.Свойство("Представитель") Тогда  
			ПроверкаПоПеречням(Результат.Представитель);
			ПараметрыФормы.Вставить("Представитель", Результат.Представитель);
			ПараметрыФормы.Вставить("ДокументПредставителя", Результат.ДокументПредставителя);  
		КонецЕсли;	  
		Если Результат.Свойство("ДоверенностьПредставителя") Тогда 
			ПараметрыФормы.Вставить("ДоверенностьПредставителя", Результат.ДоверенностьПредставителя);  
		КонецЕсли;
		//ОписаниеОповещения = новый ОписаниеОповещения("ПослеВыбораТекущееСостояниеЗБ", Этаформа);
		//ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаПереоформленияЗайма", ПараметрыФормы, ЭтаФорма, Истина,,,ОписаниеОповещения); 
		ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаПереоформленияЗайма", ПараметрыФормы, ЭтаФорма, Истина,,,);
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура СоздатьОтменуОперацииПоЗайму(Команда)
	
	ТекСтрока = Элементы.ТаблицаЗБ.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда
	    ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаОплаты")); 
		ПараметрыФормы.Вставить("Номер", ПолучитьНомерЗалоговогоБилета(ТекСтрока.ЗалоговыйБилет));
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораОтменаОперацииПоЗайму", Этаформа); //,СтруктураПараметров);	 //Выполняем после поиска
		ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателяПоНомеруБилета", ПараметрыФормы, Этаформа,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораОтменаОперацииПоЗайму(Результат,Параметры) Экспорт
	
	Если НЕ ТипЗнч(Результат) = Тип("Структура") Тогда
		Возврат; 
	Иначе
		
		ОтменяемаяОперация = ПолучитьИнформациюОЗБ(Результат.НомерЗалоговогоБилета, ТекущаяДата());
		//ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораТекущееСостояниеЗБ", Этаформа);
		
		Если ОтменяемаяОперация.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов") Тогда 
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Документ", ОтменяемаяОперация.Документ);    
			ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаОплатыПроцентов", ПараметрыФормы, ЭтаФорма, Истина,,,);
		ИначеЕсли ОтменяемаяОперация.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ИзъятиеОбъектовЗалога") Тогда 
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Документ", ОтменяемаяОперация.Документ);    
			ОткрытьФорму("ОбщаяФорма.ЛБ_ИзъятиеОбъектовЗалога", ПараметрыФормы, ЭтаФорма, Истина,,,);
		ИначеЕсли ОтменяемаяОперация.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога") Тогда 
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Документ", ОтменяемаяОперация.Документ);    
			ОткрытьФорму("ОбщаяФорма.ЛБ_ВозвратОбъектовЗалога", ПараметрыФормы, ЭтаФорма, Истина,,,);
		ИначеЕсли ОтменяемаяОперация.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОстановкаПроцентов") Тогда 
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Документ", ОтменяемаяОперация.Документ);    
			ОткрытьФорму("ОбщаяФорма.ЛБ_ОстановкаНачисленияПроцентов", ПараметрыФормы, ЭтаФорма, Истина,,,);
		ИначеЕсли ОтменяемаяОперация.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление") Тогда 
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ЗалоговыйБилет", ОтменяемаяОперация.Документ); //ЗалоговыйБилет или Документ
			ОткрытьФорму("ОбщаяФорма.ЛБ_ОтменаПереоформленияЗайма", ПараметрыФормы, ЭтаФорма, Истина,,,);
		ИначеЕсли ОтменяемаяОперация.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог") Тогда 
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ЗалоговыйБилет", ОтменяемаяОперация.Документ);
			ОткрытьФорму("ОбщаяФорма.ЛБ_ОтменаВыдачиЗайма", ПараметрыФормы, ЭтаФорма, Истина,,,);
		ИначеЕсли ОтменяемаяОперация.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога") Тогда 
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Документ", ОтменяемаяОперация.Документ);
			ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаВыдачиЗалога", ПараметрыФормы, ЭтаФорма, Истина,,,);
		Иначе                           
			СтандартнаяОбработка = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

 &НаСервереБезКонтекста
Функция ПолучитьИнформациюОЗБ(НомерЗалоговогоБилета, Дата)
	
	Результат = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(НомерЗалоговогоБилета, Дата, Истина);
	
	ИнформацияОЗБ = Новый Структура;
	ИнформацияОЗБ.Вставить("Документ", Результат.Регистратор);
	ИнформацияОЗБ.Вставить("ВидОперации", Результат.Регистратор.ВидОперации);
	
	Возврат ИнформацияОЗБ;
	
КонецФункции


&НаСервере
Функция ПолучитьИзмененныйМакет(ИмяМакета, ИсходныйМакет = "")
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛБ_МакетыПечатныхФормСрезПоследних.Макет КАК Макет
		|ИЗ
		|	РегистрСведений.ЛБ_МакетыПечатныхФорм.СрезПоследних(&Период, ИсходныйМакет = &ИсходныйМакет) КАК ЛБ_МакетыПечатныхФормСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_МакетыПечатныхФормСрезПоследних.Период УБЫВ";
		
		Запрос.УстановитьПараметр("Период", ТекущаяУниверсальнаяДата());
		Запрос.УстановитьПараметр("ИсходныйМакет", ИсходныйМакет);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Макет = Выборка.Макет.Получить();
			
		Иначе
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПользовательскиеМакетыПечати.Макет КАК Макет,
			|	ПользовательскиеМакетыПечати.Использование КАК Использование
			|ИЗ
			|	РегистрСведений.ПользовательскиеМакетыПечати КАК ПользовательскиеМакетыПечати
			|ГДЕ
			|	ПользовательскиеМакетыПечати.ИмяМакета = &ИмяМакета";
			
			Запрос.УстановитьПараметр("ИмяМакета", ИмяМакета);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				
				Если Выборка.Использование Тогда
					Макет = Выборка.Макет.Получить();
				Иначе	
					Макет = ПолучитьОбщийМакет(ИмяМакета);
				КонецЕсли;
			Иначе
				Макет = ПолучитьОбщийМакет(ИмяМакета);
			КонецЕсли;
			
		КонецЕсли;
		
		Возврат Макет;
		
КонецФункции 

&НаСервере
Функция НаименованиеОрганизации()
	
	Результат = Новый Структура("НаименованиеПолное, НаименованиеСокращенное", "", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛБ_ОсновнаяОрганизация.Значение.НаименованиеПолное КАК НаименованиеПолное,
	|	ЛБ_ОсновнаяОрганизация.Значение.НаименованиеСокращенное КАК НаименованиеСокращенное
	|ИЗ
	|	Константа.ЛБ_ОсновнаяОрганизация КАК ЛБ_ОсновнаяОрганизация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ЛБ_ОсновнаяОрганизация.Значение = Организации.Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат.НаименованиеПолное      = Выборка.НаименованиеПолное;
		Результат.НаименованиеСокращенное = Выборка.НаименованиеСокращенное;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ФИОДиректора()
	
	Результат = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.Директор.Представление КАК Директор
	|ИЗ
	|	Константа.ЛБ_ОсновнаяОрганизация КАК ЛБ_ОсновнаяОрганизация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ЛБ_ОсновнаяОрганизация.Значение = Организации.Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.Директор;	
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПаспортныеДанныеКлиента(ДокументСПрописнойБуквы = Ложь)
	
	Результат = Новый Структура("ПаспортныеДанные, ВидДокумента, Серия, Номер, КемВыдан, ДатаВыдачи, КодПодразделения", "", "", "", "", "", "", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента.Представление КАК ВидДокумента,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК Серия,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК Номер,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК КемВыдан,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА """"
	|		ИНАЧЕ ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи
	|	КОНЕЦ КАК ДатаВыдачи,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК КодПодразделения
	|ИЗ
	|	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(, ДокументЗалогодателя.Владелец = &Залогодатель) КАК ЛБ_ДокументыЗалогодателейСрезПоследних
	|ГДЕ
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя = &ДУЛ
	|	И НЕ ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНеДействителен
	|	И ЛБ_ДокументыЗалогодателейСрезПоследних.ОсновнойДУЛ";
	
	Запрос.УстановитьПараметр("ДУЛ", Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий(); 
		
		ВидДокументаВыборка = ?(ДокументСПрописнойБуквы, СтрШаблон("%1%2", НРег(Лев(Выборка.ВидДокумента, 1)), Сред(Выборка.ВидДокумента, 2)), Выборка.ВидДокумента);
		
		ВидДокумента     = ?(ПустаяСтрока(ВидДокументаВыборка),      "", СтрШаблон(" %1:",                    ВидДокументаВыборка));
		Серия            = ?(ПустаяСтрока(Выборка.Серия),            "", СтрШаблон(" серия %1",              Выборка.Серия));
		Номер            = ?(ПустаяСтрока(Выборка.Номер),            "", СтрШаблон(" номер %1,",              Выборка.Номер));
		КемВыдан         = ?(ПустаяСтрока(Выборка.КемВыдан),         "", СтрШаблон(" выдан: %1,",             Выборка.КемВыдан));
		ДатаВыдачи       = ?(ПустаяСтрока(Выборка.ДатаВыдачи),       "", СтрШаблон(" дата выдачи: %1,",       Формат(Выборка.ДатаВыдачи,"ДФ=dd.MM.yyyy")));
		КодПодразделения = ?(ПустаяСтрока(Выборка.КодПодразделения), "", СтрШаблон(" код подразделения: %1,", Выборка.КодПодразделения)); 
		
		Результат.Вставить("ПаспортныеДанные", СтрШаблон("%1%2%3%4%5%6", ВидДокумента, Серия, Номер, КемВыдан, ДатаВыдачи, КодПодразделения));
		Результат.Вставить("ВидДокумента",     Выборка.ВидДокумента);
		Результат.Вставить("Серия",            Выборка.Серия);
		Результат.Вставить("Номер",            Выборка.Номер);
		Результат.Вставить("КемВыдан",         Выборка.КемВыдан);
		Результат.Вставить("ДатаВыдачи",       Выборка.ДатаВыдачи);
		Результат.Вставить("КодПодразделения", Выборка.КодПодразделения);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 
	
&НаСервере
Функция ПечатьЗаявлениеНаВозвратБезналичнойОплаты_ТабДок()
		
		ТабДок = Новый ТабличныйДокумент;
		ТабДок.АвтоМасштаб         = Истина;
		ТабДок.ОтображатьСетку     = Ложь;
		ТабДок.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
		ТабДок.ТолькоПросмотр      = Истина; 
		
		Если Не РольДоступна("ПолныеПрава") Тогда
			ТабДок.Защита = Истина;
		КонецЕсли;
		
		ИсходныйМакет = Справочники.ЛБ_ШаблоныМакетов.ЗаявлениеНаВозвратБезналичнойОплаты.Наименование;
		Макет = ПолучитьИзмененныйМакет("ЛБ_ЗаявлениеНаВозвратБезналичнойОплаты", ИсходныйМакет);
		
		ОбластьМакетаШапка  = Макет.ПолучитьОбласть("Шапка"); 
		ОбластьМакетаТекст  = Макет.ПолучитьОбласть("Текст");                                          
		ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
		
		ЗаемщикОтчество = ?(ПустаяСтрока(Отчество), "", СтрШаблон(" %1", Отчество));
		ЗаемщикТекстом  = СтрШаблон("%1 %2%3", Фамилия, Имя, ЗаемщикОтчество);
		
		ОбластьМакетаШапка.Параметры.Директор = ПолучитьСклоненияСтроки(ФИОДиректора(), , "ПД=Дательный")[0]; 
		ОбластьМакетаШапка.Параметры.Заемщик  = ПолучитьСклоненияСтроки(ЗаемщикТекстом, , "ПД=Родительный")[0];
		ОбластьМакетаШапка.Параметры.Телефон  = ?(ПустаяСтрока(Телефон), "", Телефон);
		ОбластьМакетаШапка.Параметры.ОрганизацияНаименованиеСокращенное = НаименованиеОрганизации().НаименованиеСокращенное;
		
		ТабДок.Вывести(ОбластьМакетаШапка);
		
		УдостоверяющийДокументЗаемщика =СокрЛП(ПаспортныеДанныеКлиента(Истина).ПаспортныеДанные); 
		
		ОбластьМакетаТекст.Параметры.Заемщик                        = ЗаемщикТекстом;
		ОбластьМакетаТекст.Параметры.ДатаРожденияЗаемщика           = Формат(ДатаРождения, "ДФ=dd.MM.yyyy");
		ОбластьМакетаТекст.Параметры.УдостоверяющийДокументЗаемщика = УдостоверяющийДокументЗаемщика;
		ОбластьМакетаТекст.Параметры.АдресРегистрацииЗаемщика       = ?(Не ПустаяСтрока(АдресПоПрописке), АдресПоПрописке, ФактическийАдрес);
		
		ТабДок.Вывести(ОбластьМакетаТекст);
		
		ОбластьМакетаПодвал.Параметры.Дата = Формат(ТекущаяДатаСеанса(),"ДЛФ=ДД");
		
		ТабДок.Вывести(ОбластьМакетаПодвал);
		
		Возврат ТабДок;
		
КонецФункции	

&НаСервере
Функция ПечатьШаблонЗаявленияНаВозвратБезналичнойОплаты_ТабДок()
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб         = Истина;
	ТабДок.ОтображатьСетку     = Ложь;
	ТабДок.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ТабДок.ТолькоПросмотр      = Истина;
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		ТабДок.Защита = Истина;
	КонецЕсли;
	
	ИсходныйМакет = Справочники.ЛБ_ШаблоныМакетов.ШаблонЗаявленияНаВозвратБезналичнойОплаты.Наименование;
	Макет = ПолучитьИзмененныйМакет("ЛБ_ШаблонЗаявленияНаВозвратБезналичнойОплаты", ИсходныйМакет);
	
	ОбластьМакетаШапка  = Макет.ПолучитьОбласть("Шапка"); 
	ОбластьМакетаТекст  = Макет.ПолучитьОбласть("Текст");
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьМакетаШапка.Параметры.ОрганизацияНаименованиеСокращенное = НаименованиеОрганизации().НаименованиеСокращенное;
	
	ТабДок.Вывести(ОбластьМакетаШапка);
	ТабДок.Вывести(ОбластьМакетаТекст);
	ТабДок.Вывести(ОбластьМакетаПодвал);
	
	Возврат ТабДок;
	
КонецФункции	

&НаСервере
Функция ПечатьЗаявлениеОПредоставленииСведенийОНаличииОбязательствИмущественногоХарактера_ТабДок()
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб         = Истина;
	ТабДок.ОтображатьСетку     = Ложь;
	ТабДок.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ТабДок.ТолькоПросмотр      = Истина; 
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		ТабДок.Защита = Истина;
	КонецЕсли;
	
	ИсходныйМакет = Справочники.ЛБ_ШаблоныМакетов.ЗаявлениеОПредоставленииСведенийОНаличииОбязательствИмущХарактера.Наименование;
	Макет = ПолучитьИзмененныйМакет("ЛБ_ЗаявлениеОПредоставленииСведенийОНаличииОбязательствИмущХарактера", ИсходныйМакет);
	
	ОбластьМакетаШапка  = Макет.ПолучитьОбласть("Шапка"); 
	ОбластьМакетаТекст  = Макет.ПолучитьОбласть("Текст");         
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ЗаемщикОтчество = ?(ПустаяСтрока(Отчество), "", СтрШаблон(" %1", Отчество));
	ЗаемщикТекстом  = СтрШаблон("%1 %2%3", Фамилия, Имя, ЗаемщикОтчество);
	ОбластьМакетаШапка.Параметры.Заемщик                            = ПолучитьСклоненияСтроки(ЗаемщикТекстом, , "ПД=Родительный")[0];
	ОбластьМакетаШапка.Параметры.ДатаРожденияЗаемщика               = Формат(ДатаРождения, "ДФ=dd.MM.yyyy");
	ОбластьМакетаШапка.Параметры.УдостоверяющийДокументЗаемщика     = СокрЛП(ПаспортныеДанныеКлиента().ПаспортныеДанные);
	ОбластьМакетаШапка.Параметры.АдресРегистрацииЗаемщика           = ?(Не ПустаяСтрока(АдресПоПрописке), АдресПоПрописке, ФактическийАдрес);
	ОбластьМакетаШапка.Параметры.Телефон                            = ?(ПустаяСтрока(Телефон), "", Телефон);
	ОбластьМакетаШапка.Параметры.ОрганизацияНаименованиеСокращенное = НаименованиеОрганизации().НаименованиеСокращенное;
	
	ТабДок.Вывести(ОбластьМакетаШапка);
	
	ТабДок.Вывести(ОбластьМакетаТекст);
	
	ОбластьМакетаПодвал.Параметры.НаименованиеЛомбардаИНомерОтделения = "";    
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	Если НЕ ТекПользователь.ЭтоЛомбард Тогда
		Сотрудник = ТекПользователь.Сотрудник;
	Иначе
		Сотрудник = ПараметрыСеанса.ТекущийСотрудник;
	КонецЕсли;	
	ОбластьМакетаПодвал.Параметры.Работник                            = Сотрудник;
	ОбластьМакетаПодвал.Параметры.Дата                                = Формат(ТекущаяДатаСеанса(),"ДЛФ=ДД");
	
	ТабДок.Вывести(ОбластьМакетаПодвал);
	
	Возврат ТабДок;
	
КонецФункции  

&НаСервере
Функция ПечатьАктОПолученииИзделийНаследниками_ТабДок()  
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб         = Истина;
	ТабДок.ОтображатьСетку     = Ложь;
	ТабДок.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ТабДок.ТолькоПросмотр      = Истина; 
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		ТабДок.Защита = Истина;
	КонецЕсли;
	
	ИсходныйМакет = Справочники.ЛБ_ШаблоныМакетов.АктОПолученииИзделийНаследниками.Наименование;
	Макет = ПолучитьИзмененныйМакет("ЛБ_АктОПолученииИзделийНаследниками", ИсходныйМакет);
	
	ОбластьМакетаШапка  = Макет.ПолучитьОбласть("Шапка"); 
	ОбластьМакетаТекст  = Макет.ПолучитьОбласть("Текст");
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьМакетаШапка.Параметры.АдресЛомбарда                      = "";
	ОбластьМакетаШапка.Параметры.Дата                               = Формат(ТекущаяДатаСеанса(),"ДЛФ=ДД"); 
	ОбластьМакетаШапка.Параметры.ОрганизацияНаименованиеСокращенное = НаименованиеОрганизации().НаименованиеСокращенное;
	
	ТабДок.Вывести(ОбластьМакетаШапка);
	
	ЗаемщикОтчество = ?(ПустаяСтрока(Отчество), "", СтрШаблон(" %1", Отчество));
	ЗаемщикТекстом  = СтрШаблон("%1 %2%3", Фамилия, Имя, ЗаемщикОтчество);
	ОбластьМакетаТекст.Параметры.Заемщик                        = ПолучитьСклоненияСтроки(ЗаемщикТекстом, , "ПД=Родительный")[0];
	ОбластьМакетаТекст.Параметры.УдостоверяющийДокументЗаемщика = СокрЛП(ПаспортныеДанныеКлиента(Истина).ПаспортныеДанные);
	
	ТабДок.Вывести(ОбластьМакетаТекст);
	
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	Если НЕ ТекПользователь.ЭтоЛомбард Тогда
		Сотрудник = ТекПользователь.Сотрудник;
	Иначе
		Сотрудник = ПараметрыСеанса.ТекущийСотрудник;
	КонецЕсли;	
	ОбластьМакетаПодвал.Параметры.Сотрудник = Сотрудник; 
	
	ТабДок.Вывести(ОбластьМакетаПодвал);
	
	Возврат ТабДок;
	
КонецФункции	

&НаСервере
Функция ПечатьЗаявлениеВСвободнойФорме_ТабДок()
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб         = Истина;
	ТабДок.ОтображатьСетку     = Ложь;
	ТабДок.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ТабДок.ТолькоПросмотр      = Истина; 
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		ТабДок.Защита = Истина;
	КонецЕсли;
	
	ИсходныйМакет = Справочники.ЛБ_ШаблоныМакетов.ЗаявлениеВСвободнойФорме.Наименование;
	Макет = ПолучитьИзмененныйМакет("ЛБ_ЗаявлениеВСвободнойФорме", ИсходныйМакет);
	
	ОбластьМакетаШапка  = Макет.ПолучитьОбласть("Шапка"); 
	ОбластьМакетаТекст  = Макет.ПолучитьОбласть("Текст");
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал"); 
	
	ЗаемщикОтчество = ?(ПустаяСтрока(Отчество), "", СтрШаблон(" %1", Отчество));
	ЗаемщикТекстом  = СтрШаблон("%1 %2%3", Фамилия, Имя, ЗаемщикОтчество);
	
	ОбластьМакетаШапка.Параметры.Директор                           = ПолучитьСклоненияСтроки(ФИОДиректора(), , "ПД=Дательный")[0]; 
	ОбластьМакетаШапка.Параметры.Заемщик                            = ПолучитьСклоненияСтроки(ЗаемщикТекстом, , "ПД=Родительный")[0];
	ОбластьМакетаШапка.Параметры.ДатаРожденияЗаемщика               = Формат(ДатаРождения, "ДФ=dd.MM.yyyy");
	ОбластьМакетаШапка.Параметры.УдостоверяющийДокументЗаемщика     = СокрЛП(ПаспортныеДанныеКлиента().ПаспортныеДанные);
	ОбластьМакетаШапка.Параметры.АдресРегистрацииЗаемщика           = ?(Не ПустаяСтрока(АдресПоПрописке), АдресПоПрописке, ФактическийАдрес);
	ОбластьМакетаШапка.Параметры.Телефон                            = ?(ПустаяСтрока(Телефон), "", Телефон);
	ОбластьМакетаШапка.Параметры.ОрганизацияНаименованиеСокращенное = НаименованиеОрганизации().НаименованиеСокращенное;
	
	ТабДок.Вывести(ОбластьМакетаШапка);
	ТабДок.Вывести(ОбластьМакетаТекст);
	ТабДок.Вывести(ОбластьМакетаПодвал);
	
	Возврат ТабДок;
	
КонецФункции	

&НаСервере
Функция ПечатьСогласиеНаОпробование()
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб         = Истина;
	ТабДок.ОтображатьСетку     = Ложь;
	ТабДок.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ТабДок.ТолькоПросмотр      = Истина;
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		ТабДок.Защита = Истина;
	КонецЕсли;
	
	ИсходныйМакет = Справочники.ЛБ_ШаблоныМакетов.СогласиеНаОпробование.Наименование;
	Макет = ПолучитьИзмененныйМакет("ЛБ_СогласиеНаОпробование", ИсходныйМакет);
	
	ОбластьМакетаШапка  = Макет.ПолучитьОбласть("Шапка"); 
	ОбластьМакетаТекст  = Макет.ПолучитьОбласть("Текст");
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьМакетаШапка.Параметры.ОрганизацияНаименованиеПолное = НаименованиеОрганизации().НаименованиеПолное;
	
	ТабДок.Вывести(ОбластьМакетаШапка);
	
	ЗаемщикОтчество = ?(ПустаяСтрока(Отчество), "", СтрШаблон(" %1", Отчество));
	ЗаемщикТекстом  = СтрШаблон("%1 %2%3", Фамилия, Имя, ЗаемщикОтчество);
	ОбластьМакетаТекст.Параметры.Заемщик                        = ЗаемщикТекстом;
	ОбластьМакетаТекст.Параметры.ДатаРожденияЗаемщика           = Формат(ДатаРождения, "ДФ=dd.MM.yyyy");
	ОбластьМакетаТекст.Параметры.УдостоверяющийДокументЗаемщика = СокрЛП(ПаспортныеДанныеКлиента(Истина).ПаспортныеДанные);
	ОбластьМакетаТекст.Параметры.АдресРегистрацииЗаемщика       = ?(Не ПустаяСтрока(АдресПоПрописке), АдресПоПрописке, ФактическийАдрес);
	ОбластьМакетаТекст.Параметры.СимволСтепени                  = Символ(185);
	
	ТабДок.Вывести(ОбластьМакетаТекст);
	
	ОбластьМакетаПодвал.Параметры.Дата          = Формат(ТекущаяДатаСеанса(),"ДЛФ=ДД");
	ОбластьМакетаПодвал.Параметры.СимволСтепени = Символ(185);
	
	ТабДок.Вывести(ОбластьМакетаПодвал);
	
	Возврат ТабДок;
	
КонецФункции


 &НаКлиенте
Процедура СогласиеНаОпробование(Команда)
	//ИВВ, 01.2026, замена на новую ПФ
	
	//КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Макет");
	//ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "Макет");
	//
	//// Формирование табличного документа
	//ПечатнаяФорма.ТабличныйДокумент = ПечатьСогласиеНаОпробование();
	//
	//КлючУникальности = Строка(Новый УникальныйИдентификатор);
	//ПараметрыОткрытия = Новый Структура("ИмяМенеджераПечати,ИменаМакетов,ПараметрКоманды,ПараметрыПечати");
	//ПараметрыОткрытия.ПараметрКоманды = Новый Массив;
	//ПараметрыОткрытия.ПараметрыПечати = Новый Структура;
	//ПараметрыОткрытия.Вставить("КоллекцияПечатныхФорм", КоллекцияПечатныхФорм);
	//ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ВладелецФормы, КлючУникальности);		
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ИмяКоманды",   "ПечатьСогласияНаОпробование");
	СтруктураПараметров.Вставить("Залогодатель", Залогодатель);
	ЛБ_СогласияНаОбработкуПД_Клиент.ОбработкаКоманд(СтруктураПараметров);
КонецПроцедуры 

&НаКлиенте
Процедура ЗаявлениеНаВозврат(Команда)
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Макет");
	ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "Макет");
	
	// Формирование табличного документа
	ПечатнаяФорма.ТабличныйДокумент = ПечатьЗаявлениеНаВозвратБезналичнойОплаты_ТабДок();
	
	КлючУникальности = Строка(Новый УникальныйИдентификатор);
	ПараметрыОткрытия = Новый Структура("ИмяМенеджераПечати,ИменаМакетов,ПараметрКоманды,ПараметрыПечати");
	ПараметрыОткрытия.ПараметрКоманды = Новый Массив;
	ПараметрыОткрытия.ПараметрыПечати = Новый Структура;
	ПараметрыОткрытия.Вставить("КоллекцияПечатныхФорм", КоллекцияПечатныхФорм);
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ВладелецФормы, КлючУникальности);
КонецПроцедуры

&НаКлиенте
Процедура ШаблонЗаявления(Команда)
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Макет");
	ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "Макет");
	
	// Формирование табличного документа
	ПечатнаяФорма.ТабличныйДокумент = ПечатьШаблонЗаявленияНаВозвратБезналичнойОплаты_ТабДок();
	
	КлючУникальности = Строка(Новый УникальныйИдентификатор);
	ПараметрыОткрытия = Новый Структура("ИмяМенеджераПечати,ИменаМакетов,ПараметрКоманды,ПараметрыПечати");
	ПараметрыОткрытия.ПараметрКоманды = Новый Массив;
	ПараметрыОткрытия.ПараметрыПечати = Новый Структура;
	ПараметрыОткрытия.Вставить("КоллекцияПечатныхФорм", КоллекцияПечатныхФорм);
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ВладелецФормы, КлючУникальности);
КонецПроцедуры

&НаКлиенте
Процедура ЗаявлениеОПредоставленииСведений(Команда)
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Макет");
	ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "Макет");
	
	// Формирование табличного документа
	ПечатнаяФорма.ТабличныйДокумент = ПечатьЗаявлениеОПредоставленииСведенийОНаличииОбязательствИмущественногоХарактера_ТабДок();
	
	КлючУникальности = Строка(Новый УникальныйИдентификатор);
	ПараметрыОткрытия = Новый Структура("ИмяМенеджераПечати,ИменаМакетов,ПараметрКоманды,ПараметрыПечати");
	ПараметрыОткрытия.ПараметрКоманды = Новый Массив;
	ПараметрыОткрытия.ПараметрыПечати = Новый Структура;
	ПараметрыОткрытия.Вставить("КоллекцияПечатныхФорм", КоллекцияПечатныхФорм);
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ВладелецФормы, КлючУникальности);
КонецПроцедуры

&НаКлиенте
Процедура АктНаследник(Команда)
	Если ДатаСмерти = Дата(1, 1, 1) Тогда
		Возврат;
	КонецЕсли;
	
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Макет");
	ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "Макет");
	
	// Формирование табличного документа
	ПечатнаяФорма.ТабличныйДокумент = ПечатьАктОПолученииИзделийНаследниками_ТабДок();
	
	КлючУникальности = Строка(Новый УникальныйИдентификатор);
	ПараметрыОткрытия = Новый Структура("ИмяМенеджераПечати,ИменаМакетов,ПараметрКоманды,ПараметрыПечати");
	ПараметрыОткрытия.ПараметрКоманды = Новый Массив;
	ПараметрыОткрытия.ПараметрыПечати = Новый Структура;
	ПараметрыОткрытия.Вставить("КоллекцияПечатныхФорм", КоллекцияПечатныхФорм);
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ВладелецФормы, КлючУникальности);

КонецПроцедуры

&НаКлиенте
Процедура СвободнаяФорма(Команда)
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Макет");
	ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "Макет");
	
	// Формирование табличного документа
	ПечатнаяФорма.ТабличныйДокумент = ПечатьЗаявлениеВСвободнойФорме_ТабДок();
	
	КлючУникальности = Строка(Новый УникальныйИдентификатор);
	ПараметрыОткрытия = Новый Структура("ИмяМенеджераПечати,ИменаМакетов,ПараметрКоманды,ПараметрыПечати");
	ПараметрыОткрытия.ПараметрКоманды = Новый Массив;
	ПараметрыОткрытия.ПараметрыПечати = Новый Структура;
	ПараметрыОткрытия.Вставить("КоллекцияПечатныхФорм", КоллекцияПечатныхФорм);
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ВладелецФормы, КлючУникальности);
КонецПроцедуры

&НаСервере
Функция ПолучитьВидОперацииЗБ(ЗалоговыйБилет)
	Возврат ЗалоговыйБилет.ВидОперации;
КонецФункции

&НаКлиенте
Процедура ПечатьЗБ(Команда)  
	ТекСтрока = Элементы.ТаблицаЗБ.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда
		ПараметрыФормы = Новый Структура; 
		ВидОперации = ПолучитьВидОперацииЗБ(ТекСтрока.ЗалоговыйБилет); 
		Если ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление") Тогда 
			ПараметрыФормы.Вставить("ИменаМакетов", "Переоформление");
		Иначе	
		    ПараметрыФормы.Вставить("ИменаМакетов", "ЗалоговыйБилет");  
		КонецЕсли;	
		ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_ОперацияПоЗалогу");
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(ТекСтрока.ЗалоговыйБилет);
		ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
		ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,); 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьДубликатаЗБ(Команда)
	Предупреждение("Эта печ. форма пока в работе.", 60);
КонецПроцедуры

&НаСервере
Функция НайтиПоследнийДокументОплатыДС(ЗалоговыйБилет)  
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилета.Регистратор КАК ОперацияОплаты,
	               |	ЛБ_СостояниеЗалоговогоБилета.НомерДопСоглашения КАК НомерДС
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета КАК ЛБ_СостояниеЗалоговогоБилета
	               |ГДЕ
	               |	ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет = &ЗалоговыйБилет
	               |	И ЛБ_СостояниеЗалоговогоБилета.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
	               |	И ЛБ_СостояниеЗалоговогоБилета.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_СостояниеЗалоговогоБилета.Период УБЫВ";  
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	НомерДС = 0; 
	ОперацияОплаты = Документы.ЛБ_ОперацияПоЗалогу.ПустаяСсылка();
	Для каждого стр Из ТаблицаЗапроса цикл 
		Если ПолучитьДокументОтмены(стр.ОперацияОплаты) Тогда
			Продолжить;
		КонецЕсли;	
		Если Стр.НомерДС = 0 Тогда 
			Возврат ОперацияОплаты;
		КонецЕсли;	
		Если ЗначениеЗаполнено(ОперацияОплаты) Тогда
			Если НЕ НомерДС = Стр.НомерДС Тогда
				Возврат ОперацияОплаты;
			КонецЕсли;	
		Иначе	
		    НомерДС = Стр.НомерДС; 
			ОперацияОплаты = стр.ОперацияОплаты;
		КонецЕсли;	
	КонецЦикла;
	Возврат ОперацияОплаты;
КонецФункции

&НаКлиенте
Процедура ПечатьДС(Команда)  
	ТекСтрока = Элементы.ТаблицаЗБ.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда
		ДокументОплаты = НайтиПоследнийДокументОплатыДС(ТекСтрока.ЗалоговыйБилет);
		Если ЗначениеЗаполнено(ДокументОплаты) Тогда	
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ИменаМакетов", "ДополнительноеСоглашение"); 
			ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_ОперацияПоЗалогу");
			МассивОбъектов = Новый Массив;
			МассивОбъектов.Добавить(ДокументОплаты);
			ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
			ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,); 
		Иначе     
			Предупреждение("У залогового билета нет доп. соглашений.", 60);
		КонецЕсли;	
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьДубликатаДС(Команда)
	Предупреждение("Эта печ. форма пока в работе.", 60);
КонецПроцедуры

&НаКлиенте
Процедура РеестрДС(Команда) 
	ТекСтрока = Элементы.ТаблицаЗБ.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет);
		ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаРеестраПлатежей", ПараметрыФормы, Этаформа,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
	КонецЕсли;	
КонецПроцедуры  

&НаКлиенте
Процедура ОтчетОНачисленныхПроцентах(Команда)
	ТекСтрока = Элементы.ТаблицаЗБ.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда
		ПараметрыВыбора = Новый Структура;
		ПараметрыВыбора.Вставить("Клиент", Залогодатель);  
		ПараметрыВыбора.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет); 
		//+МАН 19.05.26 Изменил. Заявка 3649
		//ПараметрыВыбора.Вставить("Детально", Истина);
		ПараметрыВыбора.Вставить("Детально", Ложь);
		//-МАН
	     
		ОткрытьФорму("Отчет.ЛБ_НачисленныеПроцентыПоДоговоруЗайма.ФормаОбъекта", ПараметрыВыбора,ЭтаФорма, Истина,,,, РежимОткрытияОкнаФормы.Независимый);
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура Доверенность(Команда)
	ТекСтрока = Элементы.ТаблицаЗБ.ТекущиеДанные;   
	Если НЕ ТекСтрока = неопределено Тогда
		ПараметрыВыбора = Новый Структура;
		ПараметрыВыбора.Вставить("Клиент", Залогодатель);  
		ПараметрыВыбора.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет);
	        
		//ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораТекущееСостояниеЗБ",ЭтаФорма);
		ОткрытьФорму("ОбщаяФорма.ЛБ_Доверенности", ПараметрыВыбора,ЭтаФорма, Истина,,,, РежимОткрытияОкнаФормы.Независимый);
	КонецЕсли;	
КонецПроцедуры     

&НаКлиенте
Процедура СортироватьВ(Команда) 
	ТекущийЭлемент = Элементы.ТаблицаЗБ; 
	ТЭ_имя_объект=ТекущийЭлемент.Имя;
    ТЭ_поле = ТекущийЭлемент.ТекущийЭлемент.имя;

    имяКолонки=СтрЗаменить(ТЭ_поле,ТЭ_имя_объект,"");
    СортироватьНасервере(имяКолонки, "Возр");
КонецПроцедуры

&НаКлиенте
Процедура СортироватьУ(Команда)
	ТекущийЭлемент = Элементы.ТаблицаЗБ; 
	ТЭ_имя_объект=ТекущийЭлемент.Имя;
	ТЭ_поле = ТекущийЭлемент.ТекущийЭлемент.имя;

    имяКолонки = СтрЗаменить(ТЭ_поле,ТЭ_имя_объект,"");
    СортироватьНасервере(имяКолонки,"Убыв");
КонецПроцедуры

&НаСервере
Процедура сортироватьНасервере(имяКолонки,ВидСортировки) 
	тз= ТаблицаЗБ.Выгрузить();
    КолонкаСортировки = тз.Колонки.Найти(имяКолонки);
	Если КолонкаСортировки <> Неопределено тогда   
		Если ИмяКолонки = "Ломбард" Тогда
			 тз.Колонки.Добавить("НомерЛ");
			 Для каждого Стр Из тз Цикл   
				 Попытка 
				     Стр.НомерЛ = Число(Стр.Ломбард.НомерЛомбарда); 
				 Исключение	 
					 Стр.НомерЛ = 0;
				 КонецПопытки;	 
			 Конеццикла;
			 тз.Сортировать("НомерЛ" + " " + ВидСортировки); 
			 ТаблицаЗБ.Загрузить(тз);
		Иначе	
            ТаблицаЗБ.Сортировать(имяКолонки + " " + ВидСортировки);
		КонецЕсли;	
     КонецЕсли;
конецпроцедуры

&НаКлиенте
Процедура НовыйКлиент(Команда)
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеДобавленияКлиента",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_КарточкаЗалогодателя", , ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ПослеДобавленияКлиента(Результат, ДопПараметры) Экспорт
	Если Результат = неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Залогодатель = Результат.Залогодатель;
	ПолучитьКонтактнуюИнформацию();
	ИнформацияОКлиенте = ЗаполнитьИнформациюОКлиенте();  
	ЗаполнитьИнформациюОКлиентеДополнительно();   
	СтатусыКлиента = ЗаполнитьСтатусыКлиента(); 	
	ВыборЗБ = 1; 
	ТекущийВыборЗБ = 1;  
	Если НЕ ПустаяСтрока(НомерЗБ) Тогда 
		НомерЗБ = "";
		Элементы.НомерЗБ.Видимость = Ложь;
	КонецЕсли;	
    ПолучитьСписокЗБ(Истина);  		
	ЗаполнитьСписокЛомбардов(); 
	УстановитьОтборНаСервере();          
	Элементы.ИнформацияОКлиенте.Высота = ИнформацияОКлиенте.ВысотаТаблицы;
	Элементы.СтатусыКлиента.Высота = СтатусыКлиента.ВысотаТаблицы; 
	Элементы.КарточкаКлиента.Доступность = Истина;
	Элементы.СтатистикаОбращений.Доступность = Истина;
	Элементы.ЭДО.Доступность = Истина;  
	//+МАН 28.01.26 Изменил. Заявка 3649
	//Элементы.ГруппаКнопки.Доступность = Истина;  
	Элементы.СогласиеНаОпробование.Доступность = Истина;
	Элементы.ФормаЗаявлениеНаВозврат.Доступность = Истина;
	Элементы.ФормаЗаявлениеОПредоставленииСведений.Доступность = Истина;
	Элементы.ФормаАктНаследник.Доступность = Истина;
	//-МАН
	Элементы.КомандыТаблицыЗБ.Доступность = Истина; 
	Элементы.ГруппаВыбораЗБ.Доступность = Истина;
	
	НаличиеЭДО = ЛБ_СоглашенияЭДОСервер.НаличиеДействующегоСоглашения(Залогодатель);
	
	Если НаличиеЭДО Тогда
		Элементы.СтатусЭДО.Заголовок = "есть";
	Иначе
		Элементы.СтатусЭДО.Заголовок = "нет";
	КонецЕсли;	

	//+МАН 28.01.26 Заявка 3649
	ОформлениеЭДО(НаличиеЭДО);
	//-МАН
КонецПроцедуры	

&НаКлиенте
Процедура СправочникТары(Команда)
	ОткрытьФорму("Справочник.ЛБ_Тара.Форма.ФормаСписка",, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

//+МАН 05.12.25 Заполнение подвала
&НаСервере
Процедура ЗаполнитьПодвал(Отбор = Неопределено)
	ОтборСтатуса = Новый Структура();
	ОтборСтатуса.Вставить("СтатусЗалоговогоБилета", Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтказОтОформления);
	
	Если Отбор <> Неопределено Тогда
		Для каждого Стр Из Отбор Цикл
			ОтборСтатуса.Вставить(Стр.Ключ, Стр.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Если Отбор = Неопределено Тогда
		ТЗПоСтатусу = ТаблицаЗБ.Выгрузить(ОтборСтатуса);
		
		ИтогоКоличество = ТаблицаЗБ.Количество() - ТЗПоСтатусу.Количество();
		ИтогоСуммаЗайма = ТаблицаЗБ.Итог("СуммаЗайма") - ТЗПоСтатусу.Итог("СуммаЗайма");
		ИтогоСуммаОценки = ТаблицаЗБ.Итог("СуммаОценки") - ТЗПоСтатусу.Итог("СуммаОценки");
		ИтогоДолг = ТаблицаЗБ.Итог("Долг") - ТЗПоСтатусу.Итог("Долг");
	Иначе
		ТЗОтбора = ТаблицаЗБ.Выгрузить(Отбор);
		
		ТЗПоСтатусу = ТаблицаЗБ.Выгрузить(ОтборСтатуса);
		
		ИтогоКоличество = ТЗОтбора.Количество() - ТЗПоСтатусу.Количество();
		ИтогоСуммаЗайма = ТЗОтбора.Итог("СуммаЗайма") - ТЗПоСтатусу.Итог("СуммаЗайма");
		ИтогоСуммаОценки = ТЗОтбора.Итог("СуммаОценки") - ТЗПоСтатусу.Итог("СуммаОценки");
		ИтогоДолг = ТЗОтбора.Итог("Долг") - ТЗПоСтатусу.Итог("Долг");
	КонецЕсли;

	Элементы.ТаблицаЗБНомерЗБ.ТекстПодвала = ИтогоКоличество;
	Элементы.ТаблицаЗБСуммаЗайма.ТекстПодвала = ИтогоСуммаЗайма;
	Элементы.ТаблицаЗБСуммаОценки.ТекстПодвала = ИтогоСуммаОценки;
	Элементы.ТаблицаЗБДолг.ТекстПодвала = ИтогоДолг;

КонецПроцедуры

//+МАН 28.01.26 Заявка 3649
&НаСервере
Процедура УсловноеОформлениеСрока()
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
	
	ЭлементУсловия = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаЗБ.ТекСрокЗайма");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ЭлементУсловия.ПравоеЗначение =  Новый ПолеКомпоновкиДанных("ТаблицаЗБ.ПСЗДни");
	ЭлементУсловия. Использование = Истина;
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ТаблицаЗБДатаВозвратаЛьготная");
	ПолеОформления.Использование = Истина;
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ТаблицаЗБПСЗ");
	ПолеОформления.Использование = Истина;

	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
	
	ЭлементУсловия = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = ТекущаяДата();
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ЭлементУсловия.ПравоеЗначение =  Новый ПолеКомпоновкиДанных("ТаблицаЗБ.ДатаВозвратаЛьготная");
	ЭлементУсловия. Использование = Истина;
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ТаблицаЗБДатаВозвратаЛьготная");
	ПолеОформления.Использование = Истина;
КонецПроцедуры

&НаСервере
Процедура ОформлениеЭДО(НаличиеЭДО)
	Если НаличиеЭДО Тогда
		Элементы.СтатусЭДО.ЦветТекста = WebЦвета.Зеленый;
	Иначе
		Элементы.СтатусЭДО.ЦветТекста = WebЦвета.Красный;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗБПриАктивизацииСтроки(Элемент)
	ЭтоЛомбард = ПользовательЛомбард();
	
	ТекСтр = Элементы.ТаблицаЗБ.ТекущиеДанные;
	
	Если ТекСтр <> Неопределено Тогда
		Если ТекСтр.СтатусЗалоговогоБилета = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыЗалоговыхБилетов.Реализован") И ЭтоЛомбард Тогда
			Элементы.ТекущееСостояниеЗБ.Доступность = Ложь;
		Иначе
			Элементы.ТекущееСостояниеЗБ.Доступность = Истина;
		КонецЕсли;
	КонецЕсли;

	//+МАН 19.02.26 Заявка 3649
	Если ТекСтр <> Неопределено И ТекСтр.СтатусЗалоговогоБилета = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыЗалоговыхБилетов.ОтказОтОформления") Тогда
		Элементы.ФормаГруппаПечатьЗБ.Доступность = Ложь;
	Иначе
		Элементы.ФормаГруппаПечатьЗБ.Доступность = Истина;
	КонецЕсли;
	//-МАН
КонецПроцедуры

&НаСервере
Функция ПользовательЛомбард()
	Возврат ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард;
КонецФункции

&НаСервере
Функция ПолучитьЛомбардыОтделения(Ломбард)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард
		|ИЗ
		|	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(
		|			,
		|			ВЫБОР
		|				КОГДА Отделение В
		|						(ВЫБРАТЬ
		|							ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
		|						ИЗ
		|							РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(, Ломбард = &Ломбард) КАК ЛБ_ОтделенияЛомбардовСрезПоследних)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
		//|ГДЕ
		//|	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард <> &Ломбард
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.НомерЧисловой  УБЫВ";
		//|	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.НомерЛомбарда  УБЫВ";
	
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() > 0 Тогда
		Возврат Результат;
	КонецЕсли;

	Возврат Неопределено;
КонецФункции

&НаСервере
Функция СортироватьТЗЛомбарды(ТЗЛомбарды)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВнешнийИсточник.Ломбард КАК Ломбард
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ВнешнийИсточник КАК ВнешнийИсточник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Ломбард КАК Ломбард
	|ИЗ
	|	ВТ КАК ВТ
	|	
	|УПОРЯДОЧИТЬ ПО
	|	ВТ.Ломбард.НомерЧисловой";
	
	Запрос.УстановитьПараметр("ВнешнийИсточник", ТЗЛомбарды);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

&НаКлиенте
Процедура ПечатьСогласиеНаОбработкуПД(Команда)
	ТекСтр = Элементы.ТаблицаЗБ.ТекущиеДанные;
	
	ЛБ_СогласияНаОбработкуПД_Сервер.ЗаключитьСогласиеНаОбработкуПД_ЗБ(ТекСтр.ЗалоговыйБилет);
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ИмяКоманды",    Команда.Имя);
	СтруктураПараметров.Вставить("ОперацияЗайма", ТекСтр.ЗалоговыйБилет);
	ЛБ_СогласияНаОбработкуПД_Клиент.ОбработкаКоманд(СтруктураПараметров);
КонецПроцедуры
//-МАН

//++ИВВ, 02.2026, согласия
#Область Согласия
&НаКлиенте
Процедура ЗаключитьСогласие(Команда)
	Если ДатаСмерти = Дата(1,1,1) Тогда
		Если ЗначениеЗаполнено(Телефон) Тогда	
			ЛБ_СогласияНаИнформированиеКлиент.ОбработкаКоманд(Команда.Имя, Залогодатель,,,ЭтаФорма);
			НаличиеСогласия = ЛБ_СогласияНаИнформированиеСервер.НаличиеДействующегоСогласия(Залогодатель);
			
			Если НаличиеСогласия Тогда
				Элементы.СтатусСогласия.Заголовок = "есть";
			Иначе
				Элементы.СтатусСогласия.Заголовок = "нет";
			КонецЕсли;
		Иначе
			Предупреждение("Для заключения согласия на информирование заполните номер телефона",, "Номер телефона не заполнен");
		КонецЕсли;
	Иначе
		Предупреждение("Клиент умер. Дата смерти " + Формат(ДатаСмерти, "ДФ=dd.MM.yyyy"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтозватьСогласие(Команда)
	ОписаниеОповещенияОтозватьСогласиеПродолжить = Новый ОписаниеОповещения("ОтозватьСогласиеПродолжить", ЭтотОбъект);
	ЛБ_СогласияНаИнформированиеКлиент.ОбработкаКоманд(Команда.Имя, Залогодатель,ОписаниеОповещенияОтозватьСогласиеПродолжить,,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусСогласия(Результат, ДополнительныеПараметры) Экспорт
	НаличиеСогласия = ЛБ_СогласияНаИнформированиеСервер.НаличиеДействующегоСогласия(Залогодатель);
	
	Если НаличиеСогласия Тогда
		Элементы.СтатусСогласия.Заголовок = "есть";
	Иначе
		Элементы.СтатусСогласия.Заголовок = "нет";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтозватьСогласиеПродолжить(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		Если Результат Тогда
			ОписаниеОповещенияОтозватьСогласиеЗавершение = Новый ОписаниеОповещения("ОтозватьСогласиеЗавершение", ЭтотОбъект);
			ЛБ_СогласияНаИнформированиеКлиент.ОбработкаКоманд("ОтозватьСогласиеПродолжить", Залогодатель,ОписаниеОповещенияОтозватьСогласиеЗавершение,,ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтозватьСогласиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	ОтветРасторжениеПодписано = Вопрос("Заявление на отзыв Согласия на информирование подписано клиентом?",
	РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да);
	Если ОтветРасторжениеПодписано = КодВозвратаДиалога.Да Тогда
		РезультатОтзываСогласия = ЛБ_СогласияНаИнформированиеСервер.ОтозватьСогласиеНаИнформирование(Залогодатель);
		Если РезультатОтзываСогласия Тогда
			Элементы.СтатусСогласия.Заголовок = "нет";
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСогласие(Команда)
	ЛБ_СогласияНаИнформированиеКлиент.ОбработкаКоманд(Команда.Имя, Залогодатель);
	НаличиеСогласия = ЛБ_СогласияНаИнформированиеСервер.НаличиеДействующегоСогласия(Залогодатель);
	
	Если НаличиеСогласия Тогда
		Элементы.СтатусСогласия.Заголовок = "есть";
	Иначе
		Элементы.СтатусСогласия.Заголовок = "нет";
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СтатусСогласияНажатие(Элемент)
	ЛБ_СогласияНаИнформированиеКлиент.ОбработкаКоманд("ИсторияСогласия", Залогодатель);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСогласиеНаИнформирование(Команда)
	ЛБ_СогласияНаИнформированиеКлиент.ОбработкаКоманд(Команда.Имя, Залогодатель,,,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьОтзывСогласияНаИнформирование(Команда)
	ЛБ_СогласияНаИнформированиеКлиент.ОбработкаКоманд(Команда.Имя, Залогодатель,,,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ЗаключитьСогласиеПродолжить(Результат, ДополнительныеПараметры) Экспорт
	ЭтаФорма.Закрыть(ДополнительныеПараметры);
КонецПроцедуры

#КонецОбласти
//--ИВВ

//++ООВ 20.03.2026 Заявка 3751
&НаКлиенте
Процедура МаршрутныйЛист(Команда)
ОткрытьФорму("Документ.ЛБ_МаршрутПоездки.Форма.ФормаСписка");	
КонецПроцедуры ////--ООВ 20.03.2026




	


