
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Подразделение КАК Подразделение,
	               |	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность
	               |ИЗ
	               |	РегистрСведений.ЛБ_КадроваяИсторияСотрудников.СрезПоследних(, Сотрудник = &Сотрудник) КАК ЛБ_КадроваяИсторияСотрудниковСрезПоследних";
	Запрос.УстановитьПараметр("Сотрудник", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДолжностьСотрудника = Выборка.Должность;
		Подразделение       = Выборка.Подразделение;
	КонецЕсли;    
	
	
	Элементы.ИсторияФИО.Видимость = Ложь;

	ЗапросФИО = Новый Запрос;
	ЗапросФИО.Текст = "ВЫБРАТЬ
	                  |	ЛБ_ФИОФизическихЛиц.Фамилия КАК Фамилия,
	                  |	ЛБ_ФИОФизическихЛиц.Имя КАК Имя,
	                  |	ЛБ_ФИОФизическихЛиц.Отчество КАК Отчество
	                  |ИЗ
	                  |	РегистрСведений.ЛБ_ФИОФизическихЛиц КАК ЛБ_ФИОФизическихЛиц
	                  |ГДЕ
	                  |	ЛБ_ФИОФизическихЛиц.ФизическоеЛицо = &ФизическоеЛицо";
	ЗапросФИО.УстановитьПараметр("ФизическоеЛицо", Объект.ФизическоеЛицо);
	тз = ЗапросФИО.Выполнить().Выгрузить();
	Если тз.Количество() > 1 Тогда  
		Элементы.ИсторияФИО.Видимость = Истина;
	КонецЕсли;   
	
	Если ЛБ_ОбщийМодуль.ТекущийПользователь_ЭтоЛомбард() Тогда
		Элементы.СтавкаЧас.Видимость = Ложь;  
		Элементы.Пароль.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры



&НаКлиенте
Процедура ИсторияФИО(Команда)

	ПараметрыОткрытияФормы = Новый Структура;
    Отбор = Новый Структура;
    Отбор.Вставить("ФизическоеЛицо",  Объект.ФизическоеЛицо); 
	ПараметрыОткрытияФормы.Вставить("Отбор", Отбор);
    ОткрытьФорму("РегистрСведений.ЛБ_ФИОФизическихЛиц.ФормаСписка", ПараметрыОткрытияФормы);

КонецПроцедуры

