
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Залогодатель") Тогда
		Клиент = Параметры.Залогодатель;
	Иначе
		Отказ = Истина;
	КонецЕсли;    
		
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК Телефон,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПрописке КАК АдресПоПрописке,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ФактическийАдрес КАК АдресФактический,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ПочтовыйАдрес КАК АдресПочтовый,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Email КАК Email,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПропискеВручную КАК АдресПоПропискеВручную,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ФактическийАдресВручную КАК АдресФактическийВручную,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ПочтовыйАдресВручную КАК АдресПочтовыйВручную,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Комментарий КАК Комментарий,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаСмерти КАК ДатаСмерти
	               |ИЗ
	               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(, Залогодатель = &Клиент) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних"; 
	Выборка = Запрос.Выполнить().Выбрать(); 
	Если Выборка.Следующий() Тогда
	    Фамилия = Выборка.Фамилия;
		Имя = Выборка.Имя;
		Отчество = Выборка.Отчество;
		ДатаРождения = Выборка.ДатаРождения;
		ФИО = СокрЛП(Фамилия) + " " + СокрЛП(Имя) + ?(НЕ ПустаяСтрока(Отчество), " " + СокрЛП(Отчество), "") + ", дата рождения " + Формат(ДатаРождения, "ДЛФ=DD");
		ДатаРождения = Выборка.ДатаРождения;  
		Гражданство = Выборка.Гражданство; 
		Телефон = ?(ПустаяСтрока(Выборка.Телефон), "не указан", СокрЛП(Выборка.Телефон));
		Email = ?(ПустаяСтрока(Выборка.Email), "не указан", СокрЛП(Выборка.Email)); 
		АдресПоПрописке = ?(НЕ ПустаяСтрока(Выборка.АдресПоПрописке), Выборка.АдресПоПрописке, Выборка.АдресПоПропискеВручную); 
		Если ПустаяСтрока(АдресПоПрописке) Тогда
			АдресПоПрописке = "не указан";
		КонецЕсли;	
		АдресФактический = ?(НЕ ПустаяСтрока(Выборка.АдресФактический), Выборка.АдресФактический, Выборка.АдресФактическийВручную); 
		Если ПустаяСтрока(АдресФактический) Тогда
			АдресФактический = "не указан";
		КонецЕсли;	
		АдресПочтовый = ?(НЕ ПустаяСтрока(Выборка.АдресПочтовый), Выборка.АдресПочтовый, Выборка.АдресПочтовыйВручную); 
		Если ПустаяСтрока(АдресПочтовый) Тогда
			АдресПочтовый = "не указан";
		КонецЕсли;	
		Комментарий = Выборка.Комментарий;
		Если ПустаяСтрока(Комментарий) Тогда  
			Элементы.Комментарий.Видимость =Ложь;
		КонецЕсли;	
		
		ЗапросДок = Новый Запрос; 
	    ЗапросДок.УстановитьПараметр("Клиент", Клиент);
		ЗапросДок.УстановитьПараметр("Гражданство", Гражданство);
		ЗапросДок.Текст = "ВЫБРАТЬ
		                  |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
		                  |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
		                  |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
		                  |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
		                  |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
		                  |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
		                  |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия
		                  |ИЗ
		                  |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(
		                  |			,
		                  |			ДокументЗалогодателя.Владелец = &Клиент
		                  |				И Гражданство = &Гражданство
		                  |				И ОсновнойДУЛ = ИСТИНА) КАК ЛБ_ДокументыЗалогодателейСрезПоследних
		                  |
		                  |УПОРЯДОЧИТЬ ПО
		                  |	ЛБ_ДокументыЗалогодателейСрезПоследних.Период УБЫВ";  
		ВыборкаДок = ЗапросДок.Выполнить().Выбрать(); 
	    Если ВыборкаДок.Следующий() Тогда    
			ВидДокумента = ВыборкаДок.ВидДокумента; 
			ДокументСерия = ВыборкаДок.ДокументСерия;
			ДокументНомер = ВыборкаДок.ДокументНомер;   
			ДокументДатаВыдачи = ВыборкаДок.ДокументДатаВыдачи;
			ДокументКемВыдан = ВыборкаДок.ДокументКемВыдан;     
			Если НЕ ПустаяСтрока(ДокументКемВыдан) Тогда
				Элементы.ДокументКемВыдан.Видимость = Истина;
			КонецЕсли;	
			ДокументКодПодразделения = ВыборкаДок.ДокументКодПодразделения;
			Если НЕ ПустаяСтрока(ДокументКодПодразделения) Тогда
				Элементы.ДокументКодПодразделения.Видимость = Истина;
			КонецЕсли;
			ДокументСрокДействия = ВыборкаДок.ДокументСрокДействия; 
			Если НЕ ДокументСрокДействия = Дата(1,1,1) Тогда
				Элементы.ДокументСрокДействия.Видимость = Истина;
			КонецЕсли;
		Иначе
			ВидДокумента = "не найден"; 
		КонецЕсли;
		
		Если НЕ Гражданство = Справочники.СтраныМира.Россия Тогда 
			Элементы.ГруппаДопДокументы.Видимость = Истина;
			ДопДокументы.Загрузить(ЛБ_УправлениеЛомбардом.ПолучитьДокументыПравоПребыванияРФ(ТекущаяДата(), Клиент, Гражданство));
		КонецЕсли;	
	КонецЕсли;
	
	//++Иванов ВВ, статус ЭДО, согласия
	НаличиеЭДО = ЛБ_СоглашенияЭДОСервер.НаличиеДействующегоСоглашения(Клиент);
	
	Если НаличиеЭДО Тогда
		СоглашениеОбЭДО = "есть";
	Иначе
		СоглашениеОбЭДО = "нет";
	КонецЕсли;
	
	НаличиеСогласия = ЛБ_СогласияНаИнформированиеСервер.НаличиеДействующегоСогласия(Клиент);
	
	Если НаличиеСогласия Тогда
		СогласиеНаИнформирование = "есть";
	Иначе
		СогласиеНаИнформирование = "нет";
	КонецЕсли;
	//--Иванов ВВ

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если НЕ ДанныеАктуальны И НЕ ДанныеНеАктуальны Тогда
	    Отказ = Истина;  
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеАктуальны(Команда)
	ДанныеАктуальны = Истина;
	Этаформа.Закрыть(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДанныеНеАктуальны(Команда)
	ДанныеНеАктуальны = Истина;
	Этаформа.Закрыть(Ложь);
КонецПроцедуры
