
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ВидПеречня") Тогда
		ВидПеречня = Параметры.ВидПеречня; 
		ЭтаФорма.Заголовок = "Даты проверки перечня " + Строка(ВидПеречня);
	Иначе
		Сообщить("Не выбран вид перечня!");
		возврат;
	КонецЕсли;	 
	
	Если Параметры.Свойство("ДатаПроверки") Тогда   
		ДатаПроверки = Параметры.ДатаПроверки;
	иначе	
		ДатаПроверки = ТекущаяДата();
	КонецЕсли;
	
	Если Параметры.Свойство("Клиент") Тогда 
		Клиент = Параметры.Клиент;
	КонецЕсли;	
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ВидПеречня", ВидПеречня);
	Запрос.УстановитьПараметр("Дата", ДатаПроверки);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.Текст ="ВЫБРАТЬ РАЗЛИЧНЫЕ
	              |	ЛБ_ДатыЗагрузкиПеречней.Период КАК Период,
	              |	ЛБ_ДатыЗагрузкиПеречней.ДатаПеречня КАК ДатаПеречня,
	              |	ЛБ_ДатыЗагрузкиПеречней.ВидПроверки КАК ВидПроверки,
	              |	ЛБ_ДатыЗагрузкиПеречней.Ответственный КАК Ответственный
	              |ИЗ
	              |	РегистрСведений.ЛБ_ДатыЗагрузкиПеречней КАК ЛБ_ДатыЗагрузкиПеречней
	              |ГДЕ
	              |	ЛБ_ДатыЗагрузкиПеречней.ВидПеречня = &ВидПеречня
	              |	И ЛБ_ДатыЗагрузкиПеречней.Период <= &Дата
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	Период";  
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	ТаблицаЗапроса.Колонки.Добавить("ВидПроверкиАнкета");
	
	ВидыОперации = Новый СписокЗначений; 
	ВидыОперации.Добавить(Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог);
	ВидыОперации.Добавить(Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление);
	ВидыОперации.Добавить(Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов);
	ВидыОперации.Добавить(Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога);
	Запрос.УстановитьПараметр("ВидыОперации", ВидыОперации);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КарточкаЗалогодателя.Дата КАК Период,
	               |	ЛБ_КарточкаЗалогодателя.Ответственный КАК Ответственный,
	               |	0 КАК Вид
	               |ИЗ
	               |	Документ.ЛБ_КарточкаЗалогодателя КАК ЛБ_КарточкаЗалогодателя
	               |ГДЕ
	               |	ЛБ_КарточкаЗалогодателя.Дата <= &Дата
	               |	И ЛБ_КарточкаЗалогодателя.Проведен = ИСТИНА
	               |	И ЛБ_КарточкаЗалогодателя.Залогодатель = &Клиент
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЛБ_ОперацияПоЗалогу.Дата,
	               |	ЛБ_ОперацияПоЗалогу.ОтветственныйСотрудник,
	               |	1
	               |ИЗ
	               |	Документ.ЛБ_ОперацияПоЗалогу КАК ЛБ_ОперацияПоЗалогу
	               |ГДЕ
	               |	ЛБ_ОперацияПоЗалогу.Дата <= &Дата
	               |	И ЛБ_ОперацияПоЗалогу.Проведен = ИСТИНА
	               |	И ЛБ_ОперацияПоЗалогу.Залогодатель = &Клиент
	               |	И ЛБ_ОперацияПоЗалогу.ВидОперации В(&ВидыОперации)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период";  
	Выборка = Запрос.Выполнить().Выбрать();
	Ном = 0;   
	ДатаОформленияАнкеты = Дата(1,1,1);
	Пока Выборка.Следующий() цикл 
		СтрП  = ТаблицаЗапроса.Добавить(); 
		СтрП.Период = Выборка.Период; 
		СтрП.Ответственный = Выборка.Ответственный;  
		Если Выборка.Вид = 0 Тогда
			Если Ном = 0 Тогда
			    СтрП.ВидПроверкиАнкета = "Оформление анкеты клиента"; 
				ДатаОформленияАнкеты = Выборка.Период;
			Иначе   
				СтрП.ВидПроверкиАнкета = "Изменение анкеты клиента";
			КонецЕсли;	
			Ном = Ном + 1;   
		Иначе 
			СтрП.ВидПроверкиАнкета = "Оформление операции по займу";
		КонецЕсли;	
	Конеццикла;	 
	
	Для каждого Стр Из ТаблицаЗапроса Цикл  
		Если Стр.Период < ДатаОформленияАнкеты Тогда
			Продолжить;
		КонецЕсли;	
		НоваяСтр = ТаблицаОбновлений.Добавить();
		НоваяСтр.ДатаПроверки = Стр.Период; 
		НоваяСтр.ДатаПеречня = Стр.ДатаПеречня; 
		НоваяСтр.ВидПроверки = ?(ЗначениеЗаполнено(Стр.ВидПроверки), Стр.ВидПроверки, Стр.ВидПроверкиАнкета);
		НоваяСтр.Ответственный = стр.Ответственный;
	Конеццикла;
	ТаблицаОбновлений.Сортировать("ДатаПроверки Убыв, ДатаПеречня Убыв");

КонецПроцедуры
