// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	 //проверка есть ли не отмененные платежи
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	Движения.ЛБ_СостояниеРеестраПлатежей.Записывать = Истина;	 
				
	Если  РеестрПлатежей.ВидОперации = Перечисления.ЛБ_ВидыБезналичныхПлатежей.ЛичныйКабинет Тогда 
		Движение = Движения.ЛБ_СостояниеРеестраПлатежей.Добавить();
		Движение.Период = Дата;
		Движение.РеестрПлатежей = ЭтотОбъект.РеестрПлатежей;
		Движение.СтатусРеестра = Перечисления.ЛБ_СтатусыРеестраПлатежей.Отменен;
		Движение.СуммаПлатежей = ЭтотОбъект.РеестрПлатежей.ПлатежиЛК.Итог("СуммаПлатежа");
		Движение.Ответственный = ЭтотОбъект.Ответственный;
		
	ИначеЕсли  РеестрПлатежей.ВидОперации = Перечисления.ЛБ_ВидыБезналичныхПлатежей.РасчетыйСчет Тогда
		Движение = Движения.ЛБ_СостояниеРеестраПлатежей.Добавить();
		Движение.Период = Дата;
		Движение.РеестрПлатежей = ЭтотОбъект.РеестрПлатежей;
		Движение.СтатусРеестра = Перечисления.ЛБ_СтатусыРеестраПлатежей.Отменен;
		Движение.СуммаПлатежей = ЭтотОбъект.РеестрПлатежей.ПлатежиБН.Итог("СуммаПлатежа"); 
		Движение.Ответственный = ЭтотОбъект.Ответственный;
		
	КонецЕсли;	
КонецПроцедуры

