
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ЗаполнитьОтборыРегистров()
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда				
		Отбор = ДокументыЗалогодателя.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДокументЗалогодателя.Владелец");
	    Отбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	    Отбор.Использование  = Истина;
	    Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный; 
	    Отбор.ПравоеЗначение = Объект.Ссылка;
		
		Отбор = КонтактнаяИнформацияЗалогодателя.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Залогодатель");
	    Отбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	    Отбор.Использование  = Истина;
	    Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный; 
	    Отбор.ПравоеЗначение = Объект.Ссылка;
	КонецЕсли;	
	
КонецПроцедуры
	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Если РольДоступна("ПриемщикЛомбарда")
	//	И Не РольДоступна("ПолныеПрава") Тогда
	//	
	//	ТолькоПросмотр = Истина;
	//	
	//КонецЕсли;
	
	ЗаполнитьОтборыРегистров();
	Для каждого Элемент Из УсловноеОформление.Элементы Цикл
		Для каждого ЭлементОтбор Из Элемент.Отбор.Элементы Цикл
			ЭлементОтбор.ПравоеЗначение = ТекущаяДата();
		КонецЦикла;	
	КонецЦикла;	

КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименование()
	Объект.Наименование = СокрЛП(Объект.Фамилия) + " " + СокрЛП(Объект.Имя) + " " + СокрЛП(Объект.Отчество);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ЗаполнитьОтборыРегистров();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьДоступность()
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.ГруппаДокумент.Доступность = Истина;
		Элементы.ГруппаКонтактныеДанные.Доступность = Истина;
	Иначе
		Элементы.ГруппаДокумент.Доступность = ложь;
		Элементы.ГруппаКонтактныеДанные.Доступность = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	
	//Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	ПараметрыФормы = Новый Структура;
	//	ПараметрыФормы.Вставить("Владелец", Объект.Ссылка);
	//	
	//	ОткрытьФорму("РегистрСведений.ЛБ_ДокументыЗалогодателей.ФормаЗаписи", ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//Иначе	
	//	Сообщить("Документ не записан. Необходимо сначала записать документ.", СтатусСообщения.Информация);
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияЗалогодателяПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	
	//Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	ПараметрыФормы = Новый Структура;
	//	ПараметрыФормы.Вставить("Владелец", Объект.Ссылка);
	//	
	//	ОткрытьФорму("РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.ФормаЗаписи", ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//Иначе	
	//	Сообщить("Документ не записан. Необходимо сначала записать документ.", СтатусСообщения.Информация);
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	Объект.Фамилия = ТРег(Объект.Фамилия);
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	Объект.Имя = ТРег(Объект.Имя);
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	Объект.Отчество = ТРег(Объект.Отчество);
	СформироватьНаименование();
КонецПроцедуры

&НаСервере
Функция ПроверитьФИОЗалогодателя(Фамилия, Имя, Отчество)
    //Проверим правильность заполнения ФИО
	СтруктураВозврата = ЛБ_ОбщийМодуль.ПроверитьФИОЗалогодателя(Фамилия, Имя, Отчество);
	Если НЕ СтруктураВозврата.Результат Тогда
		Сообщить(СтруктураВозврата.Сообщение, СтатусСообщения.Важное);
	КонецЕсли;
	Возврат СтруктураВозврата.Результат;
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НЕ ПроверитьФИОЗалогодателя(Объект.Фамилия, Объект.Имя, Объект.Отчество) Тогда
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры


#КонецОбласти
