
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Список") Тогда
		Список = Параметры.Список;
	КонецЕсли;	
	Если Параметры.Свойство("Заголовок") Тогда
		ЭтаФорма.Заголовок = Параметры.Заголовок;
	Иначе
		ЭтаФорма.Заголовок = "Выберите значения";
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	ЕстьПометки = Ложь;
	Для Каждого Эл Из Список Цикл 
		Если Эл.Пометка Тогда 
			ЕстьПометки = Истина;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	Если НЕ ЕстьПометки Тогда  
		Предупреждение("Не выбрано ни одного значения!");
		Возврат;
	КонецЕсли;
	
	Закрыть(Список);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	Для Каждого Эл Из Список Цикл 
		Эл.Пометка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметку(Команда)
	Для Каждого Эл Из Список Цикл 
		Эл.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры
