
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Залогодатель = Параметры.Отбор.Залогодатель;
КонецПроцедуры

&НаКлиенте
Процедура ИсторияПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИсторияПриАктивизацииСтроки(Элемент)
	ТекСтр = Элемент.ТекущиеДанные;
	
	Если ТекСтр.ДатаИВремяСовпадения = Дата(1,1,1) Тогда
		ДатаПоиска = ТекСтр.Период;
	Иначе
		ДатаПоиска = ТекСтр.ДатаИВремяСовпадения;
	КонецЕсли;
	
	ЗаполнитьСовпадения(Залогодатель, ДатаПоиска);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСовпадения(Залогодатель, Дата)
	
	Совпадения.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ЧастичныеСовпаденияПоПеречнямСрезПервых.Период КАК Период,
		|	ЛБ_ЧастичныеСовпаденияПоПеречнямСрезПервых.Залогодатель КАК Залогодатель,
		|	ЛБ_ЧастичныеСовпаденияПоПеречнямСрезПервых.СтрокаСовпадения КАК СтрокаСовпадения
		|ИЗ
		|	РегистрСведений.ЛБ_ЧастичныеСовпаденияПоПеречням.СрезПервых(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_ЧастичныеСовпаденияПоПеречнямСрезПервых
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		МассивСтрокСовпадения = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(РезультатЗапроса.СтрокаСовпадения, ";", Ложь);
		
		Для каждого СтрМ Из МассивСтрокСовпадения Цикл
			МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрМ, "|", Ложь);
			
			Если МассивСтрок.Количество() = 5 Тогда
				НаваяСтр = Совпадения.Добавить();
				
				Если МассивСтрок[0] = "Наим" Тогда
					НаваяСтр.Наименование = МассивСтрок[1];
				ИначеЕсли МассивСтрок[0] = "ДрНаим" Тогда
					НаваяСтр.ДрНаименование = МассивСтрок[1];
				КонецЕсли;
				
				НаваяСтр.ИД = МассивСтрок[2];
				НаваяСтр.ДатаРождения = СтроковыеФункцииКлиентСервер.СтрокаВДату(МассивСтрок[3]);
				НаваяСтр.ВидПеречня = МассивСтрок[4];
			Иначе
				Сообщить("Некорректно заполнена строка совпадения");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
















