
&НаКлиенте
Процедура ПробыПробаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	Если НЕ ЗначениеЗаполнено(Объект.Металл) Тогда
		Сообщить("Не выбран металл!");
	Иначе
	    фиксНастройки = Новый НастройкиКомпоновкиДанных;
	    Отбор = фиксНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
	    Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	    Отбор.ПравоеЗначение = Объект.Металл;
	    Отбор.Использование = Истина;
	    Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	    ПараметрыФормы = Новый Структура;
	    ПараметрыФормы.Вставить("ФиксированныеНастройки", фиксНастройки);
	    ОткрытьФорму("Справочник.ЛБ_Пробы.ФормаВыбора", ПараметрыФормы, Элемент);
	КонецЕсли;	
КонецПроцедуры
