
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Наименование = "1";
КонецПроцедуры

&НаКлиенте
Процедура ВыходнойПриИзменении(Элемент)
	ДоступностьЭлементов();
КонецПроцедуры 

Процедура ДоступностьЭлементов()
	Если Объект.Выходной = 2 Тогда
		Объект.ВремяНачала = "";
		Объект.ВремяОкончания = "";
		Элементы.ВремяНачала.Доступность = Ложь;
		Элементы.ВремяОкончания.Доступность = Ложь;
	Иначе   
		Элементы.ВремяНачала.Доступность = Истина;
		Элементы.ВремяОкончания.Доступность = Истина;
	КонецЕсли; 
КонецПроцедуры
