
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("НакладнаяНаОтгрузку") Тогда
		НакладнаяНаОтгрузку = Параметры.НакладнаяНаОтгрузку;    
		Ломбард = НакладнаяНаОтгрузку.Ломбард;
		ОтделениеЛомбарда = ЛБ_ОбщийМодуль.ПолучитьОтделениеЛомбарда(ТекущаяДатаСеанса(), Ломбард); 
		ДатаОтгрузки = ТекущаяДатаСеанса();
		Получатель = Справочники.ЛБ_Ломбарды.ЦентральныйОфис; 
		Элементы.СкладПолучатель.СписокВыбора.ЗагрузитьЗначения(ЗаполнитьСписокВыбораСкладов());
		Если Элементы.СкладПолучатель.СписокВыбора.Количество() = 1 Тогда
			СкладПолучатель = Элементы.СкладПолучатель.СписокВыбора.Получить(0).Значение;
		КонецЕсли;	
	Иначе
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьЛомбардыОтделения() 
	Возврат ЛБ_ОбщийМодуль.ПолучитьЛомбардыВОтделении(ТекущаяДатаСеанса(), ОтделениеЛомбарда, Ломбард); 
КонецФункции

&НаКлиенте
Процедура Отгрузить(Команда)
	ВсеОК = Истина;  
	Если НЕ ЗначениеЗаполнено(Инкассатор) Тогда
		ВсеОК = Ложь;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(Получатель) Тогда
		ВсеОК = Ложь;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(СкладПолучатель) Тогда
		ВсеОК = Ложь;
	КонецЕсли;	
	
	Если НЕ ВсеОК тогда
		Предупреждение("Необходимо заполнить все реквизиты на форме!", 60);
		Возврат;
	КонецЕсли;	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Инкассатор", Инкассатор);
	СтруктураВозврата.Вставить("Получатель", Получатель); 
	СтруктураВозврата.Вставить("СкладПолучатель", СкладПолучатель); 
	СтруктураВозврата.Вставить("ДатаОтгрузки", ДатаОтгрузки);
	СтруктураВозврата.Вставить("НакладнаяНаОтгрузку", НакладнаяНаОтгрузку);
	ЭтаФорма.Закрыть(СтруктураВозврата);
КонецПроцедуры 

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСписокВыбораСкладов() 
	МассивС = Новый Массив;
	Если Получатель = Справочники.ЛБ_Ломбарды.ЦентральныйОфис Тогда  
		МассивС.Добавить(ЛБ_Общиймодуль.ПолучитьСклад(Получатель, Перечисления.ЛБ_ВидыСкладов.ОбщийСкладЦО));   
	Иначе	
	    МассивС.Добавить(ЛБ_Общиймодуль.ПолучитьСклад(Получатель, Перечисления.ЛБ_ВидыСкладов.Залоги)); 
	КонецЕсли;
	Возврат МассивС; 
КонецФункции	

&НаКлиенте
Процедура ПолучательНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	СтандартнаяОбработка = Ложь; 
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораПолучателя",ЭтаФорма);
    Если ЗначениеЗаполнено(ОтделениеЛомбарда) Тогда 
		СписокВыбора = ПолучитьЛомбардыОтделения();  
		СписокВыбора.Вставить(0, ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис"));
		ВыбранноеЗначение = ВыбратьИзСписка(СписокВыбора, Ломбард); 

		Если ВыбранноеЗначение <> Неопределено Тогда 
		   Получатель = ВыбранноеЗначение.Значение;
		   Элементы.СкладПолучатель.СписокВыбора.ЗагрузитьЗначения(ЗаполнитьСписокВыбораСкладов());
		   Если Элементы.СкладПолучатель.СписокВыбора.Количество() = 1 Тогда
			   СкладПолучатель = Элементы.СкладПолучатель.СписокВыбора.Получить(0).Значение;
		   КонецЕсли;	
	   КонецЕсли;      
	Иначе	 
	    ОткрытьФорму("Справочник.ЛБ_Ломбарды.ФормаВыбора",,ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	КонецЕсли;	
КонецПроцедуры    
	
&НаСервере
Процедура ПослеВыбораПолучателя(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;  
	
	Получатель = Результат; 
	Элементы.СкладПолучатель.СписокВыбора.ЗагрузитьЗначения(ЗаполнитьСписокВыбораСкладов());
	Если Элементы.СкладПолучатель.СписокВыбора.Количество() = 1 Тогда
		СкладПолучатель = Элементы.СкладПолучатель.СписокВыбора.Получить(0).Значение;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ИнкассаторОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = Тип("СправочникСсылка.ЛБ_Сотрудники") Тогда
		СтандартнаяОбработка = Ложь;
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Ссылка", СформироватьМассивСотрудников());
		
		ПараметрФормы = Новый Структура;
		ПараметрФормы.Вставить("Отбор", СтруктураОтбора);
		
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораСотрудникика", ЭтаФорма);
		
		ОткрытьФорму("Справочник.ЛБ_Сотрудники.ФормаВыбора", ПараметрФормы, ЭтаФорма,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СформироватьМассивСотрудников()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.ЛБ_КадроваяИсторияСотрудников.СрезПоследних(&Дата, ) КАК ЛБ_КадроваяИсторияСотрудниковСрезПоследних
		|ГДЕ
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыКадровыхСобытий.Увольнение)
		|	И ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Подразделение В
		|			(ВЫБРАТЬ
		|				ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард
		|			ИЗ
		|				РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, Отделение В
		|					(ВЫБРАТЬ
		|						ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
		|					ИЗ
		|						РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, Ломбард = &Ломбард) КАК ЛБ_ОтделенияЛомбардовСрезПоследних)) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
		|			ГДЕ
		|				НЕ ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.Закрыт)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник.Наименование";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	МассивВозврата = Новый Массив;
	
	Для каждого Стр Из Результат Цикл
		МассивВозврата.Добавить(Стр.Сотрудник);
	КонецЦикла;
	
	Возврат МассивВозврата;
	
КонецФункции

&НаКлиенте
Процедура ПослеВыбораСотрудникика(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	Инкассатор = Результат;
КонецПроцедуры

&НаКлиенте
Процедура ИнкассаторНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Инкассатор = Неопределено;
КонецПроцедуры

	
	
