&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	Если Параметры.Свойство("ЗалоговыйБилет") Тогда  
		ЗБ = Параметры.ЗалоговыйБилет;
	    ЭтаФорма.Заголовок = "Приказы по процентым ставкам в залогововом билете № " + ЗБ.НомерЗалоговогоБилета;  

		ОтборПриказа = ЛБ_ОбщийМодуль.ПолучитьПриказыПоПроценымСтавкамВЗБ(ЗБ);
		Если ОтборПриказа.Количество() = 0 Тогда
			Если Параметры.Свойство("Приказ") Тогда  
				ЭтаФорма.Заголовок = "Приказы по процентым ставкам на дату залоговового билета № " + ЗБ.НомерЗалоговогоБилета;
				ОтборПриказа = Новый СписокЗначений;
				ОтборПриказа.Добавить(Параметры.Приказ); 
			КонецЕсли;	 
		КонецЕсли;	
				
		ЭтаФорма.Элементы.ТаблицаПриказов.КоманднаяПанель.Видимость = ложь; 
		ЭтаФорма.Элементы.ЦеныМеталлыКнопкиДоп.Видимость = Ложь;
		ЭтаФорма.Элементы.ТекущийПриказЦеныВставкиГруппаЗаполнить.Видимость = Ложь; 
		ЭтаФорма.Элементы.ТаблицаСтавокАкцииЗаполнитьАкцииСтавкиПоШаблону.Видимость = Ложь; 
		ЭтаФорма.Элементы.ТаблицаСтавокАкцииЗаполнитьПроцентныеСтавкиАкция.Видимость = Ложь;  
		ЭтаФорма.Элементы.ГруппаПараметрыПечати.Видимость = Ложь;
	ИначеЕсли Параметры.Свойство("Действующие") Тогда
		ЭтаФорма.Заголовок = "Действующие приказы"; 
		Если Параметры.Свойство("Ломбард") Тогда
			ТекЛомбард = Параметры.Ломбард;
			ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " в ломбарде № " + СокрЛП(ТекЛомбард.НомерЛомбарда);
		КонецЕсли;	   
		ОтборПриказа = ЛБ_ОбщийМодуль.ПолучитьДействующиеПриказы(ТекЛомбард); 		
		ЭтаФорма.Элементы.ТаблицаПриказов.КоманднаяПанель.Видимость = ложь;  
		ЭтаФорма.Элементы.ЦеныМеталлыКнопкиДоп.Видимость = Ложь; 
		ЭтаФорма.Элементы.ТекущийПриказЦеныВставкиГруппаЗаполнить.Видимость = Ложь; 
		ЭтаФорма.Элементы.ТаблицаСтавокАкцииЗаполнитьАкцииСтавкиПоШаблону.Видимость = Ложь; 
		ЭтаФорма.Элементы.ТаблицаСтавокАкцииЗаполнитьПроцентныеСтавкиАкция.Видимость = Ложь;  
		ЭтаФорма.Элементы.ГруппаПараметрыПечати.Видимость = Ложь;
	Иначе	
		ОсновнаяЕдиницаИзмерения = Константы.ЛБ_ОсновнаяЕдиницаМеталлы.Получить();
		ЗаполнитьВыборЕдиницИзмерения(); 
		
		ОсновнаяЕдиницаИзмеренияВставки = Константы.ЛБ_ОсновнаяЕдиницаКамни.Получить();
		ЗаполнитьВыборЕдиницИзмеренияВставки();  
		
		ЗапросБазовыеЦены = Новый Запрос;
		ЗапросБазовыеЦены.Текст = "ВЫБРАТЬ
		                          |	ЛБ_БазовыеЦеныНаДрагоценныеМеталлы.Период КАК Период,
		                          |	ЛБ_БазовыеЦеныНаДрагоценныеМеталлы.Проба КАК Проба,
		                          |	ЛБ_БазовыеЦеныНаДрагоценныеМеталлы.КатегорияОбъектаЗалога КАК Категория
		                          |ИЗ
		                          |	РегистрСведений.ЛБ_БазовыеЦеныНаДрагоценныеМеталлы КАК ЛБ_БазовыеЦеныНаДрагоценныеМеталлы
		                          |
		                          |УПОРЯДОЧИТЬ ПО
		                          |	Период";
		ТаблицаБазовыеЦены.Загрузить(ЗапросБазовыеЦены.Выполнить().Выгрузить());
		
		//Запрос = Новый Запрос;
		//Запрос.Текст = "ВЫБРАТЬ
		//               |	ЛБ_ДиапазоныСуммЗайма.Ссылка КАК Ссылка
		//               |ИЗ
		//               |	Справочник.ЛБ_ДиапазоныСуммЗайма КАК ЛБ_ДиапазоныСуммЗайма
		//               |ГДЕ
		//               |	ЛБ_ДиапазоныСуммЗайма.ЭтоГруппа = ЛОЖЬ
		//               |	И ЛБ_ДиапазоныСуммЗайма.ПометкаУдаления = ЛОЖЬ
		//               |
		//               |УПОРЯДОЧИТЬ ПО
		//               |	ЛБ_ДиапазоныСуммЗайма.ПорядокСортировки";
		//Выборка = Запрос.Выполнить().Выбрать();
		//Пока Выборка.Следующий() Цикл
		//    Элементы.ТаблицаСтавокДиапазонСумм.СписокВыбора.Добавить(Выборка.Ссылка); 
		//	Элементы.ТаблицаСтавокАкцииДиапазонСумм.СписокВыбора.Добавить(Выборка.Ссылка);
		//КонецЦикла;	

		КонПериода = ТекущаяДата(); 
		НачПериода = НачалоДня(ДобавитьМесяц(КонПериода, -2));  
		Период = Новый СтандартныйПериод(НачПериода, КонПериода);
		ЭтаФорма.Заголовок = "Журнал приказов " + ПредставлениеПериода(Период.ДатаНачала, Период.ДатаОкончания);
    КонецЕсли;
	ЗаполнитьТаблицуПриказов();
    ЗаполнитьДеревоЛомбардов(); 
	
	Элементы.СпособВыводаЛомбардовНаПечать.СписокВыбора.Очистить();  
	Элементы.СпособВыводаЛомбардовНаПечать.СписокВыбора.Добавить(0, "по ломбардам"); 
	Элементы.СпособВыводаЛомбардовНаПечать.СписокВыбора.Добавить(1, "по отделениям ломбардов");
	
	СпособВыводаЛомбардовНаПечать = ТекущийПриказ.ВыводитьЛомбарды; 
	ЕстьПолныеПрава = ?(РольДоступна("Администрирование"), истина, ложь);   
	
	Если ЗначениеЗаполнено(ОтборПриказа) Тогда 
		Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаСтавки;
	КонецЕсли;	
КонецПроцедуры 


&НаСервере
Процедура ЗаполнитьДеревоЛомбардов()

    Запрос = Новый Запрос; 
    Если ВидОтбораЛомбардов = 0 Тогда
	    Запрос.Текст = "ВЫБРАТЬ
	                   |	ЛБ_Ломбарды.Ссылка КАК Ломбард,
	                   |	ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
	                   |ИЗ
	                   |	Справочник.ЛБ_Ломбарды КАК ЛБ_Ломбарды
	                   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних КАК ЛБ_ОтделенияЛомбардовСрезПоследних
	                   |		ПО (ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард = ЛБ_Ломбарды.Ссылка)
	                   |ГДЕ
	                   |	ЛБ_Ломбарды.Закрыт = ЛОЖЬ";
    Иначе	
	    Запрос.Текст = "ВЫБРАТЬ
	                   |	ЛБ_Ломбарды.Ссылка КАК Ломбард,
	                   |	ЛБ_ГруппыЛомбардовСрезПоследних.Группа КАК Отделение
	                   |ИЗ
	                   |	Справочник.ЛБ_Ломбарды КАК ЛБ_Ломбарды
	                   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ГруппыЛомбардов.СрезПоследних КАК ЛБ_ГруппыЛомбардовСрезПоследних
	                   |		ПО (ЛБ_ГруппыЛомбардовСрезПоследних.Ломбард = ЛБ_Ломбарды.Ссылка)
	                   |ГДЕ
	                   |	ЛБ_Ломбарды.Закрыт = ЛОЖЬ";
    КонецЕсли;	   
    ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
    Отделения = ТаблицаЗапроса.Скопировать(); 
    Отделения.Свернуть("Отделение");
	 	
	ДанныеДерево =  Новый ДеревоЗначений;  
	ДанныеДерево.Колонки.Добавить("Ломбард"); 
	ДанныеДерево.Колонки.Добавить("Предопределенный", Новый ОписаниеТипов("Булево"));
	ДанныеДерево.Колонки.Добавить("Пометка", Новый ОписаниеТипов("Булево"));
	ДанныеДерево.Колонки.Добавить("ЭтоГруппа", Новый ОписаниеТипов("Булево"));
	ДанныеДерево.Колонки.Добавить("ОтделениеРодитель");
	Для каждого СтрО Из Отделения Цикл 
		СтрокаВерхнего = ДанныеДерево.Строки.Добавить();
		Если СтрО.Отделение = null Тогда
		    СтрокаВерхнего.Ломбард = ?(ВидОтбораЛомбардов = 0, Справочники.ЛБ_ОтделенияЛомбардов.ЛомбардыВнеОтделений, Справочники.ЛБ_ГруппыЛомбардов.ЛомбардыВнеГрупп);
			СтрокаВерхнего.Предопределенный = Истина;
		Иначе    
			СтрокаВерхнего.Ломбард = СтрО.Отделение;
		КонецЕсли;
		СтрокаВерхнего.ЭтоГруппа = Истина;
		
		Отбор = Новый Структура; 
		Отбор.Вставить("Отделение", СтрО.Отделение);          
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
		Для каждого стр Из Строки Цикл		
		   СтрокаВторого = СтрокаВерхнего.Строки.Добавить();
		   СтрокаВторого.Ломбард = Стр.Ломбард;
		   СтрокаВторого.ОтделениеРодитель = СтрокаВерхнего.Ломбард; 
		КонецЦикла;
	Конеццикла;	 
	ДанныеДерево.Строки.Сортировать("Предопределенный Убыв, Ломбард", Истина);
		
	ЗначениеВРеквизитФормы(ДанныеДерево, "Дерево");  
	Если НЕ СписокЛомбардыОтбор.Количество() = 0 Тогда                        
		ДеревоНаСервере = РеквизитФормыВЗначение("Дерево");
		ПроставитьГалочки(ДеревоНаСервере);
		ЗначениеВРеквизитФормы(ДеревоНаСервере, "Дерево");	
	КонецЕсли;
КонецПроцедуры  

&НаСервере
Процедура ПроставитьГалочки(ДеревоНаСервере)
	Для каждого Строка Из ДеревоНаСервере.Строки Цикл		
		Если НЕ СписокЛомбардыОтбор.НайтиПоЗначению(Строка.Ломбард) = неопределено  Тогда
			Строка.Пометка = Истина; 
		КонецЕсли;		

		Если НЕ Строка.Строки.Количество() = 0 Тогда
			ПроставитьГалочки(Строка);
		КонецЕсли;	
	
	КонецЦикла;	
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьВидимость()
	Если ТекущийПриказ.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.Базовый") Тогда 		
		Элементы.ГруппаЦеныМеталлы.Видимость = Истина;  
		Элементы.ГруппаЦеныВставки.Видимость = Истина;
		Элементы.ГруппаСтавки.Видимость = Истина; 
		Элементы.ГруппаАкцииМеталлы.Видимость = ложь; 
		Элементы.ГруппаАкцииСтавки.Видимость = ложь; 
		Элементы.ГруппаАкция.Видимость = ложь;
		Элементы.ГруппаСК.Видимость = Истина; 
		Элементы.ТекущийПриказНачальникОДО.Видимость = Истина;
		Элементы.ТекущийПриказНачальникОРБ.Видимость = Истина;
		Элементы.ТекущийПриказОтветственноеЛицоОРБ.Видимость = Ложь;
		Элементы.ТекущийПриказОтветственноеЛицоРеклама.Видимость = Ложь;
		Элементы.ТекущийПриказПодписантДолжность.Видимость = Ложь;
		Элементы.ТекущийПриказПодписантФИО.Видимость = Ложь;
		Элементы.СпособВыводаЛомбардовНаПечать.Видимость = Ложь; 
		Элементы.ТекущийПриказНеВыводитьНаПечатьПричиныПрименения.Видимость = Истина;
	Иначе 
		Элементы.ГруппаЦеныМеталлы.Видимость = ложь;  
		Элементы.ГруппаЦеныВставки.Видимость = ложь;
		Элементы.ГруппаСтавки.Видимость = ложь; 
		Элементы.ГруппаАкцииМеталлы.Видимость = Истина; 
		Элементы.ГруппаАкцииСтавки.Видимость = Истина;  
		Элементы.ГруппаАкция.Видимость = Истина;
		Элементы.ГруппаСК.Видимость = ложь;  
		Элементы.ТекущийПриказНачальникОДО.Видимость = Ложь;
		Элементы.ТекущийПриказНачальникОРБ.Видимость = Истина; 
		Элементы.ТекущийПриказОтветственноеЛицоОРБ.Видимость = Истина;
		Элементы.ТекущийПриказОтветственноеЛицоРеклама.Видимость = Истина;
		Элементы.ТекущийПриказПодписантДолжность.Видимость = Истина;
		Элементы.ТекущийПриказПодписантФИО.Видимость = Истина;
		Элементы.СпособВыводаЛомбардовНаПечать.Видимость = Истина;  
		Элементы.ТекущийПриказНеВыводитьНаПечатьПричиныПрименения.Видимость = Ложь;
	КонецЕсли;
	Если ТекущийПриказ.Проведен тогда
		Элементы.ТаблицаПриказовКнопкаОтменитьПроведение.Доступность = Истина; 
		Элементы.ТекущийПриказНачальникОДО.ТолькоПросмотр = Истина;
		Элементы.ТекущийПриказНачальникОРБ.ТолькоПросмотр = Истина;
		Элементы.ТекущийПриказОтветственноеЛицоОРБ.ТолькоПросмотр = Истина;
		Элементы.ТекущийПриказОтветственноеЛицоРеклама.ТолькоПросмотр = Истина;
		Элементы.ТекущийПриказПодписантДолжность.ТолькоПросмотр = Истина;
		Элементы.ТекущийПриказПодписантФИО.ТолькоПросмотр = Истина;
		Элементы.СпособВыводаЛомбардовНаПечать.ТолькоПросмотр = Истина;
		Элементы.ТекущийПриказНеВыводитьНаПечатьПричиныПрименения.ТолькоПросмотр = Истина;
		//+МАН 17.12.24 Заявка 2934       
		Элементы.ГруппаСтавки.ТолькоПросмотр = Истина;
		Элементы.ГруппаЦеныМеталлы.ТолькоПросмотр = Истина;
		Элементы.ГруппаЦеныВставки.ТолькоПросмотр = Истина;   
		Элементы.ГруппаАкцииСтавки.ТолькоПросмотр = Истина;
		Элементы.ГруппаПараметрыПечати.ТолькоПросмотр = Истина;
		Элементы.ТекущийПриказЦеныВставкиГруппаЗаполнить.Доступность = Ложь;
		Элементы.ЦеныМеталлыКнопкиДоп.Доступность = Ложь; 
		Элементы.ТаблицаОтклоненийОтБазовыхЦенМеталлы.КоманднаяПанель.Доступность =ложь;
		Элементы.ТаблицаСтавокАкции.КоманднаяПанель.Доступность = Ложь;  
		Элементы.ТаблицаСтавок.КоманднаяПанель.Доступность = Ложь;
		//-МАН
	Иначе
		Элементы.ТаблицаПриказовКнопкаОтменитьПроведение.Доступность = ложь; 
		Элементы.ТекущийПриказНачальникОДО.ТолькоПросмотр = Ложь;
		Элементы.ТекущийПриказНачальникОРБ.ТолькоПросмотр = Ложь;
		Элементы.ТекущийПриказОтветственноеЛицоОРБ.ТолькоПросмотр = Ложь;
		Элементы.ТекущийПриказОтветственноеЛицоРеклама.ТолькоПросмотр = Ложь;
		Элементы.ТекущийПриказПодписантДолжность.ТолькоПросмотр = Ложь;
		Элементы.ТекущийПриказПодписантФИО.ТолькоПросмотр = Ложь;
		Элементы.СпособВыводаЛомбардовНаПечать.ТолькоПросмотр = Ложь;
        Элементы.ТекущийПриказНеВыводитьНаПечатьПричиныПрименения.ТолькоПросмотр = Ложь;
		//+МАН 17.12.24 Заявка 2934   
		Элементы.ГруппаСтавки.ТолькоПросмотр = Ложь;
		Элементы.ГруппаЦеныМеталлы.ТолькоПросмотр = Ложь;
		Элементы.ГруппаЦеныВставки.ТолькоПросмотр = Ложь;  
		Элементы.ГруппаАкцииСтавки.ТолькоПросмотр = Ложь;
		Элементы.ГруппаПараметрыПечати.ТолькоПросмотр = Ложь;
		Элементы.ТекущийПриказЦеныВставкиГруппаЗаполнить.Доступность = Истина;
		Элементы.ЦеныМеталлыКнопкиДоп.Доступность = Истина;
		Элементы.ТаблицаОтклоненийОтБазовыхЦенМеталлы.КоманднаяПанель.Доступность = истина; 
		Элементы.ТаблицаСтавокАкции.КоманднаяПанель.Доступность = Истина; 
		Элементы.ТаблицаСтавок.КоманднаяПанель.Доступность = Истина;
		//-МАН
	КонецЕсли;	
КонецПроцедуры  

&НаСервере
Процедура ПолучитьДополнительныеРеквизиты(СтрокаПриказа) 
	ДокументОбъект = СтрокаПриказа.Ссылка.ПолучитьОбъект();
	ЛБ_УправлениеЛомбардом.ЗаполнитьДополнительныеРеквизитыПриказа(ДокументОбъект); 
	ДокументОбъект.Записать();    
	
	СтрокаПриказа.Металлы = ДокументОбъект.ЕстьМеталлы;
	//+МАН 24.01.25 Добавление отметки наличия отклонений металлов. Заявка 2792.
	СтрокаПриказа.ОтклМеталлы = ДокументОбъект.ЕстьОтклМеталлы;
	//-МАН
	СтрокаПриказа.Вставки = ДокументОбъект.ЕстьВставки;
	СтрокаПриказа.ПроцентныеСтавки = ДокументОбъект.ЕстьПроцентныеСтавки;
	СтрокаПриказа.АкцияСтавки = ДокументОбъект.ЕстьАкцииПроцентныеСтавки; 
	СтрокаПриказа.АкцияМеталлы = ДокументОбъект.ЕстьАкцииМеталлы;
	СтрокаПриказа.КоличествоЛомбардов = ДокументОбъект.КоличествоЛомбардов; 
	СтрокаПриказа.БазоваяЦенаМеталлы = ДокументОбъект.БазоваяЦенаМеталлы;
	СтрокаПриказа.МаксимальнаяПроцентнаяСтавка = ДокументОбъект.МаксимальнаяПроцентнаяСтавка; 
 КонецПроцедуры	
	
&НаСервере
Процедура ЗаполнитьТаблицуПриказов(ИдентификаторСтроки = неопределено)    
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата1", ?(НачПериода = Дата(1,1,1), НачПериода, НачалоДня(НачПериода))); 
	Запрос.УстановитьПараметр("Дата2", ?(КонПериода = Дата(1,1,1), КонецДня(ТекущаяДата()), КонецДня(КонПериода)));
	Запрос.УстановитьПараметр("СписокЛомбардов", ВыборСписокЛомбардов);
	Запрос.УстановитьПараметр("НомерПриказа", СокрЛП(ВыборНомерПриказа) + "%"); 
	Запрос.УстановитьПараметр("ОтборПриказа", ОтборПриказа);
	Запрос.Текст ="ВЫБРАТЬ
	              |	ЛБ_ПриказУсловияПредоставленияЗаймов.Ссылка КАК Ссылка,
	              |	ЛБ_ПриказУсловияПредоставленияЗаймов.Номер КАК Номер,
	              |	ЛБ_ПриказУсловияПредоставленияЗаймов.Дата КАК Дата,
	              |	ЛБ_ПриказУсловияПредоставленияЗаймов.Ответственный КАК Ответственный,
	              |	ЛБ_ПриказУсловияПредоставленияЗаймов.Комментарий КАК Комментарий,
	              |	ЛБ_ПриказУсловияПредоставленияЗаймов.СтрокаЛомбарды КАК СтрокаЛомбарды,
	              |	ЛБ_ПриказУсловияПредоставленияЗаймов.ДатаОкончанияДействияПриказа КАК ДатаОкончанияДействияПриказа,
	              |	ЛБ_ПриказУсловияПредоставленияЗаймов.ВидОперации КАК ВидОперации,
	              |	ЛБ_ПриказУсловияПредоставленияЗаймов.ВидПриказа КАК ВидПриказа,
	              |	ЛБ_ПриказУсловияПредоставленияЗаймов.ДатаНачалаДействияПриказа КАК ДатаНачалаДействияПриказа,
	              |	ЛБ_ПриказУсловияПредоставленияЗаймов.НомерПриказа КАК НомерПриказа,
	              |	ВЫБОР
	              |		КОГДА ЛБ_ПриказУсловияПредоставленияЗаймов.ПометкаУдаления
	              |			ТОГДА 2
	              |		ИНАЧЕ ВЫБОР
	              |				КОГДА ЛБ_ПриказУсловияПредоставленияЗаймов.Проведен
	              |					ТОГДА 1
	              |				ИНАЧЕ 0
	              |			КОНЕЦ
	              |	КОНЕЦ КАК СостояниеДокумента,
	              |	ЛБ_ПриказУсловияПредоставленияЗаймов.ЕстьМеталлы КАК Металлы,
	              |	ЛБ_ПриказУсловияПредоставленияЗаймов.ЕстьВставки КАК Вставки,
				//+МАН 24.01.25 Добавление отметки наличия отклонений металлов. Заявка 2792.
	              |	ЛБ_ПриказУсловияПредоставленияЗаймов.ЕстьОтклМеталлы КАК ОтклМеталлы,
				//-МАН
	              |	ЛБ_ПриказУсловияПредоставленияЗаймов.ЕстьПроцентныеСтавки КАК ПроцентныеСтавки,
				  //+МАН 22.01.25 Исправил наименование колонок в запросе для дальнейшего, корректного, заполнения списка. Заявка 2581
	              |	ЛБ_ПриказУсловияПредоставленияЗаймов.ЕстьАкцииПроцентныеСтавки КАК АкцияСтавки,
	              |	ЛБ_ПриказУсловияПредоставленияЗаймов.ЕстьАкцииМеталлы КАК АкцияМеталлы,
				  //-МАН
	              |	ЛБ_ПриказУсловияПредоставленияЗаймов.КоличествоЛомбардов КАК КоличествоЛомбардов,
	              |	ЛБ_ПриказУсловияПредоставленияЗаймов.БазоваяЦенаМеталлы КАК БазоваяЦенаМеталлы,
	              |	ЛБ_ПриказУсловияПредоставленияЗаймов.МаксимальнаяПроцентнаяСтавка КАК МаксимальнаяПроцентнаяСтавка,
				  //+МАН 15.11.24 Вывод наименования акции в ТЧ приказов. Заявка 2581.
				  |	ЛБ_ПриказУсловияПредоставленияЗаймов.Акция КАК Акция
				  //-МАН
	              |ИЗ
	              |	Документ.ЛБ_ПриказУсловияПредоставленияЗаймов КАК ЛБ_ПриказУсловияПредоставленияЗаймов
	              |ГДЕ
	              |	ЛБ_ПриказУсловияПредоставленияЗаймов.Дата МЕЖДУ &Дата1 И &Дата2";
	Если НЕ ВыборСписокЛомбардов.Количество() = 0 Тогда
		Запрос.Текст = Запрос.Текст + "
	              |	И ЛБ_ПриказУсловияПредоставленияЗаймов.Ломбарды.Ломбард В(&СписокЛомбардов)";
	КонецЕсли;  
	Если НЕ ПустаяСтрока(ВыборНомерПриказа) Тогда
		Запрос.Текст = Запрос.Текст + "
	              |	И ЛБ_ПриказУсловияПредоставленияЗаймов.НомерПриказа ПОДОБНО &НомерПриказа";
	КонецЕсли; 
	Если ЗначениеЗаполнено(ОтборПриказа) Тогда
		Запрос.Текст = Запрос.Текст + "
	              |	И ЛБ_ПриказУсловияПредоставленияЗаймов.Ссылка В (&ОтборПриказа)";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	Дата УБЫВ"; 
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	ТаблицаПриказов.Загрузить(ТаблицаЗапроса); 
	
	Если НЕ ТаблицаПриказов.Количество() = 0 Тогда
		Если ИдентификаторСтроки = неопределено Тогда
			//КолСтр = ТаблицаПриказов.Количество();
			СтрокаТЗ = ТаблицаПриказов[0];
			ИдентификаторСтроки = СтрокаТЗ.ПолучитьИдентификатор();
		КонецЕсли;	
		Элементы.ТаблицаПриказов.ТекущаяСтрока = ИдентификаторСтроки;
		ДокументОбъект = ТаблицаПриказов[0].Ссылка.ПолучитьОбъект();
		ЗначениеВРеквизитФормы(ДокументОбъект, "ТекущийПриказ");
		Если ДокументОбъект.Проведен Тогда 
			Элементы.СтрокаЛомбарды.ТолькоПросмотр = Истина;
			Элементы.СтрокаСК.ТолькоПросмотр = Истина;
	        Элементы.Акция.ТолькоПросмотр = Истина;
		Иначе
			Элементы.СтрокаЛомбарды.ТолькоПросмотр = Ложь;
			Элементы.СтрокаСК.ТолькоПросмотр = Ложь;
	        Элементы.Акция.ТолькоПросмотр = Ложь; 
		КонецЕсли;	
  	Иначе
		ДокументОбъект = Документы.ЛБ_ПриказУсловияПредоставленияЗаймов.СоздатьДокумент();   
		ЗначениеВРеквизитФормы(ДокументОбъект, "ТекущийПриказ");
	КонецЕсли;	
		
КонецПроцедуры  

&НаСервере 
Процедура ЗаполнитьВыборЕдиницИзмерения()
	ТаблицаЕдиницИзмерения = ЛБ_ОбщийМодуль.ВыборЕдиницИзмеренияРасчетаЦенМеталлов();
	Элементы.ЦеныМеталлыЕдиницаИзмерения.СписокВыбора.Очистить();		
	Для каждого Стр Из ТаблицаЕдиницИзмерения Цикл
		Элементы.ЦеныМеталлыЕдиницаИзмерения.СписокВыбора.Добавить(Стр.ЕдиницаИзмерения);
	КонецЦикла;
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьВыборЕдиницИзмеренияВставки()
	ТаблицаЕдиницИзмерения = ЛБ_ОбщийМодуль.ВыборЕдиницИзмеренияРасчетаЦенКамней();
	Элементы.ЦеныВставкиЕдиницаИзмерения.СписокВыбора.Очистить();		
	Для каждого Стр Из ТаблицаЕдиницИзмерения Цикл
		Элементы.ЦеныВставкиЕдиницаИзмерения.СписокВыбора.Добавить(Стр.ЕдиницаИзмерения);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПриказовПриАктивизацииСтроки(Элемент) 
	//Если НЕ  ЭтаФорма.ТекущийЭлемент = Элементы.ТаблицаПриказов Тогда
	//	Возврат;
	//КонецЕсли;	
	ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;  
	Если НЕ ТекСтрока = неопределено Тогда  
		ТекущийПриказИдентификатор = ТекСтрока.ПолучитьИдентификатор();
		ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
		ДатаДок = ТекСтрока.Дата; 
		СтрокаАкция = СокрЛП(ТекущийПриказ.Акция);				
		УстановитьВидимость();
	КонецЕсли;		
КонецПроцедуры

&НаСервере
Процедура ПолучитьОбъектПриказа(Идентификатор) 
	СтрП = ТаблицаПриказов.НайтиПоИдентификатору(Идентификатор); 
	Если НЕ СтрП = Неопределено Тогда
		ДокументОбъект = СтрП.Ссылка.ПолучитьОбъект();
		ЗначениеВРеквизитФормы(ДокументОбъект, "ТекущийПриказ");
		Если ДокументОбъект.Проведен Тогда 
			Элементы.СтрокаЛомбарды.ТолькоПросмотр = Истина;
			Элементы.СтрокаСК.ТолькоПросмотр = Истина;
	        Элементы.Акция.ТолькоПросмотр = Истина;
		Иначе
			Элементы.СтрокаЛомбарды.ТолькоПросмотр = Ложь;
			Элементы.СтрокаСК.ТолькоПросмотр = Ложь;
	        Элементы.Акция.ТолькоПросмотр = Ложь;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры	
	
&НаСервере
Процедура ВводДокументовНаОсновании(ИдентификаторСтроки)
	СтрП = ТаблицаПриказов.НайтиПоИдентификатору(ИдентификаторСтроки); 
	ДокОбъект = СтрП.Ссылка.ПолучитьОбъект(); 

	//металлы
	Если НЕ ДокОбъект.ЦеныМеталлы.Количество() = 0 Тогда 
		 ЗапросДок = Новый Запрос;
		 ЗапросДок.УстановитьПараметр("Приказ", ДокОбъект.Ссылка);
		 ЗапросДок.Текст = "ВЫБРАТЬ
		                   |	ЛБ_ПрейскурантЦенНаМеталлы.Ссылка КАК Ссылка
		                   |ИЗ
		                   |	Документ.ЛБ_ПрейскурантЦенНаМеталлы КАК ЛБ_ПрейскурантЦенНаМеталлы
		                   |ГДЕ
		                   |	ЛБ_ПрейскурантЦенНаМеталлы.Приказ = &Приказ
		                   |	И ЛБ_ПрейскурантЦенНаМеталлы.ПометкаУдаления = ЛОЖЬ
		                   |
		                   |УПОРЯДОЧИТЬ ПО
		                   |	ЛБ_ПрейскурантЦенНаМеталлы.Дата УБЫВ";
		 ВыборкаДок = ЗапросДок.Выполнить().Выбрать();
		 Если  ВыборкаДок.Следующий() Тогда  
			 ДокОбъектМ = ВыборкаДок.Ссылка.ПолучитьОбъект(); 
		 Иначе	
			 ДокОбъектМ = Документы.ЛБ_ПрейскурантЦенНаМеталлы.СоздатьДокумент();
		 КонецЕсли;	 
		 ДокОбъектМ.Дата = ДокОбъект.Дата;
		 ДокОбъектМ.ЗаполнитьНаОсновании(ДокОбъект.Ссылка);
		 
		 Попытка
		     ДокОбъектМ.Записать(РежимЗаписиДокумента.Проведение);
			 Сообщить("Создан прейскурант цен на металлы № " + СокрЛП(ДокОбъектМ.Номер) + " от " + Строка(ДокОбъектМ.Дата) + ".");
		 Исключение              
			ОшибкаПроведения = Истина; 
			Сообщить("Прейскурант цен на металлы не создан!");
			Сообщить(ОписаниеОшибки(), СтатусСообщения.Важное);
		КонецПопытки;	  
	КонецЕсли;	  
	
	//вставки
	Если НЕ ДокОбъект.ЦеныВставки.Количество() = 0 Тогда 
		 ЗапросДок = Новый Запрос;
		 ЗапросДок.УстановитьПараметр("Приказ", ДокОбъект.Ссылка);
		 ЗапросДок.Текст = "ВЫБРАТЬ
		                   |	ЛБ_ПрейскурантЦенНаДрагоценныеКамни.Ссылка КАК Ссылка
		                   |ИЗ
		                   |	Документ.ЛБ_ПрейскурантЦенНаДрагоценныеКамни КАК ЛБ_ПрейскурантЦенНаДрагоценныеКамни
		                   |ГДЕ
		                   |	ЛБ_ПрейскурантЦенНаДрагоценныеКамни.Приказ = &Приказ
		                   |	И ЛБ_ПрейскурантЦенНаДрагоценныеКамни.ПометкаУдаления = ЛОЖЬ
		                   |
		                   |УПОРЯДОЧИТЬ ПО
		                   |	ЛБ_ПрейскурантЦенНаДрагоценныеКамни.Дата УБЫВ";
		 ВыборкаДок = ЗапросДок.Выполнить().Выбрать();
		 Если  ВыборкаДок.Следующий() Тогда  
			 ДокОбъектВ = ВыборкаДок.Ссылка.ПолучитьОбъект(); 
		 Иначе	
			 ДокОбъектВ = Документы.ЛБ_ПрейскурантЦенНаДрагоценныеКамни.СоздатьДокумент();
		 КонецЕсли;	 
		 ДокОбъектВ.Дата = ДокОбъект.Дата;
		 ДокОбъектВ.ЗаполнитьНаОсновании(ДокОбъект.Ссылка);
		 
		 Попытка
		     ДокОбъектВ.Записать(РежимЗаписиДокумента.Проведение);
			 Сообщить("Создан прейскурант цен на драгоценные камни № " + СокрЛП(ДокОбъектВ.Номер) + " от " + Строка(ДокОбъектВ.Дата) + ".");
		 Исключение              
			ОшибкаПроведения = Истина; 
			Сообщить("Прейскурант цен на драгоценные камни не создан!");
			Сообщить(ОписаниеОшибки(), СтатусСообщения.Важное);
		КонецПопытки;	  
	КонецЕсли;	
	
	//процентные ставки
	Если НЕ ДокОбъект.СтавкиПроцентов.Количество() = 0 Тогда 
		 ЗапросДок = Новый Запрос;
		 ЗапросДок.УстановитьПараметр("Приказ", ДокОбъект.Ссылка);
		 ЗапросДок.Текст = "ВЫБРАТЬ
		                   |	ЛБ_ПрейскурантПроцентныхСтавок.Ссылка КАК Ссылка
		                   |ИЗ
		                   |	Документ.ЛБ_ПрейскурантПроцентныхСтавок КАК ЛБ_ПрейскурантПроцентныхСтавок
						   |ГДЕ
		                   |	ЛБ_ПрейскурантПроцентныхСтавок.Приказ = &Приказ
		                   |	И ЛБ_ПрейскурантПроцентныхСтавок.ПометкаУдаления = ЛОЖЬ
		                   |
		                   |УПОРЯДОЧИТЬ ПО
		                   |	ЛБ_ПрейскурантПроцентныхСтавок.Дата УБЫВ";
		 ВыборкаДок = ЗапросДок.Выполнить().Выбрать();
		 Если  ВыборкаДок.Следующий() Тогда  
			 ДокОбъектС = ВыборкаДок.Ссылка.ПолучитьОбъект(); 
		 Иначе	
			 ДокОбъектС= Документы.ЛБ_ПрейскурантПроцентныхСтавок.СоздатьДокумент();
		 КонецЕсли;	 
		 ДокОбъектС.Дата = ДокОбъект.Дата;
		 ДокОбъектС.ЗаполнитьНаОсновании(ДокОбъект.Ссылка);
		 
		 Попытка
		     ДокОбъектС.Записать(РежимЗаписиДокумента.Проведение);
			 Сообщить("Создан прейскурант процентных ставок № " + СокрЛП(ДокОбъектС.Номер) + " от " + Строка(ДокОбъектС.Дата) + ".");
		 Исключение              
			ОшибкаПроведения = Истина; 
			Сообщить("Прейскурант процентных ставок не создан!");
			Сообщить(ОписаниеОшибки(), СтатусСообщения.Важное);
		КонецПопытки;	  
	КонецЕсли;	

КонецПроцедуры  

&НаСервере
Процедура ВводДокументовНаОснованииАкция(ИдентификаторСтроки)
	СтрП = ТаблицаПриказов.НайтиПоИдентификатору(ИдентификаторСтроки); 
	ДокОбъект = СтрП.Ссылка.ПолучитьОбъект(); 

	//металлы
	Если НЕ ДокОбъект.УсловияАкцииМеталлы.Количество() = 0 Тогда 
		 ЗапросДок = Новый Запрос;
		 ЗапросДок.УстановитьПараметр("Приказ", ДокОбъект.Ссылка);
		 ЗапросДок.Текст = "ВЫБРАТЬ
		                   |	ЛБ_АкцииМеталлы.Ссылка КАК Ссылка
		                   |ИЗ
		                   |	Документ.ЛБ_АкцииМеталлы КАК ЛБ_АкцииМеталлы
		                   |ГДЕ
		                   |	ЛБ_АкцииМеталлы.Приказ = &Приказ
		                   |	И ЛБ_АкцииМеталлы.ПометкаУдаления = ЛОЖЬ
		                   |
		                   |УПОРЯДОЧИТЬ ПО
		                   |	ЛБ_АкцииМеталлы.Дата УБЫВ";
		 ВыборкаДок = ЗапросДок.Выполнить().Выбрать();
		 Если  ВыборкаДок.Следующий() Тогда  
			 ДокОбъектМ = ВыборкаДок.Ссылка.ПолучитьОбъект(); 
		 Иначе	
			 ДокОбъектМ = Документы.ЛБ_АкцииМеталлы.СоздатьДокумент();
		 КонецЕсли;	 
		 ДокОбъектМ.Дата = ДокОбъект.Дата;
		 ДокОбъектМ.ЗаполнитьНаОсновании(ДокОбъект.Ссылка);
		 
		 Попытка
		     ДокОбъектМ.Записать(РежимЗаписиДокумента.Проведение);
			 Сообщить("Создан документ акций на металлы № " + СокрЛП(ДокОбъектМ.Номер) + " от " + Строка(ДокОбъектМ.Дата) + ".");
		 Исключение              
			ОшибкаПроведения = Истина; 
			Сообщить("Документ акций на металлы не создан!");
			Сообщить(ОписаниеОшибки(), СтатусСообщения.Важное);
		КонецПопытки;	  
	КонецЕсли;	
	
	//процентные ставки
	Если НЕ ДокОбъект.УсловияАкцииСтавки.Количество() = 0 Тогда 
		 ЗапросДок = Новый Запрос;
		 ЗапросДок.УстановитьПараметр("Приказ", ДокОбъект.Ссылка);
		 ЗапросДок.Текст = "ВЫБРАТЬ
		                   |	ЛБ_АкцииПроцентныеСтавки.Ссылка КАК Ссылка
		                   |ИЗ
		                   |	Документ.ЛБ_АкцииПроцентныеСтавки КАК ЛБ_АкцииПроцентныеСтавки
		                   |ГДЕ
		                   |	ЛБ_АкцииПроцентныеСтавки.Приказ = &Приказ
		                   |	И ЛБ_АкцииПроцентныеСтавки.ПометкаУдаления = ЛОЖЬ
		                   |
		                   |УПОРЯДОЧИТЬ ПО
		                   |	ЛБ_АкцииПроцентныеСтавки.Дата УБЫВ";
		 ВыборкаДок = ЗапросДок.Выполнить().Выбрать();
		 Если  ВыборкаДок.Следующий() Тогда  
			 ДокОбъектС = ВыборкаДок.Ссылка.ПолучитьОбъект(); 
		 Иначе	
			 ДокОбъектС= Документы.ЛБ_АкцииПроцентныеСтавки.СоздатьДокумент();
		 КонецЕсли;	 
		 ДокОбъектС.Дата = ДокОбъект.Дата;
		 ДокОбъектС.ЗаполнитьНаОсновании(ДокОбъект.Ссылка);
		 
		 Попытка
		     ДокОбъектС.Записать(РежимЗаписиДокумента.Проведение);
			 Сообщить("Создан документ акций на процентные ставки № " + СокрЛП(ДокОбъектС.Номер) + " от " + Строка(ДокОбъектС.Дата) + ".");
		 Исключение              
			ОшибкаПроведения = Истина; 
			Сообщить("Документ акций на процентные ставки не создан!");
			Сообщить(ОписаниеОшибки(), СтатусСообщения.Важное);
		КонецПопытки;	  
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Функция ВводПриказаВДействие(ИдентификаторСтроки, Результат)
	СтрП = ТаблицаПриказов.НайтиПоИдентификатору(ИдентификаторСтроки); 
	ДокОбъект = СтрП.Ссылка.ПолучитьОбъект(); 
	
	ДокОбъект.ВидПриказа = Перечисления.ЛБ_ВидыПриказа.Факт;
	ДокОбъект.НомерПриказа = Результат.НомерПриказа;
	ДокОбъект.ДатаНачалаДействияПриказа = Результат.ДатаНачалаДействияПриказа;
	Если ДокОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.Акция Тогда
		ДокОбъект.ДатаОкончанияДействияПриказа = Результат.ДатаОкончанияДействияПриказа;
	КонецЕсли;
	
	ВсеОК = Истина;
	Попытка
	    ДокОбъект.Записать(РежимЗаписиДокумента.Проведение); 
		Сообщить("Приказ введен в действие!");
	Исключение    
		ОшибкаПроведения = Истина; 
		Сообщить("Приказ не введен в действие!");
		//Сообщить(ОписаниеОшибки(), Статуссообщения.Важное);
		ВсеОК = ложь;
	КонецПопытки;	
    Возврат ВсеОК;
КонецФункции

&НаКлиенте
Процедура ПослеВводаПриказаВДействие(Результат, ДопПараметры) Экспорт
	Если Результат = неопределено Тогда 
		Возврат;   
	КонецЕсли;	   
	
	ТекСтрокаПриказы = Элементы.ТаблицаПриказов.ТекущиеДанные; 
	ИдентификаторСтроки = ТекСтрокаПриказы.ПолучитьИдентификатор();
	ПриказВведен = ВводПриказаВДействие(ИдентификаторСтроки, Результат);
		
	Если ПриказВведен Тогда   
		ТекСтрокаПриказы.ВидПриказа = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПриказа.Факт"); 
		ТекСтрокаПриказы.НомерПриказа = Результат.НомерПриказа;    
		ТекСтрокаПриказы.Дата = Результат.ДатаПриказа;
		ТекСтрокаПриказы.ДатаНачалаДействияПриказа = Результат.ДатаНачалаДействияПриказа;
		ТекСтрокаПриказы.ДатаОкончанияДействияПриказа = Результат.ДатаОкончанияДействияПриказа;  
		ТекСтрокаПриказы.СостояниеДокумента = 1;     
		ПолучитьОбъектПриказа(ИдентификаторСтроки);
		//Если ТекСтрокаПриказы.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.Акция") Тогда 
		//	ВводДокументовНаОснованииАкция(ИдентификаторСтроки);
		//Иначе 
		//	ВводДокументовНаОсновании(ИдентификаторСтроки);
		//КонецЕсли;	
	КонецЕсли;	 
КонецПроцедуры

&НаКлиенте
Процедура ВвестиПриказВДействие(Команда)  
	ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные; 
	Если ТекСтрока = неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//+Мельников 14.08.24 Проверка заполнения поля ставка. Заявка 2676.
	ПустаяСтавка = Ложь;
	
	Если ЭтотОбъект.ТекущийПриказ.СтавкиПроцентов.Количество() > 0 Тогда
		Для каждого СтрСтавки Из ЭтотОбъект.ТекущийПриказ.СтавкиПроцентов Цикл
			Если СтрСтавки.Ставка <> 0 Тогда
				Продолжить;
			Иначе
				Сообщить("В строке № " + СтрСтавки.НомерСтроки + " не заполнена ставка.");
				ПустаяСтавка = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если ПустаяСтавка Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	//-Мельников
	
	Если ТекСтрока.ВидПриказа = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПриказа.Факт") Тогда 
		Сообщить("Приказ уже введен в действие!"); 
		Возврат;
	ИначеЕсли ТекСтрока.СостояниеДокумента = 2 Тогда 
		Сообщить("Приказ помечен на удаление!"); 
		Возврат;
	КонецЕсли;	
	
	ПараметрыФормы = Новый Структура;   
	ПараметрыФормы.Вставить("ВидОперации", ТекСтрока.ВидОперации);
	ПараметрыФормы.Вставить("НомерПриказа", ТекСтрока.НомерПриказа); 
	ПараметрыФормы.Вставить("ДатаПриказа", ТекСтрока.Дата);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВводаПриказаВДействие",ЭтаФорма);
	
	ОткрытьФорму("ОбщаяФорма.ЛБ_ВводПриказаВДействие", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура Период(Команда)    
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
    Диалог.Период = Новый СтандартныйПериод(НачПериода, КонПериода);
	Оповещение = Новый ОписаниеОповещения("ВыборПериодаЗавершение", ЭтаФорма);
	Диалог.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериодаЗавершение(Период, ДополнительныеПараметры) Экспорт 
	Если Период = неопределено Тогда
		Возврат;
	КонецЕсли;	
	НачПериода = Период.ДатаНачала;
    КонПериода = Период.ДатаОкончания;
	ЭтаФорма.Заголовок = "Журнал приказов " + ПредставлениеПериода(НачПериода, КонПериода);
	ЗаполнитьТаблицуПриказов();
КонецПроцедуры

&НаСервере
Процедура ДобавитьПриказСервер(ВидОперации) 
	НовыйДок = Документы.ЛБ_ПриказУсловияПредоставленияЗаймов.СоздатьДокумент(); 
	НовыйДок.Дата = ТекущаяДата();
	НовыйДок.ВидПриказа = Перечисления.ЛБ_ВидыПриказа.Проект;  
	НовыйДок.ВидОперации = ВидОперации;
	НовыйДок.НомерПриказа = "";  
	НовыйДок.ДатаНачалаДействияПриказа = Дата(1,1,1); 
	НовыйДок.Ответственный = Пользователи.ТекущийПользователь();
	НовыйДок.Записать();  
	Если КонПериода < НовыйДок.Дата Тогда
		КонПериода = НовыйДок.Дата;
	КонецЕсли;	
	ЗаполнитьТаблицуПриказов();
КонецПроцедуры	

&НаКлиенте
Процедура ДобавитьПриказ(Команда)
	ВидыПриказа = Новый СписокЗначений;
    ВидыПриказа.Добавить(ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.Базовый"));
    ВидыПриказа.Добавить(ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.Акция"));
    
    ОповещениеПослеВыбораЭлемента = Новый ОписаниеОповещения("ПослеВыбораВидаОперацииПриказа", ЭтаФорма);//Элементы.ТаблицаПриказовДобавить);
 
    ВидыПриказа.ПоказатьВыборЭлемента(ОповещениеПослеВыбораЭлемента, "Выберите вид операции");
 
КонецПроцедуры
 
&НаКлиенте
Процедура ПослеВыбораВидаОперацииПриказа(Элемент, Параметры) Экспорт
 
	Если Элемент <> Неопределено Тогда 
		ДобавитьПриказСервер(Элемент.Значение); 
	КонецЕсли;
 
КонецПроцедуры

&НаСервере
Процедура КопироватьПриказСервер(ИдентификаторСтроки)  
	Стр = ТаблицаПриказов.НайтиПоИдентификатору(ИдентификаторСтроки); 
	Если Стр = неопределено Тогда
        Возврат;
	КонецЕсли;	
	ДокументКопия = Стр.Ссылка.Скопировать();
    ДокументКопия.Дата = ТекущаяДата();	
	ДокументКопия.ВидПриказа = Перечисления.ЛБ_ВидыПриказа.Проект;
	ДокументКопия.НомерПриказа = "";  
	ДокументКопия.ДатаНачалаДействияПриказа = Дата(1,1,1); 
	ДокументКопия.Ответственный = Пользователи.ТекущийПользователь();
    ДокументКопия.Записать();
	Если КонПериода < ДокументКопия.Дата Тогда
		КонПериода = ДокументКопия.Дата;
	КонецЕсли;	
	ЗаполнитьТаблицуПриказов();
КонецПроцедуры

&НаКлиенте
Процедура КопироватьПриказ(Команда)
	ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;	
	Если НЕ ТекСтрока = неопределено Тогда
		ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
		КопироватьПриказСервер(ИдентификаторСтроки);  
	КонецЕсли;	
КонецПроцедуры  

&НаСервере
Процедура ПометитьНаУдалениеСервер(ИдентификаторСтроки) 
	Стр = ТаблицаПриказов.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если Стр = неопределено Тогда
       Возврат;
	КонецЕсли;   
	ДокОбъект =  Стр.Ссылка.ПолучитьОбъект();
	Если ДокОбъект.ПометкаУдаления Тогда
	    ДокОбъект.УстановитьПометкуУдаления(Ложь);
	    Стр.СостояниеДокумента = 0; 
	Иначе
		ДокОбъект.УстановитьПометкуУдаления(Истина);
	    Стр.СостояниеДокумента = 2; 
	КонецЕсли;   
	//ЗаполнитьТаблицуПриказов();
КонецПроцедуры	
	
&НаКлиенте
Процедура УдалитьПриказ(Команда)
	ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;  
	Если НЕ ТекСтрока = неопределено Тогда	
		ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
		ПометитьНаУдалениеСервер(ИдентификаторСтроки); 
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура РаспровестиДокументСервере(ИдентификаторСтроки) 
   Стр = ТаблицаПриказов.НайтиПоИдентификатору(ИдентификаторСтроки);
   Если Стр = неопределено Тогда
	   Возврат;
   КонецЕсли;	   
   Если НЕ Стр.Ссылка.Проведен Тогда
       Сообщить("Нельзя отменить проведения у непроведенного документа!");
       Возврат;
   КонецЕсли;   
   КолЗБ = ЛБ_ОбщийМодуль.ПроверитьПриказыВЗБ(Стр.Ссылка);
   Если НЕ КолЗБ = 0 Тогда 
	   Сообщить("Установки приказа использованы при выдаче залоговых билетов. Действие приказа нельзя отменить!");
       Возврат;
   КонецЕсли;	   

   ДокОбъект =  Стр.Ссылка.ПолучитьОбъект();
   Если НЕ Стр.ВидПриказа = Перечисления.ЛБ_ВидыПриказа.Проект Тогда  
	   Стр.ВидПриказа = Перечисления.ЛБ_ВидыПриказа.Проект; 
       ДокОбъект.ВидПриказа = Перечисления.ЛБ_ВидыПриказа.Проект;   	    
   КонецЕсли;	   
   ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
   Стр.СостояниеДокумента = 0; 
   
   
   //Запрос = Новый Запрос;
   //Запрос.УстановитьПараметр("Приказ", Стр.Ссылка);
   //Если Стр.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.Базовый Тогда
   //    Запрос.Текст = "ВЫБРАТЬ
   //                   |	ЛБ_ПрейскурантЦенНаМеталлы.Ссылка КАК Ссылка
   //                   |ИЗ
   //                   |	Документ.ЛБ_ПрейскурантЦенНаМеталлы КАК ЛБ_ПрейскурантЦенНаМеталлы
   //                   |ГДЕ
   //                   |	ЛБ_ПрейскурантЦенНаМеталлы.Приказ = &Приказ
   //                   |	И ЛБ_ПрейскурантЦенНаМеталлы.Проведен = ИСТИНА
   //                   |
   //                   |ОБЪЕДИНИТЬ ВСЕ
   //                   |
   //                   |ВЫБРАТЬ
   //                   |	ЛБ_ПрейскурантЦенНаДрагоценныеКамни.Ссылка
   //                   |ИЗ
   //                   |	Документ.ЛБ_ПрейскурантЦенНаДрагоценныеКамни КАК ЛБ_ПрейскурантЦенНаДрагоценныеКамни
   //                   |ГДЕ
   //                   |	ЛБ_ПрейскурантЦенНаДрагоценныеКамни.Приказ = &Приказ
   //                   |	И ЛБ_ПрейскурантЦенНаДрагоценныеКамни.Проведен = ИСТИНА
   //                   |
   //                   |ОБЪЕДИНИТЬ ВСЕ
   //                   |
   //                   |ВЫБРАТЬ
   //                   |	ЛБ_ПрейскурантПроцентныхСтавок.Ссылка
   //                   |ИЗ
   //                   |	Документ.ЛБ_ПрейскурантПроцентныхСтавок КАК ЛБ_ПрейскурантПроцентныхСтавок
   //                   |ГДЕ
   //                   |	ЛБ_ПрейскурантПроцентныхСтавок.Приказ = &Приказ
   //                   |	И ЛБ_ПрейскурантПроцентныхСтавок.Проведен = ИСТИНА";	    
   //Иначе                                                                    
   //    Запрос.Текст = "ВЫБРАТЬ
   //                   |	ЛБ_АкцииМеталлы.Ссылка КАК Ссылка
   //                   |ИЗ
   //                   |	Документ.ЛБ_АкцииМеталлы КАК ЛБ_АкцииМеталлы
   //                   |ГДЕ
   //                   |	ЛБ_АкцииМеталлы.Приказ = &Приказ
   //                   |	И ЛБ_АкцииМеталлы.Проведен = ИСТИНА
   //                   |
   //                   |ОБЪЕДИНИТЬ ВСЕ
   //                   |
   //                   |ВЫБРАТЬ
   //                   |	ЛБ_АкцииПроцентныеСтавки.Ссылка
   //                   |ИЗ
   //                   |	Документ.ЛБ_АкцииПроцентныеСтавки КАК ЛБ_АкцииПроцентныеСтавки
   //                   |ГДЕ
   //                   |	ЛБ_АкцииПроцентныеСтавки.Приказ = &Приказ
   //                   |	И ЛБ_АкцииПроцентныеСтавки.Проведен = ИСТИНА";
   //КонецЕсли;
   //
   //Выборка = Запрос.Выполнить().Выбрать();
   //Пока Выборка.Следующий() Цикл  
   //    ДокОбъект =  Выборка.Ссылка.ПолучитьОбъект();
   //    ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
   //КонецЦикла;	   
   //
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПроведение(Команда)
	ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда
		ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();		
	    РаспровестиДокументСервере(ИдентификаторСтроки); 
		ПолучитьОбъектПриказа(ИдентификаторСтроки);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПриказа(Команда)
	ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда   
		Если ТекСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.Базовый") Тогда		
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ИменаМакетов", "Приказ"); 
			ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_ПриказУсловияПредоставленияЗаймов");
			МассивОбъектов = Новый Массив;
			МассивОбъектов.Добавить(ТекСтрока.Ссылка);
			ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
			ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,); 
		Иначе     
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ИменаМакетов", "Акция"); 
			ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_ПриказУсловияПредоставленияЗаймов");
			МассивОбъектов = Новый Массив;
			МассивОбъектов.Добавить(ТекСтрока.Ссылка);
			ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
			ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,); 
		КонецЕсли;	
    КонецЕсли;
КонецПроцедуры  

&НаСервере 
Функция ПолучитьСписокСК() 
	СК = Новый СписокЗначений;
    Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СхемыКредитования.Ссылка КАК СхемаКредитования
	               |ИЗ
	               |	Справочник.ЛБ_СхемыКредитования КАК ЛБ_СхемыКредитования
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_УсловияПредоставленияКредита.СрезПоследних(&Дата, ) КАК ЛБ_УсловияПредоставленияКредитаСрезПоследних
	               |		ПО (ЛБ_УсловияПредоставленияКредитаСрезПоследних.СхемаКредитования = ЛБ_СхемыКредитования.Ссылка)
	               |ГДЕ
	               |	ЛБ_СхемыКредитования.ПометкаУдаления = ЛОЖЬ";
	ТЗ = Запрос.Выполнить().Выгрузить();     
	Массив = ТЗ.ВыгрузитьКолонку("СхемаКредитования");//выгружаем таблицу значений в массив
    СК.ЗагрузитьЗначения(Массив);//загружаем массив в список значений  
	
	Возврат СК;
КонецФункции	

&НаСервере
Функция ПолучитьМассивВыбранныхСхемКредитования()  	
	СК = ТекущийПриказ.НастройкаОтклоненийОтБазовыхЦенМеталлы.Выгрузить();
	СК.Свернуть("СхемаКредитования");
	Возврат ЛБ_УправлениеЛомбардом.ПреобразованиеТаблицыЗначенийВМассив(СК);
КонецФункции	

&НаКлиенте
Процедура РедактироватьЦеныМеталлы(Команда)
    ПараметрыФормы = Новый Структура;    
	ПараметрыФормы.Вставить("Документ", ТекущийПриказ); 
	Если ТекущийПриказ.Проведен Тогда
		ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
	КонецЕсли;	  
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеРедактированияМеталлов",ЭтаФорма);
	
	ОткрытьФорму("ОбщаяФорма.ЛБ_ЗаполнениеЦенМеталловИзПриказа", ПараметрыФормы,,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
КонецПроцедуры  

&НаКлиенте
Процедура ПроверитьВыборСК(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;  
	
	ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;  
	ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
	ПолучитьОбъектПриказа(ИдентификаторСтроки);  
	ОбработатьИзменениеТабличныхЧастейПриказа();
КонецПроцедуры	

&НаСервере
Функция ПолучитьКраткоеНаименованиеСК(СК) 
	Возврат СК.НаименованиеКраткое;
КонецФункции

&НаКлиенте
Процедура ЦеныМеталлыЦенаБазоваяПриИзменении(Элемент)
	//ТекСтрока = Элементы.ЦеныМеталлы.ТекущиеДанные;  
	//Для каждого СтрК Из СхемыКредитования Цикл 
	//	ИмяКолонки = "Цена_" + СокрЛП(ПолучитьКраткоеНаименованиеСК(СтрК.СхемаКредитования));
	//    ТекСтрока[ИмяКолонки] = ПолучитьЦенуСКМеталлы(СтрК.СхемаКредитования, ТекСтрока.КатегорияОбъектаЗалога, ТекСтрока.Проба, ТекСтрока.Цена);  
	//КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаЛомбардыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	
	ПараметрыФормы = Новый Структура;    
	ПараметрыФормы.Вставить("Ломбарды", ТекущийПриказ.Ломбарды); 
	ПараметрыФормы.Вставить("ДатаДок", ТекущийПриказ.Дата);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЛомбардов",ЭтаФорма);
	
	ОткрытьФорму("Обработка.ЛБ_ВыборЛомбардовИзСписка.Форма", ПараметрыФормы, Элементы.СтрокаЛомбарды,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
	
&НаСервере
Процедура ЗаполнитьСписокЛомбардов(ДокументОбъект)
	Результат = "";
	Для каждого Стр Из ДокументОбъект.Ломбарды Цикл
		Результат = Результат + ?(ПустаяСтрока(Результат), "", "; ") + ?(НЕ ПустаяСтрока(Стр.Ломбард.НаименованиеПолное), СокрЛП(Стр.Ломбард.НаименованиеПолное), СокрЛП(Стр.Ломбард.Наименование));
	КонецЦикла;	
	ДокументОбъект.СтрокаЛомбарды = Результат; 
КонецПроцедуры	

&НаСервере
Процедура СохранитьЛомбарды(Результат)
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");  
	ДокументОбъект.Ломбарды.Очистить();  
	КоличествоВыбрано = Результат.Количество;
	Для сч = 1 По КоличествоВыбрано Цикл
		НоваяСтр = ДокументОбъект.Ломбарды.Добавить();
		НоваяСтр.Ломбард = Результат["Значение" + Строка(сч)];
	КонецЦикла;	
	
	ЗаполнитьСписокЛомбардов(ДокументОбъект);
	ДокументОбъект.Записать();
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);	
	СтрокаПриказа = ТаблицаПриказов.НайтиПоИдентификатору(ТекущийПриказИдентификатор); 
	СтрокаПриказа.СтрокаЛомбарды = ДокументОбъект.СтрокаЛомбарды; 
	ПолучитьДополнительныеРеквизиты(СтрокаПриказа);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЛомбардов(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
	    Возврат;
	КонецЕсли;
		
	Если ТекущийПриказ.Ломбарды.Количество() = 0 Тогда
		ПокаНетЛомбардов = Истина;
	Иначе	
		ПокаНетЛомбардов = ложь; 
	КонецЕсли;
	СохранитьЛомбарды(Результат);
	
	////Если НЕ ТекущийПриказ.Ломбарды.Количество() = 0 И НЕ ТекущийПриказ.СхемыКредитования.Количество() = 0 Тогда
	////	Если ПокаНетЛомбардов Тогда 
	////		Режим = РежимДиалогаВопрос.ДаНет;
	////		Ответ = Вопрос("Заполнить процентные ставки по текущим данным в ломбарде?", Режим, 0);
	////		Если Ответ = КодВозвратаДиалога.Да Тогда									
	////			Если ТекущийПриказ.Ломбарды.Количество() = 1 Тогда
	////				ПроставитьПроцентныеСтавкиПоТекущимНастройкам(ТекущийПриказ.Ломбарды.Получить(0).Ломбард); 
	////			Иначе
	////				ПараметрыФормы = Новый Структура;
	////			    ПараметрыФормы.Вставить("Приказ", ТекущийПриказ); 
	////				
	////				ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЛомбардаСК", ЭтаФорма);
	////				ОткрытьФорму("ОбщаяФорма.ЛБ_ВыборЛомбардаИзПриказа", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	////			КонецЕсли;	 
	////		КонецЕсли;	
	////	КонецЕсли;
	////КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораПриказаНаСервере(ИдентификаторСтроки) 	
	СтрП = ТаблицаПриказов.НайтиПоИдентификатору(ИдентификаторСтроки);
	СтрП.ВидПриказа = СтрП.Ссылка.ВидПриказа;
	СтрП.НомерПриказа = СтрП.Ссылка.НомерПриказа;
	СтрП.СтрокаЛомбарды = СтрП.Ссылка.СтрокаЛомбарды;
	СтрП.Комментарий = СтрП.Ссылка.Комментарий;  
	СтрП.Дата = СтрП.Ссылка.Дата;
	СтрП.ДатаНачалаДействияПриказа = СтрП.Ссылка.ДатаНачалаДействияПриказа;
	СтрП.ДатаОкончанияДействияПриказа = СтрП.Ссылка.ДатаОкончанияДействияПриказа; 	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПриказа(Результат, ДопПараметры) Экспорт 
	ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;   
	ТекущийПриказИдентификатор = ТекСтрока.ПолучитьИдентификатор();
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	ПослеВыбораПриказаНаСервере(ТекущийПриказИдентификатор);
КонецПроцедуры	

&НаКлиенте
Процедура ПослеВыбораЛомбарда(Результат, ДопПараметры) Экспорт 
	Если Результат = неопределено Тогда
	    Возврат;
	КонецЕсли;
	
	ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;
	ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Ломбард", Результат); 
	ПараметрыФормы.Вставить("Дата", ТекСтрока.Дата);
		
	ОткрытьФорму("Отчет.ЛБ_УсловияЗаймаВЛомбарде.Форма.ФормаОтчета", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры	

&НаКлиенте
Процедура ТаблицаПриказовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда  
		СписокВыбора = Новый СписокЗначений; 
		
		Если ЕстьПолныеПрава Тогда
		    СписокВыбора.Добавить("Документ", "Открыть приказ"); 
		КонецЕсли;	
		СписокВыбора.Добавить("Отчет", "Открыть отчет по условиям займа"); 
		СписокВыбора.Добавить("Печать", "Печать приказа");

		ВыбранноеЗначение = ВыбратьИзМеню(СписокВыбора, Элементы.ТаблицаПриказов.ТекущаяСтрока); 
		
		Если НЕ ВыбранноеЗначение = неопределено Тогда
			Если ВыбранноеЗначение.Значение = "Документ" Тогда
			    ПараметрыФормы = Новый Структура;
			    ПараметрыФормы.Вставить("Ключ", ТекСтрока.Ссылка);
				
				ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораПриказа",ЭтаФорма);
				ОткрытьФорму("Документ.ЛБ_ПриказУсловияПредоставленияЗаймов.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			ИначеЕсли ВыбранноеЗначение.Значение = "Отчет" Тогда 
			    ПараметрыФормы = Новый Структура;
			    ПараметрыФормы.Вставить("Приказ", ТекСтрока.Ссылка);
				
				Если ТекущийПриказ.Ломбарды.Количество() > 1 Тогда
					ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЛомбарда",ЭтаФорма);
					ОткрытьФорму("ОбщаяФорма.ЛБ_ВыборЛомбардаИзПриказа", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
				Иначе 
					ПараметрыФормы = Новый Структура; 
					Если ТекущийПриказ.Ломбарды.Количество() = 1 Тогда
				        ПараметрыФормы.Вставить("Ломбард", ТекущийПриказ.Ломбарды.Получить(0).Ломбард); 
					Иначе 
						ПараметрыФормы.Вставить("Ломбард", ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ПустаяСсылка"));
					КонецЕсли;	
					ПараметрыФормы.Вставить("Дата", ТекСтрока.Дата);
						
					ОткрытьФорму("Отчет.ЛБ_УсловияЗаймаВЛомбарде.Форма.ФормаОтчета", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.Независимый);
				КонецЕсли;	
			ИначеЕсли ВыбранноеЗначение.Значение = "Печать" Тогда
				Если ТекСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.Базовый") Тогда		
					ПараметрыФормы = Новый Структура;
					ПараметрыФормы.Вставить("ИменаМакетов", "Приказ"); 
					ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_ПриказУсловияПредоставленияЗаймов");
					МассивОбъектов = Новый Массив;
					МассивОбъектов.Добавить(ТекСтрока.Ссылка);
					ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
					ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,); 
				Иначе     
					ПараметрыФормы = Новый Структура;
					ПараметрыФормы.Вставить("ИменаМакетов", "Акция"); 
					ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_ПриказУсловияПредоставленияЗаймов");
					МассивОбъектов = Новый Массив;
					МассивОбъектов.Добавить(ТекСтрока.Ссылка);
					ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
					ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,); 
				КонецЕсли;	
			КонецЕсли; 
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьЦеныМеталловПоНастройкамНаСервере() 
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");
	ДокументОбъект.ЦеныМеталлы.Очистить();  
	ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенМеталлы.Очистить();
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", ДокументОбъект.Дата); 
	Запрос.УстановитьПараметр("ВидШаблона", Перечисления.ЛБ_ВидыОперацийУстановитьШаблонПриказа.Металлы);
	МассивЛ = ДокументОбъект.Ломбарды.ВыгрузитьКолонку("Ломбард");  
	МассивЛ.Добавить(Справочники.ЛБ_Ломбарды.ПустаяСсылка());
	Запрос.УстановитьПараметр("Ломбарды", МассивЛ); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_УстановкаОтменаШаблонаПриказаСрезПоследних.ШаблонПриказа КАК ШаблонПриказа,
	               |	ЛБ_УстановкаОтменаШаблонаПриказаСрезПоследних.Отменен КАК Отменен,
	               |	ЛБ_УстановкаОтменаШаблонаПриказаСрезПоследних.Ломбард КАК Ломбард
	               |ИЗ
	               |	РегистрСведений.ЛБ_УстановкаОтменаШаблонаПриказа.СрезПоследних(
	               |			&Дата,
	               |			ВидШаблона = &ВидШаблона
	               |				И Ломбард В (&Ломбарды)) КАК ЛБ_УстановкаОтменаШаблонаПриказаСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_УстановкаОтменаШаблонаПриказаСрезПоследних.Период УБЫВ"; 
	ТЗ = Запрос.Выполнить().Выгрузить();   
	ТаблицаРегистраторов = Новый ТаблицаЗначений; 
	ТаблицаРегистраторов.Колонки.Добавить("Ломбард"); 
	ТаблицаРегистраторов.Колонки.Добавить("Регистратор");
	Отбор = Новый Структура;  
	Если НЕ ДокументОбъект.Ломбарды.Количество() = 0 Тогда
		Для каждого СтрЛ Из ДокументОбъект.Ломбарды Цикл			
			Отбор.Вставить("Ломбард", СтрЛ.Ломбард); 
			Строки = ТЗ.НайтиСтроки(Отбор);
			Если НЕ Строки.Количество() = 0 Тогда 
				Стр = строки.Получить(0); 
				Если НЕ Стр.Отменен Тогда
					стрР = ТаблицаРегистраторов.Добавить(); 
					СтрР.Ломбард = СтрЛ.Ломбард;
					СтрР.Регистратор = Стр.ШаблонПриказа;
					Продолжить
				КонецЕсли;	  	
			КонецЕсли;
			Отбор.Вставить("Ломбард", Справочники.ЛБ_Ломбарды.ПустаяСсылка());  
			Строки = ТЗ.НайтиСтроки(Отбор);
			Если НЕ Строки.Количество() = 0 Тогда 
				Стр = строки.Получить(0);
				стрР = ТаблицаРегистраторов.Добавить(); 
				СтрР.Ломбард = СтрЛ.Ломбард;
				СтрР.Регистратор = Стр.ШаблонПриказа; 
			Иначе
				стрР = ТаблицаРегистраторов.Добавить(); 
				СтрР.Ломбард = СтрЛ.Ломбард;
			КонецЕсли;	
		КонецЦикла;	 
	ИначеЕсли НЕ ТЗ.Количество() = 0 Тогда	  
		стрР = ТаблицаРегистраторов.Добавить();
		СтрР.Ломбард = Справочники.ЛБ_Ломбарды.ПустаяСсылка();
		СтрР.Регистратор = ТЗ.Получить(0).ШаблонПриказа; 
	КонецЕсли;	
	
	СписокРегистраторов = Новый СписокЗначений;
	СписокЛомбардовБезШаблона = "";
	Для каждого СтрР Из ТаблицаРегистраторов Цикл  
		Если НЕ ЗначениеЗаполнено(СтрР.Регистратор) Тогда
			СписокЛомбардовБезШаблона = СписокЛомбардовБезШаблона + ?(ПустаяСтрока(СписокЛомбардовБезШаблона), "", ", ") + СокрЛП(СтрР.Ломбард);
		Иначе 
			Если СписокРегистраторов.НайтиПоЗначению(СтрР.Регистратор) = неопределено  Тогда  
				СписокРегистраторов.Добавить(СтрР.Регистратор);
			КонецЕсли;	
		КонецЕсли;	
	Конеццикла;
	
	Если НЕ ПустаяСтрока(СписокЛомбардовБезШаблона) Тогда
		ОбщегоНазначения.СообщитьПользователю("Для ломбардов " + СписокЛомбардовБезШаблона +  " не найдено установленного шаблона по металлам.");
		Возврат; 
	КонецЕсли;
	
	Если СписокРегистраторов.Количество() = 0 Тогда  
		ОбщегоНазначения.СообщитьПользователю("Для выбранных ломбардов не найдено установленного шаблона по металлам.");
		Возврат;   
	ИначеЕсли СписокРегистраторов.Количество() > 1 Тогда  
		ОбщегоНазначения.СообщитьПользователю("Для выбранных ломбардов найдено " + Строка(СписокРегистраторов.Количество()) + " установленных шаблона  по металлам.");
		ОбщегоНазначения.СообщитьПользователю("");
		Возврат;   	
	КонецЕсли;	
	
	ТекРегистратор = СписокРегистраторов.Получить(0).Значение;
    Запрос.УстановитьПараметр("Регистратор", ТекРегистратор);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ТекущийШаблонПриказаМеталлы.Металл КАК Металл,
	               |	ЛБ_ТекущийШаблонПриказаМеталлы.Проба КАК Проба,
	               |	ЛБ_ТекущийШаблонПриказаМеталлы.Категория КАК Категория,
	               |	ЛБ_ТекущийШаблонПриказаМеталлы.БазоваяНастройка КАК БазоваяНастройка,
	               |	ЛБ_ТекущийШаблонПриказаМеталлы.БазоваяЦена КАК БазоваяЦена,
	               |	ЛБ_ТекущийШаблонПриказаМеталлы.ОклонениеОтБазовой КАК ОклонениеОтБазовой,
	               |	ЛБ_ТекущийШаблонПриказаМеталлы.ЗначениеОтклонения КАК ЗначениеОтклонения,
	               |	ЛБ_ТекущийШаблонПриказаМеталлы.ПорядокОкругления КАК ПорядокОкругления,
	               |	ЛБ_ТекущийШаблонПриказаМеталлы.ОкруглятьВБольшуюСторону КАК ОкруглятьВБольшуюСторону
	               |ИЗ
	               |	РегистрСведений.ЛБ_ТекущийШаблонПриказаМеталлы КАК ЛБ_ТекущийШаблонПриказаМеталлы
	               |ГДЕ
	               |	ЛБ_ТекущийШаблонПриказаМеталлы.Регистратор = &Регистратор";
	ШаблонМеталлов = Запрос.Выполнить().Выгрузить(); 
	ТаблицаМ = ШаблонМеталлов.Скопировать(); 
	ТаблицаМ.Свернуть("Металл");   
	
	Запрос.Текст = "ВЫБРАТЬ
	                |	ЛБ_ТекущийШаблонПриказаМеталлыНастройкаОтклонений.СхемаКредитования КАК СхемаКредитования,
	                |	ЛБ_ТекущийШаблонПриказаМеталлыНастройкаОтклонений.Металл КАК Металл,
	                |	ЛБ_ТекущийШаблонПриказаМеталлыНастройкаОтклонений.Проба КАК Проба,
	                |	ЛБ_ТекущийШаблонПриказаМеталлыНастройкаОтклонений.Категория КАК КатегорияОбъектаЗалога,
	                |	ЛБ_ТекущийШаблонПриказаМеталлыНастройкаОтклонений.ОклонениеОтБазовой КАК ОтклонениеОтБазовойЦены,
	                |	ЛБ_ТекущийШаблонПриказаМеталлыНастройкаОтклонений.ЗначениеОтклонения КАК ЗначениеОтклонения
	                |ИЗ
	                |	РегистрСведений.ЛБ_ТекущийШаблонПриказаМеталлыНастройкаОтклонений КАК ЛБ_ТекущийШаблонПриказаМеталлыНастройкаОтклонений
	                |ГДЕ
	                |	ЛБ_ТекущийШаблонПриказаМеталлыНастройкаОтклонений.Регистратор = &Регистратор"; 
	НастройкиОтклонения = Запрос.Выполнить().Выгрузить(); 

	Для каждого СтрМ Из ТаблицаМ Цикл
		ЦенаБазовая = 0;
		Отбор = новый Структура; 
		Отбор.Вставить("Металл", СтрМ.Металл); 
		Отбор.Вставить("БазоваяНастройка", Истина); 
		Строки = ШаблонМеталлов.НайтиСтроки(Отбор);
		Если НЕ Строки.Количество() = 0 Тогда
			ЦенаБазовая = Строки.Получить(0).БазоваяЦена;
		КонецЕсли;
		ДокументОбъект.БазоваяЦенаМеталлы = ЦенаБазовая;
				
		Для каждого Стр Из ШаблонМеталлов Цикл
			Если НЕ Стр.Металл = СтрМ.Металл Тогда
				Продолжить;
			КонецЕсли;	
			НоваяСтр = ДокументОбъект.ЦеныМеталлы.Добавить();
			НоваяСтр.Металл = Стр.Металл;
			НоваяСтр.Проба = Стр.Проба;
			НоваяСтр.КатегорияОбъектаЗалога = Стр.Категория;
			НоваяСтр.ЕдиницаИзмерения = ОсновнаяЕдиницаИзмерения;
			НоваяСтр.БазоваяНастройка = Стр.БазоваяНастройка;
			Если Стр.БазоваяНастройка Тогда
				НоваяСтр.Цена = Стр.БазоваяЦена;
			ИначеЕсли НЕ ЦенаБазовая = 0 Тогда
				 Если Стр.ОклонениеОтБазовой = Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Абсолютное Тогда  
					 НоваяСтр.Цена = ЦенаБазовая + стр.ЗначениеОтклонения;
				 ИначеЕсли Стр.ОклонениеОтБазовой = Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Относительное Тогда
					 НоваяСтр.Цена = ЦенаБазовая + ЦенаБазовая*стр.ЗначениеОтклонения/100;
				 КонецЕсли;	  
				 Если ЗначениеЗаполнено(Стр.ПорядокОкругления) Тогда     
					 НоваяСтр.Цена = ЛБ_ОбщийМодуль.ОкруглитьЦену(НоваяСтр.Цена, Стр.ПорядокОкругления, Стр.ОкруглятьВБольшуюСторону);
				 КонецЕсли;	 
			 КонецЕсли;	 
		 КонецЦикла;  
		 
		 ОтборМ = новый Структура; 
		 ОтборМ.Вставить("Металл", СтрМ.Металл); 
		 
		 СтрокиН = НастройкиОтклонения.НайтиСтроки(ОтборМ);  
		 Для каждого СтрН Из СтрокиН Цикл
			 НоваяСтрН = ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенМеталлы.Добавить(); 
			 НоваяСтрН.СхемаКредитования = СтрН.СхемаКредитования; 
			 НоваяСтрН.Металл = СтрН.Металл;
			 НоваяСтрН.Проба = СтрН.Проба;
			 НоваяСтрН.КатегорияОбъектаЗалога = СтрН.КатегорияОбъектаЗалога;
			 НоваяСтрН.ОтклонениеОтБазовойЦены = СтрН.ОтклонениеОтБазовойЦены;
			 НоваяСтрН.ЗначениеОтклонения = СтрН.ЗначениеОтклонения;
		 КонецЦикла;
	 КонецЦикла;	
	 
	 ДокументОбъект.ЦеныМеталлы.Сортировать("Металл, Проба, КатегорияОбъектаЗалога");
	 ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенМеталлы.Сортировать("СхемаКредитования, Металл, Проба, КатегорияОбъектаЗалога");
	 ДокументОбъект.ШаблонМеталлы = ТекРегистратор;
	 ДокументОбъект.Записать();  
	 СтрокаПриказа = ТаблицаПриказов.НайтиПоИдентификатору(ТекущийПриказИдентификатор);
	 ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	 ПолучитьДополнительныеРеквизиты(СтрокаПриказа);
КонецПроцедуры    

&НаСервере
Функция ПолучитьТекущийШаблон(ВидПрейскуранта)
	СписокЛ = Новый СписокЗначений; 
	СписокЛ.Добавить(Справочники.ЛБ_Ломбарды.ПустаяСсылка());
	Для каждого Стр Из ТекущийПриказ.Ломбарды цикл 
		СписокЛ.Добавить(Стр.Ломбард);
	Конеццикла;	
	Возврат ЛБ_ОбщийМодуль.ПолучитьТекущийШаблон(ДатаДок, ВидПрейскуранта, СписокЛ);
КонецФункции

&НаСервере
Функция ПолучитьТекущийШаблонАкция(ВидПрейскуранта)
	Возврат ЛБ_ОбщийМодуль.ПолучитьТекущийШаблонАкция(ДатаДок, Перечисления.ЛБ_ВидыПрейскурантов.Металлы, );
КонецФункции	

&НаСервере
Функция ПолучитьСообщениеПоБазовымНастройкамШаблонаМеталлов(ШаблонМеталлы)
	ТекстСообщения = "";
	Для каждого  Стр Из ШаблонМеталлы.БазовыеНастройки Цикл
		Если Стр.БазоваяЦена = 0 Тогда
			ТекстСообщения = ТекстСообщения + ?(ПустаяСтрока(ТекстСообщения), "", Символы.ПС) + 
			   "Для расчета цен на металл " + СокрЛП(Стр.Металл) + " установите цену базовой пробы металла (" + СокрЛП(Стр.БазоваяПроба) + ", " + СокрЛП(Стр.БазоваяКатегория) + ")";
		КонецЕсли;	
	КонецЦикла;
	Возврат ТекстСообщения;
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьЦеныМеталловПоНастройкам(Команда) 
	ЗаполнитьЦеныМеталловПоНастройкамНаСервере();
	
	Если ЗначениеЗаполнено(ТекущийПриказ.ШаблонМеталлы) Тогда
		Результат = ПолучитьСообщениеПоБазовымНастройкамШаблонаМеталлов(ТекущийПриказ.ШаблонМеталлы); 
		Если НЕ ПустаяСтрока(Результат) Тогда 
			Сообщить(Результат, Статуссообщения.БезСтатуса);
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры   
		
&НаСервере
Процедура ЗаполнитьЦеныВставокПоНастройкамНаСервере()   
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");  
		
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", ДокументОбъект.Дата); 
	Запрос.УстановитьПараметр("ВидШаблона", Перечисления.ЛБ_ВидыОперацийУстановитьШаблонПриказа.Вставки);
	МассивЛ = ДокументОбъект.Ломбарды.ВыгрузитьКолонку("Ломбард");  
	МассивЛ.Добавить(Справочники.ЛБ_Ломбарды.ПустаяСсылка());
	Запрос.УстановитьПараметр("Ломбарды", МассивЛ); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_УстановкаОтменаШаблонаПриказаСрезПоследних.ШаблонПриказа КАК ШаблонПриказа,
	               |	ЛБ_УстановкаОтменаШаблонаПриказаСрезПоследних.Отменен КАК Отменен,
	               |	ЛБ_УстановкаОтменаШаблонаПриказаСрезПоследних.Ломбард КАК Ломбард
	               |ИЗ
	               |	РегистрСведений.ЛБ_УстановкаОтменаШаблонаПриказа.СрезПоследних(
	               |			&Дата,
	               |			ВидШаблона = &ВидШаблона
	               |				И Ломбард В (&Ломбарды)) КАК ЛБ_УстановкаОтменаШаблонаПриказаСрезПоследних"; 
	ТЗ = Запрос.Выполнить().Выгрузить();   
	ТаблицаРегистраторов = Новый ТаблицаЗначений; 
	ТаблицаРегистраторов.Колонки.Добавить("Ломбард"); 
	ТаблицаРегистраторов.Колонки.Добавить("Регистратор");
	Отбор = Новый Структура;  
	Если НЕ ДокументОбъект.Ломбарды.Количество() = 0 Тогда
		Для каждого СтрЛ Из ДокументОбъект.Ломбарды Цикл			
			Отбор.Вставить("Ломбард", СтрЛ.Ломбард); 
			Строки = ТЗ.НайтиСтроки(Отбор);
			Если НЕ Строки.Количество() = 0 Тогда 
				Стр = строки.Получить(0); 
				Если НЕ Стр.Отменен Тогда
					стрР = ТаблицаРегистраторов.Добавить(); 
					СтрР.Ломбард = СтрЛ.Ломбард;
					СтрР.Регистратор = Стр.ШаблонПриказа;			                                        
					Продолжить;
				КонецЕсли;	
			КонецЕсли;
			Отбор.Вставить("Ломбард", Справочники.ЛБ_Ломбарды.ПустаяСсылка());  
			Строки = ТЗ.НайтиСтроки(Отбор);
			Если НЕ Строки.Количество() = 0 Тогда 
				Стр = строки.Получить(0);
				стрР = ТаблицаРегистраторов.Добавить(); 
				СтрР.Ломбард = СтрЛ.Ломбард;
				СтрР.Регистратор = Стр.ШаблонПриказа; 
			Иначе
				стрР = ТаблицаРегистраторов.Добавить(); 
				СтрР.Ломбард = СтрЛ.Ломбард;
			КонецЕсли;	
		КонецЦикла;	 
	ИначеЕсли НЕ ТЗ.Количество() = 0 Тогда	  
		стрР = ТаблицаРегистраторов.Добавить();
		СтрР.Ломбард = Справочники.ЛБ_Ломбарды.ПустаяСсылка();
		СтрР.Регистратор = ТЗ.Получить(0).ШаблонПриказа; 
	КонецЕсли;	
	
	СписокРегистраторов = Новый СписокЗначений;
	СписокЛомбардовБезШаблона = "";
	Для каждого СтрР Из ТаблицаРегистраторов Цикл  
		Если НЕ ЗначениеЗаполнено(СтрР.Регистратор) Тогда
			СписокЛомбардовБезШаблона = СписокЛомбардовБезШаблона + ?(ПустаяСтрока(СписокЛомбардовБезШаблона), "", ", ") + СокрЛП(СтрР.Ломбард);
		Иначе 
			Если СписокРегистраторов.НайтиПоЗначению(СтрР.Регистратор) = неопределено  Тогда  
				СписокРегистраторов.Добавить(СтрР.Регистратор);
			КонецЕсли;	
		КонецЕсли;	
	Конеццикла;
	
	Если НЕ ПустаяСтрока(СписокЛомбардовБезШаблона) Тогда
		ОбщегоНазначения.СообщитьПользователю("Для ломбардов " + СписокЛомбардовБезШаблона +  " не найдено установленного шаблона по драгоценным вставкам.");
		Возврат; 
	КонецЕсли;
	
	Если СписокРегистраторов.Количество() = 0 Тогда  
		ОбщегоНазначения.СообщитьПользователю("Для выбранных ломбардов не найдено установленного шаблона по процентым ставкам.");
		Возврат;   
	ИначеЕсли СписокРегистраторов.Количество() > 1 Тогда  
		ОбщегоНазначения.СообщитьПользователю("Для выбранных ломбардов найдено " + Строка(СписокРегистраторов.Количество()) + " установленных шаблона по процентым ставкам.");
		ОбщегоНазначения.СообщитьПользователю("");
		Возврат;   	
	КонецЕсли;	
	
	ТекРегистратор = СписокРегистраторов.Получить(0).Значение;
    Запрос.УстановитьПараметр("Регистратор", ТекРегистратор);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ТекущийШаблонПриказаВставки.Вставка КАК Вставка,
	               |	ЛБ_ТекущийШаблонПриказаВставки.ФормаОгранки КАК ФормаОгранки,
	               |	ЛБ_ТекущийШаблонПриказаВставки.ВидОгранки КАК ВидОгранки,
	               |	ЛБ_ТекущийШаблонПриказаВставки.КачествоОгранки КАК КачествоОгранки,
	               |	ЛБ_ТекущийШаблонПриказаВставки.ВесоваяГруппа КАК ВесоваяГруппа
	               |ИЗ
	               |	РегистрСведений.ЛБ_ТекущийШаблонПриказаВставки КАК ЛБ_ТекущийШаблонПриказаВставки
	               |ГДЕ
	               |	ЛБ_ТекущийШаблонПриказаВставки.Регистратор = &Регистратор
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Вставка,
	               |	ФормаОгранки,
	               |	ВидОгранки,
	               |	КачествоОгранки,
	               |	ВесоваяГруппа";
	ШаблонВставок = Запрос.Выполнить().Выгрузить();
	
	СписокЛ = Новый СписокЗначений;
	Для каждого СтрЛ из ТекущийПриказ.Ломбарды Цикл
		СписокЛ.Добавить(СтрЛ.Ломбард);
	КонецЦикла;	 
	Если СписокЛ.Количество() = 0 Тогда
		ОтборЛ = "";
	Иначе
		ОтборЛ = "Ломбард В (&Ломбарды)";
	КонецЕсли;	
	Запрос.УстановитьПараметр("Ломбарды", СписокЛ); 
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.Ломбард КАК Ломбард,
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.ВидВставки КАК ВидВставки,
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.ВесоваяГруппа КАК ВесоваяГруппа,
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.ФормаОгранки КАК ФормаОгранки,
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.ВидОгранки КАК ВидОгранки,
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.КачествоОгранки КАК КачествоОгранки,
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.Цена КАК Цена,
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПрейскурантЦенНаДрагоценныеКамни.СрезПоследних(&Дата, " + ОтборЛ + ") КАК ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВидВставки,
	               |	ФормаОгранки,
	               |	ВидОгранки,
	               |	КачествоОгранки,
	               |	ВесоваяГруппа";
	ТаблицаЦен = Запрос.Выполнить().Выгрузить();
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");
	ДокументОбъект.ЦеныВставки.Очистить();
	
	Для каждого Стр Из ШаблонВставок Цикл
	     НоваяСтр = ДокументОбъект.ЦеныВставки.Добавить();
		 НоваяСтр.ВидВставки = Стр.Вставка;
		 НоваяСтр.ВесоваяГруппа = Стр.ВесоваяГруппа;
		 НоваяСтр.КачествоОгранки = Стр.КачествоОгранки;
		 НоваяСтр.ФормаОгранки = Стр.ФормаОгранки; 
		 НоваяСтр.ВидОгранки = Стр.ВидОгранки;
		 
		 Отбор = новый Структура;
		 Отбор.Вставить("ВидВставки", Стр.Вставка);
		 Отбор.Вставить("ВесоваяГруппа", Стр.ВесоваяГруппа);
		 Отбор.Вставить("КачествоОгранки", Стр.КачествоОгранки);
		 Отбор.Вставить("ФормаОгранки", Стр.ФормаОгранки); 
		 Отбор.Вставить("ВидОгранки", Стр.ВидОгранки);
		 
		 СтрокиЦен = ТаблицаЦен.НайтиСтроки(Отбор);
		 Если СтрокиЦен.Количество() = 0 Тогда
			 НоваяСтр.ЕдиницаИзмерения = ОсновнаяЕдиницаИзмеренияВставки;
		 Иначе
			 СтрЦ = СтрокиЦен.Получить(0);
			 НоваяСтр.Цена = СтрЦ.Цена;
			 НоваяСтр.ЕдиницаИзмерения = СтрЦ.ЕдиницаИзмерения;
		 КонецЕсли;	 
	КонецЦикла;	                                    
	ДокументОбъект.ЦеныВставки.Сортировать("ВидВставки, ФормаОгранки, ВидОгранки, КачествоОгранки, ВесоваяГруппа"); 
	ДокументОбъект.ШаблонВставки = ТекРегистратор;  
	ДокументОбъект.Записать();
	СтрокаПриказа = ТаблицаПриказов.НайтиПоИдентификатору(ТекущийПриказИдентификатор);
	ПолучитьДополнительныеРеквизиты(СтрокаПриказа);	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦеныВставокПоНастройкам(Команда) 
	ЗаполнитьЦеныВставокПоНастройкамНаСервере(); 
	ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;  
	ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
	ПолучитьОбъектПриказа(ИдентификаторСтроки);	
КонецПроцедуры   


&НаКлиенте
Процедура ЦеныВставкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекСтрока = Элементы.ЦеныВставки.ТекущиеДанные;
	Если НоваяСтрока Тогда		
		ТекСтрока.ЕдиницаИзмерения = ОсновнаяЕдиницаИзмеренияВставки;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСтавокАкцииУстановитьЗначениеИлиОтконениеПриИзменении(Элемент)
	ТекСтрока = Элементы.ТаблицаСтавокАкции.ТекущиеДанные; 
	Если ТекСтрока.УстановитьЗначениеИлиОтконение = ПредопределенноеЗначение("Перечисление.ЛБ_УстановкаЗначенияИлиОтклонения.Значение") Тогда 
		ТекСтрока.Отклонение = ПредопределенноеЗначение("Перечисление.ЛБ_ОтклонениеОтБазовойЦены.ПустаяСсылка");
		ТекСтрока.ЗначениеОтклонения = 0;
	ИначеЕсли ТекСтрока.УстановитьЗначениеИлиОтконение = ПредопределенноеЗначение("Перечисление.ЛБ_УстановкаЗначенияИлиОтклонения.Отклонение") Тогда
        ТекСтрока.Ставка = 0;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураПодчиненности(Команда)   
	ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные; 
	Если НЕ Текстрока = неопределено Тогда
		ПараметрыФормы = Новый Структура("ОбъектОтбора", ТекСтрока.Ссылка);
		ОткрытьФорму("ОбщаяФорма.СтруктураПодчиненности",ПараметрыФормы,); 
	КонецЕсли;	
 КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтклоненийОтБазовыхЦенВставкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	 Если НоваяСтрока И НЕ Копирование Тогда 
		ТекСтрока = Элементы.ТаблицаОтклоненийОтБазовыхЦенВставки.ТекущиеДанные;
        ТекСтрока.ОтклонениеОтБазовойЦены = ПредопределенноеЗначение("Перечисление.ЛБ_ОтклонениеОтБазовойЦены.Абсолютное");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДерево(ЭлементыДерева)
	Для каждого Элемент Из ЭлементыДерева Цикл
		ВлЭлементыДерева = Элемент.ПолучитьЭлементы();
		Если ВлЭлементыДерева.Количество() > 0 Тогда
			СвернутьДерево(ВлЭлементыДерева);
		КонецЕсли;	
		Элементы.СписокЛомбардов.Свернуть(Элемент.ПолучитьИдентификатор());
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура Развернуть(Команда)
	ЭлементыДерева = Дерево.ПолучитьЭлементы();
	Для каждого Элемент Из ЭлементыДерева Цикл		
		 Элементы.СписокЛомбардов.Развернуть(Элемент.ПолучитьИдентификатор(), Истина);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура Свернуть(Команда)
	ЭлементыДерева = Дерево.ПолучитьЭлементы();
	СвернутьДерево(ЭлементыДерева);
КонецПроцедуры

&НаКлиенте
Процедура ОтборЛомбарды(Команда)  
	ВыборСписокЛомбардов.Очистить();
	ЗаполитьСписокВыборЛомбардов(Дерево.ПолучитьЭлементы());
	ЗаполнитьТаблицуПриказов();
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполитьСписокВыборЛомбардов(Строки)
    Для Каждого СтрокаДерева Из Строки Цикл
        Если СтрокаДерева.Пометка И НЕ СтрокаДерева.ЭтоГруппа  Тогда
            ВыборСписокЛомбардов.Добавить(СтрокаДерева.Ломбард);
		КонецЕсли;	 
        ПодчиненныеСтроки  = СтрокаДерева.ПолучитьЭлементы();
         
        Если ПодчиненныеСтроки.Количество() > 0 Тогда
            ЗаполитьСписокВыборЛомбардов(ПодчиненныеСтроки);
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПроставитьГалочкиПоГруппе(ДеревоНаСервере, Группа, Пометка)
	Для каждого Строка Из ДеревоНаСервере.Строки Цикл
		Если Строка.Ломбард = Группа Тогда
			Строка.Пометка = Пометка;
		ИначеЕсли Строка.ОтделениеРодитель = Группа Тогда
			Строка.Пометка = Пометка;	
		Иначе
			Продолжить;
		КонецЕсли;		

		Если НЕ Строка.Строки.Количество() = 0 Тогда
			ПроставитьГалочкиПоГруппе(Строка, Группа, Пометка);
		КонецЕсли;	
	
	КонецЦикла;	
КонецПроцедуры	

&НаСервере
Процедура ОбработатьОтметкуГруппы(Ломбард, Пометка)
	ДеревоНаСервере = РеквизитФормыВЗначение("Дерево");
	ПроставитьГалочкиПоГруппе(ДеревоНаСервере, Ломбард, Пометка);
	ЗначениеВРеквизитФормы(ДеревоНаСервере, "Дерево");
КонецПроцедуры	

&НаКлиенте
Процедура СписокЛомбардовПометкаПриИзменении(Элемент)
	ТекСтрока = Элементы.СписокЛомбардов.ТекущиеДанные;
	Если ТекСтрока.ЭтоГруппа Тогда
		ОбработатьОтметкуГруппы(ТекСтрока.Ломбард, ТекСтрока.Пометка);
		ЭлементыДерева = Дерево.ПолучитьЭлементы();
		Для каждого ЭлементГруппа Из ЭлементыДерева Цикл
			Если ЭлементГруппа.Ломбард = ТекСтрока.Ломбард Тогда
				Если ТекСтрока.Пометка Тогда				
			        Элементы.СписокЛомбардов.Развернуть(ЭлементГруппа.ПолучитьИдентификатор(), Истина);
				Иначе
					Элементы.СписокЛомбардов.Свернуть(ЭлементГруппа.ПолучитьИдентификатор());
				КонецЕсли;
				Прервать;
			КонецЕсли;	 
		КонецЦикла;	
	Иначе
		//проверить отметку родителя
		ЭлементыДерева = Дерево.ПолучитьЭлементы();
		Для каждого ЭлементГруппа Из ЭлементыДерева Цикл
			Если ЭлементГруппа.Ломбард = ТекСтрока.ОтделениеРодитель Тогда
				Пометка = ТекСтрока.Пометка;
				ВлЭлементы = ЭлементГруппа.ПолучитьЭлементы();
				Для каждого ВлЭлемент Из ВлЭлементы Цикл
					Если НЕ ВлЭлемент.Пометка = ТекСтрока.Пометка Тогда
						Пометка = ВлЭлемент.Пометка;
						Прервать;
					КонецЕсли;
				КонецЦикла;    
				ЭлементГруппа.Пометка = ?(Пометка = ТекСтрока.Пометка, ТекСтрока.Пометка, ложь);
				Прервать;
			КонецЕсли;	
		КонецЦикла;		
	КонецЕсли; 
	ОтборЛомбарды = "";
	СписокЛомбардыОтбор.Очистить();
	ЗаполнитьОтборЛомбарды(Дерево.ПолучитьЭлементы());
КонецПроцедуры

&НаКлиенте
Процедура ПанельПоискПоЛомбардам(Команда) 
	Элементы.ГруппаОтбор.Видимость = НЕ Элементы.ГруппаОтбор.Видимость;
	Если Элементы.ГруппаОтбор.Видимость Тогда
		Элементы.ТаблицаПриказовНайтиЛомбарды.Пометка = Истина;  
		Элементы.ТаблицаПриказовНайтиЛомбарды.ЦветФона = WebЦвета.БледноЗеленый;
	Иначе
		Элементы.ТаблицаПриказовНайтиЛомбарды.Пометка = ложь; 
		Элементы.ТаблицаПриказовНайтиЛомбарды.ЦветФона = WebЦвета.Белый;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВыборЛомбардовСброс(Команда)
	ОбойтиРекурсивноСтрокиДерева(Дерево.ПолучитьЭлементы(), ложь);
	ВыборСписокЛомбардов.Очистить(); 
	СписокЛомбардыОтбор.Очистить();
	ОтборЛомбарды = "";
	ЗаполнитьТаблицуПриказов();
КонецПроцедуры  

&НаКлиенте
Процедура ВыборЛомбардовУстановитьФлажки(Команда)
	ОбойтиРекурсивноСтрокиДерева(Дерево.ПолучитьЭлементы(), Истина);
КонецПроцедуры  

&НаКлиенте
Процедура ВыборЛомбардовСнятьФлажки(Команда)
	ОбойтиРекурсивноСтрокиДерева(Дерево.ПолучитьЭлементы(), ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОбойтиРекурсивноСтрокиДерева(Строки, Пометка)
    Для Каждого СтрокаДерева Из Строки Цикл
        Если НЕ СтрокаДерева.Пометка = Пометка  Тогда
            СтрокаДерева.Пометка = Пометка;
		КонецЕсли;	 
        ПодчиненныеСтроки  = СтрокаДерева.ПолучитьЭлементы();
         
        Если ПодчиненныеСтроки.Количество() > 0 Тогда
            ОбойтиРекурсивноСтрокиДерева(ПодчиненныеСтроки, Пометка);
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры   

&НаКлиенте
Процедура ЗаполнитьОтборЛомбарды(Строки)  	
    Для Каждого СтрокаДерева Из Строки Цикл
		Если СтрокаДерева.Пометка И НЕ СтрокаДерева.ЭтоГруппа Тогда  
			СписокЛомбардыОтбор.Добавить(СтрокаДерева.Ломбард);
            ОтборЛомбарды = ОтборЛомбарды + ?(ПустаяСтрока(ОтборЛомбарды), "", "; ") + СокрЛП(СтрокаДерева.Ломбард);
		КонецЕсли;	 
        ПодчиненныеСтроки  = СтрокаДерева.ПолучитьЭлементы();
         
        Если ПодчиненныеСтроки.Количество() > 0 Тогда
            ЗаполнитьОтборЛомбарды(ПодчиненныеСтроки);
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура НайтиПоНомеруПриказа(Команда)
	ЗаполнитьТаблицуПриказов();
КонецПроцедуры

&НаКлиенте
Процедура ВыборНомерПриказаОчистка(Элемент, СтандартнаяОбработка) 
	ВыборНомерПриказа = "";
	ЗаполнитьТаблицуПриказов();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСтавокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура;    
	ПараметрыФормы.Вставить("Документ", ТекущийПриказ); 
	Если ТекущийПриказ.Проведен Тогда
		ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
	КонецЕсли;	  
	ТекСтрока = Элементы.ТаблицаСтавок.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда
		ПараметрыФормы.Вставить("СхемаКредитования", ТекСтрока.СхемаКредитования);
	КонецЕсли;	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеРедактированияСтавок",ЭтаФорма);
	
	ОткрытьФорму("ОбщаяФорма.ЛБ_ЗаполнениеПроцентныхСтавокИзПриказа", ПараметрыФормы,,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры 

&НаКлиенте
Процедура ПослеРедактированияСтавок(Результат, ДопПараметры) Экспорт 
	Если Результат = неопределено Тогда
		Возврат;
	КонецЕсли;	
	ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;  
	ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
	ПолучитьОбъектПриказа(ИдентификаторСтроки); 
	ОбработатьИзменениеТабличныхЧастейПриказа();
КонецПроцедуры   

&НаСервере 
Процедура ОбработатьИзменениеТабличныхЧастейПриказа() 
	СтрокаПриказа = ТаблицаПриказов.НайтиПоИдентификатору(ТекущийПриказИдентификатор);
	ПолучитьДополнительныеРеквизиты(СтрокаПриказа);
КонецПроцедуры	

&НаСервере 
Функция ВыбратьСК()   
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");

	СК = Новый СписокЗначений;
    Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", ДокументОбъект.Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СхемыКредитования.Ссылка КАК СхемаКредитования
	               |ИЗ
	               |	Справочник.ЛБ_СхемыКредитования КАК ЛБ_СхемыКредитования
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_УсловияПредоставленияКредита.СрезПоследних(&Дата, ) КАК ЛБ_УсловияПредоставленияКредитаСрезПоследних
	               |		ПО (ЛБ_УсловияПредоставленияКредитаСрезПоследних.СхемаКредитования = ЛБ_СхемыКредитования.Ссылка)
	               |ГДЕ
	               |	ЛБ_СхемыКредитования.ПометкаУдаления = ЛОЖЬ";
	ТЗ = Запрос.Выполнить().Выгрузить();     
	Массив = ТЗ.ВыгрузитьКолонку("СхемаКредитования");//выгружаем таблицу значений в массив
    СК.ЗагрузитьЗначения(Массив);//загружаем массив в список значений  
	
	Для каждого Стр Из ДокументОбъект.СхемыКредитования Цикл 
		Эл = СК.НайтиПоЗначению(Стр.СхемаКредитования);
		Если НЕ Эл = неопределено Тогда
	        Эл.Пометка = Истина; 
		КонецЕсли;
	Конеццикла;
	Возврат СК;
КонецФункции

&НаКлиенте
Процедура СтрокаСКНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если ТекущийПриказ.Ломбарды.Количество() = 0 Тогда 
		Предупреждение("Выберите ломбарды в приказе!", 60);
		Возврат;
	КонецЕсли;	
	ОповещениеПослеВыборка = Новый ОписаниеОповещения("ПослеВыбораСК", ЭтаФорма); 
	ОткрытьФорму("Справочник.ЛБ_СхемыКредитования.ФормаВыбора", , Этаформа,,,,ОповещениеПослеВыборка,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры 

&НаСервере
Процедура ОбработкаВыбораСК(СхемаКредитования, ЗаполнятьСК = Истина) 
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");  
		
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", ДокументОбъект.Дата); 
	Запрос.УстановитьПараметр("ВидШаблона", Перечисления.ЛБ_ВидыОперацийУстановитьШаблонПриказа.ПроцентныеСтавки);
	МассивЛ = ДокументОбъект.Ломбарды.ВыгрузитьКолонку("Ломбард");  
	МассивЛ.Добавить(Справочники.ЛБ_Ломбарды.ПустаяСсылка());
	Запрос.УстановитьПараметр("Ломбарды", МассивЛ); 
	Запрос.УстановитьПараметр("СхемаКредитования", СхемаКредитования); 	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_УстановкаОтменаШаблонаПриказаСрезПоследних.ШаблонПриказа КАК ШаблонПриказа,
	               |	ЛБ_УстановкаОтменаШаблонаПриказаСрезПоследних.Отменен КАК Отменен,
	               |	ЛБ_УстановкаОтменаШаблонаПриказаСрезПоследних.Ломбард КАК Ломбард
	               |ИЗ
	               |	РегистрСведений.ЛБ_УстановкаОтменаШаблонаПриказа.СрезПоследних(
	               |			&Дата,
	               |			ВидШаблона = &ВидШаблона
	               |				И СхемаКредитования = &СхемаКредитования
	               |				И Ломбард В (&Ломбарды)) КАК ЛБ_УстановкаОтменаШаблонаПриказаСрезПоследних"; 
	ТЗ = Запрос.Выполнить().Выгрузить();   
	ТаблицаРегистраторов = Новый ТаблицаЗначений; 
	ТаблицаРегистраторов.Колонки.Добавить("Ломбард"); 
	ТаблицаРегистраторов.Колонки.Добавить("Регистратор");
	Отбор = Новый Структура;
	Для каждого СтрЛ Из ДокументОбъект.Ломбарды Цикл			
		Отбор.Вставить("Ломбард", СтрЛ.Ломбард); 
		Строки = ТЗ.НайтиСтроки(Отбор);
		Если НЕ Строки.Количество() = 0 Тогда 
			Стр = строки.Получить(0); 
			Если НЕ Стр.Отменен Тогда
				стрР = ТаблицаРегистраторов.Добавить(); 
				СтрР.Ломбард = СтрЛ.Ломбард;
				СтрР.Регистратор = Стр.ШаблонПриказа;			                                        
				Продолжить;
			КонецЕсли;	
		КонецЕсли;
		Отбор.Вставить("Ломбард", Справочники.ЛБ_Ломбарды.ПустаяСсылка());  
		Строки = ТЗ.НайтиСтроки(Отбор);
		Если НЕ Строки.Количество() = 0 Тогда 
			Стр = строки.Получить(0);
			стрР = ТаблицаРегистраторов.Добавить(); 
			СтрР.Ломбард = СтрЛ.Ломбард;
			СтрР.Регистратор = Стр.ШаблонПриказа; 
		Иначе
			стрР = ТаблицаРегистраторов.Добавить(); 
			СтрР.Ломбард = СтрЛ.Ломбард;
		КонецЕсли;	
	КонецЦикла;	   
	
	СписокРегистраторов = Новый СписокЗначений;
	СписокЛомбардовБезШаблона = "";
	Для каждого СтрР Из ТаблицаРегистраторов Цикл  
		Если НЕ ЗначениеЗаполнено(СтрР.Регистратор) Тогда
			СписокЛомбардовБезШаблона = СписокЛомбардовБезШаблона + ?(ПустаяСтрока(СписокЛомбардовБезШаблона), "", ", ") + СокрЛП(СтрР.Ломбард);
		Иначе 
			Если СписокРегистраторов.НайтиПоЗначению(СтрР.Регистратор) = неопределено  Тогда  
				СписокРегистраторов.Добавить(СтрР.Регистратор);
			КонецЕсли;	
		КонецЕсли;	
	Конеццикла;
	
	Если НЕ ПустаяСтрока(СписокЛомбардовБезШаблона) Тогда
		ОбщегоНазначения.СообщитьПользователю("Для ломбардов " + СписокЛомбардовБезШаблона +  " не найдено установленного шаблона по процентым ставкам для схемы кредитования " + СокрЛП(СхемаКредитования));
		Возврат; 
	КонецЕсли;
	
	Если СписокРегистраторов.Количество() = 0 Тогда  
		ОбщегоНазначения.СообщитьПользователю("Для выбранной схемы кредитования " + СокрЛП(СхемаКредитования) + " и выбранных ломбардов не найдено установленного шаблона по процентым ставкам.");
		Возврат;   
	ИначеЕсли СписокРегистраторов.Количество() > 1 Тогда  
		ОбщегоНазначения.СообщитьПользователю("Для выбранной схемы кредитования " + СокрЛП(СхемаКредитования) + " и выбранных ломбардов найдено " + Строка(СписокРегистраторов.Количество()) + " установленных шаблона по процентым ставкам.");
		ОбщегоНазначения.СообщитьПользователю("");
		Возврат;   	
	КонецЕсли;	

	ТекРегистратор = СписокРегистраторов.Получить(0).Значение;
    Запрос.УстановитьПараметр("Регистратор", ТекРегистратор);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЛБ_ТекущийШаблонПриказаПроцентныеСтавки.СхемаКредитования КАК СхемаКредитования,
	               |	ЛБ_ТекущийШаблонПриказаПроцентныеСтавки.ПричинаПрименения КАК ПричинаПрименения,
	               |	ЛБ_ТекущийШаблонПриказаПроцентныеСтавки.СтатусЗалогодателя КАК СтатусЗалогодателя,
	               |	ЛБ_ТекущийШаблонПриказаПроцентныеСтавки.ДиапазонСумм КАК ДиапазонСумм,
	               |	ЛБ_ТекущийШаблонПриказаПроцентныеСтавки.ДеньНачалаПрименения КАК ДеньНачалаПрименения,
	               |	ЛБ_ТекущийШаблонПриказаПроцентныеСтавки.ДиапазонСумм.ПорядокСортировки КАК ДиапазонСуммПорядокСортировки
	               |ИЗ
	               |	РегистрСведений.ЛБ_ТекущийШаблонПриказаПроцентныеСтавки КАК ЛБ_ТекущийШаблонПриказаПроцентныеСтавки
	               |ГДЕ
	               |	ЛБ_ТекущийШаблонПриказаПроцентныеСтавки.Регистратор = &Регистратор
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СхемаКредитования,
	               |	ПричинаПрименения УБЫВ,
	               |	СтатусЗалогодателя,
	               |	ДеньНачалаПрименения,
	               |	ДиапазонСуммПорядокСортировки";
	ТаблицаШаблона = Запрос.Выполнить().Выгрузить();
	
	Если ЗаполнятьСК Тогда
		НоваяСтр = ДокументОбъект.СхемыКредитования.Добавить();
	    НоваяСтр.СхемаКредитования = СхемаКредитования; 
		НоваяСтр.ШаблонПроцентныеСтавки = ТекРегистратор; 
		
		ЗаполнитьСписокСК(ДокументОбъект);
	КонецЕсли;	
				
	Для каждого Стр Из ТаблицаШаблона Цикл
		НоваяСтрП = ДокументОбъект.СтавкиПроцентов.Добавить();
		НоваяСтрП.СхемаКредитования = Стр.СхемаКредитования;
		НоваяСтрП.ПричинаПрименения = Стр.ПричинаПрименения;
		НоваяСтрП.СтатусЗалогодателя = Стр.СтатусЗалогодателя;
		НоваяСтрП.ДиапазонСумм = Стр.ДиапазонСумм;
		НоваяСтрП.ДеньНачалаПрименения = Стр.ДеньНачалаПрименения;
		НоваяСтрП.Ставка = 0;
	КонецЦикла;	
		
    ДокументОбъект.Записать();          
	СтрокаПриказа = ТаблицаПриказов.НайтиПоИдентификатору(ТекущийПриказИдентификатор);
    ПолучитьДополнительныеРеквизиты(СтрокаПриказа);
	СхемыКредитования.Загрузить(ТекущийПриказ.СхемыКредитования.Выгрузить());
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор); 		   
КонецПроцедуры  

&НаКлиенте
Процедура ПослеВыбораСК(Результат, ДопПараметры) Экспорт   
	Если НЕ Результат = неопределено Тогда 
		ОтборК = Новый Структура;
	    ОтборК.Вставить("СхемаКредитования", Результат);
		СтрокиК = ТекущийПриказ.СхемыКредитования.НайтиСтроки(ОтборК); 
		Если СтрокиК.Количество() = 0 Тогда
		    ОбработкаВыбораСК(Результат);   
		Иначе     
			Предупреждение("Схема кредитования " + СокрЛП(Результат) + " уже выбрана в приказе.", 60);
		КонецЕсли;	
		//ПроставитьПроцентныеСтавкиПоТекущимНастройкам(Результат, ТекущийПриказ.Ломбарды.Получить(0).Ломбард); 	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокСК(ДокументОбъект)  
	Результат = "";
	Для каждого Стр Из ДокументОбъект.СхемыКредитования Цикл
		Результат = Результат + ?(ПустаяСтрока(Результат), "", "; ") + СокрЛП(Стр.СхемаКредитования.Наименование);
	КонецЦикла;	
	ДокументОбъект.СтрокаСхемыКредитования = Результат;
КонецПроцедуры	

&НаКлиенте
Процедура ПослеОтметкиЭлементовСК(Элементы, Параметры) Экспорт 
	//Если Элементы <> Неопределено Тогда 
	//	ОбработкаОтметкиЭлементовСК(Элементы);
	//	Если НЕ ТекущийПриказ.Ломбарды.Количество() =  0 Тогда
	//		ЕстьОтметка = ложь;
	//		Для Каждого Эл Из Элементы Цикл 
	//		    Если Эл.Пометка Тогда 
	//				ЕстьОтметка = Истина;
	//				Прервать;
	//			КонецЕсли;	 
	//		КонецЦикла; 
	//		Если ЕстьОтметка Тогда 
	//			Режим = РежимДиалогаВопрос.ДаНет;
	//			Ответ = Вопрос("Заполнить процентные ставки по текущим данным в ломбарде?", Режим, 0);
	//			Если Ответ = КодВозвратаДиалога.Да Тогда									
	//				Если ТекущийПриказ.Ломбарды.Количество() = 1 Тогда
	//					ПроставитьПроцентныеСтавкиПоТекущимНастройкам(ТекущийПриказ.Ломбарды.Получить(0).Ломбард); 
	//				Иначе
	//					ПараметрыФормы = Новый Структура;
	//				    ПараметрыФормы.Вставить("Приказ", ТекущийПриказ.Ссылка); 
	//					
	//					ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЛомбардаСК", ЭтаФорма);
	//					ОткрытьФорму("ОбщаяФорма.ЛБ_ВыборЛомбардаИзПриказа", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	//				КонецЕсли;
	//			КонецЕсли;	
	//		КонецЕсли;
	//	КонецЕсли;	
	//КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЛомбардаСК(Результат, ДопПараметры) Экспорт 
//	Если Результат = неопределено Тогда
//	   Возврат; 	
//	КонецЕсли;
//	ПроставитьПроцентныеСтавкиПоТекущимНастройкам(Результат);
КонецПроцедуры	

&НаСервере
Функция ЗаполнитьПроцентныеСтавкиПоНастройкамВЛомбарде(СхемаКредитования, Ломбард) 
	ЗапросСтавки = Новый Запрос; 
	ЗапросСтавки.УстановитьПараметр("СхемаКредитования", СхемаКредитования); 
	ЗапросСтавки.УстановитьПараметр("Ломбард", Ломбард);  
	ЗапросСтавки.УстановитьПараметр("Дата", ТекущийПриказ.Дата);
	ЗапросСтавки.Текст = "ВЫБРАТЬ
	                     |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.Период КАК Период,
	                     |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.СхемаКредитования КАК СхемаКредитования,
	                     |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.СтатусЗалогодателя КАК СтатусЗалогодателя,
	                     |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.ПричинаПрименения КАК ПричинаПрименения,
	                     |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.ДиапазонСуммЗайма КАК ДиапазонСумм,
	                     |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.ДеньНачалаПрименения КАК ДеньНачалаПрименения,
	                     |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.ПроцентнаяСтавка КАК Ставка
	                     |ИЗ
	                     |	РегистрСведений.ЛБ_ПрейскурантПроцентныхСтавок.СрезПоследних(
	                     |			&Дата,
	                     |			СхемаКредитования = &СхемаКредитования
	                     |				И Ломбард = &Ломбард
	                     |				И ДатаНачалаДействия <= &Дата) КАК ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних
	                     |
	                     |УПОРЯДОЧИТЬ ПО
	                     |	Период УБЫВ"; 
	ТаблицаЗапросаСтавки = ЗапросСтавки.Выполнить().Выгрузить(); 
	ТаблицаСтавок = ТаблицаЗапросаСтавки.Скопировать(); 
	ТаблицаСтавок.Очистить();
	
	Период = Дата(1,1,1);
	Для каждого Стр Из ТаблицаЗапросаСтавки Цикл
		Если Период = Дата(1,1,1) Тогда
			Период = Стр.Период;
		ИначеЕсли Стр.Период < Период Тогда
			Прервать;
		КонецЕсли;	
		НоваяСтр = ТаблицаСтавок.Добавить();
		НоваяСтр.СхемаКредитования = Стр.СхемаКредитования; 
		НоваяСтр.СтатусЗалогодателя = Стр.СтатусЗалогодателя;
		НоваяСтр.ПричинаПрименения = Стр.ПричинаПрименения; 
		НоваяСтр.ДиапазонСумм = Стр.ДиапазонСумм;
		НоваяСтр.ДеньНачалаПрименения = Стр.ДеньНачалаПрименения;
		НоваяСтр.Ставка = Стр.Ставка;
	КонецЦикла;
	Возврат ТаблицаСтавок;	
КонецФункции	

 &НаСервере
Процедура ПроставитьПроцентныеСтавкиПоТекущимНастройкам(СхемаКредитования, Ломбард) 
	ТаблицаСтавок = ЗаполнитьПроцентныеСтавкиПоНастройкамВЛомбарде(СхемаКредитования, Ломбард);
	Если НЕ ТаблицаСтавок.Количество() = 0 тогда  
		ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
		ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");
		Для каждого стр Из ДокументОбъект.СтавкиПроцентов Цикл  
			ОтборП = Новый Структура;
            ОтборП.Вставить("СхемаКредитования", стр.СхемаКредитования);
			ОтборП.Вставить("ПричинаПрименения", стр.ПричинаПрименения);
			ОтборП.Вставить("СтатусЗалогодателя", стр.СтатусЗалогодателя);
			ОтборП.Вставить("ДиапазонСумм", стр.ДиапазонСумм);
			ОтборП.Вставить("ДеньНачалаПрименения", стр.ДеньНачалаПрименения);
			
			СтрокиП = ТаблицаСтавок.НайтиСтроки(ОтборП); 
			Если НЕ СтрокиП.Количество() = 0 Тогда
				СтрП = строкиП.Получить(0);
				Стр.Ставка = СтрП.ставка;
			КонецЕсли;	
		КонецЦикла;	
        ДокументОбъект.Записать();                         
		СтрокаПриказа = ТаблицаПриказов.НайтиПоИдентификатору(ТекущийПриказИдентификатор);
	    ПолучитьДополнительныеРеквизиты(СтрокаПриказа);

		ПолучитьОбъектПриказа(ТекущийПриказИдентификатор); 	
	КонецЕсли; 	 
КонецПроцедуры	 
	 
&НаСервере
Процедура ОбработкаОтметкиЭлементовСК(Элементы)  	
	Если Элементы <> Неопределено Тогда 
		ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
		ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");
		ДатаПроверки = ДокументОбъект.Дата;
		ТаблицаСК = ДокументОбъект.СхемыКредитования.Выгрузить();
		ДокументОбъект.СхемыКредитования.Очистить();
		Для Каждого Эл Из Элементы Цикл 
			Если Эл.Пометка Тогда   
				ШаблонПриказа = ЛБ_ОбщийМодуль.ПолучитьТекущийШаблон(ДатаПроверки, Перечисления.ЛБ_ВидыПрейскурантов.ПроцентныеСтавки, Ломбарды, Эл.Значение);
				Если НЕ ШаблонПриказа = неопределено Тогда 
					НоваяСтр = ДокументОбъект.СхемыКредитования.Добавить(); 
				    НоваяСтр.СхемаКредитования = Эл.Значение;
					НоваяСтр.ШаблонПроцентныеСтавки = ШаблонПриказа;
					
					Отбор = Новый Структура;
				    Отбор.Вставить("СхемаКредитования",Эл.Значение);
					Строки = ТаблицаСК.НайтиСтроки(Отбор);
					Если Строки.Количество() = 0 Тогда
						Для каждого СтрШ Из НоваяСтр.ШаблонПроцентныеСтавки.СтавкиПроцентов Цикл 
							НоваяСтрП = ДокументОбъект.СтавкиПроцентов.Добавить();
							НоваяСтрП.СхемаКредитования = НоваяСтр.СхемаКредитования;
							НоваяСтрП.ПричинаПрименения = СтрШ.ПричинаПрименения;
							НоваяСтрП.СтатусЗалогодателя = СтрШ.СтатусЗалогодателя;
							НоваяСтрП.ДиапазонСумм = СтрШ.ДиапазонСумм;
							НоваяСтрП.ДеньНачалаПрименения = СтрШ.ДеньНачалаПрименения;
							НоваяСтрП.Ставка = 0;
						Конеццикла;	
					Иначе
						СтрокаСК = Строки.Получить(0);
						Если НЕ СтрокаСК.ШаблонПроцентныеСтавки = ШаблонПриказа Тогда 
							СтрокиУдалить = ДокументОбъект.СтавкиПроцентов.НайтиСтроки(Отбор);  
							Для каждого Стр Из СтрокиУдалить Цикл
								ТекущийПриказ.СтавкиПроцентов.Удалить(Стр);
							КонецЦикла; 
							Для каждого СтрШ Из НоваяСтр.ШаблонПроцентныеСтавки.СтавкиПроцентов Цикл
	                            НоваяСтрП = ДокументОбъект.СтавкиПроцентов.Добавить();
								НоваяСтрП.СхемаКредитования = НоваяСтр.СхемаКредитования;
								НоваяСтрП.ПричинаПрименения = СтрШ.ПричинаПрименения;
								НоваяСтрП.СтатусЗалогодателя = СтрШ.СтатусЗалогодателя;
								НоваяСтрП.ДиапазонСумм = СтрШ.ДиапазонСумм;
							КонецЦикла;	
						КонецЕсли;	
                    КонецЕсли;
				Иначе
					Сообщить("Для кредитной схемы " + СокрЛП(Эл.Значение) + " не установлен шаблон процентных ставок!");					
				КонецЕсли;	
			Иначе  
				Отбор = Новый Структура;
				Отбор.Вставить("СхемаКредитования",Эл.Значение); 
				Строки = ТаблицаСК.НайтиСтроки(Отбор);
				Если НЕ Строки.Количество() = 0 Тогда
					СтрокиУдалить = ДокументОбъект.СтавкиПроцентов.НайтиСтроки(Отбор);  
					Для каждого Стр Из СтрокиУдалить Цикл
						ДокументОбъект.СтавкиПроцентов.Удалить(Стр);
					КонецЦикла; 	 
				КонецЕсли;	
			КонецЕсли;				
		КонецЦикла;  
		ЗаполнитьСписокСК(ДокументОбъект);
	    ДокументОбъект.Записать();          
		СтрокаПриказа = ТаблицаПриказов.НайтиПоИдентификатору(ТекущийПриказИдентификатор);
	    ПолучитьДополнительныеРеквизиты(СтрокаПриказа);
		СхемыКредитования.Загрузить(ТекущийПриказ.СхемыКредитования.Выгрузить());
		ПолучитьОбъектПриказа(ТекущийПриказИдентификатор); 		
    КонецЕсли; 
КонецПроцедуры  

&НаКлиенте
Процедура АкцияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораАкции",ЭтаФорма);
	
	ОткрытьФорму("Справочник.ЛБ_Акции.ФормаВыбора",, Элементы.Акция,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры 

&НаКлиенте
Процедура АкцияОчистка(Элемент, СтандартнаяОбработка)
	ОчиститьНастройкиАкция();
КонецПроцедуры  

&НаСервере
Процедура ОчиститьНастройкиАкция()   
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");
	ДокументОбъект.Акция = Справочники.ЛБ_Акции.ПустаяСсылка();
	ДокументОбъект.УсловияАкцииСтавки.Очистить(); 
    ДокументОбъект.Записать();
	СтрокаАкция = СокрЛП(ДокументОбъект.Акция);
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор); 
	СтрокаПриказа = ТаблицаПриказов.НайтиПоИдентификатору(ТекущийПриказИдентификатор);
	//+МАН 15.11.24 Вывод наименования акции в ТЧ приказов. Заявка 2581.
	СтрокаПриказа.Акция = СтрокаАкция;
	//-МАН
	ПолучитьДополнительныеРеквизиты(СтрокаПриказа);
КонецПроцедуры 	

&НаСервере
Функция ПолучитьАкцияПроцентныеСтавкиСрезПоследних(ДокументОбъект)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДокументОбъект.Дата); 
	Запрос.УстановитьПараметр("Акция", ДокументОбъект.Акция);
	Запрос.УстановитьПараметр("Ломбарды", ДокументОбъект.Ломбарды.ВыгрузитьКолонку("Ломбард"));
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_АкцииПроцентныеСтавкиСрезПоследних.СхемаКредитования КАК СхемаКредитования,
	               |	ЛБ_АкцииПроцентныеСтавкиСрезПоследних.ПричинаПрименения КАК ПричинаПрименения,
	               |	ЛБ_АкцииПроцентныеСтавкиСрезПоследних.СтатусЗалогодателя КАК СтатусЗалогодателя,
	               |	ЛБ_АкцииПроцентныеСтавкиСрезПоследних.ДиапазонСуммЗайма КАК ДиапазонСумм,
	               |	ЛБ_АкцииПроцентныеСтавкиСрезПоследних.ПроцентнаяСтавка КАК Ставка,
	               |	ЛБ_АкцииПроцентныеСтавкиСрезПоследних.Отклонение КАК Отклонение,
	               |	ЛБ_АкцииПроцентныеСтавкиСрезПоследних.ЗначениеОтклонения КАК ЗначениеОтклонения
	               |ИЗ
	               |	РегистрСведений.ЛБ_АкцииПроцентныеСтавки.СрезПоследних(
	               |			&Дата,
	               |			Акция = &Акция
	               |				И Ломбард В (&Ломбарды)) КАК ЛБ_АкцииПроцентныеСтавкиСрезПоследних"; 
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

&НаСервере
Функция ПолучитьАкцияМеталлыСрезПоследних(ДокументОбъект)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДокументОбъект.Дата); 
	Запрос.УстановитьПараметр("Акция", ДокументОбъект.Акция);
	Запрос.УстановитьПараметр("Ломбарды", ДокументОбъект.Ломбарды.ВыгрузитьКолонку("Ломбард"));
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_АкцииМеталлыСрезПоследних.СхемаКредитования КАК СхемаКредитования,
	               |	ЛБ_АкцииМеталлыСрезПоследних.Проба КАК Проба,
	               |	ЛБ_АкцииМеталлыСрезПоследних.Категория КАК Категория,
	               |	ЛБ_АкцииМеталлыСрезПоследних.Отклонение КАК Отклонение,
	               |	ЛБ_АкцииМеталлыСрезПоследних.ЗначениеОтклонения КАК ЗначениеОтклонения,
	               |	ЛБ_АкцииМеталлыСрезПоследних.Цена КАК Цена
	               |ИЗ
	               |	РегистрСведений.ЛБ_АкцииМеталлы.СрезПоследних(
	               |			&Дата,
	               |			Акция = &Акция
	               |				И Ломбард В (&Ломбарды)) КАК ЛБ_АкцииМеталлыСрезПоследних"; 
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции	

&НаСервере
Процедура ПослеВыбораАкции(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;	
	
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");
	ДокументОбъект.Акция = Результат;
    ДокументОбъект.Записать();

	
	ЗаполнитьАкциСтавкиПоНастройкамНаСервере(Истина);

	
	//ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	//ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ"); 
	//ДокументОбъект.Акция = Результат; 
	//ДокументОбъект.УсловияАкцииСтавки.Очистить(); 
	//ДокументОбъект.УсловияАкцииМеталлы.Очистить();
	//ДатаПроверки = ДокументОбъект.Дата;
	//ШаблонПриказа = ЛБ_ОбщийМодуль.ПолучитьТекущийШаблонАкция(ДатаПроверки, Перечисления.ЛБ_ВидыПрейскурантов.ПроцентныеСтавки, Результат);
	//Если НЕ ШаблонПриказа = неопределено Тогда
	//	ТаблицаСтавок = ПолучитьАкцияПроцентныеСтавкиСрезПоследних(ДокументОбъект);
	//	Если ЗначениеЗаполнено(ДокументОбъект.Акция) Тогда
	//		Для каждого СтрШ Из ШаблонПриказа.СтавкиПроцентов Цикл 
	//			НоваяСтрП = ДокументОбъект.УсловияАкцииСтавки.Добавить();
	//			НоваяСтрП.СхемаКредитования = СтрШ.СхемаКредитования;
	//			НоваяСтрП.ПричинаПрименения = СтрШ.ПричинаПрименения;
	//			НоваяСтрП.СтатусЗалогодателя = СтрШ.СтатусЗалогодателя;
	//			НоваяСтрП.ДиапазонСумм = СтрШ.ДиапазонСумм;   
	//			
	//			Если НЕ ТаблицаСтавок.Количество() = 0 Тогда
	//				Запрос = Новый Запрос; 
	//				Запрос.УстановитьПараметр("ТЗ", ТаблицаСтавок);
	//				Запрос.УстановитьПараметр("ПричинаПрименения", НоваяСтрП.ПричинаПрименения); 
	//				Запрос.УстановитьПараметр("ДиапазонСумм", НоваяСтрП.ДиапазонСумм);  
	//				СК = Новый СписокЗначений;
	//				СК.Добавить(НоваяСтрП.СхемаКредитования);
	//				СК.Добавить(Справочники.ЛБ_СхемыКредитования.ПустаяСсылка());
	//				Запрос.УстановитьПараметр("СхемыКредитования", СК); 
	//				Статусы = Новый СписокЗначений;
	//				Статусы.Добавить(НоваяСтрП.СтатусЗалогодателя);
	//				Статусы.Добавить(Справочники.ЛБ_СтатусыЗалогодателей.ПустаяСсылка());
	//				Запрос.УстановитьПараметр("Статусы", Статусы);
	//				Запрос.Текст = "ВЫБРАТЬ
	//				               |	ТЗ.ПричинаПрименения КАК ПричинаПрименения,
	//				               |	ТЗ.СхемаКредитования КАК СхемаКредитования,
	//				               |	ТЗ.СтатусЗалогодателя КАК СтатусЗалогодателя,
	//				               |	ТЗ.ДиапазонСумм КАК ДиапазонСумм,
	//				               |	ТЗ.Ставка КАК Ставка,
	//				               |	ТЗ.Отклонение КАК Отклонение,
	//				               |	ТЗ.ЗначениеОтклонения КАК ЗначениеОтклонения
	//				               |ПОМЕСТИТЬ Таблица
	//				               |ИЗ
	//				               |	&ТЗ КАК ТЗ
	//				               |;
	//				               |
	//				               |////////////////////////////////////////////////////////////////////////////////
	//				               |ВЫБРАТЬ
	//				               |	Таблица.Ставка КАК Ставка,
	//				               |	Таблица.Отклонение КАК Отклонение,
	//				               |	Таблица.ЗначениеОтклонения КАК ЗначениеОтклонения
	//				               |ИЗ
	//				               |	Таблица КАК Таблица
	//				               |ГДЕ
	//				               |	Таблица.ПричинаПрименения = &ПричинаПрименения
	//				               |	И Таблица.ДиапазонСумм = &ДиапазонСумм
	//				               |	И Таблица.СхемаКредитования В(&СхемыКредитования)
	//				               |	И Таблица.СтатусЗалогодателя В(&Статусы)
	//				               |
	//				               |УПОРЯДОЧИТЬ ПО
	//				               |	Таблица.СхемаКредитования УБЫВ,
	//				               |	Таблица.СтатусЗалогодателя УБЫВ"; 
	//                Выборка = Запрос.Выполнить().Выбрать(); 
	//				Если Выборка.Следующий() Тогда
	//					Если НЕ Выборка.ставка = 0 Тогда
	//					    НоваяСтрП.Ставка = Выборка.ставка;
	//						НоваяСтрП.УстановитьЗначениеИлиОтклонение = Перечисления.ЛБ_УстановкаЗначенияИлиОтклонения.Значение; 
	//					Иначе 
	//						НоваяСтрП.Отклонение = Выборка.Отклонение;  
	//						НоваяСтрП.ЗначениеОтклонения = Выборка.ЗначениеОтклонения;
	//						НоваяСтрП.УстановитьЗначениеИлиОтклонение = Перечисления.ЛБ_УстановкаЗначенияИлиОтклонения.Отклонение; 
	//					КонецЕсли;	
	//				Иначе   
	//					НоваяСтрП.УстановитьЗначениеИлиОтклонение = Перечисления.ЛБ_УстановкаЗначенияИлиОтклонения.Значение;
	//				    НоваяСтрП.Ставка = 0;
	//				КонецЕсли;
	//			Иначе  
	//				НоваяСтрП.УстановитьЗначениеИлиОтклонение = Перечисления.ЛБ_УстановкаЗначенияИлиОтклонения.Значение;
	//			    НоваяСтрП.Ставка = 0;
	//			КонецЕсли;	
	//		КонецЦикла;	
	//	КонецЕсли;	
	//		
	//Иначе 
	//	Сообщить("Для акции " + СокрЛП(Результат) + " не установлен шаблон процентных ставок!"); 
	//	ДокументОбъект.УсловияАкцииСтавки.Очистить(); 
	//КонецЕсли;	  
	//
	//ШаблонПриказа = ЛБ_ОбщийМодуль.ПолучитьТекущийШаблонАкция(ДатаПроверки, Перечисления.ЛБ_ВидыПрейскурантов.Металлы, Результат);
	//Если НЕ ШаблонПриказа = неопределено Тогда
	//	ТаблицаМеталлов = ПолучитьАкцияМеталлыСрезПоследних(ДокументОбъект);
	//	Если ЗначениеЗаполнено(ДокументОбъект.Акция) Тогда
	//		Для каждого СтрШ Из ШаблонПриказа.Металлы Цикл 
	//			НоваяСтрП = ДокументОбъект.УсловияАкцииМеталлы.Добавить();
	//			НоваяСтрП.Металл = СтрШ.Металл;
	//			НоваяСтрП.Проба = СтрШ.Проба;
	//			НоваяСтрП.Категория = СтрШ.КатегорияОбъектаЗалога; 
	//			НоваяСтрП.ЕдиницаИзмерения = ОсновнаяЕдиницаИзмерения;
	//						
	//			Если НЕ ТаблицаМеталлов.Количество() = 0 Тогда
	//				Запрос = Новый Запрос; 
	//				Запрос.УстановитьПараметр("ТЗ", ТаблицаМеталлов);
	//				Запрос.УстановитьПараметр("Проба", НоваяСтрП.Проба); 
	//				Запрос.УстановитьПараметр("Категория", НоваяСтрП.Категория);  
	//				СК = Новый СписокЗначений;
	//				СК.Добавить(НоваяСтрП.СхемаКредитования);
	//				СК.Добавить(Справочники.ЛБ_СхемыКредитования.ПустаяСсылка());
	//				Запрос.УстановитьПараметр("СхемыКредитования", СК); 
	//				Запрос.Текст = "ВЫБРАТЬ
	//				               |	ТЗ.Проба КАК Проба,
	//				               |	ТЗ.СхемаКредитования КАК СхемаКредитования,
	//				               |	ТЗ.Категория КАК Категория,
	//				               |	ТЗ.Цена КАК Цена,
	//				               |	ТЗ.Отклонение КАК Отклонение,
	//				               |	ТЗ.ЗначениеОтклонения КАК ЗначениеОтклонения
	//				               |ПОМЕСТИТЬ Таблица
	//				               |ИЗ
	//				               |	&ТЗ КАК ТЗ
	//				               |;
	//				               |
	//				               |////////////////////////////////////////////////////////////////////////////////
	//				               |ВЫБРАТЬ
	//				               |	Таблица.Цена КАК Цена,
	//				               |	Таблица.Отклонение КАК Отклонение,
	//				               |	Таблица.ЗначениеОтклонения КАК ЗначениеОтклонения
	//				               |ИЗ
	//				               |	Таблица КАК Таблица
	//				               |ГДЕ
	//				               |	Таблица.Проба = &ПричинаПрименения
	//				               |	И Таблица.Категория = &Категория
	//				               |	И Таблица.СхемаКредитования В(&СхемыКредитования)
	//				               |
	//				               |УПОРЯДОЧИТЬ ПО
	//				               |	Таблица.СхемаКредитования УБЫВ";
	//                Выборка = Запрос.Выполнить().Выбрать(); 
	//				Если Выборка.Следующий() Тогда
	//					Если НЕ Выборка.Цена = 0 Тогда
	//					    НоваяСтрП.Цена = Выборка.Цена;
	//						НоваяСтрП.УстановитьЗначениеИлиОтконение = Перечисления.ЛБ_УстановкаЗначенияИлиОтклонения.Значение; 
	//					Иначе 
	//						НоваяСтрП.Отклонение = Выборка.Отклонение;  
	//						НоваяСтрП.ЗначениеОтклонения = Выборка.ЗначениеОтклонения;
	//						НоваяСтрП.УстановитьЗначениеИлиОтконение = Перечисления.ЛБ_УстановкаЗначенияИлиОтклонения.Отклонение; 
	//					КонецЕсли;	
	//				Иначе  
	//					НоваяСтрП.УстановитьЗначениеИлиОтконение = Перечисления.ЛБ_УстановкаЗначенияИлиОтклонения.Значение;
	//				    НоваяСтрП.Цена = 0;
	//				КонецЕсли;
	//			Иначе  
	//				НоваяСтрП.УстановитьЗначениеИлиОтконение = Перечисления.ЛБ_УстановкаЗначенияИлиОтклонения.Значение;
	//			    НоваяСтрП.Цена = 0;
	//			КонецЕсли;	
	//		КонецЦикла;	
	//	КонецЕсли;	
	//Иначе 
	//	//Сообщить("Для акции " + СокрЛП(Результат) + " не установлен шаблон металлов!"); 		
	//    ДокументОбъект.УсловияАкцииМеталлы.Очистить(); 
	//КонецЕсли;	
	//ДокументОбъект.Записать();
	//СтрокаАкция = СокрЛП(ДокументОбъект.Акция);
	//ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);  
	//СтрокаПриказа = ТаблицаПриказов.НайтиПоИдентификатору(ТекущийПриказИдентификатор);
	////+МАН 15.11.24 Вывод наименования акции в ТЧ приказов. Заявка 2581.
	//СтрокаПриказа.Акция = СтрокаАкция;
	////-МАН
	//ПолучитьДополнительныеРеквизиты(СтрокаПриказа);
КонецПроцедуры

&НаКлиенте
Процедура МеталлыРедактированиеСК()
	ПараметрыФормы = Новый Структура;    
	ПараметрыФормы.Вставить("Документ", ТекущийПриказ);  
	ПараметрыФормы.Вставить("МассивСК", ПолучитьМассивВыбранныхСхемКредитования()); 
	ПараметрыФормы.Вставить("ТолькоПросмотр", ТекущийПриказ.Проведен);
	ОбработкаЗакрытия = Новый ОписаниеОповещения("ПроверитьВыборСК",ЭтаФорма);
	
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПросмотрЦенМеталлов", ПараметрыФормы,,,,, ОбработкаЗакрытия, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры  

&НаКлиенте
Процедура ЦеныМеталлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтрока = Элементы.ЦеныМеталлы.ТекущиеДанные;
	Если НЕ ТекСтрока.БазоваяНастройка Тогда	
	    МеталлыРедактированиеСК();  
	КонецЕсли;	
КонецПроцедуры  

&НаКлиенте
Процедура ТаблицаОтклоненийОтБазовыхЦенМеталлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	МеталлыРедактированиеСК();
КонецПроцедуры


&НаКлиенте
Процедура ПослеРедактированияМеталлов(Результат, ДопПараметры) Экспорт 
	Если Результат = неопределено Тогда
		Возврат;
	КонецЕсли;	
	ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;  
	ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
	ПолучитьОбъектПриказа(ИдентификаторСтроки);  
	ОбработатьИзменениеТабличныхЧастейПриказа();
КонецПроцедуры

&НаКлиенте
Процедура СценарийОценкиМеталловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораСценария",ЭтаФорма);
	
	ОткрытьФорму("Справочник.ЛБ_СценарииОценки.ФормаВыбора",, Элементы.СценарийОценкиМеталлов,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры   

&НаСервере
Процедура ПослеВыбораСценария(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;    
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");
	ДокументОбъект.СценарийОценкиМеталлов = Результат; 
	ДокументОбъект.Записать(); 
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСтавокАкцииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура;    
	ПараметрыФормы.Вставить("Документ", ТекущийПриказ); 
	Если ТекущийПриказ.Проведен Тогда
		ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
	КонецЕсли;	  
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеРедактированияСтавокАкция",ЭтаФорма);
	
	ОткрытьФорму("ОбщаяФорма.ЛБ_ЗаполнениеПроцентныхСтавокАкцияИзПриказа", ПараметрыФормы,,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеРедактированияСтавокАкция(Результат, ДопПараметры) Экспорт 
	Если Результат = неопределено Тогда
		Возврат;
	КонецЕсли;	
	ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;  
	ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
	ПолучитьОбъектПриказа(ИдентификаторСтроки);  
	ОбработатьИзменениеТабличныхЧастейПриказа();
КонецПроцедуры

&НаСервере
Процедура ОчиститьПроцентныеСтавкиНаСервере()   
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
    ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");
	ДокументОбъект.СтавкиПроцентов.Очистить(); 
	ДокументОбъект.Записать(); 
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	СтрокаПриказа = ТаблицаПриказов.НайтиПоИдентификатору(ТекущийПриказИдентификатор);
	ПолучитьДополнительныеРеквизиты(СтрокаПриказа);
 КонецПроцедуры	

&НаКлиенте
Процедура ОчиститьПроцентныеСтавки(Команда)
	Если  ТекущийПриказ.Проведен Тогда  
		Сообщить("Приказ введен в действие, его корректировка запрещена!");
	Иначе	          
	    Ответ = Вопрос("Удалить все строки таблицы?", РежимДиалогаВопрос.ДаНет, 0);
	    Если Ответ = КодВозвратаДиалога.Да Тогда
		    ОчиститьПроцентныеСтавкиНаСервере();
			ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;  
		    ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
		    ПолучитьОбъектПриказа(ИдентификаторСтроки); 
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМеталловАкцииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура;    
	ПараметрыФормы.Вставить("Документ", ТекущийПриказ); 
	Если ТекущийПриказ.Проведен Тогда
		ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
	КонецЕсли;	  
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеРедактированияМеталловАкция",ЭтаФорма);
	
	ОткрытьФорму("ОбщаяФорма.ЛБ_ЗаполнениеЦенМеталловАкцияИзПриказа", ПараметрыФормы,,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеРедактированияМеталловАкция(Результат, ДопПараметры) Экспорт 
	Если Результат = неопределено Тогда
		Возврат;
	КонецЕсли;	
	ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;  
	ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
	ПолучитьОбъектПриказа(ИдентификаторСтроки);    
	ОбработатьИзменениеТабличныхЧастейПриказа();
КонецПроцедуры

&НаСервере
Процедура ОчиститьПроцентныеСтавкиАкцияНаСервере() 
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
    ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");
	ДокументОбъект.УсловияАкцииСтавки.Очистить(); 
	ДокументОбъект.Записать(); 
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	СтрокаПриказа = ТаблицаПриказов.НайтиПоИдентификатору(ТекущийПриказИдентификатор);
	ПолучитьДополнительныеРеквизиты(СтрокаПриказа);
КонецПроцедуры	

&НаКлиенте
Процедура ОчиститьПроцентныеСтавкиАкции(Команда)
	Если  ТекущийПриказ.Проведен Тогда  
		Сообщить("Приказ введен в действие, его корректировка запрещена!");
	Иначе	          
	    Ответ = Вопрос("Удалить все строки таблицы?", РежимДиалогаВопрос.ДаНет, 0);
	    Если Ответ = КодВозвратаДиалога.Да Тогда
		    ОчиститьПроцентныеСтавкиАкцияНаСервере();
			ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;  
		    ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
		    ПолучитьОбъектПриказа(ИдентификаторСтроки); 
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОчиститьМеталлыАкцияНаСервере() 
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
    ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");
	ДокументОбъект.УсловияАкцииМеталлы.Очистить(); 
	ДокументОбъект.Записать();  
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	СтрокаПриказа = ТаблицаПриказов.НайтиПоИдентификатору(ТекущийПриказИдентификатор);
	ПолучитьДополнительныеРеквизиты(СтрокаПриказа);
КонецПроцедуры	

&НаКлиенте
Процедура ОчиститьМеталлыАкции(Команда)
	Если  ТекущийПриказ.Проведен Тогда  
		Сообщить("Приказ введен в действие, его корректировка запрещена!");
	Иначе	          
	    Ответ = Вопрос("Удалить все строки таблицы?", РежимДиалогаВопрос.ДаНет, 0);
	    Если Ответ = КодВозвратаДиалога.Да Тогда
		    ОчиститьМеталлыАкцияНаСервере();
			ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;  
		    ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
		    ПолучитьОбъектПриказа(ИдентификаторСтроки); 
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОчиститьМеталлыНаСервере()  
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
    ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");
	ДокументОбъект.ЦеныМеталлы.Очистить(); 
	ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенМеталлы.Очистить();
	ДокументОбъект.Записать(); 
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	СтрокаПриказа = ТаблицаПриказов.НайтиПоИдентификатору(ТекущийПриказИдентификатор);
	ПолучитьДополнительныеРеквизиты(СтрокаПриказа);
КонецПроцедуры	

&НаКлиенте
Процедура ОчиститьМеталлы(Команда)
	Если  ТекущийПриказ.Проведен Тогда  
		Сообщить("Приказ введен в действие, его корректировка запрещена!");
	Иначе	          
	    Ответ = Вопрос("Удалить все строки таблицы?", РежимДиалогаВопрос.ДаНет, 0);
	    Если Ответ = КодВозвратаДиалога.Да Тогда
		    ОчиститьМеталлыНаСервере();
			ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;  
		    ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
		    ПолучитьОбъектПриказа(ИдентификаторСтроки); 
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры   

&НаСервере
Процедура ОчиститьВставкиНаСервере()  
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
    ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");
	ДокументОбъект.ЦеныВставки.Очистить(); 
	ДокументОбъект.Записать(); 
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	СтрокаПриказа = ТаблицаПриказов.НайтиПоИдентификатору(ТекущийПриказИдентификатор);
	ПолучитьДополнительныеРеквизиты(СтрокаПриказа);
КонецПроцедуры	

&НаКлиенте
Процедура ОчиститьВставки(Команда)
	Если  ТекущийПриказ.Проведен Тогда  
		Сообщить("Приказ введен в действие, его корректировка запрещена!");
	Иначе	          
	    Ответ = Вопрос("Удалить все строки таблицы?", РежимДиалогаВопрос.ДаНет, 0);
	    Если Ответ = КодВозвратаДиалога.Да Тогда
		    ОчиститьВставкиНаСервере();
			ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;  
		    ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
		    ПолучитьОбъектПриказа(ИдентификаторСтроки); 
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОчиститьНастройкиМеталлыНаСервере()
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
    ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");
	ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенМеталлы.Очистить(); 
	ДокументОбъект.Записать(); 
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	СтрокаПриказа = ТаблицаПриказов.НайтиПоИдентификатору(ТекущийПриказИдентификатор);
	ПолучитьДополнительныеРеквизиты(СтрокаПриказа);
КонецПроцедуры	

&НаКлиенте
Процедура ОчиститьНастройкиМеталлы(Команда)
	Если  ТекущийПриказ.Проведен Тогда  
		Сообщить("Приказ введен в действие, его корректировка запрещена!");
	Иначе	          
	    Ответ = Вопрос("Удалить все строки таблицы?", РежимДиалогаВопрос.ДаНет, 0);
	    Если Ответ = КодВозвратаДиалога.Да Тогда
		    ОчиститьНастройкиМеталлыНаСервере();
			ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;  
		    ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
		    ПолучитьОбъектПриказа(ИдентификаторСтроки); 
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийПриказЦеныВставкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)  
	ТекСтрока = Элементы.ТекущийПриказЦеныВставки.ТекущиеДанные;
	Если ТекСтрока.ВидВставки = ПредопределенноеЗначение("Справочник.ЛБ_ДрагоценныеКамни.Бриллиант") Тогда
		ПараметрыФормы = Новый Структура;    
		ПараметрыФормы.Вставить("Документ", ТекущийПриказ); 
		Если ТекущийПриказ.Проведен Тогда
			ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
		КонецЕсли;	  
		
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеРедактированияВставок",ЭтаФорма);
		
		ОткрытьФорму("ОбщаяФорма.ЛБ_ЗаполнениеЦенВставокИзПриказа", ПараметрыФормы,,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	КонецЕсли;	
КонецПроцедуры  

&НаКлиенте
Процедура ПослеРедактированияВставок(Результат, ДопПараметры) Экспорт 
	Если Результат = неопределено Тогда
		Возврат;
	КонецЕсли;	
	ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;  
	ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
	ПолучитьОбъектПриказа(ИдентификаторСтроки);  
	ОбработатьИзменениеТабличныхЧастейПриказа();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПроцентныеСтавкиАкция(Команда)
	ПараметрыФормы = Новый Структура;    
	ПараметрыФормы.Вставить("Документ", ТекущийПриказ); 
	Если ТекущийПриказ.Проведен Тогда
		ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
	КонецЕсли;	  
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеРедактированияСтавокАкция",ЭтаФорма);
	
	ОткрытьФорму("ОбщаяФорма.ЛБ_ЗаполнениеПроцентныхСтавокАкцияИзПриказа", ПараметрыФормы,,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ВидОтбораЛомбардовПриИзменении(Элемент)   
	ЗаполнитьДеревоЛомбардов();
	ПроставитьГалочкиВГруппе();
КонецПроцедуры  

&НаКлиенте
Процедура ПроставитьГалочкиВГруппе() 
    ЭлементыДерева = Дерево.ПолучитьЭлементы();
	Для каждого Элемент Из ЭлементыДерева Цикл		
		ВлЭлементы = Элемент.ПолучитьЭлементы();
		Если ВлЭлементы.Количество()  > 0 Тогда
			Пометка = Истина;  
			ЕстьОтмеченные = ложь;
			Для каждого ВлЭлемент Из ВлЭлементы Цикл
				Если НЕ ВлЭлемент.Пометка Тогда
					Пометка = Ложь;
					//Прервать;					
				Иначе
					ЕстьОтмеченные = Истина;
				КонецЕсли;
			КонецЦикла;
			Элемент.Пометка = Пометка;  
			Если ЕстьОтмеченные Тогда
			    Элементы.СписокЛомбардов.Развернуть(Элемент.ПолучитьИдентификатор(), Истина); 
			КонецЕсли;	
		КонецЕсли;		
	КонецЦикла;	

КонецПроцедуры	

&НаКлиенте
Процедура СпособВыводаЛомбардовНаПечатьПриИзменении(Элемент)
	ТекущийПриказ.ВыводитьЛомбарды = СпособВыводаЛомбардовНаПечать; 
	ЗаписатьРеквизит("ВыводитьЛомбарды", ТекущийПриказ.ВыводитьЛомбарды);
КонецПроцедуры

&НаСервере
Процедура ЗаписатьРеквизит(ИмяРеквизита, Значение) 
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
    ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ"); 
	ДокументОбъект[ИмяРеквизита] = Значение;  
	ДокументОбъект.Записать();
КонецПроцедуры	

&НаКлиенте
Процедура ТекущийПриказНачальникОтделаРазвитияБизнесаПриИзменении(Элемент)
	ЗаписатьРеквизит("НачальникОРБ", ТекущийПриказ.НачальникОРБ);
КонецПроцедуры

&НаКлиенте
Процедура ТекущийПриказОтветственноеЛицоОРБПриИзменении(Элемент)
	ЗаписатьРеквизит("ОтветственноеЛицоОРБ", ТекущийПриказ.ОтветственноеЛицоОРБ);
КонецПроцедуры

&НаКлиенте
Процедура ТекущийПриказОтветственноеЛицоРекламаПриИзменении(Элемент)
	ЗаписатьРеквизит("ОтветственноеЛицоРеклама", ТекущийПриказ.ОтветственноеЛицоРеклама);
КонецПроцедуры

&НаКлиенте
Процедура ТекущийПриказПодписантДолжностьПриИзменении(Элемент)
	ЗаписатьРеквизит("ПодписантДолжность", ТекущийПриказ.ПодписантДолжность);
КонецПроцедуры

&НаКлиенте
Процедура ТекущийПриказПодписантФИОПриИзменении(Элемент)
	ЗаписатьРеквизит("ПодписантФИО", ТекущийПриказ.ПодписантФИО);
КонецПроцедуры

&НаКлиенте
Процедура ТекущийПриказНачальникОДОПриИзменении(Элемент)
	ЗаписатьРеквизит("НачальникОДО", ТекущийПриказ.НачальникОДО);
КонецПроцедуры

&НаКлиенте
Процедура ТекущийПриказНеВыводитьНаПечатьПричиныПримененияПриИзменении(Элемент)
	ЗаписатьРеквизит("НеВыводитьНаПечатьПричиныПрименения", ТекущийПриказ.НеВыводитьНаПечатьПричиныПрименения);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАкцииСтавкиПоШаблону(Команда)  
	ЗаполнитьАкциСтавкиПоНастройкамНаСервере();
КонецПроцедуры  
		
&НаСервере
Процедура ЗаполнитьАкциСтавкиПоНастройкамНаСервере(ВыборАкции = Ложь) 
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ"); 
	
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.Акция) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не выбрана акция!");
		Возврат;
	КонецЕсли;	

		
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", ДокументОбъект.Дата); 
	Запрос.УстановитьПараметр("Акция", ДокументОбъект.Акция);
	Запрос.УстановитьПараметр("ВидШаблона", Перечисления.ЛБ_ВидыОперацийУстановитьШаблонПриказа.ПроцентныеСтавкиАкция);
	МассивЛ = ДокументОбъект.Ломбарды.ВыгрузитьКолонку("Ломбард");  
	МассивЛ.Добавить(Справочники.ЛБ_Ломбарды.ПустаяСсылка());
	Запрос.УстановитьПараметр("Ломбарды", МассивЛ); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_УстановкаОтменаШаблонаПриказаСрезПоследних.ШаблонПриказа КАК ШаблонПриказа,
	               |	ЛБ_УстановкаОтменаШаблонаПриказаСрезПоследних.Отменен КАК Отменен,
	               |	ЛБ_УстановкаОтменаШаблонаПриказаСрезПоследних.Ломбард КАК Ломбард
	               |ИЗ
	               |	РегистрСведений.ЛБ_УстановкаОтменаШаблонаПриказа.СрезПоследних(
	               |			&Дата,
	               |			ВидШаблона = &ВидШаблона
	               |				И Акция = &Акция
	               |				И Ломбард В (&Ломбарды)) КАК ЛБ_УстановкаОтменаШаблонаПриказаСрезПоследних"; 
	ТЗ = Запрос.Выполнить().Выгрузить();   
	ТаблицаРегистраторов = Новый ТаблицаЗначений; 
	ТаблицаРегистраторов.Колонки.Добавить("Ломбард"); 
	ТаблицаРегистраторов.Колонки.Добавить("Регистратор");
	Отбор = Новый Структура;
	Для каждого СтрЛ Из ДокументОбъект.Ломбарды Цикл			
		Отбор.Вставить("Ломбард", СтрЛ.Ломбард); 
		Строки = ТЗ.НайтиСтроки(Отбор);
		Если НЕ Строки.Количество() = 0 Тогда 
			Стр = строки.Получить(0); 
			Если НЕ Стр.Отменен Тогда
				стрР = ТаблицаРегистраторов.Добавить(); 
				СтрР.Ломбард = СтрЛ.Ломбард;
				СтрР.Регистратор = Стр.ШаблонПриказа;			                                        
				Продолжить;
			КонецЕсли;	
		КонецЕсли;
		Отбор.Вставить("Ломбард", Справочники.ЛБ_Ломбарды.ПустаяСсылка());  
		Строки = ТЗ.НайтиСтроки(Отбор);
		Если НЕ Строки.Количество() = 0 Тогда 
			Стр = строки.Получить(0);
			стрР = ТаблицаРегистраторов.Добавить(); 
			СтрР.Ломбард = СтрЛ.Ломбард;
			СтрР.Регистратор = Стр.ШаблонПриказа; 
		Иначе
			стрР = ТаблицаРегистраторов.Добавить(); 
			СтрР.Ломбард = СтрЛ.Ломбард;
		КонецЕсли;	
	КонецЦикла;	   
	
	СписокРегистраторов = Новый СписокЗначений;
	СписокЛомбардовБезШаблона = "";
	Для каждого СтрР Из ТаблицаРегистраторов Цикл  
		Если НЕ ЗначениеЗаполнено(СтрР.Регистратор) Тогда
			СписокЛомбардовБезШаблона = СписокЛомбардовБезШаблона + ?(ПустаяСтрока(СписокЛомбардовБезШаблона), "", ", ") + СокрЛП(СтрР.Ломбард);
		Иначе 
			Если СписокРегистраторов.НайтиПоЗначению(СтрР.Регистратор) = неопределено  Тогда  
				СписокРегистраторов.Добавить(СтрР.Регистратор);
			КонецЕсли;	
		КонецЕсли;	
	Конеццикла;
	
	Если НЕ ПустаяСтрока(СписокЛомбардовБезШаблона) Тогда  
		Если НЕ ВыборАкции Тогда
		    ОбщегоНазначения.СообщитьПользователю("Для ломбардов " + СписокЛомбардовБезШаблона +  " не найдено установленного шаблона по процентым ставкам акции " + СокрЛП(ДокументОбъект.Акция) + ".");  
		КонецЕсли;	
		Возврат; 
	КонецЕсли;
	
	Если СписокРегистраторов.Количество() = 0 Тогда 
		Если НЕ ВыборАкции Тогда
		    ОбщегоНазначения.СообщитьПользователю("Для выбранных ломбардов не найдено установленного шаблона по процентым ставкам акции " + СокрЛП(ДокументОбъект.Акция) + "."); 
		КонецЕсли;	
		Возврат;   
	ИначеЕсли СписокРегистраторов.Количество() > 1 Тогда  
		Если НЕ ВыборАкции Тогда
			ОбщегоНазначения.СообщитьПользователю("Для  выбранных ломбардов найдено " + Строка(СписокРегистраторов.Количество()) + " установленных шаблона по процентым ставкамакции " + СокрЛП(ДокументОбъект.Акция) + ".");
		КонецЕсли;
	Возврат;   	
	КонецЕсли;	

	ТекРегистратор = СписокРегистраторов.Получить(0).Значение;
    Запрос.УстановитьПараметр("Регистратор", ТекРегистратор);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЛБ_ТекущийШаблонПриказаПроцентныеСтавкиАкция.СхемаКредитования КАК СхемаКредитования,
	               |	ЛБ_ТекущийШаблонПриказаПроцентныеСтавкиАкция.ПричинаПрименения КАК ПричинаПрименения,
	               |	ЛБ_ТекущийШаблонПриказаПроцентныеСтавкиАкция.СтатусЗалогодателя КАК СтатусЗалогодателя,
	               |	ЛБ_ТекущийШаблонПриказаПроцентныеСтавкиАкция.ДиапазонСумм КАК ДиапазонСумм,
	               |	ЛБ_ТекущийШаблонПриказаПроцентныеСтавкиАкция.ДиапазонСумм.ПорядокСортировки КАК ДиапазонСуммПорядокСортировки
	               |ИЗ
	               |	РегистрСведений.ЛБ_ТекущийШаблонПриказаПроцентныеСтавкиАкция КАК ЛБ_ТекущийШаблонПриказаПроцентныеСтавкиАкция
	               |ГДЕ
	               |	ЛБ_ТекущийШаблонПриказаПроцентныеСтавкиАкция.Регистратор = &Регистратор
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СхемаКредитования,
	               |	ПричинаПрименения УБЫВ,
	               |	СтатусЗалогодателя,
	               |	ДиапазонСуммПорядокСортировки";
	ТаблицаШаблона = Запрос.Выполнить().Выгрузить();
   	ДокументОбъект.УсловияАкцииСтавки.Очистить(); 
	ТаблицаСтавок = ПолучитьАкцияПроцентныеСтавкиСрезПоследних(ДокументОбъект);

	Для каждого СтрШ Из ТаблицаШаблона Цикл 
		НоваяСтрП = ДокументОбъект.УсловияАкцииСтавки.Добавить();
		НоваяСтрП.СхемаКредитования = СтрШ.СхемаКредитования;
		НоваяСтрП.ПричинаПрименения = СтрШ.ПричинаПрименения;
		НоваяСтрП.СтатусЗалогодателя = СтрШ.СтатусЗалогодателя;
		НоваяСтрП.ДиапазонСумм = СтрШ.ДиапазонСумм; 
		
		Если НЕ ТаблицаСтавок.Количество() = 0 Тогда
			Запрос = Новый Запрос; 
			Запрос.УстановитьПараметр("ТЗ", ТаблицаСтавок);
			Запрос.УстановитьПараметр("ПричинаПрименения", НоваяСтрП.ПричинаПрименения); 
			Запрос.УстановитьПараметр("ДиапазонСумм", НоваяСтрП.ДиапазонСумм);  
			СК = Новый СписокЗначений;
			СК.Добавить(НоваяСтрП.СхемаКредитования);
			СК.Добавить(Справочники.ЛБ_СхемыКредитования.ПустаяСсылка());
			Запрос.УстановитьПараметр("СхемыКредитования", СК); 
			Статусы = Новый СписокЗначений;
			Статусы.Добавить(НоваяСтрП.СтатусЗалогодателя);
			Статусы.Добавить(Справочники.ЛБ_СтатусыЗалогодателей.ПустаяСсылка());
			Запрос.УстановитьПараметр("Статусы", Статусы);
			Запрос.Текст = "ВЫБРАТЬ
			               |	ТЗ.ПричинаПрименения КАК ПричинаПрименения,
			               |	ТЗ.СхемаКредитования КАК СхемаКредитования,
			               |	ТЗ.СтатусЗалогодателя КАК СтатусЗалогодателя,
			               |	ТЗ.ДиапазонСумм КАК ДиапазонСумм,
			               |	ТЗ.Ставка КАК Ставка,
			               |	ТЗ.Отклонение КАК Отклонение,
			               |	ТЗ.ЗначениеОтклонения КАК ЗначениеОтклонения
			               |ПОМЕСТИТЬ Таблица
			               |ИЗ
			               |	&ТЗ КАК ТЗ
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	Таблица.Ставка КАК Ставка,
			               |	Таблица.Отклонение КАК Отклонение,
			               |	Таблица.ЗначениеОтклонения КАК ЗначениеОтклонения
			               |ИЗ
			               |	Таблица КАК Таблица
			               |ГДЕ
			               |	Таблица.ПричинаПрименения = &ПричинаПрименения
			               |	И Таблица.ДиапазонСумм = &ДиапазонСумм
			               |	И Таблица.СхемаКредитования В(&СхемыКредитования)
			               |	И Таблица.СтатусЗалогодателя В(&Статусы)
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	Таблица.СхемаКредитования УБЫВ,
			               |	Таблица.СтатусЗалогодателя УБЫВ"; 
            Выборка = Запрос.Выполнить().Выбрать(); 
			Если Выборка.Следующий() Тогда
				Если НЕ Выборка.ставка = 0 Тогда
				    НоваяСтрП.Ставка = Выборка.ставка;
					НоваяСтрП.УстановитьЗначениеИлиОтклонение = Перечисления.ЛБ_УстановкаЗначенияИлиОтклонения.Значение; 
				Иначе 
					НоваяСтрП.Отклонение = Выборка.Отклонение;  
					НоваяСтрП.ЗначениеОтклонения = Выборка.ЗначениеОтклонения;
					НоваяСтрП.УстановитьЗначениеИлиОтклонение = Перечисления.ЛБ_УстановкаЗначенияИлиОтклонения.Отклонение; 
				КонецЕсли;	
			Иначе   
				НоваяСтрП.УстановитьЗначениеИлиОтклонение = Перечисления.ЛБ_УстановкаЗначенияИлиОтклонения.Значение;
			    НоваяСтрП.Ставка = 0;
			КонецЕсли;
		Иначе  
			НоваяСтрП.УстановитьЗначениеИлиОтклонение = Перечисления.ЛБ_УстановкаЗначенияИлиОтклонения.Значение;
		    НоваяСтрП.Ставка = 0;
		КонецЕсли;	
    Конеццикла;	

	ДокументОбъект.ШаблонАкцииПроцентныеСтавки = ТекРегистратор;
	ДокументОбъект.Записать();     
	СтрокаПриказа = ТаблицаПриказов.НайтиПоИдентификатору(ТекущийПриказИдентификатор);  
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	ПолучитьДополнительныеРеквизиты(СтрокаПриказа);
КонецПроцедуры    

&НаСервере
Процедура ОчиститьСхемуКредитованияНаСервере(СхемаКредитования) 
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");  
	
    ОтборК = Новый Структура;
	ОтборК.Вставить("СхемаКредитования", СхемаКредитования); 
	
	Строки = ДокументОбъект.СтавкиПроцентов.НайтиСтроки(ОтборК);
	Для каждого Стр из Строки цикл   
		ДокументОбъект.СтавкиПроцентов.Удалить(Стр);
	КонецЦикла;	

	Строки = ДокументОбъект.СхемыКредитования.НайтиСтроки(ОтборК);
	Для каждого Стр из Строки цикл   
		ДокументОбъект.СхемыКредитования.Удалить(Стр);
	КонецЦикла;	
	ДокументОбъект.Записать(); 
	ЗаполнитьСписокСК(ДокументОбъект);
	СтрокаПриказа = ТаблицаПриказов.НайтиПоИдентификатору(ТекущийПриказИдентификатор); 
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	ПолучитьДополнительныеРеквизиты(СтрокаПриказа);
КонецПроцедуры	

&НаКлиенте
Процедура СтрокаСКОчистка(Элемент, СтандартнаяОбработка)
	СписокК = Новый списокЗначений;
	Для каждого СтрК Из ТекущийПриказ.СхемыКредитования Цикл
		СписокК.Добавить(СтрК.СхемаКредитования);
	КонецЦикла;                                
	Если СписокК.ОтметитьЭлементы("Выберите для удаления") Тогда 
		Для каждого СК Из СписокК Цикл  
			Если СК.Пометка Тогда 
				ОчиститьСхемуКредитованияНаСервере(СК.Значение);
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПроцентныеСтавкиПоШаблону(Команда)
	Для каждого СтрК Из ТекущийПриказ.СхемыКредитования Цикл 
		ОбработкаВыбораСК(СтрК.СхемаКредитования, Ложь);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ПроставитьПроцентныеСтавкиПоПриказу(Команда)  
	Если НЕ ТекущийПриказ.СтавкиПроцентов.Количество() = 0 Тогда
		ТекЛомбард = ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ПустаяСсылка");
		Если ВвестиЗначение(ТекЛомбард, "Выберите ломбард", Тип("СправочникСсылка.ЛБ_Ломбарды")) Тогда 
			Для каждого СтрК Из ТекущийПриказ.СхемыКредитования Цикл
		        ПроставитьПроцентныеСтавкиПоТекущимНастройкам(СтрК.СхемаКредитования, ТекЛомбард); 
			КонецЦикла;	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ИзменитьЦенуВставкиНаСервере(НомерСтроки, Цена) 
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
    ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ"); 
	СтрВ = ДокументОбъект["ЦеныВставки"].Получить(НомерСтроки); 
	СтрВ.Цена = Цена;
	ДокументОбъект.Записать();
КонецПроцедуры	
	
&НаКлиенте
Процедура ЦеныВставкиЦенаПриИзменении(Элемент)
	ТекСтрока = Элементы.ТекущийПриказЦеныВставки.ТекущиеДанные;
	ИзменитьЦенуВставкиНаСервере(ТекСтрока.НомерСтроки-1, ТекСтрока.Цена);    
КонецПроцедуры

&НаСервере
Процедура ИзменитьЦенуМеталлаНаСервере(НомерСтроки, Цена) 
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
    ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ"); 
	СтрМ = ДокументОбъект["ЦеныМеталлы"].Получить(НомерСтроки); 
	СтрМ.Цена = Цена;   
	ДокументОбъект.БазоваяЦенаМеталлы = Цена;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", ДокументОбъект.ШаблонМеталлы);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ТекущийШаблонПриказаМеталлы.Металл КАК Металл,
	               |	ЛБ_ТекущийШаблонПриказаМеталлы.Проба КАК Проба,
	               |	ЛБ_ТекущийШаблонПриказаМеталлы.Категория КАК Категория,
	               |	ЛБ_ТекущийШаблонПриказаМеталлы.БазоваяНастройка КАК БазоваяНастройка,
	               |	ЛБ_ТекущийШаблонПриказаМеталлы.БазоваяЦена КАК БазоваяЦена,
	               |	ЛБ_ТекущийШаблонПриказаМеталлы.ОклонениеОтБазовой КАК ОклонениеОтБазовой,
	               |	ЛБ_ТекущийШаблонПриказаМеталлы.ЗначениеОтклонения КАК ЗначениеОтклонения,
	               |	ЛБ_ТекущийШаблонПриказаМеталлы.ПорядокОкругления КАК ПорядокОкругления,
	               |	ЛБ_ТекущийШаблонПриказаМеталлы.ОкруглятьВБольшуюСторону КАК ОкруглятьВБольшуюСторону
	               |ИЗ
	               |	РегистрСведений.ЛБ_ТекущийШаблонПриказаМеталлы КАК ЛБ_ТекущийШаблонПриказаМеталлы
	               |ГДЕ
	               |	ЛБ_ТекущийШаблонПриказаМеталлы.Регистратор = &Регистратор";
	ШаблонМеталлов = Запрос.Выполнить().Выгрузить(); 
	
	ЦенаБазовая = Цена;			
	Для каждого Стр Из ШаблонМеталлов Цикл 
		Отбор = Новый Структура;
		Отбор.Вставить("Металл", Стр.Металл); 
		Отбор.Вставить("Проба", Стр.Проба);
		Отбор.Вставить("КатегорияОбъектаЗалога", Стр.Категория);
		СтрокиМ = ДокументОбъект.ЦеныМеталлы.НайтиСтроки(Отбор); 
		Если НЕ СтрокиМ.Количество() = 0 Тогда
			СтрМ = СтрокиМ.Получить(0);
		  	Если Стр.БазоваяНастройка Тогда 
				 СтрМ.Цена = ЦенаБазовая;
			 Иначе
				 Если Стр.ОклонениеОтБазовой = Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Абсолютное Тогда  
					 СтрМ.Цена = ЦенаБазовая + стр.ЗначениеОтклонения;
				 ИначеЕсли Стр.ОклонениеОтБазовой = Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Относительное Тогда
					 СтрМ.Цена = ЦенаБазовая + ЦенаБазовая*стр.ЗначениеОтклонения/100;
				 КонецЕсли;	  
				 Если ЗначениеЗаполнено(Стр.ПорядокОкругления) Тогда     
					 СтрМ.Цена = ЛБ_ОбщийМодуль.ОкруглитьЦену(СтрМ.Цена, Стр.ПорядокОкругления, Стр.ОкруглятьВБольшуюСторону);
				 КонецЕсли;	 
			 КонецЕсли;	 
		КонецЕсли;	 
	КонецЦикла;

	ДокументОбъект.Записать(); 
		
    ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);  
	СтрокаПриказа = ТаблицаПриказов.НайтиПоИдентификатору(ТекущийПриказИдентификатор);
	ПолучитьДополнительныеРеквизиты(СтрокаПриказа);
КонецПроцедуры	

&НаКлиенте
Процедура ЦеныМеталлыЦенаПриИзменении(Элемент)
	ТекСтрока = Элементы.ЦеныМеталлы.ТекущиеДанные;
	ИзменитьЦенуМеталлаНаСервере(ТекСтрока.НомерСтроки-1, ТекСтрока.Цена);  

КонецПроцедуры

&НаКлиенте
Процедура ПросмотрШаблона(Команда) 
	ИмяАктивнойСтраницы = Элементы.Страницы.ТекущаяСтраница.Имя;
	
	Если ИмяАктивнойСтраницы = "ГруппаЦеныМеталлы" Тогда
		Если ЗначениеЗаполнено(ТекущийПриказ.ШаблонМеталлы) Тогда 
			ПараметрыФормы = Новый Структура("Ключ", ТекущийПриказ.ШаблонМеталлы);
			ОткрытьФорму("Документ.ЛБ_УстановитьШаблонПриказа.ФормаОбъекта", ПараметрыФормы); 
		Иначе
			Предупреждение("Шаблон не выбран в приказ", 60);
		КонецЕсли;	   
	ИначеЕсли ИмяАктивнойСтраницы = "ГруппаЦеныВставки" Тогда
		Если ЗначениеЗаполнено(ТекущийПриказ.ШаблонВставки) Тогда 
			ПараметрыФормы = Новый Структура("Ключ", ТекущийПриказ.ШаблонВставки);
			ОткрытьФорму("Документ.ЛБ_УстановитьШаблонПриказа.ФормаОбъекта", ПараметрыФормы);   
		Иначе
			Предупреждение("Шаблон не выбран в приказ", 60);	
		КонецЕсли;	
	ИначеЕсли ИмяАктивнойСтраницы = "ГруппаАкцииСтавки" Тогда 
		Если ЗначениеЗаполнено(ТекущийПриказ.ШаблонАкцииПроцентныеСтавки) Тогда 
			ПараметрыФормы = Новый Структура("Ключ", ТекущийПриказ.ШаблонАкцииПроцентныеСтавки);
			ОткрытьФорму("Документ.ЛБ_УстановитьШаблонПриказа.ФормаОбъекта", ПараметрыФормы);  
		Иначе
			Предупреждение("Шаблон не выбран в приказ", 60);	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦеныМеталлаПоПриказуВЛомбарде(Команда)
	Если НЕ ТекущийПриказ.ЦеныМеталлы.Количество() = 0 Тогда
		ТекЛомбард = ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ПустаяСсылка");
		Если ВвестиЗначение(ТекЛомбард, "Выберите ломбард", Тип("СправочникСсылка.ЛБ_Ломбарды")) Тогда 
		    ПроставитьМеталлыПоТекущимНастройкам(ТекЛомбард); 
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПроставитьМеталлыПоТекущимНастройкам(Ломбард) 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних.Проба.Владелец КАК Металл,
	               |	ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних.Проба КАК Проба,
	               |	ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних.Категория КАК КатегорияОбъектаЗалога,
	               |	ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних.Цена КАК Цена,
	               |	ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПрейскурантЦенНаМеталлы.СрезПоследних(
	               |			&Дата,
	               |			Ломбард = &Ломбард
	               |				И ДатаНачалаДействия < &Дата) КАК ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Металл,
	               |	Проба,
	               |	КатегорияОбъектаЗалога";
	ТаблицаЦен = Запрос.Выполнить().Выгрузить();   
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОтносительныеОтклоненияОтБазовыхЦенМеталлыСрезПоследних.СхемаКредитования КАК СхемаКредитования,
	               |	ЛБ_ОтносительныеОтклоненияОтБазовыхЦенМеталлыСрезПоследних.Металл КАК Металл,
	               |	ЛБ_ОтносительныеОтклоненияОтБазовыхЦенМеталлыСрезПоследних.ПроцентОтклонения КАК ПроцентОтклонения,
	               |	ЛБ_ОтносительныеОтклоненияОтБазовыхЦенМеталлыСрезПоследних.УстанавливатьОтклонение КАК УстанавливатьОтклонение
	               |ИЗ
	               |	РегистрСведений.ЛБ_ОтносительныеОтклоненияОтБазовыхЦенМеталлы.СрезПоследних(&Дата, ) КАК ЛБ_ОтносительныеОтклоненияОтБазовыхЦенМеталлыСрезПоследних";
	ТаблицаНастроек = Запрос.Выполнить().Выгрузить(); 
	ТаблицаСК = ТаблицаНастроек.Скопировать(); 
	ТаблицаСК.Свернуть("СхемаКредитования");

	Если НЕ ТаблицаЦен.Количество() = 0 тогда     
		ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
		ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");
		ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенМеталлы.Очистить();
		
		Для каждого Стр Из ДокументОбъект.ЦеныМеталлы Цикл
			Отбор = новый Структура;
			Отбор.Вставить("Металл", Стр.Металл);
			Отбор.Вставить("Проба", Стр.Проба);
			Отбор.Вставить("КатегорияОбъектаЗалога", Стр.КатегорияОбъектаЗалога);
			 
			СтрокиЦен = ТаблицаЦен.НайтиСтроки(Отбор);
			Если НЕ СтрокиЦен.Количество() = 0 Тогда
				СтрЦ = СтрокиЦен.Получить(0);
				Стр.Цена = СтрЦ.Цена;
			КонецЕсли;	 
			
			Если НЕ ТаблицаСК.Количество() = 0 тогда
				Для каждого СтрК Из ТаблицаСК Цикл
					ОтборН = новый Структура;
					ОтборН.Вставить("СхемаКредитования", СтрК.СхемаКредитования);	
					ОтборН.Вставить("Металл", Стр.Металл);
					СтрокиН = ТаблицаНастроек.НайтиСтроки(ОтборН); 
					Если СтрокиН.Количество() = 0 Тогда 
						ОтборН.Вставить("Металл", Справочники.ЛБ_ДрагоценныеМеталлы.ПустаяСсылка()); 
						СтрокиН = ТаблицаНастроек.НайтиСтроки(ОтборН); 
					КонецЕсли;	
					Если СтрокиН.Количество() = 0 Тогда
						НоваяСтрН = ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенМеталлы.Добавить();
						НоваяСтрН.СхемаКредитования = СтрК.СхемаКредитования; 
						НоваяСтрН.Металл = Стр.Металл;
		                НоваяСтрН.Проба = Стр.Проба;
		                НоваяСтрН.КатегорияОбъектаЗалога = Стр.КатегорияОбъектаЗалога;
                    Иначе 
						Для каждого СтрН Из СтрокиН Цикл  
							НоваяСтрН = ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенМеталлы.Добавить();
							НоваяСтрН.СхемаКредитования = СтрК.СхемаКредитования; 
							НоваяСтрН.Металл = Стр.Металл;
			                НоваяСтрН.Проба = Стр.Проба;
			                НоваяСтрН.КатегорияОбъектаЗалога = Стр.КатегорияОбъектаЗалога;
					        НоваяСтрН.ОтклонениеОтБазовойЦены = СтрН.УстанавливатьОтклонение; 
							Если НоваяСтрН.ОтклонениеОтБазовойЦены = Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Относительное Тогда
	                            НоваяСтрН.ЗначениеОтклонения = СтрН.ПроцентОтклонения;  
							Иначе 
								НоваяСтрН.ЗначениеОтклонения = Стр.Цена*СтрН.ПроцентОтклонения/100 - Стр.Цена;
							КонецЕсли;	
						КонецЦикла;	
					КонецЕсли;	
				Конеццикла;
			КонецЕсли;   
		КонецЦикла;	
		
		ДокументОбъект.Записать();     
		ПолучитьОбъектПриказа(ТекущийПриказИдентификатор); 
		СтрокаПриказа = ТаблицаПриказов.НайтиПоИдентификатору(ТекущийПриказИдентификатор);
		ПолучитьДополнительныеРеквизиты(СтрокаПриказа); 
	КонецЕсли;	
		 
КонецПроцедуры	 

&НаСервере
Процедура СохранитьШаблонВДокументе(ВидШаблона)
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");  
	
	Если ВидШаблона = "Металлы" Тогда 
		ДокументОбъект.ШаблонМеталлы = ПредопределенноеЗначение("Документ.ЛБ_УстановитьШаблонПриказа.ПустаяСсылка"); 
		ДокументОбъект.ЦеныМеталлы.Очистить(); 
	    ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенМеталлы.Очистить();	
	ИначеЕсли ВидШаблона = "Вставки" Тогда
		ДокументОбъект.ШаблонВставки = ПредопределенноеЗначение("Документ.ЛБ_УстановитьШаблонПриказа.ПустаяСсылка");
		ДокументОбъект.ЦеныВставки.Очистить(); 
	ИначеЕсли ВидШаблона = "АкцииСтавки" Тогда
		ДокументОбъект.ШаблонАкцииПроцентныеСтавки = ПредопределенноеЗначение("Документ.ЛБ_УстановитьШаблонПриказа.ПустаяСсылка");  
		ДокументОбъект.УсловияАкцииСтавки.Очистить(); 
	КонецЕсли;
	ДокументОбъект.Записать(); 
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	СтрокаПриказа = ТаблицаПриказов.НайтиПоИдентификатору(ТекущийПриказИдентификатор);
	ПолучитьДополнительныеРеквизиты(СтрокаПриказа);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьШаблон(Команда)
	ИмяАктивнойСтраницы = Элементы.Страницы.ТекущаяСтраница.Имя;
	
	Если ИмяАктивнойСтраницы = "ГруппаЦеныМеталлы" Тогда
		Если ЗначениеЗаполнено(ТекущийПриказ.ШаблонМеталлы) Тогда
			ТекущийПриказ.ШаблонМеталлы = ПредопределенноеЗначение("Документ.ЛБ_УстановитьШаблонПриказа.ПустаяСсылка"); 
			СохранитьШаблонВДокументе("Металлы");
		КонецЕсли;	   
	ИначеЕсли ИмяАктивнойСтраницы = "ГруппаЦеныВставки" Тогда
		ТекущийПриказ.ШаблонВставки = ПредопределенноеЗначение("Документ.ЛБ_УстановитьШаблонПриказа.ПустаяСсылка");  
		СохранитьШаблонВДокументе("Вставки");
	ИначеЕсли ИмяАктивнойСтраницы = "ГруппаАкцииСтавки" Тогда 
		ТекущийПриказ.ШаблонАкцииПроцентныеСтавки = ПредопределенноеЗначение("Документ.ЛБ_УстановитьШаблонПриказа.ПустаяСсылка"); 
		СохранитьШаблонВДокументе("АкцииСтавки");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрШаблонаПоТекущейСК(Команда)
	ТекСтрока = Элементы.ТаблицаСтавок.ТекущиеДанные;
	Если ТекСтрока = неопределено Тогда
		Возврат;
	КонецЕсли;
	Отбор = Новый Структура;
	Отбор.Вставить("СхемаКредитования", ТекСтрока.СхемаКредитования); 
	Строки = ТекущийПриказ.СхемыКредитования.НайтиСтроки(Отбор);
	Если НЕ Строки.Количество() = 0 Тогда 
		ПриказСтавки = Строки.Получить(0).ШаблонПроцентныеСтавки;
		Если ЗначениеЗаполнено(ПриказСтавки) Тогда 
			ПараметрыФормы = Новый Структура("Ключ", ПриказСтавки);
			ОткрытьФорму("Документ.ЛБ_УстановитьШаблонПриказа.ФормаОбъекта", ПараметрыФормы);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры











 
 




