
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;   
	Если УправлениеДоступом.ЕстьРоль("ЛБ_Суперпользователь") Тогда 
		ЭтоСуперпользователь = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда		 
		Объект.Дата = ТекущаяДатаСеанса(); 
		Объект.Ответственный = ТекПользователь;
		Если Параметры.Свойство("СхемаКредитования") Тогда  
			Объект.СхемаКредитования = Параметры.СхемаКредитования; 
			Элементы.СхемаКредитования.ТолькоПросмотр = Истина;
		КонецЕсли;
		Если Параметры.Свойство("ДокументКопирования") Тогда
			ЗаполнитьДокументКопированием(Параметры.ДокументКопирования);
			Элементы.СхемаКредитования.ТолькоПросмотр = Истина;
		КонецЕсли;	
	КонецЕсли;    
		
	УстановитьСостояниеДокумента(); 
	
	Если Объект.Проведен Тогда  
		ЭтаФорма.ТолькоПросмотр = Истина;  
		Элементы.Ссуда.ТолькоПросмотр = Истина;
		Элементы.ТехническиеСтавки.ТолькоПросмотр = Истина;
	КонецЕсли;	
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);

КонецПроцедуры   

&НаСервере
Процедура ЗаполнитьДокументКопированием(ДокументКопирования) 
	Объект.СрокЗалога = ДокументКопирования.СрокЗалога;
	Объект.СхемаКредитования = ДокументКопирования.СхемаКредитования;
	Объект.УчастиеВРасчетах = ДокументКопирования.УчастиеВРасчетах;  
	Объект.Ссуда.Загрузить(ДокументКопирования.Ссуда.Выгрузить()); 
	Объект.ТехническиеСтавки.Загрузить(ДокументКопирования.ТехническиеСтавки.Выгрузить());

КонецПроцедуры	

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект);
	
КонецПроцедуры          


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если НЕ ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда 
		Если НЕ НачалоДня(ТекущийОбъект.Дата) = НачалоДня(ТекущаяДатаСеанса()) Тогда
			Если НЕ ЭтоСуперпользователь Тогда 
				 Сообщить("Пользователь имеет право проводить документ только текущей датой. Измените дату документа.", статуссообщения.Важное);
			     Отказ = Истина;
				 Возврат;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	// Вставить содержимое обработчика.
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры   

&НаКлиенте
Процедура СсудаСтатусЗалогодателяОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	Отбор = новый Структура;
	Отбор.Вставить("СтатусЗалогодателя", ВыбранноеЗначение); 
	Строки = Объект.Ссуда.НайтиСтроки(Отбор);
	Если Строки.Количество() > 0 Тогда
		Предупреждение("Статус " + СокрЛП(ВыбранноеЗначение) + " уже добавлен в таблицу!", 60);
	    ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.ЛБ_СтатусыЗалогодателей.ПустаяСсылка");  
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТехническиеСтавкиДеньНачалаПримененияОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Отбор = новый Структура;
	Отбор.Вставить("ДеньНачалаПрименения", число(Текст)); 
	Строки = Объект.ТехническиеСтавки.НайтиСтроки(Отбор);
	Если Строки.Количество() > 0 Тогда
		Предупреждение("В таблицу уже добавлена строка с днем начала примения технической ставки " + СокрЛП(Текст) + "!", 60);
	    Элементы.ТехническиеСтавки.ТекущиеДанные.ДеньНачалаПрименения = 0;  
	КонецЕсли;
КонецПроцедуры
