&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ПКО") тогда
		Объект.ПКО = Параметры.ПКО;  
		Объект.Организация = Объект.ПКО.Организация;
		Объект.Ломбард = Объект.ПКО.Ломбард;
	КонецЕсли;	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда  
		Объект.Организация = ?(Не ЗначениеЗаполнено(Объект.Организация), Константы.ЛБ_ОсновнаяОрганизация.Получить(), Объект.Организация);  
		ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
		Если НЕ ЗначениеЗаполнено(Объект.Ломбард) Тогда
		    Объект.Ломбард = ЛБ_ОбщийМодуль.ПолучитьЛомбардПользователя(ТекПользователь); 
		КонецЕсли;	
		Объект.Дата = ТекущаяДатаСеанса();
		Если НЕ ТекПользователь.ЭтоЛомбард Тогда
       		Объект.Ответственный = ТекПользователь;
		Иначе
			Объект.Ответственный = ПараметрыСеанса.ТекущийСотрудник;
		КонецЕсли;	  
	Иначе
		Элементы.Дата.ТолькоПросмотр = Истина;
		ЭтаФорма.ИспользоватьРежимПроведения = ИспользованиеРежимаПроведения.Неоперативный;
	КонецЕсли;	             
	Если ЗначениеЗаполнено(Объект.ПКО) Тогда
		Объект.ВидОперации = "Отмена: " + Строка(Объект.ПКО.ВидОперации);
        ЗаполнитьИнформациюПКО();   
	КонецЕсли;	       
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект); 
	УстановитьВидимость(); 
	ДатаДок = Объект.Дата;
КонецПроцедуры 

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


&НаСервере
Процедура УстановитьВидимость()
	Если ЗначениеЗаполнено(Объект.ПКО) Тогда
        Элементы.ГруппаИнф.Видимость = Истина; 
		ЭтаФорма.Заголовок = "Отмена операции ПКО № " + СокрЛП(Объект.ПКО.ПредставлениеНомераПКО) + " от " + Формат(Объект.Дата, "ДЛФ=DT");
	Иначе
		Элементы.ГруппаИнф.Видимость = Ложь;
		ЭтаФорма.Заголовок = "Отмена операции ПКО";
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Не ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда  
		ТекущийОбъект.Дата = ТекущаяДата();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПКО(Команда)                
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Ломбард", Объект.Ломбард);
	ПараметрыОтбора.Вставить("Организация", Объект.Организация);  
	ПараметрыОтбора.Вставить("Проведен", Истина);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора); ///Добавляем отбор в параметры формы
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораПКО", ЭтаФорма);
	ОткрытьФорму("Документ.ЛБ_ПриходныйКассовыйОрдер.ФормаВыбора", ПараметрыФормы,ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Функция ДокументПроведен(Документ)
	Возврат ?(Документ.Проведен, Истина, Ложь);
КонецФункции	

&НаСервере
Процедура ПослеВыбораПКО(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;	 
	
	Объект.ПКО = Результат; 
	Объект.ВидОперации = "Отмена: " + Строка(Объект.ПКО.ВидОперации);
	ЗаполнитьИнформациюПКО(); 
	УстановитьВидимость();  
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнформациюПКО() 
	ПКОНомер = "Приходный кассовый ордер № " + СокрЛП(Объект.ПКО.ПредставлениеНомераПКО) + " от " + Формат(Объект.ПКО.Дата, "ДЛФ=DT");
	ПКОВидОперации = "Операция: " + Строка(Объект.ПКО.ВидОперации);  
	ПКООснование = "Основание: " + СокрЛП(Объект.ПКО.Основание);
	ПКОФИО = "Принято от: " + СокрЛП(Объект.ПКО.ПринятоОт);
	ПКОСумма = "Сумма: " + Формат(Объект.ПКО.Сумма, "ЧЦ=15; ЧДЦ=2; ЧН=0,00; ЧФ='Ч руб.'");
КонецПроцедуры	


&НаКлиенте
Процедура ОткрытьПКО(Команда)
    Если ЗначениеЗаполнено(Объект.ПКО) Тогда
		ПараметрыФормы = Новый Структура("Ключ", Объект.ПКО);
		ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
		ОткрытьФорму("Документ.ЛБ_ПриходныйКассовыйОрдер.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры





