// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	Движения.ЛБ_ПредельныеСуммыДляИдентификацииКлиента.Записывать = Истина;
		
	Для каждого Стр Из ЭтотОбъект.ПредельныеСуммы Цикл
		Если НЕ Стр.Использовать Тогда
			Продолжить;
		КонецЕсли;	
		Движение = Движения.ЛБ_ПредельныеСуммыДляИдентификацииКлиента.Добавить();
		Движение.Период = Дата; 
		Движение.СпособОплаты = Стр.СпособОплаты;
		Движение.ПредельнаяСумма = стр.ПредельнаяСумма; 
	Конеццикла;		
КонецПроцедуры

