
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Документ") Тогда
		Приказ = Параметры.Документ.Ссылка;  
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Приказ) Тогда 
		Сообщить("Не выбран приказ!");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТаблицыИзПриказа();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицыИзПриказа() 
	КлючСтроки = 0;
	ТаблицаДоп = Приказ.СтавкиПроцентов.Выгрузить(); 
	ТаблицаДоп.Свернуть("СхемаКредитования, ПричинаПрименения, СтатусЗалогодателя");
	Для каждого Стр Из ТаблицаДоп Цикл
		КлючСтроки = КлючСтроки + 1;
		НоваяСтр1 = ТаблицаСК.Добавить();
		НоваяСтр1.КлючСтроки = КлючСтроки; 
		НоваяСтр1.СхемаКредитования = Стр.СхемаКредитования; 
		НоваяСтр1.ПричинаПрименения = Стр.ПричинаПрименения;
		НоваяСтр1.СтатусЗалогодателя = Стр.СтатусЗалогодателя;
		
		Отбор = Новый Структура;
		Отбор.Вставить("СхемаКредитования", Стр.СхемаКредитования);
		Отбор.Вставить("ПричинаПрименения", Стр.ПричинаПрименения);
		Отбор.Вставить("СтатусЗалогодателя", Стр.СтатусЗалогодателя);
		Строки = Приказ.СтавкиПроцентов.НайтиСтроки(Отбор); 
		Для каждого СтрС Из Строки Цикл  
			НоваяСтр2 = ТаблицаСтавок.Добавить(); 
			НоваяСтр2.КлючСтроки = КлючСтроки;  
			НоваяСтр2.ДиапазонСумм = СтрС.ДиапазонСумм;
			НоваяСтр2.СхемаРасчетаПроцентов = СтрС.СхемаРасчетаПроцентов;
			НоваяСтр2.Ставка = СтрС.Ставка;
		Конеццикла;	
	Конеццикла;	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзменения(Команда)
	СохранитьПриказ();
	ЭтаФорма.Закрыть(Истина);
КонецПроцедуры

&НаСервере
Процедура СохранитьПриказ() 
	ДокументОбъект = Приказ.ПолучитьОбъект();
	Для каждого Стр Из ТаблицаСК Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("СхемаКредитования", Стр.СхемаКредитования);
		Отбор.Вставить("ПричинаПрименения", Стр.ПричинаПрименения);
		Отбор.Вставить("СтатусЗалогодателя", Стр.СтатусЗалогодателя);
		
		ОтборК = Новый Структура;
		ОтборК.Вставить("КлючСтроки", Стр.КлючСтроки);
		СтрокиК = ТаблицаСтавок.НайтиСтроки(ОтборК);
		Для каждого СтрК Из СтрокиК Цикл
			Отбор.Вставить("ДиапазонСумм", СтрК.ДиапазонСумм);
			Строки = ДокументОбъект.СтавкиПроцентов.Найтистроки(Отбор);
			Если НЕ Строки.Количество() = 0 Тогда
				СтрДок = Строки.Получить(0); 
				СтрДок.СхемаРасчетаПроцентов = СтрК.СхемаРасчетаПроцентов; 
				СтрДок.Ставка = СтрК.Ставка;
			КонецЕсли;	
		КонецЦикла;
	КонецЦикла;	  
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСКПриАктивизацииСтроки(Элемент)
	СтрокаТабличнойЧасти = Элементы.ТаблицаСК.ТекущиеДанные;	
	
	Если СтрокаТабличнойЧасти <> неопределено Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",СтрокаТабличнойЧасти.КлючСтроки);
		Элементы.ТаблицаСтавок.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);				
	Иначе
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",0);
		Элементы.ТаблицаСтавок.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСтавокПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	СтрокаТабличнойЧасти = Элементы.ТаблицаСК.ТекущиеДанные;	
	
	Если СтрокаТабличнойЧасти <> неопределено Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",СтрокаТабличнойЧасти.КлючСтроки);
		Элементы.ТаблицаСтавок.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);				
	Иначе
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",0);
		Элементы.ТаблицаСтавок.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
	КонецЕсли;
КонецПроцедуры

