
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ОПИСАНИЕ ПЕРЕМЕННЫХ
#Область ОписаниеПеременных

	

#КонецОбласти

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	текОтборЗБ = "Все"; //+++ Моисеев 20250610
	Попытка
		Если ЗначениеЗаполнено(ПараметрыСеанса.ТекущийЛомбард) Тогда
			Элементы.БилетыКомандаЗалоговыеБилетыОтборВЛомбарде.Заголовок = "В ломбарде №" + ПараметрыСеанса.ТекущийЛомбард.НомерЛомбарда;
		КонецЕсли;
	Исключение	
	КонецПопытки;
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеФормойНаКлиенте();
	
	УстановитьНастройкиНаКлиенте();
	
	ИнтервалОбновленияОстатковДС = 60;
	//ПодключитьОбработчикОжидания("Подключаемый_ОбновитьРеквизитыДенежныхСредств", ИнтервалОбновленияОстатковДС, Ложь);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЗавершениеРаботы Тогда
		//СохранитьНастройкиНаСервере();
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	//Если ИмяСобытия = "Запись_НаборКонстант" Тогда
	//	
	//	Если Источник = "АКСЛМБВестиУчетЗаймов" Или Источник = "АКСЛМБВестиУчетИмуществаНаХранении" Тогда
	//		УправлениеФормойНаКлиенте();
	//		УстановитьНастройкиНаКлиенте();
	//	КонецЕсли;
	//	
	//ИначеЕсли ИмяСобытия = "АКСЛМБИзменениеЦветовСостоянийЗалоговыхБилетов" Тогда
	//	
	//	Элементы.ЗалоговыеБилеты.Обновить();
	//	
	//КонецЕсли;
	//
	
КонецПроцедуры

#КонецОбласти

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Процедура ЗаполнитьСтатусыКлиентаСервер()
	СтатусыКлиента.Очистить();
	СтрокаПоСистемеЛояльности = СтатусыКлиента.Добавить();
	СтрокаПоСистемеЛояльности.ВидСтатуса = "по системе лояльности";
	СтрокаПоСистемеЛояльности.Значение = ЛБ_УправлениеЛомбардом.ПолучитьТекущийСтатусКлиента(ТекущаяДата(), Объект.Залогодатель);
	
	//дополнительные статусы
	строкаДополнительныеСтатусы = "";
	результатВИП = ПроверитьСтатусКлиентаВИП(ТекущаяДата(), Объект.Залогодатель);
	Если результатВИП.Используется Тогда 
		строкаДополнительныеСтатусы = строкаДополнительныеСтатусы + ?(ЗначениеЗаполнено(строкаДополнительныеСтатусы), ",", "") + "ВИП";
	КонецЕсли;
	ДопСтатусы = ЗаполнитьТаблицуВыбораДопСтатусовКлиента();
	строкаДополнительныеСтатусы = строкаДополнительныеСтатусы + ДопСтатусы;
	Если ЗначениеЗаполнено(СокрЛП(строкаДополнительныеСтатусы)) Тогда 
		новстрокаДополнительныеСтатусы = СтатусыКлиента.Добавить();
		новстрокаДополнительныеСтатусы.ВидСтатуса = "дополнительный статус";
		новстрокаДополнительныеСтатусы.Значение = СокрЛП(строкаДополнительныеСтатусы);
	КонецЕсли;
	
	СлужебныеСтатусы = ЗаполнитьТаблицуВыбораСлужебныхСтатусовКлиента();
	Если ЗначениеЗаполнено(СокрЛП(СлужебныеСтатусы)) Тогда
		новСтрокаСлужебныеСтатусы = СтатусыКлиента.Добавить();
		новСтрокаСлужебныеСтатусы.ВидСтатуса = "служебный статус";
		новСтрокаСлужебныеСтатусы.Значение = СокрЛП(СлужебныеСтатусы);
	КонецЕсли;
	
	КомплаенсСтатусы = ПроверитьПоПеречням();
	Если ЗначениеЗаполнено(СокрЛП(КомплаенсСтатусы)) Тогда 
		новСтрокаСлужебныеСтатусы = СтатусыКлиента.Добавить();
		новСтрокаСлужебныеСтатусы.ВидСтатуса = "комплаенс статус";
		новСтрокаСлужебныеСтатусы.Значение = СокрЛП(КомплаенсСтатусы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗалогодательПриИзменении(Элемент)
	
	//УстановитьКонтрагентаПоЗалогодателю();
	
	//УстановитьПараметрыВыбораЗалоговогоБилета();
	//УстановитьОтборПоЗалогодателю();
	//ОбновитьРеквизитыЗалогодателя();
	//
	//ОбновитьРеквизитыСтатистикиЗаймов();
	//
	//ОбновитьВыбранныеЗалоговыеБилеты();
	//УстановитьНачальныеЗначенияРеквизитовЗадолженности();
	//УстановитьДанныеЗаголовкаЗадолженностиНаДату();
	//
	
	//получаем Статус клиента
	Если ЗначениеЗаполнено(Объект.Залогодатель) Тогда
		ЗаполнитьСтатусыКлиентаСервер();
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Залогодатель) Тогда 
		Объект.ЗалоговыйБилет = Неопределено;
	КонецЕсли;     
	ВывестиБилетыСОтбором();
	
    // ++ Сербаев 28.06.2023
	Если Элементы.Билеты.ТекущиеДанные = Неопределено Тогда
		Если Билеты.Количество() > 0 Тогда
		    Элементы.Билеты.ТекущаяСтрока = Билеты.Получить(0).ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
    // -- Сербаев 28.06.2023
	
	ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры  

&НаСервере
Процедура ВывестиБилетыСОтбором()
	Если Не ЗначениеЗаполнено(Объект.Залогодатель) и Не ЗначениеЗаполнено(Объект.ЗалоговыйБилет) Тогда
		Билеты.Очистить();
		ОперацииЗБ.Очистить();
		Возврат;
	КонецЕсли;
	
	
    // ++ Сербаев 27.06.2023 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОперацияПоЗалогу.Ссылка КАК ОперацияПоЗалогу,
	               |	ЛБ_ОперацияПоЗалогу.НомерЗалоговогоБилета КАК Номер,
	               |	ЛБ_ОперацияПоЗалогу.СуммаСсуды КАК СуммаЗайма,
	               |	ВложенныйЗапрос.СтатусЗалоговогоБилета КАК Статус,
					|	ЛБ_ОперацияПоЗалогу.СхемаКредитования КАК СхемаКредитования0,
					|	ЛБ_ОперацияПоЗалогу.СрокЗалога КАК СрокЗалога,
					|	ВЫБОР
					|		КОГДА ЛБ_ОперацияПоЗалогу.СхемаКредитования.ПризнакПримененияГибкогоПроцента = ИСТИНА
					|			ТОГДА ЛБ_ОперацияПоЗалогу.СхемаКредитования.НаименованиеКраткое
					|		ИНАЧЕ ""Фиксир-я""
					|	КОНЕЦ КАК СхемаКредитования,
					|	РАЗНОСТЬДАТ(ЛБ_ОперацияПоЗалогу.Дата, &ТекДата, ДЕНЬ) КАК СрокЗаймаТекущий,
					|	ЛБ_ОперацияПоЗалогу.Дата КАК ДатаПриема,
					|	ВложенныйЗапрос.ДатаВыкупа КАК СрокВозврата,
					|	ВложенныйЗапрос.ДатаВыкупаЛьготныйСрок КАК СрокЛьготный,
	               |	ЛБ_ОперацияПоЗалогу.Ломбард.НомерЛомбарда КАК НомерЛомбарда
	               |ИЗ
	               |	Документ.ЛБ_ОперацияПоЗалогу КАК ЛБ_ОперацияПоЗалогу
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета,
	               |			ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
					|			ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаВыкупа КАК ДатаВыкупа,
					|			ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаВыкупаЛьготныйСрок КАК ДатаВыкупаЛьготныйСрок
	               |		ИЗ
	               |			РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних) КАК ВложенныйЗапрос
	               |		ПО ЛБ_ОперацияПоЗалогу.Ссылка = ВложенныйЗапрос.ЗалоговыйБилет
	               |ГДЕ
	               |	ЛБ_ОперацияПоЗалогу.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог)
	               |	И 100 = 100
	               |	И 200 = 200
	               |	И 300 = 300
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЛБ_ДоверенностиСрезПоследних.Доверенность КАК Доверенность,
	               |	ЛБ_ДоверенностиСрезПоследних.ЗалоговыйБилет КАК ОперацияПоЗалогу,
	               |	ЛБ_ДоверенностиСрезПоследних.Доверенность.СрокДействияДоверенности КАК СрокДействия,
	               |	ЛБ_ДоверенностиСрезПоследних.СтатусДоверенности КАК СтатусДоверенности
	               |ИЗ
	               |	РегистрСведений.ЛБ_Доверенности.СрезПоследних(
	               |			,
	               |			Доверенность.СрокДействияДоверенности >= &ТекДата
	               |				И 111 = 111
	               |				И 222 = 222) КАК ЛБ_ДоверенностиСрезПоследних"; 
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ВЫРАЗИТЬ(ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.Регистратор КАК Документ.ЛБ_ОперацияПоЗалогу).Ссылка КАК ОперацияПоЗалогу,
	//	|	ВЫРАЗИТЬ(ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.Регистратор КАК Документ.ЛБ_ОперацияПоЗалогу).НомерЗалоговогоБилета КАК Номер,
	//	|	ВЫРАЗИТЬ(ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.Регистратор КАК Документ.ЛБ_ОперацияПоЗалогу).СуммаСсуды КАК СуммаЗайма,
	//	|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК Статус
	//	|ИЗ
	//	|	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(
	//	|			&ТекДата,
	//	|			ЗалоговыйБилет.ВидОперации = &ВидОперации
	//	|				И 100 = 100
	//	|				И 200 = 200) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ЛБ_ДоверенностиСрезПоследних.Доверенность КАК Доверенность,
	//	|	ЛБ_ДоверенностиСрезПоследних.ЗалоговыйБилет КАК ОперацияПоЗалогу,
	//	|	ЛБ_ДоверенностиСрезПоследних.Доверенность.СрокДействияДоверенности КАК СрокДействия,
	//	|	ЛБ_ДоверенностиСрезПоследних.СтатусДоверенности КАК СтатусДоверенности
	//	|ИЗ
	//	|	РегистрСведений.ЛБ_Доверенности.СрезПоследних(
	//	|			&ТекДата,
	//	|			Доверенность.СрокДействияДоверенности >= &ТекДата
	//	|				И 111 = 111
	//	|				И 222 = 222) КАК ЛБ_ДоверенностиСрезПоследних";
	
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог);
	// -- Сербаев 27.06.2023
	
	//+++ Моисеев 20250610
	Если текОтборЗБ = "Все" Тогда
		//нечего добавить
	ИначеЕсли текОтборЗБ = "Действующие" Тогда
		//при нажатии кнопки «Все действующие» - билеты в статусах «Принят», «Перезалог» и «Вкл. в накл.»
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "300 = 300", "ВложенныйЗапрос.СтатусЗалоговогоБилета В(&СтатусЗалоговогоБилетаДействует)");
		СписокСтатусовДействует = Новый СписокЗначений();
		СписокСтатусовДействует.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Оформлен);	//принят
		СписокСтатусовДействует.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Продлен);	//перезалог
		СписокСтатусовДействует.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ВключенВНакладную);
		Запрос.УстановитьПараметр("СтатусЗалоговогоБилетаДействует", СписокСтатусовДействует);
	ИначеЕсли текОтборЗБ = "ВЛомбарде" Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "300 = 300", "ЛБ_ОперацияПоЗалогу.Ломбард = &Ломбард");
		Попытка
			//ПараметрыСеанса.ТекущийЛомбард инициализируется пр входе под пользователем ломбард ##...
			Запрос.УстановитьПараметр("Ломбард", ПараметрыСеанса.ТекущийЛомбард);
		Исключение
			Запрос.УстановитьПараметр("Ломбард", Справочники.ЛБ_Ломбарды.ПустаяСсылка());
		КонецПопытки;
	КонецЕсли;
	//--- Моисеев 20250610
	
	Если ЗначениеЗаполнено(Объект.Залогодатель) Тогда
		//Запрос.Текст = СтрЗаменить(Запрос.Текст, "100 = 100", " ЛБ_ОперацияПоЗалогу.Залогодатель = &Залогодатель");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "100 = 100", " Залогодатель = &Залогодатель");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "111 = 111", " ЗалоговыйБилет.Залогодатель = &Залогодатель");
		Запрос.УстановитьПараметр("Залогодатель", Объект.Залогодатель);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ЗалоговыйБилет)
		И текОтборЗБ = "Один"	//+++ Моисеев 20250611
		Тогда 
		//Запрос.Текст = СтрЗаменить(Запрос.Текст, "200 = 200", " ЛБ_ОперацияПоЗалогу.НомерЗалоговогоБилета = &Номер");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "200 = 200", " НомерЗалоговогоБилета = &Номер");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "222 = 222", " ЗалоговыйБилет.НомерЗалоговогоБилета = &Номер");

		Запрос.УстановитьПараметр("Номер", Объект.ЗалоговыйБилет);
	КонецЕсли; 
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	
	Результат = Запрос.ВыполнитьПакет();
	
	тз = Результат[0].Выгрузить(); 	
	тзДоверкиРез = Результат[1].Выгрузить();
	
	ПараметрыОтбора = Новый Структура("СтатусДоверенности",Перечисления.ЛБ_СтатусыДоверенностей.ДоверенностьОформлена);
	тзДоверки = тзДоверкиРез.Скопировать(ПараметрыОтбора); 
	
	тз.Колонки.Добавить("Доверенность", Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("ВидСрокЗайма", Новый ОписаниеТипов("Строка"));
	
	Для каждого стр из тз Цикл
		печДоверка = "";
		Если ЗначениеЗаполнено(стр.ОперацияПоЗалогу.ПредыдущаяОперация) Тогда
			НайдСтроки = тзДоверки.НайтиСтроки(Новый Структура("ОперацияПоЗалогу", стр.ОперацияПоЗалогу.ПредыдущаяОперация));	
		Иначе
			НайдСтроки = тзДоверки.НайтиСтроки(Новый Структура("ОперацияПоЗалогу", стр.ОперацияПоЗалогу));
		КонецЕсли;
		Для каждого строчка из НайдСтроки Цикл
			печДоверка = печДоверка + "Доверенность до " + Формат(строчка.СрокДействия,"ДФ=dd.MM.yyyy")+"; ";
		КонецЦикла;
		
		печДоверка = Лев(печДоверка, СтрДлина(печДоверка)-2);
		
		стр.Доверенность = печДоверка;
		
		Если ЗначениеЗаполнено(стр.СхемаКредитования0) Тогда
			стрНаименованиеСхемы = стр.СхемаКредитования0.Наименование;
			позКонецНазвания = СтрНайти(стрНаименованиеСхемы, "(");
			Если позКонецНазвания = 0 Тогда
				позКонецНазвания = СтрНайти(стрНаименованиеСхемы, " ");
			КонецЕсли;
			Если позКонецНазвания > 0 Тогда 
				стрНаименованиеСхемы = Лев(стрНаименованиеСхемы, позКонецНазвания-1);
			КонецЕсли;
			стрНаименованиеСхемы = стрНаименованиеСхемы + "/" + стр.СрокЗалога;
			стр.ВидСрокЗайма = стрНаименованиеСхемы;
		 КонецЕсли;
	КонецЦикла;
	
	Билеты.Загрузить(тз); 
	
	Если ЗначениеЗаполнено(Объект.ЗалоговыйБилет) И Не ЗначениеЗаполнено(Объект.Залогодатель) Тогда
		Если тз.Количество() > 0 Тогда
			Объект.Залогодатель	= тз[0].ОперацияПоЗалогу.Залогодатель;
		КонецЕсли;
	КонецЕсли;

	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОперацияПоЗалогу.Ссылка КАК ОперацияПоЗалогу,
	               |	ЛБ_ОперацияПоЗалогу.НомерЗалоговогоБилета КАК ЗалоговыйБилет,
	               |	ЛБ_ОперацияПоЗалогу.Номер КАК Номер,
	               |	ЛБ_ОперацияПоЗалогу.Дата КАК Дата,
	               |	ЛБ_ОперацияПоЗалогу.ВидОперации КАК ВидОперации,
				   |	ВЫБОР
	               |		КОГДА ЛБ_ОперацияПоЗалогу.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог)
	               |			ТОГДА ЛБ_ОперацияПоЗалогу.СуммаСсуды
	               |		ИНАЧЕ ЛБ_ОперацияПоЗалогу.СуммаОплаты
	               |	КОНЕЦ КАК Сумма
	               |ИЗ
	               |	Документ.ЛБ_ОперацияПоЗалогу КАК ЛБ_ОперацияПоЗалогу
	               |ГДЕ ИСТИНА
				   |	И 100 = 100
	               |	И 200 = 200
	              // |	ЛБ_ОперацияПоЗалогу.Залогодатель = &Залогодатель
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата";  
	
	Если ЗначениеЗаполнено(Объект.Залогодатель) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "100 = 100", " ЛБ_ОперацияПоЗалогу.Залогодатель = &Залогодатель");
		Запрос.УстановитьПараметр("Залогодатель", Объект.Залогодатель);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ЗалоговыйБилет) Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "200 = 200", " ЛБ_ОперацияПоЗалогу.НомерЗалоговогоБилета = &Номер");
		Запрос.УстановитьПараметр("Номер", Объект.ЗалоговыйБилет);
	КонецЕсли; 
	
	тз = Запрос.Выполнить().Выгрузить();  
	ОперацииЗБ.Загрузить(тз); 
	
КонецПроцедуры

&НаСервере
Процедура ВывестиБилетыОтборПоЗБ() 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОперацияПоЗалогу.Ссылка КАК ОперацияПоЗалогу,
	               |	ЛБ_ОперацияПоЗалогу.НомерЗалоговогоБилета КАК Номер,
	               |	ЛБ_ОперацияПоЗалогу.СуммаСсуды КАК СуммаЗайма,
	               |	ВложенныйЗапрос.СтатусЗалоговогоБилета КАК Статус
	               |ИЗ
	               |	Документ.ЛБ_ОперацияПоЗалогу КАК ЛБ_ОперацияПоЗалогу
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета,
	               |			ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет
	               |		ИЗ
	               |			РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних) КАК ВложенныйЗапрос
	               |		ПО ЛБ_ОперацияПоЗалогу.Ссылка = ВложенныйЗапрос.ЗалоговыйБилет
	               |ГДЕ
	               |	ЛБ_ОперацияПоЗалогу.НомерЗалоговогоБилета = &Номер
	               |	И ЛБ_ОперацияПоЗалогу.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог)"; 
	
	Запрос.УстановитьПараметр("Номер", Объект.ЗалоговыйБилет); 
	тз = Запрос.Выполнить().Выгрузить();	
	Билеты.Загрузить(тз);   
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОперацияПоЗалогу.Ссылка КАК ОперацияПоЗалогу,
	               |	ЛБ_ОперацияПоЗалогу.НомерЗалоговогоБилета КАК ЗалоговыйБилет,
	               |	ЛБ_ОперацияПоЗалогу.Номер КАК Номер,
	               |	ЛБ_ОперацияПоЗалогу.Дата КАК Дата,
	               |	ЛБ_ОперацияПоЗалогу.ВидОперации КАК ВидОперации,
	               |	ВЫБОР
	               |		КОГДА ЛБ_ОперацияПоЗалогу.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог)
	               |			ТОГДА ЛБ_ОперацияПоЗалогу.СуммаСсуды
	               |		ИНАЧЕ ЛБ_ОперацияПоЗалогу.СуммаОплаты
	               |	КОНЕЦ КАК Сумма
	               |ИЗ
	               |	Документ.ЛБ_ОперацияПоЗалогу КАК ЛБ_ОперацияПоЗалогу
	               |ГДЕ
	               |	ЛБ_ОперацияПоЗалогу.НомерЗалоговогоБилета = &Номер
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата"; 
	
	Запрос.УстановитьПараметр("Номер", Объект.ЗалоговыйБилет); 
	тз = Запрос.Выполнить().Выгрузить();	
	ОперацииЗБ.Загрузить(тз);   	
	
	
	Если ЗначениеЗаполнено(Объект.ЗалоговыйБилет) И Не ЗначениеЗаполнено(Объект.Залогодатель) Тогда
		Если тз.Количество() > 0 Тогда
			Объект.Залогодатель	= тз[0].ОперацияПоЗалогу.Залогодатель;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗалоговыйБилетПриИзменении(Элемент)
	
		//	
	//	СтруктураКонтрагентЗалогодатель = ПолучитьКонтрагентаЗалогодателяПоДоговору(Объект.ЗалоговыйБилет);
	//	
	//	//Если ЗначениеЗаполнено(СтруктураКонтрагентЗалогодатель.Залогодатель) Тогда 
	//		
	//		//Объект.Залогодатель = Объект.ЗалоговыйБилет.Залогодатель;
	//		Объект.Залогодатель	= СтруктураКонтрагентЗалогодатель.Залогодатель;
	//		
	//		УстановитьПараметрыВыбораЗалоговогоБилета();
	//		УстановитьОтборПоЗалогодателю();
	//		ОбновитьРеквизитыЗалогодателя();
	//		
	//		ОбновитьРеквизитыСтатистикиЗаймов();
	//		
	//	//КонецЕсли;
	//	
	//КонецЕсли;
	//
	//УстановитьОтборПоЗалоговомуБилету(Объект.ЗалоговыйБилет, "ЗалоговыеБилеты");
	//
	//ОбновитьВыбранныеЗалоговыеБилеты();
	//УстановитьНачальныеЗначенияРеквизитовЗадолженности();
	//УстановитьДанныеЗаголовкаЗадолженностиНаДату();
	
	ВывестиБилетыСОтбором();
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеЗалоговогоБилетаПриИзменении(Элемент)
	
	УстановитьОтборПоСостояниюЗалоговогоБилета();	
	
	ОбновитьВыбранныеЗалоговыеБилеты();
	УстановитьНачальныеЗначенияРеквизитовЗадолженности();
	УстановитьДанныеЗаголовкаЗадолженностиНаДату();
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиДенежныхСредствВсеОстаткиНажатие(Элемент)
	//
	//ОтбораПоВидуДенежныхСредств = Новый Структура();
	//ОтбораПоВидуДенежныхСредств.Вставить("Поле",         "ВидДенежныхСредств");
	//ОтбораПоВидуДенежныхСредств.Вставить("ВидСравнения", ВидСравненияКомпоновкиДанных.Равно);
	//ОтбораПоВидуДенежныхСредств.Вставить("Значение",     "Деньги в кассе");
	//
	//ОтборыОтчета = Новый Массив;
	//ОтборыОтчета.Добавить(ОтбораПоВидуДенежныхСредств);
	//
	//Если ВестиУчетПоПодразделениям И ЗначениеЗаполнено(Объект.Подразделение) Тогда
	//	
	//	ОтборПоПодразделению = Новый Структура();
	//	ОтборПоПодразделению.Вставить("Поле",         "Подразделение");
	//	ОтборПоПодразделению.Вставить("ВидСравнения", ВидСравненияКомпоновкиДанных.ВИерархии);
	//	ОтборПоПодразделению.Вставить("Значение",     Объект.Подразделение);
	//	
	//	ОтборыОтчета.Добавить(ОтборПоПодразделению);
	//	
	//КонецЕсли;
	//
	//ОткрытьОтчет("Отчет.ОстаткиДенежныхСредств.Форма", , ОтборыОтчета);
	//
КонецПроцедуры

&НаКлиенте
Процедура ЗалогодательАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ОбработатьАвтоПодборОкончаниеВводаТекстаЗалогодателя(Текст, ПараметрыПолученияДанных, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗалогодательОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ОбработатьАвтоПодборОкончаниеВводаТекстаЗалогодателя(Текст, ПараметрыПолученияДанных, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадолженностьНаДатуПоВидамНачисленийНажатие(Элемент)
	
	//СписокДоговоров = СформироватьСписокДоговоровКОбработке();
	//Если СписокДоговоров.Количество() = 0 Тогда
	//	ПоказатьПредупреждение(
	//		,
	//		НСтр("ru = 'Команда не может быть выполнена для указанного объекта.'"),
	//		,
	//		"Предупреждение"
	//	);
	//	Возврат;
	//КонецЕсли;
	//
	//ОбновлятьРеквизитыЗадолженности = (ЗадолженностьНаДатуОсновнойДолг <> ПолучитьСтрокуНачальногоЗначенияЗадолженности());
	//Если ОбновлятьРеквизитыЗадолженности Тогда 
	//	ОбновитьРеквизитыЗадолженностиНаДату(СписокДоговоров);
	//КонецЕсли;
	//
	//ОткрытьОтчетРассчитатьНаДату(СписокДоговоров);
	
КонецПроцедуры

#КонецОбласти

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ТАБЛИЦЫ ФОРМЫ ЗалоговыеБилеты
#Область ОбработчикиСобытийЭлементовТаблицыФормыЗалоговыеБилеты

&НаКлиенте
Процедура ЗалоговыеБилетыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элемент.ТекущиеДанные;
	
	Если СписокСостоянийИсключений.НайтиПоЗначению(ТекДанные.Состояние)<> Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "ЗалоговыеБилетыФлаг"
		И ТекДанные <> Неопределено 
		И ТекДанные.Свойство("ЗалоговыйБилет") Тогда 
		
		СтандартнаяОбработка = Ложь;
		
		ТекЗалоговыйБилет = ТекДанные.ЗалоговыйБилет;
		
		ЭлементСписка = ВыбранныеЗалоговыеБилеты.НайтиПоЗначению(ТекЗалоговыйБилет);
		Если ЭлементСписка = Неопределено Тогда
			ВыбранныеЗалоговыеБилеты.Добавить(ТекЗалоговыйБилет);
		Иначе
			ВыбранныеЗалоговыеБилеты.Удалить(ЭлементСписка);
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
			ЗалоговыеБилеты,
			"ВыбранныеЗалоговыеБилеты",
			ВыбранныеЗалоговыеБилеты
		);
		
		УстановитьНачальныеЗначенияРеквизитовЗадолженности();
		УстановитьДанныеЗаголовкаЗадолженностиНаДату();
		УстановитьДоступностьКомандыПерезалог();
		
	ИначеЕсли Поле.Имя = "ЗалоговыеБилетыЗалоговыйБилет"
		И ТекДанные <> Неопределено 
		И ТекДанные.Свойство("ЗалоговыйБилет") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПоказатьЗначение(, ТекДанные.ЗалоговыйБилет);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗалоговыеБилетыПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("Подключаемый_ПриАктивизацииСтрокиЗалоговыхБилетов", 	0.2, Истина);
	ПодключитьОбработчикОжидания("Подключаемый_УстановитьДоступностьКоманд", 	0.1, Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗалоговыеБилетыПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	//МассивДоговоров = Новый Массив;
	//СоответствиеДоговоровКлючей = Новый Соответствие;
	//Для Каждого Ключ Из Строки.ПолучитьКлючи() Цикл
	//	МассивДоговоров.Добавить(Ключ.ДоговорКонтрагента);
	//	СоответствиеДоговоровКлючей.Вставить(Ключ.ДоговорКонтрагента, Ключ);
	//КонецЦикла;
	//
	//ОтборПоПодразделению = Ложь;
	//Подразделение = Неопределено;
	//ПолеПодразделение = Новый ПолеКомпоновкиДанных("ПодразделениеОрганизации");
	//Для Каждого ЭлОтбор Из Настройки.Отбор.Элементы Цикл
	//	Если ЭлОтбор.Использование 
	//		И ЭлОтбор.ЛевоеЗначение = ПолеПодразделение 
	//		И ЗначениеЗаполнено(ЭлОтбор.ПравоеЗначение) Тогда
	//		
	//		ОтборПоПодразделению = Истина;
	//		Подразделение = ЭлОтбор.ПравоеЗначение;
	//		
	//		Прервать;
	//		
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("МассивДоговоров", МассивДоговоров);
	//Запрос.УстановитьПараметр("ОтборПоПодразделению", ОтборПоПодразделению);
	//Запрос.УстановитьПараметр("Подразделение", Подразделение);
	//
	//#Область ТекстЗапроса
	//
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	ДоговорыКонтрагентов.Ссылка КАК ДоговорКонтрагента,
	//|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	//|	ДоговорыКонтрагентов.Организация КАК Организация
	//|ПОМЕСТИТЬ ВТ_СтрокиДС
	//|ИЗ
	//|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	//|ГДЕ
	//|	ДоговорыКонтрагентов.Ссылка В(&МассивДоговоров)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	АКСЛМБУчетПредоставленныхЗаймовОбороты.Договор КАК ДоговорКонтрагента,
	//|	АКСЛМБУчетПредоставленныхЗаймовОбороты.ОценкаПредметаПриход КАК ОценкаПредметов,
	//|	АКСЛМБУчетПредоставленныхЗаймовОбороты.СуммаЗаймаПриход КАК СуммаЗайма
	//|ИЗ
	//|	РегистрНакопления.АКСЛМБУчетПредоставленныхЗаймов.Обороты(
	//|			,
	//|			,
	//|			,
	//|			(Договор, Контрагент, Организация) В
	//|					(ВЫБРАТЬ
	//|						ВТ_СтрокиДС.ДоговорКонтрагента КАК ДоговорКонтрагента,
	//|						ВТ_СтрокиДС.Контрагент КАК Контрагент,
	//|						ВТ_СтрокиДС.Организация КАК Организация
	//|					ИЗ
	//|						ВТ_СтрокиДС КАК ВТ_СтрокиДС)
	//|				И Договор.АКСЛМБВидДоговора = ЗНАЧЕНИЕ(Перечисление.АКСЛМБВидыДоговоров.Займ)
	//|				И ВЫБОР
	//|					КОГДА &ОтборПоПодразделению
	//|						ТОГДА ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ) КАК АКСЛМБУчетПредоставленныхЗаймовОбороты
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	АКСЛМБУчетВещейНаХраненииОбороты.Договор,
	//|	СУММА(АКСЛМБУчетВещейНаХраненииОбороты.ОценкаПредметаПриход),
	//|	СУММА(0)
	//|ИЗ
	//|	РегистрНакопления.АКСЛМБУчетВещейНаХранении.Обороты(
	//|			,
	//|			,
	//|			,
	//|			(Договор, Контрагент, Организация) В
	//|					(ВЫБРАТЬ
	//|						ВТ_СтрокиДС.ДоговорКонтрагента КАК ДоговорКонтрагента,
	//|						ВТ_СтрокиДС.Контрагент КАК Контрагент,
	//|						ВТ_СтрокиДС.Организация КАК Организация
	//|					ИЗ
	//|						ВТ_СтрокиДС КАК ВТ_СтрокиДС)
	//|				И Договор.АКСЛМБВидДоговора = ЗНАЧЕНИЕ(Перечисление.АКСЛМБВидыДоговоров.Хранение)
	//|				И ВЫБОР
	//|					КОГДА &ОтборПоПодразделению
	//|						ТОГДА ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ) КАК АКСЛМБУчетВещейНаХраненииОбороты
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	АКСЛМБУчетВещейНаХраненииОбороты.Договор";
	//
	//#КонецОбласти
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	
	//	СтрокаСписка = Строки[СоответствиеДоговоровКлючей.Получить(Выборка.ДоговорКонтрагента)];
	//	ЗаполнитьЗначенияСвойств(СтрокаСписка.Данные, Выборка, "ОценкаПредметов, СуммаЗайма");
	//	
	//КонецЦикла;
	//
	//ДополнительныеПараметры = Новый Структура();
	//ДополнительныеПараметры.Вставить("ИмяФормы", "Обработка.ЛБ_РабочееМестоТовароведа.Форма.Форма");
	//ДополнительныеПараметры.Вставить("ИмяКолонкиСостояние", "Состояние");
	//АКСЛМБСобытияФорм.ДинамическийСписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки, ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ
#Область ОбработчикиКомандФормы

#Область КомандыФормы

&НаКлиенте
Процедура Настройки(Команда)
	
	ОткрытьФормуНастроек();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоШтрихкоду(Команда)
	//ОписаниеОповещенияПоискПоШтрихкоду = Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект);
	//ОткрытьФорму("РегистрСведений.АКСЛМБШтрихкодыДоговоров.Форма.ФормаВводШтрихкода", , ЭтотОбъект,,,,ОписаниеОповещенияПоискПоШтрихкоду , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область КомандыКонтейнеров

&НаКлиенте
Процедура ОбновитьОстаткиДС(Команда)
	
	//ОбновитьРеквизитыДенежныхСредств();
	
КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьСтатистикуЗалоговыхБилетов(Команда)
	
//	ОбновитьРеквизитыСтатистикиЗаймов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗалогодателя(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Залогодатель) Тогда 
		
		ПоказатьПредупреждение(
			,
			НСтр("ru = 'Команда не может быть выполнена для указанного объекта.'"),
			,
			"Предупреждение"
		);
		
	Иначе
		//ПоказатьЗначение(, Объект.Залогодатель);
		//СтандартнаяОбработка = Ложь;
		//ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЗалогодателя",ЭтаФорма); 
		ПараметрыФормы = Новый Структура;  
		ПараметрыФормы.Вставить("Залогодатель", Объект.Залогодатель);
		ОткрытьФорму("ОбщаяФорма.ЛБ_КарточкаЗалогодателя", ПараметрыФормы, ЭтотОбъект);//	,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗадолженностьНаДату(Команда)
	
	//ОчиститьСообщения();
	
	//ОбновитьРеквизитыЗадолженностиНаДату();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадолженностьНаДатуДатаРасчетаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	//Если НавигационнаяСсылкаФорматированнойСтроки = "ДатаРасчетаЗадолженности" Тогда 
	//	
	//	СтандартнаяОбработка = Ложь;
	//	
	//	ПараметрыВыбора = Новый Структура;
	//	ПараметрыВыбора.Вставить("НачальноеЗначение", 	ДатаРасчетаЗадолженности);
	//	ПараметрыВыбора.Вставить("Заголовок", 			"Выберите дату расчета задолженности");
	//	ПараметрыВыбора.Вставить("ПоясняющийТекст", 	"Укажите дату, на которую будет произведен предварительный расчет задолженности");
	//	
	//	ОткрытьФорму(
	//		"ОбщаяФорма.ВыборДаты", 
	//		ПараметрыВыбора, 
	//		ЭтаФорма,,,, 
	//		Новый ОписаниеОповещения("ПослеВыбораДатыРасчетаЗадолженности", ЭтотОбъект)
	//	);
	//	
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораДатыРасчетаЗадолженности(Результат, ДополнительныеПараметры) Экспорт
	
	//Если Результат = Неопределено Тогда 
	//	Возврат;
	//КонецЕсли;
	//
	//УстановитьЗадолженностьНаДатуДатаРасчета(Результат);
	//
	//ОбновлятьРеквизитыЗадолженности = (ЗадолженностьНаДатуОсновнойДолг <> ПолучитьСтрокуНачальногоЗначенияЗадолженности());
	//Если ОбновлятьРеквизитыЗадолженности Тогда 
	//	ОбновитьРеквизитыЗадолженностиНаДату();
	//КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область КомандыОпераций

&НаКлиенте
Процедура СоздатьВыдачаЗаймаПолучениеЗалога(Команда)
	
	//СоздатьДокумент("АКСЛМБВыдачаЗайма");
	//СтруктураПараметров = Новый Структура("ВидОперации");
	//СтруктураПараметров.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог");
	//СтруктураПараметров.Залогодатель
	//СтруктураПараметров.ДокументЗалогодателя  
	//
	//
	//СтруктураПараметров =   
	
	ПарамФормы = Новый Структура("Залогодатель", Объект.Залогодатель);
	СтруктураПараметров = Новый Структура("ВидОперации");
	СтруктураПараметров.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог");

	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЗалогодателяЗалог", ЭтотОбъект, СтруктураПараметров);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателя",ПарамФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЗалогодателяЗалог(Результат,Параметры) Экспорт
	Если НЕ ТипЗнч(Результат) = Тип("Структура") Тогда
		Возврат;		
	Иначе
		СтруктураПараметров = Результат;
	КонецЕсли;
	СтруктураПараметров.Вставить("ВидОперации", Параметры.ВидОперации);
	ОткрытьФорму("Документ.ЛБ_ОперацияПоЗалогу.Форма.ФормаДокумента", СтруктураПараметров, ЭтаФорма);
КонецПроцедуры	


&НаКлиенте
Процедура СоздатьВозвратЗайма(Команда)
	
	СтруктураПараметров = Новый Структура("ВидОперации");
	СтруктураПараметров.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов"); 
	
	ПараметрыФормы = Новый Структура; 
	ПараметрыФормы.Вставить("ВидОперации",  ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов"));
	ПараметрыФормы.Вставить("Залогодатель", Объект.Залогодатель);
	// ++ Сербаев 13.06.2023 добавлена проверка на неопределено
	//Если ЗначениеЗаполнено(Элементы.Билеты.ТекущиеДанные.Номер) Тогда
	//	ПараметрыФормы.Вставить("Номер",        Элементы.Билеты.ТекущиеДанные.Номер);
	//КонецЕсли;
	Если Элементы.Билеты.ТекущиеДанные = Неопределено Тогда
		Возврат;
	ИначеЕсли ЗначениеЗаполнено(Элементы.Билеты.ТекущиеДанные.Номер) Тогда
		ПараметрыФормы.Вставить("Номер", Элементы.Билеты.ТекущиеДанные.Номер);
	КонецЕсли;
	// -- Сербаев 13.06.2023
	
	ОписаниеОповещения = новый ОписаниеОповещения("ПослеВыбораЗалогодателяОплатаПроцентов",ЭтотОбъект,СтруктураПараметров);	
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателяПоНомеруБилета",ПараметрыФормы,ЭтотОбъект,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЗалогодателяОплатаПроцентов(Результат,Параметры) Экспорт
	Если НЕ ТипЗнч(Результат) = Тип("Структура") Тогда
		Возврат;		
	Иначе
		СтруктураПараметров = Результат;
	КонецЕсли;
	СтруктураПараметров.Вставить("ВидОперации", Параметры.ВидОперации);
	ОткрытьФорму("Документ.ЛБ_ОперацияПоЗалогу.Форма.ФормаДокумента", СтруктураПараметров, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПерезалог(Команда)
	
	//СоздатьДокумент("АКСЛМБПерезалог");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПриемНаХранение(Команда)
	
	//СоздатьДокумент("АКСЛМБПриемНаХранение");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЗалогодателяВыдачаЗалога(Результат,Параметры) Экспорт
	Если НЕ ТипЗнч(Результат) = Тип("Структура") Тогда
		Возврат;		
	Иначе
		СтруктураПараметров = Результат;
	КонецЕсли;
	СтруктураПараметров.Вставить("ВидОперации", Параметры.ВидОперации);
	ОткрытьФорму("Документ.ЛБ_ОперацияПоЗалогу.Форма.ФормаДокумента", СтруктураПараметров, ЭтаФорма);
КонецПроцедуры	

&НаКлиенте
Процедура СоздатьВозвратСХранения(Команда)
	
	СтруктураПараметров = Новый Структура("ВидОперации");
	СтруктураПараметров.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога");
	
	ПараметрыФормы = Новый Структура; 
	ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога"));	
	ОписаниеОповещения = новый ОписаниеОповещения("ПослеВыбораЗалогодателяВыдачаЗалога",ЭтотОбъект,СтруктураПараметров);	
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателяПоНомеруБилета",ПараметрыФормы,ЭтотОбъект,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);КонецПроцедуры

&НаКлиенте
Процедура СоздатьБыстрыйЧастичныйПерезалог(Команда)
	
	//КоличествоВыбранныхЗалоговыхБилетов = ВыбранныеЗалоговыеБилеты.Количество();
	//
	//Если КоличествоВыбранныхЗалоговыхБилетов > 1 Тогда
	//	ТекстСообщения = Нстр("ru = 'Необходимо отметить только один залоговый билет для оформления быстрого частичного перезалога'");
	//	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,, "ЗалоговыеБилеты");
	//	Возврат;
	//КонецЕсли;
	//
	//Если КоличествоВыбранныхЗалоговыхБилетов = 1 Тогда
	//	ТекЗалоговыйБилет = ВыбранныеЗалоговыеБилеты[0].Значение;
	//Иначе	
	//	ТекДанные = Элементы.ЗалоговыеБилеты.ТекущиеДанные;
	//	ТекЗалоговыйБилет = Неопределено;
	//	Если ЗначениеЗаполнено(Объект.ЗалоговыйБилет) Тогда 
	//		ТекЗалоговыйБилет = Объект.ЗалоговыйБилет;
	//	ИначеЕсли ТекДанные <> Неопределено И ТекДанные.Свойство("ЗалоговыйБилет") Тогда
	//		ТекЗалоговыйБилет = ТекДанные.ЗалоговыйБилет;
	//	КонецЕсли;
	//КонецЕсли;	
	//
	//АКСЛМБОперацииЗаймаКлиент.ОткрытьМастерСозданияБыстрогоЧастичногоПерезалога(ЭтаФорма, ТекЗалоговыйБилет); 
	
КонецПроцедуры

#КонецОбласти

#Область КомандыЗалоговыхБилетов

&НаКлиенте
Процедура РассчитатьНаДату(Команда)
	
	Если ВыбранныеЗалоговыеБилеты.Количество() > 0 Тогда 
		
		ОткрытьОтчетРассчитатьНаДату(ВыбранныеЗалоговыеБилеты);
		
	Иначе
		
		ТекДанные = Элементы.ЗалоговыеБилеты.ТекущиеДанные;
		Если ТекДанные <> Неопределено И ТекДанные.Свойство("ЗалоговыйБилет") Тогда 
			
			ОткрытьОтчетРассчитатьНаДату(ТекДанные.ЗалоговыйБилет);

		Иначе
			
			ПоказатьПредупреждение(
				,
				НСтр("ru = 'Команда не может быть выполнена для указанного объекта.'"),
				,
				"Предупреждение"
			);		
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

// Формирует отчет "Расчет задолженности на дату" для выбранных договоров (залоговых билетов)
//
// Параметры:
//  Договор	 - СписокЗначений, СправочникСсылка.ДоговорыКонтрагентов - договор(ы), для которых
//					необходимо открыть отчет.
//
&НаКлиенте
Процедура ОткрытьОтчетРассчитатьНаДату(Договор)
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("Договор", 						Договор);
	ПараметрыРасчета.Вставить("ДатаРасчета", 					ДатаРасчетаЗадолженности);
	ПараметрыРасчета.Вставить("КлючВарианта", 					"РасчетЗадолженностиНаДату");
	ПараметрыРасчета.Вставить("КлючПользовательскихНастроек", 	""); // пользовательские настройки не грузим
	
	ОткрытьФорму(
		"Отчет.АКСЛМБРасчетЗадолженностиНаДату.ФормаОбъекта", 
		ПараметрыРасчета,
		ЭтаФорма,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	ВыбранныеЗалоговыеБилеты = ПолучитьТекущиеЗалоговыеБилеты();
	
	Если Не ЗначениеЗаполнено(ВыбранныеЗалоговыеБилеты) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Нстр("ru = 'В списке не обнаружены действующие договоры'"),,, "ЗалоговыеБилеты");	
	КонецЕсли;	
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		ЗалоговыеБилеты,
		"ВыбранныеЗалоговыеБилеты",
		ВыбранныеЗалоговыеБилеты
	);
	
	УстановитьНачальныеЗначенияРеквизитовЗадолженности();
	УстановитьДанныеЗаголовкаЗадолженностиНаДату();
	УстановитьДоступностьКомандыПерезалог();
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	ВыбранныеЗалоговыеБилеты.Очистить();
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		ЗалоговыеБилеты,
		"ВыбранныеЗалоговыеБилеты",
		ВыбранныеЗалоговыеБилеты
	);
	
	УстановитьНачальныеЗначенияРеквизитовЗадолженностиНаСервере();
	УстановитьДанныеЗаголовкаЗадолженностиНаДату();
	УстановитьДоступностьКомандыПерезалог();
	
КонецПроцедуры

Процедура УстановитьДоступностьКомандыПерезалог();
	         
	Если ВыбранныеЗалоговыеБилеты.Количество() > 1 Тогда
		Элементы.СоздатьПерезалог.Доступность = Ложь;
	Иначе
		Элементы.СоздатьПерезалог.Доступность = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область КомандыКассоваяСмена

&НаКлиенте
Процедура ОткрытьСмену(Команда)
	
		
КонецПроцедуры
	
&НаКлиенте
Процедура ЗакрытьСмену(Команда)
	
		
КонецПроцедуры

#КонецОбласти

#Область КомандыРежимЗаймаХранения

&НаКлиенте
Процедура РежимЗаймы(Команда)
	
	ОбработатьИзменениеРежимаЗаймаХранения("Займы");
	
КонецПроцедуры

&НаКлиенте
Процедура РежимХранение(Команда)
	
	ОбработатьИзменениеРежимаЗаймаХранения("Хранение");
	
КонецПроцедуры

#КонецОбласти

#Область КомандыДоверенности

&НаКлиенте
Процедура СоздатьДоверенность(Команда)
	
	//СоздатьДокумент("АКСЛМБДоверенность");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьАннулированиеДоверенности(Команда)
	
	//СоздатьДокумент("АКСЛМБАннулированиеДоверенности");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
#Область СлужебныеПроцедурыИФункции

#Область РаботаСФормой

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	//ВыполнитьНачальнуюНастройкуДинамическихСписковНаСервере();
	//ИнициализироватьУчетПоПодразделениям();
	//ИнициализироватьСписокСостоянийИсключений();
	//ЗагрузитьНастройкиНаСервере();
	//ОбновитьРеквизитыДенежныхСредствНаСервере();
	//УстановитьНачальныеЗначенияРеквизитовЗадолженностиНаСервере();
	
КонецПроцедуры
	
&НаКлиенте
Процедура УправлениеФормойНаКлиенте()
	
	//ЕстьНеустановленныеОтборы = ЕстьНеустановленныеОтборы();
	//
	//Элементы.ДекорацияНеустановленныеОтборы.Видимость = ЕстьНеустановленныеОтборы;
	//Если ЕстьНеустановленныеОтборы Тогда 
	//	Элементы.ДекорацияНеустановленныеОтборы.Заголовок = ПолучитьТекстНеустановленныхОтборов();
	//КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, 
		"ГруппаРежимЗаймаХранения", 
		"Видимость", 
		Истина И Ложь
	);
	
	ИспользуетсяРежимЗаймы = Истина;
	//ИспользуетсяРежимЗаймы = ВидыДоговоровЗаймаХранения.НайтиПоЗначению(ПредопределенноеЗначение("Перечисление.АКСЛМБВидыДоговоров.Займ")) <> Неопределено;
	//Если ИспользуетсяРежимЗаймы Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаРежимЗаймы", "Пометка", Истина);
	//КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, 
		"СоздатьВыдачаЗаймаПолучениеЗалога", 
		"Видимость", 
		ИспользуетсяРежимЗаймы
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, 
		"СоздатьВозвратЗайма", 
		"Видимость", 
		ИспользуетсяРежимЗаймы
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, 
		"СоздатьПерезалог", 
		"Видимость", 
		ИспользуетсяРежимЗаймы
	);
	
		
	//ИспользуетсяРежимХранение = ВидыДоговоровЗаймаХранения.НайтиПоЗначению(ПредопределенноеЗначение("Перечисление.АКСЛМБВидыДоговоров.Хранение")) <> Неопределено;
	//Если ИспользуетсяРежимХранение Тогда
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаРежимХранение", "Пометка", Истина);
	//КонецЕсли;
	//
	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	//	Элементы, 
	//	"СоздатьПриемНаХранение", 
	//	"Видимость",
	//	ИспользуетсяРежимХранение
	//);
	//
	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	//	Элементы, 
	//	"СоздатьВозвратСХранения", 
	//	"Видимость",
	//	ИспользуетсяРежимХранение
	//);
		
	УстановитьЗаголовокФормы();
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьНеустановленныеОтборы()
	
	ЕстьНеустановленныеОтборы = Не ЗначениеЗаполнено(Объект.Организация);
	
	Возврат ЕстьНеустановленныеОтборы;	
	
КонецФункции

&НаКлиенте
Функция ПолучитьТекстНеустановленныхОтборов()
	
	ТекстНеустановленныхОтборов = "";
	
	Возврат ТекстНеустановленныхОтборов;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуНастроек()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация",		Объект.Организация);
	ПараметрыФормы.Вставить("Подразделение",	Объект.Подразделение);
	ПараметрыФормы.Вставить("Склад",			Объект.Склад);
	
	ОткрытьФорму(
		"Обработка.ЛБ_РабочееМестоТовароведа.Форма.ФормаНастройки",
		ПараметрыФормы, 
		ЭтаФорма,,,,
		Новый ОписаниеОповещения("ПослеЗакрытияФормыНастроек", ЭтотОбъект), 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);

КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ОбработатьПолученныйКод(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокФормы()
	
	ТекстЗаголовока = НСтр("ru = 'Рабочее место товароведа'");
	
	УстановленыОпцииЗаймаХранения = Истина И Ложь;
	
	Если УстановленыОпцииЗаймаХранения Тогда
		Если Элементы.ФормаРежимЗаймы.Пометка И Не Элементы.ФормаРежимХранение.Пометка Тогда
			ТекстЗаголовока = НСтр("ru = 'Рабочее место товароведа (договоры займа)'");
		ИначеЕсли Не Элементы.ФормаРежимЗаймы.Пометка И Элементы.ФормаРежимХранение.Пометка Тогда
			ТекстЗаголовока = НСтр("ru = 'Рабочее место товароведа (договоры хранения)'");
		Иначе
			// дополнительная обработка не требуется
		КонецЕсли;
	КонецЕсли;
	
	//+++ Моисеев 20250520
	текПользователь = ПолучитьТекущегоПользователяНаСервере();
	ТекстЗаголовока = СтрЗаменить(ТекстЗаголовока, "товароведа", "приемщика") + "                    " + текПользователь;
	//--- Моисеев 20250520
	Заголовок = ТекстЗаголовока;

КонецПроцедуры

//+++ Моисеев 20250520
&НаСервере
Функция ПолучитьТекущегоПользователяНаСервере()
	
	текСотрудник = "" + ПараметрыСеанса.ТекущийСотрудник;
	Если текСотрудник = "" Тогда 
		текСотрудник = "" + Пользователи.ТекущийПользователь();
	КонецЕсли;
	Возврат текСотрудник;
КонецФункции
//--- Моисеев 20250520

#КонецОбласти

#Область УстановкаПараметровИОтборов

&НаКлиенте
Процедура УстановитьПараметрыЗалоговыхБилетов()
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		ЗалоговыеБилеты,
		"ВыбранныеЗалоговыеБилеты",
		ВыбранныеЗалоговыеБилеты
	);	
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриАктивизацииСтрокиЗалоговыхБилетов()

	ТекДанные = Элементы.ЗалоговыеБилеты.ТекущиеДанные;
	ТекЗалоговыйБилет = ?(
		ТекДанные <> Неопределено И ТекДанные.Свойство("ЗалоговыйБилет"), 
		ТекДанные.ЗалоговыйБилет, 
		Неопределено
	);
	УстановитьОтборПоЗалоговомуБилету(ТекЗалоговыйБилет, "Операции");

	Если ВыбранныеЗалоговыеБилеты.Количество() = 0 Тогда 
		УстановитьНачальныеЗначенияРеквизитовЗадолженности();
	КонецЕсли;
	
	УстановитьДанныеЗаголовкаЗадолженностиНаДату();

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УстановитьДоступностьКоманд()
	
	ТекДанные = Элементы.ЗалоговыеБилеты.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Или СписокСостоянийИсключений.НайтиПоЗначению(ТекДанные.Состояние) <> Неопределено Тогда
		СостояниеЗБ = Ложь;
	Иначе 
		СостояниеЗБ = Истина;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"СоздатьВозвратЗайма",
		"Доступность",
		СостояниеЗБ
	);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"СоздатьПерезалог",
		"Доступность",
		СостояниеЗБ
	);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"СоздатьБыстрыйЧастичныйПерезалог",
		"Доступность",
		СостояниеЗБ
	);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"СоздатьПриемНаХранение",
		"Доступность",
		СостояниеЗБ
	);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"СоздатьВозвратСХранения",
		"Доступность",
		СостояниеЗБ
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"СоздатьДоверенность",
		"Доступность",
		СостояниеЗБ
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"СоздатьАннулированиеДоверенности",
		"Доступность",
		СостояниеЗБ
	);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоЗалогодателю()
	
	ВидСравненияКомпановки = ВидСравненияКомпоновкиДанных.Равно;
	Если Не ЗначениеЗаполнено(Объект.Залогодатель) Тогда 
		ВидСравненияКомпановки = ВидСравненияКомпоновкиДанных.НеРавно;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		ЗалоговыеБилеты,
		"Залогодатель",
		Объект.Залогодатель,
		ВидСравненияКомпановки,
		,
		Истина,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный
	);
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоЗалоговомуБилету(ТекущийЗалоговыйБилет, ИмяДинамическогоСписка)
	
	УстанавливатьОтбор = (ТекущийЗалоговыйБилет <> ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка"));
	
	Если ИмяДинамическогоСписка = "ЗалоговыеБилеты" Тогда 
		
		//ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		//	ЭтотОбъект[ИмяДинамическогоСписка],
		//	"ЗалоговыйБилет",
		//	ТекущийЗалоговыйБилет, 
		//	УстанавливатьОтбор, 
		//	ВидСравненияКомпоновкиДанных.Равно
		//);
		
	Иначе
		
		// "Операции"
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
			Операции,
			"ОтборПоЗалоговомуБилету",
			УстанавливатьОтбор
		);
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
			Операции,
			"ЗалоговыйБилет",
			ТекущийЗалоговыйБилет
		);
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
			Операции,
			"ДокументыПоЗалоговомуБилету",
			?(УстанавливатьОтбор, ДокументыЖурналаПоЗалоговомуБилетуВТабличнойЧасти(ТекущийЗалоговыйБилет), Неопределено)
		);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДокументыЖурналаПоЗалоговомуБилетуВТабличнойЧасти(ТекущийЗалоговыйБилет)
	
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("ДоговорКонтрагента", ТекущийЗалоговыйБилет);
	//Запрос.Текст =
	//"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	АКСЛМБЛотыДоговоры.Ссылка КАК Ссылка
	//|ПОМЕСТИТЬ втЛоты
	//|ИЗ
	//|	Справочник.АКСЛМБЛоты.Договоры КАК АКСЛМБЛотыДоговоры
	//|ГДЕ
	//|	АКСЛМБЛотыДоговоры.Договор = &ДоговорКонтрагента
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	//|	АКСЛМБВводНачальныхОстатковПоЗаймамИВещамНаХраненииДанныеПоКонтрагентам.Ссылка КАК Ссылка
	//|ИЗ
	//|	Документ.АКСЛМБВводНачальныхОстатковПоЗаймамИВещамНаХранении.ДанныеПоКонтрагентам КАК АКСЛМБВводНачальныхОстатковПоЗаймамИВещамНаХраненииДанныеПоКонтрагентам
	//|ГДЕ
	//|	АКСЛМБВводНачальныхОстатковПоЗаймамИВещамНаХраненииДанныеПоКонтрагентам.ДоговорКонтрагента = &ДоговорКонтрагента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	АКСЛМБПередачаНаРеализациюДоговоры.Ссылка
	//|ИЗ
	//|	Документ.АКСЛМБПередачаНаРеализацию.Договоры КАК АКСЛМБПередачаНаРеализациюДоговоры
	//|ГДЕ
	//|	АКСЛМБПередачаНаРеализациюДоговоры.Договор = &ДоговорКонтрагента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	АКСЛМБРеализацияИмуществаСписокДоговоров.Ссылка
	//|ИЗ
	//|	Документ.АКСЛМБРеализацияИмущества.СписокДоговоров КАК АКСЛМБРеализацияИмуществаСписокДоговоров
	//|ГДЕ
	//|	АКСЛМБРеализацияИмуществаСписокДоговоров.ДоговорКонтрагента = &ДоговорКонтрагента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	АКСЛМБОбъявлениеТорговЛоты.Ссылка
	//|ИЗ
	//|	Документ.АКСЛМБОбъявлениеТоргов.Лоты КАК АКСЛМБОбъявлениеТорговЛоты
	//|ГДЕ
	//|	АКСЛМБОбъявлениеТорговЛоты.ДоговорЛота = &ДоговорКонтрагента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	АКСЛМБПроведениеТорговЛоты.Ссылка
	//|ИЗ
	//|	Документ.АКСЛМБПроведениеТоргов.Лоты КАК АКСЛМБПроведениеТорговЛоты
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЛоты КАК втЛоты
	//|		ПО АКСЛМБПроведениеТорговЛоты.Лот = втЛоты.Ссылка";
	//
	//Если ВариантыПриложений.ЭтоВерсияКОРП() Тогда
	//	
	//	Запрос.Текст = Запрос.Текст + "
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	АКСЛМБПеремещениеПоДоговорамЗаймаИХраненияДанныеПоКонтрагентам.Ссылка КАК Ссылка
	//	|ИЗ
	//	|	Документ.АКСЛМБПеремещениеПоДоговорамЗаймаИХранения.ДанныеПоКонтрагентам КАК АКСЛМБПеремещениеПоДоговорамЗаймаИХраненияДанныеПоКонтрагентам
	//	|ГДЕ
	//	|	АКСЛМБПеремещениеПоДоговорамЗаймаИХраненияДанныеПоКонтрагентам.ДоговорКонтрагента = &ДоговорКонтрагента
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	АКСЛМБАвизоПоЗаймамИсходящееДанныеПоКонтрагентам.Ссылка КАК Ссылка
	//	|ИЗ
	//	|	Документ.АКСЛМБАвизоПоЗаймамИсходящее.ДанныеПоКонтрагентам КАК АКСЛМБАвизоПоЗаймамИсходящееДанныеПоКонтрагентам
	//	|ГДЕ
	//	|	АКСЛМБАвизоПоЗаймамИсходящееДанныеПоКонтрагентам.ДоговорКонтрагента = &ДоговорКонтрагента
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	АКСЛМБАвизоПоЗаймамВходящееДанныеПоКонтрагентам.Ссылка КАК Ссылка
	//	|ИЗ
	//	|	Документ.АКСЛМБАвизоПоЗаймамВходящее.ДанныеПоКонтрагентам КАК АКСЛМБАвизоПоЗаймамВходящееДанныеПоКонтрагентам
	//	|ГДЕ
	//	|	АКСЛМБАвизоПоЗаймамВходящееДанныеПоКонтрагентам.ДоговорКонтрагента = &ДоговорКонтрагента";
	//	
	//КонецЕсли;
	//
	//Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаКлиенте
Процедура УстановитьОтборПоОрганизации()

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		ЗалоговыеБилеты,
		"Организация",
		Объект.Организация,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		Истина,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Операции,
		"Организация",
		Объект.Организация,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		Истина,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный
	);
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоПодразделению()

	Если Не ВестиУчетПоПодразделениям Тогда 
		Возврат;
	КонецЕсли;
	
	ИспользоватьОтборПоПодразделению = ЗначениеЗаполнено(Объект.Подразделение);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		ЗалоговыеБилеты,
		"ПодразделениеОрганизации",
		Объект.Подразделение,
		ВидСравненияКомпоновкиДанных.ВИерархии,
		,
		ИспользоватьОтборПоПодразделению,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Операции,
		"Подразделение",
		Объект.Подразделение,
		ВидСравненияКомпоновкиДанных.ВИерархии,
		,
		ИспользоватьОтборПоПодразделению,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный
	);
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоСостояниюЗалоговогоБилета()
	
	//ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
	//	ЗалоговыеБилеты,
	//	"Состояние",
	//	Объект.СостояниеЗалоговогоБилета,
	//	ЗначениеЗаполнено(Объект.СостояниеЗалоговогоБилета),
	//	ВидСравненияКомпоновкиДанных.Равно
	//);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыВыбораЗалоговогоБилета()
	
	Элементы.ЗалоговыйБилет.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);
	
	//АКСЛМБОбщегоНазначенияКлиентСервер.ДобавитьПараметрВыбора(
	//	Элементы.ЗалоговыйБилет,
	//	"Организация",
	//	Объект.Организация
	//);
	
	//АКСЛМБОбщегоНазначенияКлиентСервер.ДобавитьПараметрВыбора(
	//	Элементы.ЗалоговыйБилет,
	//	"ВидДоговора",
	//	ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.Прочее")
	//);
	
	//АКСЛМБОбщегоНазначенияКлиентСервер.ДобавитьПараметрВыбора(
	//	Элементы.ЗалоговыйБилет,
	//	"АКСЛМБВидДоговора",
	//	ВидыДоговоровЗаймаХранения
	//);
		
	//Если ЗначениеЗаполнено(Объект.Контрагент) Тогда 
	//	
	//	АКСЛМБОбщегоНазначенияКлиентСервер.ДобавитьПараметрВыбора(
	//		Элементы.ЗалоговыйБилет,
	//		"Владелец",
	//		Объект.Контрагент	
	//	);
	//	
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНастройкиНаКлиенте()
	
	//УстановитьПараметрыЗалоговыхБилетов();
	
	//УстановитьОтборПоЗалогодателю();
	//УстановитьКонтрагентаПоЗалогодателю();
	//УстановитьПараметрыВыбораЗалоговогоБилета();
	//ОбновитьРеквизитыЗалогодателя();
	//ОбновитьРеквизитыСтатистикиЗаймов();
	
	//УстановитьОтборПоЗалоговомуБилету(Объект.ЗалоговыйБилет, "ЗалоговыеБилеты");
	//УстановитьОтборПоЗалоговомуБилету(Объект.ЗалоговыйБилет, "Операции");
	
	//УстановитьОтборПоОрганизации();
	//УстановитьОтборПоПодразделению();
	
	//УстановитьОтборПоВидуДоговора();
	
	//УстановитьЗадолженностьНаДатуДатаРасчета();
	//УстановитьОтборПоСостояниюЗалоговогоБилета();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоВидуДоговора()
	
	//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	//	ЗалоговыеБилеты,
	//	"ЗалоговыйБилет.АКСЛМБВидДоговора",
	//	ВидыДоговоровЗаймаХранения,
	//	ВидСравненияКомпоновкиДанных.ВСписке,
	//	,
	//	Истина,
	//	РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный
	//);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСКонтейнерами

&НаКлиенте
Процедура ОткрытьОтчет(Отчет, ГруппировкаОтчета = Неопределено, Отборы = Неопределено, Показатели  = Неопределено, КлючВарианта = Неопределено, НачалоПериода = Неопределено, КонецПериода = Неопределено)
	
	ПользовательскиеНастройки = ПользовательскиеНастройкиДляРасшифровки(НачалоПериода, КонецПериода);
	ДополнительныеСвойства = ПользовательскиеНастройки.ДополнительныеСвойства;
	
	Если ГруппировкаОтчета <> Неопределено И ТипЗнч(ГруппировкаОтчета) = Тип("Массив") Тогда
		ДополнительныеСвойства.Вставить("Группировка", ГруппировкаОтчета);
	КонецЕсли;
	
	Если ТипЗнч(Отборы) = Тип("Массив") Тогда
		
		НастройкаОтбора = ПользовательскиеНастройки.Элементы.Добавить(Тип("ОтборКомпоновкиДанных"));
		НастройкаОтбора.ИдентификаторПользовательскойНастройки = "Отбор";
		Для Каждого Отбор Из Отборы Цикл
			//БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(НастройкаОтбора, Отбор.Поле, Отбор.Значение, Отбор.ВидСравнения);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТипЗнч(Показатели) = Тип("Массив") Тогда
		
		Для Каждого Показатель Из Показатели Цикл
			ДополнительныеСвойства.Вставить(Показатель, Истина);
		КонецЦикла;
		
	КонецЕсли;
	
	Если КлючВарианта <> Неопределено Тогда
		ДополнительныеСвойства.Вставить("КлючВарианта", КлючВарианта);
	КонецЕсли;
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("РежимРасшифровки"         , Истина);
	ПараметрыОтчета.Вставить("ВидРасшифровки"           , 2);
	ПараметрыОтчета.Вставить("ПользовательскиеНастройки", ПользовательскиеНастройки);
	
	ОткрытьФорму(Отчет, ПараметрыОтчета, ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Функция ПользовательскиеНастройкиДляРасшифровки(НачалоПериода = Неопределено, КонецПериода = Неопределено, ВариантОкругления = Неопределено)
	
	// Инициализация пользовательских настроек
	ПользовательскиеНастройки = Новый ПользовательскиеНастройкиКомпоновкиДанных;
	
	ДополнительныеСвойства = ПользовательскиеНастройки.ДополнительныеСвойства;
	ДополнительныеСвойства.Вставить("РежимРасшифровки", Истина);
	ДополнительныеСвойства.Вставить("Организация", 		Объект.Организация);
	ДополнительныеСвойства.Вставить("Период", 			ОбщегоНазначенияКлиент.ДатаСеанса());
	
	Если НачалоПериода <> Неопределено Тогда
		ДополнительныеСвойства.Вставить("НачалоПериода", НачалоПериода);
	КонецЕсли;
	
	Если КонецПериода <> Неопределено Тогда
		ДополнительныеСвойства.Вставить("КонецПериода", КонецПериода);
	КонецЕсли;
	
	Если ВариантОкругления = 1000 Тогда
		
		// Установим формат цифр для рублевых сумм
		УсловноеОформление = ПользовательскиеНастройки.Элементы.Добавить(Тип("УсловноеОформлениеКомпоновкиДанных"));
		УсловноеОформление.ИдентификаторПользовательскойНастройки = "УсловноеОформление";
		
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформления.Представление = НСтр("ru = 'Суммы в тыс.'");
		ЭлементУсловногоОформления.Использование = Истина;
		
		//БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(ЭлементУсловногоОформления.Оформление, "Формат", "ЧДЦ=; ЧС=3");
		
	КонецЕсли;
	
	Возврат ПользовательскиеНастройки;
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ОбновитьРеквизитыДенежныхСредств()
	
	ОбновитьРеквизитыДенежныхСредств();
	
КонецПроцедуры

// Заполняет реквизиты по денежным средставам
// за текущий день для организации, указанной в отборе
//
&НаКлиенте
Процедура ОбновитьРеквизитыДенежныхСредств() Экспорт
	
	СтруктураРеквизитовДС = РеквизитыДенежныхСредств(Объект.Организация, Объект.Подразделение, ВестиУчетПоПодразделениям);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураРеквизитовДС);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРеквизитыЗадолженностиНаДату(СписокДоговоров = Неопределено)
	
	Если СписокДоговоров = Неопределено Тогда
		
		СписокДоговоров = СформироватьСписокДоговоровКОбработке();
		
		Если СписокДоговоров.Количество() = 0 Тогда
			ПоказатьПредупреждение(
				,
				НСтр("ru = 'Команда не может быть выполнена для указанного объекта.'"),
				,
				"Предупреждение"
			);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	СтруктураРеквизитовЗадолженностиНаДату = РеквизитыЗадолженностиНаДату(СписокДоговоров, ДатаРасчетаЗадолженности);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураРеквизитовЗадолженностиНаДату);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РеквизитыЗадолженностиНаДату(СписокДоговоров, ДатаРасчета)
	
	//СтруктураЗадолженности = Новый Структура;
	//
	//СтруктураРасчетаПоГруппам = Отчеты.АКСЛМБРасчетЗадолженностиНаДату.ПолучитьРасчетЗадолженностиПоГруппам(СписокДоговоров, ДатаРасчета);
	//Если СтруктураРасчетаПоГруппам.Ошибка Тогда
	//	
	//	СтрокаНачальногоЗначенияЗадолженности = ПолучитьСтрокуНачальногоЗначенияЗадолженности();
	//	
	//	СтруктураЗадолженности.Вставить("ЗадолженностьНаДатуОсновнойДолг", 	СтрокаНачальногоЗначенияЗадолженности);
	//	СтруктураЗадолженности.Вставить("ЗадолженностьНаДатуНачисления", 	СтрокаНачальногоЗначенияЗадолженности);
	//	СтруктураЗадолженности.Вставить("ЗадолженностьНаДатуВсего", 		СтрокаНачальногоЗначенияЗадолженности);
	//	
	//	Возврат СтруктураЗадолженности;
	//	
	//КонецЕсли;
	//
	//ИспользоватьВалютныйУчет = ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет");
	//Если ИспользоватьВалютныйУчет Тогда
	//	ВалютаПоУмолчанию = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	//Иначе
	//	ВалютаПоУмолчанию = Неопределено;
	//КонецЕсли;
	//
	//СтруктураЗадолженности.Вставить("ЗадолженностьНаДатуОсновнойДолг", 	ПредставлениеСуммы(СтруктураРасчетаПоГруппам.ОсновнойДолг, ВалютаПоУмолчанию));
	//СтруктураЗадолженности.Вставить("ЗадолженностьНаДатуНачисления", 	ПредставлениеСуммы(СтруктураРасчетаПоГруппам.Начисления, ВалютаПоУмолчанию));
	//СтруктураЗадолженности.Вставить("ЗадолженностьНаДатуВсего", 		ПредставлениеСуммы(СтруктураРасчетаПоГруппам.Всего, ВалютаПоУмолчанию));
	//
	//Возврат СтруктураЗадолженности;
	//
КонецФункции

&НаСервере
Процедура ОбновитьРеквизитыДенежныхСредствНаСервере() Экспорт
	
	СтруктураРеквизитовДС = РеквизитыДенежныхСредств(Объект.Организация, Объект.Подразделение, ВестиУчетПоПодразделениям);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураРеквизитовДС);
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция РеквизитыДенежныхСредств(Организация, Подразделение, ВестиУчетПоПодразделениям)
	
	СтруктураРеквизитов = Новый Структура("НачальныйОстатокДС, ПриходДС, РасходДС, КонечныйОстатокДС");
	
	//ТекДата = ТекущаяДатаСеанса();
	//
	//Запрос = Новый Запрос;
	//
	//Запрос.УстановитьПараметр("Организация", 			Организация);
	//Запрос.УстановитьПараметр("ОтборПоОрганизации", 	ЗначениеЗаполнено(Организация));
	//Запрос.УстановитьПараметр("НачалоПериода", 			НачалоДня(ТекДата));
	//Запрос.УстановитьПараметр("КонецПериода", 			КонецДня(ТекДата));
	//ОтборПоПодразделению = ВестиУчетПоПодразделениям И ЗначениеЗаполнено(Подразделение);
	//Запрос.УстановитьПараметр("ОтборПоПодразделению", ОтборПоПодразделению);
	//Запрос.УстановитьПараметр("Подразделение", Подразделение);
	//	
	//ТекстЗапроса =
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстатокДт КАК НачальныйОстаток,
	//|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт КАК Приход,
	//|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт КАК Расход,
	//|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокДт КАК КонечныйОстаток
	//|ИЗ
	//|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	//|			&НачалоПериода,
	//|			&КонецПериода,
	//|			,
	//|			,
	//|			Счет В (&Счета),
	//|			,
	//|			ВЫБОР
	//|					КОГДА &ОтборПоОрганизации
	//|						ТОГДА Организация = &Организация
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ОтборПоПодразделению
	//|						ТОГДА Подразделение В ИЕРАРХИИ (&Подразделение)
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ) КАК ХозрасчетныйОстаткиИОбороты";
	//
	//
	//АКСЕПСПрямойУчетЕПС = АКСЕПСРегламентированныйУчет.ИспользуетсяУчет(Организация, ТекДата);
	//
	//Если АКСЕПСПрямойУчетЕПС Тогда
	//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Хозрасчетный", "АКСЕПС");
	//	СчетКассаЕПС = ПланыСчетов.Хозрасчетный.НайтиПоКоду("20202");		
	//	СписокСчетов = Новый Массив();
	//	СписокСчетов.Добавить(СчетКассаЕПС);
	//Иначе
	//	// Получим список счетов кассы для отбора
	//	СписокСчетов = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.Касса));
	//	// Уберем из иерархии счета по которым не хотим отбирать
	//	СписокСчетов = ОбщегоНазначенияКлиентСервер.РазностьМассивов(СписокСчетов,
	//		БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.ДенежныеДокументы)); 
	//	СписокСчетов = ОбщегоНазначенияКлиентСервер.РазностьМассивов(СписокСчетов,
	//		БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.ДенежныеДокументыВал)); 
	//КонецЕсли;
	//
	//Запрос.УстановитьПараметр("Счета", СписокСчетов);
	//
	//Запрос.Текст = ТекстЗапроса;
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Если Выборка.Следующий() Тогда 
	//	
	//	ИспользоватьВалютныйУчет = ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет");
	//	Если ИспользоватьВалютныйУчет Тогда
	//		ВалютаПоУмолчанию = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	//	Иначе
	//		ВалютаПоУмолчанию = Неопределено;
	//	КонецЕсли;
	//	
	//	СтруктураРеквизитов.Вставить("НачальныйОстатокДС", 	ПредставлениеСуммы(Выборка.НачальныйОстаток, ВалютаПоУмолчанию, Истина));
	//	СтруктураРеквизитов.Вставить("ПриходДС",			ПредставлениеСуммы(Выборка.Приход, ВалютаПоУмолчанию, Истина));
	//	СтруктураРеквизитов.Вставить("РасходДС",			ПредставлениеСуммы(Выборка.Расход, ВалютаПоУмолчанию, Истина));
	//	СтруктураРеквизитов.Вставить("КонечныйОстатокДС",	ПредставлениеСуммы(Выборка.КонечныйОстаток, ВалютаПоУмолчанию, Истина));
	//	
	//КонецЕсли;
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПредставлениеСуммы(Сумма, Валюта, ОтрицательныеКрасным = Ложь, Жирный = Ложь)
	
	ФорматнаяСтрока = "ЧДЦ=2; ЧН=0";
	
	Если ЗначениеЗаполнено(Валюта) Тогда
		СтроковоеПредставление = СтрШаблон("%1 %2", Формат(Сумма, ФорматнаяСтрока), Валюта);
	Иначе
		СтроковоеПредставление = Формат(Сумма, ФорматнаяСтрока);
	КонецЕсли;
	
	Шрифт = ?(Жирный, Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,, 8, Истина), Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,, 8, Ложь));
	Если ОтрицательныеКрасным Тогда 
		ЦветТекста = ?(Сумма >= 0, ЦветаСтиля.ЦветТекстаИнформационнойПанели, ЦветаСтиля.ВажноеСобытие);
	Иначе
		ЦветТекста = ЦветаСтиля.ЦветТекстаИнформационнойПанели;
	КонецЕсли;
	
	Возврат Новый ФорматированнаяСтрока(СтроковоеПредставление, Шрифт, ЦветТекста);
	
КонецФункции

&НаКлиенте
Процедура ОбновитьРеквизитыЗалогодателя()
	
	//СтруктураКадровыхДанных = ПолучитьСтруктуруКадровыхДанныхЗалогодателяНаСервере(Объект.Залогодатель);
	//ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураКадровыхДанных);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруКадровыхДанныхЗалогодателяНаСервере(Знач Залогодатель)
	
	// Для указания полей кадровых данных см. КадровыйУчетВнутренний.ЗапросВТПостоянныеКадровыеДанныеФизическихЛиц
	//КадровыеДанныеФЛ = КадровыйУчет.КадровыеДанныеФизическихЛиц(
	//	Истина,
	//	Залогодатель, 
	//	"ДокументПредставление, АдресПоПропискеПредставление, ТелефонДомашнийПредставление"
	//);
	//
	//СтруктураКадровыхДанных = Новый Структура(
	//	"ЗалогодательДокумент, ЗалогодательАдрес, ЗалогодательТелефон", "", "", ""
	//);
	//
	//Если КадровыеДанныеФЛ.Количество() > 0 Тогда 
	//	
	//	СтрКадровыеДанные = КадровыеДанныеФЛ[0];
	//	
	//	СтруктураКадровыхДанных.ЗалогодательДокумент	= СтрКадровыеДанные.ДокументПредставление;
	//	СтруктураКадровыхДанных.ЗалогодательАдрес		= СтрКадровыеДанные.АдресПоПропискеПредставление;
	//	СтруктураКадровыхДанных.ЗалогодательТелефон		= СтрКадровыеДанные.ТелефонДомашнийПредставление;
	//	
	//КонецЕсли;
	//
	//Возврат СтруктураКадровыхДанных;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьРеквизитыСтатистикиЗаймов()
	
	СтруктураСтатистикиЗаймов = ПолучитьСтруктуруСтатистикиЗаймовНаСервере(
		Объект.Залогодатель, 
		Объект.Контрагент, 
		Объект.Организация, 
		Объект.Подразделение, 
		ВестиУчетПоПодразделениям
	);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураСтатистикиЗаймов);
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруСтатистикиЗаймовНаСервере(Залогодатель, Контрагент, Организация, Подразделение, ВестиУчетПоПодразделениям)
	
	СтруктураСтатистикиЗаймов = Новый Структура(
		"ЗалоговыеБилетыДействует, ЗалоговыеБилетыПогашено, ЗалоговыеБилетыДругое, ЗалоговыеБилетыВсего, 
		|ЗалоговыйБилетОбщаяСуммаЗаймов, ЗалоговыйБилетОбщаяСуммаПогашений, ЗалоговыеБилетыДатаПоследнегоЗайма, ЗалоговыеБилетыКассовыеДокументы", 
		0, 0, 0, 0,
		0, 0, '00010101', 0
	);
	
	//Запрос = Новый Запрос();
	//Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	//Запрос.УстановитьПараметр("Организация", Организация);
	//Запрос.УстановитьПараметр("ОтборПоОрганизации", ЗначениеЗаполнено(Организация));
	//ОтборПоПодразделению = ВестиУчетПоПодразделениям И ЗначениеЗаполнено(Подразделение);
	//Запрос.УстановитьПараметр("ОтборПоПодразделению", ОтборПоПодразделению);
	//Запрос.УстановитьПараметр("Подразделение", Подразделение);
	//Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	//Запрос.УстановитьПараметр("Контрагент", Контрагент);
	//Запрос.Текст =
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	СУММА(НеСгруппированныеДанные.Действует) КАК Действует,
	//|	СУММА(НеСгруппированныеДанные.Погашено) КАК Погашено,
	//|	СУММА(НеСгруппированныеДанные.Другое) КАК Другое,
	//|	СУММА(НеСгруппированныеДанные.Всего) КАК Всего,
	//|	СУММА(НеСгруппированныеДанные.ОбщаяСуммаЗаймов) КАК ОбщаяСуммаЗаймов,
	//|	СУММА(НеСгруппированныеДанные.ОбщаяСуммаПогашений) КАК ОбщаяСуммаПогашений,
	//|	МАКСИМУМ(НеСгруппированныеДанные.ДатаПоследнегоЗайма) КАК ДатаПоследнегоЗайма,
	//|	СУММА(НеСгруппированныеДанные.КассовыеДокументы) КАК КассовыеДокументы
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		СУММА(ВЫБОР
	//|				КОГДА АКСЛМБСостояниеЗалоговогоБилетаСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.АКСЛМБСостояниеЗалоговогоБилета.Действует)
	//|					ТОГДА 1
	//|				ИНАЧЕ 0
	//|			КОНЕЦ) КАК Действует,
	//|		СУММА(ВЫБОР
	//|				КОГДА АКСЛМБСостояниеЗалоговогоБилетаСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.АКСЛМБСостояниеЗалоговогоБилета.Погашен)
	//|					ТОГДА 1
	//|				ИНАЧЕ 0
	//|			КОНЕЦ) КАК Погашено,
	//|		СУММА(ВЫБОР
	//|				КОГДА НЕ АКСЛМБСостояниеЗалоговогоБилетаСрезПоследних.Состояние В (ЗНАЧЕНИЕ(Перечисление.АКСЛМБСостояниеЗалоговогоБилета.Действует), ЗНАЧЕНИЕ(Перечисление.АКСЛМБСостояниеЗалоговогоБилета.Погашен))
	//|					ТОГДА 1
	//|				ИНАЧЕ 0
	//|			КОНЕЦ) КАК Другое,
	//|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АКСЛМБСостояниеЗалоговогоБилетаСрезПоследних.ДоговорКонтрагента) КАК Всего,
	//|		0 КАК ОбщаяСуммаЗаймов,
	//|		0 КАК ОбщаяСуммаПогашений,
	//|		&ПустаяДата КАК ДатаПоследнегоЗайма,
	//|		0 КАК КассовыеДокументы
	//|	ИЗ
	//|		РегистрСведений.АКСЛМБСостояниеЗалоговогоБилета.СрезПоследних(
	//|				,
	//|				ВЫБОР
	//|						КОГДА &ОтборПоОрганизации
	//|							ТОГДА ДоговорКонтрагента.Организация = &Организация
	//|						ИНАЧЕ ИСТИНА
	//|					КОНЕЦ
	//|					И ДоговорКонтрагента.Владелец.АКСЛМБФизическоеЛицо = &Залогодатель) КАК АКСЛМБСостояниеЗалоговогоБилетаСрезПоследних
	//|	ГДЕ
	//|		ВЫБОР
	//|				КОГДА &ОтборПоПодразделению
	//|					ТОГДА АКСЛМБСостояниеЗалоговогоБилетаСрезПоследних.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)
	//|				ИНАЧЕ ИСТИНА
	//|			КОНЕЦ
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		СУММА(АКСЛМБУчетПредоставленныхЗаймовОбороты.СуммаЗаймаПриход),
	//|		СУММА(АКСЛМБУчетПредоставленныхЗаймовОбороты.СуммаЗаймаРасход),
	//|		МАКСИМУМ(АКСЛМБУчетПредоставленныхЗаймовОбороты.Договор.Дата),
	//|		0
	//|	ИЗ
	//|		РегистрНакопления.АКСЛМБУчетПредоставленныхЗаймов.Обороты(
	//|				,
	//|				,
	//|				,
	//|				ВЫБОР
	//|						КОГДА &ОтборПоОрганизации
	//|							ТОГДА Организация = &Организация
	//|						ИНАЧЕ ИСТИНА
	//|					КОНЕЦ
	//|					И Контрагент.АКСЛМБФизическоеЛицо = &Залогодатель) КАК АКСЛМБУчетПредоставленныхЗаймовОбороты
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		&ПустаяДата,
	//|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Деньги.Ссылка)
	//|	ИЗ
	//|		ЖурналДокументов.Деньги КАК Деньги
	//|	ГДЕ
	//|		Деньги.Проведен
	//|		И Деньги.Контрагент = &Контрагент
	//|		И ВЫБОР
	//|				КОГДА &ОтборПоОрганизации
	//|					ТОГДА Деньги.Организация = &Организация
	//|				ИНАЧЕ ИСТИНА
	//|			КОНЕЦ
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		0,
	//|		АКСЛМБУчетНачисленийПоЗаймамОбороты.СуммаРасход,
	//|		&ПустаяДата,
	//|		0
	//|	ИЗ
	//|		РегистрНакопления.АКСЛМБУчетНачисленийПоЗаймам.Обороты(
	//|				,
	//|				,
	//|				,
	//|				ВЫБОР
	//|						КОГДА &ОтборПоОрганизации
	//|							ТОГДА Организация = &Организация
	//|						ИНАЧЕ ИСТИНА
	//|					КОНЕЦ
	//|					И Контрагент.АКСЛМБФизическоеЛицо = &Залогодатель
	//|					И ВидНачисления = ЗНАЧЕНИЕ(Справочник.Номенклатура.АКСЛМБПроцентЗаПользованиеЗаймом)) КАК АКСЛМБУчетНачисленийПоЗаймамОбороты) КАК НеСгруппированныеДанные";
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Если Выборка.Следующий() Тогда 
	//	
	//	СтруктураСтатистикиЗаймов.ЗалоговыеБилетыДействует = Новый ФорматированнаяСтрока(Формат(Выборка.Действует, "ЧН=0"));
	//	СтруктураСтатистикиЗаймов.ЗалоговыеБилетыПогашено = Новый ФорматированнаяСтрока(Формат(Выборка.Погашено, "ЧН=0"));
	//	СтруктураСтатистикиЗаймов.ЗалоговыеБилетыДругое = Новый ФорматированнаяСтрока(Формат(Выборка.Другое, "ЧН=0"));
	//	СтруктураСтатистикиЗаймов.ЗалоговыеБилетыВсего = Новый ФорматированнаяСтрока(Формат(Выборка.Всего, "ЧН=0"));
	//	СтруктураСтатистикиЗаймов.ЗалоговыйБилетОбщаяСуммаЗаймов = Новый ФорматированнаяСтрока(Формат(Выборка.ОбщаяСуммаЗаймов, "ЧН='0 руб.'; ЧФ='Ч ""руб.""'"));
	//	СтруктураСтатистикиЗаймов.ЗалоговыйБилетОбщаяСуммаПогашений = Новый ФорматированнаяСтрока(Формат(Выборка.ОбщаяСуммаПогашений, "ЧН='0 руб.'; ЧФ='Ч ""руб.""'"));
	//	СтруктураСтатистикиЗаймов.ЗалоговыеБилетыДатаПоследнегоЗайма = Новый ФорматированнаяСтрока(Формат(Выборка.ДатаПоследнегоЗайма, "ДФ='dd.MM.yyyy ""г.""'; ДП=-"));
	//	СтруктураСтатистикиЗаймов.ЗалоговыеБилетыКассовыеДокументы = Новый ФорматированнаяСтрока(Формат(Выборка.КассовыеДокументы, "ЧН=0"));
	//	
	//КонецЕсли;
	
	Возврат СтруктураСтатистикиЗаймов;
	
КонецФункции

&НаКлиенте
Процедура УстановитьНачальныеЗначенияРеквизитовЗадолженности()
	
	СтрокаНачальныхЗначений = ПолучитьСтрокуНачальногоЗначенияЗадолженности();
	
	ЗадолженностьНаДатуОсновнойДолг = СтрокаНачальныхЗначений;
	ЗадолженностьНаДатуНачисления 	= СтрокаНачальныхЗначений;
	ЗадолженностьНаДатуВсего 		= СтрокаНачальныхЗначений;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНачальныеЗначенияРеквизитовЗадолженностиНаСервере()
	
	СтрокаНачальныхЗначений = ПолучитьСтрокуНачальногоЗначенияЗадолженности();
	
	ЗадолженностьНаДатуОсновнойДолг = СтрокаНачальныхЗначений;
	ЗадолженностьНаДатуНачисления 	= СтрокаНачальныхЗначений;
	ЗадолженностьНаДатуВсего 		= СтрокаНачальныхЗначений;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтрокуНачальногоЗначенияЗадолженности()
	
	Шрифт 		= Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,, 8, Ложь);
	ЦветТекста 	= ЦветаСтиля.ЦветТекстаИнформационнойПанели;
	
	Возврат Новый ФорматированнаяСтрока("-", Шрифт, ЦветТекста);
	
КонецФункции

&НаКлиенте
Процедура УстановитьДанныеЗаголовкаЗадолженностиНаДату()
	
	КоличествоВыбранныхЗалоговыхБилетов = ВыбранныеЗалоговыеБилеты.Количество();
	Если КоличествоВыбранныхЗалоговыхБилетов > 0 Тогда
		Если КоличествоВыбранныхЗалоговыхБилетов = 1 Тогда
			ЗадолженностьНаДатуДанныеЗаголовка = ВыбранныеЗалоговыеБилеты[0].Значение;
		Иначе
			ЗадолженностьНаДатуДанныеЗаголовка = ВыбранныеЗалоговыеБилеты.Количество();
		КонецЕсли;
	Иначе
		
		ТекДанные = Элементы.ЗалоговыеБилеты.ТекущиеДанные;
		ТекЗалоговыйБилет = Неопределено;
		Если ЗначениеЗаполнено(Объект.ЗалоговыйБилет) Тогда 
			ТекЗалоговыйБилет = Объект.ЗалоговыйБилет;
		ИначеЕсли ТекДанные <> Неопределено И ТекДанные.Свойство("ЗалоговыйБилет") Тогда
			ТекЗалоговыйБилет = ТекДанные.ЗалоговыйБилет;
		КонецЕсли;
		
		ЗадолженностьНаДатуДанныеЗаголовка = ТекЗалоговыйБилет;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗадолженностьНаДатуДатаРасчета(Дата = Неопределено)
	
	Если Дата = Неопределено Тогда 
		ДатаРасчетаЗадолженности = КонецДня(ОбщегоНазначенияКлиент.ДатаСеанса());
	Иначе
		ДатаРасчетаЗадолженности = КонецДня(Дата);
	КонецЕсли;
	
	ЗадолженностьНаДатуДатаРасчета = ПредставлениеДатыРасчета(ДатаРасчетаЗадолженности);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПредставлениеДатыРасчета(Дата)
	
	Возврат Новый ФорматированнаяСтрока(
		Формат(Дата, "ДФ='dd.MM.yyyy ""г.""'"), Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,, 8), ЦветаСтиля.ГиперссылкаЦвет,, "ДатаРасчетаЗадолженности"
	);	
	
КонецФункции

#КонецОбласти

#Область СозданиеОпераций

&НаКлиенте
Процедура СоздатьДокумент(ИмяДокумента)
	
	МассивСтруктурОснований = Новый Массив;
	
	ЕстьОтмеченныеЗалоговыеБилеты = ВыбранныеЗалоговыеБилеты.Количество() > 0;
	
	МассивИменПервичныхДокументов = Новый Массив;
	МассивИменПервичныхДокументов.Добавить("АКСЛМБВыдачаЗайма");
	МассивИменПервичныхДокументов.Добавить("АКСЛМБПриемНаХранение");
	
	Если ЕстьОтмеченныеЗалоговыеБилеты И МассивИменПервичныхДокументов.Найти(ИмяДокумента) = Неопределено Тогда
		
		Для Каждого ЭлементСписка Из ВыбранныеЗалоговыеБилеты Цикл
			МассивСтруктурОснований.Добавить(ПолучитьСтруктуруОснованиеДляСозданияДокумента(ИмяДокумента, ЭлементСписка.Значение));
		КонецЦикла;
		
	Иначе
		
		Если Не ЗначениеЗаполнено(Объект.Залогодатель) И ИмяДокумента <> "АКСЛМБВыдачаЗайма" Тогда
			
			ПоказатьПредупреждение(, НСтр("ru = 'Не задан отбор по залогодателю.'"),, "Предупреждение");
			
			Возврат;
			
		КонецЕсли;
		
		ТекДанные = Элементы.ЗалоговыеБилеты.ТекущиеДанные;
		ТекЗалоговыйБилет = Неопределено;
		Если ЗначениеЗаполнено(Объект.ЗалоговыйБилет) Тогда 
			ТекЗалоговыйБилет = Объект.ЗалоговыйБилет;
		ИначеЕсли ТекДанные <> Неопределено И ТекДанные.Свойство("ЗалоговыйБилет") Тогда
			ТекЗалоговыйБилет = ТекДанные.ЗалоговыйБилет;
		КонецЕсли;
		
		МассивСтруктурОснований.Добавить(ПолучитьСтруктуруОснованиеДляСозданияДокумента(ИмяДокумента, ТекЗалоговыйБилет));
	
	КонецЕсли;
	
	Для Каждого СтруктураОснование Из МассивСтруктурОснований Цикл
	
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Основание", СтруктураОснование);
		
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить("Документ");
		МассивСтрок.Добавить(ИмяДокумента);
		МассивСтрок.Добавить("ФормаОбъекта");
		
		ИмяФормыДокумента = СтрСоединить(МассивСтрок, ".");
		
		ОткрытьФорму(
			ИмяФормыДокумента,
			ПараметрыОткрытия,
			ЭтаФорма,,,,, 
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
		);
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтруктуруОснованиеДляСозданияДокумента(ИмяДокумента, ЗалоговыйБилет)
	
	СтруктураОснование = Новый Структура;
	СтруктураОснование.Вставить("Организация", 				Объект.Организация);
	СтруктураОснование.Вставить("Контрагент", 				Объект.Контрагент);
	СтруктураОснование.Вставить("ПодразделениеОрганизации", Объект.Подразделение);
	СтруктураОснование.Вставить("Склад",					Объект.Склад);
	
	Если ИмяДокумента = "АКСЛМБВыдачаЗайма"
	  Или ИмяДокумента = "АКСЛМБПриемНаХранение" Тогда	
		СтруктураОснование.Вставить("Клиент", Объект.Залогодатель);
		
	ИначеЕсли ИмяДокумента = "АКСЛМБДоверенность"
	  Или ИмяДокумента = "АКСЛМБАннулированиеДоверенности" Тогда
		СтруктураОснование.Вставить("Клиент", Объект.Залогодатель);
		СтруктураОснование.Вставить("ДоговорКонтрагента", ЗалоговыйБилет);
	Иначе
		СтруктураОснование.Вставить("ДоговорКонтрагента", ЗалоговыйБилет);
		СтруктураОснование.Вставить("Клиент", Объект.Залогодатель);
		Товары = КоличествоПредметовПоДоговору(ЗалоговыйБилет, Объект.Организация, Объект.Контрагент);
		СтруктураОснование.Вставить("Товары",Товары);		
	КонецЕсли;
	
	Возврат СтруктураОснование;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКонтрагентаЗалогодателяНаСервере(Знач Залогодатель)
	
	//Возврат АКСЛМБОперацииЗаймаСервер.НайтиКонтрагентаПоФизЛицу(Залогодатель);
	
КонецФункции

&НаСервереБезКонтекста
Функция КоличествоПредметовПоДоговору(Договор, Организация, Контрагент = Неопределено) Экспорт	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АКСЛМБУчетПредоставленныхЗаймовОстатки.ПредметЗалога КАК ПредметЗалога
		|ИЗ
		|	РегистрНакопления.АКСЛМБУчетПредоставленныхЗаймов.Остатки(
		|			,
		|			Договор = &Договор
		|				И Организация = &Организация
		|				И Контрагент = &Контрагент) КАК АКСЛМБУчетПредоставленныхЗаймовОстатки";
	
	Запрос.УстановитьПараметр("Договор", 	Договор);
	Запрос.УстановитьПараметр("Организация",Организация);
	
	Если Не Контрагент = Неопределено Тогда 	
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Иначе
		Запрос.УстановитьПараметр("Контрагент", Договор.Владелец);
	КонецЕсли;
			
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи.Количество(); 

КонецФункции

#КонецОбласти

#Область ПодборЗалогодателя

&НаСервереБезКонтекста
Функция ДанныеВыбора(ПараметрыПолученияДанных)
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ДокументыФизическихЛиц) Тогда 
		Возврат Справочники.ФизическиеЛица.ПолучитьДанныеВыбора(ПараметрыПолученияДанных);
	КонецЕсли;
	
	СтрокаПоиска = СокрЛП(ПараметрыПолученияДанных.СтрокаПоиска);
	
	ПозицияНомера 			= СтрНайти(СтрокаПоиска, "№");
	СтрокаЗаданаФорматно 	= ПозицияНомера > 0;
	
	Запрос = Новый Запрос;
	
	Если СтрокаЗаданаФорматно Тогда 
		
		СтрокаСерия = СокрЛП(Лев(СтрокаПоиска, ПозицияНомера - 1));
		СтрокаНомер = СокрЛП(Сред(СтрокаПоиска, ПозицияНомера + 1));
		
		ОтбиратьПоСерии 	= Не ПустаяСтрока(СтрокаСерия);
		ОтбиратьПоНомеру 	= Не ПустаяСтрока(СтрокаНомер);
		
		Если Не ОтбиратьПоСерии И Не ОтбиратьПоНомеру Тогда 
			Возврат Справочники.ФизическиеЛица.ПолучитьДанныеВыбора(ПараметрыПолученияДанных);
		КонецЕсли;
		
		Запрос.УстановитьПараметр("СтрокаСерия", 		"%" + СтрокаСерия + "%");
		Запрос.УстановитьПараметр("СтрокаНомер", 		"%" + СтрокаНомер + "%");
		Запрос.УстановитьПараметр("ОтбиратьПоСерии", 	ОтбиратьПоСерии);
		Запрос.УстановитьПараметр("ОтбиратьПоНомеру", 	ОтбиратьПоНомеру);
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 50
		|	ДокументыФизическихЛицСрезПоследних.Физлицо КАК Ссылка,
		|	ДокументыФизическихЛицСрезПоследних.Физлицо.Представление КАК СсылкаПредставление,
		|	ДокументыФизическихЛицСрезПоследних.Представление КАК ДокументПредставление
		|ИЗ
		|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛицСрезПоследних
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ОтбиратьПоСерии
		|				ТОГДА ДокументыФизическихЛицСрезПоследних.Серия ПОДОБНО &СтрокаСерия
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ОтбиратьПоНомеру
		|				ТОГДА ДокументыФизическихЛицСрезПоследних.Номер ПОДОБНО &СтрокаНомер
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
			
		
	Иначе
		
		// задана либо серия, либо номер
		
		Запрос.УстановитьПараметр("СтрокаПоиска", "%" + СтрокаПоиска + "%");
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 50
		|	ДокументыФизическихЛицСрезПоследних.Физлицо КАК Ссылка,
		|	ДокументыФизическихЛицСрезПоследних.Физлицо.Представление КАК СсылкаПредставление,
		|	ДокументыФизическихЛицСрезПоследних.Представление КАК ДокументПредставление
		|ИЗ
		|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛицСрезПоследних
		|ГДЕ
		|	ДокументыФизическихЛицСрезПоследних.Серия ПОДОБНО &СтрокаПоиска
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 50
		|	ДокументыФизическихЛицСрезПоследних.Физлицо,
		|	ДокументыФизическихЛицСрезПоследних.Физлицо.Представление,
		|	ДокументыФизическихЛицСрезПоследних.Представление
		|ИЗ
		|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛицСрезПоследних
		|ГДЕ
		|	ДокументыФизическихЛицСрезПоследних.Номер ПОДОБНО &СтрокаПоиска";
		
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	
	ШрифтКоманды   = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста);
	ШрифтПодстроки = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста, , , Истина);
	ЦветПодстроки  = ЦветаСтиля.ЦветУспешногоПоиска;
	
	Список = Новый СписокЗначений;
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаПодбора = Выборка.ДокументПредставление + " (" + Выборка.СсылкаПредставление + ")";
		
		Если СтрокаЗаданаФорматно Тогда 
			
			ПозицияСерии 	= СтрНайти(СтрокаПодбора, СтрокаСерия);
			ПозицияНомера 	= СтрНайти(СтрокаПодбора, СтрокаНомер);
			
			Если ОтбиратьПоСерии И Не ОтбиратьПоНомеру Тогда 
				// только по серии
				МассивСтрокПоиска = Новый Массив;
				МассивСтрокПоиска.Добавить(СтрокаСерия);
				Представление = ПредставлениеДанныхВыбора(СтрокаПодбора, МассивСтрокПоиска, ЦветПодстроки, ШрифтКоманды, ШрифтПодстроки);
				
			ИначеЕсли Не ОтбиратьПоСерии И ОтбиратьПоНомеру Тогда 
				// только по номеру
				МассивСтрокПоиска = Новый Массив;
				МассивСтрокПоиска.Добавить(СтрокаНомер);
				НачальнаяПозицияПоиска = СтрНайти(СтрокаПодбора, "№");
				Представление = ПредставлениеДанныхВыбора(СтрокаПодбора, МассивСтрокПоиска, ЦветПодстроки, ШрифтКоманды, ШрифтПодстроки, НачальнаяПозицияПоиска);
				
			Иначе
				// и по номеру, и по серии
				МассивСтрокПоиска = Новый Массив;
				МассивСтрокПоиска.Добавить(СтрокаСерия);
				МассивСтрокПоиска.Добавить(СтрокаНомер);
				Представление = ПредставлениеДанныхВыбора(СтрокаПодбора, МассивСтрокПоиска, ЦветПодстроки, ШрифтКоманды, ШрифтПодстроки);
				
			КонецЕсли;
			
		Иначе
			
			МассивСтрокПоиска = Новый Массив;
			МассивСтрокПоиска.Добавить(СтрокаПоиска);
			Представление = ПредставлениеДанныхВыбора(СтрокаПодбора, МассивСтрокПоиска, ЦветПодстроки, ШрифтКоманды, ШрифтПодстроки);
			
		КонецЕсли;
		
		Список.Добавить(Выборка.Ссылка, Представление);
		
	КонецЦикла;
	
	Возврат Список;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПредставлениеДанныхВыбора(Знач СтрокаПодбора, Знач МассивСтрокПоиска, Знач ЦветПодстроки, Знач ШрифтКоманды, Знач ШрифтПодстроки, Знач НачальнаяПозицияПоиска = 1)
	
	// Список, где значение - позиция искомой строки, представление - сама строка поиска
	СписокСтрокПоиска = Новый СписокЗначений;
	Для к = 0 По МассивСтрокПоиска.ВГраница() Цикл
		СписокСтрокПоиска.Добавить(СтрНайти(СтрокаПодбора, МассивСтрокПоиска[к],, НачальнаяПозицияПоиска), МассивСтрокПоиска[к]);
	КонецЦикла;
	
	СписокСтрокПоиска.СортироватьПоЗначению();
	
	МассивФорматированныхСтрок = Новый Массив;
	
	ТекСтрокаПодбора = СтрокаПодбора;
	
	Для к = 0 По СписокСтрокПоиска.Количество() - 1 Цикл
		
		СтрокаПоиска = СписокСтрокПоиска[к].Представление;
		
		ПозицияСтрокиПоиска = СтрНайти(ТекСтрокаПодбора, СтрокаПоиска,, ?(к = 0, НачальнаяПозицияПоиска, 1));
		
		Если ПозицияСтрокиПоиска > 1 Тогда
			
			ПодобраннаяСтрока1 = Лев(ТекСтрокаПодбора, ПозицияСтрокиПоиска - 1);
			
			МассивФорматированныхСтрок.Добавить(Новый ФорматированнаяСтрока(ПодобраннаяСтрока1, ШрифтКоманды));
			МассивФорматированныхСтрок.Добавить(Новый ФорматированнаяСтрока(СтрокаПоиска, ШрифтПодстроки, ЦветПодстроки));
			
		Иначе
			
			МассивФорматированныхСтрок.Добавить(Новый ФорматированнаяСтрока(СтрокаПоиска, ШрифтКоманды, ЦветПодстроки));
			
		КонецЕсли;
		
		// сдвигаем текущую строку поиска
		ТекСтрокаПодбора = Сред(ТекСтрокаПодбора, ПозицияСтрокиПоиска + СтрДлина(СтрокаПоиска));
	
	КонецЦикла;
	
	Если Не ПустаяСтрока(ТекСтрокаПодбора) Тогда 
		МассивФорматированныхСтрок.Добавить(Новый ФорматированнаяСтрока(ТекСтрокаПодбора, ШрифтКоманды));
	КонецЕсли;
	
	Представление = Новый ФорматированнаяСтрока(МассивФорматированныхСтрок);
	
	Возврат Представление;

КонецФункции

#КонецОбласти

#Область РаботаСНастройками

&НаСервере
Процедура ЗагрузитьНастройкиНаСервере()
	
	Объект.Организация = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"ЛБ_РабочееМестоТовароведа",
		"Организация",
		БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация")
	);
	
	Если ВестиУчетПоПодразделениям Тогда 
		Объект.Подразделение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"ЛБ_РабочееМестоТовароведа",
			"Подразделение",
			БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновноеПодразделениеОрганизации")
		);
	КонецЕсли;	
		
	Объект.Склад = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"ЛБ_РабочееМестоТовароведа",
		"Склад",
		Справочники.Склады.ПолучитьСкладПоУмолчанию()
	);
	
	ЗагрузитьНастройкуВидыДоговоровЗаймаХранения();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкуВидыДоговоровЗаймаХранения()
	
	СписокВидовДоговоровПоУмолчанию = Новый СписокЗначений;
	
	ФО_УчетЗаймов = ПолучитьФункциональнуюОпцию("АКСЛМБВестиУчетЗаймов");
	Если ФО_УчетЗаймов Тогда
		СписокВидовДоговоровПоУмолчанию.Добавить(Перечисления.АКСЛМБВидыДоговоров.Займ);
	КонецЕсли;
	
	ФО_УчетХранения = ПолучитьФункциональнуюОпцию("АКСЛМБВестиУчетИмуществаНаХранении");
	Если ФО_УчетХранения Тогда
		СписокВидовДоговоровПоУмолчанию.Добавить(Перечисления.АКСЛМБВидыДоговоров.Хранение);
	КонецЕсли;
	
	Объект.ВидыДоговоровЗаймаХранения = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"ЛБ_РабочееМестоТовароведа",
		"ВидыДоговоровЗаймаХранения",
		СписокВидовДоговоровПоУмолчанию
	);
	
	ЭлементЗайм = Объект.ВидыДоговоровЗаймаХранения.НайтиПоЗначению(Перечисления.АКСЛМБВидыДоговоров.Займ);
	Если ФО_УчетЗаймов Тогда
		Если Не ФО_УчетХранения И ЭлементЗайм = Неопределено Тогда
			Объект.ВидыДоговоровЗаймаХранения.Добавить(Перечисления.АКСЛМБВидыДоговоров.Займ);
			НастройкиИзменились = Истина;
		КонецЕсли;
	Иначе
		Если ЭлементЗайм <> Неопределено Тогда
			Объект.ВидыДоговоровЗаймаХранения.Удалить(ЭлементЗайм);
			НастройкиИзменились = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ЭлементХранение = Объект.ВидыДоговоровЗаймаХранения.НайтиПоЗначению(Перечисления.АКСЛМБВидыДоговоров.Хранение);
	Если ФО_УчетХранения Тогда 
		Если Не ФО_УчетЗаймов И ЭлементХранение = Неопределено Тогда
			Объект.ВидыДоговоровЗаймаХранения.Добавить(Перечисления.АКСЛМБВидыДоговоров.Хранение);
			НастройкиИзменились = Истина;
		КонецЕсли;
	Иначе
		Если ЭлементХранение <> Неопределено Тогда
			Объект.ВидыДоговоровЗаймаХранения.Удалить(ЭлементХранение);
			НастройкиИзменились = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ВидыДоговоровЗаймаХранения = Объект.ВидыДоговоровЗаймаХранения; // по умолчанию равны

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыНастроек(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда 
		
		ЗаполнитьЗначенияСвойств(Объект, Результат);
		
		Если Результат.Свойство("Организация") Тогда 
			УстановитьОтборПоОрганизации();
		КонецЕсли;
		
		Если Результат.Свойство("Подразделение") Тогда
			УстановитьОтборПоПодразделению();
		КонецЕсли;
		
		ОбновитьРеквизитыДенежныхСредств();
		
		УправлениеФормойНаКлиенте();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область КассоваяСмена

&НаКлиенте
Процедура ОткрытьСменуПослеВыбораУстройства(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	//Если РезультатВыбора = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//ОчиститьСообщения();
	//Доступность = Ложь;

	//ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыВыполненияОперации();
	//Кассир = "";
	//СтандартнаяОбработка = Истина;
	//МенеджерОборудованияКлиентСерверПереопределяемый.ОбработкаЗаполненияИмяКассира(Кассир, СтандартнаяОбработка); 
	//ПараметрыОперации.Кассир = ?(Не СтандартнаяОбработка, Кассир, НСтр("ru='Администратор'")); 
	//
	//ДополнительныеПараметры = Новый Структура();
	//Если МенеджерОборудованияКлиентПовтИсп.ИспользуетсяЧекопечатающиеУстройства() Тогда
	//	МодульКассовыеСменыКлиентПереопределяемый = ОбщегоНазначенияКлиент.ОбщийМодуль("КассовыеСменыКлиентПереопределяемый");
	//	МодульКассовыеСменыКлиентПереопределяемый.УправлениеФУЗаполнитьДополнительныеПараметрыПередОткрытиемСмены(
	//		РезультатВыбора,
	//		ДополнительныеПараметры
	//	);
	//КонецЕсли;
	//
	//ОповещениеПриЗавершении = Новый ОписаниеОповещения("ОперацияЗавершение", ЭтотОбъект);
	//ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьОткрытиеСменыНаФискальномУстройстве(
	//	ОповещениеПриЗавершении,
	//	УникальныйИдентификатор,
	//	РезультатВыбора.ИдентификаторУстройства,
	//	ПараметрыОперации,
	//	ДополнительныеПараметры
	//);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСменуПослеВыбораУстройства(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	//Если РезультатВыбора = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;

	//Доступность = Ложь;
	//
	//ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыВыполненияОперации();
	//Кассир = "";
	//СтандартнаяОбработка = Истина;
	//МенеджерОборудованияКлиентСерверПереопределяемый.ОбработкаЗаполненияИмяКассира(Кассир, СтандартнаяОбработка); 
	//ПараметрыОперации.Кассир = ?(Не СтандартнаяОбработка, Кассир, НСтр("ru='Администратор'")); 
	//
	//ОповещениеПриЗавершении = Новый ОписаниеОповещения("ОперацияЗавершение", ЭтотОбъект);
	//ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьЗакрытиеСменыНаФискальномУстройстве(
	//	ОповещениеПриЗавершении,
	//	УникальныйИдентификатор,
	//	ПараметрыОперации,
	//	РезультатВыбора
	//);
	
КонецПроцедуры

&НаКлиенте
Процедура ОперацияЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Доступность = Истина;
	
	ТекстСообщения = ?(РезультатВыполнения.Результат, НСтр("ru='Операция успешно завершена.'"), РезультатВыполнения.ОписаниеОшибки);
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти

#Область РежимЗаймаХранения

&НаКлиенте
Процедура ОбработатьИзменениеРежимаЗаймаХранения(Режим)
	
	Если Режим = "Займы" Тогда
		
		ВидДоговора = ПредопределенноеЗначение("Перечисление.АКСЛМБВидыДоговоров.Займ");
		ЭлементРежимЗаймыХранение = Элементы.ФормаРежимЗаймы;
		
	Иначе
		// Хранение
		ВидДоговора = ПредопределенноеЗначение("Перечисление.АКСЛМБВидыДоговоров.Хранение");
		ЭлементРежимЗаймыХранение = Элементы.ФормаРежимХранение;
		
	КонецЕсли;
	
	ЭлементРежимЗаймыХранение.Пометка = Не ЭлементРежимЗаймыХранение.Пометка;
	
	ЭлементПоВидуДоговора = ВидыДоговоровЗаймаХранения.НайтиПоЗначению(ВидДоговора);
	Если ЭлементРежимЗаймыХранение.Пометка Тогда
		Если ЭлементПоВидуДоговора = Неопределено Тогда
			ВидыДоговоровЗаймаХранения.Добавить(ВидДоговора);
		КонецЕсли;
	Иначе
		Если ЭлементПоВидуДоговора <> Неопределено Тогда 
			ВидыДоговоровЗаймаХранения.Удалить(ЭлементПоВидуДоговора);
		КонецЕсли;
	КонецЕсли;
	
	УстановитьОтборПоВидуДоговора();
	
	УправлениеФормойНаКлиенте();
	
КонецПроцедуры

#КонецОбласти

#Область Штрихкодирование

&НаКлиенте
Процедура ПодключениеОборудованияЗавершено(РезультатВыполнения, Параметры) Экспорт
	
	Если Не РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр( "ru = 'При подключении оборудования произошла ошибка:""%ОписаниеОшибки%"".'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	Иначе
		ТекстСообщения = НСтр("ru = 'Оборудование подключено.'" );
	КонецЕсли;
	
	СканерШтрихкодаПодключен = РезультатВыполнения.Результат;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьСканерШКЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если Не РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр("ru = 'При отключении оборудования произошла ошибка: ""%1"".'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	Иначе
		СканерШтрихкодаПодключен = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаСервере
Процедура ВыполнитьНачальнуюНастройкуДинамическихСписковНаСервере()
	
	ЗалоговыеБилетыПоляГруппировки = Новый Массив;
	ЗалоговыеБилетыПоляГруппировки.Добавить("ОценкаПредмета");
	ЗалоговыеБилетыПоляГруппировки.Добавить("СуммаЗайма");
	
	ЗалоговыеБилетыПоляПорядка = Новый Массив;
	ЗалоговыеБилетыПоляПорядка.Добавить("ОценкаПредмета");
	ЗалоговыеБилетыПоляПорядка.Добавить("СуммаЗайма");
	
	ЗалоговыеБилетыПоляОтбора = Новый Массив;
	ЗалоговыеБилетыПоляОтбора.Добавить("ОценкаПредмета");
	ЗалоговыеБилетыПоляОтбора.Добавить("СуммаЗайма");
	
	ЗалоговыеБилеты.УстановитьОграниченияИспользованияВГруппировке(ЗалоговыеБилетыПоляГруппировки);
	ЗалоговыеБилеты.УстановитьОграниченияИспользованияВПорядке(ЗалоговыеБилетыПоляПорядка);
	ЗалоговыеБилеты.УстановитьОграниченияИспользованияВОтборе(ЗалоговыеБилетыПоляОтбора);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьУчетПоПодразделениям()
	
	//ВестиУчетПоПодразделениям = АКСЛМБУчетЗаймов.ВестиУчетПоПодразделениям();  
	ВестиУчетПоПодразделениям = Ложь;

КонецПроцедуры

&НаСервере
Процедура ИнициализироватьСписокСостоянийИсключений()
	
	СостоянияЗБ = Перечисления.АКСЛМБСостояниеЗалоговогоБилета;
	
	СписокСостоянийИсключений.Добавить(СостоянияЗБ.Погашен);
	СписокСостоянийИсключений.Добавить(СостоянияЗБ.Реализован);
	СписокСостоянийИсключений.Добавить(СостоянияЗБ.НаОтветственномХранении);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьАвтоПодборОкончаниеВводаТекстаЗалогодателя(Текст, ПараметрыПолученияДанных, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ПустаяСтрока(Текст) Тогда 
		Возврат;
	КонецЕсли;
	
	СтрокаБезСимволаНомер = СтрЗаменить(Текст, "№", "");
	Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(СтрокаБезСимволаНомер, , Ложь) Тогда 
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = ДанныеВыбора(ПараметрыПолученияДанных);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКонтрагентаЗалогодателяПоДоговору(Договор)
	
	КонтрагентЗалогодатель = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "Залогодатель", Истина);
	
	СтруктураКонтрагентЗалогодатель = Новый Структура("Залогодатель", КонтрагентЗалогодатель.Залогодатель);
	
	Возврат СтруктураКонтрагентЗалогодатель;
	
КонецФункции

&НаСервере
Функция ПолучитьТекущиеЗалоговыеБилеты()
	
	Схема 		= Элементы.ЗалоговыеБилеты.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки 	= Элементы.ЗалоговыеБилеты.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		Настройки.Отбор, 
		"Состояние", 
		ВидСравненияКомпоновкиДанных.НеВСписке,
		СписокСостоянийИсключений,, 
		Истина
	);
	
	КомпоновщикМакета 	= Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки 	= КомпоновщикМакета.Выполнить(Схема, Настройки,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ТаблицаЗалоговыхБилетов = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Список = Новый СписокЗначений;
	Список.ЗагрузитьЗначения(ТаблицаЗалоговыхБилетов.ВыгрузитьКолонку("ЗалоговыйБилет"));
	
	Возврат Список;
	
КонецФункции

// Обновить выбранные залоговые билеты в соответствии с установленными отборами
//
&НаКлиенте
Процедура ОбновитьВыбранныеЗалоговыеБилеты()
	
	кол = ВыбранныеЗалоговыеБилеты.Количество() - 1;
	Если кол < 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеЗБ = ПолучитьТекущиеЗалоговыеБилеты();
	
	Если ТекущиеЗБ.Количество() = 0 Тогда
		ВыбранныеЗалоговыеБилеты.Очистить();
	Иначе
		Пока кол >= 0 Цикл
			Если ТекущиеЗБ.НайтиПоЗначению(ВыбранныеЗалоговыеБилеты[кол].Значение) = Неопределено Тогда
				ВыбранныеЗалоговыеБилеты.Удалить(кол);
			КонецЕсли;
			кол = кол - 1;
		КонецЦикла;
	КонецЕсли;	
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		ЗалоговыеБилеты,
		"ВыбранныеЗалоговыеБилеты",
		ВыбранныеЗалоговыеБилеты
	);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКонтрагентаПоЗалогодателю()
	
	Если ЗначениеЗаполнено(Объект.Залогодатель) Тогда 
		Объект.Контрагент = ПолучитьКонтрагентаЗалогодателяНаСервере(Объект.Залогодатель);
	Иначе
		Объект.Контрагент = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПолученныйКод(Штрихкод)
	
	//Результат = АКСЛМБШтрихкодированиеСервер.ПолучитьДоговорПоШтрихкоду(Штрихкод);
	//
	//Если Результат.Ошибка Тогда
	//	ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ОписаниеОшибки);
	//	Возврат;
	//Иначе
	//	НайденныйДоговор = Результат.Договор;			
	//КонецЕсли;

	//ОбработатьПолученныйКодНаСервере(НайденныйДоговор);
	//ЗалогодательПриИзменении(Неопределено);
	//УстановитьОтборПоЗалоговомуБилету(Объект.ЗалоговыйБилет, "ЗалоговыеБилеты");
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПолученныйКодНаСервере(НайденныйДоговор)
	
	// Добавим собранные данные на форму
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Контрагенты.АКСЛМБФизическоеЛицо КАК ФизическоеЛицо
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ДоговорыКонтрагентов.Владелец = Контрагенты.Ссылка
	|ГДЕ
	|	ДоговорыКонтрагентов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", НайденныйДоговор);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Объект.ЗалоговыйБилет = НайденныйДоговор;
	Объект.Залогодатель = ВыборкаДетальныеЗаписи.ФизическоеЛицо;
	
	Элементы.ЗалоговыеБилеты.ТекущаяСтрока = Новый ("РегистрСведенийКлючЗаписи.АКСЛМБСостояниеЗалоговогоБилета", Новый Структура ("ДоговорКонтрагента", НайденныйДоговор));

КонецПроцедуры

&НаСервере
Функция ПолучитьНоменклатуруПоШК(Штрихкод)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Штрихкоды.Номенклатура
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.Штрихкод ПОДОБНО &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый Структура("Ошибка, ТекстОшибки", Истина, "Не найдена номенклатура по штрихкоду " + Штрихкод);
	Иначе	
		Возврат Новый Структура("Ошибка, ТЗНоменклатура", Ложь, РезультатЗапроса.Выгрузить());
	КонецЕсли;
КонецФункции

&НаКлиенте
Функция СформироватьСписокДоговоровКОбработке()
	
	ЕстьОтмеченныеЗалоговыеБилеты = ВыбранныеЗалоговыеБилеты.Количество() > 0;
	
	СписокДоговоров = Новый СписокЗначений;
	
	Если ЕстьОтмеченныеЗалоговыеБилеты Тогда
		
		СписокДоговоров = ВыбранныеЗалоговыеБилеты;
		
	Иначе
		
		ТекДанные = Элементы.ЗалоговыеБилеты.ТекущиеДанные;
		ТекЗалоговыйБилет = Неопределено;
		Если ЗначениеЗаполнено(Объект.ЗалоговыйБилет) Тогда 
			ТекЗалоговыйБилет = Объект.ЗалоговыйБилет;
		ИначеЕсли ТекДанные <> Неопределено И ТекДанные.Свойство("ЗалоговыйБилет") Тогда
			ТекЗалоговыйБилет = ТекДанные.ЗалоговыйБилет;
		КонецЕсли;
		
		Если ТекЗалоговыйБилет <> Неопределено Тогда
			СписокДоговоров.Добавить(ТекЗалоговыйБилет);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СписокДоговоров;
	
КонецФункции

// Сохраняет дополнительные настройки, недоступные из основной формы настроек
//
&НаСервере
Процедура СохранитьНастройкиНаСервере()
	
	// ВидыДоговоровЗаймаХранения
	Если НастройкиИзменились Или Не ОбщегоНазначения.КоллекцииИдентичны(Объект.ВидыДоговоровЗаймаХранения, ВидыДоговоровЗаймаХранения) Тогда
		
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
			"ЛБ_РабочееМестоТовароведа",
			"ВидыДоговоровЗаймаХранения",
			ВидыДоговоровЗаймаХранения
		);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьОплату(Команда)
	
	СписокЗалоговыеБилеты = ДанныеДляРаспределения();
	Если СписокЗалоговыеБилеты.Количество() < 2 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Для распределения оплаты необходимо выбрать несколько договоров.'"));
		Возврат;
	КонецЕсли;	
	ПараметрыНовойФормы = Новый Структура;
	ПараметрыНовойФормы.Вставить("Организация",Объект.Организация);
	ПараметрыНовойФормы.Вставить("Подразделение",Объект.Подразделение);
	ПараметрыНовойФормы.Вставить("Залогодатель",Объект.Залогодатель);
	ПараметрыНовойФормы.Вставить("ЗалоговыйБилет",Объект.ЗалоговыйБилет);
	ПараметрыНовойФормы.Вставить("СписокЗалоговыеБилеты", СписокЗалоговыеБилеты);
    ОткрытьФорму(
		"Обработка.АКСЛМБРаспределениеСуммыОплатыПоДоговорамКлиента.Форма.ФормаПогашения",
		ПараметрыНовойФормы,
		ЭтотОбъект,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
		
КонецПроцедуры
	
&НаСервере
Функция ДанныеДляРаспределения()
	
	Схема = Элементы.ЗалоговыеБилеты.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
    Настройки = Элементы.ЗалоговыеБилеты.ПолучитьИсполняемыеНастройкиКомпоновкиДанных(); 
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		Настройки.Отбор, 
		"Флаг", 
		ВидСравненияКомпоновкиДанных.Равно,
		Истина,, 
		Истина
	);
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
    МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));   
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);  
    ТаблицаЗначений = Новый ТаблицаЗначений; 
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
	МассивЗалоговыеБилеты = ТаблицаЗначений.ВыгрузитьКолонку("ЗалоговыйБилет");
	СписокЗалоговыеБилеты = новый СписокЗначений; 
	СписокЗалоговыеБилеты.ЗагрузитьЗначения(МассивЗалоговыеБилеты);
	
	Возврат СписокЗалоговыеБилеты;
	
КонецФункции


&НаКлиенте
Процедура БилетыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "БилетыДоверенность" Тогда
		//П = Новый Структура; 
		//П.Вставить("ЗалоговыйБилет", Элемент.ТекущиеДанные.ОперацияПоЗалогу);
		//ОткрытьФорму("Документ.ЛБ_Доверенности.ФормаСписка", П); 
		
		ПараметрыВыбора = Новый Структура;
		ПараметрыВыбора.Вставить("Клиент", Объект.Залогодатель);  
		ПараметрыВыбора.Вставить("ЗалоговыйБилет", Элементы.Билеты.ТекущиеДанные.ОперацияПоЗалогу);
		
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораДоверенности",ЭтаФорма);
		ОткрытьФорму("ОбщаяФорма.ЛБ_Доверенности", ПараметрыВыбора,ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.Независимый);
                                                      
	Иначе
		ОткрытьЗначение(Элемент.ТекущиеДанные.ОперацияПоЗалогу);

	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗалоговыйБилетОчистка(Элемент, СтандартнаяОбработка)
	Объект.ЗалоговыйБилет = Неопределено;
	ВывестиБилетыСОтбором();
КонецПроцедуры

&НаКлиенте
Процедура БилетыПриАктивизацииСтроки(Элемент)
	ТекСтр = Элементы.Билеты.ТекущиеДанные;
	Если ТекСтр = Неопределено Тогда
		Элементы.ОперацииЗБ.ОтборСтрок = Новый ФиксированнаяСтруктура();
	Иначе
		Элементы.ОперацииЗБ.ОтборСтрок = Новый ФиксированнаяСтруктура("ЗалоговыйБилет",ТекСтр.Номер);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОперацииЗБВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьЗначение(Элемент.ТекущиеДанные.ОперацияПоЗалогу);
КонецПроцедуры

&НаКлиенте
Процедура ЗалогодательОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеИзмененияЗалогодателя",ЭтаФорма);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Залогодатель",     Объект.Залогодатель);
	ПараметрыФормы.Вставить("ПричинаИзменения", ПредопределенноеЗначение("Справочник.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.ИсправлениеДанныхКонтактнаяИнформация")); 
	ПараметрыФормы.Вставить("ЗакрыватьПриСохранении", Истина);
	ОткрытьФорму("ОбщаяФорма.ЛБ_КарточкаЗалогодателя", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеИзмененияЗалогодателя(Результат, ДопПараметры) Экспорт
	//Если Результат = Неопределено Тогда
	//    Возврат;
	//КонецЕсли;
	//ТекущаяСтрока = Элементы.Залогодатели.ТекущиеДанные;
	//ТекущаяСтрока.Залогодатель = Результат.Залогодатель;
	//ТекущаяСтрока.НомерТелефона = Результат.НомерТелефона;
	//
	//Отбор = Новый Структура;
	//Отбор.Вставить("Залогодатель", ТекущаяСтрока.Залогодатель);
	//
	//Строки = ДокументыЗалогодателей.НайтиСтроки(Отбор);
	//Для каждого Стр Из Строки Цикл
	//	ДокументыЗалогодателей.Удалить(Стр);
	//КонецЦикла;	

	//ПерезаполнитьИнформациюПоДокументамЗалогодателя(ТекущаяСтрока.Залогодатель);
	//
	//Элементы.ДокументыЗалогодателей.ОтборСтрок = Новый ФиксированнаяСтруктура("Залогодатель", ТекущаяСтрока.Залогодатель);	
КонецПроцедуры


&НаКлиенте
Процедура ПослеВыбораДоверенности(Результат, ДопПараметры) Экспорт
	//ТекСтрока = Элементы.Список.ТекущиеДанные; 	 
	//СписокПриАктивизацииСтрокиНаСервере(ТекСтрока.ВидОперации, ТекСтрока.Залогодатель, ТекСтрока.Номер, ТекСтрока.Дата); 
КонецПроцедуры

&НаКлиенте
Процедура ДоверенностиПоБилету(Команда) 
	//ТекСтр  = Элементы.Билеты.ТекущиеДанные.ОперацияПоЗалогу; 
	
	Если Не Элементы.Билеты.ТекущиеДанные = Неопределено Тогда
		
		ПараметрыВыбора = Новый Структура;
		ПараметрыВыбора.Вставить("Клиент", Объект.Залогодатель);
		//Если ЗначениеЗаполнено(Элементы.Билеты.ТекущиеДанные.ОперацияПоЗалогу.ПредыдущаяОперация) Тогда
		//	ПараметрыВыбора.Вставить("ЗалоговыйБилет", Элементы.Билеты.ТекущиеДанные.ОперацияПоЗалогу.ПредыдущаяОперация);	
		//Иначе
			ПараметрыВыбора.Вставить("ЗалоговыйБилет", Элементы.Билеты.ТекущиеДанные.ОперацияПоЗалогу);
		//КОнецЕсли;
		
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораДоверенности",ЭтаФорма);
		//ОткрытьФорму("Документ.ЛБ_Доверенности.ФормаСписка", ПараметрыВыбора,ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		ОткрытьФорму("ОбщаяФорма.ЛБ_Доверенности", ПараметрыВыбора,ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.Независимый);
		
	КонецЕсли;
	
КонецПроцедуры

//+++ Моисеев 20250521
&НаКлиенте
Процедура КомандаПоискЗалогодателя(Команда)
	СтруктураПараметров = Новый Структура("ВидОперации");
//	СтруктураПараметров.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог");
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЗалогодателя", ЭтотОбъект, СтруктураПараметров);

	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателя", СтруктураПараметров, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЗалогодателя(Результат,Параметры) Экспорт
	Если НЕ ТипЗнч(Результат) = Тип("Структура") Тогда
		Возврат;		
	Иначе
		Объект.Залогодатель = Результат.Залогодатель;
		СтруктураПараметров = Результат;
		ЗаполнитьДанныеКлиента();
		ЗалогодательПриИзменении(Неопределено);
	КонецЕсли;
	//СтруктураПараметров.Вставить("ВидОперации", Параметры.ВидОперации);
	//ОткрытьФорму("Документ.ЛБ_ОперацияПоЗалогу.Форма.ФормаДокумента", СтруктураПараметров, ЭтаФорма);
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьДанныеКлиента()
	ЭтотОбъект.ДанныеКлиента.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЛБ_ОперацияПоЗалогу.Ссылка КАК Ссылка,
	               |	ЛБ_ОперацияПоЗалогу.Дата КАК Дата,
	               |	ЛБ_ОперацияПоЗалогу.ВидОперации КАК ВидОперации,
	               |	ЛБ_ОперацияПоЗалогу.Ломбард КАК Ломбард,
	               |	ЛБ_ОперацияПоЗалогу.Ломбард.НомерЛомбарда КАК НомерЛомбарда,
	               |	ЛБ_ОперацияПоЗалогу.Проведен КАК Проведен
	               |ПОМЕСТИТЬ ВТ_ПоследняяОперация
	               |ИЗ
	               |	Документ.ЛБ_ОперацияПоЗалогу КАК ЛБ_ОперацияПоЗалогу
	               |ГДЕ
	               |	ЛБ_ОперацияПоЗалогу.Проведен = ИСТИНА
	               |	И ЛБ_ОперацияПоЗалогу.Залогодатель = &Залогодатель
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата УБЫВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Залогодатель КАК СсылкаЗалогодатель,
	               |	ВТ_ПоследняяОперация.Дата КАК ПоследнееОбращениеКлиентаДата,
	               |	ВТ_ПоследняяОперация.ВидОперации КАК ПоследнееОбращениеКлиентаВидОперации,
	               |	ВТ_ПоследняяОперация.НомерЛомбарда КАК ПоследнееОбращениеКлиентаНомерЛомбарда,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПрописке КАК АдресРегистрации,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК Телефон,
	               |	ВЫБОР
	               |		КОГДА ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения = ДАТАВРЕМЯ(1, 1, 1)
	               |			ТОГДА -1
	               |		КОГДА МЕСЯЦ(&ДатаДокумента) < МЕСЯЦ(ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения)
	               |			ТОГДА РАЗНОСТЬДАТ(ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения, &ДатаДокумента, ГОД) - 1
	               |		КОГДА МЕСЯЦ(&ДатаДокумента) > МЕСЯЦ(ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения)
	               |			ТОГДА РАЗНОСТЬДАТ(ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения, &ДатаДокумента, ГОД)
	               |		КОГДА МЕСЯЦ(&ДатаДокумента) = МЕСЯЦ(ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ДЕНЬ(&ДатаДокумента) < ДЕНЬ(ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения)
	               |						ТОГДА РАЗНОСТЬДАТ(ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения, &ДатаДокумента, ГОД) - 1
	               |					КОГДА ДЕНЬ(&ДатаДокумента) >= ДЕНЬ(ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения)
	               |						ТОГДА РАЗНОСТЬДАТ(ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения, &ДатаДокумента, ГОД)
	               |				КОНЕЦ
	               |	КОНЕЦ КАК Возраст,
	               |	ЛБ_ДокументыЗалогодателей.ВидДокумента КАК ДокументВид,
	               |	ЛБ_ДокументыЗалогодателей.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателей.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателей.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателей.ДокументДатаВыдачи КАК ДокументДатаВыдачи
	               |ИЗ
	               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ДокументыЗалогодателей КАК ЛБ_ДокументыЗалогодателей
	               |		ПО ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Залогодатель = ЛБ_ДокументыЗалогодателей.ДокументЗалогодателя.Владелец
				   |			И НЕ ЛБ_ДокументыЗалогодателей.ДокументНеДействителен = Истина
				   
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоследняяОперация КАК ВТ_ПоследняяОперация
	               |		ПО (ИСТИНА)";
	Запрос.УстановитьПараметр("Залогодатель", Объект.Залогодатель);
	Запрос.УстановитьПараметр("ДатаДокумента", ТекущаяДата());
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Парам = Новый Структура("Серия, Номер", СокрЛП(Выборка.ДокументСерия), СокрЛП(Выборка.ДокументНомер));
		Если ЛБ_ОбменLX.ПаспортНедействителен(Парам) Тогда 
			Продолжить;//Стр.ПроверкаНеДействителен = Истина;
		КонецЕсли;	
		новДанныеКлиента = ЭтотОбъект.ДанныеКлиента.Добавить();
		ЗаполнитьЗначенияСвойств(новДанныеКлиента, Выборка);
	КонецЦикла;
КонецПроцедуры
//--- Моисеев 20250521

&НаКлиенте
Процедура КомандаЭДО(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КомандаСтатистикаОбращений(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Залогодатель) Тогда
		Возврат;
	КонецЕсли;	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Клиент", Объект.Залогодатель);
	ПараметрыФормы.Вставить("Дата", ТекущаяДата());
	
	ОткрытьФорму("Отчет.ЛБ_СтатистикаОбращенийКлиента.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
КонецПроцедуры

 //+++ Моисеев 20250609
 //взято из общей формы ЛБ_КарточкаЗалогодателя
 &НаСервереБезКонтекста
Функция ПроверитьСтатусКлиентаВИП(Дата, Залогодатель)
	
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК Регистратор,
	|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор.Комментарий КАК Комментарий,
	|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период КАК Период
	|ИЗ
	|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
	|ГДЕ
	|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель = &Залогодатель
	|	И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор КАК Регистратор,
	|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор.Комментарий КАК Комментарий,
	|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период КАК Период
	|ИЗ
	|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
	|ГДЕ
	|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель = &Залогодатель
	|	И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор КАК Регистратор,
	|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор.Комментарий КАК Комментарий,
	|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период КАК Период
	|ИЗ
	|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
	|ГДЕ
	|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель = &Залогодатель
	|	И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период УБЫВ";

	Пакеты = Запрос.ВыполнитьПакет();
	
	ИспользуютсяСтавки = Ложь;
	ИспользуютсяМаталлы = Ложь;
	ИспользуютсяВставки = Ложь;
	Используется = Ложь;
	СрокДействия = Дата(1,1,1);
	Комментарий = "";

	Ставки = Пакеты[0].Выбрать();
	Металлы = Пакеты[1].Выбрать();
	Вставки = Пакеты[2].Выбрать();

	Если Ставки.Следующий() Тогда
		Если Ставки.Регистратор.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП Тогда
			Если Ставки.ДатаОкончанияДействия >= Дата ИЛИ Ставки.ДатаОкончанияДействия = Дата(1,1,1) Тогда
				ИспользуютсяСтавки = Ложь;
			КонецЕсли;	
		Иначе
			Если Ставки.ДатаОкончанияДействия >= Дата ИЛИ Ставки.ДатаОкончанияДействия = Дата(1,1,1) Тогда
				ИспользуютсяСтавки = Истина;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	Если Металлы.Следующий() Тогда
		Если Металлы.Регистратор.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП Тогда
			Если Металлы.ДатаОкончанияДействия >= Дата ИЛИ Металлы.ДатаОкончанияДействия = Дата(1,1,1) Тогда
				ИспользуютсяМаталлы = Ложь;
			КонецЕсли;	
		Иначе
			Если Металлы.ДатаОкончанияДействия >= Дата ИЛИ Металлы.ДатаОкончанияДействия = Дата(1,1,1) Тогда
				ИспользуютсяМаталлы = Истина;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	Если Вставки.Следующий() Тогда
		Если Вставки.Регистратор.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП Тогда
			Если Вставки.ДатаОкончанияДействия >= Дата ИЛИ Вставки.ДатаОкончанияДействия = Дата(1,1,1) Тогда
				ИспользуютсяВставки = Ложь;
			КонецЕсли;	
		Иначе
			Если Вставки.ДатаОкончанияДействия >= Дата ИЛИ Вставки.ДатаОкончанияДействия = Дата(1,1,1) Тогда
				ИспользуютсяВставки = Истина;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	Если ИспользуютсяСтавки ИЛИ ИспользуютсяМаталлы ИЛИ ИспользуютсяВставки Тогда
		Используется = Истина;
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Используется", Используется);
	СтруктураВозврата.Вставить("СрокДействия", СрокДействия);
	СтруктураВозврата.Вставить("Комментарий", Комментарий);
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаСервере
Функция ЗаполнитьТаблицуВыбораДопСтатусовКлиента() 		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Пол КАК Пол
	               |ИЗ
	               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних
	               |ГДЕ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Залогодатель = &Залогодатель";
	
	Запрос.УстановитьПараметр("Залогодатель", Объект.Залогодатель);
	Выборка = запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Пол = Выборка.Пол;
		ДатаРождения = Выборка.ДатаРождения;
	Иначе
		Пол = Неопределено;
		ДатаРождения = '00010101';
	КонецЕсли;
	
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Справочники.ЛБ_СтатусыЗалогодателей.Почетный);
	МассивСтатусов.Добавить(Справочники.ЛБ_СтатусыЗалогодателей.VIP);
	
	Запрос.УстановитьПараметр("Статусы", МассивСтатусов);
	//-Мельников
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СтатусыЗалогодателей.Ссылка КАК Статус,
				   |	ЛОЖЬ КАК Используется
	               |ИЗ
	               |	Справочник.ЛБ_СтатусыЗалогодателей КАК ЛБ_СтатусыЗалогодателей
	               |ГДЕ
	               |	ЛБ_СтатусыЗалогодателей.ПометкаУдаления = ЛОЖЬ
	               |	И ЛБ_СтатусыЗалогодателей.ЭтоГруппа = ЛОЖЬ
	               |	И ЛБ_СтатусыЗалогодателей.ДоступенДляВыбораВручную = ИСТИНА
			//+Мельников 25.09.24 Убрал ВИПов из результата запроса. ВИП. Заявка 2792.
	               //Было: |	И НЕ ЛБ_СтатусыЗалогодателей.Ссылка = &Почетный
	               |	И НЕ ЛБ_СтатусыЗалогодателей.Ссылка В (&Статусы)
			//-Мельников
	               |АВТОУПОРЯДОЧИВАНИЕ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	//ТаблицаДопСтатусов.Загрузить(ТаблицаЗапроса);   
	ТаблицаДопСтатусов = ТаблицаЗапроса.Скопировать();
			
    Запрос.Текст = "ВЫБРАТЬ
                   |	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус,
                   |	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Используется КАК Используется,
                   |	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.СрокДействия КАК СрокДействия,
                   |	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Комментарий КАК Комментарий
                   |ИЗ
                   |	РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(
                   |			&Дата,
                   |			Залогодатель = &Залогодатель
                   |				И Статус = &Статус) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних
                   |
                   |УПОРЯДОЧИТЬ ПО
                   |	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Период УБЫВ";
    Запрос.УстановитьПараметр("Дата", ТекущаяДата()); 
	Для каждого Стр Из ТаблицаДопСтатусов Цикл 
		Запрос.УстановитьПараметр("Статус", Стр.Статус);  
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Стр.Используется = Выборка.Используется;
			Если Выборка.Используется Тогда  
				Если ЗначениеЗаполнено(Выборка.СрокДействия) Тогда
					Если Выборка.СрокДействия >= НачалоДня(Этаформа.Дата) Тогда
						//Стр.СрокДействия = Выборка.СрокДействия; 
						//Стр.Комментарий = Выборка.Комментарий; 
					Иначе
						Стр.Используется = Ложь;
					КонецЕсли;    
				Иначе   
					Если Выборка.статус = ПредопределенноеЗначение("Справочник.ЛБ_СтатусыЗалогодателей.Сотрудник") Тогда
						//Стр.Комментарий = ПолучитьСписокСотрудников();
					Иначе	
						//Стр.Комментарий = Выборка.Комментарий;
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	   
	
	Если ЛБ_УправлениеЛомбардом.ПроверитьСтатусПочетный(ДатаРождения, Пол) Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("Статус", Справочники.ЛБ_СтатусыЗалогодателей.Почетный);
		СтрокиС = ТаблицаДопСтатусов.НайтиСтроки(Отбор);  
		Если СтрокиС.Количество() = 0 Тогда
			Новаястр = ТаблицаДопСтатусов.Добавить();
		    НоваяСтр.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Почетный;
			НоваяСтр.Используется = Истина;   
			//НоваяСтр.ТолькоПросмотр = Истина; 
		Иначе    
			СтрС = строкиС.Получить(0); 
			СтрС.Используется = Истина;
		КонецЕсли;	
	//+Мельников 25.09.24 Для красоты отобразим статус без галки "Используется". ВИП. Заявка 2792.
	//Было: КонецЕсли;
	Иначе
		Новаястр = ТаблицаДопСтатусов.Добавить();
		НоваяСтр.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Почетный;
		НоваяСтр.Используется = Ложь;
		//НоваяСтр.ТолькоПросмотр = Истина;
	КонецЕсли;
	//-Мельников

	//+Мельников 25.09.24 Добавляем и проверяем статус ВИП. ВИП. Заявка 2792.
	СтатусВИП = ПроверитьСтатусКлиентаВИП(ТекущаяДата(), Объект.Залогодатель); //, Справочники.ЛБ_СтатусыЗалогодателей.VIP);
	Если СтатусВИП.Используется Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("Статус", Справочники.ЛБ_СтатусыЗалогодателей.VIP);
		СтрокиС = ТаблицаДопСтатусов.НайтиСтроки(Отбор);
		Если СтрокиС.Количество() = 0 Тогда
			Новаястр = ТаблицаДопСтатусов.Добавить();
		    НоваяСтр.Статус = Справочники.ЛБ_СтатусыЗалогодателей.VIP;
			НоваяСтр.Используется = СтатусВИП.Используется;
			//НоваяСтр.СрокДействия = СтатусВИП.СрокДействия;
			//НоваяСтр.Комментарий = СтатусВИП.Комментарий;
			//НоваяСтр.ТолькоПросмотр = Истина;
		Иначе
			СтрС = строкиС.Получить(0);
			СтрС.Используется = СтатусВИП.Используется;
			//СтрС.СрокДействия = СтатусВИП.СрокДействия;
			//СтрС.Комментарий = СтатусВИП.Комментарий;
			//СтрС.ТолькоПросмотр = Истина;
		КонецЕсли;
	Иначе
		Новаястр = ТаблицаДопСтатусов.Добавить();
		НоваяСтр.Статус = Справочники.ЛБ_СтатусыЗалогодателей.VIP;
		НоваяСтр.Используется = СтатусВИП.Используется;
		//НоваяСтр.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ТаблицаДопСтатусов.Сортировать("Статус Возр");
	//-Мельников
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СоответствиеДокументовИЛьготныхСтатусовСрезПоследних.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_СоответствиеДокументовИЛьготныхСтатусовСрезПоследних.Статус КАК Статус
	               |ИЗ
	               |	РегистрСведений.ЛБ_СоответствиеДокументовИЛьготныхСтатусов.СрезПоследних(&Дата, НеАктуально = ЛОЖЬ) КАК ЛБ_СоответствиеДокументовИЛьготныхСтатусовСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		//Отбор = Новый структура;
		//Отбор.Вставить("ВидДокумента", Выборка.ВидДокумента);
		//
		//СтрокиД = ДокументыЗалогодателя.НайтиСтроки(Отбор); 
		//Если НЕ СтрокиД.Количество() = 0 тогда			
		//	СтрД = строкиД.Получить(0);  
		//	Если СтрД.ДокументНеДействителен Тогда
		//		Продолжить;				
		//	ИначеЕсли НЕ (СтрД.ДокументСрокДействия = Дата(1,1,1)) Тогда
		//		Если СтрД.ДокументСрокДействия < НачалоДня(ТекущаяДата()) Тогда
		//			Продолжить;
		//		КонецЕсли;
		//	КонецЕсли;
			
			СтатусЛояльности = ЛБ_УправлениеЛомбардом.ПолучитьСтатусПоСистемеЛояльности(ТекущаяДата(), Выборка.статус);
			Если НЕ СтатусЛояльности = неопределено Тогда 
				Отбор = Новый Структура;
				Отбор.Вставить("Статус", СтатусЛояльности);
				Если ТаблицаДопСтатусов.НайтиСтроки(Отбор).Количество() = 0 Тогда
					Новаястр = ТаблицаДопСтатусов.Добавить();
			        НоваяСтр.Статус = СтатусЛояльности;
				    НоваяСтр.Используется = Истина; 
					//НоваяСтр.ТолькоПросмотр = Истина;
					//НоваяСтр.СрокДействия = СтрД.ДокументСрокДействия; 
				Иначе
					//+МАН 31.01.25 Закомментировал. Ранее выставляется статус. Заявка 2792
					//ТаблицаДопСтатусов.Получить(0).Используется = Истина; 
					//-МАН
				КонецЕсли;	
			КонецЕсли;	
		//КонецЕсли;
	Конеццикла;
	
	ИтоговаяСтрока = "";
	Для каждого стрДопСтатус Из ТаблицаДопСтатусов Цикл 
		Если стрДопСтатус.Используется Тогда 
			ИтоговаяСтрока = ИтоговаяСтрока + "," + стрДопСтатус.Статус;
		КонецЕсли;
	КонецЦикла;
	Если СтрДлина(ИтоговаяСтрока) > 0 Тогда 
		ИтоговаяСтрока = Сред(ИтоговаяСтрока, 2);
	КонецЕсли;
	
	Возврат ИтоговаяСтрока;
	
КонецФункции        

&НаСервере
Функция ЗаполнитьТаблицуВыбораСлужебныхСтатусовКлиента() 		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СлужебныеСтатусы.Ссылка КАК Статус,
				   |	ЛОЖЬ КАК Используется
	               |ИЗ
	               |	Справочник.ЛБ_СлужебныеСтатусыКлиентов КАК СлужебныеСтатусы
	               |ГДЕ
	               |	СлужебныеСтатусы.ПометкаУдаления = ЛОЖЬ
	               |АВТОУПОРЯДОЧИВАНИЕ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	//ТаблицаСлужебныхСтатусов.Загрузить(ТаблицаЗапроса); 
	ТаблицаСлужебныхСтатусов = ТаблицаЗапроса.Скопировать(); 
		
    Запрос.Текст = "ВЫБРАТЬ
                   |	ЛБ_СтатусыЗалогодателейСлужебныеСрезПоследних.Статус КАК Статус,
                   |	ЛБ_СтатусыЗалогодателейСлужебныеСрезПоследних.Используется КАК Используется,
                   |	ЛБ_СтатусыЗалогодателейСлужебныеСрезПоследних.Комментарий КАК Комментарий
                   |ИЗ
                   |	РегистрСведений.ЛБ_СтатусыЗалогодателейСлужебные.СрезПоследних(
                   |			&Дата,
                   |			Залогодатель = &Залогодатель
                   |				И Статус = &Статус) КАК ЛБ_СтатусыЗалогодателейСлужебныеСрезПоследних";
	Для каждого Стр Из ТаблицаСлужебныхСтатусов Цикл 
		Запрос.УстановитьПараметр("Залогодатель", Объект.Залогодатель);  
	    Запрос.УстановитьПараметр("Дата", ТекущаяДата()); 
		Запрос.УстановитьПараметр("Статус", Стр.Статус);  
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Стр.Используется = Выборка.Используется;
			//Стр.Комментарий = Выборка.Комментарий;
		КонецЕсли;	
	КонецЦикла;	   
	
	ИтоговаяСтрока = "";
	Для каждого стрСлужебныйСтатус Из ТаблицаСлужебныхСтатусов Цикл 
		Если стрСлужебныйСтатус.Используется Тогда 
			ИтоговаяСтрока = ИтоговаяСтрока + "," + стрСлужебныйСтатус.Статус;
		КонецЕсли;
	КонецЦикла;
	Если СтрДлина(ИтоговаяСтрока) > 0 Тогда 
		ИтоговаяСтрока = Сред(ИтоговаяСтрока, 2);
	КонецЕсли;
	
	Возврат ИтоговаяСтрока;
	
КонецФункции        

&НаСервере
Функция ПроверитьПоПеречням()   
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Залогодатель", Объект.Залогодатель);  
	Запрос.УстановитьПараметр("Дата", ТекущаяДата()); 	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КлиентыВПеречняхСрезПоследних.ВидПеречня КАК ВидПеречня,
	               |	ЛБ_КлиентыВПеречняхСрезПоследних.СтатусКлиентаВПеречне КАК Статус
	               |ИЗ
	               |	РегистрСведений.ЛБ_КлиентыВПеречнях.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КлиентыВПеречняхСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_КлиентыВПеречняхСрезПоследних.Период УБЫВ"; 
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	ИтоговаяСтрока = "";
	
	//ТаблицаКомплаенсСтатусов.Очистить();
	Отбор = Новый Структура;
	Отбор.Вставить("ВидПеречня", Перечисления.ЛБ_ВидыПеречней.Террористы);
	Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);  
	//СтрК = ТаблицаКомплаенсСтатусов.Добавить();  
	//СтрК.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.Террористы;
	Если НЕ Строки.Количество() = 0 Тогда
		Выборка = Строки.Получить(0);
		Если Выборка.Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен Тогда 
			ИтоговаяСтрока = ИтоговаяСтрока + "," + "Террорист";
			//ПроверкаПереченьТеррористов = Истина;  
			//Элементы.ПроверкаПереченьТеррористов.ЦветТекстаЗаголовка = WebЦвета.Красный;  
			//Элементы.ПроверкаПереченьТеррористов.ЦветРамки = WebЦвета.Красный; 
			//Элементы.КнопкаТеррористы.Доступность = Истина; 
			//СтрК.Статус = "Террорист"; 
			//СтрК.Включен = Истина;
			//ПроверкаПереченьТеррористов = Истина;
		//ИначеЕсли Выборка.Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Исключен Тогда
		//	СтрК.Статус = "Исключен из перечня террористов"; 
		//	ПроверкаПереченьТеррористов = ложь;   
		//	Элементы.ПереченьТеррористов.ЦветТекстаЗаголовка = WebЦвета.Черный; 
		//	Элементы.ПереченьТеррористов.ЦветРамки = WebЦвета.СветлоСерый; 
		КонецЕсли;   
	//Иначе
	//	СтрК.Статус = "Отсутствует в перечне террористов";
	//	ПроверкаПереченьТеррористов = ложь;
	КонецЕсли;
	
	Отбор.Вставить("ВидПеречня", Перечисления.ЛБ_ВидыПеречней.МВК);
	Строки = ТаблицаЗапроса.НайтиСтроки(Отбор); 
	//СтрК = ТаблицаКомплаенсСтатусов.Добавить();  
	//СтрК.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.МВК;
	Если НЕ Строки.Количество() = 0 Тогда
		Выборка = Строки.Получить(0);
		Если Выборка.Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен Тогда 
			ИтоговаяСтрока = ИтоговаяСтрока + "," + "Замороженный";
	//		ПроверкаСписокМВК = Истина;  
	//		Элементы.ПроверкаСписокМВК.ЦветТекстаЗаголовка = WebЦвета.Красный; 
	//		Элементы.ПроверкаСписокМВК.ЦветРамки = WebЦвета.Красный; 
	//		Элементы.КнопкаМВК.Доступность = Истина; 
	//	    СтрК.Статус = "Замороженный"; 
	//		СтрК.Включен = Истина;
	//		ПроверкаСписокМВК = Истина;
	//	ИначеЕсли Выборка.Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Исключен Тогда
	//		СтрК.Статус = "Размороженный";	
	//		ПроверкаСписокМВК = Ложь; 
	//		Элементы.ПроверкаСписокМВК.ЦветТекстаЗаголовка = WebЦвета.Черный; 
	//		Элементы.ПроверкаСписокМВК.ЦветРамки = WebЦвета.СветлоСерый; 
		КонецЕсли;                        
	//Иначе
	//	СтрК.Статус = "Отсутствует в перечне МВК";
	//	ПроверкаСписокМВК = Ложь;
	КонецЕсли;	

	Отбор.Вставить("ВидПеречня", Перечисления.ЛБ_ВидыПеречней.ФРОМУ);
	Строки = ТаблицаЗапроса.НайтиСтроки(Отбор); 
	//СтрК = ТаблицаКомплаенсСтатусов.Добавить();  
	//СтрК.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ФРОМУ;
	Если НЕ Строки.Количество() = 0 Тогда
		Выборка = Строки.Получить(0);
		Если Выборка.Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен Тогда 
			ИтоговаяСтрока = ИтоговаяСтрока + "," + "В перечне ФРОМУ";
			//ПроверкаПереченьФРОМУ = Истина;    
			//Элементы.ПроверкаПереченьФРОМУ.ЦветТекстаЗаголовка = WebЦвета.Красный; 
			//Элементы.ПроверкаПереченьФРОМУ.ЦветРамки = WebЦвета.Красный; 
			//Элементы.КнопкаФРОМУ.Доступность = Истина; 
			//СтрК.Статус = "В перечне ФРОМУ"; 
			//СтрК.Включен = Истина;
			//ПроверкаПереченьФРОМУ = Истина;
		//Иначе     
		//	СтрК.Статус = "Отсутствует в перечне ФРОМУ";
		//	ПроверкаПереченьФРОМУ = Ложь;
		КонецЕсли;  
	//Иначе
	//	СтрК.Статус = "Отсутствует в перечне ФРОМУ"; 
	//	ПроверкаПереченьФРОМУ = Ложь; 
	КонецЕсли;     
	
	Отбор.Вставить("ВидПеречня", Перечисления.ЛБ_ВидыПеречней.ООН);
	Строки = ТаблицаЗапроса.НайтиСтроки(Отбор); 
	//СтрК = ТаблицаКомплаенсСтатусов.Добавить();  
	//СтрК.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ООН;
	Если НЕ Строки.Количество() = 0 Тогда
		Выборка = Строки.Получить(0);
		Если Выборка.Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен Тогда 
			ИтоговаяСтрока = ИтоговаяСтрока + "," + "В перечне ООН";
		//	ПроверкаПереченьООН = Истина;    
		//	Элементы.ПроверкаПереченьООН.ЦветТекстаЗаголовка = WebЦвета.Красный; 
		//	Элементы.ПроверкаПереченьООН.ЦветРамки = WebЦвета.Красный; 
		//	Элементы.КнопкаООН.Доступность = Истина; 
		//	СтрК.Статус = "В перечне ООН";
		//	СтрК.Включен = Истина;
		//	ПроверкаПереченьООН = Истина;
		//Иначе
		//	СтрК.Статус = "Отсутствует в перечне ООН";
		//    ПроверкаПереченьООН = Ложь;
		КонецЕсли;  
	//Иначе
	//	СтрК.Статус = "Отсутствует в перечне ООН";
	//	ПроверкаПереченьООН = Ложь;
	КонецЕсли;

	
	Отбор.Вставить("ВидПеречня", Перечисления.ЛБ_ВидыПеречней.ЦБ);
	Строки = ТаблицаЗапроса.НайтиСтроки(Отбор); 
	//СтрК = ТаблицаКомплаенсСтатусов.Добавить();  
	//СтрК.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ЦБ;
	Если НЕ Строки.Количество() = 0 Тогда
		ИтоговаяСтрока = ИтоговаяСтрока + "," + "Присутствует в перечне ЦБ";
	//	СтрК.Статус = "Присутствует в перечне ЦБ"; 
	//	СтрК.Включен = Истина;
	//Иначе  
	//	СтрК.Статус = "Отсутствует в перечне ЦБ";
	КонецЕсли;	
	
	Если СтрДлина(ИтоговаяСтрока) > 0 Тогда 
		ИтоговаяСтрока = Сред(ИтоговаяСтрока, 2);
	КонецЕсли;

	Возврат ИтоговаяСтрока;
КонецФункции	    

&НаКлиенте
Процедура КомандаЗалоговыеБилетыОтборВсе(Команда)
	// Вставить содержимое обработчика.
	Если текОтборЗБ = "Один" Тогда
		//убираем отбор в ТЧ Операции
		Элементы.ОперацииЗБ.ОтборСтрок = Новый ФиксированнаяСтруктура();
	КонецЕсли;	
		
	текОтборЗБ = "Все";
	Элементы.БилетыКомандаЗалоговыеБилетыОтборВсе.Пометка = Истина;
	Элементы.БилетыКомандаЗалоговыеБилетыОтборВЛомбарде.Пометка = Ложь;
	Элементы.БилетыКомандаЗалоговыеБилетыОтборОдин.Пометка = Ложь;
	Элементы.БилетыКомандаЗалоговыеБилетыОтборВсеДействующие.Пометка = Ложь;
	ВывестиБилетыСОтбором();
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗалоговыеБилетыОтборВсеДействующие(Команда)
	Если текОтборЗБ = "Один" Тогда
		//убираем отбор в ТЧ Операции
		Элементы.ОперацииЗБ.ОтборСтрок = Новый ФиксированнаяСтруктура();
	КонецЕсли;	

	текОтборЗБ = "Действующие";
	Элементы.БилетыКомандаЗалоговыеБилетыОтборВсе.Пометка = Ложь;
	Элементы.БилетыКомандаЗалоговыеБилетыОтборВЛомбарде.Пометка = Ложь;
	Элементы.БилетыКомандаЗалоговыеБилетыОтборОдин.Пометка = Ложь;
	Элементы.БилетыКомандаЗалоговыеБилетыОтборВсеДействующие.Пометка = Истина;
	ВывестиБилетыСОтбором();
	//Элементы.Билеты.ОтборСтрок
	//элементыф
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗалоговыеБилетыОтборВЛомбарде(Команда)
	Если текОтборЗБ = "Один" Тогда
		//убираем отбор в ТЧ Операции
		Элементы.ОперацииЗБ.ОтборСтрок = Новый ФиксированнаяСтруктура();
	КонецЕсли;	
	текОтборЗБ = "ВЛомбарде";
	Элементы.БилетыКомандаЗалоговыеБилетыОтборВсе.Пометка = Ложь;
	Элементы.БилетыКомандаЗалоговыеБилетыОтборВЛомбарде.Пометка = Истина;
	Элементы.БилетыКомандаЗалоговыеБилетыОтборОдин.Пометка = Ложь;
	Элементы.БилетыКомандаЗалоговыеБилетыОтборВсеДействующие.Пометка = Ложь;
	ВывестиБилетыСОтбором();
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗалоговыеБилетыОтборОдин(Команда)
	// Вставить содержимое обработчика.
	текОтборЗБ = "Один";
	Элементы.БилетыКомандаЗалоговыеБилетыОтборВсе.Пометка = Ложь;
	Элементы.БилетыКомандаЗалоговыеБилетыОтборВЛомбарде.Пометка = Ложь;
	Элементы.БилетыКомандаЗалоговыеБилетыОтборОдин.Пометка = Истина;
	Элементы.БилетыКомандаЗалоговыеБилетыОтборВсеДействующие.Пометка = Ложь;
	ВывестиБилетыСОтбором();
КонецПроцедуры

&НаСервере
Функция ПолучитьЗБ(Идентификатор, ТЧ) 
	Стр = ЭтотОбъект[ТЧ].НайтиПоИдентификатору(Идентификатор); 
	СтруктураВ = Новый Структура;
	СтруктураВ.Вставить("ЗБ", Стр.ОперацияПоЗалогу);
	СтруктураВ.Вставить("Залогодатель", Стр.ОперацияПоЗалогу.Залогодатель);
	Возврат СтруктураВ;
КонецФункции	

&НаКлиенте
Процедура КомандаИсторияЗБ(Команда)
	ТекСтрока = Элементы.Билеты.ТекущиеДанные;	//Элементы[ТекСтр].ТекущиеДанные; //Было: Элементы.Товары.ТекущиеДанные; 
	
	//Если НЕ ТекСтрока = неопределено Тогда
		Результат = ПолучитьЗБ(ТекСтрока.ПолучитьИдентификатор(), "Билеты");
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Клиент", Результат.Залогодатель);
		ПараметрыФормы.Вставить("ЗалоговыйБилет", Результат.ЗБ);	 
								
		Попытка
			ОткрытьФорму("Отчет.ЛБ_ИсторияЗалоговогоБилета.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
		Исключение
			ОбщегоНазначенияКлиент.СообщитьПользователю("Невозможно сформировать отчет по истории залогового билета.");
		КонецПопытки;
	//КонецЕсли;	
КонецПроцедуры

//--- Моисеев 20250609
#КонецОбласти

#КонецОбласти

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	
// ИНИЦИАЛИЗАЦИЯ
#Область Инициализация

	

#КонецОбласти