&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Если Параметры.Свойство("ВидОперации") Тогда
			Объект.ВидОперации = Параметры.ВидОперации; 
		Иначе
			Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.Базовый;
		КонецЕсли;  
		Объект.Дата = ТекущаяДата();
		Объект.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;                 
	УстановитьСостояниеДокумента();   
	ЛБ_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Строка(Объект.ВидОперации), Объект, ЭтаФорма);
КонецПроцедуры 

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость() 
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.Базовый") Тогда 
		Элементы.ШаблоныАкция.Видимость = ложь;
		Элементы.ШаблоныСхемаКредитования.Видимость = Истина; 
		Элементы.ШаблоныШаблонАкция.Видимость = Ложь;
		Элементы.ШаблоныШаблон.Видимость = Истина; 
		Элементы.СписокЛомбардов.Видимость = Истина;
	Иначе   
		Элементы.ШаблоныАкция.Видимость = Истина;
		Элементы.ШаблоныСхемаКредитования.Видимость = ложь;  
		Элементы.ШаблоныШаблонАкция.Видимость = Истина;
		Элементы.ШаблоныШаблон.Видимость = Ложь; 
		Элементы.СписокЛомбардов.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры	


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьСписокЛомбардов();
	Элементы.СписокЛомбардов.Подсказка = Элементы.СписокЛомбардов.Заголовок;
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	Объект.Шаблоны.Очистить();  
	УстановитьВидимость();
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)  
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.Базовый") Тогда
	    Объект.СтрокаЛомбарды = СписокЛомбардов; 
	КонецЕсли;	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись тогда
		Возврат;
	КонецЕсли;	
	ВсеОК = Истина;
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.Базовый") Тогда 
		Для каждого Стр из Объект.Шаблоны Цикл 
			Если НЕ ЗначениеЗаполнено(Стр.СхемаКредитования) Тогда  
				Сообщить("Ошибка заполнения. В строке № " + Строка(Стр.НомерСтроки) + " не заполнена схема кредитования!"); 
				ВсеОК = ложь;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Стр.Шаблон) Тогда  
				Сообщить("Ошибка заполнения. В строке № " + Строка(Стр.НомерСтроки) + " не выбран шаблон!"); 
				ВсеОК = ложь;
			КонецЕсли;
		КонецЦикла;	
	Иначе   
		Для каждого Стр из Объект.Шаблоны Цикл 
			Если НЕ ЗначениеЗаполнено(Стр.Акция) Тогда  
				Сообщить("Ошибка заполнения. В строке № " + Строка(Стр.НомерСтроки) + " не заполнена акция!"); 
				ВсеОК = ложь;
			КонецЕсли;	
			Если НЕ ЗначениеЗаполнено(Стр.ШаблонАкция) Тогда  
				Сообщить("Ошибка заполнения. В строке № " + Строка(Стр.НомерСтроки) + " не выбран шаблон!"); 
				ВсеОК = ложь;
			КонецЕсли;
		КонецЦикла;	

	КонецЕсли;	    
	Если НЕ ВсеОК Тогда
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныШаблонНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)	
	ТекСтрока = Элементы.Шаблоны.ТекущиеДанные;     
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.Базовый") Тогда
		СтандартнаяОбработка = ложь;
		Если ЗначениеЗаполнено(ТекСтрока.СхемаКредитования) Тогда			
		    ПараметрыОтбора = Новый Структура;
	        ПараметрыОтбора.Вставить("СхемаКредитования", ТекСтрока.СхемаКредитования);
	 
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора); 
			
			ПараметрыФормы.Вставить("РежимВыбора",Истина);
			ПараметрыФормы.Вставить("МножественныйВыбор",ложь);

			ОбработкаВыбора = Новый ОписаниеОповещения("ПриВыбореШаблона", ЭтаФорма,"Подбор");

			ОткрытьФорму("Справочник.ЛБ_ШаблоныПриказовПроцентныеСтавки.ФормаВыбора", ПараметрыФормы, ЭтаФорма, , , , ОбработкаВыбора);
		Иначе
		КонецЕсли;			
	Иначе    
		СтандартнаяОбработка = Истина;
	КонецЕсли;	
КонецПроцедуры     

&НаКлиенте
Процедура ПриВыбореШаблона(Значение, ДопПараметры) Экспорт
    Если Значение = Неопределено Тогда
        Возврат;
    КонецЕсли;
	
	ТекСтрока = Элементы.Шаблоны.ТекущиеДанные; 
    ТекСтрока.Шаблон = Значение; 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛомбардовНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	
	ПараметрыФормы = Новый Структура;    
	ПараметрыФормы.Вставить("Ломбарды", Объект.Ломбарды); 
	ПараметрыФормы.Вставить("ДатаДок", Объект.Дата);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЛомбардов",ЭтаФорма);
	
	ОткрытьФорму("Обработка.ЛБ_ВыборЛомбардовИзСписка.Форма", ПараметрыФормы, Элементы.СписокЛомбардов,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокЛомбардов()
	Результат = "";
	Для каждого Стр Из Объект.Ломбарды Цикл
		Результат = Результат + ?(ПустаяСтрока(Результат), "", "; ") + ?(НЕ ПустаяСтрока(Стр.Ломбард.НаименованиеПолное), СокрЛП(Стр.Ломбард.НаименованиеПолное), СокрЛП(Стр.Ломбард.Наименование));
	КонецЦикла;	
	СписокЛомбардов = Результат; 
КонецПроцедуры	
 
&НаСервере
Процедура ПослеВыбораЛомбардов(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;

	Объект.Ломбарды.Очистить();
	КоличествоВыбрано = Результат.Количество;
	Для сч = 1 По КоличествоВыбрано Цикл
		НоваяСтр = Объект.Ломбарды.Добавить();
		НоваяСтр.Ломбард = Результат["Значение" + Строка(сч)];
	КонецЦикла;	
	
	ЗаполнитьСписокЛомбардов();
	Элементы.СписокЛомбардов.Подсказка = Элементы.СписокЛомбардов.Заголовок;
КонецПроцедуры

