	   
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь; 
	Если НЕ ТекПользователь.ЭтоЛомбард Тогда
		Если УправлениеДоступом.ЕстьРоль("ЛБ_СотрудникЦО") Тогда 
			СотрудникЦО = Истина;
		КонецЕсли;   
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если НЕ ТекПользователь.ЭтоЛомбард Тогда
       		Объект.Ответственный = ТекПользователь;
		Иначе
			Объект.Ответственный = ПараметрыСеанса.ТекущийСотрудник; 
		КонецЕсли;	
		Объект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить(); 
		Объект.ВидОперации = Перечисления.ЛБ_ВидыПоступленияОбъектовЗалога.ИзЛомбарда; 
		Объект.Категория = Перечисления.ЛБ_КатегорииПоступленияОбъектовЗалога.Поштучно;
		Объект.Дата = ТекущаяДатаСеанса(); 
		ЭтаФорма.Заголовок = "Оприходование объектов залога (создание)";
	Иначе
		//ВидОперацииСтрока = " (" + Строка(Объект.ВидОперации) + ")";
	    ЭтаФорма.Заголовок = "Оприходование объектов залога № " + СокрЛП(Объект.ПредставлениеНомераПоступления) + " от " + Формат(Объект.Дата, "ДЛФ=DT"); 
	КонецЕсли;
	УстановитьСостояниеДокумента(); 
	ЗаполнитьВыборКатегории();
	УстановитьВидимость();     
	ЗаполнитьТаблицуТоваров();                
	//ПривестиЗначениеОткуда();  
	Элементы.Откуда.СписокВыбора.ЗагрузитьЗначения(ПолучитьПодразделеняВПути());
	ТекущийВидОперации = Объект.ВидОперации;  
		
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыПоступленияОбъектовЗалога.ИзЛомбарда Тогда
		Элементы.Категория.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.Категория.ТолькоПросмотр = Истина;
	КонецЕсли;	 
	
	Если Объект.Проведен Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;	
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
КонецПроцедуры  


&НаСервере
Процедура ЗаполнитьВыборКатегории()  
	Если Объект.Категория = Перечисления.ЛБ_КатегорииПоступленияОбъектовЗалога.Поштучно Тогда
		ЭтаФорма.ВыборКатегории = 0;
	Иначе   
		ЭтаФорма.ВыборКатегории = 1;
	КонецЕсли;	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры   
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура ПривестиЗначениеОткуда()
	Массив = Новый Массив(); 
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыПоступленияОбъектовЗалога.ОтСтороннегоКонтрагента Тогда
	    Массив.Добавить(Тип("СправочникСсылка._ДемоКонтрагенты"));
	Иначе 
		Массив.Добавить(Тип("СправочникСсылка.ЛБ_Ломбарды"));
	КонецЕсли;	
	Описание = Новый ОписаниеТипов(Массив);

	Элементы.Откуда.ОграничениеТипа = Описание; 
	Объект.ЛомбардОткуда = Описание.ПривестиЗначение(Объект.ЛомбардОткуда);  
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуДокумента()
	Объект.Товары.Загрузить(ТаблицаТоваров.Выгрузить());
КонецПроцедуры

&НаСервере
Функция ПолучитьНовыйНомерПоступления()   
	СтруктураВозврата = Новый Структура; 
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		НомерПоступления = ЛБ_УправлениеЛомбардом.ПолучитьНовыйНомерПоступления(Объект.Дата, Объект.Организация, Объект.ЛомбардКуда, Объект.Ссылка);
	Иначе	
	    НомерПоступления = ЛБ_УправлениеЛомбардом.ПолучитьНовыйНомерПоступления(Объект.Дата, Объект.Организация, Объект.ЛомбардКуда); 
	КонецЕсли;	
	СтруктураВозврата.Вставить("НомерПоступления", НомерПоступления);	
	Если Объект.ЛомбардКуда = ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис") Тогда
		ПредставлениеНомера = СокрЛП(НомерПоступления);
	Иначе	
        ПредставлениеНомера = СокрЛП(Объект.ЛомбардКуда.НомерЛомбарда) + "/" +  СокрЛП(НомерПоступления);  
	КонецЕсли;	  
	СтруктураВозврата.Вставить("ПредставлениеНомера", ПредставлениеНомера);
    Возврат СтруктураВозврата;
КонецФункции	

&НаСервере
Функция ПроверкаОстатков() 
	ЕстьОшибки = Ложь;    
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыПоступленияОбъектовЗалога.РазборСумки Тогда
		ТаблицаОстатковВСумке = ЛБ_УправлениеЛомбардом.ПолучитьТоварыВСумке(Объект.Дата, Объект.Организация, Объект.ЛомбардКуда, Объект.СкладПолучатель, Объект.НакладнаяНаОтгрузку);     
		
		Для каждого Стр Из ТаблицаТоваров Цикл  
			Отбор = новый структура;
			Отбор.Вставить("ЗалоговыйБилет", Стр.ЗалоговыйБилет); 
			Отбор.Вставить("ОбъектЗалога", Стр.ОбъектЗалога);
			СтрокиОст = ТаблицаОстатковВСумке.НайтиСтроки(Отбор);
			Если СтрокиОст.Количество() = 0 Тогда 
				ОбщегоНазначения.СообщитьПользователю("Изделие с артикулом " + СокрЛП(Стр.Артикул) + " не найдено в сумке на складе " + СокрЛП(Объект.СкладОтправитель));
                ЕстьОшибки = Истина;
			Конецесли;    
		Конеццикла;  
    Иначе
		ТаблицаВПути = ЛБ_УправлениеЛомбардом.ПолучитьТоварыВПути(Объект.Дата, Объект.Организация, Объект.ЛомбардОткуда, Объект.СкладОтправитель, Объект.ЛомбардКуда, Объект.СкладПолучатель, Объект.НакладнаяНаОтгрузку, Объект.ВидОперации);   
		
		Для каждого Стр Из ТаблицаТоваров Цикл  
			Отбор = новый структура;
			Отбор.Вставить("ЗалоговыйБилет", Стр.ЗалоговыйБилет); 
			Отбор.Вставить("ОбъектЗалога", Стр.ОбъектЗалога);
			СтрокиОст = ТаблицаВПути.НайтиСтроки(Отбор);
			Если СтрокиОст.Количество() = 0 Тогда 
				ОбщегоНазначения.СообщитьПользователю("Изделие с артикулом " + СокрЛП(Стр.Артикул) + " не найдено в пути на склад " + СокрЛП(Объект.СкладПолучатель)); 
			    ЕстьОшибки = Истина;
			Конецесли;  
		Конеццикла;  	
	КонецЕсли;
	
	Возврат ?(ЕстьОшибки, Ложь, Истина);
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ЗаполнитьТаблицуДокумента(); 
	Если ЗначениеЗаполнено(Объект.ЛомбардКуда) И (Объект.НомерПоступления = 0) Тогда
		Результат = ПолучитьНовыйНомерПоступления();
		Объект.НомерПоступления = Результат.НомерПоступления;
		Объект.ПредставлениеНомераПоступления = Результат.ПредставлениеНомера;
	КонецЕсли;
	Если НЕ ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		Если ТаблицаТоваров.Количество() = 0 Тогда
			Сообщить("Не выбраны изделия для перемещения.", статуссообщения.Важное);
			Отказ = Истина;
		КонецЕсли;    
		//Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПеремещенияОбъектовЗалога.СторонннемуКонтрагенту") Тогда 
		//	Если НЕ ЗначениеЗаполнено(Объект.СкладПолучатель) Тогда
		//		Сообщить("Не выбран склад-получатель.", статуссообщения.Важное);
		//		Отказ = Истина;
		//	КонецЕсли;	
		//КонецЕсли;	
		//Если НЕ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПеремещенияОбъектовЗалога.ВнутриПодразделения") Тогда 
		//	Если НЕ ЗначениеЗаполнено(Объект.Инкассатор) Тогда
		//		Сообщить("Не выбран инкассатор.", статуссообщения.Важное);
		//		Отказ = Истина; 
		//	КонецЕсли;	
		//КонецЕсли;	  
		
		Если НЕ ПроверкаОстатков() Тогда  
			Отказ = Истина;
		КонецЕсли;

		Если Отказ Тогда
			Возврат;
		КонецЕсли;	
	КонецЕсли;		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИтоги()
	ИтогКоличество = ТаблицаТоваров.Итог("Количество");
	ИтогВес = ТаблицаТоваров.Итог("ВесИзделия"); 
	ИтогВесМеталла = ТаблицаТоваров.Итог("ВесМеталла");
    ИтогСуммаОценки = ТаблицаТоваров.Итог("СуммаОценки");
	ИтогСуммаОценкиМакс = ТаблицаТоваров.Итог("СуммаОценкиМакс"); 
	ИтогСуммаОценкиМеталлы = ТаблицаТоваров.Итог("СуммаОценкиМеталлы");
	ИтогСуммаОценкиВставки = ТаблицаТоваров.Итог("СуммаОценкиВставки");
	ИтогСуммаСсуды = ТаблицаТоваров.Итог("СуммаСсуды");
КонецПроцедуры	  


&НаСервере
Процедура ЗаполнитьТаблицуТоваров()  
	Запрос = Новый Запрос;  
	СписокОЗ = Новый СписокЗначений;
	СписокЗБ = Новый СписокЗначений;
	Для каждого Стр Из Объект.Товары Цикл 
		Если СписокЗБ.НайтиПоЗначению(Стр.ЗалоговыйБилет) = неопределено Тогда 
			СписокЗБ.Добавить(Стр.ЗалоговыйБилет);
		КонецЕсли;	
		Если СписокОЗ.НайтиПоЗначению(Стр.ОбъектЗалога) = неопределено Тогда 
			СписокОЗ.Добавить(Стр.ОбъектЗалога);
		КонецЕсли;	
	КонецЦикла;	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);  
	Запрос.УстановитьПараметр("ЗалоговыеБилеты", СписокЗБ); 
	Запрос.УстановитьПараметр("ОбъектыЗалога", СписокОЗ);  
	Запрос.УстановитьПараметр("НакладнаяНаОтгрузку", Объект.НакладнаяНаОтгрузку);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК ВесИзделия,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесМеталла,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценки,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМакс КАК СуммаОценкиМакс,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиКамни КАК СуммаОценкиВставки,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаСсуды КАК СуммаСсуды,
	               |	1 КАК Количество,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вставки КАК Вставки,
	               |	&НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
	               |	ЛБ_ГруппыОбъектовЗалогаСрезПоследних.Группа КАК Группа
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
	               |			&Дата,
	               |			ОбъектЗалога В (&ОбъектыЗалога)
	               |				И ЗалоговыйБилет В (&ЗалоговыеБилеты)) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ГруппыОбъектовЗалога.СрезПоследних(&Дата, ) КАК ЛБ_ГруппыОбъектовЗалогаСрезПоследних
	               |		ПО ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет = ЛБ_ГруппыОбъектовЗалогаСрезПоследних.ЗалоговыйБилет
	               |			И ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога = ЛБ_ГруппыОбъектовЗалогаСрезПоследних.ОбъектЗалога";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	ТаблицаТоваров.Загрузить(ТаблицаЗапроса); 
	ЗаполнитьИтоги();
КонецПроцедуры	

&НаСервере
Процедура ПолучитьТоварыВПути()  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыВПути(Объект.Дата, Объект.Организация, Объект.ЛомбардОткуда, Объект.СкладОтправитель, Объект.ЛомбардКуда, Объект.СкладПолучатель, Объект.НакладнаяНаОтгрузку, Объект.ВидОперации);  
	Объект.Товары.Загрузить(ТаблицаЗапроса);
	Объект.Товары.Сортировать("ЗалоговыйБилет");
	ЗаполнитьТаблицуТоваров(); 
КонецПроцедуры	
	 
&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыПоступленияОбъектовЗалога.ИзЛомбарда Тогда   
		Элементы.СкладОтправитель.Видимость = Истина;
		Элементы.Откуда.Заголовок = "Подразделение"; 		
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыПоступленияОбъектовЗалога.ОтСтороннегоКонтрагента Тогда
		Элементы.СкладОтправитель.Видимость = Ложь;
		Элементы.Откуда.Заголовок = "Контрагент";
	КонецЕсли;	   
КонецПроцедуры	

&НаСервере
Процедура ИзменитьВидОперации()
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыПоступленияОбъектовЗалога.ИзЛомбарда Тогда 
		Объект.ЛомбардОткуда = Справочники.ЛБ_Ломбарды.ПустаяСсылка();
		Элементы.СкладПолучатель.ТолькоПросмотр = Истина;  
		Элементы.Куда.ТолькоПросмотр = Ложь;    
		Элементы.Категория.ТолькоПросмотр = Ложь;  
		Элементы.Откуда.ТолькоПросмотр = Истина;
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыПоступленияОбъектовЗалога.ОтСтороннегоКонтрагента Тогда
		Объект.ЛомбардОткуда = Справочники._ДемоКонтрагенты.ПустаяСсылка();   
		Объект.ЛомбардКуда = Справочники.ЛБ_Ломбарды.ЦентральныйОфис;  
		Элементы.Куда.ТолькоПросмотр = Истина;
		Элементы.СкладПолучатель.ТолькоПросмотр = Ложь;  
		ВыборКатегории = 0;
		Объект.Категория = Перечисления.ЛБ_КатегорииПоступленияОбъектовЗалога.Поштучно;  
		Элементы.Категория.ТолькоПросмотр = Истина;
		Элементы.Откуда.ТолькоПросмотр = Ложь;     
		ТипСтр = "СправочникСсылка._ДемоКонтрагенты";		
		Элементы.Откуда.ОграничениеТипа = Новый ОписаниеТипов(ТипСтр);
		Элементы.Откуда.ВыбиратьТип = Ложь; 
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыПоступленияОбъектовЗалога.РазборСумки Тогда
		ВыборКатегории = 0;
		Объект.Категория = Перечисления.ЛБ_КатегорииПоступленияОбъектовЗалога.Поштучно;  
		Элементы.Категория.ТолькоПросмотр = Истина;  
		Объект.ЛомбардКуда = Справочники.ЛБ_Ломбарды.ЦентральныйОфис;
		Объект.ЛомбардОткуда = Объект.ЛомбардКуда;
		Элементы.Откуда.ТолькоПросмотр = Истина; 
		Элементы.Куда.ТолькоПросмотр = Истина;
	КонецЕсли;	 
			
	УстановитьВидимость(); 
	//Объект.ЛомбардОткуда = неопределено;
	Объект.СкладОтправитель = Справочники.ЛБ_Склады.ПустаяСсылка(); 
	Объект.СкладПолучатель = Справочники.ЛБ_Склады.ПустаяСсылка();
	ТаблицаТоваров.Очистить();
	ЗаполнитьИтоги();
КонецПроцедуры	

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	Если НЕ Объект.ВидОперации = ТекущийВидОперации Тогда
		ТекущийВидОперации = Объект.ВидОперации;
		ИзменитьВидОперации();  
		Объект.НомерПоступления = 0;
		Объект.ПредставлениеНомераПоступления = "";
		//Если НЕ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПоступленияОбъектовЗалога.РазборСумки") Тогда
		//    Элементы.Откуда.СписокВыбора.ЗагрузитьЗначения(ПолучитьПодразделеняВПути());  	
		//КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьТипОтудаКонтрагент()
	Если ТипЗнч(Объект.ЛомбардОткуда) = Тип("СправочникСсылка._ДемоКонтрагенты") Тогда
		Возврат Истина;
	КонецЕсли;	  
	Возврат Ложь;
КонецФункции	

&НаСервере
Функция ЗаполнитьСписокВыбораСкладов(Направление) 
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыПоступленияОбъектовЗалога.ОтСтороннегоКонтрагента И ЗначениеЗаполнено(Объект.ЛомбардКуда) И ЗначениеЗаполнено(Объект.ЛомбардОткуда) Тогда 
		Если Направление = "Откуда" Тогда
		    ВидСкладаНаправление = Объект.СкладПолучатель.ВидСклада;
		Иначе
			ВидСкладаНаправление = Объект.СкладОтправитель.ВидСклада;
		КонецЕсли;	
        Возврат ЛБ_Общиймодуль.ПолучитьСписокВыбораСкладовДляПеремещения(Перечисления.ЛБ_ВидыПеремещенияОбъектовЗалога.СторонннемуКонтрагенту, Объект.ЛомбардКуда, Объект.ЛомбардОткуда, Направление, неопределено); 
	Иначе                    
		Возврат Новый Массив;
	КонецЕсли;
КонецФункции	

&НаКлиенте
Процедура ОткудаПриИзменении(Элемент) 
	Если ПолучитьТипОтудаКонтрагент() Тогда 
		//Элементы.СкладПолучатель.СписокВыбора.ЗагрузитьЗначения(ЗаполнитьСписокВыбораСкладов("Откуда"));
		Если ВыборКатегории = 0 Тогда
		    ПолучитьТоварыВПути();   
		КонецЕсли;    
	Иначе  
		Объект.ЛомбардОткуда = ПредопределенноеЗначение("Справочник._ДемоКонтрагенты.ПустаяСсылка");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КудаПриИзменении(Элемент) 
	Объект.НомерПоступления = 0;
	Объект.ПредставлениеНомераПоступления = "";
	Если ВыборКатегории = 0 Тогда
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПоступленияОбъектовЗалога.РазборСумки") Тогда			
			 Объект.ЛомбардОткуда = Объект.ЛомбардКуда;
		Иначе	 
	         ПолучитьТоварыВПути();
		КонецЕсли;	 
	КонецЕсли;  
КонецПроцедуры

&НаСервере
Функция ПолучитьЗаемщика(ЗБ) 
	Возврат ЗБ.Залогодатель;
КонецФункции

&НаКлиенте
Процедура ИсторияЗБ(Команда)
	ТекСтрока = Элементы.ТаблицаТоваров.ТекущиеДанные;
	Если ТекСтрока = неопределено Тогда
		Возврат;
	КонецЕсли;	
	Если ЗначениеЗаполнено(ТекСтрока.ЗалоговыйБилет) Тогда 
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Клиент", ПолучитьЗаемщика(ТекСтрока.ЗалоговыйБилет));
		ПараметрыФормы.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет);	 
								
		ОткрытьФорму("Отчет.ЛБ_ИсторияЗалоговогоБилета.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);   
	КонецЕсли;	 
КонецПроцедуры

&НаСервере
Процедура ПолучитьКатегорию() 
	Если ВыборКатегории = 0 Тогда
		Объект.Категория = Перечисления.ЛБ_КатегорииПоступленияОбъектовЗалога.Поштучно;
	Иначе
		Объект.Категория = Перечисления.ЛБ_КатегорииПоступленияОбъектовЗалога.Сумка;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте    
Процедура КатегорияПриИзменении(Элемент)
	ПолучитьКатегорию();
	Если ЗначениеЗаполнено(Объект.ЛомбардКуда) Тогда     
		ПараметрыФормы = новый Структура;   
		ПараметрыФормы.Вставить("Документ", Объект);
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбора",ЭтаФорма);
		ОткрытьФорму("Документ.ЛБ_ОприходованиеОбъектовЗалога.Форма.ФормаВыбораВПути", ПараметрыФормы,,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
	КонецЕсли;	
КонецПроцедуры     

&НаСервере
Процедура ПослеВыбора(Результат, ДопПараметры) Экспорт
	Если Результат = неопределено тогда  
		Возврат;
	КонецЕсли;	
	
	Если НЕ Объект.ВидОперации = Перечисления.ЛБ_ВидыПоступленияОбъектовЗалога.ОтСтороннегоКонтрагента Тогда
		Объект.НакладнаяНаОтгрузку = Результат.НакладнаяНаОтгрузку; 
		Объект.ЛомбардОткуда = Результат.Отправитель;  
		Объект.СкладОтправитель = Результат.СкладОтправитель;
		Объект.ЛомбардКуда = Результат.Получатель;           
		Объект.СкладПолучатель = Результат.СкладПолучатель;  
		Если Объект.ВидОперации = Перечисления.ЛБ_ВидыПоступленияОбъектовЗалога.РазборСумки Тогда 
			Объект.СкладПолучатель = Объект.СкладОтправитель;   
		КонецЕсли;	
	Иначе	
		Объект.СкладПолучатель = Результат.СкладОтправитель;
	КонецЕсли;
	ПолучитьТоварыВПути();
	ЗаполнитьТаблицуТоваров()
КонецПроцедуры	     

&НаКлиенте
Процедура ПослеВыбораРазборкаСумки(Результат, ДопПараметры) Экспорт
	Если Результат = неопределено тогда  
		Возврат;
	КонецЕсли;	
	
	Объект.НакладнаяНаОтгрузку = Результат.НакладнаяНаОтгрузку; 
	Объект.СкладОтправитель = Результат.СкладПолучатель;
	Объект.СкладПолучатель = Результат.СкладПолучатель;
	
	ПолучитьТоварыВСумке();
	ЗаполнитьТаблицуТоваров()
КонецПроцедуры	

&НаСервере
Процедура ПолучитьТоварыВСумке()  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыВСумке(Объект.Дата, Объект.Организация, Объект.ЛомбардКуда, Объект.СкладПолучатель, Объект.НакладнаяНаОтгрузку);  
	Объект.Товары.Загрузить(ТаблицаЗапроса);
	Объект.Товары.Сортировать("ЗалоговыйБилет");
КонецПроцедуры	

&НаКлиенте
Процедура Заполнить(Команда)  
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПоступленияОбъектовЗалога.РазборСумки") Тогда
		Если ЗначениеЗаполнено(Объект.ЛомбардКуда) Тогда     
			ПараметрыФормы = новый Структура;   
			ПараметрыФормы.Вставить("Документ", Объект);
			ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораРазборкаСумки",ЭтаФорма);
			ОткрытьФорму("Документ.ЛБ_ОприходованиеОбъектовЗалога.Форма.ФормаВыбораВСумке", ПараметрыФормы,,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
		Иначе
		    Предупреждение("Необходимо выбрать подразделение-получатель", 60);
		КонецЕсли;	
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПоступленияОбъектовЗалога.ОтСтороннегоКонтрагента") Тогда
		Если ЗначениеЗаполнено(Объект.ЛомбардОткуда) И ЗначениеЗаполнено(Объект.СкладПолучатель) Тогда     
			ПараметрыФормы = новый Структура;   
			ПараметрыФормы.Вставить("Документ", Объект);
			ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбора",ЭтаФорма);
			ОткрытьФорму("Документ.ЛБ_ОприходованиеОбъектовЗалога.Форма.ФормаВыбораВПути", ПараметрыФормы,,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе
			Предупреждение("Необходимо выбрать контрагента и склад-получатель", 60);
		КонецЕсли;	 
	Иначе	
		Если ЗначениеЗаполнено(Объект.ЛомбардКуда) Тогда     
			ПараметрыФормы = новый Структура;   
			ПараметрыФормы.Вставить("Документ", Объект);
			ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбора",ЭтаФорма);
			ОткрытьФорму("Документ.ЛБ_ОприходованиеОбъектовЗалога.Форма.ФормаВыбораВПути", ПараметрыФормы,,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе
			Предупреждение("Необходимо выбрать подразделение-получатель", 60);
		КонецЕсли;	 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СкладОтправительНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СкладПолучательНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	СтандартнаяОбработка = Ложь;
	СписокСкладов = Новый СписокЗначений; 
	СписокСкладов.ЗагрузитьЗначения(ЗаполнитьСписокВыбораСкладов("Откуда"));
	ВыбЗначение = ВыбратьИзсписка(СписокСкладов, Элемент); 
	Если НЕ ВыбЗначение = неопределено Тогда  
		Объект.СкладПолучатель = ВыбЗначение.Значение;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Если ВыборКатегории = 0 Тогда
	   ПолучитьТоварыВПути();   
	КонецЕсли;   
КонецПроцедуры

&НаКлиенте
Процедура СкладОтправительПриИзменении(Элемент)
	Если ВыборКатегории = 0 Тогда
	   ПолучитьТоварыВПути();   
	КонецЕсли;  
КонецПроцедуры

&НаКлиенте
Процедура СкладПолучательПриИзменении(Элемент)
	Если ВыборКатегории = 0 Тогда 
		ТаблицаТоваров.Очистить();
	    ПолучитьТоварыВПути();   
	КонецЕсли;  
КонецПроцедуры

&НаСервере
Функция ПолучитьПодразделеняВПути() 
	СписокП = Новый Массив;
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", Объект.Дата); 
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОбъектыЗалогаВПутиОстатки.Отправитель КАК Отправитель
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОбъектыЗалогаВПути.Остатки(
	               |			&Дата,
	               |			Организация = &Организация";
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыПоступленияОбъектовЗалога.ИзЛомбарда Тогда
		Запрос.Текст =  Запрос.Текст + "
	               |				И ТИПЗНАЧЕНИЯ(Отправитель) = ТИП(Справочник.ЛБ_Ломбарды)";
	Иначе 
		Запрос.Текст =  Запрос.Текст + "
	               |				И ТИПЗНАЧЕНИЯ(Отправитель) = ТИП(Справочник._ДемоКонтрагенты)";
	КонецЕсли;	
	Запрос.Текст =  Запрос.Текст + ") КАК ЛБ_ОбъектыЗалогаВПутиОстатки			   
				   |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ОбъектыЗалогаВПутиОстатки.Отправитель";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл  
		СписокП.Добавить(Выборка.Отправитель);
	Конеццикла;	                   
	Возврат СписокП;
КонецФункции	

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьСостояниеДокумента(); 
	ЭтаФорма.Заголовок = "Оприходование объектов залога № " + СокрЛП(Объект.ПредставлениеНомераПоступления) + " от " + Формат(Объект.Дата, "ДЛФ=DT");
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ОткудаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПоступленияОбъектовЗалога.ОтСтороннегоКонтрагента") Тогда
		ТипСтр = "СправочникСсылка._ДемоКонтрагенты";
	КонецЕсли;	
	Элементы.Откуда.ОграничениеТипа = Новый ОписаниеТипов(ТипСтр);
	Элементы.Откуда.ВыбиратьТип = Ложь; 
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоваровПослеУдаления(Элемент)
	ЗаполнитьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	 ЭтаФорма.Заголовок = "Оприходование объектов залога № " + СокрЛП(Объект.ПредставлениеНомераПоступления) + " от " + Формат(Объект.Дата, "ДЛФ=DT");
КонецПроцедуры








