#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВремяДокументаПоУмолчанию() Экспорт
	
	Возврат Новый Структура("Часы, Минуты", 6, 0);
	
КонецФункции

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область СчетаУчета

Процедура УстановитьПравилаЗаполненияСчетовУчета(Правила) Экспорт
	
	// Табличная часть Товары
	
	//СчетаУчетаВДокументах.ДобавитьПравилоЗаполнения(Правила, "Товары", "СчетУчета",    "Запасы");
	//СчетаУчетаВДокументах.ДобавитьВПравилоИсточникДанныхРеквизитОбъекта(Правила, "Номенклатура", "Номенклатура");
	//СчетаУчетаВДокументах.ДобавитьВПравилоУсловиеЗапрещено(Правила, "ТоварыВЦенахПродажи");
	//
	//СчетаУчетаВДокументах.ДобавитьПравилоЗаполнения(Правила, "Товары", "СчетУчета",    "ЗапасыВЦенахПродажи");
	//СчетаУчетаВДокументах.ДобавитьВПравилоИсточникДанныхРеквизитОбъекта(Правила, "Номенклатура", "Номенклатура");
	//СчетаУчетаВДокументах.ДобавитьВПравилоУсловиеРазрешено(Правила, "ТоварыВЦенахПродажи");
	//
	//// Данные заполнения
	//СчетаУчетаВДокументах.ДобавитьВПравилоОписаниеРеквизитаДокумента(Правила, "Дата");
	//СчетаУчетаВДокументах.ДобавитьВПравилоОписаниеРеквизитаДокумента(Правила, "Организация");
	//СчетаУчетаВДокументах.ДобавитьВПравилоОписаниеРеквизитаДокумента(Правила, "Склад");
	
КонецПроцедуры

#Область УстаревшиеПроцедурыИФункции

// Устарела: Следует использовать ЗаполнитьПередЗаписью(), 
// ЗаполнитьПередОтображениемПользователю(), Заполнить(), 
// ЗаполнитьОбъектПриИзменении(), ЗаполнитьСтроки(),
// либо перед записью документа устанавливать дополнительное свойство 
// ЗаполнитьСчетаУчетаПередЗаписью
//
Процедура ЗаполнитьСчетаУчетаВТабличнойЧасти(Объект, ИмяТабличнойЧасти) Экспорт
	
	// ++ Сербаев 05.05.2023
	//СчетаУчетаВДокументах.ЗаполнитьСчетаУчетаВТабличнойЧасти(
	//	Объект,
	//	ИмяТабличнойЧасти);
	// -- Сербаев 05.05.2023	

КонецПроцедуры

// Устарела: Следует использовать ЗаполнитьПередЗаписью(), 
// ЗаполнитьПередОтображениемПользователю(), Заполнить(), 
// ЗаполнитьОбъектПриИзменении(), ЗаполнитьСтроки(),
// либо перед записью документа устанавливать дополнительное свойство 
// ЗаполнитьСчетаУчетаПередЗаписью
//
// Заполняет счета учета номенклатуры в строке табличной части документа
//
// Параметры:
//  Объект                - ДокументОбъект или соответствующие данные формы
//  СтрокаТабличнойЧасти  - строка табличной части документа
//  ИмяТабличнойЧасти     - имя табличной части документа
//  СведенияОНоменклатуре - оставлен для совместимости; не используется
//
Процедура ЗаполнитьСчетаУчетаВСтрокеТабличнойЧасти(Объект, СтрокаТабличнойЧасти, ИмяТабличнойЧасти, СведенияОНоменклатуре = Неопределено) Экспорт
	
	// ++ Сербаев 05.05.2023
	//СчетаУчетаВДокументах.ЗаполнитьСчетаУчетаВСтрокеТабличнойЧасти(
	//	Объект,
	//	СтрокаТабличнойЧасти,
	//	ИмяТабличнойЧасти);
	// -- Сербаев 05.05.2023

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	// Инвентаризация товаров на складе
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "ИнвентаризацияТоваровНаСкладе";
	//КомандаПечати.Представление = НСтр("ru = 'Инвентаризация товаров на складе'");
	//КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";

	// Инвентаризационная опись товаров (ИНВ-3)
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "ИНВ3";
	//КомандаПечати.Представление = НСтр("ru = 'Инвентаризационная опись товаров (ИНВ-3)'");
	//КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ИНВ8";
	КомандаПечати.Представление = НСтр("ru = '01. ИНВ-8 Акт инвентаризации ДМ и изделий из них'");

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ИНВ8Черновик";
	КомандаПечати.Представление = НСтр("ru = '02. ИНВ-8 Акт инвентаризации ДМ и изделий из них (черновик)'");

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ИНВ8Пустая";
	КомандаПечати.Представление = НСтр("ru = '03. ИНВ-8 Акт инвентаризации ДМ и изделий из них (пустой)'");
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ИНВ5";
	КомандаПечати.Представление = НСтр("ru = '04. ИНВ-5 Акт инвентаризации ДМ на ОХ'");
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ИНВ5Пустая";
	КомандаПечати.Представление = НСтр("ru = '05. ИНВ-5 Акт инвентаризации ДМ на ОХ (пустой)'");
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Изъятые";
	КомандаПечати.Представление = НСтр("ru = '09. Акт проверки документов, подтверждающих изъятие'"); 
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ИНВ19Полная";
	КомандаПечати.Представление = НСтр("ru = '06. ИНВ-19 Сличительная ведомость итогов инвентаризации (полная)'");
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ИНВ19Новое";
	КомандаПечати.Представление = НСтр("ru = '07. ИНВ-19 Сличительная ведомость итогов инвентаризации (новые)'");
	КомандаПечати = КомандыПечати.Добавить();
	
	КомандаПечати.Идентификатор = "ИНВ19Недостача";
	КомандаПечати.Представление = НСтр("ru = '08. ИНВ-19 Сличительная ведомость итогов инвентаризации (недостача)'");   
	КомандаПечати = КомандыПечати.Добавить();
	
	КомандаПечати.Идентификатор = "Посылки";
	КомандаПечати.Представление = НСтр("ru = '10. Опись не распакованных посылок с ценностями'");   
	КомандаПечати = КомандыПечати.Добавить();
	
	КомандаПечати.Идентификатор = "АктПроверки";
	КомандаПечати.Представление = НСтр("ru = 'Акт проверки предметов залога'");
	
	//КомандаПечати.Идентификатор = "АктНаличныхДС";
	//КомандаПечати.Представление = НСтр("ru = '08. Акт инвентаризации наличных ДС'"); 
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ОписьПоступивших";
	КомандаПечати.Представление = НСтр("ru = '11. Опись ценностей, поступивших во время инвентаризации'"); 
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ОписьВыбывших";
	КомандаПечати.Представление = НСтр("ru = '12. Опись ценностей, выбывших во время инвентаризации'");


	//КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";

	// Приказ о проведении инвентаризации (ИНВ-22)
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "ИНВ22";
	//КомандаПечати.Представление = НСтр("ru = 'Приказ о проведении инвентаризации (ИНВ-22)'");
	//КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";

	// Реестр документов
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "Реестр";
	//КомандаПечати.Представление = НСтр("ru = 'Реестр документов'");
	//КомандаПечати.ЗаголовокФормы= НСтр("ru = 'Реестр документов ""Инвентаризация товаров на складе""'");
	//КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечатиРеестраДокументов";
	//КомандаПечати.СписокФорм    = "ФормаСписка";
	//КомандаПечати.Порядок       = 100;
	
	// ++ Сербаев 10.05.2023
	// Акт поверки
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "АктПроверки";
	//КомандаПечати.Представление = НСтр("ru = 'Акт проверки'");
	//КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
    // -- Сербаев 10.05.2023
	
КонецПроцедуры

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	// ++ Сербаев 05.05.2023
	//ВалютаРегламентированногоУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	ВалютаРегламентированногоУчета = Справочники.Валюты.НайтиПоКоду("643");
	// -- Сербаев 05.05.2023
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ИнвентаризацияТоваровНаСкладе") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ИнвентаризацияТоваровНаСкладе", "Инвентаризация товаров на складе", 
			ПечатьИнвентаризации(МассивОбъектов, ОбъектыПечати, ВалютаРегламентированногоУчета), , "Документ.ИнвентаризацияТоваровНаСкладе.ПФ_MXL_ИнвентаризацияТоваровНаСкладе");
	КонецЕсли;
	//Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ИНВ3") Тогда
	//	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ИНВ3", "ИНВ-3 (Инвентаризационная опись товаров)", 
	//		ПечатьИнв3(МассивОбъектов, ОбъектыПечати, ВалютаРегламентированногоУчета), , "Документ.ИнвентаризацияТоваровНаСкладе.ПФ_MXL_ИНВ3");
	//КонецЕсли;
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ИНВ8") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ИНВ8", "ИНВ-8 (Акт инвентаризации драгметаллов и камней)", 
			ПечатьИнв8(МассивОбъектов, ОбъектыПечати, Ложь, Ложь), , "Документ.ЛБ_Инвентаризация.ПФ_MXL_ИНВ8");
	КонецЕсли; 
		
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ИНВ8Черновик") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ИНВ8Черновик", "ИНВ-8 (Акт инвентаризации драгметаллов и камней)", 
			ПечатьИнв8(МассивОбъектов, ОбъектыПечати, Ложь, Истина), , "Документ.ЛБ_Инвентаризация.ПФ_MXL_ИНВ8");
	КонецЕсли;
		
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ИНВ8Пустая") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ИНВ8Пустая", "ИНВ-8 (Акт инвентаризации драгметаллов и камней)", 
			ПечатьИнв8(МассивОбъектов, ОбъектыПечати, Истина, Ложь), , "Документ.ЛБ_Инвентаризация.ПФ_MXL_ИНВ8");
		КонецЕсли;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ИНВ5") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ИНВ5", "ИНВ-5 (Акт инвентаризации драгметаллов и камней на ОХ)", 
			ПечатьИнв5(МассивОбъектов, ОбъектыПечати, Ложь), , "Документ.ЛБ_Инвентаризация.ПФ_MXL_ИНВ5");
	КонецЕсли;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ИНВ5Пустая") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ИНВ5Пустая", "ИНВ-5 (Акт инвентаризации драгметаллов и камней на ОХ)", 
			ПечатьИнв5(МассивОбъектов, ОбъектыПечати, Истина), , "Документ.ЛБ_Инвентаризация.ПФ_MXL_ИНВ5");
	КонецЕсли;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ОписьПоступивших") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ОписьПоступивших", "Опись поступивших", 
			ПечатьОписиПоступивших(МассивОбъектов, ОбъектыПечати, Ложь), , "Документ.ЛБ_Инвентаризация.ПФ_MXL_ОписьПоступивших");
	КонецЕсли;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ОписьВыбывших") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ОписьВыбывших", "Опись выбывших", 
			ПечатьОписиПоступивших(МассивОбъектов, ОбъектыПечати, Истина), , "Документ.ЛБ_Инвентаризация.ПФ_MXL_ОписьПоступивших");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ИНВ19Полная") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ИНВ19Полная",  "ИНВ-19 (Сличительная ведомость)", 
		ПечатьИНВ19(МассивОбъектов, ОбъектыПечати, "Полная"), , "Документ.ЛБ_Инвентаризация.ПФ_MXL_ИНВ19");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ИНВ19Новое") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ИНВ19Новое",  "ИНВ-19 (Сличительная ведомость)", 
		ПечатьИНВ19(МассивОбъектов, ОбъектыПечати, "Новое"), , "Документ.ЛБ_Инвентаризация.ПФ_MXL_ИНВ19");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ИНВ19Недостача") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ИНВ19Недостача",  "ИНВ-19 (Сличительная ведомость)", 
		ПечатьИНВ19(МассивОбъектов, ОбъектыПечати, "Недостача"), , "Документ.ЛБ_Инвентаризация.ПФ_MXL_ИНВ19_Недостача");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Посылки") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Посылки",  "Опись не распакованных посылок с ценностями", 
		ПечатьПосылки(МассивОбъектов, ОбъектыПечати), , "Документ.ЛБ_Инвентаризация.НеРаспакованныеПосылки");
	КонецЕсли;
	
	//Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктНаличныхДС") Тогда
	//	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктНаличныхДС",  "Акт инвентаризации наличных ДС", 
	//	ПечатьАктаНаличныхДС(МассивОбъектов, ОбъектыПечати, ВалютаРегламентированногоУчета), , "Документ.ИнвентаризацияТоваровНаСкладе.АктНаличныхДС");
	//КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Изъятые") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Изъятые",  "Приложение 7. Изъятые", 
		ПечатьИзъятых(МассивОбъектов, ОбъектыПечати, ВалютаРегламентированногоУчета), , "Документ.ИнвентаризацияТоваровНаСкладе.Изъятые");
	КонецЕсли;
	
	//Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ИНВ22") Тогда
	//	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ИНВ22",  "ИНВ-22 (Приказ)", 
	//		ПечатьИНВ22(МассивОбъектов, ОбъектыПечати, ВалютаРегламентированногоУчета), , "ОбщийМакет.ПФ_MXL_ИНВ22");
	//КонецЕсли; 
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктПроверки") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктПроверки", "Акт проверки", 
			ПечатьАктаПроверки(МассивОбъектов, ОбъектыПечати, ВалютаРегламентированногоУчета), , "Документ.ЛБ_Инвентаризация.ПФ_MXL_АктПроверки");
	КонецЕсли;
	
//	ОбщегоНазначенияБП.ЗаполнитьДополнительныеПараметрыПечати(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);	
	
КонецПроцедуры  

Функция ПолучитьВыборкуШапок_Посылки(МассивОбъектов)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
//	Запрос.УстановитьПараметр("ДополнительнаяКолонкаПечатныхФормДокументов", Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИнвентаризацияТоваровНаСкладе.Ссылка КАК Ссылка,
	|	ИнвентаризацияТоваровНаСкладе.Номер КАК НомерДокумента,
	|	ИнвентаризацияТоваровНаСкладе.Дата КАК ДатаДокумента,
	|	ИнвентаризацияТоваровНаСкладе.НомерПриказа КАК ДокументОснованиеНомер,
	|	ИнвентаризацияТоваровНаСкладе.ДатаПриказа КАК ДокументОснованиеДата,
	|	ИнвентаризацияТоваровНаСкладе.ДатаНачалаИнвентаризации КАК ДатаНачалаИнвентаризации,
	|	ИнвентаризацияТоваровНаСкладе.ДатаОкончанияИнвентаризации КАК ДатаОкончанияИнвентаризации,
	|	ИнвентаризацияТоваровНаСкладе.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	ИнвентаризацияТоваровНаСкладе.Организация КАК Организация,
	|	ИнвентаризацияТоваровНаСкладе.Склад КАК Склад,
	|	ИнвентаризацияТоваровНаСкладе.Ломбард КАК Ломбард,
	|	ИнвентаризацияТоваровНаСкладе.СумкаЗакрыта.(
	|		НомерСтроки КАК НомерСтроки,
	|		Количество КАК Количество,
	|		КоличествоФакт КАК КоличествоФакт,
	|		Ссылка КАК Ссылка,
	|		Металл КАК Металл,
	|		МеталлФакт КАК МеталлФакт,
	|		Проба КАК Проба,
	|		ПробаФакт КАК ПробаФакт,
	|		Категория КАК Категория,
	|		КатегорияФакт КАК КатегорияФакт,
	|		ВидИзделия КАК ВидИзделия,
	|		ВидИзделияФакт КАК ВидИзделияФакт,
	|		СуммаОценки КАК Оценка,
	|		СуммаОценкиФакт КАК ОценкаФакт,
	|		МассаМеталла КАК МассаМеталла,
	|		МассаМеталлаФакт КАК МассаМеталлаФакт,
	|		ОбщаяМасса КАК ОбщаяМасса,
	|		ОбщаяМассаФакт КАК ОбщаяМассаФакт,
	|		Отклонения КАК Отклонения,
	|		Комментарий КАК Комментарий,
	|		ОбъектЗалога КАК ОбъектЗалога,
	|		ОбъектЗалога.Наименование КАК Наименование,
	|		Залогодатель КАК Залогодатель,
	|		ДатаОформленияЗайма КАК ДатаОформленияЗайма,
	|		Приемщик КАК Приемщик,
	|		СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
	|		СуммаОценкиМеталлыФакт КАК СуммаОценкиМеталлыФакт,
	|		СуммаОценкиКамниФакт КАК СуммаОценкиКамниФакт,
	|		Клеймо КАК Клеймо,
	|		КлеймоФакт КАК КлеймоФакт,
	|		Вставки КАК Вставки,
	|		ВставкиФакт КАК ВставкиФакт,
	|		ОстатокЗайма КАК ОстатокЗайма,
	|		Артикул КАК Артикул
	|	) КАК Товары,
	|	ИнвентаризацияТоваровНаСкладе.ИнвентаризационнаяКомиссия.(
	|		НомерСтроки КАК НомерСтроки,
	|		ФизЛицо КАК ФизЛицо,
	|		Председатель КАК Председатель,
	|		Дистанционно КАК Дистанционно
	|	) КАК ИнвентаризационнаяКомиссия,
	|	ИнвентаризацияТоваровНаСкладе.ПричинаПроведенияИнвентаризации КАК ПричинаПроведенияИнвентаризации,
	|	ИнвентаризацияТоваровНаСкладе.МОЛы.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ФизЛицо КАК ФизЛицо
	|	) КАК МОЛы
	|ИЗ
	|	Документ.ЛБ_Инвентаризация КАК ИнвентаризацияТоваровНаСкладе
	|ГДЕ
	|	ИнвентаризацияТоваровНаСкладе.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИнвентаризацияТоваровНаСкладе.Дата,
	|	Ссылка,
	|	Председатель УБЫВ,
	|	ИнвентаризацияТоваровНаСкладе.Товары.НомерСтроки";

	Возврат Запрос.Выполнить().Выбрать();

КонецФункции

Функция ПолучитьВыборкуШапок_Инв8(МассивОбъектов)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
//	Запрос.УстановитьПараметр("ДополнительнаяКолонкаПечатныхФормДокументов", Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИнвентаризацияТоваровНаСкладе.Ссылка КАК Ссылка,
	|	ИнвентаризацияТоваровНаСкладе.Номер КАК Номер,
	|	ИнвентаризацияТоваровНаСкладе.Дата КАК Дата,
	|	ИнвентаризацияТоваровНаСкладе.НомерПриказа КАК НомерПриказа,
	|	ИнвентаризацияТоваровНаСкладе.ДатаПриказа КАК Датаприказа,
	|	ИнвентаризацияТоваровНаСкладе.ДатаНачалаИнвентаризации КАК ДатаНачалаИнвентаризации,
	|	ИнвентаризацияТоваровНаСкладе.ДатаОкончанияИнвентаризации КАК ДатаОкончанияИнвентаризации,
	|	ИнвентаризацияТоваровНаСкладе.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	ИнвентаризацияТоваровНаСкладе.Организация КАК Организация,
	|	ИнвентаризацияТоваровНаСкладе.Организация КАК Организация1,
	|	ИнвентаризацияТоваровНаСкладе.Склад КАК Склад,
	|	ИнвентаризацияТоваровНаСкладе.Ломбард КАК Ломбард,
	|	ИнвентаризацияТоваровНаСкладе.Товары.(
	|		НомерСтроки КАК НомерСтроки,
	|		Количество КАК Количество,
	|		КоличествоФакт КАК КоличествоФакт,
	|		Ссылка КАК Ссылка,
	|		Артикул КАК Артикул,
	|		Металл КАК Металл,
	|		МеталлФакт КАК МеталлФакт,
	|		Проба КАК Проба,
	|		ПробаФакт КАК ПробаФакт,
	|		Категория КАК Категория,
	|		КатегорияФакт КАК КатегорияФакт,
	|		ВидИзделия КАК ВидИзделия,
	|		ВидИзделияФакт КАК ВидИзделияФакт,
	|		СуммаОценки КАК Оценка,
	|		СуммаОценкиФакт КАК ОценкаФакт,
	|		МассаМеталла КАК МассаМеталла,
	|		МассаМеталлаФакт КАК МассаМеталлаФакт,
	|		ОбщаяМасса КАК ОбщаяМасса,
	|		ОбщаяМассаФакт КАК ОбщаяМассаФакт,
	|		Отклонения КАК Отклонения,
	|		Комментарий КАК Комментарий,
	|		ОбъектЗалога КАК ОбъектЗалога,
	|		ОбъектЗалога.Наименование КАК Наименование,
	|		Залогодатель КАК Залогодатель,
	|		ДатаОформленияЗайма КАК ДатаОформленияЗайма,
	|		Приемщик КАК Приемщик,
	|		СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
	|		СуммаОценкиМеталлыФакт КАК СуммаОценкиМеталлыФакт,
	|		СуммаОценкиКамниФакт КАК СуммаОценкиКамниФакт,
	|		Клеймо КАК Клеймо,
	|		КлеймоФакт КАК КлеймоФакт,
	|		Вставки КАК Вставки,
	|		ВставкиФакт КАК ВставкиФакт,
	|		ОстатокЗайма КАК ОстатокЗайма
	|	) КАК Товары,
	|	ИнвентаризацияТоваровНаСкладе.ИнвентаризационнаяКомиссия.(
	|		НомерСтроки КАК НомерСтроки,
	|		ФизЛицо КАК ФизЛицо,
	|		Председатель КАК Председатель,
	|		Дистанционно КАК Дистанционно
	|	) КАК ИнвентаризационнаяКомиссия,
	|	ИнвентаризацияТоваровНаСкладе.ПричинаПроведенияИнвентаризации КАК ПричинаПроведенияИнвентаризации,
	|	ИнвентаризацияТоваровНаСкладе.МОЛы.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ФизЛицо КАК ФизЛицо
	|	) КАК МОЛы
	|ИЗ
	|	Документ.ЛБ_Инвентаризация КАК ИнвентаризацияТоваровНаСкладе
	|ГДЕ
	|	ИнвентаризацияТоваровНаСкладе.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИнвентаризацияТоваровНаСкладе.Дата,
	|	Ссылка,
	|	Председатель УБЫВ,
	|	ИнвентаризацияТоваровНаСкладе.Товары.НомерСтроки";

	Возврат Запрос.Выполнить().Выбрать();

КонецФункции

Функция ПолучитьВыборкуШапок_Инв5(МассивОбъектов)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
//	Запрос.УстановитьПараметр("ДополнительнаяКолонкаПечатныхФормДокументов", Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИнвентаризацияТоваровНаСкладе.Ссылка КАК Ссылка,
	|	ИнвентаризацияТоваровНаСкладе.Номер КАК Номер,
	|	ИнвентаризацияТоваровНаСкладе.Дата КАК Дата,
	|	ИнвентаризацияТоваровНаСкладе.НомерПриказа КАК НомерПриказа,
	|	ИнвентаризацияТоваровНаСкладе.ДатаПриказа КАК Датаприказа,
	|	ИнвентаризацияТоваровНаСкладе.ДатаНачалаИнвентаризации КАК ДатаНачалаИнвентаризации,
	|	ИнвентаризацияТоваровНаСкладе.ДатаОкончанияИнвентаризации КАК ДатаОкончанияИнвентаризации,
	|	ИнвентаризацияТоваровНаСкладе.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	ИнвентаризацияТоваровНаСкладе.Организация КАК Организация,
	|	ИнвентаризацияТоваровНаСкладе.Организация КАК Организация1,
	|	ИнвентаризацияТоваровНаСкладе.Склад КАК Склад,
	|	ИнвентаризацияТоваровНаСкладе.Ломбард КАК Ломбард,
	|	ИнвентаризацияТоваровНаСкладе.ИнвентаризационнаяКомиссия.(
	|		НомерСтроки КАК НомерСтроки,
	|		ФизЛицо КАК ФизЛицо,
	|		Председатель КАК Председатель,
	|		Дистанционно КАК Дистанционно
	|	) КАК ИнвентаризационнаяКомиссия,
	|	ИнвентаризацияТоваровНаСкладе.ПричинаПроведенияИнвентаризации КАК ПричинаПроведенияИнвентаризации,
	|	ИнвентаризацияТоваровНаСкладе.МОЛы.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ФизЛицо КАК ФизЛицо
	|	) КАК МОЛы,
	|	ИнвентаризацияТоваровНаСкладе.НаОХ.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		СчетУчета КАК СчетУчета,
	|		Количество КАК Количество,
	|		КоличествоФакт КАК КоличествоФакт,
	|		КоличествоУчет КАК КоличествоУчет,
	|		Цена КАК Цена,
	|		ЦенаВРознице КАК ЦенаВРознице,
	|		Сумма КАК Сумма,
	|		СуммаУчет КАК СуммаУчет,
	|		Металл КАК Металл,
	|		МеталлФакт КАК МеталлФакт,
	|		Проба КАК Проба,
	|		ПробаФакт КАК ПробаФакт,
	|		Категория КАК Категория,
	|		КатегорияФакт КАК КатегорияФакт,
	|		ВидИзделия КАК ВидИзделия,
	|		ВидИзделияФакт КАК ВидИзделияФакт,
	|		СуммаОценки КАК СуммаОценки,
	|		СуммаОценкиФакт КАК СуммаОценкиФакт,
	|		МассаМеталла КАК МассаМеталла,
	|		МассаМеталлаФакт КАК МассаМеталлаФакт,
	|		ОбщаяМасса КАК ОбщаяМасса,
	|		ОбщаяМассаФакт КАК ОбщаяМассаФакт,
	|		Отклонения КАК Отклонения,
	|		Комментарий КАК Комментарий,
	|		ОбъектЗалога КАК ОбъектЗалога,
	|		Залогодатель КАК Залогодатель,
	|		ДатаОформленияЗайма КАК ДатаОформленияЗайма,
	|		Приемщик КАК Приемщик,
	|		СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
	|		СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
	|		СуммаОценкиМеталлыФакт КАК СуммаОценкиМеталлыФакт,
	|		СуммаОценкиКамни КАК СуммаОценкиКамни,
	|		СуммаОценкиКамниФакт КАК СуммаОценкиКамниФакт,
	|		Клеймо КАК Клеймо,
	|		КлеймоФакт КАК КлеймоФакт,
	|		Вставки КАК Вставки,
	|		ВставкиФакт КАК ВставкиФакт,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		Именник КАК Именник,
	|		ИменникФакт КАК ИменникФакт,
	|		ОперацияЗайма КАК ОперацияЗайма,
	|		КлючСтроки КАК КлючСтроки,
	|		ОстатокЗайма КАК ОстатокЗайма,
	|		Артикул КАК Артикул,
	|		СуммаЗайма КАК СуммаЗайма,
	|		Вставка КАК Вставка,
	|		ДанныеИменника КАК ДанныеИменника,
	|		ДанныеИменникаФакт КАК ДанныеИменникаФакт,
	|		НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
	|		ЦенаФакт КАК ЦенаФакт,
	//|		СуммаОценкиНачальная КАК СуммаОценкиНачальная,
	|		СуммаДолгаЗайма КАК СуммаДолгаЗайма,
	|		СостояниеИзделия КАК СостояниеИзделия,
	|		Дефекты КАК Дефекты,
	|		ОписаниеИзделия КАК ОписаниеИзделия,
	|		Вес30 КАК Вес30,
	|		СуммаОценкиМакс КАК СуммаОценкиМакс,
	|		ОтказОтВыкупа КАК ОтказОтВыкупа
	|	) КАК Товары
	|ИЗ
	|	Документ.ЛБ_Инвентаризация КАК ИнвентаризацияТоваровНаСкладе
	|ГДЕ
	|	ИнвентаризацияТоваровНаСкладе.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИнвентаризацияТоваровНаСкладе.Дата,
	|	Ссылка,
	|	Председатель УБЫВ,
	|	ИнвентаризацияТоваровНаСкладе.Товары.НомерСтроки";

	Возврат Запрос.Выполнить().Выбрать();

КонецФункции

Функция ПолучитьВыборкуШапокБезТоваров(МассивОбъектов)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
//	Запрос.УстановитьПараметр("ДополнительнаяКолонкаПечатныхФормДокументов", Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИнвентаризацияТоваровНаСкладе.Ссылка КАК Ссылка,
	|	ИнвентаризацияТоваровНаСкладе.Номер КАК НомерДокумента,
	|	ИнвентаризацияТоваровНаСкладе.Дата КАК ДатаДокумента,
	|	ИнвентаризацияТоваровНаСкладе.ДокументОснованиеНомер КАК НомерПриказа,
	|	ИнвентаризацияТоваровНаСкладе.ДокументОснованиеДата КАК ДатаПриказа,
	|	ИнвентаризацияТоваровНаСкладе.ДатаНачалаИнвентаризации КАК ДатаНачалаИнвентаризации,
	|	ИнвентаризацияТоваровНаСкладе.ДатаОкончанияИнвентаризации КАК ДатаОкончанияИнвентаризации,
	|	ИнвентаризацияТоваровНаСкладе.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	ИнвентаризацияТоваровНаСкладе.Организация КАК Организация,
	|	ИнвентаризацияТоваровНаСкладе.Склад КАК Склад,
	|	ИнвентаризацияТоваровНаСкладе.Ломбард КАК Ломбард,
	|	ИнвентаризацияТоваровНаСкладе.ИнвентаризационнаяКомиссия.(
	|		НомерСтроки КАК НомерСтроки,
	|		ФизЛицо КАК ФизЛицо,
	|		Председатель КАК Председатель,
	|		Дистанционно КАК Дистанционно
	|	) КАК ИнвентаризационнаяКомиссия,
	|	ИнвентаризацияТоваровНаСкладе.ПричинаПроведенияИнвентаризации КАК ПричинаПроведенияИнвентаризации,
	|	ИнвентаризацияТоваровНаСкладе.МОЛы.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ФизЛицо КАК ФизЛицо
	|	) КАК МОЛы
	|ИЗ
	|	Документ.ЛБ_Инвентаризация КАК ИнвентаризацияТоваровНаСкладе
	|ГДЕ
	|	ИнвентаризацияТоваровНаСкладе.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИнвентаризацияТоваровНаСкладе.Дата,
	|	Ссылка,
	|	Председатель УБЫВ,
	|	ИнвентаризацияТоваровНаСкладе.Товары.НомерСтроки";

	Возврат Запрос.Выполнить().Выбрать();

КонецФункции

Функция ПолучитьВыборкуШапокИзъятые(МассивОбъектов)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
//	Запрос.УстановитьПараметр("ДополнительнаяКолонкаПечатныхФормДокументов", Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИнвентаризацияТоваровНаСкладе.Ссылка КАК Ссылка,
	|	ИнвентаризацияТоваровНаСкладе.Номер КАК НомерДокумента,
	|	ИнвентаризацияТоваровНаСкладе.Дата КАК ДатаДокумента,
	|	ИнвентаризацияТоваровНаСкладе.НомерПриказа КАК ДокументОснованиеНомер,
	|	ИнвентаризацияТоваровНаСкладе.ДатаПриказа КАК ДокументОснованиеДата,
	|	ИнвентаризацияТоваровНаСкладе.ДатаНачалаИнвентаризации КАК ДатаНачалаИнвентаризации,
	|	ИнвентаризацияТоваровНаСкладе.ДатаОкончанияИнвентаризации КАК ДатаОкончанияИнвентаризации,
	|	ИнвентаризацияТоваровНаСкладе.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	ИнвентаризацияТоваровНаСкладе.Организация КАК Организация,
	|	ИнвентаризацияТоваровНаСкладе.Склад КАК Склад,
	|	ИнвентаризацияТоваровНаСкладе.Ломбард КАК Ломбард,
	|	ИнвентаризацияТоваровНаСкладе.ИнвентаризационнаяКомиссия.(
	|		НомерСтроки КАК НомерСтроки,
	|		ФизЛицо КАК ФизЛицо,
	|		Председатель КАК Председатель,
	|		Дистанционно КАК Дистанционно
	|	) КАК ИнвентаризационнаяКомиссия,
	|	ИнвентаризацияТоваровНаСкладе.ПричинаПроведенияИнвентаризации КАК ПричинаПроведенияИнвентаризации,
	|	ИнвентаризацияТоваровНаСкладе.МОЛы.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ФизЛицо КАК ФизЛицо
	|	) КАК МОЛы,
	|	ИнвентаризацияТоваровНаСкладе.Изъятые.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		СчетУчета КАК СчетУчета,
	|		Количество КАК Количество,
	|		КоличествоФакт КАК КоличествоФакт,
	|		КоличествоУчет КАК КоличествоУчет,
	|		Цена КАК Цена,
	|		ЦенаВРознице КАК ЦенаВРознице,
	|		Сумма КАК Сумма,
	|		СуммаУчет КАК СуммаУчет,
	|		Металл КАК Металл,
	|		МеталлФакт КАК МеталлФакт,
	|		Проба КАК Проба,
	|		ПробаФакт КАК ПробаФакт,
	|		Категория КАК Категория,
	|		КатегорияФакт КАК КатегорияФакт,
	|		ВидИзделия КАК ВидИзделия,
	|		ВидИзделияФакт КАК ВидИзделияФакт,
	|		СуммаОценки КАК СуммаОценки,
	|		СуммаОценкиФакт КАК СуммаОценкиФакт,
	|		МассаМеталла КАК МассаМеталла,
	|		МассаМеталлаФакт КАК МассаМеталлаФакт,
	|		ОбщаяМасса КАК ОбщаяМасса,
	|		ОбщаяМассаФакт КАК ОбщаяМассаФакт,
	|		Отклонения КАК Отклонения,
	|		Комментарий КАК Комментарий,
	|		ОбъектЗалога КАК ОбъектЗалога,
	|		Залогодатель КАК Залогодатель,
	|		ДатаОформленияЗайма КАК ДатаОформленияЗайма,
	|		Приемщик КАК Приемщик,
	|		СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
	|		СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
	|		СуммаОценкиМеталлыФакт КАК СуммаОценкиМеталлыФакт,
	|		СуммаОценкиКамни КАК СуммаОценкиКамни,
	|		СуммаОценкиКамниФакт КАК СуммаОценкиКамниФакт,
	|		Клеймо КАК Клеймо,
	|		КлеймоФакт КАК КлеймоФакт,
	|		Вставки КАК Вставки,
	|		ВставкиФакт КАК ВставкиФакт,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		Именник КАК Именник,
	|		ИменникФакт КАК ИменникФакт,
	|		ОперацияЗайма КАК ОперацияЗайма,
	|		КлючСтроки КАК КлючСтроки,
	|		ОстатокЗайма КАК ОстатокЗайма,
	|		Артикул КАК Артикул,
	|		СуммаЗайма КАК СуммаЗайма,
	|		Вставка КАК Вставка,
	|		ДанныеИменника КАК ДанныеИменника,
	|		ДанныеИменникаФакт КАК ДанныеИменникаФакт,
	|		НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
	|		ЦенаФакт КАК ЦенаФакт,
	//|		СуммаОценкиНачальная КАК СуммаОценкиНачальная,
	|		СуммаДолгаЗайма КАК СуммаДолгаЗайма,
	|		СостояниеИзделия КАК СостояниеИзделия,
	|		Дефекты КАК Дефекты,
	|		ОписаниеИзделия КАК ОписаниеИзделия,
	|		Вес30 КАК Вес30,
	|		СуммаОценкиМакс КАК СуммаОценкиМакс,
	|		ОтказОтВыкупа КАК ОтказОтВыкупа
	|	) КАК Изъятые
	|ИЗ
	|	Документ.ЛБ_Инвентаризация КАК ИнвентаризацияТоваровНаСкладе
	|ГДЕ
	|	ИнвентаризацияТоваровНаСкладе.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИнвентаризацияТоваровНаСкладе.Дата,
	|	Ссылка,
	|	Председатель УБЫВ,
	|	ИнвентаризацияТоваровНаСкладе.Товары.НомерСтроки";

	Возврат Запрос.Выполнить().Выбрать();

КонецФункции

Функция ПолучитьВыборкуШапок_Инв19(МассивОбъектов)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
//	Запрос.УстановитьПараметр("ДополнительнаяКолонкаПечатныхФормДокументов", Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить());
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнвентаризацияТоваровНаСкладе.Ссылка КАК Ссылка,
		|	ИнвентаризацияТоваровНаСкладе.Номер КАК НомерДокумента,
		|	ИнвентаризацияТоваровНаСкладе.Дата КАК ДатаДокумента,
		|	ИнвентаризацияТоваровНаСкладе.НомерПриказа КАК ДокументОснованиеНомер,
		|	ИнвентаризацияТоваровНаСкладе.ДатаПриказа КАК ДокументОснованиеДата,
		|	ИнвентаризацияТоваровНаСкладе.ДатаНачалаИнвентаризации КАК ДатаНачалаИнвентаризации,
		|	ИнвентаризацияТоваровНаСкладе.ДатаОкончанияИнвентаризации КАК ДатаОкончанияИнвентаризации,
		|	ИнвентаризацияТоваровНаСкладе.ОтветственноеЛицо КАК ОтветственноеЛицо,
		|	ИнвентаризацияТоваровНаСкладе.Организация КАК Организация,
		|	ИнвентаризацияТоваровНаСкладе.Склад КАК Склад,
		|	ИнвентаризацияТоваровНаСкладе.ИнвентаризационнаяКомиссия.(
		|		НомерСтроки КАК НомерСтроки,
		|		ФизЛицо КАК ФизЛицо,
		|		Председатель КАК Председатель,
		|		Дистанционно КАК Дистанционно
		|	) КАК ИнвентаризационнаяКомиссия,
		|	ИнвентаризацияТоваровНаСкладе.ПричинаПроведенияИнвентаризации КАК ПричинаПроведенияИнвентаризации,
		|	ИнвентаризацияТоваровНаСкладе.МОЛы.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		ФизЛицо КАК ФизЛицо
		|	) КАК МОЛы,
		|	ИнвентаризацияТоваровНаСкладе.ДокументОснованиеВид КАК ДокументОснованиеВид,
		|	ИнвентаризацияТоваровНаСкладе.Ломбард КАК Ломбард
		|ИЗ
		|	Документ.ЛБ_Инвентаризация КАК ИнвентаризацияТоваровНаСкладе
		|ГДЕ
		|	ИнвентаризацияТоваровНаСкладе.Ссылка В(&МассивОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИнвентаризацияТоваровНаСкладе.Дата,
		|	Ссылка,
		|	Председатель УБЫВ,
		|	ИнвентаризацияТоваровНаСкладе.Товары.НомерСтроки";

	Возврат Запрос.Выполнить().Выбрать();

КонецФункции

Функция ПолучитьСтрокиДокумента_Инв19(МассивОбъектов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияТовары.НомерСтроки КАК НомерСтроки,
		|	ЛБ_ИнвентаризацияТовары.Количество КАК Количество,
		|	ЛБ_ИнвентаризацияТовары.КоличествоФакт КАК КоличествоФакт,
		|	ЛБ_ИнвентаризацияТовары.Металл КАК Металл,
		|	ЛБ_ИнвентаризацияТовары.МеталлФакт КАК МеталлФакт,
		|	ЛБ_ИнвентаризацияТовары.Проба КАК Проба,
		|	ЛБ_ИнвентаризацияТовары.ПробаФакт КАК ПробаФакт,
		|	ЛБ_ИнвентаризацияТовары.Категория КАК Категория,
		|	ЛБ_ИнвентаризацияТовары.КатегорияФакт КАК КатегорияФакт,
		|	ЛБ_ИнвентаризацияТовары.ВидИзделия КАК ВидИзделия,
		|	ЛБ_ИнвентаризацияТовары.ВидИзделияФакт КАК ВидИзделияФакт,
		|	ЛБ_ИнвентаризацияТовары.СуммаОценки КАК СуммаОценки,
		|	ЛБ_ИнвентаризацияТовары.СуммаОценкиФакт КАК СуммаОценкиФакт,
		|	ЛБ_ИнвентаризацияТовары.МассаМеталла КАК МассаМеталла,
		|	ЛБ_ИнвентаризацияТовары.МассаМеталлаФакт КАК МассаМеталлаФакт,
		|	ЛБ_ИнвентаризацияТовары.ОбщаяМасса КАК ОбщаяМасса,
		|	ЛБ_ИнвентаризацияТовары.ОбщаяМассаФакт КАК ОбщаяМассаФакт,
		|	ЛБ_ИнвентаризацияТовары.Отклонения КАК Отклонения,
		|	ЛБ_ИнвентаризацияТовары.Комментарий КАК Комментарий,
		|	ЛБ_ИнвентаризацияТовары.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ИнвентаризацияТовары.Залогодатель КАК Залогодатель,
		|	ЛБ_ИнвентаризацияТовары.ДатаОформленияЗайма КАК ДатаОформленияЗайма,
		|	ЛБ_ИнвентаризацияТовары.Приемщик КАК Приемщик,
		|	ЛБ_ИнвентаризацияТовары.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
		|	ЛБ_ИнвентаризацияТовары.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
		|	ЛБ_ИнвентаризацияТовары.СуммаОценкиМеталлыФакт КАК СуммаОценкиМеталлыФакт,
		|	ЛБ_ИнвентаризацияТовары.СуммаОценкиКамни КАК СуммаОценкиКамни,
		|	ЛБ_ИнвентаризацияТовары.СуммаОценкиКамниФакт КАК СуммаОценкиКамниФакт,
		|	ЛБ_ИнвентаризацияТовары.Клеймо КАК Клеймо,
		|	ЛБ_ИнвентаризацияТовары.КлеймоФакт КАК КлеймоФакт,
		|	ЛБ_ИнвентаризацияТовары.Вставки КАК Вставки,
		|	ЛБ_ИнвентаризацияТовары.ВставкиФакт КАК ВставкиФакт,
		|	ЛБ_ИнвентаризацияТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияТовары.Именник КАК Именник,
		|	ЛБ_ИнвентаризацияТовары.ИменникФакт КАК ИменникФакт,
		|	ЛБ_ИнвентаризацияТовары.ОперацияЗайма КАК ОперацияЗайма,
		|	ЛБ_ИнвентаризацияТовары.КлючСтроки КАК КлючСтроки,
		|	ЛБ_ИнвентаризацияТовары.ОстатокЗайма КАК ОстатокЗайма,
		|	ЛБ_ИнвентаризацияТовары.Артикул КАК Артикул,
		|	ЛБ_ИнвентаризацияТовары.СуммаЗайма КАК СуммаЗайма,
		|	ЛБ_ИнвентаризацияТовары.Вставка КАК Вставка,
		|	ЛБ_ИнвентаризацияТовары.ДанныеИменника КАК ДанныеИменника,
		|	ЛБ_ИнвентаризацияТовары.ДанныеИменникаФакт КАК ДанныеИменникаФакт,
		|	ЛБ_ИнвентаризацияТовары.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
		|	ЛБ_ИнвентаризацияТовары.ЦенаФакт КАК ЦенаФакт,
		//|	ЛБ_ИнвентаризацияТовары.СуммаОценкиНачальная КАК СуммаОценкиНачальная,
		|	ЛБ_ИнвентаризацияТовары.СуммаДолгаЗайма КАК СуммаДолгаЗайма,
		|	ЛБ_ИнвентаризацияТовары.СостояниеИзделия КАК СостояниеИзделия,
		|	ЛБ_ИнвентаризацияТовары.Дефекты КАК Дефекты,
		|	ЛБ_ИнвентаризацияТовары.СуммаОценкиМакс КАК СуммаОценкиМакс
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.Товары КАК ЛБ_ИнвентаризацияТовары
		|ГДЕ
		|	ЛБ_ИнвентаризацияТовары.Ссылка В(&МассивОбъектов)
		|	И НЕ ЛБ_ИнвентаризацияТовары.Отклонения = """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияНаОХ.НомерСтроки,
		|	ЛБ_ИнвентаризацияНаОХ.Количество,
		|	ЛБ_ИнвентаризацияНаОХ.КоличествоФакт,
		|	ЛБ_ИнвентаризацияНаОХ.Металл,
		|	ЛБ_ИнвентаризацияНаОХ.МеталлФакт,
		|	ЛБ_ИнвентаризацияНаОХ.Проба,
		|	ЛБ_ИнвентаризацияНаОХ.ПробаФакт,
		|	ЛБ_ИнвентаризацияНаОХ.Категория,
		|	ЛБ_ИнвентаризацияНаОХ.КатегорияФакт,
		|	ЛБ_ИнвентаризацияНаОХ.ВидИзделия,
		|	ЛБ_ИнвентаризацияНаОХ.ВидИзделияФакт,
		|	ЛБ_ИнвентаризацияНаОХ.СуммаОценки,
		|	ЛБ_ИнвентаризацияНаОХ.СуммаОценкиФакт,
		|	ЛБ_ИнвентаризацияНаОХ.МассаМеталла,
		|	ЛБ_ИнвентаризацияНаОХ.МассаМеталлаФакт,
		|	ЛБ_ИнвентаризацияНаОХ.ОбщаяМасса,
		|	ЛБ_ИнвентаризацияНаОХ.ОбщаяМассаФакт,
		|	ЛБ_ИнвентаризацияНаОХ.Отклонения,
		|	ЛБ_ИнвентаризацияНаОХ.Комментарий,
		|	ЛБ_ИнвентаризацияНаОХ.ОбъектЗалога,
		|	ЛБ_ИнвентаризацияНаОХ.Залогодатель,
		|	ЛБ_ИнвентаризацияНаОХ.ДатаОформленияЗайма,
		|	ЛБ_ИнвентаризацияНаОХ.Приемщик,
		|	ЛБ_ИнвентаризацияНаОХ.СтатусОбъектаЗалога,
		|	ЛБ_ИнвентаризацияНаОХ.СуммаОценкиМеталлы,
		|	ЛБ_ИнвентаризацияНаОХ.СуммаОценкиМеталлыФакт,
		|	ЛБ_ИнвентаризацияНаОХ.СуммаОценкиКамни,
		|	ЛБ_ИнвентаризацияНаОХ.СуммаОценкиКамниФакт,
		|	ЛБ_ИнвентаризацияНаОХ.Клеймо,
		|	ЛБ_ИнвентаризацияНаОХ.КлеймоФакт,
		|	ЛБ_ИнвентаризацияНаОХ.Вставки,
		|	ЛБ_ИнвентаризацияНаОХ.ВставкиФакт,
		|	ЛБ_ИнвентаризацияНаОХ.ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияНаОХ.Именник,
		|	ЛБ_ИнвентаризацияНаОХ.ИменникФакт,
		|	ЛБ_ИнвентаризацияНаОХ.ОперацияЗайма,
		|	ЛБ_ИнвентаризацияНаОХ.КлючСтроки,
		|	ЛБ_ИнвентаризацияНаОХ.ОстатокЗайма,
		|	ЛБ_ИнвентаризацияНаОХ.Артикул,
		|	ЛБ_ИнвентаризацияНаОХ.СуммаЗайма,
		|	ЛБ_ИнвентаризацияНаОХ.Вставка,
		|	ЛБ_ИнвентаризацияНаОХ.ДанныеИменника,
		|	ЛБ_ИнвентаризацияНаОХ.ДанныеИменникаФакт,
		|	ЛБ_ИнвентаризацияНаОХ.НомерСтрокиТаблицы,
		|	ЛБ_ИнвентаризацияНаОХ.ЦенаФакт,
		//|	ЛБ_ИнвентаризацияНаОХ.СуммаОценкиНачальная,
		|	ЛБ_ИнвентаризацияНаОХ.СуммаДолгаЗайма,
		|	ЛБ_ИнвентаризацияНаОХ.СостояниеИзделия,
		|	ЛБ_ИнвентаризацияНаОХ.Дефекты,
		|	ЛБ_ИнвентаризацияНаОХ.СуммаОценкиМакс
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.НаОХ КАК ЛБ_ИнвентаризацияНаОХ
		|ГДЕ
		|	ЛБ_ИнвентаризацияНаОХ.Ссылка В(&МассивОбъектов)
		|	И НЕ ЛБ_ИнвентаризацияНаОХ.Отклонения = """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.НомерСтроки,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Количество,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.КоличествоФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Металл,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.МеталлФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Проба,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ПробаФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Категория,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.КатегорияФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ВидИзделия,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ВидИзделияФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.СуммаОценки,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.СуммаОценкиФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.МассаМеталла,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.МассаМеталлаФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ОбщаяМасса,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ОбщаяМассаФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Отклонения,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Комментарий,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ОбъектЗалога,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Залогодатель,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ДатаОформленияЗайма,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Приемщик,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.СтатусОбъектаЗалога,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.СуммаОценкиМеталлы,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.СуммаОценкиМеталлыФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.СуммаОценкиКамни,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.СуммаОценкиКамниФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Клеймо,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.КлеймоФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Вставки,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ВставкиФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Именник,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ИменникФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ОперацияЗайма,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.КлючСтроки,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ОстатокЗайма,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Артикул,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.СуммаЗайма,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Вставка,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ДанныеИменника,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ДанныеИменникаФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.НомерСтрокиТаблицы,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ЦенаФакт,
		//|	ЛБ_ИнвентаризацияСумкаЗакрыта.СуммаОценкиНачальная,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.СуммаДолгаЗайма,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.СостояниеИзделия,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Дефекты,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.СуммаОценкиМакс
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.СумкаЗакрыта КАК ЛБ_ИнвентаризацияСумкаЗакрыта
		|ГДЕ
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Ссылка В(&МассивОбъектов)
		|	И НЕ ЛБ_ИнвентаризацияСумкаЗакрыта.Отклонения = """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияНовыеОЗ.НомерСтроки,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Количество,
		|	ЛБ_ИнвентаризацияНовыеОЗ.КоличествоФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Металл,
		|	ЛБ_ИнвентаризацияНовыеОЗ.МеталлФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Проба,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ПробаФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Категория,
		|	ЛБ_ИнвентаризацияНовыеОЗ.КатегорияФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ВидИзделия,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ВидИзделияФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.СуммаОценки,
		|	ЛБ_ИнвентаризацияНовыеОЗ.СуммаОценкиФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.МассаМеталла,
		|	ЛБ_ИнвентаризацияНовыеОЗ.МассаМеталлаФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ОбщаяМасса,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ОбщаяМассаФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Отклонения,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Комментарий,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ОбъектЗалога,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Залогодатель,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ДатаОформленияЗайма,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Приемщик,
		|	ЛБ_ИнвентаризацияНовыеОЗ.СтатусОбъектаЗалога,
		|	ЛБ_ИнвентаризацияНовыеОЗ.СуммаОценкиМеталлы,
		|	ЛБ_ИнвентаризацияНовыеОЗ.СуммаОценкиМеталлыФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.СуммаОценкиКамни,
		|	ЛБ_ИнвентаризацияНовыеОЗ.СуммаОценкиКамниФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Клеймо,
		|	ЛБ_ИнвентаризацияНовыеОЗ.КлеймоФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Вставки,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ВставкиФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Именник,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ИменникФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ОперацияЗайма,
		|	ЛБ_ИнвентаризацияНовыеОЗ.КлючСтроки,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ОстатокЗайма,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Артикул,
		|	ЛБ_ИнвентаризацияНовыеОЗ.СуммаЗайма,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Вставка,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ДанныеИменника,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ДанныеИменникаФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.НомерСтрокиТаблицы,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ЦенаФакт,
		//|	ЛБ_ИнвентаризацияНовыеОЗ.СуммаОценкиНачальная,
		|	ЛБ_ИнвентаризацияНовыеОЗ.СуммаДолгаЗайма,
		|	ЛБ_ИнвентаризацияНовыеОЗ.СостояниеИзделия,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Дефекты,
		|	ЛБ_ИнвентаризацияНовыеОЗ.СуммаОценкиМакс
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.НовыеОЗ КАК ЛБ_ИнвентаризацияНовыеОЗ
		|ГДЕ
		|	ЛБ_ИнвентаризацияНовыеОЗ.Ссылка В(&МассивОбъектов)
		|	И НЕ ЛБ_ИнвентаризацияНовыеОЗ.Отклонения = """"
		|
		|УПОРЯДОЧИТЬ ПО
		|	Артикул";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Возврат Запрос.Выполнить();
КонецФункции

Функция ПолучитьВставкиДокумента_Инв19(ОЗ, МассивОбъектов)
	
	СтруктураВозврата = Новый Структура("Камни, Металлы");

	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ОбъектЗалога", ОЗ);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияВставкиФакт.ВидВставки КАК ВидВставки,
		|	ЛБ_ИнвентаризацияВставкиФакт.ФормаОгранки КАК ФормаОгранки,
		|	ЛБ_ИнвентаризацияВставкиФакт.Длина КАК Длина,
		|	ЛБ_ИнвентаризацияВставкиФакт.Ширина КАК Ширина,
		|	ЛБ_ИнвентаризацияВставкиФакт.ГруппаЦвета КАК ГруппаЦвета,
		|	ЛБ_ИнвентаризацияВставкиФакт.ГруппаКачества КАК ГруппаКачества,
		|	ЛБ_ИнвентаризацияВставкиФакт.КачествоОгранки КАК КачествоОгранки,
		|	ЛБ_ИнвентаризацияВставкиФакт.Количество КАК Количество,
		|	ЛБ_ИнвентаризацияВставкиФакт.Вес КАК Вес,
		|	ЛБ_ИнвентаризацияВставкиФакт.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияВставкиФакт.Цена КАК Цена,
		|	ЛБ_ИнвентаризацияВставкиФакт.Сумма КАК Сумма,
		|	ЛБ_ИнвентаризацияВставкиФакт.Вид КАК Вид,
		|	ЛБ_ИнвентаризацияВставкиФакт.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ИнвентаризацияВставкиФакт.Диаметр КАК Диаметр,
		|	ЛБ_ИнвентаризацияВставкиФакт.Диаметр1 КАК Диаметр1,
		|	ЛБ_ИнвентаризацияВставкиФакт.Диаметр2 КАК Диаметр2,
		|	ЛБ_ИнвентаризацияВставкиФакт.Высота КАК Высота,
		|	ЛБ_ИнвентаризацияВставкиФакт.ВесГраммы КАК ВесГраммы,
		|	ЛБ_ИнвентаризацияВставкиФакт.ОписаниеРазмера КАК ОписаниеРазмера,
		|	ЛБ_ИнвентаризацияВставкиФакт.ВидОгранки КАК ВидОгранки,
		|	ЛБ_ИнвентаризацияВставкиФакт.ЦенаФакт КАК ЦенаФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.СуммаФакт КАК СуммаФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ФормаОгранкиФакт КАК ФормаОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ДлинаФакт КАК ДлинаФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ШиринаФакт КАК ШиринаФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ГруппаЦветаФакт КАК ГруппаЦветаФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ГруппаКачестваФакт КАК ГруппаКачестваФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.КачествоОгранкиФакт КАК КачествоОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.КоличествоФакт КАК КоличествоФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ВесФакт КАК ВесФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ЕдиницаИзмеренияФакт КАК ЕдиницаИзмеренияФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ВидФакт КАК ВидФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ДиаметрФакт КАК ДиаметрФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.Диаметр1Факт КАК Диаметр1Факт,
		|	ЛБ_ИнвентаризацияВставкиФакт.Диаметр2Факт КАК Диаметр2Факт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ВысотаФакт КАК ВысотаФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ВесГраммыФакт КАК ВесГраммыФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ВидОгранкиФакт КАК ВидОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ВидВставкиФакт КАК ВидВставкиФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.ВставкиФакт КАК ЛБ_ИнвентаризацияВставкиФакт
		|ГДЕ
		|	ЛБ_ИнвентаризацияВставкиФакт.Ссылка В(&МассивОбъектов)
		|	И ЛБ_ИнвентаризацияВставкиФакт.ОбъектЗалога = &ОбъектЗалога
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ВидВставки,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ФормаОгранки,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Длина,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Ширина,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ГруппаЦвета,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ГруппаКачества,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.КачествоОгранки,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Количество,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Вес,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Цена,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Сумма,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Вид,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ОбъектЗалога,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Диаметр,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Диаметр1,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Диаметр2,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Высота,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ВесГраммы,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ОписаниеРазмера,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ВидОгранки,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ЦенаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.СуммаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ФормаОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ДлинаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ШиринаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ГруппаЦветаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ГруппаКачестваФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.КачествоОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.КоличествоФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ВесФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ЕдиницаИзмеренияФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ВидФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ДиаметрФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Диаметр1Факт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Диаметр2Факт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ВысотаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ВесГраммыФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ВидОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ВидВставкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.НомерСтрокиТаблицы
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.ВставкиКамнейНаОХ КАК ЛБ_ИнвентаризацияВставкиКамнейНаОХ
		|ГДЕ
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Ссылка В(&МассивОбъектов)
		|	И ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ОбъектЗалога = &ОбъектЗалога
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ВидВставки,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ФормаОгранки,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Длина,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Ширина,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ГруппаЦвета,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ГруппаКачества,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.КачествоОгранки,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Количество,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Вес,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Цена,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Сумма,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Вид,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ОбъектЗалога,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Диаметр,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Диаметр1,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Диаметр2,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Высота,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ВесГраммы,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ОписаниеРазмера,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ВидОгранки,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ЦенаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.СуммаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ФормаОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ДлинаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ШиринаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ГруппаЦветаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ГруппаКачестваФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.КачествоОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.КоличествоФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ВесФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ЕдиницаИзмеренияФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ВидФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ДиаметрФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Диаметр1Факт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Диаметр2Факт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ВысотаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ВесГраммыФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ВидОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ВидВставкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.НомерСтрокиТаблицы
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.ВставкиКамнейСумкаЗакрыта КАК ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта
		|ГДЕ
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Ссылка В(&МассивОбъектов)
		|	И ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ОбъектЗалога = &ОбъектЗалога
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ВидВставки,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ФормаОгранки,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Длина,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Ширина,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ГруппаЦвета,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ГруппаКачества,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.КачествоОгранки,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Количество,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Вес,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Цена,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Сумма,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Вид,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ОбъектЗалога,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Диаметр,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Диаметр1,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Диаметр2,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Высота,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ВесГраммы,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ОписаниеРазмера,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ВидОгранки,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ЦенаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.СуммаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ФормаОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ДлинаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ШиринаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ГруппаЦветаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ГруппаКачестваФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.КачествоОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.КоличествоФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ВесФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ЕдиницаИзмеренияФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ВидФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ДиаметрФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Диаметр1Факт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Диаметр2Факт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ВысотаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ВесГраммыФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ВидОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ВидВставкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.НомерСтрокиТаблицы
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.ВставкиКамнейНовыеОЗ КАК ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ
		|ГДЕ
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Ссылка В(&МассивОбъектов)
		|	И ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ОбъектЗалога = &ОбъектЗалога";
	
	РезультатК = Запрос.Выполнить().Выгрузить();
	
	Если РезультатК.Количество() > 0 Тогда
		СтруктураВозврата.Камни = РезультатК;
	КонецЕсли;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияВставкиМеталла.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ИнвентаризацияВставкиМеталла.Проба КАК Проба,
		|	ЛБ_ИнвентаризацияВставкиМеталла.Вес КАК Вес,
		|	ЛБ_ИнвентаризацияВставкиМеталла.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияВставкиМеталла.СуммаОценки КАК СуммаОценки,
		|	ЛБ_ИнвентаризацияВставкиМеталла.ПробаФакт КАК ПробаФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталла.ВесФакт КАК ВесФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталла.ЕдиницаИзмеренияФакт КАК ЕдиницаИзмеренияФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталла.СуммаОценкиФакт КАК СуммаОценкиФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталла.ЦенаФакт КАК ЦенаФакт
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.ВставкиМеталла КАК ЛБ_ИнвентаризацияВставкиМеталла
		|ГДЕ
		|	ЛБ_ИнвентаризацияВставкиМеталла.Ссылка В(&МассивОбъектов)
		|	И ЛБ_ИнвентаризацияВставкиМеталла.ОбъектЗалога = &ОбъектЗалога
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияВставкиМеталлаНаОХ.ОбъектЗалога,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНаОХ.Проба,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНаОХ.Вес,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНаОХ.ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНаОХ.СуммаОценки,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНаОХ.ПробаФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНаОХ.ВесФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНаОХ.ЕдиницаИзмеренияФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНаОХ.СуммаОценкиФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНаОХ.ЦенаФакт
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.ВставкиМеталлаНаОХ КАК ЛБ_ИнвентаризацияВставкиМеталлаНаОХ
		|ГДЕ
		|	ЛБ_ИнвентаризацияВставкиМеталлаНаОХ.Ссылка В(&МассивОбъектов)
		|	И ЛБ_ИнвентаризацияВставкиМеталлаНаОХ.ОбъектЗалога = &ОбъектЗалога
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияВставкиМеталлаИзъятые.ОбъектЗалога,
		|	ЛБ_ИнвентаризацияВставкиМеталлаИзъятые.Проба,
		|	ЛБ_ИнвентаризацияВставкиМеталлаИзъятые.Вес,
		|	ЛБ_ИнвентаризацияВставкиМеталлаИзъятые.ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияВставкиМеталлаИзъятые.СуммаОценки,
		|	ЛБ_ИнвентаризацияВставкиМеталлаИзъятые.ПробаФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаИзъятые.ВесФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаИзъятые.ЕдиницаИзмеренияФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаИзъятые.СуммаОценкиФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаИзъятые.ЦенаФакт
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.ВставкиМеталлаИзъятые КАК ЛБ_ИнвентаризацияВставкиМеталлаИзъятые
		|ГДЕ
		|	ЛБ_ИнвентаризацияВставкиМеталлаИзъятые.Ссылка В(&МассивОбъектов)
		|	И ЛБ_ИнвентаризацияВставкиМеталлаИзъятые.ОбъектЗалога = &ОбъектЗалога
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта.ОбъектЗалога,
		|	ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта.Проба,
		|	ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта.Вес,
		|	ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта.ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта.СуммаОценки,
		|	ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта.ПробаФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта.ВесФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта.ЕдиницаИзмеренияФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта.СуммаОценкиФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта.ЦенаФакт
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.ВставкиМеталлаСумкаЗакрыта КАК ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта
		|ГДЕ
		|	ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта.Ссылка В(&МассивОбъектов)
		|	И ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта.ОбъектЗалога = &ОбъектЗалога
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ.ОбъектЗалога,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ.Проба,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ.Вес,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ.ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ.СуммаОценки,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ.ПробаФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ.ВесФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ.ЕдиницаИзмеренияФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ.СуммаОценкиФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ.ЦенаФакт
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.ВставкиМеталлаНовыеОЗ КАК ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ
		|ГДЕ
		|	ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ.Ссылка В(&МассивОбъектов)
		|	И ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ.ОбъектЗалога = &ОбъектЗалога";
	
	РезультатМ = Запрос.Выполнить().Выгрузить();
	
	Если РезультатМ.Количество() > 0 Тогда
		СтруктураВозврата.Металлы = РезультатМ;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
КонецФункции

Функция ПолучитьВыборкуШапокПоступивших(МассивОбъектов)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
//	Запрос.УстановитьПараметр("ДополнительнаяКолонкаПечатныхФормДокументов", Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить());
	Запрос.Текст = 

	"ВЫБРАТЬ
	|	ИнвентаризацияТоваровНаСкладе.Ссылка КАК Ссылка,
	|	ИнвентаризацияТоваровНаСкладе.Номер КАК НомерДокумента,
	|	ИнвентаризацияТоваровНаСкладе.Дата КАК ДатаДокумента,
	|	ИнвентаризацияТоваровНаСкладе.НомерПриказа КАК НомерПриказа,
	|	ИнвентаризацияТоваровНаСкладе.ДатаПриказа КАК ДатаПриказа,
	|	ИнвентаризацияТоваровНаСкладе.ДатаНачалаИнвентаризации КАК ДатаНачалаИнвентаризации,
	|	ИнвентаризацияТоваровНаСкладе.ДатаОкончанияИнвентаризации КАК ДатаОкончанияИнвентаризации,
	|	ИнвентаризацияТоваровНаСкладе.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	ИнвентаризацияТоваровНаСкладе.Организация КАК Организация,
	|	ИнвентаризацияТоваровНаСкладе.Склад КАК Склад,
	|	ИнвентаризацияТоваровНаСкладе.Ломбард КАК Ломбард,
	|	ИнвентаризацияТоваровНаСкладе.ИнвентаризационнаяКомиссия.(
	|		НомерСтроки КАК НомерСтроки,
	|		ФизЛицо КАК ФизЛицо,
	|		Председатель КАК Председатель,
	|		Дистанционно КАК Дистанционно
	|	) КАК ИнвентаризационнаяКомиссия,
	|	ИнвентаризацияТоваровНаСкладе.ПричинаПроведенияИнвентаризации КАК ПричинаПроведенияИнвентаризации,
	|	ИнвентаризацияТоваровНаСкладе.МОЛы.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ФизЛицо КАК ФизЛицо
	|	) КАК МОЛы,
	|	ИнвентаризацияТоваровНаСкладе.НовыеОЗ.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		СчетУчета КАК СчетУчета,
	|		Количество КАК Количество,
	|		КоличествоФакт КАК КоличествоФакт,
	|		КоличествоУчет КАК КоличествоУчет,
	|		Цена КАК Цена,
	|		ЦенаВРознице КАК ЦенаВРознице,
	|		Сумма КАК Сумма,
	|		СуммаУчет КАК СуммаУчет,
	|		Металл КАК Металл,
	|		МеталлФакт КАК МеталлФакт,
	|		Проба КАК Проба,
	|		ПробаФакт КАК ПробаФакт,
	|		Категория КАК Категория,
	|		КатегорияФакт КАК КатегорияФакт,
	|		ВидИзделия КАК ВидИзделия,
	|		ВидИзделияФакт КАК ВидИзделияФакт,
	|		СуммаОценки КАК СуммаОценки,
	|		СуммаОценкиФакт КАК СуммаОценкиФакт,
	|		МассаМеталла КАК МассаМеталла,
	|		МассаМеталлаФакт КАК МассаМеталлаФакт,
	|		ОбщаяМасса КАК ОбщаяМасса,
	|		ОбщаяМассаФакт КАК ОбщаяМассаФакт,
	|		Отклонения КАК Отклонения,
	|		Комментарий КАК Комментарий,
	|		ОбъектЗалога КАК ОбъектЗалога,
	|		Залогодатель КАК Залогодатель,
	|		ДатаОформленияЗайма КАК ДатаОформленияЗайма,
	|		Приемщик КАК Приемщик,
	|		СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
	|		СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
	|		СуммаОценкиМеталлыФакт КАК СуммаОценкиМеталлыФакт,
	|		СуммаОценкиКамни КАК СуммаОценкиКамни,
	|		СуммаОценкиКамниФакт КАК СуммаОценкиКамниФакт,
	|		Клеймо КАК Клеймо,
	|		КлеймоФакт КАК КлеймоФакт,
	|		Вставки КАК Вставки,
	|		ВставкиФакт КАК ВставкиФакт,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		Именник КАК Именник,
	|		ИменникФакт КАК ИменникФакт,
	|		ОперацияЗайма КАК ОперацияЗайма,
	|		КлючСтроки КАК КлючСтроки,
	|		ОстатокЗайма КАК ОстатокЗайма,
	|		Артикул КАК Артикул,
	|		СуммаЗайма КАК СуммаЗайма,
	|		Вставка КАК Вставка,
	|		ДанныеИменника КАК ДанныеИменника,
	|		ДанныеИменникаФакт КАК ДанныеИменникаФакт,
	|		НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
	|		ЦенаФакт КАК ЦенаФакт,
	//|		СуммаОценкиНачальная КАК СуммаОценкиНачальная,
	|		СуммаДолгаЗайма КАК СуммаДолгаЗайма,
	|		СостояниеИзделия КАК СостояниеИзделия,
	|		Дефекты КАК Дефекты,
	|		ОписаниеИзделия КАК ОписаниеИзделия,
	|		Вес30 КАК Вес30,
	|		СуммаОценкиМакс КАК СуммаОценкиМакс,
	|		ОтказОтВыкупа КАК ОтказОтВыкупа
	|	) КАК НовыеОЗ
	|ИЗ
	|	Документ.ЛБ_Инвентаризация КАК ИнвентаризацияТоваровНаСкладе
	|ГДЕ
	|	ИнвентаризацияТоваровНаСкладе.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИнвентаризацияТоваровНаСкладе.Дата,
	|	Ссылка,
	|	Председатель УБЫВ,
	|	ИнвентаризацияТоваровНаСкладе.Товары.НомерСтроки";

	Возврат Запрос.Выполнить().Выбрать();

КонецФункции

Функция ПолучитьПоступившиеТовары(Док)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ломбард", Док.Ломбард);
	Запрос.УстановитьПараметр("Нач", Док.ДатаНачалаИнвентаризации);
	Запрос.УстановитьПараметр("Кон", Док.ДатаОкончанияИнвентаризации);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛБ_ОбъектыЗалогаОбороты.ОбъектЗалога КАК ОбъектЗалога,
	|	ЛБ_ОбъектыЗалогаОбороты.КоличествоПриход КАК Количество,
	|	ЛБ_ОбъектыЗалогаОбороты.КоличествоПриход КАК КоличествоФакт,
	|	ЛБ_ОбъектыЗалогаОбороты.ОбъектЗалога.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделия,
	|	РеквизитыОбъектаЗалога.Проба КАК Проба,
	|	РеквизитыОбъектаЗалога.Проба КАК ПробаФакт,
	|	РеквизитыОбъектаЗалога.Категория КАК Категория,
	|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМасса,
	|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМассаФакт,
	|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталла,
	|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталлаФакт,
	|	РеквизитыОбъектаЗалога.Проба.Владелец КАК Металл,
	|	ЛБ_ОбъектыЗалогаОбороты.ЗалоговыйБилет.Залогодатель КАК Залогодатель,
	|	ЛБ_ОбъектыЗалогаОбороты.ЗалоговыйБилет.Дата КАК ДатаОформленияЗайма,
	//|	ЛБ_ОбъектыЗалогаОбороты.ЗалоговыйБилет.Ответственный КАК Приемщик,
	|	ЛБ_ОбъектыЗалогаОбороты.ЗалоговыйБилет.ОтветственныйСотрудник КАК Приемщик,
	|	ЛБ_ОбъектыЗалогаОбороты.КоличествоРасход КАК КоличествоРасход,
	|	ЛБ_ОбъектыЗалогаОбороты.СуммаОценкиПриход КАК СуммаОценкиПриход
	|ИЗ
	|	РегистрНакопления.ЛБ_ОбъектыЗалога.Обороты(&Нач, &Кон, , Ломбард = &Ломбард) КАК ЛБ_ОбъектыЗалогаОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
	|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
	|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
	|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Клеймо КАК Клеймо,
	|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК Вес,
	|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесЧистый,
	|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Именник КАК Именник
	|		ИЗ
	|			РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(&Кон, ) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних) КАК РеквизитыОбъектаЗалога
	|		ПО ЛБ_ОбъектыЗалогаОбороты.ОбъектЗалога = РеквизитыОбъектаЗалога.ОбъектЗалога";

	Возврат Запрос.Выполнить().Выбрать();

КонецФункции

Функция ПолучитьВыбывшиеТовары(Док)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ломбард", Док.Ломбард);
	Запрос.УстановитьПараметр("Нач", Док.ДатаНачалаИнвентаризации);
	Запрос.УстановитьПараметр("Кон", Док.ДатаОкончанияИнвентаризации);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛБ_ОбъектыЗалогаОбороты.ОбъектЗалога КАК ОбъектЗалога,
	|	ЛБ_ОбъектыЗалогаОбороты.КоличествоРасход КАК Количество,
	|	ЛБ_ОбъектыЗалогаОбороты.КоличествоРасход КАК КоличествоФакт,
	|	ЛБ_ОбъектыЗалогаОбороты.ОбъектЗалога.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделия,
	|	РеквизитыОбъектаЗалога.Проба КАК Проба,
	|	РеквизитыОбъектаЗалога.Проба КАК ПробаФакт,
	|	РеквизитыОбъектаЗалога.Категория КАК Категория,
	|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМасса,
	|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМассаФакт,
	|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталла,
	|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталлаФакт,
	|	РеквизитыОбъектаЗалога.Проба.Владелец КАК Металл,
	|	ЛБ_ОбъектыЗалогаОбороты.ЗалоговыйБилет.Залогодатель КАК Залогодатель,
	|	ЛБ_ОбъектыЗалогаОбороты.ЗалоговыйБилет.Дата КАК ДатаОформленияЗайма,
	//|	ЛБ_ОбъектыЗалогаОбороты.ЗалоговыйБилет.Ответственный КАК Приемщик,
	|	ЛБ_ОбъектыЗалогаОбороты.ЗалоговыйБилет.ОтветственныйСотрудник КАК Приемщик,
	|	ЛБ_ОбъектыЗалогаОбороты.Регистратор.Дата КАК ДатаВыкупа
	|ИЗ
	|	РегистрНакопления.ЛБ_ОбъектыЗалога.Обороты(&Нач, &Кон, Регистратор, Ломбард = &Ломбард) КАК ЛБ_ОбъектыЗалогаОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
	|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
	|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
	|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Клеймо КАК Клеймо,
	|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК Вес,
	|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесЧистый,
	|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Именник КАК Именник
	|		ИЗ
	|			РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(&Кон, ) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних) КАК РеквизитыОбъектаЗалога
	|		ПО ЛБ_ОбъектыЗалогаОбороты.ОбъектЗалога = РеквизитыОбъектаЗалога.ОбъектЗалога";

	Возврат Запрос.Выполнить().Выбрать();

КонецФункции

Функция ПолучитьИзъятыеТовары(Док)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ломбард", Док.Ломбард);
	//Запрос.УстановитьПараметр("Нач", Док.ДатаНачалаИнвентаризации);
	Запрос.УстановитьПараметр("Кон", Док.ДатаОкончанияИнвентаризации);
	Запрос.УстановитьПараметр("Изъят", Перечисления.ЛБ_СтатусыОбъектовЗалога.Изъят);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценки,
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаОплаты КАК СуммаОплаты,
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаДолгаЗайма КАК СуммаДолгаЗайма,
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.Регистратор.ГосОрганИзъятие КАК Орган,
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.Регистратор.ДатаИзъятия КАК ДатаИзъятия,
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.Регистратор.ФИОДолжностьИзъятие КАК ДолжностноеЛицо,
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.Регистратор.ФИОДолжностьСудьи КАК ФИОДолжностьСудьи,
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.Регистратор.ДатаПротоколИзъятия КАК ДатаПротоколаИзъятия,
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.Регистратор.ДокументИзъятияНаименование КАК ДокументИзъятияНаименование,
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.Регистратор.ДокументИзъятияДатаВыдачи КАК ДокументИзъятияДатаВыдачи,
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.Регистратор.ДокументИзъятияКемВыдан КАК ДокументИзъятияКемВыдан,
	               |	1 КАК Количество,
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ЗалоговыйБилет.Залогодатель КАК Залогодатель,
	               |	РеквизитыОЗ.Проба КАК Проба,
	               |	РеквизитыОЗ.ПробаВладелец КАК Металл,
	               |	РеквизитыОЗ.Артикул КАК Артикул,
	               |	РеквизитыОЗ.ВидИзделия КАК ВидИзделия,
	               |	РеквизитыОЗ.Категория КАК Категория,
	               |	РеквизитыОЗ.Вес КАК ОбщаяМасса
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
	               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба.Владелец КАК ПробаВладелец,
	               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
	               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
	               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
	               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК Вес
	               |		ИЗ
	               |			РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних) КАК РеквизитыОЗ
	               |		ПО ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога = РеквизитыОЗ.ОбъектЗалога
	               |ГДЕ
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога = &Изъят
	               |	И ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ЗалоговыйБилет.Ломбард = &Ломбард";
				   
	
	
	//"ВЫБРАТЬ
	//|	ЛБ_ОбъектыЗалогаОбороты.ОбъектЗалога КАК ОбъектЗалога,
	//|	ЛБ_ОбъектыЗалогаОбороты.КоличествоОстаток КАК Количество,
	//|	ЛБ_ОбъектыЗалогаОбороты.КоличествоОстаток КАК КоличествоФакт,
	//|	ЛБ_ОбъектыЗалогаОбороты.ОбъектЗалога.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	//|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделия,
	//|	РеквизитыОбъектаЗалога.Проба КАК Проба,
	//|	РеквизитыОбъектаЗалога.Проба КАК ПробаФакт,
	//|	РеквизитыОбъектаЗалога.Категория КАК Категория,
	//|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМасса,
	//|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМассаФакт,
	//|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталла,
	//|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталлаФакт,
	//|	РеквизитыОбъектаЗалога.Проба.Владелец КАК Металл,
	//|	ЛБ_ОбъектыЗалогаОбороты.ЗалоговыйБилет.Залогодатель КАК Залогодатель,
	//|	ЛБ_ОбъектыЗалогаОбороты.ЗалоговыйБилет.Дата КАК ДатаОформленияЗайма,
	//|	ЛБ_ОбъектыЗалогаОбороты.ЗалоговыйБилет.Ответственный КАК Приемщик,
	//|	СостоянияОбъектовЗалога.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога
	//|ИЗ
	//|	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(&Кон, Ломбард = &Ломбард) КАК ЛБ_ОбъектыЗалогаОбороты
	//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
	//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
	//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
	//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Клеймо КАК Клеймо,
	//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК Вес,
	//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесЧистый,
	//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Именник КАК Именник
	//|		ИЗ
	//|			РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(&Кон, ) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних) КАК РеквизитыОбъектаЗалога
	//|		ПО ЛБ_ОбъектыЗалогаОбороты.ОбъектЗалога = РеквизитыОбъектаЗалога.ОбъектЗалога
	//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	//|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	//|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога
	//|		ИЗ
	//|			РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(&Кон, ) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних) КАК СостоянияОбъектовЗалога
	//|		ПО ЛБ_ОбъектыЗалогаОбороты.ОбъектЗалога = СостоянияОбъектовЗалога.ОбъектЗалога
	//|ГДЕ
	//|	СостоянияОбъектовЗалога.СтатусОбъектаЗалога = &Изъят";

	Возврат Запрос.Выполнить().Выбрать();

КонецФункции

Функция ПолучитьВыборкуШапок_АктПроверки(МассивОбъектов)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ИнвентаризацияТоваровНаСкладе.Ссылка КАК Ссылка,
	//|	ИнвентаризацияТоваровНаСкладе.Номер КАК Номер,
	//|	ИнвентаризацияТоваровНаСкладе.Дата КАК Дата,
	//|	ИнвентаризацияТоваровНаСкладе.ДокументОснованиеНомер КАК НомерПриказа,
	//|	ИнвентаризацияТоваровНаСкладе.ДокументОснованиеДата КАК Датаприказа,
	//|	ИнвентаризацияТоваровНаСкладе.ДатаНачалаИнвентаризации КАК ДатаНачалаИнвентаризации,
	//|	ИнвентаризацияТоваровНаСкладе.ДатаОкончанияИнвентаризации КАК ДатаОкончанияИнвентаризации,
	//|	ИнвентаризацияТоваровНаСкладе.ОтветственноеЛицо КАК ОтветственноеЛицо,
	//|	ИнвентаризацияТоваровНаСкладе.Организация КАК Организация,
	//|	ИнвентаризацияТоваровНаСкладе.Организация КАК Организация1,
	//|	ИнвентаризацияТоваровНаСкладе.Склад КАК Склад,
	//|	ИнвентаризацияТоваровНаСкладе.Ломбард КАК Ломбард,
	////|	ИнвентаризацияТоваровНаСкладе.Товары.(
	//|	ИнвентаризацияТоваровНаСкладе.НаОХ.(
	//|		НомерСтроки КАК НомерСтроки,
	//|		Количество КАК Количество,
	//|		КоличествоФакт КАК КоличествоФакт,
	//|		Ссылка КАК Ссылка,
	//|		Металл КАК Металл,
	//|		МеталлФакт КАК МеталлФакт,
	//|		Проба КАК Проба,
	//|		ПробаФакт КАК ПробаФакт,
	//|		Категория КАК Категория,
	//|		КатегорияФакт КАК КатегорияФакт,
	//|		ВидИзделия КАК ВидИзделия,
	//|		ВидИзделияФакт КАК ВидИзделияФакт,
	//|		СуммаОценки КАК Оценка,
	//|		СуммаОценкиФакт КАК ОценкаФакт,
	//|		МассаМеталла КАК МассаМеталла,
	//|		МассаМеталлаФакт КАК МассаМеталлаФакт,
	//|		ОбщаяМасса КАК ОбщаяМасса,
	//|		ОбщаяМассаФакт КАК ОбщаяМассаФакт,
	//|		Отклонения КАК Отклонения,
	//|		Комментарий КАК Комментарий,
	//|		ОбъектЗалога КАК ОбъектЗалога,
	//|		ОбъектЗалога.Наименование КАК Наименование,
	//|		Залогодатель КАК Залогодатель,
	//|		ДатаОформленияЗайма КАК ДатаОформленияЗайма,
	//|		Приемщик КАК Приемщик,
	//|		СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
	//|		СуммаОценкиМеталлыФакт КАК СуммаОценкиМеталлыФакт,
	//|		СуммаОценкиКамниФакт КАК СуммаОценкиКамниФакт,
	//|		Клеймо КАК Клеймо,
	//|		КлеймоФакт КАК КлеймоФакт,
	//|		Вставки КАК Вставки,
	//|		ВставкиФакт КАК ВставкиФакт,
	//|		Артикул КАК Артикул,
	//|		ОстатокЗайма КАК ОстатокЗайма
	//|	) КАК Товары,
	//|	ИнвентаризацияТоваровНаСкладе.ИнвентаризационнаяКомиссия.(
	//|		НомерСтроки КАК НомерСтроки,
	//|		ФизЛицо КАК ФизЛицо,
	//|		Председатель КАК Председатель
	//|	) КАК ИнвентаризационнаяКомиссия,
	//|	ИнвентаризацияТоваровНаСкладе.ПричинаПроведенияИнвентаризации КАК ПричинаПроведенияИнвентаризации,
	//|	ИнвентаризацияТоваровНаСкладе.МОЛы.(
	//|		Ссылка КАК Ссылка,
	//|		НомерСтроки КАК НомерСтроки,
	//|		ФизЛицо КАК ФизЛицо
	//|	) КАК МОЛы,
	//|	ИнвентаризацияТоваровНаСкладе.ВидИнвентаризации КАК ВидИнвентаризации
	//|ИЗ
	//|	Документ.ЛБ_Инвентаризация КАК ИнвентаризацияТоваровНаСкладе
	//|ГДЕ
	//|	ИнвентаризацияТоваровНаСкладе.Ссылка В(&МассивОбъектов)
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ИнвентаризацияТоваровНаСкладе.Дата,
	//|	Ссылка,
	//|	Председатель УБЫВ,
	//|	ИнвентаризацияТоваровНаСкладе.Товары.НомерСтроки";

	"ВЫБРАТЬ
	|	ИнвентаризацияТоваровНаСкладе.Ссылка КАК Ссылка,
	|	ИнвентаризацияТоваровНаСкладе.Номер КАК Номер,
	|	ИнвентаризацияТоваровНаСкладе.Дата КАК Дата,
	|	ИнвентаризацияТоваровНаСкладе.ДокументОснованиеНомер КАК НомерПриказа,
	|	ИнвентаризацияТоваровНаСкладе.ДокументОснованиеДата КАК Датаприказа,
	|	ИнвентаризацияТоваровНаСкладе.ДатаНачалаИнвентаризации КАК ДатаНачалаИнвентаризации,
	|	ИнвентаризацияТоваровНаСкладе.ДатаОкончанияИнвентаризации КАК ДатаОкончанияИнвентаризации,
	|	ИнвентаризацияТоваровНаСкладе.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	ИнвентаризацияТоваровНаСкладе.Организация КАК Организация,
	|	ИнвентаризацияТоваровНаСкладе.Организация КАК Организация1,
	|	ИнвентаризацияТоваровНаСкладе.Склад КАК Склад,
	|	ИнвентаризацияТоваровНаСкладе.Ломбард КАК Ломбард,
	|	ИнвентаризацияТоваровНаСкладе.ИнвентаризационнаяКомиссия.(
	|		НомерСтроки КАК НомерСтроки,
	|		ФизЛицо КАК ФизЛицо,
	|		Председатель КАК Председатель,
	|		Дистанционно КАК Дистанционно
	|	) КАК ИнвентаризационнаяКомиссия,
	|	ИнвентаризацияТоваровНаСкладе.ПричинаПроведенияИнвентаризации КАК ПричинаПроведенияИнвентаризации,
	|	ИнвентаризацияТоваровНаСкладе.МОЛы.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ФизЛицо КАК ФизЛицо
	|	) КАК МОЛы,
	|	ИнвентаризацияТоваровНаСкладе.ВидИнвентаризации КАК ВидИнвентаризации
	|ИЗ
	|	Документ.ЛБ_Инвентаризация КАК ИнвентаризацияТоваровНаСкладе
	|ГДЕ
	|	ИнвентаризацияТоваровНаСкладе.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИнвентаризацияТоваровНаСкладе.Дата,
	|	Ссылка,
	|	Председатель УБЫВ,
	|	ИнвентаризацияТоваровНаСкладе.Товары.НомерСтроки";
	
	Возврат Запрос.Выполнить().Выбрать();

КонецФункции

Функция ПолучитьСтрокиДокумента_АктПроверки(МассивОбъектов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияТовары.НомерСтроки КАК НомерСтроки,
		|	ЛБ_ИнвентаризацияТовары.Количество КАК Количество,
		|	ЛБ_ИнвентаризацияТовары.КоличествоФакт КАК КоличествоФакт,
		|	ЛБ_ИнвентаризацияТовары.Металл КАК Металл,
		|	ЛБ_ИнвентаризацияТовары.МеталлФакт КАК МеталлФакт,
		|	ЛБ_ИнвентаризацияТовары.Проба КАК Проба,
		|	ЛБ_ИнвентаризацияТовары.ПробаФакт КАК ПробаФакт,
		|	ЛБ_ИнвентаризацияТовары.Категория КАК Категория,
		|	ЛБ_ИнвентаризацияТовары.КатегорияФакт КАК КатегорияФакт,
		|	ЛБ_ИнвентаризацияТовары.ВидИзделия КАК ВидИзделия,
		|	ЛБ_ИнвентаризацияТовары.ВидИзделияФакт КАК ВидИзделияФакт,
		|	ЛБ_ИнвентаризацияТовары.СуммаОценки КАК СуммаОценки,
		|	ЛБ_ИнвентаризацияТовары.СуммаОценкиФакт КАК СуммаОценкиФакт,
		|	ЛБ_ИнвентаризацияТовары.МассаМеталла КАК МассаМеталла,
		|	ЛБ_ИнвентаризацияТовары.МассаМеталлаФакт КАК МассаМеталлаФакт,
		|	ЛБ_ИнвентаризацияТовары.ОбщаяМасса КАК ОбщаяМасса,
		|	ЛБ_ИнвентаризацияТовары.ОбщаяМассаФакт КАК ОбщаяМассаФакт,
		|	ЛБ_ИнвентаризацияТовары.Отклонения КАК Отклонения,
		|	ЛБ_ИнвентаризацияТовары.Комментарий КАК Комментарий,
		|	ЛБ_ИнвентаризацияТовары.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ИнвентаризацияТовары.Залогодатель КАК Залогодатель,
		|	ЛБ_ИнвентаризацияТовары.ДатаОформленияЗайма КАК ДатаОформленияЗайма,
		|	ЛБ_ИнвентаризацияТовары.Приемщик КАК Приемщик,
		|	ЛБ_ИнвентаризацияТовары.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
		|	ЛБ_ИнвентаризацияТовары.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
		|	ЛБ_ИнвентаризацияТовары.СуммаОценкиМеталлыФакт КАК СуммаОценкиМеталлыФакт,
		|	ЛБ_ИнвентаризацияТовары.СуммаОценкиКамни КАК СуммаОценкиКамни,
		|	ЛБ_ИнвентаризацияТовары.СуммаОценкиКамниФакт КАК СуммаОценкиКамниФакт,
		|	ЛБ_ИнвентаризацияТовары.Клеймо КАК Клеймо,
		|	ЛБ_ИнвентаризацияТовары.КлеймоФакт КАК КлеймоФакт,
		|	ЛБ_ИнвентаризацияТовары.Вставки КАК Вставки,
		|	ЛБ_ИнвентаризацияТовары.ВставкиФакт КАК ВставкиФакт,
		|	ЛБ_ИнвентаризацияТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияТовары.Именник КАК Именник,
		|	ЛБ_ИнвентаризацияТовары.ИменникФакт КАК ИменникФакт,
		|	ЛБ_ИнвентаризацияТовары.ОперацияЗайма КАК ОперацияЗайма,
		|	ЛБ_ИнвентаризацияТовары.КлючСтроки КАК КлючСтроки,
		|	ЛБ_ИнвентаризацияТовары.ОстатокЗайма КАК ОстатокЗайма,
		|	ЛБ_ИнвентаризацияТовары.Артикул КАК Артикул,
		|	ЛБ_ИнвентаризацияТовары.СуммаЗайма КАК СуммаЗайма,
		|	ЛБ_ИнвентаризацияТовары.Вставка КАК Вставка,
		|	ЛБ_ИнвентаризацияТовары.ДанныеИменника КАК ДанныеИменника,
		|	ЛБ_ИнвентаризацияТовары.ДанныеИменникаФакт КАК ДанныеИменникаФакт,
		|	ЛБ_ИнвентаризацияТовары.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
		|	ЛБ_ИнвентаризацияТовары.ЦенаФакт КАК ЦенаФакт,
		//|	ЛБ_ИнвентаризацияТовары.СуммаОценкиНачальная КАК СуммаОценкиНачальная,
		|	ЛБ_ИнвентаризацияТовары.СуммаДолгаЗайма КАК СуммаДолгаЗайма,
		|	ЛБ_ИнвентаризацияТовары.СостояниеИзделия КАК СостояниеИзделия,
		|	ЛБ_ИнвентаризацияТовары.Дефекты КАК Дефекты,
		|	ЛБ_ИнвентаризацияТовары.ОписаниеИзделия КАК ОписаниеИзделия,
		|	ЛБ_ИнвентаризацияТовары.СуммаОценкиМакс КАК СуммаОценкиМакс
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.Товары КАК ЛБ_ИнвентаризацияТовары
		|ГДЕ
		|	ЛБ_ИнвентаризацияТовары.Ссылка В(&МассивОбъектов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияНаОХ.НомерСтроки,
		|	ЛБ_ИнвентаризацияНаОХ.Количество,
		|	ЛБ_ИнвентаризацияНаОХ.КоличествоФакт,
		|	ЛБ_ИнвентаризацияНаОХ.Металл,
		|	ЛБ_ИнвентаризацияНаОХ.МеталлФакт,
		|	ЛБ_ИнвентаризацияНаОХ.Проба,
		|	ЛБ_ИнвентаризацияНаОХ.ПробаФакт,
		|	ЛБ_ИнвентаризацияНаОХ.Категория,
		|	ЛБ_ИнвентаризацияНаОХ.КатегорияФакт,
		|	ЛБ_ИнвентаризацияНаОХ.ВидИзделия,
		|	ЛБ_ИнвентаризацияНаОХ.ВидИзделияФакт,
		|	ЛБ_ИнвентаризацияНаОХ.СуммаОценки,
		|	ЛБ_ИнвентаризацияНаОХ.СуммаОценкиФакт,
		|	ЛБ_ИнвентаризацияНаОХ.МассаМеталла,
		|	ЛБ_ИнвентаризацияНаОХ.МассаМеталлаФакт,
		|	ЛБ_ИнвентаризацияНаОХ.ОбщаяМасса,
		|	ЛБ_ИнвентаризацияНаОХ.ОбщаяМассаФакт,
		|	ЛБ_ИнвентаризацияНаОХ.Отклонения,
		|	ЛБ_ИнвентаризацияНаОХ.Комментарий,
		|	ЛБ_ИнвентаризацияНаОХ.ОбъектЗалога,
		|	ЛБ_ИнвентаризацияНаОХ.Залогодатель,
		|	ЛБ_ИнвентаризацияНаОХ.ДатаОформленияЗайма,
		|	ЛБ_ИнвентаризацияНаОХ.Приемщик,
		|	ЛБ_ИнвентаризацияНаОХ.СтатусОбъектаЗалога,
		|	ЛБ_ИнвентаризацияНаОХ.СуммаОценкиМеталлы,
		|	ЛБ_ИнвентаризацияНаОХ.СуммаОценкиМеталлыФакт,
		|	ЛБ_ИнвентаризацияНаОХ.СуммаОценкиКамни,
		|	ЛБ_ИнвентаризацияНаОХ.СуммаОценкиКамниФакт,
		|	ЛБ_ИнвентаризацияНаОХ.Клеймо,
		|	ЛБ_ИнвентаризацияНаОХ.КлеймоФакт,
		|	ЛБ_ИнвентаризацияНаОХ.Вставки,
		|	ЛБ_ИнвентаризацияНаОХ.ВставкиФакт,
		|	ЛБ_ИнвентаризацияНаОХ.ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияНаОХ.Именник,
		|	ЛБ_ИнвентаризацияНаОХ.ИменникФакт,
		|	ЛБ_ИнвентаризацияНаОХ.ОперацияЗайма,
		|	ЛБ_ИнвентаризацияНаОХ.КлючСтроки,
		|	ЛБ_ИнвентаризацияНаОХ.ОстатокЗайма,
		|	ЛБ_ИнвентаризацияНаОХ.Артикул,
		|	ЛБ_ИнвентаризацияНаОХ.СуммаЗайма,
		|	ЛБ_ИнвентаризацияНаОХ.Вставка,
		|	ЛБ_ИнвентаризацияНаОХ.ДанныеИменника,
		|	ЛБ_ИнвентаризацияНаОХ.ДанныеИменникаФакт,
		|	ЛБ_ИнвентаризацияНаОХ.НомерСтрокиТаблицы,
		|	ЛБ_ИнвентаризацияНаОХ.ЦенаФакт,
		//|	ЛБ_ИнвентаризацияНаОХ.СуммаОценкиНачальная,
		|	ЛБ_ИнвентаризацияНаОХ.СуммаДолгаЗайма,
		|	ЛБ_ИнвентаризацияНаОХ.СостояниеИзделия,
		|	ЛБ_ИнвентаризацияНаОХ.Дефекты,
		|	ЛБ_ИнвентаризацияНаОХ.ОписаниеИзделия,
		|	ЛБ_ИнвентаризацияНаОХ.СуммаОценкиМакс
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.НаОХ КАК ЛБ_ИнвентаризацияНаОХ
		|ГДЕ
		|	ЛБ_ИнвентаризацияНаОХ.Ссылка В(&МассивОбъектов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияИзъятые.НомерСтроки,
		|	ЛБ_ИнвентаризацияИзъятые.Количество,
		|	ЛБ_ИнвентаризацияИзъятые.КоличествоФакт,
		|	ЛБ_ИнвентаризацияИзъятые.Металл,
		|	ЛБ_ИнвентаризацияИзъятые.МеталлФакт,
		|	ЛБ_ИнвентаризацияИзъятые.Проба,
		|	ЛБ_ИнвентаризацияИзъятые.ПробаФакт,
		|	ЛБ_ИнвентаризацияИзъятые.Категория,
		|	ЛБ_ИнвентаризацияИзъятые.КатегорияФакт,
		|	ЛБ_ИнвентаризацияИзъятые.ВидИзделия,
		|	ЛБ_ИнвентаризацияИзъятые.ВидИзделияФакт,
		|	ЛБ_ИнвентаризацияИзъятые.СуммаОценки,
		|	ЛБ_ИнвентаризацияИзъятые.СуммаОценкиФакт,
		|	ЛБ_ИнвентаризацияИзъятые.МассаМеталла,
		|	ЛБ_ИнвентаризацияИзъятые.МассаМеталлаФакт,
		|	ЛБ_ИнвентаризацияИзъятые.ОбщаяМасса,
		|	ЛБ_ИнвентаризацияИзъятые.ОбщаяМассаФакт,
		|	ЛБ_ИнвентаризацияИзъятые.Отклонения,
		|	ЛБ_ИнвентаризацияИзъятые.Комментарий,
		|	ЛБ_ИнвентаризацияИзъятые.ОбъектЗалога,
		|	ЛБ_ИнвентаризацияИзъятые.Залогодатель,
		|	ЛБ_ИнвентаризацияИзъятые.ДатаОформленияЗайма,
		|	ЛБ_ИнвентаризацияИзъятые.Приемщик,
		|	ЛБ_ИнвентаризацияИзъятые.СтатусОбъектаЗалога,
		|	ЛБ_ИнвентаризацияИзъятые.СуммаОценкиМеталлы,
		|	ЛБ_ИнвентаризацияИзъятые.СуммаОценкиМеталлыФакт,
		|	ЛБ_ИнвентаризацияИзъятые.СуммаОценкиКамни,
		|	ЛБ_ИнвентаризацияИзъятые.СуммаОценкиКамниФакт,
		|	ЛБ_ИнвентаризацияИзъятые.Клеймо,
		|	ЛБ_ИнвентаризацияИзъятые.КлеймоФакт,
		|	ЛБ_ИнвентаризацияИзъятые.Вставки,
		|	ЛБ_ИнвентаризацияИзъятые.ВставкиФакт,
		|	ЛБ_ИнвентаризацияИзъятые.ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияИзъятые.Именник,
		|	ЛБ_ИнвентаризацияИзъятые.ИменникФакт,
		|	ЛБ_ИнвентаризацияИзъятые.ОперацияЗайма,
		|	ЛБ_ИнвентаризацияИзъятые.КлючСтроки,
		|	ЛБ_ИнвентаризацияИзъятые.ОстатокЗайма,
		|	ЛБ_ИнвентаризацияИзъятые.Артикул,
		|	ЛБ_ИнвентаризацияИзъятые.СуммаЗайма,
		|	ЛБ_ИнвентаризацияИзъятые.Вставка,
		|	ЛБ_ИнвентаризацияИзъятые.ДанныеИменника,
		|	ЛБ_ИнвентаризацияИзъятые.ДанныеИменникаФакт,
		|	ЛБ_ИнвентаризацияИзъятые.НомерСтрокиТаблицы,
		|	ЛБ_ИнвентаризацияИзъятые.ЦенаФакт,
		//|	ЛБ_ИнвентаризацияИзъятые.СуммаОценкиНачальная,
		|	ЛБ_ИнвентаризацияИзъятые.СуммаДолгаЗайма,
		|	ЛБ_ИнвентаризацияИзъятые.СостояниеИзделия,
		|	ЛБ_ИнвентаризацияИзъятые.Дефекты,
		|	ЛБ_ИнвентаризацияИзъятые.ОписаниеИзделия,
		|	ЛБ_ИнвентаризацияИзъятые.СуммаОценкиМакс
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.Изъятые КАК ЛБ_ИнвентаризацияИзъятые
		|ГДЕ
		|	ЛБ_ИнвентаризацияИзъятые.Ссылка В(&МассивОбъектов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.НомерСтроки,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Количество,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.КоличествоФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Металл,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.МеталлФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Проба,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ПробаФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Категория,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.КатегорияФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ВидИзделия,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ВидИзделияФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.СуммаОценки,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.СуммаОценкиФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.МассаМеталла,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.МассаМеталлаФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ОбщаяМасса,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ОбщаяМассаФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Отклонения,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Комментарий,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ОбъектЗалога,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Залогодатель,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ДатаОформленияЗайма,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Приемщик,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.СтатусОбъектаЗалога,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.СуммаОценкиМеталлы,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.СуммаОценкиМеталлыФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.СуммаОценкиКамни,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.СуммаОценкиКамниФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Клеймо,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.КлеймоФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Вставки,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ВставкиФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Именник,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ИменникФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ОперацияЗайма,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.КлючСтроки,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ОстатокЗайма,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Артикул,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.СуммаЗайма,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Вставка,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ДанныеИменника,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ДанныеИменникаФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.НомерСтрокиТаблицы,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ЦенаФакт,
		//|	ЛБ_ИнвентаризацияСумкаЗакрыта.СуммаОценкиНачальная,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.СуммаДолгаЗайма,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.СостояниеИзделия,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Дефекты,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ОписаниеИзделия,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.СуммаОценкиМакс
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.СумкаЗакрыта КАК ЛБ_ИнвентаризацияСумкаЗакрыта
		|ГДЕ
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Ссылка В(&МассивОбъектов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияНовыеОЗ.НомерСтроки,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Количество,
		|	ЛБ_ИнвентаризацияНовыеОЗ.КоличествоФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Металл,
		|	ЛБ_ИнвентаризацияНовыеОЗ.МеталлФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Проба,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ПробаФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Категория,
		|	ЛБ_ИнвентаризацияНовыеОЗ.КатегорияФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ВидИзделия,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ВидИзделияФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.СуммаОценки,
		|	ЛБ_ИнвентаризацияНовыеОЗ.СуммаОценкиФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.МассаМеталла,
		|	ЛБ_ИнвентаризацияНовыеОЗ.МассаМеталлаФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ОбщаяМасса,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ОбщаяМассаФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Отклонения,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Комментарий,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ОбъектЗалога,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Залогодатель,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ДатаОформленияЗайма,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Приемщик,
		|	ЛБ_ИнвентаризацияНовыеОЗ.СтатусОбъектаЗалога,
		|	ЛБ_ИнвентаризацияНовыеОЗ.СуммаОценкиМеталлы,
		|	ЛБ_ИнвентаризацияНовыеОЗ.СуммаОценкиМеталлыФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.СуммаОценкиКамни,
		|	ЛБ_ИнвентаризацияНовыеОЗ.СуммаОценкиКамниФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Клеймо,
		|	ЛБ_ИнвентаризацияНовыеОЗ.КлеймоФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Вставки,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ВставкиФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Именник,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ИменникФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ОперацияЗайма,
		|	ЛБ_ИнвентаризацияНовыеОЗ.КлючСтроки,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ОстатокЗайма,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Артикул,
		|	ЛБ_ИнвентаризацияНовыеОЗ.СуммаЗайма,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Вставка,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ДанныеИменника,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ДанныеИменникаФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.НомерСтрокиТаблицы,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ЦенаФакт,
		//|	ЛБ_ИнвентаризацияНовыеОЗ.СуммаОценкиНачальная,
		|	ЛБ_ИнвентаризацияНовыеОЗ.СуммаДолгаЗайма,
		|	ЛБ_ИнвентаризацияНовыеОЗ.СостояниеИзделия,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Дефекты,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ОписаниеИзделия,
		|	ЛБ_ИнвентаризацияНовыеОЗ.СуммаОценкиМакс
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.НовыеОЗ КАК ЛБ_ИнвентаризацияНовыеОЗ
		|ГДЕ
		|	ЛБ_ИнвентаризацияНовыеОЗ.Ссылка В(&МассивОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Артикул";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции

Функция ПолучитьВставкиДокумента_АктПроверки(ОЗ, МассивОбъектов)
	
	СтруктураВозврата = Новый Структура("Камни, Металлы");

	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ОбъектЗалога", ОЗ);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияВставкиФакт.ВидВставки КАК ВидВставки,
		|	ЛБ_ИнвентаризацияВставкиФакт.ФормаОгранки КАК ФормаОгранки,
		|	ЛБ_ИнвентаризацияВставкиФакт.Длина КАК Длина,
		|	ЛБ_ИнвентаризацияВставкиФакт.Ширина КАК Ширина,
		|	ЛБ_ИнвентаризацияВставкиФакт.ГруппаЦвета КАК ГруппаЦвета,
		|	ЛБ_ИнвентаризацияВставкиФакт.ГруппаКачества КАК ГруппаКачества,
		|	ЛБ_ИнвентаризацияВставкиФакт.КачествоОгранки КАК КачествоОгранки,
		|	ЛБ_ИнвентаризацияВставкиФакт.Количество КАК Количество,
		|	ЛБ_ИнвентаризацияВставкиФакт.Вес КАК Вес,
		|	ЛБ_ИнвентаризацияВставкиФакт.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияВставкиФакт.Цена КАК Цена,
		|	ЛБ_ИнвентаризацияВставкиФакт.Сумма КАК Сумма,
		|	ЛБ_ИнвентаризацияВставкиФакт.Вид КАК Вид,
		|	ЛБ_ИнвентаризацияВставкиФакт.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ИнвентаризацияВставкиФакт.Диаметр КАК Диаметр,
		|	ЛБ_ИнвентаризацияВставкиФакт.Диаметр1 КАК Диаметр1,
		|	ЛБ_ИнвентаризацияВставкиФакт.Диаметр2 КАК Диаметр2,
		|	ЛБ_ИнвентаризацияВставкиФакт.Высота КАК Высота,
		|	ЛБ_ИнвентаризацияВставкиФакт.ВесГраммы КАК ВесГраммы,
		|	ЛБ_ИнвентаризацияВставкиФакт.ОписаниеРазмера КАК ОписаниеРазмера,
		|	ЛБ_ИнвентаризацияВставкиФакт.ВидОгранки КАК ВидОгранки,
		|	ЛБ_ИнвентаризацияВставкиФакт.ЦенаФакт КАК ЦенаФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.СуммаФакт КАК СуммаФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ФормаОгранкиФакт КАК ФормаОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ДлинаФакт КАК ДлинаФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ШиринаФакт КАК ШиринаФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ГруппаЦветаФакт КАК ГруппаЦветаФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ГруппаКачестваФакт КАК ГруппаКачестваФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.КачествоОгранкиФакт КАК КачествоОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.КоличествоФакт КАК КоличествоФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ВесФакт КАК ВесФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ЕдиницаИзмеренияФакт КАК ЕдиницаИзмеренияФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ВидФакт КАК ВидФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ДиаметрФакт КАК ДиаметрФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.Диаметр1Факт КАК Диаметр1Факт,
		|	ЛБ_ИнвентаризацияВставкиФакт.Диаметр2Факт КАК Диаметр2Факт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ВысотаФакт КАК ВысотаФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ВесГраммыФакт КАК ВесГраммыФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ВидОгранкиФакт КАК ВидОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ВидВставкиФакт КАК ВидВставкиФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.ВставкиФакт КАК ЛБ_ИнвентаризацияВставкиФакт
		|ГДЕ
		|	ЛБ_ИнвентаризацияВставкиФакт.Ссылка В(&МассивОбъектов)
		|	И ЛБ_ИнвентаризацияВставкиФакт.ОбъектЗалога = &ОбъектЗалога
		|	И (ЛБ_ИнвентаризацияВставкиФакт.ВидВставки = ЗНАЧЕНИЕ(Справочник.ЛБ_ДрагоценныеКамни.Бриллиант)
		|			ИЛИ ЛБ_ИнвентаризацияВставкиФакт.ВидВставкиФакт = ЗНАЧЕНИЕ(Справочник.ЛБ_ДрагоценныеКамни.Бриллиант))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ВидВставки,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ФормаОгранки,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Длина,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Ширина,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ГруппаЦвета,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ГруппаКачества,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.КачествоОгранки,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Количество,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Вес,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Цена,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Сумма,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Вид,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ОбъектЗалога,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Диаметр,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Диаметр1,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Диаметр2,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Высота,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ВесГраммы,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ОписаниеРазмера,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ВидОгранки,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ЦенаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.СуммаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ФормаОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ДлинаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ШиринаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ГруппаЦветаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ГруппаКачестваФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.КачествоОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.КоличествоФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ВесФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ЕдиницаИзмеренияФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ВидФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ДиаметрФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Диаметр1Факт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Диаметр2Факт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ВысотаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ВесГраммыФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ВидОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ВидВставкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.НомерСтрокиТаблицы
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.ВставкиКамнейНаОХ КАК ЛБ_ИнвентаризацияВставкиКамнейНаОХ
		|ГДЕ
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Ссылка В(&МассивОбъектов)
		|	И ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ОбъектЗалога = &ОбъектЗалога
		|	И (ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ВидВставки = ЗНАЧЕНИЕ(Справочник.ЛБ_ДрагоценныеКамни.Бриллиант)
		|			ИЛИ ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ВидВставкиФакт = ЗНАЧЕНИЕ(Справочник.ЛБ_ДрагоценныеКамни.Бриллиант))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.ВидВставки,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.ФормаОгранки,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.Длина,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.Ширина,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.ГруппаЦвета,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.ГруппаКачества,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.КачествоОгранки,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.Количество,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.Вес,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.Цена,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.Сумма,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.Вид,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.ОбъектЗалога,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.Диаметр,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.Диаметр1,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.Диаметр2,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.Высота,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.ВесГраммы,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.ОписаниеРазмера,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.ВидОгранки,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.ЦенаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.СуммаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.ФормаОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.ДлинаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.ШиринаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.ГруппаЦветаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.ГруппаКачестваФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.КачествоОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.КоличествоФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.ВесФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.ЕдиницаИзмеренияФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.ВидФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.ДиаметрФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.Диаметр1Факт,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.Диаметр2Факт,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.ВысотаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.ВесГраммыФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.ВидОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.ВидВставкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.НомерСтрокиТаблицы
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.ВставкиКамнейИзъятые КАК ЛБ_ИнвентаризацияВставкиКамнейИзъятые
		|ГДЕ
		|	ЛБ_ИнвентаризацияВставкиКамнейИзъятые.Ссылка В(&МассивОбъектов)
		|	И ЛБ_ИнвентаризацияВставкиКамнейИзъятые.ОбъектЗалога = &ОбъектЗалога
		|	И (ЛБ_ИнвентаризацияВставкиКамнейИзъятые.ВидВставки = ЗНАЧЕНИЕ(Справочник.ЛБ_ДрагоценныеКамни.Бриллиант)
		|			ИЛИ ЛБ_ИнвентаризацияВставкиКамнейИзъятые.ВидВставкиФакт = ЗНАЧЕНИЕ(Справочник.ЛБ_ДрагоценныеКамни.Бриллиант))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ВидВставки,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ФормаОгранки,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Длина,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Ширина,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ГруппаЦвета,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ГруппаКачества,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.КачествоОгранки,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Количество,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Вес,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Цена,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Сумма,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Вид,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ОбъектЗалога,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Диаметр,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Диаметр1,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Диаметр2,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Высота,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ВесГраммы,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ОписаниеРазмера,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ВидОгранки,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ЦенаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.СуммаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ФормаОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ДлинаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ШиринаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ГруппаЦветаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ГруппаКачестваФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.КачествоОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.КоличествоФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ВесФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ЕдиницаИзмеренияФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ВидФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ДиаметрФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Диаметр1Факт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Диаметр2Факт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ВысотаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ВесГраммыФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ВидОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ВидВставкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.НомерСтрокиТаблицы
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.ВставкиКамнейСумкаЗакрыта КАК ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта
		|ГДЕ
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Ссылка В(&МассивОбъектов)
		|	И ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ОбъектЗалога = &ОбъектЗалога
		|	И (ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ВидВставки = ЗНАЧЕНИЕ(Справочник.ЛБ_ДрагоценныеКамни.Бриллиант)
		|			ИЛИ ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ВидВставкиФакт = ЗНАЧЕНИЕ(Справочник.ЛБ_ДрагоценныеКамни.Бриллиант))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ВидВставки,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ФормаОгранки,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Длина,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Ширина,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ГруппаЦвета,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ГруппаКачества,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.КачествоОгранки,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Количество,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Вес,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Цена,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Сумма,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Вид,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ОбъектЗалога,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Диаметр,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Диаметр1,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Диаметр2,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Высота,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ВесГраммы,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ОписаниеРазмера,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ВидОгранки,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ЦенаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.СуммаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ФормаОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ДлинаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ШиринаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ГруппаЦветаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ГруппаКачестваФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.КачествоОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.КоличествоФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ВесФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ЕдиницаИзмеренияФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ВидФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ДиаметрФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Диаметр1Факт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Диаметр2Факт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ВысотаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ВесГраммыФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ВидОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ВидВставкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.НомерСтрокиТаблицы
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.ВставкиКамнейНовыеОЗ КАК ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ
		|ГДЕ
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Ссылка В(&МассивОбъектов)
		|	И ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ОбъектЗалога = &ОбъектЗалога
		|	И (ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ВидВставки = ЗНАЧЕНИЕ(Справочник.ЛБ_ДрагоценныеКамни.Бриллиант)
		|			ИЛИ ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ВидВставкиФакт = ЗНАЧЕНИЕ(Справочник.ЛБ_ДрагоценныеКамни.Бриллиант))";
	
	РезультатК = Запрос.Выполнить().Выгрузить();
	
	Если РезультатК.Количество() > 0 Тогда
		СтруктураВозврата.Камни = РезультатК;
	КонецЕсли;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияВставкиМеталла.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ИнвентаризацияВставкиМеталла.Проба КАК Проба,
		|	ЛБ_ИнвентаризацияВставкиМеталла.Вес КАК Вес,
		|	ЛБ_ИнвентаризацияВставкиМеталла.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияВставкиМеталла.СуммаОценки КАК СуммаОценки,
		|	ЛБ_ИнвентаризацияВставкиМеталла.ПробаФакт КАК ПробаФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталла.ВесФакт КАК ВесФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталла.ЕдиницаИзмеренияФакт КАК ЕдиницаИзмеренияФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталла.СуммаОценкиФакт КАК СуммаОценкиФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталла.ЦенаФакт КАК ЦенаФакт
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.ВставкиМеталла КАК ЛБ_ИнвентаризацияВставкиМеталла
		|ГДЕ
		|	ЛБ_ИнвентаризацияВставкиМеталла.Ссылка В(&МассивОбъектов)
		|	И ЛБ_ИнвентаризацияВставкиМеталла.ОбъектЗалога = &ОбъектЗалога
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияВставкиМеталлаНаОХ.ОбъектЗалога,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНаОХ.Проба,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНаОХ.Вес,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНаОХ.ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНаОХ.СуммаОценки,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНаОХ.ПробаФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНаОХ.ВесФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНаОХ.ЕдиницаИзмеренияФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНаОХ.СуммаОценкиФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНаОХ.ЦенаФакт
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.ВставкиМеталлаНаОХ КАК ЛБ_ИнвентаризацияВставкиМеталлаНаОХ
		|ГДЕ
		|	ЛБ_ИнвентаризацияВставкиМеталлаНаОХ.Ссылка В(&МассивОбъектов)
		|	И ЛБ_ИнвентаризацияВставкиМеталлаНаОХ.ОбъектЗалога = &ОбъектЗалога
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияВставкиМеталлаИзъятые.ОбъектЗалога,
		|	ЛБ_ИнвентаризацияВставкиМеталлаИзъятые.Проба,
		|	ЛБ_ИнвентаризацияВставкиМеталлаИзъятые.Вес,
		|	ЛБ_ИнвентаризацияВставкиМеталлаИзъятые.ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияВставкиМеталлаИзъятые.СуммаОценки,
		|	ЛБ_ИнвентаризацияВставкиМеталлаИзъятые.ПробаФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаИзъятые.ВесФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаИзъятые.ЕдиницаИзмеренияФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаИзъятые.СуммаОценкиФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаИзъятые.ЦенаФакт
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.ВставкиМеталлаИзъятые КАК ЛБ_ИнвентаризацияВставкиМеталлаИзъятые
		|ГДЕ
		|	ЛБ_ИнвентаризацияВставкиМеталлаИзъятые.Ссылка В(&МассивОбъектов)
		|	И ЛБ_ИнвентаризацияВставкиМеталлаИзъятые.ОбъектЗалога = &ОбъектЗалога
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта.ОбъектЗалога,
		|	ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта.Проба,
		|	ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта.Вес,
		|	ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта.ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта.СуммаОценки,
		|	ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта.ПробаФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта.ВесФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта.ЕдиницаИзмеренияФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта.СуммаОценкиФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта.ЦенаФакт
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.ВставкиМеталлаСумкаЗакрыта КАК ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта
		|ГДЕ
		|	ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта.Ссылка В(&МассивОбъектов)
		|	И ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта.ОбъектЗалога = &ОбъектЗалога
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ.ОбъектЗалога,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ.Проба,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ.Вес,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ.ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ.СуммаОценки,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ.ПробаФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ.ВесФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ.ЕдиницаИзмеренияФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ.СуммаОценкиФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ.ЦенаФакт
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.ВставкиМеталлаНовыеОЗ КАК ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ
		|ГДЕ
		|	ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ.Ссылка В(&МассивОбъектов)
		|	И ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ.ОбъектЗалога = &ОбъектЗалога";
	
	РезультатМ = Запрос.Выполнить().Выгрузить();
	
	Если РезультатМ.Количество() > 0 Тогда
		СтруктураВозврата.Металлы = РезультатМ;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
КонецФункции

Функция ПолучитьСтрокиВыбывших(МассивОбъектов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияТовары.НомерСтроки КАК НомерСтроки,
		|	ЛБ_ИнвентаризацияТовары.Количество КАК Количество,
		|	ЛБ_ИнвентаризацияТовары.КоличествоФакт КАК КоличествоФакт,
		|	ЛБ_ИнвентаризацияТовары.Металл КАК Металл,
		|	ЛБ_ИнвентаризацияТовары.МеталлФакт КАК МеталлФакт,
		|	ЛБ_ИнвентаризацияТовары.Проба КАК Проба,
		|	ЛБ_ИнвентаризацияТовары.ПробаФакт КАК ПробаФакт,
		|	ЛБ_ИнвентаризацияТовары.Категория КАК Категория,
		|	ЛБ_ИнвентаризацияТовары.КатегорияФакт КАК КатегорияФакт,
		|	ЛБ_ИнвентаризацияТовары.ВидИзделия КАК ВидИзделия,
		|	ЛБ_ИнвентаризацияТовары.ВидИзделияФакт КАК ВидИзделияФакт,
		|	ЛБ_ИнвентаризацияТовары.СуммаОценки КАК СуммаОценки,
		|	ЛБ_ИнвентаризацияТовары.СуммаОценкиФакт КАК СуммаОценкиФакт,
		|	ЛБ_ИнвентаризацияТовары.МассаМеталла КАК МассаМеталла,
		|	ЛБ_ИнвентаризацияТовары.МассаМеталлаФакт КАК МассаМеталлаФакт,
		|	ЛБ_ИнвентаризацияТовары.ОбщаяМасса КАК ОбщаяМасса,
		|	ЛБ_ИнвентаризацияТовары.ОбщаяМассаФакт КАК ОбщаяМассаФакт,
		|	ЛБ_ИнвентаризацияТовары.Отклонения КАК Отклонения,
		|	ЛБ_ИнвентаризацияТовары.Комментарий КАК Комментарий,
		|	ЛБ_ИнвентаризацияТовары.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ИнвентаризацияТовары.Залогодатель КАК Залогодатель,
		|	ЛБ_ИнвентаризацияТовары.ДатаОформленияЗайма КАК ДатаОформленияЗайма,
		|	ЛБ_ИнвентаризацияТовары.Приемщик КАК Приемщик,
		|	ЛБ_ИнвентаризацияТовары.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
		|	ЛБ_ИнвентаризацияТовары.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
		|	ЛБ_ИнвентаризацияТовары.СуммаОценкиМеталлыФакт КАК СуммаОценкиМеталлыФакт,
		|	ЛБ_ИнвентаризацияТовары.СуммаОценкиКамни КАК СуммаОценкиКамни,
		|	ЛБ_ИнвентаризацияТовары.СуммаОценкиКамниФакт КАК СуммаОценкиКамниФакт,
		|	ЛБ_ИнвентаризацияТовары.Клеймо КАК Клеймо,
		|	ЛБ_ИнвентаризацияТовары.КлеймоФакт КАК КлеймоФакт,
		|	ЛБ_ИнвентаризацияТовары.Вставки КАК Вставки,
		|	ЛБ_ИнвентаризацияТовары.ВставкиФакт КАК ВставкиФакт,
		|	ЛБ_ИнвентаризацияТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияТовары.Именник КАК Именник,
		|	ЛБ_ИнвентаризацияТовары.ИменникФакт КАК ИменникФакт,
		|	ЛБ_ИнвентаризацияТовары.ОперацияЗайма КАК ОперацияЗайма,
		|	ЛБ_ИнвентаризацияТовары.КлючСтроки КАК КлючСтроки,
		|	ЛБ_ИнвентаризацияТовары.ОстатокЗайма КАК ОстатокЗайма,
		|	ЛБ_ИнвентаризацияТовары.Артикул КАК Артикул,
		|	ЛБ_ИнвентаризацияТовары.СуммаЗайма КАК СуммаЗайма,
		|	ЛБ_ИнвентаризацияТовары.Вставка КАК Вставка,
		|	ЛБ_ИнвентаризацияТовары.ДанныеИменника КАК ДанныеИменника,
		|	ЛБ_ИнвентаризацияТовары.ДанныеИменникаФакт КАК ДанныеИменникаФакт,
		|	ЛБ_ИнвентаризацияТовары.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
		|	ЛБ_ИнвентаризацияТовары.ЦенаФакт КАК ЦенаФакт,
		//|	ЛБ_ИнвентаризацияТовары.СуммаОценкиНачальная КАК СуммаОценкиНачальная,
		|	ЛБ_ИнвентаризацияТовары.СуммаДолгаЗайма КАК СуммаДолгаЗайма,
		|	ЛБ_ИнвентаризацияТовары.СостояниеИзделия КАК СостояниеИзделия,
		|	ЛБ_ИнвентаризацияТовары.Дефекты КАК Дефекты,
		|	ЛБ_ИнвентаризацияТовары.ОписаниеИзделия КАК ОписаниеИзделия,
		|	ЛБ_ИнвентаризацияТовары.СуммаОценкиМакс КАК СуммаОценкиМакс
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.Товары КАК ЛБ_ИнвентаризацияТовары
		|ГДЕ
		|	ЛБ_ИнвентаризацияТовары.Ссылка В(&МассивОбъектов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияНаОХ.НомерСтроки,
		|	ЛБ_ИнвентаризацияНаОХ.Количество,
		|	ЛБ_ИнвентаризацияНаОХ.КоличествоФакт,
		|	ЛБ_ИнвентаризацияНаОХ.Металл,
		|	ЛБ_ИнвентаризацияНаОХ.МеталлФакт,
		|	ЛБ_ИнвентаризацияНаОХ.Проба,
		|	ЛБ_ИнвентаризацияНаОХ.ПробаФакт,
		|	ЛБ_ИнвентаризацияНаОХ.Категория,
		|	ЛБ_ИнвентаризацияНаОХ.КатегорияФакт,
		|	ЛБ_ИнвентаризацияНаОХ.ВидИзделия,
		|	ЛБ_ИнвентаризацияНаОХ.ВидИзделияФакт,
		|	ЛБ_ИнвентаризацияНаОХ.СуммаОценки,
		|	ЛБ_ИнвентаризацияНаОХ.СуммаОценкиФакт,
		|	ЛБ_ИнвентаризацияНаОХ.МассаМеталла,
		|	ЛБ_ИнвентаризацияНаОХ.МассаМеталлаФакт,
		|	ЛБ_ИнвентаризацияНаОХ.ОбщаяМасса,
		|	ЛБ_ИнвентаризацияНаОХ.ОбщаяМассаФакт,
		|	ЛБ_ИнвентаризацияНаОХ.Отклонения,
		|	ЛБ_ИнвентаризацияНаОХ.Комментарий,
		|	ЛБ_ИнвентаризацияНаОХ.ОбъектЗалога,
		|	ЛБ_ИнвентаризацияНаОХ.Залогодатель,
		|	ЛБ_ИнвентаризацияНаОХ.ДатаОформленияЗайма,
		|	ЛБ_ИнвентаризацияНаОХ.Приемщик,
		|	ЛБ_ИнвентаризацияНаОХ.СтатусОбъектаЗалога,
		|	ЛБ_ИнвентаризацияНаОХ.СуммаОценкиМеталлы,
		|	ЛБ_ИнвентаризацияНаОХ.СуммаОценкиМеталлыФакт,
		|	ЛБ_ИнвентаризацияНаОХ.СуммаОценкиКамни,
		|	ЛБ_ИнвентаризацияНаОХ.СуммаОценкиКамниФакт,
		|	ЛБ_ИнвентаризацияНаОХ.Клеймо,
		|	ЛБ_ИнвентаризацияНаОХ.КлеймоФакт,
		|	ЛБ_ИнвентаризацияНаОХ.Вставки,
		|	ЛБ_ИнвентаризацияНаОХ.ВставкиФакт,
		|	ЛБ_ИнвентаризацияНаОХ.ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияНаОХ.Именник,
		|	ЛБ_ИнвентаризацияНаОХ.ИменникФакт,
		|	ЛБ_ИнвентаризацияНаОХ.ОперацияЗайма,
		|	ЛБ_ИнвентаризацияНаОХ.КлючСтроки,
		|	ЛБ_ИнвентаризацияНаОХ.ОстатокЗайма,
		|	ЛБ_ИнвентаризацияНаОХ.Артикул,
		|	ЛБ_ИнвентаризацияНаОХ.СуммаЗайма,
		|	ЛБ_ИнвентаризацияНаОХ.Вставка,
		|	ЛБ_ИнвентаризацияНаОХ.ДанныеИменника,
		|	ЛБ_ИнвентаризацияНаОХ.ДанныеИменникаФакт,
		|	ЛБ_ИнвентаризацияНаОХ.НомерСтрокиТаблицы,
		|	ЛБ_ИнвентаризацияНаОХ.ЦенаФакт,
		//|	ЛБ_ИнвентаризацияНаОХ.СуммаОценкиНачальная,
		|	ЛБ_ИнвентаризацияНаОХ.СуммаДолгаЗайма,
		|	ЛБ_ИнвентаризацияНаОХ.СостояниеИзделия,
		|	ЛБ_ИнвентаризацияНаОХ.Дефекты,
		|	ЛБ_ИнвентаризацияНаОХ.ОписаниеИзделия,
		|	ЛБ_ИнвентаризацияНаОХ.СуммаОценкиМакс
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.НаОХ КАК ЛБ_ИнвентаризацияНаОХ
		|ГДЕ
		|	ЛБ_ИнвентаризацияНаОХ.Ссылка В(&МассивОбъектов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.НомерСтроки,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Количество,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.КоличествоФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Металл,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.МеталлФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Проба,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ПробаФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Категория,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.КатегорияФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ВидИзделия,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ВидИзделияФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.СуммаОценки,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.СуммаОценкиФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.МассаМеталла,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.МассаМеталлаФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ОбщаяМасса,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ОбщаяМассаФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Отклонения,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Комментарий,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ОбъектЗалога,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Залогодатель,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ДатаОформленияЗайма,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Приемщик,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.СтатусОбъектаЗалога,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.СуммаОценкиМеталлы,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.СуммаОценкиМеталлыФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.СуммаОценкиКамни,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.СуммаОценкиКамниФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Клеймо,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.КлеймоФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Вставки,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ВставкиФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Именник,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ИменникФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ОперацияЗайма,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.КлючСтроки,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ОстатокЗайма,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Артикул,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.СуммаЗайма,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Вставка,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ДанныеИменника,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ДанныеИменникаФакт,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.НомерСтрокиТаблицы,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ЦенаФакт,
		//|	ЛБ_ИнвентаризацияСумкаЗакрыта.СуммаОценкиНачальная,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.СуммаДолгаЗайма,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.СостояниеИзделия,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Дефекты,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.ОписаниеИзделия,
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.СуммаОценкиМакс
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.СумкаЗакрыта КАК ЛБ_ИнвентаризацияСумкаЗакрыта
		|ГДЕ
		|	ЛБ_ИнвентаризацияСумкаЗакрыта.Ссылка В(&МассивОбъектов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияНовыеОЗ.НомерСтроки,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Количество,
		|	ЛБ_ИнвентаризацияНовыеОЗ.КоличествоФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Металл,
		|	ЛБ_ИнвентаризацияНовыеОЗ.МеталлФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Проба,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ПробаФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Категория,
		|	ЛБ_ИнвентаризацияНовыеОЗ.КатегорияФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ВидИзделия,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ВидИзделияФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.СуммаОценки,
		|	ЛБ_ИнвентаризацияНовыеОЗ.СуммаОценкиФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.МассаМеталла,
		|	ЛБ_ИнвентаризацияНовыеОЗ.МассаМеталлаФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ОбщаяМасса,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ОбщаяМассаФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Отклонения,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Комментарий,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ОбъектЗалога,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Залогодатель,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ДатаОформленияЗайма,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Приемщик,
		|	ЛБ_ИнвентаризацияНовыеОЗ.СтатусОбъектаЗалога,
		|	ЛБ_ИнвентаризацияНовыеОЗ.СуммаОценкиМеталлы,
		|	ЛБ_ИнвентаризацияНовыеОЗ.СуммаОценкиМеталлыФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.СуммаОценкиКамни,
		|	ЛБ_ИнвентаризацияНовыеОЗ.СуммаОценкиКамниФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Клеймо,
		|	ЛБ_ИнвентаризацияНовыеОЗ.КлеймоФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Вставки,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ВставкиФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Именник,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ИменникФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ОперацияЗайма,
		|	ЛБ_ИнвентаризацияНовыеОЗ.КлючСтроки,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ОстатокЗайма,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Артикул,
		|	ЛБ_ИнвентаризацияНовыеОЗ.СуммаЗайма,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Вставка,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ДанныеИменника,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ДанныеИменникаФакт,
		|	ЛБ_ИнвентаризацияНовыеОЗ.НомерСтрокиТаблицы,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ЦенаФакт,
		//|	ЛБ_ИнвентаризацияНовыеОЗ.СуммаОценкиНачальная,
		|	ЛБ_ИнвентаризацияНовыеОЗ.СуммаДолгаЗайма,
		|	ЛБ_ИнвентаризацияНовыеОЗ.СостояниеИзделия,
		|	ЛБ_ИнвентаризацияНовыеОЗ.Дефекты,
		|	ЛБ_ИнвентаризацияНовыеОЗ.ОписаниеИзделия,
		|	ЛБ_ИнвентаризацияНовыеОЗ.СуммаОценкиМакс
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.НовыеОЗ КАК ЛБ_ИнвентаризацияНовыеОЗ
		|ГДЕ
		|	ЛБ_ИнвентаризацияНовыеОЗ.Ссылка В(&МассивОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Артикул";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции

Функция ПолучитьВставкиВыбывших(ОЗ, МассивОбъектов)
	
	СтруктураВозврата = Новый Структура("Камни, Металлы");

	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ОбъектЗалога", ОЗ);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияВставкиФакт.ВидВставки КАК ВидВставки,
		|	ЛБ_ИнвентаризацияВставкиФакт.ФормаОгранки КАК ФормаОгранки,
		|	ЛБ_ИнвентаризацияВставкиФакт.Длина КАК Длина,
		|	ЛБ_ИнвентаризацияВставкиФакт.Ширина КАК Ширина,
		|	ЛБ_ИнвентаризацияВставкиФакт.ГруппаЦвета КАК ГруппаЦвета,
		|	ЛБ_ИнвентаризацияВставкиФакт.ГруппаКачества КАК ГруппаКачества,
		|	ЛБ_ИнвентаризацияВставкиФакт.КачествоОгранки КАК КачествоОгранки,
		|	ЛБ_ИнвентаризацияВставкиФакт.Количество КАК Количество,
		|	ЛБ_ИнвентаризацияВставкиФакт.Вес КАК Вес,
		|	ЛБ_ИнвентаризацияВставкиФакт.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияВставкиФакт.Цена КАК Цена,
		|	ЛБ_ИнвентаризацияВставкиФакт.Сумма КАК Сумма,
		|	ЛБ_ИнвентаризацияВставкиФакт.Вид КАК Вид,
		|	ЛБ_ИнвентаризацияВставкиФакт.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ИнвентаризацияВставкиФакт.Диаметр КАК Диаметр,
		|	ЛБ_ИнвентаризацияВставкиФакт.Диаметр1 КАК Диаметр1,
		|	ЛБ_ИнвентаризацияВставкиФакт.Диаметр2 КАК Диаметр2,
		|	ЛБ_ИнвентаризацияВставкиФакт.Высота КАК Высота,
		|	ЛБ_ИнвентаризацияВставкиФакт.ВесГраммы КАК ВесГраммы,
		|	ЛБ_ИнвентаризацияВставкиФакт.ОписаниеРазмера КАК ОписаниеРазмера,
		|	ЛБ_ИнвентаризацияВставкиФакт.ВидОгранки КАК ВидОгранки,
		|	ЛБ_ИнвентаризацияВставкиФакт.ЦенаФакт КАК ЦенаФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.СуммаФакт КАК СуммаФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ФормаОгранкиФакт КАК ФормаОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ДлинаФакт КАК ДлинаФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ШиринаФакт КАК ШиринаФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ГруппаЦветаФакт КАК ГруппаЦветаФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ГруппаКачестваФакт КАК ГруппаКачестваФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.КачествоОгранкиФакт КАК КачествоОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.КоличествоФакт КАК КоличествоФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ВесФакт КАК ВесФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ЕдиницаИзмеренияФакт КАК ЕдиницаИзмеренияФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ВидФакт КАК ВидФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ДиаметрФакт КАК ДиаметрФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.Диаметр1Факт КАК Диаметр1Факт,
		|	ЛБ_ИнвентаризацияВставкиФакт.Диаметр2Факт КАК Диаметр2Факт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ВысотаФакт КАК ВысотаФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ВесГраммыФакт КАК ВесГраммыФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ВидОгранкиФакт КАК ВидОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.ВидВставкиФакт КАК ВидВставкиФакт,
		|	ЛБ_ИнвентаризацияВставкиФакт.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.ВставкиФакт КАК ЛБ_ИнвентаризацияВставкиФакт
		|ГДЕ
		|	ЛБ_ИнвентаризацияВставкиФакт.Ссылка В(&МассивОбъектов)
		|	И ЛБ_ИнвентаризацияВставкиФакт.ОбъектЗалога = &ОбъектЗалога
		|	И ЛБ_ИнвентаризацияВставкиФакт.ВидВставки = ЗНАЧЕНИЕ(Справочник.ЛБ_ДрагоценныеКамни.Бриллиант)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ВидВставки,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ФормаОгранки,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Длина,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Ширина,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ГруппаЦвета,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ГруппаКачества,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.КачествоОгранки,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Количество,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Вес,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Цена,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Сумма,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Вид,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ОбъектЗалога,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Диаметр,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Диаметр1,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Диаметр2,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Высота,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ВесГраммы,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ОписаниеРазмера,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ВидОгранки,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ЦенаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.СуммаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ФормаОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ДлинаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ШиринаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ГруппаЦветаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ГруппаКачестваФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.КачествоОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.КоличествоФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ВесФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ЕдиницаИзмеренияФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ВидФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ДиаметрФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Диаметр1Факт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Диаметр2Факт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ВысотаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ВесГраммыФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ВидОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ВидВставкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.НомерСтрокиТаблицы
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.ВставкиКамнейНаОХ КАК ЛБ_ИнвентаризацияВставкиКамнейНаОХ
		|ГДЕ
		|	ЛБ_ИнвентаризацияВставкиКамнейНаОХ.Ссылка В(&МассивОбъектов)
		|	И ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ОбъектЗалога = &ОбъектЗалога
		|	И ЛБ_ИнвентаризацияВставкиКамнейНаОХ.ВидВставки = ЗНАЧЕНИЕ(Справочник.ЛБ_ДрагоценныеКамни.Бриллиант)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ВидВставки,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ФормаОгранки,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Длина,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Ширина,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ГруппаЦвета,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ГруппаКачества,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.КачествоОгранки,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Количество,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Вес,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Цена,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Сумма,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Вид,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ОбъектЗалога,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Диаметр,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Диаметр1,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Диаметр2,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Высота,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ВесГраммы,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ОписаниеРазмера,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ВидОгранки,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ЦенаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.СуммаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ФормаОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ДлинаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ШиринаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ГруппаЦветаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ГруппаКачестваФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.КачествоОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.КоличествоФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ВесФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ЕдиницаИзмеренияФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ВидФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ДиаметрФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Диаметр1Факт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Диаметр2Факт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ВысотаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ВесГраммыФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ВидОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ВидВставкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.НомерСтрокиТаблицы
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.ВставкиКамнейСумкаЗакрыта КАК ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта
		|ГДЕ
		|	ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.Ссылка В(&МассивОбъектов)
		|	И ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ОбъектЗалога = &ОбъектЗалога
		|	И ЛБ_ИнвентаризацияВставкиКамнейСумкаЗакрыта.ВидВставки = ЗНАЧЕНИЕ(Справочник.ЛБ_ДрагоценныеКамни.Бриллиант)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ВидВставки,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ФормаОгранки,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Длина,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Ширина,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ГруппаЦвета,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ГруппаКачества,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.КачествоОгранки,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Количество,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Вес,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Цена,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Сумма,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Вид,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ОбъектЗалога,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Диаметр,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Диаметр1,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Диаметр2,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Высота,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ВесГраммы,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ОписаниеРазмера,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ВидОгранки,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ЦенаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.СуммаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ФормаОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ДлинаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ШиринаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ГруппаЦветаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ГруппаКачестваФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.КачествоОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.КоличествоФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ВесФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ЕдиницаИзмеренияФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ВидФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ДиаметрФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Диаметр1Факт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Диаметр2Факт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ВысотаФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ВесГраммыФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ВидОгранкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ВидВставкиФакт,
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.НомерСтрокиТаблицы
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.ВставкиКамнейНовыеОЗ КАК ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ
		|ГДЕ
		|	ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.Ссылка В(&МассивОбъектов)
		|	И ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ОбъектЗалога = &ОбъектЗалога
		|	И ЛБ_ИнвентаризацияВставкиКамнейНовыеОЗ.ВидВставки = ЗНАЧЕНИЕ(Справочник.ЛБ_ДрагоценныеКамни.Бриллиант)";
	
	РезультатК = Запрос.Выполнить().Выгрузить();
	
	Если РезультатК.Количество() > 0 Тогда
		СтруктураВозврата.Камни = РезультатК;
	КонецЕсли;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияВставкиМеталла.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ИнвентаризацияВставкиМеталла.Проба КАК ВидВставки,
		|	ЛБ_ИнвентаризацияВставкиМеталла.Вес КАК Вес,
		|	ЛБ_ИнвентаризацияВставкиМеталла.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияВставкиМеталла.СуммаОценки КАК СуммаОценки,
		|	ЛБ_ИнвентаризацияВставкиМеталла.ПробаФакт КАК ПробаФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталла.ВесФакт КАК ВесФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталла.ЕдиницаИзмеренияФакт КАК ЕдиницаИзмеренияФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталла.СуммаОценкиФакт КАК СуммаОценкиФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталла.ЦенаФакт КАК ЦенаФакт
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.ВставкиМеталла КАК ЛБ_ИнвентаризацияВставкиМеталла
		|ГДЕ
		|	ЛБ_ИнвентаризацияВставкиМеталла.Ссылка В(&МассивОбъектов)
		|	И ЛБ_ИнвентаризацияВставкиМеталла.ОбъектЗалога = &ОбъектЗалога
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияВставкиМеталлаНаОХ.ОбъектЗалога,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНаОХ.Проба,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНаОХ.Вес,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНаОХ.ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНаОХ.СуммаОценки,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНаОХ.ПробаФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНаОХ.ВесФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНаОХ.ЕдиницаИзмеренияФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНаОХ.СуммаОценкиФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНаОХ.ЦенаФакт
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.ВставкиМеталлаНаОХ КАК ЛБ_ИнвентаризацияВставкиМеталлаНаОХ
		|ГДЕ
		|	ЛБ_ИнвентаризацияВставкиМеталлаНаОХ.Ссылка В(&МассивОбъектов)
		|	И ЛБ_ИнвентаризацияВставкиМеталлаНаОХ.ОбъектЗалога = &ОбъектЗалога
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта.ОбъектЗалога,
		|	ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта.Проба,
		|	ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта.Вес,
		|	ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта.ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта.СуммаОценки,
		|	ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта.ПробаФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта.ВесФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта.ЕдиницаИзмеренияФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта.СуммаОценкиФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта.ЦенаФакт
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.ВставкиМеталлаСумкаЗакрыта КАК ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта
		|ГДЕ
		|	ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта.Ссылка В(&МассивОбъектов)
		|	И ЛБ_ИнвентаризацияВставкиМеталлаСумкаЗакрыта.ОбъектЗалога = &ОбъектЗалога
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ.ОбъектЗалога,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ.Проба,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ.Вес,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ.ЕдиницаИзмерения,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ.СуммаОценки,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ.ПробаФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ.ВесФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ.ЕдиницаИзмеренияФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ.СуммаОценкиФакт,
		|	ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ.ЦенаФакт
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.ВставкиМеталлаНовыеОЗ КАК ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ
		|ГДЕ
		|	ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ.Ссылка В(&МассивОбъектов)
		|	И ЛБ_ИнвентаризацияВставкиМеталлаНовыеОЗ.ОбъектЗалога = &ОбъектЗалога";
	
	РезультатМ = Запрос.Выполнить().Выгрузить();
	
	Если РезультатМ.Количество() > 0 Тогда
		СтруктураВозврата.Металлы = РезультатМ;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
КонецФункции

Функция ПолучитьВыборкуШапок(МассивОбъектов)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ДополнительнаяКолонкаПечатныхФормДокументов", Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИнвентаризацияТоваровНаСкладе.Ссылка КАК Ссылка,
	|	ИнвентаризацияТоваровНаСкладе.Номер,
	|	ИнвентаризацияТоваровНаСкладе.Дата,
	|	ИнвентаризацияТоваровНаСкладе.ДатаНачалаИнвентаризации КАК ДатаНачалаИнвентаризации,
	|	ИнвентаризацияТоваровНаСкладе.ДатаОкончанияИнвентаризации КАК ДатаОкончанияИнвентаризации,
	|	ИнвентаризацияТоваровНаСкладе.ДокументОснованиеВид КАК ДокументОснованиеВид,
	|	ВЫБОР
	|		КОГДА ИнвентаризацияТоваровНаСкладе.ДокументОснованиеДата = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ИнвентаризацияТоваровНаСкладе.Дата
	|		ИНАЧЕ ИнвентаризацияТоваровНаСкладе.ДокументОснованиеДата
	|	КОНЕЦ КАК ДокументОснованиеДата,
	|	ВЫБОР
	|		КОГДА ИнвентаризацияТоваровНаСкладе.ДокументОснованиеНомер = """"
	|			ТОГДА ЕСТЬNULL(ДанныеПервичныхДокументов.Номер, ИнвентаризацияТоваровНаСкладе.Номер)
	|		ИНАЧЕ ИнвентаризацияТоваровНаСкладе.ДокументОснованиеНомер
	|	КОНЕЦ КАК ДокументОснованиеНомер,
	|	ИнвентаризацияТоваровНаСкладе.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	ИнвентаризацияТоваровНаСкладе.Организация,
	|	ИнвентаризацияТоваровНаСкладе.Склад.Представление КАК ПредставлениеСклада,
	|	ИнвентаризацияТоваровНаСкладе.Организация КАК Организация1,
	|	ИнвентаризацияТоваровНаСкладе.Склад,
	|	ИнвентаризацияТоваровНаСкладе.Товары.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Номенклатура.НаименованиеПолное КАК Товар,
	|		Номенклатура.Наименование КАК ТоварКратко,
	|		ВЫБОР
	|			КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул)
	|				ТОГДА ИнвентаризацияТоваровНаСкладе.Товары.Номенклатура.Артикул
	|			ИНАЧЕ ИнвентаризацияТоваровНаСкладе.Товары.Номенклатура.Код
	|		КОНЕЦ КАК КодАртикул,
	|		СчетУчета КАК СубСчет,
	|		Количество КАК Количество,
	|		КоличествоУчет КАК КоличествоПоУчету,
	|		Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКодПоОКЕИ,
	|		Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
	|		Цена,
	|		Сумма,
	|		СуммаУчет КАК СуммаПоУчету
	|	),
	|	ИнвентаризацияТоваровНаСкладе.ИнвентаризационнаяКомиссия.(
	|		НомерСтроки,
	|		ФизЛицо,
	|		Председатель КАК Председатель,
	|		Дистанционно КАК Дистанционно
	|	),
	|	ИнвентаризацияТоваровНаСкладе.ПричинаПроведенияИнвентаризации
	|ИЗ
	|	Документ.ИнвентаризацияТоваровНаСкладе КАК ИнвентаризацияТоваровНаСкладе
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|		ПО ИнвентаризацияТоваровНаСкладе.Организация = ДанныеПервичныхДокументов.Организация
	|			И ИнвентаризацияТоваровНаСкладе.Ссылка = ДанныеПервичныхДокументов.Документ
	|ГДЕ
	|	ИнвентаризацияТоваровНаСкладе.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИнвентаризацияТоваровНаСкладе.Дата,
	|	Ссылка,
	|	Председатель УБЫВ,
	|	ИнвентаризацияТоваровНаСкладе.Товары.НомерСтроки";

	Возврат Запрос.Выполнить().Выбрать();

КонецФункции

Функция ПечатьИнвентаризации(МассивОбъектов, ОбъектыПечати, ВалютаРегламентированногоУчета)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВалютаПечати = ВалютаРегламентированногоУчета;
	Шапки = ПолучитьВыборкуШапок(МассивОбъектов);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб			= Истина;
	ТабДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияТоваровНаСкладе_ИнвентаризацияТоваровНаСкладе";

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИнвентаризацияТоваровНаСкладе.ПФ_MXL_ИнвентаризацияТоваровНаСкладе");
	ПервыйДокумент = Истина;
	
	ДополнительнаяКолонкаПечатныхФормДокументов = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	Если НЕ ЗначениеЗаполнено(ДополнительнаяКолонкаПечатныхФормДокументов) Тогда
		ДополнительнаяКолонкаПечатныхФормДокументов = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.НеВыводить;
	КонецЕсли;
	ВыводитьКоды = ДополнительнаяКолонкаПечатныхФормДокументов <> Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.НеВыводить;

	Пока Шапки.Следующий() Цикл
	
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		// Выводим шапку накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		// ++ Сербаев 10.05.2023
		//ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначенияБПВызовСервера.СформироватьЗаголовокДокумента(Шапки, 
		//																			"Инвентаризация товаров на складе");
		// -- Сербаев 10.05.2023
		
		ТабДокумент.Вывести(ОбластьМакета);

		// Выводим данные об организации и складе
		ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
		ОбластьМакета.Параметры.Заполнить(Шапки);
		
		// ++ Сербаев 10.05.2023
		//СведенияОбОрганизации    = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапки.Организация, Шапки.Дата);
		//ПредставлениеОрганизации = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");
		//ОбластьМакета.Параметры.ПредставлениеОрганизации = ПредставлениеОрганизации;
		// -- Сербаев 10.05.2023
		
		ОбластьМакета.Параметры.ВалютаНаименование = Строка(ВалютаПечати);
		ОбластьМакета.Параметры.Валюта             = ВалютаПечати;
		ТабДокумент.Вывести(ОбластьМакета);

		// Выводим шапку таблицы
		ОбластьШапки = ?(ВыводитьКоды, "ШапкаСКодом", "ШапкаТаблицы");
		ОбластьМакета = Макет.ПолучитьОбласть(ОбластьШапки);
		ОбластьМакета.Параметры.Заполнить(Шапки);
		Если ДополнительнаяКолонкаПечатныхФормДокументов = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
			ОбластьМакета.Параметры.Колонка = "Артикул";
		ИначеЕсли ДополнительнаяКолонкаПечатныхФормДокументов = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Код Тогда
			ОбластьМакета.Параметры.Колонка = "Код";
		КонецЕсли;
		ТабДокумент.Вывести(ОбластьМакета);

		ИтогСуммы        = 0;
		ИтогСуммыПоУчету = 0;

		ОбластьСтроки = ?(ВыводитьКоды, "СтрокаСКодом", "Строка");
		ОбластьМакета = Макет.ПолучитьОбласть(ОбластьСтроки);
		ВыборкаСтрокТовары = Шапки.Товары.Выбрать();
		Пока ВыборкаСтрокТовары.Следующий() Цикл

			ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокТовары);
			ОбластьМакета.Параметры.Товар = ВыборкаСтрокТовары.Товар;

			ИтогСуммы        = ИтогСуммы        + ВыборкаСтрокТовары.Сумма;
			ИтогСуммыПоУчету = ИтогСуммыПоУчету + ВыборкаСтрокТовары.СуммаПоУчету;
			ТабДокумент.Вывести(ОбластьМакета);

		КонецЦикла;

		// Вывести Итого
		ОбластьМакета                        = Макет.ПолучитьОбласть("Итого"); 
		
		// ++ Сербаев 10.05.2023
		//ОбластьМакета.Параметры.Всего        = ОбщегоНазначенияБПВызовСервера.ФорматСумм(ИтогСуммы);
		//ОбластьМакета.Параметры.ВсегоПоУчету = ОбщегоНазначенияБПВызовСервера.ФорматСумм(ИтогСуммыПоУчету); 
		// -- Сербаев 10.05.2023
		
		ТабДокумент.Вывести(ОбластьМакета);

		// Выводим подписи к документу
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		ТабДокумент.Вывести(ОбластьМакета);
	
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Шапки.Ссылка);

	КонецЦикла;	//Шапки.Следующий() 
	
	Возврат ТабДокумент;

КонецФункции

Функция ПечатьИнв3(МассивОбъектов, ОбъектыПечати, ВалютаРегламентированногоУчета)

	УстановитьПривилегированныйРежим(Истина);
	
	ВалютаПечати = ВалютаРегламентированногоУчета;
	Шапка = ПолучитьВыборкуШапок(МассивОбъектов);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб			= Истина;
	ТабДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияТоваровНаСкладе_ИНВ3";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИнвентаризацияТоваровНаСкладе.ПФ_MXL_ИНВ3");
	ПервыйДокумент = Истина;

	Пока Шапка.Следующий() Цикл
	
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		ВыборкаСтрокТовары = Шапка.Товары.Выбрать();
		ЧленКомиссии = Шапка.ИнвентаризационнаяКомиссия.Выбрать();

		//////////////////////////////////////////////////////////////////////
		// 1-я страница формы

		// Выводим шапку накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		
		СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
		
		// ++ Сербаев 10.05.2023
		//ПредставлениеОрганизации = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");
		//ОбластьМакета.Параметры.ПредставлениеОрганизации = ПредставлениеОрганизации; 
		// -- Сербаев 10.05.2023
		
		ОбластьМакета.Параметры.ОрганизацияПоОКПО        = СведенияОбОрганизации.КодПоОКПО;
		ОбластьМакета.Параметры.ДатаДокумента            = Шапка.Дата;
		ОбластьМакета.Параметры.НомерДокумента           = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Шапка.Номер, Истина, Ложь);
		ОбластьМакета.Параметры.ДатаОкончанияИнвентаризацииЛокальныйФормат = Шапка.ДатаОкончанияИнвентаризации; 
		
		// ++ Сербаев 10.05.2023
		//ДанныеМОЛ = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(Шапка.Организация, Шапка.ОтветственноеЛицо, Шапка.Дата);
		//ОбластьМакета.Параметры.ДолжностьМОЛ1     = ДанныеМОЛ.Должность;
		//ОбластьМакета.Параметры.ФИОМОЛ1           = ДанныеМОЛ.Представление;
		// -- Сербаев 10.05.2023
		
		ОбластьМакета.Параметры.Подразделение = Шапка.Склад;
			
		ТабДокумент.Вывести(ОбластьМакета);
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();

		//////////////////////////////////////////////////////////////////////
		// 2-я страница формы

		ИтогФактКоличество = 0;
		ИтогФактСумма      = 0;
		ИтогФактСуммаВсего = 0;
		ИтогБухКоличество  = 0;
		ИтогБухСумма       = 0;

		КолвоСтрокПоСтранице = 0;
		КолвоПоСтранице      = 0;
		СуммаЛиста           = 0;
		ИтогоКолво           = 0;
		
		НомерСтраницы = 2;
	    Ном = 0;

		// Выводим заголовок таблицы
		ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
		ТабДокумент.Вывести(ЗаголовокТаблицы);

		// Выводим многострочную часть документа
		ПодвалСтраницы  = Макет.ПолучитьОбласть("ПодвалСтраницы");	
			
		Пока ВыборкаСтрокТовары.Следующий() Цикл

			Ном = Ном + 1;
			СтрокаТаблицы   = Макет.ПолучитьОбласть("Строка");
			СтрокаТаблицы.Параметры.Заполнить(ВыборкаСтрокТовары);
			
			СтрокаСПодвалом = Новый Массив;
			СтрокаСПодвалом.Добавить(СтрокаТаблицы);
			СтрокаСПодвалом.Добавить(ПодвалСтраницы);
			
			Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, СтрокаСПодвалом) Тогда

				ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ПодвалСтраницы");
				ПараметрыОбласти = ОбластьИтоговПоСтранице.Параметры;

				ПараметрыОбласти.ИтогоФактКоличество = ИтогФактКоличество;
				ПараметрыОбласти.ИтогоФактСумма      = ИтогФактСумма;
				ПараметрыОбласти.ИтогоБухКоличество  = ИтогБухКоличество;
				ПараметрыОбласти.ИтогоБухСумма       = ИтогБухСумма;

				ПараметрыОбласти.КоличествоПорядковыхНомеровНаСтраницеПрописью     = ЧислоПрописью(КолвоСтрокПоСтранице, ,",,,,,,,,0");
				
				// ++ Сербаев 10.05.2023
				//ПараметрыОбласти.ОбщееКоличествоЕдиницФактическиНаСтраницеПрописью = ОбщегоНазначенияБПВызовСервера.КоличествоПрописью(КолвоПоСтранице);
				//ПараметрыОбласти.СуммаФактическиНаСтраницеПрописью                 = ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(СуммаЛиста, ВалютаПечати);
				// -- Сербаев 10.05.2023
				
				ТабДокумент.Вывести(ОбластьИтоговПоСтранице);
				
				НомерСтраницы = НомерСтраницы + 1;
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();

				ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
				ТабДокумент.Вывести(ЗаголовокТаблицы);

				ИтогФактКоличество = 0;
				ИтогФактСумма      = 0;
				ИтогБухКоличество  = 0;
				ИтогБухСумма       = 0;

				КолвоСтрокПоСтранице = 0;
				КолвоПоСтранице      = 0;
				СуммаЛиста           = 0;

			КонецЕсли;

			СтрокаТаблицы.Параметры.Номер = Ном;
			СтрокаТаблицы.Параметры.ТоварНаименование = ?(ЗначениеЗаполнено(ВыборкаСтрокТовары.Товар), ВыборкаСтрокТовары.Товар, ВыборкаСтрокТовары.ТоварКратко);

			ТабДокумент.Вывести(СтрокаТаблицы);

			ИтогФактКоличество = ИтогФактКоличество + ВыборкаСтрокТовары.Количество;
			ИтогФактСумма      = ИтогФактСумма      + ВыборкаСтрокТовары.Сумма;
			ИтогФактСуммаВсего = ИтогФактСуммаВсего + ВыборкаСтрокТовары.Сумма;
			ИтогБухКоличество  = ИтогБухКоличество  + ВыборкаСтрокТовары.КоличествоПоУчету;
			ИтогБухСумма       = ИтогБухСумма       + ВыборкаСтрокТовары.СуммаПоУчету;
			ИтогоКолво         = ИтогоКолво         + ВыборкаСтрокТовары.Количество;

			КолвоСтрокПоСтранице = КолвоСтрокПоСтранице + 1;
			КолвоПоСтранице      = КолвоПоСтранице      + ВыборкаСтрокТовары.Количество;
			СуммаЛиста           = СуммаЛиста           + ВыборкаСтрокТовары.Сумма;

		КонецЦикла;

		// Выводим итоги по последней странице
		ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ПодвалСтраницы");
		ПараметрыОбласти = ОбластьИтоговПоСтранице.Параметры;

		ПараметрыОбласти.ИтогоФактКоличество  = ИтогФактКоличество;
		ПараметрыОбласти.ИтогоФактСумма       = ИтогФактСумма;
		ПараметрыОбласти.ИтогоБухКоличество   = ИтогБухКоличество;
		ПараметрыОбласти.ИтогоБухСумма        = ИтогБухСумма;
		ПараметрыОбласти.КоличествоПорядковыхНомеровНаСтраницеПрописью     = ЧислоПрописью(КолвоСтрокПоСтранице, ,",,,,,,,,0");
		
		// ++ Сербаев 10.05.2023
		//ПараметрыОбласти.ОбщееКоличествоЕдиницФактическиНаСтраницеПрописью = ОбщегоНазначенияБПВызовСервера.КоличествоПрописью(КолвоПоСтранице);
		//ПараметрыОбласти.СуммаФактическиНаСтраницеПрописью                 = ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(СуммаЛиста, ВалютаПечати);
		// -- Сербаев 10.05.2023
		
		ТабДокумент.Вывести(ОбластьИтоговПоСтранице);

		// Выводим подвал документа
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		ОбластьМакета = Макет.ПолучитьОбласть("ПодвалОписи");
		ОбластьМакета.Параметры.Заполнить(Шапка); 
		
		// ++ Сербаев 10.05.2023
		//ОбластьМакета.Параметры.ОбщееКоличествоЕдиницФактическиНаСтраницеПрописью = ОбщегоНазначенияБПВызовСервера.КоличествоПрописью(ИтогоКолво);
		// -- Сербаев 10.05.2023
		
		ОбластьМакета.Параметры.КоличествоПорядковыхНомеровНаСтраницеПрописью     = ЧислоПрописью(ВыборкаСтрокТовары.Количество(), ,",,,,,,,,0");
		
		// ++ Сербаев 10.05.2023
		//ОбластьМакета.Параметры.СуммаФактическиНаСтраницеПрописью                 = ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(ИтогФактСуммаВсего, ВалютаПечати);
		// -- Сербаев 10.05.2023
		
		// ++ Сербаев 10.05.2023
		//Инд = 1;
		//Пока ЧленКомиссии.Следующий() Цикл
		//	ДанныеЧленаКомиссии = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(Шапка.Организация, ЧленКомиссии.ФизЛицо, Шапка.Дата);
		//	Если Инд <= 4 Тогда
		//		Если ЧленКомиссии.Председатель Тогда
		//			ОбластьМакета.Параметры["ДолжностьПредседателя"] = ДанныеЧленаКомиссии.Должность;
		//			ОбластьМакета.Параметры["ФИОПредседателя"] = ДанныеЧленаКомиссии.Представление;
		//		Иначе
		//			ОбластьМакета.Параметры["ДолжностьЧленаКомиссии" + Инд] = ДанныеЧленаКомиссии.Должность;
		//			ОбластьМакета.Параметры["ФИОЧленаКомиссии" + Инд] = ДанныеЧленаКомиссии.Представление;
		//		КонецЕсли;		
		//	Иначе
		//		ТабДокумент.Вывести(ОбластьМакета);
		//		
		//		ОбластьМакета = Макет.ПолучитьОбласть("ДопЧленКомиссии");
		//       	ОбластьМакета.Параметры["ДолжностьЧленаКомиссии"] = ДанныеЧленаКомиссии.Должность;
		//		ОбластьМакета.Параметры["ФИОЧленаКомиссии"] = ДанныеЧленаКомиссии.Представление;
		//	КонецЕсли;
		//	Инд = Инд + 1;
		//КонецЦикла;
		//ТабДокумент.Вывести(ОбластьМакета);
		// -- Сербаев 10.05.2023
		
		ОбластьМакета = Макет.ПолучитьОбласть("ПодвалОписиМОЛ");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ОбластьМакета.Параметры.НачальныйНомерПоПорядку = 1;
		ОбластьМакета.Параметры.НомерКонца              = ВыборкаСтрокТовары.Количество();
		
		// ++ Сербаев 10.05.2023
		//ОбластьМакета.Параметры.ДолжностьМОЛ1   = ДанныеМОЛ.Должность;
		//ОбластьМакета.Параметры.ФИОМОЛ1         = ДанныеМОЛ.Представление;
		// -- Сербаев 10.05.2023
		
		ОбластьМакета.Параметры.ДатаДокумента 	= Шапка.Дата;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);

	КонецЦикла;	//Шапки.Следующий() 

	Возврат ТабДокумент;

КонецФункции

Функция ПечатьИНВ19(МассивОбъектов, ОбъектыПечати, Вид)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Шапка = ПолучитьВыборкуШапок_Инв19(МассивОбъектов);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб			= Истина;
	ТабДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ЛБ_Инвентаризация_ИНВ19";
	
	СисИнфо = Новый СистемнаяИнформация;
	Если ПустаяСтрока(СисИнфо.ИнформацияПрограммыПросмотра) Тогда 
		ТабДокумент.ПолеСлева          = 0;
	Иначе
		ТабДокумент.ПолеСлева          = 20;
		ТабДокумент.ПолеСправа         = 0;
	КонецЕсли;

	
	// Получение областей макета.
	Если Вид = "Недостача" Тогда
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЛБ_Инвентаризация.ПФ_MXL_ИНВ19_Недостача");
	Иначе
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЛБ_Инвентаризация.ПФ_MXL_ИНВ19");
	КонецЕсли;
	ПервыйДокумент = Истина;

	ГраницаНет = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
	
	Пока Шапка.Следующий() Цикл
	
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		ВыполненныйЗапрос = ПолучитьСтрокиДокумента_Инв19(МассивОбъектов);
		
		ВыборкаСтрокТовары = ВыполненныйЗапрос.Выбрать();
		КолонкиСтрокТоваров = ВыполненныйЗапрос.Колонки;
		ЧленКомиссии = Шапка.ИнвентаризационнаяКомиссия.Выбрать();
		
		ОбластьМакетаШапка = Макет.ПолучитьОбласть("Шапка");

		// Вывод шапки документа.
		ОбластьМакетаШапка.Параметры.Заполнить(Шапка);
		
		ОбластьМакетаШапка.Параметры.Подразделение = Шапка.Ломбард.НомерЛомбарда; 
		
		ТабДокумент.Вывести(ОбластьМакетаШапка);
		
		Молы = Шапка.Молы.Выбрать();
		Пока Молы.Следующий() Цикл 		
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаМол");		
			ОбластьМакета.Параметры.ДолжностьМОЛ = Молы.Физлицо.Должность;
			ОбластьМакета.Параметры.ФИОМОЛ = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Молы.ФизЛицо.Наименование);
			ТабДокумент.Вывести(ОбластьМакета);			
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаПодвал");
		ОбластьМакета.Параметры.ДатаНачалаИнвентаризации = Формат(Шапка.ДатаНачалаИнвентаризации, "ДЛФ=DD");	
		ТабДокумент.Вывести(ОбластьМакета);		

		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();

		НомерСтраницы   = 2;
		ИтогоСуммаОценки = 0;
		ИтогоОстатокЗайма = 0;
		ИтогоКоличество = 0;
		ИтогоОбщийВес = 0;
		ИтогоЧистыйВес = 0;
		СуммаРасхождений = 0;

		// Вывод заголовка таблицы.
		ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ТабДокумент.Вывести(ЗаголовокТаблицы);
		
		Ном = 0;
		// Вывод многострочной части докмента.
		ПодвалНомСтр = Макет.ПолучитьОбласть("СтрокаНомерСтраницы");

		Пока ВыборкаСтрокТовары.Следующий() Цикл
			
			Если Вид = "Новое" И НЕ ПроверитьНаличиеИзменений(КолонкиСтрокТоваров, ВыборкаСтрокТовары) Тогда
				Продолжить;
			ИначеЕсли Вид = "Недостача" И НЕ ВыборкаСтрокТовары.Количество > ВыборкаСтрокТовары.КоличествоФакт Тогда
				Продолжить;
			КонецЕсли;
			
			Ном = Ном + 1;
			
			СтрокаТаблицы = Макет.ПолучитьОбласть("Строка");
			СтрокаТаблицы.Параметры.Заполнить(ВыборкаСтрокТовары);
			СтрокаТаблицы.Параметры.Отклонения = ?(ВыборкаСтрокТовары.Отклонения = "", "" + ВыборкаСтрокТовары.Комментарий,
				"" + ВыборкаСтрокТовары.Отклонения + Символы.ПС + ВыборкаСтрокТовары.Комментарий);
			
			Если Вид = "Новое" ИЛИ Вид = "Полная" Тогда
				СтрокаТаблицы.Параметры.Наименование = СокрЛП(ВыборкаСтрокТовары.ОбъектЗалога.Наименование) + " ["+СокрЛП(ВыборкаСтрокТовары.Категория)+"]";
				//СтрокаТаблицы.Параметры.Приемщик = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаСтрокТовары.Приемщик.Сотрудник.Наименование);
				СтрокаТаблицы.Параметры.Приемщик = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаСтрокТовары.Приемщик.Наименование);
				
				СуммаРазность = ВыборкаСтрокТовары.СуммаОценкиФакт - ВыборкаСтрокТовары.СуммаОценки;
				СуммаРасхождений = СуммаРасхождений + СуммаРазность;
				
				СтрокаТаблицы.Параметры.Сумма = СуммаРазность;
			Иначе
				СтрокаТаблицы.Параметры.Наименование = СокрЛП(ВыборкаСтрокТовары.ОбъектЗалога.Наименование) + " " + ВыборкаСтрокТовары.Проба.Наименование;
				СтрокаТаблицы.Параметры.КоличествоФакт = 0;
				СтрокаТаблицы.Параметры.ОбщаяМассаФакт = 0;
				СтрокаТаблицы.Параметры.МассаМеталлаФакт = 0;
				СтрокаТаблицы.Параметры.ПробаФакт = "-";				
				СтрокаТаблицы.Параметры.Проба = ВыборкаСтрокТовары.Проба.Проба;
				
				ИтогоСуммаОценки = ИтогоСуммаОценки + ВыборкаСтрокТовары.СуммаОценки;
				ИтогоОстатокЗайма = ИтогоОстатокЗайма + ВыборкаСтрокТовары.ОстатокЗайма;
				ИтогоКоличество = ИтогоКоличество + ВыборкаСтрокТовары.Количество;
				ИтогоОбщийВес = ИтогоОбщийВес + ВыборкаСтрокТовары.ОбщаяМасса;
				ИтогоЧистыйВес = ИтогоЧистыйВес + ВыборкаСтрокТовары.МассаМеталла;
			КонецЕсли;
			
			СтруктураВставки = ПолучитьВставкиДокумента_АктПроверки(ВыборкаСтрокТовары.ОбъектЗалога, Шапка.Ссылка);
			
			// Проверка вывода.
			СтрокаСПодвалом = Новый Массив;
			СтрокаСПодвалом.Добавить(СтрокаТаблицы);

			//Проверяем влазиет ли строка с описание вставок на один лист
			Если СтруктураВставки.Камни <> Неопределено Тогда
				Для Каждого СтрВ Из СтруктураВставки.Камни Цикл
					СтрокаВставки = Макет.ПолучитьОбласть("СтрокаВставки");
					
					СтрокаВставки.Параметры.Наименование = "- " + СокрЛП(СтрВ.ВидВставки) + " " + СокрЛП(СтрВ.ВидОгранки) + " " + СокрЛП(СтрВ.КачествоОгранки);
					
					СтрокаСПодвалом.Добавить(СтрокаВставки);
				КонецЦикла;
			КонецЕсли;
			
			Если СтруктураВставки.Металлы <> Неопределено Тогда
				Для Каждого СтрМ Из СтруктураВставки.Металлы Цикл
					СтрокаВставки = Макет.ПолучитьОбласть("СтрокаВставки");
					
					СтрокаВставки.Параметры.Наименование = "- " + СокрЛП(СтрМ.Проба);
					СтрокаСПодвалом.Добавить(СтрокаВставки);
				КонецЦикла;
			КонецЕсли;
			//

			СтрокаСПодвалом.Добавить(ПодвалНомСтр);
			
			Если НЕ ТабДокумент.ПроверитьВывод(СтрокаСПодвалом) Тогда

				ОбластьНомерСтраницы = Макет.ПолучитьОбласть("СтрокаНомерСтраницы");
				ПараметрыОбласти = ОбластьНомерСтраницы.Параметры;

				//ПараметрыОбласти.НомерСтраницы = "Страница "+СокрЛП(НомерСтраницы);
				
				ТабДокумент.Вывести(ОбластьНомерСтраницы);

				НомерСтраницы = НомерСтраницы + 1;
				
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();

				ТабДокумент.Вывести(ЗаголовокТаблицы);
			КонецЕсли;

			Если СтруктураВставки.Камни <> Неопределено ИЛИ СтруктураВставки.Металлы <> Неопределено Тогда
				СтрокаТаблицы.Области.Строка.ГраницаСнизу = ГраницаНет;
			КонецЕсли;
			
			СтрокаТаблицы.Параметры.Номер = Ном;
			ТабДокумент.Вывести(СтрокаТаблицы);
			
			КоличествоВставок = 0;

			Если СтруктураВставки.Камни <> Неопределено Тогда
				КоличествоВставок = СтруктураВставки.Камни.Количество();
			КонецЕсли;
			
			Если СтруктураВставки.Металлы <> Неопределено Тогда
				КоличествоВставок = КоличествоВставок + СтруктураВставки.Металлы.Количество();
			КонецЕсли;
			
			ПорядковыйНомерВставки = 1;
			
			Если СтруктураВставки.Камни <> Неопределено Тогда
				Для Каждого СтрВ Из СтруктураВставки.Камни Цикл
					СтрокаВставки = Макет.ПолучитьОбласть("СтрокаВставки");
					
					СтрокаВставки.Параметры.Заполнить(СтрВ);
					СтрокаВставки.Параметры.Наименование = "- " + СокрЛП(СтрВ.ВидВставки) + " " + СокрЛП(СтрВ.ВидОгранки) + " " + СокрЛП(СтрВ.КачествоОгранки);
					
					Если ПорядковыйНомерВставки <> КоличествоВставок Тогда
						СтрокаВставки.Области.СтрокаВставки.ГраницаСнизу = ГраницаНет;
					КонецЕсли;

					Если Вид = "Недостача" Тогда
						СтрокаВставки.Параметры.КоличествоФакт = 0;
						СтрокаВставки.Параметры.ВесФакт = 0;
						СтрокаВставки.Параметры.ВидВставкиФакт = "-";
					КонецЕсли;
					
					ТабДокумент.Вывести(СтрокаВставки);
					
					ПорядковыйНомерВставки = ПорядковыйНомерВставки + 1;
				КонецЦикла;				
			КонецЕсли;

			Если СтруктураВставки.Металлы <> Неопределено Тогда
				Для Каждого СтрМ Из СтруктураВставки.Металлы Цикл
					СтрокаВставки = Макет.ПолучитьОбласть("СтрокаВставки");
					
					СтрокаВставки.Параметры.Заполнить(СтрМ);
					СтрокаВставки.Параметры.Наименование = "- " + СокрЛП(СтрМ.Проба);
					
					Если ПорядковыйНомерВставки <> КоличествоВставок Тогда
						СтрокаВставки.Области.СтрокаВставки.ГраницаСнизу = ГраницаНет;
					КонецЕсли;

					Если Вид = "Недостача" Тогда
						СтрокаВставки.Параметры.КоличествоФакт = 0;
						СтрокаВставки.Параметры.ВесФакт = 0;
						СтрокаВставки.Параметры.ВидВставкиФакт = "-";
					КонецЕсли;
					
					ТабДокумент.Вывести(СтрокаВставки);

					ПорядковыйНомерВставки = ПорядковыйНомерВставки + 1;
				КонецЦикла;				
			КонецЕсли;

		КонецЦикла;
		
 		ПодвалОписи = Макет.ПолучитьОбласть("ПодвалОписи");
		ПодвалИтоговМОЛ = Макет.ПолучитьОбласть("ПодвалОписиМол");
		ПодвалНомСтр = Макет.ПолучитьОбласть("СтрокаНомерСтраницы");
		ПодвалИтоги = Макет.ПолучитьОбласть("ПодвалИтоги");
		
		Если Вид = "Недостача" Тогда
			ПодвалБух = Макет.ПолучитьОбласть("ПодвалБух");
		КонецЕсли;
		
		ПодвалНедостача = Макет.ПолучитьОбласть("ПодвалНедостача");
		
		ПодвалИтоговДокум = Новый Массив;
		ПодвалИтоговДокум.Добавить(ПодвалИтоги);
		ПодвалИтоговДокум.Добавить(ПодвалНедостача);
		ПодвалИтоговДокум.Добавить(ПодвалОписи);
		ПодвалИтоговДокум.Добавить(ПодвалИтоговМОЛ);
		
		Молы = Шапка.Молы.Выбрать();
		Пока Молы.Следующий() Цикл 		
			ПодвалИтоговМОЛНаим = Макет.ПолучитьОбласть("СтрокаМол");		
			ПодвалИтоговМОЛНаим.Параметры.ДолжностьМОЛ = Молы.ФИзлицо.Должность;
			ПодвалИтоговМОЛНаим.Параметры.ФИОМОЛ = Молы.ФИзлицо;
			ПодвалИтоговДокум.Добавить(ПодвалИтоговМОЛНаим);
		КонецЦикла;
		
		ПодвалИтоговДокум.Добавить(ПодвалНомСтр);
		
		Если НЕ ТабДокумент.ПроверитьВывод(ПодвалИтоговДокум) Тогда
			
			ОбластьНомерСтраницы = Макет.ПолучитьОбласть("СтрокаНомерСтраницы");
			ПараметрыОбласти = ОбластьНомерСтраницы.Параметры;
			
			//ПараметрыОбласти.НомерСтраницы = "Страница "+СокрЛП(НомерСтраницы);
			
			ТабДокумент.Вывести(ОбластьНомерСтраницы);
			
			НомерСтраницы = НомерСтраницы + 1;
			
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			ТабДокумент.Вывести(ЗаголовокТаблицы);
		КонецЕсли;
		
		ОбластьПодвалИтоги = Макет.ПолучитьОбласть("ПодвалИтоги");
		Если Вид = "Новое" ИЛИ Вид = "Полная" Тогда
			ОбластьПодвалИтоги.Параметры.СуммаРасхождений = СуммаРасхождений;
		Иначе
			ОбластьПодвалИтоги.Параметры.ИтогоСуммаОценки = ИтогоСуммаОценки;
			ОбластьПодвалИтоги.Параметры.ИтогоОстатокЗайма = ИтогоОстатокЗайма;
			ОбластьПодвалИтоги.Параметры.ИтогоКоличество = ИтогоКоличество;
			ОбластьПодвалИтоги.Параметры.ИтогоОбщийВес = ИтогоОбщийВес;
			ОбластьПодвалИтоги.Параметры.ИтогоЧистыйВес = ИтогоЧистыйВес;
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьПодвалИтоги);
		
		Если Вид = "Недостача" Тогда
			ПараметрыПредметаИсчисленияВеса = "целая, целых, целых, ж, сотая, сотых, сотых, ж, 2";
			ПараметрыПредметаИсчисленияСуммы = "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2";
			ФорматнаяСтрока = "Л=ru_RU";
			
			МассивПрописи = ПолучитьСклоненияСтрокиПоЧислу("штука", ИтогоКоличество, "", "Л=ru_RU; ЧС=Количественное", "ПД=Родительный; ПЧ=ЧислоПрописью");
			
			ОбластьПодвалНедостача = Макет.ПолучитьОбласть("ПодвалНедостача");
			ОбластьПодвалНедостача.Параметры.ИтогоСуммаОценки = НРег(ЧислоПрописью(ИтогоСуммаОценки, ФорматнаяСтрока, ПараметрыПредметаИсчисленияСуммы));
			ОбластьПодвалНедостача.Параметры.ИтогоОстатокЗайма = НРег(ЧислоПрописью(ИтогоОстатокЗайма, ФорматнаяСтрока, ПараметрыПредметаИсчисленияСуммы));
			ОбластьПодвалНедостача.Параметры.ИтогоКоличество = НРег(МассивПрописи.Получить(0));
			ОбластьПодвалНедостача.Параметры.ИтогоОбщийВес = НРег(ЧислоПрописью(ИтогоОбщийВес, ФорматнаяСтрока, ПараметрыПредметаИсчисленияВеса));
			
			ТабДокумент.Вывести(ОбластьПодвалНедостача);
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("ПодвалОписи");
		
		Инд = 1;
		Пока ЧленКомиссии.Следующий() Цикл
						
			Если Инд <= 4 Тогда
				Если ЧленКомиссии.Председатель Тогда
					ОбластьМакета.Параметры["ДолжностьПредседателя"] = ЧленКомиссии.ФизЛицо.Должность;
					ОбластьМакета.Параметры["ФИОПредседателя"] = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЧленКомиссии.ФизЛицо.Наименование); //ЧленКомиссии.ФизЛицо;
					
					Если ЧленКомиссии.Дистанционно Тогда
						ОбластьМакета.Параметры["ФИОПредседателя"] = ОбластьМакета.Параметры["ФИОПредседателя"] + " (дистанционно)";
					КонецЕсли;
				Иначе
					Если Инд <> 1 Тогда //Времено. Исправить
						ОбластьМакета.Параметры["ДолжностьЧленаКомиссии" + Инд] = ЧленКомиссии.ФизЛицо.Должность;
						ОбластьМакета.Параметры["ФИОЧленаКомиссии" + Инд] = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЧленКомиссии.ФизЛицо.Наименование); //ЧленКомиссии.ФизЛицо;
						
						Если ЧленКомиссии.Дистанционно Тогда
							ОбластьМакета.Параметры["ФИОЧленаКомиссии" + Инд] = ОбластьМакета.Параметры["ФИОЧленаКомиссии" + Инд] + " (дистанционно)";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;		
			Иначе
				ТабДокумент.Вывести(ОбластьМакета);
				
				ОбластьМакета = Макет.ПолучитьОбласть("ДопЧленКомиссии");
		       	ОбластьМакета.Параметры["ДолжностьЧленаКомиссии"] = ЧленКомиссии.ФизЛицо.Должность;
				ОбластьМакета.Параметры["ФИОЧленаКомиссии"] = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЧленКомиссии.ФизЛицо.Наименование); //ЧленКомиссии.ФизЛицо;
			КонецЕсли;
			Инд = Инд + 1;
		КонецЦикла;
		
		ТабДокумент.Вывести(ОбластьМакета);
			
		ОбластьМакета = Макет.ПолучитьОбласть("ПодвалОписиМОл");
		ТабДокумент.Вывести(ОбластьМакета);
		
		
		Молы         = Шапка.Молы.Выбрать();
		Пока Молы.Следующий() Цикл 		
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаМол");		
			ОбластьМакета.Параметры.ДолжностьМОЛ            = Молы.Физлицо.Должность;
			ОбластьМакета.Параметры.ФИОМОЛ                  = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Молы.ФизЛицо.Наименование);
			ТабДокумент.Вывести(ОбластьМакета);			
		КонецЦикла;
		
		Если Вид = "Недостача" Тогда
			ОбластьПодвалБух = Макет.ПолучитьОбласть("ПодвалБух");
			ТабДокумент.Вывести(ОбластьПодвалБух);
		КонецЕсли;
		
		ОбластьНомерСтраницы = Макет.ПолучитьОбласть("СтрокаНомерСтраницы");
		ПараметрыОбласти = ОбластьНомерСтраницы.Параметры;
		
		//ПараметрыОбласти.НомерСтраницы = "Страница "+СокрЛП(НомерСтраницы);
		
		ТабДокумент.Вывести(ОбластьНомерСтраницы);
		
		//Добавляем колонтитул
		Если ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард Тогда
			ТекСотрудник = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ПараметрыСеанса.ТекущийСотрудник.Наименование);
		Иначе
			ТекСотрудник = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Пользователи.ТекущийПользователь().Сотрудник.Наименование);
		КонецЕсли;
		
		Если Вид = "Полная" Тогда
			НаимПечФормы = "ИНВ-19 Сличительная ведомость итогов инвентаризации (полная)";
		ИначеЕсли Вид = "Новое" Тогда
			НаимПечФормы = "ИНВ-19 Сличительная ведомость итогов инвентаризации (новые)";
		ИначеЕсли Вид = "Недостача" Тогда
			НаимПечФормы = "ИНВ-19 Сличительная ведомость итогов инвентаризации (недостача)";
		КонецЕсли;
		
		//Т.к. при двусторонней печати левый и правый текст пемяются местами пришлось писать все в центр
		ТабДокумент.НижнийКолонтитул.НачальнаяСтраница = 2;
		ТабДокумент.НижнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
		ТабДокумент.НижнийКолонтитул.Шрифт = Новый Шрифт("Times New Roman", 7,, Истина);
		
		ТабДокумент.НижнийКолонтитул.ТекстВЦентре = "[&Дата] [&Время]" + " " + ТекСотрудник //Левый край
		+ "                                                                                                " //отступ
		+ НаимПечФормы + " № " + Шапка.НомерДокумента + " от " + Формат(Шапка.ДатаДокумента, "ДФ=dd.MM.yyyy") + " Ломбард № " + Шапка.Ломбард.НомерЛомбарда // Центр
		+ "                                                                                                " //отступ
		+ "Страница [&НомерСтраницы] из [&СтраницВсего]"; //Правый край
			
		ТабДокумент.НижнийКолонтитул.Выводить = Истина;
		//

		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);

	КонецЦикла;

	Возврат ТабДокумент;

КонецФункции

Функция ПечатьИНВ22(МассивОбъектов, ОбъектыПечати, ВалютаРегламентированногоУчета)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВалютаПечати = ВалютаРегламентированногоУчета;
	Шапка = ПолучитьВыборкуШапок(МассивОбъектов);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб			= Истина;
	ТабДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияТоваровНаСкладе_ИНВ22";
	
	// Получение областей макета.
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ИНВ22");
	ПервыйДокумент = Истина;

	Пока Шапка.Следующий() Цикл
	
		ЗаголовокРазделаПодписей = Новый Структура();
		ЗаголовокРазделаПодписей.Вставить("ПредседательКомиссии", "Председатель комиссии");
		ЗаголовокРазделаПодписей.Вставить("ЧленыКомиссии",        "Члены комиссии");
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		ВыборкаСтрокТовары = Шапка.Товары.Выбрать();
		ЧленКомиссии = Шапка.ИнвентаризационнаяКомиссия.Выбрать();
	
		// Получаем области макета для вывода в табличный документ
		ШапкаОтчета   = Макет.ПолучитьОбласть("Шапка");
		Подпись = Макет.ПолучитьОбласть("Подпись");
		Подвал  = Макет.ПолучитьОбласть("Подвал");
		
		// Выведем шапку документа
		СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
		
		ШапкаОтчета.Параметры.Заполнить(Шапка);
		
		// ++ Сербаев 10.05.2023
		//ШапкаОтчета.Параметры.Организация          = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации);
		// -- Сербаев 10.05.2023
		
		ШапкаОтчета.Параметры.ОрганизацияКодПоОКПО = СведенияОбОрганизации.КодПоОКПО;
		
		ШапкаОтчета.Параметры.НомерДокумента = Шапка.ДокументОснованиеНомер;
		ШапкаОтчета.Параметры.ДатаДокумента  = Шапка.ДокументОснованиеДата;
		
		ШапкаОтчета.Параметры.НаименованиеИмуществаОбязательств = "";
		ШапкаОтчета.Параметры.Подразделение = Шапка.Склад;
		
		ТабДокумент.Вывести(ШапкаОтчета);
		
		// Выведем подпись председателя инвентаризационной комиссии
		ПредседательКомиссии = Неопределено;
		Если ЧленКомиссии.Следующий() Тогда
			Если ЧленКомиссии.Председатель Тогда
				ПредседательКомиссии = ЧленКомиссии;
			КонецЕсли;	// 
		КонецЕсли;
		
		Если НЕ (ПредседательКомиссии = Неопределено) Тогда
			
			// ++ Сербаев 10.05.2023
			//ДанныеПредседателя = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(Шапка.Организация, ПредседательКомиссии.ФизЛицо, Шапка.Дата);
			// -- Сербаев 10.05.2023
				
			Подпись.Параметры.ЗаголовокРазделаПодписей = ЗаголовокРазделаПодписей.ПредседательКомиссии;
			
			// ++ Сербаев 10.05.2023
			//Подпись.Параметры.Должность                = ДанныеПредседателя.Должность;
			// -- Сербаев 10.05.2023
			
		    Подпись.Параметры.НаименованиеЧленаКомисси = ПредседательКомиссии.ФизЛицо.Наименование;
			
		Иначе
			
			Подпись.Параметры.ЗаголовокРазделаПодписей = ЗаголовокРазделаПодписей.ПредседательКомиссии;
			Подпись.Параметры.Должность                = "";
			Подпись.Параметры.НаименованиеЧленаКомисси = "";
			
		КонецЕсли;
			
		ТабДокумент.Вывести(Подпись);
		
		// Выведем подписи членов комиссии
		ВыводитьЗаголовок = Истина;
		
		КоличествоЧленовКомиссии = 0;
		
		// Сначала выведем членов комиссии из выборки
		Пока ЧленКомиссии.Следующий() Цикл
			
			Если ЧленКомиссии.Председатель Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, Подпись) Тогда
				
				// Выведем разрыв страницы
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ВыводитьЗаголовок = Истина; // на новой странице выведем заголовок набора подписей
			
			КонецЕсли;
			
			КоличествоЧленовКомиссии = КоличествоЧленовКомиссии + 1;
			
			// ++ Сербаев 10.05.2023
			//ДанныеЧленаКомиссии = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(Шапка.Организация, ЧленКомиссии.ФизЛицо, Шапка.Дата);
			// -- Сербаев 10.05.2023
			
			Подпись.Параметры.ЗаголовокРазделаПодписей = ?(ВыводитьЗаголовок, 
			                                               ЗаголовокРазделаПодписей.ЧленыКомиссии,
														   "");
			// ++ Сербаев 10.05.2023											   
			//Подпись.Параметры.Должность                = ДанныеЧленаКомиссии.Должность; 
			// -- Сербаев 10.05.2023
			
	    	Подпись.Параметры.НаименованиеЧленаКомисси = ЧленКомиссии.ФизЛицо.Наименование;
			
			ТабДокумент.Вывести(Подпись);
			
			ВыводитьЗаголовок = Ложь; // в следующей итерации вывод заголовка не нужен
			
		КонецЦикла;
		
		// Затем выведем пустые места для подписей (чтобы в итоге получилось не менее 3-х
		// подписей, как в форме, утвержденной Госкомстатом)
		Если КоличествоЧленовКомиссии < 3 Тогда
			
			Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, Подпись) Тогда
				
				// Выведем разрыв страницы
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ВыводитьЗаголовок = Истина; // на новой странице выведем заголовок набора подписей
			
			КонецЕсли;
			
			Для Итератор = (КоличествоЧленовКомиссии + 1) По 3 Цикл
				
				Подпись.Параметры.ЗаголовокРазделаПодписей = ?(ВыводитьЗаголовок, 
				                                               ЗаголовокРазделаПодписей.ЧленыКомиссии,
															   "");
				Подпись.Параметры.Должность                = "";
			    Подпись.Параметры.НаименованиеЧленаКомисси = "";
				
				ТабДокумент.Вывести(Подпись);
				
				ВыводитьЗаголовок = Ложь; // в следующей итерации вывод заголовка не нужен
				
			КонецЦикла;
		
		КонецЕсли;
		
		// Выведем подвал приказа
		Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, Подвал) Тогда
			
			// Выведем разрыв страницы
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЕсли;
		
		Подвал.Параметры.НаименованиеИмуществаОбязательств = "";
		Подвал.Параметры.ДатаНачалаИнвентаризации          = Формат(Шапка.ДатаНачалаИнвентаризации, "ДЛФ=DD");
		Подвал.Параметры.ДатаОкончанияИнвентаризации       = Формат(Шапка.ДатаОкончанияИнвентаризации, "ДЛФ=DD");
		Подвал.Параметры.ПричинаПроведенияИнвентаризации   = Шапка.ПричинаПроведенияИнвентаризации;
		
		//Руководители = ОтветственныеЛицаБП.ОтветственныеЛица(Шапка.Организация, Шапка.Дата);
		//
		//Подвал.Параметры.ДолжностьРуководителя          = Руководители.РуководительДолжностьПредставление;
		//Подвал.Параметры.РасшифровкаПодписиРуководителя = Руководители.РуководительПредставление;
		
		ТабДокумент.Вывести(Подвал);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);

	КонецЦикла;	//Шапки.Следующий() 

	Возврат ТабДокумент;

КонецФункции

Функция ПечатьИнв8(МассивОбъектов, ОбъектыПечати, Пустая, ВсеВставки)

	УстановитьПривилегированныйРежим(Истина);
	
	Шапка = ПолучитьВыборкуШапок_Инв8(МассивОбъектов);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб			= Истина;
	ТабДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияТоваровНаСкладе_ИНВ8";
	ТабДокумент.ТолькоПросмотр = Истина;
	ТабДокумент.Защита = Истина;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЛБ_Инвентаризация.ПФ_MXL_ИНВ8");
	ПервыйДокумент = Истина;

	ТЧСтруктура = Новый Структура;
	ТЧСтруктура.Вставить("ТЧКамни", "ВставкиФакт");
	ТЧСтруктура.Вставить("ТЧМеталл", "ВставкиМеталла");
	
	Пока Шапка.Следующий() Цикл
	
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		ВыборкаСтрокТовары = Шапка.Товары.Выбрать();
		ЧленКомиссии = Шапка.ИнвентаризационнаяКомиссия.Выбрать();

		//////////////////////////////////////////////////////////////////////
		// 1-я страница формы

		// Выводим шапку накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ОбластьМакета.Параметры.Подразделение = Шапка.Ломбард.НомерЛомбарда;	
		
		ОбластьМакета.Параметры.ДатаДокумента            = Шапка.Дата;
		ОбластьМакета.Параметры.НомерДокумента           = Шапка.Номер; //ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Шапка.Номер, Истина, Ложь);
		ОбластьМакета.Параметры.ДокументОснованиеНомер = Шапка.НомерПриказа;
		ОбластьМакета.Параметры.ДокументОснованиеДата = Шапка.ДатаПриказа;
		ТабДокумент.Вывести(ОбластьМакета); 
		
		Молы         = Шапка.Молы.Выбрать();
		Пока Молы.Следующий() Цикл 		
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаМол");		
			ОбластьМакета.Параметры.ДолжностьМОЛ            = Молы.Физлицо.Должность;
			ОбластьМакета.Параметры.ФИОМОЛ                  = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Молы.ФизЛицо.Наименование); //Молы.Физлицо;
			ТабДокумент.Вывести(ОбластьМакета);			
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаПодвал");
		ОбластьМакета.Параметры.ДатаНачалаИнвентаризации = Формат(Шапка.ДатаНачалаИнвентаризации, "ДЛФ=DD");	
		ТабДокумент.Вывести(ОбластьМакета);		

		
		
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();

		//////////////////////////////////////////////////////////////////////
		// 2-я страница формы

		ИтогФактКоличество = 0;
		ИтогФактСумма      = 0;
		ИтогФактСуммаВсего = 0;
		ИтогБухКоличество  = 0;
		ИтогБухСумма       = 0;

		КолвоСтрокПоСтранице = 0;
		КолвоПоСтранице      = 0;
		СуммаЛиста           = 0;
		ИтогоКолво           = 0; 
		
		ИтогоОстатокЗаймаСтраница 	= 0;
		ИтогоКоличествоСтраница   	= 0;
		ИтогоОбщаяМассаСтраница   	= 0;
		ИтогоМассаМеталлаСтраница 	= 0;
		ИтогоОценкаСтраница		 	= 0;
		ИтогоКоличествоФактСтраница = 0; 
		ИтогоОбщаяМассаФактСтраница	= 0;
		ИтогоМассаМеталлаФактСтраница = 0;
		ИтогоОценкаФактСтраница		= 0;
		
		ИтогоОстатокЗаймаНакопительный 	= 0;
		ИтогоКоличествоНакопительный   	= 0;
		ИтогоОбщаяМассаНакопительный   	= 0;
		ИтогоМассаМеталлаНакопительный 	= 0;
		ИтогоОценкаНакопительный		= 0;
		ИтогоКоличествоФактНакопительный = 0; 
		ИтогоОбщаяМассаФактНакопительный = 0;
		ИтогоМассаМеталлаФактНакопительный = 0;
		ИтогоОценкаФактНакопительный	= 0;
		
		НомерСтраницы = 1;
	    Ном = 0;

		// Выводим заголовок таблицы
		ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
//		ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
		ТабДокумент.Вывести(ЗаголовокТаблицы);

		// Выводим многострочную часть документа
		ПодвалСтраницы  = Макет.ПолучитьОбласть("ПодвалСтраницы");	
			
		Пока ВыборкаСтрокТовары.Следующий() Цикл

			СтруктураВставки = ПолучитьВставки(ВыборкаСтрокТовары.ОбъектЗалога, Шапка.Ссылка, ТЧСтруктура, ВсеВставки);
			
			Ном = Ном + 1;
			СтрокаТаблицы   = Макет.ПолучитьОбласть("Строка");
			СтрокаТаблицы.Параметры.Заполнить(ВыборкаСтрокТовары); 
			
			СтрокаТаблицы.Параметры.Отклонения = ?(ВыборкаСтрокТовары.Отклонения = "", ?(ВыборкаСтрокТовары.Комментарий = "", "-", "" + ВыборкаСтрокТовары.Комментарий),
				"" + ВыборкаСтрокТовары.Отклонения + Символы.ПС + ВыборкаСтрокТовары.Комментарий);
			СтрокаТаблицы.Параметры.Наименование = СокрЛП(ВыборкаСтрокТовары.Наименование) + " ["+СокрЛП(ВыборкаСтрокТовары.Категория)+"]";
			
			Если Пустая Тогда
				СтрокаТаблицы.Параметры.КоличествоФакт = "";
				СтрокаТаблицы.Параметры.ПробаФакт = "";
				СтрокаТаблицы.Параметры.ОбщаяМассаФакт = "";
				СтрокаТаблицы.Параметры.МассаМеталлаФакт = "";
				СтрокаТаблицы.Параметры.ОценкаФакт = "";
				СтрокаТаблицы.Параметры.Отклонения = "";
			КонецЕсли;
			
			СтрокаСПодвалом = Новый Массив;
			СтрокаСПодвалом.Добавить(СтрокаТаблицы);
			СтрокаСПодвалом.Добавить(ПодвалСтраницы);
			
			//Проверяем влазиет ли строка с описание вставок на один лист
			Если СтруктураВставки.Камни <> Неопределено Тогда
				Для Каждого СтрВ Из СтруктураВставки.Камни Цикл
					СтрокаВставки = Макет.ПолучитьОбласть("СтрокаВставки");
					
					СтрокаВставки.Параметры.Наименование = "- " + СокрЛП(СтрВ.ВидВставки) + " " + СокрЛП(СтрВ.ВидОгранки) + " " + СокрЛП(СтрВ.КачествоОгранки);
					
					СтрокаСПодвалом.Добавить(СтрокаВставки);
				КонецЦикла;
			КонецЕсли;
			
			Если СтруктураВставки.Металлы <> Неопределено Тогда
				Для Каждого СтрМ Из СтруктураВставки.Металлы Цикл
					СтрокаВставки = Макет.ПолучитьОбласть("СтрокаВставки");
					
					СтрокаВставки.Параметры.Наименование = "- " + СокрЛП(СтрМ.ВидВставки);
					СтрокаСПодвалом.Добавить(СтрокаВставки);
				КонецЦикла;
			КонецЕсли;
			//
			
			ГраницаНет = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
			ГраницаЕсть = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
			
			Если НЕ ТабДокумент.ПроверитьВывод(СтрокаСПодвалом) Тогда

				ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ПодвалСтраницы");
				ПараметрыОбласти = ОбластьИтоговПоСтранице.Параметры;

				//ПараметрыОбласти.ИтогоФактКоличество = ИтогФактКоличество;
				//ПараметрыОбласти.ИтогоФактСумма      = ИтогФактСумма;
				//ПараметрыОбласти.ИтогоБухКоличество  = ИтогБухКоличество;
				//ПараметрыОбласти.ИтогоБухСумма       = ИтогБухСумма;

				ПараметрыОбласти.КоличествоПорядковыхНомеровНаСтраницеПрописью     = ЧислоПрописью(КолвоСтрокПоСтранице, ,",,,,,,,,0");
				ПараметрыОбласти.ОбщееКоличествоЕдиницФактическиНаСтраницеПрописью = ?(Пустая, "" , ЧислоПрописью(ИтогоКоличествоФактСтраница, ,",,,,,,,,0"));
				
				ПараметрыПредметаИсчисления = "целая, целых, целых, ж, сотая, сотых, сотых, ж, 2";
				//ФорматнаяСтрока = "Л=ru_RU; ДП=Истина"; 
				ФорматнаяСтрока = "Л=ru_RU"; 

				ПараметрыОбласти.СуммаФактическиНаСтраницеПрописью = ?(Пустая, "" , ЧислоПрописью(ИтогоМассаМеталлаФактСтраница,ФорматнаяСтрока,ПараметрыПредметаИсчисления));
							
				ПараметрыОбласти.ИтогоКоличествоСтраница   		= ИтогоКоличествоСтраница;
				ПараметрыОбласти.ИтогоОбщаяМассаСтраница   		= ИтогоОбщаяМассаСтраница;
				ПараметрыОбласти.ИтогоМассаМеталлаСтраница 		= ИтогоМассаМеталлаСтраница;
				ПараметрыОбласти.ИтогоОценкаСтраница		 	= ИтогоОценкаСтраница;
				ПараметрыОбласти.ИтогоКоличествоФактСтраница 	= ?(Пустая, "" , ИтогоКоличествоФактСтраница);
				ПараметрыОбласти.ИтогоОбщаяМассаФактСтраница	= ?(Пустая, "" , ИтогоОбщаяМассаФактСтраница);
				ПараметрыОбласти.ИтогоМассаМеталлаФактСтраница 	= ?(Пустая, "" , ИтогоМассаМеталлаФактСтраница);
				ПараметрыОбласти.ИтогоОценкаФактСтраница		= ?(Пустая, "" , ИтогоОценкаФактСтраница);
				
				//ПараметрыОбласти.ИтогоОстатокЗаймаНакопительный 	= ИтогоОстатокЗаймаНакопительный;
				ПараметрыОбласти.ИтогоКоличествоНакопительный   	= ИтогоКоличествоНакопительный;
				ПараметрыОбласти.ИтогоОбщаяМассаНакопительный   	= ИтогоОбщаяМассаНакопительный;
				ПараметрыОбласти.ИтогоМассаМеталлаНакопительный 	= ИтогоМассаМеталлаНакопительный;
				ПараметрыОбласти.ИтогоОценкаНакопительный			= ИтогоОценкаНакопительный;
				ПараметрыОбласти.ИтогоКоличествоФактНакопительный 	= ?(Пустая, "" , ИтогоКоличествоФактНакопительный);
				ПараметрыОбласти.ИтогоОбщаяМассаФактНакопительный 	= ?(Пустая, "" , ИтогоОбщаяМассаФактНакопительный);
				ПараметрыОбласти.ИтогоМассаМеталлаФактНакопительный = ?(Пустая, "" , ИтогоМассаМеталлаФактНакопительный);
				ПараметрыОбласти.ИтогоОценкаФактНакопительный		= ?(Пустая, "" , ИтогоОценкаФактНакопительный);

				НомерСтраницы = НомерСтраницы + 1;
				//ПараметрыОбласти.НомерСтраницы = "Страница "+СокрЛП(НомерСтраницы);
				ПараметрыОбласти.НомерСтр = СокрЛП(НомерСтраницы);
				
				ТабДокумент.Вывести(ОбластьИтоговПоСтранице);
				
				//НомерСтраницы = НомерСтраницы + 1;
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();

				//ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
				ТабДокумент.Вывести(ЗаголовокТаблицы);

				ИтогФактКоличество = 0;
				ИтогФактСумма      = 0;
				ИтогБухКоличество  = 0;
				ИтогБухСумма       = 0;

				КолвоСтрокПоСтранице = 0;
				КолвоПоСтранице      = 0;
				СуммаЛиста           = 0;
				
				ИтогоОстатокЗаймаСтраница 	= 0;
				ИтогоКоличествоСтраница   	= 0;
				ИтогоОбщаяМассаСтраница   	= 0;
				ИтогоМассаМеталлаСтраница 	= 0;
				ИтогоОценкаСтраница		 	= 0;
				ИтогоКоличествоФактСтраница = 0; 
				ИтогоОбщаяМассаФактСтраница	= 0;
				ИтогоМассаМеталлаФактСтраница = 0;
				ИтогоОценкаФактСтраница		= 0;
			КонецЕсли;

			Если СтруктураВставки.Камни <> Неопределено ИЛИ СтруктураВставки.Металлы <> Неопределено Тогда
				СтрокаТаблицы.Области.Строка.ГраницаСнизу = ГраницаНет;
			КонецЕсли;

			СтрокаТаблицы.Параметры.Номер = Ном;
			ТабДокумент.Вывести(СтрокаТаблицы);

			КоличествоВставок = 0;

			Если СтруктураВставки.Камни <> Неопределено Тогда
				КоличествоВставок = СтруктураВставки.Камни.Количество();
			КонецЕсли;
			
			Если СтруктураВставки.Металлы <> Неопределено Тогда
				КоличествоВставок = КоличествоВставок + СтруктураВставки.Металлы.Количество();
			КонецЕсли;
			
			ПорядковыйНомерВставки = 1;
			
			Если СтруктураВставки.Камни <> Неопределено Тогда
				Для Каждого СтрВ Из СтруктураВставки.Камни Цикл
					СтрокаВставки = Макет.ПолучитьОбласть("СтрокаВставки");
					
					СтрокаВставки.Параметры.Заполнить(СтрВ);
					СтрокаВставки.Параметры.Наименование = "- " + СокрЛП(СтрВ.ВидВставки) + " " + СокрЛП(СтрВ.ВидОгранки) + " " + СокрЛП(СтрВ.КачествоОгранки);
					
					Если ПорядковыйНомерВставки <> КоличествоВставок Тогда
						СтрокаВставки.Области.СтрокаВставки.ГраницаСнизу = ГраницаНет;
					КонецЕсли;
					
					Если Пустая Тогда
						СтрокаВставки.Параметры.КоличествоФакт = "";
						СтрокаВставки.Параметры.ВидВставкиФакт = "";
						СтрокаВставки.Параметры.ВесФакт = "";
						СтрокаВставки.Параметры.СуммаФакт = "";
					КонецЕсли;

					ТабДокумент.Вывести(СтрокаВставки);
					
					ПорядковыйНомерВставки = ПорядковыйНомерВставки + 1;
				КонецЦикла;				
			КонецЕсли;

			Если СтруктураВставки.Металлы <> Неопределено Тогда
				Для Каждого СтрМ Из СтруктураВставки.Металлы Цикл
					СтрокаВставки = Макет.ПолучитьОбласть("СтрокаВставки");
					
					СтрокаВставки.Параметры.Заполнить(СтрМ);
					СтрокаВставки.Параметры.Наименование = "- " + СокрЛП(СтрМ.ВидВставки);
					
					Если ПорядковыйНомерВставки <> КоличествоВставок Тогда
						СтрокаВставки.Области.СтрокаВставки.ГраницаСнизу = ГраницаНет;
					КонецЕсли;

					Если Пустая Тогда
						СтрокаВставки.Параметры.КоличествоФакт = "";
						СтрокаВставки.Параметры.ВидВставкиФакт = "";
						СтрокаВставки.Параметры.ВесФакт = "";
						СтрокаВставки.Параметры.СуммаФакт = "";
					КонецЕсли;
					
					ТабДокумент.Вывести(СтрокаВставки);

					ПорядковыйНомерВставки = ПорядковыйНомерВставки + 1;
				КонецЦикла;				
			КонецЕсли;
			
			КолвоСтрокПоСтранице = КолвоСтрокПоСтранице + 1;
			КолвоПоСтранице      = КолвоПоСтранице      + ВыборкаСтрокТовары.КоличествоФакт;
			//СуммаЛиста           = СуммаЛиста           + ВыборкаСтрокТовары.Сумма; 
			
//			ИтогоОстатокЗаймаСтраница 	= ИтогоОстатокЗаймаСтраница + ВыборкаСтрокТовары.ОстатокЗайма;
			ИтогоКоличествоСтраница   	= ИтогоКоличествоСтраница + ВыборкаСтрокТовары.Количество;
			ИтогоОбщаяМассаСтраница   	= ИтогоОбщаяМассаСтраница + ВыборкаСтрокТовары.ОбщаяМасса;
			ИтогоМассаМеталлаСтраница 	= ИтогоМассаМеталлаСтраница + ВыборкаСтрокТовары.МассаМеталла;
			ИтогоОценкаСтраница		 	= ИтогоОценкаСтраница + ВыборкаСтрокТовары.Оценка;
			ИтогоКоличествоФактСтраница = ИтогоКоличествоФактСтраница + ВыборкаСтрокТовары.КоличествоФакт; 
			ИтогоОбщаяМассаФактСтраница	= ИтогоОбщаяМассаФактСтраница + ВыборкаСтрокТовары.ОбщаяМассаФакт;
			ИтогоМассаМеталлаФактСтраница = ИтогоМассаМеталлаФактСтраница + ВыборкаСтрокТовары.МассаМеталлаФакт;
			ИтогоОценкаФактСтраница		= ИтогоОценкаФактСтраница + ВыборкаСтрокТовары.ОценкаФакт;
			
			ИтогоКоличествоНакопительный   	= ИтогоКоличествоНакопительный + ВыборкаСтрокТовары.Количество;
			ИтогоОбщаяМассаНакопительный   	= ИтогоОбщаяМассаНакопительный + ВыборкаСтрокТовары.ОбщаяМасса;
			ИтогоМассаМеталлаНакопительный 	= ИтогоМассаМеталлаНакопительный + ВыборкаСтрокТовары.МассаМеталла;
			ИтогоОценкаНакопительный			= ИтогоОценкаНакопительный + ВыборкаСтрокТовары.Оценка;
			ИтогоКоличествоФактНакопительный 	= ИтогоКоличествоФактНакопительный + ВыборкаСтрокТовары.КоличествоФакт; 
			ИтогоОбщаяМассаФактНакопительный 	= ИтогоОбщаяМассаФактНакопительный + ВыборкаСтрокТовары.ОбщаяМассаФакт;
			ИтогоМассаМеталлаФактНакопительный = ИтогоМассаМеталлаФактНакопительный + ВыборкаСтрокТовары.МассаМеталлаФакт;
			ИтогоОценкаФактНакопительный		= ИтогоОценкаФактНакопительный + ВыборкаСтрокТовары.ОценкаФакт;
		КонецЦикла;

		// Выводим итоги по последней странице
		ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ПодвалСтраницы");
		ПараметрыОбласти = ОбластьИтоговПоСтранице.Параметры;
		
		ПараметрыОбласти.ИтогоКоличествоСтраница   		= ИтогоКоличествоСтраница;
		ПараметрыОбласти.ИтогоОбщаяМассаСтраница   		= ИтогоОбщаяМассаСтраница;
		ПараметрыОбласти.ИтогоМассаМеталлаСтраница 		= ИтогоМассаМеталлаСтраница;
		ПараметрыОбласти.ИтогоОценкаСтраница		 	= ИтогоОценкаСтраница;
		ПараметрыОбласти.ИтогоКоличествоФактСтраница 	= ?(Пустая, "" , ИтогоКоличествоФактСтраница);
		ПараметрыОбласти.ИтогоОбщаяМассаФактСтраница	= ?(Пустая, "" , ИтогоОбщаяМассаФактСтраница);
		ПараметрыОбласти.ИтогоМассаМеталлаФактСтраница 	= ?(Пустая, "" , ИтогоМассаМеталлаФактСтраница);
		ПараметрыОбласти.ИтогоОценкаФактСтраница		= ?(Пустая, "" , ИтогоОценкаФактСтраница);
		
		ПараметрыОбласти.ИтогоКоличествоНакопительный   	= ИтогоКоличествоНакопительный;
		ПараметрыОбласти.ИтогоОбщаяМассаНакопительный   	= ИтогоОбщаяМассаНакопительный;
		ПараметрыОбласти.ИтогоМассаМеталлаНакопительный 	= ИтогоМассаМеталлаНакопительный;
		ПараметрыОбласти.ИтогоОценкаНакопительный			= ИтогоОценкаНакопительный;
		ПараметрыОбласти.ИтогоКоличествоФактНакопительный 	= ?(Пустая, "" , ИтогоКоличествоФактНакопительный);
		ПараметрыОбласти.ИтогоОбщаяМассаФактНакопительный 	= ?(Пустая, "" , ИтогоОбщаяМассаФактНакопительный);
		ПараметрыОбласти.ИтогоМассаМеталлаФактНакопительный = ?(Пустая, "" , ИтогоМассаМеталлаФактНакопительный);
		ПараметрыОбласти.ИтогоОценкаФактНакопительный		= ?(Пустая, "" , ИтогоОценкаФактНакопительный);
                       	
		ПараметрыОбласти.КоличествоПорядковыхНомеровНаСтраницеПрописью     = ЧислоПрописью(КолвоСтрокПоСтранице, ,",,,,,,,,0");
		ПараметрыОбласти.ОбщееКоличествоЕдиницФактическиНаСтраницеПрописью = ?(Пустая, "" , ЧислоПрописью(ИтогоКоличествоФактСтраница, ,",,,,,,,,0"));
		
		ПараметрыПредметаИсчисления = "целая, целых, целых, ж, сотая, сотых, сотых, ж, 2";
		//ФорматнаяСтрока = "Л=ru_RU; ДП=Истина"; 
		ФорматнаяСтрока = "Л=ru_RU"; 
		
		ПараметрыОбласти.СуммаФактическиНаСтраницеПрописью = ?(Пустая, "" , ЧислоПрописью(ИтогоМассаМеталлаФактСтраница,ФорматнаяСтрока,ПараметрыПредметаИсчисления));
		
		НомерСтраницы = НомерСтраницы + 1;
		//ПараметрыОбласти.НомерСтраницы = "Страница "+СокрЛП(НомерСтраницы);
		ПараметрыОбласти.НомерСтр = СокрЛП(НомерСтраницы);

		ТабДокумент.Вывести(ОбластьИтоговПоСтранице);

		// Выводим подвал документа
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		ОбластьМакета = Макет.ПолучитьОбласть("ПодвалОписи");
		ОбластьМакета.Параметры.Заполнить(Шапка);  
		
		ОбластьМакета.Параметры.ОбщееКоличествоЕдиницФактическиНаСтраницеПрописью = ?(Пустая, "" , ЧислоПрописью(ИтогоКоличествоФактНакопительный, ,",,,,,,,,0"));
		ОбластьМакета.Параметры.КоличествоПорядковыхНомеровНаСтраницеПрописью     = ЧислоПрописью(ВыборкаСтрокТовары.Количество(), ,",,,,,,,,0");
		
		
		//ПараметрыПредметаИсчисления = "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2";
		//ОбластьМакета.Параметры.СуммаФактическиНаСтраницеПрописью                 = ЧислоПрописью(ИтогоОценкаФактНакопительный,ФорматнаяСтрока ,ПараметрыПредметаИсчисления);
		
		ОбластьМакета.Параметры.СуммаФактическиНаСтраницеПрописью = ?(Пустая, "" , ЧислоПрописью(ИтогоМассаМеталлаФактНакопительный,ФорматнаяСтрока ,ПараметрыПредметаИсчисления));
		
		Инд = 1;
		Пока ЧленКомиссии.Следующий() Цикл
						
			Если Инд <= 4 Тогда
				Если ЧленКомиссии.Председатель Тогда
					ОбластьМакета.Параметры["ДолжностьПредседателя"] = ЧленКомиссии.ФизЛицо.Должность;
					ОбластьМакета.Параметры["ФИОПредседателя"] = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЧленКомиссии.ФизЛицо.Наименование); //ЧленКомиссии.ФизЛицо;
					
					Если ЧленКомиссии.Дистанционно Тогда
						ОбластьМакета.Параметры["ФИОПредседателя"] = ОбластьМакета.Параметры["ФИОПредседателя"] + " (дистанционно)";
					КонецЕсли;
				Иначе
					Если Инд <> 1 Тогда //Времено. Исправить
						ОбластьМакета.Параметры["ДолжностьЧленаКомиссии" + Инд] = ЧленКомиссии.ФизЛицо.Должность;
						ОбластьМакета.Параметры["ФИОЧленаКомиссии" + Инд] = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЧленКомиссии.ФизЛицо.Наименование); //ЧленКомиссии.ФизЛицо;
						
						Если ЧленКомиссии.Дистанционно Тогда
							ОбластьМакета.Параметры["ФИОЧленаКомиссии" + Инд] = ОбластьМакета.Параметры["ФИОЧленаКомиссии" + Инд] + " (дистанционно)";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;		
			Иначе
				ТабДокумент.Вывести(ОбластьМакета);
				
				ОбластьМакета = Макет.ПолучитьОбласть("ДопЧленКомиссии");
		       	ОбластьМакета.Параметры["ДолжностьЧленаКомиссии"] = ЧленКомиссии.ФизЛицо.Должность;
				ОбластьМакета.Параметры["ФИОЧленаКомиссии"] = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЧленКомиссии.ФизЛицо.Наименование); //ЧленКомиссии.ФизЛицо;
			КонецЕсли;
			Инд = Инд + 1;
		КонецЦикла;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ПодвалОписиМОЛ");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ОбластьМакета.Параметры.НачальныйНомерПоПорядку = 1;
		ОбластьМакета.Параметры.НомерКонца              = ВыборкаСтрокТовары.Количество();
		ТабДокумент.Вывести(ОбластьМакета);
		
		
		Молы         = Шапка.Молы.Выбрать();
		Пока Молы.Следующий() Цикл 		
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаМол");		
			ОбластьМакета.Параметры.ДолжностьМОЛ         = Молы.Физлицо.Должность;
			ОбластьМакета.Параметры.ФИОМОЛ               = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Молы.ФизЛицо.Наименование); //Молы.ФИзлицо;
			ТабДокумент.Вывести(ОбластьМакета);			
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("ПодвалОписиМОЛДата");
	    ОбластьМакета.Параметры.ДатаДокумента 	= Шапка.Дата;

		НомерСтраницы = НомерСтраницы + 1;
		//ОбластьМакета.Параметры.НомерСтраницы = "Страница "+СокрЛП(НомерСтраницы);

		ТабДокумент.Вывести(ОбластьМакета);	

		//Добавляем колонтитул
		Если ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард Тогда
			ТекСотрудник = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ПараметрыСеанса.ТекущийСотрудник.Наименование);
		Иначе
			ТекСотрудник = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Пользователи.ТекущийПользователь().Сотрудник.Наименование);
		КонецЕсли;
			
		Если ВсеВставки Тогда
			НаимПечФормы = "ИНВ-8 Акт инвентаризации ДМ и изделий из них (черновик)";
		ИначеЕсли Пустая Тогда
			НаимПечФормы = "ИНВ-8 Акт инвентаризации ДМ и изделий из них (пустая)";
		Иначе
			НаимПечФормы = "ИНВ-8 Акт инвентаризации ДМ и изделий из них";
		КонецЕсли;
		
		//Т.к. при двусторонней печати левый и правый текст пемяются местами пришлось писать все в центр
		ТабДокумент.НижнийКолонтитул.НачальнаяСтраница = 2;
		ТабДокумент.НижнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
		ТабДокумент.НижнийКолонтитул.Шрифт = Новый Шрифт("Times New Roman", 7,, Истина);
		//ТабДокумент.НижнийКолонтитул.ТекстСлева = "[&Дата] [&Время]" + " " + ТекСотрудник;
		
		ТабДокумент.НижнийКолонтитул.ТекстВЦентре = "[&Дата] [&Время]" + " " + ТекСотрудник //Левый край
		+ "                                                                                                " //отступ
		+ НаимПечФормы + " № " + Шапка.Номер + " от " + Формат(Шапка.Дата, "ДФ=dd.MM.yyyy") + " Ломбард № " + Шапка.Ломбард.НомерЛомбарда // Центр
		+ "                                                                                                " //отступ
		+ "Страница [&НомерСтраницы] из [&СтраницВсего]"; //Правый край
			
		//ТабДокумент.НижнийКолонтитул.ТекстСправа = "Страница [&НомерСтраницы] из [&СтраницВсего]";
		ТабДокумент.НижнийКолонтитул.Выводить = Истина;
		//
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);

	КонецЦикла;	//Шапки.Следующий() 

	Возврат ТабДокумент;

КонецФункции

Функция ПечатьИнв5(МассивОбъектов, ОбъектыПечати, Пустая)

	УстановитьПривилегированныйРежим(Истина);
	
	Шапка = ПолучитьВыборкуШапок_Инв5(МассивОбъектов);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб			= Истина;
	ТабДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияТоваровНаСкладе_ИНВ5";
	ТабДокумент.ТолькоПросмотр = Истина;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЛБ_Инвентаризация.ПФ_MXL_ИНВ5");
	ПервыйДокумент = Истина;

	ТЧСтруктура = Новый Структура;
	ТЧСтруктура.Вставить("ТЧКамни", "ВставкиКамнейНаОХ");
	ТЧСтруктура.Вставить("ТЧМеталл", "ВставкиМеталлаНаОХ");

	Пока Шапка.Следующий() Цикл
	
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		ВыборкаСтрокТовары = Шапка.Товары.Выбрать();
		ЧленКомиссии = Шапка.ИнвентаризационнаяКомиссия.Выбрать();

		//////////////////////////////////////////////////////////////////////
		// 1-я страница формы

		// Выводим шапку накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ОбластьМакета.Параметры.ДатаДокумента            = Формат(Шапка.Дата, "ДФ=dd.MM.yyyy");
		ОбластьМакета.Параметры.Подразделение            = Шапка.Ломбард.НомерЛомбарда;
		ОбластьМакета.Параметры.НомерДокумента           = Шапка.Номер; //ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Шапка.Номер, Истина, Ложь);
		ОбластьМакета.Параметры.ДокументОснованиеНомер = Шапка.НомерПриказа;
		ОбластьМакета.Параметры.ДокументОснованиеДата = Шапка.Датаприказа;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		Молы = Шапка.Молы.Выбрать();
		Пока Молы.Следующий() Цикл 		
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаМол");		
			ОбластьМакета.Параметры.ДолжностьМОЛ            = Молы.Физлицо.Должность;
			ОбластьМакета.Параметры.ФИОМОЛ                  = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Молы.ФизЛицо.Наименование); //Молы.Физлицо;
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЦикла;

		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаПодвал");
		ОбластьМакета.Параметры.ДатаНачалаИнвентаризации = Формат(Шапка.ДатаНачалаИнвентаризации, "ДЛФ=DD");
		ТабДокумент.Вывести(ОбластьМакета);
	
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();

		//////////////////////////////////////////////////////////////////////
		// 2-я страница формы

		ИтогФактКоличество = 0;
		ИтогФактСумма      = 0;
		ИтогФактСуммаВсего = 0;
		ИтогБухКоличество  = 0;
		ИтогБухСумма       = 0;

		КолвоСтрокПоСтранице = 0;
		КолвоПоСтранице      = 0;
		СуммаЛиста           = 0;
		ИтогоКолво           = 0; 
		
		//ИтогоОстатокЗаймаСтраница 	= 0;
		ИтогоКоличествоСтраница   	= 0;
		ИтогоОбщаяМассаСтраница   	= 0;
		ИтогоМассаМеталлаСтраница 	= 0;
		ИтогоОценкаСтраница		 	= 0;
		ИтогоКоличествоФактСтраница = 0; 
		ИтогоОбщаяМассаФактСтраница	= 0;
		ИтогоМассаМеталлаФактСтраница = 0;
		ИтогоОценкаФактСтраница		= 0;
		
		//ИтогоОстатокЗаймаНакопительный 	= 0;
		ИтогоКоличествоНакопительный   	= 0;
		ИтогоОбщаяМассаНакопительный   	= 0;
		ИтогоМассаМеталлаНакопительный 	= 0;
		ИтогоОценкаНакопительный		= 0;
		ИтогоКоличествоФактНакопительный = 0; 
		ИтогоОбщаяМассаФактНакопительный = 0;
		ИтогоМассаМеталлаФактНакопительный = 0;
		ИтогоОценкаФактНакопительный	= 0;
		
		НомерСтраницы = 1;
	    Ном = 0;

		// Выводим заголовок таблицы
		ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
//		ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
		ТабДокумент.Вывести(ЗаголовокТаблицы);

		// Выводим многострочную часть документа
		ПодвалСтраницы  = Макет.ПолучитьОбласть("ПодвалСтраницы");	
			
		Пока ВыборкаСтрокТовары.Следующий() Цикл

			СтруктураВставки = ПолучитьВставки(ВыборкаСтрокТовары.ОбъектЗалога, Шапка.Ссылка, ТЧСтруктура, Ложь);
			
			ДатаОХ = ПолучитьДатуОХ(НачалоДня(Шапка.ДатаНачалаИнвентаризации), ВыборкаСтрокТовары.ОбъектЗалога, ВыборкаСтрокТовары.ОперацияЗайма.НомерЗалоговогоБилета);
			
			Ном = Ном + 1;
			СтрокаТаблицы   = Макет.ПолучитьОбласть("Строка");
			СтрокаТаблицы.Параметры.Заполнить(ВыборкаСтрокТовары); 
			СтрокаТаблицы.Параметры.Наименование = СокрЛП(ВыборкаСтрокТовары.ОбъектЗалога.Наименование) + " ["+СокрЛП(ВыборкаСтрокТовары.Категория)+"]";
			СтрокаТаблицы.Параметры.ДатаИсполнения = ДатаОХ;
			СтрокаТаблицы.Параметры.Отклонения = ?(ВыборкаСтрокТовары.Отклонения = "", "" + ВыборкаСтрокТовары.Комментарий,
				"" + ВыборкаСтрокТовары.Отклонения + Символы.ПС + ВыборкаСтрокТовары.Комментарий);
			
			Если Пустая Тогда
				СтрокаТаблицы.Параметры.КоличествоФакт = "";
				СтрокаТаблицы.Параметры.ПробаФакт = "";
				СтрокаТаблицы.Параметры.ОбщаяМассаФакт = "";
				СтрокаТаблицы.Параметры.МассаМеталлаФакт = "";
				СтрокаТаблицы.Параметры.СуммаОценкиФакт = "";
				СтрокаТаблицы.Параметры.Отклонения = "";
			КонецЕсли;
			
			СтрокаСПодвалом = Новый Массив;
			СтрокаСПодвалом.Добавить(СтрокаТаблицы);
			СтрокаСПодвалом.Добавить(ПодвалСтраницы);
			
			//Проверяем влазиет ли строка с описание вставок на один лист
			Если СтруктураВставки.Камни <> Неопределено Тогда
				Для Каждого СтрВ Из СтруктураВставки.Камни Цикл
					СтрокаВставки = Макет.ПолучитьОбласть("СтрокаВставки");
					
					СтрокаВставки.Параметры.Наименование = "- " + СокрЛП(СтрВ.ВидВставки) + " " + СокрЛП(СтрВ.ВидОгранки) + " " + СокрЛП(СтрВ.КачествоОгранки);
					
					СтрокаСПодвалом.Добавить(СтрокаВставки);
				КонецЦикла;
			КонецЕсли;
			
			Если СтруктураВставки.Металлы <> Неопределено Тогда
				Для Каждого СтрМ Из СтруктураВставки.Металлы Цикл
					СтрокаВставки = Макет.ПолучитьОбласть("СтрокаВставки");
					
					СтрокаВставки.Параметры.Наименование = "- " + СокрЛП(СтрМ.ВидВставки);
					СтрокаСПодвалом.Добавить(СтрокаВставки);
				КонецЦикла;
			КонецЕсли;
			//
			
			ГраницаНет = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
			
			Если НЕ ТабДокумент.ПроверитьВывод(СтрокаСПодвалом) Тогда

				ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ПодвалСтраницы");
				ПараметрыОбласти = ОбластьИтоговПоСтранице.Параметры;

				//ПараметрыОбласти.ИтогоФактКоличество = ИтогФактКоличество;
				//ПараметрыОбласти.ИтогоФактСумма      = ИтогФактСумма;
				//ПараметрыОбласти.ИтогоБухКоличество  = ИтогБухКоличество;
				//ПараметрыОбласти.ИтогоБухСумма       = ИтогБухСумма;

				ПараметрыОбласти.КоличествоПорядковыхНомеровНаСтраницеПрописью     = ЧислоПрописью(КолвоСтрокПоСтранице, ,",,,,,,,,0");
				ПараметрыОбласти.ОбщееКоличествоЕдиницФактическиНаСтраницеПрописью = ?(Пустая, "" , ЧислоПрописью(ИтогоКоличествоФактСтраница, ,",,,,,,,,0"));
				
				ПараметрыПредметаИсчисления = "целая, целых, целых, ж, сотая, сотых, сотых, ж, 2";
				//ФорматнаяСтрока = "Л=ru_RU; ДП=Истина";  	
				ФорматнаяСтрока = "Л=ru_RU";
				ПараметрыОбласти.СуммаФактическиНаСтраницеПрописью = ?(Пустая, "" , ЧислоПрописью(ИтогоМассаМеталлаФактСтраница,ФорматнаяСтрока,ПараметрыПредметаИсчисления));
				
				ПараметрыОбласти.ИтогоКоличествоСтраница   		= ИтогоКоличествоСтраница;
				ПараметрыОбласти.ИтогоОбщаяМассаСтраница   		= ИтогоОбщаяМассаСтраница;
				ПараметрыОбласти.ИтогоМассаМеталлаСтраница 		= ИтогоМассаМеталлаСтраница;
				ПараметрыОбласти.ИтогоОценкаСтраница		 	= ИтогоОценкаСтраница;
				ПараметрыОбласти.ИтогоКоличествоФактСтраница 	= ?(Пустая, "" , ИтогоКоличествоФактСтраница);
				ПараметрыОбласти.ИтогоОбщаяМассаФактСтраница	= ?(Пустая, "" , ИтогоОбщаяМассаФактСтраница);
				ПараметрыОбласти.ИтогоМассаМеталлаФактСтраница 	= ?(Пустая, "" , ИтогоМассаМеталлаФактСтраница);
				ПараметрыОбласти.ИтогоОценкаФактСтраница		= ?(Пустая, "" , ИтогоОценкаФактСтраница);
				
				//ПараметрыОбласти.ИтогоОстатокЗаймаНакопительный 	= ИтогоОстатокЗаймаНакопительный;
				ПараметрыОбласти.ИтогоКоличествоНакопительный   	= ИтогоКоличествоНакопительный;
				ПараметрыОбласти.ИтогоОбщаяМассаНакопительный   	= ИтогоОбщаяМассаНакопительный;
				ПараметрыОбласти.ИтогоМассаМеталлаНакопительный 	= ИтогоМассаМеталлаНакопительный;
				ПараметрыОбласти.ИтогоОценкаНакопительный			= ИтогоОценкаНакопительный;
				ПараметрыОбласти.ИтогоКоличествоФактНакопительный 	= ?(Пустая, "" , ИтогоКоличествоФактНакопительный);
				ПараметрыОбласти.ИтогоОбщаяМассаФактНакопительный 	= ?(Пустая, "" , ИтогоОбщаяМассаФактНакопительный);
				ПараметрыОбласти.ИтогоМассаМеталлаФактНакопительный = ?(Пустая, "" , ИтогоМассаМеталлаФактНакопительный);
				ПараметрыОбласти.ИтогоОценкаФактНакопительный		= ?(Пустая, "" , ИтогоОценкаФактНакопительный);
				
				НомерСтраницы = НомерСтраницы + 1;
				//ПараметрыОбласти.НомерСтраницы = "Страница "+СокрЛП(НомерСтраницы);
				ПараметрыОбласти.НомерСтр = СокрЛП(НомерСтраницы);
				
				ТабДокумент.Вывести(ОбластьИтоговПоСтранице);
				
				//НомерСтраницы = НомерСтраницы + 1;
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();

//				ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
				ТабДокумент.Вывести(ЗаголовокТаблицы);

				ИтогФактКоличество = 0;
				ИтогФактСумма      = 0;
				ИтогБухКоличество  = 0;
				ИтогБухСумма       = 0;

				КолвоСтрокПоСтранице = 0;
				КолвоПоСтранице      = 0;
				СуммаЛиста           = 0;
				
				//ИтогоОстатокЗаймаСтраница 	= 0;
				ИтогоКоличествоСтраница   	= 0;
				ИтогоОбщаяМассаСтраница   	= 0;
				ИтогоМассаМеталлаСтраница 	= 0;
				ИтогоОценкаСтраница		 	= 0;
				ИтогоКоличествоФактСтраница = 0; 
				ИтогоОбщаяМассаФактСтраница	= 0;
				ИтогоМассаМеталлаФактСтраница = 0;
				ИтогоОценкаФактСтраница		= 0;
			КонецЕсли;

			Если СтруктураВставки.Камни <> Неопределено ИЛИ СтруктураВставки.Металлы <> Неопределено Тогда
				СтрокаТаблицы.Области.Строка.ГраницаСнизу = ГраницаНет;
			КонецЕсли;
			
			СтрокаТаблицы.Параметры.Номер = Ном;
			ТабДокумент.Вывести(СтрокаТаблицы);

			КоличествоВставок = 0;

			Если СтруктураВставки.Камни <> Неопределено Тогда
				КоличествоВставок = СтруктураВставки.Камни.Количество();
			КонецЕсли;
			
			Если СтруктураВставки.Металлы <> Неопределено Тогда
				КоличествоВставок = КоличествоВставок + СтруктураВставки.Металлы.Количество();
			КонецЕсли;
			
			ПорядковыйНомерВставки = 1;
			
			Если СтруктураВставки.Камни <> Неопределено Тогда
				Для Каждого СтрВ Из СтруктураВставки.Камни Цикл
					СтрокаВставки = Макет.ПолучитьОбласть("СтрокаВставки");
					
					СтрокаВставки.Параметры.Заполнить(СтрВ);
					СтрокаВставки.Параметры.Наименование = "- " + СокрЛП(СтрВ.ВидВставки) + " " + СокрЛП(СтрВ.ВидОгранки) + " " + СокрЛП(СтрВ.КачествоОгранки);
					
					Если ПорядковыйНомерВставки <> КоличествоВставок Тогда
						СтрокаВставки.Области.СтрокаВставки.ГраницаСнизу = ГраницаНет;
					КонецЕсли;

					Если Пустая Тогда
						СтрокаВставки.Параметры.КоличествоФакт = "";
						СтрокаВставки.Параметры.ВидВставкиФакт = "";
						СтрокаВставки.Параметры.ВесФакт = "";
						СтрокаВставки.Параметры.СуммаФакт = "";
					КонецЕсли;
					
					ТабДокумент.Вывести(СтрокаВставки);
					
					ПорядковыйНомерВставки = ПорядковыйНомерВставки + 1;
				КонецЦикла;				
			КонецЕсли;

			Если СтруктураВставки.Металлы <> Неопределено Тогда
				Для Каждого СтрМ Из СтруктураВставки.Металлы Цикл
					СтрокаВставки = Макет.ПолучитьОбласть("СтрокаВставки");
					
					СтрокаВставки.Параметры.Заполнить(СтрМ);
					СтрокаВставки.Параметры.Наименование = "- " + СокрЛП(СтрМ.ВидВставки);
					
					Если ПорядковыйНомерВставки <> КоличествоВставок Тогда
						СтрокаВставки.Области.СтрокаВставки.ГраницаСнизу = ГраницаНет;
					КонецЕсли;

					Если Пустая Тогда
						СтрокаВставки.Параметры.КоличествоФакт = "";
						СтрокаВставки.Параметры.ВидВставкиФакт = "";
						СтрокаВставки.Параметры.ВесФакт = "";
						СтрокаВставки.Параметры.СуммаФакт = "";
					КонецЕсли;
					
					ТабДокумент.Вывести(СтрокаВставки);

					ПорядковыйНомерВставки = ПорядковыйНомерВставки + 1;
				КонецЦикла;				
			КонецЕсли;

			КолвоСтрокПоСтранице = КолвоСтрокПоСтранице + 1;
			КолвоПоСтранице      = КолвоПоСтранице      + ВыборкаСтрокТовары.КоличествоФакт;
			//СуммаЛиста           = СуммаЛиста           + ВыборкаСтрокТовары.Сумма; 
			
//			ИтогоОстатокЗаймаСтраница 	= ИтогоОстатокЗаймаСтраница + ВыборкаСтрокТовары.ОстатокЗайма;
			ИтогоКоличествоСтраница   	= ИтогоКоличествоСтраница + ВыборкаСтрокТовары.Количество;
			ИтогоОбщаяМассаСтраница   	= ИтогоОбщаяМассаСтраница + ВыборкаСтрокТовары.ОбщаяМасса;
			ИтогоМассаМеталлаСтраница 	= ИтогоМассаМеталлаСтраница + ВыборкаСтрокТовары.МассаМеталла;
			ИтогоОценкаСтраница		 	= ИтогоОценкаСтраница + ВыборкаСтрокТовары.СуммаОценки;
			ИтогоКоличествоФактСтраница = ИтогоКоличествоФактСтраница + ВыборкаСтрокТовары.КоличествоФакт; 
			ИтогоОбщаяМассаФактСтраница	= ИтогоОбщаяМассаФактСтраница + ВыборкаСтрокТовары.ОбщаяМассаФакт;
			ИтогоМассаМеталлаФактСтраница = ИтогоМассаМеталлаФактСтраница + ВыборкаСтрокТовары.МассаМеталлаФакт;
			ИтогоОценкаФактСтраница		= ИтогоОценкаФактСтраница + ВыборкаСтрокТовары.СуммаОценкиФакт;
			
			ИтогоКоличествоНакопительный   	= ИтогоКоличествоНакопительный + ВыборкаСтрокТовары.Количество;
			ИтогоОбщаяМассаНакопительный   	= ИтогоОбщаяМассаНакопительный + ВыборкаСтрокТовары.ОбщаяМасса;
			ИтогоМассаМеталлаНакопительный 	= ИтогоМассаМеталлаНакопительный + ВыборкаСтрокТовары.МассаМеталла;
			ИтогоОценкаНакопительный			= ИтогоОценкаНакопительный + ВыборкаСтрокТовары.СуммаОценки;
			ИтогоКоличествоФактНакопительный 	= ИтогоКоличествоФактНакопительный + ВыборкаСтрокТовары.КоличествоФакт; 
			ИтогоОбщаяМассаФактНакопительный 	= ИтогоОбщаяМассаФактНакопительный + ВыборкаСтрокТовары.ОбщаяМассаФакт;
			ИтогоМассаМеталлаФактНакопительный = ИтогоМассаМеталлаФактНакопительный + ВыборкаСтрокТовары.МассаМеталлаФакт;
			ИтогоОценкаФактНакопительный		= ИтогоОценкаФактНакопительный + ВыборкаСтрокТовары.СуммаОценкиФакт;
		КонецЦикла;

		// Выводим итоги по последней странице
		ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ПодвалСтраницы");
		ПараметрыОбласти = ОбластьИтоговПоСтранице.Параметры;
		
		ПараметрыОбласти.КоличествоПорядковыхНомеровНаСтраницеПрописью     = ЧислоПрописью(КолвоСтрокПоСтранице, ,",,,,,,,,0");
		ПараметрыОбласти.ОбщееКоличествоЕдиницФактическиНаСтраницеПрописью = ?(Пустая, "" , ЧислоПрописью(ИтогоКоличествоФактСтраница, ,",,,,,,,,0"));
		
		ПараметрыПредметаИсчисления = "целая, целых, целых, ж, сотая, сотых, сотых, ж, 2";
		//ФорматнаяСтрока = "Л=ru_RU; ДП=Истина";  	
		ФорматнаяСтрока = "Л=ru_RU";
		ПараметрыОбласти.СуммаФактическиНаСтраницеПрописью = ?(Пустая, "" , ЧислоПрописью(ИтогоМассаМеталлаФактСтраница,ФорматнаяСтрока,ПараметрыПредметаИсчисления));
		
		ПараметрыОбласти.ИтогоКоличествоСтраница   		= ИтогоКоличествоСтраница;
		ПараметрыОбласти.ИтогоОбщаяМассаСтраница   		= ИтогоОбщаяМассаСтраница;
		ПараметрыОбласти.ИтогоМассаМеталлаСтраница 		= ИтогоМассаМеталлаСтраница;
		ПараметрыОбласти.ИтогоОценкаСтраница		 	= ИтогоОценкаСтраница;
		ПараметрыОбласти.ИтогоКоличествоФактСтраница 	= ?(Пустая, "" , ИтогоКоличествоФактСтраница);
		ПараметрыОбласти.ИтогоОбщаяМассаФактСтраница	= ?(Пустая, "" , ИтогоОбщаяМассаФактСтраница);
		ПараметрыОбласти.ИтогоМассаМеталлаФактСтраница 	= ?(Пустая, "" , ИтогоМассаМеталлаФактСтраница);
		ПараметрыОбласти.ИтогоОценкаФактСтраница		= ?(Пустая, "" , ИтогоОценкаФактСтраница);
		
		//ПараметрыОбласти.ИтогоОстатокЗаймаНакопительный 	= ИтогоОстатокЗаймаНакопительный;
		ПараметрыОбласти.ИтогоКоличествоНакопительный   	= ИтогоКоличествоНакопительный;
		ПараметрыОбласти.ИтогоОбщаяМассаНакопительный   	= ИтогоОбщаяМассаНакопительный;
		ПараметрыОбласти.ИтогоМассаМеталлаНакопительный 	= ИтогоМассаМеталлаНакопительный;
		ПараметрыОбласти.ИтогоОценкаНакопительный			= ИтогоОценкаНакопительный;
		ПараметрыОбласти.ИтогоКоличествоФактНакопительный 	= ?(Пустая, "" , ИтогоКоличествоФактНакопительный);
		ПараметрыОбласти.ИтогоОбщаяМассаФактНакопительный 	= ?(Пустая, "" , ИтогоОбщаяМассаФактНакопительный);
		ПараметрыОбласти.ИтогоМассаМеталлаФактНакопительный = ?(Пустая, "" , ИтогоМассаМеталлаФактНакопительный);
		ПараметрыОбласти.ИтогоОценкаФактНакопительный		= ?(Пустая, "" , ИтогоОценкаФактНакопительный);
		
		НомерСтраницы = НомерСтраницы + 1;
		//ПараметрыОбласти.НомерСтраницы = "Страница "+СокрЛП(НомерСтраницы);
		ПараметрыОбласти.НомерСтр = СокрЛП(НомерСтраницы);
				
		ТабДокумент.Вывести(ОбластьИтоговПоСтранице);

		// Выводим подвал документа
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		ОбластьМакета = Макет.ПолучитьОбласть("ПодвалОписи");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		
		ОбластьМакета.Параметры.ОбщееКоличествоЕдиницФактическиНаСтраницеПрописью = ?(Пустая, "" , ЧислоПрописью(ИтогоКоличествоФактНакопительный, ,",,,,,,,,0"));
		ОбластьМакета.Параметры.КоличествоПорядковыхНомеровНаСтраницеПрописью     = ЧислоПрописью(Ном, ,",,,,,,,,0");
		                	
		//ПараметрыПредметаИсчисления = "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2";
		ОбластьМакета.Параметры.СуммаФактическиНаСтраницеПрописью = ?(Пустая, "" , ЧислоПрописью(ИтогоМассаМеталлаФактНакопительный,ФорматнаяСтрока ,ПараметрыПредметаИсчисления));
	           	
		Инд = 1;
		Пока ЧленКомиссии.Следующий() Цикл
			Если Инд <= 4 Тогда
				Если ЧленКомиссии.Председатель Тогда
					ОбластьМакета.Параметры["ДолжностьПредседателя"] = ЧленКомиссии.ФизЛицо.Должность;
					ОбластьМакета.Параметры["ФИОПредседателя"] = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЧленКомиссии.ФизЛицо.Наименование);
					
					Если ЧленКомиссии.Дистанционно Тогда
						ОбластьМакета.Параметры["ФИОПредседателя"] = ОбластьМакета.Параметры["ФИОПредседателя"] + " (дистанционно)";
					КонецЕсли;
				Иначе
					Если Инд <> 1 Тогда //Времено. Исправить
						ОбластьМакета.Параметры["ДолжностьЧленаКомиссии" + Инд] = ЧленКомиссии.ФизЛицо.Должность;
						ОбластьМакета.Параметры["ФИОЧленаКомиссии" + Инд] = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЧленКомиссии.ФизЛицо.Наименование);
						
						Если ЧленКомиссии.Дистанционно Тогда
							ОбластьМакета.Параметры["ФИОЧленаКомиссии" + Инд] = ОбластьМакета.Параметры["ФИОЧленаКомиссии" + Инд] + " (дистанционно)";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;		
			Иначе
				ТабДокумент.Вывести(ОбластьМакета);
				
				ОбластьМакета = Макет.ПолучитьОбласть("ДопЧленКомиссии");
		       	ОбластьМакета.Параметры["ДолжностьЧленаКомиссии"] = ЧленКомиссии.ФизЛицо.Должность;
				ОбластьМакета.Параметры["ФИОЧленаКомиссии"] = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЧленКомиссии.ФизЛицо.Наименование);
			КонецЕсли;
			Инд = Инд + 1;
		КонецЦикла;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ПодвалОписиМОЛ");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ОбластьМакета.Параметры.НачальныйНомерПоПорядку = 1;
		ОбластьМакета.Параметры.НомерКонца              = Ном;
	
		ТабДокумент.Вывести(ОбластьМакета); 
		
		Молы         = Шапка.Молы.Выбрать();
		Пока Молы.Следующий() Цикл 		
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаМол");		
			ОбластьМакета.Параметры.ДолжностьМОЛ            = Молы.Физлицо.Должность;
			ОбластьМакета.Параметры.ФИОМОЛ                  = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Молы.ФИзлицо.Наименование);
			ТабДокумент.Вывести(ОбластьМакета);			
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("ПодвалОписиМОЛДата");
	    ОбластьМакета.Параметры.ДатаДокумента 	= Шапка.Дата;

		НомерСтраницы = НомерСтраницы + 1;
		//ОбластьМакета.Параметры.НомерСтраницы = "Страница "+СокрЛП(НомерСтраницы);

		ТабДокумент.Вывести(ОбластьМакета);	

		//Добавляем колонтитул
		Если ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард Тогда
			ТекСотрудник = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ПараметрыСеанса.ТекущийСотрудник.Наименование);
		Иначе
			ТекСотрудник = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Пользователи.ТекущийПользователь().Сотрудник.Наименование);
		КонецЕсли;
			
		НаимПечФормы = "ИНВ-5 Акт инвентаризации ДМ на ОХ";
		
		//Т.к. при двусторонней печати левый и правый текст пемяются местами пришлось писать все в центр
		ТабДокумент.НижнийКолонтитул.НачальнаяСтраница = 2;
		ТабДокумент.НижнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
		ТабДокумент.НижнийКолонтитул.Шрифт = Новый Шрифт("Times New Roman", 7,, Истина);
		
		ТабДокумент.НижнийКолонтитул.ТекстВЦентре = "[&Дата] [&Время]" + " " + ТекСотрудник //Левый край
		+ "                                                                                                " //отступ
		+ НаимПечФормы + " № " + Шапка.Номер + " от " + Формат(Шапка.Дата, "ДФ=dd.MM.yyyy") + " Ломбард № " + Шапка.Ломбард.НомерЛомбарда // Центр
		+ "                                                                                                " //отступ
		+ "Страница [&НомерСтраницы] из [&СтраницВсего]"; //Правый край
			
		ТабДокумент.НижнийКолонтитул.Выводить = Истина;
		//
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);

	КонецЦикла;	//Шапки.Следующий() 

	Возврат ТабДокумент;

КонецФункции

Функция ВернутьДатуВыкупаИзделия(ОЗ, ЗБ, ДатаС, ДатаПо, ДокИнв, ДатаВыкупа)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОбъектыЗалогаОбороты.Период КАК Период,
	               |	ЛБ_ОбъектыЗалогаОбороты.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОбъектыЗалога.Обороты(
	               |			&ДатаС,
	               |			&ДатаПо,
	               |			Регистратор,
	               |			ОбъектЗалога = &ОбъектЗалога
	               |				И Ломбард = &Ломбард
	               |				И Склад = &Склад) КАК ЛБ_ОбъектыЗалогаОбороты
	               |ГДЕ
	               |	ЛБ_ОбъектыЗалогаОбороты.КоличествоРасход > 0
	               |	И ЛБ_ОбъектыЗалогаОбороты.ЗалоговыйБилет = &ЗалоговыйБилет
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ";

	Запрос.УстановитьПараметр("ОбъектЗалога", ОЗ);
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗБ);
	Запрос.УстановитьПараметр("ДатаС", ДатаС);
	Запрос.УстановитьПараметр("ДатаПо", ДатаПо);
	Запрос.УстановитьПараметр("Ломбард", ДокИнв.Ломбард);
	Запрос.УстановитьПараметр("Склад", ДокИнв.Склад);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Период;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ВернутьДокументВыкупаИзделия(ОЗ, ЗБ, ДатаС, ДатаПо, ДокИнв)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОбъектыЗалогаОбороты.Период КАК Период,
	               |	ЛБ_ОбъектыЗалогаОбороты.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОбъектыЗалога.Обороты(
	               |			&ДатаС,
	               |			&ДатаПо,
	               |			Регистратор,
	               |			ОбъектЗалога = &ОбъектЗалога
	               |				И Ломбард = &Ломбард
	               |				И Склад = &Склад) КАК ЛБ_ОбъектыЗалогаОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(&ДатаПо, ) КАК ЛБ_ОбъектыЗалогаОстатки
	               |		ПО ЛБ_ОбъектыЗалогаОбороты.ОбъектЗалога = ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога
	               |ГДЕ
	               |	ЛБ_ОбъектыЗалогаОбороты.КоличествоРасход > 0
	               |	И ЛБ_ОбъектыЗалогаОбороты.ЗалоговыйБилет = &ЗалоговыйБилет
	               |	И ВЫБОР
	               |			КОГДА ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток = 0
	               |				ТОГДА ИСТИНА
	               |			КОГДА ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток ЕСТЬ NULL
	               |				ТОГДА ИСТИНА
	               |			КОГДА ЛБ_ОбъектыЗалогаОбороты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление)
	               |					ИЛИ ЛБ_ОбъектыЗалогаОбороты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ИзъятиеОбъектовЗалога)
	               |				ТОГДА ИСТИНА
	               |		КОНЕЦ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ";

	Запрос.УстановитьПараметр("ОбъектЗалога", ОЗ);
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗБ);
	Запрос.УстановитьПараметр("ДатаС", ДатаС);
	Запрос.УстановитьПараметр("ДатаПо", ДатаПо);
	Запрос.УстановитьПараметр("Ломбард", ДокИнв.Ломбард);
	Запрос.УстановитьПараметр("Склад", ДокИнв.Склад);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Регистратор;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ПечатьОписиПоступивших(МассивОбъектов, ОбъектыПечати, Выбывшие)

	УстановитьПривилегированныйРежим(Истина);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб			= Истина;
	ТабДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияТоваровНаСкладе_ОписьПоступивших";
	ТабДокумент.ТолькоПросмотр = Истина;
	
	ПервыйДокумент = Истина;

	ТЧСтруктура = Новый Структура;
	
	Если НЕ Выбывшие Тогда
		ТЧСтруктура.Вставить("ТЧКамни", "ВставкиКамнейНовыеОЗ");
		ТЧСтруктура.Вставить("ТЧМеталл", "ВставкиМеталлаНовыеОЗ");
	Иначе
		
	КонецЕсли;
	
	Для каждого Док из МассивОбъектов Цикл
		
		Если НЕ Выбывшие Тогда
			Шапка = ПолучитьВыборкуШапокПоступивших(Док);
		Иначе
			Шапка = ПолучитьВыборкуШапокБезТоваров(Док);
		КонецЕсли;
		
		Если НЕ Выбывшие Тогда
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЛБ_Инвентаризация.ПФ_MXL_ОписьПоступивших");
		Иначе
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЛБ_Инвентаризация.ПФ_MXL_ОписьВыбывших");
		КонецЕсли;
		
		Пока Шапка.Следующий() Цикл
			
			Если Не ПервыйДокумент Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ПервыйДокумент = Ложь;
			// Запомним номер строки, с которой начали выводить текущий документ.
			НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
			
	   		Если НЕ Выбывшие Тогда
				ВыборкаСтрокТовары = Шапка.НовыеОЗ.Выбрать();
			Иначе
				ВыборкаСтрокТовары = ПолучитьСтрокиВыбывших(Док);
			КонецЕсли;
			
			ЧленКомиссии = Шапка.ИнвентаризационнаяКомиссия.Выбрать();
			
			//////////////////////////////////////////////////////////////////////
			// 1-я страница формы
			
			// Выводим шапку накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			
			Если НЕ Выбывшие Тогда
				ОбластьМакета.Параметры.Заголовок = "поступивших";
			Иначе
				ОбластьМакета.Параметры.Заголовок = "выбывших";
			КонецЕсли;
			
			ОбластьМакета.Параметры.ДатаПриказа  = Формат(Шапка.ДатаПриказа, "ДФ=dd.MM.yyyy");
			ОбластьМакета.Параметры.ДатаС  = Формат(Шапка.ДатаНачалаИнвентаризации, "ДФ=dd.MM.yyyy");
			ОбластьМакета.Параметры.ДатаПо = Формат(Шапка.ДатаОкончанияИнвентаризации, "ДФ=dd.MM.yyyy"); 
			ОбластьМакета.Параметры.ВремяОкончания = Формат(Шапка.ДатаОкончанияИнвентаризации, "ДЛФ=DT");
			ОбластьМакета.Параметры.Подразделение = Шапка.Ломбард.НомерЛомбарда;
			//ОбластьМакета.Параметры.НомерПриказа = Шапка.ДокументОснованиеНомер;
			ОбластьМакета.Параметры.Отделение = ПолучитьОтделение(НачалоДня(Шапка.ДатаДокумента), Шапка.Ломбард);
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			//ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			//////////////////////////////////////////////////////////////////////
			// 2-я страница формы
			
			ИтогоКоличествоНакопительный   	= 0;
			ИтогоОбщаяМассаНакопительный   	= 0;
			ИтогоМассаМеталлаНакопительный 	= 0;
			ИтогоКоличествоФактНакопительный = 0; 
			ИтогоОбщаяМассаФактНакопительный = 0;
			ИтогоМассаМеталлаФактНакопительный = 0;
			
			НомерСтраницы = 1;
			Ном = 0;
			
			// Выводим заголовок таблицы
			ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
			ТабДокумент.Вывести(ЗаголовокТаблицы);
			
			// Выводим многострочную часть документа
			ПодвалСтраницы  = Макет.ПолучитьОбласть("ПодвалСтраницы");	
			ПодвалНомСтр = Макет.ПолучитьОбласть("НомерСтраницы");
			
			ГраницаНет = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
			
			//ПредыдущийОЗ = "";
			
			Пока ВыборкаСтрокТовары.Следующий() Цикл 

				ДатаС = НачалоДня(Шапка.ДатаНачалаИнвентаризации);
				ДадаПо = ?(Шапка.ДатаОкончанияИнвентаризации = Дата(1,1,1), ТекущаяДата(), Шапка.ДатаОкончанияИнвентаризации);
				
				Если НЕ Выбывшие Тогда
					ДатаВыкупа = ВернутьДатуВыкупаИзделия(ВыборкаСтрокТовары.ОбъектЗалога, ВыборкаСтрокТовары.ОперацияЗайма, ДатаС, ДадаПо, Док, Истина);
					СтруктураВставки = ПолучитьВставки(ВыборкаСтрокТовары.ОбъектЗалога, Шапка.Ссылка, ТЧСтруктура, Ложь);
				Иначе
					//Если ПредыдущийОЗ = ВыборкаСтрокТовары.ОбъектЗалога Тогда
					//	Продолжить;
					//КонецЕсли;

					//ПредыдущийОЗ = ВыборкаСтрокТовары.ОбъектЗалога;
					
					Если ВыборкаСтрокТовары.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.Возвращен Тогда
						Продолжить;
					КонецЕсли;
					
					ДокументВыбытия = ВернутьДокументВыкупаИзделия(ВыборкаСтрокТовары.ОбъектЗалога, ВыборкаСтрокТовары.ОперацияЗайма, ДатаС, ДадаПо, Док);
					СтруктураВставки = ПолучитьВставкиВыбывших(ВыборкаСтрокТовары.ОбъектЗалога, Док);
					
					Если ДокументВыбытия = "" Тогда
						Продолжить;
					КонецЕсли;
					
				КонецЕсли;
				
				Ном = Ном + 1;
				СтрокаТаблицы   = Макет.ПолучитьОбласть("Строка");
				СтрокаТаблицы.Параметры.Заполнить(ВыборкаСтрокТовары); 
				СтрокаТаблицы.Параметры.Наименование = СокрЛП(ВыборкаСтрокТовары.ОбъектЗалога.Наименование) + " ["+СокрЛП(ВыборкаСтрокТовары.Категория)+"]";
				СтрокаТаблицы.Параметры.Отклонения = ?(ВыборкаСтрокТовары.Отклонения = "", "" + ВыборкаСтрокТовары.Комментарий,
					"" + ВыборкаСтрокТовары.Отклонения + Символы.ПС + ВыборкаСтрокТовары.Комментарий);
				
				Если ЗначениеЗаполнено(ВыборкаСтрокТовары.Приемщик) Тогда
					//СтрокаТаблицы.Параметры.Приемщик = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СокрЛП(ВыборкаСтрокТовары.Приемщик.Сотрудник.Наименование)); 
					СтрокаТаблицы.Параметры.Приемщик = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СокрЛП(ВыборкаСтрокТовары.Приемщик.Наименование)); 
				КонецЕсли;
				
				
				КоличествоФакт = ВыборкаСтрокТовары.Количество;
				ОбщаяМассаФакт = ВыборкаСтрокТовары.ОбщаяМасса; 
				МассаМеталлаФакт = ВыборкаСтрокТовары.МассаМеталла;
				
				Если НЕ Выбывшие И ДатаВыкупа <> "" Тогда
					СтрокаТаблицы.Параметры.ДатаВыкупа = ДатаВыкупа;
					СтрокаТаблицы.Параметры.ПробаФакт  = "-";
					КоличествоФакт = 0; 
					ОбщаяМассаФакт = 0; 
					МассаМеталлаФакт = 0;
					//СтрокаТаблицы.Параметры.Отклонения = "Выкуплено " + Формат(ДатаВыкупа, "ДФ=dd.MM.yyyy");
				ИначеЕсли Выбывшие Тогда
					Если ТипЗнч(ДокументВыбытия) = Тип("ДокументСсылка.ЛБ_ОперацияПоЗалогу") Тогда
						Если ВыборкаСтрокТовары.ОперацияЗайма.НомерЗалоговогоБилета = ДокументВыбытия.НомерЗалоговогоБилета Тогда
							Если ДокументВыбытия.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ИзъятиеОбъектовЗалога Тогда
								СтрокаТаблицы.Параметры.Отклонения = "Изъятие. Залоговый билет № " + ДокументВыбытия.НомерЗалоговогоБилета;
							Иначе
								СтрокаТаблицы.Параметры.Отклонения = "Залоговый билет № " + ДокументВыбытия.НомерЗалоговогоБилета;
							КонецЕсли;
						Иначе
							Если ДокументВыбытия.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда
								СтрокаТаблицы.Параметры.Отклонения = "Переоформление. Залоговый билет № " + ДокументВыбытия.НомерЗалоговогоБилета;
							Иначе
								СтрокаТаблицы.Параметры.Отклонения = "Залоговый билет № " + ВыборкаСтрокТовары.ОперацияЗайма.НомерЗалоговогоБилета;
							КонецЕсли;
						КонецЕсли;
					ИначеЕсли ТипЗнч(ДокументВыбытия) = Тип("ДокументСсылка.ЛБ_ИзменениеСтатусаНакладной") Тогда
						СтрокаТаблицы.Параметры.Отклонения = "Накладная на отгрузку № " + ДокументВыбытия.НакладнаяНаОтгрузку.ПредставлениеНомераНакладной
						+ " от " + Формат(ДокументВыбытия.НакладнаяНаОтгрузку.Дата, "ДФ=dd.MM.yyyy");
					ИначеЕсли ТипЗнч(ДокументВыбытия) = Тип("ДокументСсылка.ЛБ_ПеремещениеОбъектовЗалога") Тогда
						СтрокаТаблицы.Параметры.Отклонения = "Накладная перемещения № " + ДокументВыбытия.ПредставлениеНомераПеремещения
						+ " от " + Формат(ДокументВыбытия.Дата, "ДФ=dd.MM.yyyy");
					ИначеЕсли ТипЗнч(ДокументВыбытия) = Тип("ДокументСсылка.ЛБ_Реализация") Тогда
						СтрокаТаблицы.Параметры.Отклонения = "Реализация № " + ДокументВыбытия.ПредставлениеНомера
						+ " от " + Формат(ДокументВыбытия.Дата, "ДФ=dd.MM.yyyy");
					КонецЕсли;
					
					СтрокаТаблицы.Параметры.ДатаВыкупа = ДокументВыбытия.Дата;
				КонецЕсли;
				
				СтрокаТаблицы.Параметры.КоличествоФакт   = КоличествоФакт; 
				СтрокаТаблицы.Параметры.ОбщаяМассаФакт   = ОбщаяМассаФакт; 
				СтрокаТаблицы.Параметры.МассаМеталлаФакт = МассаМеталлаФакт; 				
				
				//Проверяем влазиет ли строка с описание вставок на один лист
				СтрокаСПодвалом = Новый Массив;
				СтрокаСПодвалом.Добавить(СтрокаТаблицы);
				
				Если СтруктураВставки.Камни <> Неопределено Тогда
					Для Каждого СтрВ Из СтруктураВставки.Камни Цикл
						СтрокаВставки = Макет.ПолучитьОбласть("СтрокаВставки");
						
						СтрокаВставки.Параметры.Наименование = "- " + СокрЛП(СтрВ.ВидВставки) + " " + СокрЛП(СтрВ.ВидОгранки) + " " + СокрЛП(СтрВ.КачествоОгранки);
						
						СтрокаСПодвалом.Добавить(СтрокаВставки);
					КонецЦикла;
				КонецЕсли;
				
				Если СтруктураВставки.Металлы <> Неопределено Тогда
					Для Каждого СтрМ Из СтруктураВставки.Металлы Цикл
						СтрокаВставки = Макет.ПолучитьОбласть("СтрокаВставки");
						
						СтрокаВставки.Параметры.Наименование = "- " + СокрЛП(СтрМ.ВидВставки);
						СтрокаСПодвалом.Добавить(СтрокаВставки);
					КонецЦикла;
				КонецЕсли;
				//
				
				СтрокаСПодвалом.Добавить(ПодвалСтраницы);
				СтрокаСПодвалом.Добавить(ПодвалНомСтр);
				
				Если НЕ ТабДокумент.ПроверитьВывод(СтрокаСПодвалом) Тогда
					
					ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ПодвалСтраницы");
					ПараметрыОбласти = ОбластьИтоговПоСтранице.Параметры;
					
					ПараметрыОбласти.ИтогоКоличествоНакопительный   	= ИтогоКоличествоНакопительный;
					ПараметрыОбласти.ИтогоОбщаяМассаНакопительный   	= ИтогоОбщаяМассаНакопительный;
					ПараметрыОбласти.ИтогоМассаМеталлаНакопительный 	= ИтогоМассаМеталлаНакопительный;
					ПараметрыОбласти.ИтогоКоличествоФактНакопительный 	= ИтогоКоличествоФактНакопительный; 
					ПараметрыОбласти.ИтогоОбщаяМассаФактНакопительный 	= ИтогоОбщаяМассаФактНакопительный;
					ПараметрыОбласти.ИтогоМассаМеталлаФактНакопительный = ИтогоМассаМеталлаФактНакопительный;
					
					ТабДокумент.Вывести(ОбластьИтоговПоСтранице);
					
					//НомерСтраницы = НомерСтраницы + 1;
					ОбластьНомерСтраницы = Макет.ПолучитьОбласть("НомерСтраницы");
					//ОбластьНомерСтраницы.Параметры.НомерСтраницы = "Страница "+СокрЛП(НомерСтраницы);
					
					НомерСтраницы = НомерСтраницы + 1;
					
					ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					
					//				ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
					ТабДокумент.Вывести(ЗаголовокТаблицы);
				КонецЕсли;
				
				Если СтруктураВставки.Камни <> Неопределено ИЛИ СтруктураВставки.Металлы <> Неопределено Тогда
					СтрокаТаблицы.Области.Строка.ГраницаСнизу = ГраницаНет;
				КонецЕсли;
				
				СтрокаТаблицы.Параметры.Номер = Ном;
				ТабДокумент.Вывести(СтрокаТаблицы);
				
				КоличествоВставок = 0;
				
				Если СтруктураВставки.Камни <> Неопределено Тогда
					КоличествоВставок = СтруктураВставки.Камни.Количество();
				КонецЕсли;
				
				Если СтруктураВставки.Металлы <> Неопределено Тогда
					КоличествоВставок = КоличествоВставок + СтруктураВставки.Металлы.Количество();
				КонецЕсли;
				
				ПорядковыйНомерВставки = 1;
				
				Если СтруктураВставки.Камни <> Неопределено Тогда
					Для Каждого СтрВ Из СтруктураВставки.Камни Цикл
						СтрокаВставки = Макет.ПолучитьОбласть("СтрокаВставки");
						
						СтрокаВставки.Параметры.Заполнить(СтрВ);
						СтрокаВставки.Параметры.Наименование = "- " + СокрЛП(СтрВ.ВидВставки) + " " + СокрЛП(СтрВ.ВидОгранки) + " " + СокрЛП(СтрВ.КачествоОгранки);
						
						Если ПорядковыйНомерВставки <> КоличествоВставок Тогда
							СтрокаВставки.Области.СтрокаВставки.ГраницаСнизу = ГраницаНет;
						КонецЕсли;
						
						Если ДатаВыкупа <> "" Тогда
							СтрокаВставки.Параметры.КоличествоФакт = 0;
							СтрокаВставки.Параметры.ВидВставкиФакт = "-";
							СтрокаВставки.Параметры.ВесФакт = 0;
						КонецЕсли;
						
						ТабДокумент.Вывести(СтрокаВставки);
						
						ПорядковыйНомерВставки = ПорядковыйНомерВставки + 1;
					КонецЦикла;				
				КонецЕсли;
				
				Если СтруктураВставки.Металлы <> Неопределено Тогда
					Для Каждого СтрМ Из СтруктураВставки.Металлы Цикл
						СтрокаВставки = Макет.ПолучитьОбласть("СтрокаВставки");
						
						СтрокаВставки.Параметры.Заполнить(СтрМ);
						СтрокаВставки.Параметры.Наименование = "- " + СокрЛП(СтрМ.ВидВставки);
						
						Если ПорядковыйНомерВставки <> КоличествоВставок Тогда
							СтрокаВставки.Области.СтрокаВставки.ГраницаСнизу = ГраницаНет;
						КонецЕсли;
						
						Если ДатаВыкупа <> "" Тогда
							СтрокаВставки.Параметры.КоличествоФакт = 0;
							СтрокаВставки.Параметры.ВидВставкиФакт = "-";
							СтрокаВставки.Параметры.ВесФакт = 0;
						КонецЕсли;
						
						ТабДокумент.Вывести(СтрокаВставки);
						
						ПорядковыйНомерВставки = ПорядковыйНомерВставки + 1;
					КонецЦикла;				
				КонецЕсли;
				
				ИтогоКоличествоНакопительный   	= ИтогоКоличествоНакопительный + ВыборкаСтрокТовары.Количество;
				ИтогоОбщаяМассаНакопительный   	= ИтогоОбщаяМассаНакопительный + ВыборкаСтрокТовары.ОбщаяМасса;
				ИтогоМассаМеталлаНакопительный 	= ИтогоМассаМеталлаНакопительный + ВыборкаСтрокТовары.МассаМеталла;
				ИтогоКоличествоФактНакопительный 	= ИтогоКоличествоФактНакопительный + КоличествоФакт; 
				ИтогоОбщаяМассаФактНакопительный 	= ИтогоОбщаяМассаФактНакопительный + ОбщаяМассаФакт;
				ИтогоМассаМеталлаФактНакопительный = ИтогоМассаМеталлаФактНакопительный + МассаМеталлаФакт;
			КонецЦикла;
			
			ПодвалИтогов = Макет.ПолучитьОбласть("ПодвалОписи");
			ПодвалИтоговМОЛ = Макет.ПолучитьОбласть("ПодвалОписиМол");
			ПодвалНомСтр = Макет.ПолучитьОбласть("НомерСтраницы");
			
			ПодвалИтоговДокум = Новый Массив;
			ПодвалИтоговДокум.Добавить(ПодвалИтогов);
			ПодвалИтоговДокум.Добавить(ПодвалИтоговМОЛ);
			
			Молы = Шапка.Молы.Выбрать();
			Пока Молы.Следующий() Цикл 		
				ПодвалИтоговМОЛНаим = Макет.ПолучитьОбласть("СтрокаМол");		
				ПодвалИтоговМОЛНаим.Параметры.ДолжностьМОЛ            = Молы.ФИзлицо.Должность;
				ПодвалИтоговМОЛНаим.Параметры.ФИОМОЛ                  = Молы.ФИзлицо;
				ПодвалИтоговДокум.Добавить(ПодвалИтоговМОЛНаим);
			КонецЦикла;
			
			ПодвалИтоговДокум.Добавить(ПодвалНомСтр);
			
			Если НЕ ТабДокумент.ПроверитьВывод(ПодвалИтоговДокум) Тогда
				
				ОбластьНомерСтраницы = Макет.ПолучитьОбласть("НомерСтраницы");
				ПараметрыОбласти = ОбластьНомерСтраницы.Параметры;
				
				//ПараметрыОбласти.НомерСтраницы = "Страница "+СокрЛП(НомерСтраницы);
				
				ТабДокумент.Вывести(ОбластьНомерСтраницы);
				
				НомерСтраницы = НомерСтраницы + 1;
				
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				
				ТабДокумент.Вывести(ЗаголовокТаблицы);
			КонецЕсли;
			
			// Выводим итоги по последней странице
			ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ПодвалСтраницы");
			ПараметрыОбласти = ОбластьИтоговПоСтранице.Параметры;
			
			ПараметрыОбласти.ИтогоКоличествоНакопительный   	= ИтогоКоличествоНакопительный;
			ПараметрыОбласти.ИтогоОбщаяМассаНакопительный   	= ИтогоОбщаяМассаНакопительный;
			ПараметрыОбласти.ИтогоМассаМеталлаНакопительный 	= ИтогоМассаМеталлаНакопительный;
			ПараметрыОбласти.ИтогоКоличествоФактНакопительный 	= ИтогоКоличествоФактНакопительный; 
			ПараметрыОбласти.ИтогоОбщаяМассаФактНакопительный 	= ИтогоОбщаяМассаФактНакопительный;
			ПараметрыОбласти.ИтогоМассаМеталлаФактНакопительный = ИтогоМассаМеталлаФактНакопительный;  	
			
			ТабДокумент.Вывести(ОбластьИтоговПоСтранице);
			
			// Выводим подвал документа
			//ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ОбластьМакета = Макет.ПолучитьОбласть("ПодвалОписи");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			Инд = 1;
			Пока ЧленКомиссии.Следующий() Цикл
				Если Инд <= 4 Тогда
					Если ЧленКомиссии.Председатель Тогда
						ОбластьМакета.Параметры["ДолжностьПредседателя"] = ЧленКомиссии.ФизЛицо.Должность;
						ОбластьМакета.Параметры["ФИОПредседателя"] = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЧленКомиссии.ФизЛицо.Наименование);
						
						Если ЧленКомиссии.Дистанционно Тогда
							ОбластьМакета.Параметры["ФИОПредседателя"] = ОбластьМакета.Параметры["ФИОПредседателя"] + " (дистанционно)";
						КонецЕсли;
					Иначе
						Если Инд <> 1 Тогда //Времено. Исправить
							ОбластьМакета.Параметры["ДолжностьЧленаКомиссии" + Инд] = ЧленКомиссии.ФизЛицо.Должность;
							ОбластьМакета.Параметры["ФИОЧленаКомиссии" + Инд] = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЧленКомиссии.ФизЛицо.Наименование);
							
							Если ЧленКомиссии.Дистанционно Тогда
								ОбластьМакета.Параметры["ФИОЧленаКомиссии" + Инд] = ОбластьМакета.Параметры["ФИОЧленаКомиссии" + Инд] + " (дистанционно)";
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				Иначе
					ТабДокумент.Вывести(ОбластьМакета);
					
					ОбластьМакета = Макет.ПолучитьОбласть("ДопЧленКомиссии");
					ОбластьМакета.Параметры["ДолжностьЧленаКомиссии"] = ЧленКомиссии.ФизЛицо.Должность;
					ОбластьМакета.Параметры["ФИОЧленаКомиссии"] = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЧленКомиссии.ФизЛицо.Наименование);
				КонецЕсли;
				Инд = Инд + 1;
			КонецЦикла;
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ПодвалОписиМОЛ");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			ТабДокумент.Вывести(ОбластьМакета);  
			
			Молы = Шапка.Молы.Выбрать();
			Пока Молы.Следующий() Цикл 		
				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаМол");		
				ОбластьМакета.Параметры.ДолжностьМОЛ = Молы.Физлицо.Должность;
				ОбластьМакета.Параметры.ФИОМОЛ = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Молы.ФизЛицо.Наименование);
				ТабДокумент.Вывести(ОбластьМакета);			
			КонецЦикла;
			
			ОбластьНомерСтраницы = Макет.ПолучитьОбласть("НомерСтраницы");
			ПараметрыОбласти = ОбластьНомерСтраницы.Параметры;
			
			НомерСтраницы = НомерСтраницы;
			//ПараметрыОбласти.НомерСтраницы = "Страница "+СокрЛП(НомерСтраницы);
			
			ТабДокумент.Вывести(ОбластьНомерСтраницы);
			
			//Добавляем колонтитул
			Если ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард Тогда
				ТекСотрудник = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ПараметрыСеанса.ТекущийСотрудник.Наименование);
			Иначе
				ТекСотрудник = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Пользователи.ТекущийПользователь().Сотрудник.Наименование);
			КонецЕсли;
			
			Если Выбывшие Тогда
				НаимПечФормы = "Опись ценностей, выбывших во время инвентаризации";
			Иначе
				НаимПечФормы = "Опись ценностей, поступивших во время инвентаризации";
			КонецЕсли;
			
			//Т.к. при двусторонней печати левый и правый текст пемяются местами пришлось писать все в центр
			ТабДокумент.НижнийКолонтитул.НачальнаяСтраница = 1;
			ТабДокумент.НижнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
			ТабДокумент.НижнийКолонтитул.Шрифт = Новый Шрифт("Times New Roman", 7,, Истина);
			
			ТабДокумент.НижнийКолонтитул.ТекстВЦентре = "[&Дата] [&Время]" + " " + ТекСотрудник //Левый край
			+ "                                                                                                " //отступ
			+ НаимПечФормы + " № " + Шапка.НомерДокумента + " от " + Формат(Шапка.ДатаДокумента, "ДФ=dd.MM.yyyy") + " Ломбард № " + Шапка.Ломбард.НомерЛомбарда // Центр
			+ "                                                                                                " //отступ
			+ "Страница [&НомерСтраницы] из [&СтраницВсего]"; //Правый край
			
			ТабДокумент.НижнийКолонтитул.Выводить = Истина;
			//
			
			// В табличном документе зададим имя области, в которую был 
			// выведен объект. Нужно для возможности печати покомплектно.
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
			
		КонецЦикла;	//Шапки.Следующий()
	КонецЦикла;
	
	Возврат ТабДокумент;

КонецФункции

Функция ПечатьОписиВыбывших(МассивОбъектов, ОбъектыПечати, ВалютаРегламентированногоУчета)

	УстановитьПривилегированныйРежим(Истина);
	
	ВалютаПечати = ВалютаРегламентированногоУчета; 
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб			= Истина;
	ТабДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияТоваровНаСкладе_ОписьВыбывших";

	
	ПервыйДокумент = Истина;

	Для каждого Док из МассивОбъектов Цикл
		
		Шапка = ПолучитьВыборкуШапокБезТоваров(Док);
		
		Товары = ПолучитьВыбывшиеТовары(Док); 
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЛБ_Инвентаризация.ПФ_MXL_ОписьВыбывших");
		
		Пока Шапка.Следующий() Цикл
			
			Если Не ПервыйДокумент Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ПервыйДокумент = Ложь;
			// Запомним номер строки, с которой начали выводить текущий документ.
			НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
			
		ВыборкаСтрокТовары = Товары;
		ЧленКомиссии = Шапка.ИнвентаризационнаяКомиссия.Выбрать();

		//////////////////////////////////////////////////////////////////////
		// 1-я страница формы

		// Выводим шапку накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(Шапка);      
		ОбластьМакета.Параметры.ДатаПриказа  = Формат(Шапка.ДатаПриказа, "ДФ=dd.MM.yy");
		ОбластьМакета.Параметры.ДатаС  = Формат(Шапка.ДатаС, "ДФ=dd.MM.yy");
		ОбластьМакета.Параметры.ДатаПо = Формат(Шапка.ДатаПо, "ДФ=dd.MM.yy"); 
		ОбластьМакета.Параметры.ВремяОкончания = Шапка.ДатаПо;
		ОбластьМакета.Параметры.Ломбард = Шапка.Ломбард;
		
			
		ТабДокумент.Вывести(ОбластьМакета);
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();

		//////////////////////////////////////////////////////////////////////
		// 2-я страница формы

		ИтогФактКоличество = 0;
		ИтогФактСумма      = 0;
		ИтогФактСуммаВсего = 0;
		ИтогБухКоличество  = 0;
		ИтогБухСумма       = 0;

		КолвоСтрокПоСтранице = 0;
		КолвоПоСтранице      = 0;
		СуммаЛиста           = 0;
		ИтогоКолво           = 0; 
		
		ИтогоОстатокЗаймаСтраница 	= 0;
		ИтогоКоличествоСтраница   	= 0;
		ИтогоОбщаяМассаСтраница   	= 0;
		ИтогоМассаМеталлаСтраница 	= 0;
		ИтогоОценкаСтраница		 	= 0;
		ИтогоКоличествоФактСтраница = 0; 
		ИтогоОбщаяМассаФактСтраница	= 0;
		ИтогоМассаМеталлаФактСтраница = 0;
		ИтогоОценкаФактСтраница		= 0;
		
		ИтогоОстатокЗаймаНакопительный 	= 0;
		ИтогоКоличествоНакопительный   	= 0;
		ИтогоОбщаяМассаНакопительный   	= 0;
		ИтогоМассаМеталлаНакопительный 	= 0;
		ИтогоОценкаНакопительный		= 0;
		ИтогоКоличествоФактНакопительный = 0; 
		ИтогоОбщаяМассаФактНакопительный = 0;
		ИтогоМассаМеталлаФактНакопительный = 0;
		ИтогоОценкаФактНакопительный	= 0;
		
		НомерСтраницы = 1;
	    Ном = 0;

		// Выводим заголовок таблицы
		ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
//		ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
		ТабДокумент.Вывести(ЗаголовокТаблицы);

		// Выводим многострочную часть документа
		ПодвалСтраницы  = Макет.ПолучитьОбласть("ПодвалСтраницы");	
			
		Пока ВыборкаСтрокТовары.Следующий() Цикл 
			//ДатаВыкупа = "";
			//Если ВыборкаСтрокТовары.КоличествоРасход > 0 Тогда
			//	ДатаВыкупа = ВернутьДатуВыкупаИзделия(ВыборкаСтрокТовары.ОбъектЗалога);
			//КонецЕсли;
				
			Ном = Ном + 1;
			СтрокаТаблицы   = Макет.ПолучитьОбласть("Строка");
			СтрокаТаблицы.Параметры.Заполнить(ВыборкаСтрокТовары); 
			СтрокаТаблицы.Параметры.Наименование = СокрЛП(ВыборкаСтрокТовары.ВидИзделия) + " ["+СокрЛП(ВыборкаСтрокТовары.Категория)+"]";
			СтрокаТаблицы.Параметры.Отклонения = ?(ВыборкаСтрокТовары.Отклонения = "", "" + ВыборкаСтрокТовары.Комментарий,
				"" + ВыборкаСтрокТовары.Отклонения + Символы.ПС + ВыборкаСтрокТовары.Комментарий);
			
			КоличествоФакт = ВыборкаСтрокТовары.Количество;
			ОбщаяМассаФакт = ВыборкаСтрокТовары.ОбщаяМасса; 
			МассаМеталлаФакт = ВыборкаСтрокТовары.МассаМеталла;

			//Если ДатаВыкупа <> "" Тогда
			//	СтрокаТаблицы.Параметры.ДатаВыкупа = Формат(ДатаВыкупа, "ДФ=dd.MM.yy"); 
			//	СтрокаТаблицы.Параметры.ПробаФакт  = "-";
			//	КоличествоФакт = 0; 
			//	ОбщаяМассаФакт = 0; 
			//	МассаМеталлаФакт = 0;
			//КонецЕсли;
			
			СтрокаТаблицы.Параметры.КоличествоФакт   = КоличествоФакт; 
			СтрокаТаблицы.Параметры.ОбщаяМассаФакт   = ОбщаяМассаФакт; 
			СтрокаТаблицы.Параметры.МассаМеталлаФакт = МассаМеталлаФакт; 				
			
			СтрокаСПодвалом = Новый Массив;
			СтрокаСПодвалом.Добавить(СтрокаТаблицы);
			СтрокаСПодвалом.Добавить(ПодвалСтраницы);
			
			Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, СтрокаСПодвалом) Тогда

				ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ПодвалСтраницы");
				ПараметрыОбласти = ОбластьИтоговПоСтранице.Параметры;

				//ПараметрыОбласти.ИтогоФактКоличество = ИтогФактКоличество;
				//ПараметрыОбласти.ИтогоФактСумма      = ИтогФактСумма;
				//ПараметрыОбласти.ИтогоБухКоличество  = ИтогБухКоличество;
				//ПараметрыОбласти.ИтогоБухСумма       = ИтогБухСумма;

				//ПараметрыОбласти.КоличествоПорядковыхНомеровНаСтраницеПрописью     = ЧислоПрописью(КолвоСтрокПоСтранице, ,",,,,,,,,0");
				//ПараметрыОбласти.ОбщееКоличествоЕдиницФактическиНаСтраницеПрописью = ЧислоПрописью(ИтогоКоличествоФактСтраница, ,",,,,,,,,0");
				
				
//				ПараметрыОбласти.ИтогоКоличествоСтраница   		= ИтогоКоличествоСтраница;
				//ПараметрыОбласти.ИтогоОбщаяМассаСтраница   		= ИтогоОбщаяМассаСтраница;
				//ПараметрыОбласти.ИтогоМассаМеталлаСтраница 		= ИтогоМассаМеталлаСтраница;
				//ПараметрыОбласти.ИтогоОценкаСтраница		 	= ИтогоОценкаСтраница;
				//ПараметрыОбласти.ИтогоКоличествоФактСтраница 	= ИтогоКоличествоФактСтраница; 
				//ПараметрыОбласти.ИтогоОбщаяМассаФактСтраница	= ИтогоОбщаяМассаФактСтраница;
				//ПараметрыОбласти.ИтогоМассаМеталлаФактСтраница 	= ИтогоМассаМеталлаФактСтраница;
				//ПараметрыОбласти.ИтогоОценкаФактСтраница		= ИтогоОценкаФактСтраница; 
				
				//ПараметрыОбласти.ИтогоОстатокЗаймаНакопительный 	= ИтогоОстатокЗаймаНакопительный;
				ПараметрыОбласти.ИтогоКоличествоНакопительный   	= ИтогоКоличествоНакопительный;
				ПараметрыОбласти.ИтогоОбщаяМассаНакопительный   	= ИтогоОбщаяМассаНакопительный;
				ПараметрыОбласти.ИтогоМассаМеталлаНакопительный 	= ИтогоМассаМеталлаНакопительный;
				//ПараметрыОбласти.ИтогоОценкаНакопительный			= ИтогоОценкаНакопительный;
				ПараметрыОбласти.ИтогоКоличествоФактНакопительный 	= ИтогоКоличествоФактНакопительный; 
				ПараметрыОбласти.ИтогоОбщаяМассаФактНакопительный 	= ИтогоОбщаяМассаФактНакопительный;
				ПараметрыОбласти.ИтогоМассаМеталлаФактНакопительный = ИтогоМассаМеталлаФактНакопительный;
				//ПараметрыОбласти.ИтогоОценкаФактНакопительный		= ИтогоОценкаФактНакопительный;
				
				НомерСтраницы = НомерСтраницы + 1;
				ПараметрыОбласти.НомерСтраницы = "Страница "+СокрЛП(НомерСтраницы);
				
				
				
				ТабДокумент.Вывести(ОбластьИтоговПоСтранице);
				
				//НомерСтраницы = НомерСтраницы + 1;
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();

//				ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
				ТабДокумент.Вывести(ЗаголовокТаблицы);

				ИтогФактКоличество = 0;
				ИтогФактСумма      = 0;
				ИтогБухКоличество  = 0;
				ИтогБухСумма       = 0;

				КолвоСтрокПоСтранице = 0;
				КолвоПоСтранице      = 0;
				СуммаЛиста           = 0;
				
				ИтогоОстатокЗаймаСтраница 	= 0;
				ИтогоКоличествоСтраница   	= 0;
				ИтогоОбщаяМассаСтраница   	= 0;
				ИтогоМассаМеталлаСтраница 	= 0;
				ИтогоОценкаСтраница		 	= 0;
				ИтогоКоличествоФактСтраница = 0; 
				ИтогоОбщаяМассаФактСтраница	= 0;
				ИтогоМассаМеталлаФактСтраница = 0;
				ИтогоОценкаФактСтраница		= 0;
			КонецЕсли;

			СтрокаТаблицы.Параметры.Номер = Ном;
			ТабДокумент.Вывести(СтрокаТаблицы);


			КолвоСтрокПоСтранице = КолвоСтрокПоСтранице + 1;
			КолвоПоСтранице      = КолвоПоСтранице      + КоличествоФакт;
			//СуммаЛиста           = СуммаЛиста           + ВыборкаСтрокТовары.Сумма; 
			
//			ИтогоОстатокЗаймаСтраница 	= ИтогоОстатокЗаймаСтраница + ВыборкаСтрокТовары.ОстатокЗайма;
			ИтогоКоличествоСтраница   	= ИтогоКоличествоСтраница + ВыборкаСтрокТовары.Количество;
			ИтогоОбщаяМассаСтраница   	= ИтогоОбщаяМассаСтраница + ВыборкаСтрокТовары.ОбщаяМасса;
			ИтогоМассаМеталлаСтраница 	= ИтогоМассаМеталлаСтраница + ВыборкаСтрокТовары.МассаМеталла;
//			ИтогоОценкаСтраница		 	= ИтогоОценкаСтраница + ВыборкаСтрокТовары.Оценка;
			ИтогоКоличествоФактСтраница = ИтогоКоличествоФактСтраница + КоличествоФакт; 
			ИтогоОбщаяМассаФактСтраница	= ИтогоОбщаяМассаФактСтраница + ОбщаяМассаФакт;
			ИтогоМассаМеталлаФактСтраница = ИтогоМассаМеталлаФактСтраница + МассаМеталлаФакт;
//			ИтогоОценкаФактСтраница		= ИтогоОценкаФактСтраница + ВыборкаСтрокТовары.ОценкаФакт;
			
			ИтогоКоличествоНакопительный   	= ИтогоКоличествоНакопительный + ВыборкаСтрокТовары.Количество;
			ИтогоОбщаяМассаНакопительный   	= ИтогоОбщаяМассаНакопительный + ВыборкаСтрокТовары.ОбщаяМасса;
			ИтогоМассаМеталлаНакопительный 	= ИтогоМассаМеталлаНакопительный + ВыборкаСтрокТовары.МассаМеталла;
			//ИтогоОценкаНакопительный			= ИтогоОценкаНакопительный + ВыборкаСтрокТовары.Оценка;
			ИтогоКоличествоФактНакопительный 	= ИтогоКоличествоФактНакопительный + ВыборкаСтрокТовары.КоличествоФакт; 
			ИтогоОбщаяМассаФактНакопительный 	= ИтогоОбщаяМассаФактНакопительный + ВыборкаСтрокТовары.ОбщаяМассаФакт;
			ИтогоМассаМеталлаФактНакопительный = ИтогоМассаМеталлаФактНакопительный + ВыборкаСтрокТовары.МассаМеталлаФакт;
			//ИтогоОценкаФактНакопительный		= ИтогоОценкаФактНакопительный + ВыборкаСтрокТовары.ОценкаФакт;
		КонецЦикла;

		// Выводим итоги по последней странице
		ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ПодвалСтраницы");
		ПараметрыОбласти = ОбластьИтоговПоСтранице.Параметры; 
		
		ПараметрыОбласти.ИтогоКоличествоНакопительный   	= ИтогоКоличествоНакопительный;
		ПараметрыОбласти.ИтогоОбщаяМассаНакопительный   	= ИтогоОбщаяМассаНакопительный;
		ПараметрыОбласти.ИтогоМассаМеталлаНакопительный 	= ИтогоМассаМеталлаНакопительный;
		//ПараметрыОбласти.ИтогоОценкаНакопительный			= ИтогоОценкаНакопительный;
		ПараметрыОбласти.ИтогоКоличествоФактНакопительный 	= ИтогоКоличествоФактНакопительный; 
		ПараметрыОбласти.ИтогоОбщаяМассаФактНакопительный 	= ИтогоОбщаяМассаФактНакопительный;
		ПараметрыОбласти.ИтогоМассаМеталлаФактНакопительный = ИтогоМассаМеталлаФактНакопительный;
		
//		ПараметрыОбласти.ИтогоФактКоличество  = ИтогФактКоличество;
//		ПараметрыОбласти.ИтогоФактСумма       = ИтогФактСумма;
//		ПараметрыОбласти.ИтогоБухКоличество   = ИтогБухКоличество;
//		ПараметрыОбласти.ИтогоБухСумма        = ИтогБухСумма;
//		ПараметрыОбласти.КоличествоПорядковыхНомеровНаСтраницеПрописью     = ЧислоПрописью(КолвоСтрокПоСтранице, ,",,,,,,,,0");
//		ПараметрыОбласти.ОбщееКоличествоЕдиницФактическиНаСтраницеПрописью = ОбщегоНазначенияБПВызовСервера.КоличествоПрописью(КолвоПоСтранице);
//		ПараметрыОбласти.СуммаФактическиНаСтраницеПрописью                 = ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(СуммаЛиста, ВалютаПечати);
		ТабДокумент.Вывести(ОбластьИтоговПоСтранице);

		// Выводим подвал документа
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		ОбластьМакета = Макет.ПолучитьОбласть("ПодвалОписи");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		
		Инд = 1;
		Пока ЧленКомиссии.Следующий() Цикл
			Если Инд <= 4 Тогда
				Если ЧленКомиссии.Председатель Тогда
					ОбластьМакета.Параметры["ДолжностьПредседателя"] = ЧленКомиссии.ФизЛицо.Должность;
					ОбластьМакета.Параметры["ФИОПредседателя"] = ЧленКомиссии.ФизЛицо;
					
					Если ЧленКомиссии.Дистанционно Тогда
						ОбластьМакета.Параметры["ФИОПредседателя"] = ОбластьМакета.Параметры["ФИОПредседателя"] + " (дистанционно)";
					КонецЕсли;
				Иначе
					Если Инд <> 1 Тогда //Времено. Исправить
						ОбластьМакета.Параметры["ДолжностьЧленаКомиссии" + Инд] = ЧленКомиссии.ФизЛицо.Должность;
						ОбластьМакета.Параметры["ФИОЧленаКомиссии" + Инд] = ЧленКомиссии.ФизЛицо;
						
						Если ЧленКомиссии.Дистанционно Тогда
							ОбластьМакета.Параметры["ФИОЧленаКомиссии" + Инд] = ОбластьМакета.Параметры["ФИОЧленаКомиссии" + Инд] + " (дистанционно)";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;		
			Иначе
				ТабДокумент.Вывести(ОбластьМакета);
				
				ОбластьМакета = Макет.ПолучитьОбласть("ДопЧленКомиссии");
		       	ОбластьМакета.Параметры["ДолжностьЧленаКомиссии"] = ЧленКомиссии.ФизЛицо.Должность;
				ОбластьМакета.Параметры["ФИОЧленаКомиссии"] = ЧленКомиссии.ФизЛицо;
			КонецЕсли;
			Инд = Инд + 1;
		КонецЦикла;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ПодвалОписиМОЛ");
		ОбластьМакета.Параметры.Заполнить(Шапка);
//		ОбластьМакета.Параметры.НачальныйНомерПоПорядку = 1;
//		ОбластьМакета.Параметры.НомерКонца              = ВыборкаСтрокТовары.Количество();
		
		ТабДокумент.Вывести(ОбластьМакета);  
		
		
		Молы         = Шапка.Молы.Выбрать();
		Пока Молы.Следующий() Цикл 		
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаМол");		
			ОбластьМакета.Параметры.ДолжностьМОЛ            = Молы.Физлицо.Должность;
			ОбластьМакета.Параметры.ФИОМОЛ                  = Молы.ФИзлицо;
			ТабДокумент.Вывести(ОбластьМакета);			
		КонецЦикла;
		  	
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);

		КонецЦикла;	//Шапки.Следующий()
		КонецЦикла;

	Возврат ТабДокумент;

КонецФункции

Функция ПечатьАктаПроверки(МассивОбъектов, ОбъектыПечати, ВалютаРегламентированногоУчета)

	УстановитьПривилегированныйРежим(Истина);
	
	ВалютаПечати = ВалютаРегламентированногоУчета;  
	
	Шапка = ПолучитьВыборкуШапок_АктПроверки(МассивОбъектов);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб			= Истина;
	ТабДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияТоваровНаСкладе_АктПроверки";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЛБ_Инвентаризация.ПФ_MXL_АктПроверки");
	ПервыйДокумент = Истина;

	ГраницаНет = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
	
	Пока Шапка.Следующий() Цикл
	
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		ВыборкаСтрокТовары = ПолучитьСтрокиДокумента_АктПроверки(МассивОбъектов);
		ЧленКомиссии = Шапка.ИнвентаризационнаяКомиссия.Выбрать(); 
          	
		//////////////////////////////////////////////////////////////////////
		// 1-я страница формы

		// Выводим шапку накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(Шапка); 	
		
		ОбластьМакета.Параметры.ДатаДокумента            = Формат(Шапка.Дата, "ДФ=dd.MM.yyyy");
		ОбластьМакета.Параметры.НомерДокумента           = Шапка.Номер; //ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Шапка.Номер, Истина, Ложь);
		ОбластьМакета.Параметры.Подразделение = Шапка.Ломбард.НомерЛомбарда;
		ОбластьМакета.Параметры.Город = ПолучитьГород(Шапка.Ломбард);
		ОбластьМакета.Параметры.Отделение = ПолучитьОтделение(Шапка.Дата, Шапка.Ломбард);
			
		ТабДокумент.Вывести(ОбластьМакета); 
		
		Молы         = Шапка.Молы.Выбрать();
		Пока Молы.Следующий() Цикл 		
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаМол");		
			ОбластьМакета.Параметры.ДолжностьМОЛ            = Молы.ФИзлицо.Должность;
			ОбластьМакета.Параметры.ФИОМОЛ                  = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Молы.ФизЛицо.Наименование);
			ТабДокумент.Вывести(ОбластьМакета);			
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаПодвал");
		//ОбластьМакета.Параметры.Заполнить(Шапка);
		ОбластьМакета.Параметры.ДатаДокумента = Формат(Шапка.Дата, "ДЛФ=DD");
		ОбластьМакета.Параметры.ВидИнвентаризации = НРег(Шапка.ВидИнвентаризации);
		ТабДокумент.Вывести(ОбластьМакета);		
		
		//ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();

		//////////////////////////////////////////////////////////////////////
		// 2-я страница формы

		ИтогФактКоличество = 0;
		ИтогФактСумма      = 0;
		ИтогФактСуммаВсего = 0;
		ИтогБухКоличество  = 0;
		ИтогБухСумма       = 0;

		КолвоСтрокПоСтранице = 0;
		КолвоПоСтранице      = 0;
		СуммаЛиста           = 0;
		ИтогоКолво           = 0; 
		
		ИтогоОстатокЗаймаНакопительный 	= 0;
		ИтогоКоличествоНакопительный   	= 0;
		ИтогоОбщаяМассаНакопительный   	= 0;
		ИтогоМассаМеталлаНакопительный 	= 0;
		ИтогоКоличествоФактНакопительный = 0; 
		ИтогоОбщаяМассаФактНакопительный = 0;
		ИтогоМассаМеталлаФактНакопительный = 0;
		
		НомерСтраницы = 1;
	    Ном = 0;

		// Выводим заголовок таблицы
		ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
//		ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
		ТабДокумент.Вывести(ЗаголовокТаблицы);

		// Выводим многострочную часть документа
		ПодвалНомСтр = Макет.ПолучитьОбласть("НомерСтраницы");

		Пока ВыборкаСтрокТовары.Следующий() Цикл 

			Ном = Ном + 1;
			СтрокаТаблицы   = Макет.ПолучитьОбласть("Строка");
			СтрокаТаблицы.Параметры.Заполнить(ВыборкаСтрокТовары);
			СтрокаТаблицы.Параметры.Залогодатель = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаСтрокТовары.Залогодатель.Наименование);
			//СтрокаТаблицы.Параметры.Приемщик = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаСтрокТовары.Приемщик.Сотрудник.Наименование);
			СтрокаТаблицы.Параметры.Приемщик = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаСтрокТовары.Приемщик.Наименование);
			СтрокаТаблицы.Параметры.Отклонения = ?(ВыборкаСтрокТовары.Отклонения = "", "" + ВыборкаСтрокТовары.Комментарий,
				"" + ВыборкаСтрокТовары.Отклонения + Символы.ПС + ВыборкаСтрокТовары.Комментарий);
			
			ОписаниеОЗ = ПолучитьОписаниеОЗ(НачалоДня(Шапка.Дата), ВыборкаСтрокТовары.ОбъектЗалога);
			ИнформацияИменника = ?(ВыборкаСтрокТовары.Именник = Перечисления.ЛБ_Именник.Нет, "", ВыборкаСтрокТовары.ДанныеИменника);
			ИнформацияДефекты = ?(ВыборкаСтрокТовары.Дефекты = "", "", ", " + ВыборкаСтрокТовары.Дефекты);
			ИнформацияОписаниеОЗ = ?(ОписаниеОЗ = "", "", ", " + ОписаниеОЗ);
			
			Описание = ?(ИнформацияИменника = "", "" + ВыборкаСтрокТовары.СостояниеИзделия, "" +  ИнформацияИменника + ", " + ВыборкаСтрокТовары.СостояниеИзделия);
			Описание = ?(ИнформацияДефекты = "", "" +  Описание + ИнформацияОписаниеОЗ, "" +  Описание + ИнформацияДефекты + ИнформацияОписаниеОЗ);
			
			СтрокаТаблицы.Параметры.ОписаниеОЗ = Описание;

			СтруктураВставки = ПолучитьВставкиДокумента_АктПроверки(ВыборкаСтрокТовары.ОбъектЗалога, Шапка.Ссылка);
						
			СтрокаСПодвалом = Новый Массив;
			СтрокаСПодвалом.Добавить(СтрокаТаблицы);

			//Проверяем влазиет ли строка с описание вставок на один лист
			Если СтруктураВставки.Камни <> Неопределено Тогда
				Для Каждого СтрВ Из СтруктураВставки.Камни Цикл
					СтрокаВставки = Макет.ПолучитьОбласть("СтрокаВставки");
					
					СтрокаВставки.Параметры.Наименование = "- " + СокрЛП(СтрВ.ВидВставки) + " " + СокрЛП(СтрВ.ВидОгранки) + " " + СокрЛП(СтрВ.КачествоОгранки);
					
					СтрокаСПодвалом.Добавить(СтрокаВставки);
				КонецЦикла;
			КонецЕсли;
			
			Если СтруктураВставки.Металлы <> Неопределено Тогда
				Для Каждого СтрМ Из СтруктураВставки.Металлы Цикл
					СтрокаВставки = Макет.ПолучитьОбласть("СтрокаВставки");
					
					СтрокаВставки.Параметры.Наименование = "- " + СокрЛП(СтрМ.Проба);
					СтрокаСПодвалом.Добавить(СтрокаВставки);
				КонецЦикла;
			КонецЕсли;
			//

			СтрокаСПодвалом.Добавить(ПодвалНомСтр);
			
			Если НЕ ТабДокумент.ПроверитьВывод(СтрокаСПодвалом) Тогда

				ОбластьНомерСтраницы = Макет.ПолучитьОбласть("НомерСтраницы");
				ПараметрыОбласти = ОбластьНомерСтраницы.Параметры;

				//ПараметрыОбласти.НомерСтраницы = "Страница "+СокрЛП(НомерСтраницы);
				
				ТабДокумент.Вывести(ОбластьНомерСтраницы);

				НомерСтраницы = НомерСтраницы + 1;
				
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();

				ТабДокумент.Вывести(ЗаголовокТаблицы);
			КонецЕсли;

			Если СтруктураВставки.Камни <> Неопределено ИЛИ СтруктураВставки.Металлы <> Неопределено Тогда
				СтрокаТаблицы.Области.Строка.ГраницаСнизу = ГраницаНет;
			КонецЕсли;
			
			СтрокаТаблицы.Параметры.Номер = Ном;
			ТабДокумент.Вывести(СтрокаТаблицы);


			КоличествоВставок = 0;

			Если СтруктураВставки.Камни <> Неопределено Тогда
				КоличествоВставок = СтруктураВставки.Камни.Количество();
			КонецЕсли;
			
			Если СтруктураВставки.Металлы <> Неопределено Тогда
				КоличествоВставок = КоличествоВставок + СтруктураВставки.Металлы.Количество();
			КонецЕсли;
			
			ПорядковыйНомерВставки = 1;
			
			Если СтруктураВставки.Камни <> Неопределено Тогда
				Для Каждого СтрВ Из СтруктураВставки.Камни Цикл
					СтрокаВставки = Макет.ПолучитьОбласть("СтрокаВставки");
					
					СтрокаВставки.Параметры.Заполнить(СтрВ);
					СтрокаВставки.Параметры.Наименование = "- " + СокрЛП(СтрВ.ВидВставки) + " " + СокрЛП(СтрВ.ВидОгранки) + " " + СокрЛП(СтрВ.КачествоОгранки);
					
					Если ПорядковыйНомерВставки <> КоличествоВставок Тогда
						СтрокаВставки.Области.СтрокаВставки.ГраницаСнизу = ГраницаНет;
					КонецЕсли;

					ТабДокумент.Вывести(СтрокаВставки);
					
					ПорядковыйНомерВставки = ПорядковыйНомерВставки + 1;
				КонецЦикла;				
			КонецЕсли;

			Если СтруктураВставки.Металлы <> Неопределено Тогда
				Для Каждого СтрМ Из СтруктураВставки.Металлы Цикл
					СтрокаВставки = Макет.ПолучитьОбласть("СтрокаВставки");
					
					СтрокаВставки.Параметры.Заполнить(СтрМ);
					СтрокаВставки.Параметры.Наименование = "- " + СокрЛП(СтрМ.Проба);
					
					Если ПорядковыйНомерВставки <> КоличествоВставок Тогда
						СтрокаВставки.Области.СтрокаВставки.ГраницаСнизу = ГраницаНет;
					КонецЕсли;

					ТабДокумент.Вывести(СтрокаВставки);

					ПорядковыйНомерВставки = ПорядковыйНомерВставки + 1;
				КонецЦикла;				
			КонецЕсли;
			
			КолвоСтрокПоСтранице = КолвоСтрокПоСтранице + 1;
			КолвоПоСтранице      = КолвоПоСтранице      + ВыборкаСтрокТовары.КоличествоФакт;
			
			ИтогоОстатокЗаймаНакопительный = ИтогоОстатокЗаймаНакопительный + ВыборкаСтрокТовары.ОстатокЗайма;
			ИтогоКоличествоНакопительный   	= ИтогоКоличествоНакопительный + ВыборкаСтрокТовары.Количество;
			ИтогоОбщаяМассаНакопительный   	= ИтогоОбщаяМассаНакопительный + ВыборкаСтрокТовары.ОбщаяМасса;
			ИтогоМассаМеталлаНакопительный 	= ИтогоМассаМеталлаНакопительный + ВыборкаСтрокТовары.МассаМеталла;
			ИтогоКоличествоФактНакопительный 	= ИтогоКоличествоФактНакопительный + ВыборкаСтрокТовары.КоличествоФакт; 
			ИтогоОбщаяМассаФактНакопительный 	= ИтогоОбщаяМассаФактНакопительный + ВыборкаСтрокТовары.ОбщаяМассаФакт;
			ИтогоМассаМеталлаФактНакопительный = ИтогоМассаМеталлаФактНакопительный + ВыборкаСтрокТовары.МассаМеталлаФакт;
		КонецЦикла;

 		ПодвалИтогов = Макет.ПолучитьОбласть("ПодвалОписи");
		ПодвалИтоговМОЛ = Макет.ПолучитьОбласть("ПодвалОписиМол");
		ПодвалНомСтр = Макет.ПолучитьОбласть("НомерСтраницы");
		ПодвалИтоги = Макет.ПолучитьОбласть("ПодвалИтоги");
		ПодвалИтогиСтрока = Макет.ПолучитьОбласть("ПодвалСтрока");

		ПодвалИтоговДокум = Новый Массив;
		ПодвалИтоговДокум.Добавить(ПодвалИтогов);
		ПодвалИтоговДокум.Добавить(ПодвалИтоговМОЛ);
		
		Молы = Шапка.Молы.Выбрать();
		Пока Молы.Следующий() Цикл 		
			ПодвалИтоговМОЛНаим = Макет.ПолучитьОбласть("СтрокаМол");		
			ПодвалИтоговМОЛНаим.Параметры.ДолжностьМОЛ            = Молы.ФИзлицо.Должность;
			ПодвалИтоговМОЛНаим.Параметры.ФИОМОЛ                  = Молы.ФИзлицо;
			ПодвалИтоговДокум.Добавить(ПодвалИтоговМОЛНаим);
		КонецЦикла;
		
		ПодвалИтоговДокум.Добавить(ПодвалНомСтр);
		
		Если НЕ ТабДокумент.ПроверитьВывод(ПодвалИтоговДокум) Тогда
			
			ОбластьНомерСтраницы = Макет.ПолучитьОбласть("НомерСтраницы");
			ПараметрыОбласти = ОбластьНомерСтраницы.Параметры;
			
			//ПараметрыОбласти.НомерСтраницы = "Страница "+СокрЛП(НомерСтраницы);
			
			ТабДокумент.Вывести(ОбластьНомерСтраницы);
			
			НомерСтраницы = НомерСтраницы + 1;
			
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			ТабДокумент.Вывести(ЗаголовокТаблицы);
		КонецЕсли;

		// Выводим подвал документа
		ОбластьПодвалИтоги = Макет.ПолучитьОбласть("ПодвалИтоги");
		ОбластьПодвалИтоги.Параметры.ИтогоОстатокЗаймаНакопительный = ИтогоОстатокЗаймаНакопительный;
		ОбластьПодвалИтоги.Параметры.ИтогоКоличествоНакопительный = ИтогоКоличествоНакопительный;
		ОбластьПодвалИтоги.Параметры.ИтогоКоличествоФактНакопительный = ИтогоКоличествоФактНакопительный;
		ОбластьПодвалИтоги.Параметры.ИтогоОбщаяМассаНакопительный = ИтогоОбщаяМассаНакопительный;
		ОбластьПодвалИтоги.Параметры.ИтогоОбщаяМассаФактНакопительный = ИтогоОбщаяМассаФактНакопительный;
		ОбластьПодвалИтоги.Параметры.ИтогоМассаМеталлаНакопительный = ИтогоМассаМеталлаНакопительный;
		ОбластьПодвалИтоги.Параметры.ИтогоМассаМеталлаФактНакопительный = ИтогоМассаМеталлаФактНакопительный;
		
		ТабДокумент.Вывести(ОбластьПодвалИтоги);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ПодвалОписи");
		ОбластьМакета.Параметры.Заполнить(Шапка);  
		
		ОбластьМакета.Параметры.ОбщееКоличествоЕдиницФактическиНаСтраницеПрописью = ЧислоПрописью(ИтогоКоличествоФактНакопительный, ,",,,ж,,,,,0");		
		ОбластьМакета.Параметры.КоличествоПорядковыхНомеровНаСтраницеПрописью     = ЧислоПрописью(Ном, ,",,,,,,,,0");
		ФорматСтроки = "L=ru_RU";
		ПараметрыСтроки = "целая, целых, целых, ж, сотая, сотых, сотых, ж, 2";
		ОбластьМакета.Параметры.ИтогоМассаМеталлаФактНакопительный = ЧислоПрописью(ИтогоМассаМеталлаФактНакопительный, ФорматСтроки, ПараметрыСтроки);
		ОбластьМакета.Параметры.ИтогоОбщаяМассаФактНакопительный = ЧислоПрописью(ИтогоОбщаяМассаФактНакопительный, ФорматСтроки, ПараметрыСтроки);
		ОбластьМакета.Параметры.НачальныйНомерПоПорядку = 1;
		ОбластьМакета.Параметры.НомерКонца              = Ном;
		
		Инд = 1;
		Пока ЧленКомиссии.Следующий() Цикл
			Если Инд <= 4 Тогда
				Если ЧленКомиссии.Председатель Тогда
					ОбластьМакета.Параметры["ДолжностьПредседателя"] = ЧленКомиссии.ФизЛицо.Должность;
					ОбластьМакета.Параметры["ФИОПредседателя"] = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЧленКомиссии.ФизЛицо.Наименование);
					
					Если ЧленКомиссии.Дистанционно Тогда
						ОбластьМакета.Параметры["ФИОПредседателя"] = ОбластьМакета.Параметры["ФИОПредседателя"] + " (дистанционно)";
					КонецЕсли;
				Иначе
					Если Инд <> 1 Тогда //Времено. Исправить
						ОбластьМакета.Параметры["ДолжностьЧленаКомиссии" + Инд] = ЧленКомиссии.ФизЛицо.Должность;
						ОбластьМакета.Параметры["ФИОЧленаКомиссии" + Инд] = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЧленКомиссии.ФизЛицо.Наименование);
						
						Если ЧленКомиссии.Дистанционно Тогда
							ОбластьМакета.Параметры["ФИОЧленаКомиссии" + Инд] = ОбластьМакета.Параметры["ФИОЧленаКомиссии" + Инд] + " (дистанционно)";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;		
			Иначе
				ТабДокумент.Вывести(ОбластьМакета);
				
				ОбластьМакета = Макет.ПолучитьОбласть("ДопЧленКомиссии");
		       	ОбластьМакета.Параметры["ДолжностьЧленаКомиссии"] = ЧленКомиссии.ФизЛицо.Должность;
				ОбластьМакета.Параметры["ФИОЧленаКомиссии"] = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЧленКомиссии.ФизЛицо.Наименование);
			КонецЕсли;
			Инд = Инд + 1;
		КонецЦикла;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		ПодвалИтогиСтрока = Макет.ПолучитьОбласть("ПодвалСтрока");
		ТабДокумент.Вывести(ПодвалИтогиСтрока);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ПодвалОписиМОЛ");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		
		Молы         = Шапка.Молы.Выбрать();
		Пока Молы.Следующий() Цикл 		
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаМол");		
			ОбластьМакета.Параметры.ДолжностьМОЛ            = Молы.Физлицо.Должность;
			ОбластьМакета.Параметры.ФИОМОЛ                  = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Молы.ФизЛицо.Наименование);
			ТабДокумент.Вывести(ОбластьМакета);			
		КонецЦикла;
		
		ОбластьНомерСтраницы = Макет.ПолучитьОбласть("НомерСтраницы");
		ПараметрыОбласти = ОбластьНомерСтраницы.Параметры;
		
		НомерСтраницы = НомерСтраницы;
		//ПараметрыОбласти.НомерСтраницы = "Страница "+СокрЛП(НомерСтраницы);

		ТабДокумент.Вывести(ОбластьНомерСтраницы);
		
		//Добавляем колонтитул
		Если ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард Тогда
			ТекСотрудник = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ПараметрыСеанса.ТекущийСотрудник.Наименование);
		Иначе
			ТекСотрудник = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Пользователи.ТекущийПользователь().Сотрудник.Наименование);
		КонецЕсли;
			
		НаимПечФормы = "Акт проверки предметов залога";
		
		//Т.к. при двусторонней печати левый и правый текст пемяются местами пришлось писать все в центр
		ТабДокумент.НижнийКолонтитул.НачальнаяСтраница = 1;
		ТабДокумент.НижнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
		ТабДокумент.НижнийКолонтитул.Шрифт = Новый Шрифт("Times New Roman", 7,, Истина);
		
		ТабДокумент.НижнийКолонтитул.ТекстВЦентре = "[&Дата] [&Время]" + " " + ТекСотрудник //Левый край
		+ "                                                                                                " //отступ
		+ НаимПечФормы + " № " + Шапка.Номер + " от " + Формат(Шапка.Дата, "ДФ=dd.MM.yyyy") + " Ломбард № " + Шапка.Ломбард.НомерЛомбарда // Центр
		+ "                                                                                                " //отступ
		+ "Страница [&НомерСтраницы] из [&СтраницВсего]"; //Правый край
			
		ТабДокумент.НижнийКолонтитул.Выводить = Истина;
		//
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);

	КонецЦикла;	//Шапки.Следующий() 

	Возврат ТабДокумент;

КонецФункции

Функция ПечатьПосылки(МассивОбъектов, ОбъектыПечати)

	УстановитьПривилегированныйРежим(Истина);
	
	Шапка = ПолучитьВыборкуШапок_Посылки(МассивОбъектов);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб			= Истина;
	ТабДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_НеРаспакованныеПосылки";
	ТабДокумент.ТолькоПросмотр = Истина;
	ТабДокумент.Защита = Истина;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЛБ_Инвентаризация.НеРаспакованныеПосылки");
	ПервыйДокумент = Истина;

	ТЧСтруктура = Новый Структура;
	ТЧСтруктура.Вставить("ТЧКамни", "ВставкиКамнейСумкаЗакрыта");
	ТЧСтруктура.Вставить("ТЧМеталл", "ВставкиМеталлаСумкаЗакрыта");
	
	Пока Шапка.Следующий() Цикл
	
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		ВыборкаСтрокТовары = Шапка.Товары.Выбрать();
		ЧленКомиссии = Шапка.ИнвентаризационнаяКомиссия.Выбрать();

		//////////////////////////////////////////////////////////////////////
		// 1-я страница формы

		// Выводим шапку накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ОбластьМакета.Параметры.Подразделение = Шапка.Ломбард.НомерЛомбарда;	
		ТабДокумент.Вывести(ОбластьМакета); 
		
		Молы         = Шапка.Молы.Выбрать();
		Пока Молы.Следующий() Цикл 		
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаМол");		
			ОбластьМакета.Параметры.ДолжностьМОЛ            = Молы.Физлицо.Должность;
			ОбластьМакета.Параметры.ФИОМОЛ                  = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Молы.ФизЛицо.Наименование); //Молы.Физлицо;
			ТабДокумент.Вывести(ОбластьМакета);			
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаПодвал");
		ОбластьМакета.Параметры.ДатаНачалаИнвентаризации = Формат(Шапка.ДатаНачалаИнвентаризации, "ДЛФ=DD");	
		ТабДокумент.Вывести(ОбластьМакета);		

		//ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();

		//////////////////////////////////////////////////////////////////////
		// 2-я страница формы

		ИтогоКоличествоНакопительный   	= 0;
		ИтогоОбщаяМассаНакопительный   	= 0;
		ИтогоМассаМеталлаНакопительный 	= 0;
		
		НомерСтраницы = 1;
	    Ном = 0;

		// Выводим заголовок таблицы
		ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ТабДокумент.Вывести(ЗаголовокТаблицы);

		// Выводим многострочную часть документа
		Пока ВыборкаСтрокТовары.Следующий() Цикл

			СтруктураВставки = ПолучитьВставки(ВыборкаСтрокТовары.ОбъектЗалога, Шапка.Ссылка, ТЧСтруктура, Ложь);
			
			Ном = Ном + 1;
			СтрокаТаблицы   = Макет.ПолучитьОбласть("Строка");
			СтрокаТаблицы.Параметры.Заполнить(ВыборкаСтрокТовары); 
			
			СтрокаТаблицы.Параметры.Наименование = СокрЛП(ВыборкаСтрокТовары.Наименование) + " ["+СокрЛП(ВыборкаСтрокТовары.Категория)+"]";
			
			СтрокаСПодвалом = Новый Массив;
			СтрокаСПодвалом.Добавить(СтрокаТаблицы);
			
			//Проверяем влазиет ли строка с описание вставок на один лист
			Если СтруктураВставки.Камни <> Неопределено Тогда
				Для Каждого СтрВ Из СтруктураВставки.Камни Цикл
					СтрокаВставки = Макет.ПолучитьОбласть("СтрокаВставки");
					
					СтрокаВставки.Параметры.Наименование = "- " + СокрЛП(СтрВ.ВидВставки) + " " + СокрЛП(СтрВ.ВидОгранки) + " " + СокрЛП(СтрВ.КачествоОгранки);
					
					СтрокаСПодвалом.Добавить(СтрокаВставки);
				КонецЦикла;
			КонецЕсли;
			
			Если СтруктураВставки.Металлы <> Неопределено Тогда
				Для Каждого СтрМ Из СтруктураВставки.Металлы Цикл
					СтрокаВставки = Макет.ПолучитьОбласть("СтрокаВставки");
					
					СтрокаВставки.Параметры.Наименование = "- " + СокрЛП(СтрМ.ВидВставки);
					СтрокаСПодвалом.Добавить(СтрокаВставки);
				КонецЦикла;
			КонецЕсли;
			//
		
			ГраницаНет = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
			ГраницаЕсть = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
			
			Если НЕ ТабДокумент.ПроверитьВывод(СтрокаСПодвалом) Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();

				ТабДокумент.Вывести(ЗаголовокТаблицы);
			КонецЕсли;

			Если СтруктураВставки.Камни <> Неопределено ИЛИ СтруктураВставки.Металлы <> Неопределено Тогда
				СтрокаТаблицы.Области.Строка.ГраницаСнизу = ГраницаНет;
			КонецЕсли;

			СтрокаТаблицы.Параметры.Номер = Ном;
			ТабДокумент.Вывести(СтрокаТаблицы);

			КоличествоВставок = 0;

			Если СтруктураВставки.Камни <> Неопределено Тогда
				КоличествоВставок = СтруктураВставки.Камни.Количество();
			КонецЕсли;
			
			Если СтруктураВставки.Металлы <> Неопределено Тогда
				КоличествоВставок = КоличествоВставок + СтруктураВставки.Металлы.Количество();
			КонецЕсли;
			
			ПорядковыйНомерВставки = 1;
			
			Если СтруктураВставки.Камни <> Неопределено Тогда
				Для Каждого СтрВ Из СтруктураВставки.Камни Цикл
					СтрокаВставки = Макет.ПолучитьОбласть("СтрокаВставки");
					
					СтрокаВставки.Параметры.Заполнить(СтрВ);
					СтрокаВставки.Параметры.Наименование = "- " + СокрЛП(СтрВ.ВидВставки) + " " + СокрЛП(СтрВ.ВидОгранки) + " " + СокрЛП(СтрВ.КачествоОгранки);
					
					Если ПорядковыйНомерВставки <> КоличествоВставок Тогда
						СтрокаВставки.Области.СтрокаВставки.ГраницаСнизу = ГраницаНет;
					КонецЕсли;
					
					ТабДокумент.Вывести(СтрокаВставки);
					
					ПорядковыйНомерВставки = ПорядковыйНомерВставки + 1;
				КонецЦикла;				
			КонецЕсли;

			Если СтруктураВставки.Металлы <> Неопределено Тогда
				Для Каждого СтрМ Из СтруктураВставки.Металлы Цикл
					СтрокаВставки = Макет.ПолучитьОбласть("СтрокаВставки");
					
					СтрокаВставки.Параметры.Заполнить(СтрМ);
					СтрокаВставки.Параметры.Наименование = "- " + СокрЛП(СтрМ.ВидВставки);
					
					Если ПорядковыйНомерВставки <> КоличествоВставок Тогда
						СтрокаВставки.Области.СтрокаВставки.ГраницаСнизу = ГраницаНет;
					КонецЕсли;

					ТабДокумент.Вывести(СтрокаВставки);

					ПорядковыйНомерВставки = ПорядковыйНомерВставки + 1;
				КонецЦикла;				
			КонецЕсли;
			
			ИтогоКоличествоНакопительный   	= ИтогоКоличествоНакопительный + ВыборкаСтрокТовары.Количество;
			ИтогоОбщаяМассаНакопительный   	= ИтогоОбщаяМассаНакопительный + ВыборкаСтрокТовары.ОбщаяМасса;
			ИтогоМассаМеталлаНакопительный 	= ИтогоМассаМеталлаНакопительный + ВыборкаСтрокТовары.МассаМеталла;
		КонецЦикла;

		ПодвалИтого  = Макет.ПолучитьОбласть("ПодвалИтого");
		ПодвалОписи  = Макет.ПолучитьОбласть("ПодвалОписи");
		
		СтрокиСПодваломОписи = Новый Массив;
		СтрокиСПодваломОписи.Добавить(ПодвалИтого);
		СтрокиСПодваломОписи.Добавить(ПодвалОписи);
		
		Молы = Шапка.Молы.Выбрать();
		Пока Молы.Следующий() Цикл 		
			ОбластьПодвалМолНаим = Макет.ПолучитьОбласть("СтрокаМол");		
			ОбластьПодвалМолНаим.Параметры.ДолжностьМОЛ = Молы.Физлицо.Должность;
			ОбластьПодвалМолНаим.Параметры.ФИОМОЛ = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Молы.ФизЛицо.Наименование); //Молы.Физлицо;
			СтрокиСПодваломОписи.Добавить(ОбластьПодвалМолНаим);			
		КонецЦикла;
		
		Если НЕ ТабДокумент.ПроверитьВывод(СтрокиСПодваломОписи) Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			ТабДокумент.Вывести(ЗаголовокТаблицы);
		КонецЕсли;
		
		// Выводим итоги по последней странице
		ОбластьПодвалИтогов = Макет.ПолучитьОбласть("ПодвалИтого");
		ПараметрыОбласти = ОбластьПодвалИтогов.Параметры;
		
		ПараметрыОбласти.ОбщееКоличество   	= ИтогоКоличествоНакопительный;
		ПараметрыОбласти.ОбщаяМасса   	= ИтогоОбщаяМассаНакопительный;
		ПараметрыОбласти.ОбщаяМассаМеталла 	= ИтогоМассаМеталлаНакопительный;
                       	
		ТабДокумент.Вывести(ОбластьПодвалИтогов);

		// Выводим подвал документа
		
		ОбластьМакета = Макет.ПолучитьОбласть("ПодвалОписи");
		ОбластьМакета.Параметры.Заполнить(Шапка);  
		
		Инд = 1;
		Пока ЧленКомиссии.Следующий() Цикл
						
			Если Инд <= 4 Тогда
				Если ЧленКомиссии.Председатель Тогда
					ОбластьМакета.Параметры["ДолжностьПредседателя"] = ЧленКомиссии.ФизЛицо.Должность;
					ОбластьМакета.Параметры["ФИОПредседателя"] = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЧленКомиссии.ФизЛицо.Наименование); //ЧленКомиссии.ФизЛицо;
					
					Если ЧленКомиссии.Дистанционно Тогда
						ОбластьМакета.Параметры["ФИОПредседателя"] = ОбластьМакета.Параметры["ФИОПредседателя"] + " (дистанционно)";
					КонецЕсли;
				Иначе
					Если Инд <> 1 Тогда //Времено. Исправить
						ОбластьМакета.Параметры["ДолжностьЧленаКомиссии" + Инд] = ЧленКомиссии.ФизЛицо.Должность;
						ОбластьМакета.Параметры["ФИОЧленаКомиссии" + Инд] = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЧленКомиссии.ФизЛицо.Наименование); //ЧленКомиссии.ФизЛицо;
						
						Если ЧленКомиссии.Дистанционно Тогда
							ОбластьМакета.Параметры["ФИОЧленаКомиссии" + Инд] = ОбластьМакета.Параметры["ФИОЧленаКомиссии" + Инд] + " (дистанционно)";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;		
			Иначе
				ТабДокумент.Вывести(ОбластьМакета);
				
				ОбластьМакета = Макет.ПолучитьОбласть("ДопЧленКомиссии");
		       	ОбластьМакета.Параметры["ДолжностьЧленаКомиссии"] = ЧленКомиссии.ФизЛицо.Должность;
				ОбластьМакета.Параметры["ФИОЧленаКомиссии"] = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЧленКомиссии.ФизЛицо.Наименование); //ЧленКомиссии.ФизЛицо;
			КонецЕсли;
			Инд = Инд + 1;
		КонецЦикла;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		Молы         = Шапка.Молы.Выбрать();
		Пока Молы.Следующий() Цикл 		
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаМол");		
			ОбластьМакета.Параметры.ДолжностьМОЛ         = Молы.Физлицо.Должность;
			ОбластьМакета.Параметры.ФИОМОЛ               = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Молы.ФизЛицо.Наименование); //Молы.ФИзлицо;
			ТабДокумент.Вывести(ОбластьМакета);			
		КонецЦикла;
		
		//Добавляем колонтитул
		Если ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард Тогда
			ТекСотрудник = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ПараметрыСеанса.ТекущийСотрудник.Наименование);
		Иначе
			ТекСотрудник = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Пользователи.ТекущийПользователь().Сотрудник.Наименование);
		КонецЕсли;
			
		НаимПечФормы = "Опись не распакованных посылок с ценностями";
		
		//Т.к. при двусторонней печати левый и правый текст пемяются местами пришлось писать все в центр
		ТабДокумент.НижнийКолонтитул.НачальнаяСтраница = 1;
		ТабДокумент.НижнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
		ТабДокумент.НижнийКолонтитул.Шрифт = Новый Шрифт("Times New Roman", 8,, Истина);
		
		ТабДокумент.НижнийКолонтитул.ТекстВЦентре = "[&Дата] [&Время]" + " " + ТекСотрудник //Левый край
		+ "                     " //отступ
		+ НаимПечФормы + " № " + Шапка.НомерДокумента + " от " + Формат(Шапка.ДатаДокумента, "ДФ=dd.MM.yyyy") + " Ломбард № " + Шапка.Ломбард.НомерЛомбарда // Центр
		+ "                     " //отступ
		+ "Страница [&НомерСтраницы] из [&СтраницВсего]"; //Правый край
			
		ТабДокумент.НижнийКолонтитул.Выводить = Истина;
		//
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);

	КонецЦикла;	//Шапки.Следующий() 

	Возврат ТабДокумент;

КонецФункции

Функция ВернутьОтделение(Ломбард, НаДату)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
	               |ИЗ
	               |	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&НаДату, ) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
	               |ГДЕ
	               |	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард = &Ломбард";
	Запрос.УстановитьПараметр("Ломбард", Ломбард); 
	Запрос.УстановитьПараметр("НаДату", НаДату);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Отделение;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ПечатьИзъятых(МассивОбъектов, ОбъектыПечати, ВалютаРегламентированногоУчета)

	УстановитьПривилегированныйРежим(Истина);
	
	ВалютаПечати = ВалютаРегламентированногоУчета; 
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб			= Истина;
	ТабДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияТоваровНаСкладе_Изъятые";

	
	ПервыйДокумент = Истина;

	Для каждого Док из МассивОбъектов Цикл
		
		Шапка = ПолучитьВыборкуШапокИзъятые(Док);
		
		//Товары = ПолучитьИзъятыеТовары(Док); 
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЛБ_Инвентаризация.Изъятые");
		
		Пока Шапка.Следующий() Цикл
			
			Если Не ПервыйДокумент Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ПервыйДокумент = Ложь;
			// Запомним номер строки, с которой начали выводить текущий документ.
			НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
			
			ВыборкаСтрокТовары = Шапка.Изъятые.Выбрать(); //Товары;
			ЧленКомиссии = Шапка.ИнвентаризационнаяКомиссия.Выбрать();
			
			//////////////////////////////////////////////////////////////////////
			// 1-я страница формы
			
			// Выводим шапку накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ОбластьМакета.Параметры.Заполнить(Шапка);      
			ОбластьМакета.Параметры.ДатаДокумента  = Формат(Шапка.ДатаДокумента, "ДЛФ=DD");
			ОбластьМакета.Параметры.НомерЛомбарда = Шапка.Ломбард.НомерЛомбарда;
			ОбластьМакета.Параметры.Отделение = ВернутьОтделение(Шапка.Ломбард, Док.Дата);
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			//ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			//////////////////////////////////////////////////////////////////////
			// 2-я страница формы
			
			НомерСтраницы = 1;
			Ном = 0;
			
			// Выводим заголовок таблицы
			ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
			ТабДокумент.Вывести(ЗаголовокТаблицы);
			
			// Выводим многострочную часть документа
			НомСтраницы = Макет.ПолучитьОбласть("НомерСтраницы");
			ПодвалОписиЧК = Макет.ПолучитьОбласть("ПодвалОписи");
			ПодвалОписиМОЛ = Макет.ПолучитьОбласть("ПодвалОписиМОЛ");
			
			Пока ВыборкаСтрокТовары.Следующий() Цикл 
				
				ДанныеОЗ = ПолучитьДанныеПоОЗ(НачалоДня(Шапка.ДатаНачалаИнвентаризации), ВыборкаСтрокТовары.ОбъектЗалога, ВыборкаСтрокТовары.ОперацияЗайма.НомерЗалоговогоБилета);
				ДанныеОЗСуммы = ПолучитьСуммыПоОЗ(ДанныеОЗ.Регистратор.Дата, ВыборкаСтрокТовары.ОперацияЗайма);
				
				Ном = Ном + 1;
				СтрокаТаблицы   = Макет.ПолучитьОбласть("Строка");
				СтрокаТаблицы.Параметры.Заполнить(ДанныеОЗ);

				СтрокаТаблицы.Параметры.Наименование = СокрЛП(ВыборкаСтрокТовары.ОбъектЗалога.Наименование) + " ["+СокрЛП(ВыборкаСтрокТовары.Категория)+"]";			
				СтрокаТаблицы.Параметры.Артикул = ВыборкаСтрокТовары.Артикул;
				СтрокаТаблицы.Параметры.Металл = ВыборкаСтрокТовары.Металл;
				СтрокаТаблицы.Параметры.Проба = ВыборкаСтрокТовары.Проба.Проба;
				СтрокаТаблицы.Параметры.СуммаТребования = ДанныеОЗСуммы.ПоОсновномуДолгу + ДанныеОЗСуммы.ПоПроцентам;
				СтрокаТаблицы.Параметры.СуммаПроцентов = ДанныеОЗСуммы.ПоПроцентам;
				СтрокаТаблицы.Параметры.Залогодатель = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СокрЛП(ВыборкаСтрокТовары.Залогодатель)); 
				СтрокаТаблицы.Параметры.НомерПротокола = Формат(ДанныеОЗ.ДатаПротоколаИзъятия, "ДФ=dd.MM.yy");
				
				СтрокаТаблицы.Параметры.Количество   = ВыборкаСтрокТовары.Количество; 
				СтрокаТаблицы.Параметры.ОбщаяМасса   = ВыборкаСтрокТовары.ОбщаяМасса; 
				//СтрокаТаблицы.Параметры.Отклонения = ?(ВыборкаСтрокТовары.Отклонения = "", "" + ВыборкаСтрокТовары.Комментарий,
				//	"" + ВыборкаСтрокТовары.Отклонения + Символы.ПС + ВыборкаСтрокТовары.Комментарий);
				
				СтрокаСПодвалом = Новый Массив;
				СтрокаСПодвалом.Добавить(СтрокаТаблицы);
				СтрокаСПодвалом.Добавить(НомСтраницы);
				
				Если НЕ ТабДокумент.ПроверитьВывод(СтрокаСПодвалом) Тогда
					//НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, СтрокаСПодвалом) Тогда
					
					ОбластьНомерСтраницы = Макет.ПолучитьОбласть("НомерСтраницы");
					ПараметрыОбласти = ОбластьНомерСтраницы.Параметры;
					
					//НомерСтраницы = НомерСтраницы + 1;
					//ПараметрыОбласти.НомерСтраницы = "Страница "+СокрЛП(НомерСтраницы);
					
					ТабДокумент.Вывести(ОбластьНомерСтраницы);
					
					НомерСтраницы = НомерСтраницы + 1;
					
					ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					
					ТабДокумент.Вывести(ЗаголовокТаблицы);
				КонецЕсли;
				
				СтрокаТаблицы.Параметры.Номер = Ном;
				ТабДокумент.Вывести(СтрокаТаблицы);
			КонецЦикла;
			
			// Выводим итоги по последней странице

			ОбластьНомерСтраницы = Макет.ПолучитьОбласть("НомерСтраницы");
			ПараметрыОбласти = ОбластьНомерСтраницы.Параметры;
			
			//ПараметрыОбласти.НомерСтраницы = "Страница "+СокрЛП(НомерСтраницы);

			СтрокиСПодваломОписи = Новый Массив;
			СтрокиСПодваломОписи.Добавить(ПодвалОписиЧК);
			СтрокиСПодваломОписи.Добавить(ПодвалОписиМОЛ);
			СтрокиСПодваломОписи.Добавить(НомСтраницы);
			
			Если НЕ ТабДокумент.ПроверитьВывод(СтрокиСПодваломОписи) Тогда
				ТабДокумент.Вывести(ОбластьНомерСтраницы);
				НомерСтраницы = НомерСтраницы + 1;
				
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			//ТабДокумент.Вывести(ОбластьНомерСтраницы);
			
			// Выводим подвал документа
			//ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ОбластьМакета = Макет.ПолучитьОбласть("ПодвалОписи");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			Инд = 1;
			Пока ЧленКомиссии.Следующий() Цикл
				Если Инд <= 4 Тогда
					Если ЧленКомиссии.Председатель Тогда
						ОбластьМакета.Параметры["ДолжностьПредседателя"] = ЧленКомиссии.ФизЛицо.Должность;
						ОбластьМакета.Параметры["ФИОПредседателя"] = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЧленКомиссии.ФизЛицо.Наименование);
					
						Если ЧленКомиссии.Дистанционно Тогда
							ОбластьМакета.Параметры["ФИОПредседателя"] = ОбластьМакета.Параметры["ФИОПредседателя"] + " (дистанционно)";
						КонецЕсли;
					Иначе
						Если Инд <> 1 Тогда //Времено. Исправить
							ОбластьМакета.Параметры["ДолжностьЧленаКомиссии" + Инд] = ЧленКомиссии.ФизЛицо.Должность;
							ОбластьМакета.Параметры["ФИОЧленаКомиссии" + Инд] = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЧленКомиссии.ФизЛицо.Наименование);
							
							Если ЧленКомиссии.Дистанционно Тогда
								ОбластьМакета.Параметры["ФИОЧленаКомиссии" + Инд] = ОбластьМакета.Параметры["ФИОЧленаКомиссии" + Инд] + " (дистанционно)";
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;		
				Иначе
					ТабДокумент.Вывести(ОбластьМакета);
					
					ОбластьМакета = Макет.ПолучитьОбласть("ДопЧленКомиссии");
					ОбластьМакета.Параметры["ДолжностьЧленаКомиссии"] = ЧленКомиссии.ФизЛицо.Должность;
					ОбластьМакета.Параметры["ФИОЧленаКомиссии"] = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЧленКомиссии.ФизЛицо.Наименование);
				КонецЕсли;
				Инд = Инд + 1;
			КонецЦикла;
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ПодвалОписиМОЛ");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			ПорядковыйНомер = 1;
			
			Молы = Шапка.Молы.Выбрать();
			
			Пока Молы.Следующий() Цикл 		
				ОбластьМакета.Параметры["ДолжностьМОЛ" + ПорядковыйНомер] = Молы.Физлицо.Должность;
				ОбластьМакета.Параметры["ФИОМОЛ" + ПорядковыйНомер] = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Молы.ФизЛицо.Наименование);
				ПорядковыйНомер = ПорядковыйНомер + 1;
			КонецЦикла;

			//ТабДокумент.Вывести(ОбластьМакета);  
			//
			//ОбластьМакета = Макет.ПолучитьОбласть("НомерСтраницы");
			
			//НомерСтраницы = НомерСтраницы + 1;
			//ОбластьМакета.Параметры.НомерСтраницы = "Страница "+СокрЛП(НомерСтраницы);
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			//Добавляем колонтитул
			Если ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард Тогда
				ТекСотрудник = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ПараметрыСеанса.ТекущийСотрудник.Наименование);
			Иначе
				ТекСотрудник = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Пользователи.ТекущийПользователь().Сотрудник.Наименование);
			КонецЕсли;
			
			НаимПечФормы = "Акт проверки документов, подтверждающих изъятие";
			
			//Т.к. при двусторонней печати левый и правый текст пемяются местами пришлось писать все в центр
			ТабДокумент.НижнийКолонтитул.НачальнаяСтраница = 1;
			ТабДокумент.НижнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
			ТабДокумент.НижнийКолонтитул.Шрифт = Новый Шрифт("Times New Roman", 7,, Истина);
			
			ТабДокумент.НижнийКолонтитул.ТекстВЦентре = "[&Дата] [&Время]" + " " + ТекСотрудник //Левый край
			+ "                                                                                                " //отступ
			+ НаимПечФормы + " № " + Шапка.НомерДокумента + " от " + Формат(Шапка.ДатаДокумента, "ДФ=dd.MM.yyyy") + " Ломбард № " + Шапка.Ломбард.НомерЛомбарда // Центр
			+ "                                                                                                " //отступ
			+ "Страница [&НомерСтраницы] из [&СтраницВсего]"; //Правый край
			
			ТабДокумент.НижнийКолонтитул.Выводить = Истина;
			//
			// В табличном документе зададим имя области, в которую был 
			// выведен объект. Нужно для возможности печати покомплектно.
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
			
		КонецЦикла;	//Шапки.Следующий()
	КонецЦикла;

	Возврат ТабДокумент;

КонецФункции

Функция ПечатьАктаНаличныхДС(МассивОбъектов, ОбъектыПечати, ВалютаРегламентированногоУчета)

	УстановитьПривилегированныйРежим(Истина);
	
	ВалютаПечати = ВалютаРегламентированногоУчета; 
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб			= Истина;
	ТабДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияТоваровНаСкладе_ПФ_MXL_ИНВ15";

	
	ПервыйДокумент = Истина;

	Для каждого Док из МассивОбъектов Цикл
		
		Шапка = ПолучитьВыборкуШапокБезТоваров(Док);
		

		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЛБ_Инвентаризация.ПФ_MXL_ИНВ15");
		
		Пока Шапка.Следующий() Цикл
			
			Если Не ПервыйДокумент Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ПервыйДокумент = Ложь;
			// Запомним номер строки, с которой начали выводить текущий документ.
			НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
			
		ЧленКомиссии = Шапка.ИнвентаризационнаяКомиссия.Выбрать();  
		
		Молы         	= Шапка.Молы.Выбрать();  
		КассирДолжность = "";
		ФИОКассира      = "";

		Пока Молы.Следующий() Цикл
			КассирДолжность = Молы.Физлицо.Должность;
			ФИОКассира      = Молы.ФИзлицо;
			Прервать;
		КонецЦикла;    
		
		СуммаПоФакту = 118535.06; 
		СуммаПоФактуРубли = Цел(СуммаПоФакту);
		СуммаПоФактуКопейки = (СуммаПоФакту - СуммаПоФактуРубли)*100; 
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(Шапка);      
		ОбластьМакета.Параметры.ДатаДокумента  = Формат(Шапка.Дата, "ДФ=dd.MM.yy; ДЛФ=DD");
 
		
		ОбластьМакета.Параметры.Организация 	= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ОсновнаяОрганизация");
		ОбластьМакета.Параметры.Подразделение  	= Шапка.Ломбард;  
		ОбластьМакета.Параметры.КассирДолжность = КассирДолжность; 
		ОбластьМакета.Параметры.ФИОКассира  	= ФИОКассира;  	
		ТабДокумент.Вывести(ОбластьМакета);
		
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаНаличныхДенег"); 
		ОбластьМакета.Параметры.НомерПоПорядку = 1; 
		ОбластьМакета.Параметры.НаименованиеЦенности = "наличных денег";
		ОбластьМакета.Параметры.СуммаПоФактуРубли = СуммаПоФактуРубли;
		ОбластьМакета.Параметры.СуммаПоФактуКопейки = СуммаПоФактуКопейки;
		ТабДокумент.Вывести(ОбластьМакета);

        		
		ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
		ОбластьМакета.Параметры.Заполнить(Шапка); 
		
		
		ОбластьМакета.Параметры.СуммаПоФактуРеглПрописью = ЧислоПрописью(
          СуммаПоФакту,,
          "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
		
		ТабДокумент.Вывести(ОбластьМакета); 
		
		ОбластьМакета = Макет.ПолучитьОбласть("ПоследниеНомера");
		ОбластьМакета.Параметры.Заполнить(Шапка);  
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ЧленыКомиссии");

			
		Инд = 1;
		Пока ЧленКомиссии.Следующий() Цикл
			Если ЧленКомиссии.Председатель Тогда
				ОбластьМакета.Параметры["ЗаголовокЧленаКомиссии"] = "Председатель комиссии";
				ОбластьМакета.Параметры["Должность"] = ЧленКомиссии.ФизЛицо.Должность;
				ОбластьМакета.Параметры["НаименованиеЧленаКомиссии"] = ЧленКомиссии.ФизЛицо; 
				ТабДокумент.Вывести(ОбластьМакета); 
			КонецЕсли;
			Прервать;
		КонецЦикла;
		
		инд = 0;
		ЧленКомиссии = Шапка.ИнвентаризационнаяКомиссия.Выбрать();   
		Пока ЧленКомиссии.Следующий() Цикл 
			Если инд < 3 Тогда
				Если НЕ ЧленКомиссии.Председатель Тогда 				
					ОбластьМакета.Параметры["ЗаголовокЧленаКомиссии"] = "Член комиссии"; 
					ОбластьМакета.Параметры["Должность"] = ЧленКомиссии.ФизЛицо.Должность;
					ОбластьМакета.Параметры["НаименованиеЧленаКомиссии"] = ЧленКомиссии.ФизЛицо; 
					ТабДокумент.Вывести(ОбластьМакета);  
					инд = инд + 1;   				
				КонецЕсли; 
			КонецЕсли;
		КонецЦикла;

		
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ОбластьМакета.Параметры.КассирДолжность = КассирДолжность; 
		ОбластьМакета.Параметры.ФИОКассира  	= ФИОКассира;
		ТабДокумент.Вывести(ОбластьМакета);  
		
		
		//Молы         = Шапка.Молы.Выбрать();
		//Пока Молы.Следующий() Цикл 		
		//	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаМол");		
		//	ОбластьМакета.Параметры.ДолжностьМОЛ            = Молы.Физлицо.Должность;
		//	ОбластьМакета.Параметры.ФИОМОЛ                  = Молы.ФИзлицо;
		//	ТабДокумент.Вывести(ОбластьМакета);			
		//КонецЦикла;
		  	
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);

		КонецЦикла;	//Шапки.Следующий()
		КонецЦикла;

	Возврат ТабДокумент;

КонецФункции

Функция ПолучитьВставки(ОЗ, Док, ТЧВставки, ВсеВставки)
	
	СтруктураВозврата = Новый Структура("Камни, Металлы");
	
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("ОбъектЗалога", ОЗ);
	Запрос.УстановитьПараметр("Ссылка", Док);
	
	Запрос.Текст = 
		"ВЫБРАТЬ //РАЗЛИЧНЫЕ
		|	ЛБ_Инвентаризация111.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_Инвентаризация111.ВидВставки КАК ВидВставки,
		|	ЛБ_Инвентаризация111.ВидВставкиФакт КАК ВидВставкиФакт,
		|	ЛБ_Инвентаризация111.ВидОгранки КАК ВидОгранки,
		|	ЛБ_Инвентаризация111.ВидОгранкиФакт КАК ВидОгранкиФакт,
		|	ЛБ_Инвентаризация111.КачествоОгранки КАК КачествоОгранки,
		|	ЛБ_Инвентаризация111.КачествоОгранкиФакт КАК КачествоОгранкиФакт,
		|	ЛБ_Инвентаризация111.Количество КАК Количество,
		|	ЛБ_Инвентаризация111.КоличествоФакт КАК КоличествоФакт,
		|	ВЫБОР
		|		КОГДА ВидВставки <> ЗНАЧЕНИЕ(Справочник.ЛБ_ДрагоценныеКамни.Бриллиант)
		//|		КОГДА ЛБ_Инвентаризация111.Вид = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыКомплектующихИзделия.Комплектующее)
		|			ТОГДА ЛБ_Инвентаризация111.ВесГраммы
		|		ИНАЧЕ ЛБ_Инвентаризация111.Вес
		|	КОНЕЦ КАК Вес,
		|	ВЫБОР
		|		КОГДА ВидВставки <> ЗНАЧЕНИЕ(Справочник.ЛБ_ДрагоценныеКамни.Бриллиант)
		//|		КОГДА ЛБ_Инвентаризация111.Вид = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыКомплектующихИзделия.Комплектующее)
		|			ТОГДА ЛБ_Инвентаризация111.ВесГраммыФакт
		|		ИНАЧЕ ЛБ_Инвентаризация111.ВесФакт
		|	КОНЕЦ КАК ВесФакт,
		//|	ЛБ_Инвентаризация111.Вес КАК Вес,
		//|	ЛБ_Инвентаризация111.ВесФакт КАК ВесФакт,
		|	ЛБ_Инвентаризация111.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЛБ_Инвентаризация111.ЕдиницаИзмеренияФакт КАК ЕдиницаИзмеренияФакт,
		|	ЛБ_Инвентаризация111.Сумма КАК Сумма,
		|	ЛБ_Инвентаризация111.СуммаФакт КАК СуммаФакт
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.111 КАК ЛБ_Инвентаризация111
		|ГДЕ
		|	ЛБ_Инвентаризация111.ОбъектЗалога = &ОбъектЗалога
		|	И ЛБ_Инвентаризация111.Ссылка = &Ссылка
		|	И 100 = 100";
	
	Если НЕ ВсеВставки Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "100 = 100", "ЛБ_Инвентаризация111.ВидВставки = ЗНАЧЕНИЕ(Справочник.ЛБ_ДрагоценныеКамни.Бриллиант)");
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "111", ТЧВставки.ТЧКамни);
	
	РезультатК = Запрос.Выполнить().Выгрузить();
	
	Если РезультатК.Количество() > 0 Тогда
		СтруктураВозврата.Камни = РезультатК;
	КонецЕсли;
	
	Запрос.Текст = 
		"ВЫБРАТЬ //РАЗЛИЧНЫЕ
		|	ЛБ_Инвентаризация111.Проба КАК ВидВставки,
		|	ЛБ_Инвентаризация111.ПробаФакт КАК ВидВставкиФакт,
		|	ЛБ_Инвентаризация111.Вес КАК Вес,
		|	ЛБ_Инвентаризация111.ВесФакт КАК ВесФакт,
		|	ЛБ_Инвентаризация111.СуммаОценки КАК Сумма,
		|	ЛБ_Инвентаризация111.СуммаОценкиФакт КАК СуммаФакт
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.111 КАК ЛБ_Инвентаризация111
		|ГДЕ
		|	ЛБ_Инвентаризация111.ОбъектЗалога = &ОбъектЗалога
		|	И ЛБ_Инвентаризация111.Ссылка = &Ссылка";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "111", ТЧВставки.ТЧМеталл);
	
	РезультатМ = Запрос.Выполнить().Выгрузить();
	
	Если РезультатМ.Количество() > 0 Тогда
		СтруктураВозврата.Металлы = РезультатМ;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПолучитьСуммыПоОЗ(Дата, ЗБ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РасчетыСКлиентамиБУОстаткиИОбороты.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	СУММА(ЛБ_РасчетыСКлиентамиБУОстаткиИОбороты.СуммаОборот) КАК Сумма,
	               |	ЛБ_РасчетыСКлиентамиБУОстаткиИОбороты.ВидРасчета КАК ВидРасчета
	               |ИЗ
	               |	РегистрНакопления.ЛБ_РасчетыСКлиентамиБУ.ОстаткиИОбороты(, , Регистратор, , ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_РасчетыСКлиентамиБУОстаткиИОбороты
	               |ГДЕ
	               |	ЛБ_РасчетыСКлиентамиБУОстаткиИОбороты.Период <= &Дата
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_РасчетыСКлиентамиБУОстаткиИОбороты.ЗалоговыйБилет,
	               |	ЛБ_РасчетыСКлиентамиБУОстаткиИОбороты.ВидРасчета";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗБ);

	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктураВозврата = Новый Структура("ПоПроцентам, ПоОсновномуДолгу", 0, 0);

	Пока Выборка.Следующий() Цикл
		Если Выборка.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам Тогда
			СтруктураВозврата.ПоПроцентам = Выборка.Сумма;
		ИначеЕсли Выборка.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоОсновномуДолгу Тогда
			СтруктураВозврата.ПоОсновномуДолгу = Выборка.Сумма;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураВозврата;

КонецФункции

Функция ПолучитьДанныеПоОЗ(Дата, ОЗ, НомерЗБ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СостояниеОбъектаЗалога.Регистратор КАК Регистратор,
		|	ЛБ_СостояниеОбъектаЗалога.Регистратор.ГосОрганИзъятие КАК Орган,
		|	ЛБ_СостояниеОбъектаЗалога.Регистратор.ДатаИзъятия КАК ДатаИзъятия,
		|	ЛБ_СостояниеОбъектаЗалога.Регистратор.ФИОДолжностьИзъятие КАК ДолжностноеЛицо,
		|	ЛБ_СостояниеОбъектаЗалога.Регистратор.ФИОДолжностьСудьи КАК ФИОДолжностьСудьи,
		|	ЛБ_СостояниеОбъектаЗалога.Регистратор.ДатаПротоколИзъятия КАК ДатаПротоколаИзъятия,
		|	ЛБ_СостояниеОбъектаЗалога.Регистратор.ДокументИзъятияНаименование КАК ДокументИзъятияНаименование,
		|	ЛБ_СостояниеОбъектаЗалога.Регистратор.ДокументИзъятияДатаВыдачи КАК ДокументИзъятияДатаВыдачи,
		|	ЛБ_СостояниеОбъектаЗалога.Регистратор.ДокументИзъятияКемВыдан КАК ДокументИзъятияКемВыдан
		|ИЗ
		|	РегистрСведений.ЛБ_СостояниеОбъектаЗалога КАК ЛБ_СостояниеОбъектаЗалога
		|ГДЕ
		|	ЛБ_СостояниеОбъектаЗалога.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ИзъятиеОбъектовЗалога)
		|	И ЛБ_СостояниеОбъектаЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Изъят)
		|	И ЛБ_СостояниеОбъектаЗалога.Период <= &Дата
		|	И ЛБ_СостояниеОбъектаЗалога.ОбъектЗалога = &ОЗ
		|	И ЛБ_СостояниеОбъектаЗалога.Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		|	И ЛБ_СостояниеОбъектаЗалога.Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		|	И НЕ ЛБ_СостояниеОбъектаЗалога.Регистратор В
		|				(ВЫБРАТЬ
		|					ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
		|				ИЗ
		|					РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&Дата, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
		|				ГДЕ
		|					ЛБ_ОтменыОперацийЗБСрезПоследних.НомерЗалоговогоБилета ПОДОБНО ""%"" + &НомерЗалоговогоБилета + ""%"")
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_СостояниеОбъектаЗалога.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ОЗ", ОЗ);
	Запрос.УстановитьПараметр("НомерЗалоговогоБилета", НомерЗБ);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("Регистратор", Результат.Регистратор);
		СтруктураВозврата.Вставить("Орган", Результат.Орган);
		СтруктураВозврата.Вставить("ДатаИзъятия", Результат.ДатаИзъятия);
		СтруктураВозврата.Вставить("ДолжностноеЛицо", Результат.ДолжностноеЛицо);
		СтруктураВозврата.Вставить("ФИОДолжностьСудьи", Результат.ФИОДолжностьСудьи);
		СтруктураВозврата.Вставить("ДатаПротоколаИзъятия", Результат.ДатаПротоколаИзъятия);
		СтруктураВозврата.Вставить("ДокументИзъятияНаименование", Результат.ДокументИзъятияНаименование);
		СтруктураВозврата.Вставить("ДокументИзъятияДатаВыдачи", Результат.ДокументИзъятияДатаВыдачи);
		СтруктураВозврата.Вставить("ДокументИзъятияКемВыдан", Результат.ДокументИзъятияКемВыдан);
		
		Возврат СтруктураВозврата;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции



Функция ПолучитьДополнительныеРеквизитыДляРеестра() Экспорт
	
	Результат = Новый Структура("Информация", "Склад");
	
	Возврат Результат;
	
КонецФункции

#Область ЗаполнениеПоОстаткам

Функция НовыеПараметрыЗаполнения() Экспорт
	
	ПараметрыЗаполнения = Новый Структура;
	
	// Один из двух вариантов: "Заполнить" или "ПерезаполнитьУчетныеКоличества".
	ПараметрыЗаполнения.Вставить("НазваниеДействия", "Заполнить");
	
	ПараметрыЗаполнения.Вставить("ВыполнитьКорректировкуСтоимости",  Ложь);
	
	// Результат Обработки.ЗакрытиеМесяца.НовыеПараметрыВыполненияОперации()
	ПараметрыЗаполнения.Вставить("ПараметрыКорректировкиСтоимости");
	
	ПараметрыЗаполнения.Вставить("ИспользуетсяОтложенноеПроведение", Ложь);
	
	ПараметрыЗаполнения.Вставить("Ссылка",            Документы.ИнвентаризацияТоваровНаСкладе.ПустаяСсылка());
	ПараметрыЗаполнения.Вставить("ОтветственноеЛицо", Справочники.ФизическиеЛица.ПустаяСсылка());
	ПараметрыЗаполнения.Вставить("Дата",              '0001-01-01');
	ПараметрыЗаполнения.Вставить("Склад",             Справочники.Склады.ПустаяСсылка());
	ПараметрыЗаполнения.Вставить("Организация",       Справочники.Организации.ПустаяСсылка());
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

Функция НовыйРезультатЗаполнения() Экспорт
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЗаданиеВыполнено",              Ложь);
	СтруктураПараметров.Вставить("ОткрытьФормуОшибки",            Ложь);
	СтруктураПараметров.Вставить("ОперацияКорректировкаСтоимости");
	СтруктураПараметров.Вставить("ТаблицаТовары");
	
	Возврат СтруктураПараметров;
	
КонецФункции

// Получает таблицу остатков по складу. Предназначена для запуска фоновым заданием.
//
// Параметры:
//  ПараметрыЗаполнения - Структура - см. НовыеПараметрыЗаполнения().
//  АдресХранилища - Строка - место, куда фоновое задание поместит результат.
//
Процедура ЗаполнитьПоОстаткам(ПараметрыЗаполнения, АдресХранилища) Экспорт
	
	Результат = НовыйРезультатЗаполнения();
	
	Если ПараметрыЗаполнения.ВыполнитьКорректировкуСтоимости Тогда
		
		РезультатКорректировки = Обработки.ЗакрытиеМесяца.АктуализироватьОстатки(ПараметрыЗаполнения.ПараметрыКорректировкиСтоимости);
		
		Если ТипЗнч(РезультатКорректировки) <> Тип("Структура")
		 Или Не РезультатКорректировки.Свойство("Отказ")
		 Или Не РезультатКорректировки.Свойство("Ссылка") Тогда
			Возврат;
		КонецЕсли;
			
		Результат.ОткрытьФормуОшибки = РезультатКорректировки.Отказ;
		Результат.ОперацияКорректировкаСтоимости = РезультатКорректировки.Ссылка;
		
	КонецЕсли;
	
	Если Не Результат.ОткрытьФормуОшибки Тогда
		Результат.ТаблицаТовары = ЗаполнитьПоОстаткамНаСкладе(ПараметрыЗаполнения);
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);
	
КонецПроцедуры

Функция СписокСкладовДляЗаполнения(ПараметрыЗаполнения)

	Если ЗначениеЗаполнено(ПараметрыЗаполнения.Склад) Тогда
		
		СписокСкладов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрыЗаполнения.Склад);
		
	Иначе
		
		ЗапросПоСкладам = Новый Запрос;
		ЗапросПоСкладам.УстановитьПараметр("МОЛ", ПараметрыЗаполнения.ОтветственноеЛицо);
		ЗапросПоСкладам.УстановитьПараметр("КонецПериода", ПараметрыЗаполнения.Дата);
		ЗапросПоСкладам.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОтветственныеЛицаСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
		|ИЗ
		|	РегистрСведений.ОтветственныеЛица.СрезПоследних(&КонецПериода, ) КАК ОтветственныеЛицаСрезПоследних
		|ГДЕ
		|	ОтветственныеЛицаСрезПоследних.ФизическоеЛицо = &МОЛ";
		
		СписокСкладов = ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("СтруктурнаяЕдиница");
		
	КонецЕсли;
	
	Возврат СписокСкладов;

КонецФункции

Функция ПодготовитьЗапросИнвентаризация(ПараметрыЗаполнения)
	
	// Определим настройки аналитического учета.
	//ВестиСкладскойУчетБУ = БухгалтерскийУчет.ВедетсяУчетПоСкладам(ПланыСчетов.Хозрасчетный.Товары);
	//ВестиСуммовойУчетПоСкладамБУ = ВестиСкладскойУчетБУ
	//	И БухгалтерскийУчет.ВедетсяСуммовойУчетПоСкладам(ПланыСчетов.Хозрасчетный.Товары);
	//	
	//МассивИсклСчетов = Новый Массив();
	//МассивИсклСчетов.Добавить(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ); // 41.12
	//МассивИсклСчетов.Добавить(ПланыСчетов.Хозрасчетный.ТорговаяНаценка);                            // 42
	//МассивИсклСчетов.Добавить(ПланыСчетов.Хозрасчетный.ГТД);                                        // ГТД
	//МассивИсклСчетов.Добавить(ПланыСчетов.Хозрасчетный.МатериальныеЦенностиВЭксплуатации);          // МЦ
	//МассивИсклСчетов = БухгалтерскийУчет.СформироватьМассивСубсчетов(МассивИсклСчетов);
	//
	//// Определяем условия отборов по счетам и аналитикам.
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("МоментАнализаОстатков",  Новый Граница(ПараметрыЗаполнения.Дата, ВидГраницы.Исключая));
	//Запрос.УстановитьПараметр("Склад",		            СписокСкладовДляЗаполнения(ПараметрыЗаполнения));
	//Запрос.УстановитьПараметр("МОЛ",	 			    ПараметрыЗаполнения.ОтветственноеЛицо);
	//Запрос.УстановитьПараметр("Организация",	        ПараметрыЗаполнения.Организация);
	//Запрос.УстановитьПараметр("ИсклСчета",	 		    МассивИсклСчетов);
	//ТолькоПерезаполнение = (ПараметрыЗаполнения.НазваниеДействия = "ПерезаполнитьУчетныеКоличества");
	//Если ТолькоПерезаполнение Тогда
	//	Запрос.УстановитьПараметр("ДокументСсылка", ПараметрыЗаполнения.Ссылка);
	//КонецЕсли;
	//
	//Если Не ПараметрыЗаполнения.ИспользуетсяОтложенноеПроведение Тогда
	//	Если ПараметрыЗаполнения.НазваниеДействия = "ПерезаполнитьУчетныеКоличества" Тогда
	//		ТекстУсловияСчетов = "ИСТИНА";
	//	Иначе
	//		ТекстУсловияСчетов = "НЕ Счет В (&ИсклСчета)";
	//	КонецЕсли;
	//Иначе
	//	// Актуальность на дату документа возможна только для отдельных счетов. Для всех остальных счетов актуальными будут
	//	// только остатки, учитывающие проводки корректировки стоимости по состоянию на конец месяца.
	//	Если ПараметрыЗаполнения.НазваниеДействия = "ПерезаполнитьУчетныеКоличества" Тогда
	//		ТекстУсловияСчетов = "(&АктуальностьНаКонецМесяца
	//		|				И НЕ ИнвентаризацияТоваровНаСкладеТовары.СчетУчета В (&СчетаРассчитываемыеОперативно)
	//		|			ИЛИ НЕ &АктуальностьНаКонецМесяца
	//		|				И ИнвентаризацияТоваровНаСкладеТовары.СчетУчета В (&СчетаРассчитываемыеОперативно))";
	//	Иначе
	//		ТекстУсловияСчетов = "(&АктуальностьНаКонецМесяца
	//		|						И НЕ Счет В (&ИсклСчета, &СчетаРассчитываемыеОперативно)
	//		|					ИЛИ НЕ &АктуальностьНаКонецМесяца
	//		|						И Счет В (&СчетаРассчитываемыеОперативно)
	//		|						И НЕ Счет В (&ИсклСчета))";
	//	КонецЕсли;
	//	Запрос.УстановитьПараметр("СчетаРассчитываемыеОперативно", УчетТоваров.СчетаРассчитываемыеОперативно());
	//КонецЕсли;
	//ТекстУсловияКоличества = ?(ВестиСкладскойУчетБУ, "И Субконто2 В (&Склад)", "");
	//ТекстУсловияЦены = ?(ВестиСуммовойУчетПоСкладамБУ, "И Субконто2 В (&Склад)", "");
	//
	//// Определяем наборы субконто.
	//
	//ПорядокСубконтоКоличество = Новый Массив();
	//ПорядокСубконтоКоличество.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
	//Если ВестиСкладскойУчетБУ Тогда
	//	ПорядокСубконтоКоличество.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады);
	//КонецЕсли;
	//
	//ПорядокСубконтоЦена = Новый Массив();
	//ПорядокСубконтоЦена.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
	//Если ВестиСуммовойУчетПоСкладамБУ Тогда
	//	ПорядокСубконтоЦена.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады);
	//КонецЕсли;
	//
	//ПорядокСубконтоМОЛ = Новый Массив();
	//ПорядокСубконтоМОЛ.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
	//ПорядокСубконтоМОЛ.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РаботникиОрганизаций);
	//
	//Запрос.УстановитьПараметр("ПорядокСубконтоКоличество", ПорядокСубконтоКоличество);
	//Запрос.УстановитьПараметр("ПорядокСубконтоЦена",       ПорядокСубконтоЦена);
	//Запрос.УстановитьПараметр("ПорядокСубконтоМОЛ",        ПорядокСубконтоМОЛ);
	//
	//Если ПараметрыЗаполнения.НазваниеДействия = "ПерезаполнитьУчетныеКоличества" Тогда
	//	
	//	ТекстЗапросаИнвентаризация =
	//	"ВЫБРАТЬ
	//	|	ИнвентаризацияТоваровНаСкладеТовары.НомерСтроки КАК НомерСтроки,
	//	|	ИнвентаризацияТоваровНаСкладеТовары.Номенклатура КАК Номенклатура,
	//	|	ИнвентаризацияТоваровНаСкладеТовары.СчетУчета КАК СчетУчета,
	//	|	ИнвентаризацияТоваровНаСкладеТовары.Количество КАК Количество,
	//	|	ИнвентаризацияТоваровНаСкладеТовары.Цена КАК Цена,
	//	|	ИнвентаризацияТоваровНаСкладеТовары.ЦенаВРознице КАК ЦенаВРознице,
	//	|	ИнвентаризацияТоваровНаСкладеТовары.Сумма КАК Сумма
	//	|ПОМЕСТИТЬ ТаблицаТовары
	//	|ИЗ
	//	|	Документ.ИнвентаризацияТоваровНаСкладе.Товары КАК ИнвентаризацияТоваровНаСкладеТовары
	//	|ГДЕ
	//	|	ИнвентаризацияТоваровНаСкладеТовары.Ссылка = &ДокументСсылка
	//	|	И &ТекстУсловияСчетов
	//	|
	//	|ИНДЕКСИРОВАТЬ ПО
	//	|	Номенклатура
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ХозрасчетныйОстаткиКоличество.Счет КАК Счет,
	//	|	ХозрасчетныйОстаткиКоличество.Субконто1 КАК Субконто1,
	//	|	СУММА(ХозрасчетныйОстаткиКоличество.КоличествоОстаток) КАК КоличествоОстаток
	//	|ПОМЕСТИТЬ ХозрасчетныйОстаткиКоличество
	//	|ИЗ
	//	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	//	|			&МоментАнализаОстатков,
	//	|			НЕ Счет В (&ИсклСчета),
	//	|			&ПорядокСубконтоКоличество,
	//	|			Организация = &Организация
	//	|				И Субконто1 В
	//	|					(ВЫБРАТЬ
	//	|						ТаблицаТовары.Номенклатура
	//	|					ИЗ
	//	|						ТаблицаТовары КАК ТаблицаТовары)
	//	|				И &ТекстУсловияКоличества) КАК ХозрасчетныйОстаткиКоличество
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ХозрасчетныйОстаткиКоличество.Субконто1,
	//	|	ХозрасчетныйОстаткиКоличество.Счет
	//	|
	//	|ИНДЕКСИРОВАТЬ ПО
	//	|	Субконто1,
	//	|	Счет
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ХозрасчетныйЦена.Счет КАК Счет,
	//	|	ХозрасчетныйЦена.Субконто1 КАК Субконто1,
	//	|	СУММА(ВЫБОР
	//	|			КОГДА ХозрасчетныйЦена.КоличествоКонечныйОстаток <> 0
	//	|				ТОГДА ХозрасчетныйЦена.КоличествоКонечныйОстаток
	//	|			КОГДА ХозрасчетныйЦена.КоличествоОборотКт <> 0
	//	|				ТОГДА ХозрасчетныйЦена.КоличествоОборотКт
	//	|			КОГДА ХозрасчетныйЦена.КоличествоОборотДт <> 0
	//	|				ТОГДА ХозрасчетныйЦена.КоличествоОборотДт
	//	|			ИНАЧЕ 0
	//	|		КОНЕЦ) КАК КоличествоДляЦены,
	//	|	СУММА(ВЫБОР
	//	|			КОГДА ХозрасчетныйЦена.КоличествоКонечныйОстаток <> 0
	//	|				ТОГДА ХозрасчетныйЦена.СуммаКонечныйОстаток
	//	|			КОГДА ХозрасчетныйЦена.КоличествоОборотКт <> 0
	//	|				ТОГДА ХозрасчетныйЦена.СуммаОборотКт
	//	|			КОГДА ХозрасчетныйЦена.КоличествоОборотДт <> 0
	//	|				ТОГДА ХозрасчетныйЦена.СуммаОборотДт
	//	|			ИНАЧЕ 0
	//	|		КОНЕЦ) КАК СуммаДляЦены
	//	|ПОМЕСТИТЬ ХозрасчетныйЦена
	//	|ИЗ
	//	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	//	|			&НачалоМесяца,
	//	|			&МоментАнализаЦены,
	//	|			Период,
	//	|			ДвиженияИГраницыПериода,
	//	|			,
	//	|			&ПорядокСубконтоЦена,
	//	|			Организация = &Организация
	//	|				И Субконто1 В
	//	|					(ВЫБРАТЬ
	//	|						ТаблицаТовары.Номенклатура
	//	|					ИЗ
	//	|						ТаблицаТовары КАК ТаблицаТовары)
	//	|				И &ТекстУсловияЦены) КАК ХозрасчетныйЦена
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ХозрасчетныйЦена.Субконто1,
	//	|	ХозрасчетныйЦена.Счет
	//	|
	//	|ИНДЕКСИРОВАТЬ ПО
	//	|	Субконто1,
	//	|	Счет";
	//	
	//	ТекстЗапросаИнвентаризация = ТекстЗапросаИнвентаризация + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	//		
	//	Если НЕ ЗначениеЗаполнено(ПараметрыЗаполнения.Склад)
	//	   И ЗначениеЗаполнено(ПараметрыЗаполнения.ОтветственноеЛицо) Тогда
	//	   
	//	   // Для счёта 10.11 отложенное проведение не используется, поэтому сумма всегда на дату документа.
	//	   
	//	   ТекстЗапросаИнвентаризация = ТекстЗапросаИнвентаризация +
	//		"ВЫБРАТЬ
	//		|	ХозрасчетныйОстатки.Счет КАК Счет,
	//		|	ХозрасчетныйОстатки.Субконто1 КАК Субконто1,
	//		|	ХозрасчетныйОстатки.СуммаОстаток КАК СуммаОстаток,
	//		|	ХозрасчетныйОстатки.КоличествоОстаток КАК КоличествоОстаток
	//		|ПОМЕСТИТЬ ХозрасчетныйМОЛ
	//		|ИЗ
	//		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	//		|			&МоментАнализаОстатков,
	//		|			НЕ Счет В (&ИсклСчета),
	//		|			&ПорядокСубконтоМОЛ,
	//		|			НЕ &АктуальностьНаКонецМесяца
	//		|				И Организация = &Организация
	//		|				И Субконто2 В (&МОЛ)) КАК ХозрасчетныйОстатки
	//		|
	//		|ИНДЕКСИРОВАТЬ ПО
	//		|	Субконто1,
	//		|	Счет
	//		|;
	//		|
	//		|////////////////////////////////////////////////////////////////////////////////
	//		|ВЫБРАТЬ
	//		|	ТаблицаТовары.СчетУчета КАК СчетУчета,
	//		|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
	//		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	//		|	ВЫБОР
	//		|		КОГДА ЕСТЬNULL(ХозрасчетныйЦена.КоличествоДляЦены, 0) + ЕСТЬNULL(ХозрасчетныйМОЛ.КоличествоОстаток, 0) = 0
	//		|			ТОГДА ТаблицаТовары.Цена
	//		|		ИНАЧЕ ЕСТЬNULL(ХозрасчетныйЦена.СуммаДляЦены, 0) + ЕСТЬNULL(ХозрасчетныйМОЛ.СуммаОстаток, 0)
	//		|	КОНЕЦ КАК СуммаДляЦены,
	//		|	ВЫБОР
	//		|		КОГДА ЕСТЬNULL(ХозрасчетныйЦена.КоличествоДляЦены, 0) + ЕСТЬNULL(ХозрасчетныйМОЛ.КоличествоОстаток, 0) = 0
	//		|			ТОГДА 1
	//		|		ИНАЧЕ ЕСТЬNULL(ХозрасчетныйЦена.КоличествоДляЦены, 0) + ЕСТЬNULL(ХозрасчетныйМОЛ.КоличествоОстаток, 0)
	//		|	КОНЕЦ КАК КоличествоДляЦены,
	//		|	ВЫБОР
	//		|		КОГДА ЕСТЬNULL(ХозрасчетныйОстаткиКоличество.КоличествоОстаток, 0) + ЕСТЬNULL(ХозрасчетныйМОЛ.КоличествоОстаток, 0) > 0
	//		|			ТОГДА ЕСТЬNULL(ХозрасчетныйОстаткиКоличество.КоличествоОстаток, 0) + ЕСТЬNULL(ХозрасчетныйМОЛ.КоличествоОстаток, 0)
	//		|		ИНАЧЕ 0
	//		|	КОНЕЦ КАК КоличествоУчет,
	//		|	ТаблицаТовары.Количество КАК Количество,
	//		|	ТаблицаТовары.ЦенаВРознице КАК ЦенаВРознице,
	//		|	ТаблицаТовары.Сумма КАК Сумма
	//		|ИЗ
	//		|	ТаблицаТовары КАК ТаблицаТовары
	//		|		ЛЕВОЕ СОЕДИНЕНИЕ ХозрасчетныйМОЛ КАК ХозрасчетныйМОЛ
	//		|		ПО ТаблицаТовары.Номенклатура = ХозрасчетныйМОЛ.Субконто1
	//		|			И ТаблицаТовары.СчетУчета = ХозрасчетныйМОЛ.Счет
	//		|		ЛЕВОЕ СОЕДИНЕНИЕ ХозрасчетныйОстаткиКоличество КАК ХозрасчетныйОстаткиКоличество
	//		|			ЛЕВОЕ СОЕДИНЕНИЕ ХозрасчетныйЦена КАК ХозрасчетныйЦена
	//		|			ПО ХозрасчетныйОстаткиКоличество.Субконто1 = ХозрасчетныйЦена.Субконто1
	//		|				И ХозрасчетныйОстаткиКоличество.Счет = ХозрасчетныйЦена.Счет
	//		|		ПО ТаблицаТовары.Номенклатура = ХозрасчетныйОстаткиКоличество.Субконто1
	//		|			И ТаблицаТовары.СчетУчета = ХозрасчетныйОстаткиКоличество.Счет"
	//		
	//	Иначе
	//		
	//		ТекстЗапросаИнвентаризация = ТекстЗапросаИнвентаризация +
	//		"ВЫБРАТЬ
	//		|	ТаблицаТовары.СчетУчета КАК СчетУчета,
	//		|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
	//		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	//		|	ЕСТЬNULL(ХозрасчетныйЦена.СуммаДляЦены, ТаблицаТовары.Цена) КАК СуммаДляЦены,
	//		|	ЕСТЬNULL(ХозрасчетныйЦена.КоличествоДляЦены, 1) КАК КоличествоДляЦены,
	//		|	ЕСТЬNULL(ХозрасчетныйОстаткиКоличество.КоличествоОстаток, 0) КАК КоличествоУчет,
	//		|	ТаблицаТовары.Количество КАК Количество,
	//		|	ТаблицаТовары.ЦенаВРознице КАК ЦенаВРознице,
	//		|	ТаблицаТовары.Сумма КАК Сумма
	//		|ИЗ
	//		|	ТаблицаТовары КАК ТаблицаТовары
	//		|		ЛЕВОЕ СОЕДИНЕНИЕ ХозрасчетныйОстаткиКоличество КАК ХозрасчетныйОстаткиКоличество
	//		|			ЛЕВОЕ СОЕДИНЕНИЕ ХозрасчетныйЦена КАК ХозрасчетныйЦена
	//		|			ПО ХозрасчетныйОстаткиКоличество.Субконто1 = ХозрасчетныйЦена.Субконто1
	//		|				И ХозрасчетныйОстаткиКоличество.Счет = ХозрасчетныйЦена.Счет
	//		|		ПО ТаблицаТовары.Номенклатура = ХозрасчетныйОстаткиКоличество.Субконто1
	//		|			И ТаблицаТовары.СчетУчета = ХозрасчетныйОстаткиКоличество.Счет";
	//	
	//	КонецЕсли;
	//	
	//	ТекстЗапросаИнвентаризация = ТекстЗапросаИнвентаризация + "
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	НомерСтроки";
	//	
	//Иначе
	//	СхемаЗапроса = Новый СхемаЗапроса();
	//	
	//	СхемаЗапроса.УстановитьТекстЗапроса(
	//	"ВЫБРАТЬ
	//	|	ХозрасчетныйОстаткиКоличество.Счет КАК Счет,
	//	|	ХозрасчетныйОстаткиКоличество.Субконто1 КАК Субконто1,
	//	|	СУММА(ХозрасчетныйОстаткиКоличество.КоличествоОстаток) КАК КоличествоОстаток
	//	|ПОМЕСТИТЬ ХозрасчетныйОстаткиКоличество
	//	|ИЗ
	//	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	//	|			&МоментАнализаОстатков,
	//	|			&ТекстУсловияСчетов,
	//	|			&ПорядокСубконтоКоличество,
	//	|			Организация = &Организация
	//	|				И &ТекстУсловияКоличества) КАК ХозрасчетныйОстаткиКоличество
	//	|ГДЕ
	//	|	ХозрасчетныйОстаткиКоличество.КоличествоОстаток > 0
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ХозрасчетныйОстаткиКоличество.Счет,
	//	|	ХозрасчетныйОстаткиКоличество.Субконто1
	//	|
	//	|ИНДЕКСИРОВАТЬ ПО
	//	|	Счет,
	//	|	Субконто1
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ХозрасчетныйЦена.Счет КАК Счет,
	//	|	ХозрасчетныйЦена.Субконто1 КАК Субконто1,
	//	|	СУММА(ВЫБОР
	//	|			КОГДА ХозрасчетныйЦена.КоличествоКонечныйОстаток <> 0
	//	|				ТОГДА ХозрасчетныйЦена.КоличествоКонечныйОстаток
	//	|			КОГДА ХозрасчетныйЦена.КоличествоОборотКт <> 0
	//	|				ТОГДА ХозрасчетныйЦена.КоличествоОборотКт
	//	|			КОГДА ХозрасчетныйЦена.КоличествоОборотДт <> 0
	//	|				ТОГДА ХозрасчетныйЦена.КоличествоОборотДт
	//	|			ИНАЧЕ 0
	//	|		КОНЕЦ) КАК КоличествоДляЦены,
	//	|	СУММА(ВЫБОР
	//	|			КОГДА ХозрасчетныйЦена.КоличествоКонечныйОстаток <> 0
	//	|				ТОГДА ХозрасчетныйЦена.СуммаКонечныйОстаток
	//	|			КОГДА ХозрасчетныйЦена.КоличествоОборотКт <> 0
	//	|				ТОГДА ХозрасчетныйЦена.СуммаОборотКт
	//	|			КОГДА ХозрасчетныйЦена.КоличествоОборотДт <> 0
	//	|				ТОГДА ХозрасчетныйЦена.СуммаОборотДт
	//	|			ИНАЧЕ 0
	//	|		КОНЕЦ) КАК СуммаДляЦены
	//	|ПОМЕСТИТЬ ХозрасчетныйЦена
	//	|ИЗ
	//	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	//	|			&НачалоМесяца,
	//	|			&МоментАнализаЦены,
	//	|			Период,
	//	|			ДвиженияИГраницыПериода,
	//	|			&ТекстУсловияСчетов,
	//	|			&ПорядокСубконтоЦена,
	//	|			Организация = &Организация
	//	|				И &ТекстУсловияЦены) КАК ХозрасчетныйЦена
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ХозрасчетныйЦена.Счет,
	//	|	ХозрасчетныйЦена.Субконто1
	//	|
	//	|ИНДЕКСИРОВАТЬ ПО
	//	|	Счет,
	//	|	Субконто1
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ХозрасчетныйОстаткиКоличество.Счет КАК СчетУчета,
	//	|	ХозрасчетныйОстаткиКоличество.Счет.Порядок КАК Порядок,
	//	|	ХозрасчетныйОстаткиКоличество.Субконто1 КАК Номенклатура,
	//	|	ЕСТЬNULL(ХозрасчетныйЦена.СуммаДляЦены, 0) КАК СуммаДляЦены,
	//	|	ЕСТЬNULL(ХозрасчетныйЦена.КоличествоДляЦены, 0) КАК КоличествоДляЦены,
	//	|	ХозрасчетныйОстаткиКоличество.КоличествоОстаток КАК КоличествоУчет
	//	|ИЗ
	//	|	ХозрасчетныйОстаткиКоличество КАК ХозрасчетныйОстаткиКоличество
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ХозрасчетныйЦена КАК ХозрасчетныйЦена
	//	|		ПО ХозрасчетныйОстаткиКоличество.Счет = ХозрасчетныйЦена.Счет
	//	|			И ХозрасчетныйОстаткиКоличество.Субконто1 = ХозрасчетныйЦена.Субконто1
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ХозрасчетныйОстатки.Счет,
	//	|	ХозрасчетныйОстатки.Счет.Порядок,
	//	|	ХозрасчетныйОстатки.Субконто1,
	//	|	ХозрасчетныйОстатки.СуммаОстаток,
	//	|	ХозрасчетныйОстатки.КоличествоОстаток,
	//	|	ХозрасчетныйОстатки.КоличествоОстаток
	//	|ИЗ
	//	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	//	|			&МоментАнализаОстатков, // Для счёта 10.11 отложенное проведение не используется, поэтому сумма всегда на дату документа.
	//	|			НЕ Счет В (&ИсклСчета),
	//	|			&ПорядокСубконтоМОЛ,
	//	|			НЕ &АктуальностьНаКонецМесяца
	//	|				И Организация = &Организация
	//	|				И Субконто2 В (&МОЛ)) КАК ХозрасчетныйОстатки
	//	|ГДЕ
	//	|	ХозрасчетныйОстатки.КоличествоОстаток > 0
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	Порядок,
	//	|	Номенклатура");
	//	
	//	Если ЗначениеЗаполнено(ПараметрыЗаполнения.Склад) ИЛИ НЕ ЗначениеЗаполнено(ПараметрыЗаполнения.ОтветственноеЛицо) Тогда
	//		СхемаЗапроса.ПакетЗапросов[2].Операторы.Удалить(1);
	//	КонецЕсли; 
	//	
	//	ТекстЗапросаИнвентаризация = СхемаЗапроса.ПолучитьТекстЗапроса();
	//КонецЕсли;
	//
	//ТекстЗапросаИнвентаризация = СтрЗаменить(ТекстЗапросаИнвентаризация, "&ТекстУсловияСчетов",       ТекстУсловияСчетов);
	//ТекстЗапросаИнвентаризация = СтрЗаменить(ТекстЗапросаИнвентаризация, "И &ТекстУсловияКоличества", ТекстУсловияКоличества);
	//ТекстЗапросаИнвентаризация = СтрЗаменить(ТекстЗапросаИнвентаризация, "И &ТекстУсловияЦены",       ТекстУсловияЦены);
	//
	//Запрос.Текст = ТекстЗапросаИнвентаризация;
	//
	//Возврат Запрос;
	
КонецФункции

// Заполняет документ по остаткам на складе.
//
// Параметры:
//  ПараметрыЗаполнения - Структура - см. НовыеПараметрыЗаполнения().
// 
Функция ЗаполнитьПоОстаткамНаСкладе(ПараметрыЗаполнения)

	Запрос = ПодготовитьЗапросИнвентаризация(ПараметрыЗаполнения);
	
	ТаблицаТовары = Документы.ИнвентаризацияТоваровНаСкладе.ПустаяСсылка().Товары.ВыгрузитьКолонки();
	
	// При оперативном проведении моментом актуальности является дата документа.
	// Если используется отложенное проведение, то отдельно определяются остатки
	// по количеству и сумме по счетам, которые рассчитываются оперативно, а по всем
	// остальным счетам цена определяется в целом за месяц аналогично тому,
	// как рассчитывает корректировка стоимости списания.
	РассчитатьЦеныНаМоментАктуальности(ТаблицаТовары, Ложь, Запрос, ПараметрыЗаполнения);
	
	Если ПараметрыЗаполнения.ИспользуетсяОтложенноеПроведение Тогда
		// При отложенном проведении делаем второй вызов для счетов,
		// суммы по которым рассчитываются неоперативно (целиком за месяц),
		// поэтому момент актуальности - это конец месяца.
		РассчитатьЦеныНаМоментАктуальности(ТаблицаТовары, Истина, Запрос, ПараметрыЗаполнения);
	КонецЕсли;
	
	Возврат ТаблицаТовары;
	
КонецФункции

Процедура РассчитатьЦеныНаМоментАктуальности(ТаблицаТовары, АктуальностьНаКонецМесяца, Запрос, ПараметрыЗаполнения)
	
	//Если АктуальностьНаКонецМесяца Тогда // нужно рассчитать цену с учётом корректировки стоимости
	//	МоментАнализаЦены  = Новый Граница(КонецМесяца(ПараметрыЗаполнения.Дата), ВидГраницы.Включая);
	//	МоментНачалаМесяца = Новый Граница(НачалоМесяца(ПараметрыЗаполнения.Дата), ВидГраницы.Включая);
	//ИначеЕсли ПараметрыЗаполнения.Дата = НачалоМесяца(ПараметрыЗаполнения.Дата) Тогда // используем только остатки
	//	МоментАнализаЦены  = Новый Граница(ПараметрыЗаполнения.Дата, ВидГраницы.Исключая);
	//	МоментНачалаМесяца = Новый Граница(ПараметрыЗаполнения.Дата - 1, ВидГраницы.Исключая);
	//Иначе // нужно рассчитать цену на дату документа
	//	МоментАнализаЦены = ПараметрыЗаполнения.Дата;
	//	МоментНачалаМесяца = НачалоМесяца(ПараметрыЗаполнения.Дата);
	//КонецЕсли;
	//
	//Запрос.УстановитьПараметр("АктуальностьНаКонецМесяца", АктуальностьНаКонецМесяца);
	//Запрос.УстановитьПараметр("НачалоМесяца",              МоментНачалаМесяца);
	//Запрос.УстановитьПараметр("МоментАнализаЦены",         МоментАнализаЦены);
	//
	//ВалютаРегламентированногоУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	//ДанныеСклада = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПараметрыЗаполнения.Склад, "ТипСклада, ТипЦенРозничнойТорговли");
	//ТолькоПерезаполнение = (ПараметрыЗаполнения.НазваниеДействия = "ПерезаполнитьУчетныеКоличества");
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	
	//	СтрокаТабличнойЧасти = ТаблицаТовары.Добавить();

	//	СтрокаТабличнойЧасти.Номенклатура   = Выборка.Номенклатура;
	//	СтрокаТабличнойЧасти.КоличествоУчет = Выборка.КоличествоУчет;
	//	СтрокаТабличнойЧасти.СчетУчета	    = Выборка.СчетУчета;
	//	
	//	Цена = ?(Выборка.КоличествоДляЦены = 0, 0, Выборка.СуммаДляЦены / Выборка.КоличествоДляЦены);
	//	
	//	СтрокаТабличнойЧасти.СуммаУчет = Цена * Выборка.КоличествоУчет;
	//	СтрокаТабличнойЧасти.Цена      = Цена;

	//	Если ТолькоПерезаполнение Тогда
	//		
	//		СтрокаТабличнойЧасти.Количество   = Выборка.Количество;
	//		СтрокаТабличнойЧасти.ЦенаВРознице = Выборка.ЦенаВРознице;
	//		
	//		СтрокаТабличнойЧасти.Сумма        = Цена * Выборка.Количество;
	//		
	//	Иначе
	//		
	//		СтрокаТабличнойЧасти.Количество = СтрокаТабличнойЧасти.КоличествоУчет;
	//		СтрокаТабличнойЧасти.Сумма      = СтрокаТабличнойЧасти.СуммаУчет;
	//		Если ДанныеСклада.ТипСклада = Перечисления.ТипыСкладов.НеавтоматизированнаяТорговаяТочка Тогда
	//			СтрокаТабличнойЧасти.ЦенаВРознице = Ценообразование.ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура,
	//				ДанныеСклада.ТипЦенРозничнойТорговли, ПараметрыЗаполнения.Дата, ВалютаРегламентированногоУчета, 1, 1);
	//		КонецЕсли;
	//		
	//	КонецЕсли;

	//КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Функция ПолучитьОтделение(Дата, Ломбард)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
		|ИЗ
		|	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, Ломбард = &Ломбард) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
		|ГДЕ
		|	НЕ ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.Закрыт
		|	И НЕ ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Отделение;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция ПолучитьГород(Ломбард)
	ОтборКИ = Новый Структура;
	ОтборКИ.Вставить("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес); 
	ОтборКИ.Вставить("Вид", справочники.ВидыКонтактнойИнформации.ФактАдресЛомбарда);
	СтрокиКИ = Ломбард.КонтактнаяИнформация.НайтиСтроки(ОтборКИ);
	Если строкиКИ.Количество() = 0 Тогда 
		Возврат "Адрес ломбарда заполнен строкой, а не по муниципальному или административному делению.";
	Иначе
		Возврат СтрокиКИ.Получить(0).Город;
	КонецЕсли;	
КонецФункции	

Функция ПолучитьДатуОХ(Дата, ОЗ, НомерЗБ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СостояниеОбъектаЗалога.Регистратор КАК Регистратор,
		|	ЛБ_СостояниеОбъектаЗалога.Регистратор.ВидОперации КАК РегистраторВидОперации,
		|	ЛБ_СостояниеОбъектаЗалога.Период КАК Период,
		|	ЛБ_СостояниеОбъектаЗалога.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога
		|ИЗ
		|	РегистрСведений.ЛБ_СостояниеОбъектаЗалога КАК ЛБ_СостояниеОбъектаЗалога
		|ГДЕ
		|	ЛБ_СостояниеОбъектаЗалога.Период <= &Дата
		|	И ЛБ_СостояниеОбъектаЗалога.ОбъектЗалога = &ОбъектЗалога
		|	И (ЛБ_СостояниеОбъектаЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение)
		|			ИЛИ ЛБ_СостояниеОбъектаЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Наследство))
		|	И ЛБ_СостояниеОбъектаЗалога.Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		|	И ЛБ_СостояниеОбъектаЗалога.Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		|	И НЕ ЛБ_СостояниеОбъектаЗалога.Регистратор В
		|				(ВЫБРАТЬ
		|					ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
		|				ИЗ
		|					РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&Дата, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
		|				ГДЕ
		|					ЛБ_ОтменыОперацийЗБСрезПоследних.НомерЗалоговогоБилета ПОДОБНО ""%"" + &НомерЗалоговогоБилета + ""%"")
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_СостояниеОбъектаЗалога.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ОбъектЗалога", ОЗ);
	Запрос.УстановитьПараметр("НомерЗалоговогоБилета", НомерЗБ);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Период;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция ПроверитьНаличиеИзменений(Колонки, Строка)
	Для каждого Элем Из Колонки Цикл
		КолонкаФакт = Колонки.Найти(Элем.Имя + "Факт");
		Если КолонкаФакт <> Неопределено Тогда
			Если Строка[Элем.Имя] <> Строка[Элем.Имя + "Факт"] Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

Функция ПолучитьОписаниеОЗ(Дата, ОЗ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога.Код КАК ОбъектЗалогаКод,
		|	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОписаниеОЗ КАК ОписаниеОЗ
		|ИЗ
		|	РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(&Дата, ОбъектЗалога = &ОбъектЗалога) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ОбъектЗалога", ОЗ);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.ОписаниеОЗ;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

#КонецЕсли