#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	// ++ Сербаев 10.05.2023
	//ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения, Истина); 

	//Если ЗначениеЗаполнено(Склад) Тогда
	//	ОтветственноеЛицо = ОтветственныеЛицаБП.ОтветственноеЛицоНаСкладе(Склад, Дата);
	//КонецЕсли;
	// -- Сербаев 10.05.2023

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата 		  = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты) 
	
	// ++ Сербаев 10.05.2023 
	Проверка = ПроверяемыеРеквизиты.Найти("Организация");
    Если Проверка <> Неопределено Тогда
        ПроверяемыеРеквизиты.Удалить(Проверка);
    КонецЕсли;
    // -- Сербаев 10.05.2023
	
	//МассивНепроверяемыхРеквизитов = Новый Массив;
	//
	//ТипСклада = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "ТипСклада");
	//
	//МассивНепроверяемыхРеквизитов.Добавить("Товары.КоличествоУчет");
	//МассивНепроверяемыхРеквизитов.Добавить("Товары.Количество");
	//
	//Для каждого Строка Из Товары Цикл
	//	
	//	Префикс = "Товары[" + Формат(Строка.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";
	//	ИмяСписка = НСтр("ru = 'Товары'");
	//	
	//	Если Строка.Количество = 0 И Строка.КоличествоУчет = 0 Тогда
	//		
	//		ИмяПоля = НСтр("ru = 'Количество'");
	//		Поле = Префикс + "Количество";
	//		
	//		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Заполнение", 
	//			ИмяПоля, Строка.НомерСтроки, ИмяСписка, ТекстСообщения);
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
	//		
	//		ИмяПоля = НСтр("ru = 'Количество учетное'");
	//		Поле = Префикс + "КоличествоУчет";
	//		
	//		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Заполнение", 
	//			ИмяПоля, Строка.НомерСтроки, ИмяСписка, ТекстСообщения);
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
	//		
	//	КонецЕсли;
	//
	//КонецЦикла;
	//
	//ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	//СчетаУчетаВДокументах.ПроверитьЗаполнение(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	////+Мельников 06.05.24
	//Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ДатаНачалаИнвентаризации) Тогда
	//	ЭтотОбъект.ДатаНачалаИнвентаризации = ЭтотОбъект.Дата;
	//КонецЕсли;
	////-Мельников
	
	// При групповом перепроведении реквизиты документов не меняются,
	// поэтому обновление связанных данных выполнять не требуется.
	//Если ПроведениеСервер.ГрупповоеПерепроведение(ЭтотОбъект) Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//СчетаУчетаВДокументах.ЗаполнитьПередЗаписью(ЭтотОбъект, РежимЗаписи); 

КонецПроцедуры 


#КонецЕсли

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//
	//+МАН 01.11.24 На данный момент итоги инвентаризации ни где и не как не фиксируются, носят только информационный характер.
	//В связи с этим вся обработка проведения документа закомментирована.
	//
	 	////Обработка ТЧ товары
	//++ООВ 06.04.2026 Заявка 3757 Обработка проведения документа частично раскомментирована
	Для каждого СтрТовары Из Товары Цикл
		Если 
			//СтрТовары.ВидИзделия <> СтрТовары.ВидИзделияФакт ИЛИ 
			СтрТовары.Проба <> СтрТовары.ПробаФакт 
			//ИЛИ CтрТовары.Именник <> СтрТовары.ИменникФакт ИЛИ СтрТовары.ДанныеИменника <> СтрТовары.ДанныеИменникаФакт ИЛИ
			//СтрТовары.Клеймо <> СтрТовары.КлеймоФакт ИЛИ СтрТовары.Категория <> СтрТовары.КатегорияФакт 
			ИЛИ СтрТовары.ОбщаяМасса <> СтрТовары.ОбщаяМассаФакт ИЛИ СтрТовары.МассаМеталла <> СтрТовары.МассаМеталлаФакт ИЛИ
			//++ООВ 06.04.2026 Заявка 3757
			СтрТовары.Количество <> СтрТовары.КоличествоФакт ИЛИ 
			//--ООВ 06.04.2026 Заявка 3757
			СтрТовары.СуммаОценкиМеталлы <> СтрТовары.СуммаОценкиМеталлыФакт ИЛИ СтрТовары.СуммаОценки <> СтрТовары.СуммаОценкиФакт Тогда
			
			//Отбор = Новый Структура;
			//Отбор.Вставить("ОбъектЗалога", СтрТовары.ОбъектЗалога);
			
	//		СтрокиВставкиКамнейПоОЗ = ЭтотОбъект.ВставкиФакт.НайтиСтроки(Отбор);
	//		СтрокиВставкиМеталлаПоОЗ = ЭтотОбъект.ВставкиМеталла.НайтиСтроки(Отбор);
		
			//Запись изменений по ОЗ
			// регистр ЛБ_РеквизитыОбъектаЗалога
			Движения.ЛБ_РеквизитыОбъектаЗалога.Записывать = Истина;
			
			Движение = Движения.ЛБ_РеквизитыОбъектаЗалога.Добавить();
			Движение.Период = Дата;
			Движение.ОбъектЗалога = СтрТовары.ОбъектЗалога;
			Движение.ЗалоговыйБилет = СтрТовары.ОперацияЗайма;
			Движение.Артикул = СтрТовары.Артикул;
			Движение.ВидИзделия = СтрТовары.ВидИзделияФакт;
			Движение.Проба = СтрТовары.ПробаФакт;
			Движение.Категория = СтрТовары.КатегорияФакт;
			Движение.Клеймо = СтрТовары.КлеймоФакт;
			Движение.Именник = СтрТовары.ИменникФакт;
			Движение.ДанныеИменника = СтрТовары.ДанныеИменникаФакт;
			Движение.СостояниеИзделия = СтрТовары.СостояниеИзделия;
			Движение.Дефекты = СтрТовары.Дефекты;
			Движение.ЕдиницаИзмерения = СтрТовары.ЕдиницаИзмерения;
			Движение.Вес = СтрТовары.ОбщаяМассаФакт;
			Движение.ВесЧистый = СтрТовары.МассаМеталлаФакт;
			Движение.ВесВПробеЧистоты = ЛБ_ОбщийМодуль.ПеревестиВЧистоту(СтрТовары.МассаМеталлаФакт, СтрТовары.ПробаФакт);
			Движение.Цена = СтрТовары.ЦенаФакт;
			Движение.СуммаОценки = СтрТовары.СуммаОценкиФакт;
			Движение.ОписаниеИзделия = СтрТовары.ОписаниеИзделия;
			Движение.СуммаОценкиМакс = СтрТовары.СуммаОценкиМакс;
			Движение.СуммаОценкиМеталлы = СтрТовары.СуммаОценкиМеталлыФакт;
			Движение.СуммаОценкиКамни = СтрТовары.СуммаОценкиКамниФакт;
			Движение.НомерСтрокиТаблицы = СтрТовары.НомерСтрокиТаблицы;
			Движение.СуммаСсуды = СтрТовары.СуммаЗайма;
			Движение.Вес30 = СтрТовары.Вес30;
			
			//Состояние объекта залога
			// регистр ЛБ_СостояниеОбъектаЗалога
			Движения.ЛБ_СостояниеОбъектаЗалога.Записывать = Истина;
			
			Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить();
			Движение.Период = Дата;
			Движение.ОбъектЗалога = СтрТовары.ОбъектЗалога;
			Движение.ЗалоговыйБилет = СтрТовары.ОперацияЗайма;
			Движение.СтатусОбъектаЗалога = СтрТовары.СтатусОбъектаЗалога;
			Движение.СуммаОценкиНачальная = СтрТовары.СуммаОценкиНачальная;
			Движение.СуммаОценки = СтрТовары.СуммаОценкиФакт;
			Движение.СуммаЗайма = СтрТовары.СуммаЗайма;
			Движение.СуммаДолгаЗайма = СтрТовары.СуммаДолгаЗайма;
			
	//		//Объекты залога
	//		// регистр ЛБ_ОбъектыЗалога 
			Движения.ЛБ_ОбъектыЗалога.Записывать = Истина;
			
			//Расход со старыми данными
			Движение = Движения.ЛБ_ОбъектыЗалога.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Ломбард = Ломбард; 
			 //++ООВ 06.04.2026 Заявка 3757
			Движение.Склад = Склад;
			 //--ООВ 06.04.2026 Заявка 3757
			Движение.ЗалоговыйБилет = СтрТовары.ОперацияЗайма;
			Движение.ОбъектЗалога = СтрТовары.ОбъектЗалога;
		//	Движение.ОтказОтВыкупа = СтрТовары.ОтказОтВыкупа;
			Движение.Количество = СтрТовары.Количество;
		//	Движение.СуммаОценкиНачальная = СтрТовары.СуммаОценкиНачальная;
			Движение.СуммаОценки = СтрТовары.СуммаОценки;

	//		//Приход с новыми данными
	//		Движение = Движения.ЛБ_ОбъектыЗалога.Добавить();
	//		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//		Движение.Период = Дата;
	//		Движение.Организация = Организация;
	//		Движение.Ломбард = Ломбард;
	//		Движение.ЗалоговыйБилет = СтрТовары.ОперацияЗайма;
	//		Движение.ОбъектЗалога = СтрТовары.ОбъектЗалога;
	//		Движение.ОтказОтВыкупа = СтрТовары.ОтказОтВыкупа;
	//		Движение.Количество = СтрТовары.КоличествоФакт;
	//		Движение.СуммаОценкиНачальная = СтрТовары.СуммаОценкиНачальная;
	//		Движение.СуммаОценки = СтрТовары.СуммаОценкиФакт;
	//		
	//		//Вставки камней
	//		Если СтрокиВставкиКамнейПоОЗ.Количество() > 0 Тогда
	//			Для каждого СтрВК Из СтрокиВставкиКамнейПоОЗ Цикл
	//				Если СтрВК.ВидВставки <> СтрВК.ВидВставкиФакт ИЛИ СтрВК.ФормаОгранки <> СтрВК.ФормаОгранкиФакт ИЛИ
	//					СтрВК.Длина <> СтрВК.ДлинаФакт ИЛИ СтрВК.КачествоОгранки <> СтрВК.КачествоОгранкиФакт ИЛИ
	//					СтрВК.Количество <> СтрВК.КоличествоФакт ИЛИ СтрВК.Вес <> СтрВК.ВесФакт ИЛИ
	//					СтрВК.ЕдиницаИзмерения <> СтрВК.ЕдиницаИзмеренияФакт ИЛИ СтрВК.Цена <> СтрВК.ЦенаФакт ИЛИ
	//					СтрВК.Сумма <> СтрВК.СуммаФакт ИЛИ СтрВК.Диаметр <> СтрВК.ДиаметрФакт ИЛИ 
	//					СтрВК.Диаметр1 <> СтрВК.Диаметр1Факт ИЛИ СтрВК.Диаметр2 <> СтрВК.Диаметр2Факт ИЛИ
	//					СтрВК.Высота <> СтрВК.ВысотаФакт ИЛИ СтрВК.ВесГраммы <> СтрВК.ВесГраммыФакт ИЛИ
	//					СтрВК.ВидОгранки <> СтрВК.ВидОгранкиФакт ИЛИ СтрВК.Ширина <> СтрВК.ШиринаФакт Тогда
	//					
	//					// регистр ЛБ_ВставкиОбъектаЗалога
	//					Движения.ЛБ_ВставкиОбъектаЗалога.Записывать = Истина;
	//					
	//					Движение = Движения.ЛБ_ВставкиОбъектаЗалога.Добавить();
	//					Движение.Период = Дата;
	//					Движение.ЗалоговыйБилет = СтрТовары.ОперацияЗайма;
	//					Движение.ОбъектЗалога = СтрВК.ОбъектЗалога;
	//					Движение.НомерСтрокиТаблицы = СтрВК.НомерСтрокиТаблицы;
	//					Движение.ВидВставки = СтрВК.ВидВставкиФакт;
	//					Движение.ФормаОгранки = СтрВК.ФормаОгранкиФакт;
	//					Движение.ВидОгранки = СтрВК.ВидОгранкиФакт;
	//					Движение.КачествоОгранки = СтрВК.КачествоОгранкиФакт;
	//					Движение.Длина = СтрВК.ДлинаФакт;
	//					Движение.Ширина = СтрВК.ШиринаФакт;
	//					Движение.Высота = СтрВК.ВысотаФакт;
	//					Движение.Диаметр = СтрВК.ДиаметрФакт;
	//					Движение.Диаметр1 = СтрВК.Диаметр1Факт;
	//					Движение.Диаметр2 = СтрВК.Диаметр2Факт;
	//					Движение.ЕдиницаИзмерения = СтрВК.ЕдиницаИзмеренияФакт;
	//					Движение.Вес = СтрВК.ВесФакт;
	//					Движение.ВесГраммы = СтрВК.ВесГраммыФакт;
	//					Движение.НеОценивать = СтрВК.НеОцениватьФакт;
	//					Движение.Цена = СтрВК.ЦенаФакт;
	//					Движение.Количество = СтрВК.КоличествоФакт;
	//					Движение.СуммаОценки = СтрВК.СуммаФакт;
					КонецЕсли;
				КонецЦикла;
	//		КонецЕсли;
	//		
	//		//Вставки металла
	//		Если СтрокиВставкиМеталлаПоОЗ.Количество() > 0 Тогда
	//			Для каждого СтрВМ Из СтрокиВставкиМеталлаПоОЗ Цикл
	//				Если СтрВМ.Проба <> СтрВМ.ПробаФакт ИЛИ СтрВМ.Вес <> СтрВМ.ВесФакт ИЛИ
	//					СтрВМ.ВесВПробеЧистоты <> СтрВМ.ВесВПробеЧистотыФакт ИЛИ СтрВМ.ЕдиницаИзмерения <> СтрВМ.ЕдиницаИзмеренияФакт ИЛИ
	//					СтрВМ.СуммаОценки <> СтрВМ.СуммаОценкиФакт Тогда
	//					
	//					// регистр ЛБ_ДополнительныеМатериалыОбъектаЗалога
	//					Движения.ЛБ_ДополнительныеМатериалыОбъектаЗалога.Записывать = Истина;
	//					
	//					Движение = Движения.ЛБ_ДополнительныеМатериалыОбъектаЗалога.Добавить();
	//					Движение.Период = Дата;
	//					Движение.ЗалоговыйБилет = СтрТовары.ОперацияЗайма;
	//					Движение.ОбъектЗалога = СтрВМ.ОбъектЗалога;
	//					Движение.НомерСтрокиТаблицы = СтрВМ.НомерСтрокиТаблицы;
	//					Движение.Проба = СтрВМ.ПробаФакт;
	//					Движение.ВесЧистый = СтрВМ.ВесФакт;
	//					Движение.ВесВПробеЧистоты = СтрВМ.ВесВПробеЧистотыФакт;
	//					Движение.ЕдиницаИзмерения = СтрВМ.ЕдиницаИзмеренияФакт;
	//					Движение.Цена = СтрВМ.ЦенаФакт;
	//					Движение.СуммаОценки = СтрВМ.СуммаОценкиФакт;
	//				КонецЕсли;
	//			КонецЦикла;
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//КонецЦикла;	
	//
	////Обработка ТЧ новых ОЗ
	//Если ЭтотОбъект.НовыеОЗ.Количество() > 0 Тогда
	//	Для каждого СтрТовары Из НовыеОЗ Цикл
	//		Если СтрТовары.ВидИзделия <> СтрТовары.ВидИзделияФакт ИЛИ СтрТовары.Проба <> СтрТовары.ПробаФакт ИЛИ
	//			СтрТовары.Именник <> СтрТовары.ИменникФакт ИЛИ СтрТовары.ДанныеИменника <> СтрТовары.ДанныеИменникаФакт ИЛИ
	//			СтрТовары.Клеймо <> СтрТовары.КлеймоФакт ИЛИ СтрТовары.Категория <> СтрТовары.КатегорияФакт ИЛИ
	//			СтрТовары.ОбщаяМасса <> СтрТовары.ОбщаяМассаФакт ИЛИ СтрТовары.МассаМеталла <> СтрТовары.МассаМеталлаФакт ИЛИ
	//			СтрТовары.СуммаОценкиМеталлы <> СтрТовары.СуммаОценкиМеталлыФакт ИЛИ СтрТовары.СуммаОценки <> СтрТовары.СуммаОценкиФакт Тогда
	//			
	//			Отбор = Новый Структура;
	//			Отбор.Вставить("ОбъектЗалога", СтрТовары.ОбъектЗалога);
	//			
	//			СтрокиВставкиКамнейПоОЗ = ЭтотОбъект.ВставкиКамнейНовыеОЗ.НайтиСтроки(Отбор);
	//			СтрокиВставкиМеталлаПоОЗ = ЭтотОбъект.ВставкиМеталлаНовыеОЗ.НайтиСтроки(Отбор);
	//			
	//			//Запись изменений по ОЗ
	//			// регистр ЛБ_РеквизитыОбъектаЗалога
	//			Движения.ЛБ_РеквизитыОбъектаЗалога.Записывать = Истина;
	//			
	//			Движение = Движения.ЛБ_РеквизитыОбъектаЗалога.Добавить();
	//			Движение.Период = Дата;
	//			Движение.ОбъектЗалога = СтрТовары.ОбъектЗалога;
	//			Движение.ЗалоговыйБилет = СтрТовары.ОперацияЗайма;
	//			Движение.Артикул = СтрТовары.Артикул;
	//			Движение.ВидИзделия = СтрТовары.ВидИзделияФакт;
	//			Движение.Проба = СтрТовары.ПробаФакт;
	//			Движение.Категория = СтрТовары.КатегорияФакт;
	//			Движение.Клеймо = СтрТовары.КлеймоФакт;
	//			Движение.Именник = СтрТовары.ИменникФакт;
	//			Движение.ДанныеИменника = СтрТовары.ДанныеИменникаФакт;
	//			Движение.СостояниеИзделия = СтрТовары.СостояниеИзделия;
	//			Движение.Дефекты = СтрТовары.Дефекты;
	//			Движение.ЕдиницаИзмерения = СтрТовары.ЕдиницаИзмерения;
	//			Движение.Вес = СтрТовары.ОбщаяМассаФакт;
	//			Движение.ВесЧистый = СтрТовары.МассаМеталлаФакт;
	//			Движение.ВесВПробеЧистоты = ЛБ_ОбщийМодуль.ПеревестиВЧистоту(СтрТовары.МассаМеталлаФакт, СтрТовары.ПробаФакт);
	//			Движение.Цена = СтрТовары.ЦенаФакт;
	//			Движение.СуммаОценки = СтрТовары.СуммаОценкиФакт;
	//			Движение.ОписаниеИзделия = СтрТовары.ОписаниеИзделия;
	//			Движение.СуммаОценкиМакс = СтрТовары.СуммаОценкиМакс;
	//			Движение.СуммаОценкиМеталлы = СтрТовары.СуммаОценкиМеталлыФакт;
	//			Движение.СуммаОценкиКамни = СтрТовары.СуммаОценкиКамниФакт;
	//			Движение.НомерСтрокиТаблицы = СтрТовары.НомерСтрокиТаблицы;
	//			Движение.СуммаСсуды = СтрТовары.СуммаЗайма;
	//			Движение.Вес30 = СтрТовары.Вес30;
	//			
	//			//Состояние объекта залога
	//			// регистр ЛБ_СостояниеОбъектаЗалога
	//			Движения.ЛБ_СостояниеОбъектаЗалога.Записывать = Истина;
	//			
	//			Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить();
	//			Движение.Период = Дата;
	//			Движение.ОбъектЗалога = СтрТовары.ОбъектЗалога;
	//			Движение.ЗалоговыйБилет = СтрТовары.ОперацияЗайма;
	//			Движение.СтатусОбъектаЗалога = СтрТовары.СтатусОбъектаЗалога;
	//			Движение.СуммаОценкиНачальная = СтрТовары.СуммаОценкиНачальная;
	//			Движение.СуммаОценки = СтрТовары.СуммаОценкиФакт;
	//			Движение.СуммаЗайма = СтрТовары.СуммаЗайма;
	//			Движение.СуммаДолгаЗайма = СтрТовары.СуммаДолгаЗайма;
	//			
	//			//Объекты залога
	//			// регистр ЛБ_ОбъектыЗалога Приход
	//			Движения.ЛБ_ОбъектыЗалога.Записывать = Истина;
	//			
	//			Движение = Движения.ЛБ_ОбъектыЗалога.Добавить();
	//			Движение.ВидДвижения = ВидДвиженияНакопления.Приход; //А расход?
	//			Движение.Период = Дата;
	//			Движение.Организация = Организация;
	//			Движение.Ломбард = Ломбард;
	//			Движение.ЗалоговыйБилет = СтрТовары.ОперацияЗайма;
	//			Движение.ОбъектЗалога = СтрТовары.ОбъектЗалога;
	//			Движение.ОтказОтВыкупа = СтрТовары.ОтказОтВыкупа;
	//			Движение.Количество = СтрТовары.КоличествоФакт;
	//			Движение.СуммаОценкиНачальная = СтрТовары.СуммаОценкиНачальная;
	//			Движение.СуммаОценки = СтрТовары.СуммаОценкиФакт;
	//			
	//			//Вставки камней
	//			Если СтрокиВставкиКамнейПоОЗ > 0 Тогда
	//				Для каждого СтрВК Из СтрокиВставкиКамнейПоОЗ Цикл
	//					Если СтрВК.ВидВставки <> СтрВК.ВидВставкиФакт ИЛИ СтрВК.ФормаОгранки <> СтрВК.ФормаОгранкиФакт ИЛИ
	//						СтрВК.Длина <> СтрВК.ДлинаФакт ИЛИ СтрВК.КачествоОгранки <> СтрВК.КачествоОгранкиФакт ИЛИ
	//						СтрВК.Количество <> СтрВК.КоличествоФакт ИЛИ СтрВК.Вес <> СтрВК.ВесФакт ИЛИ
	//						СтрВК.ЕдиницаИзмерения <> СтрВК.ЕдиницаИзмеренияФакт ИЛИ СтрВК.Цена <> СтрВК.ЦенаФакт ИЛИ
	//						СтрВК.Сумма <> СтрВК.СуммаФакт ИЛИ СтрВК.Диаметр <> СтрВК.ДиаметрФакт ИЛИ 
	//						СтрВК.Диаметр1 <> СтрВК.Диаметр1Факт ИЛИ СтрВК.Диаметр2 <> СтрВК.Диаметр2Факт ИЛИ
	//						СтрВК.Высота <> СтрВК.ВысотаФакт ИЛИ СтрВК.ВесГраммы <> СтрВК.ВесГраммыФакт ИЛИ
	//						СтрВК.ВидОгранки <> СтрВК.ВидОгранкиФакт ИЛИ СтрВК.Ширина <> СтрВК.ШиринаФакт Тогда
	//						
	//						// регистр ЛБ_ВставкиОбъектаЗалога
	//						Движения.ЛБ_ВставкиОбъектаЗалога.Записывать = Истина;
	//						
	//						Движение = Движения.ЛБ_ВставкиОбъектаЗалога.Добавить();
	//						Движение.Период = Дата;
	//						Движение.ЗалоговыйБилет = СтрТовары.ОперацияЗайма;
	//						Движение.ОбъектЗалога = СтрВК.ОбъектЗалога;
	//						Движение.НомерСтрокиТаблицы = СтрВК.НомерСтрокиТаблицы;
	//						Движение.ВидВставки = СтрВК.ВидВставкиФакт;
	//						Движение.ФормаОгранки = СтрВК.ФормаОгранкиФакт;
	//						Движение.ВидОгранки = СтрВК.ВидОгранкиФакт;
	//						Движение.КачествоОгранки = СтрВК.КачествоОгранкиФакт;
	//						Движение.Длина = СтрВК.ДлинаФакт;
	//						Движение.Ширина = СтрВК.ШиринаФакт;
	//						Движение.Высота = СтрВК.ВысотаФакт;
	//						Движение.Диаметр = СтрВК.ДиаметрФакт;
	//						Движение.Диаметр1 = СтрВК.Диаметр1Факт;
	//						Движение.Диаметр2 = СтрВК.Диаметр2Факт;
	//						Движение.ЕдиницаИзмерения = СтрВК.ЕдиницаИзмеренияФакт;
	//						Движение.Вес = СтрВК.ВесФакт;
	//						Движение.ВесГраммы = СтрВК.ВесГраммыФакт;
	//						Движение.НеОценивать = СтрВК.НеОцениватьФакт;
	//						Движение.Цена = СтрВК.ЦенаФакт;
	//						Движение.Количество = СтрВК.КоличествоФакт;
	//						Движение.СуммаОценки = СтрВК.СуммаФакт;
	//					КонецЕсли;
	//				КонецЦикла;
	//			КонецЕсли;
	//			
	//			//Вставки металла
	//			Если СтрокиВставкиМеталлаПоОЗ > 0 Тогда
	//				Для каждого СтрВМ Из СтрокиВставкиМеталлаПоОЗ Цикл
	//					Если СтрВМ.Проба <> СтрВМ.ПробаФакт ИЛИ СтрВМ.Вес <> СтрВМ.ВесФакт ИЛИ
	//						СтрВМ.ВесВПробеЧистоты <> СтрВМ.ВесВПробеЧистотыФакт ИЛИ СтрВМ.ЕдиницаИзмерения <> СтрВМ.ЕдиницаИзмеренияФакт ИЛИ
	//						СтрВМ.СуммаОценки <> СтрВМ.СуммаОценкиФакт Тогда
	//						
	//						// регистр ЛБ_ДополнительныеМатериалыОбъектаЗалога
	//						Движения.ЛБ_ДополнительныеМатериалыОбъектаЗалога.Записывать = Истина;
	//						
	//						Движение = Движения.ЛБ_ДополнительныеМатериалыОбъектаЗалога.Добавить();
	//						Движение.Период = Дата;
	//						Движение.ЗалоговыйБилет = СтрТовары.ОперацияЗайма;
	//						Движение.ОбъектЗалога = СтрВМ.ОбъектЗалога;
	//						Движение.НомерСтрокиТаблицы = СтрВМ.НомерСтрокиТаблицы;
	//						Движение.Проба = СтрВМ.ПробаФакт;
	//						Движение.ВесЧистый = СтрВМ.ВесФакт;
	//						Движение.ВесВПробеЧистоты = СтрВМ.ВесВПробеЧистотыФакт;
	//						Движение.ЕдиницаИзмерения = СтрВМ.ЕдиницаИзмеренияФакт;
	//						Движение.Цена = СтрВМ.ЦенаФакт;
	//						Движение.СуммаОценки = СтрВМ.СуммаОценкиФакт;
	//					КонецЕсли;
	//				КонецЦикла;
	//			КонецЕсли;
	//			
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если ЭтотОбъект.Проведен Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	Если ЭтотОбъект.Проведен Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Функция СформироватьСтруктуру(Стр, Набор) //Стр, Регистр)
	
	//СтруктураСтр = Новый Структура;
	
	//СтруктураСтр.Вставить(
	
	//Отбор = Новый Структура;
	
	//Набор.Метаданные()
	//Для каждого СтрНабора Из Набор.Метаданные().Измерения Цикл
	
	ТЗОЗ = Набор.Выгрузить();
	
	//текст = "";
	
	СтруктураСтрокой = "";
	НужнаЗапятая 	 = Ложь;
	
	
	Для Каждого Колонка Из ТЗОЗ.Колонки Цикл
		
		Если Колонка.Имя = "МоментВремени" ИЛИ Колонка.Имя = "Активность" ИЛИ
			Колонка.Имя = "НомерСтроки" ИЛИ Колонка.Имя = "СуммаОценки" Тогда
			Продолжить;
		КонецЕсли;
		
		Если НужнаЗапятая Тогда
			СтруктураСтрокой = СтруктураСтрокой + ","; //?(Колонка.Имя = "МоментВремени", "", ",");
		КонецЕсли;
		
		СтруктураСтрокой = СтруктураСтрокой + Колонка.Имя; //?(Колонка.Имя = "МоментВремени", "", Колонка.Имя);
		НужнаЗапятая     = Истина;
		
	КонецЦикла;
	
	//Для Каждого Строка Из п_ТЗ Цикл
	
	СтруктураСтр = Новый Структура(СтруктураСтрокой);
	ЗаполнитьЗначенияСвойств(СтруктураСтр, Стр);
	
	Если ТЗОЗ.Количество() <> 0 Тогда
		СтруктураСтр.Вставить("Регистратор", ТЗОЗ[0].Регистратор);
		СтруктураСтр.Вставить("Период", ТЗОЗ[0].Период);
	КонецЕсли;

	//
	текст = "";
	
	//Массив.Добавить(НоваяСтрока);
		
	//КонецЦикла;
		//Отбор.Вставить(СтрНабора.Имя, 
		
		//Метаданные.РегистрыСведений[Регистр].Измерения
		
		//СтрНабораВК
		//Отбор.Вставить(СтрНабораВК.Ключ, СтрНабораВК.Значение);
		
		//ТЗОЗ = НаборЗаписейСостояниеОЗ.Выгрузить();
		//НайденнаяСтрокаОЗ = ТЗОЗ.Скопировать(Отбор); // Найти(Стр.ОбъектЗалога, "ОбъектЗалога");
		//НаборЗаписейСостояниеОЗ.Загрузить(НайденнаяСтрокаОЗ); //ТЗОЗ.НайтиСтроки(Отбор));
	//КонецЦикла;
	
	Возврат СтруктураСтр;
	
КонецФункции
