   
&НаСервере
Процедура ЗаполнитьОтборыРегистров()
	Отбор = НастройкаВыбораФормОгранки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидКамня");
    Отбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
    Отбор.Использование  = Истина;
    Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный; 
    Отбор.ПравоеЗначение = Объект.Ссылка;
	
	Отбор = НастройкаВыбораКачестваОгранки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидКамня");
    Отбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
    Отбор.Использование  = Истина;
    Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный; 
    Отбор.ПравоеЗначение = Объект.Ссылка;		                               

    Отбор = НастройкаОграниченияВыбораВидовОгранки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидКамня");
    Отбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
    Отбор.Использование  = Истина;
    Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный; 
    Отбор.ПравоеЗначение = Объект.Ссылка;  
	
	Отбор = ПараметрыОенкиВставок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидКамня");
    Отбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
    Отбор.Использование  = Истина;
    Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный; 
    Отбор.ПравоеЗначение = Объект.Ссылка;
 КонецПроцедуры
   
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ВидКамня = Перечисления.ЛБ_ВидыКамней.Драгоценные;  
	КонецЕсли;	
	ЗаполнитьОтборыРегистров(); 
	УстановитьВидимость();
КонецПроцедуры    

&НаСервере
Процедура УстановитьВидимость()
	Если НЕ Объект.Ссылка = Справочники.ЛБ_ДрагоценныеКамни.Бриллиант Тогда
		Элементы.Страница1.Видимость =ложь; 
		Элементы.Страница2.Видимость =ложь;
	КонецЕсли;	
	Если Объект.НеОценивается Тогда  
		Элементы.СтраницаЗ.Видимость =ложь;
	Иначе	
		Элементы.СтраницаЗ.Видимость =Истина;
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура СоздатьНастройкуФО(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Необходимо сначала записать элемент справочника");
		Возврат;
	КонецЕсли;
	Параметрыформы = новый структура;
	Параметрыформы.Вставить("ВидКамня", Объект.Ссылка);
	ОткрытьФорму("РегистрСведений.ЛБ_НастройкаДопустимыхФормОгранки.ФормаЗаписи", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНастройкуКО(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Необходимо сначала записать элемент справочника");
		Возврат;
	КонецЕсли;
	Параметрыформы = новый структура;
	Параметрыформы.Вставить("ВидКамня", Объект.Ссылка);
	ОткрытьФорму("РегистрСведений.ЛБ_НастройкаДопустимыхКачествОгранки.ФормаЗаписи", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНастройкуВО(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Необходимо сначала записать элемент справочника");
		Возврат;
	КонецЕсли;
	Параметрыформы = новый структура;
	Параметрыформы.Вставить("ВидКамня", Объект.Ссылка);
	ОткрытьФорму("РегистрСведений.ЛБ_НастройкаДопустимыхВидовОгранки.ФормаЗаписи", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПараметрыОценки(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Необходимо сначала записать элемент справочника");
		Возврат;
	КонецЕсли;
	Параметрыформы = новый структура;
	Параметрыформы.Вставить("ВидКамня", Объект.Ссылка);
	ОткрытьФорму("РегистрСведений.ЛБ_ПараметрыОценкиВставокВОбъектахЗалога.ФормаЗаписи", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура НеОцениваетсяПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры
