////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С ДВИЖЕНИЯМИ ДОКУМЕНТОВ

// Процедура удаления существующих движений документа при перепроведении (отмене проведения)
Процедура УдалитьДвиженияРегистратора(ДокументОбъект, Отказ) Экспорт
	
	МассивОбрабатываемыхСтрокТаблицыДвижений = Новый Массив();
	
	// получение списка регистров, по которым существуют движения
	ТаблицаДвижений = ОпределитьНаличиеДвиженийПоРегистратору(ДокументОбъект.Ссылка);
	ТаблицаДвижений.Колонки.Добавить("НаборЗаписей");
	ТаблицаДвижений.Колонки.Добавить("БезусловноеУдаление", Новый ОписаниеТипов("Булево"));
		
	Для Каждого СтрокаДвижения ИЗ ТаблицаДвижений Цикл
		// имя регистра передается как значение, полученное с помощью
		// функции ПолноеИмя() метаданных регистра
		ПозицияТочки = Найти(СтрокаДвижения.Имя, ".");
		ТипРегистра = Лев(СтрокаДвижения.Имя, ПозицияТочки - 1);
		ИмяРегистра = СокрП(Сред(СтрокаДвижения.Имя, ПозицияТочки + 1));

		МассивОбрабатываемыхСтрокТаблицыДвижений.Добавить(СтрокаДвижения);
		
		ЕСли ТипРегистра = "РегистрНакопления" Тогда
			Набор = РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей();
				
		ИначеЕсли ТипРегистра = "РегистрСведений" Тогда
			Набор = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();  			
			
		ИначеЕсли ТипРегистра = "РегистрБухгалтерии" Тогда    //ов -н
			Набор = РегистрыБухгалтерии[ИмяРегистра].СоздатьНаборЗаписей(); //ов -к 			
						
		КонецЕсли;

		Если НЕ ПравоДоступа("Изменение", Набор.Метаданные()) Тогда
			// отсутствуют права на всю таблицу регистра
			ОбщегоНазначения.СообщитьПользователю("Нарушение прав доступа", ДокументОбъект.Ссылка, , СтрокаДвижения.Имя, Отказ);
			Возврат;
		КонецЕсли;

		Набор.Отбор.Регистратор.Установить(ДокументОбъект.Ссылка);			

		// набор не записывается сразу, чтобы не откатывать транзакцию, если впоследствии
		// выяснится, что на один из регистров не хватает прав.		
		СтрокаДвижения.НаборЗаписей = Набор;		
		
	КонецЦикла;	
	
	Для Каждого СтрокаДвижения ИЗ МассивОбрабатываемыхСтрокТаблицыДвижений Цикл		
		Если СтрокаДвижения.БезусловноеУдаление Тогда
			ЗаписатьНаборЗаписейНаСервере(СтрокаДвижения.НаборЗаписей, ДокументОбъект.Ссылка);
		Иначе		
			Попытка
				СтрокаДвижения.НаборЗаписей.Записать();
			Исключение
				// возможно «сработал» RLS или механизм даты запрета изменения
				ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки(), ДокументОбъект.Ссылка, ,СтрокаДвижения.Имя, Отказ);
				ВызватьИсключение "Операция не выполнена";
			КонецПопытки;
		КонецЕсли;	
	КонецЦикла;
	
	ОчисткаКоллекцииДвиженийДокумента(ДокументОбъект);
	
	// Удаление записей регистрации из всех последовательностей
	УдалитьРегистрациюДокументаВПоследовательностях(ДокументОбъект, Истина);

КонецПроцедуры

// Процедура очищает коллекцию движений документа
//
Процедура ОчисткаКоллекцииДвиженийДокумента(ДокументОбъект) Экспорт
		
	Для Каждого Движение ИЗ ДокументОбъект.Движения Цикл
		Если Движение.Количество() > 0 Тогда
			Движение.Очистить();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьНаборЗаписейНаСервере(ПолноеИмяРегистра, Регистратор, ТаблицаДвижений = Неопределено) Экспорт	
	
	// Определим тип регистра
	ПозицияТочки = Найти(ПолноеИмяРегистра, ".");
	ТипРегистра = Лев(ПолноеИмяРегистра, ПозицияТочки - 1);
	ИмяРегистра = СокрП(Сред(ПолноеИмяРегистра, ПозицияТочки + 1));
	
	Если ТипРегистра = "РегистрНакопления" Тогда
		Набор = РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей();
	ИначеЕсли ТипРегистра = "РегистрСведений" Тогда
		Набор = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();  			
	КонецЕсли;

	Набор.Отбор.Регистратор.Установить(Регистратор);
	Если ТаблицаДвижений <> Неопределено Тогда
		Набор.мТаблицаДвижений = ТаблицаДвижений;
		ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(Набор);
	КонецЕсли;
	Набор.Записать();
	
КонецПроцедуры

Функция ОпределитьНаличиеДвиженийПоРегистратору(ДокументСсылка) Экспорт
	ТекстЗапроса = "";	
	// для исключения падения для документов, проводящимся более чем по 256 таблицам
	счетчик_таблиц = 0;
	
	МетаданнныеДокумента = ДокументСсылка.Метаданные();
	
	Если МетаданнныеДокумента.Движения.Количество() = 0 Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Для Каждого Движение ИЗ МетаданнныеДокумента.Движения Цикл
		// в запросе получаем имена регистров, по которым есть хотя бы одно движение
		// например,
		// ВЫБРАТЬ Первые 1 «РегистрНакопления.ТоварыНаСкладах»
		// ИЗ РегистрНакопления.ТоварыНаСкладах
		// ГДЕ Регистратор = &Регистратор
		
		// имя регистра приводим к Строка(200), см. ниже
		ТекстЗапроса = ТекстЗапроса + "
		|" + ?(ТекстЗапроса = "", "", "ОБЪЕДИНИТЬ ВСЕ ") + "
		|ВЫБРАТЬ ПЕРВЫЕ 1 ВЫРАЗИТЬ(""" + Движение.ПолноеИмя() 
		+  """ КАК Строка(200)) КАК Имя ИЗ " + Движение.ПолноеИмя() 
		+ " ГДЕ Регистратор = &Регистратор";
		
		// если в запрос попадает более 256 таблиц – разбиваем его на две части
		// (вариант документа с проведением по 512 регистрам считаем нежизненным)
		счетчик_таблиц = счетчик_таблиц + 1;
		Если счетчик_таблиц = 256 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	ЗАпрос.УстановитьПараметр("Регистратор", ДокументСсылка);
	// при выгрузке для колонки «Имя» тип устанавливается по самой длинной строке из запроса
	// при втором проходе по таблице новое имя может не «влезть», по этому сразу в запросе
	// приводится к строка(200)
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	// если количество таблиц не превысило 256 – возвращаем таблицу
	Если счетчик_таблиц = МетаданнныеДокумента.Движения.Количество() Тогда
		Возврат ТаблицаЗапроса;			
	КонецЕсли;
	
	// таблиц больше чем 256, делаем доп. запрос и дополняем строки таблицы.
	
	ТекстЗапроса = "";
	Для Каждого Движение ИЗ МетаданнныеДокумента.Движения Цикл
		
		Если счетчик_таблиц > 0 Тогда
			счетчик_таблиц = счетчик_таблиц - 1;
			Продолжить;
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + "
		|" + ?(ТекстЗапроса = "", "", "ОБЪЕДИНИТЬ ВСЕ ") + "
		|ВЫБРАТЬ ПЕРВЫЕ 1 """ + Движение.ПолноеИмя() +  """ КАК Имя ИЗ " 
		+ Движение.ПолноеИмя() + " ГДЕ Регистратор = &Регистратор";	
		
		
	КонецЦикла;
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТаблицы = ТаблицаЗапроса.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка);
	КонецЦикла;
	
	Возврат ТаблицаЗапроса;
	
КонецФункции

// Выполняет движение по регистру.
//
// Параметры:
//  НаборДвижений               - набор движений регистра,
//  ПустыеКолонкиСоставногоТипа - структура, содержащая имена измерений,ресурсов и
//  реквизитов составного типа, которые могут содержать пустые ссылки.
//
Процедура ВыполнитьДвижениеПоРегистру(НаборДвижений, ВидДвижения = Неопределено,
	                                  ПустыеКолонкиСоставногоТипа = Неопределено, ЗаполнитьПериод = истина) Экспорт

	ТаблицаДвижений = НаборДвижений.мТаблицаДвижений;
	Если ТаблицаДвижений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустыеКолонкиСоставногоТипа = Неопределено Тогда
		ПустыеКолонкиСоставногоТипа = Новый Структура;
	КонецЕсли;
	
	МетаРег = НаборДвижений.Метаданные();
	ИзмеренияСостТипа = Новый Структура;
	Для Каждого МетаИзм Из МетаРег.Измерения Цикл
		Если (МетаИзм.Тип.Типы().Количество() > 1)
		   И НЕ (ПустыеКолонкиСоставногоТипа.Свойство(МетаИзм.Имя)) Тогда
			ИзмеренияСостТипа.Вставить(МетаИзм.Имя);
		КонецЕсли;
	КонецЦикла;
	Для Каждого МетаРек Из МетаРег.Реквизиты Цикл
		Если (МетаРек.Тип.Типы().Количество() > 1)
		   И НЕ (ПустыеКолонкиСоставногоТипа.Свойство(МетаРек.Имя)) Тогда
			ИзмеренияСостТипа.Вставить(МетаРек.Имя);
		КонецЕсли;
	КонецЦикла;
	Для Каждого МетаРес Из МетаРег.Ресурсы Цикл
		Если (МетаРес.Тип.Типы().Количество() > 1)
		   И НЕ (ПустыеКолонкиСоставногоТипа.Свойство(МетаРес.Имя)) Тогда
			ИзмеренияСостТипа.Вставить(МетаРес.Имя);
		КонецЕсли;
	КонецЦикла;
	
	// Откопируем остальные колонки (структура таблиц совпадает).
	ПерваяКолонка = Истина;
	МассивСтрок   = Новый Массив(ТаблицаДвижений.Количество());
	ЕстьПериод    = НЕ ТаблицаДвижений.Колонки.Найти("Период") = Неопределено;
	Для каждого Колонка Из ТаблицаДвижений.Колонки Цикл

		ИмяКолонки = Колонка.Имя;
		Если ИмяКолонки <> "Период"
		   И ИмяКолонки <> "Активность"
		   И ИмяКолонки <> "НомерСтроки"
		   И ИмяКолонки <> ""
		   И ?(ИмяКолонки = "ВидДвижения", ВидДвижения = Неопределено, Истина)
		   И ИмяКолонки <> "МоментВремени" Тогда
		   
			Если ИзмеренияСостТипа.Свойство(ИмяКолонки) Тогда
				ФлагКолонкиСостТипа = Истина;
			Иначе
				ФлагКолонкиСостТипа = Ложь;
			КонецЕсли;
			
			Индекс = 0;
			Для каждого СтрокаТаблицы Из ТаблицаДвижений Цикл

				Если ПерваяКолонка Тогда
					
					Если ВидДвижения = ВидДвиженияНакопления.Приход Тогда
						СтрокаДвижения = НаборДвижений.ДобавитьПриход();
					ИначеЕсли ВидДвижения = ВидДвиженияНакопления.Расход Тогда
						СтрокаДвижения = НаборДвижений.ДобавитьРасход();
					Иначе
						СтрокаДвижения = НаборДвижений.Добавить(); // Для оборотных регистров
					КонецЕсли;
					
					МассивСтрок[Индекс] = СтрокаДвижения;
					СтрокаДвижения.Период = НаборДвижений.мПериод;
					Если не ЗаполнитьПериод и ЕстьПериод И НЕ СтрокаТаблицы.Период = '00010101' Тогда
						СтрокаДвижения.Период = СтрокаТаблицы.Период;
					Иначе
						СтрокаДвижения.Период = НаборДвижений.мПериод;
					КонецЕсли; 
					
				Иначе
					
					СтрокаДвижения = МассивСтрок[Индекс];
					
				КонецЕсли;
				
				Индекс = Индекс + 1;
				
				ЗначКолонки = СтрокаТаблицы[ИмяКолонки];
				Если ФлагКолонкиСостТипа Тогда

					Очистить = Ложь;
					Если ТипЗнч(ЗначКолонки) = Тип("Число")Тогда
						Если ЗначКолонки = 0 Тогда
							Очистить = Истина;
						КонецЕсли;
					ИначеЕсли ТипЗнч(ЗначКолонки) = Тип("Строка") Тогда
						Если ЗначКолонки = "" Тогда
							Очистить = Истина;
						КонецЕсли;
					ИначеЕсли ТипЗнч(ЗначКолонки) = Тип("Дата") Тогда
						Если ЗначКолонки = '00010101000000' Тогда
							Очистить = Истина;
						КонецЕсли;
					ИначеЕсли ЗначКолонки = Неопределено Или ЗначКолонки.Пустая() Тогда
						Очистить = Истина;
					КонецЕсли;

					Если Очистить Тогда
						СтрокаДвижения[ИмяКолонки] = Неопределено;
					Иначе
						СтрокаДвижения[ИмяКолонки] = ЗначКолонки;
					КонецЕсли;
				Иначе
					СтрокаДвижения[ИмяКолонки] = ЗначКолонки;
				КонецЕсли;
				
			КонецЦикла;
			
			ПерваяКолонка = Ложь;
			
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры // ВыполнитьДвижениеПоРегистру()

// Добавляет в таблицу значений строки из другой таблицы значений и 
// в них значения колонок с совпадающими наименованиями.
//
// Параметры:
//  ТаблицаИсточник - таблица значений, откуда берутся значения.
//  ТаблицаПриемник - таблица значений, куда добавляются строки.
//
Процедура ЗагрузитьВТаблицуЗначений(ТаблицаИсточник, ТаблицаПриемник) Экспорт

	// Заполним значения в совпадающих колонках.
	Для каждого СтрокаТаблицыИсточника Из ТаблицаИсточник Цикл

		СтрокаТаблицыПриемника = ТаблицаПриемник.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыПриемника, СтрокаТаблицыИсточника);

	КонецЦикла;

КонецПроцедуры // ЗагрузитьВТаблицуЗначений()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С ПОСЛЕДОВАТЕЛЬНОСТЯМИ

Процедура УдалитьРегистрациюДокументаВПоследовательностях(ДокументОбъект, ПроверятьДвижения = Ложь)Экспорт
	// получение списка последовательностей в которых зарегистрирован документ
	Если ПроверятьДвижения Тогда
		ТаблицаРегистраций = ОпределитьНаличиеРегистрацииДокументаВПоследовательности(ДокументОбъект);
	КонецЕсли;      
	КоллекцияПоследовательностей = ДокументОбъект.ПринадлежностьПоследовательностям;
	Для Каждого НаборЗаписейРегистрацииВПоследовательности ИЗ КоллекцияПоследовательностей Цикл
		Если (НаборЗаписейРегистрацииВПоследовательности.Количество() > 0)
		  ИЛИ (ПроверятьДвижения И (НЕ ТаблицаРегистраций.Найти(НаборЗаписейРегистрацииВПоследовательности.Метаданные().Имя,"Имя") = Неопределено)) Тогда
		   НаборЗаписейРегистрацииВПоследовательности.Очистить();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры//УдалитьРегистрациюДокументаВПоследовательностях

Функция ОпределитьНаличиеРегистрацииДокументаВПоследовательности(ДокументОбъект) Экспорт
	ТекстЗапроса = "";	
	
	Для Каждого Последовательность ИЗ ДокументОбъект.ПринадлежностьПоследовательностям Цикл
		// в запросе получаем имена последовательностей, в которых документ зарегистрирован
		ТекстЗапроса = ТекстЗапроса + "
		|" + ?(ТекстЗапроса = "", "", "ОБЪЕДИНИТЬ ВСЕ ") + "
		|ВЫБРАТЬ """ + Последовательность.Метаданные().Имя 
		+  """ КАК Имя ИЗ " + Последовательность.Метаданные().ПолноеИмя()  
		+ " ГДЕ Регистратор = &Регистратор";
		
	КонецЦикла;
	
	Если ТекстЗапроса = "" Тогда
		Возврат Новый ТаблицаЗначений();
	Иначе
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Регистратор", ДокументОбъект.Ссылка);
		ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();	
		Возврат ТаблицаЗапроса;
	КонецЕсли;
	
КонецФункции

Функция ВыборЕдиницИзмеренияРасчетаЦенМеталлов() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЛБ_ЕдиницыРасчетаДрагоценныхМеталлов.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	               |ИЗ
	               |	РегистрСведений.ЛБ_ЕдиницыРасчетаДрагоценныхМеталлов КАК ЛБ_ЕдиницыРасчетаДрагоценныхМеталлов";
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции	

Функция ВыборЕдиницИзмеренияРасчетаЦенКамней() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЛБ_ЕдиницыРасчетаДрагоценныхКамней.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	               |ИЗ
	               |	РегистрСведений.ЛБ_ЕдиницыРасчетаДрагоценныхКамней КАК ЛБ_ЕдиницыРасчетаДрагоценныхКамней";
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции	

Функция РассчитатьВесДрагоценногоКамня(ВидКамня, ФормаОгранки, ВидОгранки, КачествоОгранки, Длина = 0, Ширина = 0, Высота = 0) Экспорт 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидКамня", ВидКамня);   
	СписокФО = Новый СписокЗначений;
	СписокФО.Добавить(Справочники.ЛБ_ФормыОгранки.ПустаяСсылка());  
	Если ЗначениеЗаполнено(ФормаОгранки) Тогда 
		СписокФО.Добавить(ФормаОгранки);
	КонецЕсли;	
	Запрос.УстановитьПараметр("ФормаОгранки", СписокФО);
	Запрос.УстановитьПараметр("ВидОгранки", ВидОгранки);
	Запрос.УстановитьПараметр("КачествоОгранки", КачествоОгранки);
	Запрос.УстановитьПараметр("Длина", Длина);
	Запрос.УстановитьПараметр("Ширина", Ширина);
	Запрос.УстановитьПараметр("Высота", Высота);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПравилаРасчетаВесаДрагоценныхКамней.Вес КАК Вес,
	               |	ЛБ_ПравилаРасчетаВесаДрагоценныхКамней.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПравилаРасчетаВесаДрагоценныхКамней КАК ЛБ_ПравилаРасчетаВесаДрагоценныхКамней
	               |ГДЕ
	               |	ЛБ_ПравилаРасчетаВесаДрагоценныхКамней.ВидДрагоценногоКамня = &ВидКамня
	               |	И ЛБ_ПравилаРасчетаВесаДрагоценныхКамней.ФормаОгранки В(&ФормаОгранки)
	               |	И ЛБ_ПравилаРасчетаВесаДрагоценныхКамней.ВидОгранки = &ВидОгранки
	               |	И ЛБ_ПравилаРасчетаВесаДрагоценныхКамней.КачествоОгранки = &КачествоОгранки
	               |	И ЛБ_ПравилаРасчетаВесаДрагоценныхКамней.Длина = &Длина
	               |	И ЛБ_ПравилаРасчетаВесаДрагоценныхКамней.Ширина = &Ширина
	               |	И ЛБ_ПравилаРасчетаВесаДрагоценныхКамней.Высота = &Высота
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ПравилаРасчетаВесаДрагоценныхКамней.ФормаОгранки УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если  Выборка.Следующий() Тогда 
		СтруктураВозврата = Новый структура("Вес, ЕдиницаИзмерения"); 
		СтруктураВозврата.Вес = Выборка.Вес;
		СтруктураВозврата.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
		Возврат СтруктураВозврата;
	КонецЕсли;
	Возврат неопределено;
КонецФункции

Функция ПолучитьВесовуюГруппу(ВидКамня, Вес) Экспорт
	Если Вес = 0  ИЛИ НЕ ЗначениеЗаполнено(ВидКамня) Тогда
		Возврат Справочники.ЛБ_ВесовыеГруппыДрагоценныхКамней.ПустаяСсылка();
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Вес", Вес);
	Запрос.УстановитьПараметр("ВидКамня", ВидКамня);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ВесовыеГруппыДрагоценныхКамней.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЛБ_ВесовыеГруппыДрагоценныхКамней КАК ЛБ_ВесовыеГруппыДрагоценныхКамней
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА ЛБ_ВесовыеГруппыДрагоценныхКамней.ВесОт = 0
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛБ_ВесовыеГруппыДрагоценныхКамней.ВесОт <= &Вес
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА ЛБ_ВесовыеГруппыДрагоценныхКамней.ВесДо = 0
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛБ_ВесовыеГруппыДрагоценныхКамней.ВесДо >= &Вес
	               |		КОНЕЦ
	               |	И ЛБ_ВесовыеГруппыДрагоценныхКамней.ВидДрагоценногоКамня = &ВидКамня";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат  Выборка.Ссылка;
	КонецЕсли;
		
	Возврат Справочники.ЛБ_ВесовыеГруппыДрагоценныхКамней.ПустаяСсылка();
КонецФункции	

Функция ПолучитьОтклонениеОтБазовойЦеныКамни(Дата, Ломбард, Категория, ВидВставки, БазоваяЦена) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	МассивК = Новый Массив;
	МассивК.Добавить(Справочники.ЛБ_ДрагоценныеКамни.ПустаяСсылка());
	Если ЗначениеЗаполнено(Категория) Тогда
		МассивК.Добавить(Категория);
	КонецЕсли;	
	Запрос.УстановитьПараметр("Категории", МассивК);
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	МассивВ = Новый Массив;
	МассивВ.Добавить(Справочники.ЛБ_ДрагоценныеКамни.ПустаяСсылка());
	Если ЗначениеЗаполнено(ВидВставки) Тогда
		МассивВ.Добавить(ВидВставки);
	КонецЕсли;	
    Запрос.УстановитьПараметр("ВидыВставок", МассивВ); 
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_НастройкаОценкиДрагоценныхВставокСрезПоследних.КатегорияОбъектаЗалога КАК Категория,
	               |	ЛБ_НастройкаОценкиДрагоценныхВставокСрезПоследних.ВидВставки КАК ВидВставки,
	               |	ЛБ_НастройкаОценкиДрагоценныхВставокСрезПоследних.ОтклонениеОтБазовойЦены КАК ОтклонениеОтБазовойЦены,
	               |	ЛБ_НастройкаОценкиДрагоценныхВставокСрезПоследних.ЗначениеОтклонения КАК ЗначениеОтклонения
	               |ИЗ
	               |	РегистрСведений.ЛБ_НастройкаОценкиДрагоценныхВставок.СрезПоследних(
	               |			&Дата,
	               |			Ломбард = &Ломбард
	               |				И ВидВставки В (&ВидыВставок)
	               |				И КатегорияОбъектаЗалога В (&Категории)
	               |				И ДатаНачалаДействия <= &Дата) КАК ЛБ_НастройкаОценкиДрагоценныхВставокСрезПоследних";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	ТаблицаЗапроса.Сортировать("Категория Убыв, ВидВставки Убыв");
	
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
		СтрокаЗапроса = ТаблицаЗапроса.Получить(0);
		Если СтрокаЗапроса.ОтклонениеОтБазовойЦены = Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Относительное Тогда
			БазоваяЦена = БазоваяЦена * (1+СтрокаЗапроса.ЗначениеОтклонения/100);
		ИначеЕсли СтрокаЗапроса.ОтклонениеОтБазовойЦены = Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Абсолютное Тогда
			БазоваяЦена = БазоваяЦена + СтрокаЗапроса.ЗначениеОтклонения;
	    КонецЕсли;
	КонецЕсли;	
	
	Возврат БазоваяЦена;

КонецФункции		
	
Функция ПолучитьЦенуДрагоценногоКамняИзПрейскуранта(ПараметрыПоиска) Экспорт 
	Цена = 0; 
	Приказ = Документы.ЛБ_ПриказУсловияПредоставленияЗаймов.ПустаяСсылка();
	
	МассивГруппВес = Новый Массив;
	МассивГруппВес.Добавить(Справочники.ЛБ_ВесовыеГруппыДрагоценныхКамней.ПустаяСсылка());
	ВесоваяГруппа = ПолучитьВесовуюГруппу(ПараметрыПоиска.ВидВставки, ПараметрыПоиска.Вес);
	Если ЗначениеЗаполнено(ВесоваяГруппа) Тогда
		МассивГруппВес.Добавить(ВесоваяГруппа);
	КонецЕсли;	
	
	МассивФормаОгранки = Новый Массив;
	МассивФормаОгранки.Добавить(Справочники.ЛБ_ФормыОгранки.ПустаяСсылка());
	Если ЗначениеЗаполнено(ПараметрыПоиска.ФормаОгранки) Тогда
		МассивФормаОгранки.Добавить(ПараметрыПоиска.ФормаОгранки);
	КонецЕсли;	
	
	МассивВидОгранки = Новый Массив;
	МассивВидОгранки.Добавить(Справочники.ЛБ_ВидыОгранки.ПустаяСсылка());
	Если ЗначениеЗаполнено(ПараметрыПоиска.ВидОгранки) Тогда
		МассивВидОгранки.Добавить(ПараметрыПоиска.ВидОгранки);
	КонецЕсли;	

	МассивКачествоОгранки = Новый Массив;
	МассивКачествоОгранки.Добавить(Справочники.ЛБ_КачествоОгранки.ПустаяСсылка());
	Если ЗначениеЗаполнено(ПараметрыПоиска.КачествоОгранки) Тогда
		МассивКачествоОгранки.Добавить(ПараметрыПоиска.КачествоОгранки);
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ПараметрыПоиска.Дата); 
	Запрос.УстановитьПараметр("Ломбард", ПараметрыПоиска.Ломбард);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамни.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПрейскурантЦенНаДрагоценныеКамни КАК ЛБ_ПрейскурантЦенНаДрагоценныеКамни
	               |ГДЕ
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамни.Ломбард = &Ломбард
	               |	И ЛБ_ПрейскурантЦенНаДрагоценныеКамни.ДатаНачалаДействия <= &Дата
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамни.Период УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Запрос.УстановитьПараметр("ВидВставки", ПараметрыПоиска.ВидВставки);
		Запрос.УстановитьПараметр("ВесовыеГруппы", МассивГруппВес);
		Запрос.УстановитьПараметр("ФормыОгранки", МассивФормаОгранки);
	    Запрос.УстановитьПараметр("ВидыОгранки", МассивВидОгранки);
	    Запрос.УстановитьПараметр("КачествоОгранки", МассивКачествоОгранки);
		Запрос.УстановитьПараметр("ЕдиницаИзмерения", ПараметрыПоиска.ЕдиницаИзмерения);
		Запрос.УстановитьПараметр("Регистратор", Выборка.Регистратор);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.Ломбард КАК Ломбард,
		               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.ВесоваяГруппа КАК ВесоваяГруппа,
		               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.ФормаОгранки КАК ФормаОгранки,
		               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.ВидОгранки КАК ВидОгранки,
		               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.КачествоОгранки КАК КачествоОгранки,
		               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.Цена КАК ЦенаБазовая
		               |ИЗ
		               |	РегистрСведений.ЛБ_ПрейскурантЦенНаДрагоценныеКамни.СрезПоследних(
		               |			&Дата,
		               |			Ломбард = &Ломбард
		               |				И ВидВставки = &ВидВставки
		               |				И ВесоваяГруппа В (&ВесовыеГруппы)
		               |				И ФормаОгранки В (&ФормыОгранки)
		               |				И ВидОгранки В (&ВидыОгранки)
		               |				И КачествоОгранки В (&КачествоОгранки)
		               |				И ЕдиницаИзмерения = &ЕдиницаИзмерения
		               |				И ДатаНачалаДействия <= &Дата) КАК ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних
		               |ГДЕ
		               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.Регистратор = &Регистратор
		               |АВТОУПОРЯДОЧИВАНИЕ";
		ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
		ТаблицаЗапроса.Сортировать("ВесоваяГруппа Убыв, ФормаОгранки Убыв, ВидОгранки Убыв, КачествоОгранки Убыв");
		
		Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
			Цена = ТаблицаЗапроса.Получить(0).ЦенаБазовая;
			Приказ = Выборка.Регистратор;

			//+Мельников 23.09.24 ВИП. Заявка 2792
			//Было: Возврат Цена;
			ЦенаВИП = ПолучитьОтклонениеОтБазовойЦеныКамняВИП(ПараметрыПоиска, Цена);
			
			//+МАН 10.12.25
			ПриказВИПВставки = Документы.ЛБ_ПриказИндивидуальныеУсловия.ПустаяСсылка();
			//-МАН
			Если ЦенаВИП <> Ложь Тогда
				//+МАН 10.12.25
				//БЫло: Цена = ЦенаВИП;
				Цена = ЦенаВИП.Цена;
				ПриказВИПВставки = ЦенаВИП.ПриказВИПВставки;
			КонецЕсли;
			//-Мельников

			//КатегорияОбъектаЗалога = СтрокаТЧТовары.Категория;  
			//ВидВставки = СтрокаТЧВставки.ВидВставки; 
			//
			//Возврат ПолучитьОтклонениеОтБазовойЦеныКамни(ДатаДок, ДокументОбъект.Ломбард, КатегорияОбъектаЗалога, ВидВставки, Цена);
		КонецЕсли;
	КонецЕсли;	
	
	СтруктураВ = Новый Структура;
	СтруктураВ.Вставить("Цена", Цена); 
	СтруктураВ.Вставить("Приказ", Приказ);
	//+МАН 10.12.25
	СтруктураВ.Вставить("ПриказВИПВставки", ПриказВИПВставки);
	//-МАН
	Возврат СтруктураВ;
КонецФункции

//+Мельников 23.09.24 Изменения для проверки ВИПов. Добавлен параметр Залогодатель. ВИП. Заявка 2792
Функция ПолучитьОтклонениеОтБазовойЦеныМеталлы(Дата, Ломбард, СхемаКредитования, Категория, Проба, БазоваяЦена, Залогодатель = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	
	МассивСхем = Новый Массив;
	МассивСхем.Добавить(Справочники.ЛБ_СхемыКредитования.ПустаяСсылка());
	Если ЗначениеЗаполнено(СхемаКредитования) Тогда
		МассивСхем.Добавить(СхемаКредитования);
	КонецЕсли;	
	Запрос.УстановитьПараметр("СхемыКредитования", МассивСхем);
	
	МассивКатегорий = Новый Массив;
	МассивКатегорий.Добавить(Справочники.ЛБ_КатегорииОбъектовЗалога.ПустаяСсылка());
	Если ЗначениеЗаполнено(Категория) Тогда
		МассивКатегорий.Добавить(Категория);
	КонецЕсли;	
	Запрос.УстановитьПараметр("Категории", МассивКатегорий);
	
	МассивМеталлов = Новый Массив;
	МассивМеталлов.Добавить(Справочники.ЛБ_ДрагоценныеМеталлы.ПустаяСсылка());
	
	МассивПроб = Новый Массив;
	МассивПроб.Добавить(Справочники.ЛБ_Пробы.ПустаяСсылка());

	Если ЗначениеЗаполнено(Проба) Тогда
		МассивМеталлов.Добавить(Проба.Владелец);
		МассивПроб.Добавить(Проба);
	КонецЕсли;	
	Запрос.УстановитьПараметр("Металлы", МассивМеталлов);
	Запрос.УстановитьПараметр("Пробы", МассивПроб);
	Запрос.УстановитьПараметр("Ломбард", Ломбард);

	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_НастройкаРасчетаОценкиЗалогаСрезПоследних.СхемаКредитования КАК СхемаКредитования,
	               |	ЛБ_НастройкаРасчетаОценкиЗалогаСрезПоследних.КатегорияОбъектаЗалога КАК Категория,
	               |	ЛБ_НастройкаРасчетаОценкиЗалогаСрезПоследних.Металл КАК Металл,
	               |	ЛБ_НастройкаРасчетаОценкиЗалогаСрезПоследних.Проба КАК Проба,
	               |	ЛБ_НастройкаРасчетаОценкиЗалогаСрезПоследних.ОтклонениеОтБазовойЦены КАК ОтклонениеОтБазовойЦены,
	               |	ЛБ_НастройкаРасчетаОценкиЗалогаСрезПоследних.ЗначениеОтклонения КАК ЗначениеОтклонения
	               |ИЗ
	               |	РегистрСведений.ЛБ_НастройкаРасчетаОценкиЗалога.СрезПоследних(
	               |			&Дата,
	               |			Ломбард = &Ломбард
	               |				И СхемаКредитования В (&СхемыКредитования)
	               |				И КатегорияОбъектаЗалога В (&Категории)
	               |				И Металл В (&Металлы)
	               |				И Проба В (&Пробы)
	               |				И ДатаНачалаДействия <= &Дата) КАК ЛБ_НастройкаРасчетаОценкиЗалогаСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_НастройкаРасчетаОценкиЗалогаСрезПоследних.Период УБЫВ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
    ТаблицаЗапроса.Сортировать("СхемаКредитования Убыв, Категория Убыв, Металл Убыв, Проба Убыв");
	
	Цена = БазоваяЦена;
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
		СтрокаЗапроса = ТаблицаЗапроса.Получить(0);
		Если СтрокаЗапроса.ОтклонениеОтБазовойЦены = Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Относительное Тогда
			Цена = БазоваяЦена * (1+СтрокаЗапроса.ЗначениеОтклонения/100);
		ИначеЕсли СтрокаЗапроса.ОтклонениеОтБазовойЦены = Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Абсолютное Тогда
			Цена = БазоваяЦена + СтрокаЗапроса.ЗначениеОтклонения;
	    КонецЕсли;
	КонецЕсли;	
	
	//+Мельников 23.09.24 ВИП. Заявка 2792
	Если Залогодатель <> Неопределено Тогда
		ЦенаВИП = ПолучитьОтклонениеОтБазовойЦеныМеталлаВИП(Дата, СхемаКредитования, Категория, Проба, Цена, Залогодатель);
	Иначе
		ЦенаВИП = Ложь;
	КонецЕсли;
	
	//+МАН 10.12.25
	ПриказВИПМеталлы = Документы.ЛБ_ПриказИндивидуальныеУсловия.ПустаяСсылка();
	//-МАН
	
	Если ЦенаВИП <> Ложь Тогда
		//+МАН 10.12.25
		//Было: Цена = ЦенаВИП;
		Цена = ЦенаВИП.Цена;
		ПриказВИПМеталлы = ЦенаВИП.ПриказВИПМеталлы;
		//-МАН
	КонецЕсли;
	//-Мельников

	//+МАН 10.12.25
	//Было: Возврат Цена;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Цена", Цена);
	СтруктураВозврата.Вставить("ПриказВИПМеталлы", ПриказВИПМеталлы);
	
	Возврат СтруктураВозврата;
    //-МАН

КонецФункции	
	
Функция ПолучитьЦенуМеталлаИзПрейскуранта(ПараметрыПоиска) Экспорт	
	Цена = 0;
	Приказ = Документы.ЛБ_ПриказУсловияПредоставленияЗаймов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ПараметрыПоиска.Дата);
	Запрос.УстановитьПараметр("Ломбард", ПараметрыПоиска.Ломбард);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПрейскурантЦенНаМеталлы.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПрейскурантЦенНаМеталлы КАК ЛБ_ПрейскурантЦенНаМеталлы
	               |ГДЕ
	               |	ЛБ_ПрейскурантЦенНаМеталлы.Ломбард = &Ломбард
	               |	И ЛБ_ПрейскурантЦенНаМеталлы.ДатаНачалаДействия <= &Дата
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ПрейскурантЦенНаМеталлы.Период УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Запрос.УстановитьПараметр("Проба", ПараметрыПоиска.Проба);
		Запрос.УстановитьПараметр("Категория", ПараметрыПоиска.Категория);
		Запрос.УстановитьПараметр("ЕдиницаИзмерения", ПараметрыПоиска.ЕдиницаИзмерения);
		Запрос.УстановитьПараметр("Регистратор", Выборка.Регистратор);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних.Ломбард КАК Ломбард,
		               |	ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних.Цена КАК ЦенаБазовая
		               |ИЗ
		               |	РегистрСведений.ЛБ_ПрейскурантЦенНаМеталлы.СрезПоследних(
		               |			&Дата,
		               |			Ломбард = &Ломбард
		               |				И Проба = &Проба
		               |				И Категория = &Категория
		               |				И ЕдиницаИзмерения = &ЕдиницаИзмерения) КАК ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних
		               |ГДЕ
		               |	ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних.Регистратор = &Регистратор
		               |АВТОУПОРЯДОЧИВАНИЕ";
		ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
		
		Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
			Цена = ТаблицаЗапроса.Получить(0).ЦенаБазовая; 
			Приказ = Выборка.Регистратор;
			
			//+Мельников 23.09.24 Добавлен параметр Залогодатель. ВИП. Заявка 2792
			Если ПараметрыПоиска.Свойство("Залогодатель") Тогда
				//+МАН 10.12.25 Изменил
				//Было: Цена = ПолучитьОтклонениеОтБазовойЦеныМеталлы(ПараметрыПоиска.Дата, ПараметрыПоиска.Ломбард, ПараметрыПоиска.СхемаКредитования, ПараметрыПоиска.Категория, ПараметрыПоиска.Проба, Цена, ПараметрыПоиска.Залогодатель);
				СтруктураЦена = ПолучитьОтклонениеОтБазовойЦеныМеталлы(ПараметрыПоиска.Дата, ПараметрыПоиска.Ломбард, ПараметрыПоиска.СхемаКредитования, ПараметрыПоиска.Категория, ПараметрыПоиска.Проба, Цена, ПараметрыПоиска.Залогодатель);
			Иначе 
				//+МАН 10.12.25 Изменил
				//Было: Цена = ПолучитьОтклонениеОтБазовойЦеныМеталлы(ПараметрыПоиска.Дата, ПараметрыПоиска.Ломбард, ПараметрыПоиска.СхемаКредитования, ПараметрыПоиска.Категория, ПараметрыПоиска.Проба, Цена);
				СтруктураЦена = ПолучитьОтклонениеОтБазовойЦеныМеталлы(ПараметрыПоиска.Дата, ПараметрыПоиска.Ломбард, ПараметрыПоиска.СхемаКредитования, ПараметрыПоиска.Категория, ПараметрыПоиска.Проба, Цена);
			КонецЕсли;
			//-Мельников
		КонецЕсли;
	КонецЕсли;	
	
	СтруктураВ = Новый Структура;
	СтруктураВ.Вставить("Приказ", Приказ);
	//+МАН 10.12.25 Изменил
	//Было СтруктураВ.Вставить("Цена", Цена); 
	СтруктураВ.Вставить("Цена", ?(СтруктураЦена = Неопределено, Цена, СтруктураЦена.Цена));
	СтруктураВ.Вставить("ПриказВИПМеталлы", ?(СтруктураЦена = Неопределено, Документы.ЛБ_ПриказИндивидуальныеУсловия.ПустаяСсылка(), СтруктураЦена.ПриказВИПМеталлы));
	//-МАН
	Возврат СтруктураВ;
КонецФункции	

//+Мельников 19.09.24 Изменения для проверки ВИПов. Добавлен параметр "Залогодатель". Заявка 2792
Функция ПолучитьПроцентнуюСхемуИзПрейскуранта(Дата, Ломбард, СхемаКредитования, СтатусЗалогодателя, СписокДопСтатусов, СуммаСсуды, Залогодатель = Неопределено) Экспорт
	Если НЕ ЗначениеЗаполнено(Ломбард) ИЛИ НЕ ЗначениеЗаполнено(СхемаКредитования) Тогда
		Возврат неопределено;
	КонецЕсли;  
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("СхемаКредитования", СхемаКредитования);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СхемыКредитованияПричиныПримененияПроцентнойСхемы.ПричинаПрименения КАК ПричинаПрименения
	               |ИЗ
	               |	Справочник.ЛБ_СхемыКредитования.ПричиныПримененияПроцентнойСхемы КАК ЛБ_СхемыКредитованияПричиныПримененияПроцентнойСхемы
	               |ГДЕ
	               |	ЛБ_СхемыКредитованияПричиныПримененияПроцентнойСхемы.Ссылка = &СхемаКредитования";
	ПричиныПрименения = Запрос.Выполнить().Выгрузить();
	
	СрокЗалога = 0;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_УсловияПредоставленияКредитаСрезПоследних.СрокЗалога КАК СрокЗалога
	               |ИЗ
	               |	РегистрСведений.ЛБ_УсловияПредоставленияКредита.СрезПоследних(&Дата, СхемаКредитования = &СхемаКредитования) КАК ЛБ_УсловияПредоставленияКредитаСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
	    СрокЗалога = Выборка.СрокЗалога;
	КонецЕсли;
 
	МассивСтатусовКлиента = Новый Массив;
	МассивСтатусовКлиента.Добавить(Справочники.ЛБ_СтатусыЗалогодателей.ПустаяСсылка());
	Если ЗначениеЗаполнено(СтатусЗалогодателя) Тогда
		МассивСтатусовКлиента.Добавить(СтатусЗалогодателя);
		Если ЗначениеЗаполнено(СтатусЗалогодателя.Родитель) Тогда 
			МассивСтатусовКлиента.Добавить(СтатусЗалогодателя.Родитель);
		КонецЕсли;	
	КонецЕсли;	
	
	Для каждого Эл Из СписокДопСтатусов Цикл 
		МассивСтатусовКлиента.Добавить(Эл.Значение);
		Если ЗначениеЗаполнено(Эл.Значение.Родитель) Тогда 
			МассивСтатусовКлиента.Добавить(Эл.Значение.Родитель);
		КонецЕсли;	
		СоставнойСтатус = ЛБ_УправлениеЛомбардом.ПолучитьСоставнойСтатусКлиента(Дата, СтатусЗалогодателя, Эл.Значение);
		Если НЕ СоставнойСтатус = неопределено Тогда
			МассивСтатусовКлиента.Добавить(СоставнойСтатус);
		КонецЕсли;	
	Конеццикла;	
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ломбард", Ломбард); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПрейскурантПроцентныхСтавок.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПрейскурантПроцентныхСтавок КАК ЛБ_ПрейскурантПроцентныхСтавок
	               |ГДЕ
	               |	ЛБ_ПрейскурантПроцентныхСтавок.Ломбард = &Ломбард
	               |	И ЛБ_ПрейскурантПроцентныхСтавок.ДатаНачалаДействия <= &Дата
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ПрейскурантПроцентныхСтавок.Период УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Запрос.УстановитьПараметр("СтатусыЗалогодателя", МассивСтатусовКлиента);
		Запрос.УстановитьПараметр("СхемаКредитования", СхемаКредитования);
		Запрос.УстановитьПараметр("СуммаЗайма", СуммаСсуды);
		Запрос.УстановитьПараметр("ПричиныПрименения", ПричиныПрименения); 
		Запрос.УстановитьПараметр("Регистратор", Выборка.Регистратор);
		Запрос.УстановитьПараметр("ВидПроцентнойСтавки", Перечисления.ЛБ_ВидыПроцентныхСтавок.Базовая);
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.СтатусЗалогодателя КАК СтатусЗалогодателя,
		               |	&ВидПроцентнойСтавки КАК ВидПроцентнойСтавки,
		               |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.ДеньНачалаПрименения КАК ДеньНачалаПрименения,
		               |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.ПричинаПрименения КАК ПричинаПрименения,
		               |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.ПроцентнаяСтавка КАК ПроцентнаяСтавка
		               |ИЗ
		               |	РегистрСведений.ЛБ_ПрейскурантПроцентныхСтавок.СрезПоследних(
		               |			&Дата,
		               |			ПричинаПрименения В (&ПричиныПрименения)
		               |				И Ломбард = &Ломбард
		               |				И СтатусЗалогодателя В (&СтатусыЗалогодателя)
		               |				И СхемаКредитования = &СхемаКредитования
		               |				И ДиапазонСуммЗайма.СуммаОт <= &СуммаЗайма
		               |				И ВЫБОР
		               |					КОГДА ДиапазонСуммЗайма.СуммаДо = 0
		               |						ТОГДА ИСТИНА
		               |					ИНАЧЕ ДиапазонСуммЗайма.СуммаДо >= &СуммаЗайма
		               |				КОНЕЦ) КАК ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних
		               |ГДЕ
		               |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.Регистратор = &Регистратор
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ДеньНачалаПрименения";       
		ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();  
		
		ТаблицаСтатусов = ТаблицаЗапроса.Скопировать();  
		ТаблицаСтатусов.Свернуть("СтатусЗалогодателя");	
		ТаблицаСтатусов.Колонки.Добавить("ПСК");
		Если ТаблицаСтатусов.Количество() > 1 И НЕ СрокЗалога = 0 Тогда   
			Для каждого стр Из ТаблицаСтатусов цикл 
				ОтборС = Новый Структура;
				ОтборС.Вставить("СтатусЗалогодателя", стр.СтатусЗалогодателя);
				ОтборС.Вставить("ПричинаПрименения", Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма);
				СтрокиС = ТаблицаЗапроса.НайтиСтроки(ОтборС); 
				СуммарнаяПроцентнаяСтавка = 0;
				Для сч = 0 По СтрокиС.Количество() - 1 Цикл 
					СтрС = строкиС.Получить(сч);
					ДеньНач = СтрС.ДеньНачалаПрименения;
					
					сч1 = сч + 1;
					Если сч1 >= СтрокиС.Количество() Тогда
						ДеньКон = СрокЗалога; 
					Иначе      
						СтрС1 = СтрокиС.Получить(сч1);
						ДеньКон = СтрС1.ДеньНачалаПрименения;  
						Если ДеньКон > СрокЗалога Тогда
							ДеньКон = СрокЗалога;
						КонецЕсли;	
					КонецЕсли;	

					КолДней = ДеньКон-ДеньНач+1;
					Ставка = СтрС.ПроцентнаяСтавка;
					СуммарнаяПроцентнаяСтавка = СуммарнаяПроцентнаяСтавка + Ставка*КолДней;
					Если ДеньКон = СрокЗалога Тогда  
						Прервать;
					КонецЕсли;	
				КонецЦикла;
				Стр.ПСК = ЛБ_УправлениеЛомбардом.РасчетПСКГодПрейскурант(Дата, СрокЗалога, СуммарнаяПроцентнаяСтавка);
			КонецЦикла;  
			
			ТаблицаСтатусов.Сортировать("ПСК"); 
			ВыбранныйСтатус = ТаблицаСтатусов.Получить(0).СтатусЗалогодателя;
			
			УдСтроки = Новый СписокЗначений;
			Для каждого стр Из ТаблицаЗапроса цикл 
				Если НЕ Стр.СтатусЗалогодателя = ВыбранныйСтатус Тогда
					УдСтроки.Добавить(Стр);
				КонецЕсли;	
			КонецЦикла;
			Для каждого Эл из удСтроки Цикл
				ТаблицаЗапроса.Удалить(Эл.Значение);
			КонецЦикла;	
		КонецЕсли;	    
		ТаблицаЗапроса.Свернуть("ПричинаПрименения, ДеньНачалаПрименения, ВидПроцентнойСтавки, ПроцентнаяСтавка");
		
		//+Мельников 20.09.24 ВИП. Заявка 2792
		Если Залогодатель <> Неопределено Тогда
			СтавкаВИП = ПроверитьСтавкуВИП(Дата, СхемаКредитования, Залогодатель, СуммаСсуды);
		Иначе
			СтавкаВИП = Ложь;
		КонецЕсли;
	
		//+МАН 10.12.25
		ТаблицаЗапроса.Колонки.Добавить("ПриказВИП", Новый ОписаниеТипов("ДокументСсылка.ЛБ_ПриказИндивидуальныеУсловия"));
		//-МАН
		
		Если СтавкаВИП <> Ложь Тогда
			Для каждого СтрТЗ Из ТаблицаЗапроса Цикл
				Если (СтрТЗ.ПричинаПрименения = Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма
					ИЛИ СтрТЗ.ПричинаПрименения = Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ОплатаПроцентов)
					И СтрТЗ.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Базовая Тогда
					//+МАН 10.12.25
					//Было: СтрТЗ.ПроцентнаяСтавка = СтавкаВИП;
					
					СтрТЗ.ПроцентнаяСтавка = СтавкаВИП.СтавкаВИП;
					СтрТЗ.ПриказВИП = СтавкаВИП.ПриказВИП;
					//-МАН
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		//-Мельников
		
		Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ТехническиеСтавкиСрезПоследних.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрСведений.ЛБ_ТехническиеСтавки.СрезПоследних(&Дата, СхемаКредитования = &СхемаКредитования) КАК ЛБ_ТехническиеСтавкиСрезПоследних";
		ВыборкаДок = Запрос.Выполнить().Выбрать();
		Если ВыборкаДок.Следующий() Тогда   
			Запрос.УстановитьПараметр("Регистратор", ВыборкаДок.Регистратор);
			Запрос.УстановитьПараметр("ВидПроцентнойСтавки", Перечисления.ЛБ_ВидыПроцентныхСтавок.Техническая);		
			Запрос.Текст = "ВЫБРАТЬ
			               |	&ВидПроцентнойСтавки КАК ВидПроцентнойСтавки,
			               |	ЛБ_ТехническиеСтавкиСрезПоследних.ПроцентнаяСтавка КАК ПроцентнаяСтавка,
			               |	ЛБ_ТехническиеСтавкиСрезПоследних.ДеньНачалаПрименения КАК ДеньНачалаПрименения
			               |ИЗ
			               |	РегистрСведений.ЛБ_ТехническиеСтавки.СрезПоследних(, ) КАК ЛБ_ТехническиеСтавкиСрезПоследних
			               |ГДЕ
			               |	ЛБ_ТехническиеСтавкиСрезПоследних.Регистратор = &Регистратор";
			ВыборкаТ = Запрос.Выполнить().Выбрать();
			Если ВыборкаТ.Следующий() Тогда	
				Если НЕ ВыборкаТ.ДеньНачалаПрименения = 0 Тогда
					Для каждого СтрП Из ПричиныПрименения Цикл
					    НоваяСтр = ТаблицаЗапроса.Добавить(); 
						НоваяСтр.ДеньНачалаПрименения = ВыборкаТ.ДеньНачалаПрименения; 
						НоваяСтр.ПроцентнаяСтавка = ВыборкаТ.ПроцентнаяСтавка; 
						НоваяСтр.ВидПроцентнойСтавки = ВыборкаТ.ВидПроцентнойСтавки; 
						НоваяСтр.ПричинаПрименения = СтрП.ПричинаПрименения;
					КонецЦикла;	
				КонецЕсли;	
		    КонецЕсли;
		КонецЕсли;
		
		СтруктураВ = Новый Структура;
		СтруктураВ.Вставить("ТаблицаСтавок", ТаблицаЗапроса); 
		СтруктураВ.Вставить("Приказ", Выборка.Регистратор);  
		
		Возврат СтруктураВ;
		//Возврат ТаблицаЗапроса;			
	КонецЕсли;	
	
	Возврат неопределено; 
КонецФункции		
	
Функция ВыбратьДействующиеАкции(Дата, Ломбард, ПричинаПрименения, МассивСтатусовКлиента, СуммаЗайма, СписокЛьготныхСтатусов, МассивСК, Промокод, Предъявитель) Экспорт 
	МассивАкций = Новый Массив;
	Если НЕ ЗначениеЗаполнено(Ломбард) Тогда
		Возврат МассивАкций;
	КонецЕсли;  
	
	ДатаДок = Дата;
	ДатаПроверка = Дата; 
	
	//МассивСтатусовКлиента = Новый Массив;
	//МассивСтатусовКлиента.Добавить(Справочники.ЛБ_СтатусыЗалогодателей.ПустаяСсылка());
	//Если ЗначениеЗаполнено(СтатусЗалогодателя) Тогда
	//	МассивСтатусовКлиента.Добавить(СтатусЗалогодателя);
	//КонецЕсли;	

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("ДатаПроверка", ДатаПроверка);
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.УстановитьПараметр("СтатусыЗалогодателя", МассивСтатусовКлиента);
	Запрос.УстановитьПараметр("СхемыКредитования", МассивСК);
	Запрос.УстановитьПараметр("СуммаЗайма", СуммаЗайма);
	Запрос.УстановитьПараметр("ПричинаПрименения", ПричинаПрименения);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_АкцииПроцентныеСтавкиСрезПоследних.Акция КАК Акция,
	               |	ЛБ_АкцииПроцентныеСтавкиСрезПоследних.СхемаКредитования КАК СхемаКредитования
	               |ИЗ
	               |	РегистрСведений.ЛБ_АкцииПроцентныеСтавки.СрезПоследних(
	               |			&Дата,
	               |			ПричинаПрименения = &ПричинаПрименения
	               |				И Ломбард = &Ломбард
	               |				И ДатаНачалаДействия <= &ДатаПроверка
	               |				И ДатаОкончанияДействия >= &ДатаПроверка
	               |				И СтатусЗалогодателя В (&СтатусыЗалогодателя)
	               |				И СхемаКредитования В (&СхемыКредитования)
	               |				И ДиапазонСуммЗайма.СуммаОт <= &СуммаЗайма
	               |				И ВЫБОР
	               |					КОГДА ДиапазонСуммЗайма.СуммаДо = 0
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ ДиапазонСуммЗайма.СуммаДо >= &СуммаЗайма
	               |				КОНЕЦ) КАК ЛБ_АкцииПроцентныеСтавкиСрезПоследних";  
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	Удстроки = Новый СписокЗначений;
	Для каждого Выборка Из ТаблицаЗапроса Цикл
		Если Выборка.Акция.ВидАкции = Перечисления.ЛБ_ВидыАкций.ПоДням Тогда 
			ДеньНедели = ДеньНедели(ДатаПроверка);
			Отбор = Новый Структура;
			Отбор.Вставить("ДеньНедели", ДеньНедели); 
			Строки = Выборка.Акция.ДниНедели.НайтиСтроки(Отбор);
			Если Строки.Количество() = 0 Тогда  
				Удстроки.Добавить(Выборка);
			КонецЕсли;	 
		ИначеЕсли Выборка.Акция.ВидАкции = Перечисления.ЛБ_ВидыАкций.ПоСтатусамЗаемщика Тогда 
			ЕстьСтатус = Ложь;
			Для каждого Эл Из СписокЛьготныхСтатусов Цикл 				 
				Отбор = Новый Структура;
				Отбор.Вставить("Статус", Эл.Значение); 
				Строки = Выборка.Акция.СтатусыЗаемщика.НайтиСтроки(Отбор);
				Если НЕ Строки.Количество() = 0 Тогда 
					ЕстьСтатус = Истина;
					Прервать;
				КонецЕсли;	
			КонецЦикла;	 
			Если НЕ ЕстьСтатус Тогда  
				Удстроки.Добавить(Выборка);
			КонецЕсли;	 
		ИначеЕсли Выборка.Акция.ВидАкции = Перечисления.ЛБ_ВидыАкций.ПоПромокоду Тогда
			Если НЕ ПустаяСтрока(Промокод) Тогда 
				Если НЕ (нрег(СокрЛП(Промокод)) = нрег(СокрЛП(Выборка.Акция.Промокод))) Тогда 
					Удстроки.Добавить(Выборка);
				КонецЕсли;	
			КонецЕсли;	
		ИначеЕсли Выборка.Акция.ВидАкции = Перечисления.ЛБ_ВидыАкций.НаПредъявителя Тогда
			Если НЕ Предъявитель Тогда 
				Удстроки.Добавить(Выборка);
			КонецЕсли;		
		КонецЕсли;	
	КонецЦикла;
	
	Для каждого Эл Из Удстроки Цикл 
		ТаблицаЗапроса.Удалить(Эл.Значение);
	Конеццикла;
	ТаблицаЗапроса.Свернуть("СхемаКредитования, Акция");
	
	Возврат ТаблицаЗапроса;
КонецФункции

Функция ПолучитьПроцентнуюСтавкуОтклонениеПоАкции(Дата, Акция, Ломбард, СхемаКредитования, СтатусЗалогодателя, СписокДопСтатусов, ПричинаПрименения, СуммаСсуды) Экспорт 
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Ставка", 0); 
	СтруктураВозврата.Вставить("Отклонение", Перечисления.ЛБ_ОтклонениеОтБазовойЦены.ПустаяСсылка()); 
	СтруктураВозврата.Вставить("ЗначениеОтклонения", 0);
	
	Если НЕ ЗначениеЗаполнено(Ломбард) ИЛИ НЕ ЗначениеЗаполнено(Акция) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	ДатаДок = Дата;
	ДатаПроверка = Дата; 	
	
	МассивСтатусовКлиента = Новый Массив;
	МассивСтатусовКлиента.Добавить(Справочники.ЛБ_СтатусыЗалогодателей.ПустаяСсылка());
	Если ЗначениеЗаполнено(СтатусЗалогодателя) Тогда
		МассивСтатусовКлиента.Добавить(СтатусЗалогодателя);
		Если ЗначениеЗаполнено(СтатусЗалогодателя.Родитель) Тогда 
			МассивСтатусовКлиента.Добавить(СтатусЗалогодателя.Родитель);
		КонецЕсли;	
	КонецЕсли;	  
	
	Для каждого Эл Из СписокДопСтатусов Цикл 
		МассивСтатусовКлиента.Добавить(Эл.Значение);
		Если ЗначениеЗаполнено(Эл.Значение.Родитель) Тогда 
			МассивСтатусовКлиента.Добавить(Эл.Значение.Родитель);
		КонецЕсли;	 
	Конеццикла;	

	МассивСК = Новый Массив;
	МассивСК.Добавить(Справочники.ЛБ_СхемыКредитования.ПустаяСсылка());
	Если ЗначениеЗаполнено(СхемаКредитования) Тогда
		МассивСК.Добавить(СхемаКредитования);
	КонецЕсли;	

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("ДатаПроверка", ДатаПроверка);
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.УстановитьПараметр("СтатусыЗалогодателя", МассивСтатусовКлиента);
	Запрос.УстановитьПараметр("СхемыКредитования", МассивСК);
	Запрос.УстановитьПараметр("СуммаЗайма", СуммаСсуды);
	Запрос.УстановитьПараметр("ПричинаПрименения", ПричинаПрименения);
	Запрос.УстановитьПараметр("Акция", Акция); 
	Запрос.УстановитьПараметр("ПустойСтатус", Справочники.ЛБ_СтатусыЗалогодателей.ПустаяСсылка());
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_АкцииПроцентныеСтавкиСрезПоследних.Регистратор КАК Приказ,
	               |	ЛБ_АкцииПроцентныеСтавкиСрезПоследних.ПроцентнаяСтавка КАК ПроцентнаяСтавка,
	               |	ЛБ_АкцииПроцентныеСтавкиСрезПоследних.Отклонение КАК Отклонение,
	               |	ЛБ_АкцииПроцентныеСтавкиСрезПоследних.ЗначениеОтклонения КАК ЗначениеОтклонения,
	               |	ВЫБОР
	               |		КОГДА ЛБ_АкцииПроцентныеСтавкиСрезПоследних.СтатусЗалогодателя = &ПустойСтатус
	               |			ТОГДА 0
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ЛБ_АкцииПроцентныеСтавкиСрезПоследних.СтатусЗалогодателя.ЭтоГруппа
	               |					ТОГДА 1
	               |				ИНАЧЕ 2
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Вид
	               |ИЗ
	               |	РегистрСведений.ЛБ_АкцииПроцентныеСтавки.СрезПоследних(
	               |			&Дата,
	               |			ПричинаПрименения = &ПричинаПрименения
	               |				И Акция = &Акция
	               |				И Ломбард = &Ломбард
	               |				И ДатаНачалаДействия <= &ДатаПроверка
	               |				И ДатаОкончанияДействия >= &ДатаПроверка
	               |				И СтатусЗалогодателя В (&СтатусыЗалогодателя)
	               |				И СхемаКредитования В (&СхемыКредитования)
	               |				И ДиапазонСуммЗайма.СуммаОт <= &СуммаЗайма
	               |				И ВЫБОР
	               |					КОГДА ДиапазонСуммЗайма.СуммаДо = 0
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ ДиапазонСуммЗайма.СуммаДо >= &СуммаЗайма
	               |				КОНЕЦ) КАК ЛБ_АкцииПроцентныеСтавкиСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Вид УБЫВ,
	               |	ЛБ_АкцииПроцентныеСтавкиСрезПоследних.Период УБЫВ";  
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	Если НЕ ТаблицаЗапроса.Количество() = 0  Тогда 
		Выборка = ТаблицаЗапроса.Получить(0); 
		СтруктураВозврата.Вставить("Приказ", Выборка.Приказ);
		СтруктураВозврата.Вставить("Ставка", Выборка.ПроцентнаяСтавка); 
	    СтруктураВозврата.Вставить("Отклонение", Выборка.Отклонение); 
	    СтруктураВозврата.Вставить("ЗначениеОтклонения", Выборка.ЗначениеОтклонения);
	КонецЕсли;
	
	Возврат СтруктураВозврата;
КонецФункции	

//+Мельников 19.09.24 Изменения для проверки ВИПов. Добавлен параметр "Залогодатель". Заявка 2792
Функция ЗаполнитьТаблицуПроцентныхСтавок(Дата, Ломбард, СхемаКредитования, Акция, СтатусЗалогодателя, СписокДопСтатусов, СуммаСсуды, Залогодатель = Неопределено) Экспорт	
	ТаблицаСтавок = Новый ТаблицаЗначений;    
	ТаблицаСтавок.Колонки.Добавить("ПричинаПрименения", Новый ОписаниеТипов("ПеречислениеСсылка.ЛБ_ПричиныПримененияПроцентнойСхемы")); 
	ТаблицаСтавок.Колонки.Добавить("ВидПроцентнойСтавки", Новый ОписаниеТипов("ПеречислениеСсылка.ЛБ_ВидыПроцентныхСтавок"));  
	ТаблицаСтавок.Колонки.Добавить("ДеньНачалаПрименения", Новый ОписаниеТипов("Число")); 
	ТаблицаСтавок.Колонки.Добавить("ПроцентнаяСтавка", Новый ОписаниеТипов("Число"));	
	ТаблицаСтавок.Колонки.Добавить("ПроцентнаяСтавкаАкция", Новый ОписаниеТипов("Число"));
	ТаблицаСтавок.Колонки.Добавить("ОтклонениеАкцияАбсолютное", Новый ОписаниеТипов("Число"));
	ТаблицаСтавок.Колонки.Добавить("ОтклонениеАкцияОтносительное", Новый ОписаниеТипов("Число"));
	ТаблицаСтавок.Колонки.Добавить("Приказ"); 
	ТаблицаСтавок.Колонки.Добавить("ПриказАкция");
	//+МАН 10.12.25
	ТаблицаСтавок.Колонки.Добавить("ПриказВИП", Новый ОписаниеТипов("ДокументСсылка.ЛБ_ПриказИндивидуальныеУсловия")); 
	//-МАН
		
	Приказ = неопределено;
	//+Мельников 19.09.24 Добавлен параметр "Залогодатель". ВИП. Заявка 2792
	Если Залогодатель <> Неопределено Тогда
		Результат = ПолучитьПроцентнуюСхемуИзПрейскуранта(Дата, Ломбард, СхемаКредитования, СтатусЗалогодателя, СписокДопСтатусов, СуммаСсуды, Залогодатель); 
		Если НЕ Результат = неопределено Тогда
		   ТаблицаС = Результат.ТаблицаСтавок;
		   Приказ = Результат.Приказ;
		КонецЕсли;   
	Иначе
		Результат = ПолучитьПроцентнуюСхемуИзПрейскуранта(Дата, Ломбард, СхемаКредитования, СтатусЗалогодателя, СписокДопСтатусов, СуммаСсуды);  
		Если НЕ Результат = неопределено Тогда
		   ТаблицаС = Результат.ТаблицаСтавок;
		   Приказ = Результат.Приказ;
		КонецЕсли; 
	КонецЕсли;
	//-Мельников
	Если НЕ Приказ = неопределено Тогда 
		Для каждого Стр из ТаблицаС Цикл
		     НоваяСтрока = ТаблицаСтавок.Добавить(); 
			 НоваяСтрока.Приказ = Приказ;
		     ЗаполнитьЗначенияСвойств(НоваяСтрока,Стр);
		КонецЦикла;
		ПричиныПрименения = ТаблицаСтавок.Скопировать();
		ПричиныПрименения.Свернуть("ПричинаПрименения");  
		Для каждого стрП из ПричиныПрименения Цикл 
			СтруктураАкция = ПолучитьПроцентнуюСтавкуОтклонениеПоАкции(Дата, Акция, Ломбард, СхемаКредитования, СтатусЗалогодателя, СписокДопСтатусов, СтрП.ПричинаПрименения, СуммаСсуды);		
			Если НЕ (СтруктураАкция.Ставка = 0) ИЛИ НЕ (СтруктураАкция.ЗначениеОтклонения = 0) Тогда
				Отбор = Новый структура;
				Отбор.Вставить("ПричинаПрименения", СтрП.ПричинаПрименения);
				Строки = ТаблицаСтавок.НайтиСтроки(Отбор); 
				Для каждого стрС Из Строки цикл
					СтрС.ПриказАкция = СтруктураАкция.Приказ; 
					//+МАН 10.12.25
					СтрС.ПриказВИП = Документы.ЛБ_ПриказИндивидуальныеУсловия.ПустаяСсылка();
					//-МАН
					Если СтрС.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Техническая Тогда
						Продолжить;
					КонецЕсли;	
					СтрС.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Акционная;
					СтрС.ПроцентнаяСтавкаАкция = СтруктураАкция.Ставка;
					Если НЕ СтруктураАкция.ЗначениеОтклонения = 0 Тогда
						Если СтруктураАкция.Отклонение = Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Абсолютное Тогда
						    СтрС.ОтклонениеАкцияАбсолютное = СтруктураАкция.ЗначениеОтклонения;
						ИначеЕсли СтруктураАкция.Отклонение = Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Относительное Тогда
						    СтрС.ОтклонениеАкцияОтносительное = СтруктураАкция.ЗначениеОтклонения;
	                    КонецЕсли;
					КонецЕсли;	
				Конеццикла;	
			КонецЕсли; 
		КонецЦикла;	
	КонецЕсли;	
	
	Возврат ТаблицаСтавок;
КонецФункции

//+Мельников 19.09.24 ВИП. Заявка 2792
Функция ПроверитьСтавкуВИП(ДатаДок, СхемаКредитования, Залогодатель, СуммаСсуды)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	//+МАН 14.11.24 Изменен запрос получения процентной ставки. Заявка 2792
		//"ВЫБРАТЬ ПЕРВЫЕ 1
		//|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ПроцентнаяСтавка КАК ПроцентнаяСтавка,
		//|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия КАК ДатаОкончанияДействия
		//|ИЗ
		//|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		//|ГДЕ
		//|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель = &Залогодатель
		//|	И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.СхемаКредитования = &СхемаКредитования
		//|	И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
		//|	И &СуммаЗайма МЕЖДУ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДиапазонСуммЗайма.СуммаОт И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДиапазонСуммЗайма.СуммаДо
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период УБЫВ";
		
	//+МАН 25.08.25 Изменил запрос
		//"ВЫБРАТЬ ПЕРВЫЕ 1
		//|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ПроцентнаяСтавка КАК ПроцентнаяСтавка,
		//|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
		//|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ОтменяемыйПриказ КАК ОтменяемыйПриказ
		//|ИЗ
		//|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		//|ГДЕ
		//|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель = &Залогодатель
		//|	И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.СхемаКредитования = &СхемаКредитования
		//|	И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
		//|	И &СуммаЗайма МЕЖДУ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДиапазонСуммЗайма.СуммаОт И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДиапазонСуммЗайма.СуммаДо
		//|	И ВЫБОР
		//|			КОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		//|				ТОГДА ИСТИНА
		//|			КОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия >= &Дата
		//|				ТОГДА ИСТИНА
		//|			ИНАЧЕ ЛОЖЬ
		//|		КОНЕЦ
		////|	И НЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор В
		////|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		////|					ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ОтменяемыйПриказ КАК ОтменяемыйПриказ
		////|				ИЗ
		////|					РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		////|				ГДЕ
		////|					ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель = &Залогодатель
		////|					И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
		////|					И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ОтменяемыйПриказ <> ЗНАЧЕНИЕ(Документ.ЛБ_ПриказИндивидуальныеУсловия.ПустаяСсылка))
		////|	И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ВИП)
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период УБЫВ";
	//-МАН
	
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ПроцентнаяСтавка КАК ПроцентнаяСтавка,
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор.ВидОперации КАК РегистраторВидОперации,
		//+МАН 10.12.25
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК ПриказВИП
		//-МАН
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		|ГДЕ
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель = &Залогодатель
		|	И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.СхемаКредитования = &СхемаКредитования
		|	И ВЫБОР
		|			КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период, ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия, ДЕНЬ) = 0
		|				ТОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период <= &Дата
		|			ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
		|		КОНЕЦ
		|	И &СуммаЗайма МЕЖДУ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДиапазонСуммЗайма.СуммаОт И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДиапазонСуммЗайма.СуммаДо
		|	И ВЫБОР
		|			КОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ИСТИНА
		|			КОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия >= &Дата
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|	И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК Регистратор
		|			ИЗ
		|				РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		|			ГДЕ
		|				ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель = &Залогодатель
		|				И ВЫБОР
		|					КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период, ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия, ДЕНЬ) = 0
		|						ТОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период <= &Дата
		|					ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
		|				КОНЕЦ
		|				И ВЫБОР
		|					КОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|						ТОГДА ИСТИНА
		|					КОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия >= &Дата
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ
		|			УПОРЯДОЧИТЬ ПО
		|				ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период УБЫВ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период УБЫВ";
	//-МАН

	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("СуммаЗайма", СуммаСсуды);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.УстановитьПараметр("СхемаКредитования", СхемаКредитования);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		//+МАН 14.11.24 Измен возврат результата. Заявка 2792
		//Если Результат.ДатаОкончанияДействия >= ДатаДок ИЛИ Результат.ДатаОкончанияДействия = Дата(1,1,1) Тогда
		//	Возврат Результат.ПроцентнаяСтавка;
		//+МАН 25.08.25 Изменил
		//Если НЕ ЗначениеЗаполнено(Результат.ОтменяемыйПриказ) Тогда
		Если Результат.РегистраторВидОперации <> Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП //Тогда
			//+МАН 10.12.25
			И (Результат.ДатаОкончанияДействия >= ДатаДок ИЛИ Результат.ДатаОкончанияДействия = Дата(1,1,1))Тогда
			//-МАН
		//-МАН
			//+МАН 10.12.25
			//Было: Возврат Результат.ПроцентнаяСтавка;
			СтруктураВозврата = Новый Структура("СтавкаВИП, ПриказВИП");
			
			СтруктураВозврата.СтавкаВИП = Результат.ПроцентнаяСтавка;
			СтруктураВозврата.ПриказВИП = Результат.ПриказВИП;
			
			Возврат СтруктураВозврата;
		//-МАН
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

//+Мельников 23.09.24 ВИП. Заявка 2792
Функция ПолучитьОтклонениеОтБазовойЦеныМеталлаВИП(Дата, СхемаКредитования, Категория, Проба, БазоваяЦена, Залогодатель) Экспорт
	
	МассивСхем = Новый Массив;
	МассивСхем.Добавить(Справочники.ЛБ_СхемыКредитования.ПустаяСсылка());
	Если ЗначениеЗаполнено(СхемаКредитования) Тогда
		МассивСхем.Добавить(СхемаКредитования);
	КонецЕсли;	
	
	МассивКатегорий = Новый Массив;
	МассивКатегорий.Добавить(Справочники.ЛБ_КатегорииОбъектовЗалога.ПустаяСсылка());
	Если ЗначениеЗаполнено(Категория) Тогда
		МассивКатегорий.Добавить(Категория);
	КонецЕсли;	
	
	МассивМеталлов = Новый Массив;
	МассивМеталлов.Добавить(Справочники.ЛБ_ДрагоценныеМеталлы.ПустаяСсылка());
	
	МассивПроб = Новый Массив;
	МассивПроб.Добавить(Справочники.ЛБ_Пробы.ПустаяСсылка());

	Если ЗначениеЗаполнено(Проба) Тогда
		МассивМеталлов.Добавить(Проба.Владелец);
		МассивПроб.Добавить(Проба);
	КонецЕсли;	

	Запрос = Новый Запрос;
	Запрос.Текст = 
	//+МАН 14.11.24 Изменен запрос получения условий по металлам. Заявка 2792
				   // "ВЫБРАТЬ ПЕРВЫЕ 1
				   //|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ОтклонениеОтБазовойЦены КАК ОтклонениеОтБазовойЦены,
				   //|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ЗначениеОтклонения КАК ЗначениеОтклонения,
				   //|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия КАК ДатаОкончанияДействия
				   //|ИЗ
				   //|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
				   //|ГДЕ
				   //|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель = &Залогодатель
				   //|	И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.СхемаКредитования В(&СхемаКредитования)
				   //|	И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.КатегорияОбъектаЗалога В(&КатегорияОбъектаЗалога)
				   //|	И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Металл В(&Металл)
				   //|	И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Проба В(&Проба)
				   //|	И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
				   //|
				   //|УПОРЯДОЧИТЬ ПО
				   //|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период УБЫВ";

	//+МАН 25.08.25 Изменил запрос
				//"ВЫБРАТЬ ПЕРВЫЕ 1
				//|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ОтклонениеОтБазовойЦены КАК ОтклонениеОтБазовойЦены,
				//|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ЗначениеОтклонения КАК ЗначениеОтклонения,
				//|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
				//|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ОтменяемыйПриказ КАК ОтменяемыйПриказ
				//|ИЗ
				//|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
				//|ГДЕ
				//|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель = &Залогодатель
				//|	И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.СхемаКредитования В(&СхемаКредитования)
				//|	И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.КатегорияОбъектаЗалога В(&КатегорияОбъектаЗалога)
				//|	И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Металл В(&Металл)
				//|	И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Проба В(&Проба)
				//|	И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
				//|	И ВЫБОР
				//|			КОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
				//|				ТОГДА ИСТИНА
				//|			КОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия >= &Дата
				//|				ТОГДА ИСТИНА
				//|			ИНАЧЕ ЛОЖЬ
				//|		КОНЕЦ
				////|	И НЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор В
				////|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
				////|					ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ОтменяемыйПриказ КАК ОтменяемыйПриказ
				////|				ИЗ
				////|					РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
				////|				ГДЕ
				////|					ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель = &Залогодатель
				////|					И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
				////|					И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ОтменяемыйПриказ <> ЗНАЧЕНИЕ(Документ.ЛБ_ПриказИндивидуальныеУсловия.ПустаяСсылка))
				////|	И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ВИП)
				//| 
				//|УПОРЯДОЧИТЬ ПО
				//|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период УБЫВ";
	//-МАН
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ОтклонениеОтБазовойЦены КАК ОтклонениеОтБазовойЦены,
				|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ЗначениеОтклонения КАК ЗначениеОтклонения,
				|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
				|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор.ВидОперации КАК РегистраторВидОперации,
				//+МАН 10.12.25
				|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор КАК ПриказВИПМеталлы
				//-МАН
				|ИЗ
				|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
				|ГДЕ
				|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель = &Залогодатель
				|	И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.СхемаКредитования В(&СхемаКредитования)
				|	И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.КатегорияОбъектаЗалога В(&КатегорияОбъектаЗалога)
				|	И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Металл В(&Металл)
				|	И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Проба В(&Проба)
				|	И ВЫБОР
				|			КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период, ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия, ДЕНЬ) = 0
				|				ТОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период <= &Дата
				|			ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
				|		КОНЕЦ
				|	И ВЫБОР
				|			КОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
				|				ТОГДА ИСТИНА
				|			КОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия >= &Дата
				|				ТОГДА ИСТИНА
				|			ИНАЧЕ ЛОЖЬ
				|		КОНЕЦ
				|	И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор В
				|			(ВЫБРАТЬ ПЕРВЫЕ 1
				|				ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор КАК Регистратор
				|			ИЗ
				|				РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
				|			ГДЕ
				|				ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель = &Залогодатель
				|				И ВЫБОР
				|					КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период, ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия, ДЕНЬ) = 0
				|						ТОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период <= &Дата
				|					ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
				|				КОНЕЦ
				|				И ВЫБОР
				|					КОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
				|						ТОГДА ИСТИНА
				|					КОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия >= &Дата
				|						ТОГДА ИСТИНА
				|					ИНАЧЕ ЛОЖЬ
				|				КОНЕЦ
				|			УПОРЯДОЧИТЬ ПО
				|				ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период УБЫВ)
				|
				|УПОРЯДОЧИТЬ ПО
				|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период УБЫВ";
	//-МАН
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.УстановитьПараметр("Металл", МассивМеталлов);
	Запрос.УстановитьПараметр("Проба", МассивПроб);
	Запрос.УстановитьПараметр("СхемаКредитования", МассивСхем);
	Запрос.УстановитьПараметр("КатегорияОбъектаЗалога", МассивКатегорий);
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
    //ТаблицаЗапроса.Сортировать("СхемаКредитования Убыв, КатегорияОбъектаЗалога Убыв, Металл Убыв, Проба Убыв");
	
	Если ТаблицаЗапроса.Количество() <> 0 Тогда
		СтрокаЗапроса = ТаблицаЗапроса.Получить(0);
		//+МАН 14.11.24 Измен возврат результата. Заявка 2792
		//Если СтрокаЗапроса.ДатаОкончанияДействия >= Дата ИЛИ СтрокаЗапроса.ДатаОкончанияДействия = Дата(1,1,1) Тогда
		//+МАН 25.08.25 Изменил
		//Если НЕ ЗначениеЗаполнено(СтрокаЗапроса.ОтменяемыйПриказ) Тогда
		Если СтрокаЗапроса.РегистраторВидОперации <> Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП Тогда
		//-МАН
			Если СтрокаЗапроса.ОтклонениеОтБазовойЦены = Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Относительное Тогда
				Цена = БазоваяЦена * (1+СтрокаЗапроса.ЗначениеОтклонения/100);
			ИначеЕсли СтрокаЗапроса.ОтклонениеОтБазовойЦены = Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Абсолютное Тогда
				Цена = БазоваяЦена + СтрокаЗапроса.ЗначениеОтклонения;
			КонецЕсли;
		
			//+МАН 10.12.25
			//Было: Возврат Цена;
			СтруктураВозврата = Новый Структура("Цена, ПриказВИПМеталлы");
			СтруктураВозврата.Цена = Цена;
			СтруктураВозврата.ПриказВИПМеталлы = СтрокаЗапроса.ПриказВИПМеталлы;
			
			Возврат СтруктураВозврата;
			//-МАН
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции	

//+Мельников 23.09.24 ВИП. Заявка 2792
Функция ПолучитьОтклонениеОтБазовойЦеныКамняВИП(ПараметрыПоиска, БазоваяЦена) Экспорт
	
	МассивСхем = Новый Массив;
	МассивСхем.Добавить(Справочники.ЛБ_СхемыКредитования.ПустаяСсылка());
	Если ЗначениеЗаполнено(ПараметрыПоиска.СхемаКредитования) Тогда
		МассивСхем.Добавить(ПараметрыПоиска.СхемаКредитования);
	КонецЕсли;	
	
	МассивВидОгранки = Новый Массив;
	МассивВидОгранки.Добавить(Справочники.ЛБ_ВидыОгранки.ПустаяСсылка());
	Если ЗначениеЗаполнено(ПараметрыПоиска.ВидОгранки) Тогда
		МассивВидОгранки.Добавить(ПараметрыПоиска.ВидОгранки);
	КонецЕсли;	

	МассивКачествоОгранки = Новый Массив;
	МассивКачествоОгранки.Добавить(Справочники.ЛБ_КачествоОгранки.ПустаяСсылка());
	Если ЗначениеЗаполнено(ПараметрыПоиска.КачествоОгранки) Тогда
		МассивКачествоОгранки.Добавить(ПараметрыПоиска.КачествоОгранки);
	КонецЕсли;	

	Запрос = Новый Запрос;
	Запрос.Текст =

	//+МАН 14.11.24 Изменен запрос получения условий по камням. Заявка 2792
				   //"ВЫБРАТЬ ПЕРВЫЕ 1
				   //|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ОтклонениеОтБазовойЦены КАК ОтклонениеОтБазовойЦены,
				   //|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ЗначениеОтклонения КАК ЗначениеОтклонения,
				   //|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия КАК ДатаОкончанияДействия
				   //|ИЗ
				   //|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
				   //|ГДЕ
				   //|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель = &Залогодатель
				   //|	И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.СхемаКредитования В(&СхемаКредитования)
				   //|	И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ВидВставки = &ВидВставки
				   //|	И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ВидОгранки В(&ВидОгранки)
				   //|	И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.КачествоОгранки В(&КачествоОгранки)
				   //|	И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
				   //|
				   //|УПОРЯДОЧИТЬ ПО
				   //|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период УБЫВ";
				   
	//+МАН 25.08.25 Изменил запрос
			//"ВЫБРАТЬ ПЕРВЫЕ 1
			//|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ОтклонениеОтБазовойЦены КАК ОтклонениеОтБазовойЦены,
			//|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ЗначениеОтклонения КАК ЗначениеОтклонения,
			//|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
			//|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ОтменяемыйПриказ КАК ОтменяемыйПриказ
			//|ИЗ
			//|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
			//|ГДЕ
			//|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель = &Залогодатель
			//|	И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.СхемаКредитования В(&СхемаКредитования)
			//|	И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ВидВставки = &ВидВставки
			//|	И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ВидОгранки В(&ВидОгранки)
			//|	И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.КачествоОгранки В(&КачествоОгранки)
			//|	И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
			//|	И ВЫБОР
			//|			КОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
			//|				ТОГДА ИСТИНА
			//|			КОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия >= &Дата
			//|				ТОГДА ИСТИНА
			//|			ИНАЧЕ ЛОЖЬ
			//|		КОНЕЦ
			////|	И НЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор В
			////|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
			////|					ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ОтменяемыйПриказ КАК ОтменяемыйПриказ
			////|				ИЗ
			////|					РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
			////|				ГДЕ
			////|					ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель = &Залогодатель
			////|					И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
			////|					И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ОтменяемыйПриказ <> ЗНАЧЕНИЕ(Документ.ЛБ_ПриказИндивидуальныеУсловия.ПустаяСсылка))
			////|	И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ВИП)
			//|
			//|УПОРЯДОЧИТЬ ПО
			//|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период УБЫВ";
	//-МАН
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ОтклонениеОтБазовойЦены КАК ОтклонениеОтБазовойЦены,
			|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ЗначениеОтклонения КАК ЗначениеОтклонения,
			|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
			|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор.ВидОперации КАК РегистраторВидОперации,
			//+МАН 10.12.25
			|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор КАК ПриказВИПВставки
			//-МАН
			|ИЗ
			|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
			|ГДЕ
			|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель = &Залогодатель
			|	И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.СхемаКредитования В(&СхемаКредитования)
			|	И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ВидВставки = &ВидВставки
			|	И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ВидОгранки В(&ВидОгранки)
			|	И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.КачествоОгранки В(&КачествоОгранки)
			|	И ВЫБОР
			|			КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период, ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия, ДЕНЬ) = 0
			|				ТОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период <= &Дата
			|			ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
			|		КОНЕЦ
			|	И ВЫБОР
			|			КОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
			|				ТОГДА ИСТИНА
			|			КОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия >= &Дата
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ЛОЖЬ
			|		КОНЕЦ
			|	И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор В
			|			(ВЫБРАТЬ ПЕРВЫЕ 1
			|				ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор КАК Регистратор
			|			ИЗ
			|				РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
			|			ГДЕ
			|				ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель = &Залогодатель
			|				И ВЫБОР
			|					КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период, ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия, ДЕНЬ) = 0
			|						ТОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период <= &Дата
			|					ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
			|				КОНЕЦ
			|				И ВЫБОР
			|					КОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
			|						ТОГДА ИСТИНА
			|					КОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия >= &Дата
			|						ТОГДА ИСТИНА
			|					ИНАЧЕ ЛОЖЬ
			|				КОНЕЦ
			|			УПОРЯДОЧИТЬ ПО
			|				ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период УБЫВ)
			|
			|УПОРЯДОЧИТЬ ПО
			|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период УБЫВ";
	//-МАН
	
	Запрос.УстановитьПараметр("Дата", ПараметрыПоиска.Дата);
	Запрос.УстановитьПараметр("Залогодатель", ПараметрыПоиска.Залогодатель);
	Запрос.УстановитьПараметр("СхемаКредитования", МассивСхем);
	Запрос.УстановитьПараметр("ВидВставки", ПараметрыПоиска.ВидВставки);
	Запрос.УстановитьПараметр("ВидОгранки", МассивВидОгранки);
	Запрос.УстановитьПараметр("КачествоОгранки", МассивКачествоОгранки);
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаЗапроса.Количество() <> 0 Тогда
		СтрокаЗапроса = ТаблицаЗапроса.Получить(0);
		//+МАН 14.11.24 Измен возврат результата. Заявка 2792
		//Если СтрокаЗапроса.ДатаОкончанияДействия >= ПараметрыПоиска.Дата ИЛИ СтрокаЗапроса.ДатаОкончанияДействия = Дата(1,1,1) Тогда
		//+МАН 25.08.25 Изменил
		//Если НЕ ЗначениеЗаполнено(СтрокаЗапроса.ОтменяемыйПриказ) Тогда
		Если СтрокаЗапроса.РегистраторВидОперации <> Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП Тогда
		//-МАН
			Если СтрокаЗапроса.ОтклонениеОтБазовойЦены = Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Относительное Тогда
				Цена = БазоваяЦена * (1+СтрокаЗапроса.ЗначениеОтклонения/100);
			ИначеЕсли СтрокаЗапроса.ОтклонениеОтБазовойЦены = Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Абсолютное Тогда
				Цена = БазоваяЦена + СтрокаЗапроса.ЗначениеОтклонения;
			КонецЕсли;
			
			//+МАН 10.12.25
			//Было: Возврат Цена;
			СтруктураВозврата = Новый Структура("Цена, ПриказВИПВставки");
			СтруктураВозврата.Цена = Цена;
			СтруктураВозврата.ПриказВИПВставки = СтрокаЗапроса.ПриказВИПВставки;
			
			Возврат СтруктураВозврата;
			//-МАН
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции	
//-Мельников

Функция ПеревестиВЧистоту(Количество, ПробаМеталла) Экспорт
	Если НЕ ЗначениеЗаполнено(ПробаМеталла) Тогда
		Возврат 0;
	КонецЕсли;
	
	Проба = ПробаМеталла.Проба;
	Если Цел(Проба) = 999 Тогда
        КоличествоЧистое = Количество;
	Иначе	
	    КоличествоЧистое = Количество*Цел(Проба)/999.9;
    КонецЕсли;
		
	Возврат окр(КоличествоЧистое, 3);
КонецФункции	

// Округляет число по заданному порядку. Если задано (=Истина) "ОкруглятьВБольшуюСторону",
// то число 123.37 при порядке округление 0.5 превратиться в 123.50, а число 0.1 
// при порядке округления 5 станет равным 5.
//
// Параметры:
//  Число                    - исходное число
//  ПорядокОкругления        - элемент перечисления Порядки окгугления: 
//                             "шаг" округления (0.01 (арифметическое), 0.01, 0.05, 0.1, 0.5, 1, 5, 10, 50, 100)
//  ОкруглятьВБольшуюСторону - булево, определяет способ округления: если Истина, 
//                             то при порядке округления "5" 0.01 будет округлена до 5, 
//                             Ложь - округление по арифметическим правилам
//
// Возвращаемое значение:
//  Округленное по заданному порядку значение
//
Функция ОкруглитьЦену(Число, ПараметрПорядокОкругления, ОкруглятьВБольшуюСторону) Экспорт

	Перем Результат;

	// Преобразуем порядок округления числа.
	// Если передали пустое значение порядка, то округлим до копеек. 
	Если НЕ ЗначениеЗаполнено(ПараметрПорядокОкругления) Тогда
		ПорядокОкругления = Перечисления.ПорядкиОкругления.Окр0_01; 
	Иначе
		ПорядокОкругления = ПараметрПорядокОкругления;
	КонецЕсли;

	Порядок = Число(Строка(ПорядокОкругления));
		
	// вычислим количество интервалов, входящих в число
	КоличествоИнтервал	= Число / Порядок;
		
	// вычислим целое количество интервалов.
	КоличествоЦелыхИнтервалов = Цел(КоличествоИнтервал);
		
	Если КоличествоИнтервал = КоличествоЦелыхИнтервалов Тогда
		
		// Числа поделились нацело. Округлять не нужно.
		Результат	= Число;
	Иначе
		Если ОкруглятьВБольшуюСторону Тогда
			
			// При порядке округления "0.05" 0.371 должно округлитья до 0.4
			Результат = Порядок * (КоличествоЦелыхИнтервалов + 1);
		Иначе

			// При порядке округления "0.05" 0.371 должно округлитья до 0.35,
			// а 0.376 до 0.4
			Результат = Порядок * Окр(КоличествоИнтервал,0,РежимОкругления.Окр15как20);
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ОкруглитьЦену()

Функция ПроверитьФИОЗалогодателя(Знач Фамилия, Знач Имя, Знач Отчество, ТолькоКириллица = Истина) Экспорт
	СтруктураВозврата = Новый Структура("Результат, Сообщение");
	
	// ++ Сербаев 15.06.2023 Убрал с проверки разрешенные символы (тире и пробел по середине)
	РазрешенныеСимволы = Новый Массив;
	РазрешенныеСимволы.Добавить(" ");
	РазрешенныеСимволы.Добавить("-");
	
	Для каждого РазрешенныйСимвол Из РазрешенныеСимволы Цикл
	   Фамилия  = СтрЗаменить(Фамилия, РазрешенныйСимвол, "");
	   Имя      = СтрЗаменить(Имя, РазрешенныйСимвол, "");
	   Отчество = СтрЗаменить(Отчество, РазрешенныйСимвол, "");
	КонецЦикла;
    // -- Сербаев 15.06.2023
	
	СтрокаСообщений = "";
    //Проверим правильность заполнения ФИО
	Если ТолькоКириллица Тогда
		ТолькоКириллицаФамилия = СтроковыеФункцииКлиентСервер.ТолькоКириллицаВСтроке(Фамилия);
		Если НЕ ТолькоКириллицаФамилия Тогда
		  	СтрокаСообщений = СтрокаСообщений + ?(ПустаяСтрока(СтрокаСообщений), "", Символы.ПС) + "Ошибка заполнения фамилии. Фамилия должна содержать только символы кириллицы!";
		КонецЕсли;
		ТолькоКириллицаИмя = СтроковыеФункцииКлиентСервер.ТолькоКириллицаВСтроке(Имя);
		Если НЕ ТолькоКириллицаИмя Тогда
		 	СтрокаСообщений = СтрокаСообщений + ?(ПустаяСтрока(СтрокаСообщений), "", Символы.ПС) + "Ошибка заполнения имени. Имя должно содержать только символы кириллицы!";
		КонецЕсли;	
		Если НЕ ПустаяСтрока(Отчество) Тогда
		    ТолькоКириллицаОтчество = СтроковыеФункцииКлиентСервер.ТолькоКириллицаВСтроке(Отчество);
			Если НЕ ТолькоКириллицаОтчество Тогда
				СтрокаСообщений = СтрокаСообщений + ?(ПустаяСтрока(СтрокаСообщений), "", Символы.ПС) + "Ошибка заполнения отчества. Отчество должно содержать только символы кириллицы!";
			КонецЕсли;
		КонецЕсли;	
	Иначе
  	    ТолькоЛатиницаФамилия = СтроковыеФункцииКлиентСервер.ТолькоЛатиницаВСтроке(Фамилия);
		Если НЕ ТолькоЛатиницаФамилия Тогда
			СтрокаСообщений = СтрокаСообщений + ?(ПустаяСтрока(СтрокаСообщений), "", Символы.ПС) + "Ошибка заполнения фамилии для иностранных граждан. Фамилия должна содержать только латинские символы!";
		КонецЕсли;
	    ТолькоЛатиницаИмя = СтроковыеФункцииКлиентСервер.ТолькоЛатиницаВСтроке(Имя);
		Если НЕ ТолькоЛатиницаИмя Тогда
			СтрокаСообщений = СтрокаСообщений + ?(ПустаяСтрока(СтрокаСообщений), "", Символы.ПС) + "Ошибка заполнения имени для иностранных граждан. Имя должно содержать только латинские символы!";
		КонецЕсли;	
		Если НЕ ПустаяСтрока(Отчество) Тогда
	   	    ТолькоЛатиницаОтчество = СтроковыеФункцииКлиентСервер.ТолькоЛатиницаВСтроке(Отчество);
			Если НЕ ТолькоЛатиницаОтчество Тогда
				СтрокаСообщений = СтрокаСообщений + ?(ПустаяСтрока(СтрокаСообщений), "", Символы.ПС) + "Ошибка заполнения отчества для иностранных граждан. Отчество должно содержать только латинские символы!";
			КонецЕсли;
		КонецЕсли;			
	КонецЕсли;	
	
	Если НЕ ПустаяСтрока(СтрокаСообщений) Тогда
		СтруктураВозврата.Результат = Ложь;
        СтруктураВозврата.Сообщение = СтрокаСообщений;
		Возврат СтруктураВозврата;
	КонецЕсли;	
		
	СтруктураВозврата.Результат = Истина;
    СтруктураВозврата.Сообщение = СтрокаСообщений;
	Возврат СтруктураВозврата;
КонецФункции

Функция ВычислитьВозраст(ДатаРождения) Экспорт

	Возраст = Год(Текущаядата()) - Год(ДатаРождения);	
	
	ДеньТекущий = День(Текущаядата());
	МесяцТекущий = Месяц(ТекущаяДата());
	
	ДеньРождения = День(ДатаРождения);
	МесяцРождения = Месяц(ДатаРождения);
	
	Если МесяцРождения > МесяцТекущий ИЛИ (МесяцРождения = МесяцТекущий И ДеньРождения > ДеньТекущий) Тогда
		
		Возраст = Возраст - 1;

	КонецЕсли;
	
	Возврат Возраст;	

КонецФункции 

Функция ПроверитьпоследниеИзмененияДокументаДокумент(Гражданство, ВидДокумента, Серия, Номер, ДокументЗалогодателя)
	ЗапросДок = Новый Запрос;
	ЗапросДок.УстановитьПараметр("ДокументЗалогодателя", ДокументЗалогодателя);
	ЗапросДок.Текст = "ВЫБРАТЬ
	                  |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
	                  |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
	                  |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК Серия,
	                  |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК Номер
	                  |ИЗ
	                  |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(, ДокументЗалогодателя = &ДокументЗалогодателя) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";
	ВыборкаДок = ЗапросДок.Выполнить().Выбрать();
	Если ВыборкаДок.Следующий() Тогда 
		Если ВыборкаДок.ВидДокумента  = ВидДокумента И
			 ВыборкаДок.Гражданство  = Гражданство И
			 СокрЛП(ВыборкаДок.Серия) = Серия И
			 СокрЛП(ВыборкаДок.Номер) = Номер Тогда
			Возврат Ложь;
		КонецЕсли;	
	КонецЕсли;
	Возврат Истина;
КонецФункции

Функция ПроверитьЕстьДокумент(Гражданство, ВидДокумента, Серия, Номер, ДокументСсылка = неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Гражданство", Гражданство);
	Запрос.УстановитьПараметр("ВидДокумента", ВидДокумента);
	Запрос.УстановитьПараметр("Серия", Серия);
	Запрос.УстановитьПараметр("Номер", Номер);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателей.ДокументЗалогодателя КАК ДокументЗалогодателя
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей КАК ЛБ_ДокументыЗалогодателей
	               |ГДЕ
	               |	ЛБ_ДокументыЗалогодателей.ВидДокумента = &ВидДокумента
	               |	И ЛБ_ДокументыЗалогодателей.Гражданство = &Гражданство
	               |	И ЛБ_ДокументыЗалогодателей.ДокументСерия = &Серия
	               |	И ЛБ_ДокументыЗалогодателей.ДокументНомер = &Номер";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ ДокументСсылка = неопределено Тогда
			Если НЕ Выборка.ДокументЗалогодателя = ДокументСсылка Тогда 
				Если НЕ ПроверитьпоследниеИзмененияДокументаДокумент(Гражданство, ВидДокумента, Серия, Номер, Выборка.ДокументЗалогодателя) Тогда
		           Возврат Выборка.ДокументЗалогодателя; 
				КонецЕсли;   
			КонецЕсли
		Иначе       
			Если НЕ ПроверитьпоследниеИзмененияДокументаДокумент(Гражданство, ВидДокумента, Серия, Номер, Выборка.ДокументЗалогодателя) Тогда
			    Возврат Выборка.ДокументЗалогодателя; 
			КонецЕсли;   
		КонецЕсли;	
	КонецЦикла;
	Возврат неопределено;
	
КонецФункции	

// Проверяет, содержит ли строка только символы кириллического алфавита.
//
// Параметры:
//  СтрокаПроверки - Строка - проверяемая строка.
//
// Возвращаемое значение:
//  Булево - Истина, если строка содержит только кириллические (или допустимые) символы или пустая;
//           Ложь, если строка содержит иные символы.
//
Функция ТолькоКириллицаИлиЛатиницаВСтроке(Знач СтрокаПроверки, Знач ЕстьСимволы = Истина, Знач ТолкоБуквы = Истина) Экспорт
	
	Если ТипЗнч(СтрокаПроверки) <> Тип("Строка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаПроверки) Тогда
		Возврат Истина;
	КонецЕсли;
	
	КодыДопустимыхСимволов = Новый Массив;
	КодыДопустимыхСимволов.Добавить(1105); // "ё"
	КодыДопустимыхСимволов.Добавить(1025); // "Ё"
	КодыДопустимыхСимволов.Добавить(32); // пробел
	Если ЕстьСимволы Тогда
		КодыДопустимыхСимволов.Добавить(46); // точка
		КодыДопустимыхСимволов.Добавить(45); // тире
    КонецЕсли;
	Если НЕ ТолкоБуквы Тогда
		КодыДопустимыхСимволов.Добавить(49); // 1
		КодыДопустимыхСимволов.Добавить(50); // 2
		КодыДопустимыхСимволов.Добавить(51); // 3
		КодыДопустимыхСимволов.Добавить(52); // 4
		КодыДопустимыхСимволов.Добавить(53); // 5
		КодыДопустимыхСимволов.Добавить(54); // 6
		КодыДопустимыхСимволов.Добавить(55); // 7
		КодыДопустимыхСимволов.Добавить(56); // 8
		КодыДопустимыхСимволов.Добавить(57); // 9
	КонецЕсли;	

	
	Для Индекс = 1 По СтрДлина(СтрокаПроверки) Цикл
		КодСимвола = КодСимвола(Сред(СтрокаПроверки, Индекс, 1));
		СимволК = Истина;
		СимволЛ = Истина;
		
		Если ((КодСимвола < 1040) Или (КодСимвола > 1103)) И (КодыДопустимыхСимволов.Найти(КодСимвола) = Неопределено) Тогда
				СимволК = Ложь;
		КонецЕсли;	
		Если ((КодСимвола < 65) Или (КодСимвола > 90 И КодСимвола < 97) Или (КодСимвола > 122)) И (КодыДопустимыхСимволов.Найти(КодСимвола) = Неопределено) Тогда
			СимволЛ = Ложь;
		КонецЕсли;
		Если НЕ (СимволК ИЛИ СимволЛ) Тогда
			Возврат Ложь;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ПроверитьМесторождениеЗалогодателя(Страна, Область, Район, НаселенныйПункт) Экспорт
	СтруктураВозврата = Новый Структура("Результат, Сообщение");
	
	СтрокаСообщений = "";
    //Проверим правильность заполнения 
	ОКСтрана = Истина;
	Если НЕ ПустаяСтрока(Страна) Тогда
        // ++ Сербаев 20.06.2023 
        //ОКСтрана = ТолькоКириллицаИлиЛатиницаВСтроке(Страна, ложь);
	    ОКСтрана = ТолькоКириллицаИлиЛатиницаВСтроке(Страна);
		// -- Сербаев 20.06.2023
		Если НЕ ОКСтрана Тогда
			СтрокаСообщений = СтрокаСообщений + ?(ПустаяСтрока(СтрокаСообщений), "", Символы.ПС) + "Ошибка заполнения страны. Страна должна содержать или только русские или только латинские символы!";
		КонецЕсли;
	КонецЕсли;
	ОКОбласть = Истина;
	Если НЕ ПустаяСтрока(Область) Тогда
	    ОКОбласть = ТолькоКириллицаИлиЛатиницаВСтроке(Область);
		Если НЕ ОКОбласть Тогда
			СтрокаСообщений = СтрокаСообщений + ?(ПустаяСтрока(СтрокаСообщений), "", Символы.ПС) + "Ошибка заполнения области. Область должна содержать или только русские или только латинские символы!";
		КонецЕсли;
	Иначе
		Если НЕ Найти(Врег(Страна), "РОССИЯ") = 0 Тогда
			СтрокаСообщений = СтрокаСообщений + ?(ПустаяСтрока(СтрокаСообщений), "", Символы.ПС) + "Ошибка заполнения области. Для места рождения РОССИЯ заполнение области обязательно!";
		КонецЕсли;	
	КонецЕсли;
	ОКРайон = Истина;
	Если НЕ ПустаяСтрока(Район) Тогда
		ОКРайон = ТолькоКириллицаИлиЛатиницаВСтроке(Район);
		Если НЕ ОКРайон Тогда
		  	СтрокаСообщений = СтрокаСообщений + ?(ПустаяСтрока(СтрокаСообщений), "", Символы.ПС) + "Ошибка заполнения района. Район должен содержать или только русские или только латинские символы!";
		КонецЕсли;	
	КонецЕсли;	
	ОКНаселенныйПункт = Истина;
	Если НЕ ПустаяСтрока(НаселенныйПункт) Тогда
	    ОКНаселенныйПункт = ТолькоКириллицаИлиЛатиницаВСтроке(НаселенныйПункт,,ложь);
		Если НЕ ОКНаселенныйПункт Тогда
			СтрокаСообщений = СтрокаСообщений + ?(ПустаяСтрока(СтрокаСообщений), "", Символы.ПС) + "Ошибка заполнения города. Город (населенный пункт) должно содержать или только русские или только латинские символы!";
		Иначе
			 ОКНаселенныйПункт = НЕ ПроверкаТолькоЦифры(НаселенныйПункт, "");
			 Если НЕ ОКНаселенныйПункт Тогда
			     СтрокаСообщений = СтрокаСообщений + ?(ПустаяСтрока(СтрокаСообщений), "", Символы.ПС) + "Ошибка заполнения города. Город (населенный пункт) не может содержать только цифры!";
			 КонецЕсли;	 
		КонецЕсли;
	КонецЕсли;	
	
	Если НЕ ПустаяСтрока(СтрокаСообщений) Тогда
		СтруктураВозврата.Результат = Ложь;
        СтруктураВозврата.Сообщение = СтрокаСообщений;
		Возврат СтруктураВозврата;
	КонецЕсли;	
	
	СтруктураВозврата.Результат = Истина;
    СтруктураВозврата.Сообщение = СтрокаСообщений;
	Возврат СтруктураВозврата;
КонецФункции

Функция ПроверитьПаспортРФДействует(ДатаРождения, ДатаВыдачи, ВыводитьСообщения = Истина) Экспорт
	Возраст = ВычислитьВозраст(ДатаРождения);
	ТекДата = НачалоДня(ТекущаяДата());
	ДатаРождения20 = ДобавитьМесяц(ДатаРождения, 12 * 20);
    Если Возраст <= 20 Тогда	    
		Если ДатаВыдачи > ДатаРождения20 Тогда
		    Возврат Истина;
		ИначеЕсли ДатаРождения20 > ТекДата Тогда
			РазницаВДнях = (ДатаРождения20 - ТекДата) / (60 * 60 * 24); 
			Если РазницаВДнях <= 30 И ВыводитьСообщения Тогда
			     Сообщить("Необходимо напомнить клиенту о скорой смене паспорта!", СтатусСообщения.Информация);
			КонецЕсли;	
	        Возврат Истина;
		Иначе		  
	        РазницаВДнях = (ТекДата - ДатаРождения20) / (60 * 60 * 24);
			Если РазницаВДнях <= 90 Тогда
				Возврат Истина;	  
			Иначе
				Возврат Ложь;
			КонецЕсли;	   
        КонецЕсли;
	Иначе
		Если ДатаВыдачи < ДатаРождения20 Тогда
			Возврат Ложь;
		КонецЕсли;	
	    ДатаРождения45 = ДобавитьМесяц(ДатаРождения, 12 * 45);
		Если ДатаВыдачи > ДатаРождения45 Тогда
		    Возврат Истина;
		ИначеЕсли ДатаРождения45 > ТекДата Тогда
			РазницаВДнях = (НачалоДня(ДатаРождения45) - ТекДата) / (60 * 60 * 24); 
			Если РазницаВДнях <= 30 И ВыводитьСообщения Тогда
			     Сообщить("Необходимо напомнить клиенту о скорой смене паспорта!", СтатусСообщения.Информация);
			КонецЕсли;	
	        Возврат Истина;
		Иначе		  
	        РазницаВДнях = (ТекДата - ДатаРождения45) / (60 * 60 * 24);
			Если РазницаВДнях <= 90 Тогда
				Возврат Истина;	  
			Иначе
				Возврат Ложь;
			КонецЕсли;	   
        КонецЕсли;
	КонецЕсли;			
КонецФункции

Функция ПроверитьСвидетельствоОРожденииДействует(ДатаРождения, ДатаПроверки = неопределено) Экспорт 
	Если ДатаПроверки = неопределено Тогда
		ДатаПроверки = ТекущаяДата(); 
	КонецЕсли;	
	Возраст = ВычислитьВозраст(ДатаРождения);
	Если Возраст >= 14 Тогда
		ТекДата = НачалоДня(ДатаПроверки);
		ДатаРождения14 = ДобавитьМесяц(ДатаРождения, 12 * 14);
	    РазницаВДнях = (ТекДата - ДатаРождения14) / (60 * 60 * 24);
		Если РазницаВДнях <= 90 Тогда
			Возврат Истина;	  
		Иначе
			Возврат Ложь;
		КонецЕсли;	
	Иначе
		Возврат Истина;
    КонецЕсли;			
КонецФункции	


Функция ДокументСоСрокомДействия(Гражданство, ВидДокументаЗалогодателя, ВидДокумента) Экспорт
	Если Гражданство = Справочники.СтраныМира.Россия Тогда
		ВидГражданства = Перечисления.ЛБ_ВидыГражданства.ГражданинРФ;
	ИначеЕсли Гражданство = Справочники.СтраныМира.БезГражданства Тогда
		ВидГражданства = Перечисления.ЛБ_ВидыГражданства.ЛицоБезГражданства;
	Иначе
		ВидГражданства = Перечисления.ЛБ_ВидыГражданства.ИностранныйГражданин;
	КонецЕсли;	

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.Обязателен КАК Обязателен
	               |ИЗ
	               |	РегистрСведений.ЛБ_НастройкаРеквизитовДокументовЗалогодателя КАК ЛБ_НастройкаРеквизитовДокументовЗалогодателя
	               |ГДЕ
	               |	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.ВидДокумента = &ВидДокумента
	               |	И ЛБ_НастройкаРеквизитовДокументовЗалогодателя.ВидДокументаЗалогодателя = &ВидДокументаЗалогодателя
				   |	И ЛБ_НастройкаРеквизитовДокументовЗалогодателя.ВидГражданства = &ВидГражданства
	               |	И ЛБ_НастройкаРеквизитовДокументовЗалогодателя.Реквизит = &Реквизит";
	               
	Запрос.УстановитьПараметр("ВидДокументаЗалогодателя", ВидДокументаЗалогодателя);
	Запрос.УстановитьПараметр("ВидДокумента", ВидДокумента);  
	Запрос.УстановитьПараметр("ВидГражданства", ВидГражданства);
	Запрос.УстановитьПараметр("Реквизит", Справочники.ЛБ_РеквизитыДокументовЗалогодателя.ДокументСрокДействия);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Обязателен;
	КонецЕсли;
	Возврат Ложь;
КонецФункции	
		

Функция СформироватьНаименованиеДокументаЗалогодателя(СтрокаТЧ) Экспорт
	Наименование = "";
	Наименование = Наименование + ?(ПустаяСтрока(Наименование), "", " ") + СокрЛП(СтрокаТЧ.ВидДокумента);
	Наименование = Наименование + ?(ЗначениеЗаполнено(СтрокаТЧ.ДокументСерия), ?(ПустаяСтрока(Наименование), "", " ") + "серия " + СокрЛП(СтрокаТЧ.ДокументСерия), "");
	Наименование = Наименование + ?(ЗначениеЗаполнено(СтрокаТЧ.ДокументНомер), ?(ПустаяСтрока(Наименование), "", " ") + "№ " + СокрЛП(СтрокаТЧ.ДокументНомер), "");
	Наименование = Наименование + ?(НЕ СтрокаТЧ.ДокументДатаВыдачи = Дата(1,1,1), ?(ПустаяСтрока(Наименование), "", " ") + "выдан " + СокрЛП(Формат(СтрокаТЧ.ДокументДатаВыдачи, "ДФ=dd.MM.yyyy")), "");
	Наименование = Наименование + ?(НЕ СтрокаТЧ.ДокументСрокДействия = Дата(1,1,1), ?(ПустаяСтрока(Наименование), "", " ") + "срок действия " + СокрЛП(Формат(СтрокаТЧ.ДокументСрокДействия, "ДФ=dd.MM.yyyy")), "");
	Возврат  Наименование;
КонецФункции	

Функция СформироватьПолноеНаименованиеДокументаЗалогодателя(СтрокаТЧ) Экспорт
	Наименование = "";
	Наименование = Наименование + ?(ЗначениеЗаполнено(СтрокаТЧ.Гражданство), ?(ПустаяСтрока(Наименование), "", " ") + СокрЛП(СтрокаТЧ.Гражданство), "");
	Наименование = Наименование + ?(ПустаяСтрока(Наименование), "", " ") + ?(СтрокаТЧ.ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность, "ДУЛ", "Доп. документ");
	Наименование = Наименование + ?(ПустаяСтрока(Наименование), "", " ") + СокрЛП(СтрокаТЧ.ВидДокумента);
	Наименование = Наименование + ?(ЗначениеЗаполнено(СтрокаТЧ.ДокументСерия), ?(ПустаяСтрока(Наименование), "", " ") + "серия " + СокрЛП(СтрокаТЧ.ДокументСерия), "");
	Наименование = Наименование + ?(ЗначениеЗаполнено(СтрокаТЧ.ДокументНомер), ?(ПустаяСтрока(Наименование), "", " ") + "№ " + СокрЛП(СтрокаТЧ.ДокументНомер), "");
	Наименование = Наименование + ?(НЕ ПустаяСтрока(СтрокаТЧ.ДокументКемВыдан), ?(ПустаяСтрока(Наименование), "", " ") + "выдан " + СокрЛП(СтрокаТЧ.ДокументКемВыдан), "");
	Наименование = Наименование + ?(НЕ СтрокаТЧ.ДокументДатаВыдачи = Дата(1,1,1), ?(ПустаяСтрока(Наименование), "", " ") + СокрЛП(Формат(СтрокаТЧ.ДокументДатаВыдачи, "ДФ=dd.MM.yyyy")), "");
	Наименование = Наименование + ?(ЗначениеЗаполнено(СтрокаТЧ.ДокументКодПодразделения), ?(ПустаяСтрока(Наименование), "", " ") + "код подр. " + СокрЛП(СтрокаТЧ.ДокументКодПодразделения), "");
	Наименование = Наименование + ?(НЕ СтрокаТЧ.ДокументСрокДействия = Дата(1,1,1), ?(ПустаяСтрока(Наименование), "", " ") + "срок действия " + СокрЛП(Формат(СтрокаТЧ.ДокументСрокДействия, "ДФ=dd.MM.yyyy")), "");
	Возврат  Наименование;
КонецФункции	

Функция ПолучитьДоступныеВидыДокументов(Гражданство, ВидДокументаЗалогодателя) Экспорт
	СписокВД = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидДокументаЗалогодателя", ВидДокументаЗалогодателя);
	Если Гражданство = Справочники.СтраныМира.Россия Тогда
		ВидГражданства = Перечисления.ЛБ_ВидыГражданства.ГражданинРФ;
	ИначеЕсли Гражданство = Справочники.СтраныМира.БезГражданства Тогда
		ВидГражданства = Перечисления.ЛБ_ВидыГражданства.ЛицоБезГражданства;
	Иначе
		ВидГражданства = Перечисления.ЛБ_ВидыГражданства.ИностранныйГражданин;
	КонецЕсли;	
	Запрос.УстановитьПараметр("ВидГражданства", ВидГражданства);
	МассивГ = Новый Массив;
	МассивГ.Добавить(Гражданство);
	МассивГ.Добавить(Справочники.СтраныМира.ПустаяСсылка());
	Запрос.УстановитьПараметр("Гражданство", МассивГ);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПереченьДокументовЗалогодателя.Гражданство КАК Гражданство,
	               |	ЛБ_ПереченьДокументовЗалогодателя.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_ПереченьДокументовЗалогодателя.ПорядокСортировки КАК ПорядокСортировки
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПереченьДокументовЗалогодателя КАК ЛБ_ПереченьДокументовЗалогодателя
	               |ГДЕ
	               |	ЛБ_ПереченьДокументовЗалогодателя.ВидДокументаЗалогодателя = &ВидДокументаЗалогодателя
	               |	И ЛБ_ПереченьДокументовЗалогодателя.Гражданство В(&Гражданство)
	               |	И ЛБ_ПереченьДокументовЗалогодателя.ВидГражданства = &ВидГражданства
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Гражданство УБЫВ,
	               |	ПорядокСортировки,
	               |	ВидДокумента";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	ТаблицаВидов = ТаблицаЗапроса.Скопировать();
	ТаблицаВидов.Свернуть("ВидДокумента");
	
	УдСтроки = Новый СписокЗначений;
	Для каждого СтрВ из ТаблицаВидов Цикл
		ОтборВ = новый Структура;
		ОтборВ.Вставить("ВидДокумента", СтрВ.ВидДокумента);
		
		Строки = ТаблицаЗапроса.НайтиСтроки(ОтборВ);
		Если Строки.Количество() > 1 Тогда
			Для сч = 1 По Строки.Количество() - 1 Цикл
				УдСтроки.Добавить(Строки.Получить(сч));
			Конеццикла;	
		КонецЕсли;	
	Конеццикла;	
	
	Для каждого Эл Из УдСтроки Цикл
		ТаблицаЗапроса.Удалить(Эл.Значение);
	Конеццикла;	
	
	Для каждого Выборка Из ТаблицаЗапроса Цикл
		СписокВД.Добавить(Выборка.ВидДокумента);
	КонецЦикла;	
	Возврат СписокВД; 
КонецФункции	

Функция ПолучитьДоступныеВидыДокументовЗалогодателя(Гражданство) Экспорт
	СписокВД = Новый СписокЗначений;
	Запрос = Новый Запрос;
	
	Если Гражданство = Справочники.СтраныМира.Россия Тогда
		ВидГражданства = Перечисления.ЛБ_ВидыГражданства.ГражданинРФ;
	ИначеЕсли Гражданство = Справочники.СтраныМира.БезГражданства Тогда
		ВидГражданства = Перечисления.ЛБ_ВидыГражданства.ЛицоБезГражданства;
	Иначе
		ВидГражданства = Перечисления.ЛБ_ВидыГражданства.ИностранныйГражданин;
	КонецЕсли;	
	Запрос.УстановитьПараметр("ВидГражданства", ВидГражданства);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЛБ_ПереченьДокументовЗалогодателя.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПереченьДокументовЗалогодателя КАК ЛБ_ПереченьДокументовЗалогодателя
	               |ГДЕ
	               |	ЛБ_ПереченьДокументовЗалогодателя.ВидГражданства = &ВидГражданства";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	ТаблицаЗапроса.Колонки.Добавить("Порядок");
	Для каждого Стр Из ТаблицаЗапроса Цикл
		Если Стр.ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность Тогда
			Стр.Порядок = 1;
		ИначеЕсли Стр.ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийПравоПребыванияРФ Тогда			
			Стр.Порядок = 2;	
		Иначе
			Стр.Порядок = 3;
		КонецЕсли;	
	Конеццикла;
	ТаблицаЗапроса.Сортировать("Порядок");
		
	Для каждого Выборка Из ТаблицаЗапроса Цикл
		СписокВД.Добавить(Выборка.ВидДокументаЗалогодателя);
	КонецЦикла;	
	Возврат СписокВД; 
КонецФункции	

Функция ПолучитьГруппуПроб(Проба) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Проба", Проба);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ГруппыПробПробы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЛБ_ГруппыПроб.Пробы КАК ЛБ_ГруппыПробПробы
	               |ГДЕ
	               |	ЛБ_ГруппыПробПробы.Проба = &Проба";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат неопределено;
КонецФункции	

// Проверяет, содержит ли строка только цифры.
//
// Параметры:
//  Значение         - Строка - проверяемая строка.
//  Устаревший       - Булево - устаревший параметр, не используется.
//  ПробелыЗапрещены - Булево - если Ложь, то в строке допустимо наличие пробелов.
//
// Возвращаемое значение:
//   Булево - Истина - строка содержит только цифры или пустая, Ложь - строка содержит иные символы.
//
// Пример:
//  Результат = СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке("0123"); // Истина
//  Результат = СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке("0123abc"); // Ложь
//  Результат = СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке("01 2 3",, Ложь); // Истина
//
Функция ПроверкаТолькоЦифры(Знач Значение, Знач ДопЗнак = неопределено) Экспорт
	
	Если ТипЗнч(Значение) <> Тип("Строка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ДопЗнак = неопределено Тогда
		Значение = СтрЗаменить(Значение, ДопЗнак, "");
	КонецЕсли;
		
	Если СтрДлина(Значение) = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Если содержит только цифры, то в результате замен должна быть получена пустая строка.
	// Проверять при помощи ПустаяСтрока нельзя, так как в исходной строке могут быть пробельные символы.
	Возврат СтрДлина(
		СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить(
		СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( 
			Значение, "0", ""), "1", ""), "2", ""), "3", ""), "4", ""), "5", ""), "6", ""), "7", ""), "8", ""), "9", "")) = 0;
	
КонецФункции

Функция ПроверкаКодаПодразделения(Знач Значение) Экспорт
	ДопЗнак = "-";
	Если ПроверкаТолькоЦифры(Значение, ДопЗнак) Тогда
		Поз = Найти(Значение, ДопЗнак);
		Если НЕ Поз = 4 Тогда
			Возврат ложь;
		КонецЕсли;	
		Возврат Истина;
	Иначе
		Возврат ложь;
	КонецЕсли;	
КонецФункции	
		
Функция ПроверитьЕстьОсновнойДУЛ(Залогодатель) Экспорт 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", Залогодатель);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателей.ДокументЗалогодателя КАК ДокументЗалогодателя
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей КАК ЛБ_ДокументыЗалогодателей
	               |ГДЕ
	               |	ЛБ_ДокументыЗалогодателей.ОсновнойДУЛ = ИСТИНА
	               |	И ЛБ_ДокументыЗалогодателей.ДокументНеДействителен = ЛОЖЬ
	               |	И ЛБ_ДокументыЗалогодателей.ДокументЗалогодателя.Владелец = &Владелец";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДокументЗалогодателя;
	КонецЕсли;
	Возврат неопределено;
КонецФункции

Функция ПолучитьПричинуПримененияПроцентнойСхемы(ДокументОбъект, ЗалоговыйБилет) Экспорт 
	Если НЕ ДокументОбъект.СхемаКредитования.ПризнакПримененияГибкогоПроцента Тогда
		Возврат Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма;
	КонецЕсли;

	Если ЗначениеЗаполнено(ДокументОбъект.Ссылка) Тогда	  
		МоментДоДокумента = Новый Граница(Новый МоментВремени(ДокументОбъект.Дата, ДокументОбъект.Ссылка), ВидГраницы.Исключая);
		ДатаДок = МоментДоДокумента; 
	Иначе	
	    ДатаДок = ДокументОбъект.Дата;		
	КонецЕсли;	
  			
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&Дата, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.Период УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если  Выборка.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Оформлен Тогда
		    Возврат Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма;
		ИначеЕсли  Выборка.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Продлен Тогда
			Возврат Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ОплатаПроцентов;
		КонецЕсли;	
	КонецЕсли;	
	Возврат Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ПустаяСсылка();
КонецФункции	

Функция РасчетПроцентов(ДатаНач, ДатаКон, ПроцентнаяСтавка, СуммаЗайма, ОкруглятьЦены, ВидОкругленияСуммыПроцентов = неопределено, ПорядокОкругления = неопределено , ОкруглятьВБольшуюСторону = неопределено) Экспорт
	Если НачалоДня(ДатаКон) = НачалоДня(ДатаНач)  Тогда
		КолДней = 1;
	Иначе	
		КолДней = (НачалоДня(ДатаКон) - НачалоДня(ДатаНач)) / (60 * 60 * 24) + 1;
	КонецЕсли;	
	
	СуммаПроцентов = СуммаЗайма*ПроцентнаяСтавка/100;  	
	Если ОкруглятьЦены Тогда  
		Если ВидОкругленияСуммыПроцентов = Перечисления.ЛБ_ВидыОкругленияСуммыПроцентов.ОкруглениеДоУмноженияНаКоличествоДней Тогда
			СуммаПроцентов = ОкруглитьЦену(СуммаПроцентов, ПорядокОкругления, ОкруглятьВБольшуюСторону)*КолДней;    
		ИначеЕсли ВидОкругленияСуммыПроцентов = Перечисления.ЛБ_ВидыОкругленияСуммыПроцентов.ОкруглениеПослеУмноженияНаКоличествоДней Тогда	
			СуммаПроцентов = ОкруглитьЦену(СуммаПроцентов*КолДней, ПорядокОкругления, ОкруглятьВБольшуюСторону);
		КонецЕсли;
	Иначе
		СуммаПроцентов = СуммаПроцентов*КолДней;
	КонецЕсли;	
	Возврат СуммаПроцентов;
КонецФункции	

Функция ПолучитьСостояниеЗалоговогоБилета(ДокументОбъект, ЗалоговыйБилет, НаНачалоДня = ложь) Экспорт 
	Если НаНачалоДня Тогда
		ДатаДок = НачалоДня(ДокументОбъект.Дата);
		Если ДатаДок = ДокументОбъект.Дата Тогда
			ДатаДок = ДатаДок - 1; //ситуация когда документ сделан на начало дня
		КонецЕсли;	
		Если ДатаДок < ЗалоговыйБилет.Дата Тогда 
			ДатаДок = ЗалоговыйБилет.Дата;
		КонецЕсли;	
    Иначе
		Если ЗначениеЗаполнено(ДокументОбъект.Ссылка) Тогда	 
			МоментДоДокумента = Новый Граница(Новый МоментВремени(ДокументОбъект.Дата, ДокументОбъект.Ссылка), ВидГраницы.Включая);  
			ДатаДок = МоментДоДокумента;  	
		Иначе	
		    ДатаДок = ДокументОбъект.Дата;	
		КонецЕсли;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаНачалаРасчетаПроцентов КАК ДатаНачалаРасчета,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаВыкупа КАК ДатаВыкупа,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаВыкупаЛьготныйСрок КАК ДатаВыкупаЛьготныйСрок,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПричинаПрименения КАК ПричинаПрименения,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.НомерДопСоглашения КАК НомерДопСоглашения
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&Дата, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.Период УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("ДатаНачалаРасчета", Выборка.ДатаНачалаРасчета); 
		СтруктураВозврата.Вставить("ДатаВыкупа", Выборка.ДатаВыкупа);
		СтруктураВозврата.Вставить("ДатаВыкупаЛьготныйСрок", Выборка.ДатаВыкупаЛьготныйСрок);
		СтруктураВозврата.Вставить("СуммаЗайма", Выборка.СуммаЗайма);
		СтруктураВозврата.Вставить("СтатусЗалоговогоБилета", Выборка.СтатусЗалоговогоБилета); 
		СтруктураВозврата.Вставить("ПричинаПрименения", Выборка.ПричинаПрименения); 
		СтруктураВозврата.Вставить("НомерДопСоглашения", Выборка.НомерДопСоглашения);
		
		Возврат СтруктураВозврата;
	КонецЕсли;
	Возврат неопределено;
КонецФункции

Функция ПолучитьСостояниеЗалоговогоБилетаДоНакладной(ДокументОбъект, ЗалоговыйБилет) Экспорт 
	ДатаДок = ДокументОбъект.Дата-1;	
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаНачалаРасчетаПроцентов КАК ДатаНачалаРасчета,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаВыкупа КАК ДатаВыкупа,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаВыкупаЛьготныйСрок КАК ДатаВыкупаЛьготныйСрок,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПричинаПрименения КАК ПричинаПрименения,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.НомерДопСоглашения КАК НомерДопСоглашения
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&Дата, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.Период УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("ДатаНачалаРасчета", Выборка.ДатаНачалаРасчета); 
		СтруктураВозврата.Вставить("ДатаВыкупа", Выборка.ДатаВыкупа);
		СтруктураВозврата.Вставить("ДатаВыкупаЛьготныйСрок", Выборка.ДатаВыкупаЛьготныйСрок);
		СтруктураВозврата.Вставить("СуммаЗайма", Выборка.СуммаЗайма);
		СтруктураВозврата.Вставить("СтатусЗалоговогоБилета", Выборка.СтатусЗалоговогоБилета); 
		СтруктураВозврата.Вставить("ПричинаПрименения", Выборка.ПричинаПрименения); 
		СтруктураВозврата.Вставить("НомерДопСоглашения", Выборка.НомерДопСоглашения);
		
		Возврат СтруктураВозврата;
	КонецЕсли;
	Возврат неопределено;
КонецФункции


Функция ПолучитьОстатокПроцентов(ДокументОбъект = неопределено, ЗалоговыйБилет) Экспорт 
	Если ДокументОбъект = неопределено Тогда
		ДатаДок = ТекущаяДата();
	Иначе	
		Если ЗначениеЗаполнено(ДокументОбъект.Ссылка) Тогда	  
			МоментДоДокумента = Новый Граница(Новый МоментВремени(ДокументОбъект.Дата, ДокументОбъект.Ссылка), ВидГраницы.Исключая);
			ДатаДок = МоментДоДокумента; 
		Иначе	
		    ДатаДок = ДокументОбъект.Дата;		
		КонецЕсли;
	КонецЕсли;	

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.УстановитьПараметр("ВидРасчета", Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РасчетыСКлиентамиОстатки.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	СУММА(ЛБ_РасчетыСКлиентамиОстатки.СуммаОстаток) КАК Сумма
	               |ИЗ
	               |	РегистрНакопления.ЛБ_РасчетыСКлиентами.Остатки(
	               |			&Дата,
	               |			ЗалоговыйБилет = &ЗалоговыйБилет
	               |				И ВидРасчета = &ВидРасчета) КАК ЛБ_РасчетыСКлиентамиОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_РасчетыСКлиентамиОстатки.ЗалоговыйБилет";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Сумма;
	КонецЕсли;
	
	Возврат 0;
КонецФункции

Функция ПолучитьОстатокПроцентовНаДату(Дата, ЗалоговыйБилет) Экспорт 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.УстановитьПараметр("ВидРасчета", Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РасчетыСКлиентамиОстатки.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	СУММА(ЛБ_РасчетыСКлиентамиОстатки.СуммаОстаток) КАК Сумма
	               |ИЗ
	               |	РегистрНакопления.ЛБ_РасчетыСКлиентами.Остатки(
	               |			&Дата,
	               |			ЗалоговыйБилет = &ЗалоговыйБилет
	               |				И ВидРасчета = &ВидРасчета) КАК ЛБ_РасчетыСКлиентамиОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_РасчетыСКлиентамиОстатки.ЗалоговыйБилет";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Сумма;
	КонецЕсли;
	
	Возврат 0;
КонецФункции

Функция ПолучитьНачисленияПроцентов_Старый(ДокументОбъект = неопределено, ЗалоговыйБилет, ДатаНачалаРасчета) Экспорт 
	Если ДокументОбъект = неопределено Тогда
		ДатаДок = ТекущаяДата();
	Иначе	
		Если ЗначениеЗаполнено(ДокументОбъект.Ссылка) Тогда	  
			МоментДоДокумента = Новый Граница(Новый МоментВремени(ДокументОбъект.Дата, ДокументОбъект.Ссылка), ВидГраницы.Исключая);
			ДатаДок = МоментДоДокумента; 
		Иначе	
		    ДатаДок = ДокументОбъект.Дата;		
		КонецЕсли;
	КонецЕсли;	

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач", ДатаНачалаРасчета);  
	Запрос.УстановитьПараметр("ДатаКон", ДатаДок);
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.УстановитьПараметр("ВидРасчета", Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РасчетыСКлиентамиОстатки.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	СУММА(ЛБ_РасчетыСКлиентамиОстатки.СуммаПриход) КАК Сумма
	               |ИЗ
	               |	РегистрНакопления.ЛБ_РасчетыСКлиентами.Обороты(
	               |			&ДатаНач,
	               |			&ДатаКон,
	               |			,
	               |			ЗалоговыйБилет = &ЗалоговыйБилет
	               |				И ВидРасчета = &ВидРасчета) КАК ЛБ_РасчетыСКлиентамиОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_РасчетыСКлиентамиОстатки.ЗалоговыйБилет";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Сумма;
	КонецЕсли;
	
	Возврат 0;
КонецФункции

Функция ПолучитьНачисленияПроцентов(ДокументОбъект = неопределено, ЗалоговыйБилет, ДатаНачалаРасчета) Экспорт 
	Если ДокументОбъект = неопределено Тогда
		ДатаДок = ТекущаяДата();
	Иначе	
		Если ЗначениеЗаполнено(ДокументОбъект.Ссылка) Тогда	  
			МоментДоДокумента = Новый Граница(Новый МоментВремени(ДокументОбъект.Дата, ДокументОбъект.Ссылка), ВидГраницы.Исключая);
			ДатаДок = МоментДоДокумента; 
		Иначе	
		    ДатаДок = ДокументОбъект.Дата;		
		КонецЕсли;
	КонецЕсли;	

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач", ДатаНачалаРасчета);  
	Запрос.УстановитьПараметр("ДатаКон", ДатаДок);
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
	Запрос.Текст ="ВЫБРАТЬ
	              |	ЛБ_НачислениеПроцентовДетальноОбороты.СуммаПроцентовОборот КАК СуммаПроцентов
	              |ИЗ
	              |	РегистрНакопления.ЛБ_НачислениеПроцентовДетально.Обороты(
	              |			,
	              |			&ДатаКон,
	              |			,
	              |			ЗалоговыйБилет = &ЗалоговыйБилет
	              |				И ДатаНач = &ДатаНач) КАК ЛБ_НачислениеПроцентовДетальноОбороты";	
	Выборка = Запрос.Выполнить().Выбрать();
	СуммаНачислено = 0;
	Пока Выборка.Следующий() Цикл
		СуммаНачислено = СуммаНачислено + Выборка.СуммаПроцентов;
	КонецЦикла;
	
	Возврат СуммаНачислено;
КонецФункции	

Функция ПолучитьНачисленияПроцентовДетально(ДокументОбъект = неопределено, ЗалоговыйБилет, ДатаНачалаРасчета) Экспорт 
	Если ДокументОбъект = неопределено Тогда
		ДатаДок = ТекущаяДата();
	Иначе	
		Если ЗначениеЗаполнено(ДокументОбъект.Ссылка) Тогда	  
			МоментДоДокумента = Новый Граница(Новый МоментВремени(ДокументОбъект.Дата, ДокументОбъект.Ссылка), ВидГраницы.Исключая);
			ДатаДок = МоментДоДокумента; 
		Иначе	
		    ДатаДок = ДокументОбъект.Дата;		
		КонецЕсли;
	КонецЕсли;	

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач", ДатаНачалаРасчета);  
	Запрос.УстановитьПараметр("ДатаКон", ДатаДок);
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
	Запрос.Текст ="ВЫБРАТЬ
	              |	ЛБ_НачислениеПроцентовДетальноОбороты.СуммаПроцентовОборот КАК СуммаПроцентов,
	              |	ЛБ_НачислениеПроцентовДетальноОбороты.ДеньНач КАК ДеньНач,
	              |	ЛБ_НачислениеПроцентовДетальноОбороты.ДеньКон КАК ДеньКон,
	              |	ЛБ_НачислениеПроцентовДетальноОбороты.ДатаНач КАК ДатаНач,
	              |	ЛБ_НачислениеПроцентовДетальноОбороты.ДатаКон КАК ДатаКон,
	              |	ЛБ_НачислениеПроцентовДетальноОбороты.ПроцентнаяСтавкаБазовая КАК ПроцентнаяСтавкаБазовая,
	              |	ЛБ_НачислениеПроцентовДетальноОбороты.ПроцентнаяСтавкаАкция КАК ПроцентнаяСтавкаАкция,
	              |	ЛБ_НачислениеПроцентовДетальноОбороты.ОтклонениеАкцияОтностельное КАК ОтклонениеАкцияОтностельное,
	              |	ЛБ_НачислениеПроцентовДетальноОбороты.ОтклонениеАкцияАбсолютное КАК ОтклонениеАкцияАбсолютное
	              |ИЗ
	              |	РегистрНакопления.ЛБ_НачислениеПроцентовДетально.Обороты(
	              |			,
	              |			&ДатаКон,
	              |			,
	              |			ЗалоговыйБилет = &ЗалоговыйБилет
	              |				И ДатаНачалаРасчета = &ДатаНач) КАК ЛБ_НачислениеПроцентовДетальноОбороты";	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
		
	Возврат ТаблицаЗапроса;
КонецФункции	 


Процедура ПроверитьДействительностьДокумента(Стр, Знач ДатаРождения, ВыводитьСообщения = Истина, ДатаПроверки = неопределено) Экспорт
	Если  ДатаПроверки = неопределено Тогда  
		ДатаПроверки = ТекущаяДата(); 
	КонецЕсли;	
	ЕстьСвидетельствоОРождении = ложь;	
	Если Стр.ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность Тогда
		Если (Стр.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ) ИЛИ (Стр.ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность) Тогда
			Если НЕ (ДатаРождения = Дата(1,1,1)) И (Стр.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ) Тогда
				Если НЕ ЛБ_ОбщийМодуль.ПроверитьПаспортРФДействует(ДатаРождения, Стр.ДокументДатаВыдачи, ВыводитьСообщения) Тогда
				    Стр.ПроверкаНеДействителен = Истина;
				КонецЕсли; 
			ИначеЕсли НЕ Стр.ДокументСрокДействия = Дата(1,1,1) Тогда
				Если Стр.ДокументСрокДействия < НачалоДня(ДатаПроверки) Тогда
			        Стр.ПроверкаНеДействителен = Истина;
			    КонецЕсли;
			КонецЕсли;	
		КонецЕсли;	
	ИначеЕсли (Стр.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.СвидетельствоОРождении) Тогда
		ЕстьСвидетельствоОРождении = Истина;
		Если НЕ (ДатаРождения = Дата(1,1,1))  Тогда
			Если НЕ ЛБ_ОбщийМодуль.ПроверитьСвидетельствоОРожденииДействует(ДатаРождения, ДатаПроверки) Тогда
				Стр.ПроверкаНеДействителен = Истина;
			КонецЕсли;
		КонецЕсли;
	//ИначеЕсли ЛБ_ОбщийМодуль.ДокументСоСрокомДействия(Стр.ВидДокументаЗалогодателя, Стр.ВидДокумента) Тогда
	ИначеЕсли НЕ Стр.ДокументСрокДействия = Дата(1,1,1) Тогда
		Если Стр.ДокументСрокДействия < НачалоДня(ДатаПроверки) Тогда
			Стр.ПроверкаНеДействителен = Истина;
		КонецЕсли;
	// ++ Сербаев 07.06.2023  (Проверка документа Вид на жительство на действительность)
    ИначеЕсли Стр.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ВидНаЖительство Тогда
	     Если ПроверитьДействительностьВидаНаЖительство(Стр, ДатаРождения, ДатаПроверки) Тогда
		     Стр.ПроверкаНеДействителен = Истина;
		 КонецЕсли;
	// -- Сербаев 07.06.2023
	КонецЕсли;		
КонецПроцедуры    

Процедура ПроверитьДействительностьСвидетельствоОРождении(ТаблицаДокументов) Экспорт 
	//	проверим недействительность свидетельства о рождении если есть паспорт
	ЕстьПаспорт = ложь;
	Для каждого Стр Из ТаблицаДокументов Цикл
		Если (Стр.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ) И НЕ (Стр.ДокументНЕДействителен ИЛИ Стр.ПроверкаНеДействителен) Тогда
		    ЕстьПаспорт = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	Если ЕстьПаспорт Тогда
		ОтборД = Новый структура;
		ОтборД.Вставить("ВидДокумента", Справочники.ВидыДокументовФизическихЛиц.СвидетельствоОРождении);
		СтрокиД = ТаблицаДокументов.НайтиСтроки(ОтборД);
		Для каждого СтрД Из СтрокиД цикл
			СтрД.ПроверкаНеДействителен = Истина;
		Конеццикла;	
	КонецЕсли;	 
КонецПроцедуры

Функция ПолучитьКлючСтроки(ДокументОбъект, ИмяТабличнойЧасти = "Товары") Экспорт
	
	ТаблицаКлючей = ДокументОбъект[ИмяТабличнойЧасти].Выгрузить(, "КлючСтроки");
	Если  ТаблицаКлючей.Количество() = 1 Тогда
		Возврат 1;
	Иначе	
		ТаблицаКлючей.Сортировать("КлючСтроки Убыв");
		
		Возврат ТаблицаКлючей[0].КлючСтроки + 1;
	КонецЕсли;	
	
КонецФункции

Функция ПроверитьГородФедеральногоЗначения(Регион) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регион", Регион);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ГородаФедеральногоЗначения.Регион КАК Регион
	               |ИЗ
	               |	РегистрСведений.ЛБ_ГородаФедеральногоЗначения КАК ЛБ_ГородаФедеральногоЗначения
	               |ГДЕ
	               |	ЛБ_ГородаФедеральногоЗначения.Регион = &Регион";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;	
	Возврат Ложь;
КонецФункции

Функция ПолучитьТекущийШаблон(Дата, ВидПрейскуранта, СписокЛ, СхемаКредитования = неопределено) Экспорт 
	//СписокЛ = Новый СписокЗначений;
	//СписокЛ.Добавить(Справочники.ЛБ_Ломбарды.ПустаяСсылка());
	//Для каждого Эл из Ломбарды Цикл 
	//	СписокЛ.Добавить(Эл.Значение);
	//КонецЦикла;
	
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ВидПрейскуранта", ВидПрейскуранта); 
	Запрос.УстановитьПараметр("Ломбарды", СписокЛ);
	Запрос.УстановитьПараметр("СхемаКредитования", СхемаКредитования);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ТекущийШаблонПриказа.Ломбард КАК Ломбард,
	               |	ЛБ_ТекущийШаблонПриказа.ШаблонПриказа КАК ШаблонПриказа
	               |ИЗ
	               |	РегистрСведений.ЛБ_ТекущийШаблонПриказа.СрезПоследних(
	               |			&Дата,
	               |			ВидПрейскуранта = &ВидПрейскуранта
	               |				И Ломбард В (&Ломбарды)";
	Если НЕ  СхемаКредитования = неопределено Тогда
		Запрос.Текст = Запрос.Текст + "
	               |				И СхемаКредитования = &СхемаКредитования"; 
	КонецЕсли;	       
	Запрос.Текст = Запрос.Текст + ") КАК ЛБ_ТекущийШаблонПриказа
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Ломбард УБЫВ";                                                               
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ШаблонПриказа;
	КонецЕсли;
	Возврат неопределено;
КонецФункции   

Функция ПолучитьТекущуюУстановкуШаблона(Дата, ВидШаблона, СписокЛ, СхемаКредитования = неопределено) Экспорт 	
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ВидШаблона", ВидШаблона); 
	Запрос.УстановитьПараметр("Ломбарды", СписокЛ);
	Запрос.УстановитьПараметр("СхемаКредитования", СхемаКредитования);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_УстановкаОтменаШаблонаПриказаСрезПоследних.ШаблонПриказа КАК ШаблонПриказа
	               |ИЗ
	               |	РегистрСведений.ЛБ_УстановкаОтменаШаблонаПриказа.СрезПоследних(
	               |			&Дата,
	               |			ВидШаблона = &ВидШаблона
	               |				И Ломбард В (&Ломбарды)
	               |				И Отменен = ЛОЖЬ";
	Если НЕ  СхемаКредитования = неопределено Тогда
		Запрос.Текст = Запрос.Текст + "
	               |				И СхемаКредитования = &СхемаКредитования"; 
	КонецЕсли;	       
	Запрос.Текст = Запрос.Текст + ")КАК ЛБ_УстановкаОтменаШаблонаПриказаСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Ломбард УБЫВ";                                                               
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ШаблонПриказа;
	КонецЕсли;
	Возврат неопределено;
КонецФункции


Функция ПолучитьТекущийШаблонАкция(Дата, ВидПрейскуранта, Акция) Экспорт
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ВидПрейскуранта", ВидПрейскуранта);
	Запрос.УстановитьПараметр("Акция", Акция);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ТекущийШаблонПриказаАкцииСрезПоследних.ШаблонПриказа КАК ШаблонПриказа
	               |ИЗ
	               |	РегистрСведений.ЛБ_ТекущийШаблонПриказаАкции.СрезПоследних(
	               |			&Дата,
	               |			ВидПрейскуранта = &ВидПрейскуранта
	               |				И Акция = &Акция) КАК ЛБ_ТекущийШаблонПриказаАкцииСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ШаблонПриказа;
	КонецЕсли;
	Возврат неопределено;
КонецФункции

Функция РассчитатьСуммуПроцентов(ДатаНач, ДатаКон, ПроцентнаяСтавка, СуммаЗайма, СтруктураОкругления) Экспорт   
	Если ЗначениеЗаполнено(ПроцентнаяСтавка) Тогда 
		ПроцентнаяСхемаРезультат = ПроцентнаяСтавка; 		
		Если НачалоДня(ДатаКон) < НачалоДня(ДатаНач) тогда 
			СуммаПроцентов = 0; 
			СуммаПроцентовДень = 0;
		Иначе	   
			Если СтруктураОкругления.ОкруглятьЦены Тогда
		        СуммаПроцентов = ЛБ_ОбщийМодуль.РасчетПроцентов(ДатаНач, ДатаКон, ПроцентнаяСхемаРезультат, СуммаЗайма, СтруктураОкругления.ОкруглятьЦены, СтруктураОкругления.ВидОкругленияСуммыПроцентов, СтруктураОкругления.ПорядокОкругления, СтруктураОкругления.ОкруглятьВБольшуюСторону); 
			Иначе
				СуммаПроцентов = ЛБ_ОбщийМодуль.РасчетПроцентов(ДатаНач, ДатаКон, ПроцентнаяСхемаРезультат, СуммаЗайма, СтруктураОкругления.ОкруглятьЦены);
			КонецЕсли;	
			КолДней = ?(НачалоДня(ДатаКон) = НачалоДня(ДатаНач), 1, (НачалоДня(ДатаКон) - НачалоДня(ДатаНач)) / (60 * 60 * 24) + 1);
			СуммаПроцентовДень = ?(КолДней <= 0, 0, СуммаПроцентов/КолДней);   
		КонецЕсли;	
	Иначе
		СуммаПроцентов = 0;
		СуммаПроцентовДень = 0;
	КонецЕсли;	 
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("СуммаПроцентов", СуммаПроцентов);
	СтруктураВозврата.Вставить("СуммаПроцентовДень", СуммаПроцентовДень); 
	
	Возврат СтруктураВозврата;
КонецФункции

Функция РассчитатьСуммуПроцентовОплата(Объект, ДатаНачалаРасчета, ПредельноеЗначениеПроцентов, ПричинаПримененияПроцентнойСхемы, Установки, СтруктураОкругления, ДатаРасчетаОстаткаЗайма = неопределено) Экспорт 
	ПроцентнаяСхемаРезультат = Объект.ПроцентнаяСхема;
	ТаблицаСтавок = Объект.ПредыдущаяОперация.ПроцентныеСтавкиПоПериодам.Выгрузить();
	УдСтроки = новый СписокЗначений;
	Для каждого стр Из ТаблицаСтавок Цикл 
		Если Стр.ПричинаПрименения =  ПричинаПримененияПроцентнойСхемы Тогда
			Продолжить;
		КонецЕсли;
		УдСтроки.Добавить(Стр);
	Конеццикла;	               
	Для каждого Эл из УдСтроки Цикл 
		ТаблицаСтавок.Удалить(Эл.Значение);
	Конеццикла;	 
	Объект.НачислениеПроцентовДетально.Очистить();   
	
	ПредельноеЗначениеПоДоговору = ложь;                                                                                
	Если Установки = неопределено Тогда 
		НеНачислятьПроцентыЗаПоследнийДень = ложь;
		СчитатьПроцентыДеньВыдачиРавенДеньВыкупа = ложь;
	Иначе 
		НеНачислятьПроцентыЗаПоследнийДень = Установки.НеНачислятьПроцентыЗаПоследнийДень;
		СчитатьПроцентыДеньВыдачиРавенДеньВыкупа = Установки.СчитатьПроцентыДеньВыдачиРавенДеньВыкупа;
	КонецЕсли;	
	
	НачисленоПроценты = ЛБ_УправлениеЛомбардом.ПолучитьНачисленныеПроцентыПоДоговору(Объект, Объект.ПредыдущаяОперация);
	
	Если ДатаРасчетаОстаткаЗайма = неопределено Тогда
		СтруктураРез = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗалоговогоБилета(Объект, Объект.ПредыдущаяОперация, Истина);
		СуммаЗаймаНач = СтруктураРез.СуммаЗайма;  
	Иначе    
		ДатаДокумента = Объект.Дата; 
		Объект.Дата = ДатаРасчетаОстаткаЗайма;
		СтруктураРез = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗалоговогоБилета(Объект, Объект.ПредыдущаяОперация);
		СуммаЗаймаНач = СтруктураРез.СуммаЗайма; 
		Объект.Дата = ДатаДокумента;
	КонецЕсли;	
	Если СуммаЗаймаНач = 0 Тогда 
		СтруктураВозврата = Новый Структура;
	    СтруктураВозврата.Вставить("СуммаПроцентов", 0); 
		СтруктураВозврата.Вставить("СуммаПроцентовНачислено", 0);
	    СтруктураВозврата.Вставить("СуммаПроцентовДень", 0);
        СтруктураВозврата.Вставить("ПредельноеЗначениеПоДоговору", ПредельноеЗначениеПоДоговору);

		Возврат СтруктураВозврата;
	КонецЕсли;	
	
	ДатаДок = Объект.Дата;
	ДатаНач = НачалоДня(ДатаНачалаРасчета);
	ДатаКон = НачалоДня(Объект.Дата); 
	//Если НачалоДня(ДатаКон) < НачалоДня(ДатаНач) тогда
	СуммаНачисленоЗаПериод = 0;
	//Иначе	
	//    СуммаНачисленоЗаПериод = ЛБ_ОбщийМодуль.ПолучитьНачисленияПроцентов(Объект, Объект.ПредыдущаяОперация, ДатаНачалаРасчета);
	//КонецЕсли;	
	Если Объект.Выкуп Тогда
		Если НеНачислятьПроцентыЗаПоследнийДень Тогда
		    ДатаКон = НачалоДня(ДатаКон - 1);			
		КонецЕсли;                              
		Если НачалоДня(Объект.Дата) = НачалоДня(Объект.ПредыдущаяОперация.Дата) Тогда
			Если СчитатьПроцентыДеньВыдачиРавенДеньВыкупа Тогда 
				СтрС = ТаблицаСтавок.Получить(0); 
				СтавкаП = СтрС.ПроцентнаяСтавка; 
				Если СтрС.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Акционная Тогда
					Если НЕ СтрС.ПроцентнаяСтавкаАкция = 0 Тогда
						СтавкаП = СтрС.ПроцентнаяСтавкаАкция;
					ИначеЕсли НЕ СтрС.ОтклонениеАкцияОтносительное = 0 Тогда	 
						СтавкаП = СтрС.ПроцентнаяСтавка + СтрС.ПроцентнаяСтавка*СтрС.ОтклонениеАкцияОтносительное/100;
					ИначеЕсли НЕ СтрС.ОтклонениеАкцияАбсолютное = 0 Тогда
						СтавкаП = СтрС.ПроцентнаяСтавка + СтрС.ОтклонениеАкцияАбсолютное;
				    КонецЕсли; 
				КонецЕсли;	

				Если СтруктураОкругления.ОкруглятьЦены Тогда
			        СуммаПроцентов = ЛБ_ОбщийМодуль.РасчетПроцентов(ДатаКон, ДатаКон, СтавкаП, СуммаЗаймаНач, СтруктураОкругления.ОкруглятьЦены, СтруктураОкругления.ВидОкругленияСуммыПроцентов, СтруктураОкругления.ПорядокОкругления, СтруктураОкругления.ОкруглятьВБольшуюСторону); 
				Иначе
					СуммаПроцентов = ЛБ_ОбщийМодуль.РасчетПроцентов(ДатаКон, ДатаКон, СтавкаП, СуммаЗаймаНач, СтруктураОкругления.ОкруглятьЦены);
				КонецЕсли;     
				Если НЕ ПредельноеЗначениеПроцентов = 0 Тогда 
					МожноНачислитьПроценты = ПредельноеЗначениеПроцентов - НачисленоПроценты;
					Если СуммаПроцентов > МожноНачислитьПроценты Тогда
						СуммаПроцентов = МожноНачислитьПроценты;
						ПредельноеЗначениеПоДоговору = Истина;
					КонецЕсли;	
				КонецЕсли;	
				СуммаПроцентовДень = СуммаПроцентов; 
												
				СтрП = Объект.НачислениеПроцентовДетально.Добавить();   
				СтрП.ВидПроцентнойСтавки = СтрС.ВидПроцентнойСтавки; 
				СтрП.ДатаНач = ДатаКон;
				СтрП.ДатаКон = ДатаКон;
				СтрП.ДеньНач = СтрС.ДеньНачалаПрименения;  
				СтрП.ДеньКон = СтрС.ДеньНачалаПрименения; 
				СтрП.ПроцентнаяСтавкаБазовая = СтрС.ПроцентнаяСтавка;
				СтрП.ПроцентнаяСтавкаАкция = СтрС.ПроцентнаяСтавкаАкция;
				СтрП.ОтклонениеАкцияОтносительное = СтрС.ОтклонениеАкцияОтносительное; 
				СтрП.ОтклонениеАкцияАбсолютное = СтрС.ОтклонениеАкцияАбсолютное;
                СтрП.СуммаПроцентов = СуммаПроцентов;
				СтрП.СуммаПроцентовДень = СуммаПроцентовДень;
				
				СтруктураВозврата = Новый Структура;
				СтруктураВозврата.Вставить("СуммаПроцентов", СуммаПроцентов); 
				СтруктураВозврата.Вставить("СуммаПроцентовНачислено", Объект.НачислениеПроцентовДетально.Итог("СуммаПроцентов"));
				СтруктураВозврата.Вставить("СуммаПроцентовДень", СуммаПроцентовДень);
				СтруктураВозврата.Вставить("ПредельноеЗначениеПоДоговору", ПредельноеЗначениеПоДоговору); 
				Возврат СтруктураВозврата;  
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	  
	Если НачалоДня(ДатаКон) < НачалоДня(ДатаНач) тогда 
		СуммаПроцентов = ЛБ_ОбщийМодуль.ПолучитьОстатокПроцентов(Объект, Объект.ПредыдущаяОперация);;   
		Если СтруктураОкругления.ОкруглятьЦены Тогда
		    СуммаПроцентовДень = ЛБ_ОбщийМодуль.РасчетПроцентов(ДатаНач, ДатаНач, ПроцентнаяСхемаРезультат, СуммаЗаймаНач, СтруктураОкругления.ОкруглятьЦены, СтруктураОкругления.ВидОкругленияСуммыПроцентов, СтруктураОкругления.ПорядокОкругления, СтруктураОкругления.ОкруглятьВБольшуюСторону);
		Иначе
			СуммаПроцентовДень = ЛБ_ОбщийМодуль.РасчетПроцентов(ДатаНач, ДатаНач, ПроцентнаяСхемаРезультат, СуммаЗаймаНач, СтруктураОкругления.ОкруглятьЦены); 
		КонецЕсли;	
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("СуммаПроцентов", СуммаПроцентов);  
		СтруктураВозврата.Вставить("СуммаПроцентовНачислено", 0);
		СтруктураВозврата.Вставить("СуммаПроцентовДень", СуммаПроцентовДень);
		СтруктураВозврата.Вставить("ПредельноеЗначениеПоДоговору", ПредельноеЗначениеПоДоговору);
	Иначе	         
		ДатаКонРезультат = ДатаКон;
		СуммаПроцентов = ЛБ_ОбщийМодуль.ПолучитьОстатокПроцентов(Объект, Объект.ПредыдущаяОперация);
		Если НЕ ПредельноеЗначениеПроцентов = 0 Тогда 
			МожноНачислитьПроценты = ПредельноеЗначениеПроцентов - НачисленоПроценты; 
		КонецЕсли;	 
		ТаблицаНачисленоЗаПериод = ПолучитьНачисленияПроцентовДетально(Объект, Объект.ПредыдущаяОперация, ДатаНачалаРасчета);
		Для сч = 0 По ТаблицаСтавок.Количество() - 1 Цикл 
			СтрС = ТаблицаСтавок.Получить(сч);
			ДеньНач = СтрС.ДеньНачалаПрименения;
			Если СтрС.ДеньНачалаПрименения = 1 Тогда
				ДатаНач = ДатаНачалаРасчета;   
			Иначе 
				ДатаНач = НачалоДня(ДатаНачалаРасчета-1) + СтрС.ДеньНачалаПрименения*(60 * 60 * 24);
			КонецЕсли;	  
			//Если ДатаНач > НачалоДня(Объект.Дата) Тогда  
			Если ДатаНач > ДатаКонРезультат Тогда
				Прервать;
			КонецЕсли;	
			
			сч1 = сч + 1;
			Если сч1 >= ТаблицаСтавок.Количество() Тогда
				ДатаКон = ДатаКонРезультат; 
				ДеньКон = (НачалоДня(ДатаКон) - НачалоДня(ДатаНачалаРасчета)) / (60 * 60 * 24) + 1;
			Иначе   
				СтрС1 = ТаблицаСтавок.Получить(сч1);
				ДатаКонца = НачалоДня(ДатаНачалаРасчета-1) + (СтрС1.ДеньНачалаПрименения-1)*(60 * 60 * 24); 
				//Если ДатаКонца > НачалоДня(Объект.Дата) Тогда 
				Если ДатаКонца > ДатаКонРезультат Тогда
					ДатаКон = ДатаКонРезультат; 
				    ДеньКон = (НачалоДня(ДатаКон) - НачалоДня(ДатаНачалаРасчета)) / (60 * 60 * 24) + 1;
				Иначе
					ДатаКон = ДатаКонца; 
					ДеньКон = СтрС1.ДеньНачалаПрименения-1;
				КонецЕсли;	
			КонецЕсли;	    
			
			//Проверим начисления
			ДатаКонНачислено = ДатаНач;
			Для каждого СтрН из ТаблицаНачисленоЗаПериод Цикл 
				Если СтрН.ДатаКон < ДатаНач Тогда
					Продолжить;
				КонецЕсли;	
				Если СтрН.ДатаКон > ДатаКон Тогда
					Прервать;
				КонецЕсли;	
				Если СтрН.ДатаКон <= ДатаКон Тогда 
					ДатаКонНачислено = СтрН.ДатаКон;
				КонецЕсли;	
			КонецЦикла; 		
			
			Если НЕ ДатаКонНачислено = ДатаНач Тогда
				Если ДатаКонНачислено = ДатаКон Тогда
					Продолжить;
				КонецЕсли;
				
				ДатаНач = КонецДня(ДатаКонНачислено) + 1;
			КонецЕсли;	

			
			СтрС = ТаблицаСтавок.Получить(сч); 
			СтавкаП = СтрС.ПроцентнаяСтавка; 
			Если СтрС.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Акционная Тогда
				Если НЕ СтрС.ПроцентнаяСтавкаАкция = 0 Тогда
					СтавкаП = СтрС.ПроцентнаяСтавкаАкция;
				ИначеЕсли НЕ СтрС.ОтклонениеАкцияОтносительное = 0 Тогда	 
					СтавкаП = СтрС.ПроцентнаяСтавка + СтрС.ПроцентнаяСтавка*СтрС.ОтклонениеАкцияОтносительное/100;
				ИначеЕсли НЕ СтрС.ОтклонениеАкцияАбсолютное = 0 Тогда
					СтавкаП = СтрС.ПроцентнаяСтавка + СтрС.ОтклонениеАкцияАбсолютное;
			    КонецЕсли; 
			КонецЕсли;	
						
			КолДней = ?(НачалоДня(ДатаКон) = НачалоДня(ДатаНач), 0, (НачалоДня(ДатаКон) - НачалоДня(ДатаНач)) / (60 * 60 * 24)) + 1;
			Если СтруктураОкругления.ОкруглятьЦены Тогда
		        СуммаПроцентовНач = ЛБ_ОбщийМодуль.РасчетПроцентов(ДатаНач, ДатаКон, СтавкаП, СуммаЗаймаНач, СтруктураОкругления.ОкруглятьЦены, СтруктураОкругления.ВидОкругленияСуммыПроцентов, СтруктураОкругления.ПорядокОкругления, СтруктураОкругления.ОкруглятьВБольшуюСторону);
          	Иначе
				СуммаПроцентовНач = ЛБ_ОбщийМодуль.РасчетПроцентов(ДатаНач, ДатаКон, СтавкаП, СуммаЗаймаНач, СтруктураОкругления.ОкруглятьЦены); 
			КонецЕсли;	
			
			СуммаПроцентовНачислено = СуммаПроцентовНач; 
			//ДеньНачК = ДеньНач;  
			//ДатаНачК = ДатаНач;  
			//Для каждого СтрН из ТаблицаНачисленоЗаПериод Цикл 
			//	Если СтрН.ДатаКон = ДатаКон Тогда	
			//		СтрН.СуммаПроцентов = 0; 
			//		СуммаПроцентовНачислено = 0;
			//		Прервать;
			//	ИначеЕсли СтрН.ДатаКон > ДатаКон Тогда
			//		Прервать;
			//	КонецЕсли;	
			//	Если НЕ СтрН.СуммаПроцентов = 0 Тогда  
			//		Если СуммаПроцентовНачислено >= СтрН.СуммаПроцентов Тогда 
			//			СуммаПроцентовНачислено = СуммаПроцентовНачислено - СтрН.СуммаПроцентов;
			//			СтрН.СуммаПроцентов = 0;
			//		Иначе         						
			//			СтрН.СуммаПроцентов = СтрН.СуммаПроцентов - СуммаПроцентовНачислено;
			//			СуммаПроцентовНачислено = 0;
			//		КонецЕсли;	
			//		ДеньНачК = СтрН.ДеньКон+1;  
			//	    ДатаНачК = КонецДня(СтрН.ДатаКон) + 1; 
			//	КонецЕсли; 
			//КонецЦикла; 			
			//			
			//Если (СуммаПроцентовНачислено = 0) И НЕ (ДатаКон = ДатаКонРезультат) Тогда //(ДатаКон = Объект.Дата) Тогда  
			//    Продолжить;
			//КонецЕсли;
			//
			//Если НЕ ДеньНач = ДеньНачК И НЕ (СуммаПроцентовНачислено = 0) Тогда
			//	ДеньНач = ДеньНачК;  
			//	ДатаНач = ДатаНачК;    
			//	КолДней = ?(НачалоДня(ДатаКон) = НачалоДня(ДатаНач), 0, (НачалоДня(ДатаКон) - НачалоДня(ДатаНач)) / (60 * 60 * 24)) + 1;
			//	Если СтруктураОкругления.ОкруглятьЦены Тогда
			//        СуммаПроцентовНач = ЛБ_ОбщийМодуль.РасчетПроцентов(ДатаНач, ДатаКон, СтавкаП, СуммаЗаймаНач, СтруктураОкругления.ОкруглятьЦены, СтруктураОкругления.ВидОкругленияСуммыПроцентов, СтруктураОкругления.ПорядокОкругления, СтруктураОкругления.ОкруглятьВБольшуюСторону);
			//  	Иначе
			//		СуммаПроцентовНач = ЛБ_ОбщийМодуль.РасчетПроцентов(ДатаНач, ДатаКон, СтавкаП, СуммаЗаймаНач, СтруктураОкругления.ОкруглятьЦены); 
			//	КонецЕсли;              
			//	СуммаПроцентовНачислено = СуммаПроцентовНач;
			//КонецЕсли;	
			////СуммаПроцентовДень = окр(СуммаПроцентовНач/КолДней, 2);   
			
			СуммаПроцентовДень = СуммаПроцентовНач/КолДней;
			Если НЕ ПредельноеЗначениеПроцентов = 0 Тогда
				Если СуммаПроцентовНачислено > МожноНачислитьПроценты Тогда 
					РазницаНачислено = СуммаПроцентовНачислено - МожноНачислитьПроценты;
					РазницаДни = окр(РазницаНачислено/СуммаПроцентовДень, 0, РежимОкругления.Окр15как20);  
					СуммаПроцентовНачислено = МожноНачислитьПроценты;
					СуммаПроцентов = СуммаПроцентов + СуммаПроцентовНачислено;
					ПредельноеЗначениеПоДоговору = Истина;  					
					ДеньКон = окр(ДеньКон - РазницаДни, 0);
					ДатаКон = НачалоДня(ДатаКон - РазницаДни*(24*60*60));
				Иначе         
					СуммаПроцентов = СуммаПроцентов + СуммаПроцентовНачислено;
					МожноНачислитьПроценты = МожноНачислитьПроценты - СуммаПроцентовНачислено;  					
				КонецЕсли;	                                                                    
			Иначе
				СуммаПроцентов = СуммаПроцентов + СуммаПроцентовНачислено;
			КонецЕсли;	
			
			СтрП = Объект.НачислениеПроцентовДетально.Добавить();   
			СтрП.ВидПроцентнойСтавки = СтрС.ВидПроцентнойСтавки; 
			СтрП.ДатаНач = ДатаНач;
			СтрП.ДатаКон = ДатаКон;
			СтрП.ДеньНач = ДеньНач;  
			СтрП.ДеньКон = ДеньКон; 
			СтрП.ПроцентнаяСтавкаБазовая = СтрС.ПроцентнаяСтавка;
			СтрП.ПроцентнаяСтавкаАкция = СтрС.ПроцентнаяСтавкаАкция;
			СтрП.ОтклонениеАкцияОтносительное = СтрС.ОтклонениеАкцияОтносительное; 
			СтрП.ОтклонениеАкцияАбсолютное = СтрС.ОтклонениеАкцияАбсолютное;
            СтрП.СуммаПроцентов = СуммаПроцентовНачислено;
			СтрП.СуммаПроцентовДень = СуммаПроцентовДень; 
			
			Если ПредельноеЗначениеПоДоговору Тогда
				Прервать;
			КонецЕсли;	
		КонецЦикла;   
				
        // ++ Сербаев 20.06.2023 добавил проверку
		Если Не Объект.НачислениеПроцентовДетально.Количество() = 0 Тогда
		    СуммаПроцентовДень = Объект.НачислениеПроцентовДетально.Получить(0).СуммаПроцентовДень;
		КонецЕсли;
		// -- Сербаев 20.06.2023
		
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("СуммаПроцентов", СуммаПроцентов); 
		СтруктураВозврата.Вставить("СуммаПроцентовНачислено", Объект.НачислениеПроцентовДетально.Итог("СуммаПроцентов"));
		СтруктураВозврата.Вставить("СуммаПроцентовДень", СуммаПроцентовДень);
		СтруктураВозврата.Вставить("ПредельноеЗначениеПоДоговору", ПредельноеЗначениеПоДоговору);
	КонецЕсли;	
		
	Возврат СтруктураВозврата;
КонецФункции    

Функция ПолучитьОплатуПередИзъятием(ДатаОкончанияРасчета, ЗалоговыйБилет) 
	СуммаПроцентовОплачено = 0;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
	Запрос.УстановитьПараметр("Дата", ДатаОкончанияРасчета);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РасчетыСКлиентамиОбороты.Период КАК Период,
	               |	ЛБ_РасчетыСКлиентамиОбороты.СуммаРасход КАК Сумма
	               |ИЗ
	               |	РегистрНакопления.ЛБ_РасчетыСКлиентами.Обороты(
	               |			,
	               |			,
	               |			Регистратор,
	               |			ЗалоговыйБилет = &ЗалоговыйБилет
	               |				И ВидРасчета = Значение(Перечисление.ЛБ_ВидыРасчетов.ПоПроцентам)) КАК ЛБ_РасчетыСКлиентамиОбороты
	               |ГДЕ
	               |	ЛБ_РасчетыСКлиентамиОбороты.Период > &Дата
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	    СуммаПроцентовОплачено = СуммаПроцентовОплачено + Выборка.Сумма;
    КонецЦикла;
	
	Возврат СуммаПроцентовОплачено;
КонецФункции   

Функция ПолучитьСуммуЗаймаПередИзъятием(ДатаОкончанияРасчета, ЗалоговыйБилет) 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
	Запрос.УстановитьПараметр("Дата", ДатаОкончанияРасчета);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РасчетыСКлиентамиОстатки.СуммаОстаток КАК СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.ЛБ_РасчетыСКлиентами.Остатки(
	               |			&Дата,
	               |			ЗалоговыйБилет = &ЗалоговыйБилет
	               |				И ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыРасчетов.ПоОсновномуДолгу)) КАК ЛБ_РасчетыСКлиентамиОстатки";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
	    Возврат Выборка.СуммаОстаток;
    КонецЕсли;
	
	Возврат 0;
КонецФункции


Функция РассчитатьСуммуПроцентовИзъятие(Объект, ДатаНачалаРасчета, ДатаОкончанияРасчета, ПредельноеЗначениеПроцентов, ПричинаПримененияПроцентнойСхемы, Установки, СтруктураОкругления) Экспорт 
	ПроцентнаяСхемаРезультат = Объект.ПроцентнаяСхема;   
	ТаблицаСтавок = Объект.ПредыдущаяОперация.ПроцентныеСтавкиПоПериодам.Выгрузить();
	УдСтроки = новый СписокЗначений;
	Для каждого стр Из ТаблицаСтавок Цикл 
		Если Стр.ПричинаПрименения =  ПричинаПримененияПроцентнойСхемы Тогда
			Продолжить;
		КонецЕсли;
		УдСтроки.Добавить(Стр);
	Конеццикла;	               
	Для каждого Эл из УдСтроки Цикл 
		ТаблицаСтавок.Удалить(Эл.Значение);
	Конеццикла;	 
	Объект.НачислениеПроцентовДетально.Очистить();
	
	ПредельноеЗначениеПоДоговору = ложь;                                                                                
	Если Установки = неопределено Тогда 
		НеНачислятьПроцентыЗаПоследнийДень = ложь;
		СчитатьПроцентыДеньВыдачиРавенДеньВыкупа = ложь;
	Иначе 
		НеНачислятьПроцентыЗаПоследнийДень = Установки.НеНачислятьПроцентыЗаПоследнийДень;
		СчитатьПроцентыДеньВыдачиРавенДеньВыкупа = Установки.СчитатьПроцентыДеньВыдачиРавенДеньВыкупа;
	КонецЕсли;	
	
	НачисленоПроценты = ЛБ_УправлениеЛомбардом.ПолучитьНачисленныеПроцентыПоДоговору(Объект, Объект.ПредыдущаяОперация);
	
	СуммаЗаймаНач = ПолучитьСуммуЗаймаПередИзъятием(ДатаОкончанияРасчета, Объект.ПредыдущаяОперация);
	//СтруктураРез = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗалоговогоБилета(Объект, Объект.ПредыдущаяОперация, Истина);
	//СуммаЗаймаНач = СтруктураРез.СуммаЗайма;    
	Если СуммаЗаймаНач = 0 Тогда 
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("СуммаЗайма", 0);
	    СтруктураВозврата.Вставить("СуммаПроцентов", 0);
	    СтруктураВозврата.Вставить("СуммаПроцентовДень", 0);
        СтруктураВозврата.Вставить("ПредельноеЗначениеПоДоговору", ПредельноеЗначениеПоДоговору);

		Возврат СтруктураВозврата;
	КонецЕсли;	
	
	ПроцентыОплаченыПослеДатыОкончанияРасчетов = ПолучитьОплатуПередИзъятием(ДатаОкончанияРасчета, Объект.ПредыдущаяОперация);
	ДатаНач = НачалоДня(ДатаНачалаРасчета);
	ДатаКон = КонецДня(ДатаОкончанияРасчета);                           
	Если НачалоДня(Объект.ПредыдущаяОперация.Дата) = НачалоДня(ДатаОкончанияРасчета) Тогда
		Если СчитатьПроцентыДеньВыдачиРавенДеньВыкупа Тогда 
			ДатаОкончанияРасчета = НачалоДня(ДатаКон + 1);
			ДатаКон = ДатаОкончанияРасчета; 
		КонецЕсли;
	КонецЕсли;	

	//Если НачалоДня(ДатаКон) < НачалоДня(ДатаНач) тогда
		СуммаНачисленоЗаПериод = 0;
	//Иначе	
	//    СуммаНачисленоЗаПериод = ЛБ_ОбщийМодуль.ПолучитьНачисленияПроцентов(Объект, Объект.ПредыдущаяОперация, ДатаНачалаРасчета);
	//КонецЕсли;	
	Если НачалоДня(ДатаКон) < НачалоДня(ДатаНач) тогда 
		СуммаПроцентов = 0;   
		Если СтруктураОкругления.ОкруглятьЦены Тогда
	        СуммаПроцентовДень = ЛБ_ОбщийМодуль.РасчетПроцентов(ДатаНач, ДатаНач, ПроцентнаяСхемаРезультат, СуммаЗаймаНач, СтруктураОкругления.ОкруглятьЦены, СтруктураОкругления.ВидОкругленияСуммыПроцентов, СтруктураОкругления.ПорядокОкругления, СтруктураОкругления.ОкруглятьВБольшуюСторону);
		Иначе
			СуммаПроцентовДень = ЛБ_ОбщийМодуль.РасчетПроцентов(ДатаНач, ДатаНач, ПроцентнаяСхемаРезультат, СуммаЗаймаНач, СтруктураОкругления.ОкруглятьЦены); 
		КонецЕсли;	
		СтруктураВозврата = Новый Структура;  
		СтруктураВозврата.Вставить("СуммаЗайма", 0);
		СтруктураВозврата.Вставить("СуммаПроцентов", СуммаПроцентов);
		СтруктураВозврата.Вставить("СуммаПроцентовДень", СуммаПроцентовДень);
		СтруктураВозврата.Вставить("ПредельноеЗначениеПоДоговору", ПредельноеЗначениеПоДоговору);
	Иначе	           
		СуммаПроцентов = ЛБ_ОбщийМодуль.ПолучитьОстатокПроцентов(Объект, Объект.ПредыдущаяОперация);
		Если НЕ ПредельноеЗначениеПроцентов = 0 Тогда 
			МожноНачислитьПроценты = ПредельноеЗначениеПроцентов - НачисленоПроценты; 
		КонецЕсли;	 
		ТаблицаНачисленоЗаПериод = ПолучитьНачисленияПроцентовДетально(Объект, Объект.ПредыдущаяОперация, ДатаНачалаРасчета);
		Для сч = 0 По ТаблицаСтавок.Количество() - 1 Цикл 
			СтрС = ТаблицаСтавок.Получить(сч); 
			ДеньНач = СтрС.ДеньНачалаПрименения;
			Если СтрС.ДеньНачалаПрименения = 1 Тогда
				ДатаНач = ДатаНачалаРасчета;
			Иначе 
				ДатаНач = НачалоДня(ДатаНачалаРасчета-1) + СтрС.ДеньНачалаПрименения*(60 * 60 * 24);
			КонецЕсли;
			Если ДатаНач > НачалоДня(ДатаОкончанияРасчета) Тогда
				Прервать;
			КонецЕсли;	
			
			//СуммаНачисленоЗаПериод = ЛБ_ОбщийМодуль.ПолучитьНачисленияПроцентов(Объект, Объект.ПредыдущаяОперация, ДатаНачалаРасчета);
			
			сч1 = сч + 1;
			Если сч1 >= ТаблицаСтавок.Количество() Тогда
				ДатаКон = ДатаОкончанияРасчета; 
				ДеньКон = (НачалоДня(ДатаКон) - НачалоДня(ДатаНачалаРасчета)) / (60 * 60 * 24) + 1;
			Иначе   
				СтрС1 = ТаблицаСтавок.Получить(сч1);
				ДатаКонца = НачалоДня(ДатаНачалаРасчета-1) + (СтрС1.ДеньНачалаПрименения-1)*(60 * 60 * 24); 
				Если ДатаКонца > НачалоДня(ДатаОкончанияРасчета) Тогда
					ДатаКон = ДатаОкончанияРасчета; 
				    ДеньКон = (НачалоДня(ДатаКон) - НачалоДня(ДатаНачалаРасчета)) / (60 * 60 * 24) + 1;
				Иначе
					ДатаКон = ДатаКонца; 
					ДеньКон = СтрС1.ДеньНачалаПрименения-1;
				КонецЕсли;	
			КонецЕсли;	 
			СтрС = ТаблицаСтавок.Получить(сч); 
			СтавкаП = СтрС.ПроцентнаяСтавка; 
			Если СтрС.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Акционная Тогда
				Если НЕ СтрС.ПроцентнаяСтавкаАкция = 0 Тогда
					СтавкаП = СтрС.ПроцентнаяСтавкаАкция;
				ИначеЕсли НЕ СтрС.ОтклонениеАкцияОтносительное = 0 Тогда	 
					СтавкаП = СтрС.ПроцентнаяСтавка + СтрС.ПроцентнаяСтавка*СтрС.ОтклонениеАкцияОтносительное/100;
				ИначеЕсли НЕ СтрС.ОтклонениеАкцияАбсолютное = 0 Тогда
					СтавкаП = СтрС.ПроцентнаяСтавка + СтрС.ОтклонениеАкцияАбсолютное;
			    КонецЕсли; 
			КонецЕсли;	  
			
			//Проверим начисления
			ДатаКонНачислено = ДатаНач;
			Для каждого СтрН из ТаблицаНачисленоЗаПериод Цикл 
				Если СтрН.ДатаКон < ДатаНач Тогда
					Продолжить;
				КонецЕсли;	
				Если СтрН.ДатаКон > ДатаКон Тогда
					Прервать;
				КонецЕсли;	
				Если СтрН.ДатаКон <= ДатаКон Тогда 
					ДатаКонНачислено = СтрН.ДатаКон;
				КонецЕсли;	
			КонецЦикла; 		
			
			Если НЕ ДатаКонНачислено = ДатаНач Тогда
				Если ДатаКонНачислено = ДатаКон Тогда
					Продолжить;
				КонецЕсли;
				
				ДатаНач = КонецДня(ДатаКонНачислено) + 1;
			КонецЕсли;	
						
			КолДней = ?(НачалоДня(ДатаКон) = НачалоДня(ДатаНач), 0, (НачалоДня(ДатаКон) - НачалоДня(ДатаНач)) / (60 * 60 * 24)) + 1;
			Если СтруктураОкругления.ОкруглятьЦены Тогда
		        СуммаПроцентовНач = ЛБ_ОбщийМодуль.РасчетПроцентов(ДатаНач, ДатаКон, СтавкаП, СуммаЗаймаНач, СтруктураОкругления.ОкруглятьЦены, СтруктураОкругления.ВидОкругленияСуммыПроцентов, СтруктураОкругления.ПорядокОкругления, СтруктураОкругления.ОкруглятьВБольшуюСторону);
          	Иначе
				СуммаПроцентовНач = ЛБ_ОбщийМодуль.РасчетПроцентов(ДатаНач, ДатаКон, СтавкаП, СуммаЗаймаНач, СтруктураОкругления.ОкруглятьЦены); 
			КонецЕсли;	
			
			СуммаПроцентовНачислено = СуммаПроцентовНач; 
			//ДеньНачК = ДеньНач;  
			//ДатаНачК = ДатаНач;  
			//Для каждого СтрН из ТаблицаНачисленоЗаПериод Цикл 
			//	Если СтрН.ДатаКон = ДатаКон Тогда
			//		СуммаПроцентовНачислено = 0; 
			//		СтрН.СуммаПроцентов = 0;
			//		Прервать;
			//	ИначеЕсли СтрН.ДатаКон > ДатаКон Тогда
			//		Прервать;
			//	КонецЕсли;	
			//	Если НЕ СтрН.СуммаПроцентов = 0 Тогда  
			//		Если СуммаПроцентовНачислено >= СтрН.СуммаПроцентов Тогда  
			//			СуммаПроцентовНачислено = СуммаПроцентовНачислено - СтрН.СуммаПроцентов;
			//			СтрН.СуммаПроцентов = 0;
			//		Иначе      
			//			СтрН.СуммаПроцентов = СтрН.СуммаПроцентов - СуммаПроцентовНачислено;
			//			СуммаПроцентовНачислено = 0;
			//		КонецЕсли;	
			//		ДеньНачК = СтрН.ДеньКон+1;  
			//		ДатаНачК = КонецДня(СтрН.ДатаКон) + 1;  
			//	КонецЕсли;
			//КонецЦикла; 			
			//			
			//Если (СуммаПроцентовНачислено = 0) И НЕ (ДатаКон = ДатаОкончанияРасчета) Тогда
			//	Продолжить;
			//КонецЕсли;
			//
			//Если НЕ ДеньНач = ДеньНачК Тогда
			//	ДеньНач = ДеньНачК;  
			//	ДатаНач = ДатаНачК;    
			//	КолДней = ?(НачалоДня(ДатаКон) = НачалоДня(ДатаНач), 0, (НачалоДня(ДатаКон) - НачалоДня(ДатаНач)) / (60 * 60 * 24)) + 1;
			//	Если СтруктураОкругления.ОкруглятьЦены Тогда
			//        СуммаПроцентовНач = ЛБ_ОбщийМодуль.РасчетПроцентов(ДатаНач, ДатаКон, СтавкаП, СуммаЗаймаНач, СтруктураОкругления.ОкруглятьЦены, СтруктураОкругления.ВидОкругленияСуммыПроцентов, СтруктураОкругления.ПорядокОкругления, СтруктураОкругления.ОкруглятьВБольшуюСторону);
			//  	Иначе
			//		СуммаПроцентовНач = ЛБ_ОбщийМодуль.РасчетПроцентов(ДатаНач, ДатаКон, СтавкаП, СуммаЗаймаНач, СтруктураОкругления.ОкруглятьЦены); 
			//	КонецЕсли;
			//	СуммаПроцентовНачислено = СуммаПроцентовНач;
			//КонецЕсли;	
			СуммаПроцентовДень = окр(СуммаПроцентовНач/КолДней, 2);			
			Если НЕ ПредельноеЗначениеПроцентов = 0 Тогда 
				Если СуммаПроцентовНачислено > МожноНачислитьПроценты Тогда 
					РазницаНачислено = СуммаПроцентовНачислено - МожноНачислитьПроценты;
					РазницаДни = РазницаНачислено/СуммаПроцентовДень;  
					СуммаПроцентовНачислено = МожноНачислитьПроценты;
					СуммаПроцентов = СуммаПроцентов + СуммаПроцентовНачислено;
					ПредельноеЗначениеПоДоговору = Истина;  					
					ДеньКон = окр(ДеньКон - РазницаДни, 0);
					ДатаКон = НачалоДня(ДатаКон - РазницаДни*(24*60*60));
				Иначе         
					СуммаПроцентов = СуммаПроцентов + СуммаПроцентовНачислено;
					МожноНачислитьПроценты = МожноНачислитьПроценты - СуммаПроцентовНачислено;
				КонецЕсли;	
			Иначе
				СуммаПроцентов = СуммаПроцентов + СуммаПроцентовНачислено;	
			КонецЕсли;	
			
			СтрП = Объект.НачислениеПроцентовДетально.Добавить();   
			СтрП.ВидПроцентнойСтавки = СтрС.ВидПроцентнойСтавки; 
			СтрП.ДатаНач = ДатаНач;
			СтрП.ДатаКон = ДатаКон;
			СтрП.ДеньНач = СтрС.ДеньНачалаПрименения;  
			СтрП.ДеньКон = ДеньКон; 
			СтрП.ПроцентнаяСтавкаБазовая = СтрС.ПроцентнаяСтавка;
			СтрП.ПроцентнаяСтавкаАкция = СтрС.ПроцентнаяСтавкаАкция;
			СтрП.ОтклонениеАкцияОтносительное = СтрС.ОтклонениеАкцияОтносительное; 
			СтрП.ОтклонениеАкцияАбсолютное = СтрС.ОтклонениеАкцияАбсолютное;
            СтрП.СуммаПроцентов = СуммаПроцентовНачислено;
			СтрП.СуммаПроцентовДень = СуммаПроцентовДень; 
			
			Если ПредельноеЗначениеПоДоговору Тогда
				Прервать;
			КонецЕсли;	
		КонецЦикла;
		
		// ++ Сербаев 20.06.2023 добавил проверку
		Если Не Объект.НачислениеПроцентовДетально.Количество() = 0 Тогда
		    СуммаПроцентовДень = Объект.НачислениеПроцентовДетально.Получить(0).СуммаПроцентовДень;
		КонецЕсли;
        // -- Сербаев 20.06.2023
		
		СтруктураВозврата = Новый Структура; 
		Если СуммаПроцентов < 0 Тогда  
			СтруктураВозврата.Вставить("СуммаЗайма", -СуммаПроцентов);
		    СтруктураВозврата.Вставить("СуммаПроцентов", 0); 
			СтруктураВозврата.Вставить("СуммаПроцентовДень", 0);
		Иначе	       
			Если ПроцентыОплаченыПослеДатыОкончанияРасчетов > СуммаПроцентов Тогда  
				СтруктураВозврата.Вставить("СуммаЗайма", ПроцентыОплаченыПослеДатыОкончанияРасчетов - СуммаПроцентов);
				СтруктураВозврата.Вставить("СуммаПроцентов", 0);
				СтруктураВозврата.Вставить("СуммаПроцентовДень", 0);
			Иначе	
			    СтруктураВозврата.Вставить("СуммаЗайма", 0); 
				СтруктураВозврата.Вставить("СуммаПроцентов", СуммаПроцентов); 
				СтруктураВозврата.Вставить("СуммаПроцентовДень", СуммаПроцентовДень);
			КонецЕсли;	
			 СтруктураВозврата.Вставить("ПредельноеЗначениеПоДоговору", ПредельноеЗначениеПоДоговору);
		КонецЕсли;	
	КонецЕсли;	
		
	Возврат СтруктураВозврата;
КонецФункции    

Функция РассчитатьСуммуПроцентовОстановкаНачислений(Объект, ДатаНачалаРасчета, ДатаОкончанияРасчета, ПредельноеЗначениеПроцентов, ПричинаПримененияПроцентнойСхемы, Установки, СтруктураОкругления) Экспорт 
	ПроцентнаяСхемаРезультат = Объект.ПроцентнаяСхема;
	ТаблицаСтавок = Объект.ПредыдущаяОперация.ПроцентныеСтавкиПоПериодам.Выгрузить();
	УдСтроки = новый СписокЗначений;
	Для каждого стр Из ТаблицаСтавок Цикл 
		Если Стр.ПричинаПрименения =  ПричинаПримененияПроцентнойСхемы Тогда
			Продолжить;
		КонецЕсли;
		УдСтроки.Добавить(Стр);
	Конеццикла;	               
	Для каждого Эл из УдСтроки Цикл 
		ТаблицаСтавок.Удалить(Эл.Значение);
	Конеццикла;	 
	Объект.НачислениеПроцентовДетально.Очистить();
	
	ПредельноеЗначениеПоДоговору = ложь;                                                                                
	Если Установки = неопределено Тогда 
		НеНачислятьПроцентыЗаПоследнийДень = ложь;
		СчитатьПроцентыДеньВыдачиРавенДеньВыкупа = ложь;
	Иначе 
		НеНачислятьПроцентыЗаПоследнийДень = Установки.НеНачислятьПроцентыЗаПоследнийДень;
		СчитатьПроцентыДеньВыдачиРавенДеньВыкупа = Установки.СчитатьПроцентыДеньВыдачиРавенДеньВыкупа;
	КонецЕсли;	
	
	НачисленоПроценты = ЛБ_УправлениеЛомбардом.ПолучитьНачисленныеПроцентыПоДоговору(Объект, Объект.ПредыдущаяОперация);
	
	СтруктураРез = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗалоговогоБилета(Объект, Объект.ПредыдущаяОперация, Истина);
	СуммаЗаймаНач = СтруктураРез.СуммаЗайма;    
	Если СуммаЗаймаНач = 0 Тогда 
		СтруктураВозврата = Новый Структура;
	    СтруктураВозврата.Вставить("СуммаПроцентов", 0);
	    СтруктураВозврата.Вставить("СуммаПроцентовДень", 0);
        СтруктураВозврата.Вставить("ПредельноеЗначениеПоДоговору", ПредельноеЗначениеПоДоговору);

		Возврат СтруктураВозврата;
	КонецЕсли;	
	
	ДатаНач = НачалоДня(ДатаНачалаРасчета);
	ДатаКон = КонецДня(ДатаОкончанияРасчета);    
	//Если НачалоДня(ДатаКон) < НачалоДня(ДатаНач) тогда
		СуммаНачисленоЗаПериод = 0;
	//Иначе	
	//    СуммаНачисленоЗаПериод = ЛБ_ОбщийМодуль.ПолучитьНачисленияПроцентов(Объект, Объект.ПредыдущаяОперация, ДатаНачалаРасчета);
	//КонецЕсли;	
	Если НачалоДня(ДатаКон) < НачалоДня(ДатаНач) тогда 
		СуммаПроцентов = 0;   
		Если СтруктураОкругления.ОкруглятьЦены Тогда
	        СуммаПроцентовДень = ЛБ_ОбщийМодуль.РасчетПроцентов(ДатаНач, ДатаНач, ПроцентнаяСхемаРезультат, СуммаЗаймаНач, СтруктураОкругления.ОкруглятьЦены, СтруктураОкругления.ВидОкругленияСуммыПроцентов, СтруктураОкругления.ПорядокОкругления, СтруктураОкругления.ОкруглятьВБольшуюСторону);
		Иначе
			СуммаПроцентовДень = ЛБ_ОбщийМодуль.РасчетПроцентов(ДатаНач, ДатаНач, ПроцентнаяСхемаРезультат, СуммаЗаймаНач, СтруктураОкругления.ОкруглятьЦены); 
		КонецЕсли;	
		СтруктураВозврата = Новый Структура;  
		СтруктураВозврата.Вставить("СуммаПроцентов", СуммаПроцентов);
		СтруктураВозврата.Вставить("СуммаПроцентовДень", СуммаПроцентовДень);
		СтруктураВозврата.Вставить("ПредельноеЗначениеПоДоговору", ПредельноеЗначениеПоДоговору);
	Иначе	           
		СуммаПроцентов = ЛБ_ОбщийМодуль.ПолучитьОстатокПроцентов(Объект, Объект.ПредыдущаяОперация);
		Если НЕ ПредельноеЗначениеПроцентов = 0 Тогда 
			МожноНачислитьПроценты = ПредельноеЗначениеПроцентов - НачисленоПроценты; 
		КонецЕсли;	 
		ТаблицаНачисленоЗаПериод = ПолучитьНачисленияПроцентовДетально(Объект, Объект.ПредыдущаяОперация, ДатаНачалаРасчета);
		Для сч = 0 По ТаблицаСтавок.Количество() - 1 Цикл 
			СтрС = ТаблицаСтавок.Получить(сч); 
			ДеньНач = СтрС.ДеньНачалаПрименения;
			Если СтрС.ДеньНачалаПрименения = 1 Тогда
				ДатаНач = ДатаНачалаРасчета;
			Иначе 
				ДатаНач = НачалоДня(ДатаНачалаРасчета-1) + СтрС.ДеньНачалаПрименения*(60 * 60 * 24);
			КонецЕсли;	
			Если ДатаНач > НачалоДня(ДатаОкончанияРасчета) Тогда
				Прервать;
			КонецЕсли;	
			
			//СуммаНачисленоЗаПериод = ЛБ_ОбщийМодуль.ПолучитьНачисленияПроцентов(Объект, Объект.ПредыдущаяОперация, ДатаНачалаРасчета);
			
			сч1 = сч + 1;
			Если сч1 >= ТаблицаСтавок.Количество() Тогда
				ДатаКон = ДатаОкончанияРасчета; 
				ДеньКон = (НачалоДня(ДатаКон) - НачалоДня(ДатаНачалаРасчета)) / (60 * 60 * 24) + 1;
			Иначе   
				СтрС1 = ТаблицаСтавок.Получить(сч1);
				ДатаКонца = НачалоДня(ДатаНачалаРасчета-1) + (СтрС1.ДеньНачалаПрименения-1)*(60 * 60 * 24); 
				Если ДатаКонца > НачалоДня(ДатаОкончанияРасчета) Тогда
					ДатаКон = ДатаОкончанияРасчета; 
				    ДеньКон = (НачалоДня(ДатаКон) - НачалоДня(ДатаНачалаРасчета)) / (60 * 60 * 24) + 1;
				Иначе
					ДатаКон = ДатаКонца; 
					ДеньКон = СтрС1.ДеньНачалаПрименения-1;
				КонецЕсли;	
			КонецЕсли;	 
			СтрС = ТаблицаСтавок.Получить(сч); 
			СтавкаП = СтрС.ПроцентнаяСтавка; 
			Если СтрС.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Акционная Тогда
				Если НЕ СтрС.ПроцентнаяСтавкаАкция = 0 Тогда
					СтавкаП = СтрС.ПроцентнаяСтавкаАкция;
				ИначеЕсли НЕ СтрС.ОтклонениеАкцияОтносительное = 0 Тогда	 
					СтавкаП = СтрС.ПроцентнаяСтавка + СтрС.ПроцентнаяСтавка*СтрС.ОтклонениеАкцияОтносительное/100;
				ИначеЕсли НЕ СтрС.ОтклонениеАкцияАбсолютное = 0 Тогда
					СтавкаП = СтрС.ПроцентнаяСтавка + СтрС.ОтклонениеАкцияАбсолютное;
			    КонецЕсли; 
			КонецЕсли;	
			
			//Проверим начисления
			ДатаКонНачислено = ДатаНач;
			Для каждого СтрН из ТаблицаНачисленоЗаПериод Цикл 
				Если СтрН.ДатаКон < ДатаНач Тогда
					Продолжить;
				КонецЕсли;	
				Если СтрН.ДатаКон > ДатаКон Тогда
					Прервать;
				КонецЕсли;	
				Если СтрН.ДатаКон <= ДатаКон Тогда 
					ДатаКонНачислено = СтрН.ДатаКон;
				КонецЕсли;	
			КонецЦикла; 		
			
			Если НЕ ДатаКонНачислено = ДатаНач Тогда
				Если ДатаКонНачислено = ДатаКон Тогда
					Продолжить;
				КонецЕсли;
				
				ДатаНач = КонецДня(ДатаКонНачислено) + 1;
			КонецЕсли;	
						
			КолДней = ?(НачалоДня(ДатаКон) = НачалоДня(ДатаНач), 0, (НачалоДня(ДатаКон) - НачалоДня(ДатаНач)) / (60 * 60 * 24)) + 1;
			Если СтруктураОкругления.ОкруглятьЦены Тогда
		        СуммаПроцентовНач = ЛБ_ОбщийМодуль.РасчетПроцентов(ДатаНач, ДатаКон, СтавкаП, СуммаЗаймаНач, СтруктураОкругления.ОкруглятьЦены, СтруктураОкругления.ВидОкругленияСуммыПроцентов, СтруктураОкругления.ПорядокОкругления, СтруктураОкругления.ОкруглятьВБольшуюСторону);
          	Иначе
				СуммаПроцентовНач = ЛБ_ОбщийМодуль.РасчетПроцентов(ДатаНач, ДатаКон, СтавкаП, СуммаЗаймаНач, СтруктураОкругления.ОкруглятьЦены); 
			КонецЕсли;	
			
			СуммаПроцентовНачислено = СуммаПроцентовНач; 
			//ДеньНачК = ДеньНач;  
			//ДатаНачК = ДатаНач;  
			//Для каждого СтрН из ТаблицаНачисленоЗаПериод Цикл 
			//	Если СтрН.ДатаКон = ДатаКон Тогда
			//		СуммаПроцентовНачислено = 0; 
			//		СтрН.СуммаПроцентов = 0;
			//		Прервать;
			//	ИначеЕсли СтрН.ДатаКон > ДатаКон Тогда
			//		Прервать;
			//	КонецЕсли;	
			//	Если НЕ СтрН.СуммаПроцентов = 0 Тогда  
			//		Если СуммаПроцентовНачислено >= СтрН.СуммаПроцентов Тогда  
			//			СуммаПроцентовНачислено = СуммаПроцентовНачислено - СтрН.СуммаПроцентов;
			//			СтрН.СуммаПроцентов = 0;
			//		Иначе      
			//			СтрН.СуммаПроцентов = СтрН.СуммаПроцентов - СуммаПроцентовНачислено;
			//			СуммаПроцентовНачислено = 0;
			//		КонецЕсли;
			//		ДеньНачК = СтрН.ДеньКон+1;  
			//		ДатаНачК = КонецДня(СтрН.ДатаКон) + 1;  
			//	КонецЕсли;
			//КонецЦикла; 			
			//			
			//Если (СуммаПроцентовНачислено = 0) И НЕ (ДатаКон = ДатаОкончанияРасчета) Тогда
			//	Продолжить;
			//КонецЕсли;
			//
			//Если НЕ ДеньНач = ДеньНачК Тогда
			//	ДеньНач = ДеньНачК;  
			//	ДатаНач = ДатаНачК;    
			//	КолДней = ?(НачалоДня(ДатаКон) = НачалоДня(ДатаНач), 0, (НачалоДня(ДатаКон) - НачалоДня(ДатаНач)) / (60 * 60 * 24)) + 1;
			//	Если СтруктураОкругления.ОкруглятьЦены Тогда
			//        СуммаПроцентовНач = ЛБ_ОбщийМодуль.РасчетПроцентов(ДатаНач, ДатаКон, СтавкаП, СуммаЗаймаНач, СтруктураОкругления.ОкруглятьЦены, СтруктураОкругления.ВидОкругленияСуммыПроцентов, СтруктураОкругления.ПорядокОкругления, СтруктураОкругления.ОкруглятьВБольшуюСторону);
			//  	Иначе
			//		СуммаПроцентовНач = ЛБ_ОбщийМодуль.РасчетПроцентов(ДатаНач, ДатаКон, СтавкаП, СуммаЗаймаНач, СтруктураОкругления.ОкруглятьЦены); 
			//	КонецЕсли;
			//	СуммаПроцентовНачислено = СуммаПроцентовНач;
			//КонецЕсли;	
			СуммаПроцентовДень = окр(СуммаПроцентовНач/КолДней, 2);			
			Если НЕ ПредельноеЗначениеПроцентов = 0 Тогда 
				Если СуммаПроцентовНачислено > МожноНачислитьПроценты Тогда 
					РазницаНачислено = СуммаПроцентовНачислено - МожноНачислитьПроценты;
					РазницаДни = РазницаНачислено/СуммаПроцентовДень;  
					СуммаПроцентовНачислено = МожноНачислитьПроценты;
					СуммаПроцентов = СуммаПроцентов + СуммаПроцентовНачислено;
					ПредельноеЗначениеПоДоговору = Истина;  					
					ДеньКон = окр(ДеньКон - РазницаДни, 0);
					ДатаКон = НачалоДня(ДатаКон - РазницаДни*(24*60*60));
				Иначе         
					СуммаПроцентов = СуммаПроцентов + СуммаПроцентовНачислено;
					МожноНачислитьПроценты = МожноНачислитьПроценты - СуммаПроцентовНачислено;
				КонецЕсли;	
			Иначе
				СуммаПроцентов = СуммаПроцентов + СуммаПроцентовНачислено;		
			КонецЕсли;	
			
			СтрП = Объект.НачислениеПроцентовДетально.Добавить();   
			СтрП.ВидПроцентнойСтавки = СтрС.ВидПроцентнойСтавки; 
			СтрП.ДатаНач = ДатаНач;
			СтрП.ДатаКон = ДатаКон;
			СтрП.ДеньНач = СтрС.ДеньНачалаПрименения;  
			СтрП.ДеньКон = ДеньКон; 
			СтрП.ПроцентнаяСтавкаБазовая = СтрС.ПроцентнаяСтавка;
			СтрП.ПроцентнаяСтавкаАкция = СтрС.ПроцентнаяСтавкаАкция;
			СтрП.ОтклонениеАкцияОтносительное = СтрС.ОтклонениеАкцияОтносительное; 
			СтрП.ОтклонениеАкцияАбсолютное = СтрС.ОтклонениеАкцияАбсолютное;
            СтрП.СуммаПроцентов = СуммаПроцентовНачислено;
			СтрП.СуммаПроцентовДень = СуммаПроцентовДень; 
			
			Если ПредельноеЗначениеПоДоговору Тогда
				Прервать;
			КонецЕсли;	
		КонецЦикла;
		
		// ++ Сербаев 20.06.2023 добавил проверку
		Если Не Объект.НачислениеПроцентовДетально.Количество() = 0 Тогда
		    СуммаПроцентовДень = Объект.НачислениеПроцентовДетально.Получить(0).СуммаПроцентовДень;
		КонецЕсли;
        // -- Сербаев 20.06.2023
		
		СтруктураВозврата = Новый Структура; 
		СтруктураВозврата.Вставить("СуммаПроцентов", СуммаПроцентов); 
		СтруктураВозврата.Вставить("СуммаПроцентовДень", СуммаПроцентовДень);
		СтруктураВозврата.Вставить("ПредельноеЗначениеПоДоговору", ПредельноеЗначениеПоДоговору);
	КонецЕсли;	
		
	Возврат СтруктураВозврата;
КонецФункции    

#Область ДополнительныеНастройки

// Возвращает значение доп. настройки по ИД
Функция ПолучитьЗначениеДопНастройки(ИДДопНастройки, ОжидаемыйТип = "") Экспорт
	
	ПолноеИмяДопНастройки = "ДопНастройки_" + ВРег(ИДДопНастройки);
	
	#Если ВнешнееСоединение Тогда
		ЗначениеНастройки = Неопределено;
	#Иначе
		ЗначениеНастройки = Неопределено;

		//ЗначениеНастройки = глЗначениеПеременной(ПолноеИмяДопНастройки);
	#КонецЕсли
	
	Если ЗначениеНастройки = Неопределено Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ИспользоватьХранилище,
		|	ХранилищеЗначения,
		|	ЗначениеНастройки,
		|	Кэшировать
		|ИЗ
		|	Справочник.ЛБ_ДополнительныеНастройки КАК ДополнительныеНастройки
		|ГДЕ
		|	ИД = &ИД
		|	И НЕ ПометкаУдаления
		|	И НЕ ЭтоГруппа");
		
		Запрос.УстановитьПараметр("ИД", ИДДопНастройки);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			Если Выборка.ИспользоватьХранилище Тогда
				
				СтруктураХранилища = Выборка.ХранилищеЗначения.Получить();
				
				Если ТипЗнч(СтруктураХранилища) = Тип("Структура") Тогда
					ЗначениеНастройки = СтруктураХранилища.Значение;	// Без попытки, считаем, что если в хранилище значения структура,
																		// то поле Значение всегда существует.
				КонецЕсли;
																	
			Иначе
				ЗначениеНастройки = Выборка.ЗначениеНастройки;
			КонецЕсли;
			
			//#Если НЕ ВнешнееСоединение Тогда
			//	Если Выборка.Кэшировать Тогда
			//		глЗначениеПеременнойУстановить(ПолноеИмяДопНастройки, ЗначениеНастройки);
			//	КонецЕсли;
			//#КонецЕсли
		
		КонецЕсли;	
		
	КонецЕсли;
	
	// Если тип значения не соответствует ожидаемому, то возвращается пустое значение ожидаемого типа.
	Если НЕ ПустаяСтрока(ОжидаемыйТип) Тогда
		ДоступныеТипы = Справочники.ЛБ_ДополнительныеНастройки.ПолучитьСоответствиеДоступныхТиповХранилища();
		Если (ДоступныеТипы[ОжидаемыйТип] <> Неопределено) 
				И (ТипЗнч(ЗначениеНастройки) <> Тип(ОжидаемыйТип)) Тогда
			ЗначениеНастройки = Новый(ОжидаемыйТип);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗначениеНастройки; 
	
КонецФункции 


Функция СоздатьДопНастройку(ИД, Наименование, Значение) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ДополнительныеНастройки.Ссылка
	                |ИЗ
	                |	Справочник.ЛБ_ДополнительныеНастройки КАК ДополнительныеНастройки
	                |ГДЕ
	                |	ДополнительныеНастройки.ИД = &ИД";
	
	Запрос.УстановитьПараметр("ИД", ИД);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НовЭл = Выборка.ссылка.ПолучитьОбъект();
	Иначе
		НовЭл = Справочники.ЛБ_ДополнительныеНастройки.СоздатьЭлемент();
	КонецЕсли;
	
	ИспользоватьХранилище = Ложь;
	ТипОбъекта = ТипЗнч(Значение);

	Если ТипОбъекта = Тип("Массив") или ТипОбъекта = Тип("Соответствие") или ТипОбъекта = Тип("ТаблицаЗначений") Тогда
		ИспользоватьХранилище = Истина;
	КонецЕсли;
		
	
	НовЭл.ИД                = ИД;
	НовЭл.Наименование      = Наименование;
	НовЭл.ЗначениеНастройки = Значение; 	             
	НовЭл.ИспользоватьХранилище = ИспользоватьХранилище;
	
	Если ИспользоватьХранилище Тогда
		
		Если ТипОбъекта = Тип("Массив") Тогда
			
			СтруктураХранилища = Новый Структура("Тип, Значение", "Массив", Значение);
			
		ИначеЕсли ТипОбъекта = Тип("Соответствие") Тогда
			
			ТекСоответствие = Новый Соответствие;
			Для Каждого ТекСтрока Из Значение Цикл
				ТекСоответствие.Вставить(ТекСтрока.Ключ, ТекСтрока.Значение);
			КонецЦикла;
			СтруктураХранилища = Новый Структура("Тип, Значение",
			"Соответствие",
			ТекСоответствие);
			
		ИначеЕсли ТипОбъекта = Тип("ТаблицаЗначений") Тогда
			
			СтруктураХранилища = Новый Структура("Тип, Значение",
			"ТаблицаЗначений",
			Значение.Скопировать());
			
		Иначе		
			СтруктураХранилища = Неопределено;
			
		КонецЕсли;
		
		НовЭл.ХранилищеЗначения = Новый ХранилищеЗначения(СтруктураХранилища);
		
	Иначе		
		НовЭл.ХранилищеЗначения = Новый ХранилищеЗначения(Неопределено);		
	КонецЕсли;
		
	НовЭл.Записать();
	
	Возврат НовЭл.Ссылка;		
КонецФункции


#КонецОбласти 

// ++ Сербаев 16.05.2023
Функция ПроверитьНаРезиденство(Залогодатель, Период) Экспорт

	Резиденство = Ложь; 
	Гражданство = неопределено;
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство
		|ИЗ
		|	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Период, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Гражданство = Выборка.Гражданство;  
	КонецЕсли;
	
	Если Гражданство = Справочники.СтраныМира.Россия Тогда
		 Резиденство = Истина;
	Иначе	 
		Если НЕ Гражданство = неопределено Тогда
			Запрос.УстановитьПараметр("Гражданство", Гражданство);
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ИСТИНА КАК Резиденство
				|ИЗ
				|	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&Период, ДокументЗалогодателя.Владелец = &Залогодатель) КАК ЛБ_ДокументыЗалогодателейСрезПоследних
				|ГДЕ
				|	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство = &Гражданство
				|	И ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ВидНаЖительство)
				|	И ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия > НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
				|	И НЕ ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНеДействителен
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	ИСТИНА
				|ИЗ
				|	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&Период, ДокументЗалогодателя.Владелец = &Залогодатель) КАК ЛБ_ДокументыЗалогодателейСрезПоследних
				|ГДЕ
				|	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство = &Гражданство
				|	И ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ВидНаЖительство)
				|	И ЕСТЬNULL(ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
				|	И НЕ ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНеДействителен";			
			
			РезультатЗапроса = Запрос.Выполнить();
			Если Не РезультатЗапроса.Пустой() Тогда
				
				Выборка = РезультатЗапроса.Выбрать();
				Пока Выборка.Следующий() Цикл
					Резиденство = Истина;
				КонецЦикла;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	Возврат Резиденство;
	
КонецФункции 

Функция ПроверитьДействительностьВидаНаЖительство(Стр, ДатаРождения, ДатаПроверки = неопределено) Экспорт
	Если ДатаПроверки = неопределено Тогда
		ДатаПроверки = ТекущаяДата();
	КонецЕсли;	
		
	//Залогодатель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.ДокументСсылка, "Владелец");
	//Если ИзмененыПерсональныеДанныеКлиента(Залогодатель, Стр.ДокументНачалоДействия) Тогда
	//    ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'В связи с изменениями персональных данных клиента, документ ""Вид на жительство"" является недействительным!'"));
	//	Возврат Ложь;
	//КонецЕсли;
	
	СрокОкончания = Стр.ДокументСрокДействия;
	ДатаВыдачи    = Стр.ДокументДатаВыдачи;
	ТекДата       = НачалоДня(ДатаПроверки);
	
	Если СрокОкончания = Дата(1, 1, 1) Тогда 
		
		Возраст = ВычислитьВозраст(ДатаРождения);
		
		ДатаРождения14 = ДобавитьМесяц(ДатаРождения, 12 * 14); 
		Если Возраст <= 14 Тогда	    
			Если ДатаВыдачи > ДатаРождения14 Тогда
				Возврат Истина;
			ИначеЕсли ДатаРождения14 > ТекДата Тогда
				Возврат Истина;
			Иначе		  
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'В связи с достижением клиента 14 лет, документ ""Вид на жительство"" является недействительным! Дальнейшие операции с клиентом в системе блокированы!'"));
				Возврат Ложь;
			КонецЕсли;
		Иначе
			Если ДатаВыдачи < ДатаРождения14 Тогда
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'В связи с достижением клиента 14 лет, документ ""Вид на жительство"" является недействительным! Дальнейшие операции с клиентом в системе блокированы!'"));
				Возврат Ложь;
			КонецЕсли; 
			
			ДатаРождения20 = ДобавитьМесяц(ДатаРождения, 12 * 20);
			Если Возраст <= 20 Тогда	    
				Если ДатаВыдачи > ДатаРождения20 Тогда
					Возврат Истина;
				ИначеЕсли ДатаРождения20 > ТекДата Тогда
					Возврат Истина;
				Иначе		  
					ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'В связи с достижением клиента 20 лет, документ ""Вид на жительство"" является недействительным! Дальнейшие операции с клиентом в системе блокированы!'"));
					Возврат Ложь;
				КонецЕсли;
			Иначе
				Если ДатаВыдачи < ДатаРождения20 Тогда
					ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'В связи с достижением клиента 20 лет, документ ""Вид на жительство"" является недействительным! Дальнейшие операции с клиентом в системе блокированы!'"));
					Возврат Ложь;
				КонецЕсли;
				
				ДатаРождения45 = ДобавитьМесяц(ДатаРождения, 12 * 45);
				Если ДатаВыдачи > ДатаРождения45 Тогда
					Возврат Истина;
				ИначеЕсли ДатаРождения45 > ТекДата Тогда
					Возврат Истина;
				Иначе		  
					ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'В связи с достижением клиента 45 лет, документ ""Вид на жительство"" является недействительным! Дальнейшие операции с клиентом в системе блокированы!'"));
					Возврат Ложь;
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		Если СрокОкончания >= ТекДата Тогда
			РазницаВДнях = (СрокОкончания - ТекДата) / (60 * 60 * 24); 
			Если РазницаВДнях <= 30  Тогда
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Необходимо напомнить клиенту о скором окончании срока действия вида на жительство!'"));
			КонецЕсли;	
			Возврат Истина;
		Иначе	
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Срок действия вида на жительство истек! Дальнейшие операции с клиентом в системе не возможны!'"));
			Возврат Ложь;
		КонецЕсли;	
		
	КонецЕсли;
	
КонецФункции

Функция ПроверитьЕстьДатаСмерти(Клиент, Дата) Экспорт 
	
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Клиент", Клиент); 
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДатаСмерти КАК ДатаСмерти
	//               |ИЗ
	//               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(
	//               |			&Дата,
	//               |			ДокументЗалогодателя.Владелец = &Клиент
	//               |				И ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.СвидетельствоОСмерти)) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//	Возврат Выборка.ДатаСмерти;
	//КонецЕсли;
	//Возврат неопределено;    
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаСмерти КАК ДатаСмерти
	               |ИЗ
	               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Клиент) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат ?(ЗначениеЗаполнено(Выборка.ДатаСмерти), Выборка.ДатаСмерти, неопределено);
	КонецЕсли;
	Возврат неопределено;
КонецФункции

Функция ИзмененыПерсональныеДанныеКлиента(Залогодатель, ДокументНачалоДействия) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Период КАК Период,
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Залогодатель КАК Залогодатель,
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество,
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Пол КАК Пол,
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРождения КАК МестоРождения
		|ПОМЕСТИТЬ КонтактнаяИнформацияНаДатуДокВидНаЖительство
		|ИЗ
		|	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Период, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИСТИНА КАК ЕстьИзменения
		|ИЗ
		|	КонтактнаяИнформацияНаДатуДокВидНаЖительство КАК КонтактнаяИнформацияНаДатуДокВидНаЖительство
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей КАК ЛБ_КонтактнаяИнформацияЗалогодателей
		|		ПО КонтактнаяИнформацияНаДатуДокВидНаЖительство.Залогодатель = ЛБ_КонтактнаяИнформацияЗалогодателей.Залогодатель
		|ГДЕ
		|	ЛБ_КонтактнаяИнформацияЗалогодателей.Период > КонтактнаяИнформацияНаДатуДокВидНаЖительство.Период
		|	И (КонтактнаяИнформацияНаДатуДокВидНаЖительство.Залогодатель <> ЛБ_КонтактнаяИнформацияЗалогодателей.Залогодатель
		|			ИЛИ КонтактнаяИнформацияНаДатуДокВидНаЖительство.Фамилия <> ЛБ_КонтактнаяИнформацияЗалогодателей.Фамилия
		|			ИЛИ КонтактнаяИнформацияНаДатуДокВидНаЖительство.Имя <> ЛБ_КонтактнаяИнформацияЗалогодателей.Имя
		|			ИЛИ КонтактнаяИнформацияНаДатуДокВидНаЖительство.Отчество <> ЛБ_КонтактнаяИнформацияЗалогодателей.Отчество
		|			ИЛИ КонтактнаяИнформацияНаДатуДокВидНаЖительство.ДатаРождения <> ЛБ_КонтактнаяИнформацияЗалогодателей.ДатаРождения
		|			ИЛИ КонтактнаяИнформацияНаДатуДокВидНаЖительство.Гражданство <> ЛБ_КонтактнаяИнформацияЗалогодателей.Гражданство
		|			ИЛИ КонтактнаяИнформацияНаДатуДокВидНаЖительство.Пол <> ЛБ_КонтактнаяИнформацияЗалогодателей.Пол
		|			ИЛИ КонтактнаяИнформацияНаДатуДокВидНаЖительство.МестоРождения <> ЛБ_КонтактнаяИнформацияЗалогодателей.МестоРождения)";
	
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.УстановитьПараметр("Период", ДокументНачалоДействия);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
	    Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ЭтоТестоваяБаза()Экспорт  
	
    Результат = Ложь;    
	Если ЗначениеЗаполнено(ПланыВидовХарактеристик.ЛБ_НастройкиЛомбард.ЭтоТестоваяБаза.Значение) Тогда
	    Если ПланыВидовХарактеристик.ЛБ_НастройкиЛомбард.ЭтоТестоваяБаза.Значение Тогда
		    Результат = Истина;
	    КонецЕсли;
	КонецЕсли;
	Возврат Результат;

КонецФункции
// -- Сербаев 16.05.2023


Функция ПроверитьСменаВидНаЖительствоВозраст(ДатаРождения, ДатаВыдачиДокумента) Экспорт 
	ТекстСообщения = "";
	Возраст = ЛБ_ОбщийМодуль.ВычислитьВозраст(ДатаРождения);  
	Если Возраст >= 20 и Возраст < 45 Тогда 
	    ДатаРождения20 = ДобавитьМесяц(ДатаРождения, 12 * 20);
		Если ДатаВыдачиДокумента < ДатаРождения20 Тогда 
			ТекстСообщения = "Клиенту больше 20 лет, а бессрочный вид на жительство оформлен до достижения им этого возраста. Необходима смена вида на жительство.";
		КонецЕсли;	
	ИначеЕсли Возраст >= 45 Тогда 
		ДатаРождения45 = ДобавитьМесяц(ДатаРождения, 12 * 45);
		Если ДатаВыдачиДокумента < ДатаРождения45 Тогда 
			ТекстСообщения = "Клиенту больше 45 лет, а бессрочный вид на жительство оформлен до достижения им этого возраста. Необходима смена вида на жительство.";
		КонецЕсли;
	КонецЕсли;	  
	Возврат ТекстСообщения;
КонецФункции

Функция ПроверитьСменаВидНаЖительствоКонтактнаяИнформация(Клиент, ДатаВыдачиДокумента, ДатаОперации) Экспорт 
	ТекстСообщения = "";
	
	Запрос = новый Запрос; 
	Запрос.УстановитьПараметр("Клиент" , Клиент); 
	Запрос.УстановитьПараметр("Дата" , ДатаОперации);  	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Период КАК Период
	               |ИЗ
	               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(
	               |			&Дата,
	               |			Залогодатель = &Клиент
	               |				И ПричинаИзмененияФИО = Значение(Справочник.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.ИзменениеФИО)) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		Если НачалоДня(Выборка.Период) > ДатаВыдачиДокумента тогда
			ТекстСообщения = "Клиент сменил ФИО " + Формат(Выборка.Период, "ДФ=dd.MM.yyyy") + ", а бессрочный вид на жительство оформлен " + Формат(ДатаВыдачиДокумента, "ДФ=dd.MM.yyyy") + ". Необходима смена вида на жительство.";
		КонецЕсли;	
	КонецЕсли;  
	Возврат ТекстСообщения;
КонецФункции	
	
Функция ПроверитьЕстьТолькоСпецСимволы(Строка) Экспорт
	СтрокаСпецСимволов = "№#;:()~""<>?,./!@%^&*-_+='[]{}|\";  
	
	СтрокаДляПроверки = СокрЛП(Строка);
	СтрокаДляПроверки = СтрЗаменить(СтрокаДляПроверки, " ", "");

	ТолькоСпецСимволы = Истина;   
	Для сч = 1 по СтрДлина(СокрЛП(СтрокаДляПроверки)) Цикл 
		Симв = Сред(СокрЛП(СтрокаДляПроверки), сч, 1);
		Поз = Найти(СтрокаСпецСимволов, Симв);
		Если Не Поз = 0 Тогда
			Продолжить;
		КонецЕсли;
		ТолькоСпецСимволы = Ложь;
		Прервать;
	Конеццикла;	 
	Возврат ТолькоСпецСимволы;
КонецФункции	

Функция ПолучитьМинимальнуюСуммуЗайма(Дата) Экспорт    
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_МинимальнаяСуммаЗаймаСрезПоследних.Сумма КАК Сумма
	               |ИЗ
	               |	РегистрСведений.ЛБ_МинимальнаяСуммаЗайма.СрезПоследних(&Дата, ) КАК ЛБ_МинимальнаяСуммаЗаймаСрезПоследних";  
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		Возврат Выборка.Сумма;
	КонецЕсли;	              
	Возврат 0;
КонецФункции	

Функция ПолучитьСлужебныеСтатусыКлиента(Дата, Клиент) Экспорт
	СписокСлужебныхСтатусов = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Клиент", Клиент); 
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СтатусыЗалогодателейСлужебныеСрезПоследних.Статус КАК Статус,
	               |	ЛБ_СтатусыЗалогодателейСлужебныеСрезПоследних.Используется КАК Используется
	               |ИЗ
	               |	РегистрСведений.ЛБ_СтатусыЗалогодателейСлужебные.СрезПоследних(&Дата, Залогодатель = &Клиент) КАК ЛБ_СтатусыЗалогодателейСлужебныеСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Если Выборка.Используется Тогда 
			СписокСлужебныхСтатусов.Добавить(Выборка.Статус);
		КонецЕсли;	
	КонецЦикла;	
	Возврат СписокСлужебныхСтатусов;
КонецФункции	


Функция ПроверитьСлужебныйСтатус(Статус, ВидОперации) Экспорт  
	СтруктураРез = Новый Структура;
	СтруктураРез.Вставить("Запрет", ложь); 
	СтруктураРез.Вставить("Предупредить", "");
	ОтборС = Новый Структура("ВидОперации", ВидОперации);
	СтрокиС = Статус.ЗапретНаОперации.НайтиСтроки(ОтборС);
	Если НЕ СтрокиС.Количество() = 0 Тогда 
	    СтруктураРез.Запрет = Истина; 
	КонецЕсли;	  
	Если НЕ СтруктураРез.Запрет И Статус.Предупредить Тогда
		Информация = Статус.ДопИнформация.Получить(); 
		СтруктураРез.Предупредить = Информация.ПолучитьТекст();
	КонецЕсли;
		
	Возврат СтруктураРез;
КонецФункции

Функция ПроверитьЕстьРегламентноеНачислениеПроцентов(ДокументОбъект) Экспорт 
	СписокЛ = Новый СписокЗначений;  
	Для каждого Стр Из ДокументОбъект.Ломбарды Цикл
		СписокЛ.Добавить(Стр.Ломбард);
	Конеццикла;	

	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Дата", ДокументОбъект.Дата);   
	Запрос.УстановитьПараметр("Организация", ДокументОбъект.Организация); 
	Запрос.УстановитьПараметр("Ломбарды", СписокЛ);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РасчетыСКлиентамиБУ.Период КАК Период,
	               |	ЛБ_РасчетыСКлиентамиБУ.Регистратор КАК Регистратор,
	               |	ЛБ_РасчетыСКлиентамиБУ.Ломбард КАК Ломбард,
	               |	ЛБ_РасчетыСКлиентамиБУ.ЗалоговыйБилет.НомерЗалоговогоБилета КАК НомерЗБ
	               |ИЗ
	               |	РегистрНакопления.ЛБ_РасчетыСКлиентамиБУ КАК ЛБ_РасчетыСКлиентамиБУ
	               |ГДЕ
	               |	ЛБ_РасчетыСКлиентамиБУ.Период >= &Дата
	               |	И ЛБ_РасчетыСКлиентамиБУ.ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыРасчетов.ПоПроцентам)
	               |	И ЛБ_РасчетыСКлиентамиБУ.Организация = &Организация";
	Если НЕ СписокЛ.Количество() = 0 Тогда
		Запрос.Текст = Запрос.Текст + "
		  |	И ЛБ_РасчетыСКлиентамиБУ.Ломбард В(&Ломбарды)";  
	КонецЕсли;	
	Запрос.Текст = Запрос.Текст + "
	              |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_РасчетыСКлиентамиБУ.Период";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл  
		Если ЗначениеЗаполнено(ДокументОбъект.Ссылка) И (Выборка.Регистратор = ДокументОбъект.Ссылка) Тогда 
			Продолжить;
		КонецЕсли;	
		Возврат "Найден документ " + Строка(Выборка.Регистратор) + ": (" + СокрЛП(Выборка.Ломбард) + ",  ЗБ № " + СокрЛП(Выборка.НомерЗБ) + ") с движениями по регламентному начислению процентов и с датой больше даты текущего документа.";
	КонецЦикла;
	Возврат "";     
	
КонецФункции	

//+Мельников 25.04.24 Отмена операции
Функция ПолучитьСостояниеЗБ(НомерЗалоговогоБилета, Дата, Поиск = Ложь, ОтменаОперации = Ложь) Экспорт

	Если Поиск ИЛИ ОтменаОперации Тогда
		СписокСтатусовЗБ = Новый СписокЗначений;
		СписокСтатусовЗБ.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Оформлен);
		СписокСтатусовЗБ.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Продлен);   
		СписокСтатусовЗБ.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтвественноеХранение);
		СписокСтатусовЗБ.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят);
		СписокСтатусовЗБ.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен);
		СписокСтатусовЗБ.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Остановлен);
		СписокСтатусовЗБ.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт);
		
		СписокВидовОперации = Новый СписокЗначений;
		СписокВидовОперации.Добавить(Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаОплаты);
		СписокВидовОперации.Добавить(Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаВыдачиСОХ);
		СписокВидовОперации.Добавить(Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаИзъятия);
		СписокВидовОперации.Добавить(Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаВозвратаИзъятого);
		СписокВидовОперации.Добавить(Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаОстановкиНачисленияПроцентов);
		СписокВидовОперации.Добавить(Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаПереоформления);
		СписокВидовОперации.Добавить(Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаЗалога);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛБ_СостояниеЗалоговогоБилета.Период КАК Период,
		|	ЛБ_СостояниеЗалоговогоБилета.Регистратор КАК Регистратор,
		|	ЛБ_СостояниеЗалоговогоБилета.Залогодатель КАК Залогодатель,
		|	ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет КАК ЗалоговыйБилет,
		|	ЛБ_СостояниеЗалоговогоБилета.НомерЗалоговогоБилета КАК НомерЗалоговогоБилета,
		|	ЛБ_СостояниеЗалоговогоБилета.СхемаКредитования КАК СхемаКредитования,
		|	ЛБ_СостояниеЗалоговогоБилета.ПричинаПрименения КАК ПричинаПрименения,
		|	ЛБ_СостояниеЗалоговогоБилета.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета,
		|	ЛБ_СостояниеЗалоговогоБилета.СуммаЗайма КАК СуммаЗайма,
		|	ЛБ_СостояниеЗалоговогоБилета.ДатаНачалаРасчетаПроцентов КАК ДатаНачалаРасчетаПроцентов,
		|	ЛБ_СостояниеЗалоговогоБилета.НомерДопСоглашения КАК НомерДопСоглашения,
		|	ЛБ_СостояниеЗалоговогоБилета.ДатаВыкупа КАК ДатаВыкупа,
		|	ЛБ_СостояниеЗалоговогоБилета.ДатаВыкупаЛьготныйСрок КАК ДатаВыкупаЛьготныйСрок,
		|	ЛБ_СостояниеЗалоговогоБилета.СуммаПроцентовДень КАК СуммаПроцентовДень,
		|	ЛБ_СостояниеЗалоговогоБилета.СуммаПроцентовСрок КАК СуммаПроцентовСрок,
		|	ЛБ_СостояниеЗалоговогоБилета.ПредельныйСрокЗайма КАК ПредельныйСрокЗайма,
		|	ЛБ_СостояниеЗалоговогоБилета.ПредельныйСрокЗаймаДни КАК ПредельныйСрокЗаймаДни,
		|	ЛБ_СостояниеЗалоговогоБилета.ДатаОстановкиНачислений КАК ДатаОстановкиНачислений
		|ИЗ
		|	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета КАК ЛБ_СостояниеЗалоговогоБилета
		|ГДЕ
		|	ЛБ_СостояниеЗалоговогоБилета.НомерЗалоговогоБилета ПОДОБНО &НомерЗалоговогоБилета
		|	И ЛБ_СостояниеЗалоговогоБилета.Период <= &Период"
		+ ?(Поиск, Символы.ПС    
		//+МАН 17.06.25 Изменил на поиск в регистре
		//+ "	И ЛБ_СостояниеЗалоговогоБилета.Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		+ "	И НЕ ЛБ_СостояниеЗалоговогоБилета.Регистратор В (ВЫБРАТЬ
		|			ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
		|		ИЗ
		|			РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&Период, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
		|		ГДЕ
		|			ЛБ_ОтменыОперацийЗБСрезПоследних.НомерЗалоговогоБилета ПОДОБНО &НомерЗалоговогоБилета)
		//-МАН
		|	И НЕ ЛБ_СостояниеЗалоговогоБилета.Регистратор.ВидОперации В (&СписокВидовОперации)
		|	И ЛБ_СостояниеЗалоговогоБилета.СтатусЗалоговогоБилета В(&СписокСтатусовЗБ)"
		+ Символы.ПС, "")
		+ ?(ОтменаОперации, Символы.ПС  
		//+МАН 17.06.25 Изменил на поиск в регистре
		//+ "	И ЛБ_СостояниеЗалоговогоБилета.Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		+ "	И НЕ ЛБ_СостояниеЗалоговогоБилета.Регистратор В (ВЫБРАТЬ
		|			ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
		|		ИЗ
		|			РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&Период, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
		|		ГДЕ
		|			ЛБ_ОтменыОперацийЗБСрезПоследних.НомерЗалоговогоБилета ПОДОБНО &НомерЗалоговогоБилета)
		//-МАН
		|	И НЕ ЛБ_СостояниеЗалоговогоБилета.Регистратор.ВидОперации В (&СписокВидовОперации)"
		+ Символы.ПС, "")
		+ "
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ"; 
		
	Запрос.УстановитьПараметр("НомерЗалоговогоБилета", "%" + НомерЗалоговогоБилета + "%");
	Запрос.УстановитьПараметр("Период", Дата);
	Если Поиск ИЛИ ОтменаОперации Тогда
		Запрос.УстановитьПараметр("СписокВидовОперации", СписокВидовОперации);
		Запрос.УстановитьПараметр("СписокСтатусовЗБ", СписокСтатусовЗБ);
	КонецЕсли;

	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат;
	КонецЕсли;

КонецФункции

Функция ПолучитьЛомбардПользователя(Пользователь) Экспорт 
	Если Пользователь.ЭтоЛомбард Тогда   
		Возврат ПараметрыСеанса.ТекущийЛомбард;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ТекущийЛомбардПользователя.Ломбард КАК Ломбард
		|ИЗ
		|	РегистрСведений.ЛБ_ТекущийЛомбардПользователя КАК ЛБ_ТекущийЛомбардПользователя
		|ГДЕ
		|	ЛБ_ТекущийЛомбардПользователя.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат <> Неопределено Тогда
		Возврат Результат[0].Ломбард;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

//+Мельников 07.05.24 Взято с https://forum.infostart.ru/forum9/topic10769/ и адаптировано
Функция ПолучитьИмяТекущегоПользователяОСИИмяКомпьютера() Экспорт
	
	ТекущийПользовательОС = Неопределено;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Пользователь", ИмяПользователя());
	Отбор.Вставить("Событие", "_$Session$_.Authentication");
	Отбор.Вставить("Сеанс", НомерСеансаИнформационнойБазы());
	
	ТЗ = Новый ТаблицаЗначений();
	ВыгрузитьЖурналРегистрации(ТЗ, Отбор); //Было: , "Данные", , 1);
	
	Если ТЗ.Количество() > 0 Тогда
		Данные = ТЗ[ТЗ.Количество()-1];
		
		Если Данные <> Неопределено Тогда
			Результат = Новый Структура;
			Результат.Вставить("ТекущийПользовательОС", Данные.Данные.ТекущийПользовательОС);
			Результат.Вставить("Компьютер", Данные.Компьютер);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//Взято с https://1clenta.ru/pattern/143 на https://koder.by/poluchit_ip_adres.php тоже самое
Функция ПолучитьIPКомпьютера() Экспорт
	
	COMОбъект = ПолучитьCOMОбъект("winmgmts:\\.\root\CIMV2");	
	
	//Если нужны все параметры, то в запросе вместо "IPAddress" ставим * (звездачку).
	Результат = COMОбъект.ExecQuery("SELECT IPAddress FROM 
									|Win32_NetworkAdapterConfiguration 
									|WHERE IPEnabled = TRUE");
	
	Для каждого Строка Из Результат Цикл
		Для каждого ПодСтрока Из Строка.IPAddress Цикл
			Возврат ПодСтрока;
		КонецЦикла;
	КонецЦикла;
	
КонецФункции

Функция ПолучитьСсылкуЛомбарда() Экспорт

	//Например по ломбарду №142:
	//Имя компьютера - "L-142-645445"
	//Имя пользователя - "lk-142l"
	//IP - 10.0.142.10

	ПользовательИКомпьютер = ЛБ_ОбщийМодуль.ПолучитьИмяТекущегоПользователяОСИИмяКомпьютера();
	IPКомпьютера = ЛБ_ОбщийМодуль.ПолучитьIPКомпьютера();

	Если ТипЗнч(ПользовательИКомпьютер) = Тип("Структура") Тогда
		НомерЛомбардаОтКомпьютера = Сред(ПользовательИКомпьютер.Компьютер, СтрНайти(ПользовательИКомпьютер.Компьютер, "-")+1, 3);
		НомерЛомбардаОтПользователя = Сред(ПользовательИКомпьютер.ТекущийПользовательОС, СтрНайти(ПользовательИКомпьютер.ТекущийПользовательОС, "-")+1, 3);
	КонецЕсли;
	
	Если IPКомпьютера <> "" Тогда 
		НомерЛомбардаОтIP = Сред(IPКомпьютера, СтрНайти(IPКомпьютера, ".",,,2)+1, 3);
	КонецЕсли;
	
	Если НомерЛомбардаОтПользователя = НомерЛомбардаОтКомпьютера Тогда
		НомерЛомбарда = НомерЛомбардаОтПользователя;
	Иначе
		НомерЛомбарда = Неопределено;
	КонецЕсли;

	//Можно добавить проверку номеров для последующей выдачи сообщения.
	
	ЛомбардСсылка = Справочники.ЛБ_Ломбарды.НайтиПоРеквизиту("НомерЛомбарда", НомерЛомбарда);

	Возврат ЛомбардСсылка;
	
КонецФункции
//-Мельников

Функция ЗаполнитьДтКт(ВидОперации) Экспорт  	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Дт", "");
	СтруктураВозврата.Вставить("Кт", "");
	
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("ВидОперации", ВидОперации);   
	Если ТипЗнч(ВидОперации) = Тип("ПеречислениеСсылка.ЛБ_ВидыОперацийПКО") Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_ЗначенияПоУмолчаниюДляПодстановкиПКО.Дт КАК Дт,
		               |	ЛБ_ЗначенияПоУмолчаниюДляПодстановкиПКО.Кт КАК Кт
		               |ИЗ
		               |	РегистрСведений.ЛБ_ЗначенияПоУмолчаниюДляПодстановкиПКО КАК ЛБ_ЗначенияПоУмолчаниюДляПодстановкиПКО
		               |ГДЕ
		               |	ЛБ_ЗначенияПоУмолчаниюДляПодстановкиПКО.ВидОперации = &ВидОперации";  		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			СтруктураВозврата.Дт = Выборка.Дт;
			СтруктураВозврата.Кт = Выборка.Кт;
		КонецЕсли;     
	ИначеЕсли ТипЗнч(ВидОперации) = Тип("ПеречислениеСсылка.ЛБ_ВидыОперацийРКО") Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_ЗначенияПоУмолчаниюДляПодстановкиРКО.Дт КАК Дт,
		               |	ЛБ_ЗначенияПоУмолчаниюДляПодстановкиРКО.Кт КАК Кт
		               |ИЗ
		               |	РегистрСведений.ЛБ_ЗначенияПоУмолчаниюДляПодстановкиРКО КАК ЛБ_ЗначенияПоУмолчаниюДляПодстановкиРКО
		               |ГДЕ
		               |	ЛБ_ЗначенияПоУмолчаниюДляПодстановкиРКО.ВидОперации = &ВидОперации";  		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			СтруктураВозврата.Дт = Выборка.Дт;
			СтруктураВозврата.Кт = Выборка.Кт;
		КонецЕсли;     
	КонецЕсли;
	Возврат СтруктураВозврата;
КонецФункции    

Функция ПолучитьОткрытуюКассовуюСмену(Дата, Организация, Ломбард) Экспорт 
	Запрос = Новый Запрос;    
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация); 
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КассоваяСменаСрезПоследних.Период КАК Период,
	               |	ЛБ_КассоваяСменаСрезПоследних.КассоваяСмена КАК КассоваяСмена,
	               |	ЛБ_КассоваяСменаСрезПоследних.Статус КАК Статус,
	               |	ЛБ_КассоваяСменаСрезПоследних.ПКОСводный КАК ПКОСводный,
	               |	ЛБ_КассоваяСменаСрезПоследних.РКОСводный КАК РКОСводный,
	               |	ЛБ_КассоваяСменаСрезПоследних.Ответственный КАК Ответственный
	               |ИЗ
	               |	РегистрСведений.ЛБ_КассоваяСмена.СрезПоследних(
	               |			&Дата,
	               |			Организация = &Организация
	               |				И Ломбард = &Ломбард) КАК ЛБ_КассоваяСменаСрезПоследних"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда   
		Если Выборка.Статус = Перечисления.ЛБ_КассоваяСменаСтатус.Открыта Тогда
			СтруктураВ = Новый Структура;
		    СтруктураВ.Вставить("Дата", Выборка.Период); 
			СтруктураВ.Вставить("КассоваяСмена", Выборка.КассоваяСмена);
			СтруктураВ.Вставить("ПКОСводный", Выборка.ПКОСводный); 
			СтруктураВ.Вставить("РКОСводный", Выборка.РКОСводный);
			СтруктураВ.Вставить("Ответственный", Выборка.Ответственный);
			
			Возврат СтруктураВ; 
		Иначе   
			Возврат неопределено;
		КонецЕсли;	
	КонецЕсли;	
	Возврат неопределено;
КонецФункции

Функция СоздатьСводныйПКО(Дата, Организация, Ломбард) Экспорт  
	НовыйОбъект = Документы.ЛБ_ПриходныйКассовыйОрдер.СоздатьДокумент();
	НовыйОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.СводныйПКО;
	НовыйОбъект.Дата = Дата;
	НовыйОбъект.Организация = Организация; 
	НовыйОбъект.Ломбард = Ломбард;  
	НовыйОбъект.НомерПКО = ЛБ_УправлениеЛомбардом.ПолучитьНовыйНомерПКО(НовыйОбъект.Дата, НовыйОбъект.Организация, НовыйОбъект.Ломбард);
	НовыйОбъект.ПредставлениеНомераПКО = СокрЛП(НовыйОбъект.Ломбард.НомерЛомбарда) + "/" + СокрЛП(НовыйОбъект.НомерПКО); 
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
    Если НЕ ТекПользователь.ЭтоЛомбард Тогда
   		Ответственный = ТекПользователь;
	Иначе
		Ответственный = ПараметрыСеанса.ТекущийСотрудник;
	КонецЕсли;
	НовыйОбъект.Ответственный = Ответственный;
	
	Попытка
	    НовыйОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение    
		НовыйОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;	
	Возврат НовыйОбъект.Ссылка;
КонецФункции  

Функция СоздатьСводныйРКО(Дата, Организация, Ломбард) Экспорт  
	НовыйОбъект = Документы.ЛБ_РасходныйКассовыйОрдер.СоздатьДокумент();
	НовыйОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.СводныйРКО;
	НовыйОбъект.Дата = Дата;
	НовыйОбъект.Организация = Организация; 
	НовыйОбъект.Ломбард = Ломбард;  
	НовыйОбъект.НомерРКО = ЛБ_УправлениеЛомбардом.ПолучитьНовыйНомерРКО(НовыйОбъект.Дата, НовыйОбъект.Организация, НовыйОбъект.Ломбард);
	НовыйОбъект.ПредставлениеНомераРКО = СокрЛП(НовыйОбъект.Ломбард.НомерЛомбарда) + "/" + СокрЛП(НовыйОбъект.НомерРКО);
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
    Если НЕ ТекПользователь.ЭтоЛомбард Тогда
   		Ответственный = ТекПользователь;
	Иначе
		Ответственный = ПараметрыСеанса.ТекущийСотрудник;
	КонецЕсли;
	НовыйОбъект.Ответственный = Ответственный;
	
	Попытка
	    НовыйОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение    
		НовыйОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;	
	Возврат НовыйОбъект.Ссылка;
КонецФункции

Функция ПроверитьНаличиеСуммыВКассеЛомбарда(Дата, Организация, Ломбард) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата); 
	Запрос.УстановитьПараметр("Организация", Организация);
    Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДенежныеСредстваОстатки.Организация КАК Организация,
	               |	ЛБ_ДенежныеСредстваОстатки.Ломбард КАК Ломбард,
	               |	ЛБ_ДенежныеСредстваОстатки.ВидДенежныхСредств КАК ВидДенежныхСредств,
	               |	СУММА(ЛБ_ДенежныеСредстваОстатки.СуммаОстаток) КАК Сумма
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ДенежныеСредства.Остатки(
	               |			&Дата,
	               |			Организация = &Организация
	               |				И Ломбард = &Ломбард
	               |				И ВидДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДенежныхСредств.Наличные)) КАК ЛБ_ДенежныеСредстваОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ДенежныеСредстваОстатки.Организация,
	               |	ЛБ_ДенежныеСредстваОстатки.Ломбард,
	               |	ЛБ_ДенежныеСредстваОстатки.ВидДенежныхСредств";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Сумма;
	КонецЕсли;
	Возврат 0;
КонецФункции

Функция ПолучитьТекущийСтатусКассовойСмены(Дата, Организация, Ломбард) Экспорт 
	Запрос = Новый Запрос;    
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация); 
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КассоваяСменаСрезПоследних.Статус КАК Статус,
	               |	ЛБ_КассоваяСменаСрезПоследних.Период КАК Период,
	               |	ЛБ_КассоваяСменаСрезПоследних.КассовыйДень КАК КассовыйДень,
	               |	ЛБ_КассоваяСменаСрезПоследних.Ответственный КАК Ответственный
	               |ИЗ
	               |	РегистрСведений.ЛБ_КассоваяСмена.СрезПоследних(
	               |			&Дата,
	               |			Организация = &Организация
	               |				И Ломбард = &Ломбард
	               |				И НЕ Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_КассоваяСменаСтатус.КассовыйДеньЗакрыт)) КАК ЛБ_КассоваяСменаСрезПоследних"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда   
		СтруктураВ = Новый Структура;
	    СтруктураВ.Вставить("Дата", Выборка.Период); 
		СтруктураВ.Вставить("Статус", Выборка.Статус); 
		СтруктураВ.Вставить("КассовыйДень", Выборка.КассовыйДень);
		СтруктураВ.Вставить("Ответственный", Выборка.Ответственный);
		
		Возврат СтруктураВ; 
	КонецЕсли;	
	Возврат неопределено;
КонецФункции

Функция ПроверитьЕстьОтменаКО(Документ) Экспорт 
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("КассоваяОперация", Документ);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДвиженияДенежныхСредств.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ДвиженияДенежныхСредств КАК ЛБ_ДвиженияДенежныхСредств
	               |ГДЕ
	               |	ЛБ_ДвиженияДенежныхСредств.КассоваяОперация = &КассоваяОперация
	               |	И НЕ ЛБ_ДвиженияДенежныхСредств.Регистратор = &КассоваяОперация";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции	

Функция ПолучитьЗакрытыйКассовыйДень(Дата, Организация, Ломбард) Экспорт 
	Запрос = Новый Запрос;    
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация); 
	Запрос.УстановитьПараметр("Ломбард", Ломбард);  
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КассоваяСменаСрезПоследних.Период КАК Период,
	               |	ЛБ_КассоваяСменаСрезПоследних.КассовыйДень КАК КассовыйДень,
	               |	ЛБ_КассоваяСменаСрезПоследних.Ответственный КАК Ответственный
	               |ИЗ
	               |	РегистрСведений.ЛБ_КассоваяСмена.СрезПоследних(
	               |			&Дата,
	               |			Организация = &Организация
	               |				И Ломбард = &Ломбард
	               |				И Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_КассоваяСменаСтатус.КассовыйДеньЗакрыт)) КАК ЛБ_КассоваяСменаСрезПоследних"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда   
		СтруктураВ = Новый Структура;
	    СтруктураВ.Вставить("Дата", Выборка.Период);  
		СтруктураВ.Вставить("КассовыйДень", Выборка.КассовыйДень);
		СтруктураВ.Вставить("Ответственный", Выборка.Ответственный);
		
		Возврат СтруктураВ; 
	КонецЕсли;	
	Возврат неопределено;
КонецФункции

Функция КассовыеСменаСовпадаетСТекущей(Документ) Экспорт 
	СтруктураКСДок = ПолучитьОткрытуюКассовуюСмену(Документ.Дата, Документ.Организация, Документ.Ломбард);
	СтруктураКСТекущая = ПолучитьОткрытуюКассовуюСмену(ТекущаяДатаСеанса(), Документ.Организация, Документ.Ломбард);
	
	Если НЕ СтруктураКСТекущая = неопределено Тогда
		Если НЕ СтруктураКСДок = неопределено Тогда 
			Если СтруктураКСТекущая.КассоваяСмена = СтруктураКСДок.КассоваяСмена Тогда
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	Возврат Ложь;
КонецФункции	

Функция ПолучитьСводныйПКО_РКО(Дата, Организация, Ломбард) Экспорт 
	Запрос = Новый Запрос;    
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация); 
	Запрос.УстановитьПараметр("Ломбард", Ломбард);	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КассоваяСменаСрезПоследних.Период КАК Период,
	               |	ЛБ_КассоваяСменаСрезПоследних.ПКОСводный КАК ПКОСводный,
	               |	ЛБ_КассоваяСменаСрезПоследних.РКОСводный КАК РКОСводный
	               |ИЗ
	               |	РегистрСведений.ЛБ_КассоваяСмена.СрезПоследних(
	               |			&Дата,
	               |			Организация = &Организация
	               |				И Ломбард = &Ломбард
	               |				И Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_КассоваяСменаСтатус.Открыта)) КАК ЛБ_КассоваяСменаСрезПоследних"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		Если НачалоДня(Выборка.Период) = НачалоДня(Дата) Тогда
			СтруктураВ = Новый Структура;
			СтруктураВ.Вставить("ПКОСводный", Выборка.ПКОСводный); 
			СтруктураВ.Вставить("РКОСводный", Выборка.РКОСводный);
			
			Возврат СтруктураВ;
		КонецЕсли;	
	КонецЕсли;	                    
	Возврат неопределено;
КонецФункции

Функция ПолучитьОтделениеЛомбарда(Дата, Ломбард) Экспорт 
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Ломбард", Ломбард); 
	Запрос.УстановитьПараметр("Дата", Дата);
    Запрос.Текст = "ВЫБРАТЬ
                   |	ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
                   |ИЗ
                   |	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, Ломбард = &Ломбард) КАК ЛБ_ОтделенияЛомбардовСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Отделение;
	КонецЕсли;
	Возврат Справочники.ЛБ_ОтделенияЛомбардов.ПустаяСсылка();
КонецФункции	

Функция ПолучитьЛомбардыВОтделении(Дата, Отделение, ЛомбардИсключить = неопределено) Экспорт	
	СписокЛ = Новый СписокЗначений;   
	ДопСтрока = "                    ";
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Отделение", Отделение); 
	Запрос.УстановитьПараметр("Дата", Дата);
    Запрос.Текст = "ВЫБРАТЬ
                   |	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард,
                   |	ЛБ_ОтделенияЛомбардовСрезПоследних.Центральный КАК Центральный
                   |ИЗ
                   |	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, Отделение = &Отделение) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
                   |ГДЕ
                   |	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.Закрыт = ЛОЖЬ
                   |
                   |УПОРЯДОЧИТЬ ПО
                   |	Ломбард
                   |АВТОУПОРЯДОЧИВАНИЕ";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл   
		Если НЕ ЛомбардИсключить = неопределено Тогда
			Если Выборка.Ломбард = ЛомбардИсключить Тогда 
				Продолжить;
			КонецЕсли;
		КонецЕсли;	
		СписокЛ.Добавить(Выборка.Ломбард, СокрЛП(Выборка.Ломбард)+ ?(Выборка.Центральный , " (ЦОЛ)", "") + ДопСтрока);
	КонецЦикла;
	Возврат СписокЛ;
КонецФункции

Функция ПроверитьЦОЛ(Дата, Ломбард) Экспорт
	Отделение = ПолучитьОтделениеЛомбарда(Дата, Ломбард);
	Если Не ЗначениеЗаполнено(Отделение) Тогда
		Возврат Ложь;
	Иначе
		Запрос = Новый Запрос;      
		Запрос.УстановитьПараметр("Ломбард", Ломбард);
		Запрос.УстановитьПараметр("Отделение", Отделение); 
		Запрос.УстановитьПараметр("Дата", Дата);
	    Запрос.Текст = "ВЫБРАТЬ
	                   |	ЛБ_ОтделенияЛомбардовСрезПоследних.Центральный КАК Центральный
	                   |ИЗ
	                   |	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(
	                   |			&Дата,
	                   |			Отделение = &Отделение
	                   |				И Ломбард = &Ломбард) КАК ЛБ_ОтделенияЛомбардовСрезПоследних";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда  
			Если Выборка.Центральный тогда
				Возврат Истина;
			Иначе
				Возврат Ложь;
			КонецЕсли;	
		КонецЕсли;	 
		Возврат Ложь;
	КонецЕсли;	
КонецФункции	

Функция ПолучитьНомерКассовогоЛиста(ДатаНач, ДатаКон, Организация, Ломбард) Экспорт  
	СтруктураВозврата = Новый Структура;
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("ДатаНач", НачалоГода(ДатаКон));  
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));
	Запрос.УстановитьПараметр("Организация", Организация); 
	Запрос.УстановитьПараметр("Ломбард", Ломбард);  
	Запрос.Текст = "ВЫБРАТЬ
	               |	НАЧАЛОПЕРИОДА(ЛБ_ДвиженияДенежныхСредствОбороты.Период, ДЕНЬ) КАК День,
	               |	СУММА(ЛБ_ДвиженияДенежныхСредствОбороты.СуммаОборот) КАК Сумма
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ДвиженияДенежныхСредств.Обороты(
	               |			&ДатаНач,
	               |			&ДатаКон,
	               |			День,
	               |			Организация = &Организация
	               |				И Ломбард = &Ломбард
	               |				И ВидДенежныхСредств = Значение(Перечисление.ЛБ_ВидыДенежныхСредств.Наличные)) КАК ЛБ_ДвиженияДенежныхСредствОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НАЧАЛОПЕРИОДА(ЛБ_ДвиженияДенежныхСредствОбороты.Период, ДЕНЬ)";
	КоличествоЛистовГод = 0;
	ПоследнийДеньКассовогоЛиста = Дата(1,1,1);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Если Выборка.Сумма = 0 Тогда
			Продолжить;
		КонецЕсли;
		КоличествоЛистовГод = КоличествоЛистовГод + 1; 
		ПоследнийДеньКассовогоЛиста = Выборка.День;
	Конеццикла;	       
	Если (НачалоДня(ДатаКон) = ПоследнийДеньКассовогоЛиста) ИЛИ НЕ (НачалоДня(ДатаНач) = НачалоДня(ДатаКон)) Тогда 
		СтруктураВозврата.Вставить("Номер", КоличествоЛистовГод); 
		СтруктураВозврата.Вставить("Дата", ПоследнийДеньКассовогоЛиста);
	    Возврат СтруктураВозврата;  
	КонецЕсли; 
    СтруктураВозврата.Вставить("Номер", 0); 
	СтруктураВозврата.Вставить("Дата", ДатаКон);
    Возврат СтруктураВозврата;     
КонецФункции	
	
Функция ПолучитьИмяФормыКорректировкиНакладных(Документ) Экспорт   
	Если Документ.ВидОперации = Перечисления.ЛБ_ВидыКорректировкиНакладной.ИсключениеЗБИзНакладной Тогда  
		Возврат "ЛБ_ФормаИсключенияИзНакладнойНаОтгрузку"; 
	ИначеЕсли Документ.ВидОперации = Перечисления.ЛБ_ВидыКорректировкиНакладной.БлокировкаВключенияЗБВНакладные Тогда 
		Возврат "ЛБ_ФормаБлокировкиЗалоговыхБилетов"; 
	ИначеЕсли Документ.ВидОперации = Перечисления.ЛБ_ВидыКорректировкиНакладной.ОтгрузкаНакладных Тогда 
		Возврат "ЛБ_ФормаОтгрузкиНакладных"; 
	ИначеЕсли Документ.ВидОперации = Перечисления.ЛБ_ВидыКорректировкиНакладной.ОтменаОтгрузкиНакладных Тогда 
		Возврат "ЛБ_ФормаОтменыОтгрузкиНакладных";  
	ИначеЕсли Документ.ВидОперации = Перечисления.ЛБ_ВидыКорректировкиНакладной.ОплатаОтгруженногоЗБ Тогда 
		Возврат "ЛБ_ФормаОплатыОтгруженныхЗБ"; 	
	КонецЕсли;
	Возврат неопределено;
КонецФункции	

Функция ПолучитьЗБПоНомеру(НомерЗБ, БезОтмененных = Истина) Экспорт 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номер", НомерЗБ);  
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(, НомерЗалоговогоБилета = &Номер) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних";
	
	Если  БезОтмененных Тогда
		Запрос.Текст = Запрос.Текст + "
	               |ГДЕ
	               |	 НЕ ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыЗалоговыхБилетов.ОтказОтОформления)";
	КонецЕсли;  	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		Возврат Выборка.ЗалоговыйБилет;
	КонецЕсли;                         
	Возврат Документы.ЛБ_ОперацияПоЗалогу.ПустаяСсылка();
КонецФункции	

Функция ПроверитьРасчетыПоЗалоговомуБилету(Дата, ЗалоговыйБилет, Выкуп = Ложь) Экспорт 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПричинаПрименения КАК ПричинаПрименения,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗБ,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаНачалаРасчетаПроцентов КАК ДатаНачалаРасчетаПроцентов
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&Дата, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних";	
	Выборка = Запрос.Выполнить().Выбрать();
	СуммаПроценты = 0;
	СуммаЗайм = 0;
	Если Выборка.Следующий() Тогда  
		СуммаЗайм = Выборка.СуммаЗайма;
		Результат = РасчитатьДолгПроценты(Дата, ЗалоговыйБилет, Выборка.СтатусЗБ, Выборка.ДатаНачалаРасчетаПроцентов, Выборка.ПричинаПрименения, Выкуп); 
		СуммаПроценты = Результат.СуммаПроценты;
	КонецЕсли; 
	СтруктураВ = Новый Структура;
	СтруктураВ.Вставить("ОстатокПроценты", СуммаПроценты); 
	СтруктураВ.Вставить("ОстатокЗайм", СуммаЗайм);
	Возврат СтруктураВ;
КонецФункции


Функция РасчитатьДолгПроценты(Дата, ЗалоговыйБилет, СтатусЗБ, ДатаНачалаРасчета, ПричинаПримененияПроцентнойСхемы, Выкуп = Ложь) Экспорт
	СуммаПроцентов = 0;
	
	ДокументОбъект = Документы.ЛБ_ОперацияПоЗалогу.СоздатьДокумент(); 
	ДокументОбъект.ПредыдущаяОперация = ЗалоговыйБилет; 
	ДокументОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов;
	ДокументОбъект.Дата = Дата; 
	ДокументОбъект.Организация = ЗалоговыйБилет.Организация;
	ДокументОбъект.ПроцентнаяСхема = ЗалоговыйБилет.ПроцентнаяСхема; 
	ДокументОбъект.Выкуп = Выкуп;    
	
	НачисленияОстановлены = Ложь;
	ДатаСмертиКлиента = ЛБ_ОбщийМодуль.ПроверитьЕстьДатаСмерти(ЗалоговыйБилет.Залогодатель, Дата);   
	Если НЕ ДатаСмертиКлиента = неопределено Тогда   
		ПредыдущийСтатусЗБ = ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(ДатаСмертиКлиента-1, ЗалоговыйБилет); 
		Если ПредыдущийСтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят ИЛИ 
		     ПредыдущийСтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен ИЛИ
		     ПредыдущийСтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Остановлен Тогда 
			НачисленияОстановлены = Истина; 
		КонецЕсли; 
	КонецЕсли;
	
	Если НачисленияОстановлены ИЛИ
		 СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят ИЛИ 
		 СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен ИЛИ
		 СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Остановлен Тогда
		 СуммаПроцентов = ЛБ_ОбщийМодуль.ПолучитьОстатокПроцентов(ДокументОбъект, ДокументОбъект.ПредыдущаяОперация);
			
		СтруктураВ = Новый Структура;
		СтруктураВ.Вставить("СуммаПроценты", СуммаПроцентов);  
		СтруктураВ.Вставить("ДокументОбъект", ДокументОбъект); 
	Иначе		
	
		СтруктураП = ЛБ_УправлениеЛомбардом.ПолучитьПредельныеЗначенияПроцентов(ЗалоговыйБилет.Дата, ЗалоговыйБилет.Организация);
		Если НЕ СтруктураП = неопределено Тогда
		    ПланкаПроцентов = СтруктураП.ПланкаПроцентов;
			ПредельноеЗначениеПроцентов = ЗалоговыйБилет.СуммаСсуды*СтруктураП.ПланкаПроцентов; 
		Иначе
			ПредельноеЗначениеПроцентов = 0;
		КонецЕсли;   
		СтруктураОкр = ЛБ_УправлениеЛомбардом.ПолучитьУсловияОкругленияПроцентов(ЗалоговыйБилет);
		Установки = ЛБ_УправлениеЛомбардом.ПолучитьУсловияПоДоговору(ЗалоговыйБилет); 	
			
		Результат = ЛБ_ОбщийМодуль.РассчитатьСуммуПроцентовОплата(ДокументОбъект, ДатаНачалаРасчета, ПредельноеЗначениеПроцентов, ПричинаПримененияПроцентнойСхемы, Установки, СтруктураОкр); 
		
		СтруктураВ = Новый Структура;
		СтруктураВ.Вставить("СуммаПроценты", Результат.СуммаПроцентов);  
		СтруктураВ.Вставить("ДокументОбъект", ДокументОбъект);  
	КонецЕсли;	
  
	Возврат СтруктураВ;
КонецФункции

Функция ПолучитьИтоговыйСтатусБезналичногоПлатежа(Дата, РеестрПлатежей, ИдентификаторПлатежа, ДатаПлатежа, НомерЗБ) Экспорт 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РеестрПлатежей", РеестрПлатежей);
	Запрос.УстановитьПараметр("ИдентификаторПлатежа", ИдентификаторПлатежа);
	Запрос.УстановитьПараметр("ДатаПлатежа", ДатаПлатежа);
	Запрос.УстановитьПараметр("НомерЗБ", НомерЗБ); 
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.СтатусПлатежа КАК СтатусПлатежа,
	               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеестрБезначныхПлатежей.СрезПоследних(
	               |			&Дата,
	               |			РеестрПлатежей = &РеестрПлатежей
	               |				И ИдентификаторПлатежа = &ИдентификаторПлатежа
	               |				И ДатаПлатежа = &ДатаПлатежа
	               |				И НомерЗБ = &НомерЗБ) КАК ЛБ_РеестрБезначныхПлатежейСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда 
		Если Выборка.Регистратор = РеестрПлатежей Тогда 
			Возврат Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ПустаяСсылка();
		Иначе	
		    Возврат Выборка.СтатусПлатежа;
		КонецЕсли;   
	КонецЕсли;                         
	Возврат Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ПустаяСсылка();
КонецФункции	

Функция ПолучитьИтоговыйСтатусПереплаты(РеестрПлатежей, ИдентификаторПлатежа, ДатаПлатежа, НомерЗБ) Экспорт 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РеестрПлатежей", РеестрПлатежей);
	Запрос.УстановитьПараметр("ИдентификаторПлатежа", ИдентификаторПлатежа);
	Запрос.УстановитьПараметр("ДатаПлатежа", ДатаПлатежа);
	Запрос.УстановитьПараметр("НомерЗБ", НомерЗБ); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеестрБезначныхПлатежейПереплатаСрезПоследних.СтатусПлатежа КАК СтатусПлатежа,
	               |	ЛБ_РеестрБезначныхПлатежейПереплатаСрезПоследних.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеестрБезначныхПлатежейПереплаты.СрезПоследних(
	               |			,
	               |			РеестрПлатежей = &РеестрПлатежей
	               |				И ИдентификаторПлатежа = &ИдентификаторПлатежа
	               |				И ДатаПлатежа = &ДатаПлатежа
	               |				И НомерЗБ = &НомерЗБ) КАК ЛБ_РеестрБезначныхПлатежейПереплатаСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_РеестрБезначныхПлатежейПереплатаСрезПоследних.Период УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда 
		Если Выборка.Регистратор = РеестрПлатежей Тогда 
			Возврат Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ПустаяСсылка();
		Иначе	
		    Возврат Выборка.СтатусПлатежа;
		КонецЕсли;   
	КонецЕсли;                         
	Возврат Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ПустаяСсылка();
КонецФункции	

Функция ПолучитьСостояниеБезналичногоПлатежа(Дата, РеестрПлатежей, ИдентификаторПлатежа, ДатаПлатежа, НомерЗБ) Экспорт  
	СтруктураВ = Новый Структура;
	СтруктураВ.Вставить("ЗалоговыйБилет"); 
	СтруктураВ.Вставить("СтатусПлатежа");
	СтруктураВ.Вставить("ОплатаПроценты");
	СтруктураВ.Вставить("ОплатаЗайм");
	СтруктураВ.Вставить("Переплата");
	СтруктураВ.Вставить("Возврат");
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РеестрПлатежей", РеестрПлатежей);
	Запрос.УстановитьПараметр("ИдентификаторПлатежа", ИдентификаторПлатежа);
	Запрос.УстановитьПараметр("ДатаПлатежа", ДатаПлатежа);
	Запрос.УстановитьПараметр("НомерЗБ", НомерЗБ); 
	Запрос.УстановитьПараметр("Дата", Дата);  
	Запрос.УстановитьПараметр("ПустойСтатус", Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ПустаяСсылка());
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ВЫБОР
	               |		КОГДА ЛБ_РеестрБезначныхПлатежейСрезПоследних.Регистратор ССЫЛКА Документ.ЛБ_РеестрПлатежей
	               |			ТОГДА &ПустойСтатус
	               |		ИНАЧЕ ЛБ_РеестрБезначныхПлатежейСрезПоследних.СтатусПлатежа
	               |	КОНЕЦ КАК СтатусПлатежа,
	               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.ОплатаПроценты КАК ОплатаПроценты,
	               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.ОплатаЗайм КАК ОплатаЗайм,
	               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.Переплата КАК Переплата,
	               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.Возврат КАК Возврат
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеестрБезначныхПлатежей.СрезПоследних(
	               |			&Дата,
	               |			РеестрПлатежей = &РеестрПлатежей
	               |				И ИдентификаторПлатежа = &ИдентификаторПлатежа
	               |				И ДатаПлатежа = &ДатаПлатежа
	               |				И НомерЗБ = &НомерЗБ) КАК ЛБ_РеестрБезначныхПлатежейСрезПоследних";		
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда  
		СтруктураВ.Вставить("ЗалоговыйБилет", Выборка.ЗалоговыйБилет); 
		СтруктураВ.Вставить("СтатусПлатежа", Выборка.СтатусПлатежа);
		СтруктураВ.Вставить("ОплатаПроценты", Выборка.ОплатаПроценты);
		СтруктураВ.Вставить("ОплатаЗайм", Выборка.ОплатаЗайм);
		СтруктураВ.Вставить("Переплата", Выборка.Переплата);
		СтруктураВ.Вставить("Возврат", Выборка.Возврат);
	КонецЕсли;                         
	Возврат СтруктураВ;
КонецФункции

Функция ПолучитьСтатусыБезналичныхПлатежей(Дата = неопределено, РеестрПлатежей) Экспорт   
	Если Дата = неопределено Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РеестрПлатежей", РеестрПлатежей);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.СтатусПлатежа КАК СтатусПлатежа,
	               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.НомерЗБ КАК НомерЗБ,
	               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
	               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.ДатаПлатежа КАК ДатаПлатежа,
	               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.СуммаПлатежа КАК СуммаПлатежа,
	               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеестрБезначныхПлатежей.СрезПоследних(&Дата, РеестрПлатежей = &РеестрПлатежей) КАК ЛБ_РеестрБезначныхПлатежейСрезПоследних";
    Возврат Запрос.Выполнить().Выгрузить();
КонецФункции	

Функция ПолучитьСтатусыБезналичныхПлатежейПереплата(Дата = неопределено, РеестрПлатежей) Экспорт   
	Если Дата = неопределено Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РеестрПлатежей", РеестрПлатежей);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.ПереплатаНачальная КАК ПереплатаНачальная,
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.СтатусПлатежа КАК СтатусПлатежа,
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.НомерЗБ КАК НомерЗБ,
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.ДатаПлатежа КАК ДатаПлатежа,
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.СуммаПлатежа КАК СуммаПлатежа,
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.ЗалоговыйБилет КАК ЗалоговыйБилет
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеестрБезначныхПлатежейПереплаты КАК ЛБ_РеестрБезначныхПлатежейПереплаты
	               |ГДЕ
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.РеестрПлатежей = &РеестрПлатежей
	               |	И ЛБ_РеестрБезначныхПлатежейПереплаты.Период < &Дата
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.Период УБЫВ";
    ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	ТаблицаНачальныхПереплат = ТаблицаЗапроса.Скопировать(); 
	ТаблицаНачальныхПереплат.Свернуть("ПереплатаНачальная");
	ТаблицаСтатусов = ТаблицаЗапроса.Скопировать(); 
	ТаблицаСтатусов.Очистить();
	Для Каждого Стр Из ТаблицаНачальныхПереплат Цикл	
		Отбор = новый Структура;
		Отбор.Вставить("ПереплатаНачальная", Стр.ПереплатаНачальная);
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор); 
		Если Строки.Количество() > 1 Тогда
			СтрЗ = Строки.Получить(0);
			Если СтрЗ.СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.Отменен Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		Выборка = Строки.Получить(0);
		Стр = ТаблицаСтатусов.Добавить();
		Стр.ДатаПлатежа = Выборка.ДатаПлатежа;
		Стр.ИдентификаторПлатежа = Выборка.ИдентификаторПлатежа;
		Стр.НомерЗБ = Выборка.НомерЗБ;  
		Стр.СуммаПлатежа = Выборка.СуммаПлатежа; 
		Стр.СтатусПлатежа = Выборка.СтатусПлатежа; 
		Стр.ПереплатаНачальная = Выборка.ПереплатаНачальная;
		Стр.ЗалоговыйБилет = Выборка.ЗалоговыйБилет; 
	Конеццикла;  
    Возврат ТаблицаСтатусов;
КонецФункции	

Функция ПроверитьЕстьОплатыКасса(ВидОперацииРеестра, ДатаРеестра, ДатаПлатежа, ЗалоговыйБилет) Экспорт
	Запрос = Новый Запрос; 
	Если ВидОперацииРеестра = Перечисления.ЛБ_ВидыБезналичныхПлатежей.РасчетыйСчет Тогда
		Запрос.УстановитьПараметр("Дата", КонецДня(ДатаПлатежа)-9);
		Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
		Запрос.УстановитьПараметр("Пусто", Документы.ЛБ_РеестрПлатежей.ПустаяСсылка());
		Запрос.Текст = "ВЫБРАТЬ
		                |	ЛБ_ОборотыПоОперациямЗайма.Регистратор КАК Регистратор
		                |ИЗ
		                |	РегистрНакопления.ЛБ_ОборотыПоОперациямЗайма КАК ЛБ_ОборотыПоОперациямЗайма
		                |ГДЕ
		                |	ЛБ_ОборотыПоОперациямЗайма.Период > &Дата
		                |	И ЛБ_ОборотыПоОперациямЗайма.ЗалоговыйБилет = &ЗалоговыйБилет
		                |	И ЛБ_ОборотыПоОперациямЗайма.РеестрПлатежей = &Пусто
		                |	И ЛБ_ОборотыПоОперациямЗайма.ВидОперации = Значение(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов)";
		Выборка  = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Истина;
		КонецЕсли;					
	ИначеЕсли ВидОперацииРеестра = Перечисления.ЛБ_ВидыБезналичныхПлатежей.ЛичныйКабинет Тогда
        Запрос.УстановитьПараметр("Дата1", ДатаПлатежа); 
		Запрос.УстановитьПараметр("Дата2", ДатаРеестра);
		Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
		Запрос.УстановитьПараметр("Пусто", Документы.ЛБ_РеестрПлатежей.ПустаяСсылка());
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_ОборотыПоОперациямЗайма.Регистратор КАК Регистратор
		               |ИЗ
		               |	РегистрНакопления.ЛБ_ОборотыПоОперациямЗайма КАК ЛБ_ОборотыПоОперациямЗайма
		               |ГДЕ
		               |	ЛБ_ОборотыПоОперациямЗайма.Период МЕЖДУ &Дата1 И &Дата2
		               |	И ЛБ_ОборотыПоОперациямЗайма.ЗалоговыйБилет = &ЗалоговыйБилет
		               |	И ЛБ_ОборотыПоОперациямЗайма.РеестрПлатежей = &Пусто
		               |	И ЛБ_ОборотыПоОперациямЗайма.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов)";
		Выборка  = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Истина;
		КонецЕсли;				
	КонецЕсли;
	Возврат Ложь;
КонецФункции  

Функция ПроверитьЕстьОплатыБН(ДатаПлатежа, ЗалоговыйБилет) Экспорт
	ЗапросC = Новый Запрос;
	ЗапросC.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
	ЗапросC.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.СтатусПлатежа КАК СтатусПлатежа
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеестрБезначныхПлатежей.СрезПоследних(
	               |			,
	               |			РеестрПлатежей = &РеестрПлатежей
	               |				И ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_РеестрБезначныхПлатежейСрезПоследних";
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", ДатаПлатежа);
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОборотыПоОперациямЗайма.РеестрПлатежей КАК РеестрПлатежей
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОборотыПоОперациямЗайма КАК ЛБ_ОборотыПоОперациямЗайма
	               |ГДЕ
	               |	ЛБ_ОборотыПоОперациямЗайма.Период > &Дата
	               |	И ЛБ_ОборотыПоОперациямЗайма.ЗалоговыйБилет = &ЗалоговыйБилет
	               |	И ЛБ_ОборотыПоОперациямЗайма.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов)
	               |	И ЛБ_ОборотыПоОперациямЗайма.РеестрПлатежей.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыБезналичныхПлатежей.РасчетыйСчет)";
	Выборка  = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗапросC.УстановитьПараметр("РеестрПлатежей", Выборка.РеестрПлатежей);     
		ВыборкаС = ЗапросC.Выполнить().Выбрать();
		Если ВыборкаС.Следующий() Тогда  
			Если ВыборкаС.СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ЗачисленоПолностью ИЛИ
				 ВыборкаС.СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ЗачисленоЧастично Тогда  
				Возврат Истина; 
			КонецЕсли;	 
		КонецЕсли;	
	КонецЦикла;					
	Возврат Ложь;
КонецФункции


Функция ПроверитьЕстьОплатыРегламентныеНачисленияОтменаБН(ДатаПлатежа, ЗалоговыйБилет) Экспорт  
	СтруктураВозврата = Новый Структура;
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", ДатаПлатежа);
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);   
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РасчетыСКлиентами.Период КАК Период,
	               |	ЛБ_РасчетыСКлиентами.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	СУММА(ЛБ_РасчетыСКлиентами.Сумма) КАК Сумма
	               |ИЗ
	               |	РегистрНакопления.ЛБ_РасчетыСКлиентами КАК ЛБ_РасчетыСКлиентами
	               |ГДЕ
	               |	ЛБ_РасчетыСКлиентами.Период > &Дата
	               |	И ЛБ_РасчетыСКлиентами.ЗалоговыйБилет = &ЗалоговыйБилет
	               |	И ЛБ_РасчетыСКлиентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |	И ЛБ_РасчетыСКлиентами.Сумма > 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_РасчетыСКлиентами.ЗалоговыйБилет,
	               |	ЛБ_РасчетыСКлиентами.Период";
	Выборка  = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		СтруктураВозврата.Вставить("Период", Выборка.Период);
		СтруктураВозврата.Вставить("Вид", 0); 
		
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РасчетыСКлиентамиБУ.Период КАК Период,
	               |	ЛБ_РасчетыСКлиентамиБУ.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	СУММА(ЛБ_РасчетыСКлиентамиБУ.Сумма) КАК Сумма
	               |ИЗ
	               |	РегистрНакопления.ЛБ_РасчетыСКлиентамиБУ КАК ЛБ_РасчетыСКлиентамиБУ
	               |ГДЕ
	               |	ЛБ_РасчетыСКлиентамиБУ.Период > &Дата
	               |	И ЛБ_РасчетыСКлиентамиБУ.ЗалоговыйБилет = &ЗалоговыйБилет
	               |	И ЛБ_РасчетыСКлиентамиБУ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	               |	И ЛБ_РасчетыСКлиентамиБУ.Сумма > 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_РасчетыСКлиентамиБУ.ЗалоговыйБилет,
	               |	ЛБ_РасчетыСКлиентамиБУ.Период";
	Выборка  = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		СтруктураВозврата.Вставить("Период", Выборка.Период);
		СтруктураВозврата.Вставить("Вид", 1); 
		Возврат СтруктураВозврата;
	КонецЕсли;	
	
	Возврат неопределено;
КонецФункции


Функция ПроверитьЕстьПлатежиЛКДляОтмены(ДатаПлатежа, ЗалоговыйБилет) Экспорт  	
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.УстановитьПараметр("ДатаПлатежа", ДатаПлатежа); 
	Запрос.УстановитьПараметр("ПустойСтатус", Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ПустаяСсылка());
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.РеестрПлатежей КАК РеестрПлатежей,
	               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.НомерЗБ КАК НомерЗБ,
	               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.ДатаПлатежа КАК ДатаПлатежа,
	               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
	               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.СуммаПлатежа КАК СуммаПлатежа,
	               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.СтатусПлатежа КАК СтатусПлатежа,
	               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.ДокументОплаты КАК ДокументОплаты,
	               |	&ПустойСтатус КАК СтатусПереплаты
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеестрБезначныхПлатежей.СрезПоследних(, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_РеестрБезначныхПлатежейСрезПоследних
	               |ГДЕ
	               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.РеестрПлатежей.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыБезналичныхПлатежей.ЛичныйКабинет)
	               |	И ЛБ_РеестрБезначныхПлатежейСрезПоследних.ДатаПлатежа >= &ДатаПлатежа
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.Период УБЫВ"; 
    ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();   
	УдСтроки = Новый СписокЗначений;
	Для каждого Выборка из ТаблицаЗапроса Цикл  
		Если НЕ Выборка.СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ЗачисленоПолностью И
			 НЕ Выборка.СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ЗачисленоЧастично И
			 НЕ Выборка.СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.Возвращено И
			 НЕ Выборка.СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ОтнесеноВДоходы Тогда 
			УдСтроки.Добавить(Выборка);  
			Продолжить;
		КонецЕсли;	 
		Выборка.СтатусПереплаты = ПолучитьИтоговыйСтатусПереплаты(Выборка.РеестрПлатежей, Выборка.ИдентификаторПлатежа, Выборка.ДатаПлатежа, Выборка.НомерЗБ);
		//	СтруктураВозврата = Новый Структура; 
		//	СтруктураВозврата.Вставить("РеестрПлатежей", Выборка.РеестрПлатежей); 
		//	СтруктураВозврата.Вставить("НомерЗБ", Выборка.НомерЗБ);
		//	СтруктураВозврата.Вставить("ДатаПлатежа", Выборка.ДатаПлатежа);
		//	СтруктураВозврата.Вставить("ИдентификаторПлатежа", Выборка.ИдентификаторПлатежа);
		//	СтруктураВозврата.Вставить("СуммаПлатежа", Выборка.СуммаПлатежа);
		//	СтруктураВозврата.Вставить("СтатусПлатежа", Выборка.СтатусПлатежа); 
		//	СтруктураВозврата.Вставить("ДокументОплаты", Выборка.ДокументОплаты); 
		//	СтруктураВозврата.Вставить("СтатусПереплаты", ПолучитьИтоговыйСтатусПереплаты(Выборка.РеестрПлатежей, Выборка.ИдентификаторПлатежа, Выборка.ДатаПлатежа, Выборка.НомерЗБ));
		//	Возврат СтруктураВозврата;
		//КонецЕсли;	
	КонецЦикла; 
	
	Для каждого Эл Из Удстроки Цикл 
		ТаблицаЗапроса.Удалить(Эл.Значение);
	Конеццикла;	
	Возврат ТаблицаЗапроса;
КонецФункции
	
Функция РассчитатьОстатокПереплатыБезналичногоПлатежа(Дата, РеестрПлатежей, ИдентификаторПлатежа, ДатаПлатежа, НомерЗБ) Экспорт 
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("РеестрПлатежей", РеестрПлатежей);
	Запрос.УстановитьПараметр("ИдентификаторПлатежа", ИдентификаторПлатежа);
	Запрос.УстановитьПараметр("ДатаПлатежа", ДатаПлатежа);
	Запрос.УстановитьПараметр("НомерЗБ", НомерЗБ); 
	Запрос.УстановитьПараметр("Дата", Дата);   
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.Переплата КАК Переплата
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеестрБезначныхПлатежей.СрезПоследних(
	               |			&Дата,
	               |			РеестрПлатежей = &РеестрПлатежей
	               |				И ИдентификаторПлатежа = &ИдентификаторПлатежа
	               |				И ДатаПлатежа = &ДатаПлатежа
	               |				И НомерЗБ = &НомерЗБ) КАК ЛБ_РеестрБезначныхПлатежейСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.Период УБЫВ";  
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
        ПереплатаОстаток = Выборка.Переплата;   
		Если НЕ ПереплатаОстаток = 0 Тогда
			Запрос.Текст = "ВЫБРАТЬ
			               |	ЛБ_РаспределениеПереплаты.ОплатаПроценты КАК ОплатаПроценты,
			               |	ЛБ_РаспределениеПереплаты.ОплатаЗайм КАК ОплатаЗайм,
			               |	ЛБ_РаспределениеПереплаты.Возвращено КАК Возвращено,
			               |	ЛБ_РаспределениеПереплаты.ВДоходы КАК ВДоходы
			               |ИЗ
			               |	РегистрНакопления.ЛБ_РаспределениеПереплаты КАК ЛБ_РаспределениеПереплаты
			               |ГДЕ
			               |	ЛБ_РаспределениеПереплаты.Период <= &Дата
			               |	И ЛБ_РаспределениеПереплаты.РеестрПлатежей = &РеестрПлатежей
			               |	И ЛБ_РаспределениеПереплаты.НомерЗБ = &НомерЗБ
			               |	И ЛБ_РаспределениеПереплаты.ДатаПлатежа = &ДатаПлатежа
			               |	И ЛБ_РаспределениеПереплаты.ИдентификаторПлатежа = &ИдентификаторПлатежа"; 
			ВыборкаП = Запрос.Выполнить().Выбрать();  
			ПереплатаРаспределенная = 0;
			Пока ВыборкаП.Следующий() Цикл 
				Если ЗначениеЗаполнено(ВыборкаП.ОплатаПроценты) Тогда 
					ПереплатаРаспределенная = ПереплатаРаспределенная + ВыборкаП.ОплатаПроценты;
				КонецЕсли;	  
				Если ЗначениеЗаполнено(ВыборкаП.ОплатаЗайм) Тогда 
					ПереплатаРаспределенная = ПереплатаРаспределенная + ВыборкаП.ОплатаЗайм;
				КонецЕсли;	
                Если ЗначениеЗаполнено(ВыборкаП.Возвращено) Тогда 
					ПереплатаРаспределенная = ПереплатаРаспределенная + ВыборкаП.Возвращено;
				КонецЕсли;	
                Если ЗначениеЗаполнено(ВыборкаП.ВДоходы) Тогда 
					ПереплатаРаспределенная = ПереплатаРаспределенная + ВыборкаП.ВДоходы;
				КонецЕсли;	 
			КонецЦикла;	     
			Возврат ПереплатаОстаток - ПереплатаРаспределенная;
		КонецЕсли;	
	КонецЕсли;
	Возврат 0;
КонецФункции	

Функция ПолучитьПредельныйСрокЗаймаДата(ЗалоговыйБилет) Экспорт 
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Регистратор", ЗалоговыйБилет);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилета.ПредельныйСрокЗайма КАК ПредельныйСрокЗайма
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета КАК ЛБ_СостояниеЗалоговогоБилета
	               |ГДЕ
	               |	ЛБ_СостояниеЗалоговогоБилета.Регистратор = &Регистратор"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПредельныйСрокЗайма;
	КонецЕсли;
	Возврат неопределено;
	
КонецФункции	

Функция ПолучитьСостояниеЗБПриОтменеБезналичнойОплаты(ЗалоговыйБилет,  ОтмененныйДокумент) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.Залогодатель КАК Залогодатель,
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.НомерЗалоговогоБилета КАК НомерЗалоговогоБилета,
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СхемаКредитования КАК СхемаКредитования,
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПричинаПрименения КАК ПричинаПрименения,
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета,
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаНачалаРасчетаПроцентов КАК ДатаНачалаРасчетаПроцентов,
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.НомерДопСоглашения КАК НомерДопСоглашения,
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаВыкупа КАК ДатаВыкупа,
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаВыкупаЛьготныйСрок КАК ДатаВыкупаЛьготныйСрок,
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаПроцентовДень КАК СуммаПроцентовДень,
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаПроцентовСрок КАК СуммаПроцентовСрок,
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПредельныйСрокЗайма КАК ПредельныйСрокЗайма,
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПредельныйСрокЗаймаДни КАК ПредельныйСрокЗаймаДни,
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаОстановкиНачислений КАК ДатаОстановкиНачислений,
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&Период, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних";
		 		
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.УстановитьПараметр("Период", Новый Граница(Новый МоментВремени(ОтмененныйДокумент.Дата, ОтмененныйДокумент.Ссылка), ВидГраницы.Исключая)); 

	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат;
	КонецЕсли;

КонецФункции

Функция ПолучитьПроцентнуюСхемуЗБ(ЗалоговыйБилет, ПричинаПрименения) Экспорт
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.УстановитьПараметр("ПричинаПрименения", ПричинаПрименения);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ГрафикПлатежей.ДеньНачалаПрименения КАК ДеньНачалаПрименения,
	               |	ЛБ_ГрафикПлатежей.ВидПроцентнойСтавки КАК ВидПроцентнойСтавки,
	               |	ЛБ_ГрафикПлатежей.ПроцентнаяСтавкаБазовая КАК ПроцентнаяСтавкаБазовая,
	               |	ЛБ_ГрафикПлатежей.ПроцентнаяСтавкаАкция КАК ПроцентнаяСтавкаАкция,
	               |	ЛБ_ГрафикПлатежей.ОтклонениеАкцияОтностельное КАК ОтклонениеАкцияОтностельное,
	               |	ЛБ_ГрафикПлатежей.ОтклонениеАкцияАбсолютное КАК ОтклонениеАкцияАбсолютное
	               |ИЗ
	               |	РегистрСведений.ЛБ_ГрафикПлатежей КАК ЛБ_ГрафикПлатежей
	               |ГДЕ
	               |	ЛБ_ГрафикПлатежей.ЗалоговыйБилет = &ЗалоговыйБилет
	               |	И ЛБ_ГрафикПлатежей.ПричинаПрименения = &ПричинаПрименения
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДеньНачалаПрименения";
	Выборка = Запрос.Выполнить().Выбрать(); 
	Если Выборка.Следующий() Тогда  
		ПроцентнаяСхема = Выборка.ПроцентнаяСтавкаБазовая; 
		Если Выборка.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Акционная Тогда
			Если НЕ Выборка.ПроцентнаяСтавкаАкция = 0 Тогда
				ПроцентнаяСхема = Выборка.ПроцентнаяСтавкаАкция;
			ИначеЕсли НЕ Выборка.ОтклонениеАкцияОтносительное = 0 Тогда	 
				ПроцентнаяСхема = Выборка.ПроцентнаяСтавкаБазовая + Выборка.ПроцентнаяСтавкаБазовая*Выборка.ОтклонениеАкцияОтносительное/100;
			ИначеЕсли НЕ Выборка.ОтклонениеАкцияАбсолютное = 0 Тогда
				ПроцентнаяСхема = Выборка.ПроцентнаяСтавкаБазовая + Выборка.ОтклонениеАкцияАбсолютное;
		    КонецЕсли; 
		КонецЕсли;
        Возврат ПроцентнаяСхема;
	КонецЕсли;
	Возврат 0;
КонецФункции	

Процедура ПеревестиПриказыРежимРаботыВАрхив() Экспорт 
	Если НЕ ЛБ_ОбщийМодуль.ЭтоРабочаяБаза() Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПриказРежимРаботы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЛБ_ПриказРежимРаботы КАК ЛБ_ПриказРежимРаботы
	               |ГДЕ
	               |	НАЧАЛОПЕРИОДА(ЛБ_ПриказРежимРаботы.ДатаОкончания, ДЕНЬ) < &ДатаОкончания
	               |	И ЛБ_ПриказРежимРаботы.Архив = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ДатаОкончания", НачалоДня(ТекущаяДата()));
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Ссылка.ДатаОкончания) Тогда
			Об = Выборка.Ссылка.ПолучитьОбъект(); 
			Об.Архив = Истина;
			Об.Статус = Перечисления.ЛБ_СтатусыПриказовРежимРаботы.Архив;
			Об.Записать();	
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

Функция ПолучитьФИО(Клиент, Дата = неопределено) Экспорт 
	ФИО = "";	
	Запрос = новый Запрос; 
	Запрос.УстановитьПараметр("Клиент" , Клиент); 
	Запрос.УстановитьПараметр("Дата" , ?(Дата = неопределено, ТекущаяДатаСеанса(), Дата));
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество
	               |ИЗ
	               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Клиент) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда   
		ФИО = СокрЛП(Выборка.Фамилия) + " " + СокрЛП(Выборка.Имя) +  ?(НЕ ПустаяСтрока(Выборка.Отчество), " " + СокрЛП(Выборка.Отчество), "");
	КонецЕсли;  
	Возврат ФИО;
КонецФункции	  

Функция ПолучитьСотрудника(Ответственный) Экспорт 
	Если ТипЗнч(Ответственный) = Тип("СправочникСсылка.Пользователи") Тогда
		Возврат Ответственный.Сотрудник;
	ИначеЕсли ТипЗнч(Ответственный) = Тип("СправочникСсылка.ЛБ_Сотрудники") Тогда
		Возврат Ответственный;
	Иначе	
	    Возврат неопределено;
	КонецЕсли;	
КонецФункции	

Функция ПолучитьСписокВыбораСкладовДляПеремещения(ВидПеремещения, Откуда, Куда, Направление, ВидСкладаНаправление) Экспорт
	Если Откуда = Справочники.ЛБ_Ломбарды.ЦентральныйОфис Тогда
	    ДвижениеОткуда = Перечисления.ЛБ_ДвиженияОбъектовЗалога.ЦО;
	Иначе   
		ДвижениеОткуда = Перечисления.ЛБ_ДвиженияОбъектовЗалога.Ломбард;
	КонецЕсли;	
	Если Куда = Справочники.ЛБ_Ломбарды.ЦентральныйОфис Тогда
	    ДвижениеКуда = Перечисления.ЛБ_ДвиженияОбъектовЗалога.ЦО;
	ИначеЕсли ТипЗнч(Куда) = Тип("СправочникСсылка._ДемоКонтрагенты") Тогда
	    ДвижениеКуда = Перечисления.ЛБ_ДвиженияОбъектовЗалога.Контрагент; 
	Иначе	
		ДвижениеКуда = Перечисления.ЛБ_ДвиженияОбъектовЗалога.Ломбард;
	КонецЕсли;	
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("ВидПеремещения", ВидПеремещения);
	Запрос.УстановитьПараметр("Откуда", ДвижениеОткуда);
    Запрос.УстановитьПараметр("Куда", ДвижениеКуда);
	Запрос.Текст = "ВЫБРАТЬ
	                |	ЛБ_ПравилаПеремещенияОбъектовЗалога.ВидСкладаОткуда КАК ВидСкладаОткуда,
	                |	ЛБ_ПравилаПеремещенияОбъектовЗалога.ВидСкладаКуда КАК ВидСкладаКуда
	                |ИЗ
	                |	РегистрСведений.ЛБ_ПравилаПеремещенияОбъектовЗалога КАК ЛБ_ПравилаПеремещенияОбъектовЗалога
	                |ГДЕ
	                |	ЛБ_ПравилаПеремещенияОбъектовЗалога.ВидПеремещения = &ВидПеремещения
	                |	И ЛБ_ПравилаПеремещенияОбъектовЗалога.Откуда = &Откуда
	                |	И ЛБ_ПравилаПеремещенияОбъектовЗалога.Куда = &Куда";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	ВидыСклада = Новый СписокЗначений; 
	СписокСкладов = Новый Массив;
	Если Направление = "Откуда" Тогда
	    Запрос.УстановитьПараметр("Владелец", Откуда);
		Для каждого Стр Из ТаблицаЗапроса Цикл     
			Если ЗначениеЗаполнено(Стр.ВидСкладаОткуда) Тогда 
				Если ЗначениеЗаполнено(ВидСкладаНаправление) Тогда
					Если НЕ ВидСкладаНаправление = Стр.ВидСкладаКуда  Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				Если ВидыСклада.НайтиПоЗначению(Стр.ВидСкладаОткуда) = неопределено Тогда
			        ВидыСклада.Добавить(Стр.ВидСкладаОткуда);
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;	
	Иначе   
		Запрос.УстановитьПараметр("Владелец", Куда);
		Для каждого Стр Из ТаблицаЗапроса Цикл     
			Если ЗначениеЗаполнено(Стр.ВидСкладаКуда) Тогда 
				Если ЗначениеЗаполнено(ВидСкладаНаправление) Тогда
					Если НЕ ВидСкладаНаправление = Стр.ВидСкладаОткуда  Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;	    
				Если ВидыСклада.НайтиПоЗначению(Стр.ВидСкладаКуда) = неопределено Тогда
			        ВидыСклада.Добавить(Стр.ВидСкладаКуда); 
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_Склады.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЛБ_Склады КАК ЛБ_Склады
	               |ГДЕ
	               |	ЛБ_Склады.Владелец = &Владелец
	               |	И ЛБ_Склады.ПометкаУдаления = ЛОЖЬ";
	Если НЕ ВидыСклада.Количество() = 0 Тогда 
		Запрос.Текст = Запрос.Текст + "
	               |	И ЛБ_Склады.ВидСклада В(&ВидыСклада)";  
		Запрос.УстановитьПараметр("ВидыСклада", ВидыСклада);
	КонецЕсли;	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Если СписокСкладов.Найти(Выборка.Ссылка) = неопределено Тогда
		    СписокСкладов.Добавить(Выборка.Ссылка); 
		КонецЕсли;	
	КонецЦикла;	                             
	Возврат СписокСкладов;
КонецФункции	

Функция ПолучитьСклад(Владелец, ВидСклада) Экспорт 
	Запрос = новый Запрос; 
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("ВидСклада", ВидСклада);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_Склады.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЛБ_Склады КАК ЛБ_Склады
	               |ГДЕ
	               |	ЛБ_Склады.Владелец = &Владелец
	               |	И ЛБ_Склады.ВидСклада = &ВидСклада";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда 
		Возврат Выборка.Ссылка;
	КонецЕсли;	               
	Возврат неопределено;
КонецФункции	

Функция ПолучитьСписокВыбораСкладов(Ломбард) Экспорт  
	СписокСкладов = Новый Массив;
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("Владелец", Ломбард);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_Склады.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЛБ_Склады КАК ЛБ_Склады
	               |ГДЕ
	               |	ЛБ_Склады.Владелец = &Владелец
	               |	И ЛБ_Склады.ПометкаУдаления = ЛОЖЬ";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Если СписокСкладов.Найти(Выборка.Ссылка) = неопределено Тогда
		    СписокСкладов.Добавить(Выборка.Ссылка); 
		КонецЕсли;	
	КонецЦикла;	                             
	Возврат СписокСкладов;
КонецФункции	


Процедура РегЗадание_ПересчетРежимовРаботыЛомбардов() Экспорт 
	Если НЕ ЛБ_ОбщийМодуль.ЭтоРабочаяБаза() Тогда
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	ЛБ_Ломбарды.Ссылка КАК Ссылка
	              |ИЗ
	              |	Справочник.ЛБ_Ломбарды КАК ЛБ_Ломбарды
	              |ГДЕ
	              |	ЛБ_Ломбарды.Закрыт = Ложь";
	тзЛомбарды = Запрос.Выполнить().Выгрузить();
	тзЛомбарды.Свернуть("Ссылка");
	МассивЛомб = тзЛомбарды.ВыгрузитьКолонку("Ссылка"); 
	
	ПересчетРежимовРаботыЛомбардов(МассивЛомб, 1000, Истина);
	
КонецПроцедуры

&НаСервере                                                        
Процедура ПересчетРежимовРаботыЛомбардов(СписокЛомбардов, КоличествоДнейРасчета, ОчищатьВсе) Экспорт 
	Если ОчищатьВсе Тогда
		Набор = РегистрыСведений.ЛБ_РабочиеДниЛомбарда.СоздатьНаборЗаписей();
		Набор.Записать();  
	КонецЕсли;
	
	Для каждого Ломбард из СписокЛомбардов Цикл 
		
		Набор = РегистрыСведений.ЛБ_РабочиеДниЛомбарда.СоздатьНаборЗаписей();
		Набор.Отбор.Ломбард.Установить(Ломбард);
		Набор.Записать();
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЛБ_ПриказРежимРаботыРежимРаботы.Ссылка КАК Ссылка,
		|	ЛБ_ПриказРежимРаботыРежимРаботы.Ссылка.Статус КАК Статус,
		|	ЛБ_ПриказРежимРаботыРежимРаботы.Ссылка.ВидПриказа КАК ВидПриказа,
		|	ЛБ_ПриказРежимРаботыРежимРаботы.Ссылка.ДатаНачала КАК ДатаНачала,
		|	ЛБ_ПриказРежимРаботыРежимРаботы.Ссылка.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	Документ.ЛБ_ПриказРежимРаботы.РежимРаботы КАК ЛБ_ПриказРежимРаботыРежимРаботы
		|ГДЕ
		|	ЛБ_ПриказРежимРаботыРежимРаботы.Ломбард = &Ломбард
		|	И ЛБ_ПриказРежимРаботыРежимРаботы.Ссылка.Проведен = Истина
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_ПриказРежимРаботыРежимРаботы.Ссылка.ДатаНачала";
		
		Запрос.УстановитьПараметр("Ломбард", Ломбард); 
		//Запрос.УстановитьПараметр("СтатусПроект", Перечисления.ЛБ_СтатусыПриказовРежимРаботы.Проект);
		
		тзПриказов = запрос.Выполнить().Выгрузить();
		
		Для каждого СтрокаПриказа из тзПриказов Цикл
			Приказ = СтрокаПриказа.Ссылка;

			Если СтрокаПриказа.Ссылка.Проведен Тогда 
				 Если ЗначениеЗаполнено(Приказ.ДатаОкончания) Тогда
					 КоличествоДнейВперед = (НачалоДня(СтрокаПриказа.ДатаОкончания) - НачалоДня(СтрокаПриказа.ДатаНачала))/86400;
				 Иначе
					 КоличествоДнейВперед = КоличествоДнейРасчета; 
				 КонецЕсли;
				
				
				тзЛомбарды = Приказ.РежимРаботы.Выгрузить(,"Ломбард");
				тзЛомбарды.Свернуть("Ломбард");
				
				Для каждого строч из тзЛомбарды Цикл
					Если строч.Ломбард <> Ломбард Тогда
						ПРодолжить;
					КонецЕсли;
					
					отб = Новый Структура;
					отб.Вставить("ломбард", строч.Ломбард);
					НайденныеСтроки = Приказ.РежимРаботы.НайтиСтроки(отб); 
					Для каждого стр из НайденныеСтроки Цикл
						Для инд = 0 по КоличествоДнейВперед Цикл
							ДатаВРегистр = НачалоДня(СтрокаПриказа.ДатаНачала) + 86400*инд; 
							Если ДеньНедели(ДатаВРегистр) = стр.НомерДня Тогда
								
								Движ = РегистрыСведений.ЛБ_РабочиеДниЛомбарда.СоздатьМенеджерЗаписи();
								Движ.Период = ДатаВРегистр;
								Движ.Приказ = Приказ;
								Движ.Выходной = стр.Выходной;
								Движ.Ломбард = стр.Ломбард;
								Движ.ДеньНедели = стр.День;
								Движ.НомерДня = стр.НомерДня;
								Движ.Начало = стр.Начало;
								Движ.Окончание = стр.Окончание;
								Движ.ПерерывНачало = стр.ПерерывНачало;
								Движ.ПерерывОкончание = стр.ПерерывОкончание;
								Движ.РабочиеМинуты = (стр.Окончание - стр.Начало - (стр.ПерерывОкончание - стр.ПерерывНачало))/60; 
								Движ.Записать();
								
							КонецЕсли;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;	
			КонецЕсли;
		КонецЦикла; 
	КонецЦикла;
КонецПроцедуры


Функция ЭтоРабочаяБаза() Экспорт
	
	СтрокаСоединенияРабочейБазы = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СтрокаСоединенияРабочейБазы");
	Если ТипЗнч(СтрокаСоединенияРабочейБазы) <> Тип("Строка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтрокаЭтаБаза		= СокрЛП(НРег(СтрокаСоединенияИнформационнойБазы()));
	СтрокаРабочаяБаза	= СокрЛП(НРег(СтрокаСоединенияРабочейБазы));
	
	Возврат (СтрокаЭтаБаза = СтрокаРабочаяБаза);
	
КонецФункции

Функция СформироватьТехническоеНаименование(Наименование) Экспорт
	
	НаимЗалогодателя = СокрЛП(НРег(Строка(Наименование)));
	
	Если НЕ ПустаяСтрока(НаимЗалогодателя) Тогда
		Если СтрНайти(НаимЗалогодателя, "ё") > 0 Тогда
			НаимЗалогодателя = СтрЗаменить(НаимЗалогодателя, "ё", "е");
		КонецЕсли;

		Если СтрНайти(НаимЗалогодателя, "й") > 0 Тогда
			НаимЗалогодателя = СтрЗаменить(НаимЗалогодателя, "й", "и");
		КонецЕсли;

		Если СтрНайти(НаимЗалогодателя, "ъ") > 0 Тогда
			НаимЗалогодателя = СтрЗаменить(НаимЗалогодателя, "ъ", "ь");
		КонецЕсли;
	КонецЕсли;
	
	Возврат ВРег(НаимЗалогодателя);
КонецФункции

Процедура СнятьСтатусСУволенныхСотрудников() Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КадроваяИсторияСотрудников.Период КАК Период,
	               |	ЛБ_КадроваяИсторияСотрудников.Сотрудник КАК Сотрудник,
	               |	ВложенныйЗапрос.Клиент КАК Клиент
	               |ИЗ
	               |	РегистрСведений.ЛБ_КадроваяИсторияСотрудников КАК ЛБ_КадроваяИсторияСотрудников
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ЛБ_СоответствиеКлиентовИСотрудниковОрганизации.Клиент КАК Клиент,
	               |			ЛБ_СоответствиеКлиентовИСотрудниковОрганизации.Сотрудник КАК Сотрудник
	               |		ИЗ
	               |			РегистрСведений.ЛБ_СоответствиеКлиентовИСотрудниковОрганизации КАК ЛБ_СоответствиеКлиентовИСотрудниковОрганизации) КАК ВложенныйЗапрос
	               |		ПО ЛБ_КадроваяИсторияСотрудников.Сотрудник = ВложенныйЗапрос.Сотрудник
	               |ГДЕ
	               |	ЛБ_КадроваяИсторияСотрудников.ВидСобытия = &ВидСобытия";
	Запрос.УстановитьПараметр("ВидСобытия", Перечисления.ЛБ_ВидыКадровыхСобытий.Увольнение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл  
		Если ЗначениеЗаполнено(Выборка.Клиент) Тогда	
			
			Запрос2 = Новый Запрос;
			Запрос2.Текст = "ВЫБРАТЬ
			                |	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Период КАК Период,
			                |	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель КАК Залогодатель,
			                |	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус
			                |ИЗ
			                |	РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(&НаДату, Залогодатель = &Клиент) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних
			                |ГДЕ
			                |	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус = &Статус
			                |	И ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Используется = Истина";
			Запрос2.УстановитьПараметр("НаДату", Выборка.Период + 10);
			Запрос2.УстановитьПараметр("Клиент", Выборка.Клиент);
			Запрос2.УстановитьПараметр("Статус", Справочники.ЛБ_СтатусыЗалогодателей.Сотрудник);
			
			Выборка2 = Запрос2.Выполнить().Выбрать();
			Если Выборка2.Следующий() Тогда  
				
				ЗапросКарт = Новый Запрос;
				ЗапросКарт.Текст ="ВЫБРАТЬ ПЕРВЫЕ 1
				                  |	ЛБ_КарточкаЗалогодателя.Ссылка КАК Ссылка
				                  |ИЗ
				                  |	Документ.ЛБ_КарточкаЗалогодателя КАК ЛБ_КарточкаЗалогодателя
				                  |ГДЕ
				                  |	ЛБ_КарточкаЗалогодателя.Залогодатель = &Залогодатель
				                  |
				                  |УПОРЯДОЧИТЬ ПО
				                  |	ЛБ_КарточкаЗалогодателя.Дата УБЫВ";
				ЗапросКарт.УстановитьПараметр("Залогодатель", Выборка.Клиент);
				ВыборкаКарт = ЗапросКарт.Выполнить().Выбрать();
				Если ВыборкаКарт.Следующий() Тогда 
					НовДок = Документы.ЛБ_КарточкаЗалогодателя.СоздатьДокумент();
					ЗаполнитьЗначенияСвойств(НовДок, ВыборкаКарт.Ссылка,,"Номер");
					НовДок.Дата = Выборка.Период + 1;
					
					Для каждого стр из ВыборкаКарт.Ссылка.ДокументыЗалогодателя Цикл
						НовСтр = НовДок.ДокументыЗалогодателя.Добавить();
						ЗаполнитьЗначенияСвойств(НовСтр, стр);
					КонецЦикла;
					Для каждого стр из ВыборкаКарт.Ссылка.Бенефициары Цикл
						НовСтр = НовДок.Бенефициары.Добавить();
						ЗаполнитьЗначенияСвойств(НовСтр, стр);
					КонецЦикла;
					Для каждого стр из ВыборкаКарт.Ссылка.ОтказыКлиентам Цикл
						НовСтр = НовДок.ОтказыКлиентам.Добавить();
						ЗаполнитьЗначенияСвойств(НовСтр, стр);
					КонецЦикла;
					Для каждого стр из ВыборкаКарт.Ссылка.СлужебныеСтатусы Цикл
						НовСтр = НовДок.СлужебныеСтатусы.Добавить();
						ЗаполнитьЗначенияСвойств(НовСтр, стр);
					КонецЦикла; 
					
					Для каждого стр из ВыборкаКарт.Ссылка.ДополнительныеСтатусы Цикл
						НовСтр = НовДок.ДополнительныеСтатусы.Добавить();
						ЗаполнитьЗначенияСвойств(НовСтр, стр);
						Если НовСтр.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Сотрудник Тогда
							НовСтр.Используется = Ложь;
							НовСтр.Комментарий = "увольнение";
						КонецЕсли;
					КонецЦикла; 	
					НовДок.ПричинаИзменения = Справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.СнятиеСтатусаСотрудник;
					
					НовДок.Записать();
					НовДок.Записать(РежимЗаписиДокумента.Проведение);
					
					//
					//Если НовДок.Проведен Тогда
					//	НаборЗаписей = РегистрыСведений.ЛБ_СтатусыЗалогодателейДополнительные.СоздатьНаборЗаписей();
					//	НаборЗаписей.Отбор.Регистратор.Установить(НовДок.Ссылка);
					//	НаборЗаписей.Отбор.Статус.Установить(Справочники.ЛБ_СтатусыЗалогодателей.Сотрудник);
					//	НаборЗаписей.Прочитать();
					//	
					//	
					//	НаборЗаписей.Записывать = Истина;
					//	
					//	
					//	Движение3 = НаборЗаписей.Добавить();
					//	Движение3.Регистратор = Док.Ссылка;
					//	Движение3.Залогодатель = Док.Залогодатель;
					//	Движение3.Период = Док.Дата;
					//	Движение3.Комментарий = "Загружен из Эликс";
					//	Движение3.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Сотрудник;
					//	Движение3.Используется = Ложь;
					//			
					//		
					//	КонецЕсли;
					//КонецЕсли;
									
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	
КонецПроцедуры

Функция ПолучитьСписокЗБКлиента(Клиент, ЗалоговыйБилет = неопределено) Экспорт  
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Залогодатель", Клиент);
	СписокВидовОпераций = Новый СписокЗначений;
	СписокВидовОпераций.Добавить(Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог);
	СписокВидовОпераций.Добавить(Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление);
	Запрос.УстановитьПараметр("СписокВидовОпераций", СписокВидовОпераций);  
	СписокСтатусов = Новый СписокЗначений;
	СписокСтатусов.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтказОтОформления);
    СписокСтатусов.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Реализован); 
	СписокСтатусов.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт);	
	Запрос.УстановитьПараметр("СписокСтатусов", СписокСтатусов);
	Если ЗалоговыйБилет = неопределено Тогда 
		УсловиеОтбора = "   Залогодатель = &Залогодатель И ЗалоговыйБилет.ВидОперации В (&СписокВидовОпераций)"
	Иначе	
	    Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
		УсловиеОтбора = "   ЗалоговыйБилет = &ЗалоговыйБилет";
	КонецЕсли;	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет.Ломбард КАК Ломбард,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПричинаПрименения КАК ПричинаПрименения,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СхемаКредитования КАК СхемаКредитования,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаВыкупа КАК ДатаВыкупа,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаВыкупаЛьготныйСрок КАК ДатаВыкупаЛьготныйСрок,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаНачалаРасчетаПроцентов КАК ДатаНачалаРасчетаПроцентов,
	               |	ВЫБОР
	               |		КОГДА ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета В (&СписокСтатусов)
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК Действующий
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(
	               |			,
	               |";  
	Запрос.Текст = Запрос.Текст + УсловиеОтбора + ") КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.Период УБЫВ";
	
	Возврат Запрос.Выполнить().Выгрузить();                       
КонецФункции	

Функция ПолучитьДействующиеПриказы(Ломбард) Экспорт 
	СписокПриказов = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаПроверки", ТекущаяДатаСеанса()); 
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.Регистратор КАК Регистратор,
	               |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.СхемаКредитования КАК СхемаКредитования
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПрейскурантПроцентныхСтавок.СрезПоследних(
	               |			,
	               |			Ломбард = &Ломбард
	               |				И ДатаНачалаДействия <= &ДатаПроверки) КАК ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.Период УБЫВ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	ТаблицаСК = ТаблицаЗапроса.Скопировать(); 
	ТаблицаСК.Свернуть("СхемаКредитования");
	Для каждого Стр Из ТаблицаСК Цикл  
		Отбор = Новый Структура;
		Отбор.Вставить("СхемаКредитования", Стр.СхемаКредитования);
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);  
		Если НЕ Строки.Количество() = 0 Тогда 
			Регистратор = Строки.Получить(0).Регистратор;
			Если СписокПриказов.НайтиПоЗначению(Регистратор) = неопределено Тогда  
				СписокПриказов.Добавить(Регистратор);
			КонецЕсли;	
		КонецЕсли;	
	Конеццикла;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних.Регистратор КАК Регистратор,
	               |	ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних.Ломбард КАК Ломбард
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПрейскурантЦенНаМеталлы.СрезПоследних(
	               |			,
	               |			Ломбард = &Ломбард
	               |				И ДатаНачалаДействия <= &ДатаПроверки) КАК ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних.Период УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();    
	Если Выборка.Следующий() Тогда  
		СписокПриказов.Добавить(Выборка.Регистратор);
	КонецЕсли;	     
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.Регистратор КАК Регистратор,
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.Ломбард КАК Ломбард
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПрейскурантЦенНаДрагоценныеКамни.СрезПоследних(
	               |			,
	               |			Ломбард = &Ломбард
	               |				И ДатаНачалаДействия <= &ДатаПроверки) КАК ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.Период УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();    
	Если Выборка.Следующий() Тогда  
		СписокПриказов.Добавить(Выборка.Регистратор);
	КонецЕсли;	     

	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_АкцииПроцентныеСтавкиСрезПоследних.Регистратор КАК Регистратор,
	               |	ЛБ_АкцииПроцентныеСтавкиСрезПоследних.СхемаКредитования КАК СхемаКредитования,
	               |	ЛБ_АкцииПроцентныеСтавкиСрезПоследних.Акция КАК Акция
	               |ИЗ
	               |	РегистрСведений.ЛБ_АкцииПроцентныеСтавки.СрезПоследних(
	               |			,
	               |			Ломбард = &Ломбард
	               |				И ДатаНачалаДействия <= &ДатаПроверки
	               |				И ДатаОкончанияДействия >= &ДатаПроверки) КАК ЛБ_АкцииПроцентныеСтавкиСрезПоследних";  
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	ТаблицаСК = ТаблицаЗапроса.Скопировать(); 
	ТаблицаСК.Свернуть("Акция, СхемаКредитования");
	Для каждого Стр Из ТаблицаСК Цикл  
		Отбор = Новый Структура;
		Отбор.Вставить("СхемаКредитования", Стр.СхемаКредитования);
		Отбор.Вставить("Акция", Стр.Акция);
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);  
		Если НЕ Строки.Количество() = 0 Тогда 
			Регистратор = Строки.Получить(0).Регистратор;
			Если СписокПриказов.НайтиПоЗначению(Регистратор) = неопределено Тогда  
				СписокПриказов.Добавить(Регистратор);
			КонецЕсли;	
		КонецЕсли;	
	Конеццикла;
	
	Возврат  СписокПриказов;
КонецФункции

Функция ТекущийПользователь_ЭтоЛомбард() Экспорт
	Возврат ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард;	
КонецФункции

Функция ПроверитьПриказыВЗБ(Приказ) Экспорт
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Приказ", Приказ);
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(*) КАК Количество
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПриказыВОперацияхЗайма КАК ЛБ_ПриказыВОперацияхЗайма
	               |ГДЕ
	               |	ЛБ_ПриказыВОперацияхЗайма.Приказ = &Приказ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Количество;
	КонецЕсли;
	Возврат 0;
КонецФункции	

Функция ПолучитьПриказыПоПроценымСтавкамВЗБ(ЗалоговыйБилет, ВИП = Ложь) Экспорт 
	СписокПриказов = Новый СписокЗначений;  
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Регистратор", ЗалоговыйБилет); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПриказыВОперацияхЗайма.ВидПриказа КАК ВидПриказа,
	               |	ЛБ_ПриказыВОперацияхЗайма.Приказ КАК Приказ,
	               |	ЛБ_ПриказыВОперацияхЗайма.ОтклонениеПоАкции КАК ОтклонениеПоАкции
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПриказыВОперацияхЗайма КАК ЛБ_ПриказыВОперацияхЗайма
	               |ГДЕ
	               |	ЛБ_ПриказыВОперацияхЗайма.Регистратор = &Регистратор
	               |	И ЛБ_ПриказыВОперацияхЗайма.Установить = ЗНАЧЕНИЕ(Перечисление.ЛБ_УстановитьВПриказе.Ставки)";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();    
	
	Если ВИП Тогда 
		Отбор = Новый Структура;
		Отбор.Вставить("ВидПриказа", Перечисления.ЛБ_ВидыОперацийПриказы.ВИП);
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
		Если НЕ Строки.Количество() = 0 Тогда
			Стр = Строки.Получить(0);
			СписокПриказов.Добавить(Стр.Приказ);
			ДобавитьБазовыйПриказ = Истина;
		КонецЕсли;	                       
	Иначе	
		ДобавитьБазовыйПриказ = Ложь;
		Отбор = Новый Структура;
		Отбор.Вставить("ВидПриказа", Перечисления.ЛБ_ВидыОперацийПриказы.Акция);
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
		Если НЕ Строки.Количество() = 0 Тогда
			Стр = Строки.Получить(0);
			СписокПриказов.Добавить(Стр.Приказ);
			Если Стр.ОтклонениеПоАкции Тогда 
				ДобавитьБазовыйПриказ = Истина;
			КонецЕсли; 
		Иначе
			ДобавитьБазовыйПриказ = Истина;
		КонецЕсли;	                       
		Если ДобавитьБазовыйПриказ Тогда
			Отбор = Новый Структура;
			Отбор.Вставить("ВидПриказа", Перечисления.ЛБ_ВидыОперацийПриказы.Базовый);
			Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
		    Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
			Если НЕ Строки.Количество() = 0 Тогда
				Стр = Строки.Получить(0);
				СписокПриказов.Добавить(Стр.Приказ);
	        КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	Возврат СписокПриказов;
КонецФункции	
	