&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Дата") тогда
		ДатаЗБ = Параметры.Дата;
	КонецЕсли;
	Если Параметры.Свойство("Залогодатель") тогда
		Залогодатель = Параметры.Залогодатель;
	КонецЕсли;
	Если НЕ Параметры.ТолькоПросмотр = неопределено тогда 
		ЭтаФорма.ТолькоПросмотр = Параметры.ТолькоПросмотр; 
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Объект.Ссылка) тогда  
		СсылкаНаКартинку = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"Картинка"); 
	Иначе
		Объект.Наименование = СокрЛП(Залогодатель) + " " + ?(ДатаЗБ = Дата(1,1,1), Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy"), Формат(ДатаЗБ, "ДФ=dd.MM.yyyy"));
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКартинку()
	Режим = РежимДиалогаВыбораФайла.Открытие; 
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.ПолноеИмяФайла = "";  
	Фильтр = "JPG (*.jpg)|*.jpg|JPEG (*.jpeg)|*.jepg|PNG (*.png)|*.png";
	ДиалогОткрытия.Фильтр = Фильтр; 
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберете файл этикетки"; 
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиФайла",ЭтаФорма); 
	ДиалогОткрытия.Показать(ОписаниеОповещения);
КонецПроцедуры
	
&НаКлиенте
Процедура СсылкаНаКартинкуНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбратьКартинку();
КонецПроцедуры 

&НаКлиенте 
//Процедура ПослеЗагрузкиФайла(ВыбранныйФайл,ДопПараметр) Экспорт 
//	Если ВыбранныйФайл = Неопределено Тогда 
//		Возврат; 
//	КонецЕсли; 
//	ИмяФайла = ВыбранныйФайл[0];
//	Картинка0 = Новый Картинка(ИмяФайла);  
//	Идентификатор  = Новый УникальныйИдентификатор;	
//	СсылкаНаКартинку = ПоместитьВоВременноеХранилище(Картинка0, Идентификатор); 
//КонецПроцедуры                          
Процедура ПослеЗагрузкиФайла(ВыбранныйФайл,ДопПараметр) Экспорт 
	Если ВыбранныйФайл = Неопределено Тогда 
		Возврат; 
	КонецЕсли; 
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПомещенияФайла", ЭтаФорма); 
	НачатьПомещениеФайла(ОписаниеОповещения,, ВыбранныйФайл[0], Ложь, УникальныйИдентификатор); 
КонецПроцедуры 

&НаКлиенте 
Процедура ПослеПомещенияФайла(Результат, Адрес, ВыбранноеИмяФайла,ДопПараметры) Экспорт 
	Если Не Результат Тогда 
		Возврат; 
	КонецЕсли; 
	СсылкаНаКартинку = Адрес; 
	Модифицированность = Истина; 
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияДобавитьСканНажатие(Элемент)
	ВыбратьКартинку();
КонецПроцедуры   

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) 
	Если ЭтоАдресВременногоХранилища(СсылкаНаКартинку)  Тогда 
		ФайлКартинки = ПолучитьИзВременногоХранилища(СсылкаНаКартинку); 
		ТекущийОбъект.Картинка = Новый ХранилищеЗначения(ФайлКартинки); 
		УдалитьИзВременногоХранилища(СсылкаНаКартинку); 
		СсылкаНаКартинку = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"Картинка"); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Закрыть(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры




