
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Вид") Тогда
		Вид = Параметры.Вид;
	КонецЕсли;    
	Если Параметры.Свойство("Металл") Тогда 
		Металл = Параметры.Металл; 		
	КонецЕсли;     
	Если Параметры.Свойство("СписокП") Тогда 
		СписокП = Параметры.СписокП; 
	Иначе
		СписокП = Новый СписокЗначений;
	КонецЕсли;	
	Если Параметры.Свойство("СписокК") Тогда 
		СписокК = Параметры.СписокК; 
	Иначе
		СписокК = Новый СписокЗначений;
	КонецЕсли;		
	Если Параметры.Свойство("ВидОтклонения") Тогда 
		ВидОтклонения = Параметры.ВидОтклонения; 
	Иначе
		ВидОтклонения = Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Относительное;
	КонецЕсли;    
	ЗаполнитьСписокПроб(СписокП);
	ЗаполнитьСписокКатегорий(СписокК);
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	СтруктураВозврата = Новый структура; 
	Если НЕ Вид = 0 Тогда  
		СтруктураВозврата.Вставить("СхемаКредитования", СхемаКредитования); 
	КонецЕсли;	
	СтруктураВозврата.Вставить("Металл", Металл);
	СписокПробаРезультат = Новый СписокЗначений;
	Для каждого Проба Из СписокПроба Цикл   
		Если Проба.Пометка тогда 
			СписокПробаРезультат.Добавить(Проба.Значение);
		КонецЕсли;	
	КонецЦикла;	
	СтруктураВозврата.Вставить("Проба", СписокПробаРезультат);
	
	СписокКатегорияРезультат = Новый СписокЗначений;
	Для каждого Категория Из СписокКатегория Цикл   
		Если Категория.Пометка тогда 
			СписокКатегорияРезультат.Добавить(Категория.Значение);
		КонецЕсли;	
	КонецЦикла;	
	СтруктураВозврата.Вставить("Категория", СписокКатегорияРезультат);
	СтруктураВозврата.Вставить("Отклонение", Отклонение);  
	СтруктураВозврата.Вставить("ВидОтклонения", ВидОтклонения);  
	
	Если Вид = 0 Тогда
		Если СписокПробаРезультат.Количество() = 0 Или СписокКатегорияРезультат.Количество() = 0 Тогда    
			Предупреждение("Необходимо выбрать группы проб и категории", 60);
			Возврат;
		КонецЕсли;	
	КонецЕсли;	
	
	Этаформа.Закрыть(СтруктураВозврата);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Этаформа.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	Если Вид = 0 Тогда
		Элементы.СхемаКредитования.Видимость = Ложь;
	Иначе   
		Элементы.СхемаКредитования.Видимость = Истина;
	КонецЕсли;
	Если ВидОтклонения = ПредопределенноеЗначение("Перечисление.ЛБ_ОтклонениеОтБазовойЦены.Абсолютное") Тогда
		Элементы.Отклонение.Заголовок = "Значение откл. (руб.)";
	Иначе 
		Элементы.Отклонение.Заголовок = "Значение откл. (%)";
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ВидОтлоненияПриИзменении(Элемент)
	УстановитьВидимость()
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокПроб(СписокП) 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Металл", Металл);
	Запрос.УстановитьПараметр("Пробы", СписокП);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЛБ_ГруппыПробПробы.Ссылка КАК Проба
	               |ИЗ
	               |	Справочник.ЛБ_ГруппыПроб.Пробы КАК ЛБ_ГруппыПробПробы
	               |ГДЕ
	               |	ЛБ_ГруппыПробПробы.Ссылка.Металл = &Металл
	               |	И ЛБ_ГруппыПробПробы.Проба В(&Пробы)
	               |	И ЛБ_ГруппыПробПробы.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |АВТОУПОРЯДОЧИВАНИЕ";
	Выборка = Запрос.Выполнить().Выбрать();
	СписокПроба.Очистить();
	Пока Выборка.Следующий() цикл 
		СписокПроба.Добавить(Выборка.проба);
	КонецЦикла	
КонецПроцедуры

&НаКлиенте
Процедура ПробаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;    
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", "Выберите группы проб"); 
	ПараметрыФормы.Вставить("Список", СписокПроба); 
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораПроб", ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаВыбораИзСписка", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	 
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВыбораПроб(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;   
	
	СтрокаПроба = "";
	СписокПроба = Результат; 
    Для Каждого Проба Из Результат Цикл
        Если Проба.Пометка Тогда
            СтрокаПроба = СтрокаПроба + ?(ПустаяСтрока(СтрокаПроба), "", "; ") + СокрЛП(Проба.Значение);
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокКатегорий(СписокК) 
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Категории", СписокК);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КатегорииОбъектовЗалога.Ссылка КАК Категория
	               |ИЗ
	               |	Справочник.ЛБ_КатегорииОбъектовЗалога КАК ЛБ_КатегорииОбъектовЗалога
	               |ГДЕ
	               |	ЛБ_КатегорииОбъектовЗалога.ПометкаУдаления = ЛОЖЬ
	               |	И ЛБ_КатегорииОбъектовЗалога.Ссылка В(&Категории)
	               |АВТОУПОРЯДОЧИВАНИЕ";
	Выборка = Запрос.Выполнить().Выбрать();
	СписокКатегория.Очистить();
	Пока Выборка.Следующий() цикл 
		СписокКатегория.Добавить(Выборка.Категория);
	КонецЦикла	
КонецПроцедуры

&НаКлиенте
Процедура КатегорияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;  
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", "Выберите категории"); 
	ПараметрыФормы.Вставить("Список", СписокКатегория); 
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораКатегорий", ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаВыбораИзСписка", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры   

&НаКлиенте
Процедура ПослеВыбораКатегорий(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;   
 
	СтрокаКатегория = "";  
	СписокКатегория = Результат;
    Для Каждого Категория Из Результат Цикл
        Если Категория.Пометка Тогда
            СтрокаКатегория = СтрокаКатегория + ?(ПустаяСтрока(СтрокаКатегория), "", "; ") + СокрЛП(Категория.Значение);
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры

