&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	ОсновнаяЕдиницаИзмерения = Константы.ЛБ_ОсновнаяЕдиницаМеталлы.Получить();
	//ЗаполнитьВыборЕдиницИзмерения(); 
	
	ОсновнаяЕдиницаИзмеренияВставки = Константы.ЛБ_ОсновнаяЕдиницаКамни.Получить();
	ЗаполнитьВыборЕдиницИзмеренияВставки();  
	
	ЗапросБазовыеЦены = Новый Запрос;
	ЗапросБазовыеЦены.Текст = "ВЫБРАТЬ
	                          |	ЛБ_БазовыеЦеныНаДрагоценныеМеталлы.Период КАК Период,
	                          |	ЛБ_БазовыеЦеныНаДрагоценныеМеталлы.Проба КАК Проба,
	                          |	ЛБ_БазовыеЦеныНаДрагоценныеМеталлы.КатегорияОбъектаЗалога КАК Категория
	                          |ИЗ
	                          |	РегистрСведений.ЛБ_БазовыеЦеныНаДрагоценныеМеталлы КАК ЛБ_БазовыеЦеныНаДрагоценныеМеталлы
	                          |
	                          |УПОРЯДОЧИТЬ ПО
	                          |	Период";
	ТаблицаБазовыеЦены.Загрузить(ЗапросБазовыеЦены.Выполнить().Выгрузить());
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ЛБ_ДиапазоныСуммЗайма.Ссылка КАК Ссылка
	//               |ИЗ
	//               |	Справочник.ЛБ_ДиапазоныСуммЗайма КАК ЛБ_ДиапазоныСуммЗайма
	//               |ГДЕ
	//               |	ЛБ_ДиапазоныСуммЗайма.ЭтоГруппа = ЛОЖЬ
	//               |	И ЛБ_ДиапазоныСуммЗайма.ПометкаУдаления = ЛОЖЬ
	//               |
	//               |УПОРЯДОЧИТЬ ПО
	//               |	ЛБ_ДиапазоныСуммЗайма.ПорядокСортировки";
	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//    Элементы.ТаблицаСтавокДиапазонСумм.СписокВыбора.Добавить(Выборка.Ссылка); 
	//	Элементы.ТаблицаСтавокАкцииДиапазонСумм.СписокВыбора.Добавить(Выборка.Ссылка);
	//КонецЦикла;	

	КонПериода = ТекущаяДата(); 
	НачПериода = НачалоДня(ДобавитьМесяц(КонПериода, -2));  
	Период = Новый СтандартныйПериод(НачПериода, КонПериода);
	ЭтаФорма.Заголовок = "Журнал приказов по залогодателям " + ПредставлениеПериода(Период.ДатаНачала, Период.ДатаОкончания);

	ЗаполнитьТаблицуПриказов();
	ЗаполнитьПараметрыПечати();
	//ЗаполнитьДеревоЛомбардов(); 
	
	//Элементы.СпособВыводаЛомбардовНаПечать.СписокВыбора.Очистить();  
	//Элементы.СпособВыводаЛомбардовНаПечать.СписокВыбора.Добавить(0, "по ломбардам"); 
	//Элементы.СпособВыводаЛомбардовНаПечать.СписокВыбора.Добавить(1, "по отделениям ломбардов");
	//
	//СпособВыводаЛомбардовНаПечать = ТекущийПриказ.ВыводитьЛомбарды; 
	ЕстьПолныеПрава = ?(РольДоступна("Администрирование"), Истина, Ложь);
	
	Если Параметры.Свойство("Документ") Тогда
		ВыборНомерПриказа = Параметры.Документ.НомерПриказа;
		//ПанельПоискаЗалогодателя(Истина);
		ЗаполнитьТаблицуПриказов();
		Элементы.ГруппаОтбор.Видимость = Истина;
		Элементы.ПанельПоискаЗалогодателя.Пометка = Истина;  
		Элементы.ПанельПоискаЗалогодателя.ЦветФона = WebЦвета.БледноЗеленый;
	КонецЕсли;
	
	//+МАН 03.07.25
	//Изменил
	Если ТекущийПриказ.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП Тогда
		//Добавил
		Элементы.ГруппаЗалогодатели.Видимость = Ложь;
		Элементы.СтрокаСК.Видимость = Ложь;
		Элементы.ГруппаЦеныМеталлы.Видимость = Ложь;
		Элементы.ГруппаЦеныВставки.Видимость = Ложь;
		Элементы.ГруппаСтавки.Видимость = Ложь;
		
		//Убрал
		//Элементы.ГруппаПриказа.Видимость = Ложь;
		//
		Элементы.ГруппаОтменыПриказа.Видимость = Истина;
	Иначе 
		//Добавил
		Элементы.ГруппаЗалогодатели.Видимость = Истина;
		Элементы.СтрокаСК.Видимость = Истина;
		Элементы.ГруппаЦеныМеталлы.Видимость = Истина;
		Элементы.ГруппаЦеныВставки.Видимость = Истина;
		Элементы.ГруппаСтавки.Видимость = Истина;
		
		//Убрал
		//Элементы.ГруппаПриказа.Видимость = Истина;
		//
		Элементы.ГруппаОтменыПриказа.Видимость = Ложь;
	КонецЕсли;
	//-МАН
	
КонецПроцедуры 


&НаКлиенте
Процедура УстановитьВидимость()
	//Если ТекущийПриказ.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.ВИП") Тогда 		
	//	Элементы.ГруппаЦеныМеталлы.Видимость = Истина;  
	//	Элементы.ГруппаЦеныВставки.Видимость = Истина;
	//	Элементы.ГруппаСтавки.Видимость = Истина; 
	//	//Элементы.ГруппаАкцииМеталлы.Видимость = ложь; 
	//	//Элементы.ГруппаАкцииСтавки.Видимость = ложь; 
	//	//Элементы.ГруппаАкция.Видимость = ложь;
	//	Элементы.ГруппаСК.Видимость = Истина; 
	//	Элементы.ТекущийПриказНачальникОДО.Видимость = Истина;
	//	Элементы.ТекущийПриказНачальникОРБ.Видимость = Истина;
	//	Элементы.ТекущийПриказОтветственноеЛицоОРБ.Видимость = Ложь;
	//	Элементы.ТекущийПриказОтветственноеЛицоРеклама.Видимость = Ложь;
	//	Элементы.ТекущийПриказПодписантДолжность.Видимость = Ложь;
	//	Элементы.ТекущийПриказПодписантФИО.Видимость = Ложь;
	//	Элементы.СпособВыводаЛомбардовНаПечать.Видимость = Ложь; 
	//	Элементы.ТекущийПриказНеВыводитьНаПечатьПричиныПрименения.Видимость = Истина;
	//Иначе 
	//	Элементы.ГруппаЦеныМеталлы.Видимость = ложь;  
	//	Элементы.ГруппаЦеныВставки.Видимость = ложь;
	//	Элементы.ГруппаСтавки.Видимость = ложь; 
	//	//Элементы.ГруппаАкцииМеталлы.Видимость = Истина; 
	//	//Элементы.ГруппаАкцииСтавки.Видимость = Истина;  
	//	//Элементы.ГруппаАкция.Видимость = Истина;
	//	Элементы.ГруппаСК.Видимость = ложь;  
	//	Элементы.ТекущийПриказНачальникОДО.Видимость = Ложь;
	//	Элементы.ТекущийПриказНачальникОРБ.Видимость = Истина; 
	//	Элементы.ТекущийПриказОтветственноеЛицоОРБ.Видимость = Истина;
	//	Элементы.ТекущийПриказОтветственноеЛицоРеклама.Видимость = Истина;
	//	Элементы.ТекущийПриказПодписантДолжность.Видимость = Истина;
	//	Элементы.ТекущийПриказПодписантФИО.Видимость = Истина;
	//	Элементы.СпособВыводаЛомбардовНаПечать.Видимость = Истина;  
	//	Элементы.ТекущийПриказНеВыводитьНаПечатьПричиныПрименения.Видимость = Ложь;
	//КонецЕсли;
	
	Если ТекущийПриказ.Проведен ИЛИ ТекущийПриказ.ПометкаУдаления Тогда
		Элементы.ТаблицаПриказовКнопкаОтменитьПроведение.Доступность = Истина;
		Элементы.СценарийОценкиМеталлов.ТолькоПросмотр = Истина;
		Элементы.ТекущийПриказНачальникОДО.ТолькоПросмотр = Истина;
		Элементы.ТекущийПриказНачальникОРБ.ТолькоПросмотр = Истина;
		Элементы.ТекущийПриказОтветственноеЛицоОРБ.ТолькоПросмотр = Истина;
		//Элементы.ТекущийПриказОтветственноеЛицоРеклама.ТолькоПросмотр = Истина;
		//Элементы.ТекущийПриказПодписантДолжность.ТолькоПросмотр = Истина;
		Элементы.ТекущийПриказПодписантФИО.ТолькоПросмотр = Истина;
		//Элементы.СпособВыводаЛомбардовНаПечать.ТолькоПросмотр = Истина;
		Элементы.ТекущийПриказНеВыводитьНаПечатьПричиныПрименения.ТолькоПросмотр = Истина;
		Элементы.СтрокаЗалогодатели.ТолькоПросмотр = Истина;
		Элементы.ТаблицаОтклоненийОтБазовыхЦенМеталлыЗаполнитьОтклоненияМеталлов.Доступность = Ложь;
		Элементы.ТекущийПриказЦеныВставкиГруппаЗаполнить.ТолькоПросмотр = Истина;
		Элементы.ТаблицаОтклоненийОтБазовыхЦенВставки.ТолькоПросмотр = Истина;
		Элементы.ЗаполнитьПриказОтмены.Доступность = Ложь;
		Элементы.Комментарий.ТолькоПросмотр = Истина;
		Элементы.ТекущийПриказНомерПриказа.ТолькоПросмотр = Истина;
		Элементы.ТекущийПриказДата.ТолькоПросмотр = Истина;
		Элементы.ТекущийПриказДатаНачалаДействияПриказа.ТолькоПросмотр = Истина;
		Элементы.ТекущийПриказДатаОкончанияДействияПриказа.ТолькоПросмотр = Истина;
		Элементы.ТекущийПриказОснованиеПриказа.ТолькоПросмотр = Истина;
		//+МАН 12.08.25
		Если ТекущийПриказ.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП") Тогда
			Элементы.ТаблицаПриказовЗБПоПриказу.Доступность = Ложь;
		Иначе
			Элементы.ТаблицаПриказовЗБПоПриказу.Доступность = Истина;
		КонецЕсли;
		//-МАН
	Иначе
		Элементы.ТаблицаПриказовКнопкаОтменитьПроведение.Доступность = ложь;
		Элементы.СценарийОценкиМеталлов.ТолькоПросмотр = Ложь;
		Элементы.ТекущийПриказНачальникОДО.ТолькоПросмотр = Ложь;
		Элементы.ТекущийПриказНачальникОРБ.ТолькоПросмотр = Ложь;
		Элементы.ТекущийПриказОтветственноеЛицоОРБ.ТолькоПросмотр = Ложь;
		//Элементы.ТекущийПриказОтветственноеЛицоРеклама.ТолькоПросмотр = Ложь;
		//Элементы.ТекущийПриказПодписантДолжность.ТолькоПросмотр = Ложь;
		Элементы.ТекущийПриказПодписантФИО.ТолькоПросмотр = Ложь;
		//Элементы.СпособВыводаЛомбардовНаПечать.ТолькоПросмотр = Ложь;
        Элементы.ТекущийПриказНеВыводитьНаПечатьПричиныПрименения.ТолькоПросмотр = Ложь;
		Элементы.СтрокаЗалогодатели.ТолькоПросмотр = Ложь;
		Элементы.ТаблицаОтклоненийОтБазовыхЦенМеталлыЗаполнитьОтклоненияМеталлов.Доступность = Истина;
		Элементы.ТекущийПриказЦеныВставкиГруппаЗаполнить.ТолькоПросмотр = Ложь;
		Элементы.ТаблицаОтклоненийОтБазовыхЦенВставки.ТолькоПросмотр = Ложь;
		Элементы.ЗаполнитьПриказОтмены.Доступность = Истина;
		Элементы.Комментарий.ТолькоПросмотр = Ложь;
		Элементы.ТекущийПриказНомерПриказа.ТолькоПросмотр = Ложь;
		Элементы.ТекущийПриказДата.ТолькоПросмотр = Ложь;
		Элементы.ТекущийПриказДатаНачалаДействияПриказа.ТолькоПросмотр = Ложь;
		Элементы.ТекущийПриказДатаОкончанияДействияПриказа.ТолькоПросмотр = Ложь;
		Элементы.ТекущийПриказОснованиеПриказа.ТолькоПросмотр = Ложь;
		//+МАН 12.08.25
		Элементы.ТаблицаПриказовЗБПоПриказу.Доступность = Ложь;
		//-МАН
	КонецЕсли;
	
	Если ТекущийПриказ.ПометкаУдаления Тогда
		Если НачалоДня(ТекущаяДата()) > НачалоДня(ТекущийПриказ.Дата + 86400) Тогда
			Элементы.ТаблицаПриказовКнопкаУдалить.Доступность = Ложь;
		Иначе
			Элементы.ТаблицаПриказовКнопкаУдалить.Доступность = Истина;
		КонецЕсли;
	Иначе
		Элементы.ТаблицаПриказовКнопкаУдалить.Доступность = Истина;
	КонецЕсли;

	Если ТекущийПриказ.Проведен Тогда
		Элементы.ТаблицаПриказовКнопкаОтменитьПроведение.Доступность = Истина;
		Элементы.КнопкаВвестиПриказВДействие.Доступность = Ложь;
	ИначеЕсли ТекущийПриказ.ПометкаУдаления  Тогда
		Элементы.ТаблицаПриказовКнопкаОтменитьПроведение.Доступность = Ложь;
		Элементы.КнопкаВвестиПриказВДействие.Доступность = Ложь;
	Иначе
		Элементы.ТаблицаПриказовКнопкаОтменитьПроведение.Доступность = Ложь;
		Элементы.КнопкаВвестиПриказВДействие.Доступность = Истина;
	КонецЕсли;

	Если ТекущийПриказ.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП") Тогда
		//+МАН 03.07.25 
		//Добавил
		Элементы.ГруппаЗалогодатели.Видимость = Ложь;
		Элементы.СтрокаСК.Видимость = Ложь;
		Элементы.ГруппаЦеныМеталлы.Видимость = Ложь;
		Элементы.ГруппаЦеныВставки.Видимость = Ложь;
		Элементы.ГруппаСтавки.Видимость = Ложь;
		
		//Убрал
		//Элементы.ГруппаПриказа.Видимость = Ложь;
		//-МАН
		Элементы.ГруппаОтменыПриказа.Видимость = Истина;
		Элементы.ТекущийПриказДатаОкончанияДействияПриказа.Видимость = Ложь;

		//Если ТекущийПриказ.ОтменаЗалогодателей Тогда
		//	Элементы.ТекущийПриказЗалогодатели.Видимость = Ложь;
		//Иначе
		//	Элементы.ТекущийПриказЗалогодатели.Видимость = Истина;
		//КонецЕсли;

		//Если ТекущийПриказ.ОтменаСхемКредитования Тогда
		//	Элементы.ТекущийПриказСхемыКредитования.Видимость = Ложь;
		//Иначе
		//	Элементы.ТекущийПриказСхемыКредитования.Видимость = Истина;
		//КонецЕсли;
		
		//+МАН 22.08.25 Убрал
		//Если ЗначениеЗаполнено(ТекущийПриказ.ОтменяемыйПриказ) Тогда
		//	СформироватьСтрокуОтменяемогоПриказа();
		//Иначе
		//	СтрокаОтменяемыйПриказ = "";
		//КонецЕсли;
		//-МАН
			
	Иначе 
		//+МАН 03.07.25 
		//Добавил
		Элементы.ГруппаЗалогодатели.Видимость = Истина;
		Элементы.СтрокаСК.Видимость = Истина;
		Элементы.ГруппаЦеныМеталлы.Видимость = Истина;
		Элементы.ГруппаЦеныВставки.Видимость = Истина;
		Элементы.ГруппаСтавки.Видимость = Истина;
		
		//Убрал
		//Элементы.ГруппаПриказа.Видимость = Истина;
		//-МАН
		Элементы.ГруппаОтменыПриказа.Видимость = Ложь;
		Элементы.ТекущийПриказДатаОкончанияДействияПриказа.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Процедура ПолучитьДополнительныеРеквизиты(СтрокаПриказа) 
	ДокументОбъект = СтрокаПриказа.Ссылка.ПолучитьОбъект();
	//ЛБ_УправлениеЛомбардом.ЗаполнитьДополнительныеРеквизитыПриказа(ДокументОбъект); 
	ЗаполнитьДополнительныеРеквизитыПриказа(ДокументОбъект);
	ДокументОбъект.Записать();    
	
	СтрокаПриказа.Металлы = ДокументОбъект.ЕстьМеталлы;
	СтрокаПриказа.Вставки = ДокументОбъект.ЕстьВставки;
	СтрокаПриказа.ПроцентныеСтавки = ДокументОбъект.ЕстьПроцентныеСтавки;
	//СтрокаПриказа.АкцияСтавки = ДокументОбъект.ЕстьАкцииПроцентныеСтавки; 
	//СтрокаПриказа.АкцияМеталлы = ДокументОбъект.ЕстьАкцииМеталлы;
	СтрокаПриказа.КоличествоЗалогодателей = ДокументОбъект.КоличествоЗалогодателей; 
	СтрокаПриказа.БазоваяЦенаМеталлы = ДокументОбъект.БазоваяЦенаМеталлы;
	СтрокаПриказа.МаксимальнаяПроцентнаяСтавка = ДокументОбъект.МаксимальнаяПроцентнаяСтавка; 
 КонецПроцедуры	
	
&НаСервере
Процедура ЗаполнитьТаблицуПриказов(ИдентификаторСтроки = неопределено)    
	Запрос = Новый Запрос;
	//+МАН 30.07.25 Изменил запрос. Добавил поиск прикрепленных файлов
	//Запрос.Текст ="ВЫБРАТЬ
	//              |	ЛБ_ПриказИндивидуальныеУсловия.Ссылка КАК Ссылка,
	//              |	ЛБ_ПриказИндивидуальныеУсловия.Номер КАК Номер,
	//              |	ЛБ_ПриказИндивидуальныеУсловия.Дата КАК Дата,
	//              |	ЛБ_ПриказИндивидуальныеУсловия.Ответственный КАК Ответственный,
	//              |	ЛБ_ПриказИндивидуальныеУсловия.Комментарий КАК Комментарий,
	//              |	ЛБ_ПриказИндивидуальныеУсловия.СтрокаЗалогодатели КАК СтрокаЗалогодатели,
	//              |	ЛБ_ПриказИндивидуальныеУсловия.ДатаОкончанияДействияПриказа КАК ДатаОкончанияДействияПриказа,
	//              |	ЛБ_ПриказИндивидуальныеУсловия.ВидОперации КАК ВидОперации,
	//              |	ЛБ_ПриказИндивидуальныеУсловия.ВидПриказа КАК ВидПриказа,
	//              |	ЛБ_ПриказИндивидуальныеУсловия.ДатаНачалаДействияПриказа КАК ДатаНачалаДействияПриказа,
	//              |	ЛБ_ПриказИндивидуальныеУсловия.НомерПриказа КАК НомерПриказа,
	//			  |	ЛБ_ПриказИндивидуальныеУсловия.НомерСистемныйЧисло КАК СистемныйНомер,
	//              |	ВЫБОР
	//              |		КОГДА ЛБ_ПриказИндивидуальныеУсловия.ПометкаУдаления
	//              |			ТОГДА 2
	//              |		ИНАЧЕ ВЫБОР
	//              |				КОГДА ЛБ_ПриказИндивидуальныеУсловия.Проведен
	//              |					ТОГДА 1
	//              |				ИНАЧЕ 0
	//              |			КОНЕЦ
	//              |	КОНЕЦ КАК СостояниеДокумента,
	//              |	ЛБ_ПриказИндивидуальныеУсловия.ЕстьМеталлы КАК Металлы,
	//              |	ЛБ_ПриказИндивидуальныеУсловия.ЕстьВставки КАК Вставки,
	//              |	ЛБ_ПриказИндивидуальныеУсловия.ЕстьПроцентныеСтавки КАК ПроцентныеСтавки,
	//              |	ЛБ_ПриказИндивидуальныеУсловия.КоличествоЗалогодателей КАК КоличествоЗалогодателей,
	//              |	ЛБ_ПриказИндивидуальныеУсловия.БазоваяЦенаМеталлы КАК БазоваяЦенаМеталлы,
	//              |	ЛБ_ПриказИндивидуальныеУсловия.МаксимальнаяПроцентнаяСтавка КАК МаксимальнаяПроцентнаяСтавка,
	//			  //+МАН 13.11.24 Заявка 2792
	//			  |	ЛБ_ПриказИндивидуальныеУсловия.ОтменяемыйПриказ.НомерПриказа КАК ОтменяемыйПриказНомерПриказа
	//			  //-МАН
	//              |ИЗ
	//              |	Документ.ЛБ_ПриказИндивидуальныеУсловия КАК ЛБ_ПриказИндивидуальныеУсловия
	//              |ГДЕ
	//              |	ЛБ_ПриказИндивидуальныеУсловия.Дата МЕЖДУ &Дата1 И &Дата2";

	Запрос.Текст ="ВЫБРАТЬ
	              |	ЛБ_ПриказИндивидуальныеУсловияПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла
	              |ПОМЕСТИТЬ ВТ
	              |ИЗ
	              |	Справочник.ЛБ_ПриказИндивидуальныеУсловияПрисоединенныеФайлы КАК ЛБ_ПриказИндивидуальныеУсловияПрисоединенныеФайлы
	              |ГДЕ
	              |	ЛБ_ПриказИндивидуальныеУсловияПрисоединенныеФайлы.ВладелецФайла.Дата МЕЖДУ &Дата1 И &Дата2
	              |	И НЕ ЛБ_ПриказИндивидуальныеУсловияПрисоединенныеФайлы.ПометкаУдаления
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	ЛБ_ПриказИндивидуальныеУсловияПрисоединенныеФайлы.ВладелецФайла
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ЛБ_ПриказИндивидуальныеУсловия.Ссылка КАК Ссылка,
	              |	ВЫБОР
	              |		КОГДА ВТ.ВладелецФайла ЕСТЬ NULL
	              |			ТОГДА ИСТИНА
	              |		ИНАЧЕ ЛОЖЬ
	              |	КОНЕЦ КАК ЕстьПрикрепленныйФайл,
	              |	ЛБ_ПриказИндивидуальныеУсловия.Номер КАК Номер,
	              |	ЛБ_ПриказИндивидуальныеУсловия.Дата КАК Дата,
	              |	ЛБ_ПриказИндивидуальныеУсловия.Ответственный КАК Ответственный,
	              |	ЛБ_ПриказИндивидуальныеУсловия.Комментарий КАК Комментарий,
	              |	ЛБ_ПриказИндивидуальныеУсловия.СтрокаЗалогодатели КАК СтрокаЗалогодатели,
	              |	ЛБ_ПриказИндивидуальныеУсловия.ДатаОкончанияДействияПриказа КАК ДатаОкончанияДействияПриказа,
	              |	ЛБ_ПриказИндивидуальныеУсловия.ВидОперации КАК ВидОперации,
	              |	ЛБ_ПриказИндивидуальныеУсловия.ВидПриказа КАК ВидПриказа,
	              |	ЛБ_ПриказИндивидуальныеУсловия.ДатаНачалаДействияПриказа КАК ДатаНачалаДействияПриказа,
	              |	ЛБ_ПриказИндивидуальныеУсловия.НомерПриказа КАК НомерПриказа,
	              |	ЛБ_ПриказИндивидуальныеУсловия.НомерСистемныйЧисло КАК СистемныйНомер,
	              |	ВЫБОР
	              |		КОГДА ЛБ_ПриказИндивидуальныеУсловия.ПометкаУдаления
	              |			ТОГДА 2
	              |		ИНАЧЕ ВЫБОР
	              |				КОГДА ЛБ_ПриказИндивидуальныеУсловия.Проведен
	              |					ТОГДА 1
	              |				ИНАЧЕ 0
	              |			КОНЕЦ
	              |	КОНЕЦ КАК СостояниеДокумента,
	              |	ЛБ_ПриказИндивидуальныеУсловия.ЕстьМеталлы КАК Металлы,
	              |	ЛБ_ПриказИндивидуальныеУсловия.ЕстьВставки КАК Вставки,
	              |	ЛБ_ПриказИндивидуальныеУсловия.ЕстьПроцентныеСтавки КАК ПроцентныеСтавки,
	              |	ЛБ_ПриказИндивидуальныеУсловия.КоличествоЗалогодателей КАК КоличествоЗалогодателей,
	              |	ЛБ_ПриказИндивидуальныеУсловия.БазоваяЦенаМеталлы КАК БазоваяЦенаМеталлы,
	              |	ЛБ_ПриказИндивидуальныеУсловия.МаксимальнаяПроцентнаяСтавка КАК МаксимальнаяПроцентнаяСтавка,
				  //+МАН 22.08.25
	              //|	ЛБ_ПриказИндивидуальныеУсловия.ОтменяемыйПриказ.НомерПриказа КАК ОтменяемыйПриказНомерПриказа
	              |	ЛБ_ПриказИндивидуальныеУсловия.ОтменяемыеПриказыСтрока КАК ОтменяемыйПриказНомерПриказа
				  //-МАН
	              |ИЗ
	              |	Документ.ЛБ_ПриказИндивидуальныеУсловия КАК ЛБ_ПриказИндивидуальныеУсловия
	              |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	              |		ПО ЛБ_ПриказИндивидуальныеУсловия.Ссылка = ВТ.ВладелецФайла
	              |ГДЕ
	              |	ЛБ_ПриказИндивидуальныеУсловия.Дата МЕЖДУ &Дата1 И &Дата2";
				  
	Запрос.УстановитьПараметр("Дата1", ?(НачПериода = Дата(1,1,1), НачПериода, НачалоДня(НачПериода))); 
	Запрос.УстановитьПараметр("Дата2", ?(КонПериода = Дата(1,1,1), КонецДня(ТекущаяДата()), КонецДня(КонПериода)));
	
	Если ЗначениеЗаполнено(ПоискПоЗалогодателю) Тогда
		Запрос.Текст = Запрос.Текст + "
	              |	И ЛБ_ПриказИндивидуальныеУсловия.Залогодатели.Залогодатель = &Залогодатель";
		
		Запрос.УстановитьПараметр("Залогодатель", ПоискПоЗалогодателю);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ВыборНомерПриказа) Тогда
		Запрос.Текст = Запрос.Текст + "
	              |	И ЛБ_ПриказИндивидуальныеУсловия.НомерПриказа ПОДОБНО &НомерПриказа";
		
		Запрос.УстановитьПараметр("НомерПриказа", СокрЛП(ВыборНомерПриказа) + "%");
	КонецЕсли;

	Запрос.Текст = Запрос.Текст + "
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	Дата УБЫВ"; 
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	ТаблицаПриказов.Загрузить(ТаблицаЗапроса); 
	
	Если ТаблицаПриказов.Количество() <> 0 Тогда
		Если ИдентификаторСтроки = Неопределено Тогда
			//КолСтр = ТаблицаПриказов.Количество();
			СтрокаТЗ = ТаблицаПриказов[0];
			ИдентификаторСтроки = СтрокаТЗ.ПолучитьИдентификатор();
		КонецЕсли;	
		Элементы.ТаблицаПриказов.ТекущаяСтрока = ИдентификаторСтроки;
		//+МАН 30.07.25 Изменил т.к. все время переходил на первую строку.
		ДокументОбъект = ТаблицаПриказов[0].Ссылка.ПолучитьОбъект();
		//ТекСтр = ТаблицаПриказов.НайтиПоИдентификатору(ИдентификаторСтроки);
		//ДокументОбъект = ТекСтр.Ссылка.ПолучитьОбъект();
		//-МАН
		ЗначениеВРеквизитФормы(ДокументОбъект, "ТекущийПриказ");
		//+Мельников 26.09.24 Заявка 2792
		Комментарий = ДокументОбъект.Комментарий;
		//-
		Если ДокументОбъект.Проведен Тогда 
			//Элементы.СтрокаЛомбарды.ТолькоПросмотр = Истина;
			Элементы.СтрокаСК.ТолькоПросмотр = Истина;
			//Элементы.Акция.ТолькоПросмотр = Истина;
		Иначе
			//Элементы.СтрокаЛомбарды.ТолькоПросмотр = Ложь;
			Элементы.СтрокаСК.ТолькоПросмотр = Ложь;
			//Элементы.Акция.ТолькоПросмотр = Ложь; 
		КонецЕсли;	
	КонецЕсли;	
		
КонецПроцедуры  

&НаСервере 
Процедура ЗаполнитьВыборЕдиницИзмеренияВставки()
	ТаблицаЕдиницИзмерения = ЛБ_ОбщийМодуль.ВыборЕдиницИзмеренияРасчетаЦенКамней();
	Элементы.ЦеныВставкиЕдиницаИзмерения.СписокВыбора.Очистить();		
	Для каждого Стр Из ТаблицаЕдиницИзмерения Цикл
		Элементы.ЦеныВставкиЕдиницаИзмерения.СписокВыбора.Добавить(Стр.ЕдиницаИзмерения);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПриказовПриАктивизацииСтроки(Элемент) 
	//Если НЕ  ЭтаФорма.ТекущийЭлемент = Элементы.ТаблицаПриказов Тогда
	//	Возврат;
	//КонецЕсли;	
	ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;  
	Если НЕ ТекСтрока = неопределено Тогда  
		ТекущийПриказИдентификатор = ТекСтрока.ПолучитьИдентификатор();
		ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
		ДатаДок = ТекСтрока.Дата; 
		//СтрокаАкция = СокрЛП(ТекущийПриказ.Акция);				
		
		Если ТекСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП") Тогда
			Элементы.ТекущийПриказЗалогодателиЗалогодатель.ТекстПодвала = ПолучитьКоличествоЗалогодателей(ТекСтрока.Ссылка, "Залогодатели");
			//Элементы.ТекущийПриказЗалогодателиОтменыЗалогодатель.ТекстПодвала = ПолучитьКоличествоЗалогодателей(ТекСтрока.Ссылка, "ЗалогодателиОтмены");
		КонецЕсли;
		УстановитьВидимость();
		
	КонецЕсли;		
КонецПроцедуры

&НаСервере
Процедура ПолучитьОбъектПриказа(Идентификатор) 
	СтрП = ТаблицаПриказов.НайтиПоИдентификатору(Идентификатор); 
	Если НЕ СтрП = Неопределено Тогда
		ДокументОбъект = СтрП.Ссылка.ПолучитьОбъект();
		ЗначениеВРеквизитФормы(ДокументОбъект, "ТекущийПриказ");

		//+Мельников 26.09.24 Заявка 2792
		Комментарий = ДокументОбъект.Комментарий;
		//-

		Если ДокументОбъект.Проведен Тогда 
			//Элементы.СтрокаЛомбарды.ТолькоПросмотр = Истина;
			Элементы.СтрокаСК.ТолькоПросмотр = Истина;
			//Элементы.Акция.ТолькоПросмотр = Истина;
		Иначе
			//Элементы.СтрокаЛомбарды.ТолькоПросмотр = Ложь;
			Элементы.СтрокаСК.ТолькоПросмотр = Ложь;
			//Элементы.Акция.ТолькоПросмотр = Ложь;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры	
	
&НаСервере
Процедура ВводДокументовНаОсновании(ИдентификаторСтроки)
	СтрП = ТаблицаПриказов.НайтиПоИдентификатору(ИдентификаторСтроки); 
	ДокОбъект = СтрП.Ссылка.ПолучитьОбъект(); 

	//металлы
	Если НЕ ДокОбъект.ЦеныМеталлы.Количество() = 0 Тогда 
		 ЗапросДок = Новый Запрос;
		 ЗапросДок.УстановитьПараметр("Приказ", ДокОбъект.Ссылка);
		 ЗапросДок.Текст = "ВЫБРАТЬ
		                   |	ЛБ_ПрейскурантЦенНаМеталлы.Ссылка КАК Ссылка
		                   |ИЗ
		                   |	Документ.ЛБ_ПрейскурантЦенНаМеталлы КАК ЛБ_ПрейскурантЦенНаМеталлы
		                   |ГДЕ
		                   |	ЛБ_ПрейскурантЦенНаМеталлы.Приказ = &Приказ
		                   |	И ЛБ_ПрейскурантЦенНаМеталлы.ПометкаУдаления = ЛОЖЬ
		                   |
		                   |УПОРЯДОЧИТЬ ПО
		                   |	ЛБ_ПрейскурантЦенНаМеталлы.Дата УБЫВ";
		 ВыборкаДок = ЗапросДок.Выполнить().Выбрать();
		 Если  ВыборкаДок.Следующий() Тогда  
			 ДокОбъектМ = ВыборкаДок.Ссылка.ПолучитьОбъект(); 
		 Иначе	
			 ДокОбъектМ = Документы.ЛБ_ПрейскурантЦенНаМеталлы.СоздатьДокумент();
		 КонецЕсли;	 
		 ДокОбъектМ.Дата = ДокОбъект.Дата;
		 ДокОбъектМ.ЗаполнитьНаОсновании(ДокОбъект.Ссылка);
		 
		 Попытка
		     ДокОбъектМ.Записать(РежимЗаписиДокумента.Проведение);
			 Сообщить("Создан прейскурант цен на металлы № " + СокрЛП(ДокОбъектМ.Номер) + " от " + Строка(ДокОбъектМ.Дата) + ".");
		 Исключение              
			ОшибкаПроведения = Истина; 
			Сообщить("Прейскурант цен на металлы не создан!");
			Сообщить(ОписаниеОшибки(), СтатусСообщения.Важное);
		КонецПопытки;	  
	КонецЕсли;	  
	
	//вставки
	Если НЕ ДокОбъект.ЦеныВставки.Количество() = 0 Тогда 
		 ЗапросДок = Новый Запрос;
		 ЗапросДок.УстановитьПараметр("Приказ", ДокОбъект.Ссылка);
		 ЗапросДок.Текст = "ВЫБРАТЬ
		                   |	ЛБ_ПрейскурантЦенНаДрагоценныеКамни.Ссылка КАК Ссылка
		                   |ИЗ
		                   |	Документ.ЛБ_ПрейскурантЦенНаДрагоценныеКамни КАК ЛБ_ПрейскурантЦенНаДрагоценныеКамни
		                   |ГДЕ
		                   |	ЛБ_ПрейскурантЦенНаДрагоценныеКамни.Приказ = &Приказ
		                   |	И ЛБ_ПрейскурантЦенНаДрагоценныеКамни.ПометкаУдаления = ЛОЖЬ
		                   |
		                   |УПОРЯДОЧИТЬ ПО
		                   |	ЛБ_ПрейскурантЦенНаДрагоценныеКамни.Дата УБЫВ";
		 ВыборкаДок = ЗапросДок.Выполнить().Выбрать();
		 Если  ВыборкаДок.Следующий() Тогда  
			 ДокОбъектВ = ВыборкаДок.Ссылка.ПолучитьОбъект(); 
		 Иначе	
			 ДокОбъектВ = Документы.ЛБ_ПрейскурантЦенНаДрагоценныеКамни.СоздатьДокумент();
		 КонецЕсли;	 
		 ДокОбъектВ.Дата = ДокОбъект.Дата;
		 ДокОбъектВ.ЗаполнитьНаОсновании(ДокОбъект.Ссылка);
		 
		 Попытка
		     ДокОбъектВ.Записать(РежимЗаписиДокумента.Проведение);
			 Сообщить("Создан прейскурант цен на драгоценные камни № " + СокрЛП(ДокОбъектВ.Номер) + " от " + Строка(ДокОбъектВ.Дата) + ".");
		 Исключение              
			ОшибкаПроведения = Истина; 
			Сообщить("Прейскурант цен на драгоценные камни не создан!");
			Сообщить(ОписаниеОшибки(), СтатусСообщения.Важное);
		КонецПопытки;	  
	КонецЕсли;	
	
	//процентные ставки
	Если НЕ ДокОбъект.СтавкиПроцентов.Количество() = 0 Тогда 
		 ЗапросДок = Новый Запрос;
		 ЗапросДок.УстановитьПараметр("Приказ", ДокОбъект.Ссылка);
		 ЗапросДок.Текст = "ВЫБРАТЬ
		                   |	ЛБ_ПрейскурантПроцентныхСтавок.Ссылка КАК Ссылка
		                   |ИЗ
		                   |	Документ.ЛБ_ПрейскурантПроцентныхСтавок КАК ЛБ_ПрейскурантПроцентныхСтавок
						   |ГДЕ
		                   |	ЛБ_ПрейскурантПроцентныхСтавок.Приказ = &Приказ
		                   |	И ЛБ_ПрейскурантПроцентныхСтавок.ПометкаУдаления = ЛОЖЬ
		                   |
		                   |УПОРЯДОЧИТЬ ПО
		                   |	ЛБ_ПрейскурантПроцентныхСтавок.Дата УБЫВ";
		 ВыборкаДок = ЗапросДок.Выполнить().Выбрать();
		 Если  ВыборкаДок.Следующий() Тогда  
			 ДокОбъектС = ВыборкаДок.Ссылка.ПолучитьОбъект(); 
		 Иначе	
			 ДокОбъектС= Документы.ЛБ_ПрейскурантПроцентныхСтавок.СоздатьДокумент();
		 КонецЕсли;	 
		 ДокОбъектС.Дата = ДокОбъект.Дата;
		 ДокОбъектС.ЗаполнитьНаОсновании(ДокОбъект.Ссылка);
		 
		 Попытка
		     ДокОбъектС.Записать(РежимЗаписиДокумента.Проведение);
			 Сообщить("Создан прейскурант процентных ставок № " + СокрЛП(ДокОбъектС.Номер) + " от " + Строка(ДокОбъектС.Дата) + ".");
		 Исключение              
			ОшибкаПроведения = Истина; 
			Сообщить("Прейскурант процентных ставок не создан!");
			Сообщить(ОписаниеОшибки(), СтатусСообщения.Важное);
		КонецПопытки;	  
	КонецЕсли;	

КонецПроцедуры  

&НаСервере
Функция ВводПриказаВДействие(ИдентификаторСтроки, Результат)
	СтрП = ТаблицаПриказов.НайтиПоИдентификатору(ИдентификаторСтроки); 
	ДокОбъект = СтрП.Ссылка.ПолучитьОбъект(); 
	
	ДокОбъект.ВидПриказа = Перечисления.ЛБ_ВидыПриказа.Факт;
	ДокОбъект.НомерПриказа = Результат.НомерПриказа;
	//+МАН 05.02.25 Если изменить дату приказа то она не изменялась в документе.
	ДокОбъект.Дата = Результат.ДатаПриказа;
	//-МАН
	ДокОбъект.ДатаНачалаДействияПриказа = Результат.ДатаНачалаДействияПриказа;
	ДокОбъект.ДатаОкончанияДействияПриказа = Результат.ДатаОкончанияДействияПриказа;
	//Если ДокОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.Акция Тогда
	//	ДокОбъект.ДатаОкончанияДействияПриказа = Результат.ДатаОкончанияДействияПриказа;
	//КонецЕсли;
	
	ВсеОК = Истина;
	Попытка
	    ДокОбъект.Записать(РежимЗаписиДокумента.Проведение); 
		Сообщить("Приказ введен в действие!");
	Исключение              
		ОшибкаПроведения = Истина; 
		Сообщить("Приказ не введен в действие!");
		//Сообщить(ОписаниеОшибки(), Статуссообщения.Важное);
		ВсеОК = ложь;
	КонецПопытки;	
    Возврат ВсеОК;
КонецФункции

&НаКлиенте
Процедура ПослеВводаПриказаВДействие(Результат, ДопПараметры) Экспорт
	Если Результат = неопределено Тогда 
		Возврат;   
	КонецЕсли;	   
	
	ТекСтрокаПриказы = Элементы.ТаблицаПриказов.ТекущиеДанные; 
	ИдентификаторСтроки = ТекСтрокаПриказы.ПолучитьИдентификатор();
	ПриказВведен = ВводПриказаВДействие(ИдентификаторСтроки, Результат);
		
	Если ПриказВведен Тогда   
		ТекСтрокаПриказы.ВидПриказа = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПриказа.Факт"); 
		ТекСтрокаПриказы.НомерПриказа = Результат.НомерПриказа;    
		ТекСтрокаПриказы.Дата = Результат.ДатаПриказа;
		ТекСтрокаПриказы.ДатаНачалаДействияПриказа = Результат.ДатаНачалаДействияПриказа;
		ТекСтрокаПриказы.ДатаОкончанияДействияПриказа = Результат.ДатаОкончанияДействияПриказа;  
		ТекСтрокаПриказы.СостояниеДокумента = 1;     
		ПолучитьОбъектПриказа(ИдентификаторСтроки);
		//Если ТекСтрокаПриказы.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.Акция") Тогда 
		//	ВводДокументовНаОснованииАкция(ИдентификаторСтроки);
		//Иначе 
		//	ВводДокументовНаОсновании(ИдентификаторСтроки);
		//КонецЕсли;	
	КонецЕсли;	 
КонецПроцедуры

&НаКлиенте
Процедура ВвестиПриказВДействие(Команда)  
	ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные; 
	Если ТекСтрока = неопределено Тогда
		Возврат;
	КонецЕсли;	 
	
	//+Мельников 14.08.24 Проверка заполнения поля ставка. Заявка 2676.
	ПустаяСтавка = Ложь;
	
	Если ТекСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.ВИП")
		И ЭтотОбъект.ТекущийПриказ.СтавкиПроцентов.Количество() > 0 Тогда
		//+МАН 05.03.25 Изменил
		//Для каждого СтрСтавки Из ЭтотОбъект.ТекущийПриказ.СтавкиПроцентов Цикл
		//	Если СтрСтавки.Ставка <> 0 Тогда
		//		Продолжить;
		//	Иначе
		//		Сообщить("В строке № " + СтрСтавки.НомерСтроки + " не заполнена ставка.");
		//		ПустаяСтавка = Истина;
		//	КонецЕсли;
		//КонецЦикла;
		
		//Если ПустаяСтавка Тогда
		//	Возврат;
		//КонецЕсли;
		
		НомераСтрок = "";
		//+МАН 19.03.25
		ЕстьНоль = Ложь;
		//-МАН
		
		Для каждого СтрСтавки Из ЭтотОбъект.ТекущийПриказ.СтавкиПроцентов Цикл
			Если СтрСтавки.Ставка = 0 Тогда
				НомераСтрок = НомераСтрок + ?(НомераСтрок <> "", ", " + СтрСтавки.НомерСтроки, СтрСтавки.НомерСтроки);
				//+МАН 19.03.25
				ЕстьНоль = Истина;
				//-МАН
			КонецЕсли;
		КонецЦикла;
		
		//+МАН 19.03.25
		Если ЕстьНоль Тогда
			ТекстСообщения = "Для строк № " + НомераСтрок + " не указана ставка. При оформлении займа будет действовать базовая ставка!";
			
			Ответ = Вопрос(ТекстСообщения, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
			Если Ответ = КодВозвратаДиалога.Нет Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		//-МАН
	КонецЕсли;
	//-Мельников
	
	//+МАН 22.08.25 Убрал
	//Если ТекСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП")
	//	И НЕ ПроверитьЗаполнениеПриказаОтмены(ТекСтрока.Ссылка) Тогда
	//	Сообщить("Не выбран приказ по которум производится отмена!");
	//	Возврат;
	//КонецЕсли;
	
	Если ТекСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП")
		И ЭтотОбъект.ТекущийПриказ.Залогодатели.Количество() = 0 Тогда
		Сообщить("Не выбраны залогодатели по которым производится отмена!");
		Возврат;
	КонецЕсли;

	Если ТекСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП")
		И ЭтотОбъект.ТекущийПриказ.ОтменяемыеПриказы.Количество() = 0 Тогда
			Если ЭтотОбъект.ТекущийПриказ.Залогодатели.Количество() = 1 Тогда
				Сообщить("По данному клиенту нет условий которые можно отменить");
			ИначеЕсли ЭтотОбъект.ТекущийПриказ.Залогодатели.Количество() > 1 Тогда
				Сообщить("По данным клиентам нет условий которые можно отменить");
			КонецЕсли;
		Возврат;
	КонецЕсли;
	//-МАН
	
	Если ТекСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП")
		И НЕ ТекущийПриказ.ОтменаСтавок И НЕ ТекущийПриказ.ОтменаМеталлов И НЕ ТекущийПриказ.ОтменаВставкок Тогда
		Сообщить("Не выбраны отменяемые условия!");
		Возврат;
	КонецЕсли;

	//+МАН 04.02.25
	Если ТекСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.ВИП")
		И ТекущийПриказ.Залогодатели.Количество() = 0 Тогда
		Сообщить("Не выбран залогодатель!");
		Возврат;
	КонецЕсли;

	Если ТекСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.ВИП")
		И ТекущийПриказ.СхемыКредитования.Количество() = 0 Тогда
		Сообщить("Не выбрана схема кредитования!");
		Возврат;
	КонецЕсли;

	//+МАН 04.03.25
	Если ТекСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.ВИП") Тогда
		РезультатПроверкиСК = ПроверитьСК(ТекСтрока.Ссылка);
		Если ЗначениеЗаполнено(РезультатПроверкиСК.СК) Тогда
			Сообщить("По схеме кредитования " + """" + РезультатПроверкиСК.СК + """" + " не установлено ни одно из условий!");
			Возврат;
		КонецЕсли;
	КонецЕсли;

	//+МАН 04.07.25
	РезультатПроверкиЗаполненияСотрудников = ПроверитьЗаполнениеСотрудников(ТекСтрока.Ссылка);
	Если РезультатПроверкиЗаполненияСотрудников Тогда
		//Сообщить("Выбраны не все сотрудники в параметрах печати!");
		Сообщить("В параметрах печати заполнены не все поля!");
		Возврат;
	КонецЕсли;
	//-МАН
	
	Если ТекСтрока.ВидПриказа = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПриказа.Факт") Тогда 
		Сообщить("Приказ уже введен в действие!"); 
		Возврат;
	ИначеЕсли ТекСтрока.СостояниеДокумента = 2 Тогда 
		Сообщить("Приказ помечен на удаление!"); 
		Возврат;
	КонецЕсли;	
	
	ПараметрыФормы = Новый Структура;   
	ПараметрыФормы.Вставить("ВидОперации", ТекСтрока.ВидОперации);
	ПараметрыФормы.Вставить("НомерПриказа", ТекСтрока.НомерПриказа); 
	ПараметрыФормы.Вставить("ДатаПриказа", ТекСтрока.Дата);
	ПараметрыФормы.Вставить("ДатаНачалаДействияПриказа", ТекСтрока.ДатаНачалаДействияПриказа);
	
	Если ТекСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.ВИП") Тогда
		ПараметрыФормы.Вставить("ДатаОкончанияДействияПриказа", ТекСтрока.ДатаОкончанияДействияПриказа);
	КонецЕсли;
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВводаПриказаВДействие",ЭтаФорма);
	
	ОткрытьФорму("Документ.ЛБ_ПриказИндивидуальныеУсловия.Форма.ВводПриказаВДействие", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

//&НаСервереБезКонтекста
//Функция ПроверитьЗаполнениеПриказаОтмены(Приказ)
//	Возврат ЗначениеЗаполнено(Приказ.ОтменяемыйПриказ);
//КонецФункции

&НаКлиенте
Процедура Период(Команда)    
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
    Диалог.Период = Новый СтандартныйПериод(НачПериода, КонПериода);
	Оповещение = Новый ОписаниеОповещения("ВыборПериодаЗавершение", ЭтаФорма);
	Диалог.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериодаЗавершение(Период, ДополнительныеПараметры) Экспорт 
	Если Период = неопределено Тогда
		Возврат;
	КонецЕсли;	
	НачПериода = Период.ДатаНачала;
    КонПериода = Период.ДатаОкончания;
	ЭтаФорма.Заголовок = "Журнал приказов по залогодателям " + ПредставлениеПериода(НачПериода, КонПериода);
	ЗаполнитьТаблицуПриказов();
КонецПроцедуры

&НаСервере
Процедура ДобавитьПриказСервер(ВидОперации) 
	//+Мельников 28.08.24 Добавлено условие. ВИП. Заявка 2792
	Если ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ВИП Тогда
		НовыйДок = Документы.ЛБ_ПриказИндивидуальныеУсловия.СоздатьДокумент(); 
		НовыйДок.Дата = ТекущаяДата();
		НовыйДок.ВидПриказа = Перечисления.ЛБ_ВидыПриказа.Проект;  
		НовыйДок.ВидОперации = ВидОперации;
		НовыйДок.НомерПриказа = "";  
		НовыйДок.ДатаНачалаДействияПриказа = Дата(1,1,1); 
		НовыйДок.Ответственный = Пользователи.ТекущийПользователь();
		
		//+МАН 
		//Если Элементы.ТекущийПриказНачальникОРБ.СписокВыбора.Количество() = 1 Тогда
		//	НовыйДок.НачальникОРБ = Элементы.ТекущийПриказНачальникОРБ.СписокВыбора.Получить(0).Значение;
		//КонецЕсли;
		//
		//Если Элементы.ТекущийПриказОтветственноеЛицоОРБ.СписокВыбора.Количество() = 1 Тогда
		//	НовыйДок.ОтветственноеЛицоОРБ = Элементы.ТекущийПриказОтветственноеЛицоОРБ.СписокВыбора.Получить(0).Значение;
		//КонецЕсли;
		//
		//Если Элементы.ТекущийПриказНачальникОДО.СписокВыбора.Количество() = 1 Тогда
		//	НовыйДок.НачальникОДО = Элементы.ТекущийПриказНачальникОДО.СписокВыбора.Получить(0).Значение;
		//КонецЕсли;
		//
		//Если Элементы.ТекущийПриказОтветственноеЛицоРеклама.СписокВыбора.Количество() = 1 Тогда
		//	НовыйДок.ОтветственноеЛицоРеклама = Элементы.ТекущийПриказОтветственноеЛицоРеклама.СписокВыбора.Получить(0).Значение;
		//КонецЕсли;
		//
		//Если Элементы.ТекущийПриказПодписантФИО.СписокВыбора.Количество() = 1 Тогда
		//	НовыйДок.ПодписантФИО = Элементы.ТекущийПриказПодписантФИО.СписокВыбора.Получить(0).Значение;
		//	НовыйДок.ПодписантДолжность = Элементы.ТекущийПриказПодписантФИО.СписокВыбора.Получить(0).Значение.Должность
		//КонецЕсли;
		//-МАН

		//+МАН 29.07.25 Изменил после ввода констант подписантов. Заявка 2792
		ЗаполнитьНастройкиПечатиВНовомДокументе(НовыйДок);
		//-МАН
		
		НовыйДок.Записать();  

		НовыйДок.НомерСистемныйЧисло = ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(НовыйДок.Номер);
		НовыйДок.Записать();

		Если КонПериода < НовыйДок.Дата Тогда
			КонПериода = НовыйДок.Дата;
		КонецЕсли;	
		ЗаполнитьТаблицуПриказов();
	//+Мельников 28.08.24 Создание документа. ВИП. Заявка 2792
	ИначеЕсли ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП Тогда
		НовыйДок = Документы.ЛБ_ПриказИндивидуальныеУсловия.СоздатьДокумент(); 
		НовыйДок.Дата = ТекущаяДата();
		НовыйДок.ВидПриказа = Перечисления.ЛБ_ВидыПриказа.Проект;  
		НовыйДок.ВидОперации = ВидОперации;
		НовыйДок.НомерПриказа = "";  
		НовыйДок.ДатаНачалаДействияПриказа = Дата(1,1,1); 
		НовыйДок.Ответственный = Пользователи.ТекущийПользователь();
		НовыйДок.ОтменаЗалогодателей = Истина;
		//НовыйДок.ОтменаСхемКредитования = Истина;
		//+МАН 29.07.25 Заполняем настройки печати. Заявка 2792
		ЗаполнитьНастройкиПечатиВНовомДокументе(НовыйДок);
		//-МАН
		НовыйДок.Записать();

		НовыйДок.НомерСистемныйЧисло = ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(НовыйДок.Номер);
		НовыйДок.Записать();

		Если КонПериода < НовыйДок.Дата Тогда
			КонПериода = НовыйДок.Дата;
		КонецЕсли;	
		ЗаполнитьТаблицуПриказов();
	Иначе
		НовыйДок = Документы.ЛБ_ПриказИндивидуальныеУсловия.СоздатьДокумент(); 
		НовыйДок.Дата = ТекущаяДата();
		НовыйДок.ВидПриказа = Перечисления.ЛБ_ВидыПриказа.Проект;  
		НовыйДок.ВидОперации = ВидОперации;
		НовыйДок.НомерПриказа = "";  
		НовыйДок.ДатаНачалаДействияПриказа = Дата(1,1,1); 
		НовыйДок.Ответственный = Пользователи.ТекущийПользователь();
		//+МАН 29.07.25 Заполняем настройки печати. Заявка 2792
		ЗаполнитьНастройкиПечатиВНовомДокументе(НовыйДок);
		//-МАН
		НовыйДок.Записать();  

		НовыйДок.НомерСистемныйЧисло = ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(НовыйДок.Номер);
		НовыйДок.Записать();

		Если КонПериода < НовыйДок.Дата Тогда
			КонПериода = НовыйДок.Дата;
		КонецЕсли;	
		ЗаполнитьТаблицуПриказов();
	КонецЕсли;
	//-Мельников
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьНастройкиПечатиВНовомДокументе(НовыйДок)
	Если ЗначениеЗаполнено(Константы.ЛБ_НачальникОРБ.Получить()) Тогда
		НовыйДок.НачальникОРБ = Константы.ЛБ_НачальникОРБ.Получить();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Константы.ЛБ_ОтветственноеЛицоОРБ.Получить()) Тогда
		НовыйДок.ОтветственноеЛицоОРБ = Константы.ЛБ_ОтветственноеЛицоОРБ.Получить();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Константы.ЛБ_НачальникОДО.Получить()) Тогда
		НовыйДок.НачальникОДО = Константы.ЛБ_НачальникОДО.Получить();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Константы.ЛБ_Подписант.Получить()) Тогда
		НовыйДок.ПодписантФИО = Константы.ЛБ_Подписант.Получить();
		НовыйДок.ПодписантДолжность = Константы.ЛБ_Подписант.Получить().Должность;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПриказ(Команда)
	ВидыПриказа = Новый СписокЗначений;
    ВидыПриказа.Добавить(ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.ВИП")); //+Мельников 28.08.24 ВИП. Заявка 2792
	ВидыПриказа.Добавить(ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП"));
    
    ОповещениеПослеВыбораЭлемента = Новый ОписаниеОповещения("ПослеВыбораВидаОперацииПриказа", ЭтаФорма);//Элементы.ТаблицаПриказовДобавить);
 
    ВидыПриказа.ПоказатьВыборЭлемента(ОповещениеПослеВыбораЭлемента, "Выберите вид операции");
 
КонецПроцедуры
 
&НаКлиенте
Процедура ПослеВыбораВидаОперацииПриказа(Элемент, Параметры) Экспорт
 
	Если Элемент <> Неопределено Тогда 
		ДобавитьПриказСервер(Элемент.Значение); 
	КонецЕсли;
 
КонецПроцедуры

&НаСервере
Процедура КопироватьПриказСервер(ИдентификаторСтроки)  
	Стр = ТаблицаПриказов.НайтиПоИдентификатору(ИдентификаторСтроки); 
	Если Стр = неопределено Тогда
        Возврат;
	КонецЕсли;	
	ДокументКопия = Стр.Ссылка.Скопировать();
    ДокументКопия.Дата = ТекущаяДата();	
	ДокументКопия.ВидПриказа = Перечисления.ЛБ_ВидыПриказа.Проект;
	ДокументКопия.НомерПриказа = "";  
	ДокументКопия.ДатаНачалаДействияПриказа = Дата(1,1,1); 
	ДокументКопия.Ответственный = Пользователи.ТекущийПользователь();
    ДокументКопия.Записать();
	Если КонПериода < ДокументКопия.Дата Тогда
		КонПериода = ДокументКопия.Дата;
	КонецЕсли;	
	ЗаполнитьТаблицуПриказов();
КонецПроцедуры

&НаКлиенте
Процедура КопироватьПриказ(Команда)
	ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;	
	Если НЕ ТекСтрока = неопределено Тогда
		ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
		КопироватьПриказСервер(ИдентификаторСтроки);  
	КонецЕсли;	
КонецПроцедуры  

&НаСервере
Процедура ПометитьНаУдалениеСервер(ИдентификаторСтроки) 
	Стр = ТаблицаПриказов.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если Стр = неопределено Тогда
       Возврат;
	КонецЕсли;   
	ДокОбъект =  Стр.Ссылка.ПолучитьОбъект();
	Если ДокОбъект.ПометкаУдаления Тогда
	    ДокОбъект.УстановитьПометкуУдаления(Ложь);
	    Стр.СостояниеДокумента = 0; 
	Иначе
		Если ДокОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП Тогда
			Ставки = ПроверитьСтавки(ДокОбъект.Ссылка);
			Металлы = ?(ДокОбъект.НастройкаОтклоненийОтБазовыхЦенМеталлы.Количество() > 0, Истина, Ложь);
			Вставки = ?(ДокОбъект.НастройкаОтклоненийОтБазовыхЦенВставки.Количество() > 0, Истина, Ложь);
			
			СтруктураВозврата = НайтиДокументыОтмены(ДокОбъект.ОтменяемыйПриказ, ДокОбъект.Ссылка, Ставки, Металлы, Вставки);
			
			Отбор = Новый Структура;
			
			Если ЗначениеЗаполнено(ДокОбъект.ОтменяемыйПриказ) Тогда 
				ДокОбъектОтменяемый = ДокОбъект.ОтменяемыйПриказ.ПолучитьОбъект();
				
				Для каждого СтрЗ Из ДокОбъект.Залогодатели Цикл
					
					Отбор.Вставить("Залогодатель", СтрЗ.Залогодатель);
					
					Массивзалогодателей = ДокОбъектОтменяемый.Залогодатели.НайтиСтроки(Отбор);
					
					Для каждого СтрМ Из Массивзалогодателей Цикл
						Если Ставки И НЕ СтруктураВозврата.Ставки Тогда
							СтрМ.НетСтавок = Ложь;
						КонецЕсли;
						
						Если Металлы И НЕ СтруктураВозврата.Металлы Тогда
							СтрМ.НетМеталлов = Ложь;
						КонецЕсли;
						
						Если Вставки И НЕ СтруктураВозврата.Вставки Тогда
							СтрМ.НетВставок = Ложь;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
				
				ДокОбъектОтменяемый.Записать();
			КонецЕсли;
		КонецЕсли;
		
		ДокОбъект.ВидПриказа = Перечисления.ЛБ_ВидыПриказа.Проект;
		ДокОбъект.Записать();
		
		ДокОбъект.УстановитьПометкуУдаления(Истина);
	    Стр.СостояниеДокумента = 2;
		
		ЗаполнитьТаблицуПриказов();
	КонецЕсли;   
	//ЗаполнитьТаблицуПриказов();
КонецПроцедуры	

&НаСервере
Функция НайтиДокументыОтмены(ДокУстановки, ДокОтмены, Ставки = Ложь, Металлы = Ложь, Вставки = Ложь)
	
	СтруктураВозврата = Новый Структура("Ставки, Металлы, Вставки");
	
	Если Ставки Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		|ГДЕ
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор.ОтменяемыйПриказ = &ОтменяемыйПриказ
		|	И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор <> &Регистратор
		|	И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор.ВидОперации = &ВидОперации
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период УБЫВ";
		
		Запрос.УстановитьПараметр("ОтменяемыйПриказ", ДокУстановки);
		Запрос.УстановитьПараметр("Регистратор", ДокОтмены);
		Запрос.УстановитьПараметр("ВидОперации", Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП);
		
		Результат = Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() Тогда
			Став = Истина;
		Иначе
			Став = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если Металлы Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
		|ГДЕ
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор.ОтменяемыйПриказ = &ОтменяемыйПриказ
		|	И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор <> &Регистратор
		|	И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор.ВидОперации = &ВидОперации
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период УБЫВ";
		
		Запрос.УстановитьПараметр("ОтменяемыйПриказ", ДокУстановки);
		Запрос.УстановитьПараметр("Регистратор", ДокОтмены);
		Запрос.УстановитьПараметр("ВидОперации", Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП);
		
		Результат = Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() Тогда
			Мет = Истина;
		Иначе
			Мет = Ложь;
		КонецЕсли;
	КонецЕсли;

	Если Вставки Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
		|ГДЕ
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор.ОтменяемыйПриказ = &ОтменяемыйПриказ
		|	И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор <> &Регистратор
		|	И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор.ВидОперации = &ВидОперации
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период УБЫВ";
		
		Запрос.УстановитьПараметр("ОтменяемыйПриказ", ДокУстановки);
		Запрос.УстановитьПараметр("Регистратор", ДокОтмены);
		Запрос.УстановитьПараметр("ВидОперации", Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП);
		
		Результат = Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() Тогда
			Встав = Истина;
		Иначе
			Встав = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	СтруктураВозврата.Ставки = Став;
	СтруктураВозврата.Металлы = Мет;
	СтруктураВозврата.Вставки = Встав;
	
	Возврат СтруктураВозврата;

КонецФункции

&НаСервере
Функция ПроверитьСтавки(Ссылка)
	ТЗ = Ссылка.СтавкиПроцентов.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнешнийИсточник.Ставка КАК Ставка
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ВнешнийИсточник КАК ВнешнийИсточник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(ВТ.Ставка) КАК Ставка
		|ИЗ
		|	ВТ КАК ВТ
		|ГДЕ
		|	ВТ.Ставка > 0";
	
	Запрос.УстановитьПараметр("ВнешнийИсточник", ТЗ);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Если Результат.Ставка > 0 Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
	
&НаКлиенте
Процедура УдалитьПриказ(Команда)
	ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;  
	Если НЕ ТекСтрока = неопределено Тогда
		
		Если ТекСтрока.СостояниеДокумента = 1 Тогда
			//ОтменитьПроведение(Истина);
			
			//ЕстьДокументы = ПроверитьНаличиеДокументов(ТекСтрока.Ссылка);
			//
			//Если ЕстьДокументы Тогда
			//	Предупреждение("Удаление приказа невозможно, есть другие документы!");
			//	Возврат;
			//Иначе
			//	//+МАН 20.03.25
			//	Если ТекСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП")
			//		И ТекущаяДата() > ТекСтрока.Дата + 86400 Тогда
			//		
			//		Предупреждение("Удаление приказа невозможно, прошло больше суток с момента проведения документа!");
			//		Возврат;
			//	КонецЕсли;
			//	//-МАН
			//КонецЕсли;
			ОтменитьПроведение = ПередОтменитьПроведение(, Истина);
			
			Если НЕ ОтменитьПроведение Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
		ПометитьНаУдалениеСервер(ИдентификаторСтроки); 
		УстановитьВидимость();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура РаспровестиДокументСервере(ИдентификаторСтроки) 
	Стр = ТаблицаПриказов.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если Стр = неопределено Тогда
		Возврат;
	КонецЕсли;	   
	Если НЕ Стр.Ссылка.Проведен Тогда
		Сообщить("Нельзя отменить проведения у непроведенного документа!");
		Возврат;
	КонецЕсли;
	
	ДокОбъект =  Стр.Ссылка.ПолучитьОбъект();
	Если НЕ Стр.ВидПриказа = Перечисления.ЛБ_ВидыПриказа.Проект Тогда  
		Стр.ВидПриказа = Перечисления.ЛБ_ВидыПриказа.Проект; 
		ДокОбъект.ВидПриказа = Перечисления.ЛБ_ВидыПриказа.Проект;   	    
	КонецЕсли;	   

	//+МАН 25.08.25 Убрал
	////+МАН 10.04.25 Убираем отметки в отменяемом документе
	//Если ДокОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП Тогда
	//	
	//	ДоОбъектОтменяемый = ДокОбъект.ОтменяемыйПриказ.ПолучитьОбъект();
	//	КолСтавки = ДокОбъект.СтавкиПроцентов.Количество();
	//	КолМеталлы = ДокОбъект.НастройкаОтклоненийОтБазовыхЦенМеталлы.Количество();
	//	КолВставки = ДокОбъект.НастройкаОтклоненийОтБазовыхЦенВставки.Количество();
	//	
	//	Для каждого СтрЗ Из ДокОбъект.Залогодатели Цикл
	//		
	//		Отбор = Новый Структура;
	//		Отбор.Вставить("Залогодатель", СтрЗ.Залогодатель);
	//		
	//		МассивСтрЗ = ДоОбъектОтменяемый.Залогодатели.НайтиСтроки(Отбор);
	//		
	//		Если КолСтавки > 0 И МассивСтрЗ.Количество() > 0 И СтрЗ.НетСтавок Тогда
	//			
	//			ЕстьВДругихДокументах = ПроверитьОтменуВДругихДокументах(СтрЗ.Залогодатель, ДокОбъект.ДатаНачалаДействияПриказа, ДоОбъектОтменяемый.Ссылка, Истина);
	//			
	//			Если НЕ ЕстьВДругихДокументах Тогда
	//				МассивСтрЗ[0].НетСтавок = Ложь;
	//			КонецЕсли;
	//		КонецЕсли;
	//		
	//		Если КолМеталлы > 0 И МассивСтрЗ.Количество() > 0 И СтрЗ.НетМеталлов Тогда
	//			
	//			ЕстьВДругихДокументах = ПроверитьОтменуВДругихДокументах(СтрЗ.Залогодатель, ДокОбъект.ДатаНачалаДействияПриказа, ДоОбъектОтменяемый.Ссылка,, Истина);
	//			
	//			Если НЕ ЕстьВДругихДокументах Тогда
	//				МассивСтрЗ[0].НетМеталлов = Ложь;
	//			КонецЕсли;
	//		КонецЕсли;
	//		
	//		Если КолВставки > 0 И МассивСтрЗ.Количество() > 0 И СтрЗ.НетВставок Тогда
	//			
	//			ЕстьВДругихДокументах = ПроверитьОтменуВДругихДокументах(СтрЗ.Залогодатель, ДокОбъект.ДатаНачалаДействияПриказа, ДоОбъектОтменяемый.Ссылка,,, Истина);
	//			
	//			Если НЕ ЕстьВДругихДокументах Тогда
	//				МассивСтрЗ[0].НетВставок = Ложь;
	//			КонецЕсли;
	//		КонецЕсли;
	//		
	//		ДоОбъектОтменяемый.Записать(РежимЗаписиДокумента.Запись);

	//	КонецЦикла;
	//КонецЕсли;
	////-МАН
	//-МАН
	
	ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	Стр.СостояниеДокумента = 0; 
	
	
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("Приказ", Стр.Ссылка);
	//Если Стр.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.Базовый Тогда
	//    Запрос.Текст = "ВЫБРАТЬ
	//                   |	ЛБ_ПрейскурантЦенНаМеталлы.Ссылка КАК Ссылка
	//                   |ИЗ
	//                   |	Документ.ЛБ_ПрейскурантЦенНаМеталлы КАК ЛБ_ПрейскурантЦенНаМеталлы
	//                   |ГДЕ
	//                   |	ЛБ_ПрейскурантЦенНаМеталлы.Приказ = &Приказ
	//                   |	И ЛБ_ПрейскурантЦенНаМеталлы.Проведен = ИСТИНА
	//                   |
	//                   |ОБЪЕДИНИТЬ ВСЕ
	//                   |
	//                   |ВЫБРАТЬ
	//                   |	ЛБ_ПрейскурантЦенНаДрагоценныеКамни.Ссылка
	//                   |ИЗ
	//                   |	Документ.ЛБ_ПрейскурантЦенНаДрагоценныеКамни КАК ЛБ_ПрейскурантЦенНаДрагоценныеКамни
	//                   |ГДЕ
	//                   |	ЛБ_ПрейскурантЦенНаДрагоценныеКамни.Приказ = &Приказ
	//                   |	И ЛБ_ПрейскурантЦенНаДрагоценныеКамни.Проведен = ИСТИНА
	//                   |
	//                   |ОБЪЕДИНИТЬ ВСЕ
	//                   |
	//                   |ВЫБРАТЬ
	//                   |	ЛБ_ПрейскурантПроцентныхСтавок.Ссылка
	//                   |ИЗ
	//                   |	Документ.ЛБ_ПрейскурантПроцентныхСтавок КАК ЛБ_ПрейскурантПроцентныхСтавок
	//                   |ГДЕ
	//                   |	ЛБ_ПрейскурантПроцентныхСтавок.Приказ = &Приказ
	//                   |	И ЛБ_ПрейскурантПроцентныхСтавок.Проведен = ИСТИНА";	    
	//Иначе                                                                    
	//    Запрос.Текст = "ВЫБРАТЬ
	//                   |	ЛБ_АкцииМеталлы.Ссылка КАК Ссылка
	//                   |ИЗ
	//                   |	Документ.ЛБ_АкцииМеталлы КАК ЛБ_АкцииМеталлы
	//                   |ГДЕ
	//                   |	ЛБ_АкцииМеталлы.Приказ = &Приказ
	//                   |	И ЛБ_АкцииМеталлы.Проведен = ИСТИНА
	//                   |
	//                   |ОБЪЕДИНИТЬ ВСЕ
	//                   |
	//                   |ВЫБРАТЬ
	//                   |	ЛБ_АкцииПроцентныеСтавки.Ссылка
	//                   |ИЗ
	//                   |	Документ.ЛБ_АкцииПроцентныеСтавки КАК ЛБ_АкцииПроцентныеСтавки
	//                   |ГДЕ
	//                   |	ЛБ_АкцииПроцентныеСтавки.Приказ = &Приказ
	//                   |	И ЛБ_АкцииПроцентныеСтавки.Проведен = ИСТИНА";
	//КонецЕсли;
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл  
	//    ДокОбъект =  Выборка.Ссылка.ПолучитьОбъект();
	//    ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	//КонецЦикла;	   
	//
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПроведение(Команда)
	//ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;
	//Если НЕ ТекСтрока = неопределено Тогда
	//	ЕстьДокументы = ПроверитьНаличиеДокументов(ТекСтрока.Ссылка);
	//	
	//	Если ЕстьДокументы Тогда
	//		Предупреждение("Отмена проведения приказа невозможна, есть другие документы!");
	//		Возврат;
	//	Иначе
	//		//+МАН 20.03.25
	//		Если ТекСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП")
	//			И ТекущаяДата() > ТекСтрока.Дата + 86400 Тогда
	//			
	//			Предупреждение("Отмена проведения приказа невозможна, прошло больше суток с момента проведения документа!");
	//			Возврат;
	//		КонецЕсли;
	//		//-МАН
	//		
	//		ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();		
	//		РаспровестиДокументСервере(ИдентификаторСтроки); 
	//		ПолучитьОбъектПриказа(ИдентификаторСтроки);
	//	КонецЕсли;
	//КонецЕсли;
	
	ОтменитьПроведение = ПередОтменитьПроведение(Истина);
КонецПроцедуры

&НаКлиенте
Функция ПередОтменитьПроведение(ОтменаПроведения = Ложь, Удаление = Ложь)
	ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда
		ЕстьДокументы = ПроверитьНаличиеДокументов(ТекСтрока.Ссылка);
		
		Если ЕстьДокументы Тогда
			Предупреждение(?(ОтменаПроведения, "Отмена проведения приказа невозможна", "Удаление приказа невозможно") + ", есть последующие операции или приказы!");
			Возврат Ложь;
		Иначе
			//+МАН 20.03.25
			//Если ТекСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП")
			//	И ТекущаяДата() > ТекСтрока.Дата + 86400 Тогда
			Если ТекущаяДата() > ТекСтрока.Дата + 86400 Тогда
				
				Предупреждение(?(ОтменаПроведения, "Отмена проведения приказа невозможна", "Удаление приказа невозможно") + ", прошло больше суток с момента проведения документа!");
				Возврат Ложь;
			КонецЕсли;
			//-МАН
			
			ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();		
			РаспровестиДокументСервере(ИдентификаторСтроки); 
			ПолучитьОбъектПриказа(ИдентификаторСтроки);
		КонецЕсли;
		
		Возврат Истина;
	КонецЕсли;	
КонецФункции

&НаКлиенте
Процедура ПечатьПриказа(Команда)
	ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда   

		РезультатПроверкиЗаполненияСотрудников = ПроверитьЗаполнениеСотрудников(ТекСтрока.Ссылка);
		Если РезультатПроверкиЗаполненияСотрудников Тогда
			Сообщить("Выбраны не все сотрудники в параметрах печати!");
			Возврат;
		КонецЕсли;
		
		//+МАН 09.10.25 Дабавлена проверка на наличие контактной информации
		ЕстьДанныеЗалогодателя = ПроверитьНаличиеДанныхЗалогодателей(ТекСтрока.Ссылка);
		Если НЕ ЕстьДанныеЗалогодателя Тогда
			Возврат;
		КонецЕсли;
		//-МАН
		
		Если ТекСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.ВИП") Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ИменаМакетов", "ПриказУстановкиВИП"); 
			ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_ПриказИндивидуальныеУсловия");
			МассивОбъектов = Новый Массив;
			МассивОбъектов.Добавить(ТекСтрока.Ссылка);
			ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
			ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,); 
		Иначе     
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ИменаМакетов", "ПриказОтмены"); 
			ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_ПриказИндивидуальныеУсловия");
			МассивОбъектов = Новый Массив;
			МассивОбъектов.Добавить(ТекСтрока.Ссылка);
			ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
			ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,); 
		КонецЕсли;	
    КонецЕсли;
КонецПроцедуры  

&НаСервере 
Функция ПроверитьНаличиеДанныхЗалогодателей(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Залогодатель КАК Залогодатель,
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Пол КАК Пол,
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.Период КАК Период,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК Серия,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК Номер,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДатаВыдачи,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК КемВыдан,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК КодПодразделения,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК СрокДействия
		|ИЗ
		|	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&Дата, ДокументЗалогодателя.Владелец = &Залогодатель) КАК ЛБ_ДокументыЗалогодателейСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, ) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних
		|		ПО (ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Залогодатель = ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя.Владелец)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
		
	Запрос.УстановитьПараметр("Дата", НачалоДня(Ссылка.Дата));
	
	Текст = "";
	Для каждого СтрЗ Из Ссылка.Залогодатели Цикл
		Запрос.УстановитьПараметр("Залогодатель", СтрЗ.Залогодатель);
			
		Результат = Запрос.Выполнить().Выбрать();
		
		Если НЕ Результат.Следующий() Тогда
			Текст = ?(Текст = "", "", Текст + Символы.ПС);
			Текст = Текст + "У залогодателя " + СтрЗ.Залогодатель + " не корректно заполнена карточка.";
		КонецЕсли;
	КонецЦикла;
	
	Если Текст <> "" Тогда
		Сообщить(Текст);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере 
Функция ПолучитьСписокСК() 
	СК = Новый СписокЗначений;
    Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СхемыКредитования.Ссылка КАК СхемаКредитования
	               |ИЗ
	               |	Справочник.ЛБ_СхемыКредитования КАК ЛБ_СхемыКредитования
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_УсловияПредоставленияКредита.СрезПоследних(&Дата, ) КАК ЛБ_УсловияПредоставленияКредитаСрезПоследних
	               |		ПО (ЛБ_УсловияПредоставленияКредитаСрезПоследних.СхемаКредитования = ЛБ_СхемыКредитования.Ссылка)
	               |ГДЕ
	               |	ЛБ_СхемыКредитования.ПометкаУдаления = ЛОЖЬ";
				   //|	И ЛБ_УсловияПредоставленияКредитаСрезПоследних.НеАктуальная = ЛОЖЬ";
	ТЗ = Запрос.Выполнить().Выгрузить();     
	Массив = ТЗ.ВыгрузитьКолонку("СхемаКредитования");//выгружаем таблицу значений в массив
    СК.ЗагрузитьЗначения(Массив);//загружаем массив в список значений  
	
	Возврат СК;
КонецФункции	

&НаСервере
Функция ПолучитьМассивВыбранныхСхемКредитования()  	
	СК = ТекущийПриказ.НастройкаОтклоненийОтБазовыхЦенМеталлы.Выгрузить();
	СК.Свернуть("СхемаКредитования");
	Возврат ЛБ_УправлениеЛомбардом.ПреобразованиеТаблицыЗначенийВМассив(СК);
КонецФункции	

&НаКлиенте
Процедура РедактироватьЦеныМеталлы(Команда)
    ПараметрыФормы = Новый Структура;    
	ПараметрыФормы.Вставить("Документ", ТекущийПриказ); 
	Если ТекущийПриказ.Проведен Тогда
		ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
	КонецЕсли;	  
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеРедактированияМеталлов",ЭтаФорма);
	
	ОткрытьФорму("ОбщаяФорма.ЛБ_ЗаполнениеЦенМеталловИзПриказа", ПараметрыФормы,,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
КонецПроцедуры  

&НаКлиенте
Процедура ПроверитьВыборСК(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;  
	
	ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;  
	ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
	ПолучитьОбъектПриказа(ИдентификаторСтроки);  
	ОбработатьИзменениеТабличныхЧастейПриказа();
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьЦеныМеталловПоСценариюНаСервере(ТаблицаБазовыхЦен) 
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);	
	ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");
	ДокументОбъект.ЦеныМеталлы.Очистить(); 
	ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенМеталлы.Очистить();
	ТаблицаЦен = ДокументОбъект.ЦеныМеталлы.Выгрузить();     
	
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("Дата", ДатаДок);
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ЛБ_ОтносительныеОтклоненияОтБазовыхЦенМеталлыСрезПоследних.СхемаКредитования КАК СхемаКредитования,
	//               |	ЛБ_ОтносительныеОтклоненияОтБазовыхЦенМеталлыСрезПоследних.Металл КАК Металл,
	//               |	ЛБ_ОтносительныеОтклоненияОтБазовыхЦенМеталлыСрезПоследних.ПроцентОтклонения КАК ПроцентОтклонения,
	//               |	ЛБ_ОтносительныеОтклоненияОтБазовыхЦенМеталлыСрезПоследних.УстанавливатьОтклонение КАК УстанавливатьОтклонение
	//               |ИЗ
	//               |	РегистрСведений.ЛБ_ОтносительныеОтклоненияОтБазовыхЦенМеталлы.СрезПоследних(&Дата, ) КАК ЛБ_ОтносительныеОтклоненияОтБазовыхЦенМеталлыСрезПоследних";
	//ТаблицаНастроек = Запрос.Выполнить().Выгрузить(); 
	//ТаблицаСК = ТаблицаНастроек.Скопировать(); 
	//ТаблицаСК.Свернуть("СхемаКредитования");
	
	//заполним таблицу цен по сценарию
	Для каждого Стр Из ДокументОбъект.СценарийОценкиМеталлов.БазовыеНастройки Цикл  
		БазоваяЦена = 0;
		ОтборЦен = Новый структура;
		ОтборЦен.Вставить("БазоваяПроба", Стр.БазоваяПроба); 
		ОтборЦен.Вставить("БазоваяКатегория", Стр.БазоваяКатегория);
		
		СтрокиЦен = ТаблицаБазовыхЦен.НайтиСтроки(ОтборЦен);
		Если НЕ СтрокиЦен.Количество() = 0 Тогда 
			БазоваяЦена = СтрокиЦен[0].БазоваяЦена;
		КонецЕсли;	
		
		Для каждого СтрГруппа Из Стр.БазоваяПроба.Пробы Цикл
		    НоваяСтр = ТаблицаЦен.Добавить();
		    НоваяСтр.Металл = Стр.Металл;
		    НоваяСтр.Проба = СтрГруппа.Проба;
		    НоваяСтр.КатегорияОбъектаЗалога = Стр.БазоваяКатегория;
		    НоваяСтр.Цена = БазоваяЦена;
		    НоваяСтр.ЕдиницаИзмерения = ОсновнаяЕдиницаИзмерения;
		КонецЦикла;
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки", Стр.КлючСтроки);
		Строки =  ДокументОбъект.СценарийОценкиМеталлов.ОценкаПоБазовойКатегории.НайтиСтроки(Отбор);
		Для каждого СтрО Из Строки Цикл
			Если (СтрО.Проба = Стр.БазоваяПроба) И (СтрО.КатегорияОбъектаЗалога = Стр.БазоваяКатегория) Тогда 
			    Продолжить;
			КонецЕсли;	 
			Для каждого СтрГруппа Из СтрО.Проба.Пробы Цикл
			    НоваяСтр = ТаблицаЦен.Добавить();
			    НоваяСтр.Металл = Стр.Металл;
			    НоваяСтр.Проба = СтрГруппа.Проба;
			    НоваяСтр.КатегорияОбъектаЗалога = СтрО.КатегорияОбъектаЗалога;
			    НоваяСтр.Цена = ?(СтрО.ОклонениеОтБазовой = Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Абсолютное, БазоваяЦена + СтрО.ЗначениеОтклонения, БазоваяЦена * (1+СтрО.ЗначениеОтклонения/100));
			    Если ЗначениеЗаполнено(СтрО.ПорядокОкругления) Тогда
			        НоваяСтр.Цена = ЛБ_ОбщийМодуль.ОкруглитьЦену(НоваяСтр.Цена, СтрО.ПорядокОкругления, СтрО.ОкруглятьВБольшуюСторону);
			    КонецЕсли;	 
			    НоваяСтр.ЕдиницаИзмерения = ОсновнаяЕдиницаИзмерения;  
			КонецЦикла;	
		КонецЦикла;
	Конеццикла;	  
	
	Для каждого СтрН Из ДокументОбъект.СценарийОценкиМеталлов.НастройкаОтклоненийОтБазовыхЦен Цикл 
		 Для каждого СтрГруппа Из СтрН.Проба.Пробы Цикл
			 НоваяСтрН = ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенМеталлы.Добавить();
			 НоваяСтрН.СхемаКредитования = СтрН.СхемаКредитования;  
			 НоваяСтрН.КатегорияОбъектаЗалога = СтрН.КатегорияОбъектаЗалога;
			 НоваяСтрН.Металл = СтрН.Металл;
			 НоваяСтрН.Проба = СтрГруппа.Проба;
			 НоваяСтрН.ОтклонениеОтБазовойЦены = СтрН.ОтклонениеОтБазовойЦены; 
			 НоваяСтрН.ЗначениеОтклонения = СтрН.ЗначениеОтклонения; 
		 КонецЦикла;	 
	Конеццикла;	
	
	//Для каждого Стр Из ШаблонМеталлы.Металлы Цикл
	//     НоваяСтр = ДокументОбъект.ЦеныМеталлы.Добавить();
	//	 НоваяСтр.Металл = Стр.Металл;
	//	 НоваяСтр.Проба = Стр.Проба;
	//	 НоваяСтр.КатегорияОбъектаЗалога = Стр.КатегорияОбъектаЗалога;
	//	 
	//	 Отбор = новый Структура;
	//	 Отбор.Вставить("Металл", Стр.Металл);
	//	 Отбор.Вставить("Проба", Стр.Проба);
	//	 Отбор.Вставить("КатегорияОбъектаЗалога", Стр.КатегорияОбъектаЗалога);
	//	 
	//	 СтрокиЦен = ТаблицаЦен.НайтиСтроки(Отбор);
	//	 Если СтрокиЦен.Количество() = 0 Тогда
	//		 НоваяСтр.ЕдиницаИзмерения = ОсновнаяЕдиницаИзмерения;
	//	 Иначе
	//		 СтрЦ = СтрокиЦен.Получить(0);
	//		 НоваяСтр.Цена = СтрЦ.Цена;
	//		 НоваяСтр.ЕдиницаИзмерения = СтрЦ.ЕдиницаИзмерения;
	//	 КонецЕсли;	
	//	 
	//	 Если НЕ ТаблицаСК.Количество() = 0 тогда
	//		Для каждого СтрК Из ТаблицаСК Цикл
	//			ОтборН = новый Структура;
	//			ОтборН.Вставить("СхемаКредитования", СтрК.СхемаКредитования);	
	//			ОтборН.Вставить("Металл", Стр.Металл);
	//			СтрокиН = ТаблицаНастроек.НайтиСтроки(ОтборН); 
	//			Если СтрокиН.Количество() = 0 Тогда 
	//				ОтборН.Вставить("Металл", Справочники.ЛБ_ДрагоценныеМеталлы.ПустаяСсылка()); 
	//				СтрокиН = ТаблицаНастроек.НайтиСтроки(ОтборН); 
	//			КонецЕсли;	
	//			Если СтрокиН.Количество() = 0 Тогда
	//				НоваяСтрН = ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенМеталлы.Добавить();
	//				НоваяСтрН.СхемаКредитования = СтрК.СхемаКредитования; 
	//				НоваяСтрН.Металл = Стр.Металл;
	//                НоваяСтрН.Проба = Стр.Проба;
	//                НоваяСтрН.КатегорияОбъектаЗалога = Стр.КатегорияОбъектаЗалога;
	//            Иначе 
	//				Для каждого СтрН Из СтрокиН Цикл  
	//					НоваяСтрН = ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенМеталлы.Добавить();
	//					НоваяСтрН.СхемаКредитования = СтрК.СхемаКредитования; 
	//					НоваяСтрН.Металл = Стр.Металл;
	//	                НоваяСтрН.Проба = Стр.Проба;
	//	                НоваяСтрН.КатегорияОбъектаЗалога = Стр.КатегорияОбъектаЗалога;
	//			        НоваяСтрН.ОтклонениеОтБазовойЦены = СтрН.УстанавливатьОтклонение; 
	//					Если НоваяСтрН.ОтклонениеОтБазовойЦены = Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Относительное Тогда
	//                        НоваяСтрН.ЗначениеОтклонения = СтрН.ПроцентОтклонения;  
	//					Иначе 
	//						НоваяСтрН.ЗначениеОтклонения = Стр.Цена*СтрН.ПроцентОтклонения/100 - Стр.Цена;
	//					КонецЕсли;	
	//				КонецЦикла;	
	//			КонецЕсли;	
	//		Конеццикла;
	//	КонецЕсли;   

	//конецЦикла;	 
	
	ДокументОбъект.ЦеныМеталлы.Загрузить(ТаблицаЦен);
	ДокументОбъект.ЦеныМеталлы.Сортировать("Металл, Проба, КатегорияОбъектаЗалога"); 
	ДокументОбъект.Записать();    
	СтрокаПриказа = ТаблицаПриказов.НайтиПоИдентификатору(ТекущийПриказИдентификатор);
	ПолучитьДополнительныеРеквизиты(СтрокаПриказа);
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьЦеныМеталловПоСценарию(Команда)
	Если ЗначениеЗаполнено(ТекущийПриказ.СценарийОценкиМеталлов) Тогда 
		//ШаблонПриказа = ПолучитьТекущийШаблон(ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПрейскурантов.Металлы"));
		//Если НЕ ШаблонПриказа = неопределено Тогда  
		Параметрыформы = Новый структура;
		ПараметрыФормы.Вставить("Сценарий", ТекущийПриказ.СценарийОценкиМеталлов);
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораБазовыхЦен",ЭтаФорма);
		ОткрытьФорму("Справочник.ЛБ_СценарииОценки.Форма.ФормаКорректировкиБазовыхЦен", Параметрыформы, ЭтаФорма,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		//ЗаполнитьЦеныМеталловПоСценариюНаСервере(ШаблонПриказа); 
		//ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;  
		//ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
		//ПолучитьОбъектПриказа(ИдентификаторСтроки);
		//Иначе  
		//	Сообщить("Не установлен шаблон цен металлов!");
		//КонецЕсли;			    
	Иначе
		Сообщить("Не выбран сценарий оценки!");
	КонецЕсли;	
КонецПроцедуры
  
&НаКлиенте
Процедура ПослеВыбораБазовыхЦен(Результат, ДопПараметры) Экспорт 
	Если Результат = неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЦеныМеталловПоСценариюНаСервере(Результат.ТаблицаБазовыхЦен);  
	
	ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;  
	ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
	ПолучитьОбъектПриказа(ИдентификаторСтроки);
КонецПроцедуры	

&НаСервере
Функция ПолучитьКраткоеНаименованиеСК(СК) 
	Возврат СК.НаименованиеКраткое;
КонецФункции

&НаКлиенте
Процедура ЦеныМеталлыЦенаБазоваяПриИзменении(Элемент)
	//ТекСтрока = Элементы.ЦеныМеталлы.ТекущиеДанные;  
	//Для каждого СтрК Из СхемыКредитования Цикл 
	//	ИмяКолонки = "Цена_" + СокрЛП(ПолучитьКраткоеНаименованиеСК(СтрК.СхемаКредитования));
	//    ТекСтрока[ИмяКолонки] = ПолучитьЦенуСКМеталлы(СтрК.СхемаКредитования, ТекСтрока.КатегорияОбъектаЗалога, ТекСтрока.Проба, ТекСтрока.Цена);  
	//КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораПриказаНаСервере(ИдентификаторСтроки) 	
	СтрП = ТаблицаПриказов.НайтиПоИдентификатору(ИдентификаторСтроки);
	СтрП.ВидПриказа = СтрП.Ссылка.ВидПриказа;
	СтрП.НомерПриказа = СтрП.Ссылка.НомерПриказа;
	//СтрП.СтрокаЛомбарды = СтрП.Ссылка.СтрокаЛомбарды;
	СтрП.Комментарий = СтрП.Ссылка.Комментарий;  
	СтрП.Дата = СтрП.Ссылка.Дата;
	СтрП.ДатаНачалаДействияПриказа = СтрП.Ссылка.ДатаНачалаДействияПриказа;
	СтрП.ДатаОкончанияДействияПриказа = СтрП.Ссылка.ДатаОкончанияДействияПриказа; 	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПриказа(Результат, ДопПараметры) Экспорт 
	ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;   
	ТекущийПриказИдентификатор = ТекСтрока.ПолучитьИдентификатор();
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	ПослеВыбораПриказаНаСервере(ТекущийПриказИдентификатор);
КонецПроцедуры	

&НаКлиенте
Процедура ПослеВыбораЛомбарда(Результат, ДопПараметры) Экспорт 
	Если Результат = неопределено Тогда
	    Возврат;
	КонецЕсли;
	
	ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;
	ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Ломбард", Результат); 
	ПараметрыФормы.Вставить("Дата", ТекСтрока.Дата);
		
	ОткрытьФорму("Отчет.ЛБ_УсловияЗаймаВЛомбарде.Форма.ФормаОтчета", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры	

&НаКлиенте
Процедура ТаблицаПриказовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда  
		СписокВыбора = Новый СписокЗначений; 
		
		Если ЕстьПолныеПрава Тогда
		    СписокВыбора.Добавить("Документ", "Открыть приказ"); 
		КонецЕсли;	
		СписокВыбора.Добавить("Отчет", "Открыть отчет по условиям займа"); 
		СписокВыбора.Добавить("Печать", "Печать приказа");

		ВыбранноеЗначение = ВыбратьИзМеню(СписокВыбора, Элементы.ТаблицаПриказов.ТекущаяСтрока); 
		
		Если НЕ ВыбранноеЗначение = неопределено Тогда
			Если ВыбранноеЗначение.Значение = "Документ" Тогда
			    ПараметрыФормы = Новый Структура;
			    ПараметрыФормы.Вставить("Ключ", ТекСтрока.Ссылка);
				
				ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораПриказа",ЭтаФорма);
				ОткрытьФорму("Документ.ЛБ_ПриказУсловияПредоставленияЗаймов.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			ИначеЕсли ВыбранноеЗначение.Значение = "Отчет" Тогда 
			    ПараметрыФормы = Новый Структура;
			    ПараметрыФормы.Вставить("Приказ", ТекСтрока.Ссылка);
				
				Если ТекущийПриказ.Ломбарды.Количество() > 1 Тогда
					ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЛомбарда",ЭтаФорма);
					ОткрытьФорму("ОбщаяФорма.ЛБ_ВыборЛомбардаИзПриказа", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
				Иначе 
					ПараметрыФормы = Новый Структура; 
					Если ТекущийПриказ.Ломбарды.Количество() = 1 Тогда
				        ПараметрыФормы.Вставить("Ломбард", ТекущийПриказ.Ломбарды.Получить(0).Ломбард); 
					Иначе 
						ПараметрыФормы.Вставить("Ломбард", ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ПустаяСсылка"));
					КонецЕсли;	
					ПараметрыФормы.Вставить("Дата", ТекСтрока.Дата);
						
					ОткрытьФорму("Отчет.ЛБ_УсловияЗаймаВЛомбарде.Форма.ФормаОтчета", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.Независимый);
				КонецЕсли;	
			ИначеЕсли ВыбранноеЗначение.Значение = "Печать" Тогда
				Если ТекСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.Базовый") Тогда		
					ПараметрыФормы = Новый Структура;
					ПараметрыФормы.Вставить("ИменаМакетов", "Приказ"); 
					ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_ПриказУсловияПредоставленияЗаймов");
					МассивОбъектов = Новый Массив;
					МассивОбъектов.Добавить(ТекСтрока.Ссылка);
					ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
					ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,); 
				Иначе     
					ПараметрыФормы = Новый Структура;
					ПараметрыФормы.Вставить("ИменаМакетов", "Акция"); 
					ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_ПриказУсловияПредоставленияЗаймов");
					МассивОбъектов = Новый Массив;
					МассивОбъектов.Добавить(ТекСтрока.Ссылка);
					ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
					ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,); 
				КонецЕсли;	
			КонецЕсли; 
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьЦеныМеталловПоНастройкамНаСервере(ШаблонМеталлы) 
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");
	ДокументОбъект.ЦеныМеталлы.Очистить();
		
	Для каждого Стр Из ШаблонМеталлы.Металлы Цикл
	     НоваяСтр = ДокументОбъект.ЦеныМеталлы.Добавить();
		 НоваяСтр.Металл = Стр.Металл;
		 НоваяСтр.Проба = Стр.Проба;
		 НоваяСтр.КатегорияОбъектаЗалога = Стр.КатегорияОбъектаЗалога;
		 НоваяСтр.ЕдиницаИзмерения = ОсновнаяЕдиницаИзмерения;		 
	 конецЦикла;	
	 ДокументОбъект.ЦеныМеталлы.Сортировать("Металл, Проба, КатегорияОбъектаЗалога");
	 ДокументОбъект.ШаблонМеталлы = ШаблонМеталлы;
	 ДокументОбъект.Записать();  
	 СтрокаПриказа = ТаблицаПриказов.НайтиПоИдентификатору(ТекущийПриказИдентификатор);
	 ПолучитьДополнительныеРеквизиты(СтрокаПриказа);
КонецПроцедуры    

&НаСервере
Функция ПолучитьТекущийШаблон(ВидПрейскуранта)
	СписокЛ = Новый СписокЗначений; 
	СписокЛ.Добавить(Справочники.ЛБ_Ломбарды.ПустаяСсылка());
	Для каждого Стр Из ТекущийПриказ.Ломбарды цикл 
		СписокЛ.Добавить(Стр.Ломбард);
	Конеццикла;	
	Возврат ЛБ_ОбщийМодуль.ПолучитьТекущийШаблон(ДатаДок, ВидПрейскуранта, СписокЛ);
КонецФункции

&НаСервере
Функция ПолучитьТекущийШаблонАкция(ВидПрейскуранта)
	Возврат ЛБ_ОбщийМодуль.ПолучитьТекущийШаблонАкция(ДатаДок, Перечисления.ЛБ_ВидыПрейскурантов.Металлы, );
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьЦеныМеталловПоНастройкам(Команда)
	ШаблонПриказа = ПолучитьТекущийШаблон(ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПрейскурантов.Металлы"));  
	Если НЕ ШаблонПриказа = неопределено Тогда 
		ЗаполнитьЦеныМеталловПоНастройкамНаСервере(ШаблонПриказа);  
		ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;  
		ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
		ПолучитьОбъектПриказа(ИдентификаторСтроки);
		Если НЕ ТекущийПриказ.Ломбарды.Количество() = 0 Тогда 
			Режим = РежимДиалогаВопрос.ДаНет;
			Ответ = Вопрос("Заполнить цены металлов по текущим данным в ломбарде?", Режим, 0);
			Если Ответ = КодВозвратаДиалога.Да Тогда									
				Если ТекущийПриказ.Ломбарды.Количество() = 1 Тогда
					ПроставитьМеталлыПоТекущимНастройкам(ТекущийПриказ.Ломбарды.Получить(0).Ломбард); 
				Иначе
					ПараметрыФормы = Новый Структура;
				    ПараметрыФормы.Вставить("Приказ", ТекущийПриказ.Ссылка); 
					
					ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЛомбардаМеталлы", ЭтаФорма);
					ОткрытьФорму("ОбщаяФорма.ЛБ_ВыборЛомбардаИзПриказа", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
				КонецЕсли;
				ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;  
				ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
				ПолучитьОбъектПриказа(ИдентификаторСтроки);
			КонецЕсли;	
		КонецЕсли;
	Иначе  
		Сообщить("Не установлен шаблон цен металлов!");
	КонецЕсли;			    
КонецПроцедуры   

&НаКлиенте
Процедура ЗаполнитьЦеныМеталловПоШаблону(Команда) 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор",Ложь); 

	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораШаблонаМеталлов", ЭтаФорма);

	ОткрытьФорму("Справочник.ЛБ_ШаблоныПриказовМеталлы.ФормаВыбора",ПараметрыФормы,
	        ЭтаФорма, , , , ОбработкаВыбора);
КонецПроцедуры  
		
&НаКлиенте
Процедура ПриЗакрытииФормыВыбораШаблонаМеталлов(Значение, ДопПараметры) Экспорт

	Если Значение = Неопределено Тогда  
		Возврат;
    КонецЕсли;
     
    ШаблонПриказа  = Значение;  
    ЗаполнитьЦеныМеталловПоНастройкамНаСервере(ШаблонПриказа);  
    ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;  
    ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
    ПолучитьОбъектПриказа(ИдентификаторСтроки);
    Если НЕ ТекущийПриказ.Ломбарды.Количество() = 0 Тогда 
	    Режим = РежимДиалогаВопрос.ДаНет;
	    Ответ = Вопрос("Заполнить цены металлов по текущим данным в ломбарде?", Режим, 0);
	    Если Ответ = КодВозвратаДиалога.Да Тогда									
		    Если ТекущийПриказ.Ломбарды.Количество() = 1 Тогда
		        ПроставитьМеталлыПоТекущимНастройкам(ТекущийПриказ.Ломбарды.Получить(0).Ломбард); 
		    Иначе
		        ПараметрыФормы = Новый Структура;
			    ПараметрыФормы.Вставить("Приказ", ТекущийПриказ.Ссылка); 
				
			    ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЛомбардаМеталлы", ЭтаФорма);
		  	    ОткрытьФорму("ОбщаяФорма.ЛБ_ВыборЛомбардаИзПриказа", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
		    КонецЕсли;
		    ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;  
		    ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
		    ПолучитьОбъектПриказа(ИдентификаторСтроки);
	    КонецЕсли;	
    КонецЕсли;
КонецПроцедуры		
		
&НаКлиенте
Процедура ПослеВыбораЛомбардаМеталлы(Результат, ДопПараметры) Экспорт 
	Если Результат = неопределено Тогда
	   Возврат; 	
	КонецЕсли;
	ПроставитьМеталлыПоТекущимНастройкам(Результат);
КонецПроцедуры	

&НаСервере
Процедура ПроставитьМеталлыПоТекущимНастройкам(Ломбард) 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних.Проба.Владелец КАК Металл,
	               |	ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних.Проба КАК Проба,
	               |	ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних.Категория КАК КатегорияОбъектаЗалога,
	               |	ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних.Цена КАК Цена,
	               |	ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПрейскурантЦенНаМеталлы.СрезПоследних(
	               |			&Дата,
	               |			Ломбард = &Ломбард
	               |				И ДатаНачалаДействия < &Дата) КАК ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Металл,
	               |	Проба,
	               |	КатегорияОбъектаЗалога";
	ТаблицаЦен = Запрос.Выполнить().Выгрузить();   
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОтносительныеОтклоненияОтБазовыхЦенМеталлыСрезПоследних.СхемаКредитования КАК СхемаКредитования,
	               |	ЛБ_ОтносительныеОтклоненияОтБазовыхЦенМеталлыСрезПоследних.Металл КАК Металл,
	               |	ЛБ_ОтносительныеОтклоненияОтБазовыхЦенМеталлыСрезПоследних.ПроцентОтклонения КАК ПроцентОтклонения,
	               |	ЛБ_ОтносительныеОтклоненияОтБазовыхЦенМеталлыСрезПоследних.УстанавливатьОтклонение КАК УстанавливатьОтклонение
	               |ИЗ
	               |	РегистрСведений.ЛБ_ОтносительныеОтклоненияОтБазовыхЦенМеталлы.СрезПоследних(&Дата, ) КАК ЛБ_ОтносительныеОтклоненияОтБазовыхЦенМеталлыСрезПоследних";
	ТаблицаНастроек = Запрос.Выполнить().Выгрузить(); 
	ТаблицаСК = ТаблицаНастроек.Скопировать(); 
	ТаблицаСК.Свернуть("СхемаКредитования");

	Если НЕ ТаблицаЦен.Количество() = 0 тогда     
		ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
		ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");
		ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенМеталлы.Очистить();
		
		Для каждого Стр Из ДокументОбъект.ЦеныМеталлы Цикл
			Отбор = новый Структура;
			Отбор.Вставить("Металл", Стр.Металл);
			Отбор.Вставить("Проба", Стр.Проба);
			Отбор.Вставить("КатегорияОбъектаЗалога", Стр.КатегорияОбъектаЗалога);
			 
			СтрокиЦен = ТаблицаЦен.НайтиСтроки(Отбор);
			Если НЕ СтрокиЦен.Количество() = 0 Тогда
				СтрЦ = СтрокиЦен.Получить(0);
				Стр.Цена = СтрЦ.Цена;
			КонецЕсли;	 
			
			Если НЕ ТаблицаСК.Количество() = 0 тогда
				Для каждого СтрК Из ТаблицаСК Цикл
					ОтборН = новый Структура;
					ОтборН.Вставить("СхемаКредитования", СтрК.СхемаКредитования);	
					ОтборН.Вставить("Металл", Стр.Металл);
					СтрокиН = ТаблицаНастроек.НайтиСтроки(ОтборН); 
					Если СтрокиН.Количество() = 0 Тогда 
						ОтборН.Вставить("Металл", Справочники.ЛБ_ДрагоценныеМеталлы.ПустаяСсылка()); 
						СтрокиН = ТаблицаНастроек.НайтиСтроки(ОтборН); 
					КонецЕсли;	
					Если СтрокиН.Количество() = 0 Тогда
						НоваяСтрН = ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенМеталлы.Добавить();
						НоваяСтрН.СхемаКредитования = СтрК.СхемаКредитования; 
						НоваяСтрН.Металл = Стр.Металл;
		                НоваяСтрН.Проба = Стр.Проба;
		                НоваяСтрН.КатегорияОбъектаЗалога = Стр.КатегорияОбъектаЗалога;
                    Иначе 
						Для каждого СтрН Из СтрокиН Цикл  
							НоваяСтрН = ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенМеталлы.Добавить();
							НоваяСтрН.СхемаКредитования = СтрК.СхемаКредитования; 
							НоваяСтрН.Металл = Стр.Металл;
			                НоваяСтрН.Проба = Стр.Проба;
			                НоваяСтрН.КатегорияОбъектаЗалога = Стр.КатегорияОбъектаЗалога;
					        НоваяСтрН.ОтклонениеОтБазовойЦены = СтрН.УстанавливатьОтклонение; 
							Если НоваяСтрН.ОтклонениеОтБазовойЦены = Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Относительное Тогда
	                            НоваяСтрН.ЗначениеОтклонения = СтрН.ПроцентОтклонения;  
							Иначе 
								НоваяСтрН.ЗначениеОтклонения = Стр.Цена*СтрН.ПроцентОтклонения/100 - Стр.Цена;
							КонецЕсли;	
						КонецЦикла;	
					КонецЕсли;	
				Конеццикла;
			КонецЕсли;   
		КонецЦикла;	
		
		ДокументОбъект.Записать();     
		ПолучитьОбъектПриказа(ТекущийПриказИдентификатор); 
		СтрокаПриказа = ТаблицаПриказов.НайтиПоИдентификатору(ТекущийПриказИдентификатор);
		ПолучитьДополнительныеРеквизиты(СтрокаПриказа); 
	КонецЕсли;	
		 
КонецПроцедуры	 

&НаСервере
Процедура ЗаполнитьЦеныВставокПоНастройкамНаСервере(ШаблонВставки)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.Ломбард КАК Ломбард,
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.ВидВставки КАК ВидВставки,
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.ВесоваяГруппа КАК ВесоваяГруппа,
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.ФормаОгранки КАК ФормаОгранки,
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.ВидОгранки КАК ВидОгранки,
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.КачествоОгранки КАК КачествоОгранки,
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.Цена КАК Цена,
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПрейскурантЦенНаДрагоценныеКамни.СрезПоследних(&Дата, Ломбард В (&Ломбарды)) КАК ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВидВставки,
	               |	ФормаОгранки,
	               |	ВидОгранки,
	               |	КачествоОгранки,
	               |	ВесоваяГруппа";
	СписокЛ = Новый СписокЗначений;
	Для каждого СтрЛ из ТекущийПриказ.Ломбарды Цикл
		СписокЛ.Добавить(СтрЛ.Ломбард);
	КонецЦикла;	
	Запрос.УстановитьПараметр("Ломбарды", СписокЛ);
	ТаблицаЦен = Запрос.Выполнить().Выгрузить();
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");
	ДокументОбъект.ЦеныВставки.Очистить();
	
	Для каждого Стр Из ШаблонВставки.Вставки Цикл
	     НоваяСтр = ДокументОбъект.ЦеныВставки.Добавить();
		 НоваяСтр.ВидВставки = Стр.Вставка;
		 НоваяСтр.ВесоваяГруппа = Стр.ВесоваяГруппа;
		 НоваяСтр.КачествоОгранки = Стр.КачествоОгранки;
		 НоваяСтр.ФормаОгранки = Стр.ФормаОгранки; 
		 НоваяСтр.ВидОгранки = Стр.ВидОгранки;
		 
		 Отбор = новый Структура;
		 Отбор.Вставить("ВидВставки", Стр.Вставка);
		 Отбор.Вставить("ВесоваяГруппа", Стр.ВесоваяГруппа);
		 Отбор.Вставить("КачествоОгранки", Стр.КачествоОгранки);
		 Отбор.Вставить("ФормаОгранки", Стр.ФормаОгранки); 
		 Отбор.Вставить("ВидОгранки", Стр.ВидОгранки);
		 
		 СтрокиЦен = ТаблицаЦен.НайтиСтроки(Отбор);
		 Если СтрокиЦен.Количество() = 0 Тогда
		     НоваяСтр.ЕдиницаИзмерения = ОсновнаяЕдиницаИзмеренияВставки;
		 Иначе
		     СтрЦ = СтрокиЦен.Получить(0);
		     НоваяСтр.Цена = СтрЦ.Цена;
		     НоваяСтр.ЕдиницаИзмерения = СтрЦ.ЕдиницаИзмерения;
		 КонецЕсли;	 
	КонецЦикла;	 
	ДокументОбъект.ШаблонВставки = ШаблонВставки;
	ДокументОбъект.Записать();
	СтрокаПриказа = ТаблицаПриказов.НайтиПоИдентификатору(ТекущийПриказИдентификатор);
	ПолучитьДополнительныеРеквизиты(СтрокаПриказа);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦеныВставокПоНастройкам(Команда) 
	ШаблонПриказа = ПолучитьТекущийШаблон(ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПрейскурантов.Вставки"));  
	Если НЕ ШаблонПриказа = неопределено Тогда 
		ЗаполнитьЦеныВставокПоНастройкамНаСервере(ШаблонПриказа); 
		ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;  
		ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
		ПолучитьОбъектПриказа(ИдентификаторСтроки);
	КонецЕсли;		
КонецПроцедуры   

&НаКлиенте
Процедура ЗаполнитьЦеныВставокПоШаблону(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор",Ложь); 

	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораШаблонаВставок", ЭтаФорма);

	ОткрытьФорму("Справочник.ЛБ_ШаблоныПриказовВставки.ФормаВыбора",ПараметрыФормы,
	        ЭтаФорма, , , , ОбработкаВыбора);
КонецПроцедуры  
		
&НаКлиенте
Процедура ПриЗакрытииФормыВыбораШаблонаВставок(Значение, ДопПараметры) Экспорт

	Если Значение = Неопределено Тогда  
		Возврат;
    КонецЕсли;
     
    ШаблонПриказа  = Значение;  
	//ЗаполнитьЦеныВставокПоНастройкамНаСервере(ШаблонПриказа); 
	ЗаполнитьОтклоненияВставокПоНастройкамНаСервере(ШаблонПриказа);
	ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;  
	ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
	ПолучитьОбъектПриказа(ИдентификаторСтроки);
КонецПроцедуры		

&НаСервере
Процедура ЗаполнитьОтклоненияВставокПоНастройкамНаСервере(ШаблонВставки)
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("Дата", ДатаДок);
	//Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	//               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.Ломбард КАК Ломбард,
	//               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.ВидВставки КАК ВидВставки,
	//               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.ВесоваяГруппа КАК ВесоваяГруппа,
	//               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.ФормаОгранки КАК ФормаОгранки,
	//               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.ВидОгранки КАК ВидОгранки,
	//               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.КачествоОгранки КАК КачествоОгранки,
	//               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.Цена КАК Цена,
	//               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	//               |ИЗ
	//               |	РегистрСведений.ЛБ_ПрейскурантЦенНаДрагоценныеКамни.СрезПоследних(&Дата, Ломбард В (&Ломбарды)) КАК ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних
	//               |
	//               |УПОРЯДОЧИТЬ ПО
	//               |	ВидВставки,
	//               |	ФормаОгранки,
	//               |	ВидОгранки,
	//               |	КачествоОгранки,
	//               |	ВесоваяГруппа";
	//СписокЛ = Новый СписокЗначений;
	//Для каждого СтрЛ из ТекущийПриказ.Ломбарды Цикл
	//	СписокЛ.Добавить(СтрЛ.Ломбард);
	//КонецЦикла;	
	//Запрос.УстановитьПараметр("Ломбарды", СписокЛ);
	//ТаблицаЦен = Запрос.Выполнить().Выгрузить();
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");
	ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенВставки.Очистить();
	
	Для каждого Стр Из ШаблонВставки.Вставки Цикл
	     НоваяСтр = ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенВставки.Добавить();
		 НоваяСтр.ВидВставки = Стр.Вставка;
		 //НоваяСтр.ВесоваяГруппа = Стр.ВесоваяГруппа;
		 НоваяСтр.КачествоОгранки = Стр.КачествоОгранки;
		 //НоваяСтр.ФормаОгранки = Стр.ФормаОгранки; 
		 НоваяСтр.ВидОгранки = Стр.ВидОгранки;
		 
		 //Отбор = новый Структура;
		 //Отбор.Вставить("ВидВставки", Стр.Вставка);
		 //Отбор.Вставить("ВесоваяГруппа", Стр.ВесоваяГруппа);
		 //Отбор.Вставить("КачествоОгранки", Стр.КачествоОгранки);
		 //Отбор.Вставить("ФормаОгранки", Стр.ФормаОгранки); 
		 //Отбор.Вставить("ВидОгранки", Стр.ВидОгранки);
		 //
		 //СтрокиЦен = ТаблицаЦен.НайтиСтроки(Отбор);
		 //Если СтрокиЦен.Количество() = 0 Тогда
		 //    НоваяСтр.ЕдиницаИзмерения = ОсновнаяЕдиницаИзмеренияВставки;
		 //Иначе
		 //    СтрЦ = СтрокиЦен.Получить(0);
		 //    НоваяСтр.Цена = СтрЦ.Цена;
		 //    НоваяСтр.ЕдиницаИзмерения = СтрЦ.ЕдиницаИзмерения;
		 //КонецЕсли;	 
	КонецЦикла;	 
	ДокументОбъект.ШаблонВставки = ШаблонВставки;
	ДокументОбъект.Записать();
	СтрокаПриказа = ТаблицаПриказов.НайтиПоИдентификатору(ТекущийПриказИдентификатор);
	ПолучитьДополнительныеРеквизиты(СтрокаПриказа);

КонецПроцедуры

&НаКлиенте
Процедура ЦеныВставкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекСтрока = Элементы.ЦеныВставки.ТекущиеДанные;
	Если НоваяСтрока Тогда		
		ТекСтрока.ЕдиницаИзмерения = ОсновнаяЕдиницаИзмеренияВставки;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПроставитьГалочкиПоГруппе(ДеревоНаСервере, Группа, Пометка)
	Для каждого Строка Из ДеревоНаСервере.Строки Цикл
		Если Строка.Ломбард = Группа Тогда
			Строка.Пометка = Пометка;
		ИначеЕсли Строка.ОтделениеРодитель = Группа Тогда
			Строка.Пометка = Пометка;	
		Иначе
			Продолжить;
		КонецЕсли;		

		Если НЕ Строка.Строки.Количество() = 0 Тогда
			ПроставитьГалочкиПоГруппе(Строка, Группа, Пометка);
		КонецЕсли;	
	
	КонецЦикла;	
КонецПроцедуры	

&НаСервере
Процедура ОбработатьОтметкуГруппы(Ломбард, Пометка)
	ДеревоНаСервере = РеквизитФормыВЗначение("Дерево");
	ПроставитьГалочкиПоГруппе(ДеревоНаСервере, Ломбард, Пометка);
	ЗначениеВРеквизитФормы(ДеревоНаСервере, "Дерево");
КонецПроцедуры	

&НаКлиенте
Процедура ПанельПоискаЗалогодателя(Команда) 
	Элементы.ГруппаОтбор.Видимость = НЕ Элементы.ГруппаОтбор.Видимость;
	Если Элементы.ГруппаОтбор.Видимость Тогда
		Элементы.ПанельПоискаЗалогодателя.Пометка = Истина;  
		Элементы.ПанельПоискаЗалогодателя.ЦветФона = WebЦвета.БледноЗеленый;
	Иначе
		Элементы.ПанельПоискаЗалогодателя.Пометка = Ложь; 
		Элементы.ПанельПоискаЗалогодателя.ЦветФона = WebЦвета.Белый;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура НайтиПоНомеруПриказа(Команда)
	ЗаполнитьТаблицуПриказов();
КонецПроцедуры

&НаКлиенте
Процедура ВыборНомерПриказаОчистка(Элемент, СтандартнаяОбработка) 
	ВыборНомерПриказа = "";
	ЗаполнитьТаблицуПриказов();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСтавокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура;    
	ПараметрыФормы.Вставить("Документ", ТекущийПриказ); 
	Если ТекущийПриказ.Проведен Тогда
		ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
	КонецЕсли;	  
	ТекСтрока = Элементы.ТаблицаСтавок.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		ПараметрыФормы.Вставить("СхемаКредитования", ТекСтрока.СхемаКредитования);
	КонецЕсли;	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеРедактированияСтавок",ЭтаФорма);
	
	ОткрытьФорму("Документ.ЛБ_ПриказИндивидуальныеУсловия.Форма.ЗаполнениеПроцентныхСтавокИзПриказа", ПараметрыФормы,,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры 

&НаКлиенте
Процедура ПослеРедактированияСтавок(Результат, ДопПараметры) Экспорт 
	Если Результат = неопределено Тогда
		Возврат;
	КонецЕсли;	
	ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;  
	ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
	ПолучитьОбъектПриказа(ИдентификаторСтроки); 
	ОбработатьИзменениеТабличныхЧастейПриказа();
КонецПроцедуры   

&НаСервере 
Процедура ОбработатьИзменениеТабличныхЧастейПриказа() 
	СтрокаПриказа = ТаблицаПриказов.НайтиПоИдентификатору(ТекущийПриказИдентификатор);
	
	//+ МАН 13.11.24 Исправление отображения залогодателей после выбора приказа для отмены. Заявка 2792.
	//Если ЗначениеЗаполнено(СтрокаПриказа.Ссылка.ОтменяемыйПриказ) Тогда
	Если ЗначениеЗаполнено(СтрокаПриказа.Ссылка.ОтменяемыеПриказыСтрока) Тогда
		СтрокаПриказа.СтрокаЗалогодатели = СтрокаПриказа.Ссылка.СтрокаЗалогодатели;
		//+МАН 22.08.25 Изменить на сбор из ТЧ.
		//СтрокаПриказа.ОтменяемыйПриказНомерПриказа = СтрокаПриказа.Ссылка.ОтменяемыйПриказ.НомерПриказа;
		СтрокаПриказа.ОтменяемыйПриказНомерПриказа = СтрокаПриказа.Ссылка.ОтменяемыеПриказыСтрока;
		//-МАН
	КонецЕсли;
	//-МАН
	
	ПолучитьДополнительныеРеквизиты(СтрокаПриказа);
КонецПроцедуры	

&НаСервере 
Функция ВыбратьСК()   
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");

	СК = Новый СписокЗначений;
    Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", ДокументОбъект.Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СхемыКредитования.Ссылка КАК СхемаКредитования
	               |ИЗ
	               |	Справочник.ЛБ_СхемыКредитования КАК ЛБ_СхемыКредитования
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_УсловияПредоставленияКредита.СрезПоследних(&Дата, ) КАК ЛБ_УсловияПредоставленияКредитаСрезПоследних
	               |		ПО (ЛБ_УсловияПредоставленияКредитаСрезПоследних.СхемаКредитования = ЛБ_СхемыКредитования.Ссылка)
	               |ГДЕ
	               |	ЛБ_СхемыКредитования.ПометкаУдаления = ЛОЖЬ";
				   //|	И ЛБ_УсловияПредоставленияКредитаСрезПоследних.НеАктуальная = ЛОЖЬ";
	ТЗ = Запрос.Выполнить().Выгрузить();     
	Массив = ТЗ.ВыгрузитьКолонку("СхемаКредитования");//выгружаем таблицу значений в массив
    СК.ЗагрузитьЗначения(Массив);//загружаем массив в список значений  
	
	Для каждого Стр Из ДокументОбъект.СхемыКредитования Цикл 
		Эл = СК.НайтиПоЗначению(Стр.СхемаКредитования);
		Если НЕ Эл = неопределено Тогда
	        Эл.Пометка = Истина; 
		КонецЕсли;
	Конеццикла;
	Возврат СК;
КонецФункции

&НаКлиенте
Процедура СтрокаСКНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//СК = ВыбратьСК();  
    //ОповещениеПослеОтметкиЭлементов = Новый ОписаниеОповещения("ПослеОтметкиЭлементовСК", ЭтаФорма);	
    //СК.ПоказатьОтметкуЭлементов(ОповещениеПослеОтметкиЭлементов, "Выберите схемы кредитования");  
	ПараметрыФормы = новый структура;
	ПараметрыФормы.Вставить("Приказ", ТекущийПриказ.Ссылка); 
	ОповещениеПослеВыборка = Новый ОписаниеОповещения("ПослеВыбораСК", ЭтаФорма); 
	ОткрытьФорму("Документ.ЛБ_ПриказИндивидуальныеУсловия.Форма.ФормаВыбораСхемКредитования", ПараметрыФормы, Этаформа,,,,ОповещениеПослеВыборка,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры 

&НаСервере
Процедура ОбработкаВыбораСК()
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");
	
	//+МАН 04.03.25
	УдалитьСК(ДокументОбъект);
	
	//Добавил усолвие
	Если ДокументОбъект.СтавкиПроцентов.Количество() = 0 Тогда
		ДокументОбъект.СтавкиПроцентов.Очистить(); 
	КонецЕсли;
	//-МАН
	
	Для Каждого Стр Из ДокументОбъект.СхемыКредитования Цикл
		ШаблонПриказа = стр.ШаблонПроцентныеСтавки;
		Если ЗначениеЗаполнено(ШаблонПриказа) Тогда 
			
			Отбор = Новый Структура;
			Отбор.Вставить("СхемаКредитования", Стр.СхемаКредитования);
							
			Для каждого СтрШ Из ШаблонПриказа.СтавкиПроцентов Цикл 
				Отбор.Вставить("ДиапазонСумм", СтрШ.ДиапазонСумм);
				
				МассивСтрок = ДокументОбъект.СтавкиПроцентов.НайтиСтроки(Отбор);
				Если МассивСтрок.Количество() > 0 Тогда
					Продолжить;
				КонецЕсли;
				
				НоваяСтрП = ДокументОбъект.СтавкиПроцентов.Добавить();
				НоваяСтрП.СхемаКредитования = Стр.СхемаКредитования;
				//НоваяСтрП.ПричинаПрименения = СтрШ.ПричинаПрименения;
				//НоваяСтрП.СтатусЗалогодателя = СтрШ.СтатусЗалогодателя;
				НоваяСтрП.ДиапазонСумм = СтрШ.ДиапазонСумм;
				//НоваяСтрП.ДеньНачалаПрименения = СтрШ.ДеньНачалаПрименения;
				НоваяСтрП.Ставка = 0;
			Конеццикла;	
		Иначе
			Сообщить("Для кредитной схемы " + СокрЛП(Стр.СхемаКредитования) + " не установлен шаблон процентных ставок!");					
		КонецЕсли;	
	КонецЦикла; 
	ЗаполнитьСписокСК(ДокументОбъект);
    ДокументОбъект.Записать();          
	СтрокаПриказа = ТаблицаПриказов.НайтиПоИдентификатору(ТекущийПриказИдентификатор);
    ПолучитьДополнительныеРеквизиты(СтрокаПриказа);
	СхемыКредитования.Загрузить(ТекущийПриказ.СхемыКредитования.Выгрузить());
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор); 		   
КонецПроцедуры  

&НаКлиенте
Процедура ПослеВыбораСК(Результат, ДопПараметры) Экспорт   
	Если НЕ Результат = неопределено Тогда 
		ОбработкаВыбораСК();
		Для каждого СтрК Из ТекущийПриказ.СхемыКредитования Цикл
			//+Мельников Убрать
			//Если НЕ ЗначениеЗаполнено(СтрК.Ломбард) Тогда
			//	Продолжить;
			//КонецЕсли;
			//-Мельников
			ПроставитьПроцентныеСтавкиПоТекущимНастройкам(СтрК.СхемаКредитования, СтрК.Ломбард); 
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокСК(ДокументОбъект)  
	Результат = "";
	Для каждого Стр Из ДокументОбъект.СхемыКредитования Цикл
		Результат = Результат + ?(ПустаяСтрока(Результат), "", "; ") + СокрЛП(Стр.СхемаКредитования.Наименование);
	КонецЦикла;	
	ДокументОбъект.СтрокаСхемыКредитования = Результат;
КонецПроцедуры	

&НаКлиенте
Процедура ПослеОтметкиЭлементовСК(Элементы, Параметры) Экспорт 
	//Если Элементы <> Неопределено Тогда 
	//	ОбработкаОтметкиЭлементовСК(Элементы);
	//	Если НЕ ТекущийПриказ.Ломбарды.Количество() =  0 Тогда
	//		ЕстьОтметка = ложь;
	//		Для Каждого Эл Из Элементы Цикл 
	//		    Если Эл.Пометка Тогда 
	//				ЕстьОтметка = Истина;
	//				Прервать;
	//			КонецЕсли;	 
	//		КонецЦикла; 
	//		Если ЕстьОтметка Тогда 
	//			Режим = РежимДиалогаВопрос.ДаНет;
	//			Ответ = Вопрос("Заполнить процентные ставки по текущим данным в ломбарде?", Режим, 0);
	//			Если Ответ = КодВозвратаДиалога.Да Тогда									
	//				Если ТекущийПриказ.Ломбарды.Количество() = 1 Тогда
	//					ПроставитьПроцентныеСтавкиПоТекущимНастройкам(ТекущийПриказ.Ломбарды.Получить(0).Ломбард); 
	//				Иначе
	//					ПараметрыФормы = Новый Структура;
	//				    ПараметрыФормы.Вставить("Приказ", ТекущийПриказ.Ссылка); 
	//					
	//					ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЛомбардаСК", ЭтаФорма);
	//					ОткрытьФорму("ОбщаяФорма.ЛБ_ВыборЛомбардаИзПриказа", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	//				КонецЕсли;
	//			КонецЕсли;	
	//		КонецЕсли;
	//	КонецЕсли;	
	//КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЛомбардаСК(Результат, ДопПараметры) Экспорт 
//	Если Результат = неопределено Тогда
//	   Возврат; 	
//	КонецЕсли;
//	ПроставитьПроцентныеСтавкиПоТекущимНастройкам(Результат);
КонецПроцедуры	

&НаСервере
Функция ЗаполнитьПроцентныеСтавкиПоНастройкамВЛомбарде(СхемаКредитования, Ломбард) 
	ЗапросСтавки = Новый Запрос; 
	ЗапросСтавки.УстановитьПараметр("СхемаКредитования", СхемаКредитования); 
	ЗапросСтавки.УстановитьПараметр("Ломбард", Ломбард);  
	ЗапросСтавки.УстановитьПараметр("Дата", ТекущийПриказ.Дата);
	ЗапросСтавки.Текст = "ВЫБРАТЬ
	                     |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.Период КАК Период,
	                     |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.СхемаКредитования КАК СхемаКредитования,
	                     |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.СтатусЗалогодателя КАК СтатусЗалогодателя,
	                     |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.ПричинаПрименения КАК ПричинаПрименения,
	                     |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.ДиапазонСуммЗайма КАК ДиапазонСумм,
	                     |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.ДеньНачалаПрименения КАК ДеньНачалаПрименения,
	                     |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.ПроцентнаяСтавка КАК Ставка
	                     |ИЗ
	                     |	РегистрСведений.ЛБ_ПрейскурантПроцентныхСтавок.СрезПоследних(
	                     |			&Дата,
	                     |			СхемаКредитования = &СхемаКредитования
	                     |				И Ломбард = &Ломбард
	                     |				И ДатаНачалаДействия <= &Дата) КАК ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних
	                     |
	                     |УПОРЯДОЧИТЬ ПО
	                     |	Период УБЫВ"; 
	ТаблицаЗапросаСтавки = ЗапросСтавки.Выполнить().Выгрузить(); 
	ТаблицаСтавок = ТаблицаЗапросаСтавки.Скопировать(); 
	ТаблицаСтавок.Очистить();
	
	Период = Дата(1,1,1);
	Для каждого Стр Из ТаблицаЗапросаСтавки Цикл
		Если Период = Дата(1,1,1) Тогда
			Период = Стр.Период;
		ИначеЕсли Стр.Период < Период Тогда
			Прервать;
		КонецЕсли;	
		НоваяСтр = ТаблицаСтавок.Добавить();
		НоваяСтр.СхемаКредитования = Стр.СхемаКредитования; 
		//НоваяСтр.СтатусЗалогодателя = Стр.СтатусЗалогодателя;
		//НоваяСтр.ПричинаПрименения = Стр.ПричинаПрименения; 
		НоваяСтр.ДиапазонСумм = Стр.ДиапазонСумм;
		//НоваяСтр.ДеньНачалаПрименения = Стр.ДеньНачалаПрименения;
		НоваяСтр.Ставка = Стр.Ставка;
	КонецЦикла;
	Возврат ТаблицаСтавок;	
КонецФункции	

 &НаСервере
Процедура ПроставитьПроцентныеСтавкиПоТекущимНастройкам(СхемаКредитования, Ломбард) 
	ТаблицаСтавок = ЗаполнитьПроцентныеСтавкиПоНастройкамВЛомбарде(СхемаКредитования, Ломбард);
	Если НЕ ТаблицаСтавок.Количество() = 0 тогда  
		ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
		ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");
		Для каждого стр Из ДокументОбъект.СтавкиПроцентов Цикл  
			ОтборП = Новый Структура;
            ОтборП.Вставить("СхемаКредитования", стр.СхемаКредитования);
			//ОтборП.Вставить("ПричинаПрименения", стр.ПричинаПрименения);
			//ОтборП.Вставить("СтатусЗалогодателя", стр.СтатусЗалогодателя);
			ОтборП.Вставить("ДиапазонСумм", стр.ДиапазонСумм);
			//ОтборП.Вставить("ДеньНачалаПрименения", стр.ДеньНачалаПрименения);
			
			СтрокиП = ТаблицаСтавок.НайтиСтроки(ОтборП); 
			Если НЕ СтрокиП.Количество() = 0 Тогда
				СтрП = строкиП.Получить(0);
				Стр.Ставка = СтрП.ставка;
			КонецЕсли;	
		КонецЦикла;	
        ДокументОбъект.Записать();                         
		СтрокаПриказа = ТаблицаПриказов.НайтиПоИдентификатору(ТекущийПриказИдентификатор);
	    ПолучитьДополнительныеРеквизиты(СтрокаПриказа);

		ПолучитьОбъектПриказа(ТекущийПриказИдентификатор); 	
	КонецЕсли; 	 
КонецПроцедуры	 
	 
&НаСервере
Процедура ОбработкаОтметкиЭлементовСК(Элементы)  	
	Если Элементы <> Неопределено Тогда 
		ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
		ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");
		ДатаПроверки = ДокументОбъект.Дата;
		ТаблицаСК = ДокументОбъект.СхемыКредитования.Выгрузить();
		ДокументОбъект.СхемыКредитования.Очистить();
		Для Каждого Эл Из Элементы Цикл 
			Если Эл.Пометка Тогда   
				ШаблонПриказа = ЛБ_ОбщийМодуль.ПолучитьТекущийШаблон(ДатаПроверки, Перечисления.ЛБ_ВидыПрейскурантов.ПроцентныеСтавки, Ломбарды, Эл.Значение);
				Если НЕ ШаблонПриказа = неопределено Тогда 
					НоваяСтр = ДокументОбъект.СхемыКредитования.Добавить(); 
				    НоваяСтр.СхемаКредитования = Эл.Значение;
					НоваяСтр.ШаблонПроцентныеСтавки = ШаблонПриказа;
					
					Отбор = Новый Структура;
				    Отбор.Вставить("СхемаКредитования",Эл.Значение);
					Строки = ТаблицаСК.НайтиСтроки(Отбор);
					Если Строки.Количество() = 0 Тогда
						Для каждого СтрШ Из НоваяСтр.ШаблонПроцентныеСтавки.СтавкиПроцентов Цикл 
							НоваяСтрП = ДокументОбъект.СтавкиПроцентов.Добавить();
							НоваяСтрП.СхемаКредитования = НоваяСтр.СхемаКредитования;
							НоваяСтрП.ПричинаПрименения = СтрШ.ПричинаПрименения;
							НоваяСтрП.СтатусЗалогодателя = СтрШ.СтатусЗалогодателя;
							НоваяСтрП.ДиапазонСумм = СтрШ.ДиапазонСумм;
							НоваяСтрП.ДеньНачалаПрименения = СтрШ.ДеньНачалаПрименения;
							НоваяСтрП.Ставка = 0;
						Конеццикла;	
					Иначе
						СтрокаСК = Строки.Получить(0);
						Если НЕ СтрокаСК.ШаблонПроцентныеСтавки = ШаблонПриказа Тогда 
							СтрокиУдалить = ДокументОбъект.СтавкиПроцентов.НайтиСтроки(Отбор);  
							Для каждого Стр Из СтрокиУдалить Цикл
								ТекущийПриказ.СтавкиПроцентов.Удалить(Стр);
							КонецЦикла; 
							Для каждого СтрШ Из НоваяСтр.ШаблонПроцентныеСтавки.СтавкиПроцентов Цикл
	                            НоваяСтрП = ДокументОбъект.СтавкиПроцентов.Добавить();
								НоваяСтрП.СхемаКредитования = НоваяСтр.СхемаКредитования;
								НоваяСтрП.ПричинаПрименения = СтрШ.ПричинаПрименения;
								НоваяСтрП.СтатусЗалогодателя = СтрШ.СтатусЗалогодателя;
								НоваяСтрП.ДиапазонСумм = СтрШ.ДиапазонСумм;
							КонецЦикла;	
						КонецЕсли;	
                    КонецЕсли;
				Иначе
					Сообщить("Для кредитной схемы " + СокрЛП(Эл.Значение) + " не установлен шаблон процентных ставок!");					
				КонецЕсли;	
			Иначе  
				Отбор = Новый Структура;
				Отбор.Вставить("СхемаКредитования",Эл.Значение); 
				Строки = ТаблицаСК.НайтиСтроки(Отбор);
				Если НЕ Строки.Количество() = 0 Тогда
					СтрокиУдалить = ДокументОбъект.СтавкиПроцентов.НайтиСтроки(Отбор);  
					Для каждого Стр Из СтрокиУдалить Цикл
						ДокументОбъект.СтавкиПроцентов.Удалить(Стр);
					КонецЦикла; 	 
				КонецЕсли;	
			КонецЕсли;				
		КонецЦикла; 
		ЗаполнитьСписокСК(ДокументОбъект);
	    ДокументОбъект.Записать();          
		СтрокаПриказа = ТаблицаПриказов.НайтиПоИдентификатору(ТекущийПриказИдентификатор);
	    ПолучитьДополнительныеРеквизиты(СтрокаПриказа);
		СхемыКредитования.Загрузить(ТекущийПриказ.СхемыКредитования.Выгрузить());
		ПолучитьОбъектПриказа(ТекущийПриказИдентификатор); 		
    КонецЕсли; 
КонецПроцедуры  

&НаКлиенте
Процедура МеталлыРедактированиеСК()
	ПараметрыФормы = Новый Структура;    
	ПараметрыФормы.Вставить("Документ", ТекущийПриказ);  
	ПараметрыФормы.Вставить("МассивСК", ПолучитьМассивВыбранныхСхемКредитования()); 
	ПараметрыФормы.Вставить("ТолькоПросмотр", ТекущийПриказ.Проведен);
	ОбработкаЗакрытия = Новый ОписаниеОповещения("ПроверитьВыборСК",ЭтаФорма);
	
	//ОткрытьФорму("ОбщаяФорма.ЛБ_ПросмотрЦенМеталлов", ПараметрыФормы,,,,, ОбработкаЗакрытия, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ОткрытьФорму("Документ.ЛБ_ПриказИндивидуальныеУсловия.Форма.ФормаУстановкаОтклоненийМеталлов", ПараметрыФормы,,,,, ОбработкаЗакрытия, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры  

&НаКлиенте
Процедура ЦеныМеталлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	МеталлыРедактированиеСК();
КонецПроцедуры  

&НаКлиенте
Процедура ТаблицаОтклоненийОтБазовыхЦенМеталлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	МеталлыРедактированиеСК();
КонецПроцедуры


&НаКлиенте
Процедура ПослеРедактированияМеталлов(Результат, ДопПараметры) Экспорт 
	Если Результат = неопределено Тогда
		Возврат;
	КонецЕсли;	
	ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;  
	ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
	ПолучитьОбъектПриказа(ИдентификаторСтроки);  
	ОбработатьИзменениеТабличныхЧастейПриказа();
КонецПроцедуры

&НаКлиенте
Процедура СценарийОценкиМеталловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораСценария",ЭтаФорма);
	
	ОткрытьФорму("Справочник.ЛБ_СценарииОценки.ФормаВыбора",, Элементы.СценарийОценкиМеталлов,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры   

&НаСервере
Процедура ПослеВыбораСценария(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;    
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");
	ДокументОбъект.СценарийОценкиМеталлов = Результат;
	ДокументОбъект.Записать(); 
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	
	ТЗМеталлы = Новый ТаблицаЗначений;
	ТЗМеталлы.Колонки.Добавить("Металл");
	ТЗМеталлы.Колонки.Добавить("БазоваяПроба");
	ТЗМеталлы.Колонки.Добавить("БазоваяКатегория");
	ТЗМеталлы.Колонки.Добавить("БазоваяЦена");
	
	Для каждого СтрСпр из Результат.БазовыеНастройки Цикл    
		Стр = ТЗМеталлы.Добавить(); 
		Стр.Металл = СтрСпр.Металл;
		Стр.БазоваяПроба = СтрСпр.БазоваяПроба;
		Стр.БазоваяКатегория = СтрСпр.БазоваяКатегория;
		Стр.БазоваяЦена = СтрСпр.БазоваяЦена;
	Конеццикла;	

	ЗаполнитьЦеныМеталловПоСценариюНаСервере(ТЗМеталлы);  

КонецПроцедуры

&НаСервере
Процедура ОчиститьПроцентныеСтавкиНаСервере()   
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
    ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");
	ДокументОбъект.СтавкиПроцентов.Очистить(); 
	ДокументОбъект.Записать(); 
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	СтрокаПриказа = ТаблицаПриказов.НайтиПоИдентификатору(ТекущийПриказИдентификатор);
	ПолучитьДополнительныеРеквизиты(СтрокаПриказа);
КонецПроцедуры	

&НаКлиенте
Процедура ОчиститьПроцентныеСтавки(Команда)
	Если  ТекущийПриказ.Проведен Тогда  
		Сообщить("Приказ введен в действие, его корректировка запрещена!");
	Иначе	          
	    Ответ = Вопрос("Удалить все строки таблицы?", РежимДиалогаВопрос.ДаНет, 0);
	    Если Ответ = КодВозвратаДиалога.Да Тогда
		    ОчиститьПроцентныеСтавкиНаСервере();
			ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;  
		    ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
		    ПолучитьОбъектПриказа(ИдентификаторСтроки); 
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОчиститьМеталлыНаСервере()  
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
    ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");
	ДокументОбъект.ЦеныМеталлы.Очистить(); 
	ДокументОбъект.Записать(); 
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	СтрокаПриказа = ТаблицаПриказов.НайтиПоИдентификатору(ТекущийПриказИдентификатор);
	ПолучитьДополнительныеРеквизиты(СтрокаПриказа);
КонецПроцедуры	

&НаКлиенте
Процедура ОчиститьМеталлы(Команда)
	Если  ТекущийПриказ.Проведен Тогда  
		Сообщить("Приказ введен в действие, его корректировка запрещена!");
	Иначе	          
	    Ответ = Вопрос("Удалить все строки таблицы?", РежимДиалогаВопрос.ДаНет, 0);
	    Если Ответ = КодВозвратаДиалога.Да Тогда
		    ОчиститьМеталлыНаСервере();
			ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;  
		    ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
		    ПолучитьОбъектПриказа(ИдентификаторСтроки); 
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры   

&НаСервере
Процедура ОчиститьВставкиНаСервере()  
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
    ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");
	ДокументОбъект.ЦеныВставки.Очистить(); 
	ДокументОбъект.Записать(); 
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	СтрокаПриказа = ТаблицаПриказов.НайтиПоИдентификатору(ТекущийПриказИдентификатор);
	ПолучитьДополнительныеРеквизиты(СтрокаПриказа);
КонецПроцедуры	

&НаКлиенте
Процедура ОчиститьВставки(Команда)
	Если  ТекущийПриказ.Проведен Тогда  
		Сообщить("Приказ введен в действие, его корректировка запрещена!");
	Иначе	          
	    Ответ = Вопрос("Удалить все строки таблицы?", РежимДиалогаВопрос.ДаНет, 0);
	    Если Ответ = КодВозвратаДиалога.Да Тогда
		    ОчиститьВставкиНаСервере();
			ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;  
		    ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
		    ПолучитьОбъектПриказа(ИдентификаторСтроки); 
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОчиститьНастройкиМеталлыНаСервере()
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
    ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");
	ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенМеталлы.Очистить(); 
	ДокументОбъект.Записать(); 
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	СтрокаПриказа = ТаблицаПриказов.НайтиПоИдентификатору(ТекущийПриказИдентификатор);
	ПолучитьДополнительныеРеквизиты(СтрокаПриказа);
КонецПроцедуры	

&НаКлиенте
Процедура ОчиститьНастройкиМеталлы(Команда)
	Если  ТекущийПриказ.Проведен Тогда  
		Сообщить("Приказ введен в действие, его корректировка запрещена!");
	Иначе	          
	    Ответ = Вопрос("Удалить все строки таблицы?", РежимДиалогаВопрос.ДаНет, 0);
	    Если Ответ = КодВозвратаДиалога.Да Тогда
		    ОчиститьНастройкиМеталлыНаСервере();
			ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;  
		    ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
		    ПолучитьОбъектПриказа(ИдентификаторСтроки); 
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийПриказЦеныВставкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура;    
	ПараметрыФормы.Вставить("Документ", ТекущийПриказ); 
	Если ТекущийПриказ.Проведен Тогда
		ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
	КонецЕсли;	  
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеРедактированияВставок",ЭтаФорма);
	
	ОткрытьФорму("ОбщаяФорма.ЛБ_ЗаполнениеЦенВставокИзПриказа", ПараметрыФормы,,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
КонецПроцедуры  

&НаКлиенте
Процедура ПослеРедактированияВставок(Результат, ДопПараметры) Экспорт 
	Если Результат = неопределено Тогда
		Возврат;
	КонецЕсли;	
	ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;  
	ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
	ПолучитьОбъектПриказа(ИдентификаторСтроки);  
	ОбработатьИзменениеТабличныхЧастейПриказа();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьРеквизит(ИмяРеквизита, Значение) 
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
    ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ"); 
	ДокументОбъект[ИмяРеквизита] = Значение;  
	ДокументОбъект.Записать();
	
	Если ИмяРеквизита = "ПодписантДолжность" Тогда
		ЗначениеВРеквизитФормы(ДокументОбъект, "ТекущийПриказ");
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ТекущийПриказНачальникОтделаРазвитияБизнесаПриИзменении(Элемент)
	ЗаписатьРеквизит("НачальникОРБ", ТекущийПриказ.НачальникОРБ);
КонецПроцедуры

&НаКлиенте
Процедура ТекущийПриказОтветственноеЛицоОРБПриИзменении(Элемент)
	ЗаписатьРеквизит("ОтветственноеЛицоОРБ", ТекущийПриказ.ОтветственноеЛицоОРБ);
КонецПроцедуры

&НаКлиенте
Процедура ТекущийПриказОтветственноеЛицоРекламаПриИзменении(Элемент)
	ЗаписатьРеквизит("ОтветственноеЛицоРеклама", ТекущийПриказ.ОтветственноеЛицоРеклама);
КонецПроцедуры

&НаКлиенте
Процедура ТекущийПриказПодписантДолжностьПриИзменении(Элемент)
	ЗаписатьРеквизит("ПодписантДолжность", ТекущийПриказ.ПодписантДолжность);
КонецПроцедуры

&НаКлиенте
Процедура ТекущийПриказПодписантФИОПриИзменении(Элемент)
	ЗаписатьРеквизит("ПодписантФИО", ТекущийПриказ.ПодписантФИО);
	ЗаписатьРеквизит("ПодписантДолжность", ПолучитьДолжностьСотрудника(ТекущийПриказ.ПодписантФИО));
КонецПроцедуры

&НаКлиенте
Процедура ТекущийПриказНачальникОДОПриИзменении(Элемент)
	ЗаписатьРеквизит("НачальникОДО", ТекущийПриказ.НачальникОДО);
КонецПроцедуры

&НаКлиенте
Процедура ТекущийПриказНеВыводитьНаПечатьПричиныПримененияПриИзменении(Элемент)
	ЗаписатьРеквизит("НеВыводитьНаПечатьПричиныПрименения", ТекущийПриказ.НеВыводитьНаПечатьПричиныПрименения);
КонецПроцедуры

&НаКлиенте
Процедура СтрокаЗалогодателиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Залогодатели", ТекущийПриказ.Залогодатели);
	ПараметрыФормы.Вставить("Дата", ТекущийПриказ.Дата);

	//Закомментировал для тестирования новой формы поиска залогодателя
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЗалогодателей",ЭтаФорма);
	
	//ОткрытьФорму("Обработка.ЛБ_ВыборЗалогодателейИзСписка.Форма", ПараметрыФормы, Элементы.СтрокаЗалогодатели,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаПоискаЗалогодателя", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЗалогодателей(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
	    Возврат;
	КонецЕсли;
		
	//Если ТекущийПриказ.Залогодатели.Количество() = 0 Тогда
	//	ПокаНетЗалогодателей = Истина;
	//Иначе	
	//	ПокаНетЗалогодателей = ложь; 
	//КонецЕсли;
	СохранитьЗалогодателей(Результат);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьЗалогодателей(Результат)
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");  
	ДокументОбъект.Залогодатели.Очистить();  
	КоличествоВыбрано = Результат.Количество;
	Для сч = 1 По КоличествоВыбрано Цикл
		НоваяСтр = ДокументОбъект.Залогодатели.Добавить();
		НоваяСтр.Залогодатель = Результат["Значение" + Строка(сч)];
	КонецЦикла;	
	
	ЗаполнитьСписокЗалогодателей(ДокументОбъект);
	ДокументОбъект.Записать();
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);	
	СтрокаПриказа = ТаблицаПриказов.НайтиПоИдентификатору(ТекущийПриказИдентификатор); 
	СтрокаПриказа.СтрокаЗалогодатели = ДокументОбъект.СтрокаЗалогодатели; 
	ПолучитьДополнительныеРеквизиты(СтрокаПриказа);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокЗалогодателей(ДокументОбъект)
	Результат = "";
	Для каждого Стр Из ДокументОбъект.Залогодатели Цикл
		Результат = Результат + ?(ПустаяСтрока(Результат), "", "; ") + СокрЛП(Стр.Залогодатель.Наименование);
	КонецЦикла;	
	ДокументОбъект.СтрокаЗалогодатели = Результат; 
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьДополнительныеРеквизитыПриказа(ДокументОбъект) Экспорт 
	ЗапросБазовыеЦены = Новый Запрос;
	ЗапросБазовыеЦены.Текст = "ВЫБРАТЬ
	                          |	ЛБ_БазовыеЦеныНаДрагоценныеМеталлы.Период КАК Период,
	                          |	ЛБ_БазовыеЦеныНаДрагоценныеМеталлы.Проба КАК Проба,
	                          |	ЛБ_БазовыеЦеныНаДрагоценныеМеталлы.КатегорияОбъектаЗалога КАК Категория
	                          |ИЗ
	                          |	РегистрСведений.ЛБ_БазовыеЦеныНаДрагоценныеМеталлы КАК ЛБ_БазовыеЦеныНаДрагоценныеМеталлы
	                          |
	                          |УПОРЯДОЧИТЬ ПО
	                          |	Период";
	//ТаблицаБазовыеЦены = ЗапросБазовыеЦены.Выполнить().Выгрузить();
	ТаблицаБазовыеЦены.Загрузить(ЗапросБазовыеЦены.Выполнить().Выгрузить());

	//+МАН 11.11.24 Изменение установки булева. Заявка 2792
	//Было:
	//ДокументОбъект.ЕстьМеталлы = ?(ДокументОбъект.ЦеныМеталлы.Количество() = 0, ложь, Истина);
	//ДокументОбъект.ЕстьВставки = ?(ДокументОбъект.ЦеныВставки.Количество() = 0, ложь, Истина);
	//ДокументОбъект.ЕстьПроцентныеСтавки = ?(ДокументОбъект.СтавкиПроцентов.Количество() = 0, ложь, Истина);
	////
	
	//+МАН 25.08.25 добавил проверку на на наличие не нулевых ставок
	Если ДокументОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ВИП Тогда
		МассивУдаленияСтрок = Новый Массив;
		
		ТЗСтавки = ДокументОбъект.СтавкиПроцентов.Выгрузить(, "Ставка");
		
		Для каждого СтрС Из ТЗСтавки Цикл
			Если СтрС.Ставка = 0 Тогда
				МассивУдаленияСтрок.Добавить(СтрС);
			КонецЕсли;			
		КонецЦикла;
		
		Если МассивУдаленияСтрок.Количество() > 0 Тогда
			Для каждого СтрМ Из МассивУдаленияСтрок Цикл
				ТЗСтавки.Удалить(СтрМ);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	//-МАН
	
	//+МАН 25.08.25 Изменил
	Если ДокументОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ВИП Тогда
		ДокументОбъект.ЕстьМеталлы = ?(ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенМеталлы.Количество() = 0, Ложь, Истина);
		ДокументОбъект.ЕстьВставки = ?(ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенВставки.Количество() = 0, Ложь, Истина);
		//ДокументОбъект.ЕстьПроцентныеСтавки = ?(ДокументОбъект.СтавкиПроцентов.Количество() = 0, Ложь, Истина);
		ДокументОбъект.ЕстьПроцентныеСтавки = ?(ТЗСтавки.Количество() = 0, Ложь, Истина);
	Иначе
		ДокументОбъект.ЕстьМеталлы = ?(ДокументОбъект.ОтменаМеталлов, Истина, Ложь);
		ДокументОбъект.ЕстьВставки = ?(ДокументОбъект.ОтменаВставкок, Истина, Ложь);
		ДокументОбъект.ЕстьПроцентныеСтавки = ?(ДокументОбъект.ОтменаСтавок, Истина, Ложь);
	КонецЕсли;
	//-МАН
	
	ДокументОбъект.КоличествоЗалогодателей = ДокументОбъект.Залогодатели.Количество(); 
	Если ДокументОбъект.ЕстьМеталлы Тогда
		Проба = Справочники.ЛБ_Пробы.ПустаяСсылка(); 
		Категория = Справочники.ЛБ_КатегорииОбъектовЗалога.ПустаяСсылка();
		Для каждого СтрБ Из ТаблицаБазовыеЦены Цикл                                
			Если СтрБ.Период > НачалоДня(ДокументОбъект.Дата) Тогда
				Прервать;
			КонецЕсли;
			Проба = СтрБ.Проба;
			Категория = СтрБ.Категория;
		КонецЦикла;	 
		Отбор = Новый Структура;
		Отбор.Вставить("Проба", Проба); 
		Отбор.Вставить("КатегорияОбъектаЗалога", Категория);
	    Строки = ДокументОбъект.ЦеныМеталлы.НайтиСтроки(Отбор);
		МаксЦена = 0;
		Если НЕ Строки.Количество() = 0 Тогда
		    МаксЦена = Строки[0].Цена;
		КонецЕсли;		

		ДокументОбъект.БазоваяЦенаМеталлы = МаксЦена; 
	КонецЕсли;
	
	//+МАН 25.08.25 Изменил условие
	//Если ДокументОбъект.ЕстьПроцентныеСтавки Тогда
	Если ДокументОбъект.ЕстьПроцентныеСтавки И ДокументОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ВИП Тогда
	//-МАН
		ТЗМакс = ДокументОбъект.СтавкиПроцентов.Выгрузить(,"Ставка");
		ТЗМакс.Сортировать("Ставка Убыв");
	    ДокументОбъект.МаксимальнаяПроцентнаяСтавка = ТЗМакс[0].Ставка; 
	КонецЕсли;	

КонецПроцедуры	 

&НаКлиенте
Процедура ПоискПоЗалогодателюПриИзменении(Элемент)
	ЗаполнитьТаблицуПриказов();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОтклоненияМеталлов(Команда)
	МеталлыРедактированиеСК();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтклоненийОтБазовыхЦенВставкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	РедактированиеВставки();
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеВставки()
	ПараметрыФормы = Новый Структура;    
	ПараметрыФормы.Вставить("Приказ", ТекущийПриказ);  
	ПараметрыФормы.Вставить("ТолькоПросмотр", ТекущийПриказ.Проведен);
	ОбработкаЗакрытия = Новый ОписаниеОповещения("ПослеЗаполненияНастроек",ЭтаФорма);
	
	ОткрытьФорму("Документ.ЛБ_ПриказИндивидуальныеУсловия.Форма.ФормаУстановкаОтклоненийВставок", ПараметрыФормы,,,,, ОбработкаЗакрытия, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаполненияНастроек(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;  
	
	ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;  
	ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
	ПолучитьОбъектПриказа(ИдентификаторСтроки);  
	ОбработатьИзменениеТабличныхЧастейПриказа();
КонецПроцедуры	

&НаКлиенте
Процедура РедактироватьВставки(Команда)
	РедактированиеВставки();
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	ЗаписатьИзменениеКомментария(Элемент.ТекстРедактирования);
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзменениеКомментария(НовыйТекст)
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");
	ДокументОбъект.Комментарий = НовыйТекст;
	ДокументОбъект.Записать(); 
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПриказОтмены(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Залогодатели", ТекущийПриказ.Залогодатели);
	ПараметрыФормы.Вставить("ТекущийПриказ", ТекущийПриказ);
	ПараметрыФормы.Вставить("ОтменяемыеПриказы", ТекущийПриказ.ОтменяемыеПриказы);
	//ПараметрыФормы.Вставить("СхемыКредитования", ТекущийПриказ.СхемыКредитования);
	ПараметрыФормы.Вставить("ТолькоПросмотр", ТекущийПриказ.Проведен);

	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораНастроекОтменыПриказа",ЭтаФорма);
	
	ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаНастроекОтеныИндивидуальногоПриказа", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораНастроекОтменыПриказа(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;
	ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
	Элементы.ТекущийПриказЗалогодателиЗалогодатель.ТекстПодвала = ПолучитьКоличествоЗалогодателей(ТекСтрока.Ссылка, "Залогодатели");
	//Элементы.ТекущийПриказЗалогодателиОтменыЗалогодатель.ТекстПодвала = ПолучитьКоличествоЗалогодателей(ТекСтрока.Ссылка, "ЗалогодателиОтмены");
	ПолучитьОбъектПриказа(ИдентификаторСтроки);
	ОбработатьИзменениеТабличныхЧастейПриказа();
	
	УстановитьВидимость();
	
КонецПроцедуры

//&НаСервере
//Процедура СформироватьСтрокуОтменяемогоПриказа()
//	СтрокаОтменяемыйПриказ = "Приказ № " + ТекущийПриказ.ОтменяемыйПриказ.НомерПриказа + " от " + ТекущийПриказ.ОтменяемыйПриказ.Дата;
//КонецПроцедуры

&НаСервере
Функция ПроверитьНаличиеДокументов(Ссылка)
	
	Если Ссылка.Проведен Тогда
		ТЗЗалогодателей = Ссылка.Залогодатели.Выгрузить(,"Залогодатель");
		
		Запрос = Новый Запрос;
		
		//+МАН 20.03.25
		Если Ссылка.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ВИП Тогда
			//-МАН
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.ЗалоговыйБилет КАК Документ
			|ИЗ
			|	РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Обороты(&ДатаС, &ДатаПо, , Клиент В (&Клиент)) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЛБ_ПриказИндивидуальныеУсловия.Ссылка
			|ИЗ
			|	Документ.ЛБ_ПриказИндивидуальныеУсловия КАК ЛБ_ПриказИндивидуальныеУсловия
			|ГДЕ
			|	ЛБ_ПриказИндивидуальныеУсловия.ОтменяемыйПриказ = &ОтменяемыйПриказ
			//+МАН 19.03.25
			|	И ЛБ_ПриказИндивидуальныеУсловия.Проведен
			|	И ЛБ_ПриказИндивидуальныеУсловия.Дата > &ДатаС";
			//-МАН
			//+МАН 20.03.25
		Иначе
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЛБ_ПриказИндивидуальныеУсловия.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ЛБ_ПриказИндивидуальныеУсловия.Залогодатели КАК ЛБ_ПриказИндивидуальныеУсловияЗалогодатели
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛБ_ПриказИндивидуальныеУсловия КАК ЛБ_ПриказИндивидуальныеУсловия
			|		ПО ЛБ_ПриказИндивидуальныеУсловияЗалогодатели.Ссылка = ЛБ_ПриказИндивидуальныеУсловия.Ссылка
			|ГДЕ
			|	ЛБ_ПриказИндивидуальныеУсловия.Проведен
			|	И ЛБ_ПриказИндивидуальныеУсловия.Дата > &ДатаС
			|	И ЛБ_ПриказИндивидуальныеУсловия.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ВИП)
			|	И ЛБ_ПриказИндивидуальныеУсловияЗалогодатели.Залогодатель В(&Клиент)";
		КонецЕсли;
		//-МАН
		
		Запрос.УстановитьПараметр("ДатаПо", ?(Ссылка.ДатаОкончанияДействияПриказа = Дата(1, 1, 1), ТекущаяДата(), Ссылка.ДатаОкончанияДействияПриказа));
		Запрос.УстановитьПараметр("Клиент", ТЗЗалогодателей);
		Запрос.УстановитьПараметр("ОтменяемыйПриказ", Ссылка);
		//+МАН 19.03.25
		//Было: Запрос.УстановитьПараметр("ДатаС", Ссылка.ДатаНачалаДействияПриказа);
		Запрос.УстановитьПараметр("ДатаС", Ссылка.Дата);
		//-МАН
		
		Результат = Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура Обновить(Команда)
	ЗаполнитьТаблицуПриказов();
КонецПроцедуры

&НаСервере
Функция ПолучитьДолжностьСотрудника(Сотрудник)
	Возврат Сотрудник.Должность;
КонецФункции

&НаКлиенте
Процедура ТекущийПриказНомерПриказаПриИзменении(Элемент)
	ЗаписатьРеквизит("НомерПриказа", ТекущийПриказ.НомерПриказа);
	ОбновитьСтрокуПриказа();
КонецПроцедуры

&НаКлиенте
Процедура ТекущийПриказДатаПриИзменении(Элемент)
	ЗаписатьРеквизит("Дата", ТекущийПриказ.Дата);
	ОбновитьСтрокуПриказа();
КонецПроцедуры

&НаКлиенте
Процедура ТекущийПриказДатаНачалаДействияПриказаПриИзменении(Элемент)
	ЗаписатьРеквизит("ДатаНачалаДействияПриказа", ТекущийПриказ.ДатаНачалаДействияПриказа);
	ОбновитьСтрокуПриказа();
КонецПроцедуры

&НаКлиенте
Процедура ТекущийПриказДатаОкончанияДействияПриказаПриИзменении(Элемент)
	Если ТекущийПриказ.ДатаНачалаДействияПриказа > ТекущийПриказ.ДатаОкончанияДействияПриказа Тогда
		Предупреждение("Дата окончания действия приказа не может быть меньше даты начала действия приказа!");
		ТекущийПриказ.ДатаОкончанияДействияПриказа = Дата(1,1,1);
		Возврат;
	Иначе
		ЗаписатьРеквизит("ДатаОкончанияДействияПриказа", ТекущийПриказ.ДатаОкончанияДействияПриказа);
		ОбновитьСтрокуПриказа();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтрокуПриказа()
	ТекСтрокаПриказы = Элементы.ТаблицаПриказов.ТекущиеДанные;
	ИдентификаторСтроки = ТекСтрокаПриказы.ПолучитьИдентификатор();
		
	ТекСтрокаПриказы.НомерПриказа = ТекущийПриказ.НомерПриказа;
	ТекСтрокаПриказы.Дата = ТекущийПриказ.Дата;
	ТекСтрокаПриказы.ДатаНачалаДействияПриказа = ТекущийПриказ.ДатаНачалаДействияПриказа;
	ТекСтрокаПриказы.ДатаОкончанияДействияПриказа = ТекущийПриказ.ДатаОкончанияДействияПриказа;
	ПолучитьОбъектПриказа(ИдентификаторСтроки);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыПечати();
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Элемент",, "Элемент");
	ТЗ.Колонки.Добавить("Должность",, "Должность");
	
	НоваяСтр = ТЗ.Добавить();
	НоваяСтр.Элемент = "ТекущийПриказНачальникОРБ";
	НоваяСтр.Должность = "Начальник отдела развития бизнеса";

	НоваяСтр = ТЗ.Добавить();
	НоваяСтр.Элемент = "ТекущийПриказОтветственноеЛицоОРБ";
	НоваяСтр.Должность = "Маркетолог-аналитик";
	
	НоваяСтр = ТЗ.Добавить();
	НоваяСтр.Элемент = "ТекущийПриказНачальникОДО";
	НоваяСтр.Должность = "Начальник отдела документационного обеспечения";

	//НоваяСтр = ТЗ.Добавить();
	//НоваяСтр.Элемент = "ТекущийПриказОтветственноеЛицоРеклама";
	//НоваяСтр.Должность = "Менеджер по рекламе";

	НоваяСтр = ТЗ.Добавить();
	НоваяСтр.Элемент = "ТекущийПриказПодписантФИО";
	НоваяСтр.Должность = "Директор";

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.ЛБ_КадроваяИсторияСотрудников.СрезПоследних КАК ЛБ_КадроваяИсторияСотрудниковСрезПоследних
		|ГДЕ
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность = &Должность
		|	И НЕ ЛБ_КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыКадровыхСобытий.Увольнение)";
	
	Для каждого Стр Из ТЗ Цикл
		
		Если Стр.Элемент = "ТекущийПриказПодписантФИО" Тогда
			Элементы[Стр.Элемент].СписокВыбора.Очистить();
			Элементы[Стр.Элемент].СписокВыбора.Добавить(Справочники.ЛБ_Сотрудники.НайтиПоКоду("ЛКЗК-02501"));
			Элементы[Стр.Элемент].СписокВыбора.Добавить(Справочники.ЛБ_Сотрудники.НайтиПоКоду("000001599"));
		Иначе
			Элементы[Стр.Элемент].СписокВыбора.Очистить();
			
			Должность = Справочники.Должности.НайтиПоНаименованию(Стр.Должность, Истина);
			
			Запрос.УстановитьПараметр("Должность", Должность);
			
			Результат = Запрос.Выполнить().Выбрать();
			
			Пока Результат.Следующий() Цикл
				Элементы[Стр.Элемент].СписокВыбора.Добавить(Результат.Сотрудник);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьСК(ДокументОбъект)
	
	Если ДокументОбъект.СхемыКредитования.Количество() = 0 Тогда
		ДокументОбъект.СтавкиПроцентов.Очистить();
		ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенВставки.Очистить();
		ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенМеталлы.Очистить();
	Иначе
		МассивСК = Новый Массив;
		
		Для каждого Стр Из ДокументОбъект.СхемыКредитования Цикл
			МассивСК.Добавить(Стр.СхемаКредитования);
		КонецЦикла;
		
		//Процентные ставки
		Если ДокументОбъект.СтавкиПроцентов.Количество() > 0 Тогда
			ТЗСтавки = ДокументОбъект.СтавкиПроцентов.Выгрузить();
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВнешнийИсточник.СхемаКредитования КАК СхемаКредитования,
			|	ВнешнийИсточник.ДиапазонСумм КАК ДиапазонСумм,
			|	ВнешнийИсточник.ДеньНачалаПрименения КАК ДеньНачалаПрименения,
			|	ВнешнийИсточник.Ставка КАК Ставка
			|ПОМЕСТИТЬ ВТ
			|ИЗ
			|	&ВнешнийИсточник КАК ВнешнийИсточник
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ.СхемаКредитования КАК СхемаКредитования,
			|	ВТ.ДиапазонСумм КАК ДиапазонСумм,
			|	ВТ.ДеньНачалаПрименения КАК ДеньНачалаПрименения,
			|	ВТ.Ставка КАК Ставка
			|ИЗ
			|	ВТ КАК ВТ
			|ГДЕ
			|	ВТ.СхемаКредитования В(&СхемаКредитования)";
			
			Запрос.УстановитьПараметр("СхемаКредитования", МассивСК);
			Запрос.УстановитьПараметр("ВнешнийИсточник", ТЗСтавки);
			
			Результат = Запрос.Выполнить().Выгрузить();
			
			Если Результат.Количество() > 0 Тогда
				ДокументОбъект.СтавкиПроцентов.Очистить();
				
				Для каждого Стр Из Результат Цикл
					НоваяСтр = ДокументОбъект.СтавкиПроцентов.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтр, Стр);
				КонецЦикла;
			Иначе
				ДокументОбъект.СтавкиПроцентов.Очистить();
			КонецЕсли;
		КонецЕсли;
		
		//Вставки
		Если ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенВставки.Количество() > 0 Тогда
			ТЗВставки = ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенВставки.Выгрузить();
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВнешнийИсточник.ВидВставки КАК ВидВставки,
			|	ВнешнийИсточник.ВидОгранки КАК ВидОгранки,
			|	ВнешнийИсточник.КачествоОгранки КАК КачествоОгранки,
			|	ВнешнийИсточник.ОтклонениеОтБазовойЦены КАК ОтклонениеОтБазовойЦены,
			|	ВнешнийИсточник.ЗначениеОтклонения КАК ЗначениеОтклонения,
			|	ВнешнийИсточник.СхемаКредитования КАК СхемаКредитования
			|ПОМЕСТИТЬ ВТ
			|ИЗ
			|	&ВнешнийИсточник КАК ВнешнийИсточник
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ.ВидВставки КАК ВидВставки,
			|	ВТ.ВидОгранки КАК ВидОгранки,
			|	ВТ.КачествоОгранки КАК КачествоОгранки,
			|	ВТ.ОтклонениеОтБазовойЦены КАК ОтклонениеОтБазовойЦены,
			|	ВТ.ЗначениеОтклонения КАК ЗначениеОтклонения,
			|	ВТ.СхемаКредитования КАК СхемаКредитования
			|ИЗ
			|	ВТ КАК ВТ
			|ГДЕ
			|	ВТ.СхемаКредитования В(&СхемаКредитования)";
			
			Запрос.УстановитьПараметр("СхемаКредитования", МассивСК);
			Запрос.УстановитьПараметр("ВнешнийИсточник", ТЗВставки);
			
			Результат = Запрос.Выполнить().Выгрузить();
			
			Если Результат.Количество() > 0 Тогда
				ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенВставки.Очистить();
				
				Для каждого Стр Из Результат Цикл
					НоваяСтр = ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенВставки.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтр, Стр);
				КонецЦикла;
			Иначе
				ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенВставки.Очистить();
			КонецЕсли;
		КонецЕсли;
		
		//Металлы
		Если ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенМеталлы.Количество() > 0 Тогда
			ТЗМеталлы = ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенМеталлы.Выгрузить();
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВнешнийИсточник.КатегорияОбъектаЗалога КАК КатегорияОбъектаЗалога,
			|	ВнешнийИсточник.СхемаКредитования КАК СхемаКредитования,
			|	ВнешнийИсточник.Металл КАК Металл,
			|	ВнешнийИсточник.Проба КАК Проба,
			|	ВнешнийИсточник.ОтклонениеОтБазовойЦены КАК ОтклонениеОтБазовойЦены,
			|	ВнешнийИсточник.ЗначениеОтклонения КАК ЗначениеОтклонения
			|ПОМЕСТИТЬ ВТ
			|ИЗ
			|	&ВнешнийИсточник КАК ВнешнийИсточник
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ.КатегорияОбъектаЗалога КАК КатегорияОбъектаЗалога,
			|	ВТ.СхемаКредитования КАК СхемаКредитования,
			|	ВТ.Металл КАК Металл,
			|	ВТ.Проба КАК Проба,
			|	ВТ.ОтклонениеОтБазовойЦены КАК ОтклонениеОтБазовойЦены,
			|	ВТ.ЗначениеОтклонения КАК ЗначениеОтклонения
			|ИЗ
			|	ВТ КАК ВТ
			|ГДЕ
			|	ВТ.СхемаКредитования В(&СхемаКредитования)";
			
			Запрос.УстановитьПараметр("СхемаКредитования", МассивСК);
			Запрос.УстановитьПараметр("ВнешнийИсточник", ТЗМеталлы);
			
			Результат = Запрос.Выполнить().Выгрузить();
			
			Если Результат.Количество() > 0 Тогда
				ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенМеталлы.Очистить();
				
				Для каждого Стр Из Результат Цикл
					НоваяСтр = ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенМеталлы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтр, Стр);
				КонецЦикла;
			Иначе
				ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенМеталлы.Очистить();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверитьСК(Ссылка)
	
	СтруктураВозврата = Новый Структура("СК");
	Отбор = Новый Структура;
	
	Для каждого СтрСК Из Ссылка.СхемыКредитования Цикл
		Отбор.Вставить("СхемаКредитования", СтрСК.СхемаКредитования);
		
		МассивС = Ссылка.СтавкиПроцентов.НайтиСтроки(Отбор);
		МассивВ = Ссылка.НастройкаОтклоненийОтБазовыхЦенВставки.НайтиСтроки(Отбор);
		МассивМ = Ссылка.НастройкаОтклоненийОтБазовыхЦенМеталлы.НайтиСтроки(Отбор);
		
		Кол = 0;
		
		Для каждого СтрС Из МассивС Цикл
			Если СтрС.Ставка = 0 Тогда
				Кол = Кол + 1;
			КонецЕсли;
		КонецЦикла;
		
		Если МассивС.Количество() = Кол И МассивВ.Количество() = 0 И МассивМ.Количество() = 0 Тогда
			СтруктураВозврата.СК = СтрСК.СхемаКредитования;
			Возврат СтруктураВозврата;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаСервере
Функция ПроверитьЗаполнениеСотрудников(Ссылка)
	
	Если НЕ ЗначениеЗаполнено(Ссылка.НачальникОРБ) ИЛИ НЕ ЗначениеЗаполнено(Ссылка.НачальникОДО)
		ИЛИ НЕ ЗначениеЗаполнено(Ссылка.ОтветственноеЛицоОРБ) //ИЛИ НЕ ЗначениеЗаполнено(Ссылка.ОтветственноеЛицоРеклама)
		ИЛИ НЕ ЗначениеЗаполнено(Ссылка.ПодписантФИО)
		//+МАН 04.07.25
		ИЛИ НЕ ЗначениеЗаполнено(Ссылка.Отделение) ИЛИ НЕ ЗначениеЗаполнено(Ссылка.НачальникОтделения)
		ИЛИ Ссылка.ОснованиеПриказа = "" Тогда
		//-МАН
		
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СценарийОценкиМеталловОчистка(Элемент, СтандартнаяОбработка)
	СценарийОценкиМеталловОчисткаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СценарийОценкиМеталловОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПослеВыбораСценария(ВыбранноеЗначение, Неопределено);
КонецПроцедуры

&НаСервере
Процедура СценарийОценкиМеталловОчисткаНаСервере()
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");
	ДокументОбъект.СценарийОценкиМеталлов = Справочники.ЛБ_СценарииОценки.ПустаяСсылка();
	ДокументОбъект.ЦеныМеталлы.Очистить(); 
	ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенМеталлы.Очистить();
	ДокументОбъект.Записать(); 
	ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоЗалогодателей(Ссылка, НаименованиеТЧ) //"Залогодатели")
	Возврат Ссылка[НаименованиеТЧ].Количество();
КонецФункции

&НаСервере
Функция ПроверитьОтменуВДругихДокументах(Залогодатель, Дата, Ссылка, Ставки = Ложь, Металлы = Ложь, Вставки = Ложь)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ПриказИндивидуальныеУсловия.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЛБ_ПриказИндивидуальныеУсловия КАК ЛБ_ПриказИндивидуальныеУсловия
		|ГДЕ
		|	НЕ ЛБ_ПриказИндивидуальныеУсловия.ПометкаУдаления
		|	И ЛБ_ПриказИндивидуальныеУсловия.Проведен
		|	И ЛБ_ПриказИндивидуальныеУсловия.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|	И ЛБ_ПриказИндивидуальныеУсловия.Залогодатели.Залогодатель = &Залогодатель
		|	И 100 = 100
		|	И ЛБ_ПриказИндивидуальныеУсловия.ДатаНачалаДействияПриказа < &Дата
		|	И ЛБ_ПриказИндивидуальныеУсловия.ОтменяемыйПриказ = &ОтменяемыйПриказ";
	
	Если Ставки Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "100 = 100", "ЛБ_ПриказИндивидуальныеУсловия.Залогодатели.НетСтавок = &Ставки");
		Запрос.УстановитьПараметр("Ставки", Ставки);
	ИначеЕсли Металлы Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "100 = 100", "ЛБ_ПриказИндивидуальныеУсловия.Залогодатели.НетМеталлов = &Металлы");
		Запрос.УстановитьПараметр("Металлы", Металлы);
	ИначеЕсли Вставки Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "100 = 100", "ЛБ_ПриказИндивидуальныеУсловия.Залогодатели.НетВставок = &Вставки");
		Запрос.УстановитьПараметр("Вставки", Вставки);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.УстановитьПараметр("ОтменяемыйПриказ", Ссылка);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ТекущийПриказНачальникОтделенияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ЗначениеЗаполнено(ТекущийПриказ.Отделение) Тогда
		Предупреждение("Не выбрано отдеделение");
		Возврат;
	Иначе
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораСотрудника", ЭтаФорма);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("МассивСотрудников", НайтиНачальникаОтделения(ТекущийПриказ.Отделение, НачалоДня(ТекущийПриказ.Дата)));
		
		ОткрытьФорму("Справочник.ЛБ_Сотрудники.Форма.ФормаВыбораСотрудников",ПараметрыФормы,,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТекущийПриказОтделениеПриИзменении(Элемент)
	ЗаписатьРеквизит("Отделение", ТекущийПриказ.Отделение);
	
	Если ЗначениеЗаполнено(ТекущийПриказ.НачальникОтделения) Тогда
		ЗаписатьРеквизит("НачальникОтделения", ПредопределенноеЗначение("Справочник.ЛБ_Сотрудники.ПустаяСсылка"));
		ОбновитьСтрокуПриказа();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция НайтиНачальникаОтделения(Отделение, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность
		|ИЗ
		|	РегистрСведений.ЛБ_КадроваяИсторияСотрудников.СрезПоследних(
		|			&Дата,
		|			ВЫБОР
		|					КОГДА Подразделение = ЗНАЧЕНИЕ(Справочник.ЛБ_Ломбарды.ЦентральныйОфис)
		|						ТОГДА ИСТИНА
		|					КОГДА Подразделение В
		|							(ВЫБРАТЬ
		|								ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард
		|							ИЗ
		|								РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, Отделение = &Отделение) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
		|							ГДЕ
		|								НЕ ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.Закрыт)
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ
		|				И НЕ Сотрудник.ПометкаУдаления) КАК ЛБ_КадроваяИсторияСотрудниковСрезПоследних
		|ГДЕ
		|	НЕ ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность В
		|				(ВЫБРАТЬ
		|					ЛБ_ДолжностиДляИнвентаризационнойКомиссии.Должность КАК Должность
		|				ИЗ
		|					РегистрСведений.ЛБ_ДолжностиДляИнвентаризационнойКомиссии КАК ЛБ_ДолжностиДляИнвентаризационнойКомиссии)
		|	И ЛБ_КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыКадровыхСобытий.Увольнение)
		|	И ВЫБОР
		|			КОГДА ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяНачальникомОтделения
		|				ТОГДА ИСТИНА
		|			КОГДА ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяЗаместителемНачальникаОтделения
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник.Наименование";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Отделение", Отделение);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	МассивВозврата = Новый Массив;
	
	Пока Результат.Следующий() Цикл
		МассивВозврата.Добавить(Результат.Сотрудник);
	КонецЦикла;
	
	Возврат МассивВозврата;
	
КонецФункции

&НаКлиенте
Процедура ПослеВыбораСотрудника(Результат, ДопПараметры) Экспорт
	ЗаписатьРеквизит("НачальникОтделения", Результат);
	ОбновитьСтрокуПриказа();
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФайл(Команда)
	
	ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда  
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВладелецФайла",  ТекСтрока.Ссылка);
		ПараметрыФормы.Вставить("ТолькоПросмотр", Ложь);
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("Ссылка", ТекСтрока.Ссылка);

		ОбработкаПрикрепления = Новый ОписаниеОповещения("ПослеПрикрепленияФайла", ЭтаФорма, ДопПараметры);
		
		ОткрытьФорму("Обработка.РаботаСФайлами.Форма.ПрисоединенныеФайлы", ПараметрыФормы, ЭтаФорма,,,, ОбработкаПрикрепления, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;		
	
КонецПроцедуры

&НаСервере
Процедура ПослеПрикрепленияФайла(Результат, ДопПараметры) Экспорт
	ЗаполнитьТаблицуПриказов();
		
	Отбор = Новый Структура;
	Отбор.Вставить("Ссылка", ДопПараметры.Ссылка);
	
	мСтр = ТаблицаПриказов.НайтиСтроки(Отбор);
	ИндексСтр = ТаблицаПриказов.Индекс(мСтр[0]);
	
	ИдентификаторСтр = ТаблицаПриказов[ИндексСтр].ПолучитьИдентификатор();

	Элементы.ТаблицаПриказов.ТекущаяСтрока = ИдентификаторСтр;
	ДокументОбъект = ТаблицаПриказов[ИндексСтр].Ссылка.ПолучитьОбъект();
	ЗначениеВРеквизитФормы(ДокументОбъект, "ТекущийПриказ");
КонецПроцедуры

&НаКлиенте
Процедура ЗБПоПриказу(Команда)
	
	ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда
		ДанныеДокумента = ВернутьПроведениеДокумента(ТекСтрока.Ссылка);
		
		Если НЕ ДанныеДокумента.Проведен Тогда
			Предупреждение("Приказ не введен в действие!
						   |Невозможно сформировать отчет.");
			Возврат;
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ДатаНач", ТекСтрока.Дата);
		ПараметрыФормы.Вставить("ДатаКон", ?(ТекСтрока.ДатаОкончанияДействияПриказа > ТекущаяДата(), ТекСтрока.ДатаОкончанияДействияПриказа, ТекущаяДата()));
		ПараметрыФормы.Вставить("Ссылка", ДанныеДокумента.Ссылка);
								
		ОткрытьФорму("Отчет.ЛБ_ЗалоговыеБилетыПоДоговоруВИП.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	 

КонецПроцедуры

&НаСервере
Функция ВернутьПроведениеДокумента(Ссылка);
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Проведен", Ссылка.Проведен);
	СтруктураВозврата.Вставить("Ссылка", Ссылка);
	
	Возврат СтруктураВозврата;
КонецФункции

&НаКлиенте
Процедура ТекущийПриказОснованиеПриказаПриИзменении(Элемент)
	ЗаписатьРеквизит("ОснованиеПриказа", ТекущийПриказ.ОснованиеПриказа);
КонецПроцедуры

&НаКлиенте
Процедура ДоговораСВИП(Команда)
	ОткрытьФорму("Отчет.ЛБ_ОтчетОЗаключенныхДоговорахСВИП.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура КлиентыВСтатусеВИП(Команда)
	ОткрытьФорму("Отчет.ЛБ_ОтчетПоКлиентамВСтатусеВИП.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура ИндивидуальныеУсловия(Команда)
	ОткрытьФорму("Отчет.ЛБ_ОтчетПоИндивидуальнымУсловиям.Форма.ФормаОтчета");
КонецПроцедуры
