Процедура СообщитьОбОшибке(ОбъектДанных, СтрокаСообщения, Отказ)  Экспорт
	Сообщение = Новый СообщениеПользователю();
    Сообщение.Текст = СтрокаСообщения;
    Сообщение.УстановитьДанные(ОбъектДанных);
    Сообщение.Сообщить();
	
	Отказ = Истина;
КонецПроцедуры	

Процедура ПроверитьЗаполнениеШапкиДокумента(ДокументОбъект, СтруктураОбязательныхПолей, Отказ) Экспорт

	МетаданныеРеквизиты = ДокументОбъект.Метаданные().Реквизиты;
	
	Для каждого КлючЗначение Из СтруктураОбязательныхПолей Цикл

		Значение = ДокументОбъект[КлючЗначение.Ключ];
		Если НЕ ЗначениеЗаполнено(Значение) Тогда

			Если НЕ ЗначениеЗаполнено(КлючЗначение.Значение) Тогда
				ПредставлениеРеквизита = МетаданныеРеквизиты[КлючЗначение.Ключ].Представление();
				СтрокаСообщения = "Не заполнено значение реквизита """ + СокрЛП(ПредставлениеРеквизита) + """!";
			Иначе
				СтрокаСообщения = КлючЗначение.Значение;
			КонецЕсли;
			СообщитьОбОшибке(ДокументОбъект, СтрокаСообщения, Отказ);

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры // ПроверитьЗаполнениеШапкиДокумента()

// Проверяет правильность заполнения строк табличной части документа.
// Если какой-то из реквизтов, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
//
// Параметры:
//  ДокументОбъект             - объект проводимого документа, 
//  ИмяТабличнойЧасти          - табличная часть документа,
//  СтруктураОбязательныхПолей - структура, содержащая имена полей, которые собственно и надо проверить.
//  Отказ                      - флаг отказа в проведении.
//  Заголовок                  - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧасти(ДокументОбъект, ИмяТабличнойЧасти, СтруктураОбязательныхПолей, 
                                                    Отказ) Экспорт

	ПредставлениеТабличнойЧасти = ДокументОбъект.Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти].Представление();
	ТабличнаяЧасть = ДокументОбъект[ИмяТабличнойЧасти];
	МетаданныеРеквизиты = ДокументОбъект.Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти].Реквизиты;

	// Цикл по строкам табличной части.
	Для каждого СтрокаТаблицы Из ТабличнаяЧасть Цикл

		СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(СтрокаТаблицы.НомерСтроки) +
		                               """ табличной части """ + ПредставлениеТабличнойЧасти + """: ";

		// Цикл по проверяемым полям
		Для каждого КлючЗначение Из СтруктураОбязательныхПолей Цикл

			Значение = СтрокаТаблицы[КлючЗначение.Ключ];
			Если НЕ ЗначениеЗаполнено(Значение) Тогда

				Если НЕ ЗначениеЗаполнено(КлючЗначение.Значение) Тогда
					ПредставлениеРеквизита = МетаданныеРеквизиты[КлючЗначение.Ключ].Представление();
					СтрокаСообщения = "Не заполнено значение реквизита """ + СокрЛП(ПредставлениеРеквизита) + """!";
				Иначе
					СтрокаСообщения = КлючЗначение.Значение;
				КонецЕсли;
				СообщитьОбОшибке(ДокументОбъект, СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ);

			КонецЕсли;

		КонецЦикла;

	КонецЦикла;

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧасти()

Функция РасчитатьМаксимальнуюСуммуЗалога(Дата, СхемаКредитования, СтатусыЗалогодателя, СтрокаТабличнойЧасти) Экспорт
	МаксимальнаяСуммаОценки = СтрокаТабличнойЧасти.СуммаОценки;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("СхемаКредитования", СхемаКредитования);
	Запрос.УстановитьПараметр("СтатусыЗалогодателя", СтатусыЗалогодателя); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_НастройкаУвеличенияЗалогаПоСтатусамЗалогодателейСрезПоследних.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрСведений.ЛБ_НастройкаУвеличенияЗалогаПоСтатусамЗалогодателей.СрезПоследних(&Дата, СхемаКредитования = &СхемаКредитования) КАК ЛБ_НастройкаУвеличенияЗалогаПоСтатусамЗалогодателейСрезПоследних";
	ВыборкаДок = Запрос.Выполнить().Выбрать();
	Если ВыборкаДок.Следующий() Тогда   
		Запрос.УстановитьПараметр("Регистратор", ВыборкаДок.Регистратор);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_НастройкаУвеличенияЗалогаПоСтатусамЗалогодателейСрезПоследних.УвеличениеСтоимостиЗалога КАК УвеличениеСтоимостиЗалога
		               |ИЗ
		               |	РегистрСведений.ЛБ_НастройкаУвеличенияЗалогаПоСтатусамЗалогодателей.СрезПоследних КАК ЛБ_НастройкаУвеличенияЗалогаПоСтатусамЗалогодателейСрезПоследних
		               |ГДЕ
		               |	ЛБ_НастройкаУвеличенияЗалогаПоСтатусамЗалогодателейСрезПоследних.СтатусЗалогодателя В(&СтатусыЗалогодателя)
		               |	И ЛБ_НастройкаУвеличенияЗалогаПоСтатусамЗалогодателейСрезПоследних.Регистратор = &Регистратор";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			МаксимальнаяСуммаОценки = МаксимальнаяСуммаОценки + МаксимальнаяСуммаОценки*Выборка.УвеличениеСтоимостиЗалога/100;
		КонецЕсли;
	КонецЕсли;	
			
	Возврат МаксимальнаяСуммаОценки;
КонецФункции

Функция ОкруглитьСуммуСсудыПоНастройкам(Дата, Организация, Сумма) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст ="ВЫБРАТЬ
	              |	УсловияПредоставленияКредита.ОкруглятьСуммуОценка КАК ОкруглятьЦены,
	              |	УсловияПредоставленияКредита.ПорядокОкругленияОценка КАК ПорядокОкругления,
	              |	УсловияПредоставленияКредита.ОкруглятьВБольшуюСторонуОценка КАК ОкруглятьВБольшуюСторону
	              |ИЗ
	              |	РегистрСведений.ЛБ_НастройкиЗаймаВерхнегоУровня.СрезПоследних(&Дата, Организация = &Организация) КАК УсловияПредоставленияКредита"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.ОкруглятьЦены Тогда
		    Сумма = ЛБ_ОбщийМодуль.ОкруглитьЦену(Сумма, Выборка.ПорядокОкругления, Выборка.ОкруглятьВБольшуюСторону);
		КонецЕсли;	
	КонецЕсли; 
	Возврат Сумма;
 КонецФункции

Функция СоздатьОбъектЗалога(ДокументОбъект, СтрокаТЧ) Экспорт
	Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ОбъектЗалога) Тогда
	    НовыйОбъектЗалога = Справочники.ЛБ_ОбъектыЗалога.СоздатьЭлемент();
	Иначе
		НовыйОбъектЗалога = СтрокаТЧ.ОбъектЗалога.ПолучитьОбъект();
		Если НовыйОбъектЗалога.ПометкаУдаления Тогда
			НовыйОбъектЗалога.УстановитьПометкуУдаления(ложь);
		КонецЕсли;	
	КонецЕсли;	
	НовыйОбъектЗалога.Залогодатель = ДокументОбъект.Залогодатель;	 
	Попытка
		НовыйОбъектЗалога.Наименование = СокрЛП(СтрокаТЧ.ВидИзделия.Наименование) + ?(СтрокаТЧ.ЕстьВставки, " с/в", " б/в"); 
	    НовыйОбъектЗалога.Записать();
		СтрокаТЧ.ОбъектЗалога = НовыйОбъектЗалога.Ссылка;
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;	 
КонецФункции	

Функция ПолучитьНомерЗалоговогоБилета(ДокументОбъект) Экспорт
	ДатаДок = ?(НЕ ЗначениеЗаполнено(ДокументОбъект.Ссылка), ТекущаяДата(), ДокументОбъект.Дата);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("Организация", ДокументОбъект.Организация);
	Запрос.УстановитьПараметр("Ломбард", ДокументОбъект.Ломбард);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВложенныйЗапрос.Номер КАК Номер,
	               |	СУММА(ВложенныйЗапрос.Количество) КАК Количество
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ЛБ_БланкиЗалоговыхБилетовОстатки.Номер КАК Номер,
	               |		ЛБ_БланкиЗалоговыхБилетовОстатки.КоличествоОстаток КАК Количество
	               |	ИЗ
	               |		РегистрНакопления.ЛБ_БланкиЗалоговыхБилетов.Остатки(
	               |				&Дата,
	               |				Организация = &Организация
	               |					И Ломбард = &Ломбард) КАК ЛБ_БланкиЗалоговыхБилетовОстатки
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ЛБ_ИспользованныеЗалоговыеБилеты.Номер,
	               |		-ЛБ_ИспользованныеЗалоговыеБилеты.Количество
	               |	ИЗ
	               |		РегистрСведений.ЛБ_ИспользованныеЗалоговыеБилеты КАК ЛБ_ИспользованныеЗалоговыеБилеты
	               |	ГДЕ
	               |		ЛБ_ИспользованныеЗалоговыеБилеты.Организация = &Организация
	               |		И ЛБ_ИспользованныеЗалоговыеБилеты.Ломбард = &Ломбард) КАК ВложенныйЗапрос
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.Номер";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	ТаблицаЗапроса.Сортировать("Номер");

	Для сч = 0 По ТаблицаЗапроса.Количество() - 1 Цикл
		Если НЕ ТаблицаЗапроса.Получить(сч).Количество = 0 Тогда
			Возврат ТаблицаЗапроса.Получить(сч).Номер;
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат неопределено;
КонецФункции

Процедура УдалитьДвиженияДокумента(Документ) Экспорт

    ДокОбъект = Документ.ПолучитьОбъект();

    Для Каждого Движение ИЗ ДокОбъект.Движения Цикл

        Если Движение.Количество() > 0 Тогда

            Точка = Найти(Строка(Движение), ".");
            ВидРегистра = Лев(Строка(Движение), Точка - 13);
            РегистрИмя = СокрП(Сред(Строка(Движение), Точка + 1));

            Если ВидРегистра = "РегистрНакопления" Тогда
                Регистр = РегистрыНакопления[РегистрИмя];            
            ИначеЕсли ВидРегистра = "РегистрБухгалтерии" Тогда
                Регистр = РегистрыБухгалтерии[РегистрИмя];  
            ИначеЕсли ВидРегистра = "РегистрСведений" Тогда
                Регистр = РегистрыСведений[РегистрИмя];  
            ИначеЕсли ВидРегистра = "РегистрРасчета" Тогда
                Регистр = РегистрыРасчета[РегистрИмя];    
            КонецЕсли;

            НаборЗаписей = Регистр.СоздатьНаборЗаписей();
            НаборЗаписей.Отбор.Регистратор.Установить(ДокОбъект.Ссылка);            

        Иначе
            НаборЗаписей = Движение;
        КонецЕсли;

        Попытка
            НаборЗаписей.Записать();
        Исключение
            Сообщить(ОписаниеОшибки());
        КонецПопытки;

    КонецЦикла;

КонецПроцедуры

Функция ПолучитьКонтактнуюИнформациюЗалогодателя(Залогодатель, Дата = неопределено) Экспорт
	Если Дата = неопределено Тогда
		Дата = ТекущаяДата();
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРождения КАК МестоРождения,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРожденияСтрана КАК МестоРожденияСтрана,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРожденияОбласть КАК МестоРожденияОбласть,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРожденияРайон КАК МестоРожденияРайон,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРожденияНаселенныйПункт КАК МестоРожденияНаселенныйПункт,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Пол КАК Пол,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК Телефон,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ТелефонСтруктура КАК ТелефонСтруктура,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Email КАК Email,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПрописке КАК АдресПоПрописке,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПропискеСтруктура КАК АдресПоПропискеСтруктура,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ФактическийАдрес КАК ФактическийАдрес,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ФактическийАдресСтруктура КАК ФактическийАдресСтруктура,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ПочтовыйАдрес КАК ПочтовыйАдрес,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ПочтовыйАдресСтруктура КАК ПочтовыйАдресСтруктура,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ТелефонДополнительный КАК ТелефонДополнительный,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ТелефонДополнительныйСтруктура КАК ТелефонДополнительныйСтруктура,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.КонтактноеЛицо КАК КонтактноеЛицо,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ТелефонКонтактногоЛица КАК ТелефонКонтактногоЛица,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ТелефонКонтактногоЛицаСтруктура КАК ТелефонКонтактногоЛицаСтруктура,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ИсточникИнформации КАК ИсточникИнформации,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Комментарий КАК Комментарий,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаСмерти КАК ДатаСмерти
	               |ИЗ
	               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("Фамилия", Выборка.Фамилия);
		СтруктураВозврата.Вставить("Имя", Выборка.Имя);
		СтруктураВозврата.Вставить("Отчество", Выборка.Отчество);
		СтруктураВозврата.Вставить("ДатаРождения", Выборка.ДатаРождения);
		СтруктураВозврата.Вставить("МестоРождения", Выборка.МестоРождения);
		СтруктураВозврата.Вставить("МестоРожденияСтрана", Выборка.МестоРожденияСтрана);
		СтруктураВозврата.Вставить("МестоРожденияОбласть", Выборка.МестоРожденияОбласть);
		СтруктураВозврата.Вставить("МестоРожденияРайон", Выборка.МестоРожденияРайон);
		СтруктураВозврата.Вставить("МестоРожденияНаселенныйПункт", Выборка.МестоРожденияНаселенныйПункт);
		СтруктураВозврата.Вставить("Телефон", Выборка.Телефон);
		СтруктураВозврата.Вставить("ТелефонСтруктура", Выборка.ТелефонСтруктура);
		СтруктураВозврата.Вставить("ТелефонДополнительный", Выборка.ТелефонДополнительный);
		СтруктураВозврата.Вставить("ТелефонДополнительныйСтруктура", Выборка.ТелефонДополнительныйСтруктура);
		СтруктураВозврата.Вставить("КонтактноеЛицо", Выборка.КонтактноеЛицо);
		СтруктураВозврата.Вставить("ТелефонКонтактногоЛица", Выборка.ТелефонКонтактногоЛица);
		СтруктураВозврата.Вставить("ТелефонКонтактногоЛицаСтруктура", Выборка.ТелефонКонтактногоЛицаСтруктура);
		СтруктураВозврата.Вставить("ИсточникИнформации", Выборка.ИсточникИнформации);
		СтруктураВозврата.Вставить("Email", Выборка.Email);
		СтруктураВозврата.Вставить("АдресПоПрописке", Выборка.АдресПоПрописке);
		СтруктураВозврата.Вставить("АдресПоПропискеСтруктура", Выборка.АдресПоПропискеСтруктура);
		СтруктураВозврата.Вставить("ФактическийАдрес", Выборка.ФактическийАдрес);
		СтруктураВозврата.Вставить("ФактическийАдресСтруктура", Выборка.ФактическийАдресСтруктура);
		СтруктураВозврата.Вставить("ПочтовыйАдрес", Выборка.ПочтовыйАдрес);
		СтруктураВозврата.Вставить("ПочтовыйАдресСтруктура", Выборка.ПочтовыйАдресСтруктура);
		СтруктураВозврата.Вставить("ДатаСмерти", Выборка.ДатаСмерти);
		СтруктураВозврата.Вставить("Комментарий", Выборка.Комментарий);
	КонецЕсли; 
	
	Возврат неопределено;
КонецФункции

Функция ПолучитьДействующиеДокуметныЗалогодателя(Залогодатель, Гражданство, Дата = неопределено) Экспорт
	Если Дата = неопределено Тогда
		Дата = ТекущаяДата();
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.УстановитьПараметр("Гражданство", Гражданство);
	Запрос.УстановитьПараметр("Дата", Дата);
    Запрос.Текст = "ВЫБРАТЬ
                   |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
                   |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
                   |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
                   |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
                   |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
                   |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
                   |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
                   |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНачалоДействия КАК ДокументНачалоДействия,
                   |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия
                   |ИЗ
                   |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(
                   |			&Дата,
                   |			Залогодатель = &Залогодатель
                   |				И Гражданство = &Гражданство
                   |				И ДокументНеДействителен = ЛОЖЬ) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
        СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("ВидДокументаЗалогодателя", Выборка.ВидДокументаЗалогодателя);
		СтруктураВозврата.Вставить("ВидДокумента", Выборка.ВидДокумента);
		СтруктураВозврата.Вставить("ДокументСерия", Выборка.ДокументСерия);
        СтруктураВозврата.Вставить("ДокументНомер", Выборка.ДокументНомер);
		СтруктураВозврата.Вставить("ДокументДатаВыдачи", Выборка.ДокументДатаВыдачи);
		СтруктураВозврата.Вставить("ДокументКемВыдан", Выборка.ДокументКемВыдан);
		СтруктураВозврата.Вставить("ДокументКодПодразделения", Выборка.ДокументКодПодразделения);
		СтруктураВозврата.Вставить("ДокументНачалоДействия", Выборка.ДокументНачалоДействия);
		СтруктураВозврата.Вставить("ДокументСрокДействия", Выборка.ДокументСрокДействия);
    КонецЕсли; 
	
	Возврат неопределено;
КонецФункции

Функция ПроверитьПоПеречнюНедружественныхСтран(Гражданство) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Гражданство", Гражданство);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПереченьНедружественныхСтранСрезПоследних.Страна КАК Гражданство,
	               |	ЛБ_ПереченьНедружественныхСтранСрезПоследних.Отменено КАК Отменено
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПереченьНедружественныхСтран.СрезПоследних КАК ЛБ_ПереченьНедружественныхСтранСрезПоследних
	               |ГДЕ
	               |	ЛБ_ПереченьНедружественныхСтранСрезПоследних.Страна = &Гражданство";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.Отменено Тогда
			Возврат Ложь;
		Иначе
			Возврат Истина;
		КонецЕсли;	
	КонецЕсли;
	Возврат Ложь;
КонецФункции	

Функция ПреобразованиеТаблицыЗначенийВМассив(ТЗ) Экспорт

   Массив = Новый Массив;

   // Запишем в массив
   Для Каждого Строка Из ТЗ Цикл

       СтрТЗ = Новый Структура;
       Для Каждого ИмяКолонки Из ТЗ.Колонки Цикл
           СтрТЗ.Вставить(ИмяКолонки.Имя, Строка[ИмяКолонки.Имя]);
       КонецЦикла;

       Массив.Добавить(СтрТЗ);

   КонецЦикла;

   Возврат Массив;

КонецФункции   

Функция ПреобразованиеМассивВТаблицуЗначений(Массив) Экспорт

   ТЗ = Новый ТаблицаЗначений;

   Для Каждого СтрокаМассива Из Массив Цикл

       Если ТЗ.Колонки.Количество() = 0 Тогда
           Для Каждого ЭлементМассива Из СтрокаМассива Цикл
               ТЗ.Колонки.Добавить(ЭлементМассива.Ключ);
           КонецЦикла;
       КонецЕсли;

       НоваяСтрока = ТЗ.Добавить();
       Для Каждого ЭлементМассива Из СтрокаМассива Цикл
           НоваяСтрока[ЭлементМассива.Ключ] = ЭлементМассива.Значение;
       КонецЦикла;
   КонецЦикла;

   Возврат ТЗ;

КонецФункции

Процедура ПроверитьИсключитьИзПеречня(ДатаСверки, ВидПеречня, Клиент)
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", ДатаСверки); 
	Запрос.УстановитьПараметр("ВидПеречня", ВидПеречня);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КлиентыВПеречняхСрезПоследних.Залогодатель КАК Залогодатель,
	               |	ЛБ_КлиентыВПеречняхСрезПоследних.ВидПеречня КАК ВидПеречня,
	               |	ЛБ_КлиентыВПеречняхСрезПоследних.ДатаПеречня КАК ДатаПеречня,
	               |	ЛБ_КлиентыВПеречняхСрезПоследних.ИД КАК ИД,
	               |	ЛБ_КлиентыВПеречняхСрезПоследних.СтатусКлиентаВПеречне КАК СтатусКлиентаВПеречне,
	               |	ЛБ_КлиентыВПеречняхСрезПоследних.ДатаВключенияВПеречень КАК ДатаВключенияВПеречень,
	               |	ЛБ_КлиентыВПеречняхСрезПоследних.Период КАК Период
	               |ИЗ
	               |	РегистрСведений.ЛБ_КлиентыВПеречнях.СрезПоследних(
	               |			&Дата,
	               |			Залогодатель = &Клиент
	               |				И ВидПеречня = &ВидПеречня) КАК ЛБ_КлиентыВПеречняхСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ";  
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		Если Выборка.СтатусКлиентаВПеречне = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен Тогда
			Рег = РегистрыСведений.ЛБ_КлиентыВПеречнях;
			НаборЗаписей = Рег.СоздатьНаборЗаписей(); 
			НаборЗаписей.Отбор.Залогодатель.Установить(Клиент);
			НаборЗаписей.Отбор.ВидПеречня.Установить(ВидПеречня); 
			НаборЗаписей.Отбор.ДатаПеречня.Установить(Выборка.ДатаПеречня);
			НаборЗаписей.Отбор.ВидПроверки.Установить(Перечисления.ЛБ_ВидыПроверкиПеречней.ПроверкаПоПеречню);
			
			НоваяЗапись = НаборЗаписей.Добавить();   
			НоваяЗапись.Период = ТекущаяДата();
			НоваяЗапись.ВидПроверки = Перечисления.ЛБ_ВидыПроверкиПеречней.ПроверкаПоПеречню;
			НоваяЗапись.ВидПеречня = ВидПеречня; 
		    НоваяЗапись.ДатаПеречня = Выборка.ДатаПеречня;
			НоваяЗапись.Залогодатель = Клиент;                                                    
			НоваяЗапись.ИД = Выборка.ИД;
			НоваяЗапись.ДатаВключенияВПеречень = Выборка.ДатаВключенияВПеречень;
			НоваяЗапись.СтатусКлиентаВПеречне = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Исключен;
			ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
		    Если НЕ ТекПользователь.ЭтоЛомбард Тогда
	       		Ответственный = ТекПользователь;
			Иначе
				Ответственный = ПараметрыСеанса.ТекущийСотрудник;
			КонецЕсли;	
			НоваяЗапись.Ответственный = Ответственный;
			
			НаборЗаписей.Записать(Истина);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

Процедура ПроверкаКлиентаПоПеречням(ДатаСверки, Клиент) Экспорт  
	ЗапросП = Новый Запрос;
	ЗапросП.Текст = "ВЫБРАТЬ
	                |	ЛБ_ВидыПеречней.Ссылка КАК ВидПеречня
	                |ИЗ
	                |	Перечисление.ЛБ_ВидыПеречней КАК ЛБ_ВидыПеречней";
	ТаблицаПеречнейВиды = ЗапросП.Выполнить().Выгрузить();
	
	ЗапросП1 = Новый Запрос;
	ЗапросП1.УстановитьПараметр("Дата", ДатаСверки);
	ЗапросП1.Текст = "ВЫБРАТЬ
	                 |	ЛБ_ПереченьНежелательныхЛицСрезПоследних.ДатаПеречня КАК ДатаПеречня,
	                 |	ЛБ_ПереченьНежелательныхЛицСрезПоследних.ДатаВключенияВПеречень КАК ДатаВключенияВПеречень,
	                 |	ЛБ_ПереченьНежелательныхЛицСрезПоследних.ИД КАК ИД,
	                 |	ЛБ_ПереченьНежелательныхЛицСрезПоследних.Наименование КАК Наименование,
	                 |	ЛБ_ПереченьНежелательныхЛицСрезПоследних.НаименованиеЛат КАК НаименованиеЛат,
	                 |	ЛБ_ПереченьНежелательныхЛицСрезПоследних.ДатаРождения КАК ДатаРождения,
	                 |	ЛБ_ПереченьНежелательныхЛицСрезПоследних.ГодРождения КАК ГодРождения,
	                 |	ЛБ_ПереченьНежелательныхЛицСрезПоследних.ИНН КАК ИНН,
	                 |	ЛБ_ПереченьНежелательныхЛицСрезПоследних.ЮридическоеФизическоеЛицо КАК ЮридическоеФизическоеЛицо,
	                 |	ЛБ_ПереченьНежелательныхЛицСрезПоследних.Статус КАК Статус
	                 |ИЗ
	                 |	РегистрСведений.ЛБ_ПереченьНежелательныхЛиц.СрезПоследних(&Дата, ВидПеречня = &ВидПеречня) КАК ЛБ_ПереченьНежелательныхЛицСрезПоследних
	                 |
	                 |УПОРЯДОЧИТЬ ПО
	                 |	ЛБ_ПереченьНежелательныхЛицСрезПоследних.Период УБЫВ";
	 
	ЗапросП2 = Новый Запрос;
	ЗапросП2.УстановитьПараметр("Дата", ДатаСверки);
	ЗапросП2.Текст = "ВЫБРАТЬ
	                 |	ЛБ_ПереченьНежелательныхЛицДокументыСрезПоследних.ИД КАК ИД,
	                 |	ЛБ_ПереченьНежелательныхЛицДокументыСрезПоследних.ДокументНомер КАК ДокументНомер,
	                 |	ЛБ_ПереченьНежелательныхЛицДокументыСрезПоследних.ДокументСерия КАК ДокументСерия
	                 |ИЗ
	                 |	РегистрСведений.ЛБ_ПереченьНежелательныхЛицДокументы.СрезПоследних(&Дата, ВидПеречня = &ВидПеречня) КАК ЛБ_ПереченьНежелательныхЛицДокументыСрезПоследних"; 
	  
	ЗапросП3 = Новый Запрос;
	ЗапросП3.УстановитьПараметр("Дата", ДатаСверки);
	ЗапросП3.Текст = "ВЫБРАТЬ
	                 |	ЛБ_ПереченьНежелательныхЛицДрНаименованияСрезПоследних.ИД КАК ИД,
	                 |	ЛБ_ПереченьНежелательныхЛицДрНаименованияСрезПоследних.Наименование КАК Наименование,
	                 |	ЛБ_ПереченьНежелательныхЛицДрНаименованияСрезПоследних.ДатаРождения КАК ДатаРождения,
	                 |	ЛБ_ПереченьНежелательныхЛицДрНаименованияСрезПоследних.ГодРождения КАК ГодРождения
	                 |ИЗ
	                 |	РегистрСведений.ЛБ_ПереченьНежелательныхЛицДрНаименования.СрезПоследних(&Дата, ВидПеречня = &ВидПеречня) КАК ЛБ_ПереченьНежелательныхЛицДрНаименованияСрезПоследних";  
		
		
    Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("ВидДокументаЗалогодателя", Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателя.Владелец КАК Клиент,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателя.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник.ЛБ_ДокументыЗалогодателя КАК ЛБ_ДокументыЗалогодателя
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних КАК ЛБ_ДокументыЗалогодателейСрезПоследних
	               |		ПО (ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя = ЛБ_ДокументыЗалогодателя.Ссылка)
	               |ГДЕ
	               |	ЛБ_ДокументыЗалогодателя.ВидДокументаЗалогодателя = &ВидДокументаЗалогодателя
	               |	И ЛБ_ДокументыЗалогодателя.Владелец = &Клиент";
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_Залогодатели.Ссылка КАК Клиент,
	               |	ЛБ_Залогодатели.Наименование КАК Наименование,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
	               |	ЛБ_АнкетаЗалогодателяСрезПоследних.ИНН КАК ИНН,
	               |	ЛБ_АнкетаЗалогодателяСрезПоследних.ТипФизЛица КАК ЮридическоеФизическоеЛицо,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия_А КАК Фамилия_А,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя_А КАК Имя_А,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество_А КАК Отчество_А
	               |ИЗ
	               |	Справочник.ЛБ_Залогодатели КАК ЛБ_Залогодатели
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних
	               |		ПО (ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Залогодатель = ЛБ_Залогодатели.Ссылка)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_АнкетаЗалогодателя.СрезПоследних КАК ЛБ_АнкетаЗалогодателяСрезПоследних
	               |		ПО (ЛБ_АнкетаЗалогодателяСрезПоследних.Залогодатель = ЛБ_Залогодатели.Ссылка)
	               |ГДЕ
	               |	ЛБ_Залогодатели.Ссылка = &Клиент";
	Выборка = Запрос.Выполнить().Выбрать(); 
	ЕстьСовпадение = ложь;
	Если Выборка.Следующий() Тогда
		Наименование = СокрЛП(Выборка.Фамилия) + ?(ПустаяСтрока(Выборка.Имя), "", " " + СокрЛП(Выборка.Имя)) + ?(ПустаяСтрока(Выборка.Отчество), "", " " + СокрЛП(Выборка.Отчество));
		Наименование = ВРег(Наименование); 
		НаименованиеЛат = СокрЛП(Выборка.Фамилия_А) + ?(ПустаяСтрока(Выборка.Имя_А), "", " " + СокрЛП(Выборка.Имя_А)) + ?(ПустаяСтрока(Выборка.Отчество_А), "", " " + СокрЛП(Выборка.Отчество_А));
		НаименованиеЛат = ВРег(НаименованиеЛат);
		ДатаРождения = Выборка.ДатаРождения;
		ГодРождения = Год(ДатаРождения);
		ЮридическоеФизическоеЛицо = Выборка.ЮридическоеФизическоеЛицо; 
		ИНН = СокрЛП(Выборка.ИНН);

		Для каждого СтрП Из ТаблицаПеречнейВиды Цикл
			ЗапросП1.УстановитьПараметр("ВидПеречня", СтрП.ВидПеречня);  
			ТаблицаПеречней = ЗапросП1.Выполнить().Выгрузить(); 
			
			ЗапросП2.УстановитьПараметр("ВидПеречня", СтрП.ВидПеречня); 
			ТаблицаПеречнейДокументы = ЗапросП2.Выполнить().Выгрузить();  
			
			ЗапросП3.УстановитьПараметр("ВидПеречня", СтрП.ВидПеречня); 
			ТаблицаПеречнейДрНаименования = ЗапросП3.Выполнить().Выгрузить(); 
			
			ЕстьСовпадение = ложь; 
			Отбор = Новый Структура;
			Отбор.Вставить("Наименование", Наименование);
			Отбор.Вставить("ЮридическоеФизическоеЛицо", ЮридическоеФизическоеЛицо);   
			СтрокиК = ТаблицаПеречней.НайтиСтроки(Отбор);
			Если НЕ СтрокиК.Количество() = 0 Тогда
				СтрК = СтрокиК.Получить(0);
				Если НЕ СтрК.ДатаРождения = Дата(1,1,1) Тогда 
					Если СтрК.ДатаРождения = ДатаРождения Тогда
						ЗаписатьВПеречень(Клиент, СтрП.ВидПеречня, СтрК.ДатаПеречня, СтрК.Ид, СтрК.ДатаВключенияВПеречень, СтрК.Статус);
						ЕстьСовпадение = Истина;  
						Прервать;
					КонецЕсли;	
				ИначеЕсли НЕ ГодРождения = 0 Тогда 
					Если СтрК.ГодРождения = ГодРождения Тогда
						ЗаписатьВПеречень(Клиент, СтрП.ВидПеречня, СтрК.ДатаПеречня, СтрК.Ид, СтрК.ДатаВключенияВПеречень, СтрК.Статус);
						ЕстьСовпадение = Истина;  
						Прервать;
					КонецЕсли;	
				КонецЕсли;
				Если НЕ ПустаяСтрока(ИНН) Тогда 
					Если СтрК.ИНН = ИНН Тогда
					    ЗаписатьВПеречень(Клиент, СтрП.ВидПеречня, СтрК.ДатаПеречня, СтрК.Ид, СтрК.ДатаВключенияВПеречень, СтрК.Статус);
						ЕстьСовпадение = Истина;
						Прервать;
					КонецЕсли;			
				КонецЕсли;
			КонецЕсли; 	
			Если ЕстьСовпадение Тогда
				Продолжить;
			КонецЕсли;  
			
			Если НЕ Пустаястрока(НаименованиеЛат) Тогда
				Отбор = Новый Структура;
                Отбор.Вставить("НаименованиеЛат", НаименованиеЛат); 
				Отбор.Вставить("ЮридическоеФизическоеЛицо", ЮридическоеФизическоеЛицо);
				СтрокиК = ТаблицаПеречней.НайтиСтроки(Отбор);
				Если НЕ СтрокиК.Количество() = 0 Тогда
					СтрК = СтрокиК.Получить(0);
					Если НЕ СтрК.ДатаРождения = Дата(1,1,1) Тогда 
						Если СтрК.ДатаРождения = ДатаРождения Тогда
							ЗаписатьВПеречень(Клиент, СтрП.ВидПеречня, СтрК.ДатаПеречня, СтрК.Ид, СтрК.ДатаВключенияВПеречень, СтрК.Статус);
							ЕстьСовпадение = Истина;  
							Прервать;
						КонецЕсли;	
					ИначеЕсли НЕ ГодРождения = 0 Тогда 
						Если СтрК.ГодРождения = ГодРождения Тогда
							ЗаписатьВПеречень(Клиент, СтрП.ВидПеречня, СтрК.ДатаПеречня, СтрК.Ид, СтрК.ДатаВключенияВПеречень, СтрК.Статус);
							ЕстьСовпадение = Истина;  
							Прервать;
						КонецЕсли;	
					КонецЕсли;
					Если НЕ ПустаяСтрока(ИНН) Тогда 
						Если СтрК.ИНН = ИНН Тогда
						    ЗаписатьВПеречень(Клиент, СтрП.ВидПеречня, СтрК.ДатаПеречня, СтрК.Ид, СтрК.ДатаВключенияВПеречень, СтрК.Статус);
							ЕстьСовпадение = Истина;
							Прервать;
						КонецЕсли;			
					КонецЕсли;
				КонецЕсли; 	
                Если ЕстьСовпадение Тогда
					Продолжить;
				КонецЕсли;  
			КонецЕсли;	

							
			Отбор = Новый Структура;
			Отбор.Вставить("Наименование", Наименование);
			СтрокиК = ТаблицаПеречнейДрНаименования.НайтиСтроки(Отбор);
			Если НЕ СтрокиК.Количество() = 0 Тогда 
				СтрК = СтрокиК.Получить(0); 
				ОтборИД = Новый Структура;
				ОтборИД.Вставить("ИД", СтрК.ИД);
				СтрокиИД = ТаблицаПеречней.НайтиСтроки(ОтборИД);
				Если НЕ СтрокиИД.Количество() = 0 Тогда  
					СтрИД = СтрокиИД.Получить(0);
					Если НЕ СтрК.ДатаРождения = Дата(1,1,1) Тогда 
						Если СтрК.ДатаРождения = ДатаРождения Тогда  
							ЗаписатьВПеречень(Клиент, СтрП.ВидПеречня, СтрИД.ДатаПеречня, СтрИД.Ид, СтрИД.ДатаВключенияВПеречень, СтрИД.Статус);
						    ЕстьСовпадение = Истина; 								
							Прервать;
						КонецЕсли;	
					ИначеЕсли НЕ ГодРождения = 0 Тогда 
						Если СтрК.ГодРождения = ГодРождения Тогда
							ЗаписатьВПеречень(Клиент, СтрП.ВидПеречня, СтрИД.ДатаПеречня, СтрИД.Ид, СтрИД.ДатаВключенияВПеречень, СтрИД.Статус);
							ЕстьСовпадение = Истина;  
							Прервать;
						КонецЕсли;	
					КонецЕсли; 
					//Если НЕ ПустаяСтрока(ИНН) Тогда 
					//	Если СтрИД.ИНН = ИНН Тогда
					//	    ЗаписатьВПеречень(Клиент, СтрП.ВидПеречня, СтрИД.ДатаПеречня, СтрИД.Ид, СтрИД.ДатаВключенияВПеречень, СтрИД.Статус);
					//		ЕстьСовпадение = Истина;
					//		Прервать;
					//	КонецЕсли;			
					//КонецЕсли;
				КонецЕсли;	
			КонецЕсли;  
			Если ЕстьСовпадение Тогда
				Продолжить;
			КонецЕсли;  
			
			Если НЕ Пустаястрока(НаименованиеЛат) Тогда
	        	Отбор = Новый Структура;
				Отбор.Вставить("НаименованиеЛат", НаименованиеЛат); 
				Отбор.Вставить("ЮридическоеФизическоеЛицо", ЮридическоеФизическоеЛицо);
				СтрокиК = ТаблицаПеречней.НайтиСтроки(Отбор);
				Если НЕ СтрокиК.Количество() = 0 Тогда 
					СтрК = СтрокиК.Получить(0);  
					Если НЕ СтрК.ДатаРождения = Дата(1,1,1) Тогда 
						Если СтрК.ДатаРождения = ДатаРождения Тогда
						    ЗаписатьВПеречень(Клиент, СтрП.ВидПеречня, СтрК.ДатаПеречня, СтрК.Ид, СтрК.ДатаВключенияВПеречень, СтрК.Статус);
							ЕстьСовпадение = Истина;
							Прервать;
						КонецЕсли;
					ИначеЕсли НЕ ГодРождения = 0 Тогда 
						Если СтрК.ГодРождения = ГодРождения Тогда
							ЗаписатьВПеречень(Клиент, СтрП.ВидПеречня, СтрК.ДатаПеречня, СтрК.Ид, СтрК.ДатаВключенияВПеречень, СтрК.Статус);
							ЕстьСовпадение = Истина;  
							Прервать;
						КонецЕсли;		
					КонецЕсли;	
					Если НЕ ПустаяСтрока(ИНН) Тогда 
						Если СтрК.ИНН = ИНН Тогда
						    ЗаписатьВПеречень(Клиент, СтрП.ВидПеречня, СтрК.ДатаПеречня, СтрК.Ид, СтрК.ДатаВключенияВПеречень, СтрК.Статус);
							ЕстьСовпадение = Истина;
							Прервать;
						КонецЕсли;			
					КонецЕсли;
				КонецЕсли;  
	            Если ЕстьСовпадение Тогда
					Продолжить;
				КонецЕсли;  
			
				Отбор = Новый Структура;
				Отбор.Вставить("Наименование", НаименованиеЛат); 
				СтрокиК = ТаблицаПеречнейДрНаименования.НайтиСтроки(Отбор);
				Если НЕ СтрокиК.Количество() = 0 Тогда 
					СтрК = СтрокиК.Получить(0); 
					ОтборИД = Новый Структура; 
					ОтборИД.Вставить("ИД", СтрК.ИД);
					СтрокиИД = ТаблицаПеречней.НайтиСтроки(ОтборИД);
					Если НЕ СтрокиИД.Количество() = 0 Тогда  
						СтрИД = СтрокиИД.Получить(0);
						Если НЕ СтрК.ДатаРождения = Дата(1,1,1) Тогда 
							Если СтрК.ДатаРождения = ДатаРождения Тогда
							    ЗаписатьВПеречень(Клиент, СтрП.ВидПеречня, СтрИД.ДатаПеречня, СтрИД.Ид, СтрИД.ДатаВключенияВПеречень, СтрИД.Статус);
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;	 
						ИначеЕсли НЕ ГодРождения = 0 Тогда 
							Если СтрК.ГодРождения = ГодРождения Тогда
								ЗаписатьВПеречень(Клиент, СтрП.ВидПеречня, СтрИД.ДатаПеречня, СтрИД.Ид, СтрИД.ДатаВключенияВПеречень, СтрИД.Статус);
								ЕстьСовпадение = Истина;  
								Прервать;
							КонецЕсли;		
						КонецЕсли; 
						//Если НЕ ПустаяСтрока(ИНН) Тогда 
						//	Если СтрИД.ИНН = ИНН Тогда
						//	    ЗаписатьВПеречень(Клиент, СтрП.ВидПеречня, СтрИД.ДатаПеречня, СтрИД.Ид, СтрИД.ДатаВключенияВПеречень, СтрИД.Статус);
						//		ЕстьСовпадение = Истина;
						//		Прервать;
						//	КонецЕсли;			
						//КонецЕсли;
					КонецЕсли;	
				КонецЕсли;  
	            Если ЕстьСовпадение Тогда
					Продолжить;
				КонецЕсли; 
			КонецЕсли;
			
			Если НЕ ПустаяСтрока(ИНН) Тогда 
				Отбор = Новый Структура;
				Отбор.Вставить("ИНН", ИНН); 
				Если СтрП.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ЦБ Тогда  
				    Отбор.Вставить("ДатаРождения", ДатаРождения); 
				КонецЕсли;	
				СтрокиК = ТаблицаПеречней.НайтиСтроки(Отбор); 
				Если НЕ СтрокиК.Количество() = 0 Тогда
					СтрИД = СтрокиК.Получить(0);  
					ЗаписатьВПеречень(Клиент, СтрП.ВидПеречня, СтрИД.ДатаПеречня, СтрИД.Ид, СтрИД.ДатаВключенияВПеречень, СтрИД.Статус);
					ЕстьСовпадение = Истина;
				КонецЕсли;	
			КонецЕсли; 
			Если ЕстьСовпадение Тогда
				Продолжить;
			КонецЕсли; 

			
			Для каждого СтрДок Из ТаблицаДокументов Цикл 
				ОтборК = Новый Структура;
				ОтборК.Вставить("ДокументНомер", СокрЛП(СтрДок.ДокументНомер)); 
				ОтборК.Вставить("ДокументСерия", СокрЛП(СтрДок.ДокументСерия));
				СтрокиК = ТаблицаПеречнейДокументы.НайтиСтроки(ОтборК); 
				Если НЕ СтрокиК.Количество() = 0 Тогда 
					СтрК = СтрокиК.Получить(0);
					ОтборИД = Новый Структура; 
					ОтборИД.Вставить("ИД", СтрК.ИД);
					СтрокиИД = ТаблицаПеречней.НайтиСтроки(ОтборИД);
					Если НЕ СтрокиИД.Количество() = 0 Тогда    
						СтрИД = СтрокиИД.Получить(0);
						Если СтрП.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ЦБ Тогда
							Если НЕ СтрИД.ДатаРождения = Дата(1,1,1) Тогда 
								Если СтрИД.ДатаРождения = ДатаРождения Тогда
								    ЗаписатьВПеречень(Клиент, СтрП.ВидПеречня, СтрИД.ДатаПеречня, СтрИД.Ид, СтрИД.ДатаВключенияВПеречень, СтрИД.Статус);
									ЕстьСовпадение = Истина;
									Прервать;
								КонецЕсли;	 
							ИначеЕсли НЕ ГодРождения = 0 Тогда 
								Если СтрИД.ГодРождения = ГодРождения Тогда
									ЗаписатьВПеречень(Клиент, СтрП.ВидПеречня, СтрИД.ДатаПеречня, СтрИД.Ид, СтрИД.ДатаВключенияВПеречень, СтрИД.Статус);
									ЕстьСовпадение = Истина;  
									Прервать;
								КонецЕсли;		
							КонецЕсли;	
					        Если НЕ ПустаяСтрока(ИНН) Тогда 
								Если СтрИД.ИНН = ИНН Тогда
								    ЗаписатьВПеречень(Клиент, СтрП.ВидПеречня, СтрИД.ДатаПеречня, СтрИД.Ид, СтрИД.ДатаВключенияВПеречень, СтрИД.Статус);
									ЕстьСовпадение = Истина;
									Прервать;
								КонецЕсли;				
							КонецЕсли; 
						Иначе	
							ЗаписатьВПеречень(Клиент, СтрП.ВидПеречня, СтрИД.ДатаПеречня, СтрИД.Ид, СтрИД.ДатаВключенияВПеречень, СтрИД.Статус);
							ЕстьСовпадение = Истина; 
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;  
                Если ЕстьСовпадение Тогда
					Прервать;
				КонецЕсли; 
			КонецЦикла;	
			Если НЕ ЕстьСовпадение Тогда
			    ПроверитьИсключитьИзПеречня(ДатаСверки, СтрП.ВидПеречня, Клиент);
			КонецЕсли;	
	    КонецЦикла;
    КонецЕсли;
КонецПроцедуры

Процедура ГлобальнаяПроверкаПоПеречням(Дата1, Дата2) Экспорт              
	ДатаПроверки = ТекущаяДата();
	ВидыПеречней = Новый СписокЗначений;
	ВидыПеречней.Добавить(Перечисления.ЛБ_ВидыПеречней.МВК);
	ВидыПеречней.Добавить(Перечисления.ЛБ_ВидыПеречней.Террористы);
	ВидыПеречней.Добавить(Перечисления.ЛБ_ВидыПеречней.ФРОМУ); 
	ВидыПеречней.Добавить(Перечисления.ЛБ_ВидыПеречней.ООН);
	
	ЗапросП = Новый Запрос; 
	ЗапросП.УстановитьПараметр("ВидыПеречней", ВидыПеречней);
	ЗапросП.Текст = "ВЫБРАТЬ
	                |	ЛБ_ВидыПеречней.Ссылка КАК ВидПеречня
	                |ИЗ
	                |	Перечисление.ЛБ_ВидыПеречней КАК ЛБ_ВидыПеречней
	                |ГДЕ
	                |	ЛБ_ВидыПеречней.Ссылка В(&ВидыПеречней)";
	ТаблицаП = ЗапросП.Выполнить().Выгрузить();
	
	ЗапросП1 = Новый Запрос;
	ЗапросП1.УстановитьПараметр("Дата1", НачалоДня(Дата1));  
	ЗапросП1.УстановитьПараметр("Дата2", КонецДня(Дата2));
	ЗапросП1.Текст = "ВЫБРАТЬ
	                 |	ЛБ_ПереченьНежелательныхЛиц.ВидПеречня КАК ВидПеречня,
	                 |	ЛБ_ПереченьНежелательныхЛиц.ДатаПеречня КАК ДатаПеречня,
	                 |	ЛБ_ПереченьНежелательныхЛиц.ДатаВключенияВПеречень КАК ДатаВключенияВПеречень,
	                 |	ЛБ_ПереченьНежелательныхЛиц.ИД КАК ИД,
	                 |	ЛБ_ПереченьНежелательныхЛиц.Наименование КАК Наименование,
	                 |	ЛБ_ПереченьНежелательныхЛиц.НаименованиеЛат КАК НаименованиеЛат,
	                 |	ЛБ_ПереченьНежелательныхЛиц.ДатаРождения КАК ДатаРождения,
	                 |	ЛБ_ПереченьНежелательныхЛиц.ГодРождения КАК ГодРождения,
	                 |	ЛБ_ПереченьНежелательныхЛиц.ИНН КАК ИНН,
	                 |	ЛБ_ПереченьНежелательныхЛиц.ЮридическоеФизическоеЛицо КАК ЮридическоеФизическоеЛицо,
	                 |	ЛБ_ПереченьНежелательныхЛиц.Статус КАК Статус,
	                 |	ЛБ_ПереченьНежелательныхЛиц.РазмерФайла КАК РазмерФайла
	                 |ИЗ
	                 |	РегистрСведений.ЛБ_ПереченьНежелательныхЛиц КАК ЛБ_ПереченьНежелательныхЛиц
	                 |ГДЕ
	                 |	ЛБ_ПереченьНежелательныхЛиц.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыКлиентаВПеречнях.Включен)
	                 |	И ЛБ_ПереченьНежелательныхЛиц.Период МЕЖДУ &Дата1 И &Дата2
	                 |
	                 |УПОРЯДОЧИТЬ ПО
	                 |	ЛБ_ПереченьНежелательныхЛиц.Период";  
	ТаблицаПеречней = ЗапросП1.Выполнить().Выгрузить(); 
	ТаблицаПеречнейДаты = ТаблицаПеречней.Скопировать();
	ТаблицаПеречнейДаты.Свернуть("ВидПеречня, ДатаПеречня, РазмерФайла");
	
	ЗапросП2 = Новый Запрос;
	ЗапросП2.УстановитьПараметр("Дата1", Дата1);  
	ЗапросП2.УстановитьПараметр("Дата2", Дата2);
	ЗапросП2.Текст = "ВЫБРАТЬ
	                 |	ЛБ_ПереченьНежелательныхЛицДокументы.ВидПеречня КАК ВидПеречня,
	                 |	ЛБ_ПереченьНежелательныхЛицДокументы.ДатаПеречня КАК ДатаПеречня,
	                 |	ЛБ_ПереченьНежелательныхЛицДокументы.ИД КАК ИД,
	                 |	ЛБ_ПереченьНежелательныхЛицДокументы.ДокументНомер КАК ДокументНомер,
	                 |	ЛБ_ПереченьНежелательныхЛицДокументы.ДокументСерия КАК ДокументСерия
	                 |ИЗ
	                 |	РегистрСведений.ЛБ_ПереченьНежелательныхЛицДокументы КАК ЛБ_ПереченьНежелательныхЛицДокументы
	                 |ГДЕ
	                 |	ЛБ_ПереченьНежелательныхЛицДокументы.Период МЕЖДУ &Дата1 И &Дата2"; 
	ТаблицаПеречнейДокументы = ЗапросП2.Выполнить().Выгрузить();
	  
	ЗапросП3 = Новый Запрос;  
	ЗапросП3.УстановитьПараметр("Дата1", Дата1);  
	ЗапросП3.УстановитьПараметр("Дата2", Дата2);
	ЗапросП3.Текст = "ВЫБРАТЬ
	                 |	ЛБ_ПереченьНежелательныхЛицДрНаименования.ВидПеречня КАК ВидПеречня,
	                 |	ЛБ_ПереченьНежелательныхЛицДрНаименования.ДатаПеречня КАК ДатаПеречня,
	                 |	ЛБ_ПереченьНежелательныхЛицДрНаименования.ИД КАК ИД,
	                 |	ЛБ_ПереченьНежелательныхЛицДрНаименования.Наименование КАК Наименование,
	                 |	ЛБ_ПереченьНежелательныхЛицДрНаименования.ДатаРождения КАК ДатаРождения,
	                 |	ЛБ_ПереченьНежелательныхЛицДрНаименования.ГодРождения КАК ГодРождения
	                 |ИЗ
	                 |	РегистрСведений.ЛБ_ПереченьНежелательныхЛицДрНаименования КАК ЛБ_ПереченьНежелательныхЛицДрНаименования
	                 |ГДЕ
	                 |	ЛБ_ПереченьНежелательныхЛицДрНаименования.Период МЕЖДУ &Дата1 И &Дата2";  
	ТаблицаПеречнейДрНаименования = ЗапросП3.Выполнить().Выгрузить();	
		
    Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("ВидДокументаЗалогодателя", Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателя.Владелец КАК Клиент,
	               |	ЛБ_ДокументыЗалогодателей.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателей.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателя.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник.ЛБ_ДокументыЗалогодателя КАК ЛБ_ДокументыЗалогодателя
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ДокументыЗалогодателей КАК ЛБ_ДокументыЗалогодателей
	               |		ПО (ЛБ_ДокументыЗалогодателей.ДокументЗалогодателя = ЛБ_ДокументыЗалогодателя.Ссылка)
	               |ГДЕ
	               |	ЛБ_ДокументыЗалогодателя.ВидДокументаЗалогодателя = &ВидДокументаЗалогодателя";
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	
	СписокКлиентов = ЗаполнитьСписокКлиентовДляГлобальнойПроверкиПоПеречням(Дата1, Дата2);
	Запрос.УстановитьПараметр("СписокКлиентов", СписокКлиентов);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_Залогодатели.Ссылка КАК Клиент,
	               |	ЛБ_Залогодатели.Наименование КАК Наименование,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
	               |	ЛБ_АнкетаЗалогодателяСрезПоследних.ИНН КАК ИНН,
	               |	ЛБ_АнкетаЗалогодателяСрезПоследних.ТипФизЛица КАК ЮридическоеФизическоеЛицо,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия_А КАК Фамилия_А,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя_А КАК Имя_А,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество_А КАК Отчество_А
	               |ИЗ
	               |	Справочник.ЛБ_Залогодатели КАК ЛБ_Залогодатели
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних
	               |		ПО (ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Залогодатель = ЛБ_Залогодатели.Ссылка)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_АнкетаЗалогодателя.СрезПоследних КАК ЛБ_АнкетаЗалогодателяСрезПоследних
	               |		ПО (ЛБ_АнкетаЗалогодателяСрезПоследних.Залогодатель = ЛБ_Залогодатели.Ссылка)
	               |ГДЕ
	               |	ЛБ_Залогодатели.ПометкаУдаления = ЛОЖЬ
	               |	И ЛБ_Залогодатели.Ссылка В(&СписокКлиентов)
	               |АВТОУПОРЯДОЧИВАНИЕ";
	ТаблицаК = Запрос.Выполнить().Выгрузить(); 
		
	Для каждого СтрП Из ТаблицаП Цикл 						
		ОтборП = Новый Структура;
		ОтборП.Вставить("ВидПеречня", СтрП.ВидПеречня);  
		СтрокиПеречня = ТаблицаПеречнейДаты.НайтиСтроки(ОтборП);
		
		Для каждого стр Из СтрокиПеречня Цикл 
			Рег = РегистрыСведений.ЛБ_ДатыЗагрузкиПеречней;
			НаборЗаписей = Рег.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ВидПеречня.Установить(Стр.ВидПеречня); 
			НаборЗаписей.Отбор.ДатаПеречня.Установить(Стр.ДатаПеречня);
			НаборЗаписей.Отбор.Период.Установить(ДатаПроверки);
			НоваяЗапись = НаборЗаписей.Добавить(); 
			НоваяЗапись.Период = ДатаПроверки; 
			НоваяЗапись.ВидПроверки = Перечисления.ЛБ_ВидыПроверкиПеречней.ГлобальнаяПроверка;
			НоваяЗапись.ВидПеречня = Стр.ВидПеречня; 
		    НоваяЗапись.ДатаПеречня = Стр.ДатаПеречня; 
			НоваяЗапись.РазмерФайла = Стр.РазмерФайла;
			НоваяЗапись.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			НаборЗаписей.Записать(Истина);
			
			Для каждого Выборка из ТаблицаК Цикл   
				Клиент = Выборка.Клиент; 
				Наименование = СокрЛП(Выборка.Фамилия) + ?(ПустаяСтрока(Выборка.Имя), "", " " + СокрЛП(Выборка.Имя)) + ?(ПустаяСтрока(Выборка.Отчество), "", " " + СокрЛП(Выборка.Отчество));
				Наименование = ВРег(Наименование);
				НаименованиеЛат = СокрЛП(Выборка.Фамилия_А) + ?(ПустаяСтрока(Выборка.Имя_А), "", " " + СокрЛП(Выборка.Имя_А)) + ?(ПустаяСтрока(Выборка.Отчество_А), "", " " + СокрЛП(Выборка.Отчество_А));
				НаименованиеЛат = ВРег(НаименованиеЛат);
				// ++ Сербаев 25.07.2023
				//ДатаРождения = ?(ДатаРождения = null, Дата(1,1,1), Выборка.ДатаРождения);
				ДатаРождения = ?(Выборка.ДатаРождения = null, Дата(1,1,1), Выборка.ДатаРождения);
				// -- Сербаев 25.07.2023
				ГодРождения = Год(ДатаРождения);
				ЮридическоеФизическоеЛицо = Выборка.ЮридическоеФизическоеЛицо; 
				ИНН = СокрЛП(Выборка.ИНН);

				ЕстьСовпадение = ложь;
				Отбор = Новый Структура; 
				Отбор.Вставить("ВидПеречня", Стр.ВидПеречня);
				Отбор.Вставить("ДатаПеречня", Стр.ДатаПеречня);
				Отбор.Вставить("Наименование", Наименование);
				Отбор.Вставить("ЮридическоеФизическоеЛицо", ЮридическоеФизическоеЛицо);   
				СтрокиК = ТаблицаПеречней.НайтиСтроки(Отбор);
				Если НЕ СтрокиК.Количество() = 0 Тогда 
					Для каждого СтрК Из СтрокиК Цикл  
						Если НЕ СтрК.ДатаРождения = Дата(1,1,1) Тогда 
							Если СтрК.ДатаРождения = ДатаРождения Тогда
								ЗаписатьВПереченьГлобальнаяПроверка(Клиент, СтрП.ВидПеречня, СтрК.ДатаПеречня, СтрК.Ид, СтрК.ДатаВключенияВПеречень, ДатаПроверки);
								ЕстьСовпадение = Истина;  
								Прервать;
							КонецЕсли;	 
						ИначеЕсли НЕ СтрК.ГодРождения = 0 Тогда 
							Если СтрК.ГодРождения = ГодРождения Тогда
								ЗаписатьВПереченьГлобальнаяПроверка(Клиент, СтрП.ВидПеречня, СтрК.ДатаПеречня, СтрК.Ид, СтрК.ДатаВключенияВПеречень, ДатаПроверки);
								ЕстьСовпадение = Истина;  
								Прервать;
							КонецЕсли;	
						КонецЕсли;
						Если НЕ ПустаяСтрока(ИНН) Тогда 
							Если СтрК.ИНН = ИНН Тогда
							    ЗаписатьВПереченьГлобальнаяПроверка(Клиент, СтрП.ВидПеречня, СтрК.ДатаПеречня, СтрК.Ид, СтрК.ДатаВключенияВПеречень, ДатаПроверки);
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;			
						КонецЕсли;
					КонецЦикла;	
				КонецЕсли; 	
				Если ЕстьСовпадение Тогда
					Продолжить;
				КонецЕсли;  
								
				Отбор = Новый Структура;  
				Отбор.Вставить("ВидПеречня", Стр.ВидПеречня);
				Отбор.Вставить("ДатаПеречня", Стр.ДатаПеречня);
				Отбор.Вставить("Наименование", Наименование);
				СтрокиК = ТаблицаПеречнейДрНаименования.НайтиСтроки(Отбор);
				Если НЕ СтрокиК.Количество() = 0 Тогда 
					Для каждого СтрК Из СтрокиК Цикл  
						ОтборИД = Новый Структура;
						ОтборИД.Вставить("ИД", СтрК.ИД);
						СтрокиИД = ТаблицаПеречней.НайтиСтроки(ОтборИД);
						Если НЕ СтрокиИД.Количество() = 0 Тогда  
							СтрИД = СтрокиИД.Получить(0);
							Если НЕ СтрК.ДатаРождения = Дата(1,1,1) Тогда 
								Если СтрК.ДатаРождения = ДатаРождения Тогда  
									ЗаписатьВПереченьГлобальнаяПроверка(Клиент, СтрП.ВидПеречня, СтрИД.ДатаПеречня, СтрИД.Ид, СтрИД.ДатаВключенияВПеречень, ДатаПроверки);
								    ЕстьСовпадение = Истина; 								
									Прервать;
								КонецЕсли;	 
							ИначеЕсли НЕ ГодРождения = 0 Тогда 
								Если СтрК.ГодРождения = ГодРождения Тогда
									ЗаписатьВПереченьГлобальнаяПроверка(Клиент, СтрП.ВидПеречня, СтрИД.ДатаПеречня, СтрИД.Ид, СтрИД.ДатаВключенияВПеречень, ДатаПроверки);
									ЕстьСовпадение = Истина;  
									Прервать;
								КонецЕсли;		
							КонецЕсли; 
							//Если НЕ ПустаяСтрока(ИНН) Тогда 
							//	Если СтрИД.ИНН = ИНН Тогда
							//	    ЗаписатьВПереченьГлобальнаяПроверка(Клиент, СтрП.ВидПеречня, СтрИД.ДатаПеречня, СтрИД.Ид, СтрИД.ДатаВключенияВПеречень, ДатаПроверки);
							//		ЕстьСовпадение = Истина;
							//		Прервать;
							//	КонецЕсли;			
							//КонецЕсли;
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли;  
				Если ЕстьСовпадение Тогда
					Продолжить;
				КонецЕсли;  
				
				Если НЕ Пустаястрока(НаименованиеЛат) Тогда
		        	Отбор = Новый Структура;
					Отбор.Вставить("ВидПеречня", Стр.ВидПеречня);
				    Отбор.Вставить("ДатаПеречня", Стр.ДатаПеречня);
					Отбор.Вставить("НаименованиеЛат", НаименованиеЛат); 
					Отбор.Вставить("ЮридическоеФизическоеЛицо", ЮридическоеФизическоеЛицо);
					СтрокиК = ТаблицаПеречней.НайтиСтроки(Отбор);
					Если НЕ СтрокиК.Количество() = 0 Тогда 
						Для каждого СтрК Из СтрокиК Цикл  
							Если НЕ СтрК.ДатаРождения = Дата(1,1,1) Тогда 
								Если СтрК.ДатаРождения = ДатаРождения Тогда
								    ЗаписатьВПереченьГлобальнаяПроверка(Клиент, СтрП.ВидПеречня, СтрК.ДатаПеречня, СтрК.Ид, СтрК.ДатаВключенияВПеречень, ДатаПроверки);
									ЕстьСовпадение = Истина;
									Прервать;
								КонецЕсли;	
							ИначеЕсли НЕ СтрК.ГодРождения = 0 Тогда 
								Если СтрК.ГодРождения = ГодРождения Тогда
									ЗаписатьВПереченьГлобальнаяПроверка(Клиент, СтрП.ВидПеречня, СтрК.ДатаПеречня, СтрК.Ид, СтрК.ДатаВключенияВПеречень, ДатаПроверки);
									ЕстьСовпадение = Истина;  
									Прервать;
								КонецЕсли;			
							КонецЕсли;	
							Если НЕ ПустаяСтрока(ИНН) Тогда 
								Если СтрК.ИНН = ИНН Тогда
								    ЗаписатьВПереченьГлобальнаяПроверка(Клиент, СтрП.ВидПеречня, СтрК.ДатаПеречня, СтрК.Ид, СтрК.ДатаВключенияВПеречень, ДатаПроверки);
									ЕстьСовпадение = Истина;
									Прервать;
								КонецЕсли;			
							КонецЕсли;
						КонецЦикла;	
					КонецЕсли;  
		            Если ЕстьСовпадение Тогда
						Продолжить;
					КонецЕсли;  
				
					Отбор = Новый Структура;  
					Отбор.Вставить("ВидПеречня", Стр.ВидПеречня);
				    Отбор.Вставить("ДатаПеречня", Стр.ДатаПеречня);
					Отбор.Вставить("Наименование", НаименованиеЛат); 
					СтрокиК = ТаблицаПеречнейДрНаименования.НайтиСтроки(Отбор);
					Если НЕ СтрокиК.Количество() = 0 Тогда 
						Для каждого СтрК Из СтрокиК Цикл  
							ОтборИД = Новый Структура; 
							ОтборИД.Вставить("ИД", СтрК.ИД);
							СтрокиИД = ТаблицаПеречней.НайтиСтроки(ОтборИД);
							Если НЕ СтрокиИД.Количество() = 0 Тогда  
								СтрИД = СтрокиИД.Получить(0);
								Если НЕ СтрК.ДатаРождения = Дата(1,1,1) Тогда 
									Если СтрК.ДатаРождения = ДатаРождения Тогда
									    ЗаписатьВПереченьГлобальнаяПроверка(Клиент, СтрП.ВидПеречня, СтрИД.ДатаПеречня, СтрИД.Ид, СтрИД.ДатаВключенияВПеречень, ДатаПроверки);
										ЕстьСовпадение = Истина;
										Прервать;
									КонецЕсли;	 
								ИначеЕсли НЕ ГодРождения = 0 Тогда 
									Если СтрК.ГодРождения = ГодРождения Тогда
										ЗаписатьВПереченьГлобальнаяПроверка(Клиент, СтрП.ВидПеречня, СтрИД.ДатаПеречня, СтрИД.Ид, СтрИД.ДатаВключенияВПеречень, ДатаПроверки);
										ЕстьСовпадение = Истина;  
										Прервать;
									КонецЕсли;			
								КонецЕсли; 
								//Если НЕ ПустаяСтрока(ИНН) Тогда 
								//	Если СтрИД.ИНН = ИНН Тогда
								//	    ЗаписатьВПереченьГлобальнаяПроверка(Клиент, СтрП.ВидПеречня, СтрИД.ДатаПеречня, СтрИД.Ид, СтрИД.ДатаВключенияВПеречень, ДатаПроверки);
								//		ЕстьСовпадение = Истина;
								//		Прервать;
								//	КонецЕсли;			
								//КонецЕсли;
							КонецЕсли;	
						КонецЦикла;	
					КонецЕсли;  
		            Если ЕстьСовпадение Тогда
						Продолжить;
					КонецЕсли; 
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(ИНН) Тогда 
					Отбор = Новый Структура; 
					Отбор.Вставить("ВидПеречня", Стр.ВидПеречня);
				    Отбор.Вставить("ДатаПеречня", Стр.ДатаПеречня);
					Отбор.Вставить("ИНН", ИНН); 
					Если СтрП.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ЦБ Тогда
					    Отбор.Вставить("ДатаРождения", ДатаРождения); 
					КонецЕсли;	
					СтрокиК = ТаблицаПеречней.НайтиСтроки(Отбор); 
					Если НЕ СтрокиК.Количество() = 0 Тогда
						СтрИД = СтрокиК.Получить(0);  
						ЗаписатьВПереченьГлобальнаяПроверка(Клиент, СтрП.ВидПеречня, СтрИД.ДатаПеречня, СтрИД.Ид, СтрИД.ДатаВключенияВПеречень, ДатаПроверки);
						ЕстьСовпадение = Истина;
					КонецЕсли;	
				КонецЕсли; 
				Если ЕстьСовпадение Тогда
					Продолжить;
				КонецЕсли; 

				
				ОтборДок = Новый Структура;
				ОтборДок.Вставить("Клиент", Выборка.Клиент); 
				СтрокиДок = ТаблицаДокументов.НайтиСтроки(ОтборДок);
				Для каждого СтрДок Из СтрокиДок Цикл 
					ОтборК = Новый Структура;  
					ОтборК.Вставить("ВидПеречня", Стр.ВидПеречня);
				    ОтборК.Вставить("ДатаПеречня", Стр.ДатаПеречня);
					ОтборК.Вставить("ДокументНомер", СокрЛП(СтрДок.ДокументНомер)); 
					ОтборК.Вставить("ДокументСерия", СокрЛП(СтрДок.ДокументСерия));
					СтрокиК = ТаблицаПеречнейДокументы.НайтиСтроки(ОтборК); 
					Если НЕ СтрокиК.Количество() = 0 Тогда 
						Для каждого СтрК Из СтрокиК Цикл  
							ОтборИД = Новый Структура; 
							ОтборИД.Вставить("ИД", СтрК.ИД);
							СтрокиИД = ТаблицаПеречней.НайтиСтроки(ОтборИД);
							Если НЕ СтрокиИД.Количество() = 0 Тогда    
								СтрИД = СтрокиИД.Получить(0); 
								ЗаписатьВПереченьГлобальнаяПроверка(Клиент, СтрП.ВидПеречня, СтрИД.ДатаПеречня, СтрИД.Ид, СтрИД.ДатаВключенияВПеречень, ДатаПроверки);
								ЕстьСовпадение = Истина; 	
							КонецЕсли;	
						КонецЦикла;	
					КонецЕсли;  
	                Если ЕстьСовпадение Тогда
						Прервать;
					КонецЕсли; 
	  			КонецЦикла;		
			КонецЦикла;
		КонецЦикла;	
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьВПеречень(Клиент, ВидПеречня, ДатаПеречня, Ид, ДатаВключенияВПеречень, Статус) 
	
	Рег = РегистрыСведений.ЛБ_КлиентыВПеречнях;
	НаборЗаписей = Рег.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Залогодатель.Установить(Клиент);
	НаборЗаписей.Отбор.ВидПеречня.Установить(ВидПеречня); 
	НаборЗаписей.Отбор.ДатаПеречня.Установить(ДатаПеречня);
	НаборЗаписей.Отбор.ВидПроверки.Установить(Перечисления.ЛБ_ВидыПроверкиПеречней.ПроверкаПоПеречню);   
	
	НоваяЗапись = НаборЗаписей.Добавить();   
	НоваяЗапись.Период = ТекущаяДата();
	НоваяЗапись.ВидПроверки = Перечисления.ЛБ_ВидыПроверкиПеречней.ПроверкаПоПеречню;
	НоваяЗапись.ВидПеречня = ВидПеречня; 
    НоваяЗапись.ДатаПеречня = ДатаПеречня;
	НоваяЗапись.Залогодатель = Клиент;                                                    
	НоваяЗапись.ИД = ИД;
	НоваяЗапись.ДатаВключенияВПеречень = ДатаВключенияВПеречень;
	НоваяЗапись.СтатусКлиентаВПеречне = Статус;
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
    Если НЕ ТекПользователь.ЭтоЛомбард Тогда
   		Ответственный = ТекПользователь;
	Иначе
		Ответственный = ПараметрыСеанса.ТекущийСотрудник;
	КонецЕсли;	
	НоваяЗапись.Ответственный = Ответственный;
	
	НаборЗаписей.Записать(Истина);

КонецПроцедуры

Процедура ЗаписатьВПереченьГлобальнаяПроверка(Клиент, ВидПеречня, ДатаПеречня, Ид, ДатаВключенияВПеречень, ДатаПроверки) 
	
	Рег = РегистрыСведений.ЛБ_КлиентыВПеречнях;
	НаборЗаписей = Рег.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Залогодатель.Установить(Клиент); 
	НаборЗаписей.Отбор.ВидПеречня.Установить(ВидПеречня); 
	НаборЗаписей.Отбор.ДатаПеречня.Установить(ДатаПеречня);
	НаборЗаписей.Отбор.ВидПроверки.Установить(Перечисления.ЛБ_ВидыПроверкиПеречней.ГлобальнаяПроверка);
	
	НоваяЗапись = НаборЗаписей.Добавить();   
	НоваяЗапись.Период = ДатаПроверки;   
	НоваяЗапись.ВидПроверки = Перечисления.ЛБ_ВидыПроверкиПеречней.ГлобальнаяПроверка;
	НоваяЗапись.ВидПеречня = ВидПеречня; 
    НоваяЗапись.ДатаПеречня = ДатаПеречня;
	НоваяЗапись.Залогодатель = Клиент;  
	НоваяЗапись.ИД = ИД;
	НоваяЗапись.ДатаВключенияВПеречень = ДатаВключенияВПеречень;
	НоваяЗапись.СтатусКлиентаВПеречне = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен; 
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	Если НЕ ТекПользователь.ЭтоЛомбард Тогда
   		Ответственный = ТекПользователь;
	Иначе
		Ответственный = ПараметрыСеанса.ТекущийСотрудник;
	КонецЕсли;	
	НоваяЗапись.Ответственный = Ответственный;
	
	НаборЗаписей.Записать(Истина);

КонецПроцедуры	 

Функция ПолучитьМакетВорд() Экспорт
	Возврат ПолучитьОбщийМакет("ЛБ_МакетАнкета");
КонецФункции	

Функция ПолучитьТекущийСтатусКлиента(Дата, Клиент) Экспорт
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", Дата); 
	Запрос.УстановитьПараметр("Залогодатель", Клиент);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СтатусыЗалогодателейСрезПоследних.Статус КАК Статус
	               |ИЗ
	               |	РегистрСведений.ЛБ_СтатусыЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_СтатусыЗалогодателейСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_СтатусыЗалогодателейСрезПоследних.Период УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		СтатусЗалогодателяНач =  Выборка.Статус; 
	Иначе
		СтатусЗалогодателяНач = Справочники.ЛБ_СтатусыЗалогодателей.ПустаяСсылка();
	КонецЕсли;               
	Возврат ПроверкаСтатусаЗалогодателя(Дата, Клиент, СтатусЗалогодателяНач);	
	//Возврат СтатусЗалогодателяНач;
КонецФункции	

Функция ПолучитьСтатусКлиентаПоСобытию(Событие) Экспорт  
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Событие", Событие);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПравилаПрисвоенияСтатусовКлиента.Статус КАК Статус
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПравилаПрисвоенияСтатусовКлиента КАК ЛБ_ПравилаПрисвоенияСтатусовКлиента
	               |ГДЕ
	               |	ЛБ_ПравилаПрисвоенияСтатусовКлиента.Событие = &Событие";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат  Выборка.Статус;
	КонецЕсли;   
	Возврат Справочники.ЛБ_СтатусыЗалогодателей.ПустаяСсылка();
КонецФункции

Функция ПроверитьИзмененияСтатусаКлиента(Дата, Залогодатель, СтатусКлиента) Экспорт
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СтатусыЗалогодателейСрезПоследних.Статус КАК Статус
	               |ИЗ
	               |	РегистрСведений.ЛБ_СтатусыЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_СтатусыЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Если Выборка.Статус = СтатусКлиента Тогда 
			Возврат Ложь;
		КонецЕсли;	
	КонецЕсли;
	Возврат Истина;
КонецФункции	

Функция РассчитатьДатуЛьготногоПериода(ДатаДоговора, Сдвиг)
 
 // Отсчет месяца ведем с даты, следующей за датой окончания договора (согласно ГК РФ)
 ДатаСледующаяЗаДатойОкончанияДоговора = НачалоДня(ДатаДоговора) + 24*60*60;
 
 ДатаСледующаяЗаДатойОкончанияДоговораСоСдвигом = ДобавитьМесяц(ДатаСледующаяЗаДатойОкончанияДоговора, Сдвиг);
 
 МассивДат = Новый Массив();
 МассивДат.Добавить(ДатаСледующаяЗаДатойОкончанияДоговораСоСдвигом);
 
 ПроизводственныйКалендарь = КалендарныеГрафики.ОсновнойПроизводственныйКалендарь();
 РабочиеДаты = КалендарныеГрафики.ДатыБлижайшихРабочихДней(ПроизводственныйКалендарь, МассивДат, , Истина);
 ДатаОкончанияЛьготногоПериода = РабочиеДаты.Получить(ДатаСледующаяЗаДатойОкончанияДоговораСоСдвигом);
 
 Возврат ДатаОкончанияЛьготногоПериода;
 
КонецФункции  

Функция ИсключитьДатаВыкупаПразничныйДень(ДатаВыкупа) Экспорт
	Пока истина Цикл      
		ПроизводственныйКалендарь = КалендарныеГрафики.ОсновнойПроизводственныйКалендарь();
	
		Если НЕ ЗначениеЗаполнено(ПроизводственныйКалендарь) Тогда
			Возврат ДатаВыкупа;
		КонецЕсли;
		
		Отбор = Новый Структура;  
		Отбор.Вставить("Год",                       Год(ДатаВыкупа));
		Отбор.Вставить("Дата",                      ДатаВыкупа);
		Отбор.Вставить("ПроизводственныйКалендарь", ПроизводственныйКалендарь);

	    СведенияНаДень = РегистрыСведений.ДанныеПроизводственногоКалендаря.Получить(Отбор);
		Если СведенияНаДень.ВидДня=Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник Тогда 
			ДатаВыкупа = НачалоДня(ДатаВыкупа) + 24*60*60;
		Иначе
			Прервать;
        КонецЕсли; 
	Конеццикла;
		
	Возврат ДатаВыкупа;	
КонецФункции	

Функция ПолучитьЛьготныйСрокЗалоговогоБилета(ДатаВыкупа) Экспорт 
	ДатаВыкупаЛьготная = ДатаВыкупа + 24*60*60;
	Число = День(ДатаВыкупаЛьготная);
	Месяц = Месяц(ДатаВыкупаЛьготная);
	Год = Год(ДатаВыкупаЛьготная);
	
	Если Месяц = 12 Тогда 
		Месяц = 1; 
		Год = Год + 1;
	Иначе  
		Месяц = Месяц+1;
	КонецЕсли;
	Попытка
	    ДатаВыкупаЛьготная = Дата(Год, Месяц, Число);
	Исключение     
		ДатаВыкупаЛьготная = КонецМесяца(Дата(Год, Месяц, 1));      		
	КонецПопытки;
	
	Возврат  ДатаВыкупаЛьготная;     	
КонецФункции	

Функция ПолучитьДатуНачалаРасчетаПроцентов(Дата, Организация) Экспорт 
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст = "ВЫБРАТЬ
	               |	УсловияПредоставленияКредита.НачислятьПроцентыЗаДеньЗалога КАК НачислятьПроцентыЗаДеньЗалога
	               |ИЗ
	               |	РегистрСведений.ЛБ_НастройкиЗаймаВерхнегоУровня.СрезПоследних(&Дата, Организация = &Организация) КАК УсловияПредоставленияКредита"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Если Выборка.НачислятьПроцентыЗаДеньЗалога Тогда
			Возврат НачалоДня(Дата);
		Иначе	
			Возврат НачалоДня(Дата) + 86400;
		КонецЕсли;	
	КонецЕсли;	
	Возврат НачалоДня(Дата) + 86400;
КонецФункции	

Функция ПроверитьСтатусПочетный(ДатаРождения, Пол) Экспорт
	Если ДатаРождения = Дата(1,1,1) Тогда 
		Возврат ложь;
	КонецЕсли;	 
	Если НЕ ЗначениеЗаполнено(Пол) Тогда
		Возврат ложь;
	КонецЕсли; 
	
	ВозрастЗалогодателя = ЛБ_ОбщийМодуль.ВычислитьВозраст(ДатаРождения);
		
	Если Пол = Перечисления.ПолФизическогоЛица.Женский Тогда 
		Если ВозрастЗалогодателя  >= 55 Тогда  
			Возврат  Истина;
		КонецЕсли;	
	ИначеЕсли Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
		Если ВозрастЗалогодателя  >= 60 Тогда  
			Возврат Истина;
		КонецЕсли;	
	КонецЕсли;	 
	
	Возврат ложь;
КонецФункции	

Функция ПолучитьСхемыКредитованияДляРасчета(Дата)
	СписокСК = Новый СписокЗначений;
	
	ЗапросСК = Новый Запрос; 
	ЗапросСК.УстановитьПараметр("Дата", Дата);
	ЗапросСК.Текст = "ВЫБРАТЬ
	                 |	ЛБ_УчастиеВРасчетеСтатусовПоСистемеЛояльностиСрезПоследних.СхемаКредитования КАК СхемаКредитования,
	                 |	ЛБ_УчастиеВРасчетеСтатусовПоСистемеЛояльностиСрезПоследних.Участвует КАК Участвует
	                 |ИЗ
	                 |	РегистрСведений.ЛБ_УчастиеВРасчетеСтатусовПоСистемеЛояльности.СрезПоследних(&Дата, ) КАК ЛБ_УчастиеВРасчетеСтатусовПоСистемеЛояльностиСрезПоследних";  
	ВыборкаСК = ЗапросСК.Выполнить().Выбрать();
	Пока ВыборкаСК.Следующий() цикл  
		Если НЕ ВыборкаСК.Участвует Тогда
			Продолжить;
		КонецЕсли;	
		СписокСК.Добавить(ВыборкаСК.СхемаКредитования);	
	Конеццикла;	
	Возврат СписокСК;
КонецФункции   

Функция ПроверитьСхемуКредитованияУчастиеВРасчетеСтатусовПоСистемеЛояльности(Дата, СК) Экспорт
	СписокСК = ПолучитьСхемыКредитованияДляРасчета(Дата);
	Если НЕ СписокСК.НайтиПоЗначению(СК) = неопределено Тогда
		Возврат Истина;
	КонецЕсли;	
	Возврат Ложь;
КонецФункции


Функция ПроверкаСтатусаЗалогодателя(Дата, Залогодатель, СтатусЗалогодателяСтарый, ЭтоВыкуп = ложь, ЭтоИзъятие = ложь) Экспорт
	ТаблицаЗ = Новый ТаблицаЗначений;
	ТаблицаЗ.Колонки.Добавить("КоличествоЗалогов");  
	ТаблицаЗ.Колонки.Добавить("КоличествоВыкупов");
	
	ЕстьЗБ = Ложь;
	ДатаАрхив = Дата;
	Запрос = Новый Запрос;  
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЛБ_АрхивныеДанныеКлиентовДляОпределенияСтатуса.Период КАК Дата
	               |ИЗ
	               |	РегистрСведений.ЛБ_АрхивныеДанныеКлиентовДляОпределенияСтатуса КАК ЛБ_АрхивныеДанныеКлиентовДляОпределенияСтатуса
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДатаАрхив = Выборка.Дата;
	КонецЕсли;	
	СписокСКАрхив = ПолучитьСхемыКредитованияДляРасчета(ДатаАрхив);
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель); 
    Запрос.Текст = "ВЫБРАТЬ
                   |	ЛБ_АрхивныеДанныеКлиентовДляОпределенияСтатуса.СхемаКредитования КАК СхемаКредитования,
                   |	ЛБ_АрхивныеДанныеКлиентовДляОпределенияСтатуса.КоличествоВыкуплено КАК КоличествоВыкуплено,
                   |	ЛБ_АрхивныеДанныеКлиентовДляОпределенияСтатуса.КоличествоОтгружено КАК КоличествоОтгружено,
                   |	ЛБ_АрхивныеДанныеКлиентовДляОпределенияСтатуса.КоличествоИзъято КАК КоличествоИзъято,
                   |	ЛБ_АрхивныеДанныеКлиентовДляОпределенияСтатуса.КоличествоОХ КАК КоличествоОХ
                   |ИЗ
                   |	РегистрСведений.ЛБ_АрхивныеДанныеКлиентовДляОпределенияСтатуса КАК ЛБ_АрхивныеДанныеКлиентовДляОпределенияСтатуса
                   |ГДЕ
                   |	ЛБ_АрхивныеДанныеКлиентовДляОпределенияСтатуса.Период <= &Дата
                   |	И ЛБ_АрхивныеДанныеКлиентовДляОпределенияСтатуса.Клиент = &Залогодатель";
    Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Количество() = 0 Тогда  
		ЕстьЗБ = Истина;
		Пока Выборка.Следующий() Цикл   
			Если НЕ СписокСКАрхив.НайтиПоЗначению(Выборка.СхемаКредитования) = неопределено Тогда  
				НоваяСтр = ТаблицаЗ.Добавить();
				НоваяСтр.КоличествоЗалогов = Выборка.КоличествоВыкуплено + Выборка.КоличествоОХ + Выборка.КоличествоОтгружено + Выборка.КоличествоИзъято;   
				НоваяСтр.КоличествоВыкупов = Выборка.КоличествоВыкуплено + Выборка.КоличествоОХ; 
			КонецЕсли;	
		КонецЦикла;	 
	КонецЕсли;		
	
	СписокСК = ПолучитьСхемыКредитованияДляРасчета(Дата);
	//+МАН 19.06.25 Изменил запрос. Добавил проверку отмененных операций.
	   //Запрос.Текст = "ВЫБРАТЬ
	   //            |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СхемаКредитования КАК СхемаКредитования,
	   //            |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	   //            |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета
	   //            |ИЗ
	   //            |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних";
   	Запрос.Текст = "ВЫБРАТЬ
   	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СхемаКредитования КАК СхемаКредитования,
   	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
   	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета
   	               |ИЗ
   	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(
   	               |			&Дата,
   	               |			Залогодатель = &Залогодатель
   	               |				И НЕ Регистратор В
   	               |						(ВЫБРАТЬ
   	               |							ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
   	               |						ИЗ
   	               |							РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&Дата, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
   	               |						ГДЕ
   	               |							ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (Регистратор))
   	               |				И СтатусЗалоговогоБилета <> ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыЗалоговыхБилетов.ОтказОтОформления)) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних";
	//-МАН
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Количество() = 0 Тогда
		ЕстьЗБ = ?(ЕстьЗБ, ЕстьЗБ, Истина);
		Пока Выборка.Следующий() Цикл   
			Если СписокСК.НайтиПоЗначению(Выборка.СхемаКредитования) = неопределено Тогда
				Продолжить;
			КонецЕсли;	
			Если НЕ (Выборка.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт) И 
				 НЕ (Выборка.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтвественноеХранение) И
				 НЕ (Выборка.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят) И 
				 НЕ (Выборка.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Отгружен) Тогда  
				Продолжить;
			КонецЕсли;	
			НоваяСтр = ТаблицаЗ.Добавить(); 
			НоваяСтр.КоличествоЗалогов = 1;   
			Если (Выборка.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт) ИЛИ (Выборка.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтвественноеХранение) Тогда 
			    НоваяСтр.КоличествоВыкупов = 1; 
			Иначе  
				НоваяСтр.КоличествоВыкупов = 0;
			конецЕсли;	
		КонецЦикла;	    
	КонецЕсли;
		
	Если НЕ ТаблицаЗ.Количество() = 0 тогда  
		//ТаблицаЗ.Свернуть("КоличествоВыкупов, КоличествоЗалогов");

		КоличествоВыкупов = 0; 
		КоличествоЗалогов = 0;
		Для сч = 0 По ТаблицаЗ.Количество()-1 Цикл
		    Выборка = ТаблицаЗ.Получить(сч); 
			КоличествоВыкупов = КоличествоВыкупов + Выборка.КоличествоВыкупов;
			КоличествоЗалогов = КоличествоЗалогов + Выборка.КоличествоЗалогов;  
		КонецЦикла;
		Если ЭтоВыкуп Тогда      
			КоличествоЗалогов = КоличествоЗалогов + 1;
			КоличествоВыкупов = КоличествоВыкупов + 1;  
		ИначеЕсли ЭтоИзъятие Тогда
			КоличествоЗалогов = КоличествоЗалогов + 1;	
		КонецЕсли;
		// ++ Савранин, 16.08.2024
		Если КоличествоЗалогов > 0 Тогда
			Коэфф = КоличествоВыкупов/КоличествоЗалогов*100;
		Иначе
			Коэфф = 0;
		КонецЕсли;
		// ++ Савранин, 16.08.2024	
		Если КоличествоЗалогов >= 3 Тогда			
			Если Коэфф <= 30 Тогда
				Возврат Справочники.ЛБ_СтатусыЗалогодателей.Невыкупающий;
			ИначеЕсли Коэфф >= 70 Тогда     
				СтатусЗ =  Справочники.ЛБ_СтатусыЗалогодателей.Добросовестный;   
				Если КоличествоЗалогов >= 5 И Коэфф >= 90 Тогда	
				    СтатусЗ = Справочники.ЛБ_СтатусыЗалогодателей.Постоянный;
				КонецЕсли;
				Возврат СтатусЗ;
			Иначе    
				Возврат Справочники.ЛБ_СтатусыЗалогодателей.Неопределенный;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	Если НЕ ЕстьЗБ тогда
		//+МАН 19.06.25 Добавил условие.
		//Было: Если ЗначениеЗаполнено(СтатусЗалогодателяСтарый) Тогда
		Если СтатусЗалогодателяСтарый = Справочники.ЛБ_СтатусыЗалогодателей.Новый Тогда
			Возврат Справочники.ЛБ_СтатусыЗалогодателей.Сверхновый;
		ИначеЕсли ЗначениеЗаполнено(СтатусЗалогодателяСтарый) Тогда
		//-МАН
		    Возврат СтатусЗалогодателяСтарый;
		Иначе
			Возврат Справочники.ЛБ_СтатусыЗалогодателей.Сверхновый;
		КонецЕсли;	
	Иначе
		Возврат Справочники.ЛБ_СтатусыЗалогодателей.Новый;
	КонецЕсли;	
КонецФункции	

Функция ПолучитьМинимальнуюПроцентнуюСтавкуПоСтатусамКлиента(ТаблицаДляПроверки, СхемаКредитования, СписокСтатусов)
	МинПроцентнаяСтавка = 0;
	Для каждого Эл Из СписокСтатусов Цикл
		ОтборП = Новый структура;
		ОтборП.Вставить("СхемаКредитования", СхемаКредитования); 
		ОтборП.Вставить("СтатусЗалогодателя", Эл.Значение); 
		
		СтрокиП = ТаблицаДляПроверки.НайтиСтроки(ОтборП);
		Если НЕ СтрокиП.Количество() = 0 Тогда
			Если МинПроцентнаяСтавка = 0 Тогда
			    МинПроцентнаяСтавка = СтрокиП.Получить(0).ПроцентнаяСтавка;
			Иначе 
				ПС = СтрокиП.Получить(0).ПроцентнаяСтавка; 
				МинПроцентнаяСтавка = ?(МинПроцентнаяСтавка <= ПС, МинПроцентнаяСтавка, ПС);
			КонецЕсли;	
		КонецЕсли;                
	КонецЦикла;	 
	Возврат МинПроцентнаяСтавка;
КонецФункции

Функция ПолучитьСоставнойСтатусКлиента(Дата, СтатусОсновной, СтатусДополнительный) Экспорт
	ЗапросС = Новый Запрос;
	ЗапросС.УстановитьПараметр("Дата", Дата);
	ЗапросС.УстановитьПараметр("СтатусОсновной", СтатусОсновной);
	ЗапросС.УстановитьПараметр("СтатусДополнительный", СтатусДополнительный);
	ЗапросС.Текст = "ВЫБРАТЬ
	          |	ЛБ_СоставныеСтатусыКлиентаСрезПоследних.СтатусКлиентаСоставной КАК СтатусСоставной
	          |ИЗ
	          |	РегистрСведений.ЛБ_СоставныеСтатусыКлиента.СрезПоследних(
	          |			&Дата,
	          |			СтатусКлиентаОсновной = &СтатусОсновной
	          |				И СтатусКлиентаДополнительный = &СтатусДополнительный
	          |				И НеАктуален = ЛОЖЬ) КАК ЛБ_СоставныеСтатусыКлиентаСрезПоследних
	          |
	          |УПОРЯДОЧИТЬ ПО
	          |	ЛБ_СоставныеСтатусыКлиентаСрезПоследних.Период УБЫВ";
	ВыборкаС = ЗапросС.Выполнить().Выбрать();
	Если ВыборкаС.Следующий() Тогда
		Возврат ВыборкаС.СтатусСоставной;
	КонецЕсли;
	Возврат неопределено;
КонецФункции	

//+МАН 27.12.24 Добавил параметр Залогодатель для проверки на наличие действующих условий по процентным ставкам.. Заявка 2792.
Функция ПолучитьДоступныеПроцентныеСхемыАкции(Дата, Ломбард, СтатусПоСистемеЛояльности, СуммаЗайма, ОтказОтВыкупа, ПричинаПримененияПроцентнойСхемы, СписокДопСтатусов, СписокЛьготныхСтатусов, Промокод, Предъявитель, Залогодатель = Неопределено)Экспорт		
	МассивСтатусовКлиента = Новый Массив;
	МассивСтатусовКлиента.Добавить(Справочники.ЛБ_СтатусыЗалогодателей.ПустаяСсылка());
	Если ЗначениеЗаполнено(СтатусПоСистемеЛояльности) Тогда
		МассивСтатусовКлиента.Добавить(СтатусПоСистемеЛояльности);
		Если ЗначениеЗаполнено(СтатусПоСистемеЛояльности.Родитель) Тогда 
			МассивСтатусовКлиента.Добавить(СтатусПоСистемеЛояльности.Родитель);
		КонецЕсли;	
	КонецЕсли;	

	//+МАН 27.12.24 Проверить действующие условия по ставкам для ВИПа. Заявка 2792.
	ЕстьВИПУсловияПоСтавкам = ПроверитьВИПУсловияПОСтавкам(Дата, Залогодатель);
	//-МАН

	Для каждого Эл Из СписокДопСтатусов Цикл 
		//+МАН 27.12.24 Добавляем или нет статус ВИП. Заявка 2792. Было без условия
		Если Эл.Значение = Справочники.ЛБ_СтатусыЗалогодателей.VIP И ЕстьВИПУсловияПоСтавкам Тогда
			МассивСтатусовКлиента.Добавить(Эл.Значение);
			Если ЗначениеЗаполнено(Эл.Значение.Родитель) Тогда 
				МассивСтатусовКлиента.Добавить(Эл.Значение.Родитель);
			КонецЕсли;	 
			СоставнойСтатус = ПолучитьСоставнойСтатусКлиента(Дата, СтатусПоСистемеЛояльности, Эл.Значение);
			Если НЕ СоставнойСтатус = неопределено Тогда
				МассивСтатусовКлиента.Добавить(СоставнойСтатус);
			КонецЕсли;	
		ИначеЕсли Эл.Значение <> Справочники.ЛБ_СтатусыЗалогодателей.VIP Тогда
			МассивСтатусовКлиента.Добавить(Эл.Значение);
			
			Если ЗначениеЗаполнено(Эл.Значение.Родитель) Тогда 
				МассивСтатусовКлиента.Добавить(Эл.Значение.Родитель);
			КонецЕсли;	 
			
			СоставнойСтатус = ПолучитьСоставнойСтатусКлиента(Дата, СтатусПоСистемеЛояльности, Эл.Значение);
			
			Если НЕ СоставнойСтатус = неопределено Тогда
				МассивСтатусовКлиента.Добавить(СоставнойСтатус);
			КонецЕсли;
		КонецЕсли;
		//-МАН
	Конеццикла;	
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", Дата); 
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПрейскурантПроцентныхСтавок.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПрейскурантПроцентныхСтавок КАК ЛБ_ПрейскурантПроцентныхСтавок
	               |ГДЕ
	               |	ЛБ_ПрейскурантПроцентныхСтавок.Ломбард = &Ломбард
	               |	И ЛБ_ПрейскурантПроцентныхСтавок.ДатаНачалаДействия <= &Дата
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ПрейскурантПроцентныхСтавок.Период УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
        Запрос.УстановитьПараметр("Регистратор", Выборка.Регистратор);
		Запрос.УстановитьПараметр("ПричинаПрименения", ПричинаПримененияПроцентнойСхемы);
		Запрос.УстановитьПараметр("СуммаЗайма", СуммаЗайма);
		Запрос.УстановитьПараметр("Статусы", МассивСтатусовКлиента); 
		Запрос.УстановитьПараметр("ПустаяАкция", Справочники.ЛБ_Акции.ПустаяСсылка());
		Запрос.УстановитьПараметр("ОтказОтВыкупа", ОтказОтВыкупа);
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.СхемаКредитования КАК СхемаКредитования,
		               |	&ПустаяАкция КАК Акция
		               |ИЗ
		               |	РегистрСведений.ЛБ_ПрейскурантПроцентныхСтавок.СрезПоследних(
		               |			&Дата,
		               |			ДатаНачалаДействия <= &Дата
		               |				И Ломбард = &Ломбард
		               |				И ПричинаПрименения = &ПричинаПрименения
		               |				И СтатусЗалогодателя В (&Статусы)
		               |				И ДиапазонСуммЗайма.СуммаОт <= &СуммаЗайма
		               |				И ВЫБОР
		               |					КОГДА ДиапазонСуммЗайма.СуммаДо = 0
		               |						ТОГДА ИСТИНА
		               |					ИНАЧЕ ДиапазонСуммЗайма.СуммаДо >= &СуммаЗайма
		               |				КОНЕЦ) КАК ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних
		               |ГДЕ
		               |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.Регистратор = &Регистратор
		               |	И ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.СхемаКредитования.ОтказОтВыкупа = &ОтказОтВыкупа";	
		ТаблицаСхемКредитованияАкций = Запрос.Выполнить().Выгрузить(); 
					
		МассивСК = Новый Массив;  
		МассивСК.Добавить(Справочники.ЛБ_СхемыКредитования.ПустаяСсылка());
		Для каждого Стр Из ТаблицаСхемКредитованияАкций Цикл 
			Если Стр.СхемаКредитования.НеПрименятьАкции тогда
				Продолжить;
			КонецЕсли;	
			Если МассивСК.Найти(Стр.СхемаКредитования) = неопределено Тогда
		       МассивСК.Добавить(Стр.СхемаКредитования);
			КонецЕсли;   
		КонецЦикла;	   
		ТаблицаАкций = ЛБ_ОбщийМодуль.ВыбратьДействующиеАкции(Дата, Ломбард, ПричинаПримененияПроцентнойСхемы, МассивСтатусовКлиента, СуммаЗайма, СписокЛьготныхСтатусов, МассивСК, Промокод, Предъявитель);
	
		Для каждого Выборка из ТаблицаАкций Цикл 
			Если НЕ ЗначениеЗаполнено(Выборка.СхемаКредитования) Тогда 
				Для каждого СК Из МассивСК Цикл
					Если НЕ ЗначениеЗаполнено(СК) Тогда
						Продолжить;
					КонецЕсли;	
					НоваяСтр = ТаблицаСхемКредитованияАкций.Добавить();
					НоваяСтр.СхемаКредитования = СК; 
					НоваяСтр.Акция = Выборка.Акция;   	
				КонецЦикла;	
			Иначе
				НоваяСтр = ТаблицаСхемКредитованияАкций.Добавить();
				НоваяСтр.СхемаКредитования = Выборка.СхемаКредитования; 
				НоваяСтр.Акция = Выборка.Акция;   	
			КонецЕсли;	
		КонецЦикла;	
	
		ТаблицаСхемКредитованияАкций.Свернуть("СхемаКредитования, Акция");
		ТаблицаСхемКредитованияАкций.Колонки.Добавить("Приоритет");
		ТаблицаСхемКредитованияАкций.ЗаполнитьЗначения(0, "Приоритет");
		
		 
		Запрос.Текст = "ВЫБРАТЬ
		                |	ЛБ_ПриоритетыВыбораУсловийЗайма.СхемаКредитования КАК СхемаКредитования,
		                |	ЛБ_ПриоритетыВыбораУсловийЗайма.Акция КАК Акция,
		                |	ЛБ_ПриоритетыВыбораУсловийЗайма.Приоритет КАК Приоритет
		                |ИЗ
		                |	РегистрСведений.ЛБ_ПриоритетыВыбораУсловийЗайма КАК ЛБ_ПриоритетыВыбораУсловийЗайма
		                |ГДЕ
		                |	ЛБ_ПриоритетыВыбораУсловийЗайма.ОтказОтВыкупа = &ОтказОтВыкупа";
		ТаблицаП = Запрос.Выполнить().Выгрузить();
		
		Для каждого стр из ТаблицаСхемКредитованияАкций Цикл 
			Отбор = Новый Структура;
			Отбор.Вставить("СхемаКредитования", стр.СхемаКредитования);
			Отбор.Вставить("Акция", стр.Акция);
			
			Строки = ТаблицаП.НайтиСтроки(Отбор);
			Если НЕ строки.Количество() = 0 Тогда
				Стр.Приоритет = Строки.Получить(0).Приоритет;
			КонецЕсли;	
		КонецЦикла;	
				
		Возврат ТаблицаСхемКредитованияАкций;
	КонецЕсли;
	Возврат неопределено;
КонецФункции	

Функция ПолучитьНачисленныеПроцентыПоДоговору(ДокументОбъект = неопределено, ЗалоговыйБилет) Экспорт  
	Если ДокументОбъект = неопределено Тогда
		ДатаДок = ТекущаяДата();
	Иначе	
		Если ЗначениеЗаполнено(ДокументОбъект.Ссылка) Тогда	  
			МоментДоДокумента = Новый Граница(Новый МоментВремени(ДокументОбъект.Дата, ДокументОбъект.Ссылка), ВидГраницы.Исключая);
			ДатаДок = МоментДоДокумента; 
		Иначе	
		    ДатаДок = ДокументОбъект.Дата;
		КонецЕсли;
	КонецЕсли;	

	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", ДатаДок); 
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ЛБ_РасчетыСКлиентамиОбороты.СуммаПриход) КАК СуммаПроценты
	               |ИЗ
	               |	РегистрНакопления.ЛБ_РасчетыСКлиентами.Обороты(
	               |			,
	               |			&Дата,
	               |			,
	               |			ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыРасчетов.ПоПроцентам)
	               |				И ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_РасчетыСКлиентамиОбороты"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат ?(Выборка.СуммаПроценты  = NULL, 0, Выборка.СуммаПроценты);
	КонецЕсли;
	Возврат 0;
КонецФункции	  

Функция ПолучитьПредельныеЗначенияПроцентов(Дата, Организация) Экспорт
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", Дата); 
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПредельныеЗначенияПроцентовСрезПоследних.ПредельнаяВеличинаПроцентов КАК ПланкаПроцентов,
	               |	ЛБ_ПредельныеЗначенияПроцентовСрезПоследних.ПредельнаяСтавкаКредитованияГод КАК ПСКГод
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПредельныеЗначенияПроцентов.СрезПоследних(&Дата, Организация = &Организация) КАК ЛБ_ПредельныеЗначенияПроцентовСрезПоследних"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		СтруктураВ = Новый Структура;
		СтруктураВ.Вставить("ПланкаПроцентов", Выборка.ПланкаПроцентов);
		СтруктураВ.Вставить("ПСКГод", Выборка.ПСКГод);
		Возврат СтруктураВ;
	КонецЕсли;
	Возврат неопределено;
КонецФункции	

Процедура ЗаполнитьДополнительныеРеквизитыПриказа(ДокументОбъект) Экспорт 
	ЗапросБазовыеЦены = Новый Запрос;
	ЗапросБазовыеЦены.Текст = "ВЫБРАТЬ
	                          |	ЛБ_БазовыеЦеныНаДрагоценныеМеталлы.Период КАК Период,
	                          |	ЛБ_БазовыеЦеныНаДрагоценныеМеталлы.Проба КАК Проба,
	                          |	ЛБ_БазовыеЦеныНаДрагоценныеМеталлы.КатегорияОбъектаЗалога КАК Категория
	                          |ИЗ
	                          |	РегистрСведений.ЛБ_БазовыеЦеныНаДрагоценныеМеталлы КАК ЛБ_БазовыеЦеныНаДрагоценныеМеталлы
	                          |
	                          |УПОРЯДОЧИТЬ ПО
	                          |	Период";
	ТаблицаБазовыеЦены = ЗапросБазовыеЦены.Выполнить().Выгрузить();

	ДокументОбъект.ЕстьМеталлы = ?(ДокументОбъект.ЦеныМеталлы.Количество() = 0, ложь, Истина);
	ДокументОбъект.ЕстьВставки = ?(ДокументОбъект.ЦеныВставки.Количество() = 0, ложь, Истина);
	ДокументОбъект.ЕстьПроцентныеСтавки = ?(ДокументОбъект.СтавкиПроцентов.Количество() = 0, ложь, Истина);
	ДокументОбъект.ЕстьАкцииПроцентныеСтавки = ?(ДокументОбъект.УсловияАкцииСтавки.Количество() = 0, ложь, Истина); 
	ДокументОбъект.ЕстьАкцииМеталлы = ?(ДокументОбъект.УсловияАкцииМеталлы.Количество() = 0, ложь, Истина);
	ДокументОбъект.КоличествоЛомбардов = ДокументОбъект.Ломбарды.Количество(); 
	//+МАН 24.01.25 Добавление отметки наличия отклонений металлов. Заявка 2792.
	ДокументОбъект.ЕстьОтклМеталлы = ?(ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенМеталлы.Количество() = 0, Ложь, Истина);
	//-МАН
	Если ДокументОбъект.ЕстьМеталлы Тогда
		Проба = Справочники.ЛБ_Пробы.ПустаяСсылка(); 
		Категория = Справочники.ЛБ_КатегорииОбъектовЗалога.ПустаяСсылка();
		Для каждого СтрБ Из ТаблицаБазовыеЦены Цикл                                
			Если СтрБ.Период > НачалоДня(ДокументОбъект.Дата) Тогда
				Прервать;
			КонецЕсли;
			Проба = СтрБ.Проба;
			Категория = СтрБ.Категория;
		КонецЦикла;	 
		Отбор = Новый Структура;
		Отбор.Вставить("Проба", Проба); 
		Отбор.Вставить("КатегорияОбъектаЗалога", Категория);
	    Строки = ДокументОбъект.ЦеныМеталлы.НайтиСтроки(Отбор);
		МаксЦена = 0;
		Если НЕ Строки.Количество() = 0 Тогда
		    МаксЦена = Строки[0].Цена;
		КонецЕсли;		

		ДокументОбъект.БазоваяЦенаМеталлы = МаксЦена; 
	КонецЕсли;	  
	Если ДокументОбъект.ЕстьПроцентныеСтавки Тогда  
		ТЗМакс = ДокументОбъект.СтавкиПроцентов.Выгрузить(,"Ставка");
		ТЗМакс.Сортировать("Ставка Убыв");
	    ДокументОбъект.МаксимальнаяПроцентнаяСтавка = ТЗМакс[0].Ставка; 
	КонецЕсли;	

КонецПроцедуры	 

Функция ПолучитьСтатусЗалоговогоБилета(Дата, ЗалоговыйБилет) Экспорт 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗалоговыйБилет",  ЗалоговыйБилет); 
	Запрос.УстановитьПараметр("Дата",  Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&Дата, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.Период УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		Возврат Выборка.СтатусЗалоговогоБилета;
	КонецЕсли;	              
	Возврат Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ПустаяСсылка();
КонецФункции	

Функция РассчитатьПоФормуле(Формула, Диаметр, Диаметр1, Диаметр2, Длина, Ширина, Высота, Сторона) Экспорт
	Формула = СтрЗаменить(Формула, "[Диаметр]", Строка(Диаметр)); 
	Формула = СтрЗаменить(Формула, "[Диаметр1]", Строка(Диаметр1));
	Формула = СтрЗаменить(Формула, "[Диаметр2]", Строка(Диаметр2));
	Формула = СтрЗаменить(Формула, "[Длина]", Строка(Длина));
	Формула = СтрЗаменить(Формула, "[Ширина]", Строка(Ширина));	
	Формула = СтрЗаменить(Формула, "[Высота]", Строка(Высота));
	Формула = СтрЗаменить(Формула, "[Сторона]", Строка(Сторона));
	Формула = СтрЗаменить(Формула, ",", ".");
	
	Попытка
	    Возврат Вычислить(Формула); 
	Исключение
		Возврат 0;
	КонецПопытки;	
КонецФункции

//+Мельников 08.08.24 Добавлен параметр "ТолькоДоступныеВиды" и условие. Заявка 2736
//+Мельников 12.08.24 Добавлен четвертый параметр "ОграниченныйСписокВидовОгранки". Заявка 2740.
Функция ПолучитьСписокВыбораВидовОгранки(ВидВставки, ФормаОгранки, ТолькоДоступныеВиды = Ложь, ОграниченныйСписокВидовОгранки = Ложь)Экспорт
	СписокВыбораВО = Новый СписокЗначений;
    Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("ВидКамня", ВидВставки); 
	Запрос.УстановитьПараметр("ФормаОгранки", ФормаОгранки);
    Запрос.Текст = "ВЫБРАТЬ
                   |	ЛБ_НастройкаДопустимыхВидовОгранки.ВидОгранки КАК ВидОгранки
                   |ИЗ
                   |	РегистрСведений.ЛБ_НастройкаДопустимыхВидовОгранки КАК ЛБ_НастройкаДопустимыхВидовОгранки
                   |ГДЕ
                   |	ЛБ_НастройкаДопустимыхВидовОгранки.ВидКамня = &ВидКамня
                   |	И ЛБ_НастройкаДопустимыхВидовОгранки.ФормаОгранки = &ФормаОгранки"
	//+Мельников 12.08.24 Проверяем на булево ограничения списка видов огранки. Заявка 2740.
				+ Символы.ПС + ?(ОграниченныйСписокВидовОгранки, "И ЛБ_НастройкаДопустимыхВидовОгранки.ОграниченныйСписокВидовОгранки" + Символы.ПС, "")
	//-Мельников
                + "АВТОУПОРЯДОЧИВАНИЕ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	//+Мельников 08.08.24 Добавил условие. Заявка 2736
	// Было: Если ТаблицаЗапроса.Количество() = 0 Тогда
	Если ТаблицаЗапроса.Количество() = 0 И НЕ ТолькоДоступныеВиды Тогда
	//-Мельников
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_ВидыОгранки.Ссылка КАК ВидОгранки
		               |ИЗ
		               |	Справочник.ЛБ_ВидыОгранки КАК ЛБ_ВидыОгранки
		               |ГДЕ
		               |	ЛБ_ВидыОгранки.ПометкаУдаления = ЛОЖЬ
		               |АВТОУПОРЯДОЧИВАНИЕ";  
		ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	Для каждого стр из ТаблицаЗапроса Цикл  
		СписокВыбораВО.Добавить(стр.ВидОгранки);
	Конеццикла;
	Возврат СписокВыбораВО; 
КонецФункции

Функция ПолучитьУсловияОкругленияПроцентов(ЗалоговыйБилет) Экспорт
    Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ЗалоговыйБилет.Дата);
	Запрос.УстановитьПараметр("Организация", ЗалоговыйБилет.Организация);
	Запрос.Текст = "ВЫБРАТЬ
	               |	УсловияПредоставленияКредита.ОкруглятьСуммуПроценты КАК ОкруглятьЦены,
	               |	УсловияПредоставленияКредита.ПорядокОкругленияПроценты КАК ПорядокОкругления,
	               |	УсловияПредоставленияКредита.ОкруглятьВБольшуюСторонуПроценты КАК ОкруглятьВБольшуюСторону,
	               |	УсловияПредоставленияКредита.ВидОкругленияСуммыПроцентов КАК ВидОкругленияСуммыПроцентов
	               |ИЗ
	               |	РегистрСведений.ЛБ_НастройкиЗаймаВерхнегоУровня.СрезПоследних(&Дата, Организация = &Организация) КАК УсловияПредоставленияКредита";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
				
		СтруктураР = Новый Структура;   
		СтруктураР.Вставить("ОкруглятьЦены", Выборка.ОкруглятьЦены);
		СтруктураР.Вставить("ПорядокОкругления", Выборка.ПорядокОкругления); 
		СтруктураР.Вставить("ОкруглятьВБольшуюСторону", Выборка.ОкруглятьВБольшуюСторону);
		СтруктураР.Вставить("ВидОкругленияСуммыПроцентов", Выборка.ВидОкругленияСуммыПроцентов);		
		
		Возврат СтруктураР;
	КонецЕсли;
	
	СтруктураР = Новый Структура;   
	СтруктураР.Вставить("ОкруглятьЦены", ложь); 
	
	Возврат СтруктураР;
КонецФункции	

Функция ПолучитьУсловияПоДоговору(ЗалоговыйБилет) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ЗалоговыйБилет.Дата);
	Запрос.УстановитьПараметр("Организация", ЗалоговыйБилет.Организация);
	Запрос.Текст = "ВЫБРАТЬ
	               |	УсловияПредоставленияКредитаСрезПоследних.НачислятьПроцентыЗаДеньЗалога КАК НачислятьПроцентыЗаДеньЗалога,
	               |	УсловияПредоставленияКредитаСрезПоследних.НеНачислятьПроцентыЗаПоследнийДень КАК НеНачислятьПроцентыЗаПоследнийДень,
	               |	УсловияПредоставленияКредитаСрезПоследних.СчитатьПроцентыДеньВыдачиРавенДеньВыкупа КАК СчитатьПроцентыДеньВыдачиРавенДеньВыкупа
	               |ИЗ
	               |	РегистрСведений.ЛБ_НастройкиЗаймаВерхнегоУровня.СрезПоследних(&Дата, Организация = &Организация) КАК УсловияПредоставленияКредитаСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда				
		СтруктураР = Новый Структура;
		СтруктураР.Вставить("НачислятьПроцентыЗаДеньЗалога", Выборка.НачислятьПроцентыЗаДеньЗалога); 
		СтруктураР.Вставить("НеНачислятьПроцентыЗаПоследнийДень", Выборка.НеНачислятьПроцентыЗаПоследнийДень);
		СтруктураР.Вставить("СчитатьПроцентыДеньВыдачиРавенДеньВыкупа", Выборка.СчитатьПроцентыДеньВыдачиРавенДеньВыкупа);
		Возврат СтруктураР;
	Иначе
		Возврат неопределено;
	КонецЕсли;	
КонецФункции   

Функция ПолучитьПричинуПримененияПроцентнойСхемы(ДокументОбъект = неопределено, ЗалоговыйБилет, Дата = неопределено) Экспорт   
	Если ЗалоговыйБилет.СхемаКредитования.ПризнакПримененияГибкогоПроцента Тогда 
		Если ДокументОбъект = неопределено Тогда
			ДатаДок = ?(Дата = неопределено, ТекущаяДата(), Дата);
		Иначе	
			Если ЗначениеЗаполнено(ДокументОбъект.Ссылка) Тогда	  
				МоментДоДокумента = Новый Граница(Новый МоментВремени(ДокументОбъект.Дата, ДокументОбъект.Ссылка), ВидГраницы.Исключая);
				ДатаДок = МоментДоДокумента; 
			Иначе	
			    ДатаДок = ДокументОбъект.Дата;		
			КонецЕсли;
		КонецЕсли;	
	  			
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Дата", ДатаДок);
		Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПричинаПрименения КАК ПричинаПрименения
		               |ИЗ
		               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&Дата, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.Период УБЫВ";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			Возврат Выборка.ПричинаПрименения;
		КонецЕсли;	 
	КонецЕсли;	
	Возврат Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма;
КонецФункции	

Функция ПолучитьПричинуПримененияГибкийПроцент(СхемаКредитования, СтатусЗалоговогоБилета) Экспорт 
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("СхемаКредитования", СхемаКредитования);
	Запрос.УстановитьПараметр("СтатусЗалоговогоБилета", СтатусЗалоговогоБилета);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СхемыКредитованияПричиныПримененияПроцентнойСхемы.ПричинаПрименения КАК ПричинаПрименения
	               |ИЗ
	               |	Справочник.ЛБ_СхемыКредитования.ПричиныПримененияПроцентнойСхемы КАК ЛБ_СхемыКредитованияПричиныПримененияПроцентнойСхемы
	               |ГДЕ
	               |	ЛБ_СхемыКредитованияПричиныПримененияПроцентнойСхемы.Ссылка = &СхемаКредитования
	               |	И ЛБ_СхемыКредитованияПричиныПримененияПроцентнойСхемы.СтатусЗалоговогоБилета = &СтатусЗалоговогоБилета";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.ПричинаПрименения;
	КонецЕсли;	
	Возврат неопределено;
КонецФункции	         

Функция ПолучитьСостояниеОбъектаЗалога(Дата, ОбъектЗалога, ЗалоговыйБилет) Экспорт  
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Дата", Дата); 
	Запрос.УстановитьПараметр("ОбъектЗалога", ОбъектЗалога);
    Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(
	               |			&Дата,
	               |			ЗалоговыйБилет = &ЗалоговыйБилет
	               |				И ОбъектЗалога = &ОбъектЗалога) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.Период УБЫВ";  
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.СтатусОбъектаЗалога;
	КонецЕсли;	
	Возврат неопределено;

КонецФункции	

Функция ПолучитьСогласиеНаСМСРассылки(Дата, Залогодатель) Экспорт
	ЗапросС = Новый Запрос; 
	ЗапросС.УстановитьПараметр("Дата", Дата); 
	ЗапросС.УстановитьПараметр("Залогодатель", Залогодатель);
	ЗапросС.Текст = "ВЫБРАТЬ
	               |	ЛБ_СогласиеНаСМСРассылкуСрезПоследних.Согласен КАК Согласен
	               |ИЗ
	               |	РегистрСведений.ЛБ_СогласиеНаСМСРассылку.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_СогласиеНаСМСРассылкуСрезПоследних";
	ВыборкаС = ЗапросС.Выполнить().Выбрать();
	Если ВыборкаС.Следующий() тогда  
		Возврат ВыборкаС.Согласен;
	КонецЕсли;	
    Возврат Ложь;
КонецФункции  

Процедура СохранитьСогласиеНаСМСРассылки(Дата, Залогодатель, СогласиеНаСМСРассылки) Экспорт
	МенеджерЗаписи = РегистрыСведений.ЛБ_СогласиеНаСМСРассылку.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Период = Дата;
	МенеджерЗаписи.Залогодатель = Залогодатель;
	МенеджерЗаписи.Согласен = СогласиеНаСМСРассылки; 

	МенеджерЗаписи.Записать();
КонецПроцедуры

Функция ПроверитьЕстьОперацииПоЗалоговомуБилету(Дата, ЗалоговыйБилет) Экспорт 
	Запрос = новый Запрос; 
	Запрос.УстановитьПараметр("Дата1", ЗалоговыйБилет.Дата); 
	Запрос.УстановитьПараметр("Дата2", Дата); 
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.Текст ="ВЫБРАТЬ
	              |	ЛБ_ОборотыПоОперациямЗаймаОбороты.ВидОперации КАК ВидОперации
	              |ИЗ
	              |	РегистрНакопления.ЛБ_ОборотыПоОперациямЗайма.Обороты(&Дата1, &Дата2, Регистратор, ) КАК ЛБ_ОборотыПоОперациямЗаймаОбороты
	              |ГДЕ
	              |	ЛБ_ОборотыПоОперациямЗаймаОбороты.ЗалоговыйБилет = &ЗалоговыйБилет
	              |	И ЛБ_ОборотыПоОперациямЗаймаОбороты.Регистратор <> &ЗалоговыйБилет"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		Возврат Выборка.ВидОперации;
	КонецЕсли;
	Возврат неопределено;
КонецФункции	           

Функция ПолучитьНовыйНомерЗалоговогоБилета(Ломбард) Экспорт  
	НаборЗаписей = РегистрыСведений.ЛБ_ПачкиЗалоговыхБилетов.СоздатьНаборЗаписей();  			
	НаборЗаписей.Отбор.Ломбард.Установить(Ломбард);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда  
		ТекНомерПачки = Константы.ЛБ_ТекущийНомерПачки.Получить() + 1;
		Константы.ЛБ_ТекущийНомерПачки.Установить(ТекНомерПачки);
		ТекНомерБилета = ТекНомерПачки*1000 + 1;  
		ПоследнийНомерБилета = ТекНомерПачки*1000 + 999;
		НовыйНомер = НаборЗаписей.Добавить();
		НовыйНомер.Ломбард = Ломбард;
		НовыйНомер.Пачка = ТекНомерПачки;
		НовыйНомер.ТекущийНомерЗалоговогоБилета = ТекНомерБилета;
		НовыйНомер.ПоследнийНомерВПачке = ПоследнийНомерБилета; 
	ИначеЕсли НаборЗаписей.Количество() = 1 Тогда
		НовыйНомер = НаборЗаписей[0];
		ТекНомерБилета = НовыйНомер.ТекущийНомерЗалоговогоБилета + 1;
		Если ТекНомерБилета > НовыйНомер.ПоследнийНомерВПачке Тогда  
			ТекНомерПачки = Константы.ЛБ_ТекущийНомерПачки.Получить() + 1;
			Константы.ЛБ_ТекущийНомерПачки.Установить(ТекНомерПачки);
		    ТекНомерБилета = ТекНомерПачки*1000 + 1;  
		    ПоследнийНомерБилета = ТекНомерПачки*1000 + 999;
            НовыйНомер.Пачка = ТекНомерПачки;
			НовыйНомер.ТекущийНомерЗалоговогоБилета = ТекНомерБилета;
			НовыйНомер.ПоследнийНомерВПачке = ПоследнийНомерБилета; 
		Иначе
			НовыйНомер.ТекущийНомерЗалоговогоБилета = ТекНомерБилета;
		КонецЕсли;	
	КонецЕсли;  
	НаборЗаписей.Записать(); 
	
	
	//+Мельников 26.04.24 Если захотят использовать префикс в номере ЗБ. Добавлено условие.
	//Было: ПрефиксЗБ = СокрЛП(Ломбард.Префикс);	
	Если Ломбард.ИспользоватьПрефиксВНомереЗБ Тогда
		ПрефиксЗБ = СокрЛП(Ломбард.Префикс);
	Иначе
		ПрефиксЗБ = "";
	КонецЕсли;
	//-Мельников
	
    Возврат ПрефиксЗБ + Формат(ТекНомерБилета, "ЧГ=");
КонецФункции	                                            

Функция ПроверитьЕстьНомерЗалоговогоБилета(НомерЗалоговогоБилета) Экспорт 
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("НомерЗалоговогоБилета", НомерЗалоговогоБилета); 
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЛБ_СостояниеЗалоговогоБилета.Залогодатель КАК Залогодатель
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета КАК ЛБ_СостояниеЗалоговогоБилета
	               |ГДЕ
	               |	ЛБ_СостояниеЗалоговогоБилета.НомерЗалоговогоБилета = &НомерЗалоговогоБилета";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат ТаблицаЗапроса.Количество();
КонецФункции	

Функция ПроверкаДатыОперацииПоЗалогу(ДатаПроверки, ЗалоговыйБилет) Экспорт 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаПроверки);
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОборотыПоОперациямЗайма.Период КАК Период
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОборотыПоОперациямЗайма КАК ЛБ_ОборотыПоОперациямЗайма
	               |ГДЕ
	               |	ЛБ_ОборотыПоОперациямЗайма.ЗалоговыйБилет = &ЗалоговыйБилет
	               |	И ЛБ_ОборотыПоОперациямЗайма.Период > &Дата"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

Функция ПолучитьТоварыНаСкладеЛомбарда(Дата, Организация, Ломбард, Склад) Экспорт 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата); 
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Склад", Склад);  
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток КАК Количество,
	               |	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток КАК СуммаОценки
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(
	               |			&Дата,
	               |			Организация = &Организация
	               |				И Ломбард = &Ломбард
	               |				И Склад = &Склад) КАК ЛБ_ОбъектыЗалогаОстатки";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
		
	Возврат ТаблицаЗапроса;
КонецФункции      

Функция ПолучитьТоварыНаСкладеЛомбардаПоГруппе(Дата, Организация, Ломбард, Склад, Группа) Экспорт  
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата); 
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Склад", Склад); 
	Запрос.УстановитьПараметр("Группа", Группа);
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ЗалоговыйБилет,
	                |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
	                |	ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток КАК Количество,
	                |	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток КАК СуммаОценки
	                |ИЗ
	                |	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(
	                |			&Дата,
	                |			Организация = &Организация
	                |				И Ломбард = &Ломбард
	                |				И Склад = &Склад) КАК ЛБ_ОбъектыЗалогаОстатки
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                |			ЛБ_ГруппыОбъектовЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	                |			ЛБ_ГруппыОбъектовЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	                |			ЛБ_ГруппыОбъектовЗалогаСрезПоследних.Группа КАК Группа
	                |		ИЗ
	                |			РегистрСведений.ЛБ_ГруппыОбъектовЗалога.СрезПоследних(&Дата, ) КАК ЛБ_ГруппыОбъектовЗалогаСрезПоследних
	                |		ГДЕ
	                |			ЛБ_ГруппыОбъектовЗалогаСрезПоследних.Группа = &Группа) КАК ГруппыОбъектовЗалога
	                |		ПО ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет = ГруппыОбъектовЗалога.ЗалоговыйБилет
	                |			И ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ГруппыОбъектовЗалога.ОбъектЗалога";   	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
		
	Возврат ТаблицаЗапроса;
КонецФункции   

Функция ПолучитьТоварыНаСкладеЛомбардаПоГруппам(Дата, Организация, Ломбард, Склад, Группы) Экспорт  
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата); 
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Склад", Склад); 
	Запрос.УстановитьПараметр("Группы", Группы);
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ЗалоговыйБилет,
	                |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
	                |	ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток КАК Количество,
	                |	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток КАК СуммаОценки,
	                |	ГруппыОбъектовЗалога.Группа КАК Группа
	                |ИЗ
	                |	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(
	                |			&Дата,
	                |			Организация = &Организация
	                |				И Ломбард = &Ломбард
	                |				И Склад = &Склад) КАК ЛБ_ОбъектыЗалогаОстатки
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                |			ЛБ_ГруппыОбъектовЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	                |			ЛБ_ГруппыОбъектовЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	                |			ЛБ_ГруппыОбъектовЗалогаСрезПоследних.Группа КАК Группа
	                |		ИЗ
	                |			РегистрСведений.ЛБ_ГруппыОбъектовЗалога.СрезПоследних(&Дата, ) КАК ЛБ_ГруппыОбъектовЗалогаСрезПоследних
	                |		ГДЕ
	                |			ЛБ_ГруппыОбъектовЗалогаСрезПоследних.Группа В(&Группы)) КАК ГруппыОбъектовЗалога
	                |		ПО ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет = ГруппыОбъектовЗалога.ЗалоговыйБилет
	                |			И ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ГруппыОбъектовЗалога.ОбъектЗалога
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	Группа";   	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
		
	Возврат ТаблицаЗапроса;
КонецФункции   


Функция ПолучитьТоварыНаСкладеЛомбардаПоНакладной(Дата, Организация, Ломбард, Склад, НомерНакладной) Экспорт 
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", Дата); 
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Склад", Склад); 
	Запрос.УстановитьПараметр("НомерНакладной", НомерНакладной);
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ЗалоговыйБилет,
	                |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
	                |	ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток КАК Количество,
	                |	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток КАК СуммаОценки
	                |ИЗ
	                |	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(
	                |			&Дата,
	                |			Организация = &Организация
	                |				И Ломбард = &Ломбард
	                |				И Склад = &Склад) КАК ЛБ_ОбъектыЗалогаОстатки
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                |			ЛБ_НакладнаяНаОтгрузкуЗалоги.ЗалоговыйБилет КАК ЗалоговыйБилет,
	                |			ЛБ_НакладнаяНаОтгрузкуЗалоги.ОбъектЗалога КАК ОбъектЗалога
	                |		ИЗ
	                |			Документ.ЛБ_НакладнаяНаОтгрузку.Залоги КАК ЛБ_НакладнаяНаОтгрузкуЗалоги
	                |		ГДЕ
	                |			ЛБ_НакладнаяНаОтгрузкуЗалоги.Ссылка.ПредставлениеНомераНакладной = &НомерНакладной) КАК ОбъектыЗалогаВНакладной
	                |		ПО ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет = ОбъектыЗалогаВНакладной.ЗалоговыйБилет
	                |			И ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ОбъектыЗалогаВНакладной.ОбъектЗалога";   	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
		
	Возврат ТаблицаЗапроса;

КонецФункции     

Функция ПолучитьТоварыНаСкладеЛомбардаПоПеремещению(Дата, Организация, Ломбард, Склад, НомерПеремещения) Экспорт 
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", Дата); 
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Склад", Склад); 
	Запрос.УстановитьПараметр("НомерПеремещения", НомерПеремещения);
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ЗалоговыйБилет,
	                |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
	                |	ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток КАК Количество,
	                |	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток КАК СуммаОценки
	                |ИЗ
	                |	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(
	                |			&Дата,
	                |			Организация = &Организация
	                |				И Ломбард = &Ломбард
	                |				И Склад = &Склад) КАК ЛБ_ОбъектыЗалогаОстатки
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                |			ЛБ_ПеремещениеОбъектовЗалогаТовары.ЗалоговыйБилет КАК ЗалоговыйБилет,
	                |			ЛБ_ПеремещениеОбъектовЗалогаТовары.ОбъектЗалога КАК ОбъектЗалога
	                |		ИЗ
	                |			Документ.ЛБ_ПеремещениеОбъектовЗалога.Товары КАК ЛБ_ПеремещениеОбъектовЗалогаТовары
	                |		ГДЕ
	                |			ЛБ_ПеремещениеОбъектовЗалогаТовары.Ссылка.ПредставлениеНомераПеремещения = &НомерПеремещения) КАК ОбъектыЗалогаВПеремещении
	                |		ПО ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет = ОбъектыЗалогаВПеремещении.ЗалоговыйБилет
	                |			И ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ОбъектыЗалогаВПеремещении.ОбъектЗалога";   	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
		
	Возврат ТаблицаЗапроса;

КонецФункции


Функция ПолучитьТоварыНаСкладеЛомбардаПоАртикулу(Дата, Организация, Ломбард, Склад, Артикул) Экспорт  
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата); 
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Склад", Склад); 
	Запрос.УстановитьПараметр("Артикул", Артикул);
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ЗалоговыйБилет,
	                |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
	                |	ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток КАК Количество,
	                |	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток КАК СуммаОценки
	                |ИЗ
	                |	РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(&Дата, Артикул = &Артикул) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(
	                |				&Дата,
	                |				Организация = &Организация
	                |					И Ломбард = &Ломбард
	                |					И Склад = &Склад) КАК ЛБ_ОбъектыЗалогаОстатки
	                |		ПО (ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет)
	                |			И (ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога)";  
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	
	Возврат ТаблицаЗапроса;
КонецФункции   

Функция ПолучитьТоварыНаСкладеЛомбардаПоПробе(Дата, Организация, Ломбард, Склад, Проба) Экспорт  
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата); 
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Склад", Склад); 
	Запрос.УстановитьПараметр("Проба", Проба);
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ЗалоговыйБилет,
	                |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
	                |	ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток КАК Количество,
	                |	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток КАК СуммаОценки
	                |ИЗ
	                |	РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(&Дата, Проба В (&Проба)) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(
	                |				&Дата,
	                |				Организация = &Организация
	                |					И Ломбард = &Ломбард
	                |					И Склад = &Склад) КАК ЛБ_ОбъектыЗалогаОстатки
	                |		ПО (ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет)
	                |			И (ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога)";  
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	
	Возврат ТаблицаЗапроса;
КонецФункции   

Функция ПолучитьТоварыНаСкладеЛомбардаПоКатегории(Дата, Организация, Ломбард, Склад, Категория) Экспорт  
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата); 
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Склад", Склад); 
	Запрос.УстановитьПараметр("Категория", Категория);
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ЗалоговыйБилет,
	                |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
	                |	ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток КАК Количество,
	                |	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток КАК СуммаОценки
	                |ИЗ
	                |	РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(&Дата, Категория В (&Категория)) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(
	                |				&Дата,
	                |				Организация = &Организация
	                |					И Ломбард = &Ломбард
	                |					И Склад = &Склад) КАК ЛБ_ОбъектыЗалогаОстатки
	                |		ПО (ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет)
	                |			И (ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога)";  
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	
	Возврат ТаблицаЗапроса;
КонецФункции  

Функция ПолучитьТоварыНаСкладеЛомбардаПоВставкамБриллианты(Дата, Организация, Ломбард, Склад) Экспорт  
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата); 
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Склад", Склад); 
	Запрос.УстановитьПараметр("Бриллиант", Справочники.ЛБ_ДрагоценныеКамни.Бриллиант);
	Запрос.Текст =  "ВЫБРАТЬ
	                |	Остатки.ЗалоговыйБилет КАК ЗалоговыйБилет,
	                |	Остатки.ОбъектЗалога КАК ОбъектЗалога,
	                |	Остатки.Количество КАК Количество,
	                |	Остатки.СуммаОценки КАК СуммаОценки
	                |ИЗ
	                |	(ВЫБРАТЬ
	                |		ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ЗалоговыйБилет,
	                |		ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
	                |		СУММА(ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток) КАК Количество,
	                |		СУММА(ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток) КАК СуммаОценки
	                |	ИЗ
	                |		РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(
	                |				&Дата,
	                |				Организация = &Организация
	                |					И Ломбард = &Ломбард
	                |					И Склад = &Склад) КАК ЛБ_ОбъектыЗалогаОстатки
	                |	
	                |	СГРУППИРОВАТЬ ПО
	                |		ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет,
	                |		ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога) КАК Остатки
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                |			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	                |			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога
	                |		ИЗ
	                |			РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(&Дата, ВидВставки = &Бриллиант) КАК ЛБ_ВставкиОбъектаЗалогаСрезПоследних) КАК ВставкиБриллианты
	                |		ПО Остатки.ЗалоговыйБилет = ВставкиБриллианты.ЗалоговыйБилет
	                |			И Остатки.ОбъектЗалога = ВставкиБриллианты.ОбъектЗалога"; 
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	
	Возврат ТаблицаЗапроса;
КонецФункции 

Функция ПолучитьТоварыНаСкладеЛомбардаПоДопМеталлам(Дата, Организация, Ломбард, Склад) Экспорт  
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата); 
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Склад", Склад); 
	Запрос.Текст =  "ВЫБРАТЬ
	                |	Остатки.ЗалоговыйБилет КАК ЗалоговыйБилет,
	                |	Остатки.ОбъектЗалога КАК ОбъектЗалога,
	                |	Остатки.Количество КАК Количество,
	                |	Остатки.СуммаОценки КАК СуммаОценки
	                |ИЗ
	                |	(ВЫБРАТЬ
	                |		ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ЗалоговыйБилет,
	                |		ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
	                |		СУММА(ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток) КАК Количество,
	                |		СУММА(ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток) КАК СуммаОценки
	                |	ИЗ
	                |		РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(
	                |				&Дата,
	                |				Организация = &Организация
	                |					И Ломбард = &Ломбард
	                |					И Склад = &Склад) КАК ЛБ_ОбъектыЗалогаОстатки
	                |	
	                |	СГРУППИРОВАТЬ ПО
	                |		ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет,
	                |		ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога) КАК Остатки
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                |			ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	                |			ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога
	                |		ИЗ
	                |			РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(&Дата, ) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних
	                |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(&Дата, ) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	                |				ПО ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет
	                |					И ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ОбъектЗалога = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога
	                |					И ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.Проба <> ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба) КАК ДопМеталлы
	                |		ПО Остатки.ЗалоговыйБилет = ДопМеталлы.ЗалоговыйБилет
	                |			И Остатки.ОбъектЗалога = ДопМеталлы.ОбъектЗалога";  
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	
	Возврат ТаблицаЗапроса;
КонецФункции   

Функция ПолучитьТоварыНаСкладеЛомбардаБезВставок(Дата, Организация, Ломбард, Склад) Экспорт 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата); 
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Склад", Склад); 
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ЗалоговыйБилет,
	                |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
	                |	ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток КАК Количество,
	                |	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток КАК СуммаОценки
	                |ИЗ
	                |	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(
	                |			&Дата,
	                |			Организация = &Организация
	                |				И Ломбард = &Ломбард
	                |				И Склад = &Склад) КАК ЛБ_ОбъектыЗалогаОстатки
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(&Дата, Вставки = ЛОЖЬ) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	                |		ПО ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет
	                |			И ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога";  
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	
	Возврат ТаблицаЗапроса;
КонецФункции      

Функция ПолучитьТоварыНаСкладеЛомбардаПоНомеруЗБ(Дата, Организация, Ломбард, Склад, НомерЗБ) Экспорт 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата); 
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Склад", Склад); 
	Запрос.УстановитьПараметр("НомерЗБ", НомерЗБ);
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ЗалоговыйБилет,
	                |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
	                |	ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток КАК Количество,
	                |	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток КАК СуммаОценки
	                |ИЗ
	                |	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(
	                |			&Дата,
	                |			Организация = &Организация
	                |				И Ломбард = &Ломбард
	                |				И Склад = &Склад
	                |				И ЗалоговыйБилет.НомерЗалоговогоБилета = &НомерЗБ) КАК ЛБ_ОбъектыЗалогаОстатки";  
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	
	Возврат ТаблицаЗапроса;
КонецФункции      

Функция ПолучитьТоварыВПути(Дата, Организация, Отправитель, СкладОтправитель, Получатель, СкладПолучатель, НакладнаяНаОтгрузку, ВидОприходования) Экспорт 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата); 
	Запрос.УстановитьПараметр("НакладнаяНаОтгрузку", НакладнаяНаОтгрузку);
	Если ВидОприходования = Перечисления.ЛБ_ВидыПоступленияОбъектовЗалога.ОтСтороннегоКонтрагента Тогда
		Запрос.УстановитьПараметр("Получатель", Отправитель); 
		Запрос.УстановитьПараметр("СкладОтправитель", СкладПолучатель);
		
		Запрос.Текст =  "ВЫБРАТЬ
		                |	ЛБ_ОбъектыЗалогаВПутиОстатки.ЗалоговыйБилет КАК ЗалоговыйБилет,
		                |	ЛБ_ОбъектыЗалогаВПутиОстатки.ОбъектЗалога КАК ОбъектЗалога,
		                |	СУММА(ЛБ_ОбъектыЗалогаВПутиОстатки.КоличествоОстаток) КАК Количество,
		                |	СУММА(ЛБ_ОбъектыЗалогаВПутиОстатки.СуммаОценкиОстаток) КАК СуммаОценки,
		                |	ЛБ_ОбъектыЗалогаВПутиОстатки.Инкассатор КАК Инкассатор,
		                |	ЛБ_ОбъектыЗалогаВПутиОстатки.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
		                |	ЛБ_ОбъектыЗалогаВПутиОстатки.Отправитель КАК Отправитель,
		                |	ЛБ_ОбъектыЗалогаВПутиОстатки.Получатель КАК Получатель,
		                |	ЛБ_ОбъектыЗалогаВПутиОстатки.СкладОтправитель КАК СкладОтправитель,
		                |	ЛБ_ОбъектыЗалогаВПутиОстатки.СкладПолучатель КАК СкладПолучатель
		                |ИЗ
		                |	РегистрНакопления.ЛБ_ОбъектыЗалогаВПути.Остатки(
		                |			&Дата,
		                |			Получатель = &Получатель
		                |				И НакладнаяНаОтгрузку = &НакладнаяНаОтгрузку
		                |				И СкладОтправитель = &СкладОтправитель) КАК ЛБ_ОбъектыЗалогаВПутиОстатки
		                |
		                |СГРУППИРОВАТЬ ПО
		                |	ЛБ_ОбъектыЗалогаВПутиОстатки.ЗалоговыйБилет,
		                |	ЛБ_ОбъектыЗалогаВПутиОстатки.НакладнаяНаОтгрузку,
		                |	ЛБ_ОбъектыЗалогаВПутиОстатки.ОбъектЗалога,
		                |	ЛБ_ОбъектыЗалогаВПутиОстатки.Инкассатор,
		                |	ЛБ_ОбъектыЗалогаВПутиОстатки.Отправитель,
		                |	ЛБ_ОбъектыЗалогаВПутиОстатки.СкладОтправитель,
		                |	ЛБ_ОбъектыЗалогаВПутиОстатки.СкладПолучатель,
		                |	ЛБ_ОбъектыЗалогаВПутиОстатки.Получатель";  
	Иначе		
		Запрос.УстановитьПараметр("Организация", Организация);    
		Запрос.УстановитьПараметр("Отправитель", Отправитель);
		Запрос.УстановитьПараметр("СкладОтправитель", СкладОтправитель);
		Запрос.УстановитьПараметр("Получатель", Получатель);  	
		Запрос.УстановитьПараметр("СкладПолучатель", СкладПолучатель);
		
		Запрос.Текст =  "ВЫБРАТЬ
		                |	ЛБ_ОбъектыЗалогаВПутиОстатки.ЗалоговыйБилет КАК ЗалоговыйБилет,
		                |	ЛБ_ОбъектыЗалогаВПутиОстатки.ОбъектЗалога КАК ОбъектЗалога,
		                |	СУММА(ЛБ_ОбъектыЗалогаВПутиОстатки.КоличествоОстаток) КАК Количество,
		                |	СУММА(ЛБ_ОбъектыЗалогаВПутиОстатки.СуммаОценкиОстаток) КАК СуммаОценки,
		                |	ЛБ_ОбъектыЗалогаВПутиОстатки.Инкассатор КАК Инкассатор,
		                |	ЛБ_ОбъектыЗалогаВПутиОстатки.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
		                |	ЛБ_ОбъектыЗалогаВПутиОстатки.Отправитель КАК Отправитель,
		                |	ЛБ_ОбъектыЗалогаВПутиОстатки.Получатель КАК Получатель,
		                |	ЛБ_ОбъектыЗалогаВПутиОстатки.СкладОтправитель КАК СкладОтправитель,
		                |	ЛБ_ОбъектыЗалогаВПутиОстатки.СкладПолучатель КАК СкладПолучатель
		                |ИЗ
		                |	РегистрНакопления.ЛБ_ОбъектыЗалогаВПути.Остатки(
		                |			&Дата,
		                |			Отправитель = &Отправитель
		                |				И СкладОтправитель = &СкладОтправитель
		                |				И Получатель = &Получатель
		                |				И СкладПолучатель = &СкладПолучатель
		                |				И НакладнаяНаОтгрузку = &НакладнаяНаОтгрузку) КАК ЛБ_ОбъектыЗалогаВПутиОстатки
		                |
		                |СГРУППИРОВАТЬ ПО
		                |	ЛБ_ОбъектыЗалогаВПутиОстатки.Отправитель,
		                |	ЛБ_ОбъектыЗалогаВПутиОстатки.Получатель,
		                |	ЛБ_ОбъектыЗалогаВПутиОстатки.СкладПолучатель,
		                |	ЛБ_ОбъектыЗалогаВПутиОстатки.НакладнаяНаОтгрузку,
		                |	ЛБ_ОбъектыЗалогаВПутиОстатки.ЗалоговыйБилет,
		                |	ЛБ_ОбъектыЗалогаВПутиОстатки.ОбъектЗалога,
		                |	ЛБ_ОбъектыЗалогаВПутиОстатки.Инкассатор,
		                |	ЛБ_ОбъектыЗалогаВПутиОстатки.СкладОтправитель";  	 
	КонецЕсли;
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаЗапроса;
КонецФункции      

Функция ПолучитьТоварыВСумке(Дата, Организация, Получатель, СкладПолучатель, НакладнаяНаОтгрузку) Экспорт 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата); 	
	Запрос.УстановитьПараметр("Организация", Организация);    
	Запрос.УстановитьПараметр("Получатель", Получатель);
	Запрос.УстановитьПараметр("СкладПолучатель", СкладПолучатель); 
	Запрос.УстановитьПараметр("НакладнаяНаОтгрузку", НакладнаяНаОтгрузку); 	
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ЛБ_ОбъектыЗалогаВСумкеОстатки.ЗалоговыйБилет КАК ЗалоговыйБилет,
	                |	ЛБ_ОбъектыЗалогаВСумкеОстатки.ОбъектЗалога КАК ОбъектЗалога,
	                |	ЛБ_ОбъектыЗалогаВСумкеОстатки.КоличествоОстаток КАК Количество,
	                |	ЛБ_ОбъектыЗалогаВСумкеОстатки.СуммаОценкиОстаток КАК СуммаОценки,
	                |	ЛБ_ОбъектыЗалогаВСумкеОстатки.Инкассатор КАК Инкассатор,
	                |	ЛБ_ОбъектыЗалогаВСумкеОстатки.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
	                |	ЛБ_ОбъектыЗалогаВСумкеОстатки.Отправитель КАК Отправитель,
	                |	ЛБ_ОбъектыЗалогаВСумкеОстатки.Получатель КАК Получатель,
	                |	ЛБ_ОбъектыЗалогаВСумкеОстатки.СкладОтправитель КАК СкладОтправитель,
	                |	ЛБ_ОбъектыЗалогаВСумкеОстатки.СкладПолучатель КАК СкладПолучатель
	                |ИЗ
	                |	РегистрНакопления.ЛБ_ОбъектыЗалогаВСумке.Остатки(
	                |			&Дата,
	                |			Получатель = &Получатель
	                |				И СкладПолучатель = &СкладПолучатель
	                |				И НакладнаяНаОтгрузку = &НакладнаяНаОтгрузку) КАК ЛБ_ОбъектыЗалогаВСумкеОстатки";  
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	
	Возврат ТаблицаЗапроса;
КонецФункции      

Функция ПолучитьОписаниеОбъектаЗалога(Дата, ОбъектЗалога) Экспорт 
	ИнформацияОЗ = "";
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Дата", Дата); 
	Запрос.УстановитьПараметр("ОбъектЗалога", ОбъектЗалога);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК ВесИзделия,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(&Дата, ОбъектЗалога = &ОбъектЗалога) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Период УБЫВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
	               |	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесЧистый,
	               |	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.Период КАК Период
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(&Дата, ОбъектЗалога = &ОбъектЗалога) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ,
	               |	ВесЧистый УБЫВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки КАК ВидВставки,
	               |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ФормаОгранки КАК ФормаОгранки,
	               |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидОгранки КАК ВидОгранки,
	               |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.КачествоОгранки КАК КачествоОгранки,
	               |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Длина КАК Длина,
	               |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Ширина КАК Ширина,
	               |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Высота КАК Высота,
	               |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Диаметр КАК Диаметр,
	               |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Диаметр1 КАК Диаметр1,
	               |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Диаметр2 КАК Диаметр2,
	               |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Вес КАК Вес,
	               |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Период КАК Период,
	               |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Количество КАК Количество
	               |ИЗ
	               |	РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(&Дата, ОбъектЗалога = &ОбъектЗалога) КАК ЛБ_ВставкиОбъектаЗалогаСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ,
	               |	ВидВставки,
	               |	Вес УБЫВ";
	МассивРезультатов = Запрос.ВыполнитьПакет();

    Выборка1 = МассивРезультатов[0].Выбрать();
	Если Выборка1.Следующий() Тогда		
		ИнформацияОЗ = ИнформацияОЗ + СокрЛП(Выборка1.ВидИзделия) + " " + СокрЛП(Формат(Выборка1.ВесИзделия, "ЧЦ=10; ЧДЦ=2")) + " " + сокрЛП(Выборка1.ЕдиницаИзмерения); 
	КонецЕсли;	   
	
	Выборка2 = МассивРезультатов[1].Выбрать();
	Период = Дата(1,1,1); 
	Ном = 0;
	Пока Выборка2.Следующий() Цикл
	    Если Период = Дата(1,1,1) тогда
		    Период = Выборка2.Период;
		ИначеЕсли НЕ Период = Выборка2.Период Тогда
			Прервать;
		КонецЕсли;
	    ИнформацияОЗ = ИнформацияОЗ + ?(Ном = 0, " ", "+") + СокрЛП(Выборка2.Проба);
		Ном = Ном + 1;
	Конеццикла;  
	
	Выборка3 = МассивРезультатов[2].Выбрать();
	Период = Дата(1,1,1); 
	Ном = 0;
	Пока Выборка3.Следующий() Цикл
	    Если Период = Дата(1,1,1) тогда
		    Период = Выборка3.Период;
		ИначеЕсли НЕ Период = Выборка3.Период Тогда
			Прервать;
		КонецЕсли;
	    ИнформацияОЗ = ИнформацияОЗ + ?(Ном = 0, "; ", ", ") + Строка(Выборка3.Количество) + " " + СокрЛП(Выборка3.ВидВставки) + 
		     ?(ЗначениеЗаполнено(Выборка3.ВидОгранки), " " + СокрЛП(Выборка3.ВидОгранки), "") + ?(ЗначениеЗаполнено(Выборка3.КачествоОгранки), " " + СокрЛП(Выборка3.КачествоОгранки), "");
		ОписаниеРазмера = "";
		Если НЕ Выборка3.Диаметр = 0 Тогда
			ОписаниеРазмера = СокрЛП(Выборка3.Диаметр) + " мм";
		ИначеЕсли НЕ Выборка3.Диаметр1 = 0 Тогда	   
			ОписаниеРазмера = СокрЛП(Выборка3.Диаметр1) + ?(НЕ Выборка3.Диаметр2 = 0, "х" + СокрЛП(Выборка3.Диаметр2), "") + " мм";
		ИначеЕсли НЕ Выборка3.Длина = 0 Тогда  
			ОписаниеРазмера = СокрЛП(Выборка3.Длина) + ?(НЕ Выборка3.Ширина = 0, "х" + СокрЛП(Выборка3.Ширина), "") + ?(НЕ Выборка3.Высота = 0, "х" + СокрЛП(Выборка3.Высота), "") + " мм";
		КонецЕсли;	
		ИнформацияОЗ = ИнформацияОЗ + " " + ОписаниеРазмера;  
		ИнформацияОЗ = ИнформацияОЗ + " " + СокрЛП(Формат(Выборка3.Вес, "ЧЦ=10; ЧДЦ=3")) + " " + сокрЛП(Выборка3.ЕдиницаИзмерения);
		Ном = Ном + 1;
    Конеццикла;
	
	Возврат ИнформацияОЗ;
Конецфункции	

Функция ПолучитьПредельныйСрокЗайма(Дата, СхемаКредитования) Экспорт  
	МассивСК = Новый Массив;
	МассивСК.Добавить(Справочники.ЛБ_СхемыКредитования.ПустаяСсылка()); 
	Если ЗначениеЗаполнено(СхемаКредитования) Тогда
	    МассивСК.Добавить(СхемаКредитования);  
	КонецЕсли;	
	
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("СК", МассивСК);
	Запрос.Текст ="ВЫБРАТЬ
	              |	ЛБ_ПредельныеСрокиЗаймаСрезПоследних.КоличествоДней КАК КоличествоДней
	              |ИЗ
	              |	РегистрСведений.ЛБ_ПредельныеСрокиЗайма.СрезПоследних(&Дата, СхемаКредитования В (&СК)) КАК ЛБ_ПредельныеСрокиЗаймаСрезПоследних
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	ЛБ_ПредельныеСрокиЗаймаСрезПоследних.Период УБЫВ"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		Возврат Выборка.КоличествоДней;
	КонецЕсли;	
	Возврат 0;
КонецФункции	

Функция ПолучитьОсновнойЛомбардПользователя() Экспорт 
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	Если ТекПользователь.ЭтоЛомбард Тогда   
		Возврат ПараметрыСеанса.ТекущийЛомбард;
	КонецЕсли;	     
	
    Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Пользователь", ТекПользователь);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ТекущийЛомбардПользователя.Ломбард КАК Ломбард
	               |ИЗ
	               |	РегистрСведений.ЛБ_ТекущийЛомбардПользователя КАК ЛБ_ТекущийЛомбардПользователя
	               |ГДЕ
	               |	ЛБ_ТекущийЛомбардПользователя.Пользователь = &Пользователь"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ломбард;
	КонецЕсли;	
    Возврат Константы.ЛБ_ОсновнойЛомбард.Получить();
КонецФункции

Функция ПолучитьПараметрыЗалоговогоБилета(ЗалоговыйБилет) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПараметрыЗалоговогоБилета.Параметр КАК Параметр,
	               |	ЛБ_ПараметрыЗалоговогоБилета.Значение КАК Значение
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПараметрыЗалоговогоБилета КАК ЛБ_ПараметрыЗалоговогоБилета
	               |ГДЕ
	               |	ЛБ_ПараметрыЗалоговогоБилета.ЗалоговыйБилет = &ЗалоговыйБилет";
	ТаблицаПараметров = Запрос.Выполнить().Выгрузить();
	
	СтруктураВозврата = Новый структура;
	Возврат СтруктураВозврата; 
КонецФункции

Функция ПолучитьСтатусПоСистемеЛояльности(Дата, СистемныйСтатус) Экспорт  
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Дата", Дата); 
	Запрос.УстановитьПараметр("СтатусСистемный", СистемныйСтатус);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Соответствие.Статус КАК Статус
	               |ИЗ
	               |	РегистрСведений.ЛБ_СоответствиеСистемныхСтатусовИСтатусовПопрограммеЛояльности.СрезПоследних(&Дата, СтатусСистемный = &СтатусСистемный) КАК Соответствие";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
	    Возврат выборка.статус;
	КонецЕсли;    
	Возврат неопределено;
КонецФункции	

Функция ПолучитьДокументыПравоПребыванияРФ(Дата, Клиент, Гражданство) Экспорт
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", Дата); 
	Запрос.УстановитьПараметр("Клиент", Клиент);   
	Запрос.УстановитьПараметр("Гражданство", Гражданство);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя КАК ДокументЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК ДокументГражданство,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНачалоДействия КАК ДокументНачалоДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя.Владелец КАК Клиент,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНеДействителен КАК ДокументНеДействителен,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ОсновнойДоп КАК ОсновнойДоп
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(
	               |			&Дата,
	               |			ДокументЗалогодателя.Владелец = &Клиент
	               |				И ВидДокументаЗалогодателя = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийПравоПребыванияРФ)
	               |				И Гражданство = &Гражданство
	               |				И ОсновнойДоп = ИСТИНА
	               |				И ДокументНеДействителен = ЛОЖЬ) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";
	ТаблицаЗапроса  = Запрос.Выполнить().Выгрузить();
	УдСтроки = Новый СписокЗначений;
	Для каждого стр Из ТаблицаЗапроса Цикл 
		Если НЕ (Стр.ДокументСрокДействия = Дата(1,1,1)) Тогда
			Если Стр.ДокументСрокДействия < НачалоДня(Дата) Тогда
				УдСтроки.Добавить(Стр);
			КонецЕсли;
		КонецЕсли;
	Конеццикла;	
	
	Для каждого Эл из Удстроки Цикл 
		ТаблицаЗапроса.Удалить(Эл.Значение);
	Конеццикла;	   
	
	Возврат ТаблицаЗапроса;
КонецФункции

Функция ПроверитьОсновнойДокумент(Дата, Клиент, Гражданство) Экспорт  
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", Дата); 
	Запрос.УстановитьПараметр("Клиент", Клиент);   
	Запрос.УстановитьПараметр("Гражданство", Гражданство); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя КАК ДокументЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(
	               |			&Дата,
	               |			ДокументЗалогодателя.Владелец = &Клиент
	               |				И ВидДокументаЗалогодателя = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность)
	               |				И Гражданство = &Гражданство
	               |				И ОсновнойДУЛ = ИСТИНА
	               |				И ДокументНеДействителен = ЛОЖЬ) КАК ЛБ_ДокументыЗалогодателейСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Период УБЫВ"; 
	ТаблицаЗапроса  = Запрос.Выполнить().Выгрузить();
	УдСтроки = Новый СписокЗначений;
	Для каждого стр Из ТаблицаЗапроса Цикл 
		Если НЕ (Стр.ДокументСрокДействия = Дата(1,1,1)) Тогда
			Если Стр.ДокументСрокДействия < НачалоДня(Дата) Тогда
				УдСтроки.Добавить(Стр);
			КонецЕсли;
		КонецЕсли;
	Конеццикла;	
	
	Для каждого Эл из Удстроки Цикл 
		ТаблицаЗапроса.Удалить(Эл.Значение);
	Конеццикла;	   
	
	Возврат ?(ТаблицаЗапроса.Количество() = 0, Справочники.ЛБ_ДокументыЗалогодателя.ПустаяСсылка(), ТаблицаЗапроса.Получить(0).ДокументЗалогодателя);
КонецФункции	

Функция КоличествоДнейВГоду(Дата) Экспорт
	Возврат ДеньГода(КонецГода(Дата));
КонецФункции

Функция РасчетПСКГод(Дата, СрокЗалога, СуммаЗайма, СуммаПроцентов) Экспорт  
	
	Если СрокЗалога = 0 Тогда
		ПСКГод = 0;
	Иначе			
		Коэф1 = 365/СрокЗалога;
		
		//Коэф2 = (СуммаЗайма + СуммаПроцентов)/СуммаЗайма - 1; 
		Коэф2 = СуммаПроцентов/СуммаЗайма;
		
		ПСКГод = Коэф1*Коэф2*100; 
	КонецЕсли;	
	Возврат ПСКГод;
КонецФункции  

Функция РасчетПСКГодПрейскурант(Дата, СрокЗалога, СуммарнаяСтавка) Экспорт
	Если СрокЗалога = 0 Тогда
		ПСКГод = 0;
	Иначе		
		Коэф1 = КоличествоДнейВГоду(Дата)/СрокЗалога;		
		ПСКГод = Коэф1*СуммарнаяСтавка; 
	КонецЕсли;	
	Возврат ПСКГод;
КонецФункции  

Функция СоздатьНовуюОплатуПроцентов(ДатаДок, ЗалоговыйБилет) Экспорт
	ДокументОбъект = Документы.ЛБ_ОперацияПоЗалогу.СоздатьДокумент(); 
	ДокументОбъект.ПредыдущаяОперация = ЗалоговыйБилет; 
	ДокументОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов;
	ДокументОбъект.Дата = ДатаДок; 
	ДокументОбъект.Организация = ЗалоговыйБилет.Организация;
	ДокументОбъект.ПроцентнаяСхема = ЗалоговыйБилет.ПроцентнаяСхема;
	Возврат ДокументОбъект; 
КонецФункции

Функция ПолучитьДатуОкончанияДоверенностейКлиента(Дата, Клиент) Экспорт
	ДатаОкончания = Дата(1,1,1);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);  
	Запрос.УстановитьПараметр("ПредставительКлиента", Клиент);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДоверенностиСрезПоследних.Период КАК Период,
	               |	ЛБ_ДоверенностиСрезПоследних.Доверенность КАК Доверенность,
	               |	ЛБ_ДоверенностиСрезПоследних.СтатусДоверенности КАК СтатусДоверенности
	               |ИЗ
	               |	РегистрСведений.ЛБ_Доверенности.СрезПоследних(&Дата, Доверенность.ПредставительКлиента = &ПредставительКлиента) КАК ЛБ_ДоверенностиСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	Для каждого Стр Из ТаблицаЗапроса Цикл
		Если Стр.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.ДоверенностьОформлена Тогда
			Если Стр.Доверенность.СрокДействияДоверенности >= НачалоДня(Дата) Тогда 
				ДатаСмертиДоверителя = ЛБ_ОбщийМодуль.ПроверитьЕстьДатаСмерти(Стр.Доверенность.Клиент, Дата); 
				Если НЕ ДатаСмертиДоверителя = неопределено Тогда 	  
				    ДатаОкончания = ?(ДатаОкончания < ДатаСмертиДоверителя, ДатаСмертиДоверителя, ДатаОкончания); 
				КонецЕсли;	 
				Возврат неопределено;
			Иначе       
				ДатаОкончания = ?(ДатаОкончания < Стр.Доверенность.СрокДействияДоверенности, Стр.Доверенность.СрокДействияДоверенности, ДатаОкончания); 
			КонецЕсли;
		Иначе
			ДатаОкончания = ?(ДатаОкончания < Стр.Период, НачалоДня(Стр.Период), ДатаОкончания);
		КонецЕсли;
	КонецЦикла;	
    Возврат ?(ДатаОкончания = Дата(1,1,1), неопределено, ДатаОкончания);
КонецФункции	     

Функция ПроверитьКлиентСотрудник(Клиент) Экспорт  
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СоответствиеКлиентовИСотрудниковОрганизации.Сотрудник КАК Сотрудник
	               |ИЗ
	               |	РегистрСведений.ЛБ_СоответствиеКлиентовИСотрудниковОрганизации КАК ЛБ_СоответствиеКлиентовИСотрудниковОрганизации
	               |ГДЕ
	               |	ЛБ_СоответствиеКлиентовИСотрудниковОрганизации.Клиент = &Клиент";   
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Сотрудник;
	КонецЕсли;
	Возврат неопределено;
КонецФункции	       

Функция ПолучитьЛьготнуюСуммуЗаймаСотрудника(Дата, Клиент) Экспорт  
	Если Константы.ЛБ_ЕстьЛьготыСотрудникам.Получить() = Ложь Тогда
		Возврат 0;
	КонецЕсли;
	
	ДопустимыйОстаток = Константы.ЛБ_ОграничениеСуммыЗаймаСотрудники.Получить();
	Если ДопустимыйОстаток = 0 Тогда
		Возврат 0;
	КонецЕсли;	
	
	ОстатокЗайма = 0;
	Запрос = Новый Запрос;        	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Клиент", Клиент); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РасчетыСКлиентамиОстатки.СуммаОстаток КАК СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.ЛБ_РасчетыСКлиентами.Остатки(
	               |			&Дата,
	               |			Клиент = &Клиент
	               |				И ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыРасчетов.ПоОсновномуДолгу)) КАК ЛБ_РасчетыСКлиентамиОстатки"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		ОстатокЗайма = ОстатокЗайма + ?(Выборка.СуммаОстаток = null, 0, Выборка.СуммаОстаток);
    КонецЕсли;
	
	СуммаЗаймаЛьготы = ДопустимыйОстаток - ОстатокЗайма;
	Возврат ?(СуммаЗаймаЛьготы <= 0, 0, СуммаЗаймаЛьготы);
КонецФункции	

Функция АртикулОбъектаЗалога(ЗалоговыйБилет, НомерСтроки) Экспорт   
	Артикул = СокрЛП(ЗалоговыйБилет.Ломбард.НомерЛомбарда) + "/" + СокрЛП(ЗалоговыйБилет.НомерЗалоговогоБилета);  
	Артикул = Артикул + "-" + Строка(НомерСтроки);
	//Отбор = Новый структура;
	//Отбор.Вставить("ОбъектЗалога", ОбъектЗалога);
	//Строки = ЗалоговыйБилет.Товары.НайтиСтроки(Отбор);
	//Если НЕ Строки.Количество() = 0 тогда
	//	НомерСтр = Строки.Получить(0).НомерСтроки;
	//	Артикул = Артикул + "-" + Строка(НомерСтр); 
	//КонецЕсли;	
	Возврат Артикул;
КонецФункции

Функция АртикулОбъектаЗалогаБыстр(НомерЛомбарда, НомерСтроки, НомерЗалоговогоБилета) Экспорт   
	Артикул = СокрЛП(НомерЛомбарда) + "/" + СокрЛП(НомерЗалоговогоБилета);  
	Артикул = Артикул + "-" + Строка(НомерСтроки);
	//Отбор = Новый структура;
	//Отбор.Вставить("ОбъектЗалога", ОбъектЗалога);
	//Строки = ЗалоговыйБилет.Товары.НайтиСтроки(Отбор);
	//Если НЕ Строки.Количество() = 0 тогда
	//	НомерСтр = Строки.Получить(0).НомерСтроки;
	//	Артикул = Артикул + "-" + Строка(НомерСтр); 
	//КонецЕсли;	
	Возврат Артикул;
КонецФункции

Функция ОписаниеОбъектаЗалогаДляПечати(ЗалоговыйБилет, ОбъектЗалога, ВариантПечати = 0) Экспорт  
	СтрокаОписанияИзделия = "";
	ЗапросОЗ = Новый Запрос;       
	ЗапросОЗ.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	ЗапросОЗ.УстановитьПараметр("ОбъектЗалога", ОбъектЗалога);  
	ЗапросОЗ.УстановитьПараметр("Дата", ЗалоговыйБилет.Дата);

	ЗапросОЗ.Текст = "ВЫБРАТЬ
	                 |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	                 |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
	                 |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
	                 |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
	                 |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
	                 |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Клеймо КАК Клеймо,
	                 |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Именник КАК Именник,
	                 |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ДанныеИменника КАК ДанныеИменника,
	                 |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СостояниеИзделия КАК СостояниеИзделия,
	                 |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Дефекты КАК Дефекты,
	                 |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                 |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК Вес,
	                 |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесЧистый
	                 |ИЗ
	                 |	РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
	                 |			&Дата,
	                 |			ЗалоговыйБилет = &ЗалоговыйБилет
	                 |				И ОбъектЗалога = &ОбъектЗалога) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних";
	ТаблицаОЗ = ЗапросОЗ.Выполнить().Выгрузить();
		
	ЗапросОЗ.Текст = "ВЫБРАТЬ
	                 |	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	                 |	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
	                 |	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                 |	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесЧистый,
	                 |	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
	                 |	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценки
	                 |ИЗ
	                 |	РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(
	                 |			&Дата,
	                 |			ЗалоговыйБилет = &ЗалоговыйБилет
	                 |				И ОбъектЗалога = &ОбъектЗалога) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних"; 
	ВыборкаОЗ = ЗапросОЗ.Выполнить().Выбрать();
	Металлы = "";

	//+Мельников 24.06.24 Выгрузим в ТЗ
	ТаблицаВМ = ЗапросОЗ.Выполнить().Выгрузить();
	ГорТаб2 = Символы.Таб + Символы.Таб;
	//-Мельников
	
	ВесЧистый = 0;
	Пока ВыборкаОЗ.Следующий() Цикл
		//+Мельников 24.06.24 Добавил условие. Разделим основной металл от вставки.
		Если НЕ ЗначениеЗаполнено(ВыборкаОЗ.НомерСтрокиТаблицы) Тогда
			Металлы = сокрЛП(ВыборкаОЗ.Проба); //+Мельников 24.06.24 Было: Металлы + ?(Пустаястрока(Металлы), "" , " и ") + сокрЛП(ВыборкаОЗ.Проба);
			ВесЧистый = ВесЧистый + ВыборкаОЗ.ВесЧистый;
		КонецЕсли;
		//-Мельников
		
	КонецЦикла;                                            
	
	Описание = "";
	Для каждого стр Из  ТаблицаОЗ Цикл 
		Если ВариантПечати = 0 Тогда
			Описание = Описание + СокрЛП(Стр.ОбъектЗалога) + " " + СокрЛП(Стр.Артикул) + " " + Металлы + " " + СокрЛП(Стр.Категория) + " " + СокрЛП(Стр.СостояниеИзделия) + " 1 шт. " +
			 СокрЛП(Формат(Стр.Вес, "ЧЦ=10; ЧДЦ=2; ЧН=00")) + " " + СокрЛП(Стр.ЕдиницаИзмерения) +  " мас./об. " + СокрЛП(Формат(ВесЧистый, "ЧЦ=10; ЧДЦ=2; ЧН=00")) + " " + СокрЛП(Стр.ЕдиницаИзмерения) +  " мет./об." +
			 " клеймо " + Нрег(СокрЛП(Стр.Клеймо)) + ?(Стр.Именник = Перечисления.ЛБ_Именник.Да, " им. есть (РФ) " + СокрЛП(Стр.ДанныеИменника) , " без им.") + ?(ПустаяСтрока(Стр.Дефекты), " без деф.", " деф.: " +  СокрЛП(Стр.Дефекты));
		Иначе  
			//+Мельников 24.06.24 Строка изменена по заявке № 1866
			//Описание = Описание + СокрЛП(Стр.ОбъектЗалога) + " " + Металлы + " " + СокрЛП(Стр.Категория) + " " + СокрЛП(Стр.СостояниеИзделия) + " 1 шт. " +
			// СокрЛП(Формат(Стр.Вес, "ЧЦ=10; ЧДЦ=2; ЧН=00")) + " " + СокрЛП(Стр.ЕдиницаИзмерения) +  " мас./об. " + СокрЛП(Формат(ВесЧистый, "ЧЦ=10; ЧДЦ=2; ЧН=00")) + " " + СокрЛП(Стр.ЕдиницаИзмерения) +  " мет./об." +
			// ?(Стр.Именник = Перечисления.ЛБ_Именник.Да, " им. есть (РФ) " + СокрЛП(Стр.ДанныеИменника) ,  " без им.") + ?(ПустаяСтрока(Стр.Дефекты), " без деф.", " деф.: " +  СокрЛП(Стр.Дефекты));
			
			ОписаниеОЗ = ПолучитьОписаниеОъектаЗалога(стр.ОбъектЗалога);
			
			Описание = Описание + СокрЛП(Стр.ОбъектЗалога) + ГорТаб2 + Металлы + ГорТаб2 + СокрЛП(Стр.Категория) + ГорТаб2 + "1 шт." + ГорТаб2 +
			 СокрЛП(Формат(Стр.Вес, "ЧЦ=10; ЧДЦ=2; ЧН=00")) + " " + СокрЛП(Стр.ЕдиницаИзмерения) +  " мас./об. " + ГорТаб2 + СокрЛП(Формат(ВесЧистый, "ЧЦ=10; ЧДЦ=2; ЧН=00")) +
			 " " + СокрЛП(Стр.ЕдиницаИзмерения) +  " мас./мет." + ГорТаб2 + СокрЛП(Стр.СостояниеИзделия) + ГорТаб2 + ?(Стр.Именник = Перечисления.ЛБ_Именник.Да, СокрЛП(Стр.ДанныеИменника), "")+ ГорТаб2 +
			 ОписаниеОЗ + ГорТаб2 + ?(ПустаяСтрока(Стр.Дефекты), "", " деф.: " +  СокрЛП(Стр.Дефекты));
			 //-Мельников
		КонецЕсли;	 
	КонецЦикла;	
	
	ЗапросОЗ.Текст = "ВЫБРАТЬ
	                 |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки КАК ВидВставки,
	                 |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ФормаОгранки КАК ФормаОгранки,
	                 |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидОгранки КАК ВидОгранки,
	                 |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.КачествоОгранки КАК КачествоОгранки,
	                 |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Длина КАК Длина,
	                 |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Ширина КАК Ширина,
	                 |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Высота КАК Высота,
	                 |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Диаметр КАК Диаметр,
	                 |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Диаметр1 КАК Диаметр1,
	                 |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Диаметр2 КАК Диаметр2,
	                 |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                 |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Вес КАК Вес,
	                 |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВесГраммы КАК ВесГраммы,
	                 |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценки,
	                 |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Количество КАК Количество
	                 |ИЗ
	                 |	РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(
	                 |			&Дата,
	                 |			ЗалоговыйБилет = &ЗалоговыйБилет
	                 |				И ОбъектЗалога = &ОбъектЗалога) КАК ЛБ_ВставкиОбъектаЗалогаСрезПоследних";
	ТаблицаВ = ЗапросОЗ.Выполнить().Выгрузить(); 
	
    ОписаниеВ = "";
	Для каждого стр Из  ТаблицаВ Цикл  
		 ОписаниеВ = ОписаниеВ + ?(ПустаяСтрока(ОписаниеВ), "", Символы.ПС);
		 //+Мельников 24.06.24 Изенил вставок
		 //ОписаниеВ = ОписаниеВ  + Строка(Стр.Количество) +  " " + ?(ПустаяСтрока(Стр.ВидВставки.КраткоеНаименование), СокрЛП(Стр.ВидВставки), СокрЛП(Стр.ВидВставки.КраткоеНаименование)) + ?(ЗначениеЗаполнено(Стр.ФормаОгранки), " " + сокрЛП((Стр.ФормаОгранки)), "") +
		 //  ?(ЗначениеЗаполнено(Стр.ВидОгранки), " " + сокрЛП((Стр.ВидОгранки)), "") + ?(ЗначениеЗаполнено(Стр.КачествоОгранки), " " + сокрЛП((Стр.КачествоОгранки)), "");
		 
		 ОписаниеВ = ОписаниеВ  + ?(ПустаяСтрока(Стр.ВидВставки.КраткоеНаименование), СокрЛП(Стр.ВидВставки), СокрЛП(Стр.ВидВставки.КраткоеНаименование)) +
		 //Строка изменена по заявке № 1866 ?(ЗначениеЗаполнено(Стр.ФормаОгранки), " " + сокрЛП((Стр.ФормаОгранки)), "") + 
		 ?(ЗначениеЗаполнено(Стр.ВидОгранки), " " + сокрЛП((Стр.ВидОгранки)), "") +
		 ?(ЗначениеЗаполнено(Стр.КачествоОгранки), " " + сокрЛП((Стр.КачествоОгранки)), "") + ГорТаб2 + Строка(Стр.Количество) + " шт.";
		 
		 ОписаниеРазмера = "";
		 //Строка изменена по заявке № 1866
		 //Если НЕ Стр.Диаметр = 0 Тогда
		 //    ОписаниеРазмера = СокрЛП(Стр.Диаметр) + " мм";
		 //ИначеЕсли НЕ Стр.Диаметр1 = 0 Тогда	   
		 //    ОписаниеРазмера = СокрЛП(Стр.Диаметр1) + ?(НЕ Стр.Диаметр2 = 0, "х" + СокрЛП(Стр.Диаметр2), "") + " мм";
		 //ИначеЕсли НЕ Стр.Длина = 0 Тогда  
		 //    ОписаниеРазмера = СокрЛП(Стр.Длина) + ?(НЕ Стр.Ширина = 0, "х" + СокрЛП(Стр.Ширина), "") + ?(НЕ Стр.Высота = 0, "х" + СокрЛП(Стр.Высота), "") + " мм";
		 //КонецЕсли;
		 //-
		 //ОписаниеВ = ОписаниеВ + ?(ПустаяСтрока(ОписаниеРазмера), "", " " + ОписаниеРазмера) + " " + СокрЛП(Формат(Стр.Вес, "ЧЦ=10; ЧДЦ=2")) + " " + СокрЛП(Стр.ЕдиницаИзмерения); 		 

		 ОписаниеВ = ОписаниеВ + ГорТаб2 + ?(Стр.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("163"),  СокрЛП(Формат(Стр.ВесГраммы, "ЧЦ=10; ЧДЦ=2")), СокрЛП(Формат(Стр.Вес, "ЧЦ=10; ЧДЦ=2"))) +
		 " " + СокрЛП(Стр.ЕдиницаИзмерения) + ГорТаб2 + ?(ПустаяСтрока(ОписаниеРазмера), "", " " + ОписаниеРазмера)+ ГорТаб2 + ?(Стр.СуммаОценки = 0, "0,00", Формат(Стр.СуммаОценки, "ЧЦ=15; ЧДЦ=2; ЧН=00; ЧРГ=' '"));
		 //-Мельников
	Конеццикла;	
	
	//+Мельников 24.06.24 Обработка Вставки металла
	
	//Добавляем вставки металла в строки вставок
	Для Каждого Стр Из ТаблицаВМ Цикл
		Если ЗначениеЗаполнено(Стр.НомерСтрокиТаблицы) Тогда
			ОписаниеВ = ОписаниеВ + ?(ПустаяСтрока(ОписаниеВ), "", Символы.ПС);
			ОписаниеВ = ОписаниеВ + Стр.Проба + ГорТаб2 + Стр.ВесЧистый + " " + Стр.ЕдиницаИзмерения + ГорТаб2 + Формат(Стр.СуммаОценки, "ЧЦ=15; ЧДЦ=2; ЧН=00; ЧРГ=' '");
		КонецЕсли;
	КонецЦикла;
	//-Мельников
		
	СтруктураВ = Новый Структура;
	СтруктураВ.Вставить("Описание", Описание);  
	СтруктураВ.Вставить("ОписаниеВ", ОписаниеВ);    
	
	Возврат СтруктураВ;
КонецФункции	

Функция ПолучитьОписаниеОъектаЗалога(ОбъектЗалога)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОперацияПоЗалогуТовары.Описание КАК Описание
		|ИЗ
		|	Документ.ЛБ_ОперацияПоЗалогу.Товары КАК ЛБ_ОперацияПоЗалогуТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛБ_ОперацияПоЗалогу КАК ЛБ_ОперацияПоЗалогу
		|		ПО ЛБ_ОперацияПоЗалогуТовары.Ссылка = ЛБ_ОперацияПоЗалогу.Ссылка
		|ГДЕ
		|	ЛБ_ОперацияПоЗалогу.Проведен
		|	И НЕ ЛБ_ОперацияПоЗалогу.ПометкаУдаления
		|	И ЛБ_ОперацияПоЗалогуТовары.ОбъектЗалога = &ОбъектЗалога";
	
	Запрос.УстановитьПараметр("ОбъектЗалога", ОбъектЗалога);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Описание;
	Иначе
		Возврат "";
	КонецЕсли;;
	
КонецФункции

// проверка паспорта - н
Функция ПридуматьТокен()
	Токен = "";         
	НаборСимв = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890";
	Для Цкл = 1 по 48 Цикл                               
		ГСЧ = Новый ГенераторСлучайныхЧисел(); 
		СлучСимвол = Сред(НаборСимв,ГСЧ.СлучайноеЧисло(1,СтрДлина(НаборСимв)),1);
		Токен = Токен + СлучСимвол;
	КонецЦикла;
	Возврат Токен;
КонецФункции
 
Функция фПрочитатьJSON(ТекстJSON) Экспорт
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(ТекстJSON);
	Структура = ЗаполнитьСтруктуруИзОтветаJSON(Чтение); 
	Чтение.Закрыть();
	Возврат Структура;
КонецФункции
 
Функция ПроверитьПаспорт(Парам) Экспорт 
	Серия = Парам.Серия;  
	Номер = Парам.Номер;
	URL = "rc-data.ru"; // URL-адрес веб-сервера, на который отправляется запрос
	    //PostData = "pssprt/get_info?series=" + СокрЛП(Серия) + "&number=" + СокрЛП(Номер) + "&token=" + ПридуматьТокен(); // Данные, которые нужно отправить в запросе
	PostData = "/pssprt/get_info";
	ПараметрыЗапроса = "series=" + СокрЛП(Серия) + "&number=" + СокрЛП(Номер) + "&token=" + ПридуматьТокен();
	 
	Соединение = Новый HTTPСоединение(URL,,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	 
    Заголовки = Новый Соответствие;                    
    Заголовки.Вставить("User-Agent", "Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.0)");
    Заголовки.Вставить("Content-type", "application/x-www-form-urlencoded");
 
    Запрос = Новый HTTPЗапрос(PostData, Заголовки);
	Запрос.УстановитьТелоИзСтроки(ПараметрыЗапроса);
	    //Запрос.УстановитьТелоИзСтроки(КодПриглашения);
	 
    Результат = Соединение.ОтправитьДляОбработки(Запрос);
	
	СтруктураВозврата = Новый Структура;
	
	Если Результат.КодСостояния<>200 тогда
		СтруктураВозврата.Вставить("Проверка", ложь);
	    СтруктураВозврата.Вставить("Сообщение", "Сервис проверки паспортов не работает, либо ошибки в запросе");
	Иначе
	    Рез = фПрочитатьJSON(Результат.ПолучитьТелоКакСтроку());
		Если НЕ Рез.Свойство("status") Тогда 
			СтруктураВозврата.Вставить("Проверка", ложь);
	        СтруктураВозврата.Вставить("Сообщение", "Сервис проверки паспортов не работает, либо ошибки в запросе");
		   Возврат "Ошибки в запросе";
		ИначеЕсли Рез.status = 1 Тогда
		   Возврат "Паспорт "+Серия+" "+Номер+" действительный";
		ИначеЕсли Рез.status = 0 Тогда
		   Возврат "Паспорт "+Серия+" "+Номер+" не действительный";
		Иначе
		   Возврат "Не могу разобрать ответ:" + Результат.ПолучитьТелоКакСтроку();
		КонецЕсли;
	КонецЕсли;   
	
	Возврат СтруктураВозврата;
КонецФункции
 
Функция ЗаполнитьСтруктуруИзОтветаJSON(Знач Чтение) Экспорт
	Результат = Новый Структура;
	ПоследнееИмяРеквизита = Неопределено;
	Пока Чтение.Прочитать() Цикл
		Тип = Чтение.ТипТекущегоЗначения;
		Если Тип = ТипЗначенияJSON.НачалоОбъекта И ПоследнееИмяРеквизита<>Неопределено Тогда 
		    Результат[ПоследнееИмяРеквизита] = ЗаполнитьСтруктуруИзОтветаJSON(Чтение);
		ИначеЕсли Тип = ТипЗначенияJSON.КонецОбъекта Тогда 
		    Возврат Результат;
		    ПоследнееИмяРеквизита = Неопределено;
		ИначеЕсли Тип = ТипЗначенияJSON.ИмяСвойства Тогда 
			Результат.Вставить(Чтение.ТекущееЗначение, Неопределено);
			ПоследнееИмяРеквизита = Чтение.ТекущееЗначение;
		ИначеЕсли Тип = ТипЗначенияJSON.Булево или Тип = ТипЗначенияJSON.Строка
		  или Тип = ТипЗначенияJSON.Число или Тип = ТипЗначенияJSON.Null Тогда 
		    Результат[ПоследнееИмяРеквизита] = Чтение.ТекущееЗначение;
		КонецЕсли;
	КонецЦикла;  
	Возврат Результат;
КонецФункции 
// проверка паспорта - к 

Функция ЗаполнитьСписокКлиентовДляПроверкиПоПеречням(Дата) Экспорт 
	СписокКлиентов = Новый СписокЗначений;
	
	Запрос = Новый Запрос;                                
	Запрос.УстановитьПараметр("Дата", КонецДня(Дата));                  
	СписокСтатусов = Новый СписокЗначений;
	СписокСтатусов.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт);
	СписокСтатусов.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Реализован);
	Запрос.УстановитьПараметр("СписокСтатусов", СписокСтатусов);
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
    Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
                   |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.Залогодатель КАК Клиент
                   |ИЗ
                   |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&Дата, НЕ СтатусЗалоговогоБилета В (&СписокСтатусов)) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних
                   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних
                   |		ПО ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.Залогодатель = ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Залогодатель
                   |ГДЕ
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаСмерти = &ПустаяДата"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл   
		СписокКлиентов.Добавить(Выборка.Клиент);
	Конеццикла;	
	
	Запрос.УстановитьПараметр("СрокДействия", НачалоДня(Дата)); 
	Запрос.УстановитьПараметр("СтатусДоверенности", Перечисления.ЛБ_СтатусыДоверенностей.ДоверенностьОформлена);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_Доверенности.Доверенность.ПредставительКлиента КАК ПредставительКлиента
	               |ИЗ
	               |	РегистрСведений.ЛБ_Доверенности КАК ЛБ_Доверенности
	               |ГДЕ
	               |	ЛБ_Доверенности.СтатусДоверенности = &СтатусДоверенности
	               |	И (ЛБ_Доверенности.Доверенность.СрокДействияДоверенности >= &СрокДействия
	               |			ИЛИ ЛБ_Доверенности.Доверенность.СрокДействияДоверенности = &ПустаяДата)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл  
		Если СписокКлиентов.НайтиПоЗначению(Выборка.ПредставительКлиента) = неопределено Тогда
			СписокКлиентов.Добавить(Выборка.ПредставительКлиента);
		КонецЕсли;	
	Конеццикла;	
	
	Запрос.УстановитьПараметр("Клиенты", СписокКлиентов);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЛБ_БенефициарныеВладельцыСрезПоследних.Бенефициар КАК Бенефициар
	               |ИЗ
	               |	РегистрСведений.ЛБ_БенефициарныеВладельцы.СрезПоследних(&Дата, Залогодатель В (&Клиенты)) КАК ЛБ_БенефициарныеВладельцыСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл  
		Если СписокКлиентов.НайтиПоЗначению(Выборка.Бенефициар) = неопределено Тогда
			СписокКлиентов.Добавить(Выборка.Бенефициар);
		КонецЕсли;	
	Конеццикла;  
	
	СписокКлиентов.СортироватьПоЗначению();
	Возврат СписокКлиентов;
КонецФункции

Функция ЗаполнитьСписокКлиентовДляГлобальнойПроверкиПоПеречням(Дата1, Дата2) Экспорт 
	СписокКлиентов = ЗаполнитьСписокКлиентовДляПроверкиПоПеречням(Дата2);
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата1", НачалоДня(Дата1));
	Запрос.УстановитьПараметр("Дата2", КонецДня(Дата2));   
	Запрос.УстановитьПараметр("Клиенты", СписокКлиентов);   
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОперацияПоЗалогу.Залогодатель КАК Клиент
	               |ИЗ
	               |	Документ.ЛБ_ОперацияПоЗалогу КАК ЛБ_ОперацияПоЗалогу
	               |ГДЕ
	               |	ЛБ_ОперацияПоЗалогу.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов)
	               |	И ЛБ_ОперацияПоЗалогу.Дата МЕЖДУ &Дата1 И &Дата2
	               |	И ЛБ_ОперацияПоЗалогу.Залогодатель <> ЛБ_ОперацияПоЗалогу.ПредыдущаяОперация.Залогодатель
	               |	И ЛБ_ОперацияПоЗалогу.Проведен = ИСТИНА
	               |	И НЕ ЛБ_ОперацияПоЗалогу.Залогодатель В (&Клиенты)"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл  
		Если СписокКлиентов.НайтиПоЗначению(Выборка.Клиент) = неопределено Тогда
			СписокКлиентов.Добавить(Выборка.Клиент);
		КонецЕсли;	
	Конеццикла;  
	
	СписокКлиентов.СортироватьПоЗначению();
	Возврат СписокКлиентов;
КонецФункции	

Функция ПроверитьОсновныеДокументыЗалогодателя(Клиент, Дата = неопределено) Экспорт 
	Если Дата = неопределено Тогда
		ДатаПроверки = ТекущаяДата();
	Иначе
		ДатаПроверки = Дата;
	КонецЕсли;
	
	Гражданство = Справочники.СтраныМира.Россия; 
	ДатаРождения = Дата(1,1,1);
	
	Запрос = Новый Запрос;    
	Запрос.УстановитьПараметр("Дата", ДатаПроверки); 
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения
	               |ИЗ
	               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Клиент) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Гражданство = Выборка.Гражданство;
		ДатаРождения = Выборка.ДатаРождения;
	КонецЕсли;   
	
	СтруктураВозврата = Новый Структура;   
	СтруктураВозврата.Вставить("ОшибкаДУЛ", "");
	СтруктураВозврата.Вставить("ОшибкаДоп", "");
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ОсновнойДУЛ КАК ОсновнойДУЛ,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ОсновнойДоп КАК ОсновнойДоп,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДатаВыдачи,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК СрокДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК Серия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК Номер,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя КАК ДокументКлиента
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&Дата, ДокументЗалогодателя.Владелец = &Клиент) КАК ЛБ_ДокументыЗалогодателейСрезПоследних
	               |ГДЕ
	               |	(ЛБ_ДокументыЗалогодателейСрезПоследних.ОсновнойДУЛ = ИСТИНА
	               |			ИЛИ ЛБ_ДокументыЗалогодателейСрезПоследних.ОсновнойДоп = ИСТИНА)
	               |	И ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНеДействителен = ЛОЖЬ";
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	
	//проверка осн. документа
	Отбор = Новый Структура;
	Отбор.Вставить("ОсновнойДУЛ", Истина);
	Строки = ТаблицаДокументов.НайтиСтроки(Отбор);
	Если Строки.Количество() = 0 Тогда 
		СтруктураВозврата.Вставить("ОшибкаДУЛ", "Не найден основной ДУЛ.");
	Иначе   
		Стр = Строки.Получить(0);
		Если НЕ Стр.Гражданство = Гражданство Тогда
			СтруктураВозврата.Вставить("ОшибкаДУЛ", "Гражданство основного ДУЛ не соответствует текущему гражданству.");
		Иначе 
			Если Стр.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ Тогда
				Парам = Новый Структура("Серия, Номер", СокрЛП(Стр.Серия), СокрЛП(Стр.Номер));
				Если ЛБ_ОбменLX.ПаспортНедействителен(Парам) Тогда 
					СтруктураВозврата.Вставить("ОшибкаДУЛ", "Основной ДУЛ найден в списке недействительных паспортов.");
				ИначеЕсли НЕ ЛБ_ОбщийМодуль.ПроверитьПаспортРФДействует(ДатаРождения, Стр.ДатаВыдачи) Тогда			
					СтруктураВозврата.Вставить("ОшибкаДУЛ", "Основной ДУЛ не действителен.");
				    ВсеОК = ложь;
				КонецЕсли;	
			ИначеЕсли НЕ Стр.СрокДействия = Дата(1,1,1) Тогда
				Если Стр.СрокДействия < НачалоДня(ДатаПроверки) Тогда 
					СтруктураВозврата.Вставить("ОшибкаДУЛ", "Основной ДУЛ просрочен.");
				КонецЕсли;	
			ИначеЕсли Стр.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ВидНаЖительство Тогда		 
		        ТекстСообщения1 = ЛБ_ОбщийМодуль.ПроверитьСменаВидНаЖительствоВозраст(ДатаРождения, стр.ДатаВыдачи); 
				Если НЕ Пустаястрока(ТекстСообщения1) тогда  
				    СтруктураВозврата.Вставить("ОшибкаДУЛ", ТекстСообщения1);
				Иначе	  						   
				    ТекстСообщения2 = ЛБ_ОбщийМодуль.ПроверитьСменаВидНаЖительствоКонтактнаяИнформация(Клиент, Стр.ДатаВыдачи, ДатаПроверки); 
					Если НЕ Пустаястрока(ТекстСообщения2) тогда 
						СтруктураВозврата.Вставить("ОшибкаДУЛ", ТекстСообщения2);
					КонецЕсли;	
				КонецЕсли;	 
			КонецЕсли;   
		КонецЕсли;	
	КонецЕсли;	  
	
	Если НЕ Гражданство = Справочники.СтраныМира.Россия Тогда 
		Отбор = Новый Структура;
		Отбор.Вставить("ОсновнойДоп", Истина);
		Строки = ТаблицаДокументов.НайтиСтроки(Отбор);
		
		Строки = ТаблицаДокументов.НайтиСтроки(Отбор);
		Если Строки.Количество() = 0 Тогда 
			СтруктураВозврата.Вставить("ОшибкаДоп", "Не найден основной документ на право пребывания в РФ.");
		Иначе   
			Стр = Строки.Получить(0);
			Если НЕ Стр.Гражданство = Гражданство Тогда
				СтруктураВозврата.Вставить("ОшибкаДоп", "Гражданство основного документа на право пребывания в РФ не соответствует текущему гражданству.");
			Иначе 
				Если НЕ Стр.СрокДействия = Дата(1,1,1) Тогда
					Если Стр.СрокДействия < НачалоДня(ДатаПроверки) Тогда 
						СтруктураВозврата.Вставить("ОшибкаДоп", "Основной документ на право пребывания в РФ просрочен.");
					КонецЕсли;	
				ИначеЕсли Стр.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ВидНаЖительство Тогда		 
			        ТекстСообщения1 = ЛБ_ОбщийМодуль.ПроверитьСменаВидНаЖительствоВозраст(ДатаРождения, стр.ДатаВыдачи); 
					Если НЕ Пустаястрока(ТекстСообщения1) тогда  
					    СтруктураВозврата.Вставить("ОшибкаДоп", ТекстСообщения1);
					Иначе	  						   
					    ТекстСообщения2 = ЛБ_ОбщийМодуль.ПроверитьСменаВидНаЖительствоКонтактнаяИнформация(Клиент, Стр.ДатаВыдачи, ДатаПроверки); 
						Если НЕ Пустаястрока(ТекстСообщения2) тогда 
							СтруктураВозврата.Вставить("ОшибкаДоп", ТекстСообщения2);
						КонецЕсли;	
					КонецЕсли;	 
				КонецЕсли;   
			КонецЕсли;	
		КонецЕсли;	  
	КонецЕсли;	      
	
    Возврат СтруктураВозврата;
КонецФункции	

Функция ПроверитьИзделияЗБВЛомбарде(Дата, ЗалоговыйБилет, Ломбард, ЭтоПереоформление = Истина) Экспорт 
	Сообщение = "";

	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Дата", Дата); 
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_ОбъектыЗалогаОстатки.Ломбард КАК Ломбард
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(&Дата, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_ОбъектыЗалогаОстатки";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
		
	ВнеЛомбарда = "";
	Ном = 0;
	Для каждого Стр из ЗалоговыйБилет.Товары Цикл
		Если НЕ Стр.Переоформить Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый структура;
		Отбор.Вставить("ОбъектЗалога", Стр.ОбъектЗалога);  
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
		Если НЕ Строки.Количество() = 0 Тогда   
			СтрОст = строки.Получить(0);
			Если НЕ Ломбард = СтрОст.Ломбард Тогда   
				Ном = ном + 1;
				ВнеЛомбарда = ВнеЛомбарда + ?(ПустаяСтрока(ВнеЛомбарда), "", ", ") + сокрЛП(Стр.ОбъектЗалога);
			КонецЕсли;	
		Иначе  
			Ном = ном + 1;
			ВнеЛомбарда = ВнеЛомбарда + ?(ПустаяСтрока(ВнеЛомбарда), "", ", ") + сокрЛП(Стр.ОбъектЗалога);
		КонецЕсли;	
	КонецЦикла;	 
	
	Если НЕ ПустаяСтрока(ВнеЛомбарда) Тогда  
		Сообщение = Сообщение + ?(Ном > 1, "Изделия ", "Изделие ") + ВнеЛомбарда + ?(Ном > 1, " не найдены в ", " не найдено в ") + СокрЛП(Ломбард);
	КонецЕсли;	
		
	Возврат Сообщение;
КонецФункции

//+Мельников 25.04.24 В функцию добавил два парамтра "Отмена" и "ОперацияДоОтменяемой".
Функция ПолучитьСостояниеОбъектовЗалогаЗалоговогоБилета(Дата, ЗалоговыйБилет, ОбъектЗалога, Отмена = Ложь, ОперацияДоОтменяемой = Неопределено) Экспорт
	Запрос = Новый Запрос;   
	Запрос.УстановитьПараметр("Дата", Дата-1); 
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.УстановитьПараметр("ОбъектЗалога", ОбъектЗалога);
	//+Мельников 25.04.24 Закомментировал запрос, он идет ниже при отработке условия
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	//               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
	//               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценки,
	//               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
	//               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаОплаты КАК СуммаОплаты,
	//               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаДолгаЗайма КАК СуммаДолгаЗайма
	//               |ИЗ
	//               |	РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(&Дата, ЗалоговыйБилет = &ЗалоговыйБилет И ОбъектЗалога = &ОбъектЗалога) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних";

	//+Мельников 25.04.24 Добавил запрос для поиска с условием "Регистратор".
	Если НЕ Отмена И ОперацияДоОтменяемой = Неопределено Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
		               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаОценкиНачальная КАК СуммаОценкиНач,
		               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценки,
		               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
		               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаОплаты КАК СуммаОплаты,
		               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаДолгаЗайма КАК СуммаДолгаЗайма,
		               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.Комментарий КАК Комментарий
		               |ИЗ
		               |	РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(
		               |			&Дата,
		               |			ЗалоговыйБилет = &ЗалоговыйБилет
		               |				И ОбъектЗалога = &ОбъектЗалога) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.Период УБЫВ";
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_СостояниеОбъектаЗалога.ОбъектЗалога КАК ОбъектЗалога,
		               |	ЛБ_СостояниеОбъектаЗалога.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
		               |	ЛБ_СостояниеОбъектаЗалога.СуммаОценки КАК СуммаОценки,
		               |	ЛБ_СостояниеОбъектаЗалога.СуммаОценкиНачальная КАК СуммаОценкиНач,
		               |	ЛБ_СостояниеОбъектаЗалога.СуммаЗайма КАК СуммаЗайма,
		               |	ЛБ_СостояниеОбъектаЗалога.СуммаОплаты КАК СуммаОплаты,
		               |	ЛБ_СостояниеОбъектаЗалога.СуммаДолгаЗайма КАК СуммаДолгаЗайма,
		               |	ЛБ_СостояниеОбъектаЗалога.Комментарий КАК Комментарий
		               |ИЗ
		               |	РегистрСведений.ЛБ_СостояниеОбъектаЗалога КАК ЛБ_СостояниеОбъектаЗалога
		               |ГДЕ
		               |	ЛБ_СостояниеОбъектаЗалога.ЗалоговыйБилет = &ЗалоговыйБилет
		               |	И ЛБ_СостояниеОбъектаЗалога.ОбъектЗалога = &ОбъектЗалога
		               |	И ЛБ_СостояниеОбъектаЗалога.Регистратор = &Регистратор";
		
		Запрос.УстановитьПараметр("Регистратор", ОперацияДоОтменяемой);
	КонецЕсли;
	//-Мельников

	Выборка = Запрос.Выполнить().Выбрать();
	Если  Выборка.Следующий() Тогда 
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("ОбъектЗалога", Выборка.ОбъектЗалога); 
		СтруктураВозврата.Вставить("СтатусОбъектаЗалога", Выборка.СтатусОбъектаЗалога);
		СтруктураВозврата.Вставить("СуммаОценки", Выборка.СуммаОценки);     
		СтруктураВозврата.Вставить("СуммаОценкиНач", Выборка.СуммаОценкиНач);
		СтруктураВозврата.Вставить("СуммаЗайма", Выборка.СуммаЗайма);
		СтруктураВозврата.Вставить("СуммаОплаты", Выборка.СуммаОплаты);  
		СтруктураВозврата.Вставить("СуммаДолгаЗайма", Выборка.СуммаДолгаЗайма);  
		СтруктураВозврата.Вставить("Комментарий", Выборка.Комментарий);

        Возврат СтруктураВозврата;
	КонецЕсли;
	
	Возврат неопределено
КонецФункции	

Функция ПолучитьСтатусНакладнойНаОтгрузку(Дата, НакладнаяНаОтгрузку) Экспорт
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", Дата);  
	Запрос.УстановитьПараметр("НакладнаяНаОтгрузку", НакладнаяНаОтгрузку);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.СтатусНакладной КАК СтатусНакладной
	               |ИЗ
	               |	РегистрСведений.ЛБ_СтатусыНакладнойНаОтгрузку.СрезПоследних(&Дата, НакладнаяНаОтгрузку = &НакладнаяНаОтгрузку) КАК ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда 
		Возврат Выборка.СтатусНакладной;
	КонецЕсли;
	Возврат Перечисления.ЛБ_СтатусыНакладнойНаОтгрузку.Проект;
КонецФункции	

Функция  ПолучитьНовыйНомерНакладнойНаОтгрузку(Дата, Организация, Ломбард) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Год", Год(Дата)); 
	Запрос.УстановитьПараметр("Организация", Организация); 
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_НакладнаяНаОтгрузку.НомерНакладной КАК НомерНакладной
	               |ИЗ
	               |	Документ.ЛБ_НакладнаяНаОтгрузку КАК ЛБ_НакладнаяНаОтгрузку
	               |ГДЕ
	               |	ГОД(ЛБ_НакладнаяНаОтгрузку.Дата) = &Год
	               |	И ЛБ_НакладнаяНаОтгрузку.Организация = &Организация
	               |	И ЛБ_НакладнаяНаОтгрузку.Ломбард = &Ломбард
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерНакладной УБЫВ";  
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НомерНакладной + 1;
	КонецЕсли;
	Возврат 1;
КонецФункции	 

Функция  ПолучитьНовыйНомерПеремещения(Дата, Организация, Ломбард, Ссылка = неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Год", Год(Дата)); 
	Запрос.УстановитьПараметр("Организация", Организация); 
	Запрос.УстановитьПараметр("Ломбард", Ломбард); 
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПеремещениеОбъектовЗалога.НомерПеремещения КАК НомерПеремещения
	               |ИЗ
	               |	Документ.ЛБ_ПеремещениеОбъектовЗалога КАК ЛБ_ПеремещениеОбъектовЗалога
	               |ГДЕ
	               |	ГОД(ЛБ_ПеремещениеОбъектовЗалога.Дата) = &Год
	               |	И ЛБ_ПеремещениеОбъектовЗалога.Организация = &Организация
	               |	И ЛБ_ПеремещениеОбъектовЗалога.ЛомбардОткуда = &Ломбард";
	Если НЕ Ссылка = неопределено Тогда  
		Запрос.Текст = Запрос.Текст + "
	               |	И ЛБ_ПеремещениеОбъектовЗалога.Ссылка <> &Ссылка";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерПеремещения УБЫВ";  
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НомерПеремещения + 1;
	КонецЕсли;
	Возврат 1;
КонецФункции	

Функция  ПолучитьНовыйНомерПоступления(Дата, Организация, Ломбард, Ссылка = неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Год", Год(Дата)); 
	Запрос.УстановитьПараметр("Организация", Организация); 
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОприходованиеОбъектовЗалога.НомерПоступления КАК НомерПоступления
	               |ИЗ
	               |	Документ.ЛБ_ОприходованиеОбъектовЗалога КАК ЛБ_ОприходованиеОбъектовЗалога
	               |ГДЕ
	               |	ГОД(ЛБ_ОприходованиеОбъектовЗалога.Дата) = &Год
	               |	И ЛБ_ОприходованиеОбъектовЗалога.Организация = &Организация
	               |	И ЛБ_ОприходованиеОбъектовЗалога.ЛомбардКуда = &Ломбард";
	Если НЕ Ссылка = неопределено Тогда  
		Запрос.Текст = Запрос.Текст + "
	               |	И ЛБ_ОприходованиеОбъектовЗалога.Ссылка <> &Ссылка";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерПоступления УБЫВ";  
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НомерПоступления + 1;
	КонецЕсли;
	Возврат 1;
КонецФункции	

Функция  ПолучитьНовыйНомерНазначенияГруппы(Дата, Организация, Ломбард, Ссылка = неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Год", Год(Дата)); 
	Запрос.УстановитьПараметр("Организация", Организация); 
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_НазначениеГруппыОбъектамЗалога.НомерНазначенияГруппы КАК НомерНазначенияГруппы
	               |ИЗ
	               |	Документ.ЛБ_НазначениеГруппыОбъектамЗалога КАК ЛБ_НазначениеГруппыОбъектамЗалога
	               |ГДЕ
	               |	ГОД(ЛБ_НазначениеГруппыОбъектамЗалога.Дата) = &Год
	               |	И ЛБ_НазначениеГруппыОбъектамЗалога.Организация = &Организация
	               |	И ЛБ_НазначениеГруппыОбъектамЗалога.Ломбард = &Ломбард";
	Если НЕ Ссылка = неопределено Тогда  
		Запрос.Текст = Запрос.Текст + "
	               |	И ЛБ_НазначениеГруппыОбъектамЗалога.Ссылка <> &Ссылка";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерНазначенияГруппы УБЫВ";  
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НомерНазначенияГруппы + 1;
	КонецЕсли;
	Возврат 1;
КонецФункции	

Функция  ПолучитьНовыйНомерУстановкиЦены(Дата, Организация, Ломбард, Ссылка = неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Год", Год(Дата)); 
	Запрос.УстановитьПараметр("Организация", Организация); 
	Запрос.УстановитьПараметр("Ломбард", Ломбард); 
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_УстановкаЦены.НомерУстановкиЦены КАК НомерУстановкиЦены
	               |ИЗ
	               |	Документ.ЛБ_УстановкаЦены КАК ЛБ_УстановкаЦены
	               |ГДЕ
	               |	ГОД(ЛБ_УстановкаЦены.Дата) = &Год
	               |	И ЛБ_УстановкаЦены.Организация = &Организация
	               |	И ЛБ_УстановкаЦены.Ломбард = &Ломбард";
	Если НЕ Ссылка = неопределено Тогда  
		Запрос.Текст = Запрос.Текст + "
	               |	И ЛБ_УстановкаЦены.Ссылка <> &Ссылка";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерУстановкиЦены УБЫВ";  
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НомерУстановкиЦены + 1;
	КонецЕсли;
	Возврат 1;
КонецФункции	

Функция  ПолучитьНовыйНомерРеализации(Дата, Организация, Ломбард, Ссылка = неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Год", Год(Дата)); 
	Запрос.УстановитьПараметр("Организация", Организация); 
	Запрос.УстановитьПараметр("Ломбард", Ломбард); 
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_Реализация.НомерРеализации КАК НомерРеализации
	               |ИЗ
	               |	Документ.ЛБ_Реализация КАК ЛБ_Реализация
	               |ГДЕ
	               |	ГОД(ЛБ_Реализация.Дата) = &Год
	               |	И ЛБ_Реализация.Организация = &Организация
	               |	И ЛБ_Реализация.Ломбард = &Ломбард";
	Если НЕ Ссылка = неопределено Тогда  
		Запрос.Текст = Запрос.Текст + "
	               |	И ЛБ_Реализация.Ссылка <> &Ссылка";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерРеализации УБЫВ";  
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НомерРеализации + 1;
	КонецЕсли;
	Возврат 1;
КонецФункции	

Функция ЕстьНакладныеНаОтгрузу(ДокументНастроек) Экспорт
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("ДокументНастроек", ДокументНастроек);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЛБ_ОборотыПоОперациямЗайма.Период КАК Период
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОборотыПоОперациямЗайма КАК ЛБ_ОборотыПоОперациямЗайма
	               |ГДЕ
	               |	ЛБ_ОборотыПоОперациямЗайма.НакладнаяНаОтгрузку.ДокументНастроек = &ДокументНастроек
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		Возврат ИСТИНА; 
	КонецЕсли;
	Возврат ЛОЖЬ;
КонецФункции	

Функция ПолучитьНовыйНомерПКО(Дата, Организация, Ломбард) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Год", Год(Дата)); 
	Запрос.УстановитьПараметр("Организация", Организация); 
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПриходныйКассовыйОрдер.НомерПКО КАК НомерПКО
	               |ИЗ
	               |	Документ.ЛБ_ПриходныйКассовыйОрдер КАК ЛБ_ПриходныйКассовыйОрдер
	               |ГДЕ
	               |	ГОД(ЛБ_ПриходныйКассовыйОрдер.Дата) = &Год
	               |	И ЛБ_ПриходныйКассовыйОрдер.Организация = &Организация
	               |	И ЛБ_ПриходныйКассовыйОрдер.Ломбард = &Ломбард
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ПриходныйКассовыйОрдер.НомерПКО УБЫВ";  
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НомерПКО + 1;
	КонецЕсли;
	Возврат 1;
КонецФункции	

Функция ПолучитьНовыйНомерРКО(Дата, Организация, Ломбард) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Год", Год(Дата)); 
	Запрос.УстановитьПараметр("Организация", Организация); 
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РасходныйКассовыйОрдер.НомерРКО КАК НомерРКО
	               |ИЗ
	               |	Документ.ЛБ_РасходныйКассовыйОрдер КАК ЛБ_РасходныйКассовыйОрдер
	               |ГДЕ
	               |	ГОД(ЛБ_РасходныйКассовыйОрдер.Дата) = &Год
	               |	И ЛБ_РасходныйКассовыйОрдер.Организация = &Организация
	               |	И ЛБ_РасходныйКассовыйОрдер.Ломбард = &Ломбард
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_РасходныйКассовыйОрдер.НомерРКО УБЫВ";  
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НомерРКО + 1;
	КонецЕсли;
	Возврат 1;
КонецФункции	

Функция ПолучитьСтатусОбъектаЗалогаВНакладнойНаОтгрузку(Дата, НакладнаяНаОтгрузку, ЗалоговыйБилет, ОбъектЗалога) Экспорт
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", Дата);  
	Запрос.УстановитьПараметр("НакладнаяНаОтгрузку", НакладнаяНаОтгрузку); 
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.УстановитьПараметр("ОбъектЗалога", ОбъектЗалога);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус КАК Статус
	               |ИЗ
	               |	РегистрСведений.ЛБ_СтатусыОбъектовЗалогаВНакладной.СрезПоследних(
	               |			&Дата,
	               |			НакладнаяНаОтгрузку = &НакладнаяНаОтгрузку
	               |				И ЗалоговыйБилет = &ЗалоговыйБилет
	               |				И ОбъектЗалога = &ОбъектЗалога) КАК ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда 
		Возврат Выборка.Статус;
	КонецЕсли;
	Возврат Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.ПустаяСсылка();
КонецФункции

Функция ПолучитьСтатусОбъектаЗалога(Дата, ЗалоговыйБилет, ОбъектЗалога) Экспорт
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", Дата);  
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.УстановитьПараметр("ОбъектЗалога", ОбъектЗалога);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус КАК Статус
	               |ИЗ
	               |	РегистрСведений.ЛБ_СтатусыОбъектовЗалогаВНакладной.СрезПоследних(
	               |			&Дата,
	               |			ЗалоговыйБилет = &ЗалоговыйБилет
	               |				И ОбъектЗалога = &ОбъектЗалога) КАК ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда 
		Возврат Выборка.Статус;
	КонецЕсли;
	Возврат Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.ПустаяСсылка();
КонецФункции	


Функция ПолучитьНакладнуюНаОтгрузкуЗалогоговогоБилета(Дата, ЗалоговыйБилет) Экспорт
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", Дата);   
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);  
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОборотыПоОперациямЗайма.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОборотыПоОперациямЗайма КАК ЛБ_ОборотыПоОперациямЗайма
	               |ГДЕ
	               |	ЛБ_ОборотыПоОперациямЗайма.Период < &Дата
	               |	И ЛБ_ОборотыПоОперациямЗайма.ЗалоговыйБилет = &ЗалоговыйБилет
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ОборотыПоОперациямЗайма.Период УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		Возврат Выборка.НакладнаяНаОтгрузку;
	КонецЕсли;	                            
	Возврат неопределено;
КонецФункции

Функция ПолучитьСтатусНакладнойПоЗБ(Дата, ЗалоговыйБилет) Экспорт  
	СтатусЗБ = ПолучитьСтатусЗалоговогоБилета(Дата, ЗалоговыйБилет);
	Если СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ВключенВНакладную ИЛИ
		 СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОбъявленТорг Тогда 
		НакладнаяНаОтгрузку = ПолучитьНакладнуюНаОтгрузкуЗалогоговогоБилета(Дата, ЗалоговыйБилет);
		Если НЕ НакладнаяНаОтгрузку = неопределено Тогда    
			СтатусНакладной = ПолучитьСтатусНакладнойНаОтгрузку(Дата, НакладнаяНаОтгрузку);
			Если СтатусНакладной = Перечисления.ЛБ_СтатусыНакладнойНаОтгрузку.Проект Тогда
				Возврат неопределено;
			Иначе
				СтруктураВ = Новый структура;     
				СтруктураВ.Вставить("НакладнаяНаОтгрузку", НакладнаяНаОтгрузку);
				СтруктураВ.Вставить("СтатусНакладной", СтатусНакладной);
			    Возврат СтруктураВ;
			КонецЕсли;	
		Иначе
			Возврат неопределено;
		КонецЕсли;	
	Иначе  
		Возврат неопределено; 
	КонецЕсли;	 
КонецФункции	

//+МАН 02.12.24 Добавил новую Функцию на основании оригинальной ПолучитьСтатусНакладнойПоЗБ т.к. она не передавала все условия. Заявка 2904
Функция ПолучитьСтатусНакладнойПоЗБИзм(Дата, ЗалоговыйБилет) Экспорт  
	СтатусЗБ = ПолучитьСтатусЗалоговогоБилета(Дата, ЗалоговыйБилет);
	//Если СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ВключенВНакладную ИЛИ
	//	 СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОбъявленТорг Тогда 
	Если ЗначениеЗаполнено(СтатусЗБ) Тогда
		НакладнаяНаОтгрузку = ПолучитьНакладнуюНаОтгрузкуЗалогоговогоБилета(Дата, ЗалоговыйБилет);
		Если НЕ НакладнаяНаОтгрузку = неопределено Тогда    
			СтатусНакладной = ПолучитьСтатусНакладнойНаОтгрузку(Дата, НакладнаяНаОтгрузку);
			Если СтатусНакладной = Перечисления.ЛБ_СтатусыНакладнойНаОтгрузку.Проект Тогда
				Возврат неопределено;
			Иначе
				СтруктураВ = Новый структура;     
				СтруктураВ.Вставить("НакладнаяНаОтгрузку", НакладнаяНаОтгрузку);
				СтруктураВ.Вставить("СтатусНакладной", СтатусНакладной);
			    Возврат СтруктураВ;
			КонецЕсли;	
		Иначе
			Возврат неопределено;
		КонецЕсли;	
	Иначе  
		Возврат неопределено; 
	КонецЕсли;	 
КонецФункции

Функция ПроверитьВИПУсловияПОСтавкам(Дата, Залогодатель)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК Регистратор,
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия КАК ДатаОкончанияДействия
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		|ГДЕ
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель = &Залогодатель
		|	И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		ОтмененныйПриказ = Результат.Регистратор.ОтменяемыйПриказ;
		
		Если ЗначениеЗаполнено(ОтмененныйПриказ) Тогда
			Возврат Ложь;
		Иначе
			Возврат Истина;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
//-МАН     

Функция ПолучитьАртикулОЗ(Дата, ЗалоговыйБилет, ОбъектЗалога) Экспорт
	Запрос = Новый Запрос;     
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.УстановитьПараметр("ОбъектЗалога", ОбъектЗалога);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
	               |			&Дата,
	               |			ЗалоговыйБилет = &ЗалоговыйБилет
	               |				И ОбъектЗалога = &ОбъектЗалога) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		Возврат Выборка.Артикул;
	КонецЕсли;	
	Возврат "<не определен>";
КонецФункции

Функция ПолучитьСкидку(Дата, СкидкаВДокументах, Ломбард) Экспорт
	Для сч = 1 По 2 Цикл    
		ТекЛомбард = ?(сч = 1, Ломбард, Справочники.ЛБ_Ломбарды.ПустаяСсылка());
		Запрос = Новый Запрос; 
		Запрос.УстановитьПараметр("Дата", Дата); 
		Запрос.УстановитьПараметр("СкидкаВДокументах", СкидкаВДокументах);
		Запрос.УстановитьПараметр("Ломбард", ТекЛомбард); 
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_УстановкаОтменаСкидкиСрезПоследних.Ломбард КАК Ломбард,
		               |	ЛБ_УстановкаОтменаСкидкиСрезПоследних.ДокументСкидки КАК ДокументСкидки,
		               |	ЛБ_УстановкаОтменаСкидкиСрезПоследних.Отменен КАК Отменен
		               |ИЗ
		               |	РегистрСведений.ЛБ_УстановкаОтменаСкидки.СрезПоследних(
		               |			&Дата,
		               |			СкидкаВДокументах = &СкидкаВДокументах
		               |				И Ломбард = &Ломбард
		               |				И ДействуетС <= &Дата) КАК ЛБ_УстановкаОтменаСкидкиСрезПоследних"; 
		ВыборкаУ = Запрос.Выполнить().Выбрать();
		Если ВыборкаУ.Следующий() Тогда  
			Если ВыборкаУ.Отменен Тогда
				Продолжить;
			КонецЕсли;	
	        Запрос.УстановитьПараметр("Регистратор", ВыборкаУ.ДокументСкидки);
			Запрос.Текст = "ВЫБРАТЬ
			               |	ЛБ_СкидкаНаОбъектыЗалога.Скидка КАК Скидка,
			               |	ЛБ_СкидкаНаОбъектыЗалога.Отклонение КАК Отклонение
			               |ИЗ
			               |	РегистрСведений.ЛБ_СкидкаНаОбъектыЗалога КАК ЛБ_СкидкаНаОбъектыЗалога
			               |ГДЕ
			               |	ЛБ_СкидкаНаОбъектыЗалога.Регистратор = &Регистратор
			               |	И ЛБ_СкидкаНаОбъектыЗалога.СкидкаВДокументах = &СкидкаВДокументах"; 
			Выборка = Запрос.Выполнить().Выбрать(); 
			Если Выборка.Следующий() тогда 
				РезультатС = Новый структура;
				РезультатС.Вставить("Скидка", Выборка.Скидка); 
				РезультатС.Вставить("Отклонение", Выборка.Отклонение);
				
				Возврат РезультатС;
			КонецЕсли;  
		КонецЕсли;	  
	КонецЦикла;	
	Возврат неопределено;
КонецФункции	

Функция ПолучитьПредельнуюСуммуДляИдентификацииКлиента(Дата, СпособОплаты) Экспорт
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("СпособОплаты", СпособОплаты);
	Запрос.Текст ="ВЫБРАТЬ
	              |	ЛБ_ПредельныеСуммыДляИдентификацииКлиентаСрезПоследних.ПредельнаяСумма КАК ПредельнаяСумма
	              |ИЗ
	              |	РегистрСведений.ЛБ_ПредельныеСуммыДляИдентификацииКлиента.СрезПоследних(&Дата, СпособОплаты = &СпособОплаты) КАК ЛБ_ПредельныеСуммыДляИдентификацииКлиентаСрезПоследних"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		Возврат Выборка.ПредельнаяСумма; 
	КонецЕсли;
	Возврат 0;
КонецФункции	   

Функция ПолучитьПКОРеализации(Реализация) Экспорт
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ДокументОснование", Реализация);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПриходныйКассовыйОрдер.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЛБ_ПриходныйКассовыйОрдер КАК ЛБ_ПриходныйКассовыйОрдер
	               |ГДЕ
	               |	ЛБ_ПриходныйКассовыйОрдер.ДокументОснование = &ДокументОснование";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда   
		Возврат Выборка.Ссылка;  
	КонецЕсли;	
	Возврат неопределено;
КонецФункции	        

Функция СоздатьПКО(Реализация, КассоваяСмена) Экспорт
	ПКОСсылка = ПолучитьПКОРеализации(Реализация);
	Если НЕ ПКОСсылка = неопределено Тогда   
		ДокОбъект = ПКОСсылка.ПолучитьОбъект();
	Иначе 
		ДокОбъект = Документы.ЛБ_ПриходныйКассовыйОрдер.СоздатьДокумент();
		ДокОбъект.Ответственный = Реализация.ОтветственныйПользователь;
		ДокОбъект.ОтветственныйСотрудник = Реализация.ОтветственныйСотрудник;
	КонецЕсли;	  
	ДокОбъект.Дата = Реализация.Дата;
	ДокОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПоступленияОтПокупателейНевостребованныхЗалогов;
	Результат = ЛБ_ОбщийМодуль.ЗаполнитьДтКт(ДокОбъект.ВидОперации);
	ДокОбъект.Дт = Результат.Дт;
    ДокОбъект.Кт = Результат.Кт; 
	ДокОбъект.Ломбард = Реализация.Ломбард;
	ДокОбъект.Организация = Реализация.Организация; 
	ДокОбъект.Контрагент = ?(ЗначениеЗаполнено(Реализация.Контрагент), Реализация.Контрагент, Реализация.Ломбард);   
	ДокОбъект.НомерПКО = ЛБ_УправлениеЛомбардом.ПолучитьНовыйНомерПКО(ДокОбъект.Дата, ДокОбъект.Организация, ДокОбъект.Ломбард);
	Если  ДокОбъект.Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис Тогда 
		ДокОбъект.ПредставлениеНомераПКО = Строка(ДокОбъект.НомерПКО);
	Иначе	
	    ДокОбъект.ПредставлениеНомераПКО = СокрЛП(ДокОбъект.Ломбард.НомерЛомбарда) + "/" + СокрЛП(ДокОбъект.НомерПКО);
	КонецЕсли;	
	ДокОбъект.ПринятоОт = "Покупателей невостребованных залогов с применением ККТ"; 
	ДокОбъект.Основание = "Поступления от покупателей по реализации НЗ № " + СокрЛП(Реализация.ПредставлениеНомера) + " за " + Формат(Реализация.Дата, "ДФ=dd.MM.yyyy");  
	ДокОбъект.Сумма = Реализация.СуммаПродажи;
	ДокОбъект.КассоваяСмена = КассоваяСмена;
	ДокОбъект.ДокументОснование = Реализация;
	
	ДокОбъект.Записать(РежимЗаписиДокумента.Запись); 
	Попытка
	    ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);  
	Исключение 
		ОбщегоНазначения.СообщитьПользователю("Ошибка при проведени ПКО. Обратитесь к разработчикам");
	КонецПопытки;	 
	Возврат ДокОбъект.Ссылка;
КонецФункции	        

Функция ПроверитьОбъектЗалогаДобавленВРеализацию(ЗалоговыйБилет, ОбъектЗалога) Экспорт
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
	Запрос.УстановитьПараметр("ОбъектЗалога", ОбъектЗалога);
	Запрос.Текст = "ВЫБРАТЬ
	               |	1 КАК Вид,
	               |	ЛБ_РеализованныеОбъектыЗалогаОбороты.Регистратор КАК Регистратор,
	               |	ЛБ_РеализованныеОбъектыЗалогаОбороты.Регистратор.ОтветственныйСотрудник КАК Ответственный
	               |ИЗ
	               |	РегистрНакопления.ЛБ_РеализованныеОбъектыЗалога.Обороты(
	               |			,
	               |			,
	               |			Регистратор,
	               |			ЗалоговыйБилет = &ЗалоговыйБилет
	               |				И ОбъектЗалога = &ОбъектЗалога) КАК ЛБ_РеализованныеОбъектыЗалогаОбороты
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ДокументРеализации,
	               |	ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.Ответственный
	               |ИЗ
	               |	РегистрСведений.ЛБ_ОбъектыЗалогаДобавленныеВРеализацию КАК ЛБ_ОбъектыЗалогаДобавленныеВРеализацию
	               |ГДЕ
	               |	ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ЗалоговыйБилет = &ЗалоговыйБилет
	               |	И ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ОбъектЗалога = &ОбъектЗалога";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		СтруктураВозврата = Новый структура;
		СтруктураВозврата.Вставить("Вид", Выборка.Вид);
		СтруктураВозврата.Вставить("Регистратор", Выборка.Регистратор); 
		СтруктураВозврата.Вставить("Ответственный", Выборка.Ответственный); 
		
		Возврат СтруктураВозврата;
	КонецЕсли;
	Возврат неопределено;

КонецФункции	   

Функция ПроверитьЗалоговыйБилетСогласованКОплате(Дата, ЗалоговыйБилет) Экспорт      
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СогласованиеОплатыОтгруженныхЗБСрезПоследних.ДатаОплаты КАК ДатаОплаты
	               |ИЗ
	               |	РегистрСведений.ЛБ_СогласованиеОплатыОтгруженныхЗБ.СрезПоследних(&Дата, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_СогласованиеОплатыОтгруженныхЗБСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		Если НачалоДня(Дата) <= НачалоДня(Выборка.ДатаОплаты) Тогда
			Возврат Истина;
		КонецЕсли;	
	КонецЕсли;
	Возврат Ложь;
КонецФункции	

Функция ПроверкаНеНачислятьПроцентыПриРеализации(Дата, ЗалоговыйБилет) Экспорт  
	
	СписокСтатусов = Новый СписокЗначений;
	СписокСтатусов.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят); 
	СписокСтатусов.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен);
	СписокСтатусов.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Остановлен);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата); 
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
    Запрос.УстановитьПараметр("Статусы", СписокСтатусов);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилета.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета,
	               |	ВЫБОР
	               |		КОГДА ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК ЕстьОтмена
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета КАК ЛБ_СостояниеЗалоговогоБилета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&Дата, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
	               |		ПО ЛБ_СостояниеЗалоговогоБилета.Регистратор = ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент
	               |ГДЕ
	               |	ЛБ_СостояниеЗалоговогоБилета.СтатусЗалоговогоБилета В(&Статусы)
	               |	И ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет = &ЗалоговыйБилет
	               |	И ЛБ_СостояниеЗалоговогоБилета.Период < &Дата";   
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл  
		Если НЕ Выборка.ЕстьОтмена Тогда
		    Возврат Истина; 
		КонецЕсли;	
	КонецЦикла;
	Возврат Ложь;
КонецФункции	      

Функция ПолучитьДокументУстановкиУсловийСхемыКредитования(Дата, СхемаКредитования) Экспорт  
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Дата", Дата);  
	Запрос.УстановитьПараметр("СхемаКредитования", СхемаКредитования);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_УстановкаУсловийСхемыКредитования.Дата КАК Дата,
	               |	ЛБ_УстановкаУсловийСхемыКредитования.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЛБ_УстановкаУсловийСхемыКредитования КАК ЛБ_УстановкаУсловийСхемыКредитования
	               |ГДЕ
	               |	ЛБ_УстановкаУсловийСхемыКредитования.СхемаКредитования = &СхемаКредитования
	               |	И ЛБ_УстановкаУсловийСхемыКредитования.Проведен = ИСТИНА
	               |	И ЛБ_УстановкаУсловийСхемыКредитования.Дата <= &Дата
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата УБЫВ";    
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Ссылка;
	КонецЕсли;	
	Возврат Документы.ЛБ_УстановкаУсловийСхемыКредитования.ПустаяСсылка();
КонецФункции	

Функция ПолучитьТекущуюПроцентнуюСтавку(ЗалоговыйБилет, ПричинаПрименения) Экспорт
	СтавкаП = 0;
	ДатаКонРезультат = ТекущаяДатаСеанса();
	
	ТаблицаСтавок = ЗалоговыйБилет.ПроцентныеСтавкиПоПериодам.Выгрузить();
	УдСтроки = новый СписокЗначений;
	Для каждого стр Из ТаблицаСтавок Цикл 
		Если Стр.ПричинаПрименения =  ПричинаПрименения Тогда
			Продолжить;
		КонецЕсли;
		УдСтроки.Добавить(Стр);
	Конеццикла;	               
	Для каждого Эл из УдСтроки Цикл 
		ТаблицаСтавок.Удалить(Эл.Значение);
	Конеццикла;	  
	
	Если ТаблицаСтавок.Количество() > 0 Тогда
		СтрС = ТаблицаСтавок.Получить(0);  
		СтавкаП = СтрС.ПроцентнаяСтавка; 
		Если СтрС.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Акционная Тогда
			Если НЕ СтрС.ПроцентнаяСтавкаАкция = 0 Тогда
				СтавкаП = СтрС.ПроцентнаяСтавкаАкция;
			ИначеЕсли НЕ СтрС.ОтклонениеАкцияОтносительное = 0 Тогда	 
				СтавкаП = СтрС.ПроцентнаяСтавка + СтрС.ПроцентнаяСтавка*СтрС.ОтклонениеАкцияОтносительное/100;
			ИначеЕсли НЕ СтрС.ОтклонениеАкцияАбсолютное = 0 Тогда
				СтавкаП = СтрС.ПроцентнаяСтавка + СтрС.ОтклонениеАкцияАбсолютное;
		    КонецЕсли; 
		КонецЕсли;	
	КонецЕсли;	
  
   	Возврат СтавкаП;
КонецФункции   

Функция ПолучитьВидОкругленияСуммыПроцентов(Дата) Экспорт
	Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("Организация", Константы.ЛБ_ОсновнаяОрганизация.Получить());
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	УсловияПредоставленияКредита.ВидОкругленияСуммыПроцентов КАК ВидОкругленияСуммыПроцентов
				   |ИЗ
	               |	РегистрСведений.ЛБ_НастройкиЗаймаВерхнегоУровня.СрезПоследних(&Дата, Организация = &Организация) КАК УсловияПредоставленияКредита";
	Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда  
	    Возврат Выборка.ВидОкругленияСуммыПроцентов;
	КонецЕсли;  
	Возврат Перечисления.ЛБ_ВидыОкругленияСуммыПроцентов.ОкруглениеДоУмноженияНаКоличествоДней;
КонецФункции	


Функция ЕстьДоверенности(ЗБ) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗБ);  
	Запрос.УстановитьПараметр("СтатусДоверенности", Перечисления.ЛБ_СтатусыДоверенностей.ДоверенностьОформлена);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДоверенностиСрезПоследних.Доверенность КАК Доверенность,
	               |	ЛБ_ДоверенностиСрезПоследних.СтатусДоверенности КАК СтатусДоверенности
	               |ИЗ
	               |	РегистрСведений.ЛБ_Доверенности.СрезПоследних(, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_ДоверенностиСрезПоследних
	               |ГДЕ
	               |	ЛБ_ДоверенностиСрезПоследних.СтатусДоверенности = &СтатусДоверенности";
	ТаблицаД = Запрос.Выполнить().Выгрузить();
	ДатаПроверки = ТекущаяДатаСеанса();
	Для каждого стрД из ТаблицаД цикл   
		Если СтрД.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.ДоверенностьОформлена Тогда
			ДоверенностьДействует = Истина;
			Если СтрД.Доверенность.СрокДействияДоверенности >= НачалоДня(ДатаПроверки) Тогда 
				Если НЕ ЛБ_ОбщийМодуль.ПроверитьЕстьДатаСмерти(СтрД.Доверенность.Клиент, ДатаПроверки) = неопределено Тогда   
					ДоверенностьДействует = Ложь;
				ИначеЕсли НЕ ЛБ_ОбщийМодуль.ПроверитьЕстьДатаСмерти(СтрД.Доверенность.ПредставительКлиента, ДатаПроверки) = неопределено Тогда  
                    ДоверенностьДействует = Ложь;					
				КонецЕсли;	              
			ИначеЕсли СтрД.Доверенность.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Наследство Тогда
				Если НЕ ЛБ_ОбщийМодуль.ПроверитьЕстьДатаСмерти(СтрД.Доверенность.ПредставительКлиента, ДатаПроверки) = неопределено Тогда  
					ДоверенностьДействует = Ложь;	
				КонецЕсли;	
			Иначе                         	
				ДоверенностьДействует = Ложь;
			КонецЕсли;  
		Иначе
			ДоверенностьДействует = Ложь;
		КонецЕсли; 
		Если ДоверенностьДействует Тогда  
			Возврат Истина;
        КонецЕсли;
	КонецЦикла;  
  	Возврат Ложь;
КонецФункции    

Функция РасчитатьДолгПоПроцентам(Дата, ЗалоговыйБилет, СуммаЗайма, ПричинаПримененияПроцентнойСхемы, ДатаНачалаРасчета) Экспорт 
	ДокументОбъект = СоздатьНовуюОплатуПроцентов(Дата, ЗалоговыйБилет); 	    
		   
	СтруктураП = ЛБ_УправлениеЛомбардом.ПолучитьПредельныеЗначенияПроцентов(ЗалоговыйБилет.Дата, ЗалоговыйБилет.Организация);
	Если НЕ СтруктураП = неопределено Тогда
	    ПланкаПроцентов = СтруктураП.ПланкаПроцентов;
		ПредельноеЗначениеПроцентов = ЗалоговыйБилет.СуммаСсуды*СтруктураП.ПланкаПроцентов; 
	Иначе
		ПредельноеЗначениеПроцентов = 0;
	КонецЕсли;   
	СтруктураОкр = ЛБ_УправлениеЛомбардом.ПолучитьУсловияОкругленияПроцентов(ЗалоговыйБилет);
	Установки = ЛБ_УправлениеЛомбардом.ПолучитьУсловияПоДоговору(ЗалоговыйБилет); 	
	Результат = ЛБ_ОбщийМодуль.РассчитатьСуммуПроцентовОплата(ДокументОбъект, ДатаНачалаРасчета, ПредельноеЗначениеПроцентов, ПричинаПримененияПроцентнойСхемы, Установки, СтруктураОкр); 

	Возврат Результат.СуммаПроцентов;
КонецФункции

Функция СформироватьСообщениеПольхователюПоРасчетуЗБ(НомерЗБ, ПроцентнаяСтавка, СуммаПроцентовВДень, Долг, ЕстьДоверенность) 
	ТекстС = СокрЛП(НомерЗБ);  
	ТекстС = ТекстС + "; " + ПроцентнаяСтавка;
	ТекстС = ТекстС + "; " + СуммаПроцентовВДень;
	ТекстС = ТекстС + "; " + СокрЛП(Формат(Долг, "ЧЦ=15; ЧДЦ=2; ЧН=0"));
	ТекстС = ТекстС + "; " + ?(ЕстьДоверенность, "да", "нет");   
	
	Возврат ТекстС;
КонецФункции	

Функция ПроверитьМестонахождениеОЗ(ЗалоговыйБилет, Ломбард) Экспорт
	ТестСообщения = "";
	СкладЗалоги = ЛБ_Общиймодуль.ПолучитьСклад(Ломбард, Перечисления.ЛБ_ВидыСкладов.Залоги);		
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
	               |	ЛБ_ОбъектыЗалогаОстатки.Ломбард КАК Ломбард,
	               |	ЛБ_ОбъектыЗалогаОстатки.Склад КАК Склад,
	               |	СУММА(ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток) КАК Количество
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_ОбъектыЗалогаОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	               |		ПО ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет
	               |			И ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога
	               |ГДЕ
	               |	НЕ ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток = 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ОбъектыЗалогаОстатки.Склад,
	               |	ЛБ_ОбъектыЗалогаОстатки.Ломбард,
	               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОбъектЗалога";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	УдСтроки = Новый списокЗначений;
	Для каждого Стр Из ТаблицаЗапроса Цикл 
		Если Стр.Ломбард = Ломбард И Стр.Склад = СкладЗалоги Тогда 
			УдСтроки.Добавить(Стр);
		КонецЕсли;	
	Конеццикла;	  
	
	Для каждого Эл из Удстроки цикл  
		ТаблицаЗапроса.Удалить(Эл.Значение);
	Конеццикла;	                          
	
	ТаблицаОЗ = ТаблицаЗапроса.Скопировать();
	ТаблицаОЗ.Свернуть("ОбъектЗалога, Ломбард, Склад");
	Для каждого СтрОЗ Из ТаблицаОЗ Цикл  
		Отбор = новый Структура;
		Отбор.Вставить("ОбъектЗалога", СтрОЗ.ОбъектЗалога); 
		Отбор.Вставить("Ломбард", СтрОЗ.Ломбард);  
		Отбор.Вставить("Склад", СтрОЗ.Склад);
		
		СписокОЗ = "";
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
		Для каждого Стр Из Строки Цикл
			 СписокОЗ = СписокОЗ + ?(ПустаяСтрока(СписокОЗ), "", ", ") + СокрЛП(Стр.Артикул);
		КонецЦикла;	
		Если Строки.Количество() = 1 Тогда
			СтрокаОЗ = "Объект залога " + СписокОЗ + " находится в ";
		Иначе  
			СтрокаОЗ = "Объекты залога " + СписокОЗ + " находятся в ";
		КонецЕсли;	
		ТестСообщения = ТестСообщения + ?(ПустаяСтрока(ТестСообщения), "", Символы.ПС) + СтрокаОЗ + 
		           ?(СтрОЗ.Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис, "ЦО", "ломбарде № " + СтрОЗ.Ломбард.НомерЛомбарда) +
				   " на складе " + СокрЛП(СтрОЗ.Склад);
	КонецЦикла;	
	
	Возврат ТестСообщения;
КонецФункции

Функция ВыполнитьОбработкуДанныхТаблицыЗБ(СписокЗБ, ДатаСмерти) Экспорт 
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗалоговыеБилеты", СписокЗБ);		
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПричинаПрименения КАК ПричинаПрименения,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаНачалаРасчетаПроцентов КАК ДатаНачалаРасчетаПроцентов
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(, ЗалоговыйБилет В (&ЗалоговыеБилеты)) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних";
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	Для каждого Эл Из СписокЗБ цикл   
		Отбор = Новый структура;
		Отбор.Вставить("ЗалоговыйБилет", Эл.Значение); 
		
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
		Если НЕ Строки.Количество() = 0 Тогда
			Стр = Строки.Получить(0);   
			
			НачисленоПроценты = 0; 
			СуммаПроцентовВДень = "";
			ПроцентнаяСтавка = "";
			Если НЕ Стр.СуммаЗайма = 0 Тогда 
				НачисленияОстановлены = Ложь;
				Если Стр.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят ИЛИ 
					 Стр.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен ИЛИ
					 Стр.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Остановлен Тогда   
					НачисленияОстановлены = Истина;
				КонецЕсли;	
				
				Если НЕ НачисленияОстановлены Тогда
					Если НЕ ДатаСмерти = Дата(1,1,1) Тогда   
						ПредыдущийСтатусЗБ = ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(ДатаСмерти-1, Стр.ЗалоговыйБилет); 
						Если ПредыдущийСтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят ИЛИ 
						     ПредыдущийСтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен ИЛИ
						     ПредыдущийСтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Остановлен Тогда 
							НачисленияОстановлены = Истина; 
						КонецЕсли; 
					КонецЕсли;
				КонецЕсли;	

				СтавкаП = ПолучитьТекущуюПроцентнуюСтавку(Стр.ЗалоговыйБилет, Стр.ПричинаПрименения); 
				ПроцентнаяСтавка = Формат(СтавкаП, "ЧЦ=10; ЧДЦ=3"); 
				Если НачисленияОстановлены Тогда  
					НачисленоПроценты = ЛБ_ОбщийМодуль.ПолучитьОстатокПроцентов(, Стр.ЗалоговыйБилет);
					СуммаПроцентовВДень = "0,00";
				Иначе	
					ВидОкругленияСуммыПроцентов = ПолучитьВидОкругленияСуммыПроцентов(Стр.ЗалоговыйБилет.Дата);
					Если ВидОкругленияСуммыПроцентов = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОкругленияСуммыПроцентов.ОкруглениеПослеУмноженияНаКоличествоДней") Тогда
				        СуммаПроцентовВДень = Формат(Стр.СуммаЗайма*СтавкаП/100, "ЧЦ=15; ЧДЦ=5");   
					Иначе
						СуммаПроцентовВДень = Формат(Стр.СуммаЗайма*СтавкаП/100, "ЧЦ=15; ЧДЦ=2");
					КонецЕсли;		
					
					НачисленоПроценты = РасчитатьДолгПоПроцентам(ТекущаяДатаСеанса(), Стр.ЗалоговыйБилет, Стр.СуммаЗайма, Стр.ПричинаПрименения, Стр.ДатаНачалаРасчетаПроцентов); 
				КонецЕсли;
			КонецЕсли;	
			Долг = Стр.СуммаЗайма + НачисленоПроценты;
			ЕстьДоверенность = ЕстьДоверенности(Стр.ЗалоговыйБилет);
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СформироватьСообщениеПольхователюПоРасчетуЗБ(Стр.ЗалоговыйБилет.НомерЗалоговогоБилета, ПроцентнаяСтавка, СуммаПроцентовВДень, Долг, ЕстьДоверенность);
			Сообщение.Сообщить();   
		КонецЕсли;	
	Конеццикла;	 
	Возврат "Выполнено"; 
КонецФункции	

