&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Ответственный = Пользователи.ТекущийПользователь();
		Объект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить(); 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОкруглятьСуммуПроцентыПриИзменении(Элемент)
	Если НЕ Объект.ОкруглятьСуммуПроценты Тогда
		Объект.ОкруглятьВБольшуюСторонуПроценты = Ложь;
		Объект.ПорядокОкругленияПроценты        = ПредопределенноеЗначение("Перечисление.ПорядкиОкругления.Окр0_01"); 
		Объект.ВидОкругленияСуммыПроцентов = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОкругленияСуммыПроцентов.ПустаяСсылка");
	КонецЕсли;
	
	Элементы.ГруппаОкругленияПроценты.Доступность = Объект.ОкруглятьСуммуПроценты;

КонецПроцедуры

&НаКлиенте
Процедура ОкруглятьСуммуОценкаПриИзменении(Элемент)
	Если НЕ Объект.ОкруглятьСуммуОценка Тогда
		Объект.ОкруглятьВБольшуюСторонуОценка = Ложь;
		Объект.ПорядокОкругленияОценка        = ПредопределенноеЗначение("Перечисление.ПорядкиОкругления.Окр0_01"); 
	КонецЕсли;
	
	Элементы.ГруппаОценка.Доступность = Объект.ОкруглятьСуммуОценка;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.ОкруглятьСуммуПроценты Тогда
		Если НЕ ЗначениеЗаполнено(ТекущийОбъект.ВидОкругленияСуммыПроцентов) Тогда  
			Сообщить("Необходимо выбрать вид округления процентов!"); 
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

