
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//СК [11.04.2019] (обнуление документов)
	//ПараметрыОтбора = Неопределено;
	//Если Параметры.Свойство("ДляОбнуления") И Параметры.Свойство("ПараметрыОтбора",ПараметрыОтбора) Тогда
	//	
	//	Список.Отбор.Элементы.Очистить();
	//	//Чтобы не загружать пользовательские настройки
	//	Список.КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки = "";
	//	
	//	ОтборДата = Неопределено;
	//	Если ПараметрыОтбора.Свойство("Дата", ОтборДата) Тогда
	//		
	//		ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Дата",
	//			НачалоДня(ОтборДата),
	//			ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	//		
	//		ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Дата",
	//			КонецДня(ОтборДата),
	//			ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);									
	//	КонецЕсли;
	//	
	//	ОтборФилиал = Неопределено;
	//	Если ПараметрыОтбора.Свойство("Филиал", ОтборФилиал) Тогда
	//		
	//		ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(Список, "ЗалоговыйБилет.Филиал",
	//			ОтборФилиал,
	//			ВидСравненияКомпоновкиДанных.Равно);
	//	КонецЕсли;
	//	
	//	ОтборОрганизация = Неопределено;
	//	Если ПараметрыОтбора.Свойство("Организация", ОтборОрганизация) Тогда
	//		
	//		ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(Список, "ЗалоговыйБилет.Организация",
	//			ОтборОрганизация,
	//			ВидСравненияКомпоновкиДанных.Равно);
	//	КонецЕсли;
	//		
	//	ОтборВидОперации = Неопределено;
	//	Если ПараметрыОтбора.Свойство("ВидОперации", ОтборВидОперации) Тогда
	//		
	//		ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(Список, "ВидОперации",
	//			ОтборВидОперации,
	//			ВидСравненияКомпоновкиДанных.Равно);
	//	КонецЕсли;
	//		
	//	ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Проведен",
	//		Истина,
	//		ВидСравненияКомпоновкиДанных.Равно);
	//		
	//	ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Обнулен",
	//		Ложь,
	//		ВидСравненияКомпоновкиДанных.Равно);

	//	
	//КонецЕсли;
	//\
	
КонецПроцедуры
