
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("РеестрПлатежей") Тогда
		РеестрПлатежей = Параметры.РеестрПлатежей;
	КонецЕсли;	
	Если Параметры.Свойство("НомерЗБ") Тогда
		НомерЗБ = Параметры.НомерЗБ;
	КонецЕсли;	 
	Если Параметры.Свойство("ДатаПлатежа") Тогда
		ДатаПлатежа = Параметры.ДатаПлатежа;
	КонецЕсли;	 
	Если Параметры.Свойство("ИдентификаторПлатежа") Тогда
		ИдентификаторПлатежа = Параметры.ИдентификаторПлатежа;
	КонецЕсли;	 
	Если Параметры.Свойство("СуммаПлатежа") Тогда
		СуммаПлатежа = Параметры.СуммаПлатежа;
	КонецЕсли;	 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	Если НЕ ЗначениеЗаполнено(РеестрПлатежей) Тогда
		Предупреждение("Не выбран реестр платежей!", 60);
		Отказ = Истина;
	КонецЕсли;  
	ВывестиИсторию();
КонецПроцедуры

&НаСервере
Процедура ВывестиИсторию()  
	Элементы.ДекорацияПлатеж.Заголовок = СокрЛП(РеестрПлатежей.НомерРеестра) + " от " + Формат(РеестрПлатежей.Дата, "ДФ=dd.MM.yyyy") + "," +
	    Символы.ПС + "Платеж № " + СокрЛП(ИдентификаторПлатежа) + " от " + формат(ДатаПлатежа, "ДЛФ=DT") + " на сумму " + СокрЛП(Формат(СуммаПлатежа, "ЧЦ=15; ЧДЦ=2")) + " руб.," +
		Символы.ПС + "Залоговый билет № " + СокрЛП(НомерЗБ);
	Запрос = новый Запрос;    
	Запрос.УстановитьПараметр("РеестрПлатежей", РеестрПлатежей);  
	Запрос.УстановитьПараметр("ДатаПлатежа", ДатаПлатежа);
	Запрос.УстановитьПараметр("ИдентификаторПлатежа", ИдентификаторПлатежа);
	Запрос.УстановитьПараметр("НомерЗБ", НомерЗБ);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ЛБ_РеестрБезначныхПлатежей.ОтменаСотрудникомЦО
	               |			ТОГДА ""Отмена операции сотрудником ЦО""
	               |		ИНАЧЕ ЛБ_РеестрБезначныхПлатежей.СтатусПлатежа
	               |	КОНЕЦ КАК СтатусПлатежа,
	               |	ЛБ_РеестрБезначныхПлатежей.Ответственный КАК Ответственный,
	               |	ЛБ_РеестрБезначныхПлатежей.Период КАК Дата,
	               |	ВЫБОР
	               |		КОГДА ЛБ_РеестрБезначныхПлатежей.НомерЗБ = ЛБ_РеестрБезначныхПлатежей.ЗалоговыйБилет.НомерЗалоговогоБилета
	               |			ТОГДА """"
	               |		ИНАЧЕ ЛБ_РеестрБезначныхПлатежей.ЗалоговыйБилет.НомерЗалоговогоБилета
	               |	КОНЕЦ КАК НомерЗБНовый
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеестрБезначныхПлатежей КАК ЛБ_РеестрБезначныхПлатежей
	               |ГДЕ
	               |	ЛБ_РеестрБезначныхПлатежей.РеестрПлатежей = &РеестрПлатежей
	               |	И ЛБ_РеестрБезначныхПлатежей.НомерЗБ = &НомерЗБ
	               |	И ЛБ_РеестрБезначныхПлатежей.ДатаПлатежа = &ДатаПлатежа
	               |	И ЛБ_РеестрБезначныхПлатежей.ИдентификаторПлатежа = &ИдентификаторПлатежа
	               |	И НЕ ЛБ_РеестрБезначныхПлатежей.Регистратор = &РеестрПлатежей
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата УБЫВ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
   	ИсторияИзменений.Загрузить(ТаблицаЗапроса);
КонецПроцедуры	