&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Приказ") Тогда 
		Приказ = Параметры.Приказ;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Приказ) тогда 
		ТаблицаЛ = Приказ.Ломбарды.Выгрузить(); 
		ТаблицаЛ.Сортировать("Ломбард");  
		Если ТаблицаЛ.Количество() = 0 Тогда
			Сообщить("В выбранном приказе не заполнен список ломбардов!"); 
			Отказ = Истина;
		Иначе	  
			Ломбард = ТаблицаЛ.Получить(0).Ломбард;
			Для каждого Стр из ТаблицаЛ Цикл
			    Элементы.Ломбард.СписокВыбора.Добавить(Стр.Ломбард);
			КонецЦикла;	 
		КонецЕсли;
	Иначе
		Сообщить("Не выбран приказ!");
		Отказ = Истина;
	КонецЕсли;	

КонецПроцедуры 


&НаКлиенте
Процедура Выбрать(Команда)
	Закрыть(Ломбард);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры



