
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокЗалогодателей.Параметры.УстановитьЗначениеПараметра("МассивСсылок", Параметры.Отбор.Ссылка);
	СписокЗалогодателей.Параметры.УстановитьЗначениеПараметра("ДатаСреза", ТекущаяДатаСеанса());
	Если Параметры.Свойство("ДатаРождения") Тогда
	    СписокЗалогодателей.Параметры.УстановитьЗначениеПараметра("ДатаРождения", Параметры.ДатаРождения);
	Иначе	
	    СписокЗалогодателей.Параметры.УстановитьЗначениеПараметра("ДатаРождения", Дата(1, 1, 1));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗалогодателейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;  
	ПараметрыФормы.Вставить("Залогодатель", Элементы.СписокЗалогодателей.ТекущиеДанные.Ссылка);
	ОткрытьФорму("ОбщаяФорма.ЛБ_КарточкаЗалогодателя", ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.Независимый); 
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры


