
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	Объект.Ответственный = Пользователи.ТекущийПользователь();
	УстановитьСостояниеДокумента();
	ЛБ_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(, Объект, ЭтаФорма); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДиапазоныСуммЗайма.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЛБ_ДиапазоныСуммЗайма КАК ЛБ_ДиапазоныСуммЗайма
	               |ГДЕ
	               |	ЛБ_ДиапазоныСуммЗайма.ЭтоГруппа = ЛОЖЬ
	               |	И ЛБ_ДиапазоныСуммЗайма.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ДиапазоныСуммЗайма.ПорядокСортировки";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	    Элементы.СтавкиПроцентовДиапазонСумм.СписокВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьСписокЛомбардов();
	Элементы.СписокЛомбардов.Подсказка = Элементы.СписокЛомбардов.Заголовок;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписидокумента.Проведение Тогда
		Если ТекущийОбъект.ДатаНачалаДействия < ТекущийОбъект.Дата Тогда
			Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
				Сообщить("Дата начала действия прейскуранта не может быть меньше даты документа!");
	            Отказ = Истина;	
			КонецЕсли;	
		КонецЕсли;	  
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)	
	ЛБ_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(, Объект, ЭтаФорма);
	
	УстановитьСостояниеДокумента();
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура СписокЛомбардовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	
	ПараметрыФормы = Новый Структура;    
	ПараметрыФормы.Вставить("Ломбарды", Объект.Ломбарды);
	ПараметрыФормы.Вставить("ДатаДок", ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Дата, ТекущаяДата()));
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЛомбардов",ЭтаФорма);
	
	ОткрытьФорму("Обработка.ЛБ_ВыборЛомбардовИзСписка.Форма", ПараметрыФормы, Элементы.СписокЛомбардов,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокЛомбардов()
	Результат = "";
	Для каждого Стр Из Объект.Ломбарды Цикл
		Результат = Результат + ?(ПустаяСтрока(Результат), "", "; ") + СокрЛП(Стр.Ломбард);
	КонецЦикла;	
	СписокЛомбардов = Результат;
	Объект.СтрокаЛомбарды = Результат;
КонецПроцедуры	
 
&НаСервере
Процедура ПослеВыбораЛомбардов(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;

	Объект.Ломбарды.Очистить();
	КоличествоВыбрано = Результат.Количество;
	Для сч = 1 По КоличествоВыбрано Цикл
		НоваяСтр = Объект.Ломбарды.Добавить();
		НоваяСтр.Ломбард = Результат["Значение" + Строка(сч)];
	КонецЦикла;	
	
	ЗаполнитьСписокЛомбардов();
	Элементы.СписокЛомбардов.Подсказка = Элементы.СписокЛомбардов.Заголовок;
КонецПроцедуры

&НаКлиенте
Процедура СтавкиПроцентовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекСтрока = Элементы.СтавкиПроцентов.ТекущиеДанные;
	Если НоваяСтрока И Не Копирование Тогда
		ТекСтрока.ПричинаПрименения = ПредопределенноеЗначение("Перечисление.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма"); 
		ТекСтрока.УстановитьЗначениеИлиОтконение = ПредопределенноеЗначение("Перечисление.ЛБ_УстановкаЗначенияИлиОтклонения.Значение");  
		ТекСтрока.Ставка = 0;
	КонецЕсли;	
КонецПроцедуры   

&НаКлиенте
Процедура СтавкиПроцентовСхемаРасчетаПроцентовПриИзменении(Элемент)
	СтрокаТабличнойЧастиСтавки = Элементы.СтавкиПроцентов.ТекущиеДанные;
	Если СтрокаТабличнойЧастиСтавки.СхемаРасчетаПроцентов = ПредопределенноеЗначение("Перечисление.ЛБ_СхемыРасчетаПроцентов.Фиксированная") Тогда
		Если НЕ ТипЗнч(СтрокаТабличнойЧастиСтавки.Ставка) = Тип("Число") Тогда
			СтрокаТабличнойЧастиСтавки.Ставка = 0;
		КонецЕсли;		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если Объект.Дата > Объект.ДатаНачалаДействия Тогда
		Объект.ДатаНачалаДействия = Объект.Дата;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриказНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.Акция"));
	 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	 
	ОткрытьФорму("Документ.ЛБ_ПриказУсловияПредоставленияЗаймов.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура СтавкиПроцентовУстановитьЗначениеИлиОтконениеПриИзменении(Элемент)
	ТекСтрока = Элементы.СтавкиПроцентов.ТекущиеДанные; 
	Если ТекСтрока.УстановитьЗначениеИлиОтконение = ПредопределенноеЗначение("Перечисление.ЛБ_УстановкаЗначенияИлиОтклонения.Значение") Тогда 
		ТекСтрока.Отклонение = ПредопределенноеЗначение("Перечисление.ЛБ_ОтклонениеОтБазовойЦены.ПустаяСсылка");
		ТекСтрока.ЗначениеОтклонения = 0;
	ИначеЕсли ТекСтрока.УстановитьЗначениеИлиОтконение = ПредопределенноеЗначение("Перечисление.ЛБ_УстановкаЗначенияИлиОтклонения.Отклонение") Тогда  
		ТекСтрока.Ставка = 0;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СтавкиПроцентовПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ТекСтрока = Элементы.СтавкиПроцентов.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекСтрока.СхемаКредитования) Тогда   
		ТекСтрока.УстановитьЗначениеИлиОтконение = ПредопределенноеЗначение("Перечисление.ЛБ_УстановкаЗначенияИлиОтклонения.Значение");
		ТекСтрока.Отклонение = ПредопределенноеЗначение("Перечисление.ЛБ_ОтклонениеОтБазовойЦены.ПустаяСсылка"); 
		ТекСтрока.ЗначениеОтклонения = 0;
	КонецЕсли;	
КонецПроцедуры









