#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда  
	
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	//+МАН 16.12.24 Убирал стандартную кнопку печати т.к. добавлена своя. Заявка 2936.
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор  = "ПКО";
	//КомандаПечати.Представление  = НСтр("ru = 'Печать ПКО'");
	//-МАН
КонецПроцедуры	

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт	
	
	// Устанавливаем признак доступности печати покомплектно.
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	// Проверяем, нужно ли для макета ЗаключениеОбОценке формировать табличный документ.
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПКО") Тогда
		
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПКО", "Печать ПКО", 
		ПечатьПКО(МассивОбъектов, ОбъектыПечати));  
   	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьПКО(МассивОбъектов, ОбъектыПечати)
	Ссылка = МассивОбъектов[0];
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ПКО";  
	//+МАН 16.12.24 Только просмотр. Заявка 2936.
	ТабличныйДокумент.ТолькоПросмотр		= Истина;
	//-МАН
	
	// Получаем макет
	Макет = ПолучитьОбщийМакет("ПФ_MXL_КО1");
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.ПредставлениеОрганизации = СокрЛП(Ссылка.Организация); 
	ОбластьМакета.Параметры.ОрганизацияПоОКПО = "4107218";
	//+МАН Изменилось наименование ломбарда. Берем наименование из полного. Заявка 2956
	//Было: ОбластьМакета.Параметры.ПредставлениеПодразделения = СокрЛП(Ссылка.Ломбард);
	ОбластьМакета.Параметры.ПредставлениеПодразделения = СокрЛП(Ссылка.Ломбард.НаименованиеПолное);
	//-МАН
	ОбластьМакета.Параметры.КодПодразделения = СокрЛП(Ссылка.Ломбард.НомерЛомбарда);
	ОбластьМакета.Параметры.НомерДокумента = Ссылка.ПредставлениеНомераПКО;
	ОбластьМакета.Параметры.ДатаДокумента = Формат(Ссылка.Дата, "ДФ=dd.MM.yyyy"); 
	ОбластьМакета.Параметры.ПринятоОт = Ссылка.ПринятоОт; 
	ОбластьМакета.Параметры.Основание = Ссылка.Основание;
	ОбластьМакета.Параметры.Приложение = Ссылка.ДополнительнаяИнформация; 
	ОбластьМакета.Параметры.ВТомЧисле = "НДС не предусмотрен"; 
	СуммаРуб = Цел(Ссылка.Сумма);
	СуммаКоп = (Ссылка.Сумма - Цел(Ссылка.Сумма))*100;
	ОбластьМакета.Параметры.СуммаРубКоп = СокрЛП(Формат(СуммаРуб, "ЧЦ=15; ЧРГ=' '")) + " руб. " + СокрЛП(Формат(СуммаКоп, "ЧЦ=2; ЧН=00; ЧВН=")) + " коп."; 
	
	ФормСтрока = "Л = ru_RU; ДП = Ложь";
    ПарПредмета="рубль,рубля,рублей,м,копейка,копейки,копеек,м,2";
	ОбластьМакета.Параметры.СуммаПрописью = ЧислоПрописью(Ссылка.Сумма, ФормСтрока, ПарПредмета); 
    ОбластьМакета.Параметры.КодДебета = СокрЛП(Ссылка.Дт); 
	ОбластьМакета.Параметры.СубСчет = СокрЛП(Ссылка.Кт); 
	ОбластьМакета.Параметры.Сумма  = СокрЛП(Формат(Ссылка.Сумма, "ЧЦ=15; ЧДЦ=2; ЧРГ="));
	ОбластьМакета.Параметры.ФИОКассира = Ссылка.Ответственный;  
	ОбластьМакета.Параметры.ФИОГлавногоБухгалтера = Ссылка.Ответственный;
	ТабличныйДокумент.Вывести(ОбластьМакета);

	Возврат ТабличныйДокумент;
КонецФункции
#КонецЕсли	