 Перем КассоваяСмена Экспорт; 
  
// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда  
		СписокНеЗаполненныхРеквизитов = "";
		КолРеквизитов = 0;
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Организация) Тогда 
			СписокНеЗаполненныхРеквизитов = СписокНеЗаполненныхРеквизитов + ?(ПустаяСтрока(СписокНеЗаполненныхРеквизитов), "", ", ") + "Организация"; 
			КолРеквизитов = КолРеквизитов + 1;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Ломбард) Тогда 
			СписокНеЗаполненныхРеквизитов = СписокНеЗаполненныхРеквизитов + ?(ПустаяСтрока(СписокНеЗаполненныхРеквизитов), "", ", ") + "Ломбард"; 
			КолРеквизитов = КолРеквизитов + 1;
		КонецЕсли; 
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ВидОперации) Тогда 
			СписокНеЗаполненныхРеквизитов = СписокНеЗаполненныхРеквизитов + ?(ПустаяСтрока(СписокНеЗаполненныхРеквизитов), "", ", ") + "Вид операции"; 
			КолРеквизитов = КолРеквизитов + 1;
		КонецЕсли;
        Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ПредставлениеНомераПКО) Тогда 
			СписокНеЗаполненныхРеквизитов = СписокНеЗаполненныхРеквизитов + ?(ПустаяСтрока(СписокНеЗаполненныхРеквизитов), "", ", ") + "Номер ПКО";
			КолРеквизитов = КолРеквизитов + 1;
		КонецЕсли;     
		Если НЕ ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.СводныйПКО Тогда
	        Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Сумма) Тогда 
				СписокНеЗаполненныхРеквизитов = СписокНеЗаполненныхРеквизитов + ?(ПустаяСтрока(СписокНеЗаполненныхРеквизитов), "", ", ") + "Сумма";
				КолРеквизитов = КолРеквизитов + 1;
			КонецЕсли;
	        Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Контрагент) Тогда 
				СписокНеЗаполненныхРеквизитов = СписокНеЗаполненныхРеквизитов + ?(ПустаяСтрока(СписокНеЗаполненныхРеквизитов), "", ", ") + "Плательщик";
				КолРеквизитов = КолРеквизитов + 1;
			КонецЕсли;     
			Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ПринятоОт) Тогда 
				СписокНеЗаполненныхРеквизитов = СписокНеЗаполненныхРеквизитов + ?(ПустаяСтрока(СписокНеЗаполненныхРеквизитов), "", ", ") + "Принято от";
				КолРеквизитов = КолРеквизитов + 1;
			КонецЕсли;
			Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПолучениеСКорпоративнойКарты Тогда
				Если НЕ ЗначениеЗаполнено(ЭтотОбъект.БанковскаяКарта) Тогда 
					СписокНеЗаполненныхРеквизитов = СписокНеЗаполненныхРеквизитов + ?(ПустаяСтрока(СписокНеЗаполненныхРеквизитов), "", ", ") + "Банковская карта";
					КолРеквизитов = КолРеквизитов + 1;
				КонецЕсли;
			КонецЕсли; 
		КонецЕсли;	
		
		Если НЕ КолРеквизитов = 0 Тогда   
			ТекстСообщения = ?(КолРеквизитов = 1, "Не заполнен реквизит документа ", "Не заполнены реквизиты документа ");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения + СписокНеЗаполненныхРеквизитов);
			Отказ = Истина;
		КонецЕсли;	 
		//Закомментировала временно. Убрать потом!!!
		//Если НЕ Отказ Тогда
		//	Если РежимПроведения = РежимПроведенияДокумента.Неоперативный Тогда
		//		Если НачалоДня(Дата) = НачалоДня(ТекущаяДатаСеанса()) Тогда
		//			Если НЕ ЭтотОбъект.Проведен ИЛИ ЛБ_ОбщийМодуль.КассовыеСменаСовпадаетСТекущей(ЭтотОбъект) Тогда
		//			    Дата = ТекущаяДатаСеанса();
		//			КонецЕсли; 
		//		ИначеЕсли НЕ ЭтотОбъект.Проведен Тогда
		//			ОбщегоНазначения.СообщитьПользователю("Неоперативное проведение документа запрещено!");
		//		    Отказ = Истина;	 	
		//		КонецЕсли;	                   
		//	КонецЕсли;	
		//КонецЕсли;  
		//Закомментировала временно. Убрать потом!!!


		//Если НЕ Отказ Тогда
		//    Результат = ЛБ_ОбщийМодуль.ПолучитьОткрытуюКассовуюСмену(Дата, Организация, Ломбард); 
		//	Если НЕ Результат = неопределено Тогда 
		//	    КассоваяСмена = Результат.КассоваяСмена;
		//	Иначе           
		//		ОбщегоНазначения.СообщитьПользователю("На дату документа не открыта кассовая смена!");
		//		Отказ = Истина;
		//	КонецЕсли;	  
		//КонецЕсли;
		//Если НЕ Отказ Тогда
		//	Если ЛБ_ОбщийМодуль.ПроверитьЕстьОтменаКО(Ссылка) Тогда 
		//		ОбщегоНазначения.СообщитьПользователю("Эта операция отменена!");
		//		Отказ = Истина;
		//	КонецЕсли;
		//КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Результат = ЛБ_ОбщийМодуль.ПолучитьОткрытуюКассовуюСмену(Дата, Организация, Ломбард); 
	Если НЕ Результат = неопределено Тогда 
	     КассоваяСмена = Результат.КассоваяСмена;  
	Иначе	 
        Отказ = Истина;  
		ОбщегоНазначения.СообщитьПользователю("На дату документа не открыта кассовая смена!");
		Возврат;
	КонецЕсли;	   
	
	Движения.ЛБ_ДенежныеСредства.Записывать = Истина;
    Движения.ЛБ_ДвиженияДенежныхСредств.Записывать = Истина;

	Если НЕ ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.СводныйПКО И НЕ ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПоступленияОтПокупателейНевостребованныхЗалогов Тогда
		Движение = Движения.ЛБ_ДенежныеСредства.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Ломбард = Ломбард;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.ВидДенежныхСредств = Перечисления.ЛБ_ВидыДенежныхСредств.Наличные;	
		Движение.Сумма = ЭтотОбъект.Сумма;

		Движение = Движения.ЛБ_ДвиженияДенежныхСредств.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Ломбард = Ломбард; 
		Движение.КассоваяСмена = КассоваяСмена;
		Движение.КассоваяОперация = ЭтотОбъект.Ссылка;
		Движение.ФизическоеЛицо = ЭтотОбъект.ФизическоеЛицо;
		Движение.ВидДенежныхСредств = Перечисления.ЛБ_ВидыДенежныхСредств.Наличные;	
		Движение.Сумма = ЭтотОбъект.Сумма;      
		Движение.ВидОперации = ЭтотОбъект.ВидОперации; 
		Движение.ВидДвиженияДС = Перечисления.ЛБ_ВидыДвиженияДС.Приход;
		Движение.Номер = ЭтотОбъект.ПредставлениеНомераПКО;
		Движение.Дт = ЭтотОбъект.Дт;
		Движение.Кт = ЭтотОбъект.Кт;
		Движение.Контрагент = ЭтотОбъект.Контрагент;
		Движение.ФИО = ЭтотОбъект.ПринятоОт;  
		Движение.ДУЛ = ЭтотОбъект.ДУЛ;
		Движение.Основание = ЭтотОбъект.Основание;
		Движение.Приложение = ЭтотОбъект.Приложение;
		Движение.ДополнительнаяИнформация = ЭтотОбъект.ДополнительнаяИнформация; 
		Движение.БанковскаяКарта = ЭтотОбъект.БанковскаяКарта;    
	КонецЕсли;
КонецПроцедуры

КассоваяСмена = Документы.ЛБ_ОперацииКассовойСмены.ПустаяСсылка();
