
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ТекСтрока = Элементы.Список.ТекущиеДанные;  
	Если НЕ ТекСтрока = неопределено Тогда  
		СформироватьНаСервере(ТекСтрока.Ссылка);
	Иначе  
		ОчиститьСтрокиРежимРаботы();		
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПолучитьОбъектПриказа(Идентификатор) 
	СтрП = Список.НайтиПоИдентификатору(Идентификатор); 
	Если СтрП <> Неопределено Тогда
		ВыбОтделение = СтрП.СписокОтделение;
		СформироватьНаСервере(ВыбОтделение); 		
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОчиститьСтрокиРежимРаботы()
	РежимРаботы.Очистить();	
КонецПроцедуры

Функция СформироватьНаСервере(Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_ПриказРежимРаботыРежимРаботы.День КАК ДеньНедели,
	|	ЛБ_ПриказРежимРаботыРежимРаботы.Начало КАК Начало,
	|	ЛБ_ПриказРежимРаботыРежимРаботы.Окончание КАК Окончание,
	|	ЛБ_ПриказРежимРаботыРежимРаботы.ПерерывНачало КАК НачПерерыва,
	|	ЛБ_ПриказРежимРаботыРежимРаботы.ПерерывОкончание КАК КонПерерыва,
	|	ЛБ_ПриказРежимРаботыРежимРаботы.Ломбард КАК Ломбард,
	|	ЛБ_ПриказРежимРаботыРежимРаботы.Выходной КАК Выходной
	|ИЗ
	|	Документ.ЛБ_ПриказРежимРаботы.РежимРаботы КАК ЛБ_ПриказРежимРаботыРежимРаботы
	|ГДЕ
	|	ЛБ_ПриказРежимРаботыРежимРаботы.Ссылка = &Документ"; 
	
	Запрос.УстановитьПараметр("Документ",  Ссылка); 
	
	тз = Запрос.Выполнить().Выгрузить();    
	
	РежимРаботы.Загрузить(тз); 
	
	Возврат 1;
	
КонецФункции

&НаКлиенте
Процедура ФильтрОтделениеПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Отделение", Отделение, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Отделение));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Отделение", Отделение, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Отделение));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка.РежимРаботы.Ломбард", Ломбард, ВидСравненияКомпоновкиДанных.Равно,,  ЗначениеЗаполнено(Ломбард));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Статус", Статус, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Статус));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Подписант", Подписант, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Подписант));
	
КонецПроцедуры

&НаКлиенте
Процедура ЛомбардПриИзменении(Элемент)                                                                                                                                
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка.РежимРаботы.Ломбард", Ломбард, ВидСравненияКомпоновкиДанных.Равно,,  ЗначениеЗаполнено(Ломбард));
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Статус", Статус, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Статус));
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантПриИзменении(Элемент)        

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Подписант", ВернутьФИОИнициалы(Подписант), ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Подписант));
	
КонецПроцедуры

Функция ВернутьФИОИнициалы(Подпис)
	Возврат СокрЛП(Подпис.Фамилия) + " " + СокрЛП(Подпис.Инициалы);
КонецФункции



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект); 

	Директор = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("Директор");
	ПервыйЗаместитель = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ПервыйЗаместительДиректора");
	
	ДиректорСтр = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СокрЛП(Директор)); 
	ПервыйЗаместительСтр = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СокрЛП(ПервыйЗаместитель));
	
	Элементы.Подписант.СписокВыбора.Добавить(Директор, СокрЛП(ДиректорСтр) + " (Директор)"); 
	Элементы.Подписант.СписокВыбора.Добавить(ПервыйЗаместитель, СокрЛП(ПервыйЗаместительСтр) + " (Первый заместитель)"); 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 10
	               |	ЛБ_ИсторияСтатусовПриказовРежимаРаботы.Приказ КАК Приказ,
				   |	ЛБ_ИсторияСтатусовПриказовРежимаРаботы.Приказ.Номер КАК Номер,
				   |	ЛБ_ИсторияСтатусовПриказовРежимаРаботы.Приказ.Дата КАК Дата,
				   |	ЛБ_ИсторияСтатусовПриказовРежимаРаботы.Период КАК Период 
				   |ИЗ
	               |	РегистрСведений.ЛБ_ИсторияСтатусовПриказовРежимаРаботы КАК ЛБ_ИсторияСтатусовПриказовРежимаРаботы
	               |ГДЕ
	               |	ЛБ_ИсторияСтатусовПриказовРежимаРаботы.Статус = &Статус
	               |	И ЛБ_ИсторияСтатусовПриказовРежимаРаботы.Приказ.ВидПриказа = &ВидПриказа
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ИсторияСтатусовПриказовРежимаРаботы.Период УБЫВ";
	Запрос.УстановитьПараметр("Статус", "Архив");
	Запрос.УстановитьПараметр("ВидПриказа", Перечисления.ЛБ_ВидыПриказаРежимаРаботы.Временный);
	
	стрОповещение = "";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		стрОповещение = стрОповещение + "Временный приказ № "+СокрЛП(Выборка.Номер)+" от "+Формат(Выборка.Дата, "ДФ=dd.MM.yy")+ " переведен в архив по окончанию срока действия "+Формат(Выборка.Период, "ДФ=dd.MM.yy")+Символы.ПС;		
	КонецЦикла;
	ОповещениеПереводВАрхив = стрОповещение; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если Врег(ИмяСобытия) = Врег("Запись_РежимРаботы") Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ИсторияСменыСтатусовНаСервере(ТекСтр)
	Если ТекСтр <> Неопределено Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЛБ_ИсторияСтатусовПриказовРежимаРаботы.Период КАК Дата,
		|	ЛБ_ИсторияСтатусовПриказовРежимаРаботы.Статус КАК Статус,
		|	ЛБ_ИсторияСтатусовПриказовРежимаРаботы.Ответственный КАК Ответственный
		|ИЗ
		|	РегистрСведений.ЛБ_ИсторияСтатусовПриказовРежимаРаботы КАК ЛБ_ИсторияСтатусовПриказовРежимаРаботы
		|ГДЕ
		|	ЛБ_ИсторияСтатусовПриказовРежимаРаботы.Приказ = &Приказ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_ИсторияСтатусовПриказовРежимаРаботы.Период";    
		Прик = ТекСтр.Ссылка;
		Запрос.УстановитьПараметр("приказ", ТекСтр.Ссылка);
		
		Таб = Новый ТабличныйДокумент;
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЛБ_ПриказРежимРаботы.ИсторияСменыСтатусов"); 
		
		Обл = Макет.ПолучитьОбласть("Шапка");
		Обл.Параметры.Номер = Прик.Номер; 
		Обл.Параметры.Дата  = Прик.Дата;
		Таб.Вывести(Обл);   
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл   
			Обл = Макет.ПолучитьОбласть("Строка"); 
			ЗаполнитьЗначенияСвойств(Обл.Параметры, Выборка);
			Таб.Вывести(Обл);
		КонецЦикла;  
		
		Таб.ТолькоПросмотр = Истина; 
		Таб.ОтображатьСетку = Ложь; 
		Таб.ОтображатьГруппировки = Ложь;
		Таб.ОтображатьЗаголовки = Ложь;
				
		Возврат Таб;	
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ИсторияСменыСтатусов(Команда)
	ТекСтр = Элементы.Список.ТекущиеДанные;
	Если ТекСтр <> Неопределено Тогда
		
		Таб = ИсторияСменыСтатусовНаСервере(ТекСтр); 
		Таб.Показать("");
	КонецЕсли;
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

