#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Процедура формирует таблицы по табличным частям документа.
//
Процедура ПодготовитьТаблицыДокумента(ТаблицаЦен, ТаблицаНастроек) Экспорт
    Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПрейскурантЦенНаМеталлыЦены.Проба КАК Проба,
	               |	ЛБ_ПрейскурантЦенНаМеталлыЦены.Категория КАК Категория,
	               |	ЛБ_ПрейскурантЦенНаМеталлыЦены.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ЛБ_ПрейскурантЦенНаМеталлыЦены.Цена КАК Цена
	               |ИЗ
	               |	Документ.ЛБ_ПрейскурантЦенНаМеталлы.Цены КАК ЛБ_ПрейскурантЦенНаМеталлыЦены
	               |ГДЕ
	               |	ЛБ_ПрейскурантЦенНаМеталлыЦены.Ссылка = &Ссылка";
		
	РезультатЗапросаПоЦенам = Запрос.Выполнить();

	// Подготовим таблицу товаров для проведения.
	ТаблицаЦен = ПодготовитьТаблицуЦен(РезультатЗапросаПоЦенам);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПрейскурантЦенНаМеталлыНастройкаОтклоненийОтБазовыхЦен.КатегорияОбъектаЗалога КАК КатегорияОбъектаЗалога,
	               |	ЛБ_ПрейскурантЦенНаМеталлыНастройкаОтклоненийОтБазовыхЦен.СхемаКредитования КАК СхемаКредитования,
	               |	ЛБ_ПрейскурантЦенНаМеталлыНастройкаОтклоненийОтБазовыхЦен.Металл КАК Металл,
	               |	ЛБ_ПрейскурантЦенНаМеталлыНастройкаОтклоненийОтБазовыхЦен.Проба КАК Проба,
	               |	ЛБ_ПрейскурантЦенНаМеталлыНастройкаОтклоненийОтБазовыхЦен.ОтклонениеОтБазовойЦены КАК ОтклонениеОтБазовойЦены,
	               |	ЛБ_ПрейскурантЦенНаМеталлыНастройкаОтклоненийОтБазовыхЦен.ЗначениеОтклонения КАК ЗначениеОтклонения
	               |ИЗ
	               |	Документ.ЛБ_ПрейскурантЦенНаМеталлы.НастройкаОтклоненийОтБазовыхЦен КАК ЛБ_ПрейскурантЦенНаМеталлыНастройкаОтклоненийОтБазовыхЦен
	               |ГДЕ
	               |	ЛБ_ПрейскурантЦенНаМеталлыНастройкаОтклоненийОтБазовыхЦен.Ссылка = &Ссылка";
		
	РезультатЗапросаПоНастройкам = Запрос.Выполнить();

	// Подготовим таблицу товаров для проведения.
	ТаблицаНастроек = ПодготовитьТаблицуНастроек(РезультатЗапросаПоНастройкам);

КонецПроцедуры // ПодготовитьТаблицыДокумента()

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  СтруктураШапкиДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблиица значений.
//
Функция ПодготовитьТаблицуЦен(РезультатЗапросаПоЦенам) Экспорт

	ТаблицаЗапроса = РезультатЗапросаПоЦенам.Выгрузить();

	ТаблицаЦен = ТаблицаЗапроса.Скопировать();
	ТаблицаЦен.Очистить();
	ТаблицаЦен.Колонки.Добавить("Ломбард");

	Если Ломбарды.Количество() = 0 Тогда
		ВыборкаЛ = Справочники.ЛБ_Ломбарды.Выбрать();
		Пока ВыборкаЛ.Следующий() Цикл
			Если ВыборкаЛ.ЭтоГруппа тогда
				Продолжить;
			ИначеЕсли ВыборкаЛ.ПометкаУдаления Тогда
				Продолжить;
			КонецЕсли;	

			Для каждого Стр Из  ТаблицаЗапроса Цикл
				Если ЭтотОбъект.НеПроводитьНулевыеЗначения И (Стр.Цена = 0) Тогда
					Продолжить;
				КонецЕсли;	
				НоваяСтр = ТаблицаЦен.Добавить();
				НоваяСтр.Ломбард = ВыборкаЛ.Ссылка;
				НоваяСтр.Проба = Стр.Проба;
				НоваяСтр.Категория = Стр.Категория;
				НоваяСтр.ЕдиницаИзмерения = Стр.ЕдиницаИзмерения;
	            НоваяСтр.Цена = Стр.Цена;
			КонецЦикла;	
		КонецЦикла;	
    Иначе
		Для каждого СтрЛ Из Ломбарды Цикл		
			Для каждого Стр Из  ТаблицаЗапроса Цикл
				Если ЭтотОбъект.НеПроводитьНулевыеЗначения И (Стр.Цена = 0) Тогда
					Продолжить;
				КонецЕсли;	
				НоваяСтр = ТаблицаЦен.Добавить();
				НоваяСтр.Ломбард = СтрЛ.Ломбард;
				НоваяСтр.Проба = Стр.Проба;
				НоваяСтр.Категория = Стр.Категория;
				НоваяСтр.ЕдиницаИзмерения = Стр.ЕдиницаИзмерения;
	            НоваяСтр.Цена = Стр.Цена;
			КонецЦикла;	
		КонецЦикла;	
	КонецЕсли;	
	
	Возврат ТаблицаЦен;

КонецФункции // ПодготовитьТаблицуЦен() 

Функция ПодготовитьТаблицуНастроек(РезультатЗапросаПоНастройкам) Экспорт

	ТаблицаЗапроса = РезультатЗапросаПоНастройкам.Выгрузить();

	ТаблицаНастроек = ТаблицаЗапроса.Скопировать();
	ТаблицаНастроек.Очистить();
	ТаблицаНастроек.Колонки.Добавить("Ломбард");

	Если Ломбарды.Количество() = 0 Тогда
		ВыборкаЛ = Справочники.ЛБ_Ломбарды.Выбрать();
		Пока ВыборкаЛ.Следующий() Цикл
			Если ВыборкаЛ.ЭтоГруппа тогда
				Продолжить;
			ИначеЕсли ВыборкаЛ.ПометкаУдаления Тогда
				Продолжить;
			КонецЕсли;	

			Для каждого Стр Из  ТаблицаЗапроса Цикл
				НоваяСтр = ТаблицаНастроек.Добавить();
				НоваяСтр.Ломбард = ВыборкаЛ.Ссылка;
				НоваяСтр.Металл = Стр.Металл;
				НоваяСтр.Проба = Стр.Проба;
				НоваяСтр.СхемаКредитования = Стр.СхемаКредитования;
				НоваяСтр.КатегорияОбъектаЗалога = Стр.КатегорияОбъектаЗалога;
	            НоваяСтр.ОтклонениеОтБазовойЦены = Стр.ОтклонениеОтБазовойЦены; 
				НоваяСтр.ЗначениеОтклонения = Стр.ЗначениеОтклонения;
			КонецЦикла;	
		КонецЦикла;	
    Иначе
		Для каждого СтрЛ Из Ломбарды Цикл		
			Для каждого Стр Из  ТаблицаЗапроса Цикл
				НоваяСтр = ТаблицаНастроек.Добавить();
				НоваяСтр.Ломбард = СтрЛ.Ломбард;
				НоваяСтр.Металл = Стр.Металл;
				НоваяСтр.Проба = Стр.Проба;
				НоваяСтр.СхемаКредитования = Стр.СхемаКредитования;
				НоваяСтр.КатегорияОбъектаЗалога = Стр.КатегорияОбъектаЗалога;
	            НоваяСтр.ОтклонениеОтБазовойЦены = Стр.ОтклонениеОтБазовойЦены; 
				НоваяСтр.ЗначениеОтклонения = Стр.ЗначениеОтклонения;
			КонецЦикла;	
		КонецЦикла;	
	КонецЕсли;	
	
	Возврат ТаблицаНастроек;

КонецФункции // ПодготовитьТаблицуНастроек()

// По результату запроса по шапке документа формируем движения по регистрам.
//
// Параметры: 
//  РежимПроведения           - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента   - выборка из результата запроса по шапке документа,
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары,
//  ТаблицаПоСкидкам          - таблица значений, содержащая данные для проведения и проверки ТЧ Скидки,
//  ТаблицаПоУслугам          - таблица значений, содержащая данные для проведения и проверки ТЧ "Услуги",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(РежимПроведения, ТаблицаЦен, ТаблицаНастроек, Отказ)
	
	Движения.ЛБ_ПрейскурантЦенНаМеталлы.Записывать = Истина;
    Для Каждого ТекСтрокаЦены Из ТаблицаЦен Цикл
		Движение = Движения.ЛБ_ПрейскурантЦенНаМеталлы.Добавить();
		Движение.Период = Дата;
		Движение.ДатаНачалаДействия = ?(ДатаНачалаДействия = Дата(1,1,1), Дата, ?(ДатаНачалаДействия < Дата, Дата, ДатаНачалаДействия));
		Движение.Ломбард = ТекСтрокаЦены.Ломбард;
		Движение.Проба = ТекСтрокаЦены.Проба;
		Движение.Категория = ТекСтрокаЦены.Категория;
		Движение.ЕдиницаИзмерения = ТекСтрокаЦены.ЕдиницаИзмерения;
		Движение.Цена = ТекСтрокаЦены.Цена;
	КонецЦикла;   
	
	Движения.ЛБ_НастройкаРасчетаОценкиЗалога.Записывать = Истина;
	Для Каждого ТекСтрокаН Из ТаблицаНастроек Цикл
		Движение = Движения.ЛБ_НастройкаРасчетаОценкиЗалога.Добавить();
		Движение.Период = Дата;
		Движение.ДатаНачалаДействия = ?(ДатаНачалаДействия = Дата(1,1,1), Дата, ?(ДатаНачалаДействия < Дата, Дата, ДатаНачалаДействия));
		Движение.Ломбард = ТекСтрокаН.Ломбард; 
		Движение.Металл = ТекСтрокаН.Металл;
		Движение.Проба = ТекСтрокаН.Проба;
		Движение.СхемаКредитования = ТекСтрокаН.СхемаКредитования;
		Движение.КатегорияОбъектаЗалога = ТекСтрокаН.КатегорияОбъектаЗалога;
		Движение.ОтклонениеОтБазовойЦены = ТекСтрокаН.ОтклонениеОтБазовойЦены;
		Движение.ЗначениеОтклонения = ТекСтрокаН.ЗначениеОтклонения;
	КонецЦикла;   		
КонецПроцедуры // ДвиженияПоРегистрам()

#Область ОбработчикиСобытий  

// Процедура - обработчик события "ОбработкаУдаленияПроведения".
//
Процедура ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	ЛБ_ОбщийМодуль.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ОбработкаУдаленияПроведения()


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Перем ТаблицаЦен, ТаблицаНастроек;
	
	ПодготовитьТаблицыДокумента(ТаблицаЦен, ТаблицаНастроек);
		
	// Движения по документу.
	Если НЕ Отказ Тогда
		
		ДвиженияПоРегистрам(РежимПроведения, ТаблицаЦен, ТаблицаНастроек, Отказ);
		
	КонецЕсли;

КонецПроцедуры


#КонецОбласти


#КонецЕсли
