
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОперацияПоЗалогу.НомерЗалоговогоБилета КАК НомерЗалоговогоБилета
	               |ИЗ
	               |	Документ.ЛБ_ОперацияПоЗалогу КАК ЛБ_ОперацияПоЗалогу
	               |ГДЕ
	               |	ЛБ_ОперацияПоЗалогу.ПакетДоговоров = &ПакетДоговоров
	               |	И ЛБ_ОперацияПоЗалогу.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог)
	               |	И НЕ ЛБ_ОперацияПоЗалогу.Ссылка В
	               |				(ВЫБРАТЬ
	               |					ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
	               |				ИЗ
	               |					РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&Период, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
	               |				ГДЕ
	               |					ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент.ПакетДоговоров = &ПакетДоговоров)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерЗалоговогоБилета";
	
	Запрос.УстановитьПараметр("ПакетДоговоров", Параметры.ПакетДоговоров);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		ПоследняяОперация = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(Результат.НомерЗалоговогоБилета, ТекущаяДата());
		
		Если ПоследняяОперация.Регистратор = ПоследняяОперация.ЗалоговыйБилет Тогда
			НоваяСтр = СписокЗБ.Добавить();
			НоваяСтр.НомерЗалоговогоБилета = Результат.НомерЗалоговогоБилета;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗБ(Команда)
	
	МассивЗБ = Новый Массив;
	
	Для каждого Стр Из СписокЗБ Цикл
		Если Стр.Выбран = Истина Тогда
				МассивЗБ.Добавить(Стр.НомерЗалоговогоБилета);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивЗБ.Количество() = 0 Тогда
		Предупреждение("Не выбран залоговый билет.");
	Иначе
		ЭтаФорма.Закрыть(МассивЗБ);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуЗБ(Команда)
	Закрыть()
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИнформациюОЗБПоНомеру(Номер, Дата)
	
	Результат = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(Номер, Дата,, Истина);
	
	Если Результат <> Неопределено Тогда
		ПоследняяОперация = Новый Структура;
		ПоследняяОперация.Вставить("ЗБ", Результат.ЗалоговыйБилет);
		ПоследняяОперация.Вставить("ДокументОперации", Результат.Регистратор);
	Иначе
		ПоследняяОперация = Неопределено;
	КонецЕсли;
	
	Возврат ПоследняяОперация;

КонецФункции
