
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)    
	ВидОперацииСтрока = " (" + Строка(Объект.ВидОперации) + ")";
	ЭтаФорма.Заголовок = "Накладная на отгрузку № " + СокрЛП(Объект.ПредставлениеНомераНакладной) + " от " + Формат(Объект.Дата, "ДЛФ=DT") + ВидОперацииСтрока; 
	СтатусНакладной = ЛБ_УправлениеЛомбардом.ПолучитьСтатусНакладнойНаОтгрузку(ТекущаяДатаСеанса(), Объект.Ссылка);
	ЗаполнитьТаблицуЗалогов();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры   
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура ЗаполнитьТаблицуЗалогов()
	ТаблицаЗалогов.Очистить();
	Для каждого Стр Из Объект.Залоги Цикл
		НоваяСтр = ТаблицаЗалогов.Добавить();
		НоваяСтр.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
		НоваяСтр.НомерЗалоговогоБилета = Стр.ЗалоговыйБилет.НомерЗалоговогоБилета;
		НоваяСтр.Залогодатель = Стр.ЗалоговыйБилет.Залогодатель;  
		СтруктураОписанияОЗ = ЛБ_УправлениеЛомбардом.ОписаниеОбъектаЗалогаДляПечати(Стр.ЗалоговыйБилет, Стр.ОбъектЗалога);
		Описание = СтруктураОписанияОЗ.Описание;
		Если НЕ ПустаяСтрока(СтруктураОписанияОЗ.ОписаниеВ) Тогда
			Описание = Описание + "; Вставки: " + СтруктураОписанияОЗ.ОписаниеВ;
		КонецЕсли;	
		НоваяСтр.ОбъектЗалога = Описание; 
		НоваяСтр.Количество = Стр.Количество; 
		НоваяСтр.Вес = Стр.Вес;
		НоваяСтр.СуммаОценки = Стр.СуммаОценки;
	Конеццикла;	
	ТаблицаЗалогов.Сортировать("Залогодатель, НомерЗалоговогоБилета");
КонецПроцедуры	

&НаКлиенте
Процедура ЗалогиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтрока = Элементы.Залоги.ТекущиеДанные;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Клиент", ТекСтрока.Залогодатель);
	ПараметрыФормы.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет);	 
							
	ОткрытьФорму("Отчет.ЛБ_ИсторияЗалоговогоБилета.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

