

&НаКлиенте
Процедура ПересчитатьНомераСтрокТЗ(Элемент)
	//++од_ 20260422 (0003798)
	Счетчик = 0;
	Для каждого Стр Из ТЗ_УИН Цикл
		Счетчик = Счетчик + 1;
		Стр.НомерСтроки = Счетчик;
	КонецЦикла;
	//--од_ 20260422 (0003798)
КонецПроцедуры

&НаКлиенте
Процедура УИН_ИзделийПриИзменении(Элемент)
	//ПересчитатьНомераСтрокТЗ(Элемент) //++од_ 20260422 (0003798)
КонецПроцедуры

//++од_ 20260422 (0003798)
&НаСервере
Процедура ПроверкаЗаполненияУИН(Текст, ИндексСтроки, Дубль)
	
	Текст = СтрЗаменитьПоРегулярномуВыражению(Текст, "\D", "");
	
	Результат = СтрПодобнаПоРегулярномуВыражению(Текст, "^\d{16}$");
	Если Не Результат Тогда
		//ОбщегоНазначения.СообщитьПользователю(СтрШаблон("УИН должен содержать 16 цифр!"),,СтрШаблон("ЭтаФорма.ТЗ_УИН[%1].УИН", ИндексСтроки),,);
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Введено некорректное значение УИН, которое содержит символы/пробелы. УИН должен содержать 16 цифр!"));
		Дубль = Истина;
	ИначеЕсли Дубль Тогда	
		Дубль = Ложь;
	КонецЕсли;
	
КонецПроцедуры //--од_ 20260422 (0003798)

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//++од_ 20260422 (0003798)
	Если Параметры.ТЗ_УИН.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Данные залога не введены!"),,,,Отказ);
		Возврат;
	КонецЕсли;
	Если Параметры.Свойство("ТолькоПросмотр") Тогда
		Если ЗначениеЗаполнено(Параметры.ТолькоПросмотр) Тогда
			Элементы.УИН_Изделий.ТолькоПросмотр = Параметры.ТолькоПросмотр;
			Элементы.ЗаписатьИЗакрыть.Доступность = Не Параметры.ТолькоПросмотр;
			Элементы.УИН_ИзделийЗаписать.Доступность = Не Параметры.ТолькоПросмотр;
			Элементы.УИН_ИзделийОчиститьСтроку.Доступность = Не Параметры.ТолькоПросмотр;
			Элементы.УИН_ИзделийОчиститьВсе.Доступность = Не Параметры.ТолькоПросмотр;
			Элементы.ЗаписатьИЗакрыть.Видимость = Не Параметры.ТолькоПросмотр;
			Элементы.УИН_ИзделийЗаписать.Видимость = Не Параметры.ТолькоПросмотр;
			Элементы.УИН_ИзделийОчиститьСтроку.Видимость = Не Параметры.ТолькоПросмотр;
			Элементы.УИН_ИзделийОчиститьВсе.Видимость = Не Параметры.ТолькоПросмотр;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("ИмяФормыВладельца") Тогда
		Если Параметры.ИмяФормыВладельца = "ЛБ_ФормаВыдачиЗайма" Тогда
		ИначеЕсли Параметры.ИмяФормыВладельца = "ЛБ_ФормаПереоформленияЗайма" Тогда
			Элементы.УИН_ИзделийЗБ.Видимость = Ложь;
		ИначеЕсли Параметры.ИмяФормыВладельца = "ЛБ_ТекущееСостояниеЗалога" Тогда
			Элементы.НомерСтроки.Видимость = Ложь;
			Элементы.УИН_ИзделийАртикул.Видимость = Истина;
			Элементы.УИН_ИзделийУИН.Видимость = Истина;
			Элементы.УИН_ИзделийЗБ.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого Стр Из Параметры.ТЗ_УИН Цикл
		НоваяСтрока = ТЗ_УИН.Добавить();
		Если Стр.Свойство("НомерСтроки") Тогда
			НоваяСтрока.НомерСтроки = Стр.НомерСтроки;
		КонецЕсли;
		Если Стр.Свойство("Артикул") Тогда
			Элементы.УИН_ИзделийАртикул.Видимость = Истина;
			НоваяСтрока.Артикул = Стр.Артикул;
		КонецЕсли;
		Если Стр.Свойство("УИН") Тогда
			НоваяСтрока.УИН = Стр.УИН;
		КонецЕсли;
		Если Стр.Свойство("ВыделитьВЗалоговыйБилет") Тогда
			НоваяСтрока.ВыделитьВЗалоговыйБилет = Стр.ВыделитьВЗалоговыйБилет;
		КонецЕсли;
	КонецЦикла;
	//--од_ 20260422 (0003798)
КонецПроцедуры

//++од_ 20260422 (0003798)
&НаСервере
Функция ПолучитьСтруктуруПараметров_ТЗ_УИН()
	ТЗ_УИН = ЭтаФорма.ВладелецФормы.Товары.Выгрузить(,"НомерСтроки, УИН, ВыделитьВЗалоговыйБилет");
	Возврат ТЗ_УИН;
КонецФункции //--од_ 20260422 (0003798)

//++од_ 20260422 (0003798)
&НаКлиенте
Процедура Записать(Команда)
	Записать_УИН();
КонецПроцедуры //--од_ 20260422 (0003798)

//++од_ 20260422 (0003798)
&НаКлиенте
Процедура Записать_УИН(ЗапрытьПосле = Ложь)
	Для Каждого Стр Из ЭтотОбъект.ТЗ_УИН Цикл
		Если Стр.НеСохранять Тогда
			Сообщить("Введено некорректное значение УИН, которое содержит символы/пробелы. УИН должен содержать 16 цифр!");
			ЗапрытьПосле = Ложь;
			Прервать;
		КонецЕсли;
		Строка = ЭтотОбъект.ВладелецФормы.Товары[Стр.НомерСтроки - 1];
		Строка.УИН = Стр.УИН;
	КонецЦикла;
	Если ЗапрытьПосле Тогда
		Закрыть();
	КонецЕсли;
КонецПроцедуры //--од_ 20260422 (0003798)

//++од_ 20260422 (0003798)
&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	Записать_УИН(Истина);
КонецПроцедуры //--од_ 20260422 (0003798)

//++од_ 20260422 (0003798)
&НаКлиенте
Процедура ОчиститьВсе(Команда)
	Счетчик = 0;
	Для Каждого Стр Из ЭтотОбъект.ТЗ_УИН Цикл
		Если Стр.УИН <> "" Тогда
			Счетчик = Счетчик + 1;
		КонецЕсли;
	КонецЦикла;	
	
	Если Счетчик > 0 Тогда

		ТекстВопроса = СтрШаблон("Данные УИН %1 шт. будут удалены. Вы уверены?", Счетчик);
		Ответ = Вопрос(ТекстВопроса,
		РежимДиалогаВопрос.ДаНет,
		0, // таймаут в секундах
		КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
		"Внимание!" // (необ.) заголовок
		);
	КонецЕсли;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Для Каждого Стр Из ЭтотОбъект.ТЗ_УИН Цикл
			Стр.УИН = "";
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры //--од_ 20260422 (0003798)

//++од_ 20260422 (0003798)
&НаКлиенте
Процедура ОчиститьСтроку(Команда)
	ТекущийЭлемент.ТекущиеДанные.УИН = "";
КонецПроцедуры //--од_ 20260422 (0003798)

//++од_ 20260422 (0003798)
&НаКлиенте
Процедура УИН_ИзделийУИНПриИзменении(Элемент)
	Если Элементы.УИН_Изделий.ТекущиеДанные.УИН <> "" Тогда
		ПроверкаЗаполненияУИН(Элементы.УИН_Изделий.ТекущиеДанные.УИН, Элементы.УИН_Изделий.ТекущиеДанные.НомерСтроки - 1, Элементы.УИН_Изделий.ТекущиеДанные.Дубль);
	КонецЕсли;
	Если Элементы.УИН_Изделий.ТекущиеДанные.УИН <> "" Тогда
		ПроверитьУникальность(Элементы.УИН_Изделий.ТекущиеДанные.УИН, Элементы.УИН_Изделий.ТекущиеДанные.НомерСтроки - 1, Элементы.УИН_Изделий.ТекущиеДанные.НеКорректно);
	КонецЕсли;
	Если Элементы.УИН_Изделий.ТекущиеДанные.Дубль Или Элементы.УИН_Изделий.ТекущиеДанные.НеКорректно Тогда
		Элементы.УИН_Изделий.ТекущиеДанные.НеСохранять = Истина;
	Иначе
		Элементы.УИН_Изделий.ТекущиеДанные.НеСохранять = Ложь;
	КонецЕсли;
	
КонецПроцедуры //--од_ 20260422 (0003798)

//++од_ 20260422 (0003798)
&НаСервере
Процедура ПроверитьУникальность(Текст, ИндексСтроки, НеКорректно)
	Отбор = Новый Структура;
	Отбор.Вставить("УИН", Текст);
	МассивСтрок = ТЗ_УИН.НайтиСтроки(Отбор);
	Если МассивСтрок.Количество() > 1 Тогда
		//ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Данный УИН уже заведен по другой строке!"),,СтрШаблон("ЭтаФорма.ТЗ_УИН[%1].УИН", ИндексСтроки),,);
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Данный УИН уже заведен по другой строке!"));
		НеКорректно = Истина;
	ИначеЕсли НеКорректно Тогда	
		НеКорректно = Ложь;
	КонецЕсли;
КонецПроцедуры //--од_ 20260422 (0003798)