
Процедура ОбработкаПроведения(Отказ, Режим) 
	Если ВидПриказа = Перечисления.ЛБ_ВидыПриказаРежимаРаботы.Временный и 
		ДатаОкончания < ДатаНачала Тогда
		Сообщить("Дата окончания не может быть меньше даты начала");
		Отказ = Истина;		 
	КонецЕсли;
	Если ДатаНачала < Дата Тогда 
		Сообщить("Дата ввода в действие приказа не должна быть ранее даты создания");
		Отказ = Истина;		 
	КонецЕсли;
	Если ВидПриказа=Перечисления.ЛБ_ВидыПриказаРежимаРаботы.Временный Тогда 
		Если Не ЗначениеЗаполнено(ДатаОкончания) Тогда 
			Сообщить("Заполните дату окончания");
			Отказ = Истина;	
		КонецЕсли;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Подписант) Тогда 
		Сообщить("Заполните подписанта");
		Отказ = Истина;	
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Отделение) Тогда 
		Сообщить("Заполните отделение");
		Отказ = Истина;	
	КонецЕсли; 
	Если РежимРаботы.Количество() = 0 Тогда
		Сообщить("Заполните режим работы ломбарда");
		Отказ = Истина;	
	КонецЕсли;   
	
	ЕстьФактПриказ = ЕстьФактическийПриказ().Есть; 
	
	Если ВидПриказа = Перечисления.ЛБ_ВидыПриказаРежимаРаботы.Постоянный и ПроверитьСтатусФактДругиеПриказы() Тогда 
		//Отказ = Истина;	
	КонецЕсли;  
	Если ВидПриказа = Перечисления.ЛБ_ВидыПриказаРежимаРаботы.Временный и НЕ ЕстьФактПриказ Тогда
		Сообщить("По отделению отсутствует постоянный приказ. Создание временного приказа недоступно");	
		Отказ = Истина;
	КонецЕсли;
    	
	
	//Должны быть следующие проверки: 
	//- колонки «Начало», «Окончание» - не должны содержать одинаковое значение,
	//- колонки «Перерыв начало», «Перерыв окончание» - не должны содержать одинаковое значение,
	//- значения колонок «Начало»/«Окончание» и «Перерыв начало»/ «Перерыв окончание» не могут быть одинаковыми.
	//- если проставлен чек-бокс «выходной» - колонки «Начало», «Окончание», «Перерыв начало», «Перерыв окончание» не должны быть доступны к заполнению. 
	
	Для каждого стр из РежимРаботы Цикл
		Если ЗначениеЗаполнено(стр.Начало) и ЗначениеЗаполнено(стр.Окончание) и стр.Начало = стр.Окончание Тогда
			Сообщить("В строке: "+СокрЛП(стр.НомерСтроки)+ " <<начало>> и <<окончание>> не должны быть равны");
			Отказ = Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(стр.ПерерывНачало) и ЗначениеЗаполнено(стр.ПерерывОкончание) и стр.ПерерывНачало = стр.ПерерывОкончание Тогда
			Сообщить("В строке: "+СокрЛП(стр.НомерСтроки)+ " <<перерыв начало>> и <<перерыв окончание>> не должны быть равны");
			Отказ = Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(стр.Начало) и ЗначениеЗаполнено(стр.ПерерывНачало) и стр.Начало = стр.ПерерывНачало Тогда
			Сообщить("В строке: "+СокрЛП(стр.НомерСтроки)+ " <<начало>> и <<перерыв начало>> не должны быть равны");
			Отказ = Истина;
		КонецЕсли; 
		Если ЗначениеЗаполнено(стр.Окончание) и ЗначениеЗаполнено(стр.ПерерывОкончание) и стр.Окончание = стр.ПерерывОкончание Тогда
			Сообщить("В строке: "+СокрЛП(стр.НомерСтроки)+ " <<окончание>> и <<перерыв окончание>> не должны быть равны");
			Отказ = Истина;
		КонецЕсли;  
		
		Если ЗначениеЗаполнено(стр.Окончание) и ЗначениеЗаполнено(стр.ПерерывОкончание) и стр.ПерерывОкончание >  стр.Окончание Тогда
			Сообщить("В строке: "+СокрЛП(стр.НомерСтроки)+ " <<перерыв окончание>> не может быть позже окончания работы");
			Отказ = Истина;
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(стр.ПерерывНачало) и Не ЗначениеЗаполнено(стр.ПерерывОкончание) Тогда
			Сообщить("В строке: "+СокрЛП(стр.НомерСтроки)+ " заполните окончание перерыва");
			Отказ = Истина;  
		КонецЕсли; 
		Если не ЗначениеЗаполнено(стр.ПерерывНачало) и ЗначениеЗаполнено(стр.ПерерывОкончание) Тогда
			Сообщить("В строке: "+СокрЛП(стр.НомерСтроки)+ " заполните начало перерыва");
			Отказ = Истина;  
		КонецЕсли;
		
		Норм = Ложь;
		Если (ЗначениеЗаполнено(стр.Начало) и ЗначениеЗаполнено(стр.Окончание)) или стр.Выходной Тогда
			Норм = Истина;
		КонецЕсли;
		
		Если Не норм Тогда 
			Сообщить("В строке: "+СокрЛП(стр.НомерСтроки)+ " не заполнен график работы");
			Отказ = Истина;
		КонецЕсли;			
	КонецЦикла; 
	
	
	КоличествоДнейРасчета = 365;
	
	Если Не Отказ Тогда  
		Для Каждого стр Из РежимРаботы Цикл 
			
			Если ЗначениеЗаполнено(ДатаОкончания) Тогда
				КоличествоДнейВперед = (НачалоДня(ДатаОкончания) - НачалоДня(ДатаНачала))/86400;
			Иначе
				КоличествоДнейВперед = КоличествоДнейРасчета; 
			КонецЕсли;
			
			Для инд = 0 по КоличествоДнейВперед Цикл
				ДатаВРегистр = НачалоДня(ДатаНачала) + 86400*инд; 
				Если ДеньНедели(ДатаВРегистр) = стр.НомерДня Тогда
					
					Движ = РегистрыСведений.ЛБ_РабочиеДниЛомбарда.СоздатьМенеджерЗаписи();
					Движ.Период = ДатаВРегистр;
					Движ.Приказ = Ссылка;
					Движ.Выходной = стр.Выходной;
					Движ.Ломбард = стр.Ломбард;
					Движ.ДеньНедели = стр.День;
					Движ.НомерДня = стр.НомерДня;
					Движ.Начало = стр.Начало;
					Движ.Окончание = стр.Окончание;
					Движ.ПерерывНачало = стр.ПерерывНачало;
					Движ.ПерерывОкончание = стр.ПерерывОкончание;
					Движ.РабочиеМинуты = (стр.Окончание - стр.Начало - (стр.ПерерывОкончание - стр.ПерерывНачало))/60; 
					Движ.Записать();
					
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;	
	
	
КонецПроцедуры

Функция ПроверитьСтатусФактДругиеПриказы()
    Рез = ЕстьФактическийПриказ(); 
	
	Если Рез.Есть Тогда 
		//Сообщить("Уже есть приказ со статусом Факт: Приказ № "+СокрЛП(Рез.Номер)+" от "+Формат(Рез.Дата,"ДФ=dd.MM.yy")+", по отделению: "+СокрЛП(Отделение));
	КонецЕсли;
	
	Возврат Рез.Есть; 
КонецФункции




Функция ЕстьФактическийПриказ()
	
	Рез = Новый Структура;
	Рез.Вставить("Есть", Ложь); 
	Рез.Вставить("Дата", "");
    Рез.Вставить("Номер", "");

	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПриказРежимРаботы.Ссылка КАК Приказ,
	               |	ЛБ_ПриказРежимРаботы.Отделение КАК Отделение,
	               |	ЛБ_ПриказРежимРаботы.Номер КАК Номер,
	               |	ЛБ_ПриказРежимРаботы.Дата КАК Дата
	               |ИЗ
	               |	Документ.ЛБ_ПриказРежимРаботы КАК ЛБ_ПриказРежимРаботы
	               |ГДЕ
	               |	ЛБ_ПриказРежимРаботы.Отделение = &Отделение
	               |	И ЛБ_ПриказРежимРаботы.Ссылка.Проведен = ИСТИНА
	               |	И ЛБ_ПриказРежимРаботы.Ссылка.Архив = ЛОЖЬ
	               |	И ЛБ_ПриказРежимРаботы.Ссылка <> &ТекПриказ
	               |	И ЛБ_ПриказРежимРаботы.Ссылка.ВидПриказа = &ВидПриказа
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ПриказРежимРаботы.Ссылка,
	               |	ЛБ_ПриказРежимРаботы.Отделение,
	               |	ЛБ_ПриказРежимРаботы.Номер,
	               |	ЛБ_ПриказРежимРаботы.Дата";
	Запрос.УстановитьПараметр("Статус", Перечисления.ЛБ_СтатусыПриказовРежимРаботы.Архив);
	Запрос.УстановитьПараметр("ВидПриказа", Перечисления.ЛБ_ВидыПриказаРежимаРаботы.Постоянный);
	Запрос.УстановитьПараметр("Отделение", Отделение);
	Запрос.УстановитьПараметр("ТекПриказ", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Рез.Вставить("Есть", Истина); 
		Рез.Вставить("Дата", Выборка.Дата);
    	Рез.Вставить("Номер", Выборка.Номер);

	КонецЦикла;
	
	Возврат Рез;
	
КонецФункции


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ВидПриказа=Перечисления.ЛБ_ВидыПриказаРежимаРаботы.Временный Тогда
		ПроверяемыеРеквизиты.Добавить("ДатаОкончания");
	КонецЕсли;
	ПроверяемыеРеквизиты.Добавить("Подписант");
	ПроверяемыеРеквизиты.Добавить("Отделение");

КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	Если Архив Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	Если Не Отказ Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_ИсторияСтатусовПриказовРежимаРаботыСрезПоследних.Статус КАК Статус
		               |ИЗ
		               |	РегистрСведений.ЛБ_ИсторияСтатусовПриказовРежимаРаботы.СрезПоследних КАК ЛБ_ИсторияСтатусовПриказовРежимаРаботыСрезПоследних
		               |ГДЕ
		               |	ЛБ_ИсторияСтатусовПриказовРежимаРаботыСрезПоследних.Приказ = &Приказ";
		Запрос.УстановитьПараметр("Приказ", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ПредСтатус = Выборка.Статус;
		Иначе
			ПредСтатус = "";
		КонецЕсли;
		
		Если Архив Тогда
			Стат = "Архив";
		Иначе
			Если Проведен Тогда
				Стат = "Факт";
			Иначе
				Стат = "Проект";
			КонецЕсли;
		КонецЕсли;
		
		Если ПредСтатус <> Стат Тогда
			
			Движ = РегистрыСведений.ЛБ_ИсторияСтатусовПриказовРежимаРаботы.СоздатьМенеджерЗаписи();
			Движ.Период = ТекущаяДата();
			Движ.Приказ = Ссылка;
			Движ.Статус = Стат;
			Если ПараметрыСеанса.ТекущийПользователь = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("Пользователь_Робот") Тогда
				Движ.Ответственный = ПараметрыСеанса.ТекущийПользователь.Сотрудник;
			Иначе
				Движ.Ответственный = ПараметрыСеанса.ТекущийСотрудник;
			КонецЕсли;
			Движ.Записать(); 
		КонецЕсли; 
		
		Если Архив Тогда
			Стат2 = Перечисления.ЛБ_СтатусыПриказовРежимРаботы.Архив;
		Иначе
			Если Проведен Тогда
				Стат2 = Перечисления.ЛБ_СтатусыПриказовРежимРаботы.Факт;
			Иначе
				Стат2 = Перечисления.ЛБ_СтатусыПриказовРежимРаботы.Проект;
			КонецЕсли;
		КонецЕсли;   
		
		Движ = РегистрыСведений.ЛБ_СтатусПриказаРежимРаботы.СоздатьМенеджерЗаписи();
		Движ.Приказ = Ссылка;
		Движ.Статус = Стат2;
		Движ.Записать(); 		
		
		
	КонецЕсли; 
КонецПроцедуры


