
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	Если Параметры.Свойство("ВидАдреса") Тогда
		ВидАдреса = Параметры.ВидАдреса;
		Если ВидАдреса = 0 Тогда
			Элементы.ГруппаПричиныИзменения.Заголовок = "Причина изменения адреса по прописке";
		ИначеЕсли ВидАдреса = 1 Тогда
			Элементы.ГруппаПричиныИзменения.Заголовок = "Причина изменения фактического адреса";
	    ИначеЕсли ВидАдреса = 2 Тогда
			Элементы.ГруппаПричиныИзменения.Заголовок = "Причина изменения почтового адреса";
        КонецЕсли;
	Иначе	
		Возврат; 
	КонецЕсли;	
	
	ПричинаИзменения_ИсправлениеАдреса = Справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.ИсправлениеДанныхКонтактнаяИнформация;
	ПричинаИзменения_СменаАдреса          = Справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.ИзменениеАдреса;   
	ВыбраноИсправление = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)	
	СтруктураВозврата = новый Структура();	
	Если ВыбранаСмена Тогда
		СтруктураВозврата.Вставить("ПричинаИзменения", ПричинаИзменения_СменаАдреса);
	ИначеЕсли ВыбраноИсправление Тогда          
		СтруктураВозврата.Вставить("ПричинаИзменения", ПричинаИзменения_ИсправлениеАдреса);
	КонецЕсли; 
	ЕстьВыбор = Истина;
	Закрыть(СтруктураВозврата);
КонецПроцедуры

&НаКлиенте
Процедура ВыбраноИсправлениеПриИзменении(Элемент)
	
	Если ВыбраноИсправление Тогда
	    ВыбранаСмена = Ложь;
	КонецЕсли; 
	
КонецПроцедуры 

&НаКлиенте
Процедура ВыбранаСменаПриИзменении(Элемент)
	
	Если ВыбранаСмена Тогда  
	    ВыбраноИсправление = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если НЕ ЕстьВыбор Тогда
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры





	