////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события "Перед записью"
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		Сообщить("Не заполнено наименование!");
		Отказ = Истина;
	КонецЕсли;	
	
	Если НЕ ЭтоГруппа Тогда
		
		ПоследнийРедактор = ПараметрыСеанса.ТекущийПользователь;
		ДатаПоследнегоИзменения = ТекущаяДата();
		
	КонецЕсли;	
	
	//ХранилищеШаблонаТекст = ПолучитьТекстИзХранилищаЗначения(ХранилищеШаблона,ВидДокумента);

КонецПроцедуры
	
