
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ЗалоговыйБилет") Тогда
		Отчет.ЗалоговыйБилет = Параметры.ЗалоговыйБилет;		
	КонецЕсли; 
	Если Параметры.Свойство("ОбъектЗалога") Тогда
		Отчет.ОбъектЗалога = Параметры.ОбъектЗалога;    
	КонецЕсли; 
	
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь; 
	Если НЕ ТекПользователь.ЭтоЛомбард Тогда
		Если УправлениеДоступом.ЕстьРоль("ЛБ_СотрудникЦО") Тогда
			СотрудникЦО = Истина;
		КонецЕсли;	  
	КонецЕсли;	
	
	Если НЕ СотрудникЦО Тогда
		Отказ = Истина;
	КонецЕсли;	
		
	Если ЗначениеЗаполнено(Отчет.ЗалоговыйБилет) И  ЗначениеЗаполнено(Отчет.ОбъектЗалога) Тогда
		СформироватьНаСервере();
	Иначе
		Отказ = Истина;
	КонецЕсли;	     
КонецПроцедуры    

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьНачальнуюДату()  
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ЗалоговыйБилет", Отчет.ЗалоговыйБилет); 
	Запрос.УстановитьПараметр("ОбъектЗалога", Отчет.ОбъектЗалога);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус КАК Статус,
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Период КАК ДатаНач
	               |ИЗ
	               |	РегистрСведений.ЛБ_СтатусыОбъектовЗалогаВНакладной.СрезПоследних(
	               |			,
	               |			ЗалоговыйБилет = &ЗалоговыйБилет
	               |				И ОбъектЗалога = &ОбъектЗалога) КАК ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаНач УБЫВ";
    Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		Если Выборка.Статус = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.Отгружено Тогда
			Возврат Выборка.ДатаНач;
		КонецЕсли;	
	КонецЕсли;	                    
	Возврат Дата(1,1,1);
КонецФункции   

&НаСервере
Функция ПолучитьДолгПоЗайму(Дата)
	Запрос = Новый Запрос;   
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ЗалоговыйБилет", Отчет.ЗалоговыйБилет); 
	Запрос.УстановитьПараметр("ОбъектЗалога", Отчет.ОбъектЗалога);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаДолгаЗайма КАК СуммаДолга
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(
	               |			&Дата,
	               |			ЗалоговыйБилет = &ЗалоговыйБилет
	               |				И ОбъектЗалога = &ОбъектЗалога) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СуммаДолга;
	КонецЕсли;
	Возврат 0;
КонецФункции	

&НаСервере
Процедура СформироватьНаСервере() 
	ДокументРезультат.Очистить(); 
    Макет 			 = Отчет.РеквизитМакет;
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка"); 
	ОбластьШапка.Параметры.Ломбард = Отчет.ЗалоговыйБилет.Ломбард; 
	
	Вес  = 0;  
	СуммаОценки = 0; 
	СуммаСсуды = 0;
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ЗалоговыйБилет", Отчет.ЗалоговыйБилет); 
	Запрос.УстановитьПараметр("ОбъектЗалога", Отчет.ОбъектЗалога);  
	Запрос.Текст  = "ВЫБРАТЬ
	                |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
	                |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
	                |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
	                |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК Вес,
	                |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМакс КАК СуммаОценки,
	                |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаСсуды КАК СуммаСсуды
	                |ИЗ
	                |	РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
	                |			,
	                |			ЗалоговыйБилет = &ЗалоговыйБилет
	                |				И ОбъектЗалога = &ОбъектЗалога) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних";  
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОбластьШапка.Параметры.Артикул = Выборка.Артикул; 
		ОбластьШапка.Параметры.ВидИзделия = Выборка.ВидИзделия;
		ОбластьШапка.Параметры.Проба = Выборка.Проба;
		Вес  = Выборка.Вес;  
		СуммаОценки = Выборка.СуммаОценки; 
		СуммаСсуды = Выборка.СуммаСсуды;
	КонецЕсли;	
	ДокументРезультат.Вывести(ОбластьШапка); 

	
	ДатаНач = ПолучитьНачальнуюДату(); 
	
	Если НЕ ДатаНач = Дата(1,1,1) Тогда 		 
		 Запрос.УстановитьПараметр("Дата", ДатаНач); 
		 Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		                |	ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Период КАК Период,
		                |	ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Регистратор КАК Регистратор,
		                |	ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.ПодразделениеОтправитель КАК Отправитель,
		                |	ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.СкладОтправитель КАК СкладОтправитель,
		                |	ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.ПодразделениеПолучатель КАК Получатель,
		                |	ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.СкладПолучатель КАК СкладПолучатель,
		                |	ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
		                |	ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Ответственный КАК Ответственный,
		                |	0 КАК Цена,
		                |	НЕОПРЕДЕЛЕНО КАК Группа
		                |ИЗ
		                |	РегистрСведений.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам КАК ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам
		                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЛБ_ОбъектыЗалога КАК ЛБ_ОбъектыЗалога
		                |		ПО ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Регистратор = ЛБ_ОбъектыЗалога.Регистратор
		                |ГДЕ
		                |	ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Период >= &Дата
		                |	И ЛБ_ОбъектыЗалога.ОбъектЗалога = &ОбъектЗалога
		                |	И ЛБ_ОбъектыЗалога.ЗалоговыйБилет = &ЗалоговыйБилет
		                |	И (ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Регистратор ССЫЛКА Документ.ЛБ_ИзменениеСтатусаНакладной
		                |			ИЛИ ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Регистратор ССЫЛКА Документ.ЛБ_КорректировкаНакладной
		                |			ИЛИ ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
		                |			ИЛИ ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Регистратор ССЫЛКА Документ.ЛБ_Реализация)
		                |
		                |ОБЪЕДИНИТЬ ВСЕ
		                |
		                |ВЫБРАТЬ
		                |	ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Период,
		                |	ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Регистратор,
		                |	ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.ПодразделениеОтправитель,
		                |	ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.СкладОтправитель,
		                |	ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.ПодразделениеПолучатель,
		                |	ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.СкладПолучатель,
		                |	ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.НакладнаяНаОтгрузку,
		                |	ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Ответственный,
		                |	0,
		                |	НЕОПРЕДЕЛЕНО
		                |ИЗ
		                |	РегистрСведений.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам КАК ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам
		                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛБ_ОприходованиеОбъектовЗалога.Товары КАК ЛБ_ОприходованиеОбъектовЗалогаТовары
		                |		ПО ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Регистратор = ЛБ_ОприходованиеОбъектовЗалогаТовары.Ссылка
		                |ГДЕ
		                |	ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Период >= &Дата
		                |	И ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Регистратор ССЫЛКА Документ.ЛБ_ОприходованиеОбъектовЗалога
		                |	И ЛБ_ОприходованиеОбъектовЗалогаТовары.ЗалоговыйБилет = &ЗалоговыйБилет
		                |	И ЛБ_ОприходованиеОбъектовЗалогаТовары.ОбъектЗалога = &ОбъектЗалога
		                |
		                |ОБЪЕДИНИТЬ ВСЕ
		                |
		                |ВЫБРАТЬ
		                |	ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Период,
		                |	ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Регистратор,
		                |	ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.ПодразделениеОтправитель,
		                |	ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.СкладОтправитель,
		                |	ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.ПодразделениеПолучатель,
		                |	ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.СкладПолучатель,
		                |	ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.НакладнаяНаОтгрузку,
		                |	ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Ответственный,
		                |	0,
		                |	НЕОПРЕДЕЛЕНО
		                |ИЗ
		                |	РегистрСведений.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам КАК ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам
		                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛБ_ПеремещениеОбъектовЗалога.Товары КАК ЛБ_ПеремещениеОбъектовЗалогаТовары
		                |		ПО ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Регистратор = ЛБ_ПеремещениеОбъектовЗалогаТовары.Ссылка
		                |ГДЕ
		                |	ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Период >= &Дата
		                |	И ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Регистратор ССЫЛКА Документ.ЛБ_ПеремещениеОбъектовЗалога
		                |	И ЛБ_ПеремещениеОбъектовЗалогаТовары.ЗалоговыйБилет = &ЗалоговыйБилет
		                |	И ЛБ_ПеремещениеОбъектовЗалогаТовары.ОбъектЗалога = &ОбъектЗалога
		                |
		                |ОБЪЕДИНИТЬ ВСЕ
		                |
		                |ВЫБРАТЬ
		                |	ЛБ_ЦеныОбъектовЗалога.Период,
		                |	ЛБ_ЦеныОбъектовЗалога.Регистратор,
		                |	НЕОПРЕДЕЛЕНО,
		                |	НЕОПРЕДЕЛЕНО,
		                |	НЕОПРЕДЕЛЕНО,
		                |	НЕОПРЕДЕЛЕНО,
		                |	НЕОПРЕДЕЛЕНО,
		                |	ЛБ_ЦеныОбъектовЗалога.Регистратор.Ответственный,
		                |	ЛБ_ЦеныОбъектовЗалога.Цена,
		                |	НЕОПРЕДЕЛЕНО
		                |ИЗ
		                |	РегистрСведений.ЛБ_ЦеныОбъектовЗалога КАК ЛБ_ЦеныОбъектовЗалога
		                |ГДЕ
		                |	ЛБ_ЦеныОбъектовЗалога.ЗалоговыйБилет = &ЗалоговыйБилет
		                |	И ЛБ_ЦеныОбъектовЗалога.ОбъектЗалога = &ОбъектЗалога
		                |
		                |ОБЪЕДИНИТЬ ВСЕ
		                |
		                |ВЫБРАТЬ
		                |	ЛБ_ГруппыОбъектовЗалога.Период,
		                |	ЛБ_ГруппыОбъектовЗалога.Регистратор,
		                |	НЕОПРЕДЕЛЕНО,
		                |	НЕОПРЕДЕЛЕНО,
		                |	НЕОПРЕДЕЛЕНО,
		                |	НЕОПРЕДЕЛЕНО,
		                |	НЕОПРЕДЕЛЕНО,
		                |	НЕОПРЕДЕЛЕНО,
		                |	0,
		                |	ЛБ_ГруппыОбъектовЗалога.Группа
		                |ИЗ
		                |	РегистрСведений.ЛБ_ГруппыОбъектовЗалога КАК ЛБ_ГруппыОбъектовЗалога
		                |ГДЕ
		                |	ЛБ_ГруппыОбъектовЗалога.ЗалоговыйБилет = &ЗалоговыйБилет
		                |	И ЛБ_ГруппыОбъектовЗалога.ОбъектЗалога = &ОбъектЗалога
		                |
		                |ОБЪЕДИНИТЬ ВСЕ
		                |
		                |ВЫБРАТЬ
		                |	ЛБ_СостояниеЗалоговогоБилета.Период,
		                |	ЛБ_СостояниеЗалоговогоБилета.Регистратор,
		                |	НЕОПРЕДЕЛЕНО,
		                |	НЕОПРЕДЕЛЕНО,
		                |	НЕОПРЕДЕЛЕНО,
		                |	НЕОПРЕДЕЛЕНО,
		                |	НЕОПРЕДЕЛЕНО,
		                |	НЕОПРЕДЕЛЕНО,
		                |	0,
		                |	НЕОПРЕДЕЛЕНО
		                |ИЗ
		                |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета КАК ЛБ_СостояниеЗалоговогоБилета
		                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_СостояниеОбъектаЗалога КАК ЛБ_СостояниеОбъектаЗалога
		                |		ПО ЛБ_СостояниеЗалоговогоБилета.Регистратор = ЛБ_СостояниеОбъектаЗалога.Регистратор
		                |ГДЕ
		                |	ЛБ_СостояниеЗалоговогоБилета.Период >= &Дата
		                |	И ЛБ_СостояниеЗалоговогоБилета.СтатусЗалоговогоБилета = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыЗалоговыхБилетов.ГотовКОтправкеОХ)
		                |	И ЛБ_СостояниеОбъектаЗалога.ОбъектЗалога = &ОбъектЗалога
		                |	И ЛБ_СостояниеОбъектаЗалога.ЗалоговыйБилет = &ЗалоговыйБилет
		                |
		                |УПОРЯДОЧИТЬ ПО
		                |	Период";         
		Выборка = Запрос.Выполнить().Выбрать();  
		
		УчетнаяЦена = 0;
		Группа = Справочники.ЛБ_ГруппыОбъектовЗалога.ПустаяСсылка();
		Пока Выборка.Следующий() Цикл 
			Если ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.ЛБ_ИзменениеСтатусаНакладной") Или
				 ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.ЛБ_КорректировкаНакладной") Тогда   
				ОбластьСтрока  = Макет.ПолучитьОбласть("Строка"); 
				ОбластьСтрока.Параметры.Дата = Выборка.Период;
				ОбластьСтрока.Параметры.Номер = Выборка.НакладнаяНаОтгрузку.ПредставлениеНомераНакладной; 
				ОбластьСтрока.Параметры.Документ = "Накладная на отгрузку";  
				ОбластьСтрока.Параметры.Кол = 1;
				ОбластьСтрока.Параметры.Вес = Вес;
				ОбластьСтрока.Параметры.Оценка = СуммаОценки;
				ОбластьСтрока.Параметры.Займ = ПолучитьДолгПоЗайму(Выборка.Период);
				ОбластьСтрока.Параметры.Отправитель = Выборка.Отправитель;	
				ОбластьСтрока.Параметры.СкладОтправитель = Выборка.СкладОтправитель;	
				ОбластьСтрока.Параметры.Получатель = Выборка.Получатель;	
				ОбластьСтрока.Параметры.СкладПолучатель = Выборка.СкладПолучатель;
				ОбластьСтрока.Параметры.Группа = Группа;
				ОбластьСтрока.Параметры.УчетнаяЦена = УчетнаяЦена;
				ОбластьСтрока.Параметры.Ответственный = Выборка.Ответственный;    
				СтруктураП = Новый Структура;
				СтруктураП.Вставить("Документ", Выборка.НакладнаяНаОтгрузку); 
				ОбластьСтрока.Параметры.СтруктураП = СтруктураП;
				ДокументРезультат.Вывести(ОбластьСтрока); 
			ИначеЕсли ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.ЛБ_ОприходованиеОбъектовЗалога") Тогда 
				ОбластьСтрока  = Макет.ПолучитьОбласть("Строка");
				ОбластьСтрока.Параметры.Дата = Выборка.Период;
				ОбластьСтрока.Параметры.Номер = Выборка.Регистратор.ПредставлениеНомераПоступления;   
				ОбластьСтрока.Параметры.Документ = "Оприходование объектов залога"; 
				Если Выборка.Регистратор.Категория = Перечисления.ЛБ_КатегорииПоступленияОбъектовЗалога.Сумка Тогда
					ОбластьСтрока.Параметры.Документ = ОбластьСтрока.Параметры.Документ + " (сумка)";
				КонецЕсли;	 
				ОбластьСтрока.Параметры.Кол = 1;
				ОбластьСтрока.Параметры.Вес = Вес;
				ОбластьСтрока.Параметры.Оценка = СуммаОценки;
				ОбластьСтрока.Параметры.Займ = ПолучитьДолгПоЗайму(Выборка.Период);
				ОбластьСтрока.Параметры.Отправитель = "-";	
				ОбластьСтрока.Параметры.СкладОтправитель = "-";	
				ОбластьСтрока.Параметры.Получатель = Выборка.Получатель;	
				ОбластьСтрока.Параметры.СкладПолучатель = Выборка.СкладПолучатель; 
				ОбластьСтрока.Параметры.Группа = Группа;
				ОбластьСтрока.Параметры.УчетнаяЦена = УчетнаяЦена;
				ОбластьСтрока.Параметры.Ответственный = Выборка.Ответственный; 
				СтруктураП = Новый Структура;
				СтруктураП.Вставить("Документ", Выборка.Регистратор); 
				ОбластьСтрока.Параметры.СтруктураП = СтруктураП;
				ДокументРезультат.Вывести(ОбластьСтрока); 
            ИначеЕсли ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.ЛБ_ПеремещениеОбъектовЗалога") Тогда 
				ОбластьСтрока  = Макет.ПолучитьОбласть("Строка");
				ОбластьСтрока.Параметры.Дата = Выборка.Период;
				ОбластьСтрока.Параметры.Номер = Выборка.Регистратор.ПредставлениеНомераПеремещения;   
				ОбластьСтрока.Параметры.Документ = "Перемещение объектов залогов"; 
				Если Выборка.Регистратор.Категория = Перечисления.ЛБ_КатегорииПоступленияОбъектовЗалога.Сумка Тогда
					ОбластьСтрока.Параметры.Документ = ОбластьСтрока.Параметры.Документ + " (сумка)";
				КонецЕсли;	 
				ОбластьСтрока.Параметры.Кол = 1;
				ОбластьСтрока.Параметры.Вес = Вес;
				ОбластьСтрока.Параметры.Оценка = СуммаОценки;
				ОбластьСтрока.Параметры.Займ = ПолучитьДолгПоЗайму(Выборка.Период);
				ОбластьСтрока.Параметры.Отправитель = Выборка.Отправитель;	
				ОбластьСтрока.Параметры.СкладОтправитель = Выборка.СкладОтправитель;	
				ОбластьСтрока.Параметры.Получатель = Выборка.Получатель;	
				ОбластьСтрока.Параметры.СкладПолучатель = Выборка.СкладПолучатель;
				ОбластьСтрока.Параметры.Группа = Группа;
				ОбластьСтрока.Параметры.УчетнаяЦена = УчетнаяЦена;
				ОбластьСтрока.Параметры.Ответственный = Выборка.Ответственный; 
				СтруктураП = Новый Структура;
				СтруктураП.Вставить("Документ", Выборка.Регистратор); 
				ОбластьСтрока.Параметры.СтруктураП = СтруктураП;
				ДокументРезультат.Вывести(ОбластьСтрока); 
            ИначеЕсли ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.ЛБ_Реализация") Тогда 
				ОбластьСтрока  = Макет.ПолучитьОбласть("Строка1");
				ОбластьСтрока.Параметры.Дата = Выборка.Период;
				ОбластьСтрока.Параметры.Номер = Выборка.Регистратор.Номер;   
				ОбластьСтрока.Параметры.Документ = "Реализация невостребованных залогов"; 
				ОбластьСтрока.Параметры.Кол = 1;
				ОбластьСтрока.Параметры.Вес = Вес;
				ОбластьСтрока.Параметры.Оценка = СуммаОценки;
				ОбластьСтрока.Параметры.Займ = ПолучитьДолгПоЗайму(Выборка.Период);
				ОбластьСтрока.Параметры.Отправитель = Выборка.Отправитель;	
				ОбластьСтрока.Параметры.СкладОтправитель = Выборка.СкладОтправитель;	
				ОбластьСтрока.Параметры.Получатель = "-";	
				ОбластьСтрока.Параметры.СкладПолучатель = "-";
				ОбластьСтрока.Параметры.Группа = Группа;
				ОбластьСтрока.Параметры.УчетнаяЦена = УчетнаяЦена;
				ОбластьСтрока.Параметры.Ответственный = Выборка.Ответственный; 
				ОбластьСтрока.Параметры.Покупатель = Выборка.Регистратор.Контрагент; 
				Отбор = Новый Структура;
				Отбор.Вставить("ЗалоговыйБилет", Отчет.ЗалоговыйБилет);
				Отбор.Вставить("ОбъектЗалога", Отчет.ОбъектЗалога); 
				Строки = Выборка.Регистратор.Товары.НайтиСтроки(Отбор);
				Если НЕ Строки.Количество() = 0 Тогда 
					ОбластьСтрока.Параметры.ЦенаРеализации = Строки.Получить(0).ФактическаяЦена;
				КонецЕсли;	  
				СтруктураП = Новый Структура;
				СтруктураП.Вставить("Документ", Выборка.Регистратор); 
				ОбластьСтрока.Параметры.СтруктураП = СтруктураП;
				ДокументРезультат.Вывести(ОбластьСтрока);    
			ИначеЕсли ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.ЛБ_ОперацияПоЗалогу") Тогда  
				Если Выборка.Регистратор.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов Тогда 
					ОбластьСтрока  = Макет.ПолучитьОбласть("Строка2"); 
					НаименованиеДокумента = "Полный выкуп залогового билета";
                ИначеЕсли Выборка.Регистратор.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога Тогда
				    ОбластьСтрока  = Макет.ПолучитьОбласть("Строка1"); 
					НаименованиеДокумента = "Выдача залогов";
				Иначе
					ОбластьСтрока  = Макет.ПолучитьОбласть("Строка"); 
					НаименованиеДокумента = Строка(Выборка.Регистратор.ВидОперации);
				КонецЕсли;	 
				ОбластьСтрока.Параметры.Дата = Выборка.Период;
				ОбластьСтрока.Параметры.Документ = НаименованиеДокумента;
				ОбластьСтрока.Параметры.Номер = Выборка.Регистратор.Номер;
				ОбластьСтрока.Параметры.Кол = 1;
				ОбластьСтрока.Параметры.Вес = Вес;
				ОбластьСтрока.Параметры.Оценка = СуммаОценки;
				ОбластьСтрока.Параметры.Займ = ПолучитьДолгПоЗайму(Выборка.Период);
                ОбластьСтрока.Параметры.Группа = Группа;
				ОбластьСтрока.Параметры.УчетнаяЦена = УчетнаяЦена;				  
				СтруктураП = Новый Структура;
				СтруктураП.Вставить("Документ", Выборка.Регистратор); 
				СтруктураП.Вставить("ВидОперации", Выборка.Регистратор.ВидОперации);
				ОбластьСтрока.Параметры.СтруктураП = СтруктураП;
				Если Выборка.Регистратор.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов Тогда
					ОбластьСтрока.Параметры.Отправитель = "-";	
					ОбластьСтрока.Параметры.СкладОтправитель = "-";	
					ОбластьСтрока.Параметры.Получатель = "-";	
					ОбластьСтрока.Параметры.СкладПолучатель = "-";  
					ОбластьСтрока.Параметры.Ответственный = Выборка.Регистратор.ОтветственныйПользователь;
				Иначе 
					ОбластьСтрока.Параметры.Отправитель = ?(ЗначениеЗаполнено(Выборка.Отправитель), Выборка.Отправитель, "-");	
					ОбластьСтрока.Параметры.СкладОтправитель =  ?(ЗначениеЗаполнено(Выборка.СкладОтправитель), Выборка.СкладОтправитель, "-");	
					ОбластьСтрока.Параметры.Получатель = ?(ЗначениеЗаполнено(Выборка.Получатель), Выборка.Получатель, "-");;	
					ОбластьСтрока.Параметры.СкладПолучатель = ?(ЗначениеЗаполнено(Выборка.СкладПолучатель), Выборка.СкладПолучатель, "-"); 
					ОбластьСтрока.Параметры.Ответственный = Выборка.Ответственный;
				КонецЕсли;	
				ДокументРезультат.Вывести(ОбластьСтрока); 
             ИначеЕсли ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.ЛБ_УстановкаЦены") Тогда 
				ОбластьСтрока.Параметры.Дата = Выборка.Период;
				ОбластьСтрока.Параметры.Номер = Выборка.Регистратор.Номер;   
				ОбластьСтрока.Параметры.Документ = "Установка цены объектов залога"; 
				ОбластьСтрока.Параметры.Кол = 1;
				ОбластьСтрока.Параметры.Вес = Вес;
				ОбластьСтрока.Параметры.Оценка = СуммаОценки;
				ОбластьСтрока.Параметры.Займ = ПолучитьДолгПоЗайму(Выборка.Период);
				ОбластьСтрока.Параметры.Отправитель = "-";	
				ОбластьСтрока.Параметры.СкладОтправитель = "-";	
				ОбластьСтрока.Параметры.Получатель = "-";	
				ОбластьСтрока.Параметры.СкладПолучатель = "-";
				ОбластьСтрока.Параметры.Группа = Группа;
				ОбластьСтрока.Параметры.УчетнаяЦена = Выборка.Цена; 
				УчетнаяЦена = Выборка.Цена; 
				ОбластьСтрока.Параметры.Ответственный = Выборка.Ответственный; 
				СтруктураП = Новый Структура;
				СтруктураП.Вставить("Документ", Выборка.Регистратор); 
				ОбластьСтрока.Параметры.СтруктураП = СтруктураП;
				ДокументРезультат.Вывести(ОбластьСтрока);  
			ИначеЕсли ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.ЛБ_НазначениеГруппыОбъектамЗалога") Тогда 
				Группа = Выборка.Группа;
			КонецЕсли;	 
	    КонецЦикла;
	КонецЕсли;	
	
	ДокументРезультат.ПоказатьУровеньГруппировокСтрок(0);
КонецПроцедуры


&НаКлиенте
Процедура ДокументРезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
	    СтандартнаяОбработка = ложь;  
		ПараметрыФормы = Новый структура;        
		Если ТипЗнч(Расшифровка.Документ) = Тип("ДокументСсылка.ЛБ_ОперацияПоЗалогу") Тогда	
			ПараметрыФормы.Вставить("Документ", Расшифровка.Документ);
			Если Расшифровка.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог") Тогда
				ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаВыдачиЗайма", ПараметрыФормы, ЭтаФорма); 
			ИначеЕсли Расшифровка.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление") Тогда 
				ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаПереоформленияЗайма", ПараметрыФормы, ЭтаФорма);	
			ИначеЕсли Расшифровка.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов") Тогда 
				ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаОплатыПроцентов", ПараметрыФормы, ЭтаФорма);
			ИначеЕсли Расшифровка.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога") Тогда 
				ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаВыдачиЗалога", ПараметрыФормы, ЭтаФорма);
		    ИначеЕсли Расшифровка.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ИзъятиеОбъектовЗалога") Тогда 
				ОткрытьФорму("ОбщаяФорма.ЛБ_ИзъятиеОбъектовЗалога", ПараметрыФормы, ЭтаФорма);
	        ИначеЕсли Расшифровка.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога") Тогда 
				ОткрытьФорму("ОбщаяФорма.ЛБ_ВозвратОбъектовЗалога", ПараметрыФормы, ЭтаФорма);
	        ИначеЕсли Расшифровка.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаЗалога") Тогда 
				ОткрытьФорму("ОбщаяФорма.ЛБ_ОтменаВыдачиЗайма", ПараметрыФормы, ЭтаФорма);   
			ИначеЕсли Расшифровка.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаПереоформления") Тогда 
				ОткрытьФорму("ОбщаяФорма.ЛБ_ОтменаПереоформленияЗайма", ПараметрыФормы, ЭтаФорма);	
			КонецЕсли;  
		ИначеЕсли ТипЗнч(Расшифровка.Документ) = Тип("ДокументСсылка.ЛБ_НакладнаяНаОтгрузку") Тогда
			ПараметрыФормы = Новый Структура("Ключ", Расшифровка.Документ);
			ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
			ОткрытьФорму("Документ.ЛБ_НакладнаяНаОтгрузку.ФормаОбъекта", ПараметрыФормы);
		ИначеЕсли ТипЗнч(Расшифровка.Документ) = Тип("ДокументСсылка.ЛБ_ПеремещениеОбъектовЗалога") Тогда
			ПараметрыФормы = Новый Структура("Ключ", Расшифровка.Документ);
			ОткрытьФорму("Документ.ЛБ_ПеремещениеОбъектовЗалога.ФормаОбъекта", ПараметрыФормы);	
		ИначеЕсли ТипЗнч(Расшифровка.Документ) = Тип("ДокументСсылка.ЛБ_ОприходованиеОбъектовЗалога") Тогда
			ПараметрыФормы = Новый Структура("Ключ", Расшифровка.Документ);
			ОткрытьФорму("Документ.ЛБ_ОприходованиеОбъектовЗалога.ФормаОбъекта", ПараметрыФормы);
		ИначеЕсли ТипЗнч(Расшифровка.Документ) = Тип("ДокументСсылка.ЛБ_Реализация") Тогда 
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Ключ", Расшифровка.Документ); 
			ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
			ОткрытьФорму("Документ.ЛБ_Реализация.ФормаОбъекта", ПараметрыФормы);
		ИначеЕсли ТипЗнч(Расшифровка.Документ) = Тип("ДокументСсылка.ЛБ_УстановкаЦены") Тогда 
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Ключ", Расшифровка.Документ); 
			ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
			ОткрытьФорму("Документ.ЛБ_УстановкаЦены.ФормаОбъекта", ПараметрыФормы);		
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры

