	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
	   Объект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить();
    КонецЕсли;  
    Если НЕ ЗначениеЗаполнено(Объект.Дата) Тогда
	   Объект.Дата = ТекущаяДата();
	КонецЕсли;   
КонецПроцедуры
	
&НаСервере
Процедура СоздатьНаСервере() 
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	ОбъектНаСервере.СоздатьНакладные(); 
	//ЗначениеВРеквизитФормы(ОбъектНаСервере, "Объект");
КонецПроцедуры
	  
&НаКлиенте
Процедура Создать(Команда)  
	Если НЕ ЗначениеЗаполнено(Объект.Дата) тогда 
		Предупреждение("Не выбрана дата!", 60);
		Возврат;
	КонецЕсли;	    
	Если НЕ ЗначениеЗаполнено(Объект.Организация) тогда 
		Предупреждение("Не выбрана организация!", 60);
		Возврат;
	КонецЕсли;	

	СоздатьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

