
&НаКлиенте
Процедура РасчетЛимитов(Команда)
	ОткрытьФорму("Отчет.ЛБ_ОтчетРасчетКассовыхЛимитов.Форма.ФормаОтчета",, Этаформа,,,,,РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ДействующиеЛимиты(Команда)
	ОткрытьФорму("Отчет.ЛБ_ДействующиеКассовыеЛимиты.Форма.ФормаОтчета",, Этаформа,,,,,РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ОтклонениеЛимитов(Команда)
	ОткрытьФорму("Отчет.ЛБ_ОтклонениеКассовыхЛимитов.Форма.ФормаОтчета",, Этаформа,,,,,РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры
