
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Владелец") Тогда
		Объект.Владелец = Параметры.Владелец;
	КонецЕсли;	
	Если Параметры.Свойство("ТолькоПросмортр") Тогда
		ЭтаФорма.ТолькоПросмотр = Параметры.ТолькоПросмотр;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//ТекущийОбъект.Наименование = ЛБ_ОбщийМодуль.СформироватьНаименованиеДокументаЗалогодателя(Объект);
	//ТекущийОбъект.НаименованиеПолное = ЛБ_ОбщийМодуль.СформироватьПолноеНаименованиеДокументаЗалогодателя(Объект);
КонецПроцедуры
