#Область ПрограммныйИнтерфейс

Функция ПечатьСводнаяНакладная(ПараметрыОтчета) Экспорт
	
	//ТабличныйДокумент = Новый ТабличныйДокумент;
	//ТабличныйДокумент.Защита = Истина;
	//ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СводнаяНакладная";
	//ТабличныйДокумент.АвтоМасштаб = Истина;
	//ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	//ТабличныйДокумент.ТолькоПросмотр = Истина;

	//Макет = ПолучитьОбщийМакет("ЛБ_ПФ_КассовыйЛист");
	//
	//ОбластьШапка   = Макет.ПолучитьОбласть("Шапка");
	//ОбластьТаблица = Макет.ПолучитьОбласть("ОбластьТаблица");
	//ОбластьПодвал  = Макет.ПолучитьОбласть("ОбластьПодвал");
	//
	//ОбластьШапка.Параметры.Организация = ПараметрыОтчета.Организация.НаименованиеСокращенное;
	//ОбластьШапка.Параметры.Ломбард = ПараметрыОтчета.Ломбард;
	//
	//АдресЛомбарда = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПараметрыОтчета.Ломбард.ПолучитьОбъект(),,ПараметрыОтчета.Период);
	//СтруктураАдреса = фПрочитатьJSON(ПараметрыОтчета.Ломбард.КонтактнаяИнформация[0].Значение);
	//ОбластьШапка.Параметры.Город = "г. " + ?(СтруктураАдреса.Свойство("city"), СтруктураАдреса.city, "");
	//
	//Результат = ЛБ_ОбщийМодуль.ПолучитьНомерКассовогоЛиста(НачалоДня(ПараметрыОтчета.Период), КонецДня(ПараметрыОтчета.Период), ПараметрыОтчета.Организация, ПараметрыОтчета.Ломбард);
	//НомерКЛ = Результат.Номер;
	//ОбластьШапка.Параметры.НомерЛиста = НомерКЛ;
	//ОбластьШапка.Параметры.Дата = Формат(ПараметрыОтчета.Период, "ДФ='дд ММММ гггг'");
	//
	////Остатки
	//Запрос = Новый Запрос;   
	//Запрос.УстановитьПараметр("Дата1", НачалоДня(ПараметрыОтчета.Период));  
	//Запрос.УстановитьПараметр("Дата2", КонецДня(ПараметрыОтчета.Период));
	//Запрос.УстановитьПараметр("Организация", ПараметрыОтчета.Организация);
	//Запрос.УстановитьПараметр("Ломбард", ПараметрыОтчета.Ломбард);
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ЛБ_ДенежныеСредстваОстаткиИОбороты.Ломбард КАК Ломбард,
	//               |	СУММА(ЛБ_ДенежныеСредстваОстаткиИОбороты.СуммаНачальныйОстаток) КАК СуммаНач,
	//               |	СУММА(ЛБ_ДенежныеСредстваОстаткиИОбороты.СуммаКонечныйОстаток) КАК СуммаКон,
	//               |	СУММА(ЛБ_ДенежныеСредстваОстаткиИОбороты.СуммаПриход) КАК СуммаПриход,
	//               |	СУММА(ЛБ_ДенежныеСредстваОстаткиИОбороты.СуммаРасход) КАК СуммаРасход
	//               |ИЗ
	//               |	РегистрНакопления.ЛБ_ДенежныеСредства.ОстаткиИОбороты(
	//               |			&Дата1,
	//               |			&Дата2,
	//               |			,
	//               |			,
	//               |			Организация = &Организация
	//               |				И ВидДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДенежныхСредств.Наличные)
	//               |				И Ломбард = &Ломбард) КАК ЛБ_ДенежныеСредстваОстаткиИОбороты
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	ЛБ_ДенежныеСредстваОстаткиИОбороты.Ломбард";
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда 
	//	СуммаОстатокНачало = Выборка.СуммаНач;
	//	СуммаОстатокКонец = Выборка.СуммаКон; 
	//	СуммаПриход = Выборка.СуммаПриход;
	//	СуммаРасход = Выборка.СуммаРасход;
	//Иначе
	//	СуммаОстатокНачало = 0;
	//	СуммаОстатокКонец = 0; 
	//	СуммаПриход = 0;
	//	СуммаРасход = 0;
	//КонецЕсли;
	//
	//ОбластьШапка.Параметры.ОстатокНачало = СуммаОстатокНачало;
	//ТабличныйДокумент.Вывести(ОбластьШапка);
	////Обороты
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ЛБ_ДвиженияДенежныхСредств.Номер КАК НомерДокумента,
	//	|	ВЫБОР
	//	|		КОГДА ТИПЗНАЧЕНИЯ(ЛБ_ДвиженияДенежныхСредств.Регистратор) = ТИП(Документ.ЛБ_ОперацияПоЗалогу)
	//	|				И ЛБ_ДвиженияДенежныхСредств.ВидДвиженияДС = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДвиженияДС.Приход)
	//	|			ТОГДА ""Залогодателей с применением ККT""
	//	|		КОГДА ТИПЗНАЧЕНИЯ(ЛБ_ДвиженияДенежныхСредств.Регистратор) = ТИП(Документ.ЛБ_ОперацияПоЗалогу)
	//	|				И ЛБ_ДвиженияДенежныхСредств.ВидДвиженияДС = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДвиженияДС.Расход)
	//	|			ТОГДА ""Залогодателям с применением ККT""
	//	|		ИНАЧЕ ВЫБОР
	//	|				КОГДА ЛБ_ДвиженияДенежныхСредств.ФизическоеЛицо = НЕОПРЕДЕЛЕНО
	//	|					ТОГДА ЛБ_ДвиженияДенежныхСредств.ФИО
	//	|				КОГДА ЛБ_ДвиженияДенежныхСредств.ФизическоеЛицо = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//	|					ТОГДА ЛБ_ДвиженияДенежныхСредств.Контрагент
	//	|				ИНАЧЕ ЛБ_ДвиженияДенежныхСредств.ФизическоеЛицо
	//	|			КОНЕЦ
	//	|	КОНЕЦ КАК Контрагент,
	//	|	СУММА(ЛБ_ДвиженияДенежныхСредств.Сумма) КАК Сумма,
	//	|	ЛБ_ДвиженияДенежныхСредств.ВидДвиженияДС КАК ВидДвиженияДС,
	//	|	ЛБ_ДвиженияДенежныхСредств.Кт КАК Кт,
	//	|	ЛБ_ДвиженияДенежныхСредств.Дт КАК Дт
	//	|ПОМЕСТИТЬ ВТ1
	//	|ИЗ
	//	|	РегистрНакопления.ЛБ_ДвиженияДенежныхСредств КАК ЛБ_ДвиженияДенежныхСредств
	//	|ГДЕ
	//	|	ЛБ_ДвиженияДенежныхСредств.Период МЕЖДУ &НачалоПериода И &КонецПериода
	//	|	И ЛБ_ДвиженияДенежныхСредств.Организация = &Организация
	//	|	И ЛБ_ДвиженияДенежныхСредств.Ломбард = &Ломбард
	//	|	И ЛБ_ДвиженияДенежныхСредств.ВидДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДенежныхСредств.Наличные)
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ЛБ_ДвиженияДенежныхСредств.Номер,
	//	|	ЛБ_ДвиженияДенежныхСредств.ВидДвиженияДС,
	//	|	ЛБ_ДвиженияДенежныхСредств.Кт,
	//	|	ЛБ_ДвиженияДенежныхСредств.Дт,
	//	|	ВЫБОР
	//	|		КОГДА ТИПЗНАЧЕНИЯ(ЛБ_ДвиженияДенежныхСредств.Регистратор) = ТИП(Документ.ЛБ_ОперацияПоЗалогу)
	//	|				И ЛБ_ДвиженияДенежныхСредств.ВидДвиженияДС = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДвиженияДС.Приход)
	//	|			ТОГДА ""Залогодателей с применением ККT""
	//	|		КОГДА ТИПЗНАЧЕНИЯ(ЛБ_ДвиженияДенежныхСредств.Регистратор) = ТИП(Документ.ЛБ_ОперацияПоЗалогу)
	//	|				И ЛБ_ДвиженияДенежныхСредств.ВидДвиженияДС = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДвиженияДС.Расход)
	//	|			ТОГДА ""Залогодателям с применением ККT""
	//	|		ИНАЧЕ ВЫБОР
	//	|				КОГДА ЛБ_ДвиженияДенежныхСредств.ФизическоеЛицо = НЕОПРЕДЕЛЕНО
	//	|					ТОГДА ЛБ_ДвиженияДенежныхСредств.ФИО
	//	|				КОГДА ЛБ_ДвиженияДенежныхСредств.ФизическоеЛицо = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//	|					ТОГДА ЛБ_ДвиженияДенежныхСредств.Контрагент
	//	|				ИНАЧЕ ЛБ_ДвиженияДенежныхСредств.ФизическоеЛицо
	//	|			КОНЕЦ
	//	|	КОНЕЦ
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ1.НомерДокумента КАК НомерДокумента,
	//	|	ВТ1.Контрагент КАК Контрагент,
	//	|	ВТ1.Сумма КАК Сумма,
	//	|	ВТ1.ВидДвиженияДС КАК ВидДвиженияДС,
	//	|	ВТ1.Кт КАК Кт,
	//	|	ВТ1.Дт КАК Дт
	//	|ИЗ
	//	|	ВТ1 КАК ВТ1
	//	|ГДЕ
	//	|	ВТ1.Сумма <> 0";
	//
	//Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ПараметрыОтчета.Период));
	//Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПараметрыОтчета.Период));
	//Запрос.УстановитьПараметр("Ломбард", ПараметрыОтчета.Ломбард);
	//Запрос.УстановитьПараметр("Организация", ПараметрыОтчета.Организация);
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//КоличествоПриходных = 0;
	//КоличествоРасходных = 0;
	//
	//Пока Выборка.Следующий() Цикл
	//	ОбластьТаблица.Параметры.НомерДокумента = Выборка.НомерДокумента;
	//	ОбластьТаблица.Параметры.Контрагент = Выборка.Контрагент;
	//	Если Выборка.Дт = "20202" Тогда 
	//		ОбластьТаблица.Параметры.НомерСчета = Выборка.Кт;
	//	ИначеЕсли Выборка.Кт = "20202" Тогда
	//		ОбластьТаблица.Параметры.НомерСчета = Выборка.Дт;
	//	КонецЕсли;
	//	Если Выборка.ВидДвиженияДС = Перечисления.ЛБ_ВидыДвиженияДС.Приход Тогда
	//		ОбластьТаблица.Параметры.СуммаПриход = Выборка.Сумма;
	//		ОбластьТаблица.Параметры.СуммаРасход = " ";
	//		КоличествоПриходных = КоличествоПриходных + 1;
	//		ТабличныйДокумент.Вывести(ОбластьТаблица);
	//	Иначе
	//		ОбластьТаблица.Параметры.СуммаРасход = Выборка.Сумма;
	//		ОбластьТаблица.Параметры.СуммаПриход = " ";
	//		КоличествоРасходных = КоличествоРасходных + 1;
	//		ТабличныйДокумент.Вывести(ОбластьТаблица);
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Ответственный              = ПараметрыСеанса.ТекущийСотрудник;	
	//ФИООтветственного          = СтрРазделить(Строка(Ответственный), " ");
	//
	//Если ФИООтветственного.Количество() > 0 Тогда
	//	ФамилияОтветственного  = ФИООтветственного[0]; 
	//	ИнициалыОтветственного = Лев(ФИООтветственного[1], 1) + "." + Лев(ФИООтветственного[2], 1) + ".";
	//Иначе
	//	ФамилияОтветственного  = ""; 
	//	ИнициалыОтветственного = "";
	//КонецЕсли;
	//
	//ОбластьПодвал.Параметры.ИтогоПриход = СуммаПриход;
	//ОбластьПодвал.Параметры.ИтогоРасход = СуммаРасход;
	//ОбластьПодвал.Параметры.ОстатокКонец = СуммаОстатокКонец;
	//
	//ОбластьПодвал.Параметры.ФИОКассира = ФамилияОтветственного + " " + ИнициалыОтветственного;
	//
	//ОбластьПодвал.Параметры.КоличествоПриходных = ЧислоПрописью(КоличествоПриходных,"НП=Ложь",",,,,,,,,0");
	//ОбластьПодвал.Параметры.КоличествоРасходных = ЧислоПрописью(КоличествоРасходных,"НП=Ложь",",,,,,,,,0");
	//
	//ДанныеНачальника_Управляющего = ПолучитьНачальникаОтделения_Управляющего(ПараметрыОтчета.Ломбард, ТекущаяДата());
	//Бухгалтер = ?(ДанныеНачальника_Управляющего.Свойство("Сотрудник"), Строка(ДанныеНачальника_Управляющего.Сотрудник), "");
	//
	//ФИОБухгалтера          = СтрРазделить(Строка(Бухгалтер), " ");
	//
	//Если ФИОБухгалтера.Количество() > 0 Тогда
	//	ФамилияБухгалтера  = ФИОБухгалтера[0]; 
	//	ИнициалыБухгалтера = Лев(ФИОБухгалтера[1], 1) + "." + Лев(ФИОБухгалтера[2], 1) + ".";
	//Иначе
	//	ФамилияБухгалтера  = ""; 
	//	ИнициалыБухгалтера = "";
	//КонецЕсли;
	//
	//ОбластьПодвал.Параметры.ФИОБухгалтера = ФамилияБухгалтера + " " + ИнициалыБухгалтера;
	//
	//ТабличныйДокумент.Вывести(ОбластьПодвал);
	//
	//ТабличныйДокумент.НижнийКолонтитул.Выводить = Истина;
	//ТабличныйДокумент.НижнийКолонтитул.НачальнаяСтраница = 1;
	//ТабличныйДокумент.НижнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
	//ТабличныйДокумент.НижнийКолонтитул.ТекстСлева = Строка(ТекущаяДата()) + 
	//" " + ФамилияОтветственного + " " + ИнициалыОтветственного;
	//ТабличныйДокумент.НижнийКолонтитул.ТекстВЦентре = "КАССА за " + Формат(ПараметрыОтчета.Период, "ДФ='дд ММММ гггг'") + " года";
	//ТабличныйДокумент.НижнийКолонтитул.ТекстСправа = "Страница [&НомерСтраницы] из [&СтраницВсего]";
	//Шрифт = Новый Шрифт("Times New Roman", 8);
	//ТабличныйДокумент.НижнийКолонтитул.Шрифт = Шрифт;
	//
	//Возврат ТабличныйДокумент;
КонецФункции

#КонецОбласти