&НаКлиенте
Перем ПараметрыОбработчикаОжидания Экспорт;

&НаКлиенте
Перем ФормаДлительнойОперации Экспорт;

&НаКлиенте
Перем НеРедактировать Экспорт;

&НаКлиенте
Перем ТекСтр Экспорт;

&НаКлиенте
Перем ТекЗначение Экспорт;

&НаКлиенте
Перем НовЗначение Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура УстановитьУсловноеОформление()

	//УсловноеОформление.Элементы.Очистить();


	// ТоварыЦенаВРознице

	//ЭлементУО = УсловноеОформление.Элементы.Добавить();

	//КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ТоварыЦенаВРознице");

	//ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
	//	"ТипСклада", ВидСравненияКомпоновкиДанных.НеРавно, Перечисления.ТипыСкладов.НеавтоматизированнаяТорговаяТочка);

	//ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);


	// ТоварыЦена

	//ЭлементУО = УсловноеОформление.Элементы.Добавить();

	//КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ТоварыЦена");

	//ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
	//	"ТипСклада", ВидСравненияКомпоновкиДанных.Равно, Перечисления.ТипыСкладов.НеавтоматизированнаяТорговаяТочка);

	//ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);


	// ТоварыКоличество, ТоварыКоличествоУчет

	//ЭлементУО = УсловноеОформление.Элементы.Добавить();

	//КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ТоварыКоличество");
	//КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ТоварыКоличествоУчет");

	//ГруппаОтбора1 = КомпоновкаДанныхКлиентСервер.ДобавитьГруппуОтбора(ЭлементУО.Отбор.Элементы, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);

	//	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора1,
	//		"Объект.Товары.Количество", ВидСравненияКомпоновкиДанных.Заполнено);

	//	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора1,
	//		"Объект.Товары.КоличествоУчет", ВидСравненияКомпоновкиДанных.Заполнено);

	//ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()

	ИспользуетсяОтложенноеПроведение = ПроведениеСервер.ИспользуетсяОтложенноеПроведение(Объект.Организация, Объект.Дата);

КонецПроцедуры  

&НаКлиенте
Процедура ДокументОснованиеВидНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ЛБ_ОснованиеИнвентаризации.Приказ"));

	Если Объект.ТипИнвентаризации =  ПредопределенноеЗначение("Перечисление.ЛБ_ТипИнвентаризации.КонтрольнаяПроверка") Тогда 	
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ЛБ_ОснованиеИнвентаризации.Распоряжение"));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	// ++ Сербаев 05.05.2023
	//ЗаполнениеДокументов.ПриИзмененииЗначенияОрганизации(Объект, Пользователи.ТекущийПользователь());
	// -- Сербаев 05.05.2023
	
	ИспользуетсяОтложенноеПроведение = ПроведениеСервер.ИспользуетсяОтложенноеПроведение(Объект.Организация, Объект.Дата);
	
	Изменения = Новый Массив;
	Изменения.Добавить("Организация");
	Изменения.Добавить("ПодразделениеОрганизации");
	Изменения.Добавить("ДоговорКонтрагента");
	
	// ++ Сербаев 05.05.2023
	//СчетаУчетаВДокументах.ЗаполнитьОбъектПриИзменении(НачатьЗаполнениеСчетовУчета(Изменения, Объект));
	// -- Сербаев 05.05.2023
	
КонецПроцедуры

&НаСервере
Процедура СкладПриИзмененииНаСервере()

//	ТипСклада = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Склад, "ТипСклада");
//	Объект.ОтветственноеЛицо = ОтветственныеЛицаБП.ОтветственноеЛицоНаСкладе(Объект.Склад, Объект.Дата);
//	
//	СчетаУчетаВДокументах.ЗаполнитьОбъектПриИзменении(НачатьЗаполнениеСчетовУчета("Склад", Объект));

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьФлагиПредседателя(СтрокаТЧ)

	СтрокаПредседателя = ?(СтрокаТЧ <> Неопределено И СтрокаТЧ.Председатель, СтрокаТЧ, Неопределено);
	
	Для Каждого СтрокаКомиссии Из Объект.ИнвентаризационнаяКомиссия Цикл
		
		Если СтрокаКомиссии.Председатель И СтрокаПредседателя = Неопределено Тогда
			СтрокаПредседателя = СтрокаКомиссии;
			Продолжить;
		КонецЕсли;	
		
		Если СтрокаКомиссии.Председатель И СтрокаКомиссии <> СтрокаПредседателя Тогда
			СтрокаКомиссии.Председатель = Ложь;
		КонецЕсли;	
		
	КонецЦикла;	

	Если СтрокаПредседателя = Неопределено И Объект.ИнвентаризационнаяКомиссия.Количество() > 0 Тогда
		Объект.ИнвентаризационнаяКомиссия[0].Председатель = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТаблиц()

	Для каждого СтрокаТаблицы Из Объект.Товары Цикл
		ЗаполнитьДобавленныеКолонкиСтрокиТаблицыТовары(СтрокаТаблицы);
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьДобавленныеКолонкиСтрокиТаблицыТовары(СтрокаТаблицы)

	СтрокаТаблицы.Отклонение = СтрокаТаблицы.Количество - СтрокаТаблицы.КоличествоУчет;

КонецПроцедуры

&НаКлиенте
Функция ПолучитьПараметрыПодбора(ИмяТаблицы)

	ПараметрыФормы = Новый Структура;
	
	ДатаРасчетов 	 = ?(НачалоДня(Объект.Дата) = НачалоДня(ТекущаяДата()), Неопределено, Объект.Дата);
	ЗаголовокПодбора = НСтр("ru = 'Подбор номенклатуры в %1 (%2)'");
	
	//Если ТипСклада = ПредопределенноеЗначение("Перечисление.ТипыСкладов.НеавтоматизированнаяТорговаяТочка") Тогда
	//	Параметрыформы.Вставить("ПоказыватьЦены", Истина);
	//КонецЕсли;
	
	ПредставлениеТаблицы = НСтр("ru = 'Товары'");
	
	ПараметрыФормы.Вставить("ПоказыватьОстатки"  , Истина);
	
	ЗаголовокПодбора = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ЗаголовокПодбора, Объект.Ссылка, ПредставлениеТаблицы);
	
	ПараметрыФормы.Вставить("ЕстьЦена"      , Истина);
	ПараметрыФормы.Вставить("ЕстьКоличество", Истина);
	ПараметрыФормы.Вставить("ДатаРасчетов"  , ДатаРасчетов);
	ПараметрыФормы.Вставить("Валюта"        , ВалютаРегламентированногоУчета);
	ПараметрыФормы.Вставить("Организация"   , Объект.Организация);
	ПараметрыФормы.Вставить("Склад"         , Объект.Склад);
	ПараметрыФормы.Вставить("Заголовок"     , ЗаголовокПодбора);
	ПараметрыФормы.Вставить("ВидПодбора"    , ПолучитьВидПодбора(ИмяТаблицы));
	ПараметрыФормы.Вставить("ИмяТаблицы"    , ИмяТаблицы);
	ПараметрыФормы.Вставить("Услуги"        , ИмяТаблицы = "Услуги");
	
	Возврат ПараметрыФормы;

КонецФункции

&НаКлиенте
Функция ПолучитьВидПодбора(ИмяТаблицы)
	
	ВидПодбора = "";
	
	//Если ТипСклада = ПредопределенноеЗначение("Перечисление.ТипыСкладов.НеавтоматизированнаяТорговаяТочка") Тогда
	//	ВидПодбора = "НТТ";
	//КонецЕсли;
	
	Возврат ВидПодбора;	

КонецФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()

	ТекущаяДатаДокумента = Объект.Дата;
	
	// ++ Сербаев 05.05.2023
	//ОбщегоНазначенияБПКлиентСервер.УстановитьПараметрыФункциональныхОпцийФормыДокумента(ЭтотОбъект);
	// -- Сербаев 05.05.2023
	
	ИспользуетсяОтложенноеПроведение = ПроведениеСервер.ИспользуетсяОтложенноеПроведение(Объект.Организация, Объект.Дата);
	
	УстановитьСостояниеДокумента();
	
	// ++ Сербаев 10.05.2023
	//ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	ВалютаРегламентированногоУчета = Справочники.Валюты.НайтиПоНаименованию("Российский рубль");
	// -- Сербаев 10.05.2023
	
	//ТипСклада = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Склад, "ТипСклада");

//	Элементы.ДокументОснованиеВид.СписокВыбора.Очистить();
//	Элементы.ДокументОснованиеВид.СписокВыбора.Добавить("Приказ");
//	Элементы.ДокументОснованиеВид.СписокВыбора.Добавить("Постановление");
//	Элементы.ДокументОснованиеВид.СписокВыбора.Добавить("Распоряжение");

	ЗаполнитьДобавленныеКолонкиТаблиц();
	
	// Проверка буфера обмена на наличие скопированных строк
	УстановитьДоступностьКомандыВставки(ЭтотОбъект, Не ОбщегоНазначения.ПустойБуферОбмена());
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РассчитатьСуммуТабЧасти(Знач СтрокаТабличнойЧасти)
	
	ЦенаУчет = Неопределено;
	
	Если СтрокаТабличнойЧасти.КоличествоУчет <> 0 Тогда
		ЦенаУчет = СтрокаТабличнойЧасти.СуммаУчет / СтрокаТабличнойЧасти.КоличествоУчет;
	КонецЕсли;
	
	Если ЦенаУчет <> Неопределено И СтрокаТабличнойЧасти.Цена = Окр(ЦенаУчет, 2) Тогда
		Сумма = СтрокаТабличнойЧасти.СуммаУчет * СтрокаТабличнойЧасти.Количество / СтрокаТабличнойЧасти.КоличествоУчет;
	Иначе
		// ++ Сербаев 05.05.2023
		//ОбработкаТабличныхЧастейКлиентСервер.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти);
		//Сумма = СтрокаТабличнойЧасти.Сумма;
		// -- Сербаев 05.05.2023
	КонецЕсли;
	
	Возврат Сумма;
	
КонецФункции

&НаКлиенте
Процедура ВопросПерезаполнитьУчетныеДанныеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьДокументНаКлиенте("ПерезаполнитьУчетныеКоличества");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПерезаполнитьКоличествоСуммуПриИзмененииСкладаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьДокументНаКлиенте("ПерезаполнитьУчетныеКоличества");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПерезаполнитьКоличествоСуммуПриИзмененииОтветственногоЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Объект.Склад)
	   И ЗначениеЗаполнено(Объект.ОтветственноеЛицо) Тогда
		МОЛСклада = ОтветственноеЛицоНаСкладе(Объект.Склад, Объект.Дата);
		Если Не ЗначениеЗаполнено(МОЛСклада)
		 Или МОЛСклада <> Объект.ОтветственноеЛицо Тогда
			Объект.Склад = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Склад)
		Или ЗначениеЗаполнено(Объект.ОтветственноеЛицо) Тогда
		Если Результат = КодВозвратаДиалога.Да Тогда
			ЗаполнитьДокументНаКлиенте("ПерезаполнитьУчетныеКоличества");
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура ЗаполнитьПоОстаткам(Команда)

	Если НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
		Предупреждение("Невыбран склад!");
		Возврат;
	КонецЕсли;

	Если Объект.ВидИнвентаризации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидИнвентаризации.Выборочная") Тогда
		УстановленыФильтры = ПроверитьФильтры();
		Если НЕ УстановленыФильтры Тогда
			Предупреждение("Фильтры не установлены. Для проведения выборочной инвентаризации установите фильтры.");
			Возврат;
		КонецЕсли;

		Если Объект.ОтборОбщаяМассаОт <> 0 И Объект.ОтборОбщаяМассаДо = 0 Тогда
			Предупреждение("Фильтр по весу изделия заполнен некорректно. Заполните значение ""До""");
			Возврат;
		КонецЕсли;

		Если Объект.ОтборМассаМеталлаОт <> 0 И Объект.ОтборМассаМеталлаДо = 0 Тогда
			Предупреждение("Фильтр по весу металла заполнен некорректно. Заполните значение ""До""");
			Возврат;
		КонецЕсли;

		Если Объект.ОтборСуммаОценкиОт <> 0 И Объект.ОтборСуммаОценкиДо = 0 Тогда
			Предупреждение("Фильтр по макс. оценке заполнен некорректно. Заполните значение ""До""");
			Возврат;
		КонецЕсли;

		Если ЗначениеЗаполнено(Объект.ОтборДатаЗаймаОт) И НЕ ЗначениеЗаполнено(Объект.ОтборДатаЗаймаДо) Тогда
			Предупреждение("Фильтр по дате займа заполнен некорректно. Заполните значение ""По""");
			Возврат;
		ИначеЕсли НЕ ЗначениеЗаполнено(Объект.ОтборДатаЗаймаОт) И ЗначениеЗаполнено(Объект.ОтборДатаЗаймаДо) Тогда
			Предупреждение("Фильтр по дате займа заполнен некорректно. Заполните значение ""С""");
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТекущийЭлемент.Имя = "Товары" ИЛИ ТекущийЭлемент.Имя = "ТоварыЗаполнитьПоОстаткам1" Тогда 
		Если Объект.Товары.Количество() > 0 Тогда
			ТекстВопроса = НСтр("ru = 'Перед заполнением табличная часть будет очищена. Заполнить?'");
			Оповещение = Новый ОписаниеОповещения("ЗаполнитьПоОстаткамЗавершение", ЭтотОбъект);
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, Заголовок);
		Иначе
			ЗаполнитьДокументНаКлиенте("Заполнить");
			Модифицированность = Истина;
		КонецЕсли;
	ИначеЕсли ТекущийЭлемент.Имя = "НовыеОЗ" Тогда
		Если Объект.НовыеОЗ.Количество() > 0 Тогда
			ТекстВопроса = НСтр("ru = 'Перед заполнением табличная часть будет очищена. Заполнить?'");
			Оповещение = Новый ОписаниеОповещения("ЗаполнитьПоОстаткамЗавершение", ЭтотОбъект);
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, Заголовок);
		Иначе
			ЗаполнитьДокументНаКлиенте("Заполнить");
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьФильтры()
	
	Если Объект.ФильтрВидыИзделий.Количество() > 0 ИЛИ Объект.ФильтрКатегории.Количество() > 0
		ИЛИ Объект.ФильтрПробы.Количество() > 0 ИЛИ Объект.ФильтрКамни.Количество() > 0
		ИЛИ Объект.ФильтрПриемщики.Количество() > 0 ИЛИ Объект.ФильтрЗалогодатели.Количество() > 0
		ИЛИ Объект.ФильтрСтатусыЗалогодателя.Количество() > 0 ИЛИ Объект.ФильтрСтатусы.Количество() > 0
		ИЛИ (Объект.ОтборОбщаяМассаОт <> 0 ИЛИ Объект.ОтборОбщаяМассаДо <> 0)
		ИЛИ (Объект.ОтборМассаМеталлаОт <> 0 ИЛИ Объект.ОтборМассаМеталлаДо <> 0)
		ИЛИ (Объект.ОтборСуммаОценкиОт <> 0 ИЛИ Объект.ОтборСуммаОценкиДо <> 0)
		ИЛИ (Объект.ОтборДатаЗаймаОт <> Дата(1, 1, 1) ИЛИ Объект.ОтборДатаЗаймаДо <> Дата(1, 1, 1))
		ИЛИ Объект.ОтборИменник ИЛИ Объект.ОтборБезВставок ИЛИ Объект.ОтборВставкаМеталл ИЛИ Объект.ОтборВставкаКомплектующие Тогда
		
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура ПерезаполнитьУчетныеДанные(Команда)
	
	Если Объект.Товары.Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru = 'Перезаполнить учетные количества и суммы? %ПредупреждениеОЗаписиДокумента%'");
	ТекстВопроса = СтрЗаменить(ТекстВопроса, "%ПредупреждениеОЗаписиДокумента%", 
		?(Модифицированность, Символы.ПС + НСтр("ru='(Перед заполнением документ будет записан!)'"), 
		""));
	Оповещение = Новый ОписаниеОповещения("ВопросПерезаполнитьУчетныеДанныеЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, Заголовок);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборКомиссии(Команда)
	
	ПараметрыФормы = Новый Структура("ЗакрыватьприВыборе,МножественныйВыбор,РежимВыбора", Ложь, Истина, Истина);
	ОткрытьФорму("Справочник.ФизическиеЛица.ФормаСписка", ПараметрыФормы, Элементы.ИнвентаризационнаяКомиссия);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборТовары(Команда)
	
	ПараметрыПодбора = ПолучитьПараметрыПодбора("Товары");
	Если ПараметрыПодбора <> Неопределено Тогда
		ОткрытьФорму("Обработка.ПодборНоменклатуры.Форма.Форма", ПараметрыПодбора, 
			ЭтаФорма, УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьКонтекстныеНовости(Команда)
	
	// ++ Сербаев 05.05.2023
	//ОбработкаНовостейКлиент.КонтекстныеНовости_ОбработкаКомандыНовости(
	//	ЭтаФорма,
	//	Команда
	//);
	// -- Сербаев 05.05.2023

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ШАПКИ

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	// ++ Сербаев 05.05.2023
	//// Общие проверки условий по датам.
	//ТребуетсяВызовСервера = ОбщегоНазначенияБПКлиент.ТребуетсяВызовСервераПриИзмененииДатыДокумента(
	//	Объект.Дата, ТекущаяДатаДокумента);
	//	
	//// Если определили, что изменение даты может повлиять на какие-либо параметры, 
	//// то передаем обработку на сервер.
	//Если ТребуетсяВызовСервера Тогда
	//	ДатаПриИзмененииНаСервере();
	//КонецЕсли;
	//
	//// Запомним новую дату документа.
	//ТекущаяДатаДокумента = Объект.Дата;
	// -- Сербаев 05.05.2023
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)

	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ОрганизацияПриИзмененииНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	//Если ЗначениеЗаполнено(Объект.Склад) Тогда
	//	СкладПриИзмененииНаСервере();
	//КонецЕсли;

	//Если ЗначениеЗаполнено(Объект.Склад) И Объект.Товары.Количество() <> 0 Тогда
	//	
	//	ТекстВопроса = НСтр("ru = 'Перезаполнить учетные количества и суммы? %ПредупреждениеОЗаписиДокумента%'");
	//	ТекстВопроса = СтрЗаменить(ТекстВопроса, "%ПредупреждениеОЗаписиДокумента%", 
	//		?(Модифицированность, Символы.ПС + НСтр("ru='(Перед заполнением документ будет записан!)'"), 
	//		""));
	//		
	//	Оповещение = Новый ОписаниеОповещения("ВопросПерезаполнитьКоличествоСуммуПриИзмененииСкладаЗавершение", ЭтотОбъект);
	//	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, Заголовок);
	//	
	//КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственноеЛицоПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ОтветственноеЛицо) И Объект.Товары.Количество() <> 0 Тогда
		
		ТекстВопроса = НСтр("ru = 'Перезаполнить учетные количества и суммы? %ПредупреждениеОЗаписиДокумента%'");
		ТекстВопроса = СтрЗаменить(ТекстВопроса, "%ПредупреждениеОЗаписиДокумента%",
			?(Модифицированность, Символы.ПС + НСтр("ru='(Перед заполнением документ будет записан!)'"),
			""));
			
		Оповещение = Новый ОписаниеОповещения("ВопросПерезаполнитьКоличествоСуммуПриИзмененииОтветственногоЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ТАБЛИЧНОГО ПОЛЯ Товары

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НЕ ОтменаРедактирования Тогда
		//Элемент.ТекущиеДанные.Отклонение = Элемент.ТекущиеДанные.Количество 
		//									- Элемент.ТекущиеДанные.КоличествоУчет;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	ТекущиеДанные.Цена = 0;
	РассчитатьСуммуТабЧасти(ТекущиеДанные);
	
	// ++ Сербаев 05.05.2023
	//ПараметрыЗаполненияСчетовУчета = НачатьЗаполнениеСчетовУчета("Товары.Номенклатура", Объект, ТекущиеДанные);
	//СчетаУчетаВДокументахКлиент.ЗаполнитьПриИзменении(ПараметрыЗаполненияСчетовУчета);
	// -- Сербаев 05.05.2023
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.Сумма = РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоУчетПриИзменении(Элемент)
	
	Элементы.Товары.ТекущиеДанные.СуммаУчет = Элементы.Товары.ТекущиеДанные.Цена 
											* Элементы.Товары.ТекущиеДанные.КоличествоУчет;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.Цена = ?(СтрокаТабличнойЧасти.Количество = 0, 0, 
									СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	// ++ Сербаев 05.05.2023
	//РаботаСНоменклатуройКлиент.НоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
	// -- Сербаев 05.05.2023
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	// ++ Сербаев 05.05.2023
	//ПараметрыПолученияДанных.Вставить("ВидыНоменклатуры", "Товары, Материалы");
	//
	//РаботаСНоменклатуройКлиент.НоменклатураАвтоПодбор(
	//	Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	// -- Сербаев 05.05.2023	
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)

	// ++ Сербаев 05.05.2023
	//ПараметрыПолученияДанных.Вставить("ВидыНоменклатуры", "Товары, Материалы");
	//
	//РаботаСНоменклатуройКлиент.НоменклатураОкончаниеВводаТекста(
	//	Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка);
	// -- Сербаев 05.05.2023	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	// ++ Сербаев 05.05.2023
	//ИспользоватьПодключаемоеОборудование = МенеджерОборудованияВызовСервераПереопределяемый.ИспользоватьПодключаемоеОборудование();
	// -- Сербаев 05.05.2023
	
	Если Параметры.Ключ.Пустая() Тогда
		ВидИнвентаризации = Перечисления.ЛБ_ВидИнвентаризации.Полная;
	КонецЕсли;

	//+Мельников 26.04.24 Указываем организацию для перефиксации номера документа и др. поля.
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить(); //Справочники.Организации.НайтиПоКоду("ДМ-000003");
		//Объект.Ответственный = Пользователи.ТекущийПользователь().Сотрудник;
		//ЛомбардСсылка = ПолучитьСсылкуЛомбарда();
		//Объект.Должность = Пользователи.ТекущийПользователь().Сотрудник.Должность;
		
		//Если ЗначениеЗаполнено(ЛомбардСсылка) Тогда
		Если ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард Тогда
			Объект.Должность = ПараметрыСеанса.ТекущийСотрудник.Должность;
			Объект.Ответственный = ПараметрыСеанса.ТекущийСотрудник;
			Объект.Ломбард = ПараметрыСеанса.ТекущийЛомбард; //ЛомбардСсылка;
		Иначе
			Объект.Должность = Пользователи.ТекущийПользователь().Сотрудник.Должность;
			Объект.Ответственный = Пользователи.ТекущийПользователь().Сотрудник;
			ЛомбардПользователя = РегистрыСведений.ЛБ_ТекущийЛомбардПользователя.Получить(Новый Структура("Пользователь", Пользователи.ТекущийПользователь()));
			Объект.Ломбард = ЛомбардПользователя.Ломбард;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.ДатаНачалаИнвентаризации) Тогда
			Объект.ДатаНачалаИнвентаризации = ТекущаяДата();
		КонецЕсли;
		
		//+МАН 27.03.25
		ЗаполнитьТЧ();
		ДобавитьМОЛ();
		//-МАН
	КонецЕсли;
	//-Мельников

	//+МАН 17.12.25
	Если Параметры.Ключ.Пустая() Тогда
		ЗаполнитьСклады(Истина);
	Иначе
		ЗаполнитьСклады();
	КонецЕсли;
	//-МАН
	
	Если Объект.ВидИнвентаризации = Перечисления.ЛБ_ВидИнвентаризации.Выборочная Тогда
		ЗаполнитьСписокВыбораКамней();
		ЗаполнитьСписокВыбораЗалогодателей();
	КонецЕсли;

	Если СтрНайти(Объект.Склад, "Витрина") > 0 Тогда
		Элементы.ТипИнвентаризации.СписокВыбора.Очистить();
		Элементы.ТипИнвентаризации.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ЛБ_ТипИнвентаризации.Инвентаризация"));
	Иначе
		Элементы.ТипИнвентаризации.СписокВыбора.Очистить();
		Элементы.ТипИнвентаризации.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ЛБ_ТипИнвентаризации.Инвентаризация"));
		Элементы.ТипИнвентаризации.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ЛБ_ТипИнвентаризации.КонтрольнаяПроверка"));
	КонецЕсли;

	УстановитьВидимостьСчетовУчета();
	
	УстановитьУсловноеОформление();
	
	ПроверитьНаличиеПредседателя();
	
	ИдентификаторыСобытийПриОткрытии = "ПриОткрытии";
	
	//++ИВВ 02.2026, вычеты для часов
	ОбновитьПредставлениеВидВставки();
    //--ИВВ
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ++ Сербаев 05.05.2023
	//Если НЕ ТолькоПросмотр И ИспользоватьПодключаемоеОборудование Тогда
	//	// Попробуем подключить сканер штрихкода
	//	МенеджерОборудованияКлиентПереопределяемый.НачатьПодключениеОборудованиеПриОткрытииФормы(ЭтотОбъект, "СканерШтрихкода");
	//КонецЕсли;
	//
	//// ИнтернетПоддержкаПользователей.Новости.ПриОткрытии
	//ОбработкаНовостейКлиент.КонтекстныеНовости_ПриОткрытии(ЭтаФорма);
	//// Конец ИнтернетПоддержкаПользователей.Новости.ПриОткрытии
	//
	//// СтандартныеПодсистемы.ПодключаемыеКоманды
	//ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	//// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	// -- Сербаев 05.05.2023
	
	//МассивИменКолонокДляПодсветки = Новый Массив;
    //МассивИменКолонокДляПодсветки.Добавить(Элементы.Товары.ПодчиненныеЭлементы.ТоварыГруппа2.ПодчиненныеЭлементы.ТоварыКатегорияФакт.Имя);
    //МассивИменКолонокДляПодсветки.Добавить(Элементы.Товары.ПодчиненныеЭлементы.ВидИзделияФакт.Имя);
	//УстановитьПодсветкуСертификации(ЭтаФорма, "Объект.Товары.КатегорияФакт", МассивИменКолонокДляПодсветки);
	УсловноеОформлениеТоваров();
	//ВидИнвентаризацииПриИзменении("");
	
	//+Мельников 13.05.24
	УстановитьВидимость();
	//-Мельников

	//+МАН 30.05.25
	ОбщееКоличествоОЗВДокументе();
    //-МАН
КонецПроцедуры  
   
&НаСервере
Процедура УсловноеОформлениеТоваров()
	УсловноеОформлениеКолонки("ВидИзделияФакт", 		"ВидИзделия",			"Объект.Товары."); 
	УсловноеОформлениеКолонки("МеталлФакт", 			"Металл",				"Объект.Товары.");
    УсловноеОформлениеКолонки("ПробаФакт", 				"Проба",				"Объект.Товары.");   
	УсловноеОформлениеКолонки("КатегорияФакт", 			"Категория",			"Объект.Товары.");
	УсловноеОформлениеКолонки("ИменникФакт", 			"Именник",				"Объект.Товары.");
	УсловноеОформлениеКолонки("КлеймоФакт", 			"Клеймо",				"Объект.Товары.");
	УсловноеОформлениеКолонки("МассаМеталлаФакт", 		"МассаМеталла",			"Объект.Товары.");
	УсловноеОформлениеКолонки("ОбщаяМассаФакт", 		"ОбщаяМасса",			"Объект.Товары."); 
	УсловноеОформлениеКолонки("КоличествоФакт", 		"Количество",			"Объект.Товары.");
	УсловноеОформлениеКолонки("СуммаОценкиФакт", 		"СуммаОценки",			"Объект.Товары.");
	УсловноеОформлениеКолонки("СуммаОценкиКамниФакт", 	"СуммаОценкиКамни",		"Объект.Товары.");
	УсловноеОформлениеКолонки("СуммаОценкиМеталлыФакт", "СуммаОценкиМеталлы",	"Объект.Товары.");
	УсловноеОформлениеКолонки("ДанныеИменникаФакт",		"ДанныеИменника",		"Объект.Товары.");
	//+Мельников 21.05.24
	//Вставки камней
	УсловноеОформлениеКолонки("ЦенаФакт",				"Цена",					"Объект.ВставкиФакт.");
	УсловноеОформлениеКолонки("СуммаФакт",				"Сумма",				"Объект.ВставкиФакт.");
	УсловноеОформлениеКолонки("ФормаОгранкиФакт",		"ФормаОгранки",			"Объект.ВставкиФакт.");
	УсловноеОформлениеКолонки("ДлинаФакт",				"Длина",				"Объект.ВставкиФакт.");
	УсловноеОформлениеКолонки("ШиринаФакт",				"Ширина",				"Объект.ВставкиФакт.");
	УсловноеОформлениеКолонки("ГруппаЦветаФакт",		"ГруппаЦвета",			"Объект.ВставкиФакт.");
	УсловноеОформлениеКолонки("ГруппаКачестваФакт",		"ГруппаКачества",		"Объект.ВставкиФакт.");
	УсловноеОформлениеКолонки("КачествоОгранкиФакт",	"КачествоОгранки",		"Объект.ВставкиФакт.");
	УсловноеОформлениеКолонки("КоличествоФакт",			"Количество",			"Объект.ВставкиФакт.");
	УсловноеОформлениеКолонки("ВесФакт",				"Вес",					"Объект.ВставкиФакт.");
	УсловноеОформлениеКолонки("ЕдиницаИзмеренияФакт",	"ЕдиницаИзмерения",		"Объект.ВставкиФакт.");
	УсловноеОформлениеКолонки("ЭтоВесовойФакт",			"ЭтоВесовой",			"Объект.ВставкиФакт.");
	УсловноеОформлениеКолонки("ВидФакт",				"Вид",					"Объект.ВставкиФакт.");
	УсловноеОформлениеКолонки("НеОцениватьФакт",		"НеОценивать",			"Объект.ВставкиФакт.");
	УсловноеОформлениеКолонки("ДиаметрФакт",			"Диаметр",				"Объект.ВставкиФакт.");
	УсловноеОформлениеКолонки("Диаметр1Факт",			"Диаметр1",				"Объект.ВставкиФакт.");
	УсловноеОформлениеКолонки("Диаметр2Факт",			"Диаметр2",				"Объект.ВставкиФакт.");
	УсловноеОформлениеКолонки("ВысотаФакт",				"Высота",				"Объект.ВставкиФакт.");
	УсловноеОформлениеКолонки("ВесГраммыФакт",			"ВесГраммы",			"Объект.ВставкиФакт.");
	УсловноеОформлениеКолонки("ВидОгранкиФакт",			"ВидОгранки",			"Объект.ВставкиФакт.");
	УсловноеОформлениеКолонки("ВидВставкиФакт",			"ВидВставки",			"Объект.ВставкиФакт.");
	//Вставки металла
	УсловноеОформлениеКолонки("ПробаФакт",				"Проба",				"Объект.ВставкиМеталла.");
	УсловноеОформлениеКолонки("ВесФакт",				"Вес",					"Объект.ВставкиМеталла.");
	УсловноеОформлениеКолонки("ВесВПробеЧистотыФакт",	"ВесВПробеЧистоты",		"Объект.ВставкиМеталла.");
	УсловноеОформлениеКолонки("ЕдиницаИзмеренияФакт",	"ЕдиницаИзмерения",		"Объект.ВставкиМеталла.");
	УсловноеОформлениеКолонки("СуммаОценкиФакт",		"СуммаОценки",			"Объект.ВставкиМеталла.");
	//НовыеОЗ
	УсловноеОформлениеКолонки("ВидИзделияФакт", 		"ВидИзделия",			"Объект.НовыеОЗ."); 
	УсловноеОформлениеКолонки("МеталлФакт", 			"Металл",				"Объект.НовыеОЗ.");
    УсловноеОформлениеКолонки("ПробаФакт", 				"Проба",				"Объект.НовыеОЗ.");   
	УсловноеОформлениеКолонки("КатегорияФакт", 			"Категория",			"Объект.НовыеОЗ.");
	УсловноеОформлениеКолонки("ИменникФакт", 			"Именник",				"Объект.НовыеОЗ.");
	УсловноеОформлениеКолонки("КлеймоФакт", 			"Клеймо",				"Объект.НовыеОЗ.");
	УсловноеОформлениеКолонки("МассаМеталлаФакт", 		"МассаМеталла",			"Объект.НовыеОЗ.");
	УсловноеОформлениеКолонки("ОбщаяМассаФакт", 		"ОбщаяМасса",			"Объект.НовыеОЗ."); 
	УсловноеОформлениеКолонки("КоличествоФакт", 		"Количество",			"Объект.НовыеОЗ.");
	УсловноеОформлениеКолонки("СуммаОценкиФакт", 		"СуммаОценки",			"Объект.НовыеОЗ.");
	УсловноеОформлениеКолонки("СуммаОценкиКамниФакт", 	"СуммаОценкиКамни",		"Объект.НовыеОЗ.");
	УсловноеОформлениеКолонки("СуммаОценкиМеталлыФакт", "СуммаОценкиМеталлы",	"Объект.НовыеОЗ.");
	УсловноеОформлениеКолонки("ДанныеИменникаФакт",		"ДанныеИменника",		"Объект.НовыеОЗ.");
	//Вставки камней
	УсловноеОформлениеКолонки("ЦенаФакт",				"Цена",					"Объект.ВставкиКамнейНовыеОЗ.");
	УсловноеОформлениеКолонки("СуммаФакт",				"Сумма",				"Объект.ВставкиКамнейНовыеОЗ.");
	УсловноеОформлениеКолонки("ФормаОгранкиФакт",		"ФормаОгранки",			"Объект.ВставкиКамнейНовыеОЗ.");
	УсловноеОформлениеКолонки("ДлинаФакт",				"Длина",				"Объект.ВставкиКамнейНовыеОЗ.");
	УсловноеОформлениеКолонки("ШиринаФакт",				"Ширина",				"Объект.ВставкиКамнейНовыеОЗ.");
	УсловноеОформлениеКолонки("ГруппаЦветаФакт",		"ГруппаЦвета",			"Объект.ВставкиКамнейНовыеОЗ.");
	УсловноеОформлениеКолонки("ГруппаКачестваФакт",		"ГруппаКачества",		"Объект.ВставкиКамнейНовыеОЗ.");
	УсловноеОформлениеКолонки("КачествоОгранкиФакт",	"КачествоОгранки",		"Объект.ВставкиКамнейНовыеОЗ.");
	УсловноеОформлениеКолонки("КоличествоФакт",			"Количество",			"Объект.ВставкиКамнейНовыеОЗ.");
	УсловноеОформлениеКолонки("ВесФакт",				"Вес",					"Объект.ВставкиКамнейНовыеОЗ.");
	УсловноеОформлениеКолонки("ЕдиницаИзмеренияФакт",	"ЕдиницаИзмерения",		"Объект.ВставкиКамнейНовыеОЗ.");
	УсловноеОформлениеКолонки("ЭтоВесовойФакт",			"ЭтоВесовой",			"Объект.ВставкиКамнейНовыеОЗ.");
	УсловноеОформлениеКолонки("ВидФакт",				"Вид",					"Объект.ВставкиКамнейНовыеОЗ.");
	УсловноеОформлениеКолонки("НеОцениватьФакт",		"НеОценивать",			"Объект.ВставкиКамнейНовыеОЗ.");
	УсловноеОформлениеКолонки("ДиаметрФакт",			"Диаметр",				"Объект.ВставкиКамнейНовыеОЗ.");
	УсловноеОформлениеКолонки("Диаметр1Факт",			"Диаметр1",				"Объект.ВставкиКамнейНовыеОЗ.");
	УсловноеОформлениеКолонки("Диаметр2Факт",			"Диаметр2",				"Объект.ВставкиКамнейНовыеОЗ.");
	УсловноеОформлениеКолонки("ВысотаФакт",				"Высота",				"Объект.ВставкиКамнейНовыеОЗ.");
	УсловноеОформлениеКолонки("ВесГраммыФакт",			"ВесГраммы",			"Объект.ВставкиКамнейНовыеОЗ.");
	УсловноеОформлениеКолонки("ВидОгранкиФакт",			"ВидОгранки",			"Объект.ВставкиКамнейНовыеОЗ.");
	УсловноеОформлениеКолонки("ВидВставкиФакт",			"ВидВставки",			"Объект.ВставкиКамнейНовыеОЗ.");
	//Вставки металла
	УсловноеОформлениеКолонки("ПробаФакт",				"Проба",				"Объект.ВставкиМеталлаНовыеОЗ.");
	УсловноеОформлениеКолонки("ВесФакт",				"Вес",					"Объект.ВставкиМеталлаНовыеОЗ.");
	УсловноеОформлениеКолонки("ВесВПробеЧистотыФакт",	"ВесВПробеЧистоты",		"Объект.ВставкиМеталлаНовыеОЗ.");
	УсловноеОформлениеКолонки("ЕдиницаИзмеренияФакт",	"ЕдиницаИзмерения",		"Объект.ВставкиМеталлаНовыеОЗ.");
	УсловноеОформлениеКолонки("СуммаОценкиФакт",		"СуммаОценки",			"Объект.ВставкиМеталлаНовыеОЗ.");
	//НаОх
	УсловноеОформлениеКолонки("ВидИзделияФакт", 		"ВидИзделия",			"Объект.НаОХ."); 
	УсловноеОформлениеКолонки("МеталлФакт", 			"Металл",				"Объект.НаОХ.");
    УсловноеОформлениеКолонки("ПробаФакт", 				"Проба",				"Объект.НаОХ.");   
	УсловноеОформлениеКолонки("КатегорияФакт", 			"Категория",			"Объект.НаОХ.");
	УсловноеОформлениеКолонки("ИменникФакт", 			"Именник",				"Объект.НаОХ.");
	УсловноеОформлениеКолонки("КлеймоФакт", 			"Клеймо",				"Объект.НаОХ.");
	УсловноеОформлениеКолонки("МассаМеталлаФакт", 		"МассаМеталла",			"Объект.НаОХ.");
	УсловноеОформлениеКолонки("ОбщаяМассаФакт", 		"ОбщаяМасса",			"Объект.НаОХ."); 
	УсловноеОформлениеКолонки("КоличествоФакт", 		"Количество",			"Объект.НаОХ.");
	УсловноеОформлениеКолонки("СуммаОценкиФакт", 		"СуммаОценки",			"Объект.НаОХ.");
	УсловноеОформлениеКолонки("СуммаОценкиКамниФакт", 	"СуммаОценкиКамни",		"Объект.НаОХ.");
	УсловноеОформлениеКолонки("СуммаОценкиМеталлыФакт", "СуммаОценкиМеталлы",	"Объект.НаОХ.");
	УсловноеОформлениеКолонки("ДанныеИменникаФакт",		"ДанныеИменника",		"Объект.НаОХ.");
	//Вставки камней
	УсловноеОформлениеКолонки("ЦенаФакт",				"Цена",					"Объект.ВставкиКамнейНаОХ.");
	УсловноеОформлениеКолонки("СуммаФакт",				"Сумма",				"Объект.ВставкиКамнейНаОХ.");
	УсловноеОформлениеКолонки("ФормаОгранкиФакт",		"ФормаОгранки",			"Объект.ВставкиКамнейНаОХ.");
	УсловноеОформлениеКолонки("ДлинаФакт",				"Длина",				"Объект.ВставкиКамнейНаОХ.");
	УсловноеОформлениеКолонки("ШиринаФакт",				"Ширина",				"Объект.ВставкиКамнейНаОХ.");
	УсловноеОформлениеКолонки("ГруппаЦветаФакт",		"ГруппаЦвета",			"Объект.ВставкиКамнейНаОХ.");
	УсловноеОформлениеКолонки("ГруппаКачестваФакт",		"ГруппаКачества",		"Объект.ВставкиКамнейНаОХ.");
	УсловноеОформлениеКолонки("КачествоОгранкиФакт",	"КачествоОгранки",		"Объект.ВставкиКамнейНаОХ.");
	УсловноеОформлениеКолонки("КоличествоФакт",			"Количество",			"Объект.ВставкиКамнейНаОХ.");
	УсловноеОформлениеКолонки("ВесФакт",				"Вес",					"Объект.ВставкиКамнейНаОХ.");
	УсловноеОформлениеКолонки("ЕдиницаИзмеренияФакт",	"ЕдиницаИзмерения",		"Объект.ВставкиКамнейНаОХ.");
	УсловноеОформлениеКолонки("ЭтоВесовойФакт",			"ЭтоВесовой",			"Объект.ВставкиКамнейНаОХ.");
	УсловноеОформлениеКолонки("ВидФакт",				"Вид",					"Объект.ВставкиКамнейНаОХ.");
	УсловноеОформлениеКолонки("НеОцениватьФакт",		"НеОценивать",			"Объект.ВставкиКамнейНаОХ.");
	УсловноеОформлениеКолонки("ДиаметрФакт",			"Диаметр",				"Объект.ВставкиКамнейНаОХ.");
	УсловноеОформлениеКолонки("Диаметр1Факт",			"Диаметр1",				"Объект.ВставкиКамнейНаОХ.");
	УсловноеОформлениеКолонки("Диаметр2Факт",			"Диаметр2",				"Объект.ВставкиКамнейНаОХ.");
	УсловноеОформлениеКолонки("ВысотаФакт",				"Высота",				"Объект.ВставкиКамнейНаОХ.");
	УсловноеОформлениеКолонки("ВесГраммыФакт",			"ВесГраммы",			"Объект.ВставкиКамнейНаОХ.");
	УсловноеОформлениеКолонки("ВидОгранкиФакт",			"ВидОгранки",			"Объект.ВставкиКамнейНаОХ.");
	УсловноеОформлениеКолонки("ВидВставкиФакт",			"ВидВставки",			"Объект.ВставкиКамнейНаОХ.");
	//Вставки металла
	УсловноеОформлениеКолонки("ПробаФакт",				"Проба",				"Объект.ВставкиМеталлаНаОХ.");
	УсловноеОформлениеКолонки("ВесФакт",				"Вес",					"Объект.ВставкиМеталлаНаОХ.");
	УсловноеОформлениеКолонки("ВесВПробеЧистотыФакт",	"ВесВПробеЧистоты",		"Объект.ВставкиМеталлаНаОХ.");
	УсловноеОформлениеКолонки("ЕдиницаИзмеренияФакт",	"ЕдиницаИзмерения",		"Объект.ВставкиМеталлаНаОХ.");
	УсловноеОформлениеКолонки("СуммаОценкиФакт",		"СуммаОценки",			"Объект.ВставкиМеталлаНаОХ.");
	//-Мельников

КонецПроцедуры

//+Мельников 21.05.24 Добавлен третий параметр ПолеДанных
&НаСервере
Процедура УсловноеОформлениеКолонки(НазваниеКолонки, СЧемСравнить, ПолеДанных)
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,10,Истина));
	//+Мельников 21.05.24 Добавим цвета в эту серость
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(255, 0, 0)); //Красный
	//-Мельников
	
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ПолеДанных + НазваниеКолонки); //Было: ("Объект.Товары."+НазваниеКолонки);
	ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементУсловия.ПравоеЗначение = Новый ПолеКомпоновкиДанных(ПолеДанных + СЧемСравнить); //Было: ("Объект.Товары."+СЧемСравнить);
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(СтрЗаменить(СтрЗаменить(ПолеДанных, "Объект.", ""), ".", "") + НазваниеКолонки); //Было: ("Товары"+НазваниеКолонки);
КонецПроцедуры 

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ИспользоватьПодключаемоеОборудование И ЗавершениеРаботы Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	// ++ Сербаев 05.05.2023
	//// ПодключаемоеОборудование
	//МенеджерОборудованияКлиентПереопределяемый.НачатьОтключениеОборудованиеПриЗакрытииФормы(ЭтаФорма);
	//// Конец ПодключаемоеОборудование
	// -- Сербаев 05.05.2023
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ++ Сербаев 05.05.2023
	//// ИнтернетПоддержкаПользователей.Новости.ОбработкаОповещения
	//ОбработкаНовостейКлиент.КонтекстныеНовости_ОбработкаОповещения(ЭтаФорма, ИмяСобытия, Параметр, Источник);
	//// Конец ИнтернетПоддержкаПользователей.Новости.ОбработкаОповещения
	//Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
	//	Если ИмяСобытия = "ScanData" Тогда
	//		Если Параметр[1] = Неопределено Тогда
	//			ТекущийКод = Параметр[0];
	//		Иначе
	//			ТекущийКод = Параметр[1][1];
	//		КонецЕсли;
	//		ДобавитьПоШтрихкодуНаСервере(ТекущийКод);
	//	КонецЕсли;
	//ИначеЕсли ИмяСобытия = "ДанныеСкопированыВБуферОбмена" Тогда
	//	
	//	УстановитьДоступностьКомандыВставки(ЭтотОбъект, Истина);
	//	
	//КонецЕсли; 
	// -- Сербаев 05.05.2023
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Обработка.ПодборНоменклатуры.Форма.Форма" Тогда	
		ОбработкаВыбораПодборВставкаИзБуфераНаСервере(ВыбранноеЗначение, ИсточникВыбора.ИмяТаблицы);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	ВсеЗаполнено = ПроверитьЗаполнениеТЧ();
	Если НЕ ВсеЗаполнено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если ПараметрыЗаписи.РежимЗаписи = ПредопределенноеЗначение("РежимЗаписиДокумента.Проведение") Тогда
		КлючеваяОперация = "ПроведениеИнвентаризацияТоваровНаСкладе";
		//+Мельников 06.05.24
		//ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, КлючеваяОперация);

		//ВсеЗаполнено = ПроверитьЗаполнениеТЧ();
		//Если НЕ ВсеЗаполнено Тогда
		//	Отказ = Истина;
		//	Возврат;
		//КонецЕсли;
		
		Объект.ДатаОкончанияИнвентаризации = ТекущаяДата();

		//++ООВ 26.03.2026 Заявка 3757 При наличии недостачи - вывод другого сообщения 
		СтрокиНедостачи = Объект.Товары.НайтиСтроки(Новый Структура("КоличествоФакт", 0));
		Если СтрокиНедостачи.Количество() > 0 Тогда  
			СтрокиВывода = Новый Массив;
			Для Каждого Стр Из СтрокиНедостачи Цикл
				Если ЗначениеЗаполнено(Стр.Вставка) Тогда
					Вставка = "да";
				Иначе
					Вставка = "нет"; 
				КонецЕсли;
				СтрокаМассива = СтрШаблон("%1) артикул: %2, %3, %4, %5, вес изделия: %6, вес металла: %7, вставки: %8", 
				СтрокиНедостачи.Найти(Стр)+1, Стр.Артикул, Стр.ВидИзделия, Стр.Проба, Стр.Категория, Стр.ОбщаяМасса, Стр.МассаМеталла, Вставка);
				СтрокиВывода.Добавить(СтрокаМассива);
			КонецЦикла;	
			Текст = СтрСоединить(СтрокиВывода, Символы.ПС);
			
			ТекстВопроса = СтрШаблон("Фиксируется недостача по %1 позициям:
			|%2 
			|
			|После проведения документа отменить изменения будет невозможно.
			|Провести документ?", СтрокиВывода.Количество(), Текст);
			
			Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет); 
		Иначе 
			//--ООВ 26.03.2026 Заявка 3757 
			
			Ответ = Вопрос("После проведения документа отмена изменений будет невозможна.
			|Провести документ?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
			Если Ответ = КодВозвратаДиалога.Да Тогда
				Отказ = Ложь;
			Иначе
				Отказ = Истина;
			КонецЕсли;
			//-Мельников
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	УстановитьСостояниеДокумента();
	
	ЗаполнитьДобавленныеКолонкиТаблиц();

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ БСП

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	Если Команда.Имя = "ПодменюПечатьОбычное_АктПроверки"
		И Объект.ТипИнвентаризации <> ПредопределенноеЗначение("Перечисление.ЛБ_ТипИнвентаризации.КонтрольнаяПроверка") Тогда
		Сообщить("""Акт проверки"" можно распечатать только по ""Контрольной проверке""");
		Возврат;
	КонецЕсли;
	
	Если Команда.Имя = "ПодменюПечатьОбычное_ИНВ8"
		И Объект.ТипИнвентаризации <> ПредопределенноеЗначение("Перечисление.ЛБ_ТипИнвентаризации.Инвентаризация") Тогда
		
		Сообщить("""ИНВ-8 Акт инвентаризации ДМ и изделий из них"" можно распечатать только по полной или выборочной инвентаризации");
		Возврат;
	КонецЕсли;

	Если Команда.Имя = "ПодменюПечатьОбычное_ИНВ8Черновик"
		И Объект.ТипИнвентаризации <> ПредопределенноеЗначение("Перечисление.ЛБ_ТипИнвентаризации.Инвентаризация") Тогда
		
		Сообщить("""ИНВ-8 Акт инвентаризации ДМ и изделий из них (черновик)"" можно распечатать только по полной или выборочной инвентаризации");
		Возврат;
	КонецЕсли;

	Если Команда.Имя = "ПодменюПечатьОбычное_ИНВ8Пустая"
		И Объект.ТипИнвентаризации <> ПредопределенноеЗначение("Перечисление.ЛБ_ТипИнвентаризации.Инвентаризация") Тогда
		
		Сообщить("""ИНВ-8 Акт инвентаризации ДМ и изделий из них (пустой)"" можно распечатать только по полной или выборочной инвентаризации");
		Возврат;
	КонецЕсли;
	
	Если Команда.Имя = "ПодменюПечатьОбычное_ИНВ5"
		И Объект.ТипИнвентаризации <> ПредопределенноеЗначение("Перечисление.ЛБ_ТипИнвентаризации.Инвентаризация") Тогда
		
		Сообщить("""ИНВ-5 Акт инвентаризации ДМ на ОХ"" можно распечатать только по полной или выборочной инвентаризации");
		Возврат;
	КонецЕсли;

	Если Команда.Имя = "ПодменюПечатьОбычное_ИНВ5Пустая"
		И Объект.ТипИнвентаризации <> ПредопределенноеЗначение("Перечисление.ЛБ_ТипИнвентаризации.Инвентаризация") Тогда
		
		Сообщить("""ИНВ-5 Акт инвентаризации ДМ на ОХ (пустой)"" можно распечатать только по полной или выборочной инвентаризации");
		Возврат;
	КонецЕсли;
	
	Если Команда.Имя = "ПодменюПечатьОбычное_Изъятые"
		И Объект.ТипИнвентаризации <> ПредопределенноеЗначение("Перечисление.ЛБ_ТипИнвентаризации.Инвентаризация") Тогда
		
		Сообщить("""Акт проверки документов, подтверждающих изъятие"" можно распечатать только по полной или выборочной инвентаризации");
		Возврат;
	КонецЕсли;

	Если Команда.Имя = "ПодменюПечатьОбычное_ОписьПоступивших"
		И Объект.ТипИнвентаризации <> ПредопределенноеЗначение("Перечисление.ЛБ_ТипИнвентаризации.Инвентаризация") Тогда
		
		Сообщить("""Опись ценностей, поступивших во время инвентаризации"" можно распечатать только по полной или выборочной инвентаризации");
		Возврат;
	КонецЕсли;

	Если Команда.Имя = "ПодменюПечатьОбычное_ОписьВыбывших"
		И Объект.ТипИнвентаризации <> ПредопределенноеЗначение("Перечисление.ЛБ_ТипИнвентаризации.Инвентаризация") Тогда
		
		Сообщить("""Опись ценностей, выбывших во время инвентаризации"" можно распечатать только по полной или выборочной инвентаризации");
		Возврат;
	КонецЕсли;

	Если Команда.Имя = "ПодменюПечатьОбычное_Посылки"
		И Объект.ТипИнвентаризации <> ПредопределенноеЗначение("Перечисление.ЛБ_ТипИнвентаризации.Инвентаризация") Тогда
		
		Сообщить("""Опись не распакованных посылок с ценностями"" можно распечатать только по полной или выборочной инвентаризации");
		Возврат;
	КонецЕсли;
	
	//ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры 

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция НайтиСтрокуТабличнойЧасти(ИмяТабличнойЧасти, СтруктураОтбора)

	СтрокаТабличнойЧасти = Неопределено;

	МассивНайденныхСтрок = Объект[ИмяТабличнойЧасти].НайтиСтроки(СтруктураОтбора);
	Если МассивНайденныхСтрок.Количество() > 0 Тогда
		// Нашли. Вернем первую найденную строку.
		СтрокаТабличнойЧасти = МассивНайденныхСтрок[0];
	КонецЕсли;

	Возврат СтрокаТабличнойЧасти;

КонецФункции

// Процедура показывает новости, требующие прочтения (важные и очень важные)
//
// Параметры:
//  Нет
//
&НаКлиенте
Процедура Подключаемый_ПоказатьНовостиТребующиеПрочтенияПриОткрытии()
	
	// ++ Сербаев 05.05.2023
	//// ИнтернетПоддержкаПользователей.Новости.Подключаемый_ПоказатьНовостиТребующиеПрочтенияПриОткрытии
	//ИдентификаторыСобытийПриОткрытии = "ПриОткрытии";
	//// Конец ИнтернетПоддержкаПользователей.Новости.Подключаемый_ПоказатьНовостиТребующиеПрочтенияПриОткрытии

	//ОбработкаНовостейКлиент.КонтекстныеНовости_ПоказатьНовостиТребующиеПрочтенияПриОткрытии(ЭтаФорма, ИдентификаторыСобытийПриОткрытии); 
	// -- Сербаев 05.05.2023

КонецПроцедуры


#Область СчетаУчета

&НаСервере
Процедура УстановитьВидимостьСчетовУчета()
	
	ЭлементыСчетов = Новый Массив(); 
	ЭлементыСчетов.Добавить("ТоварыСчетУчета");
	
	//СчетаУчетаВДокументах.УстановитьВидимостьСчетовУчета(Элементы, ЭлементыСчетов);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НачатьЗаполнениеСчетовУчета(ПричиныИзменения, Объект = Неопределено, СтрокаСписка = Неопределено, КонтейнерОбъект = Неопределено, КонтейнерСтрокаСписка = Неопределено)
	
	// ++ Сербаев 05.05.2023
	//// Код этой функции сформирован автоматически с помощью СчетаУчетаВДокументах.КодФункцииНачатьЗаполнениеСчетовУчета()

	//ПараметрыЗаполнения = СчетаУчетаВДокументахКлиентСервер.НовыйПараметрыЗаполнения(
	//	"ИнвентаризацияТоваровНаСкладе",
	//	ПричиныИзменения,
	//	Объект,
	//	СтрокаСписка,
	//	КонтейнерОбъект,
	//	КонтейнерСтрокаСписка);

	//// 1. Заполняемые реквизиты
	//// Товары.Номенклатура
	//Если ПараметрыЗаполнения.ПричиныИзменения.Найти("Товары.Номенклатура") <> Неопределено Тогда
	//	СчетаУчетаВДокументахКлиентСервер.НачатьЗаполнениеРеквизита(ПараметрыЗаполнения, "Товары.СчетУчета");
	//КонецЕсли;

	//// Организация
	//Если ПараметрыЗаполнения.ПричиныИзменения.Найти("Организация") <> Неопределено Тогда
	//	СчетаУчетаВДокументахКлиентСервер.НачатьЗаполнениеРеквизита(ПараметрыЗаполнения, "Товары.СчетУчета");
	//КонецЕсли;

	//// Склад
	//Если ПараметрыЗаполнения.ПричиныИзменения.Найти("Склад") <> Неопределено Тогда
	//	СчетаУчетаВДокументахКлиентСервер.НачатьЗаполнениеРеквизита(ПараметрыЗаполнения, "Товары.СчетУчета");
	//КонецЕсли;

	//// Дата
	//Если ПараметрыЗаполнения.ПричиныИзменения.Найти("Дата") <> Неопределено Тогда
	//	СчетаУчетаВДокументахКлиентСервер.НачатьЗаполнениеРеквизита(ПараметрыЗаполнения, "Товары.СчетУчета");
	//КонецЕсли;

	//// 2. (если требуется) Передадим на сервер данные, необходимые для заполнения
	//Если ПараметрыЗаполнения.Свойство("Контейнер") Тогда
	//	// Товары.Номенклатура
	//	Если ПараметрыЗаполнения.ПричиныИзменения.Найти("Товары.Номенклатура") <> Неопределено Тогда
	//		СчетаУчетаВДокументахКлиентСервер.ДополнитьДанныеЗаполнения(ПараметрыЗаполнения, "Строка", "Номенклатура");
	//		СчетаУчетаВДокументахКлиентСервер.ДополнитьДанныеЗаполнения(ПараметрыЗаполнения, "Строка", "СчетУчета");
	//		СчетаУчетаВДокументахКлиентСервер.ДополнитьДанныеЗаполнения(ПараметрыЗаполнения, "Объект", "Организация");
	//		СчетаУчетаВДокументахКлиентСервер.ДополнитьДанныеЗаполнения(ПараметрыЗаполнения, "Объект", "Склад");
	//		СчетаУчетаВДокументахКлиентСервер.ДополнитьДанныеЗаполнения(ПараметрыЗаполнения, "Объект", "Дата");
	//	КонецЕсли;

	//	// Организация
	//	Если ПараметрыЗаполнения.ПричиныИзменения.Найти("Организация") <> Неопределено Тогда
	//		СчетаУчетаВДокументахКлиентСервер.ДополнитьДанныеЗаполнения(ПараметрыЗаполнения, "Объект", "Организация");
	//		СчетаУчетаВДокументахКлиентСервер.ДополнитьДанныеЗаполнения(ПараметрыЗаполнения, "Строка", "СчетУчета");
	//		СчетаУчетаВДокументахКлиентСервер.ДополнитьДанныеЗаполнения(ПараметрыЗаполнения, "Строка", "Номенклатура");
	//		СчетаУчетаВДокументахКлиентСервер.ДополнитьДанныеЗаполнения(ПараметрыЗаполнения, "Объект", "Склад");
	//		СчетаУчетаВДокументахКлиентСервер.ДополнитьДанныеЗаполнения(ПараметрыЗаполнения, "Объект", "Дата");
	//	КонецЕсли;

	//	// Склад
	//	Если ПараметрыЗаполнения.ПричиныИзменения.Найти("Склад") <> Неопределено Тогда
	//		СчетаУчетаВДокументахКлиентСервер.ДополнитьДанныеЗаполнения(ПараметрыЗаполнения, "Объект", "Склад");
	//		СчетаУчетаВДокументахКлиентСервер.ДополнитьДанныеЗаполнения(ПараметрыЗаполнения, "Строка", "СчетУчета");
	//		СчетаУчетаВДокументахКлиентСервер.ДополнитьДанныеЗаполнения(ПараметрыЗаполнения, "Строка", "Номенклатура");
	//		СчетаУчетаВДокументахКлиентСервер.ДополнитьДанныеЗаполнения(ПараметрыЗаполнения, "Объект", "Организация");
	//		СчетаУчетаВДокументахКлиентСервер.ДополнитьДанныеЗаполнения(ПараметрыЗаполнения, "Объект", "Дата");
	//	КонецЕсли;

	//	// Дата
	//	Если ПараметрыЗаполнения.ПричиныИзменения.Найти("Дата") <> Неопределено Тогда
	//		СчетаУчетаВДокументахКлиентСервер.ДополнитьДанныеЗаполнения(ПараметрыЗаполнения, "Объект", "Дата");
	//		СчетаУчетаВДокументахКлиентСервер.ДополнитьДанныеЗаполнения(ПараметрыЗаполнения, "Строка", "СчетУчета");
	//		СчетаУчетаВДокументахКлиентСервер.ДополнитьДанныеЗаполнения(ПараметрыЗаполнения, "Строка", "Номенклатура");
	//		СчетаУчетаВДокументахКлиентСервер.ДополнитьДанныеЗаполнения(ПараметрыЗаполнения, "Объект", "Организация");
	//		СчетаУчетаВДокументахКлиентСервер.ДополнитьДанныеЗаполнения(ПараметрыЗаполнения, "Объект", "Склад");
	//	КонецЕсли;

	//КонецЕсли; // Нужно передавать на сервер данные заполнения
	//
	//Возврат ПараметрыЗаполнения;
	// -- Сербаев 05.05.2023
	
КонецФункции

&НаСервере
Процедура ОбработкаВыбораПодборВставкаИзБуфераНаСервере(ВыбранноеЗначение, ИмяТаблицы)

	ЭтоВставкаИзБуфера = ВыбранноеЗначение.Свойство("ЭтоВставкаИзБуфера");
	СписокСвойств = Неопределено;
	Если ЭтоВставкаИзБуфера Тогда
		
		ТаблицаТоваров = ВыбранноеЗначение.Данные;
		СписокСвойств = ВыбранноеЗначение.СписокСвойств;
		
	Иначе
		
		ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресПодобраннойНоменклатурыВХранилище);
		
	КонецЕсли;
	
	ДанныеОбъекта = Новый Структура("Дата, Организация, Склад");
	ЗаполнитьЗначенияСвойств(ДанныеОбъекта, Объект);
	
	СтрокиДляЗаполненияСчетов = Новый Массив;

	Для Каждого СтрокаТовара Из ТаблицаТоваров Цикл
		
		СтрокаТабличнойЧасти = Неопределено;
		Если Не ЭтоВставкаИзБуфера Тогда
			
			СтруктураОтбора = Новый Структура("Номенклатура, Цена", СтрокаТовара.Номенклатура, СтрокаТовара.Цена);
			СтрокаТабличнойЧасти = НайтиСтрокуТабличнойЧасти(ИмяТаблицы, СтруктураОтбора);
			
		КонецЕсли;
		Если СтрокаТабличнойЧасти <> Неопределено Тогда
			// Нашли - увеличиваем количество.
			СтрокаТабличнойЧасти.Количество = СтрокаТабличнойЧасти.Количество + СтрокаТовара.Количество;
			
			ЗаполнитьДобавленныеКолонкиСтрокиТаблицыТовары(СтрокаТабличнойЧасти);
			РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти);
		Иначе
			
			Если ЭтоВставкаИзБуфера
				И БухгалтерскийУчетПереопределяемый.НоменклатураЯвляетсяУслугой(СтрокаТовара.Номенклатура) Тогда
					
				Продолжить;
					
			КонецЕсли;
			СтрокаТабличнойЧасти = Объект[ИмяТаблицы].Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТовара, СписокСвойств);
			СтрокиДляЗаполненияСчетов.Добавить(СтрокаТабличнойЧасти);
			ЗаполнитьДобавленныеКолонкиСтрокиТаблицыТовары(СтрокаТабличнойЧасти);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// ++ Сербаев 05.05.2023
	//СчетаУчетаВДокументах.ЗаполнитьСтроки(СтрокиДляЗаполненияСчетов, ИмяТаблицы, Объект, Документы.ИнвентаризацияТоваровНаСкладе);
	// -- Сербаев 05.05.2023
	Если ЭтоВставкаИзБуфера Тогда
		
		ВыбранноеЗначение.КоличествоДобавленныхСтрок = СтрокиДляЗаполненияСчетов.Количество();
		
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкоду(Команда)
	ОписаниеОповещенияПоискПоШтрихкоду = Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("РегистрСведений.ШтрихкодыНоменклатуры.Форма.ФормаВводШтрихкода", , ЭтотОбъект,,,,ОписаниеОповещенияПоискПоШтрихкоду , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		ДобавитьНоменклатуруНаСервере(Результат.Номенклатура);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьНоменклатуруНаСервере(Номенклатура)

	ТаблицаТовары = Новый ТаблицаЗначений;
	ТаблицаТовары.Колонки.Добавить("Номенклатура");
	ТаблицаТовары.Колонки.Добавить("Количество");
	ТаблицаТовары.Колонки.Добавить("Цена");
	
	ДанныеОбъекта = Новый Структура("Дата, Организация, СуммаВключаетНДС");
	
	ЗаполнитьЗначенияСвойств(ДанныеОбъекта, Объект);
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		СведенияОНоменклатуре = БухгалтерскийУчетПереопределяемый.ПолучитьСведенияОНоменклатуре(Номенклатура, ДанныеОбъекта, Ложь, Истина);
	Иначе
		СведенияОНоменклатуре = Неопределено;
	КонецЕсли;
	
	СтрокаТаблицаТовары = ТаблицаТовары.Добавить();
	
	СтрокаТаблицаТовары.Номенклатура = Номенклатура;
	СтрокаТаблицаТовары.Количество = 1;
	СтрокаТаблицаТовары.Цена = ?(СведенияОНоменклатуре = Неопределено, 0, СведенияОНоменклатуре.Цена);
	
	Значение = Новый Структура("АдресПодобраннойНоменклатурыВХранилище, КоличествоДобавленныхСтрок", ПоместитьВоВременноеХранилище(ТаблицаТовары, УникальныйИдентификатор));
	
	ОбработкаВыбораПодборВставкаИзБуфераНаСервере(Значение, "Товары");

КонецПроцедуры 

&НаСервере
Функция ДобавитьПоШтрихкодуНаСервере(Штрихкод)
	ТаблицаНоменклатурыПоШтрихкоду = РегистрыСведений.ШтрихкодыНоменклатуры.НоменклатураПоШтрихкоду(Штрихкод);
	
	Если ТаблицаНоменклатурыПоШтрихкоду.Количество() = 1 Тогда
		ДобавитьНоменклатуруНаСервере(ТаблицаНоменклатурыПоШтрихкоду[0].Номенклатура);
	Иначе
		ДобавитьНоменклатуруНаСервере(Справочники.Номенклатура.ПустаяСсылка());
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура СкопироватьСтроки(Команда)
	
	ИмяТаблицы = ПолучитьИмяТекущейТабличнойЧасти();
	Если ПустаяСтрока(ИмяТаблицы) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	КоличествоСтрок = Элементы[ИмяТаблицы].ВыделенныеСтроки.Количество();
	Если КоличествоСтрок = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьСтроки(Команда)
	
	ИмяТаблицы = ПолучитьИмяТекущейТабличнойЧасти();
	Если ПустаяСтрока(ИмяТаблицы) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти

#Область КопированиеВставкаСтрокЧерезБуферОбмена

&НаСервере
Процедура СкопироватьСтрокиНаСервере(ИмяТаблицы)
	
	

КонецПроцедуры

&НаСервере
Функция ВставитьСтрокиНаСервере(ИмяТаблицы)
	
	
КонецФункции

&НаКлиенте
Функция ПолучитьИмяТекущейТабличнойЧасти()
	
	Возврат "Товары";
	
КонецФункции

&НаСервере
Процедура ОпределитьСписокСвойствДляВставкиИзБуфера(ПараметрыВставки)

	СписокСвойств = Новый Массив;
	СписокСвойств.Добавить("Номенклатура");
	СписокСвойств.Добавить("Количество");
	СписокСвойств.Добавить("КоличествоУчет");
	СписокСвойств.Добавить("Цена");
	СписокСвойств.Добавить("ЦенаВРознице");
	СписокСвойств.Добавить("Сумма");
	СписокСвойств.Добавить("СуммаУчет");
	Если ПараметрыВставки.ПоказыватьСчетаУчетаВДокументах Тогда
		
		СписокСвойств.Добавить("СчетУчета");
		
	КонецЕсли;
	
	// ++ Сербаев 05.05.2023
	//ПараметрыВставки.СписокСвойств = ОбработкаТабличныхЧастей.ПолучитьСписокСвойствИмеющихсяВТаблицеДанных(
	//	ПараметрыВставки.Данные, СписокСвойств); 
	// -- Сербаев 05.05.2023	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКомандыВставки(Форма, Доступность)

//	Доступность = Не Форма.ТолькоПросмотр И Доступность;
//	Элементы = Форма.Элементы;
//	Элементы.ТоварыВставитьСтроки.Доступность					 = Доступность;
//	Элементы.ТоварыКонтекстноеМенюВставитьСтроки.Доступность	 = Доступность;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтветственноеЛицоНаСкладе(Склад, Дата)
	
	// ++ Сербаев 05.05.2023
	//Возврат ОтветственныеЛицаБППереопределяемый.ОтветственноеЛицоНаСкладе(Склад, Дата);
	// -- Сербаев 05.05.2023
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеПоОстаткам

&НаКлиенте
Процедура ЗаполнитьПоОстаткамЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьДокументНаКлиенте("Заполнить");
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДокументНаКлиенте(НазваниеДействия)
	
	НоваяСтрокаТЧ = Ложь;

	Если ТекущийЭлемент.Имя = "Товары" ИЛИ ТекущийЭлемент.Имя = "ТоварыЗаполнитьПоОстаткам1" Тогда 
		//+МАН 22.11.24
		ЗаполнитьПоОстаткамОбъектовЗалога(Истина);
		//-МАН
	ИначеЕсли ТекущийЭлемент.Имя = "НовыеОЗ" Тогда
		//ЗаполнитьПоОстаткамНовыеОбъектыЗалога();
		ЗаполнитьПоОстаткамОбъектовЗалога(,,,,Истина);
	КонецЕсли;
		
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаПроведениеИнвентаризации Тогда
		ТекущийЭлемент = Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаТовары;
		ТекСтр = СтрЗаменить(Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаТовары.Имя, "Группа", "");
	КонецЕсли;
	
	ОбщееКоличествоОЗВДокументе();
КонецПроцедуры

//+МАН 25.02.26 Изменен запрос для остатков и сумки.
Процедура ЗаполнитьПоОстаткамОбъектовЗалога(Остатки = Ложь, НаОХ = Ложь, Изъятые = Ложь, СумкаЗакрыта = Ложь, НовыеОЗ = Ложь, ОбновитьНовыеОЗ = Ложь)
	
	СкладВитринаНеЦО = СтрНайти(Объект.Склад, "Витрина") > 0 И Объект.Ломбард <> Справочники.ЛБ_Ломбарды.ЦентральныйОфис;
	
	ЦО = Объект.Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис;
	
	Если Остатки ИЛИ НовыеОЗ ИЛИ ОбновитьНовыеОЗ ИЛИ ЦО ИЛИ ((НаОХ ИЛИ Изъятые ИЛИ СумкаЗакрыта) И НЕ СкладВитринаНеЦО) Тогда
		
		//+МАН 20.02.26 Убрал из запроса т.к. в запросе выходит несколько статусов из-за того что в измерениях участвует накладная.
		//Если ((Остатки И НЕ СкладВитринаНеЦО) ИЛИ СумкаЗакрыта) И НЕ ЦО Тогда
		//	Условие = "ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_СтатусыОбъектовЗалогаВНакладной.СрезПоследних(&НаДату, ) КАК ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних
		//	|		ПО (ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ОбъектЗалога)" + Символы.ПС;
		//Иначе
			Условие = "";
		//КонецЕсли;
		//-МАН
		
		Если СумкаЗакрыта И НЕ ЦО Тогда
			УсловиеСумка = "ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СостоянияОбъектовЗалога.ОбъектЗалога.Код,
			|	СостоянияОбъектовЗалога.ОбъектЗалога,
			|	РеквизитыОбъектаЗалога.Артикул,
			|	СостоянияОбъектовЗалога.СтатусОбъектаЗалога,
			|	РеквизитыОбъектаЗалога.ЕдиницаИзмерения,
			|	ЛБ_ОбъектыЗалогаОстатки.КоличествоПриход,
			|	ЛБ_ОбъектыЗалогаОстатки.КоличествоПриход,
			|	СостоянияОбъектовЗалога.СуммаОценкиНачальная,
			|	СостоянияОбъектовЗалога.СуммаОценкиНачальная,
			|	РеквизитыОбъектаЗалога.ВидИзделия,
			|	РеквизитыОбъектаЗалога.ВидИзделия,
			|	РеквизитыОбъектаЗалога.Проба,
			|	РеквизитыОбъектаЗалога.Проба,
			|	РеквизитыОбъектаЗалога.Категория,
			|	РеквизитыОбъектаЗалога.Категория,
			|	РеквизитыОбъектаЗалога.Вес,
			|	РеквизитыОбъектаЗалога.Вес,
			|	РеквизитыОбъектаЗалога.ВесЧистый,
			|	РеквизитыОбъектаЗалога.ВесЧистый,
			|	РеквизитыОбъектаЗалога.Проба.Владелец,
			|	РеквизитыОбъектаЗалога.Проба.Владелец,
			|	СостоянияОбъектовЗалога.ЗалоговыйБилет.Залогодатель,
			|	СостоянияОбъектовЗалога.ЗалоговыйБилет.Дата,
			|	СостоянияОбъектовЗалога.ЗалоговыйБилет.ОтветственныйСотрудник,
			|	РеквизитыОбъектаЗалога.Клеймо,
			|	РеквизитыОбъектаЗалога.Клеймо,
			|	РеквизитыОбъектаЗалога.Именник,
			|	РеквизитыОбъектаЗалога.Именник,
			|	РеквизитыОбъектаЗалога.ДанныеИменника,
			|	РеквизитыОбъектаЗалога.ДанныеИменника,
			|	СостоянияОбъектовЗалога.ЗалоговыйБилет,
			|	РасчетыСКлиентамиПоОбъектамЗалога.СуммаОстаток,
			|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы,
			|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы,
			|	РеквизитыОбъектаЗалога.НомерСтрокиТаблицы,
			|	СостоянияОбъектовЗалога.СуммаЗайма,
			|	СостоянияОбъектовЗалога.СуммаДолгаЗайма,
			|	РеквизитыОбъектаЗалога.СостояниеИзделия,
			|	РеквизитыОбъектаЗалога.Дефекты,
			|	РеквизитыОбъектаЗалога.Вес30,
			|	РеквизитыОбъектаЗалога.СуммаОценкиМакс
			|ИЗ
			|	РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(
			|			&НаДату,
			|			500 = 500
			|			И 750 = 750
			|			И 760 = 760
			|			И 770 = 770) КАК СостоянияОбъектовЗалога
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
			|				&НаДату,
			|				Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|					И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|					И НЕ Регистратор В
			|							(ВЫБРАТЬ
			|								ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			|							ИЗ
			|								РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&НаДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			|							ГДЕ
			|								ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))) КАК РеквизитыОбъектаЗалога
			|		ПО (СостоянияОбъектовЗалога.ОбъектЗалога = РеквизитыОбъектаЗалога.ОбъектЗалога)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЛБ_ОбъектыЗалога.Обороты(, &НаДату, Регистратор, ) КАК ЛБ_ОбъектыЗалогаОстатки
			|		ПО (СостоянияОбъектовЗалога.ОбъектЗалога = ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Остатки(&НаДату, ) КАК РасчетыСКлиентамиПоОбъектамЗалога
			|		ПО (СостоянияОбъектовЗалога.ОбъектЗалога = РасчетыСКлиентамиПоОбъектамЗалога.ОбъектЗалога)
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель КАК Залогодатель,
			|			МАКСИМУМ(ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Период) КАК Период,
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус
			|		ИЗ
			|			РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(
			|					&НаДату,
			|					Используется
			|						И ВЫБОР
			|							КОГДА СрокДействия <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|								ТОГДА ВЫБОР
			|										КОГДА СрокДействия <= &НаДату
			|											ТОГДА ЛОЖЬ
			|										ИНАЧЕ ИСТИНА
			|									КОНЕЦ
			|							ИНАЧЕ ИСТИНА
			|						КОНЕЦ) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель,
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			ЛБ_СтатусыЗалогодателейСрезПоследних.Залогодатель,
			|			ЛБ_СтатусыЗалогодателейСрезПоследних.Период,
			|			ЛБ_СтатусыЗалогодателейСрезПоследних.Статус
			|		ИЗ
			|			РегистрСведений.ЛБ_СтатусыЗалогодателей.СрезПоследних(&НаДату, ) КАК ЛБ_СтатусыЗалогодателейСрезПоследних) КАК СтатусыЗалогодателей
			|		ПО (СостоянияОбъектовЗалога.ЗалоговыйБилет.Залогодатель = СтатусыЗалогодателей.Залогодатель)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(&НаДату, ) КАК ВставкиОЗ
			|		ПО (СостоянияОбъектовЗалога.ОбъектЗалога = ВставкиОЗ.ОбъектЗалога)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(&НаДату, НомерСтрокиТаблицы <> 0) КАК ВставкиМеталла
			|		ПО (СостоянияОбъектовЗалога.ОбъектЗалога = ВставкиМеталла.ОбъектЗалога)
			|ГДЕ
			|	СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ПринятНаСкладСумка)
			|	И СостоянияОбъектовЗалога.Регистратор.ЛомбардКуда = &Ломбард
			|	И СостоянияОбъектовЗалога.Регистратор.СкладПолучатель = &Склад
			|	И ЛБ_ОбъектыЗалогаОстатки.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			|	И 100 = 100
			|	И 200 = 200
			|	И 300 = 300
			|	И 400 = 400
			|	И 600 = 600
			|	И 700 = 700
			|	И 710 = 710
			|	И 720 = 720
			|	И 730 = 730
			|	И 740 = 740
			|	И 780 = 780
			|	И 801 = 801
			|	И 900 = 900
			|	И 444 = 444";
			
		Иначе
			УсловиеСумка = "";
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛБ_ОбъектыЗалогаОстатки.Организация КАК Организация,
		|	ЛБ_ОбъектыЗалогаОстатки.Ломбард КАК Ломбард,
		|	ЛБ_ОбъектыЗалогаОстатки.Склад КАК Склад,
		|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ЗалоговыйБилет,
		|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток КАК СуммаОценкиОстаток
		|ПОМЕСТИТЬ ЛБ_ОбъектыЗалогаОстатки
		|ИЗ
		|	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(
		|			&НаДату,
		|			Ломбард = &Ломбард
		|				И Склад = &Склад
		|				И 500 = 500
		|				И 750 = 750
		|				И 760 = 760
		|				И 770 = 770) КАК ЛБ_ОбъектыЗалогаОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога.Код КАК ОбъектЗалогаКод,
		|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
		|	РеквизитыОбъектаЗалога.Артикул КАК Артикул,
		|	СостоянияОбъектовЗалога.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
		|	РеквизитыОбъектаЗалога.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток КАК Количество,
		|	ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток КАК КоличествоФакт,
		|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток КАК СуммаОценки,
		|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток КАК СуммаОценкиФакт,
		|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделия,
		|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделияФакт,
		|	РеквизитыОбъектаЗалога.Проба КАК Проба,
		|	РеквизитыОбъектаЗалога.Проба КАК ПробаФакт,
		|	РеквизитыОбъектаЗалога.Категория КАК Категория,
		|	РеквизитыОбъектаЗалога.Категория КАК КатегорияФакт,
		|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМасса,
		|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМассаФакт,
		|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталла,
		|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталлаФакт,
		|	РеквизитыОбъектаЗалога.Проба.Владелец КАК Металл,
		|	РеквизитыОбъектаЗалога.Проба.Владелец КАК МеталлФакт,
		|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель КАК Залогодатель,
		|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Дата КАК ДатаОформленияЗайма,
		|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ОтветственныйСотрудник КАК Приемщик,
		|	РеквизитыОбъектаЗалога.Клеймо КАК Клеймо,
		|	РеквизитыОбъектаЗалога.Клеймо КАК КлеймоФакт,
		|	РеквизитыОбъектаЗалога.Именник КАК Именник,
		|	РеквизитыОбъектаЗалога.Именник КАК ИменникФакт,
		|	РеквизитыОбъектаЗалога.ДанныеИменника КАК ДанныеИменника,
		|	РеквизитыОбъектаЗалога.ДанныеИменника КАК ДанныеИменникаФакт,
		|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ОперацияЗайма,
		|	РасчетыСКлиентамиПоОбъектамЗалога.СуммаОстаток КАК ОстатокЗайма,
		|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
		|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлыФакт,
		|	РеквизитыОбъектаЗалога.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
		|	СостоянияОбъектовЗалога.СуммаЗайма КАК СуммаЗайма,
		|	СостоянияОбъектовЗалога.СуммаДолгаЗайма КАК СуммаДолгаЗайма,
		|	РеквизитыОбъектаЗалога.СостояниеИзделия КАК СостояниеИзделия,
		|	РеквизитыОбъектаЗалога.Дефекты КАК Дефекты,
		|	РеквизитыОбъектаЗалога.Вес30 КАК Вес30,
		|	РеквизитыОбъектаЗалога.СуммаОценкиМакс КАК СуммаОценкиМакс
		|ИЗ
		|	ЛБ_ОбъектыЗалогаОстатки КАК ЛБ_ОбъектыЗалогаОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
		|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
		|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаДолгаЗайма КАК СуммаДолгаЗайма
		|		ИЗ
		|			РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(
		|					&НаДату,
		|					ВЫБОР
		|						КОГДА Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
		|							ТОГДА Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		|									И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		|									И НЕ Регистратор В
		|											(ВЫБРАТЬ
		|												ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
		|											ИЗ
		|												РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&НаДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
		|											ГДЕ
		|												ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))
		|						КОГДА НЕ Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
		|							ТОГДА ИСТИНА
		|					КОНЕЦ) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних) КАК СостоянияОбъектовЗалога
		|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = СостоянияОбъектовЗалога.ОбъектЗалога
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Клеймо КАК Клеймо,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК Вес,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесЧистый,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Именник КАК Именник,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ДанныеИменника КАК ДанныеИменника,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СостояниеИзделия КАК СостояниеИзделия,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Дефекты КАК Дефекты,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОписаниеИзделия КАК ОписаниеИзделия,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес30 КАК Вес30,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМакс КАК СуммаОценкиМакс,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет
		|		ИЗ
		|			РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
		|					&НаДату,
		|					Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		|						И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		|						И НЕ Регистратор В
		|								(ВЫБРАТЬ
		|									ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
		|								ИЗ
		|									РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&НаДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
		|								ГДЕ
		|									ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних) КАК РеквизитыОбъектаЗалога
		|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РеквизитыОбъектаЗалога.ОбъектЗалога
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
		|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки.СуммаОстаток КАК СуммаОстаток
		|		ИЗ
		|			РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Остатки(&НаДату, ) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки) КАК РасчетыСКлиентамиПоОбъектамЗалога
		|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РасчетыСКлиентамиПоОбъектамЗалога.ОбъектЗалога
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель КАК Залогодатель,
		|			МАКСИМУМ(ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Период) КАК Период,
		|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус
		|		ИЗ
		|			РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(
		|					&НаДату,
		|					Используется
		|						И ВЫБОР
		|							КОГДА СрокДействия <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|								ТОГДА ВЫБОР
		|										КОГДА СрокДействия <= &НаДату
		|											ТОГДА ЛОЖЬ
		|										ИНАЧЕ ИСТИНА
		|									КОНЕЦ
		|							ИНАЧЕ ИСТИНА
		|						КОНЕЦ) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель,
		|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ЛБ_СтатусыЗалогодателейСрезПоследних.Залогодатель,
		|			ЛБ_СтатусыЗалогодателейСрезПоследних.Период,
		|			ЛБ_СтатусыЗалогодателейСрезПоследних.Статус
		|		ИЗ
		|			РегистрСведений.ЛБ_СтатусыЗалогодателей.СрезПоследних(&НаДату, ) КАК ЛБ_СтатусыЗалогодателейСрезПоследних) КАК СтатусыЗалогодателей
		|		ПО ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель = СтатусыЗалогодателей.Залогодатель
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Период КАК Период,
		|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки КАК ВидВставки
		|		ИЗ
		|			РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(&НаДату, ) КАК ЛБ_ВставкиОбъектаЗалогаСрезПоследних) КАК ВставкиОЗ
		|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиОЗ.ОбъектЗалога
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога
		|		ИЗ
		|			РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(&НаДату, НомерСтрокиТаблицы <> 0) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних) КАК ВставкиМеталла
		|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиМеталла.ОбъектЗалога
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
		|			ВЫБОР
		|				КОГДА ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение)
		|						ИЛИ ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ГотовКОтправкеОХ)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ КАК ЕстьСтатусОХ
		|		ИЗ
		|			ЛБ_ОбъектыЗалогаОстатки КАК ЛБ_ОбъектыЗалогаОстатки
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(
		|						&НаДату,
		|						ВЫБОР
		|								КОГДА Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
		|									ТОГДА Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		|											И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		|											И НЕ Регистратор В
		|													(ВЫБРАТЬ
		|														ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
		|													ИЗ
		|														РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&НаДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
		|													ГДЕ
		|														ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))
		|								КОГДА НЕ Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
		|									ТОГДА ИСТИНА
		|							КОНЕЦ
		|							И (СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение)
		|								ИЛИ СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ГотовКОтправкеОХ))) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних
		|				ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога) КАК СтатусОХ
		|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = СтатусОХ.ОбъектЗалога"
		+ Символы.ПС + Условие
		+ "ГДЕ
		|	ИСТИНА
		|	И ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет = РеквизитыОбъектаЗалога.ЗалоговыйБилет
		|	И 100 = 100
		|	И 200 = 200
		|	И 300 = 300
		|	И 400 = 400
		|	И 600 = 600
		|	И 700 = 700
		|	И 710 = 710
		|	И 720 = 720
		|	И 730 = 730
		|	И 740 = 740
		|	И 780 = 780
		|	И 800 = 800
		|	И 900 = 900
		|	И 444 = 444
		|	И 999 = 999"
		+ Символы.ПС + УсловиеСумка + Символы.ПС
		+ "УПОРЯДОЧИТЬ ПО
		|	Артикул";

		Запрос.УстановитьПараметр("НаДату", НачалоДня(Объект.Дата));
		Запрос.УстановитьПараметр("Ломбард", Объект.Ломбард); 
		//+МАН 17.12.25
		Запрос.УстановитьПараметр("Склад", Объект.Склад);
		//-МАН
		
		//+МАН 21.11.24 Добавлены новые условия
		Если Остатки Тогда
			
			//УсловиеСклад = "";
			
			СтатусыВхождения = Новый Массив;
			
			Если СкладВитринаНеЦО Тогда
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ПринятНаСклад);
			ИначеЕсли ЦО Тогда
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ПринятНаСклад);
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.Возвращен);
			Иначе
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.Принят);
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.Продлен);
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.Возвращен);
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ВключенВНакладную);
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ОбъявленТорг);
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ПринятНаСклад);
				
				//+МАН 20.02.26 Убрал из запроса т.к. в запросе выходит несколько статусов из-за того что в измерениях участвует накладная.
				//УсловиеСклад = "И (ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус ЕСТЬ NULL
				//|			ИЛИ ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.Факт)
				//|			ИЛИ ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.СумкаОткрыта)
				//|			ИЛИ ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.ИсключенИзНакладной)
				//|			ИЛИ ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.Отгружено))";
				//-МАН

			КонецЕсли;
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "999 = 999", "ВЫБОР
			|			КОГДА СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Наследство)
			|					И РасчетыСКлиентамиПоОбъектамЗалога.СуммаОстаток > 0
			|				ТОГДА ИСТИНА
			|			КОГДА СостоянияОбъектовЗалога.СтатусОбъектаЗалога В (&СтатусыВхождения)
			//|					И (СтатусыОЗВНакладной.Статус В (&СтатусВНакладнойВхождение)
			//|						ИЛИ СтатусыОЗВНакладной.Статус ЕСТЬ NULL)
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ЛОЖЬ
			|		КОНЕЦ"
			+ ?(СкладВитринаНеЦО ИЛИ ЦО ИЛИ СумкаЗакрыта, "", Символы.ПС + "	И ВЫБОР
			|				КОГДА СтатусОХ.ЕстьСтатусОХ
			|						И РасчетыСКлиентамиПоОбъектамЗалога.СуммаОстаток > 0
			|					ТОГДА ИСТИНА
			|				КОГДА СтатусОХ.ЕстьСтатусОХ
			|						И (РасчетыСКлиентамиПоОбъектамЗалога.СуммаОстаток <= 0
			|							ИЛИ РасчетыСКлиентамиПоОбъектамЗалога.СуммаОстаток ЕСТЬ NULL)
			|					ТОГДА ЛОЖЬ
			|				ИНАЧЕ ИСТИНА
			|		КОНЕЦ"));

			//+ ?(СкладВитринаНеЦО ИЛИ ЦО, "", Символы.ПС + "И РасчетыСКлиентамиПоОбъектамЗалога.СуммаОстаток > 0"));
			//|		И РасчетыСКлиентамиПоОбъектамЗалога.СуммаОстаток > 0");
			//+МАН 20.02.26 Убрал из запроса т.к. в запросе выходит несколько статусов из-за того что в измерениях участвует накладная.
			//|		И РасчетыСКлиентамиПоОбъектамЗалога.СуммаОстаток > 0" + Символы.ПС + УсловиеСклад);
			//-МАН
			
			//|	И (ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус ЕСТЬ NULL
			//|			ИЛИ ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.Факт)
			//|			ИЛИ ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.СумкаОткрыта)
			//|			ИЛИ ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.ИсключенИзНакладной)
			//|			ИЛИ ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.Отгружено))");
			
			Запрос.УстановитьПараметр("СтатусыВхождения", СтатусыВхождения);
			
		ИначеЕсли НаОХ Тогда
			
			Если ЦО Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "999 = 999", "ВЫБОР
				|			КОГДА СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ГотовКОтправкеОХ)
				//|					ИЛИ СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ПринятНаСклад))
				|					И РасчетыСКлиентамиПоОбъектамЗалога.СуммаОстаток ЕСТЬ NULL
				|				ТОГДА ИСТИНА
				|			ИНАЧЕ ЛОЖЬ
				|		КОНЕЦ");
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "999 = 999", "ВЫБОР
				|			КОГДА (СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Наследство)
				|					ИЛИ СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ПринятНаСклад))
				|					И РасчетыСКлиентамиПоОбъектамЗалога.СуммаОстаток ЕСТЬ NULL
				|				ТОГДА ИСТИНА
				|			КОГДА СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение)
				|				ТОГДА ИСТИНА
				|			ИНАЧЕ ЛОЖЬ
				|		КОНЕЦ");
			КонецЕсли;
			
		ИначеЕсли Изъятые Тогда
			
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога.Код КАК ОбъектЗалогаКод,
			|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
			|	РеквизитыОбъектаЗалога.Артикул КАК Артикул,
			|	СостоянияОбъектовЗалога.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
			|	РеквизитыОбъектаЗалога.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ЛБ_ОбъектыЗалогаОстатки.КоличествоРасход КАК Количество,
			|	ЛБ_ОбъектыЗалогаОстатки.КоличествоРасход КАК КоличествоФакт,
			|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиРасход КАК СуммаОценки,
			|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиРасход КАК СуммаОценкиФакт,
			|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделия,
			|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделияФакт,
			|	РеквизитыОбъектаЗалога.Проба КАК Проба,
			|	РеквизитыОбъектаЗалога.Проба КАК ПробаФакт,
			|	РеквизитыОбъектаЗалога.Категория КАК Категория,
			|	РеквизитыОбъектаЗалога.Категория КАК КатегорияФакт,
			|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМасса,
			|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМассаФакт,
			|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталла,
			|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталлаФакт,
			|	РеквизитыОбъектаЗалога.Проба.Владелец КАК Металл,
			|	РеквизитыОбъектаЗалога.Проба.Владелец КАК МеталлФакт,
			|	РеквизитыОбъектаЗалога.Клеймо КАК Клеймо,
			|	РеквизитыОбъектаЗалога.Клеймо КАК КлеймоФакт,
			|	РеквизитыОбъектаЗалога.Именник КАК Именник,
			|	РеквизитыОбъектаЗалога.Именник КАК ИменникФакт,
			|	РеквизитыОбъектаЗалога.ДанныеИменника КАК ДанныеИменника,
			|	РеквизитыОбъектаЗалога.ДанныеИменника КАК ДанныеИменникаФакт,
			|	РасчетыСКлиентамиПоОбъектамЗалога.СуммаОстаток КАК ОстатокЗайма,
			|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
			|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлыФакт,
			|	РеквизитыОбъектаЗалога.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
			|	СостоянияОбъектовЗалога.СуммаЗайма КАК СуммаЗайма,
			|	СостоянияОбъектовЗалога.СуммаДолгаЗайма КАК СуммаДолгаЗайма,
			|	РеквизитыОбъектаЗалога.СостояниеИзделия КАК СостояниеИзделия,
			|	РеквизитыОбъектаЗалога.Дефекты КАК Дефекты,
			|	РеквизитыОбъектаЗалога.Вес30 КАК Вес30,
			|	РеквизитыОбъектаЗалога.СуммаОценкиМакс КАК СуммаОценкиМакс,
			|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель КАК Залогодатель,
			|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Дата КАК ДатаОформленияЗайма,
			|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ОтветственныйСотрудник КАК Приемщик,
			|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ОперацияЗайма
			|ИЗ
			|	РегистрНакопления.ЛБ_ОбъектыЗалога.Обороты(
			|			,
			|			&НаДату,
			|			Регистратор,
			|			Ломбард = &Ломбард
			|				И Склад = &Склад
			|				И 500 = 500
			|				И 750 = 750
			|				И 760 = 760
			|				И 770 = 770) КАК ЛБ_ОбъектыЗалогаОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
			|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
			|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаДолгаЗайма КАК СуммаДолгаЗайма,
			|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет
			|		ИЗ
			|			РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(
			|					&НаДату,
			|					(Регистратор.Ломбард = &Ломбард
			|						ИЛИ Регистратор.ЛомбардКуда = &Ломбард)
			|						И ВЫБОР
			|							КОГДА Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			|								ТОГДА Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|											И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|											И НЕ Регистратор В
			|													(ВЫБРАТЬ
			|														ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			|													ИЗ
			|														РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&НаДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			|													ГДЕ
			|														ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))
			|							КОГДА НЕ Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			|								ТОГДА ИСТИНА
			|						КОНЕЦ) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних
			|		ГДЕ
			|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Изъят)) КАК СостоянияОбъектовЗалога
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = СостоянияОбъектовЗалога.ОбъектЗалога
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Клеймо КАК Клеймо,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК Вес,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесЧистый,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Именник КАК Именник,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ДанныеИменника КАК ДанныеИменника,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СостояниеИзделия КАК СостояниеИзделия,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Дефекты КАК Дефекты,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОписаниеИзделия КАК ОписаниеИзделия,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес30 КАК Вес30,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМакс КАК СуммаОценкиМакс,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет
			|		ИЗ
			|			РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
			|					&НаДату,
			|					Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|						И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|						И НЕ Регистратор В
			|								(ВЫБРАТЬ
			|									ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			|								ИЗ
			|									РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&НаДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			|								ГДЕ
			|									ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних) КАК РеквизитыОбъектаЗалога
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РеквизитыОбъектаЗалога.ОбъектЗалога
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
			|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки.СуммаОстаток КАК СуммаОстаток
			|		ИЗ
			|			РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Остатки(&НаДату, ) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки) КАК РасчетыСКлиентамиПоОбъектамЗалога
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РасчетыСКлиентамиПоОбъектамЗалога.ОбъектЗалога
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель КАК Залогодатель,
			|			МАКСИМУМ(ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Период) КАК Период,
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус
			|		ИЗ
			|			РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(
			|					&НаДату,
			|					Используется
			|						И ВЫБОР
			|							КОГДА СрокДействия <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|								ТОГДА ВЫБОР
			|										КОГДА СрокДействия <= &НаДату
			|											ТОГДА ЛОЖЬ
			|										ИНАЧЕ ИСТИНА
			|									КОНЕЦ
			|							ИНАЧЕ ИСТИНА
			|						КОНЕЦ) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель,
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			ЛБ_СтатусыЗалогодателейСрезПоследних.Залогодатель,
			|			ЛБ_СтатусыЗалогодателейСрезПоследних.Период,
			|			ЛБ_СтатусыЗалогодателейСрезПоследних.Статус
			|		ИЗ
			|			РегистрСведений.ЛБ_СтатусыЗалогодателей.СрезПоследних(&НаДату, ) КАК ЛБ_СтатусыЗалогодателейСрезПоследних) КАК СтатусыЗалогодателей
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель = СтатусыЗалогодателей.Залогодатель
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Период КАК Период,
			|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки КАК ВидВставки
			|		ИЗ
			|			РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(&НаДату, ) КАК ЛБ_ВставкиОбъектаЗалогаСрезПоследних) КАК ВставкиОЗ
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиОЗ.ОбъектЗалога
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога
			|		ИЗ
			|			РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(&НаДату, НомерСтрокиТаблицы <> 0) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних) КАК ВставкиМеталла
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиМеталла.ОбъектЗалога
			|ГДЕ
			|	ИСТИНА
			|	И ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет = РеквизитыОбъектаЗалога.ЗалоговыйБилет
			|	И ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет = СостоянияОбъектовЗалога.ЗалоговыйБилет
			|	И ЛБ_ОбъектыЗалогаОстатки.КоличествоРасход > 0
			|	И 100 = 100
			|	И 200 = 200
			|	И 300 = 300
			|	И 400 = 400
			|	И 600 = 600
			|	И 700 = 700
			|	И 710 = 710
			|	И 720 = 720
			|	И 730 = 730
			|	И 740 = 740
			|	И 780 = 780
			|	И 800 = 800
			|	И 900 = 900
			|	И 444 = 444
			|	И 999 = 999
			|
			|УПОРЯДОЧИТЬ ПО
			|	Артикул";
			
		ИначеЕсли СумкаЗакрыта Тогда
			
			СтатусыВхождения = Новый Массив;
			
			Если ЦО Тогда
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ПринятНаСкладСумка);
			Иначе
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ВключенВНакладную);
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ОбъявленТорг);
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ПринятНаСкладСумка);
			КонецЕсли;
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "999 = 999", "ВЫБОР
			|			КОГДА СостоянияОбъектовЗалога.СтатусОбъектаЗалога В (&СтатусыВхождения)
			//|					И СтатусыОЗВНакладной.Статус В (&СтатусВНакладнойВхождение)
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ЛОЖЬ
			|		КОНЕЦ");
			//+МАН 20.02.26 Убрал из запроса т.к. в запросе выходит несколько статусов из-за того что в измерениях участвует накладная.
			//+ ?(ЦО, "", Символы.ПС
			//+ "	И ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.СумкаЗакрыта)"));
			//-МАН
			
			Запрос.УстановитьПараметр("СтатусыВхождения", СтатусыВхождения);
			
			//+МАН 24.03.25
		ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
			//+МАН 27.01.26 Пока оставил. Ниже новый.
			//Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			//|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога.Код КАК ОбъектЗалогаКод,
			//|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
			//|	РеквизитыОбъектаЗалога.Артикул КАК Артикул,
			//|	СостоянияОбъектовЗалога.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
			//|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ВидОперации КАК ЗалоговыйБилетВидОперации,
			//|	ЛБ_ОбъектыЗалогаОстатки.Склад КАК Склад,
			//|	РеквизитыОбъектаЗалога.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			//|	ЛБ_ОбъектыЗалогаОстатки.КоличествоКонечныйОстаток КАК Количество,
			//|	ЛБ_ОбъектыЗалогаОстатки.КоличествоКонечныйОстаток КАК КоличествоФакт,
			//|	СостоянияОбъектовЗалога.СуммаЗайма КАК СуммаЗайма,
			//|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиКонечныйОстаток КАК СуммаОценки,
			//|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиКонечныйОстаток КАК СуммаОценкиФакт,
			//|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделия,
			//|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделияФакт,
			//|	РеквизитыОбъектаЗалога.Проба КАК Проба,
			//|	РеквизитыОбъектаЗалога.Проба КАК ПробаФакт,
			//|	РеквизитыОбъектаЗалога.Категория КАК Категория,
			//|	РеквизитыОбъектаЗалога.Категория КАК КатегорияФакт,
			//|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМасса,
			//|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМассаФакт,
			//|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталла,
			//|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталлаФакт,
			//|	РеквизитыОбъектаЗалога.Проба.Владелец КАК Металл,
			//|	РеквизитыОбъектаЗалога.Проба.Владелец КАК МеталлФакт,
			//|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель КАК Залогодатель,
			//|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Дата КАК ДатаОформленияЗайма,
			//|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ОтветственныйСотрудник КАК Приемщик,
			//|	РеквизитыОбъектаЗалога.Клеймо КАК Клеймо,
			//|	РеквизитыОбъектаЗалога.Клеймо КАК КлеймоФакт,
			//|	РеквизитыОбъектаЗалога.Именник КАК Именник,
			//|	РеквизитыОбъектаЗалога.Именник КАК ИменникФакт,
			//|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ОперацияЗайма,
			//|	РасчетыСКлиентамиПоОбъектамЗалога.СуммаКонечныйОстаток КАК ОстатокЗайма,
			//|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
			//|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлыФакт
			//|ИЗ
			//|	РегистрНакопления.ЛБ_ОбъектыЗалога.ОстаткиИОбороты(
			//|			&СДаты,
			//|			&ПоДату,
			//|			Авто,
			//|			,
			//|			Ломбард = &Ломбард
			//|				И Склад = &Склад
			//|				И (ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог)
			//|					ИЛИ ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление)
			//|					ИЛИ ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога))
			//|				И 500 = 500
			//|				И 750 = 750
			//|				И 760 = 760
			//|				И 770 = 770) КАК ЛБ_ОбъектыЗалогаОстатки
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			//|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			//|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
			//|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
			//|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога.Код КАК ОбъектЗалогаКод,
			//|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.Регистратор КАК Регистратор
			//|		ИЗ
			//|			РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(
			//|					&ПоДату,
			//|					(Регистратор.Ломбард = &Ломбард
			//|						ИЛИ Регистратор.ЛомбардКуда = &Ломбард)
			//|						И ОбъектЗалога В
			//|							(ВЫБРАТЬ
			//|								ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога
			//|							ИЗ
			//|								РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПервых(&СДаты, (Регистратор.Ломбард = &Ломбард
			//|									ИЛИ Регистратор.ЛомбардКуда = &Ломбард)
			//|									И ВЫБОР
			//|										КОГДА Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|											ТОГДА Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|													И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|													И НЕ Регистратор В
			//|															(ВЫБРАТЬ
			//|																ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			//|															ИЗ
			//|																РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			//|															ГДЕ
			//|																ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))
			//|										КОГДА НЕ Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|											ТОГДА ИСТИНА
			//|									КОНЕЦ) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних
			//|							СГРУППИРОВАТЬ ПО
			//|								ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога)
			//|						И ВЫБОР
			//|							КОГДА Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|								ТОГДА Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|										И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|										И НЕ Регистратор В
			//|												(ВЫБРАТЬ
			//|													ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			//|												ИЗ
			//|													РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			//|												ГДЕ
			//|													ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))
			//|							КОГДА НЕ Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|								ТОГДА ИСТИНА
			//|						КОНЕЦ) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних) КАК СостоянияОбъектовЗалога
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = СостоянияОбъектовЗалога.ОбъектЗалога
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Клеймо КАК Клеймо,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК Вес,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесЧистый,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Именник КАК Именник,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Регистратор КАК Регистратор,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет
			//|		ИЗ
			//|			РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
			//|					&ПоДату,
			//|					Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|						И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|						И НЕ Регистратор В
			//|								(ВЫБРАТЬ
			//|									ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			//|								ИЗ
			//|									РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			//|								ГДЕ
			//|									ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних) КАК РеквизитыОбъектаЗалога
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РеквизитыОбъектаЗалога.ОбъектЗалога
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			//|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты.ОбъектЗалога КАК ОбъектЗалога,
			//|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
			//|		ИЗ
			//|			РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.ОстаткиИОбороты(&СДаты, &ПоДату, Период, , ) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты) КАК РасчетыСКлиентамиПоОбъектамЗалога
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РасчетыСКлиентамиПоОбъектамЗалога.ОбъектЗалога
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			//|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель КАК Залогодатель,
			//|			МАКСИМУМ(ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Период) КАК Период,
			//|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус
			//|		ИЗ
			//|			РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(
			//|					&ПоДату,
			//|					Используется
			//|						И ВЫБОР
			//|							КОГДА СрокДействия <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			//|								ТОГДА ВЫБОР
			//|										КОГДА СрокДействия <= &ПоДату
			//|											ТОГДА ЛОЖЬ
			//|										ИНАЧЕ ИСТИНА
			//|									КОНЕЦ
			//|							ИНАЧЕ ИСТИНА
			//|						КОНЕЦ) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних
			//|		
			//|		СГРУППИРОВАТЬ ПО
			//|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель,
			//|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус
			//|		
			//|		ОБЪЕДИНИТЬ ВСЕ
			//|		
			//|		ВЫБРАТЬ
			//|			ЛБ_СтатусыЗалогодателейСрезПоследних.Залогодатель,
			//|			ЛБ_СтатусыЗалогодателейСрезПоследних.Период,
			//|			ЛБ_СтатусыЗалогодателейСрезПоследних.Статус
			//|		ИЗ
			//|			РегистрСведений.ЛБ_СтатусыЗалогодателей.СрезПоследних(, ) КАК ЛБ_СтатусыЗалогодателейСрезПоследних) КАК СтатусыЗалогодателей
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель = СтатусыЗалогодателей.Залогодатель
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			//|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Период КАК Период,
			//|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			//|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки КАК ВидВставки
			//|		ИЗ
			//|			РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(&ПоДату, ) КАК ЛБ_ВставкиОбъектаЗалогаСрезПоследних) КАК ВставкиОЗ
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиОЗ.ОбъектЗалога
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			//|			ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога
			//|		ИЗ
			//|			РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(&ПоДату, НомерСтрокиТаблицы <> 0) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних) КАК ВставкиМеталла
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиМеталла.ОбъектЗалога
			//|ГДЕ
			//|	ИСТИНА
			//|	И НЕ СостоянияОбъектовЗалога.СтатусОбъектаЗалога ЕСТЬ NULL
			//|	И (СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Принят)
			//|			ИЛИ СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Возвращен)
			//|			ИЛИ СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ПринятНаСклад)
			//|			ИЛИ СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение))
			//|	И ВЫБОР
			//|			КОГДА ЛБ_ОбъектыЗалогаОстатки.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|				ТОГДА ЛБ_ОбъектыЗалогаОстатки.Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|						И ЛБ_ОбъектыЗалогаОстатки.Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|						И НЕ ЛБ_ОбъектыЗалогаОстатки.Регистратор В
			//|								(ВЫБРАТЬ
			//|									ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			//|								ИЗ
			//|									РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			//|								ГДЕ
			//|									ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОбъектыЗалогаОстатки.Регистратор))
			//|			КОГДА НЕ ЛБ_ОбъектыЗалогаОстатки.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|				ТОГДА ИСТИНА
			//|		КОНЕЦ
			//|	И ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиКонечныйОстаток <> 0
			//|	И ВЫБОР
			//|			КОГДА СостоянияОбъектовЗалога.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|					И СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение)
			//|				ТОГДА ЛОЖЬ
			//|			ИНАЧЕ ИСТИНА
			//|		КОНЕЦ
			//|	И 100 = 100
			//|	И 200 = 200
			//|	И 300 = 300
			//|	И 400 = 400
			//|	И 600 = 600
			//|	И 700 = 700
			//|	И 710 = 710
			//|	И 720 = 720
			//|	И 730 = 730
			//|	И 740 = 740
			//|	И 780 = 780
			//|	И 800 = 800
			//|	И 900 = 900
			//|	И 444 = 444
			//|	И 999 = 999
			//|
			//|УПОРЯДОЧИТЬ ПО
			//|	Артикул";
			
			УсловиеСкладНовые = "";
			
			Если НЕ СкладВитринаНеЦО Тогда
				УсловиеСкладНовые = "	И (СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Принят)
				|			ИЛИ СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Возвращен)
				|			ИЛИ СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ПринятНаСклад)
				|			ИЛИ СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение))";
			Иначе
				УсловиеСкладНовые = "	И СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ПринятНаСклад)";
			КонецЕсли;
			
			//+МАН 13.02.26 Пока убрал. Новый ниже
			//Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			//|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога.Код КАК ОбъектЗалогаКод,
			//|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
			//|	РеквизитыОбъектаЗалога.Артикул КАК Артикул,
			//|	СостоянияОбъектовЗалога.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
			//|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ВидОперации КАК ЗалоговыйБилетВидОперации,
			//|	ЛБ_ОбъектыЗалогаОстатки.Склад КАК Склад,
			//|	РеквизитыОбъектаЗалога.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			//|	ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток КАК Количество,
			//|	ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток КАК КоличествоФакт,
			//|	СостоянияОбъектовЗалога.СуммаЗайма КАК СуммаЗайма,
			//|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток КАК СуммаОценки,
			//|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток КАК СуммаОценкиФакт,
			//|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделия,
			//|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделияФакт,
			//|	РеквизитыОбъектаЗалога.Проба КАК Проба,
			//|	РеквизитыОбъектаЗалога.Проба КАК ПробаФакт,
			//|	РеквизитыОбъектаЗалога.Категория КАК Категория,
			//|	РеквизитыОбъектаЗалога.Категория КАК КатегорияФакт,
			//|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМасса,
			//|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМассаФакт,
			//|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталла,
			//|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталлаФакт,
			//|	РеквизитыОбъектаЗалога.Проба.Владелец КАК Металл,
			//|	РеквизитыОбъектаЗалога.Проба.Владелец КАК МеталлФакт,
			//|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель КАК Залогодатель,
			//|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Дата КАК ДатаОформленияЗайма,
			//|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ОтветственныйСотрудник КАК Приемщик,
			//|	РеквизитыОбъектаЗалога.Клеймо КАК Клеймо,
			//|	РеквизитыОбъектаЗалога.Клеймо КАК КлеймоФакт,
			//|	РеквизитыОбъектаЗалога.Именник КАК Именник,
			//|	РеквизитыОбъектаЗалога.Именник КАК ИменникФакт,
			//|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ОперацияЗайма,
			//|	РасчетыСКлиентамиПоОбъектамЗалога.СуммаКонечныйОстаток КАК ОстатокЗайма,
			//|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
			//|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлыФакт
			//|ИЗ
			//|	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(
			//|			&ПоДату,
			//|			Ломбард = &Ломбард
			//|				И Склад = &Склад
			//|				И (ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог)
			//|					ИЛИ ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление)
			//|					ИЛИ ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога))
			//|				И 500 = 500
			//|				И 750 = 750
			//|				И 760 = 760
			//|				И 770 = 770) КАК ЛБ_ОбъектыЗалогаОстатки
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			//|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			//|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
			//|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
			//|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога.Код КАК ОбъектЗалогаКод,
			//|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.Регистратор КАК Регистратор
			//|		ИЗ
			//|			РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(
			//|					&ПоДату,
			//|					(Регистратор.Ломбард = &Ломбард
			//|						ИЛИ Регистратор.ЛомбардКуда = &Ломбард)
			//|						И ОбъектЗалога В
			//|							(ВЫБРАТЬ
			//|								ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога
			//|							ИЗ
			//|								РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПервых(&СДаты, (Регистратор.Ломбард = &Ломбард
			//|									ИЛИ Регистратор.ЛомбардКуда = &Ломбард)
			//|									И ВЫБОР
			//|										КОГДА Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|											ТОГДА Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|													И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|													И НЕ Регистратор В
			//|															(ВЫБРАТЬ
			//|																ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			//|															ИЗ
			//|																РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			//|															ГДЕ
			//|																ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))
			//|										КОГДА НЕ Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|											ТОГДА ИСТИНА
			//|									КОНЕЦ) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних
			//|							СГРУППИРОВАТЬ ПО
			//|								ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога)
			//|						И ВЫБОР
			//|							КОГДА Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|								ТОГДА Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|										И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|										И НЕ Регистратор В
			//|												(ВЫБРАТЬ
			//|													ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			//|												ИЗ
			//|													РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			//|												ГДЕ
			//|													ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))
			//|							КОГДА НЕ Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|								ТОГДА ИСТИНА
			//|						КОНЕЦ) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних) КАК СостоянияОбъектовЗалога
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = СостоянияОбъектовЗалога.ОбъектЗалога
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Клеймо КАК Клеймо,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК Вес,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесЧистый,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Именник КАК Именник,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Регистратор КАК Регистратор,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет
			//|		ИЗ
			//|			РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
			//|					&ПоДату,
			//|					Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|						И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|						И НЕ Регистратор В
			//|								(ВЫБРАТЬ
			//|									ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			//|								ИЗ
			//|									РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			//|								ГДЕ
			//|									ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних) КАК РеквизитыОбъектаЗалога
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РеквизитыОбъектаЗалога.ОбъектЗалога
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			//|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты.ОбъектЗалога КАК ОбъектЗалога,
			//|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
			//|		ИЗ
			//|			РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.ОстаткиИОбороты(&СДаты, &ПоДату, Период, , ) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты) КАК РасчетыСКлиентамиПоОбъектамЗалога
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РасчетыСКлиентамиПоОбъектамЗалога.ОбъектЗалога
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			//|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель КАК Залогодатель,
			//|			МАКСИМУМ(ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Период) КАК Период,
			//|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус
			//|		ИЗ
			//|			РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(
			//|					&ПоДату,
			//|					Используется
			//|						И ВЫБОР
			//|							КОГДА СрокДействия <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			//|								ТОГДА ВЫБОР
			//|										КОГДА СрокДействия <= &ПоДату
			//|											ТОГДА ЛОЖЬ
			//|										ИНАЧЕ ИСТИНА
			//|									КОНЕЦ
			//|							ИНАЧЕ ИСТИНА
			//|						КОНЕЦ) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних
			//|		
			//|		СГРУППИРОВАТЬ ПО
			//|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель,
			//|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус
			//|		
			//|		ОБЪЕДИНИТЬ ВСЕ
			//|		
			//|		ВЫБРАТЬ
			//|			ЛБ_СтатусыЗалогодателейСрезПоследних.Залогодатель,
			//|			ЛБ_СтатусыЗалогодателейСрезПоследних.Период,
			//|			ЛБ_СтатусыЗалогодателейСрезПоследних.Статус
			//|		ИЗ
			//|			РегистрСведений.ЛБ_СтатусыЗалогодателей.СрезПоследних(, ) КАК ЛБ_СтатусыЗалогодателейСрезПоследних) КАК СтатусыЗалогодателей
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель = СтатусыЗалогодателей.Залогодатель
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			//|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Период КАК Период,
			//|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			//|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки КАК ВидВставки
			//|		ИЗ
			//|			РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(&ПоДату, ) КАК ЛБ_ВставкиОбъектаЗалогаСрезПоследних) КАК ВставкиОЗ
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиОЗ.ОбъектЗалога
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			//|			ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога
			//|		ИЗ
			//|			РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(&ПоДату, НомерСтрокиТаблицы <> 0) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних) КАК ВставкиМеталла
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиМеталла.ОбъектЗалога
			//|ГДЕ
			//|	ИСТИНА
			//|	И НЕ СостоянияОбъектовЗалога.СтатусОбъектаЗалога ЕСТЬ NULL"
			//+ Символы.ПС + УсловиеСкладНовые
			//+ "	И ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток <> 0
			//|	И ВЫБОР
			//|			КОГДА СостоянияОбъектовЗалога.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|					И СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение)
			//|				ТОГДА ЛОЖЬ
			//|			ИНАЧЕ ИСТИНА
			//|		КОНЕЦ
			//|	И 100 = 100
			//|	И 200 = 200
			//|	И 300 = 300
			//|	И 400 = 400
			//|	И 600 = 600
			//|	И 700 = 700
			//|	И 710 = 710
			//|	И 720 = 720
			//|	И 730 = 730
			//|	И 740 = 740
			//|	И 780 = 780
			//|	И 800 = 800
			//|	И 900 = 900
			//|	И 444 = 444
			//|	И 999 = 999
			//|
			//|УПОРЯДОЧИТЬ ПО
			//|	Артикул";

			//Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			//|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога.Код КАК ОбъектЗалогаКод,
			//|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
			//|	РеквизитыОбъектаЗалога.Артикул КАК Артикул,
			//|	СостоянияОбъектовЗалога.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
			//|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ВидОперации КАК ЗалоговыйБилетВидОперации,
			//|	ЛБ_ОбъектыЗалогаОстатки.Склад КАК Склад,
			//|	РеквизитыОбъектаЗалога.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			//|	ЛБ_ОбъектыЗалогаОстатки.КоличествоКонечныйОстаток КАК Количество,
			//|	ЛБ_ОбъектыЗалогаОстатки.КоличествоКонечныйОстаток КАК КоличествоФакт,
			//|	СостоянияОбъектовЗалога.СуммаЗайма КАК СуммаЗайма,
			//|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиКонечныйОстаток КАК СуммаОценки,
			//|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиКонечныйОстаток КАК СуммаОценкиФакт,
			//|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделия,
			//|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделияФакт,
			//|	РеквизитыОбъектаЗалога.Проба КАК Проба,
			//|	РеквизитыОбъектаЗалога.Проба КАК ПробаФакт,
			//|	РеквизитыОбъектаЗалога.Категория КАК Категория,
			//|	РеквизитыОбъектаЗалога.Категория КАК КатегорияФакт,
			//|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМасса,
			//|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМассаФакт,
			//|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталла,
			//|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталлаФакт,
			//|	РеквизитыОбъектаЗалога.Проба.Владелец КАК Металл,
			//|	РеквизитыОбъектаЗалога.Проба.Владелец КАК МеталлФакт,
			//|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель КАК Залогодатель,
			//|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Дата КАК ДатаОформленияЗайма,
			//|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ОтветственныйСотрудник КАК Приемщик,
			//|	РеквизитыОбъектаЗалога.Клеймо КАК Клеймо,
			//|	РеквизитыОбъектаЗалога.Клеймо КАК КлеймоФакт,
			//|	РеквизитыОбъектаЗалога.Именник КАК Именник,
			//|	РеквизитыОбъектаЗалога.Именник КАК ИменникФакт,
			//|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ОперацияЗайма,
			//|	РасчетыСКлиентамиПоОбъектамЗалога.СуммаКонечныйОстаток КАК ОстатокЗайма,
			//|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
			//|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлыФакт
			//|ИЗ
			//|	РегистрНакопления.ЛБ_ОбъектыЗалога.ОстаткиИОбороты(
			//|			&СДаты,
			//|			&ПоДату,
			//|			Авто,
			//|			,
			//|			Ломбард = &Ломбард
			//|				И Склад = &Склад
			//|				И (ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог)
			//|					ИЛИ ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление)
			//|					ИЛИ ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога))
			//|				И 500 = 500
			//|				И 750 = 750
			//|				И 760 = 760
			//|				И 770 = 770) КАК ЛБ_ОбъектыЗалогаОстатки
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			//|			ЛБ_СостояниеОбъектаЗалога.ОбъектЗалога КАК ОбъектЗалога,
			//|			ЛБ_СостояниеОбъектаЗалога.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
			//|			ЛБ_СостояниеОбъектаЗалога.СуммаЗайма КАК СуммаЗайма,
			//|			ЛБ_СостояниеОбъектаЗалога.Регистратор КАК Регистратор
			//|		ИЗ
			//|			РегистрСведений.ЛБ_СостояниеОбъектаЗалога КАК ЛБ_СостояниеОбъектаЗалога) КАК СостоянияОбъектовЗалога
			//|		ПО (ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = СостоянияОбъектовЗалога.ОбъектЗалога
			//|			И ЛБ_ОбъектыЗалогаОстатки.Регистратор = СостоянияОбъектовЗалога.Регистратор)
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Клеймо КАК Клеймо,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК Вес,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесЧистый,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Именник КАК Именник,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Регистратор КАК Регистратор,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет
			//|		ИЗ
			//|			РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
			//|					&ПоДату,
			//|					Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|						И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|						И НЕ Регистратор В
			//|								(ВЫБРАТЬ
			//|									ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			//|								ИЗ
			//|									РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			//|								ГДЕ
			//|									ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних) КАК РеквизитыОбъектаЗалога
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РеквизитыОбъектаЗалога.ОбъектЗалога
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			//|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты.ОбъектЗалога КАК ОбъектЗалога,
			//|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
			//|		ИЗ
			//|			РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.ОстаткиИОбороты(&СДаты, &ПоДату, Период, , ) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты) КАК РасчетыСКлиентамиПоОбъектамЗалога
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РасчетыСКлиентамиПоОбъектамЗалога.ОбъектЗалога
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			//|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель КАК Залогодатель,
			//|			МАКСИМУМ(ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Период) КАК Период,
			//|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус
			//|		ИЗ
			//|			РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(
			//|					&ПоДату,
			//|					Используется
			//|						И ВЫБОР
			//|							КОГДА СрокДействия <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			//|								ТОГДА ВЫБОР
			//|										КОГДА СрокДействия <= &ПоДату
			//|											ТОГДА ЛОЖЬ
			//|										ИНАЧЕ ИСТИНА
			//|									КОНЕЦ
			//|							ИНАЧЕ ИСТИНА
			//|						КОНЕЦ) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних
			//|		
			//|		СГРУППИРОВАТЬ ПО
			//|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель,
			//|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус
			//|		
			//|		ОБЪЕДИНИТЬ ВСЕ
			//|		
			//|		ВЫБРАТЬ
			//|			ЛБ_СтатусыЗалогодателейСрезПоследних.Залогодатель,
			//|			ЛБ_СтатусыЗалогодателейСрезПоследних.Период,
			//|			ЛБ_СтатусыЗалогодателейСрезПоследних.Статус
			//|		ИЗ
			//|			РегистрСведений.ЛБ_СтатусыЗалогодателей.СрезПоследних(, ) КАК ЛБ_СтатусыЗалогодателейСрезПоследних) КАК СтатусыЗалогодателей
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель = СтатусыЗалогодателей.Залогодатель
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			//|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Период КАК Период,
			//|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			//|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки КАК ВидВставки
			//|		ИЗ
			//|			РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(&ПоДату, ) КАК ЛБ_ВставкиОбъектаЗалогаСрезПоследних) КАК ВставкиОЗ
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиОЗ.ОбъектЗалога
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			//|			ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога
			//|		ИЗ
			//|			РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(&ПоДату, НомерСтрокиТаблицы <> 0) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних) КАК ВставкиМеталла
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиМеталла.ОбъектЗалога
			//|ГДЕ
			//|	ИСТИНА"
			////|	И НЕ СостоянияОбъектовЗалога.СтатусОбъектаЗалога ЕСТЬ NULL"
			//+ Символы.ПС + УсловиеСкладНовые
			//+ "	И НЕ ЛБ_ОбъектыЗалогаОстатки.Регистратор В
			//|		(ВЫБРАТЬ
			//|			ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			//|		ИЗ
			//|			РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			//|		ГДЕ
			//|			ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))
			//|	И ВЫБОР
			//|			КОГДА ЛБ_ОбъектыЗалогаОстатки.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|				ТОГДА ЛБ_ОбъектыЗалогаОстатки.Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|						И ЛБ_ОбъектыЗалогаОстатки.Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|						И НЕ ЛБ_ОбъектыЗалогаОстатки.Регистратор В
			//|								(ВЫБРАТЬ
			//|									ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			//|								ИЗ
			//|									РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			//|								ГДЕ
			//|									ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОбъектыЗалогаОстатки.Регистратор))
			//|			КОГДА НЕ ЛБ_ОбъектыЗалогаОстатки.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|				ТОГДА ИСТИНА
			//|		КОНЕЦ
			////|	И ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиКонечныйОстаток <> 0
			//|	И ВЫБОР
			//|			КОГДА СостоянияОбъектовЗалога.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|					И СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение)
			//|				ТОГДА ЛОЖЬ
			//|			ИНАЧЕ ИСТИНА
			//|		КОНЕЦ
			//|	И 100 = 100
			//|	И 200 = 200
			//|	И 300 = 300
			//|	И 400 = 400
			//|	И 600 = 600
			//|	И 700 = 700
			//|	И 710 = 710
			//|	И 720 = 720
			//|	И 730 = 730
			//|	И 740 = 740
			//|	И 780 = 780
			//|	И 800 = 800
			//|	И 900 = 900
			//|	И 444 = 444
			//|	И 999 = 999
			//|
			//|УПОРЯДОЧИТЬ ПО
			//|	Артикул";
			
			Запрос.Текст = "ВЫБРАТЬ
			|	ЛБ_ОбъектыЗалогаОстаткиИОбороты.НомерСтроки КАК НомерСтроки,
			|	ЛБ_ОбъектыЗалогаОстаткиИОбороты.Регистратор КАК Регистратор,
			|	ЛБ_ОбъектыЗалогаОстаткиИОбороты.ПериодСекунда КАК Период,
			|	ЛБ_ОбъектыЗалогаОстаткиИОбороты.Организация КАК Организация,
			|	ЛБ_ОбъектыЗалогаОстаткиИОбороты.Ломбард КАК Ломбард,
			|	ЛБ_ОбъектыЗалогаОстаткиИОбороты.Склад КАК Склад,
			|	ЛБ_ОбъектыЗалогаОстаткиИОбороты.ЗалоговыйБилет КАК ЗалоговыйБилет,
			|	ЛБ_ОбъектыЗалогаОстаткиИОбороты.ОбъектЗалога КАК ОбъектЗалога,
			|	ЛБ_ОбъектыЗалогаОстаткиИОбороты.ОбъектЗалога.Код КАК ОбъектЗалогаКод,
			|	ЛБ_ОбъектыЗалогаОстаткиИОбороты.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
			|	ЛБ_ОбъектыЗалогаОстаткиИОбороты.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток,
			|	ЛБ_ОбъектыЗалогаОстаткиИОбороты.КоличествоОборот КАК КоличествоОборот,
			|	ЛБ_ОбъектыЗалогаОстаткиИОбороты.КоличествоПриход КАК КоличествоПриход,
			|	ЛБ_ОбъектыЗалогаОстаткиИОбороты.КоличествоРасход КАК КоличествоРасход,
			|	ЛБ_ОбъектыЗалогаОстаткиИОбороты.СуммаОценкиНачальныйОстаток КАК СуммаОценкиНачальныйОстаток,
			|	ЛБ_ОбъектыЗалогаОстаткиИОбороты.СуммаОценкиКонечныйОстаток КАК СуммаОценкиКонечныйОстаток,
			|	ЛБ_ОбъектыЗалогаОстаткиИОбороты.СуммаОценкиОборот КАК СуммаОценкиОборот,
			|	ЛБ_ОбъектыЗалогаОстаткиИОбороты.СуммаОценкиПриход КАК СуммаОценкиПриход,
			|	ЛБ_ОбъектыЗалогаОстаткиИОбороты.СуммаОценкиРасход КАК СуммаОценкиРасход
			|ПОМЕСТИТЬ ЛБ_ОбъектыЗалогаОстатки
			|ИЗ
			|	РегистрНакопления.ЛБ_ОбъектыЗалога.ОстаткиИОбороты(
			|			&СДаты,
			|			&ПоДату,
			|			Авто,
			|			,
			|			Ломбард = &Ломбард
			|				И Склад = &Склад
			|				И (ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог)
			|					ИЛИ ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление)
			|					ИЛИ ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога))
			|				И 500 = 500
			|				И 750 = 750
			|				И 760 = 760
			|				И 770 = 770) КАК ЛБ_ОбъектыЗалогаОстаткиИОбороты
			//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&ПоДату, ) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних
			//|		ПО ЛБ_ОбъектыЗалогаОстаткиИОбороты.ЗалоговыйБилет = ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет
			//|ГДЕ
			//|	ВЫБОР
			//|			КОГДА ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыЗалоговыхБилетов.Закрыт)
			//|					И ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление)
			//|				ТОГДА ЛОЖЬ
			//|			ИНАЧЕ ИСТИНА
			//|		КОНЕЦ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога.Код КАК ОбъектЗалогаКод,
			|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
			|	РеквизитыОбъектаЗалога.Артикул КАК Артикул,
			|	СостоянияОбъектовЗалога.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
			|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ВидОперации КАК ЗалоговыйБилетВидОперации,
			|	ЛБ_ОбъектыЗалогаОстатки.Склад КАК Склад,
			|	РеквизитыОбъектаЗалога.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ЛБ_ОбъектыЗалогаОстатки.КоличествоКонечныйОстаток КАК Количество,
			|	ЛБ_ОбъектыЗалогаОстатки.КоличествоКонечныйОстаток КАК КоличествоФакт,
			|	СостоянияОбъектовЗалога.СуммаЗайма КАК СуммаЗайма,
			|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиКонечныйОстаток КАК СуммаОценки,
			|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиКонечныйОстаток КАК СуммаОценкиФакт,
			|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделия,
			|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделияФакт,
			|	РеквизитыОбъектаЗалога.Проба КАК Проба,
			|	РеквизитыОбъектаЗалога.Проба КАК ПробаФакт,
			|	РеквизитыОбъектаЗалога.Категория КАК Категория,
			|	РеквизитыОбъектаЗалога.Категория КАК КатегорияФакт,
			|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМасса,
			|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМассаФакт,
			|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталла,
			|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталлаФакт,
			|	РеквизитыОбъектаЗалога.Проба.Владелец КАК Металл,
			|	РеквизитыОбъектаЗалога.Проба.Владелец КАК МеталлФакт,
			|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель КАК Залогодатель,
			|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Дата КАК ДатаОформленияЗайма,
			|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ОтветственныйСотрудник КАК Приемщик,
			|	РеквизитыОбъектаЗалога.Клеймо КАК Клеймо,
			|	РеквизитыОбъектаЗалога.Клеймо КАК КлеймоФакт,
			|	РеквизитыОбъектаЗалога.Именник КАК Именник,
			|	РеквизитыОбъектаЗалога.Именник КАК ИменникФакт,
			|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ОперацияЗайма,
			|	РасчетыСКлиентамиПоОбъектамЗалога.СуммаКонечныйОстаток КАК ОстатокЗайма,
			|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
			|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлыФакт
			|ИЗ
			|	ЛБ_ОбъектыЗалогаОстатки КАК ЛБ_ОбъектыЗалогаОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛБ_СостояниеОбъектаЗалога.ОбъектЗалога КАК ОбъектЗалога,
			|			ЛБ_СостояниеОбъектаЗалога.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
			|			ЛБ_СостояниеОбъектаЗалога.СуммаЗайма КАК СуммаЗайма,
			|			ЛБ_СостояниеОбъектаЗалога.Регистратор КАК Регистратор
			|		ИЗ
			|			РегистрСведений.ЛБ_СостояниеОбъектаЗалога КАК ЛБ_СостояниеОбъектаЗалога) КАК СостоянияОбъектовЗалога
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = СостоянияОбъектовЗалога.ОбъектЗалога
			|			И ЛБ_ОбъектыЗалогаОстатки.Регистратор = СостоянияОбъектовЗалога.Регистратор
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Клеймо КАК Клеймо,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК Вес,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесЧистый,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Именник КАК Именник,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Регистратор КАК Регистратор,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет
			|		ИЗ
			|			ЛБ_ОбъектыЗалогаОстатки КАК ЛБ_ОбъектыЗалогаОстатки
			|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
			|						&ПоДату,
			|						Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|							И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|							И НЕ Регистратор В
			|									(ВЫБРАТЬ
			|										ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			|									ИЗ
			|										РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			|									ГДЕ
			|										ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
			|				ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога) КАК РеквизитыОбъектаЗалога
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РеквизитыОбъектаЗалога.ОбъектЗалога
			|			И ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет = РеквизитыОбъектаЗалога.ЗалоговыйБилет
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты.ОбъектЗалога КАК ОбъектЗалога,
			|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
			|		ИЗ
			|			РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.ОстаткиИОбороты(&СДаты, &ПоДату, Период, , ) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты) КАК РасчетыСКлиентамиПоОбъектамЗалога
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РасчетыСКлиентамиПоОбъектамЗалога.ОбъектЗалога
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель КАК Залогодатель,
			|			МАКСИМУМ(ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Период) КАК Период,
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус
			|		ИЗ
			|			РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(
			|					&ПоДату,
			|					Используется
			|						И ВЫБОР
			|							КОГДА СрокДействия <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|								ТОГДА ВЫБОР
			|										КОГДА СрокДействия <= &ПоДату
			|											ТОГДА ЛОЖЬ
			|										ИНАЧЕ ИСТИНА
			|									КОНЕЦ
			|							ИНАЧЕ ИСТИНА
			|						КОНЕЦ) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель,
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			ЛБ_СтатусыЗалогодателейСрезПоследних.Залогодатель,
			|			ЛБ_СтатусыЗалогодателейСрезПоследних.Период,
			|			ЛБ_СтатусыЗалогодателейСрезПоследних.Статус
			|		ИЗ
			|			РегистрСведений.ЛБ_СтатусыЗалогодателей.СрезПоследних(, ) КАК ЛБ_СтатусыЗалогодателейСрезПоследних) КАК СтатусыЗалогодателей
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель = СтатусыЗалогодателей.Залогодатель
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Период КАК Период,
			|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки КАК ВидВставки
			|		ИЗ
			|			РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(&ПоДату, ) КАК ЛБ_ВставкиОбъектаЗалогаСрезПоследних) КАК ВставкиОЗ
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиОЗ.ОбъектЗалога
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога
			|		ИЗ
			|			РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(&ПоДату, НомерСтрокиТаблицы <> 0) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних) КАК ВставкиМеталла
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиМеталла.ОбъектЗалога
			|ГДЕ
			|	ИСТИНА"
			+ Символы.ПС + УсловиеСкладНовые
			+ "	И НЕ ЛБ_ОбъектыЗалогаОстатки.Регистратор В
			|				(ВЫБРАТЬ
			|					ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			|				ИЗ
			|					РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			|				ГДЕ
			|					ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))
			|	И ВЫБОР
			|			КОГДА ЛБ_ОбъектыЗалогаОстатки.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			|				ТОГДА ЛБ_ОбъектыЗалогаОстатки.Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|						И ЛБ_ОбъектыЗалогаОстатки.Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|						И НЕ ЛБ_ОбъектыЗалогаОстатки.Регистратор В
			|								(ВЫБРАТЬ
			|									ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			|								ИЗ
			|									РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			|								ГДЕ
			|									ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОбъектыЗалогаОстатки.Регистратор))
			|			КОГДА НЕ ЛБ_ОбъектыЗалогаОстатки.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			|				ТОГДА ИСТИНА
			|		КОНЕЦ
			|	И ВЫБОР
			|			КОГДА СостоянияОбъектовЗалога.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			|					И СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение)
			|				ТОГДА ЛОЖЬ
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|	И ЛБ_ОбъектыЗалогаОстатки.КоличествоКонечныйОстаток > 0
			|	И 100 = 100
			|	И 200 = 200
			|	И 300 = 300
			|	И 400 = 400
			|	И 600 = 600
			|	И 700 = 700
			|	И 710 = 710
			|	И 720 = 720
			|	И 730 = 730
			|	И 740 = 740
			|	И 780 = 780
			|	И 800 = 800
			|	И 900 = 900
			|	И 444 = 444
			|	И 999 = 999
			|
			|УПОРЯДОЧИТЬ ПО
			|	Артикул";

			Запрос.УстановитьПараметр("СДаты", НачалоДня(Объект.Дата));    
			Запрос.УстановитьПараметр("ПоДату", ТекущаяДата());
			//+МАН 17.12.25
			Запрос.УстановитьПараметр("Склад", Объект.Склад);
			//-МАН
		КонецЕсли;
		//-МАН
		
		Если Объект.ВидИнвентаризации = Перечисления.ЛБ_ВидИнвентаризации.Выборочная Тогда
			
			Если ЗначениеЗаполнено(Объект.ОтборДатаЗаймаОт) ИЛИ ЗначениеЗаполнено(Объект.ОтборДатаЗаймаДо) Тогда
				//Если ЗначениеЗаполнено(Объект.ОтборДатаЗаймаОт) И НЕ ЗначениеЗаполнено(Объект.ОтборДатаЗаймаДо) Тогда
				//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "500 = 500", "ЗалоговыйБилет.Дата >= &ОтборДатаЗаймаОт");
				//Если НЕ ЗначениеЗаполнено(Объект.ОтборДатаЗаймаОт) И ЗначениеЗаполнено(Объект.ОтборДатаЗаймаДо) Тогда
				//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "500 = 500", "ЗалоговыйБилет.Дата <= &ОтборДатаЗаймаДо");
				//Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "500 = 500", "ЗалоговыйБилет.Дата МЕЖДУ &ОтборДатаЗаймаОт И &ОтборДатаЗаймаДо"); //Мельников 14.05.24 Было "ЗалоговыйБилет.Дата <= &ОтборДатаЗаймаДо");
				//КонецЕсли;
				Запрос.УстановитьПараметр("ОтборДатаЗаймаОт", Объект.ОтборДатаЗаймаОт);
				Запрос.УстановитьПараметр("ОтборДатаЗаймаДо", Объект.ОтборДатаЗаймаДо);
			КонецЕсли;
			
			//15.05.24 Добавлен фильтр по статусу клиента.
			Если Объект.ФильтрСтатусыЗалогодателя.Количество() > 0 Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "400 = 400", "СтатусыЗалогодателей.Статус В (&СтатусЗалогодателя)"); 	
				Массив = ВернутьМассивИзФильтра(Объект.ФильтрСтатусыЗалогодателя, "Статус"); 				
				Запрос.УстановитьПараметр("СтатусЗалогодателя", Массив); 
			КонецЕсли;  
			
			//15.05.24 Добавлен фильтр по сумме оценки
			Если Объект.ОтборСуммаОценкиОт > 0 ИЛИ Объект.ОтборСуммаОценкиДо > 0 Тогда
				Если Остатки ИЛИ НаОХ ИЛИ СумкаЗакрыта Тогда
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "800 = 800", "ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток МЕЖДУ &ОтборСуммаОценкиОт И &ОтборСуммаОценкиДо");
					
					Если СумкаЗакрыта Тогда
						Запрос.Текст = СтрЗаменить(Запрос.Текст, "801 = 801", "ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиРасход МЕЖДУ &ОтборСуммаОценкиОт И &ОтборСуммаОценкиДо");
					КонецЕсли;
					
				ИначеЕсли Изъятые Тогда
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "800 = 800", "ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиРасход МЕЖДУ &ОтборСуммаОценкиОт И &ОтборСуммаОценкиДо");
				ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "800 = 800", "ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиКонечныйОстаток МЕЖДУ &ОтборСуммаОценкиОт И &ОтборСуммаОценкиДо");
				КонецЕсли;
				
				Запрос.УстановитьПараметр("ОтборСуммаОценкиОт", Объект.ОтборСуммаОценкиОт );
				Запрос.УстановитьПараметр("ОтборСуммаОценкиДо", Объект.ОтборСуммаОценкиДо);
			КонецЕсли;	
			
			//+15.05.24 Добавлен фильтр по вставке
			Если Объект.ФильтрКамни.Количество() > 0 Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "710 = 710", "ВставкиОЗ.ВидВставки В (&ВидВставки)");
				Массив = ВернутьМассивИзФильтра(Объект.ФильтрКамни, "Вставка"); 				
				Запрос.УстановитьПараметр("ВидВставки", Массив); 
			КонецЕсли; 
			
			//+20.05.24 Добавлен фильтр по ОЗ без вставок
			Если Объект.ОтборБезВставок Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "720 = 720", "ВставкиОЗ.ВидВставки ЕСТЬ NULL");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "730 = 730", "ВставкиМеталла.ОбъектЗалога ЕСТЬ NULL");
			КонецЕсли; 
			
			//+20.05.24 Добавлен фильтр по вставкам металла
			Если Объект.ОтборВставкаМеталл Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "740 = 740", "НЕ ВставкиМеталла.ОбъектЗалога ЕСТЬ NULL");
			КонецЕсли; 
			
			//+27.05.24 Если добавляется строка
			Если НоваяСтрокаТЧ Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "770 = 770", "ОбъектЗалога = &ОбъектЗалога");
				Запрос.УстановитьПараметр("ОбъектЗалога", ДобавляемыйОЗ);
			КонецЕсли;
			
			//+МАН 21.03.25
			Если Объект.ОтборВставкаКомплектующие Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "780 = 780", "ТИПЗНАЧЕНИЯ(ВставкиОЗ.ВидВставки) = ТИП(Справочник.ЛБ_КомплектующиеИзделия)");
			КонецЕсли; 
			//-Мельников
			
			Если Объект.ФильтрЗалогодатели.Количество() > 0 тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "750 = 750", "ЗалоговыйБилет.Залогодатель В (&Клиенты)"); 	
				Массив = ВернутьМассивИзФильтра(Объект.ФильтрЗалогодатели, "Залогодатель"); 				
				Запрос.УстановитьПараметр("Клиенты", Массив); 
			КонецЕсли;  
			
			Если Объект.ФильтрПриемщики.Количество() > 0 тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "760 = 760", "ЗалоговыйБилет.Ответственный В (&Приемщики)"); 	
				Массив = ВернутьМассивИзФильтра(Объект.ФильтрПриемщики, "Приемщик"); 				
				Запрос.УстановитьПараметр("Приемщики", Массив); 
			КонецЕсли; 		
			
			Если Объект.ФильтрСтатусы.Количество() > 0 тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "444 = 444", "СостоянияОбъектовЗалога.СтатусОбъектаЗалога В (&СтатусОбъектаЗалога)"); 	
				Массив = ВернутьМассивИзФильтра(Объект.ФильтрСтатусы, "Статус"); 				
				Запрос.УстановитьПараметр("СтатусОбъектаЗалога", Массив); 
			КонецЕсли;
			
			//+МАН 25.11.24 Фильтры для реквизитов
			Если Объект.ФильтрВидыИзделий.Количество() > 0 Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "100 = 100", "РеквизитыОбъектаЗалога.ВидИзделия В (&ВидИзделия)");
				Массив = ВернутьМассивИзФильтра(Объект.ФильтрВидыИзделий, "ВидИзделия");
				Запрос.УстановитьПараметр("ВидИзделия", Массив);
			КонецЕсли;
			
			Если Объект.ФильтрКатегории.Количество() > 0 Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "200 = 200", "РеквизитыОбъектаЗалога.Категория В (&Категории)");
				Массив = ВернутьМассивИзФильтра(Объект.ФильтрКатегории, "Категория");
				Запрос.УстановитьПараметр("Категории", Массив);
			КонецЕсли;
			
			Если Объект.ФильтрПробы.Количество() > 0 Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "300 = 300", "РеквизитыОбъектаЗалога.Проба В (&Пробы)");
				Массив = ВернутьМассивИзФильтра(Объект.ФильтрПробы, "Проба");
				Запрос.УстановитьПараметр("Пробы", Массив);
			КонецЕсли;
			
			Если Объект.ОтборОбщаяМассаОт > 0 ИЛИ Объект.ОтборОбщаяМассаДо > 0 Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "700 = 700", "РеквизитыОбъектаЗалога.Вес МЕЖДУ &ОтборОбщаяМассаОт И &ОтборОбщаяМассаДо");
				Запрос.УстановитьПараметр("ОтборОбщаяМассаОт", Объект.ОтборОбщаяМассаОт);
				Запрос.УстановитьПараметр("ОтборОбщаяМассаДо", Объект.ОтборОбщаяМассаДо);
			КонецЕсли;
			
			Если Объект.ОтборМассаМеталлаОт > 0 ИЛИ Объект.ОтборМассаМеталлаДо > 0 Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "900 = 900", "РеквизитыОбъектаЗалога.ВесЧистый МЕЖДУ &ОтборМассаМеталлаОт И &ОтборМассаМеталлаДо");
				Запрос.УстановитьПараметр("ОтборМассаМеталлаОт", Объект.ОтборМассаМеталлаОт);
				Запрос.УстановитьПараметр("ОтборМассаМеталлаДо", Объект.ОтборМассаМеталлаДо);
			КонецЕсли;	
			
			//+15.05.24 Добавлен фильтр по именнику
			Если Объект.ОтборИменник Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "600 = 600", "РеквизитыОбъектаЗалога.Именник = &ОтборИменник");
				Запрос.УстановитьПараметр("ОтборИменник", ПредопределенноеЗначение("Перечисление.ЛБ_Именник.Да"));
			КонецЕсли;
		КонецЕсли;  
		
		тз = Запрос.Выполнить().Выгрузить();
		
		//+МАН 20.02.26 Вернул т.к. в запросе выходит несколько статусов из-за того что в измерениях участвует накладная.
		//+МАН 21.01.25 Пока заккоментировал. Отбор добавлен в основной запрос
		Если Остатки ИЛИ СумкаЗакрыта Тогда
			
			МассивУдаляемыхСтрокТЗ = Новый Массив;
			
			Для каждого Стр Из тз Цикл
				СтатусОЗ = ПолучитьСтатусОЗВнакладной(НачалоДня(Объект.Дата), Стр.ОбъектЗалога);
		
				Если Остатки Тогда
					Если СтатусОЗ = Неопределено
						ИЛИ СтатусОЗ = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.Факт
						ИЛИ СтатусОЗ = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.СумкаОткрыта
						ИЛИ СтатусОЗ = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.ИсключенИзНакладной
						//+МАН 24.02.26 Когда Оз вернулись в ломбард. Заявка 3269
						ИЛИ СтатусОЗ = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.Отгружено Тогда
						//-МАН
					
						Продолжить;					
					Иначе
						//тз.Удалить(Стр);
						МассивУдаляемыхСтрокТЗ.Добавить(Стр);
					КонецЕсли;
				ИначеЕсли СумкаЗакрыта Тогда
					Если СтатусОЗ = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.СумкаЗакрыта
						//+МАН 24.02.26 Когда Оз вернулись в ломбард. Заявка 3269
						ИЛИ СтатусОЗ = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.Отгружено Тогда
						//-МАН
						
						Продолжить;
					Иначе
						//тз.Удалить(Стр);
						МассивУдаляемыхСтрокТЗ.Добавить(Стр);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			Если МассивУдаляемыхСтрокТЗ.Количество() > 0 Тогда
				Для каждого СтрМассиваТЗ Из МассивУдаляемыхСтрокТЗ Цикл
					тз.Удалить(СтрМассиваТЗ);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;	
		//-МАН
		//-МАН
		
		Строка = Новый КвалификаторыСтроки(1024, ДопустимаяДлина.Переменная);
		М = Новый Массив;
		М.Добавить(Тип("Строка"));
		ТипС = Новый ОписаниеТипов(М,, Строка);
		
		//+МАН 28.10.24 Получачем описание из регистра сведений ЛБ_РеквизитыОбъектаЗалога т.к. в запрос невыбрать с неограниченной длиной
		СтрокаОписания = Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная);
		ТипСтрокиОписания = Новый ОписаниеТипов(М,, СтрокаОписания);
		тз.Колонки.Добавить("ОписаниеИзделия", ТипСтрокиОписания);
		//-МАН
		
		тз.Колонки.Добавить("Отклонения", ТипС);
		
		//+Мельников 17.05.24 Определение суммы займа по объекту залога
		Для каждого СтрТЗ Из тз Цикл
			
			//+МАН 28.10.24 Получачем описание из регистра сведений ЛБ_РеквизитыОбъектаЗалога т.к. в запрос невыбрать с неограниченной длиной
			НаборЗаписей = РегистрыСведений.ЛБ_РеквизитыОбъектаЗалога.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(СтрТЗ.ОперацияЗайма);
			НаборЗаписей.Прочитать();
			
			Для каждого СтрНЗ Из НаборЗаписей Цикл
				
				Если СтрНЗ.ОбъектЗалога <> СтрТЗ.ОбъектЗалога Тогда
					Продолжить;
				КонецЕсли;
				
				СтрТЗ.ОписаниеИзделия = СтрНЗ.ОписаниеИзделия;
				
			КонецЦикла;
			//-МАН
			
			СтрТЗ.Отклонения = ПолучитьОтклонениеПоОЗ(СтрТЗ.ОбъектЗалога);
			
		КонецЦикла;
		//-Мельников
		
		Если НЕ НоваяСтрокаТЧ Тогда
			//+МАН 25.11.24
			Если Остатки Тогда
				Объект.Товары.Загрузить(тз);
			ИначеЕсли НаОХ Тогда
				Объект.НаОХ.Загрузить(тз);
			ИначеЕсли Изъятые Тогда
				Объект.Изъятые.Загрузить(тз);
			ИначеЕсли СумкаЗакрыта Тогда
				Объект.СумкаЗакрыта.Загрузить(тз);
			ИначеЕсли НовыеОЗ Тогда
				Объект.НовыеОЗ.Загрузить(тз);
			ИначеЕсли ОбновитьНовыеОЗ Тогда
				Если тз.Количество() > 0 Тогда
					
					МассивУдаляемыхСтрок = Новый Массив;
					
					Для каждого СтрТЗ Из тз Цикл
						
						Отбор = Новый Структура;
						Отбор.Вставить("ОбъектЗалога", СтрТЗ.ОбъектЗалога);
						Отбор.Вставить("Артикул", СтрТЗ.Артикул);
						
						МассивНайденныхОЗ = Объект.НовыеОЗ.НайтиСтроки(Отбор);
						
						Если МассивНайденныхОЗ.Количество() > 0 Тогда
							МассивУдаляемыхСтрок.Добавить(СтрТЗ);
							Продолжить;
						КонецЕсли;
						
						НоваяСтр = Объект.НовыеОЗ.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтр, СтрТЗ);
						
					КонецЦикла;
					
					Если МассивУдаляемыхСтрок.Количество() > 0 Тогда
						Для каждого СтрМассива Из МассивУдаляемыхСтрок Цикл
							тз.Удалить(СтрМассива);
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			//-МАН
		Иначе
			Если тз.Количество() > 0 Тогда
				Для каждого СтрТЗ Из тз Цикл
					НоваяСтр = Объект.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтр, СтрТЗ)
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		МассивОЗ = тз.ВыгрузитьКолонку("ОбъектЗалога");
		
		ЗапросВставки = Новый Запрос;
		ЗапросВставки.Текст ="ВЫБРАТЬ
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Период КАК Период,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Регистратор КАК Регистратор,
		//|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.НомерСтроки КАК НомерСтроки,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Активность КАК Активность,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки КАК ВидВставки,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ФормаОгранки КАК ФормаОгранки,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидОгранки КАК ВидОгранки,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.КачествоОгранки КАК КачествоОгранки,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Длина КАК Длина,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Ширина КАК Ширина,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Высота КАК Высота,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Диаметр КАК Диаметр,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Диаметр1 КАК Диаметр1,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Диаметр2 КАК Диаметр2,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Вес КАК Вес,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВесГраммы КАК ВесГраммы,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Цена КАК Цена,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Количество КАК Количество,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.СуммаОценки КАК Сумма,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки КАК ВидВставкиФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ФормаОгранки КАК ФормаОгранкиФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидОгранки КАК ВидОгранкиФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.КачествоОгранки КАК КачествоОгранкиФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Длина КАК ДлинаФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Ширина КАК ШиринаФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Высота КАК ВысотаФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Диаметр КАК ДиаметрФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Диаметр1 КАК Диаметр1Факт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Диаметр2 КАК Диаметр2Факт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмеренияФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Вес КАК ВесФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВесГраммы КАК ВесГраммыФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Цена КАК ЦенаФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Количество КАК КоличествоФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаФакт,
		//+Мельников 16.10.24 Инвентаризация. Заявка 2464
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.НеОценивать КАК НеОценивать,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.НеОценивать КАК НеОцениватьФакт,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки) = ТИП(Справочник.ЛБ_ДрагоценныеКамни)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыКомплектующихИзделия.Вставка)
		|		КОГДА ТИПЗНАЧЕНИЯ(ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки) = ТИП(Справочник.ЛБ_КомплектующиеИзделия)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыКомплектующихИзделия.Комплектующее)
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Вид,
		//-Мельников
		//++ИВВ 02.2026, вычеты для часов
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.РазмерСкидки КАК РазмерСкидки
		//--ИВВ
		|ИЗ
		|	РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(100 = 100, ОбъектЗалога В (&МассивОЗ)) КАК ЛБ_ВставкиОбъектаЗалогаСрезПоследних
		|ГДЕ
		|	200 = 200
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ,
		|	НомерСтрокиТаблицы";
		
		Если Остатки ИЛИ НаОХ ИЛИ Изъятые ИЛИ СумкаЗакрыта Тогда
			ЗапросВставки.Текст = СтрЗаменить(ЗапросВставки.Текст, "100 = 100", "&НаДату");
			
			ЗапросВставки.УстановитьПараметр("НаДату", НачалоДня(Объект.Дата)); 
		ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
			ЗапросВставки.Текст = СтрЗаменить(ЗапросВставки.Текст, "100 = 100", "&ПоДату");
			ЗапросВставки.Текст = СтрЗаменить(ЗапросВставки.Текст, "200 = 200", "ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Период МЕЖДУ &СДаты И &ПоДату");
			
			ЗапросВставки.УстановитьПараметр("СДаты", НачалоДня(Объект.Дата)); 
			ЗапросВставки.УстановитьПараметр("ПоДату", ТекущаяДата()); 
		КонецЕсли;
		
		ЗапросВставки.УстановитьПараметр("МассивОЗ", МассивОЗ); 
		
		Если НЕ НоваяСтрокаТЧ ИЛИ НЕ ОбновитьНовыеОЗ Тогда
			//+МАН 25.11.24
			Если Остатки Тогда
				Объект.ВставкиФакт.Очистить();
			ИначеЕсли НаОХ Тогда
				Объект.ВставкиКамнейНаОХ.Очистить();
			ИначеЕсли Изъятые Тогда
				Объект.ВставкиКамнейИзъятые.Очистить();
			ИначеЕсли СумкаЗакрыта Тогда
				Объект.ВставкиКамнейСумкаЗакрыта.Очистить();
			ИначеЕсли НовыеОЗ Тогда
				Объект.ВставкиКамнейНовыеОЗ.Очистить();
			КонецЕсли;
			//-МАН
		КонецЕсли;
		
		//+Мельников 20.05.24
		ТзВствки = ЗапросВставки.Выполнить().Выгрузить();
		//-Мельников
		
		КоличествоВставок = 0;
		КоличествоЗагруженныхВставок = 0;
		
		ВыборкаВставки = ЗапросВставки.Выполнить().Выбрать();
		Пока ВыборкаВставки.Следующий() Цикл
			//+МАН 25.11.24
			Если Остатки Тогда
				КоличествоВставок = КоличествоВставок(ВыборкаВставки.ОбъектЗалога, НачалоДня(Объект.Дата));
				КоличествоЗагруженныхВставок = КоличествоЗагруженныхВставок(ВыборкаВставки.ОбъектЗалога, "ВставкиФакт");
				
				Если КоличествоЗагруженныхВставок <> КоличествоВставок Тогда
					НовСтрВставки = Объект.ВставкиФакт.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставки, ВыборкаВставки);
				Иначе
					Продолжить;
				КонецЕсли;
			ИначеЕсли НаОХ Тогда
				КоличествоВставок = КоличествоВставок(ВыборкаВставки.ОбъектЗалога, НачалоДня(Объект.Дата));
				КоличествоЗагруженныхВставок = КоличествоЗагруженныхВставок(ВыборкаВставки.ОбъектЗалога, "ВставкиКамнейНаОХ");
				
				Если КоличествоЗагруженныхВставок <> КоличествоВставок Тогда
					НовСтрВставки = Объект.ВставкиКамнейНаОХ.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставки, ВыборкаВставки);	
				Иначе
					Продолжить;
				КонецЕсли;
			ИначеЕсли Изъятые Тогда
				КоличествоВставок = КоличествоВставок(ВыборкаВставки.ОбъектЗалога, НачалоДня(Объект.Дата));
				КоличествоЗагруженныхВставок = КоличествоЗагруженныхВставок(ВыборкаВставки.ОбъектЗалога, "ВставкиКамнейИзъятые");
				
				Если КоличествоЗагруженныхВставок <> КоличествоВставок Тогда
					НовСтрВставки = Объект.ВставкиКамнейИзъятые.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставки, ВыборкаВставки);	
				Иначе
					Продолжить;
				КонецЕсли;
			ИначеЕсли СумкаЗакрыта Тогда
				КоличествоВставок = КоличествоВставок(ВыборкаВставки.ОбъектЗалога, НачалоДня(Объект.Дата));
				КоличествоЗагруженныхВставок = КоличествоЗагруженныхВставок(ВыборкаВставки.ОбъектЗалога, "ВставкиКамнейСумкаЗакрыта");
				
				Если КоличествоЗагруженныхВставок <> КоличествоВставок Тогда
					НовСтрВставки = Объект.ВставкиКамнейСумкаЗакрыта.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставки, ВыборкаВставки);	
				Иначе
					Продолжить;
				КонецЕсли;
			ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
				КоличествоВставок = КоличествоВставок(ВыборкаВставки.ОбъектЗалога, НачалоДня(Объект.Дата), Истина);
				КоличествоЗагруженныхВставок = КоличествоЗагруженныхВставок(ВыборкаВставки.ОбъектЗалога, "ВставкиКамнейНовыеОЗ");
				
				Если КоличествоЗагруженныхВставок <> КоличествоВставок Тогда
					НовСтрВставки = Объект.ВставкиКамнейНовыеОЗ.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставки, ВыборкаВставки);	
				Иначе
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			//-МАН
		КонецЦикла;
		
		//+Мельников 17.05.24 Добавлен поиск вставок металла
		ЗапросВставкиМеталла = Новый Запрос;
		ЗапросВставкиМеталла.Текст ="ВЫБРАТЬ
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ВесЧистый КАК Вес,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ВесВПробеЧистоты КАК ВесВПробеЧистоты,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценки,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.Проба КАК ПробаФакт,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесФакт,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ВесВПробеЧистоты КАК ВесВПробеЧистотыФакт,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмеренияФакт,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценкиФакт
		|ИЗ
		|	РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(
		|			100 = 100,
		|			ОбъектЗалога В (&МассивОЗ)
		|				И НомерСтрокиТаблицы <> 0) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних
		|ГДЕ
		|	200 = 200";
		Если Остатки ИЛИ НаОХ ИЛИ Изъятые ИЛИ СумкаЗакрыта Тогда
			ЗапросВставкиМеталла.Текст = СтрЗаменить(ЗапросВставкиМеталла.Текст, "100 = 100", "&НаДату");
			
			ЗапросВставкиМеталла.УстановитьПараметр("НаДату", НачалоДня(Объект.Дата)); 
		ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
			ЗапросВставкиМеталла.Текст = СтрЗаменить(ЗапросВставкиМеталла.Текст, "100 = 100", "&ПоДату");
			ЗапросВставкиМеталла.Текст = СтрЗаменить(ЗапросВставкиМеталла.Текст, "200 = 200", "ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.Период МЕЖДУ &СДаты И &ПоДату");
			
			ЗапросВставкиМеталла.УстановитьПараметр("СДаты", НачалоДня(Объект.Дата)); 
			ЗапросВставкиМеталла.УстановитьПараметр("ПоДату", ТекущаяДата()); 
		КонецЕсли;
		
		ЗапросВставкиМеталла.УстановитьПараметр("МассивОЗ", МассивОЗ); 
		
		Если НЕ НоваяСтрокаТЧ ИЛИ НЕ ОбновитьНовыеОЗ Тогда
			//+МАН 25.11.24
			Если Остатки Тогда
				Объект.ВставкиМеталла.Очистить();
			ИначеЕсли НаОХ Тогда
				Объект.ВставкиМеталлаНаОХ.Очистить();
			ИначеЕсли Изъятые Тогда
				Объект.ВставкиМеталлаИзъятые.Очистить();
			ИначеЕсли СумкаЗакрыта Тогда
				Объект.ВставкиМеталлаСумкаЗакрыта.Очистить();
			ИначеЕсли НовыеОЗ Тогда
				Объект.ВставкиМеталлаНовыеОЗ.Очистить();
			КонецЕсли;
			//-МАН
		КонецЕсли;
		
		ТзВствкиМеталла = ЗапросВставкиМеталла.Выполнить().Выгрузить();
		
		КоличествоВставокМеталла = 0;
		КоличествоЗагруженныхВставокМеталла = 0;
		
		ВыборкаВставкиМеталла = ЗапросВставкиМеталла.Выполнить().Выбрать();
		Пока ВыборкаВставкиМеталла.Следующий() Цикл
			//+МАН 25.11.24
			Если Остатки Тогда
				КоличествоВставокМеталла = КоличествоВставокМеталла(ВыборкаВставкиМеталла.ОбъектЗалога, НачалоДня(Объект.Дата));
				КоличествоЗагруженныхВставокМеталла = КоличествоЗагруженныхВставок(ВыборкаВставкиМеталла.ОбъектЗалога, "ВставкиМеталла");
				
				Если КоличествоЗагруженныхВставокМеталла <> КоличествоВставокМеталла Тогда
					НовСтрВставкиМеталла = Объект.ВставкиМеталла.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставкиМеталла, ВыборкаВставкиМеталла);	
				Иначе
					Продолжить;
				КонецЕсли;
			ИначеЕсли НаОХ Тогда
				КоличествоВставокМеталла = КоличествоВставокМеталла(ВыборкаВставкиМеталла.ОбъектЗалога, НачалоДня(Объект.Дата));
				КоличествоЗагруженныхВставокМеталла = КоличествоЗагруженныхВставок(ВыборкаВставкиМеталла.ОбъектЗалога, "ВставкиМеталлаНаОХ");
				
				Если КоличествоЗагруженныхВставокМеталла <> КоличествоВставокМеталла Тогда
					НовСтрВставкиМеталла = Объект.ВставкиМеталлаНаОХ.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставкиМеталла, ВыборкаВставкиМеталла);	
				Иначе
					Продолжить;
				КонецЕсли;
			ИначеЕсли Изъятые Тогда
				КоличествоВставокМеталла = КоличествоВставокМеталла(ВыборкаВставкиМеталла.ОбъектЗалога, НачалоДня(Объект.Дата));
				КоличествоЗагруженныхВставокМеталла = КоличествоЗагруженныхВставок(ВыборкаВставкиМеталла.ОбъектЗалога, "ВставкиМеталлаИзъятые");
				
				Если КоличествоЗагруженныхВставокМеталла <> КоличествоВставокМеталла Тогда
					НовСтрВставкиМеталла = Объект.ВставкиМеталлаИзъятые.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставкиМеталла, ВыборкаВставкиМеталла);	
				Иначе
					Продолжить;
				КонецЕсли;
			ИначеЕсли СумкаЗакрыта Тогда
				КоличествоВставокМеталла = КоличествоВставокМеталла(ВыборкаВставкиМеталла.ОбъектЗалога, НачалоДня(Объект.Дата));
				КоличествоЗагруженныхВставокМеталла = КоличествоЗагруженныхВставок(ВыборкаВставкиМеталла.ОбъектЗалога, "ВставкиМеталлаСумкаЗакрыта");
				
				Если КоличествоЗагруженныхВставокМеталла <> КоличествоВставокМеталла Тогда
					НовСтрВставкиМеталла = Объект.ВставкиМеталлаСумкаЗакрыта.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставкиМеталла, ВыборкаВставкиМеталла);	
				Иначе
					Продолжить;
				КонецЕсли;
			ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
				КоличествоВставокМеталла = КоличествоВставокМеталла(ВыборкаВставкиМеталла.ОбъектЗалога, НачалоДня(Объект.Дата), Истина);
				КоличествоЗагруженныхВставокМеталла = КоличествоЗагруженныхВставок(ВыборкаВставкиМеталла.ОбъектЗалога, "ВставкиМеталлаНовыеОЗ");
				
				Если КоличествоЗагруженныхВставокМеталла <> КоличествоВставокМеталла Тогда
					НовСтрВставкиМеталла = Объект.ВставкиМеталлаНовыеОЗ.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставкиМеталла, ВыборкаВставкиМеталла);	
				Иначе
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			//-МАН
		КонецЦикла;
		
		//+МАН 26.03.25
		Если Остатки Тогда
			ТЧВставки = Объект.ВставкиФакт;
			ТЧВставкиМеталла = Объект.ВставкиМеталла;
		ИначеЕсли НаОХ Тогда
			ТЧВставки = Объект.ВставкиКамнейНаОХ;
			ТЧВставкиМеталла = Объект.ВставкиМеталлаНаОХ;
		ИначеЕсли Изъятые Тогда
			ТЧВставки = Объект.ВставкиКамнейИзъятые;
			ТЧВставкиМеталла = Объект.ВставкиМеталлаИзъятые;
		ИначеЕсли СумкаЗакрыта Тогда
			ТЧВставки = Объект.ВставкиКамнейСумкаЗакрыта;
			ТЧВставкиМеталла = Объект.ВставкиМеталлаСумкаЗакрыта;
		ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
			ТЧВставки = Объект.ВставкиКамнейНовыеОЗ;
			ТЧВставкиМеталла = Объект.ВставкиМеталлаНовыеОЗ;
		КонецЕсли;
		//-МАН
		
		Для каждого СтрОЗВставка Из ТЧВставки Цикл //ТзВствки Цикл
			
			Отбор = Новый Структура;
			Отбор.Вставить("ОбъектЗалога",СтрОЗВставка.ОбъектЗалога);
			
			//+МАН 25.11.24
			Если Остатки Тогда
				НайденныйОЗ = Объект.Товары.НайтиСтроки(Отбор);
			ИначеЕсли НаОХ Тогда
				НайденныйОЗ = Объект.НаОХ.НайтиСтроки(Отбор);
			ИначеЕсли Изъятые Тогда
				НайденныйОЗ = Объект.Изъятые.НайтиСтроки(Отбор);
			ИначеЕсли СумкаЗакрыта Тогда
				НайденныйОЗ = Объект.СумкаЗакрыта.НайтиСтроки(Отбор);
			ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
				НайденныйОЗ = Объект.НовыеОЗ.НайтиСтроки(Отбор);
			КонецЕсли;
			//-МАН
			
			Для каждого СтрОЗНайденный Из НайденныйОЗ Цикл
				СтрОЗНайденный.Вставка = ?(СтрОЗНайденный.Вставка = "", СтрОЗНайденный.Вставка, СтрОЗНайденный.Вставка + ", ") + ?(СтрОЗВставка.ВидВставки = Неопределено, "", СтрОЗВставка.ВидВставки.КраткоеНаименование);
			КонецЦикла;
		КонецЦикла;
		
		Для каждого СтрОЗВставкаМеталла Из ТЧВставкиМеталла Цикл //ТзВствкиМеталла Цикл
			
			Отбор = Новый Структура;
			Отбор.Вставить("ОбъектЗалога",СтрОЗВставкаМеталла.ОбъектЗалога);
			
			//+МАН 25.11.24
			Если Остатки Тогда
				НайденныйОЗ = Объект.Товары.НайтиСтроки(Отбор);
			ИначеЕсли НаОХ Тогда
				НайденныйОЗ = Объект.НаОХ.НайтиСтроки(Отбор);
			ИначеЕсли Изъятые Тогда
				НайденныйОЗ = Объект.Изъятые.НайтиСтроки(Отбор);
			ИначеЕсли СумкаЗакрыта Тогда
				НайденныйОЗ = Объект.СумкаЗакрыта.НайтиСтроки(Отбор);
			ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
				НайденныйОЗ = Объект.НовыеОЗ.НайтиСтроки(Отбор);
			КонецЕсли;
			//-МАН
			
			Для каждого СтрОЗНайденный Из НайденныйОЗ Цикл
				СтрОЗНайденный.Вставка = ?(СтрОЗНайденный.Вставка = "", СтрОЗНайденный.Вставка, СтрОЗНайденный.Вставка + ", ") + СтрОЗВставкаМеталла.Проба.Наименование;
			КонецЦикла;
		КонецЦикла;
		//-Мельников
		
		//+МАН 25.11.24
		Если Остатки Тогда
			ЗаполнитьПоОстаткамОбъектовЗалога(,Истина);
			ЗаполнитьПоОстаткамОбъектовЗалога(,,Истина);
			ЗаполнитьПоОстаткамОбъектовЗалога(,,,Истина);
		КонецЕсли;
		//-МАН
	КонецЕсли;
КонецПроцедуры

#Область СтарыеПроцедурыЗаполненияОстатков
//+МАН 25.02.26 Пока оставил. 
Процедура ЗаполнитьПоОстаткамОбъектовЗалогаСтарая250226(Остатки = Ложь, НаОХ = Ложь, Изъятые = Ложь, СумкаЗакрыта = Ложь, НовыеОЗ = Ложь, ОбновитьНовыеОЗ = Ложь)
	
	СкладВитринаНеЦО = СтрНайти(Объект.Склад, "Витрина") > 0 И Объект.Ломбард <> Справочники.ЛБ_Ломбарды.ЦентральныйОфис;
	
	ЦО = Объект.Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис;
	
	Если Остатки ИЛИ НовыеОЗ ИЛИ ОбновитьНовыеОЗ ИЛИ ЦО ИЛИ ((НаОХ ИЛИ Изъятые ИЛИ СумкаЗакрыта) И НЕ СкладВитринаНеЦО) Тогда
		
		//+МАН 20.02.26 Убрал из запроса т.к. в запросе выходит несколько статусов из-за того что в измерениях участвует накладная.
		//Если ((Остатки И НЕ СкладВитринаНеЦО) ИЛИ СумкаЗакрыта) И НЕ ЦО Тогда
		//	Условие = "ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_СтатусыОбъектовЗалогаВНакладной.СрезПоследних(&НаДату, ) КАК ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних
		//	|		ПО (ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ОбъектЗалога)" + Символы.ПС;
		//Иначе
			Условие = "";
		//КонецЕсли;
		//-МАН
		
		Если СумкаЗакрыта И НЕ ЦО Тогда
			УсловиеСумка = "ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СостоянияОбъектовЗалога.ОбъектЗалога.Код,
			|	СостоянияОбъектовЗалога.ОбъектЗалога,
			|	РеквизитыОбъектаЗалога.Артикул,
			|	СостоянияОбъектовЗалога.СтатусОбъектаЗалога,
			|	РеквизитыОбъектаЗалога.ЕдиницаИзмерения,
			|	ЛБ_ОбъектыЗалогаОстатки.КоличествоПриход,
			|	ЛБ_ОбъектыЗалогаОстатки.КоличествоПриход,
			|	СостоянияОбъектовЗалога.СуммаОценкиНачальная,
			|	СостоянияОбъектовЗалога.СуммаОценкиНачальная,
			|	РеквизитыОбъектаЗалога.ВидИзделия,
			|	РеквизитыОбъектаЗалога.ВидИзделия,
			|	РеквизитыОбъектаЗалога.Проба,
			|	РеквизитыОбъектаЗалога.Проба,
			|	РеквизитыОбъектаЗалога.Категория,
			|	РеквизитыОбъектаЗалога.Категория,
			|	РеквизитыОбъектаЗалога.Вес,
			|	РеквизитыОбъектаЗалога.Вес,
			|	РеквизитыОбъектаЗалога.ВесЧистый,
			|	РеквизитыОбъектаЗалога.ВесЧистый,
			|	РеквизитыОбъектаЗалога.Проба.Владелец,
			|	РеквизитыОбъектаЗалога.Проба.Владелец,
			|	СостоянияОбъектовЗалога.ЗалоговыйБилет.Залогодатель,
			|	СостоянияОбъектовЗалога.ЗалоговыйБилет.Дата,
			|	СостоянияОбъектовЗалога.ЗалоговыйБилет.ОтветственныйСотрудник,
			|	РеквизитыОбъектаЗалога.Клеймо,
			|	РеквизитыОбъектаЗалога.Клеймо,
			|	РеквизитыОбъектаЗалога.Именник,
			|	РеквизитыОбъектаЗалога.Именник,
			|	РеквизитыОбъектаЗалога.ДанныеИменника,
			|	РеквизитыОбъектаЗалога.ДанныеИменника,
			|	СостоянияОбъектовЗалога.ЗалоговыйБилет,
			|	РасчетыСКлиентамиПоОбъектамЗалога.СуммаОстаток,
			|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы,
			|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы,
			|	РеквизитыОбъектаЗалога.НомерСтрокиТаблицы,
			|	СостоянияОбъектовЗалога.СуммаЗайма,
			|	СостоянияОбъектовЗалога.СуммаДолгаЗайма,
			|	РеквизитыОбъектаЗалога.СостояниеИзделия,
			|	РеквизитыОбъектаЗалога.Дефекты,
			|	РеквизитыОбъектаЗалога.Вес30,
			|	РеквизитыОбъектаЗалога.СуммаОценкиМакс
			|ИЗ
			|	РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(
			|			&НаДату,
			|			500 = 500
			|			И 750 = 750
			|			И 760 = 760
			|			И 770 = 770) КАК СостоянияОбъектовЗалога
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
			|				&НаДату,
			|				Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|					И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|					И НЕ Регистратор В
			|							(ВЫБРАТЬ
			|								ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			|							ИЗ
			|								РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&НаДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			|							ГДЕ
			|								ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))) КАК РеквизитыОбъектаЗалога
			|		ПО (СостоянияОбъектовЗалога.ОбъектЗалога = РеквизитыОбъектаЗалога.ОбъектЗалога)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЛБ_ОбъектыЗалога.Обороты(, &НаДату, Регистратор, ) КАК ЛБ_ОбъектыЗалогаОстатки
			|		ПО (СостоянияОбъектовЗалога.ОбъектЗалога = ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Остатки(&НаДату, ) КАК РасчетыСКлиентамиПоОбъектамЗалога
			|		ПО (СостоянияОбъектовЗалога.ОбъектЗалога = РасчетыСКлиентамиПоОбъектамЗалога.ОбъектЗалога)
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель КАК Залогодатель,
			|			МАКСИМУМ(ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Период) КАК Период,
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус
			|		ИЗ
			|			РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(
			|					&НаДату,
			|					Используется
			|						И ВЫБОР
			|							КОГДА СрокДействия <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|								ТОГДА ВЫБОР
			|										КОГДА СрокДействия <= &НаДату
			|											ТОГДА ЛОЖЬ
			|										ИНАЧЕ ИСТИНА
			|									КОНЕЦ
			|							ИНАЧЕ ИСТИНА
			|						КОНЕЦ) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель,
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			ЛБ_СтатусыЗалогодателейСрезПоследних.Залогодатель,
			|			ЛБ_СтатусыЗалогодателейСрезПоследних.Период,
			|			ЛБ_СтатусыЗалогодателейСрезПоследних.Статус
			|		ИЗ
			|			РегистрСведений.ЛБ_СтатусыЗалогодателей.СрезПоследних(&НаДату, ) КАК ЛБ_СтатусыЗалогодателейСрезПоследних) КАК СтатусыЗалогодателей
			|		ПО (СостоянияОбъектовЗалога.ЗалоговыйБилет.Залогодатель = СтатусыЗалогодателей.Залогодатель)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(&НаДату, ) КАК ВставкиОЗ
			|		ПО (СостоянияОбъектовЗалога.ОбъектЗалога = ВставкиОЗ.ОбъектЗалога)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(&НаДату, НомерСтрокиТаблицы <> 0) КАК ВставкиМеталла
			|		ПО (СостоянияОбъектовЗалога.ОбъектЗалога = ВставкиМеталла.ОбъектЗалога)
			|ГДЕ
			|	СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ПринятНаСкладСумка)
			|	И СостоянияОбъектовЗалога.Регистратор.ЛомбардКуда = &Ломбард
			|	И СостоянияОбъектовЗалога.Регистратор.СкладПолучатель = &Склад
			|	И ЛБ_ОбъектыЗалогаОстатки.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			|	И 100 = 100
			|	И 200 = 200
			|	И 300 = 300
			|	И 400 = 400
			|	И 600 = 600
			|	И 700 = 700
			|	И 710 = 710
			|	И 720 = 720
			|	И 730 = 730
			|	И 740 = 740
			|	И 780 = 780
			|	И 801 = 801
			|	И 900 = 900
			|	И 444 = 444";
			
		Иначе
			УсловиеСумка = "";
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога.Код КАК ОбъектЗалогаКод,
		|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
		|	РеквизитыОбъектаЗалога.Артикул КАК Артикул,
		|	СостоянияОбъектовЗалога.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
		|	РеквизитыОбъектаЗалога.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток КАК Количество,
		|	ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток КАК КоличествоФакт,
		|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток КАК СуммаОценки,
		|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток КАК СуммаОценкиФакт,
		|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделия,
		|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделияФакт,
		|	РеквизитыОбъектаЗалога.Проба КАК Проба,
		|	РеквизитыОбъектаЗалога.Проба КАК ПробаФакт,
		|	РеквизитыОбъектаЗалога.Категория КАК Категория,
		|	РеквизитыОбъектаЗалога.Категория КАК КатегорияФакт,
		|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМасса,
		|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМассаФакт,
		|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталла,
		|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталлаФакт,
		|	РеквизитыОбъектаЗалога.Проба.Владелец КАК Металл,
		|	РеквизитыОбъектаЗалога.Проба.Владелец КАК МеталлФакт,
		|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель КАК Залогодатель,
		|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Дата КАК ДатаОформленияЗайма,
		|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ОтветственныйСотрудник КАК Приемщик,
		|	РеквизитыОбъектаЗалога.Клеймо КАК Клеймо,
		|	РеквизитыОбъектаЗалога.Клеймо КАК КлеймоФакт,
		|	РеквизитыОбъектаЗалога.Именник КАК Именник,
		|	РеквизитыОбъектаЗалога.Именник КАК ИменникФакт,
		|	РеквизитыОбъектаЗалога.ДанныеИменника КАК ДанныеИменника,
		|	РеквизитыОбъектаЗалога.ДанныеИменника КАК ДанныеИменникаФакт,
		|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ОперацияЗайма,
		|	РасчетыСКлиентамиПоОбъектамЗалога.СуммаОстаток КАК ОстатокЗайма,
		|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
		|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлыФакт,
		|	РеквизитыОбъектаЗалога.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
		|	СостоянияОбъектовЗалога.СуммаЗайма КАК СуммаЗайма,
		|	СостоянияОбъектовЗалога.СуммаДолгаЗайма КАК СуммаДолгаЗайма,
		|	РеквизитыОбъектаЗалога.СостояниеИзделия КАК СостояниеИзделия,
		|	РеквизитыОбъектаЗалога.Дефекты КАК Дефекты,
		|	РеквизитыОбъектаЗалога.Вес30 КАК Вес30,
		|	РеквизитыОбъектаЗалога.СуммаОценкиМакс КАК СуммаОценкиМакс
		|ИЗ
		|	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(
		|			&НаДату,
		|			Ломбард = &Ломбард
		|				И Склад = &Склад
		|				И 500 = 500
		|				И 750 = 750
		|				И 760 = 760
		|				И 770 = 770) КАК ЛБ_ОбъектыЗалогаОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
		|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
		|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаДолгаЗайма КАК СуммаДолгаЗайма
		|		ИЗ
		|			РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(
		|					&НаДату,
		//+МАН 27.01.26
		//|					(Регистратор.Ломбард = &Ломбард
		//|						ИЛИ Регистратор.ЛомбардКуда = &Ломбард)
		//Было:|						И ВЫБОР
		|						ВЫБОР
		//-МАН
		|							КОГДА Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
		|								ТОГДА Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		|										И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		|										И НЕ Регистратор В
		|												(ВЫБРАТЬ
		|													ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
		|												ИЗ
		|													РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&НаДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
		|												ГДЕ
		|													ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))
		|							КОГДА НЕ Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
		|								ТОГДА ИСТИНА
		|						КОНЕЦ) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних) КАК СостоянияОбъектовЗалога
		|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = СостоянияОбъектовЗалога.ОбъектЗалога
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Клеймо КАК Клеймо,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК Вес,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесЧистый,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Именник КАК Именник,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ДанныеИменника КАК ДанныеИменника,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СостояниеИзделия КАК СостояниеИзделия,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Дефекты КАК Дефекты,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОписаниеИзделия КАК ОписаниеИзделия,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес30 КАК Вес30,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМакс КАК СуммаОценкиМакс,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет
		|		ИЗ
		|			РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
		|					&НаДату,
		|					Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		|						И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		|						И НЕ Регистратор В
		|								(ВЫБРАТЬ
		|									ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
		|								ИЗ
		|									РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&НаДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
		|								ГДЕ
		|									ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних) КАК РеквизитыОбъектаЗалога
		|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РеквизитыОбъектаЗалога.ОбъектЗалога
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
		|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки.СуммаОстаток КАК СуммаОстаток
		|		ИЗ
		|			РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Остатки(&НаДату, ) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки) КАК РасчетыСКлиентамиПоОбъектамЗалога
		|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РасчетыСКлиентамиПоОбъектамЗалога.ОбъектЗалога
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель КАК Залогодатель,
		|			МАКСИМУМ(ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Период) КАК Период,
		|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус
		|		ИЗ
		|			РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(
		|					&НаДату,
		|					Используется
		|						И ВЫБОР
		|							КОГДА СрокДействия <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|								ТОГДА ВЫБОР
		|										КОГДА СрокДействия <= &НаДату
		|											ТОГДА ЛОЖЬ
		|										ИНАЧЕ ИСТИНА
		|									КОНЕЦ
		|							ИНАЧЕ ИСТИНА
		|						КОНЕЦ) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель,
		|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ЛБ_СтатусыЗалогодателейСрезПоследних.Залогодатель,
		|			ЛБ_СтатусыЗалогодателейСрезПоследних.Период,
		|			ЛБ_СтатусыЗалогодателейСрезПоследних.Статус
		|		ИЗ
		|			РегистрСведений.ЛБ_СтатусыЗалогодателей.СрезПоследних(&НаДату, ) КАК ЛБ_СтатусыЗалогодателейСрезПоследних) КАК СтатусыЗалогодателей
		|		ПО ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель = СтатусыЗалогодателей.Залогодатель
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Период КАК Период,
		|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки КАК ВидВставки
		|		ИЗ
		|			РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(&НаДату, ) КАК ЛБ_ВставкиОбъектаЗалогаСрезПоследних) КАК ВставкиОЗ
		|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиОЗ.ОбъектЗалога
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога
		|		ИЗ
		|			РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(&НаДату, НомерСтрокиТаблицы <> 0) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних) КАК ВставкиМеталла
		|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиМеталла.ОбъектЗалога"
		+ Символы.ПС + Условие
		+ "ГДЕ
		|	ИСТИНА
		|	И ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет = РеквизитыОбъектаЗалога.ЗалоговыйБилет
		|	И 100 = 100
		|	И 200 = 200
		|	И 300 = 300
		|	И 400 = 400
		|	И 600 = 600
		|	И 700 = 700
		|	И 710 = 710
		|	И 720 = 720
		|	И 730 = 730
		|	И 740 = 740
		|	И 780 = 780
		|	И 800 = 800
		|	И 900 = 900
		|	И 444 = 444
		|	И 999 = 999"
		+ Символы.ПС + УсловиеСумка + Символы.ПС
		+ "УПОРЯДОЧИТЬ ПО
		|	Артикул";
		
		Запрос.УстановитьПараметр("НаДату", НачалоДня(Объект.Дата));    
		Запрос.УстановитьПараметр("Ломбард", Объект.Ломбард); 
		//+МАН 17.12.25
		Запрос.УстановитьПараметр("Склад", Объект.Склад);
		//-МАН
		
		//+МАН 21.11.24 Добавлены новые условия
		Если Остатки Тогда
			
			//УсловиеСклад = "";
			
			СтатусыВхождения = Новый Массив;
			
			Если СкладВитринаНеЦО Тогда
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ПринятНаСклад);
			ИначеЕсли ЦО Тогда
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ПринятНаСклад);
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.Возвращен);
			Иначе
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.Принят);
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.Продлен);
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.Возвращен);
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ВключенВНакладную);
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ОбъявленТорг);
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ПринятНаСклад);
				
				//+МАН 20.02.26 Убрал из запроса т.к. в запросе выходит несколько статусов из-за того что в измерениях участвует накладная.
				//УсловиеСклад = "И (ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус ЕСТЬ NULL
				//|			ИЛИ ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.Факт)
				//|			ИЛИ ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.СумкаОткрыта)
				//|			ИЛИ ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.ИсключенИзНакладной)
				//|			ИЛИ ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.Отгружено))";
				//-МАН

			КонецЕсли;
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "999 = 999", "ВЫБОР
			|			КОГДА СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Наследство)
			|					И РасчетыСКлиентамиПоОбъектамЗалога.СуммаОстаток > 0
			|				ТОГДА ИСТИНА
			|			КОГДА СостоянияОбъектовЗалога.СтатусОбъектаЗалога В (&СтатусыВхождения)
			//|					И (СтатусыОЗВНакладной.Статус В (&СтатусВНакладнойВхождение)
			//|						ИЛИ СтатусыОЗВНакладной.Статус ЕСТЬ NULL)
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ЛОЖЬ
			|		КОНЕЦ");
			//+ ?(СкладВитринаНеЦО ИЛИ ЦО, "", Символы.ПС + "И РасчетыСКлиентамиПоОбъектамЗалога.СуммаОстаток > 0"));
			//|		И РасчетыСКлиентамиПоОбъектамЗалога.СуммаОстаток > 0");
			//+МАН 20.02.26 Убрал из запроса т.к. в запросе выходит несколько статусов из-за того что в измерениях участвует накладная.
			//|		И РасчетыСКлиентамиПоОбъектамЗалога.СуммаОстаток > 0" + Символы.ПС + УсловиеСклад);
			//-МАН
			
			//|	И (ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус ЕСТЬ NULL
			//|			ИЛИ ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.Факт)
			//|			ИЛИ ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.СумкаОткрыта)
			//|			ИЛИ ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.ИсключенИзНакладной)
			//|			ИЛИ ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.Отгружено))");
			
			Запрос.УстановитьПараметр("СтатусыВхождения", СтатусыВхождения);
			
		ИначеЕсли НаОХ Тогда
			
			Если ЦО Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "999 = 999", "ВЫБОР
				|			КОГДА СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ГотовКОтправкеОХ)
				//|					ИЛИ СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ПринятНаСклад))
				|					И РасчетыСКлиентамиПоОбъектамЗалога.СуммаОстаток ЕСТЬ NULL
				|				ТОГДА ИСТИНА
				|			ИНАЧЕ ЛОЖЬ
				|		КОНЕЦ");
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "999 = 999", "ВЫБОР
				|			КОГДА (СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Наследство)
				|					ИЛИ СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ПринятНаСклад))
				|					И РасчетыСКлиентамиПоОбъектамЗалога.СуммаОстаток ЕСТЬ NULL
				|				ТОГДА ИСТИНА
				|			КОГДА СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение)
				|				ТОГДА ИСТИНА
				|			ИНАЧЕ ЛОЖЬ
				|		КОНЕЦ");
			КонецЕсли;
			
		ИначеЕсли Изъятые Тогда
			
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога.Код КАК ОбъектЗалогаКод,
			|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
			|	РеквизитыОбъектаЗалога.Артикул КАК Артикул,
			|	СостоянияОбъектовЗалога.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
			|	РеквизитыОбъектаЗалога.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ЛБ_ОбъектыЗалогаОстатки.КоличествоРасход КАК Количество,
			|	ЛБ_ОбъектыЗалогаОстатки.КоличествоРасход КАК КоличествоФакт,
			|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиРасход КАК СуммаОценки,
			|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиРасход КАК СуммаОценкиФакт,
			|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделия,
			|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделияФакт,
			|	РеквизитыОбъектаЗалога.Проба КАК Проба,
			|	РеквизитыОбъектаЗалога.Проба КАК ПробаФакт,
			|	РеквизитыОбъектаЗалога.Категория КАК Категория,
			|	РеквизитыОбъектаЗалога.Категория КАК КатегорияФакт,
			|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМасса,
			|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМассаФакт,
			|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталла,
			|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталлаФакт,
			|	РеквизитыОбъектаЗалога.Проба.Владелец КАК Металл,
			|	РеквизитыОбъектаЗалога.Проба.Владелец КАК МеталлФакт,
			|	РеквизитыОбъектаЗалога.Клеймо КАК Клеймо,
			|	РеквизитыОбъектаЗалога.Клеймо КАК КлеймоФакт,
			|	РеквизитыОбъектаЗалога.Именник КАК Именник,
			|	РеквизитыОбъектаЗалога.Именник КАК ИменникФакт,
			|	РеквизитыОбъектаЗалога.ДанныеИменника КАК ДанныеИменника,
			|	РеквизитыОбъектаЗалога.ДанныеИменника КАК ДанныеИменникаФакт,
			|	РасчетыСКлиентамиПоОбъектамЗалога.СуммаОстаток КАК ОстатокЗайма,
			|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
			|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлыФакт,
			|	РеквизитыОбъектаЗалога.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
			|	СостоянияОбъектовЗалога.СуммаЗайма КАК СуммаЗайма,
			|	СостоянияОбъектовЗалога.СуммаДолгаЗайма КАК СуммаДолгаЗайма,
			|	РеквизитыОбъектаЗалога.СостояниеИзделия КАК СостояниеИзделия,
			|	РеквизитыОбъектаЗалога.Дефекты КАК Дефекты,
			|	РеквизитыОбъектаЗалога.Вес30 КАК Вес30,
			|	РеквизитыОбъектаЗалога.СуммаОценкиМакс КАК СуммаОценкиМакс,
			|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель КАК Залогодатель,
			|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Дата КАК ДатаОформленияЗайма,
			|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ОтветственныйСотрудник КАК Приемщик,
			|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ОперацияЗайма
			|ИЗ
			|	РегистрНакопления.ЛБ_ОбъектыЗалога.Обороты(
			|			,
			|			&НаДату,
			|			Регистратор,
			|			Ломбард = &Ломбард
			|				И Склад = &Склад
			|				И 500 = 500
			|				И 750 = 750
			|				И 760 = 760
			|				И 770 = 770) КАК ЛБ_ОбъектыЗалогаОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
			|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
			|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаДолгаЗайма КАК СуммаДолгаЗайма,
			|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет
			|		ИЗ
			|			РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(
			|					&НаДату,
			|					(Регистратор.Ломбард = &Ломбард
			|						ИЛИ Регистратор.ЛомбардКуда = &Ломбард)
			|						И ВЫБОР
			|							КОГДА Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			|								ТОГДА Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|											И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|											И НЕ Регистратор В
			|													(ВЫБРАТЬ
			|														ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			|													ИЗ
			|														РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&НаДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			|													ГДЕ
			|														ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))
			|							КОГДА НЕ Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			|								ТОГДА ИСТИНА
			|						КОНЕЦ) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних
			|		ГДЕ
			|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Изъят)) КАК СостоянияОбъектовЗалога
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = СостоянияОбъектовЗалога.ОбъектЗалога
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Клеймо КАК Клеймо,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК Вес,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесЧистый,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Именник КАК Именник,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ДанныеИменника КАК ДанныеИменника,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СостояниеИзделия КАК СостояниеИзделия,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Дефекты КАК Дефекты,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОписаниеИзделия КАК ОписаниеИзделия,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес30 КАК Вес30,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМакс КАК СуммаОценкиМакс,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет
			|		ИЗ
			|			РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
			|					&НаДату,
			|					Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|						И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|						И НЕ Регистратор В
			|								(ВЫБРАТЬ
			|									ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			|								ИЗ
			|									РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&НаДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			|								ГДЕ
			|									ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних) КАК РеквизитыОбъектаЗалога
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РеквизитыОбъектаЗалога.ОбъектЗалога
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
			|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки.СуммаОстаток КАК СуммаОстаток
			|		ИЗ
			|			РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Остатки(&НаДату, ) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки) КАК РасчетыСКлиентамиПоОбъектамЗалога
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РасчетыСКлиентамиПоОбъектамЗалога.ОбъектЗалога
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель КАК Залогодатель,
			|			МАКСИМУМ(ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Период) КАК Период,
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус
			|		ИЗ
			|			РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(
			|					&НаДату,
			|					Используется
			|						И ВЫБОР
			|							КОГДА СрокДействия <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|								ТОГДА ВЫБОР
			|										КОГДА СрокДействия <= &НаДату
			|											ТОГДА ЛОЖЬ
			|										ИНАЧЕ ИСТИНА
			|									КОНЕЦ
			|							ИНАЧЕ ИСТИНА
			|						КОНЕЦ) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель,
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			ЛБ_СтатусыЗалогодателейСрезПоследних.Залогодатель,
			|			ЛБ_СтатусыЗалогодателейСрезПоследних.Период,
			|			ЛБ_СтатусыЗалогодателейСрезПоследних.Статус
			|		ИЗ
			|			РегистрСведений.ЛБ_СтатусыЗалогодателей.СрезПоследних(&НаДату, ) КАК ЛБ_СтатусыЗалогодателейСрезПоследних) КАК СтатусыЗалогодателей
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель = СтатусыЗалогодателей.Залогодатель
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Период КАК Период,
			|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки КАК ВидВставки
			|		ИЗ
			|			РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(&НаДату, ) КАК ЛБ_ВставкиОбъектаЗалогаСрезПоследних) КАК ВставкиОЗ
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиОЗ.ОбъектЗалога
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога
			|		ИЗ
			|			РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(&НаДату, НомерСтрокиТаблицы <> 0) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних) КАК ВставкиМеталла
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиМеталла.ОбъектЗалога
			|ГДЕ
			|	ИСТИНА
			|	И ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет = РеквизитыОбъектаЗалога.ЗалоговыйБилет
			|	И ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет = СостоянияОбъектовЗалога.ЗалоговыйБилет
			|	И ЛБ_ОбъектыЗалогаОстатки.КоличествоРасход > 0
			|	И 100 = 100
			|	И 200 = 200
			|	И 300 = 300
			|	И 400 = 400
			|	И 600 = 600
			|	И 700 = 700
			|	И 710 = 710
			|	И 720 = 720
			|	И 730 = 730
			|	И 740 = 740
			|	И 780 = 780
			|	И 800 = 800
			|	И 900 = 900
			|	И 444 = 444
			|	И 999 = 999
			|
			|УПОРЯДОЧИТЬ ПО
			|	Артикул";
			
		ИначеЕсли СумкаЗакрыта Тогда
			
			СтатусыВхождения = Новый Массив;
			
			Если ЦО Тогда
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ПринятНаСкладСумка);
			Иначе
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ВключенВНакладную);
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ОбъявленТорг);
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ПринятНаСкладСумка);
			КонецЕсли;
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "999 = 999", "ВЫБОР
			|			КОГДА СостоянияОбъектовЗалога.СтатусОбъектаЗалога В (&СтатусыВхождения)
			//|					И СтатусыОЗВНакладной.Статус В (&СтатусВНакладнойВхождение)
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ЛОЖЬ
			|		КОНЕЦ");
			//+МАН 20.02.26 Убрал из запроса т.к. в запросе выходит несколько статусов из-за того что в измерениях участвует накладная.
			//+ ?(ЦО, "", Символы.ПС
			//+ "	И ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.СумкаЗакрыта)"));
			//-МАН
			
			Запрос.УстановитьПараметр("СтатусыВхождения", СтатусыВхождения);
			
			//+МАН 24.03.25
		ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
			//+МАН 27.01.26 Пока оставил. Ниже новый.
			//Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			//|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога.Код КАК ОбъектЗалогаКод,
			//|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
			//|	РеквизитыОбъектаЗалога.Артикул КАК Артикул,
			//|	СостоянияОбъектовЗалога.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
			//|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ВидОперации КАК ЗалоговыйБилетВидОперации,
			//|	ЛБ_ОбъектыЗалогаОстатки.Склад КАК Склад,
			//|	РеквизитыОбъектаЗалога.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			//|	ЛБ_ОбъектыЗалогаОстатки.КоличествоКонечныйОстаток КАК Количество,
			//|	ЛБ_ОбъектыЗалогаОстатки.КоличествоКонечныйОстаток КАК КоличествоФакт,
			//|	СостоянияОбъектовЗалога.СуммаЗайма КАК СуммаЗайма,
			//|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиКонечныйОстаток КАК СуммаОценки,
			//|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиКонечныйОстаток КАК СуммаОценкиФакт,
			//|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделия,
			//|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделияФакт,
			//|	РеквизитыОбъектаЗалога.Проба КАК Проба,
			//|	РеквизитыОбъектаЗалога.Проба КАК ПробаФакт,
			//|	РеквизитыОбъектаЗалога.Категория КАК Категория,
			//|	РеквизитыОбъектаЗалога.Категория КАК КатегорияФакт,
			//|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМасса,
			//|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМассаФакт,
			//|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталла,
			//|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталлаФакт,
			//|	РеквизитыОбъектаЗалога.Проба.Владелец КАК Металл,
			//|	РеквизитыОбъектаЗалога.Проба.Владелец КАК МеталлФакт,
			//|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель КАК Залогодатель,
			//|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Дата КАК ДатаОформленияЗайма,
			//|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ОтветственныйСотрудник КАК Приемщик,
			//|	РеквизитыОбъектаЗалога.Клеймо КАК Клеймо,
			//|	РеквизитыОбъектаЗалога.Клеймо КАК КлеймоФакт,
			//|	РеквизитыОбъектаЗалога.Именник КАК Именник,
			//|	РеквизитыОбъектаЗалога.Именник КАК ИменникФакт,
			//|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ОперацияЗайма,
			//|	РасчетыСКлиентамиПоОбъектамЗалога.СуммаКонечныйОстаток КАК ОстатокЗайма,
			//|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
			//|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлыФакт
			//|ИЗ
			//|	РегистрНакопления.ЛБ_ОбъектыЗалога.ОстаткиИОбороты(
			//|			&СДаты,
			//|			&ПоДату,
			//|			Авто,
			//|			,
			//|			Ломбард = &Ломбард
			//|				И Склад = &Склад
			//|				И (ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог)
			//|					ИЛИ ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление)
			//|					ИЛИ ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога))
			//|				И 500 = 500
			//|				И 750 = 750
			//|				И 760 = 760
			//|				И 770 = 770) КАК ЛБ_ОбъектыЗалогаОстатки
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			//|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			//|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
			//|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
			//|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога.Код КАК ОбъектЗалогаКод,
			//|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.Регистратор КАК Регистратор
			//|		ИЗ
			//|			РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(
			//|					&ПоДату,
			//|					(Регистратор.Ломбард = &Ломбард
			//|						ИЛИ Регистратор.ЛомбардКуда = &Ломбард)
			//|						И ОбъектЗалога В
			//|							(ВЫБРАТЬ
			//|								ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога
			//|							ИЗ
			//|								РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПервых(&СДаты, (Регистратор.Ломбард = &Ломбард
			//|									ИЛИ Регистратор.ЛомбардКуда = &Ломбард)
			//|									И ВЫБОР
			//|										КОГДА Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|											ТОГДА Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|													И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|													И НЕ Регистратор В
			//|															(ВЫБРАТЬ
			//|																ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			//|															ИЗ
			//|																РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			//|															ГДЕ
			//|																ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))
			//|										КОГДА НЕ Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|											ТОГДА ИСТИНА
			//|									КОНЕЦ) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних
			//|							СГРУППИРОВАТЬ ПО
			//|								ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога)
			//|						И ВЫБОР
			//|							КОГДА Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|								ТОГДА Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|										И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|										И НЕ Регистратор В
			//|												(ВЫБРАТЬ
			//|													ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			//|												ИЗ
			//|													РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			//|												ГДЕ
			//|													ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))
			//|							КОГДА НЕ Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|								ТОГДА ИСТИНА
			//|						КОНЕЦ) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних) КАК СостоянияОбъектовЗалога
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = СостоянияОбъектовЗалога.ОбъектЗалога
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Клеймо КАК Клеймо,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК Вес,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесЧистый,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Именник КАК Именник,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Регистратор КАК Регистратор,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет
			//|		ИЗ
			//|			РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
			//|					&ПоДату,
			//|					Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|						И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|						И НЕ Регистратор В
			//|								(ВЫБРАТЬ
			//|									ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			//|								ИЗ
			//|									РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			//|								ГДЕ
			//|									ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних) КАК РеквизитыОбъектаЗалога
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РеквизитыОбъектаЗалога.ОбъектЗалога
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			//|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты.ОбъектЗалога КАК ОбъектЗалога,
			//|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
			//|		ИЗ
			//|			РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.ОстаткиИОбороты(&СДаты, &ПоДату, Период, , ) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты) КАК РасчетыСКлиентамиПоОбъектамЗалога
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РасчетыСКлиентамиПоОбъектамЗалога.ОбъектЗалога
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			//|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель КАК Залогодатель,
			//|			МАКСИМУМ(ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Период) КАК Период,
			//|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус
			//|		ИЗ
			//|			РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(
			//|					&ПоДату,
			//|					Используется
			//|						И ВЫБОР
			//|							КОГДА СрокДействия <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			//|								ТОГДА ВЫБОР
			//|										КОГДА СрокДействия <= &ПоДату
			//|											ТОГДА ЛОЖЬ
			//|										ИНАЧЕ ИСТИНА
			//|									КОНЕЦ
			//|							ИНАЧЕ ИСТИНА
			//|						КОНЕЦ) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних
			//|		
			//|		СГРУППИРОВАТЬ ПО
			//|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель,
			//|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус
			//|		
			//|		ОБЪЕДИНИТЬ ВСЕ
			//|		
			//|		ВЫБРАТЬ
			//|			ЛБ_СтатусыЗалогодателейСрезПоследних.Залогодатель,
			//|			ЛБ_СтатусыЗалогодателейСрезПоследних.Период,
			//|			ЛБ_СтатусыЗалогодателейСрезПоследних.Статус
			//|		ИЗ
			//|			РегистрСведений.ЛБ_СтатусыЗалогодателей.СрезПоследних(, ) КАК ЛБ_СтатусыЗалогодателейСрезПоследних) КАК СтатусыЗалогодателей
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель = СтатусыЗалогодателей.Залогодатель
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			//|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Период КАК Период,
			//|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			//|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки КАК ВидВставки
			//|		ИЗ
			//|			РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(&ПоДату, ) КАК ЛБ_ВставкиОбъектаЗалогаСрезПоследних) КАК ВставкиОЗ
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиОЗ.ОбъектЗалога
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			//|			ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога
			//|		ИЗ
			//|			РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(&ПоДату, НомерСтрокиТаблицы <> 0) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних) КАК ВставкиМеталла
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиМеталла.ОбъектЗалога
			//|ГДЕ
			//|	ИСТИНА
			//|	И НЕ СостоянияОбъектовЗалога.СтатусОбъектаЗалога ЕСТЬ NULL
			//|	И (СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Принят)
			//|			ИЛИ СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Возвращен)
			//|			ИЛИ СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ПринятНаСклад)
			//|			ИЛИ СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение))
			//|	И ВЫБОР
			//|			КОГДА ЛБ_ОбъектыЗалогаОстатки.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|				ТОГДА ЛБ_ОбъектыЗалогаОстатки.Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|						И ЛБ_ОбъектыЗалогаОстатки.Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|						И НЕ ЛБ_ОбъектыЗалогаОстатки.Регистратор В
			//|								(ВЫБРАТЬ
			//|									ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			//|								ИЗ
			//|									РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			//|								ГДЕ
			//|									ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОбъектыЗалогаОстатки.Регистратор))
			//|			КОГДА НЕ ЛБ_ОбъектыЗалогаОстатки.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|				ТОГДА ИСТИНА
			//|		КОНЕЦ
			//|	И ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиКонечныйОстаток <> 0
			//|	И ВЫБОР
			//|			КОГДА СостоянияОбъектовЗалога.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|					И СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение)
			//|				ТОГДА ЛОЖЬ
			//|			ИНАЧЕ ИСТИНА
			//|		КОНЕЦ
			//|	И 100 = 100
			//|	И 200 = 200
			//|	И 300 = 300
			//|	И 400 = 400
			//|	И 600 = 600
			//|	И 700 = 700
			//|	И 710 = 710
			//|	И 720 = 720
			//|	И 730 = 730
			//|	И 740 = 740
			//|	И 780 = 780
			//|	И 800 = 800
			//|	И 900 = 900
			//|	И 444 = 444
			//|	И 999 = 999
			//|
			//|УПОРЯДОЧИТЬ ПО
			//|	Артикул";
			
			УсловиеСкладНовые = "";
			
			Если НЕ СкладВитринаНеЦО Тогда
				УсловиеСкладНовые = "	И (СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Принят)
				|			ИЛИ СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Возвращен)
				|			ИЛИ СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ПринятНаСклад)
				|			ИЛИ СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение))";
			Иначе
				УсловиеСкладНовые = "	И СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ПринятНаСклад)";
			КонецЕсли;
			
			//+МАН 13.02.26 Пока убрал. Новый ниже
			//Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			//|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога.Код КАК ОбъектЗалогаКод,
			//|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
			//|	РеквизитыОбъектаЗалога.Артикул КАК Артикул,
			//|	СостоянияОбъектовЗалога.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
			//|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ВидОперации КАК ЗалоговыйБилетВидОперации,
			//|	ЛБ_ОбъектыЗалогаОстатки.Склад КАК Склад,
			//|	РеквизитыОбъектаЗалога.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			//|	ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток КАК Количество,
			//|	ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток КАК КоличествоФакт,
			//|	СостоянияОбъектовЗалога.СуммаЗайма КАК СуммаЗайма,
			//|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток КАК СуммаОценки,
			//|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток КАК СуммаОценкиФакт,
			//|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделия,
			//|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделияФакт,
			//|	РеквизитыОбъектаЗалога.Проба КАК Проба,
			//|	РеквизитыОбъектаЗалога.Проба КАК ПробаФакт,
			//|	РеквизитыОбъектаЗалога.Категория КАК Категория,
			//|	РеквизитыОбъектаЗалога.Категория КАК КатегорияФакт,
			//|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМасса,
			//|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМассаФакт,
			//|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталла,
			//|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталлаФакт,
			//|	РеквизитыОбъектаЗалога.Проба.Владелец КАК Металл,
			//|	РеквизитыОбъектаЗалога.Проба.Владелец КАК МеталлФакт,
			//|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель КАК Залогодатель,
			//|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Дата КАК ДатаОформленияЗайма,
			//|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ОтветственныйСотрудник КАК Приемщик,
			//|	РеквизитыОбъектаЗалога.Клеймо КАК Клеймо,
			//|	РеквизитыОбъектаЗалога.Клеймо КАК КлеймоФакт,
			//|	РеквизитыОбъектаЗалога.Именник КАК Именник,
			//|	РеквизитыОбъектаЗалога.Именник КАК ИменникФакт,
			//|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ОперацияЗайма,
			//|	РасчетыСКлиентамиПоОбъектамЗалога.СуммаКонечныйОстаток КАК ОстатокЗайма,
			//|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
			//|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлыФакт
			//|ИЗ
			//|	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(
			//|			&ПоДату,
			//|			Ломбард = &Ломбард
			//|				И Склад = &Склад
			//|				И (ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог)
			//|					ИЛИ ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление)
			//|					ИЛИ ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога))
			//|				И 500 = 500
			//|				И 750 = 750
			//|				И 760 = 760
			//|				И 770 = 770) КАК ЛБ_ОбъектыЗалогаОстатки
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			//|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			//|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
			//|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
			//|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога.Код КАК ОбъектЗалогаКод,
			//|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.Регистратор КАК Регистратор
			//|		ИЗ
			//|			РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(
			//|					&ПоДату,
			//|					(Регистратор.Ломбард = &Ломбард
			//|						ИЛИ Регистратор.ЛомбардКуда = &Ломбард)
			//|						И ОбъектЗалога В
			//|							(ВЫБРАТЬ
			//|								ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога
			//|							ИЗ
			//|								РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПервых(&СДаты, (Регистратор.Ломбард = &Ломбард
			//|									ИЛИ Регистратор.ЛомбардКуда = &Ломбард)
			//|									И ВЫБОР
			//|										КОГДА Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|											ТОГДА Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|													И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|													И НЕ Регистратор В
			//|															(ВЫБРАТЬ
			//|																ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			//|															ИЗ
			//|																РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			//|															ГДЕ
			//|																ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))
			//|										КОГДА НЕ Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|											ТОГДА ИСТИНА
			//|									КОНЕЦ) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних
			//|							СГРУППИРОВАТЬ ПО
			//|								ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога)
			//|						И ВЫБОР
			//|							КОГДА Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|								ТОГДА Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|										И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|										И НЕ Регистратор В
			//|												(ВЫБРАТЬ
			//|													ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			//|												ИЗ
			//|													РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			//|												ГДЕ
			//|													ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))
			//|							КОГДА НЕ Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|								ТОГДА ИСТИНА
			//|						КОНЕЦ) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних) КАК СостоянияОбъектовЗалога
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = СостоянияОбъектовЗалога.ОбъектЗалога
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Клеймо КАК Клеймо,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК Вес,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесЧистый,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Именник КАК Именник,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Регистратор КАК Регистратор,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет
			//|		ИЗ
			//|			РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
			//|					&ПоДату,
			//|					Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|						И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|						И НЕ Регистратор В
			//|								(ВЫБРАТЬ
			//|									ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			//|								ИЗ
			//|									РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			//|								ГДЕ
			//|									ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних) КАК РеквизитыОбъектаЗалога
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РеквизитыОбъектаЗалога.ОбъектЗалога
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			//|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты.ОбъектЗалога КАК ОбъектЗалога,
			//|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
			//|		ИЗ
			//|			РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.ОстаткиИОбороты(&СДаты, &ПоДату, Период, , ) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты) КАК РасчетыСКлиентамиПоОбъектамЗалога
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РасчетыСКлиентамиПоОбъектамЗалога.ОбъектЗалога
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			//|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель КАК Залогодатель,
			//|			МАКСИМУМ(ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Период) КАК Период,
			//|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус
			//|		ИЗ
			//|			РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(
			//|					&ПоДату,
			//|					Используется
			//|						И ВЫБОР
			//|							КОГДА СрокДействия <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			//|								ТОГДА ВЫБОР
			//|										КОГДА СрокДействия <= &ПоДату
			//|											ТОГДА ЛОЖЬ
			//|										ИНАЧЕ ИСТИНА
			//|									КОНЕЦ
			//|							ИНАЧЕ ИСТИНА
			//|						КОНЕЦ) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних
			//|		
			//|		СГРУППИРОВАТЬ ПО
			//|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель,
			//|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус
			//|		
			//|		ОБЪЕДИНИТЬ ВСЕ
			//|		
			//|		ВЫБРАТЬ
			//|			ЛБ_СтатусыЗалогодателейСрезПоследних.Залогодатель,
			//|			ЛБ_СтатусыЗалогодателейСрезПоследних.Период,
			//|			ЛБ_СтатусыЗалогодателейСрезПоследних.Статус
			//|		ИЗ
			//|			РегистрСведений.ЛБ_СтатусыЗалогодателей.СрезПоследних(, ) КАК ЛБ_СтатусыЗалогодателейСрезПоследних) КАК СтатусыЗалогодателей
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель = СтатусыЗалогодателей.Залогодатель
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			//|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Период КАК Период,
			//|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			//|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки КАК ВидВставки
			//|		ИЗ
			//|			РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(&ПоДату, ) КАК ЛБ_ВставкиОбъектаЗалогаСрезПоследних) КАК ВставкиОЗ
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиОЗ.ОбъектЗалога
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			//|			ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога
			//|		ИЗ
			//|			РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(&ПоДату, НомерСтрокиТаблицы <> 0) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних) КАК ВставкиМеталла
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиМеталла.ОбъектЗалога
			//|ГДЕ
			//|	ИСТИНА
			//|	И НЕ СостоянияОбъектовЗалога.СтатусОбъектаЗалога ЕСТЬ NULL"
			//+ Символы.ПС + УсловиеСкладНовые
			//+ "	И ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток <> 0
			//|	И ВЫБОР
			//|			КОГДА СостоянияОбъектовЗалога.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|					И СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение)
			//|				ТОГДА ЛОЖЬ
			//|			ИНАЧЕ ИСТИНА
			//|		КОНЕЦ
			//|	И 100 = 100
			//|	И 200 = 200
			//|	И 300 = 300
			//|	И 400 = 400
			//|	И 600 = 600
			//|	И 700 = 700
			//|	И 710 = 710
			//|	И 720 = 720
			//|	И 730 = 730
			//|	И 740 = 740
			//|	И 780 = 780
			//|	И 800 = 800
			//|	И 900 = 900
			//|	И 444 = 444
			//|	И 999 = 999
			//|
			//|УПОРЯДОЧИТЬ ПО
			//|	Артикул";

			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога.Код КАК ОбъектЗалогаКод,
			|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
			|	РеквизитыОбъектаЗалога.Артикул КАК Артикул,
			|	СостоянияОбъектовЗалога.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
			|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ВидОперации КАК ЗалоговыйБилетВидОперации,
			|	ЛБ_ОбъектыЗалогаОстатки.Склад КАК Склад,
			|	РеквизитыОбъектаЗалога.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ЛБ_ОбъектыЗалогаОстатки.КоличествоКонечныйОстаток КАК Количество,
			|	ЛБ_ОбъектыЗалогаОстатки.КоличествоКонечныйОстаток КАК КоличествоФакт,
			|	СостоянияОбъектовЗалога.СуммаЗайма КАК СуммаЗайма,
			|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиКонечныйОстаток КАК СуммаОценки,
			|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиКонечныйОстаток КАК СуммаОценкиФакт,
			|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделия,
			|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделияФакт,
			|	РеквизитыОбъектаЗалога.Проба КАК Проба,
			|	РеквизитыОбъектаЗалога.Проба КАК ПробаФакт,
			|	РеквизитыОбъектаЗалога.Категория КАК Категория,
			|	РеквизитыОбъектаЗалога.Категория КАК КатегорияФакт,
			|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМасса,
			|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМассаФакт,
			|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталла,
			|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталлаФакт,
			|	РеквизитыОбъектаЗалога.Проба.Владелец КАК Металл,
			|	РеквизитыОбъектаЗалога.Проба.Владелец КАК МеталлФакт,
			|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель КАК Залогодатель,
			|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Дата КАК ДатаОформленияЗайма,
			|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ОтветственныйСотрудник КАК Приемщик,
			|	РеквизитыОбъектаЗалога.Клеймо КАК Клеймо,
			|	РеквизитыОбъектаЗалога.Клеймо КАК КлеймоФакт,
			|	РеквизитыОбъектаЗалога.Именник КАК Именник,
			|	РеквизитыОбъектаЗалога.Именник КАК ИменникФакт,
			|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ОперацияЗайма,
			|	РасчетыСКлиентамиПоОбъектамЗалога.СуммаКонечныйОстаток КАК ОстатокЗайма,
			|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
			|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлыФакт
			|ИЗ
			|	РегистрНакопления.ЛБ_ОбъектыЗалога.ОстаткиИОбороты(
			|			&СДаты,
			|			&ПоДату,
			|			Авто,
			|			,
			|			Ломбард = &Ломбард
			|				И Склад = &Склад
			|				И (ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог)
			|					ИЛИ ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление)
			|					ИЛИ ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога))
			|				И 500 = 500
			|				И 750 = 750
			|				И 760 = 760
			|				И 770 = 770) КАК ЛБ_ОбъектыЗалогаОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛБ_СостояниеОбъектаЗалога.ОбъектЗалога КАК ОбъектЗалога,
			|			ЛБ_СостояниеОбъектаЗалога.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
			|			ЛБ_СостояниеОбъектаЗалога.СуммаЗайма КАК СуммаЗайма,
			|			ЛБ_СостояниеОбъектаЗалога.Регистратор КАК Регистратор
			|		ИЗ
			|			РегистрСведений.ЛБ_СостояниеОбъектаЗалога КАК ЛБ_СостояниеОбъектаЗалога) КАК СостоянияОбъектовЗалога
			|		ПО (ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = СостоянияОбъектовЗалога.ОбъектЗалога
			|			И ЛБ_ОбъектыЗалогаОстатки.Регистратор = СостоянияОбъектовЗалога.Регистратор)
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Клеймо КАК Клеймо,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК Вес,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесЧистый,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Именник КАК Именник,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Регистратор КАК Регистратор,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет
			|		ИЗ
			|			РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
			|					&ПоДату,
			|					Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|						И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|						И НЕ Регистратор В
			|								(ВЫБРАТЬ
			|									ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			|								ИЗ
			|									РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			|								ГДЕ
			|									ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних) КАК РеквизитыОбъектаЗалога
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РеквизитыОбъектаЗалога.ОбъектЗалога
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты.ОбъектЗалога КАК ОбъектЗалога,
			|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
			|		ИЗ
			|			РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.ОстаткиИОбороты(&СДаты, &ПоДату, Период, , ) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты) КАК РасчетыСКлиентамиПоОбъектамЗалога
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РасчетыСКлиентамиПоОбъектамЗалога.ОбъектЗалога
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель КАК Залогодатель,
			|			МАКСИМУМ(ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Период) КАК Период,
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус
			|		ИЗ
			|			РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(
			|					&ПоДату,
			|					Используется
			|						И ВЫБОР
			|							КОГДА СрокДействия <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|								ТОГДА ВЫБОР
			|										КОГДА СрокДействия <= &ПоДату
			|											ТОГДА ЛОЖЬ
			|										ИНАЧЕ ИСТИНА
			|									КОНЕЦ
			|							ИНАЧЕ ИСТИНА
			|						КОНЕЦ) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель,
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			ЛБ_СтатусыЗалогодателейСрезПоследних.Залогодатель,
			|			ЛБ_СтатусыЗалогодателейСрезПоследних.Период,
			|			ЛБ_СтатусыЗалогодателейСрезПоследних.Статус
			|		ИЗ
			|			РегистрСведений.ЛБ_СтатусыЗалогодателей.СрезПоследних(, ) КАК ЛБ_СтатусыЗалогодателейСрезПоследних) КАК СтатусыЗалогодателей
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель = СтатусыЗалогодателей.Залогодатель
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Период КАК Период,
			|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки КАК ВидВставки
			|		ИЗ
			|			РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(&ПоДату, ) КАК ЛБ_ВставкиОбъектаЗалогаСрезПоследних) КАК ВставкиОЗ
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиОЗ.ОбъектЗалога
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога
			|		ИЗ
			|			РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(&ПоДату, НомерСтрокиТаблицы <> 0) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних) КАК ВставкиМеталла
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиМеталла.ОбъектЗалога
			|ГДЕ
			|	ИСТИНА"
			//|	И НЕ СостоянияОбъектовЗалога.СтатусОбъектаЗалога ЕСТЬ NULL"
			+ Символы.ПС + УсловиеСкладНовые
			+ "	И ВЫБОР
			|			КОГДА ЛБ_ОбъектыЗалогаОстатки.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			|				ТОГДА ЛБ_ОбъектыЗалогаОстатки.Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|						И ЛБ_ОбъектыЗалогаОстатки.Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|						И НЕ ЛБ_ОбъектыЗалогаОстатки.Регистратор В
			|								(ВЫБРАТЬ
			|									ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			|								ИЗ
			|									РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			|								ГДЕ
			|									ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОбъектыЗалогаОстатки.Регистратор))
			|			КОГДА НЕ ЛБ_ОбъектыЗалогаОстатки.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			|				ТОГДА ИСТИНА
			|		КОНЕЦ
			//|	И ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиКонечныйОстаток <> 0
			|	И ВЫБОР
			|			КОГДА СостоянияОбъектовЗалога.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			|					И СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение)
			|				ТОГДА ЛОЖЬ
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|	И 100 = 100
			|	И 200 = 200
			|	И 300 = 300
			|	И 400 = 400
			|	И 600 = 600
			|	И 700 = 700
			|	И 710 = 710
			|	И 720 = 720
			|	И 730 = 730
			|	И 740 = 740
			|	И 780 = 780
			|	И 800 = 800
			|	И 900 = 900
			|	И 444 = 444
			|	И 999 = 999
			|
			|УПОРЯДОЧИТЬ ПО
			|	Артикул";
			
			Запрос.УстановитьПараметр("СДаты", НачалоДня(Объект.Дата));    
			Запрос.УстановитьПараметр("ПоДату", ТекущаяДата());
			//+МАН 17.12.25
			Запрос.УстановитьПараметр("Склад", Объект.Склад);
			//-МАН
		КонецЕсли;
		//-МАН
		
		Если Объект.ВидИнвентаризации = Перечисления.ЛБ_ВидИнвентаризации.Выборочная Тогда
			
			Если ЗначениеЗаполнено(Объект.ОтборДатаЗаймаОт) ИЛИ ЗначениеЗаполнено(Объект.ОтборДатаЗаймаДо) Тогда
				//Если ЗначениеЗаполнено(Объект.ОтборДатаЗаймаОт) И НЕ ЗначениеЗаполнено(Объект.ОтборДатаЗаймаДо) Тогда
				//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "500 = 500", "ЗалоговыйБилет.Дата >= &ОтборДатаЗаймаОт");
				//Если НЕ ЗначениеЗаполнено(Объект.ОтборДатаЗаймаОт) И ЗначениеЗаполнено(Объект.ОтборДатаЗаймаДо) Тогда
				//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "500 = 500", "ЗалоговыйБилет.Дата <= &ОтборДатаЗаймаДо");
				//Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "500 = 500", "ЗалоговыйБилет.Дата МЕЖДУ &ОтборДатаЗаймаОт И &ОтборДатаЗаймаДо"); //Мельников 14.05.24 Было "ЗалоговыйБилет.Дата <= &ОтборДатаЗаймаДо");
				//КонецЕсли;
				Запрос.УстановитьПараметр("ОтборДатаЗаймаОт", Объект.ОтборДатаЗаймаОт);
				Запрос.УстановитьПараметр("ОтборДатаЗаймаДо", Объект.ОтборДатаЗаймаДо);
			КонецЕсли;
			
			//15.05.24 Добавлен фильтр по статусу клиента.
			Если Объект.ФильтрСтатусыЗалогодателя.Количество() > 0 Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "400 = 400", "СтатусыЗалогодателей.Статус В (&СтатусЗалогодателя)"); 	
				Массив = ВернутьМассивИзФильтра(Объект.ФильтрСтатусыЗалогодателя, "Статус"); 				
				Запрос.УстановитьПараметр("СтатусЗалогодателя", Массив); 
			КонецЕсли;  
			
			//15.05.24 Добавлен фильтр по сумме оценки
			Если Объект.ОтборСуммаОценкиОт > 0 ИЛИ Объект.ОтборСуммаОценкиДо > 0 Тогда
				Если Остатки ИЛИ НаОХ ИЛИ СумкаЗакрыта Тогда
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "800 = 800", "ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток МЕЖДУ &ОтборСуммаОценкиОт И &ОтборСуммаОценкиДо");
					
					Если СумкаЗакрыта Тогда
						Запрос.Текст = СтрЗаменить(Запрос.Текст, "801 = 801", "ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиРасход МЕЖДУ &ОтборСуммаОценкиОт И &ОтборСуммаОценкиДо");
					КонецЕсли;
					
				ИначеЕсли Изъятые Тогда
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "800 = 800", "ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиРасход МЕЖДУ &ОтборСуммаОценкиОт И &ОтборСуммаОценкиДо");
				ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "800 = 800", "ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиКонечныйОстаток МЕЖДУ &ОтборСуммаОценкиОт И &ОтборСуммаОценкиДо");
				КонецЕсли;
				
				Запрос.УстановитьПараметр("ОтборСуммаОценкиОт", Объект.ОтборСуммаОценкиОт );
				Запрос.УстановитьПараметр("ОтборСуммаОценкиДо", Объект.ОтборСуммаОценкиДо);
			КонецЕсли;	
			
			//+15.05.24 Добавлен фильтр по вставке
			Если Объект.ФильтрКамни.Количество() > 0 Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "710 = 710", "ВставкиОЗ.ВидВставки В (&ВидВставки)");
				Массив = ВернутьМассивИзФильтра(Объект.ФильтрКамни, "Вставка"); 				
				Запрос.УстановитьПараметр("ВидВставки", Массив); 
			КонецЕсли; 
			
			//+20.05.24 Добавлен фильтр по ОЗ без вставок
			Если Объект.ОтборБезВставок Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "720 = 720", "ВставкиОЗ.ВидВставки ЕСТЬ NULL");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "730 = 730", "ВставкиМеталла.ОбъектЗалога ЕСТЬ NULL");
			КонецЕсли; 
			
			//+20.05.24 Добавлен фильтр по вставкам металла
			Если Объект.ОтборВставкаМеталл Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "740 = 740", "НЕ ВставкиМеталла.ОбъектЗалога ЕСТЬ NULL");
			КонецЕсли; 
			
			//+27.05.24 Если добавляется строка
			Если НоваяСтрокаТЧ Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "770 = 770", "ОбъектЗалога = &ОбъектЗалога");
				Запрос.УстановитьПараметр("ОбъектЗалога", ДобавляемыйОЗ);
			КонецЕсли;
			
			//+МАН 21.03.25
			Если Объект.ОтборВставкаКомплектующие Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "780 = 780", "ТИПЗНАЧЕНИЯ(ВставкиОЗ.ВидВставки) = ТИП(Справочник.ЛБ_КомплектующиеИзделия)");
			КонецЕсли; 
			//-Мельников
			
			Если Объект.ФильтрЗалогодатели.Количество() > 0 тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "750 = 750", "ЗалоговыйБилет.Залогодатель В (&Клиенты)"); 	
				Массив = ВернутьМассивИзФильтра(Объект.ФильтрЗалогодатели, "Залогодатель"); 				
				Запрос.УстановитьПараметр("Клиенты", Массив); 
			КонецЕсли;  
			
			Если Объект.ФильтрПриемщики.Количество() > 0 тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "760 = 760", "ЗалоговыйБилет.Ответственный В (&Приемщики)"); 	
				Массив = ВернутьМассивИзФильтра(Объект.ФильтрПриемщики, "Приемщик"); 				
				Запрос.УстановитьПараметр("Приемщики", Массив); 
			КонецЕсли; 		
			
			Если Объект.ФильтрСтатусы.Количество() > 0 тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "444 = 444", "СостоянияОбъектовЗалога.СтатусОбъектаЗалога В (&СтатусОбъектаЗалога)"); 	
				Массив = ВернутьМассивИзФильтра(Объект.ФильтрСтатусы, "Статус"); 				
				Запрос.УстановитьПараметр("СтатусОбъектаЗалога", Массив); 
			КонецЕсли;
			
			//+МАН 25.11.24 Фильтры для реквизитов
			Если Объект.ФильтрВидыИзделий.Количество() > 0 Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "100 = 100", "РеквизитыОбъектаЗалога.ВидИзделия В (&ВидИзделия)");
				Массив = ВернутьМассивИзФильтра(Объект.ФильтрВидыИзделий, "ВидИзделия");
				Запрос.УстановитьПараметр("ВидИзделия", Массив);
			КонецЕсли;
			
			Если Объект.ФильтрКатегории.Количество() > 0 Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "200 = 200", "РеквизитыОбъектаЗалога.Категория В (&Категории)");
				Массив = ВернутьМассивИзФильтра(Объект.ФильтрКатегории, "Категория");
				Запрос.УстановитьПараметр("Категории", Массив);
			КонецЕсли;
			
			Если Объект.ФильтрПробы.Количество() > 0 Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "300 = 300", "РеквизитыОбъектаЗалога.Проба В (&Пробы)");
				Массив = ВернутьМассивИзФильтра(Объект.ФильтрПробы, "Проба");
				Запрос.УстановитьПараметр("Пробы", Массив);
			КонецЕсли;
			
			Если Объект.ОтборОбщаяМассаОт > 0 ИЛИ Объект.ОтборОбщаяМассаДо > 0 Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "700 = 700", "РеквизитыОбъектаЗалога.Вес МЕЖДУ &ОтборОбщаяМассаОт И &ОтборОбщаяМассаДо");
				Запрос.УстановитьПараметр("ОтборОбщаяМассаОт", Объект.ОтборОбщаяМассаОт);
				Запрос.УстановитьПараметр("ОтборОбщаяМассаДо", Объект.ОтборОбщаяМассаДо);
			КонецЕсли;
			
			Если Объект.ОтборМассаМеталлаОт > 0 ИЛИ Объект.ОтборМассаМеталлаДо > 0 Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "900 = 900", "РеквизитыОбъектаЗалога.ВесЧистый МЕЖДУ &ОтборМассаМеталлаОт И &ОтборМассаМеталлаДо");
				Запрос.УстановитьПараметр("ОтборМассаМеталлаОт", Объект.ОтборМассаМеталлаОт);
				Запрос.УстановитьПараметр("ОтборМассаМеталлаДо", Объект.ОтборМассаМеталлаДо);
			КонецЕсли;	
			
			//+15.05.24 Добавлен фильтр по именнику
			Если Объект.ОтборИменник Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "600 = 600", "РеквизитыОбъектаЗалога.Именник = &ОтборИменник");
				Запрос.УстановитьПараметр("ОтборИменник", ПредопределенноеЗначение("Перечисление.ЛБ_Именник.Да"));
			КонецЕсли;
		КонецЕсли;  
		
		тз = Запрос.Выполнить().Выгрузить();
		
		//+МАН 20.02.26 Вернул т.к. в запросе выходит несколько статусов из-за того что в измерениях участвует накладная.
		//+МАН 21.01.25 Пока заккоментировал. Отбор добавлен в основной запрос
		Если Остатки ИЛИ СумкаЗакрыта Тогда
			
			МассивУдаляемыхСтрокТЗ = Новый Массив;
			
			Для каждого Стр Из тз Цикл
				СтатусОЗ = ПолучитьСтатусОЗВнакладной(НачалоДня(Объект.Дата), Стр.ОбъектЗалога);
		
				Если Остатки Тогда
					Если СтатусОЗ = Неопределено
						ИЛИ СтатусОЗ = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.Факт
						ИЛИ СтатусОЗ = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.СумкаОткрыта
						ИЛИ СтатусОЗ = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.ИсключенИзНакладной
						//+МАН 24.02.26 Когда Оз вернулись в ломбард. Заявка 3269
						ИЛИ СтатусОЗ = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.Отгружено Тогда
						//-МАН
					
						Продолжить;					
					Иначе
						//тз.Удалить(Стр);
						МассивУдаляемыхСтрокТЗ.Добавить(Стр);
					КонецЕсли;
				ИначеЕсли СумкаЗакрыта Тогда
					Если СтатусОЗ = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.СумкаЗакрыта
						//+МАН 24.02.26 Когда Оз вернулись в ломбард. Заявка 3269
						ИЛИ СтатусОЗ = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.Отгружено Тогда
						//-МАН
						
						Продолжить;
					Иначе
						//тз.Удалить(Стр);
						МассивУдаляемыхСтрокТЗ.Добавить(Стр);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			Если МассивУдаляемыхСтрокТЗ.Количество() > 0 Тогда
				Для каждого СтрМассиваТЗ Из МассивУдаляемыхСтрокТЗ Цикл
					тз.Удалить(СтрМассиваТЗ);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;	
		//-МАН
		//-МАН
		
		Строка = Новый КвалификаторыСтроки(1024, ДопустимаяДлина.Переменная);
		М = Новый Массив;
		М.Добавить(Тип("Строка"));
		ТипС = Новый ОписаниеТипов(М,, Строка);
		
		//+МАН 28.10.24 Получачем описание из регистра сведений ЛБ_РеквизитыОбъектаЗалога т.к. в запрос невыбрать с неограниченной длиной
		СтрокаОписания = Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная);
		ТипСтрокиОписания = Новый ОписаниеТипов(М,, СтрокаОписания);
		тз.Колонки.Добавить("ОписаниеИзделия", ТипСтрокиОписания);
		//-МАН
		
		тз.Колонки.Добавить("Отклонения", ТипС);
		
		//+Мельников 17.05.24 Определение суммы займа по объекту залога
		Для каждого СтрТЗ Из тз Цикл
			
			//+МАН 28.10.24 Получачем описание из регистра сведений ЛБ_РеквизитыОбъектаЗалога т.к. в запрос невыбрать с неограниченной длиной
			НаборЗаписей = РегистрыСведений.ЛБ_РеквизитыОбъектаЗалога.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(СтрТЗ.ОперацияЗайма);
			НаборЗаписей.Прочитать();
			
			Для каждого СтрНЗ Из НаборЗаписей Цикл
				
				Если СтрНЗ.ОбъектЗалога <> СтрТЗ.ОбъектЗалога Тогда
					Продолжить;
				КонецЕсли;
				
				СтрТЗ.ОписаниеИзделия = СтрНЗ.ОписаниеИзделия;
				
			КонецЦикла;
			//-МАН
			
			СтрТЗ.Отклонения = ПолучитьОтклонениеПоОЗ(СтрТЗ.ОбъектЗалога);
			
		КонецЦикла;
		//-Мельников
		
		Если НЕ НоваяСтрокаТЧ Тогда
			//+МАН 25.11.24
			Если Остатки Тогда
				Объект.Товары.Загрузить(тз);
			ИначеЕсли НаОХ Тогда
				Объект.НаОХ.Загрузить(тз);
			ИначеЕсли Изъятые Тогда
				Объект.Изъятые.Загрузить(тз);
			ИначеЕсли СумкаЗакрыта Тогда
				Объект.СумкаЗакрыта.Загрузить(тз);
			ИначеЕсли НовыеОЗ Тогда
				Объект.НовыеОЗ.Загрузить(тз);
			ИначеЕсли ОбновитьНовыеОЗ Тогда
				Если тз.Количество() > 0 Тогда
					
					МассивУдаляемыхСтрок = Новый Массив;
					
					Для каждого СтрТЗ Из тз Цикл
						
						Отбор = Новый Структура;
						Отбор.Вставить("ОбъектЗалога", СтрТЗ.ОбъектЗалога);
						Отбор.Вставить("Артикул", СтрТЗ.Артикул);
						
						МассивНайденныхОЗ = Объект.НовыеОЗ.НайтиСтроки(Отбор);
						
						Если МассивНайденныхОЗ.Количество() > 0 Тогда
							МассивУдаляемыхСтрок.Добавить(СтрТЗ);
							Продолжить;
						КонецЕсли;
						
						НоваяСтр = Объект.НовыеОЗ.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтр, СтрТЗ);
						
					КонецЦикла;
					
					Если МассивУдаляемыхСтрок.Количество() > 0 Тогда
						Для каждого СтрМассива Из МассивУдаляемыхСтрок Цикл
							тз.Удалить(СтрМассива);
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			//-МАН
		Иначе
			Если тз.Количество() > 0 Тогда
				Для каждого СтрТЗ Из тз Цикл
					НоваяСтр = Объект.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтр, СтрТЗ)
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		МассивОЗ = тз.ВыгрузитьКолонку("ОбъектЗалога");
		
		ЗапросВставки = Новый Запрос;
		ЗапросВставки.Текст ="ВЫБРАТЬ
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Период КАК Период,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Регистратор КАК Регистратор,
		//|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.НомерСтроки КАК НомерСтроки,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Активность КАК Активность,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки КАК ВидВставки,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ФормаОгранки КАК ФормаОгранки,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидОгранки КАК ВидОгранки,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.КачествоОгранки КАК КачествоОгранки,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Длина КАК Длина,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Ширина КАК Ширина,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Высота КАК Высота,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Диаметр КАК Диаметр,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Диаметр1 КАК Диаметр1,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Диаметр2 КАК Диаметр2,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Вес КАК Вес,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВесГраммы КАК ВесГраммы,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Цена КАК Цена,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Количество КАК Количество,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.СуммаОценки КАК Сумма,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки КАК ВидВставкиФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ФормаОгранки КАК ФормаОгранкиФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидОгранки КАК ВидОгранкиФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.КачествоОгранки КАК КачествоОгранкиФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Длина КАК ДлинаФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Ширина КАК ШиринаФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Высота КАК ВысотаФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Диаметр КАК ДиаметрФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Диаметр1 КАК Диаметр1Факт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Диаметр2 КАК Диаметр2Факт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмеренияФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Вес КАК ВесФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВесГраммы КАК ВесГраммыФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Цена КАК ЦенаФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Количество КАК КоличествоФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаФакт,
		//+Мельников 16.10.24 Инвентаризация. Заявка 2464
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.НеОценивать КАК НеОценивать,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.НеОценивать КАК НеОцениватьФакт,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки) = ТИП(Справочник.ЛБ_ДрагоценныеКамни)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыКомплектующихИзделия.Вставка)
		|		КОГДА ТИПЗНАЧЕНИЯ(ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки) = ТИП(Справочник.ЛБ_КомплектующиеИзделия)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыКомплектующихИзделия.Комплектующее)
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Вид
		//-Мельников
		|ИЗ
		|	РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(100 = 100, ОбъектЗалога В (&МассивОЗ)) КАК ЛБ_ВставкиОбъектаЗалогаСрезПоследних
		|ГДЕ
		|	200 = 200
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ,
		|	НомерСтрокиТаблицы";
		
		Если Остатки ИЛИ НаОХ ИЛИ Изъятые ИЛИ СумкаЗакрыта Тогда
			ЗапросВставки.Текст = СтрЗаменить(ЗапросВставки.Текст, "100 = 100", "&НаДату");
			
			ЗапросВставки.УстановитьПараметр("НаДату", НачалоДня(Объект.Дата)); 
		ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
			ЗапросВставки.Текст = СтрЗаменить(ЗапросВставки.Текст, "100 = 100", "&ПоДату");
			ЗапросВставки.Текст = СтрЗаменить(ЗапросВставки.Текст, "200 = 200", "ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Период МЕЖДУ &СДаты И &ПоДату");
			
			ЗапросВставки.УстановитьПараметр("СДаты", НачалоДня(Объект.Дата)); 
			ЗапросВставки.УстановитьПараметр("ПоДату", ТекущаяДата()); 
		КонецЕсли;
		
		ЗапросВставки.УстановитьПараметр("МассивОЗ", МассивОЗ); 
		
		Если НЕ НоваяСтрокаТЧ ИЛИ НЕ ОбновитьНовыеОЗ Тогда
			//+МАН 25.11.24
			Если Остатки Тогда
				Объект.ВставкиФакт.Очистить();
			ИначеЕсли НаОХ Тогда
				Объект.ВставкиКамнейНаОХ.Очистить();
			ИначеЕсли Изъятые Тогда
				Объект.ВставкиКамнейИзъятые.Очистить();
			ИначеЕсли СумкаЗакрыта Тогда
				Объект.ВставкиКамнейСумкаЗакрыта.Очистить();
			ИначеЕсли НовыеОЗ Тогда
				Объект.ВставкиКамнейНовыеОЗ.Очистить();
			КонецЕсли;
			//-МАН
		КонецЕсли;
		
		//+Мельников 20.05.24
		ТзВствки = ЗапросВставки.Выполнить().Выгрузить();
		//-Мельников
		
		КоличествоВставок = 0;
		КоличествоЗагруженныхВставок = 0;
		
		ВыборкаВставки = ЗапросВставки.Выполнить().Выбрать();
		Пока ВыборкаВставки.Следующий() Цикл
			//+МАН 25.11.24
			Если Остатки Тогда
				КоличествоВставок = КоличествоВставок(ВыборкаВставки.ОбъектЗалога, НачалоДня(Объект.Дата));
				КоличествоЗагруженныхВставок = КоличествоЗагруженныхВставок(ВыборкаВставки.ОбъектЗалога, "ВставкиФакт");
				
				Если КоличествоЗагруженныхВставок <> КоличествоВставок Тогда
					НовСтрВставки = Объект.ВставкиФакт.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставки, ВыборкаВставки);
				Иначе
					Продолжить;
				КонецЕсли;
			ИначеЕсли НаОХ Тогда
				КоличествоВставок = КоличествоВставок(ВыборкаВставки.ОбъектЗалога, НачалоДня(Объект.Дата));
				КоличествоЗагруженныхВставок = КоличествоЗагруженныхВставок(ВыборкаВставки.ОбъектЗалога, "ВставкиКамнейНаОХ");
				
				Если КоличествоЗагруженныхВставок <> КоличествоВставок Тогда
					НовСтрВставки = Объект.ВставкиКамнейНаОХ.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставки, ВыборкаВставки);	
				Иначе
					Продолжить;
				КонецЕсли;
			ИначеЕсли Изъятые Тогда
				КоличествоВставок = КоличествоВставок(ВыборкаВставки.ОбъектЗалога, НачалоДня(Объект.Дата));
				КоличествоЗагруженныхВставок = КоличествоЗагруженныхВставок(ВыборкаВставки.ОбъектЗалога, "ВставкиКамнейИзъятые");
				
				Если КоличествоЗагруженныхВставок <> КоличествоВставок Тогда
					НовСтрВставки = Объект.ВставкиКамнейИзъятые.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставки, ВыборкаВставки);	
				Иначе
					Продолжить;
				КонецЕсли;
			ИначеЕсли СумкаЗакрыта Тогда
				КоличествоВставок = КоличествоВставок(ВыборкаВставки.ОбъектЗалога, НачалоДня(Объект.Дата));
				КоличествоЗагруженныхВставок = КоличествоЗагруженныхВставок(ВыборкаВставки.ОбъектЗалога, "ВставкиКамнейСумкаЗакрыта");
				
				Если КоличествоЗагруженныхВставок <> КоличествоВставок Тогда
					НовСтрВставки = Объект.ВставкиКамнейСумкаЗакрыта.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставки, ВыборкаВставки);	
				Иначе
					Продолжить;
				КонецЕсли;
			ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
				КоличествоВставок = КоличествоВставок(ВыборкаВставки.ОбъектЗалога, НачалоДня(Объект.Дата), Истина);
				КоличествоЗагруженныхВставок = КоличествоЗагруженныхВставок(ВыборкаВставки.ОбъектЗалога, "ВставкиКамнейНовыеОЗ");
				
				Если КоличествоЗагруженныхВставок <> КоличествоВставок Тогда
					НовСтрВставки = Объект.ВставкиКамнейНовыеОЗ.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставки, ВыборкаВставки);	
				Иначе
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			//-МАН
		КонецЦикла;
		
		//+Мельников 17.05.24 Добавлен поиск вставок металла
		ЗапросВставкиМеталла = Новый Запрос;
		ЗапросВставкиМеталла.Текст ="ВЫБРАТЬ
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ВесЧистый КАК Вес,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ВесВПробеЧистоты КАК ВесВПробеЧистоты,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценки,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.Проба КАК ПробаФакт,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесФакт,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ВесВПробеЧистоты КАК ВесВПробеЧистотыФакт,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмеренияФакт,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценкиФакт
		|ИЗ
		|	РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(
		|			100 = 100,
		|			ОбъектЗалога В (&МассивОЗ)
		|				И НомерСтрокиТаблицы <> 0) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних
		|ГДЕ
		|	200 = 200";
		Если Остатки ИЛИ НаОХ ИЛИ Изъятые ИЛИ СумкаЗакрыта Тогда
			ЗапросВставкиМеталла.Текст = СтрЗаменить(ЗапросВставкиМеталла.Текст, "100 = 100", "&НаДату");
			
			ЗапросВставкиМеталла.УстановитьПараметр("НаДату", НачалоДня(Объект.Дата)); 
		ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
			ЗапросВставкиМеталла.Текст = СтрЗаменить(ЗапросВставкиМеталла.Текст, "100 = 100", "&ПоДату");
			ЗапросВставкиМеталла.Текст = СтрЗаменить(ЗапросВставкиМеталла.Текст, "200 = 200", "ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.Период МЕЖДУ &СДаты И &ПоДату");
			
			ЗапросВставкиМеталла.УстановитьПараметр("СДаты", НачалоДня(Объект.Дата)); 
			ЗапросВставкиМеталла.УстановитьПараметр("ПоДату", ТекущаяДата()); 
		КонецЕсли;
		
		ЗапросВставкиМеталла.УстановитьПараметр("МассивОЗ", МассивОЗ); 
		
		Если НЕ НоваяСтрокаТЧ ИЛИ НЕ ОбновитьНовыеОЗ Тогда
			//+МАН 25.11.24
			Если Остатки Тогда
				Объект.ВставкиМеталла.Очистить();
			ИначеЕсли НаОХ Тогда
				Объект.ВставкиМеталлаНаОХ.Очистить();
			ИначеЕсли Изъятые Тогда
				Объект.ВставкиМеталлаИзъятые.Очистить();
			ИначеЕсли СумкаЗакрыта Тогда
				Объект.ВставкиМеталлаСумкаЗакрыта.Очистить();
			ИначеЕсли НовыеОЗ Тогда
				Объект.ВставкиМеталлаНовыеОЗ.Очистить();
			КонецЕсли;
			//-МАН
		КонецЕсли;
		
		ТзВствкиМеталла = ЗапросВставкиМеталла.Выполнить().Выгрузить();
		
		КоличествоВставокМеталла = 0;
		КоличествоЗагруженныхВставокМеталла = 0;
		
		ВыборкаВставкиМеталла = ЗапросВставкиМеталла.Выполнить().Выбрать();
		Пока ВыборкаВставкиМеталла.Следующий() Цикл
			//+МАН 25.11.24
			Если Остатки Тогда
				КоличествоВставокМеталла = КоличествоВставокМеталла(ВыборкаВставкиМеталла.ОбъектЗалога, НачалоДня(Объект.Дата));
				КоличествоЗагруженныхВставокМеталла = КоличествоЗагруженныхВставок(ВыборкаВставкиМеталла.ОбъектЗалога, "ВставкиМеталла");
				
				Если КоличествоЗагруженныхВставокМеталла <> КоличествоВставокМеталла Тогда
					НовСтрВставкиМеталла = Объект.ВставкиМеталла.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставкиМеталла, ВыборкаВставкиМеталла);	
				Иначе
					Продолжить;
				КонецЕсли;
			ИначеЕсли НаОХ Тогда
				КоличествоВставокМеталла = КоличествоВставокМеталла(ВыборкаВставкиМеталла.ОбъектЗалога, НачалоДня(Объект.Дата));
				КоличествоЗагруженныхВставокМеталла = КоличествоЗагруженныхВставок(ВыборкаВставкиМеталла.ОбъектЗалога, "ВставкиМеталлаНаОХ");
				
				Если КоличествоЗагруженныхВставокМеталла <> КоличествоВставокМеталла Тогда
					НовСтрВставкиМеталла = Объект.ВставкиМеталлаНаОХ.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставкиМеталла, ВыборкаВставкиМеталла);	
				Иначе
					Продолжить;
				КонецЕсли;
			ИначеЕсли Изъятые Тогда
				КоличествоВставокМеталла = КоличествоВставокМеталла(ВыборкаВставкиМеталла.ОбъектЗалога, НачалоДня(Объект.Дата));
				КоличествоЗагруженныхВставокМеталла = КоличествоЗагруженныхВставок(ВыборкаВставкиМеталла.ОбъектЗалога, "ВставкиМеталлаИзъятые");
				
				Если КоличествоЗагруженныхВставокМеталла <> КоличествоВставокМеталла Тогда
					НовСтрВставкиМеталла = Объект.ВставкиМеталлаИзъятые.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставкиМеталла, ВыборкаВставкиМеталла);	
				Иначе
					Продолжить;
				КонецЕсли;
			ИначеЕсли СумкаЗакрыта Тогда
				КоличествоВставокМеталла = КоличествоВставокМеталла(ВыборкаВставкиМеталла.ОбъектЗалога, НачалоДня(Объект.Дата));
				КоличествоЗагруженныхВставокМеталла = КоличествоЗагруженныхВставок(ВыборкаВставкиМеталла.ОбъектЗалога, "ВставкиМеталлаСумкаЗакрыта");
				
				Если КоличествоЗагруженныхВставокМеталла <> КоличествоВставокМеталла Тогда
					НовСтрВставкиМеталла = Объект.ВставкиМеталлаСумкаЗакрыта.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставкиМеталла, ВыборкаВставкиМеталла);	
				Иначе
					Продолжить;
				КонецЕсли;
			ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
				КоличествоВставокМеталла = КоличествоВставокМеталла(ВыборкаВставкиМеталла.ОбъектЗалога, НачалоДня(Объект.Дата), Истина);
				КоличествоЗагруженныхВставокМеталла = КоличествоЗагруженныхВставок(ВыборкаВставкиМеталла.ОбъектЗалога, "ВставкиМеталлаНовыеОЗ");
				
				Если КоличествоЗагруженныхВставокМеталла <> КоличествоВставокМеталла Тогда
					НовСтрВставкиМеталла = Объект.ВставкиМеталлаНовыеОЗ.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставкиМеталла, ВыборкаВставкиМеталла);	
				Иначе
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			//-МАН
		КонецЦикла;
		
		//+МАН 26.03.25
		Если Остатки Тогда
			ТЧВставки = Объект.ВставкиФакт;
			ТЧВставкиМеталла = Объект.ВставкиМеталла;
		ИначеЕсли НаОХ Тогда
			ТЧВставки = Объект.ВставкиКамнейНаОХ;
			ТЧВставкиМеталла = Объект.ВставкиМеталлаНаОХ;
		ИначеЕсли Изъятые Тогда
			ТЧВставки = Объект.ВставкиКамнейИзъятые;
			ТЧВставкиМеталла = Объект.ВставкиМеталлаИзъятые;
		ИначеЕсли СумкаЗакрыта Тогда
			ТЧВставки = Объект.ВставкиКамнейСумкаЗакрыта;
			ТЧВставкиМеталла = Объект.ВставкиМеталлаСумкаЗакрыта;
		ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
			ТЧВставки = Объект.ВставкиКамнейНовыеОЗ;
			ТЧВставкиМеталла = Объект.ВставкиМеталлаНовыеОЗ;
		КонецЕсли;
		//-МАН
		
		Для каждого СтрОЗВставка Из ТЧВставки Цикл //ТзВствки Цикл
			
			Отбор = Новый Структура;
			Отбор.Вставить("ОбъектЗалога",СтрОЗВставка.ОбъектЗалога);
			
			//+МАН 25.11.24
			Если Остатки Тогда
				НайденныйОЗ = Объект.Товары.НайтиСтроки(Отбор);
			ИначеЕсли НаОХ Тогда
				НайденныйОЗ = Объект.НаОХ.НайтиСтроки(Отбор);
			ИначеЕсли Изъятые Тогда
				НайденныйОЗ = Объект.Изъятые.НайтиСтроки(Отбор);
			ИначеЕсли СумкаЗакрыта Тогда
				НайденныйОЗ = Объект.СумкаЗакрыта.НайтиСтроки(Отбор);
			ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
				НайденныйОЗ = Объект.НовыеОЗ.НайтиСтроки(Отбор);
			КонецЕсли;
			//-МАН
			
			Для каждого СтрОЗНайденный Из НайденныйОЗ Цикл
				СтрОЗНайденный.Вставка = ?(СтрОЗНайденный.Вставка = "", СтрОЗНайденный.Вставка, СтрОЗНайденный.Вставка + ", ") + СтрОЗВставка.ВидВставки.КраткоеНаименование;
			КонецЦикла;
		КонецЦикла;
		
		Для каждого СтрОЗВставкаМеталла Из ТЧВставкиМеталла Цикл //ТзВствкиМеталла Цикл
			
			Отбор = Новый Структура;
			Отбор.Вставить("ОбъектЗалога",СтрОЗВставкаМеталла.ОбъектЗалога);
			
			//+МАН 25.11.24
			Если Остатки Тогда
				НайденныйОЗ = Объект.Товары.НайтиСтроки(Отбор);
			ИначеЕсли НаОХ Тогда
				НайденныйОЗ = Объект.НаОХ.НайтиСтроки(Отбор);
			ИначеЕсли Изъятые Тогда
				НайденныйОЗ = Объект.Изъятые.НайтиСтроки(Отбор);
			ИначеЕсли СумкаЗакрыта Тогда
				НайденныйОЗ = Объект.СумкаЗакрыта.НайтиСтроки(Отбор);
			ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
				НайденныйОЗ = Объект.НовыеОЗ.НайтиСтроки(Отбор);
			КонецЕсли;
			//-МАН
			
			Для каждого СтрОЗНайденный Из НайденныйОЗ Цикл
				СтрОЗНайденный.Вставка = ?(СтрОЗНайденный.Вставка = "", СтрОЗНайденный.Вставка, СтрОЗНайденный.Вставка + ", ") + СтрОЗВставкаМеталла.Проба.Наименование;
			КонецЦикла;
		КонецЦикла;
		//-Мельников
		
		//+МАН 25.11.24
		Если Остатки Тогда
			ЗаполнитьПоОстаткамОбъектовЗалога(,Истина);
			ЗаполнитьПоОстаткамОбъектовЗалога(,,Истина);
			ЗаполнитьПоОстаткамОбъектовЗалога(,,,Истина);
		КонецЕсли;
		//-МАН
	КонецЕсли;
КонецПроцедуры
//+МАН 24.02.25 Пока оставил старую процедуру
Процедура ЗаполнитьПоОстаткамОбъектовЗалогаСтарая_(Остатки = Ложь, НаОХ = Ложь, Изъятые = Ложь, СумкаЗакрыта = Ложь, НовыеОЗ = Ложь, ОбновитьНовыеОЗ = Ложь)
	
	СкладВитринаНеЦО = СтрНайти(Объект.Склад, "Витрина") > 0 И Объект.Ломбард <> Справочники.ЛБ_Ломбарды.ЦентральныйОфис;
	
	ЦО = Объект.Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис;
	
	Если Остатки ИЛИ НовыеОЗ ИЛИ ОбновитьНовыеОЗ ИЛИ ЦО ИЛИ ((НаОХ ИЛИ Изъятые ИЛИ СумкаЗакрыта) И НЕ СкладВитринаНеЦО) Тогда
	
		Если ((Остатки И НЕ СкладВитринаНеЦО) ИЛИ СумкаЗакрыта) И НЕ ЦО Тогда
			Условие = "ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_СтатусыОбъектовЗалогаВНакладной.СрезПоследних(&НаДату, ) КАК ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних
			|		ПО (ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ОбъектЗалога)" + Символы.ПС;
		Иначе
			Условие = "";
		КонецЕсли;
		
		Если СумкаЗакрыта И НЕ ЦО Тогда
			УсловиеСумка = "ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СостоянияОбъектовЗалога.ОбъектЗалога.Код,
			|	СостоянияОбъектовЗалога.ОбъектЗалога,
			|	РеквизитыОбъектаЗалога.Артикул,
			|	СостоянияОбъектовЗалога.СтатусОбъектаЗалога,
			|	РеквизитыОбъектаЗалога.ЕдиницаИзмерения,
			|	ЛБ_ОбъектыЗалогаОстатки.КоличествоПриход,
			|	ЛБ_ОбъектыЗалогаОстатки.КоличествоПриход,
			|	СостоянияОбъектовЗалога.СуммаОценкиНачальная,
			|	СостоянияОбъектовЗалога.СуммаОценкиНачальная,
			|	РеквизитыОбъектаЗалога.ВидИзделия,
			|	РеквизитыОбъектаЗалога.ВидИзделия,
			|	РеквизитыОбъектаЗалога.Проба,
			|	РеквизитыОбъектаЗалога.Проба,
			|	РеквизитыОбъектаЗалога.Категория,
			|	РеквизитыОбъектаЗалога.Категория,
			|	РеквизитыОбъектаЗалога.Вес,
			|	РеквизитыОбъектаЗалога.Вес,
			|	РеквизитыОбъектаЗалога.ВесЧистый,
			|	РеквизитыОбъектаЗалога.ВесЧистый,
			|	РеквизитыОбъектаЗалога.Проба.Владелец,
			|	РеквизитыОбъектаЗалога.Проба.Владелец,
			|	СостоянияОбъектовЗалога.ЗалоговыйБилет.Залогодатель,
			|	СостоянияОбъектовЗалога.ЗалоговыйБилет.Дата,
			|	СостоянияОбъектовЗалога.ЗалоговыйБилет.ОтветственныйСотрудник,
			|	РеквизитыОбъектаЗалога.Клеймо,
			|	РеквизитыОбъектаЗалога.Клеймо,
			|	РеквизитыОбъектаЗалога.Именник,
			|	РеквизитыОбъектаЗалога.Именник,
			|	РеквизитыОбъектаЗалога.ДанныеИменника,
			|	РеквизитыОбъектаЗалога.ДанныеИменника,
			|	СостоянияОбъектовЗалога.ЗалоговыйБилет,
			|	РасчетыСКлиентамиПоОбъектамЗалога.СуммаОстаток,
			|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы,
			|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы,
			|	РеквизитыОбъектаЗалога.НомерСтрокиТаблицы,
			|	СостоянияОбъектовЗалога.СуммаЗайма,
			|	СостоянияОбъектовЗалога.СуммаДолгаЗайма,
			|	РеквизитыОбъектаЗалога.СостояниеИзделия,
			|	РеквизитыОбъектаЗалога.Дефекты,
			|	РеквизитыОбъектаЗалога.Вес30,
			|	РеквизитыОбъектаЗалога.СуммаОценкиМакс
			|ИЗ
			|	РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(
			|			&НаДату,
			|			500 = 500
			|			И 750 = 750
			|			И 760 = 760
			|			И 770 = 770) КАК СостоянияОбъектовЗалога
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
			|				&НаДату,
			|				Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|					И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|					И НЕ Регистратор В
			|							(ВЫБРАТЬ
			|								ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			|							ИЗ
			|								РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&НаДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			|							ГДЕ
			|								ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))) КАК РеквизитыОбъектаЗалога
			|		ПО (СостоянияОбъектовЗалога.ОбъектЗалога = РеквизитыОбъектаЗалога.ОбъектЗалога)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЛБ_ОбъектыЗалога.Обороты(, &НаДату, Регистратор, ) КАК ЛБ_ОбъектыЗалогаОстатки
			|		ПО (СостоянияОбъектовЗалога.ОбъектЗалога = ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Остатки(&НаДату, ) КАК РасчетыСКлиентамиПоОбъектамЗалога
			|		ПО (СостоянияОбъектовЗалога.ОбъектЗалога = РасчетыСКлиентамиПоОбъектамЗалога.ОбъектЗалога)
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель КАК Залогодатель,
			|			МАКСИМУМ(ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Период) КАК Период,
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус
			|		ИЗ
			|			РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(
			|					&НаДату,
			|					Используется
			|						И ВЫБОР
			|							КОГДА СрокДействия <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|								ТОГДА ВЫБОР
			|										КОГДА СрокДействия <= &НаДату
			|											ТОГДА ЛОЖЬ
			|										ИНАЧЕ ИСТИНА
			|									КОНЕЦ
			|							ИНАЧЕ ИСТИНА
			|						КОНЕЦ) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель,
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			ЛБ_СтатусыЗалогодателейСрезПоследних.Залогодатель,
			|			ЛБ_СтатусыЗалогодателейСрезПоследних.Период,
			|			ЛБ_СтатусыЗалогодателейСрезПоследних.Статус
			|		ИЗ
			|			РегистрСведений.ЛБ_СтатусыЗалогодателей.СрезПоследних(&НаДату, ) КАК ЛБ_СтатусыЗалогодателейСрезПоследних) КАК СтатусыЗалогодателей
			|		ПО (СостоянияОбъектовЗалога.ЗалоговыйБилет.Залогодатель = СтатусыЗалогодателей.Залогодатель)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(&НаДату, ) КАК ВставкиОЗ
			|		ПО (СостоянияОбъектовЗалога.ОбъектЗалога = ВставкиОЗ.ОбъектЗалога)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(&НаДату, НомерСтрокиТаблицы <> 0) КАК ВставкиМеталла
			|		ПО (СостоянияОбъектовЗалога.ОбъектЗалога = ВставкиМеталла.ОбъектЗалога)
			|ГДЕ
			|	СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ПринятНаСкладСумка)
			|	И СостоянияОбъектовЗалога.Регистратор.ЛомбардКуда = &Ломбард
			|	И СостоянияОбъектовЗалога.Регистратор.СкладПолучатель = &Склад
			|	И ЛБ_ОбъектыЗалогаОстатки.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			|	И 100 = 100
			|	И 200 = 200
			|	И 300 = 300
			|	И 400 = 400
			|	И 600 = 600
			|	И 700 = 700
			|	И 710 = 710
			|	И 720 = 720
			|	И 730 = 730
			|	И 740 = 740
			|	И 780 = 780
			|	И 801 = 801
			|	И 900 = 900
			|	И 444 = 444";
			
		Иначе
			УсловиеСумка = "";
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога.Код КАК ОбъектЗалогаКод,
		|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
		|	РеквизитыОбъектаЗалога.Артикул КАК Артикул,
		|	СостоянияОбъектовЗалога.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
		|	РеквизитыОбъектаЗалога.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток КАК Количество,
		|	ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток КАК КоличествоФакт,
		|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток КАК СуммаОценки,
		|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток КАК СуммаОценкиФакт,
		|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделия,
		|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделияФакт,
		|	РеквизитыОбъектаЗалога.Проба КАК Проба,
		|	РеквизитыОбъектаЗалога.Проба КАК ПробаФакт,
		|	РеквизитыОбъектаЗалога.Категория КАК Категория,
		|	РеквизитыОбъектаЗалога.Категория КАК КатегорияФакт,
		|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМасса,
		|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМассаФакт,
		|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталла,
		|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталлаФакт,
		|	РеквизитыОбъектаЗалога.Проба.Владелец КАК Металл,
		|	РеквизитыОбъектаЗалога.Проба.Владелец КАК МеталлФакт,
		|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель КАК Залогодатель,
		|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Дата КАК ДатаОформленияЗайма,
		|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ОтветственныйСотрудник КАК Приемщик,
		|	РеквизитыОбъектаЗалога.Клеймо КАК Клеймо,
		|	РеквизитыОбъектаЗалога.Клеймо КАК КлеймоФакт,
		|	РеквизитыОбъектаЗалога.Именник КАК Именник,
		|	РеквизитыОбъектаЗалога.Именник КАК ИменникФакт,
		|	РеквизитыОбъектаЗалога.ДанныеИменника КАК ДанныеИменника,
		|	РеквизитыОбъектаЗалога.ДанныеИменника КАК ДанныеИменникаФакт,
		|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ОперацияЗайма,
		|	РасчетыСКлиентамиПоОбъектамЗалога.СуммаОстаток КАК ОстатокЗайма,
		|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
		|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлыФакт,
		|	РеквизитыОбъектаЗалога.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
		|	СостоянияОбъектовЗалога.СуммаЗайма КАК СуммаЗайма,
		|	СостоянияОбъектовЗалога.СуммаДолгаЗайма КАК СуммаДолгаЗайма,
		|	РеквизитыОбъектаЗалога.СостояниеИзделия КАК СостояниеИзделия,
		|	РеквизитыОбъектаЗалога.Дефекты КАК Дефекты,
		|	РеквизитыОбъектаЗалога.Вес30 КАК Вес30,
		|	РеквизитыОбъектаЗалога.СуммаОценкиМакс КАК СуммаОценкиМакс
		|ИЗ
		|	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(
		|			&НаДату,
		|			Ломбард = &Ломбард
		|				И Склад = &Склад
		|				И 500 = 500
		|				И 750 = 750
		|				И 760 = 760
		|				И 770 = 770) КАК ЛБ_ОбъектыЗалогаОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
		|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
		|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаДолгаЗайма КАК СуммаДолгаЗайма
		|		ИЗ
		|			РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(
		|					&НаДату,
		//+МАН 27.01.26
		//|					(Регистратор.Ломбард = &Ломбард
		//|						ИЛИ Регистратор.ЛомбардКуда = &Ломбард)
		//Было:|						И ВЫБОР
		|						ВЫБОР
		//-МАН
		|							КОГДА Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
		|								ТОГДА Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		|										И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		|										И НЕ Регистратор В
		|												(ВЫБРАТЬ
		|													ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
		|												ИЗ
		|													РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&НаДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
		|												ГДЕ
		|													ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))
		|							КОГДА НЕ Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
		|								ТОГДА ИСТИНА
		|						КОНЕЦ) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних) КАК СостоянияОбъектовЗалога
		|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = СостоянияОбъектовЗалога.ОбъектЗалога
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Клеймо КАК Клеймо,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК Вес,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесЧистый,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Именник КАК Именник,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ДанныеИменника КАК ДанныеИменника,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СостояниеИзделия КАК СостояниеИзделия,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Дефекты КАК Дефекты,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОписаниеИзделия КАК ОписаниеИзделия,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес30 КАК Вес30,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМакс КАК СуммаОценкиМакс,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет
		|		ИЗ
		|			РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
		|					&НаДату,
		|					Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		|						И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		|						И НЕ Регистратор В
		|								(ВЫБРАТЬ
		|									ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
		|								ИЗ
		|									РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&НаДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
		|								ГДЕ
		|									ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних) КАК РеквизитыОбъектаЗалога
		|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РеквизитыОбъектаЗалога.ОбъектЗалога
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
		|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки.СуммаОстаток КАК СуммаОстаток
		|		ИЗ
		|			РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Остатки(&НаДату, ) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки) КАК РасчетыСКлиентамиПоОбъектамЗалога
		|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РасчетыСКлиентамиПоОбъектамЗалога.ОбъектЗалога
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель КАК Залогодатель,
		|			МАКСИМУМ(ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Период) КАК Период,
		|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус
		|		ИЗ
		|			РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(
		|					&НаДату,
		|					Используется
		|						И ВЫБОР
		|							КОГДА СрокДействия <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|								ТОГДА ВЫБОР
		|										КОГДА СрокДействия <= &НаДату
		|											ТОГДА ЛОЖЬ
		|										ИНАЧЕ ИСТИНА
		|									КОНЕЦ
		|							ИНАЧЕ ИСТИНА
		|						КОНЕЦ) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель,
		|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ЛБ_СтатусыЗалогодателейСрезПоследних.Залогодатель,
		|			ЛБ_СтатусыЗалогодателейСрезПоследних.Период,
		|			ЛБ_СтатусыЗалогодателейСрезПоследних.Статус
		|		ИЗ
		|			РегистрСведений.ЛБ_СтатусыЗалогодателей.СрезПоследних(&НаДату, ) КАК ЛБ_СтатусыЗалогодателейСрезПоследних) КАК СтатусыЗалогодателей
		|		ПО ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель = СтатусыЗалогодателей.Залогодатель
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Период КАК Период,
		|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки КАК ВидВставки
		|		ИЗ
		|			РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(&НаДату, ) КАК ЛБ_ВставкиОбъектаЗалогаСрезПоследних) КАК ВставкиОЗ
		|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиОЗ.ОбъектЗалога
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога
		|		ИЗ
		|			РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(&НаДату, НомерСтрокиТаблицы <> 0) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних) КАК ВставкиМеталла
		|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиМеталла.ОбъектЗалога"
		+ Символы.ПС + Условие
		+ "ГДЕ
		|	ИСТИНА
		|	И ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет = РеквизитыОбъектаЗалога.ЗалоговыйБилет
		|	И 100 = 100
		|	И 200 = 200
		|	И 300 = 300
		|	И 400 = 400
		|	И 600 = 600
		|	И 700 = 700
		|	И 710 = 710
		|	И 720 = 720
		|	И 730 = 730
		|	И 740 = 740
		|	И 780 = 780
		|	И 800 = 800
		|	И 900 = 900
		|	И 444 = 444
		|	И 999 = 999"
		+ Символы.ПС + УсловиеСумка + Символы.ПС
		+ "УПОРЯДОЧИТЬ ПО
		|	Артикул";
		
		Запрос.УстановитьПараметр("НаДату", НачалоДня(Объект.Дата));    
		Запрос.УстановитьПараметр("Ломбард", Объект.Ломбард); 
		//+МАН 17.12.25
		Запрос.УстановитьПараметр("Склад", Объект.Склад);
		//-МАН
		
		//+МАН 21.11.24 Добавлены новые условия
		Если Остатки Тогда
			
			УсловиеСклад = "";
			
			СтатусыВхождения = Новый Массив;
			
			Если СкладВитринаНеЦО Тогда
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ПринятНаСклад);
			ИначеЕсли ЦО Тогда
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ПринятНаСклад);
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.Возвращен);
			Иначе
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.Принят);
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.Продлен);
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.Возвращен);
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ВключенВНакладную);
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ОбъявленТорг);
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ПринятНаСклад);
				
				УсловиеСклад = "И (ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус ЕСТЬ NULL
				|			ИЛИ ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.Факт)
				|			ИЛИ ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.СумкаОткрыта)
				|			ИЛИ ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.ИсключенИзНакладной)
				|			ИЛИ ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.Отгружено))";

			КонецЕсли;
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "999 = 999", "ВЫБОР
			|			КОГДА СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Наследство)
			|					И РасчетыСКлиентамиПоОбъектамЗалога.СуммаОстаток > 0
			|				ТОГДА ИСТИНА
			|			КОГДА СостоянияОбъектовЗалога.СтатусОбъектаЗалога В (&СтатусыВхождения)
			//|					И (СтатусыОЗВНакладной.Статус В (&СтатусВНакладнойВхождение)
			//|						ИЛИ СтатусыОЗВНакладной.Статус ЕСТЬ NULL)
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ЛОЖЬ
			|		КОНЕЦ" + Символы.ПС + УсловиеСклад);
			//|	И (ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус ЕСТЬ NULL
			//|			ИЛИ ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.Факт)
			//|			ИЛИ ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.СумкаОткрыта)
			//|			ИЛИ ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.ИсключенИзНакладной)
			//|			ИЛИ ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.Отгружено))");
			
			Запрос.УстановитьПараметр("СтатусыВхождения", СтатусыВхождения);
			
		ИначеЕсли НаОХ Тогда
			
			Если ЦО Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "999 = 999", "ВЫБОР
				|			КОГДА СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ГотовКОтправкеОХ)
				//|					ИЛИ СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ПринятНаСклад))
				|					И РасчетыСКлиентамиПоОбъектамЗалога.СуммаОстаток ЕСТЬ NULL
				|				ТОГДА ИСТИНА
				|			ИНАЧЕ ЛОЖЬ
				|		КОНЕЦ");
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "999 = 999", "ВЫБОР
				|			КОГДА (СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Наследство)
				|					ИЛИ СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ПринятНаСклад))
				|					И РасчетыСКлиентамиПоОбъектамЗалога.СуммаОстаток ЕСТЬ NULL
				|				ТОГДА ИСТИНА
				|			КОГДА СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение)
				|				ТОГДА ИСТИНА
				|			ИНАЧЕ ЛОЖЬ
				|		КОНЕЦ");
			КонецЕсли;
			
		ИначеЕсли Изъятые Тогда
			
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога.Код КАК ОбъектЗалогаКод,
			|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
			|	РеквизитыОбъектаЗалога.Артикул КАК Артикул,
			|	СостоянияОбъектовЗалога.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
			|	РеквизитыОбъектаЗалога.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ЛБ_ОбъектыЗалогаОстатки.КоличествоРасход КАК Количество,
			|	ЛБ_ОбъектыЗалогаОстатки.КоличествоРасход КАК КоличествоФакт,
			|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиРасход КАК СуммаОценки,
			|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиРасход КАК СуммаОценкиФакт,
			|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделия,
			|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделияФакт,
			|	РеквизитыОбъектаЗалога.Проба КАК Проба,
			|	РеквизитыОбъектаЗалога.Проба КАК ПробаФакт,
			|	РеквизитыОбъектаЗалога.Категория КАК Категория,
			|	РеквизитыОбъектаЗалога.Категория КАК КатегорияФакт,
			|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМасса,
			|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМассаФакт,
			|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталла,
			|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталлаФакт,
			|	РеквизитыОбъектаЗалога.Проба.Владелец КАК Металл,
			|	РеквизитыОбъектаЗалога.Проба.Владелец КАК МеталлФакт,
			|	РеквизитыОбъектаЗалога.Клеймо КАК Клеймо,
			|	РеквизитыОбъектаЗалога.Клеймо КАК КлеймоФакт,
			|	РеквизитыОбъектаЗалога.Именник КАК Именник,
			|	РеквизитыОбъектаЗалога.Именник КАК ИменникФакт,
			|	РеквизитыОбъектаЗалога.ДанныеИменника КАК ДанныеИменника,
			|	РеквизитыОбъектаЗалога.ДанныеИменника КАК ДанныеИменникаФакт,
			|	РасчетыСКлиентамиПоОбъектамЗалога.СуммаОстаток КАК ОстатокЗайма,
			|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
			|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлыФакт,
			|	РеквизитыОбъектаЗалога.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
			|	СостоянияОбъектовЗалога.СуммаЗайма КАК СуммаЗайма,
			|	СостоянияОбъектовЗалога.СуммаДолгаЗайма КАК СуммаДолгаЗайма,
			|	РеквизитыОбъектаЗалога.СостояниеИзделия КАК СостояниеИзделия,
			|	РеквизитыОбъектаЗалога.Дефекты КАК Дефекты,
			|	РеквизитыОбъектаЗалога.Вес30 КАК Вес30,
			|	РеквизитыОбъектаЗалога.СуммаОценкиМакс КАК СуммаОценкиМакс,
			|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель КАК Залогодатель,
			|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Дата КАК ДатаОформленияЗайма,
			|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ОтветственныйСотрудник КАК Приемщик,
			|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ОперацияЗайма
			|ИЗ
			|	РегистрНакопления.ЛБ_ОбъектыЗалога.Обороты(
			|			,
			|			&НаДату,
			|			Регистратор,
			|			Ломбард = &Ломбард
			|				И Склад = &Склад
			|				И 500 = 500
			|				И 750 = 750
			|				И 760 = 760
			|				И 770 = 770) КАК ЛБ_ОбъектыЗалогаОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
			|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
			|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаДолгаЗайма КАК СуммаДолгаЗайма,
			|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет
			|		ИЗ
			|			РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(
			|					&НаДату,
			|					(Регистратор.Ломбард = &Ломбард
			|						ИЛИ Регистратор.ЛомбардКуда = &Ломбард)
			|						И ВЫБОР
			|							КОГДА Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			|								ТОГДА Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|											И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|											И НЕ Регистратор В
			|													(ВЫБРАТЬ
			|														ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			|													ИЗ
			|														РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&НаДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			|													ГДЕ
			|														ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))
			|							КОГДА НЕ Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			|								ТОГДА ИСТИНА
			|						КОНЕЦ) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних
			|		ГДЕ
			|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Изъят)) КАК СостоянияОбъектовЗалога
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = СостоянияОбъектовЗалога.ОбъектЗалога
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Клеймо КАК Клеймо,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК Вес,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесЧистый,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Именник КАК Именник,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ДанныеИменника КАК ДанныеИменника,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СостояниеИзделия КАК СостояниеИзделия,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Дефекты КАК Дефекты,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОписаниеИзделия КАК ОписаниеИзделия,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес30 КАК Вес30,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМакс КАК СуммаОценкиМакс,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет
			|		ИЗ
			|			РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
			|					&НаДату,
			|					Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|						И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|						И НЕ Регистратор В
			|								(ВЫБРАТЬ
			|									ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			|								ИЗ
			|									РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&НаДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			|								ГДЕ
			|									ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних) КАК РеквизитыОбъектаЗалога
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РеквизитыОбъектаЗалога.ОбъектЗалога
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
			|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки.СуммаОстаток КАК СуммаОстаток
			|		ИЗ
			|			РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Остатки(&НаДату, ) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки) КАК РасчетыСКлиентамиПоОбъектамЗалога
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РасчетыСКлиентамиПоОбъектамЗалога.ОбъектЗалога
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель КАК Залогодатель,
			|			МАКСИМУМ(ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Период) КАК Период,
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус
			|		ИЗ
			|			РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(
			|					&НаДату,
			|					Используется
			|						И ВЫБОР
			|							КОГДА СрокДействия <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|								ТОГДА ВЫБОР
			|										КОГДА СрокДействия <= &НаДату
			|											ТОГДА ЛОЖЬ
			|										ИНАЧЕ ИСТИНА
			|									КОНЕЦ
			|							ИНАЧЕ ИСТИНА
			|						КОНЕЦ) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель,
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			ЛБ_СтатусыЗалогодателейСрезПоследних.Залогодатель,
			|			ЛБ_СтатусыЗалогодателейСрезПоследних.Период,
			|			ЛБ_СтатусыЗалогодателейСрезПоследних.Статус
			|		ИЗ
			|			РегистрСведений.ЛБ_СтатусыЗалогодателей.СрезПоследних(&НаДату, ) КАК ЛБ_СтатусыЗалогодателейСрезПоследних) КАК СтатусыЗалогодателей
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель = СтатусыЗалогодателей.Залогодатель
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Период КАК Период,
			|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки КАК ВидВставки
			|		ИЗ
			|			РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(&НаДату, ) КАК ЛБ_ВставкиОбъектаЗалогаСрезПоследних) КАК ВставкиОЗ
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиОЗ.ОбъектЗалога
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога
			|		ИЗ
			|			РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(&НаДату, НомерСтрокиТаблицы <> 0) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних) КАК ВставкиМеталла
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиМеталла.ОбъектЗалога
			|ГДЕ
			|	ИСТИНА
			|	И ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет = РеквизитыОбъектаЗалога.ЗалоговыйБилет
			|	И ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет = СостоянияОбъектовЗалога.ЗалоговыйБилет
			|	И ЛБ_ОбъектыЗалогаОстатки.КоличествоРасход > 0
			|	И 100 = 100
			|	И 200 = 200
			|	И 300 = 300
			|	И 400 = 400
			|	И 600 = 600
			|	И 700 = 700
			|	И 710 = 710
			|	И 720 = 720
			|	И 730 = 730
			|	И 740 = 740
			|	И 780 = 780
			|	И 800 = 800
			|	И 900 = 900
			|	И 444 = 444
			|	И 999 = 999
			|
			|УПОРЯДОЧИТЬ ПО
			|	Артикул";
			
		ИначеЕсли СумкаЗакрыта Тогда
			
			СтатусыВхождения = Новый Массив;
			
			Если ЦО Тогда
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ПринятНаСкладСумка);
			Иначе
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ВключенВНакладную);
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ОбъявленТорг);
				СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ПринятНаСкладСумка);
			КонецЕсли;
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "999 = 999", "ВЫБОР
			|			КОГДА СостоянияОбъектовЗалога.СтатусОбъектаЗалога В (&СтатусыВхождения)
			//|					И СтатусыОЗВНакладной.Статус В (&СтатусВНакладнойВхождение)
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ЛОЖЬ
			|		КОНЕЦ"
			+ ?(ЦО, "", Символы.ПС
			+ "	И ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.СумкаЗакрыта)"));
			
			Запрос.УстановитьПараметр("СтатусыВхождения", СтатусыВхождения);
			
			//+МАН 24.03.25
		ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
			//+МАН 27.01.26 Пока оставил. Ниже новый.
			//Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			//|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога.Код КАК ОбъектЗалогаКод,
			//|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
			//|	РеквизитыОбъектаЗалога.Артикул КАК Артикул,
			//|	СостоянияОбъектовЗалога.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
			//|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ВидОперации КАК ЗалоговыйБилетВидОперации,
			//|	ЛБ_ОбъектыЗалогаОстатки.Склад КАК Склад,
			//|	РеквизитыОбъектаЗалога.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			//|	ЛБ_ОбъектыЗалогаОстатки.КоличествоКонечныйОстаток КАК Количество,
			//|	ЛБ_ОбъектыЗалогаОстатки.КоличествоКонечныйОстаток КАК КоличествоФакт,
			//|	СостоянияОбъектовЗалога.СуммаЗайма КАК СуммаЗайма,
			//|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиКонечныйОстаток КАК СуммаОценки,
			//|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиКонечныйОстаток КАК СуммаОценкиФакт,
			//|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделия,
			//|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделияФакт,
			//|	РеквизитыОбъектаЗалога.Проба КАК Проба,
			//|	РеквизитыОбъектаЗалога.Проба КАК ПробаФакт,
			//|	РеквизитыОбъектаЗалога.Категория КАК Категория,
			//|	РеквизитыОбъектаЗалога.Категория КАК КатегорияФакт,
			//|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМасса,
			//|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМассаФакт,
			//|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталла,
			//|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталлаФакт,
			//|	РеквизитыОбъектаЗалога.Проба.Владелец КАК Металл,
			//|	РеквизитыОбъектаЗалога.Проба.Владелец КАК МеталлФакт,
			//|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель КАК Залогодатель,
			//|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Дата КАК ДатаОформленияЗайма,
			//|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ОтветственныйСотрудник КАК Приемщик,
			//|	РеквизитыОбъектаЗалога.Клеймо КАК Клеймо,
			//|	РеквизитыОбъектаЗалога.Клеймо КАК КлеймоФакт,
			//|	РеквизитыОбъектаЗалога.Именник КАК Именник,
			//|	РеквизитыОбъектаЗалога.Именник КАК ИменникФакт,
			//|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ОперацияЗайма,
			//|	РасчетыСКлиентамиПоОбъектамЗалога.СуммаКонечныйОстаток КАК ОстатокЗайма,
			//|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
			//|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлыФакт
			//|ИЗ
			//|	РегистрНакопления.ЛБ_ОбъектыЗалога.ОстаткиИОбороты(
			//|			&СДаты,
			//|			&ПоДату,
			//|			Авто,
			//|			,
			//|			Ломбард = &Ломбард
			//|				И Склад = &Склад
			//|				И (ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог)
			//|					ИЛИ ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление)
			//|					ИЛИ ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога))
			//|				И 500 = 500
			//|				И 750 = 750
			//|				И 760 = 760
			//|				И 770 = 770) КАК ЛБ_ОбъектыЗалогаОстатки
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			//|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			//|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
			//|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
			//|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога.Код КАК ОбъектЗалогаКод,
			//|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.Регистратор КАК Регистратор
			//|		ИЗ
			//|			РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(
			//|					&ПоДату,
			//|					(Регистратор.Ломбард = &Ломбард
			//|						ИЛИ Регистратор.ЛомбардКуда = &Ломбард)
			//|						И ОбъектЗалога В
			//|							(ВЫБРАТЬ
			//|								ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога
			//|							ИЗ
			//|								РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПервых(&СДаты, (Регистратор.Ломбард = &Ломбард
			//|									ИЛИ Регистратор.ЛомбардКуда = &Ломбард)
			//|									И ВЫБОР
			//|										КОГДА Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|											ТОГДА Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|													И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|													И НЕ Регистратор В
			//|															(ВЫБРАТЬ
			//|																ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			//|															ИЗ
			//|																РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			//|															ГДЕ
			//|																ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))
			//|										КОГДА НЕ Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|											ТОГДА ИСТИНА
			//|									КОНЕЦ) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних
			//|							СГРУППИРОВАТЬ ПО
			//|								ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога)
			//|						И ВЫБОР
			//|							КОГДА Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|								ТОГДА Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|										И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|										И НЕ Регистратор В
			//|												(ВЫБРАТЬ
			//|													ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			//|												ИЗ
			//|													РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			//|												ГДЕ
			//|													ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))
			//|							КОГДА НЕ Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|								ТОГДА ИСТИНА
			//|						КОНЕЦ) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних) КАК СостоянияОбъектовЗалога
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = СостоянияОбъектовЗалога.ОбъектЗалога
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Клеймо КАК Клеймо,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК Вес,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесЧистый,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Именник КАК Именник,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Регистратор КАК Регистратор,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет
			//|		ИЗ
			//|			РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
			//|					&ПоДату,
			//|					Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|						И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|						И НЕ Регистратор В
			//|								(ВЫБРАТЬ
			//|									ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			//|								ИЗ
			//|									РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			//|								ГДЕ
			//|									ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних) КАК РеквизитыОбъектаЗалога
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РеквизитыОбъектаЗалога.ОбъектЗалога
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			//|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты.ОбъектЗалога КАК ОбъектЗалога,
			//|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
			//|		ИЗ
			//|			РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.ОстаткиИОбороты(&СДаты, &ПоДату, Период, , ) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты) КАК РасчетыСКлиентамиПоОбъектамЗалога
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РасчетыСКлиентамиПоОбъектамЗалога.ОбъектЗалога
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			//|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель КАК Залогодатель,
			//|			МАКСИМУМ(ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Период) КАК Период,
			//|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус
			//|		ИЗ
			//|			РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(
			//|					&ПоДату,
			//|					Используется
			//|						И ВЫБОР
			//|							КОГДА СрокДействия <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			//|								ТОГДА ВЫБОР
			//|										КОГДА СрокДействия <= &ПоДату
			//|											ТОГДА ЛОЖЬ
			//|										ИНАЧЕ ИСТИНА
			//|									КОНЕЦ
			//|							ИНАЧЕ ИСТИНА
			//|						КОНЕЦ) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних
			//|		
			//|		СГРУППИРОВАТЬ ПО
			//|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель,
			//|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус
			//|		
			//|		ОБЪЕДИНИТЬ ВСЕ
			//|		
			//|		ВЫБРАТЬ
			//|			ЛБ_СтатусыЗалогодателейСрезПоследних.Залогодатель,
			//|			ЛБ_СтатусыЗалогодателейСрезПоследних.Период,
			//|			ЛБ_СтатусыЗалогодателейСрезПоследних.Статус
			//|		ИЗ
			//|			РегистрСведений.ЛБ_СтатусыЗалогодателей.СрезПоследних(, ) КАК ЛБ_СтатусыЗалогодателейСрезПоследних) КАК СтатусыЗалогодателей
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель = СтатусыЗалогодателей.Залогодатель
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			//|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Период КАК Период,
			//|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			//|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки КАК ВидВставки
			//|		ИЗ
			//|			РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(&ПоДату, ) КАК ЛБ_ВставкиОбъектаЗалогаСрезПоследних) КАК ВставкиОЗ
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиОЗ.ОбъектЗалога
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			//|			ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога
			//|		ИЗ
			//|			РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(&ПоДату, НомерСтрокиТаблицы <> 0) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних) КАК ВставкиМеталла
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиМеталла.ОбъектЗалога
			//|ГДЕ
			//|	ИСТИНА
			//|	И НЕ СостоянияОбъектовЗалога.СтатусОбъектаЗалога ЕСТЬ NULL
			//|	И (СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Принят)
			//|			ИЛИ СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Возвращен)
			//|			ИЛИ СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ПринятНаСклад)
			//|			ИЛИ СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение))
			//|	И ВЫБОР
			//|			КОГДА ЛБ_ОбъектыЗалогаОстатки.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|				ТОГДА ЛБ_ОбъектыЗалогаОстатки.Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|						И ЛБ_ОбъектыЗалогаОстатки.Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|						И НЕ ЛБ_ОбъектыЗалогаОстатки.Регистратор В
			//|								(ВЫБРАТЬ
			//|									ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			//|								ИЗ
			//|									РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			//|								ГДЕ
			//|									ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОбъектыЗалогаОстатки.Регистратор))
			//|			КОГДА НЕ ЛБ_ОбъектыЗалогаОстатки.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|				ТОГДА ИСТИНА
			//|		КОНЕЦ
			//|	И ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиКонечныйОстаток <> 0
			//|	И ВЫБОР
			//|			КОГДА СостоянияОбъектовЗалога.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|					И СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение)
			//|				ТОГДА ЛОЖЬ
			//|			ИНАЧЕ ИСТИНА
			//|		КОНЕЦ
			//|	И 100 = 100
			//|	И 200 = 200
			//|	И 300 = 300
			//|	И 400 = 400
			//|	И 600 = 600
			//|	И 700 = 700
			//|	И 710 = 710
			//|	И 720 = 720
			//|	И 730 = 730
			//|	И 740 = 740
			//|	И 780 = 780
			//|	И 800 = 800
			//|	И 900 = 900
			//|	И 444 = 444
			//|	И 999 = 999
			//|
			//|УПОРЯДОЧИТЬ ПО
			//|	Артикул";
			
			УсловиеСкладНовые = "";
			
			Если НЕ СкладВитринаНеЦО Тогда
				УсловиеСкладНовые = "	И (СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Принят)
				|			ИЛИ СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Возвращен)
				|			ИЛИ СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ПринятНаСклад)
				|			ИЛИ СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение))";
			Иначе
				УсловиеСкладНовые = "	И СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ПринятНаСклад)";
			КонецЕсли;
			
			//+МАН 13.02.26 Пока убрал. Новый ниже
			//Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			//|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога.Код КАК ОбъектЗалогаКод,
			//|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
			//|	РеквизитыОбъектаЗалога.Артикул КАК Артикул,
			//|	СостоянияОбъектовЗалога.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
			//|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ВидОперации КАК ЗалоговыйБилетВидОперации,
			//|	ЛБ_ОбъектыЗалогаОстатки.Склад КАК Склад,
			//|	РеквизитыОбъектаЗалога.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			//|	ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток КАК Количество,
			//|	ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток КАК КоличествоФакт,
			//|	СостоянияОбъектовЗалога.СуммаЗайма КАК СуммаЗайма,
			//|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток КАК СуммаОценки,
			//|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток КАК СуммаОценкиФакт,
			//|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделия,
			//|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделияФакт,
			//|	РеквизитыОбъектаЗалога.Проба КАК Проба,
			//|	РеквизитыОбъектаЗалога.Проба КАК ПробаФакт,
			//|	РеквизитыОбъектаЗалога.Категория КАК Категория,
			//|	РеквизитыОбъектаЗалога.Категория КАК КатегорияФакт,
			//|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМасса,
			//|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМассаФакт,
			//|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталла,
			//|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталлаФакт,
			//|	РеквизитыОбъектаЗалога.Проба.Владелец КАК Металл,
			//|	РеквизитыОбъектаЗалога.Проба.Владелец КАК МеталлФакт,
			//|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель КАК Залогодатель,
			//|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Дата КАК ДатаОформленияЗайма,
			//|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ОтветственныйСотрудник КАК Приемщик,
			//|	РеквизитыОбъектаЗалога.Клеймо КАК Клеймо,
			//|	РеквизитыОбъектаЗалога.Клеймо КАК КлеймоФакт,
			//|	РеквизитыОбъектаЗалога.Именник КАК Именник,
			//|	РеквизитыОбъектаЗалога.Именник КАК ИменникФакт,
			//|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ОперацияЗайма,
			//|	РасчетыСКлиентамиПоОбъектамЗалога.СуммаКонечныйОстаток КАК ОстатокЗайма,
			//|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
			//|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлыФакт
			//|ИЗ
			//|	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(
			//|			&ПоДату,
			//|			Ломбард = &Ломбард
			//|				И Склад = &Склад
			//|				И (ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог)
			//|					ИЛИ ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление)
			//|					ИЛИ ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога))
			//|				И 500 = 500
			//|				И 750 = 750
			//|				И 760 = 760
			//|				И 770 = 770) КАК ЛБ_ОбъектыЗалогаОстатки
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			//|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			//|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
			//|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
			//|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога.Код КАК ОбъектЗалогаКод,
			//|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.Регистратор КАК Регистратор
			//|		ИЗ
			//|			РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(
			//|					&ПоДату,
			//|					(Регистратор.Ломбард = &Ломбард
			//|						ИЛИ Регистратор.ЛомбардКуда = &Ломбард)
			//|						И ОбъектЗалога В
			//|							(ВЫБРАТЬ
			//|								ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога
			//|							ИЗ
			//|								РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПервых(&СДаты, (Регистратор.Ломбард = &Ломбард
			//|									ИЛИ Регистратор.ЛомбардКуда = &Ломбард)
			//|									И ВЫБОР
			//|										КОГДА Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|											ТОГДА Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|													И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|													И НЕ Регистратор В
			//|															(ВЫБРАТЬ
			//|																ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			//|															ИЗ
			//|																РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			//|															ГДЕ
			//|																ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))
			//|										КОГДА НЕ Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|											ТОГДА ИСТИНА
			//|									КОНЕЦ) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних
			//|							СГРУППИРОВАТЬ ПО
			//|								ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога)
			//|						И ВЫБОР
			//|							КОГДА Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|								ТОГДА Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|										И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|										И НЕ Регистратор В
			//|												(ВЫБРАТЬ
			//|													ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			//|												ИЗ
			//|													РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			//|												ГДЕ
			//|													ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))
			//|							КОГДА НЕ Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|								ТОГДА ИСТИНА
			//|						КОНЕЦ) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних) КАК СостоянияОбъектовЗалога
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = СостоянияОбъектовЗалога.ОбъектЗалога
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Клеймо КАК Клеймо,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК Вес,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесЧистый,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Именник КАК Именник,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Регистратор КАК Регистратор,
			//|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет
			//|		ИЗ
			//|			РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
			//|					&ПоДату,
			//|					Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|						И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			//|						И НЕ Регистратор В
			//|								(ВЫБРАТЬ
			//|									ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			//|								ИЗ
			//|									РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			//|								ГДЕ
			//|									ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних) КАК РеквизитыОбъектаЗалога
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РеквизитыОбъектаЗалога.ОбъектЗалога
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			//|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты.ОбъектЗалога КАК ОбъектЗалога,
			//|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
			//|		ИЗ
			//|			РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.ОстаткиИОбороты(&СДаты, &ПоДату, Период, , ) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты) КАК РасчетыСКлиентамиПоОбъектамЗалога
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РасчетыСКлиентамиПоОбъектамЗалога.ОбъектЗалога
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			//|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель КАК Залогодатель,
			//|			МАКСИМУМ(ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Период) КАК Период,
			//|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус
			//|		ИЗ
			//|			РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(
			//|					&ПоДату,
			//|					Используется
			//|						И ВЫБОР
			//|							КОГДА СрокДействия <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			//|								ТОГДА ВЫБОР
			//|										КОГДА СрокДействия <= &ПоДату
			//|											ТОГДА ЛОЖЬ
			//|										ИНАЧЕ ИСТИНА
			//|									КОНЕЦ
			//|							ИНАЧЕ ИСТИНА
			//|						КОНЕЦ) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних
			//|		
			//|		СГРУППИРОВАТЬ ПО
			//|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель,
			//|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус
			//|		
			//|		ОБЪЕДИНИТЬ ВСЕ
			//|		
			//|		ВЫБРАТЬ
			//|			ЛБ_СтатусыЗалогодателейСрезПоследних.Залогодатель,
			//|			ЛБ_СтатусыЗалогодателейСрезПоследних.Период,
			//|			ЛБ_СтатусыЗалогодателейСрезПоследних.Статус
			//|		ИЗ
			//|			РегистрСведений.ЛБ_СтатусыЗалогодателей.СрезПоследних(, ) КАК ЛБ_СтатусыЗалогодателейСрезПоследних) КАК СтатусыЗалогодателей
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель = СтатусыЗалогодателей.Залогодатель
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			//|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Период КАК Период,
			//|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			//|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки КАК ВидВставки
			//|		ИЗ
			//|			РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(&ПоДату, ) КАК ЛБ_ВставкиОбъектаЗалогаСрезПоследних) КАК ВставкиОЗ
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиОЗ.ОбъектЗалога
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			//|			ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога
			//|		ИЗ
			//|			РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(&ПоДату, НомерСтрокиТаблицы <> 0) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних) КАК ВставкиМеталла
			//|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиМеталла.ОбъектЗалога
			//|ГДЕ
			//|	ИСТИНА
			//|	И НЕ СостоянияОбъектовЗалога.СтатусОбъектаЗалога ЕСТЬ NULL"
			//+ Символы.ПС + УсловиеСкладНовые
			//+ "	И ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток <> 0
			//|	И ВЫБОР
			//|			КОГДА СостоянияОбъектовЗалога.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			//|					И СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение)
			//|				ТОГДА ЛОЖЬ
			//|			ИНАЧЕ ИСТИНА
			//|		КОНЕЦ
			//|	И 100 = 100
			//|	И 200 = 200
			//|	И 300 = 300
			//|	И 400 = 400
			//|	И 600 = 600
			//|	И 700 = 700
			//|	И 710 = 710
			//|	И 720 = 720
			//|	И 730 = 730
			//|	И 740 = 740
			//|	И 780 = 780
			//|	И 800 = 800
			//|	И 900 = 900
			//|	И 444 = 444
			//|	И 999 = 999
			//|
			//|УПОРЯДОЧИТЬ ПО
			//|	Артикул";

			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога.Код КАК ОбъектЗалогаКод,
			|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
			|	РеквизитыОбъектаЗалога.Артикул КАК Артикул,
			|	СостоянияОбъектовЗалога.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
			|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ВидОперации КАК ЗалоговыйБилетВидОперации,
			|	ЛБ_ОбъектыЗалогаОстатки.Склад КАК Склад,
			|	РеквизитыОбъектаЗалога.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ЛБ_ОбъектыЗалогаОстатки.КоличествоКонечныйОстаток КАК Количество,
			|	ЛБ_ОбъектыЗалогаОстатки.КоличествоКонечныйОстаток КАК КоличествоФакт,
			|	СостоянияОбъектовЗалога.СуммаЗайма КАК СуммаЗайма,
			|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиКонечныйОстаток КАК СуммаОценки,
			|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиКонечныйОстаток КАК СуммаОценкиФакт,
			|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделия,
			|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделияФакт,
			|	РеквизитыОбъектаЗалога.Проба КАК Проба,
			|	РеквизитыОбъектаЗалога.Проба КАК ПробаФакт,
			|	РеквизитыОбъектаЗалога.Категория КАК Категория,
			|	РеквизитыОбъектаЗалога.Категория КАК КатегорияФакт,
			|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМасса,
			|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМассаФакт,
			|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталла,
			|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталлаФакт,
			|	РеквизитыОбъектаЗалога.Проба.Владелец КАК Металл,
			|	РеквизитыОбъектаЗалога.Проба.Владелец КАК МеталлФакт,
			|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель КАК Залогодатель,
			|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Дата КАК ДатаОформленияЗайма,
			|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ОтветственныйСотрудник КАК Приемщик,
			|	РеквизитыОбъектаЗалога.Клеймо КАК Клеймо,
			|	РеквизитыОбъектаЗалога.Клеймо КАК КлеймоФакт,
			|	РеквизитыОбъектаЗалога.Именник КАК Именник,
			|	РеквизитыОбъектаЗалога.Именник КАК ИменникФакт,
			|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ОперацияЗайма,
			|	РасчетыСКлиентамиПоОбъектамЗалога.СуммаКонечныйОстаток КАК ОстатокЗайма,
			|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
			|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлыФакт
			|ИЗ
			|	РегистрНакопления.ЛБ_ОбъектыЗалога.ОстаткиИОбороты(
			|			&СДаты,
			|			&ПоДату,
			|			Авто,
			|			,
			|			Ломбард = &Ломбард
			|				И Склад = &Склад
			|				И (ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог)
			|					ИЛИ ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление)
			|					ИЛИ ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога))
			|				И 500 = 500
			|				И 750 = 750
			|				И 760 = 760
			|				И 770 = 770) КАК ЛБ_ОбъектыЗалогаОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛБ_СостояниеОбъектаЗалога.ОбъектЗалога КАК ОбъектЗалога,
			|			ЛБ_СостояниеОбъектаЗалога.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
			|			ЛБ_СостояниеОбъектаЗалога.СуммаЗайма КАК СуммаЗайма,
			|			ЛБ_СостояниеОбъектаЗалога.Регистратор КАК Регистратор
			|		ИЗ
			|			РегистрСведений.ЛБ_СостояниеОбъектаЗалога КАК ЛБ_СостояниеОбъектаЗалога) КАК СостоянияОбъектовЗалога
			|		ПО (ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = СостоянияОбъектовЗалога.ОбъектЗалога
			|			И ЛБ_ОбъектыЗалогаОстатки.Регистратор = СостоянияОбъектовЗалога.Регистратор)
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Клеймо КАК Клеймо,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК Вес,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесЧистый,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Именник КАК Именник,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Регистратор КАК Регистратор,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет
			|		ИЗ
			|			РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
			|					&ПоДату,
			|					Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|						И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|						И НЕ Регистратор В
			|								(ВЫБРАТЬ
			|									ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			|								ИЗ
			|									РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			|								ГДЕ
			|									ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних) КАК РеквизитыОбъектаЗалога
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РеквизитыОбъектаЗалога.ОбъектЗалога
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты.ОбъектЗалога КАК ОбъектЗалога,
			|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
			|		ИЗ
			|			РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.ОстаткиИОбороты(&СДаты, &ПоДату, Период, , ) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты) КАК РасчетыСКлиентамиПоОбъектамЗалога
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РасчетыСКлиентамиПоОбъектамЗалога.ОбъектЗалога
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель КАК Залогодатель,
			|			МАКСИМУМ(ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Период) КАК Период,
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус
			|		ИЗ
			|			РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(
			|					&ПоДату,
			|					Используется
			|						И ВЫБОР
			|							КОГДА СрокДействия <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|								ТОГДА ВЫБОР
			|										КОГДА СрокДействия <= &ПоДату
			|											ТОГДА ЛОЖЬ
			|										ИНАЧЕ ИСТИНА
			|									КОНЕЦ
			|							ИНАЧЕ ИСТИНА
			|						КОНЕЦ) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель,
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			ЛБ_СтатусыЗалогодателейСрезПоследних.Залогодатель,
			|			ЛБ_СтатусыЗалогодателейСрезПоследних.Период,
			|			ЛБ_СтатусыЗалогодателейСрезПоследних.Статус
			|		ИЗ
			|			РегистрСведений.ЛБ_СтатусыЗалогодателей.СрезПоследних(, ) КАК ЛБ_СтатусыЗалогодателейСрезПоследних) КАК СтатусыЗалогодателей
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель = СтатусыЗалогодателей.Залогодатель
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Период КАК Период,
			|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки КАК ВидВставки
			|		ИЗ
			|			РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(&ПоДату, ) КАК ЛБ_ВставкиОбъектаЗалогаСрезПоследних) КАК ВставкиОЗ
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиОЗ.ОбъектЗалога
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога
			|		ИЗ
			|			РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(&ПоДату, НомерСтрокиТаблицы <> 0) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних) КАК ВставкиМеталла
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиМеталла.ОбъектЗалога
			|ГДЕ
			|	ИСТИНА"
			//|	И НЕ СостоянияОбъектовЗалога.СтатусОбъектаЗалога ЕСТЬ NULL"
			+ Символы.ПС + УсловиеСкладНовые
			+ "	И ВЫБОР
			|			КОГДА ЛБ_ОбъектыЗалогаОстатки.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			|				ТОГДА ЛБ_ОбъектыЗалогаОстатки.Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|						И ЛБ_ОбъектыЗалогаОстатки.Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|						И НЕ ЛБ_ОбъектыЗалогаОстатки.Регистратор В
			|								(ВЫБРАТЬ
			|									ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			|								ИЗ
			|									РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			|								ГДЕ
			|									ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОбъектыЗалогаОстатки.Регистратор))
			|			КОГДА НЕ ЛБ_ОбъектыЗалогаОстатки.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			|				ТОГДА ИСТИНА
			|		КОНЕЦ
			//|	И ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиКонечныйОстаток <> 0
			|	И ВЫБОР
			|			КОГДА СостоянияОбъектовЗалога.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
			|					И СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение)
			|				ТОГДА ЛОЖЬ
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|	И 100 = 100
			|	И 200 = 200
			|	И 300 = 300
			|	И 400 = 400
			|	И 600 = 600
			|	И 700 = 700
			|	И 710 = 710
			|	И 720 = 720
			|	И 730 = 730
			|	И 740 = 740
			|	И 780 = 780
			|	И 800 = 800
			|	И 900 = 900
			|	И 444 = 444
			|	И 999 = 999
			|
			|УПОРЯДОЧИТЬ ПО
			|	Артикул";
			
			Запрос.УстановитьПараметр("СДаты", НачалоДня(Объект.Дата));    
			Запрос.УстановитьПараметр("ПоДату", ТекущаяДата());
			//+МАН 17.12.25
			Запрос.УстановитьПараметр("Склад", Объект.Склад);
			//-МАН
		КонецЕсли;
		//-МАН
		
		Если Объект.ВидИнвентаризации = Перечисления.ЛБ_ВидИнвентаризации.Выборочная Тогда
			
			Если ЗначениеЗаполнено(Объект.ОтборДатаЗаймаОт) ИЛИ ЗначениеЗаполнено(Объект.ОтборДатаЗаймаДо) Тогда
				//Если ЗначениеЗаполнено(Объект.ОтборДатаЗаймаОт) И НЕ ЗначениеЗаполнено(Объект.ОтборДатаЗаймаДо) Тогда
				//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "500 = 500", "ЗалоговыйБилет.Дата >= &ОтборДатаЗаймаОт");
				//Если НЕ ЗначениеЗаполнено(Объект.ОтборДатаЗаймаОт) И ЗначениеЗаполнено(Объект.ОтборДатаЗаймаДо) Тогда
				//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "500 = 500", "ЗалоговыйБилет.Дата <= &ОтборДатаЗаймаДо");
				//Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "500 = 500", "ЗалоговыйБилет.Дата МЕЖДУ &ОтборДатаЗаймаОт И &ОтборДатаЗаймаДо"); //Мельников 14.05.24 Было "ЗалоговыйБилет.Дата <= &ОтборДатаЗаймаДо");
				//КонецЕсли;
				Запрос.УстановитьПараметр("ОтборДатаЗаймаОт", Объект.ОтборДатаЗаймаОт);
				Запрос.УстановитьПараметр("ОтборДатаЗаймаДо", Объект.ОтборДатаЗаймаДо);
			КонецЕсли;
			
			//15.05.24 Добавлен фильтр по статусу клиента.
			Если Объект.ФильтрСтатусыЗалогодателя.Количество() > 0 Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "400 = 400", "СтатусыЗалогодателей.Статус В (&СтатусЗалогодателя)"); 	
				Массив = ВернутьМассивИзФильтра(Объект.ФильтрСтатусыЗалогодателя, "Статус"); 				
				Запрос.УстановитьПараметр("СтатусЗалогодателя", Массив); 
			КонецЕсли;  
			
			//15.05.24 Добавлен фильтр по сумме оценки
			Если Объект.ОтборСуммаОценкиОт > 0 ИЛИ Объект.ОтборСуммаОценкиДо > 0 Тогда
				Если Остатки ИЛИ НаОХ ИЛИ СумкаЗакрыта Тогда
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "800 = 800", "ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток МЕЖДУ &ОтборСуммаОценкиОт И &ОтборСуммаОценкиДо");
					
					Если СумкаЗакрыта Тогда
						Запрос.Текст = СтрЗаменить(Запрос.Текст, "801 = 801", "ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиРасход МЕЖДУ &ОтборСуммаОценкиОт И &ОтборСуммаОценкиДо");
					КонецЕсли;
					
				ИначеЕсли Изъятые Тогда
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "800 = 800", "ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиРасход МЕЖДУ &ОтборСуммаОценкиОт И &ОтборСуммаОценкиДо");
				ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "800 = 800", "ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиКонечныйОстаток МЕЖДУ &ОтборСуммаОценкиОт И &ОтборСуммаОценкиДо");
				КонецЕсли;
				
				Запрос.УстановитьПараметр("ОтборСуммаОценкиОт", Объект.ОтборСуммаОценкиОт );
				Запрос.УстановитьПараметр("ОтборСуммаОценкиДо", Объект.ОтборСуммаОценкиДо);
			КонецЕсли;	
			
			//+15.05.24 Добавлен фильтр по вставке
			Если Объект.ФильтрКамни.Количество() > 0 Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "710 = 710", "ВставкиОЗ.ВидВставки В (&ВидВставки)");
				Массив = ВернутьМассивИзФильтра(Объект.ФильтрКамни, "Вставка"); 				
				Запрос.УстановитьПараметр("ВидВставки", Массив); 
			КонецЕсли; 
			
			//+20.05.24 Добавлен фильтр по ОЗ без вставок
			Если Объект.ОтборБезВставок Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "720 = 720", "ВставкиОЗ.ВидВставки ЕСТЬ NULL");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "730 = 730", "ВставкиМеталла.ОбъектЗалога ЕСТЬ NULL");
			КонецЕсли; 
			
			//+20.05.24 Добавлен фильтр по вставкам металла
			Если Объект.ОтборВставкаМеталл Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "740 = 740", "НЕ ВставкиМеталла.ОбъектЗалога ЕСТЬ NULL");
			КонецЕсли; 
			
			//+27.05.24 Если добавляется строка
			Если НоваяСтрокаТЧ Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "770 = 770", "ОбъектЗалога = &ОбъектЗалога");
				Запрос.УстановитьПараметр("ОбъектЗалога", ДобавляемыйОЗ);
			КонецЕсли;
			
			//+МАН 21.03.25
			Если Объект.ОтборВставкаКомплектующие Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "780 = 780", "ТИПЗНАЧЕНИЯ(ВставкиОЗ.ВидВставки) = ТИП(Справочник.ЛБ_КомплектующиеИзделия)");
			КонецЕсли; 
			//-Мельников
			
			Если Объект.ФильтрЗалогодатели.Количество() > 0 тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "750 = 750", "ЗалоговыйБилет.Залогодатель В (&Клиенты)"); 	
				Массив = ВернутьМассивИзФильтра(Объект.ФильтрЗалогодатели, "Залогодатель"); 				
				Запрос.УстановитьПараметр("Клиенты", Массив); 
			КонецЕсли;  
			
			Если Объект.ФильтрПриемщики.Количество() > 0 тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "760 = 760", "ЗалоговыйБилет.Ответственный В (&Приемщики)"); 	
				Массив = ВернутьМассивИзФильтра(Объект.ФильтрПриемщики, "Приемщик"); 				
				Запрос.УстановитьПараметр("Приемщики", Массив); 
			КонецЕсли; 		
			
			Если Объект.ФильтрСтатусы.Количество() > 0 тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "444 = 444", "СостоянияОбъектовЗалога.СтатусОбъектаЗалога В (&СтатусОбъектаЗалога)"); 	
				Массив = ВернутьМассивИзФильтра(Объект.ФильтрСтатусы, "Статус"); 				
				Запрос.УстановитьПараметр("СтатусОбъектаЗалога", Массив); 
			КонецЕсли;
			
			//+МАН 25.11.24 Фильтры для реквизитов
			Если Объект.ФильтрВидыИзделий.Количество() > 0 Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "100 = 100", "РеквизитыОбъектаЗалога.ВидИзделия В (&ВидИзделия)");
				Массив = ВернутьМассивИзФильтра(Объект.ФильтрВидыИзделий, "ВидИзделия");
				Запрос.УстановитьПараметр("ВидИзделия", Массив);
			КонецЕсли;
			
			Если Объект.ФильтрКатегории.Количество() > 0 Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "200 = 200", "РеквизитыОбъектаЗалога.Категория В (&Категории)");
				Массив = ВернутьМассивИзФильтра(Объект.ФильтрКатегории, "Категория");
				Запрос.УстановитьПараметр("Категории", Массив);
			КонецЕсли;
			
			Если Объект.ФильтрПробы.Количество() > 0 Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "300 = 300", "РеквизитыОбъектаЗалога.Проба В (&Пробы)");
				Массив = ВернутьМассивИзФильтра(Объект.ФильтрПробы, "Проба");
				Запрос.УстановитьПараметр("Пробы", Массив);
			КонецЕсли;
			
			Если Объект.ОтборОбщаяМассаОт > 0 ИЛИ Объект.ОтборОбщаяМассаДо > 0 Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "700 = 700", "РеквизитыОбъектаЗалога.Вес МЕЖДУ &ОтборОбщаяМассаОт И &ОтборОбщаяМассаДо");
				Запрос.УстановитьПараметр("ОтборОбщаяМассаОт", Объект.ОтборОбщаяМассаОт);
				Запрос.УстановитьПараметр("ОтборОбщаяМассаДо", Объект.ОтборОбщаяМассаДо);
			КонецЕсли;
			
			Если Объект.ОтборМассаМеталлаОт > 0 ИЛИ Объект.ОтборМассаМеталлаДо > 0 Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "900 = 900", "РеквизитыОбъектаЗалога.ВесЧистый МЕЖДУ &ОтборМассаМеталлаОт И &ОтборМассаМеталлаДо");
				Запрос.УстановитьПараметр("ОтборМассаМеталлаОт", Объект.ОтборМассаМеталлаОт);
				Запрос.УстановитьПараметр("ОтборМассаМеталлаДо", Объект.ОтборМассаМеталлаДо);
			КонецЕсли;	
			
			//+15.05.24 Добавлен фильтр по именнику
			Если Объект.ОтборИменник Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "600 = 600", "РеквизитыОбъектаЗалога.Именник = &ОтборИменник");
				Запрос.УстановитьПараметр("ОтборИменник", ПредопределенноеЗначение("Перечисление.ЛБ_Именник.Да"));
			КонецЕсли;
		КонецЕсли;  
		
		тз = Запрос.Выполнить().Выгрузить();
		
		//+МАН 21.01.25 Пока заккоментировал. Отбор добавлен в основной запрос
		//Если Остатки ИЛИ СумкаЗакрыта Тогда
		//	
		//	МассивУдаляемыхСтрокТЗ = Новый Массив;
		//	
		//	Для каждого Стр Из тз Цикл
		//		СтатусОЗ = ПолучитьСтатусОЗВнакладной(НачалоДня(Объект.Дата), Стр.ОбъектЗалога);
		
		//		Если Остатки Тогда
		//			Если СтатусОЗ = Неопределено
		//				ИЛИ СтатусОЗ = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.Факт
		//				ИЛИ СтатусОЗ = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.СумкаОткрыта
		//				ИЛИ СтатусОЗ = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.ИсключенИзНакладной Тогда
		//			
		//				Продолжить;					
		//			Иначе
		//				//тз.Удалить(Стр);
		//				МассивУдаляемыхСтрокТЗ.Добавить(Стр);
		//			КонецЕсли;
		//		ИначеЕсли СумкаЗакрыта Тогда
		//			Если СтатусОЗ = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.СумкаЗакрыта Тогда
		//				
		//				Продолжить;
		//			Иначе
		//				//тз.Удалить(Стр);
		//				МассивУдаляемыхСтрокТЗ.Добавить(Стр);
		//			КонецЕсли;
		//		КонецЕсли;
		//	КонецЦикла;
		//	
		//	Если МассивУдаляемыхСтрокТЗ.Количество() > 0 Тогда
		//		Для каждого СтрМассиваТЗ Из МассивУдаляемыхСтрокТЗ Цикл
		//			тз.Удалить(СтрМассиваТЗ);
		//		КонецЦикла;
		//	КонецЕсли;
		//КонецЕсли;	
		//-МАН
		
		Строка = Новый КвалификаторыСтроки(1024, ДопустимаяДлина.Переменная);
		М = Новый Массив;
		М.Добавить(Тип("Строка"));
		ТипС = Новый ОписаниеТипов(М,, Строка);
		
		//+МАН 28.10.24 Получачем описание из регистра сведений ЛБ_РеквизитыОбъектаЗалога т.к. в запрос невыбрать с неограниченной длиной
		СтрокаОписания = Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная);
		ТипСтрокиОписания = Новый ОписаниеТипов(М,, СтрокаОписания);
		тз.Колонки.Добавить("ОписаниеИзделия", ТипСтрокиОписания);
		//-МАН
		
		тз.Колонки.Добавить("Отклонения", ТипС);
		
		//+Мельников 17.05.24 Определение суммы займа по объекту залога
		Для каждого СтрТЗ Из тз Цикл
			
			//+МАН 28.10.24 Получачем описание из регистра сведений ЛБ_РеквизитыОбъектаЗалога т.к. в запрос невыбрать с неограниченной длиной
			НаборЗаписей = РегистрыСведений.ЛБ_РеквизитыОбъектаЗалога.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(СтрТЗ.ОперацияЗайма);
			НаборЗаписей.Прочитать();
			
			Для каждого СтрНЗ Из НаборЗаписей Цикл
				
				Если СтрНЗ.ОбъектЗалога <> СтрТЗ.ОбъектЗалога Тогда
					Продолжить;
				КонецЕсли;
				
				СтрТЗ.ОписаниеИзделия = СтрНЗ.ОписаниеИзделия;
				
			КонецЦикла;
			//-МАН
			
			СтрТЗ.Отклонения = ПолучитьОтклонениеПоОЗ(СтрТЗ.ОбъектЗалога);
			
		КонецЦикла;
		//-Мельников
		
		Если НЕ НоваяСтрокаТЧ Тогда
			//+МАН 25.11.24
			Если Остатки Тогда
				Объект.Товары.Загрузить(тз);
			ИначеЕсли НаОХ Тогда
				Объект.НаОХ.Загрузить(тз);
			ИначеЕсли Изъятые Тогда
				Объект.Изъятые.Загрузить(тз);
			ИначеЕсли СумкаЗакрыта Тогда
				Объект.СумкаЗакрыта.Загрузить(тз);
			ИначеЕсли НовыеОЗ Тогда
				Объект.НовыеОЗ.Загрузить(тз);
			ИначеЕсли ОбновитьНовыеОЗ Тогда
				Если тз.Количество() > 0 Тогда
					
					МассивУдаляемыхСтрок = Новый Массив;
					
					Для каждого СтрТЗ Из тз Цикл
						
						Отбор = Новый Структура;
						Отбор.Вставить("ОбъектЗалога", СтрТЗ.ОбъектЗалога);
						Отбор.Вставить("Артикул", СтрТЗ.Артикул);
						
						МассивНайденныхОЗ = Объект.НовыеОЗ.НайтиСтроки(Отбор);
						
						Если МассивНайденныхОЗ.Количество() > 0 Тогда
							МассивУдаляемыхСтрок.Добавить(СтрТЗ);
							Продолжить;
						КонецЕсли;
						
						НоваяСтр = Объект.НовыеОЗ.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтр, СтрТЗ);
						
					КонецЦикла;
					
					Если МассивУдаляемыхСтрок.Количество() > 0 Тогда
						Для каждого СтрМассива Из МассивУдаляемыхСтрок Цикл
							тз.Удалить(СтрМассива);
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			//-МАН
		Иначе
			Если тз.Количество() > 0 Тогда
				Для каждого СтрТЗ Из тз Цикл
					НоваяСтр = Объект.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтр, СтрТЗ)
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		МассивОЗ = тз.ВыгрузитьКолонку("ОбъектЗалога");
		
		ЗапросВставки = Новый Запрос;
		ЗапросВставки.Текст ="ВЫБРАТЬ
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Период КАК Период,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Регистратор КАК Регистратор,
		//|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.НомерСтроки КАК НомерСтроки,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Активность КАК Активность,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки КАК ВидВставки,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ФормаОгранки КАК ФормаОгранки,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидОгранки КАК ВидОгранки,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.КачествоОгранки КАК КачествоОгранки,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Длина КАК Длина,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Ширина КАК Ширина,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Высота КАК Высота,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Диаметр КАК Диаметр,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Диаметр1 КАК Диаметр1,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Диаметр2 КАК Диаметр2,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Вес КАК Вес,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВесГраммы КАК ВесГраммы,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Цена КАК Цена,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Количество КАК Количество,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.СуммаОценки КАК Сумма,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки КАК ВидВставкиФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ФормаОгранки КАК ФормаОгранкиФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидОгранки КАК ВидОгранкиФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.КачествоОгранки КАК КачествоОгранкиФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Длина КАК ДлинаФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Ширина КАК ШиринаФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Высота КАК ВысотаФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Диаметр КАК ДиаметрФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Диаметр1 КАК Диаметр1Факт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Диаметр2 КАК Диаметр2Факт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмеренияФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Вес КАК ВесФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВесГраммы КАК ВесГраммыФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Цена КАК ЦенаФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Количество КАК КоличествоФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаФакт,
		//+Мельников 16.10.24 Инвентаризация. Заявка 2464
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.НеОценивать КАК НеОценивать,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.НеОценивать КАК НеОцениватьФакт,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки) = ТИП(Справочник.ЛБ_ДрагоценныеКамни)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыКомплектующихИзделия.Вставка)
		|		КОГДА ТИПЗНАЧЕНИЯ(ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки) = ТИП(Справочник.ЛБ_КомплектующиеИзделия)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыКомплектующихИзделия.Комплектующее)
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Вид
		//-Мельников
		|ИЗ
		|	РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(100 = 100, ОбъектЗалога В (&МассивОЗ)) КАК ЛБ_ВставкиОбъектаЗалогаСрезПоследних
		|ГДЕ
		|	200 = 200
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ,
		|	НомерСтрокиТаблицы";
		
		Если Остатки ИЛИ НаОХ ИЛИ Изъятые ИЛИ СумкаЗакрыта Тогда
			ЗапросВставки.Текст = СтрЗаменить(ЗапросВставки.Текст, "100 = 100", "&НаДату");
			
			ЗапросВставки.УстановитьПараметр("НаДату", НачалоДня(Объект.Дата)); 
		ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
			ЗапросВставки.Текст = СтрЗаменить(ЗапросВставки.Текст, "100 = 100", "&ПоДату");
			ЗапросВставки.Текст = СтрЗаменить(ЗапросВставки.Текст, "200 = 200", "ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Период МЕЖДУ &СДаты И &ПоДату");
			
			ЗапросВставки.УстановитьПараметр("СДаты", НачалоДня(Объект.Дата)); 
			ЗапросВставки.УстановитьПараметр("ПоДату", ТекущаяДата()); 
		КонецЕсли;
		
		ЗапросВставки.УстановитьПараметр("МассивОЗ", МассивОЗ); 
		
		Если НЕ НоваяСтрокаТЧ ИЛИ НЕ ОбновитьНовыеОЗ Тогда
			//+МАН 25.11.24
			Если Остатки Тогда
				Объект.ВставкиФакт.Очистить();
			ИначеЕсли НаОХ Тогда
				Объект.ВставкиКамнейНаОХ.Очистить();
			ИначеЕсли Изъятые Тогда
				Объект.ВставкиКамнейИзъятые.Очистить();
			ИначеЕсли СумкаЗакрыта Тогда
				Объект.ВставкиКамнейСумкаЗакрыта.Очистить();
			ИначеЕсли НовыеОЗ Тогда
				Объект.ВставкиКамнейНовыеОЗ.Очистить();
			КонецЕсли;
			//-МАН
		КонецЕсли;
		
		//+Мельников 20.05.24
		ТзВствки = ЗапросВставки.Выполнить().Выгрузить();
		//-Мельников
		
		КоличествоВставок = 0;
		КоличествоЗагруженныхВставок = 0;
		
		ВыборкаВставки = ЗапросВставки.Выполнить().Выбрать();
		Пока ВыборкаВставки.Следующий() Цикл
			//+МАН 25.11.24
			Если Остатки Тогда
				КоличествоВставок = КоличествоВставок(ВыборкаВставки.ОбъектЗалога, НачалоДня(Объект.Дата));
				КоличествоЗагруженныхВставок = КоличествоЗагруженныхВставок(ВыборкаВставки.ОбъектЗалога, "ВставкиФакт");
				
				Если КоличествоЗагруженныхВставок <> КоличествоВставок Тогда
					НовСтрВставки = Объект.ВставкиФакт.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставки, ВыборкаВставки);
				Иначе
					Продолжить;
				КонецЕсли;
			ИначеЕсли НаОХ Тогда
				КоличествоВставок = КоличествоВставок(ВыборкаВставки.ОбъектЗалога, НачалоДня(Объект.Дата));
				КоличествоЗагруженныхВставок = КоличествоЗагруженныхВставок(ВыборкаВставки.ОбъектЗалога, "ВставкиКамнейНаОХ");
				
				Если КоличествоЗагруженныхВставок <> КоличествоВставок Тогда
					НовСтрВставки = Объект.ВставкиКамнейНаОХ.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставки, ВыборкаВставки);	
				Иначе
					Продолжить;
				КонецЕсли;
			ИначеЕсли Изъятые Тогда
				КоличествоВставок = КоличествоВставок(ВыборкаВставки.ОбъектЗалога, НачалоДня(Объект.Дата));
				КоличествоЗагруженныхВставок = КоличествоЗагруженныхВставок(ВыборкаВставки.ОбъектЗалога, "ВставкиКамнейИзъятые");
				
				Если КоличествоЗагруженныхВставок <> КоличествоВставок Тогда
					НовСтрВставки = Объект.ВставкиКамнейИзъятые.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставки, ВыборкаВставки);	
				Иначе
					Продолжить;
				КонецЕсли;
			ИначеЕсли СумкаЗакрыта Тогда
				КоличествоВставок = КоличествоВставок(ВыборкаВставки.ОбъектЗалога, НачалоДня(Объект.Дата));
				КоличествоЗагруженныхВставок = КоличествоЗагруженныхВставок(ВыборкаВставки.ОбъектЗалога, "ВставкиКамнейСумкаЗакрыта");
				
				Если КоличествоЗагруженныхВставок <> КоличествоВставок Тогда
					НовСтрВставки = Объект.ВставкиКамнейСумкаЗакрыта.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставки, ВыборкаВставки);	
				Иначе
					Продолжить;
				КонецЕсли;
			ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
				КоличествоВставок = КоличествоВставок(ВыборкаВставки.ОбъектЗалога, НачалоДня(Объект.Дата), Истина);
				КоличествоЗагруженныхВставок = КоличествоЗагруженныхВставок(ВыборкаВставки.ОбъектЗалога, "ВставкиКамнейНовыеОЗ");
				
				Если КоличествоЗагруженныхВставок <> КоличествоВставок Тогда
					НовСтрВставки = Объект.ВставкиКамнейНовыеОЗ.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставки, ВыборкаВставки);	
				Иначе
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			//-МАН
		КонецЦикла;
		
		//+Мельников 17.05.24 Добавлен поиск вставок металла
		ЗапросВставкиМеталла = Новый Запрос;
		ЗапросВставкиМеталла.Текст ="ВЫБРАТЬ
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ВесЧистый КАК Вес,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ВесВПробеЧистоты КАК ВесВПробеЧистоты,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценки,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.Проба КАК ПробаФакт,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесФакт,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ВесВПробеЧистоты КАК ВесВПробеЧистотыФакт,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмеренияФакт,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценкиФакт
		|ИЗ
		|	РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(
		|			100 = 100,
		|			ОбъектЗалога В (&МассивОЗ)
		|				И НомерСтрокиТаблицы <> 0) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних
		|ГДЕ
		|	200 = 200";
		Если Остатки ИЛИ НаОХ ИЛИ Изъятые ИЛИ СумкаЗакрыта Тогда
			ЗапросВставкиМеталла.Текст = СтрЗаменить(ЗапросВставкиМеталла.Текст, "100 = 100", "&НаДату");
			
			ЗапросВставкиМеталла.УстановитьПараметр("НаДату", НачалоДня(Объект.Дата)); 
		ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
			ЗапросВставкиМеталла.Текст = СтрЗаменить(ЗапросВставкиМеталла.Текст, "100 = 100", "&ПоДату");
			ЗапросВставкиМеталла.Текст = СтрЗаменить(ЗапросВставкиМеталла.Текст, "200 = 200", "ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.Период МЕЖДУ &СДаты И &ПоДату");
			
			ЗапросВставкиМеталла.УстановитьПараметр("СДаты", НачалоДня(Объект.Дата)); 
			ЗапросВставкиМеталла.УстановитьПараметр("ПоДату", ТекущаяДата()); 
		КонецЕсли;
		
		ЗапросВставкиМеталла.УстановитьПараметр("МассивОЗ", МассивОЗ); 
		
		Если НЕ НоваяСтрокаТЧ ИЛИ НЕ ОбновитьНовыеОЗ Тогда
			//+МАН 25.11.24
			Если Остатки Тогда
				Объект.ВставкиМеталла.Очистить();
			ИначеЕсли НаОХ Тогда
				Объект.ВставкиМеталлаНаОХ.Очистить();
			ИначеЕсли Изъятые Тогда
				Объект.ВставкиМеталлаИзъятые.Очистить();
			ИначеЕсли СумкаЗакрыта Тогда
				Объект.ВставкиМеталлаСумкаЗакрыта.Очистить();
			ИначеЕсли НовыеОЗ Тогда
				Объект.ВставкиМеталлаНовыеОЗ.Очистить();
			КонецЕсли;
			//-МАН
		КонецЕсли;
		
		ТзВствкиМеталла = ЗапросВставкиМеталла.Выполнить().Выгрузить();
		
		КоличествоВставокМеталла = 0;
		КоличествоЗагруженныхВставокМеталла = 0;
		
		ВыборкаВставкиМеталла = ЗапросВставкиМеталла.Выполнить().Выбрать();
		Пока ВыборкаВставкиМеталла.Следующий() Цикл
			//+МАН 25.11.24
			Если Остатки Тогда
				КоличествоВставокМеталла = КоличествоВставокМеталла(ВыборкаВставкиМеталла.ОбъектЗалога, НачалоДня(Объект.Дата));
				КоличествоЗагруженныхВставокМеталла = КоличествоЗагруженныхВставок(ВыборкаВставкиМеталла.ОбъектЗалога, "ВставкиМеталла");
				
				Если КоличествоЗагруженныхВставокМеталла <> КоличествоВставокМеталла Тогда
					НовСтрВставкиМеталла = Объект.ВставкиМеталла.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставкиМеталла, ВыборкаВставкиМеталла);	
				Иначе
					Продолжить;
				КонецЕсли;
			ИначеЕсли НаОХ Тогда
				КоличествоВставокМеталла = КоличествоВставокМеталла(ВыборкаВставкиМеталла.ОбъектЗалога, НачалоДня(Объект.Дата));
				КоличествоЗагруженныхВставокМеталла = КоличествоЗагруженныхВставок(ВыборкаВставкиМеталла.ОбъектЗалога, "ВставкиМеталлаНаОХ");
				
				Если КоличествоЗагруженныхВставокМеталла <> КоличествоВставокМеталла Тогда
					НовСтрВставкиМеталла = Объект.ВставкиМеталлаНаОХ.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставкиМеталла, ВыборкаВставкиМеталла);	
				Иначе
					Продолжить;
				КонецЕсли;
			ИначеЕсли Изъятые Тогда
				КоличествоВставокМеталла = КоличествоВставокМеталла(ВыборкаВставкиМеталла.ОбъектЗалога, НачалоДня(Объект.Дата));
				КоличествоЗагруженныхВставокМеталла = КоличествоЗагруженныхВставок(ВыборкаВставкиМеталла.ОбъектЗалога, "ВставкиМеталлаИзъятые");
				
				Если КоличествоЗагруженныхВставокМеталла <> КоличествоВставокМеталла Тогда
					НовСтрВставкиМеталла = Объект.ВставкиМеталлаИзъятые.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставкиМеталла, ВыборкаВставкиМеталла);	
				Иначе
					Продолжить;
				КонецЕсли;
			ИначеЕсли СумкаЗакрыта Тогда
				КоличествоВставокМеталла = КоличествоВставокМеталла(ВыборкаВставкиМеталла.ОбъектЗалога, НачалоДня(Объект.Дата));
				КоличествоЗагруженныхВставокМеталла = КоличествоЗагруженныхВставок(ВыборкаВставкиМеталла.ОбъектЗалога, "ВставкиМеталлаСумкаЗакрыта");
				
				Если КоличествоЗагруженныхВставокМеталла <> КоличествоВставокМеталла Тогда
					НовСтрВставкиМеталла = Объект.ВставкиМеталлаСумкаЗакрыта.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставкиМеталла, ВыборкаВставкиМеталла);	
				Иначе
					Продолжить;
				КонецЕсли;
			ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
				КоличествоВставокМеталла = КоличествоВставокМеталла(ВыборкаВставкиМеталла.ОбъектЗалога, НачалоДня(Объект.Дата), Истина);
				КоличествоЗагруженныхВставокМеталла = КоличествоЗагруженныхВставок(ВыборкаВставкиМеталла.ОбъектЗалога, "ВставкиМеталлаНовыеОЗ");
				
				Если КоличествоЗагруженныхВставокМеталла <> КоличествоВставокМеталла Тогда
					НовСтрВставкиМеталла = Объект.ВставкиМеталлаНовыеОЗ.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставкиМеталла, ВыборкаВставкиМеталла);	
				Иначе
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			//-МАН
		КонецЦикла;
		
		//+МАН 26.03.25
		Если Остатки Тогда
			ТЧВставки = Объект.ВставкиФакт;
			ТЧВставкиМеталла = Объект.ВставкиМеталла;
		ИначеЕсли НаОХ Тогда
			ТЧВставки = Объект.ВставкиКамнейНаОХ;
			ТЧВставкиМеталла = Объект.ВставкиМеталлаНаОХ;
		ИначеЕсли Изъятые Тогда
			ТЧВставки = Объект.ВставкиКамнейИзъятые;
			ТЧВставкиМеталла = Объект.ВставкиМеталлаИзъятые;
		ИначеЕсли СумкаЗакрыта Тогда
			ТЧВставки = Объект.ВставкиКамнейСумкаЗакрыта;
			ТЧВставкиМеталла = Объект.ВставкиМеталлаСумкаЗакрыта;
		ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
			ТЧВставки = Объект.ВставкиКамнейНовыеОЗ;
			ТЧВставкиМеталла = Объект.ВставкиМеталлаНовыеОЗ;
		КонецЕсли;
		//-МАН
		
		Для каждого СтрОЗВставка Из ТЧВставки Цикл //ТзВствки Цикл
			
			Отбор = Новый Структура;
			Отбор.Вставить("ОбъектЗалога",СтрОЗВставка.ОбъектЗалога);
			
			//+МАН 25.11.24
			Если Остатки Тогда
				НайденныйОЗ = Объект.Товары.НайтиСтроки(Отбор);
			ИначеЕсли НаОХ Тогда
				НайденныйОЗ = Объект.НаОХ.НайтиСтроки(Отбор);
			ИначеЕсли Изъятые Тогда
				НайденныйОЗ = Объект.Изъятые.НайтиСтроки(Отбор);
			ИначеЕсли СумкаЗакрыта Тогда
				НайденныйОЗ = Объект.СумкаЗакрыта.НайтиСтроки(Отбор);
			ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
				НайденныйОЗ = Объект.НовыеОЗ.НайтиСтроки(Отбор);
			КонецЕсли;
			//-МАН
			
			Для каждого СтрОЗНайденный Из НайденныйОЗ Цикл
				СтрОЗНайденный.Вставка = ?(СтрОЗНайденный.Вставка = "", СтрОЗНайденный.Вставка, СтрОЗНайденный.Вставка + ", ") + СтрОЗВставка.ВидВставки.КраткоеНаименование;
			КонецЦикла;
		КонецЦикла;
		
		Для каждого СтрОЗВставкаМеталла Из ТЧВставкиМеталла Цикл //ТзВствкиМеталла Цикл
			
			Отбор = Новый Структура;
			Отбор.Вставить("ОбъектЗалога",СтрОЗВставкаМеталла.ОбъектЗалога);
			
			//+МАН 25.11.24
			Если Остатки Тогда
				НайденныйОЗ = Объект.Товары.НайтиСтроки(Отбор);
			ИначеЕсли НаОХ Тогда
				НайденныйОЗ = Объект.НаОХ.НайтиСтроки(Отбор);
			ИначеЕсли Изъятые Тогда
				НайденныйОЗ = Объект.Изъятые.НайтиСтроки(Отбор);
			ИначеЕсли СумкаЗакрыта Тогда
				НайденныйОЗ = Объект.СумкаЗакрыта.НайтиСтроки(Отбор);
			ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
				НайденныйОЗ = Объект.НовыеОЗ.НайтиСтроки(Отбор);
			КонецЕсли;
			//-МАН
			
			Для каждого СтрОЗНайденный Из НайденныйОЗ Цикл
				СтрОЗНайденный.Вставка = ?(СтрОЗНайденный.Вставка = "", СтрОЗНайденный.Вставка, СтрОЗНайденный.Вставка + ", ") + СтрОЗВставкаМеталла.Проба.Наименование;
			КонецЦикла;
		КонецЦикла;
		//-Мельников
		
		//+МАН 25.11.24
		Если Остатки Тогда
			ЗаполнитьПоОстаткамОбъектовЗалога(,Истина);
			ЗаполнитьПоОстаткамОбъектовЗалога(,,Истина);
			ЗаполнитьПоОстаткамОбъектовЗалога(,,,Истина);
		КонецЕсли;
		//-МАН
	КонецЕсли;
КонецПроцедуры

//+МАН 28.01.25 Пока оставил старую процедуру
Процедура ЗаполнитьПоОстаткамОбъектовЗалогаСтарая(Остатки = Ложь, НаОХ = Ложь, Изъятые = Ложь, СумкаЗакрыта = Ложь, НовыеОЗ = Ложь, ОбновитьНовыеОЗ = Ложь)

	СкладВитринаНеЦО = СтрНайти(Объект.Склад, "Витрина") > 0 И Объект.Ломбард <> Справочники.ЛБ_Ломбарды.ЦентральныйОфис;
	
	Если Остатки ИЛИ НовыеОЗ ИЛИ ОбновитьНовыеОЗ ИЛИ ((НаОХ ИЛИ Изъятые ИЛИ СумкаЗакрыта) И НЕ СкладВитринаНеЦО) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога.Код КАК ОбъектЗалогаКод,
		|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
		|	РеквизитыОбъектаЗалога.Артикул КАК Артикул,
		|	СостоянияОбъектовЗалога.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
		|	РеквизитыОбъектаЗалога.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток КАК Количество,
		|	ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток КАК КоличествоФакт,
		|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток КАК СуммаОценки,
		|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток КАК СуммаОценкиФакт,
		|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделия,
		|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделияФакт,
		|	РеквизитыОбъектаЗалога.Проба КАК Проба,
		|	РеквизитыОбъектаЗалога.Проба КАК ПробаФакт,
		|	РеквизитыОбъектаЗалога.Категория КАК Категория,
		|	РеквизитыОбъектаЗалога.Категория КАК КатегорияФакт,
		|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМасса,
		|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМассаФакт,
		|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталла,
		|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталлаФакт,
		|	РеквизитыОбъектаЗалога.Проба.Владелец КАК Металл,
		|	РеквизитыОбъектаЗалога.Проба.Владелец КАК МеталлФакт,
		|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель КАК Залогодатель,
		|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Дата КАК ДатаОформленияЗайма,
		|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ОтветственныйСотрудник КАК Приемщик,
		|	РеквизитыОбъектаЗалога.Клеймо КАК Клеймо,
		|	РеквизитыОбъектаЗалога.Клеймо КАК КлеймоФакт,
		|	РеквизитыОбъектаЗалога.Именник КАК Именник,
		|	РеквизитыОбъектаЗалога.Именник КАК ИменникФакт,
		|	РеквизитыОбъектаЗалога.ДанныеИменника КАК ДанныеИменника,
		|	РеквизитыОбъектаЗалога.ДанныеИменника КАК ДанныеИменникаФакт,
		|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ОперацияЗайма,
		|	РасчетыСКлиентамиПоОбъектамЗалога.СуммаОстаток КАК ОстатокЗайма,
		|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
		|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлыФакт,
		|	РеквизитыОбъектаЗалога.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
		//|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиНачальнаяОстаток КАК СуммаОценкиНачальная,
		|	СостоянияОбъектовЗалога.СуммаЗайма КАК СуммаЗайма,
		|	СостоянияОбъектовЗалога.СуммаДолгаЗайма КАК СуммаДолгаЗайма,
		|	РеквизитыОбъектаЗалога.СостояниеИзделия КАК СостояниеИзделия,
		|	РеквизитыОбъектаЗалога.Дефекты КАК Дефекты,
		|	РеквизитыОбъектаЗалога.Вес30 КАК Вес30,
		|	РеквизитыОбъектаЗалога.СуммаОценкиМакс КАК СуммаОценкиМакс
		|ИЗ
		|	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(
		|			&НаДату,
		|			Ломбард = &Ломбард
		//+МАН 17.12.25
		|			И Склад = &Склад
		//-МАН
		|				И 500 = 500
		|				И 750 = 750
		|				И 760 = 760
		|				И 770 = 770) КАК ЛБ_ОбъектыЗалогаОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
		|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
		|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаДолгаЗайма КАК СуммаДолгаЗайма
		|		ИЗ
		|			РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(
		|					&НаДату,
		|					Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		|							И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		|							И НЕ Регистратор В
		|									(ВЫБРАТЬ
		|										ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
		|									ИЗ
		|										РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&НаДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
		|									ГДЕ
		|										ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (Регистратор))
		|						ИЛИ Регистратор ССЫЛКА Документ.ЛБ_НакладнаяНаОтгрузку
		|						ИЛИ Регистратор ССЫЛКА Документ.ЛБ_ИзменениеСтатусаНакладной
		|						ИЛИ Регистратор ССЫЛКА Документ.ЛБ_КарточкаЗалогодателя
		|						ИЛИ Регистратор ССЫЛКА Документ.ЛБ_КорректировкаНакладной
		|						ИЛИ Регистратор ССЫЛКА Документ.ЛБ_ПеремещениеОбъектовЗалога) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних) КАК СостоянияОбъектовЗалога
		|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = СостоянияОбъектовЗалога.ОбъектЗалога
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Клеймо КАК Клеймо,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК Вес,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесЧистый,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Именник КАК Именник,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ДанныеИменника КАК ДанныеИменника,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СостояниеИзделия КАК СостояниеИзделия,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Дефекты КАК Дефекты,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОписаниеИзделия КАК ОписаниеИзделия,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес30 КАК Вес30,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМакс КАК СуммаОценкиМакс,
		|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет
		|		ИЗ
		|			РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
		|					&НаДату,
		|					Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		|							И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		|							И НЕ Регистратор В
		|								(ВЫБРАТЬ
		|									ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
		|								ИЗ
		|									РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&НаДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
		|								ГДЕ
		|									ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (Регистратор))) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних) КАК РеквизитыОбъектаЗалога
		|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РеквизитыОбъектаЗалога.ОбъектЗалога
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
		|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки.СуммаОстаток КАК СуммаОстаток
		|		ИЗ
		|			РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Остатки(&НаДату, ) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки) КАК РасчетыСКлиентамиПоОбъектамЗалога
		|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РасчетыСКлиентамиПоОбъектамЗалога.ОбъектЗалога
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель КАК Залогодатель,
		|			МАКСИМУМ(ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Период) КАК Период,
		|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус
		|		ИЗ
		|			РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(
		|					&НаДату,
		|					Используется
		|						И ВЫБОР
		|							КОГДА СрокДействия <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|								ТОГДА ВЫБОР
		|										КОГДА СрокДействия <= &НаДату
		|											ТОГДА ЛОЖЬ
		|										ИНАЧЕ ИСТИНА
		|									КОНЕЦ
		|							ИНАЧЕ ИСТИНА
		|						КОНЕЦ) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель,
		|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ЛБ_СтатусыЗалогодателейСрезПоследних.Залогодатель,
		|			ЛБ_СтатусыЗалогодателейСрезПоследних.Период,
		|			ЛБ_СтатусыЗалогодателейСрезПоследних.Статус
		|		ИЗ
		|			РегистрСведений.ЛБ_СтатусыЗалогодателей.СрезПоследних(&НаДату, ) КАК ЛБ_СтатусыЗалогодателейСрезПоследних) КАК СтатусыЗалогодателей
		|		ПО ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель = СтатусыЗалогодателей.Залогодатель
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Период КАК Период,
		|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки КАК ВидВставки
		|		ИЗ
		|			РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(&НаДату, ) КАК ЛБ_ВставкиОбъектаЗалогаСрезПоследних) КАК ВставкиОЗ
		|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиОЗ.ОбъектЗалога
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога
		|		ИЗ
		|			РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(&НаДату, НомерСтрокиТаблицы <> 0) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних) КАК ВставкиМеталла
		|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиМеталла.ОбъектЗалога
		|ГДЕ
		|	ИСТИНА
		|	И ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет = РеквизитыОбъектаЗалога.ЗалоговыйБилет
		|	И 100 = 100
		|	И 200 = 200
		|	И 300 = 300
		|	И 400 = 400
		|	И 600 = 600
		|	И 700 = 700
		|	И 710 = 710
		|	И 720 = 720
		|	И 730 = 730
		|	И 740 = 740
		|	И 780 = 780
		|	И 800 = 800
		|	И 900 = 900
		|	И 444 = 444
		|	И 999 = 999
		|
		|УПОРЯДОЧИТЬ ПО
		|	Артикул";
		
		Запрос.УстановитьПараметр("НаДату", НачалоДня(Объект.Дата));    
		Запрос.УстановитьПараметр("Ломбард", Объект.Ломбард); 
		//+МАН 17.12.25
		Запрос.УстановитьПараметр("Склад", Объект.Склад);
		//-МАН
		
		//+МАН 21.11.24 Добавлены новые условия
		Если Остатки Тогда
			
			//СтатусВНакладнойВхождение = Новый Массив;
			//СтатусВНакладнойВхождение.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.Факт);
			//СтатусВНакладнойВхождение.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.СумкаОткрыта);
			//СтатусВНакладнойВхождение.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.ИсключенИзНакладной);
			
			СтатусыВхождения = Новый Массив;
			СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.Принят);
			СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.Продлен);
			СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.Возвращен);
			СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ВключенВНакладную);
			СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ОбъявленТорг);
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "999 = 999", "ВЫБОР
			|			КОГДА СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Наследство)
			|					И РасчетыСКлиентамиПоОбъектамЗалога.СуммаОстаток > 0
			|				ТОГДА ИСТИНА
			|			КОГДА СостоянияОбъектовЗалога.СтатусОбъектаЗалога В (&СтатусыВхождения)
			//|					И (СтатусыОЗВНакладной.Статус В (&СтатусВНакладнойВхождение)
			//|						ИЛИ СтатусыОЗВНакладной.Статус ЕСТЬ NULL)
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ЛОЖЬ
			|		КОНЕЦ");
			
			//Запрос.УстановитьПараметр("СтатусВНакладнойВхождение", СтатусВНакладнойВхождение);
			Запрос.УстановитьПараметр("СтатусыВхождения", СтатусыВхождения);
			
		ИначеЕсли НаОХ Тогда
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "999 = 999", "ВЫБОР
			|			КОГДА СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Наследство)
			|					И РасчетыСКлиентамиПоОбъектамЗалога.СуммаОстаток ЕСТЬ NULL
			|				ТОГДА ИСТИНА
			|			КОГДА СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение)
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ЛОЖЬ
			|		КОНЕЦ");
			
		ИначеЕсли Изъятые Тогда
			
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога.Код КАК ОбъектЗалогаКод,
			|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
			|	РеквизитыОбъектаЗалога.Артикул КАК Артикул,
			|	СостоянияОбъектовЗалога.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
			|	РеквизитыОбъектаЗалога.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ЛБ_ОбъектыЗалогаОстатки.КоличествоРасход КАК Количество,
			|	ЛБ_ОбъектыЗалогаОстатки.КоличествоРасход КАК КоличествоФакт,
			|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиРасход КАК СуммаОценки,
			|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиРасход КАК СуммаОценкиФакт,
			|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделия,
			|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделияФакт,
			|	РеквизитыОбъектаЗалога.Проба КАК Проба,
			|	РеквизитыОбъектаЗалога.Проба КАК ПробаФакт,
			|	РеквизитыОбъектаЗалога.Категория КАК Категория,
			|	РеквизитыОбъектаЗалога.Категория КАК КатегорияФакт,
			|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМасса,
			|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМассаФакт,
			|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталла,
			|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталлаФакт,
			|	РеквизитыОбъектаЗалога.Проба.Владелец КАК Металл,
			|	РеквизитыОбъектаЗалога.Проба.Владелец КАК МеталлФакт,
			|	РеквизитыОбъектаЗалога.Клеймо КАК Клеймо,
			|	РеквизитыОбъектаЗалога.Клеймо КАК КлеймоФакт,
			|	РеквизитыОбъектаЗалога.Именник КАК Именник,
			|	РеквизитыОбъектаЗалога.Именник КАК ИменникФакт,
			|	РеквизитыОбъектаЗалога.ДанныеИменника КАК ДанныеИменника,
			|	РеквизитыОбъектаЗалога.ДанныеИменника КАК ДанныеИменникаФакт,
			|	РасчетыСКлиентамиПоОбъектамЗалога.СуммаОстаток КАК ОстатокЗайма,
			|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
			|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлыФакт,
			|	РеквизитыОбъектаЗалога.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
			|	СостоянияОбъектовЗалога.СуммаЗайма КАК СуммаЗайма,
			|	СостоянияОбъектовЗалога.СуммаДолгаЗайма КАК СуммаДолгаЗайма,
			|	РеквизитыОбъектаЗалога.СостояниеИзделия КАК СостояниеИзделия,
			|	РеквизитыОбъектаЗалога.Дефекты КАК Дефекты,
			|	РеквизитыОбъектаЗалога.Вес30 КАК Вес30,
			|	РеквизитыОбъектаЗалога.СуммаОценкиМакс КАК СуммаОценкиМакс,
			|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель КАК Залогодатель,
			|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Дата КАК ДатаОформленияЗайма,
			|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ОтветственныйСотрудник КАК Приемщик,
			|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ОперацияЗайма
			//|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиНачальнаяРасход КАК СуммаОценкиНачальная
			|ИЗ
			|	РегистрНакопления.ЛБ_ОбъектыЗалога.Обороты(
			|			,
			|			&НаДату,
			|			Регистратор,
			|			Ломбард = &Ломбард
			//+МАН 17.12.25
			|			И Склад = &Склад
			//-МАН
			|				И 500 = 500
			|				И 750 = 750
			|				И 760 = 760
			|				И 770 = 770) КАК ЛБ_ОбъектыЗалогаОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
			|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
			|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаДолгаЗайма КАК СуммаДолгаЗайма,
			|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет
			|		ИЗ
			|			РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(
			|					&НаДату,
			|					Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|							И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|							И НЕ Регистратор В
			|									(ВЫБРАТЬ
			|										ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			|									ИЗ
			|										РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&НаДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			|									ГДЕ
			|										ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (Регистратор))
			|						ИЛИ Регистратор ССЫЛКА Документ.ЛБ_НакладнаяНаОтгрузку
			|						ИЛИ Регистратор ССЫЛКА Документ.ЛБ_ИзменениеСтатусаНакладной
			|						ИЛИ Регистратор ССЫЛКА Документ.ЛБ_КарточкаЗалогодателя
			|						ИЛИ Регистратор ССЫЛКА Документ.ЛБ_КорректировкаНакладной
			|						ИЛИ Регистратор ССЫЛКА Документ.ЛБ_ПеремещениеОбъектовЗалога) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних
			|		ГДЕ
			|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Изъят)) КАК СостоянияОбъектовЗалога
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = СостоянияОбъектовЗалога.ОбъектЗалога
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Клеймо КАК Клеймо,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК Вес,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесЧистый,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Именник КАК Именник,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ДанныеИменника КАК ДанныеИменника,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СостояниеИзделия КАК СостояниеИзделия,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Дефекты КАК Дефекты,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОписаниеИзделия КАК ОписаниеИзделия,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес30 КАК Вес30,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМакс КАК СуммаОценкиМакс,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет
			|		ИЗ
			|			РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
			|					&НаДату,
			|					Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|							И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|							И НЕ Регистратор В
			|								(ВЫБРАТЬ
			|									ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			|								ИЗ
			|									РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&НаДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			|								ГДЕ
			|									ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (Регистратор))) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних) КАК РеквизитыОбъектаЗалога
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РеквизитыОбъектаЗалога.ОбъектЗалога
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
			|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки.СуммаОстаток КАК СуммаОстаток
			|		ИЗ
			|			РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Остатки(&НаДату, ) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки) КАК РасчетыСКлиентамиПоОбъектамЗалога
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РасчетыСКлиентамиПоОбъектамЗалога.ОбъектЗалога
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель КАК Залогодатель,
			|			МАКСИМУМ(ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Период) КАК Период,
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус
			|		ИЗ
			|			РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(
			|					&НаДату,
			|					Используется
			|						И ВЫБОР
			|							КОГДА СрокДействия <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|								ТОГДА ВЫБОР
			|										КОГДА СрокДействия <= &НаДату
			|											ТОГДА ЛОЖЬ
			|										ИНАЧЕ ИСТИНА
			|									КОНЕЦ
			|							ИНАЧЕ ИСТИНА
			|						КОНЕЦ) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель,
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			ЛБ_СтатусыЗалогодателейСрезПоследних.Залогодатель,
			|			ЛБ_СтатусыЗалогодателейСрезПоследних.Период,
			|			ЛБ_СтатусыЗалогодателейСрезПоследних.Статус
			|		ИЗ
			|			РегистрСведений.ЛБ_СтатусыЗалогодателей.СрезПоследних(&НаДату, ) КАК ЛБ_СтатусыЗалогодателейСрезПоследних) КАК СтатусыЗалогодателей
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель = СтатусыЗалогодателей.Залогодатель
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Период КАК Период,
			|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки КАК ВидВставки
			|		ИЗ
			|			РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(&НаДату, ) КАК ЛБ_ВставкиОбъектаЗалогаСрезПоследних) КАК ВставкиОЗ
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиОЗ.ОбъектЗалога
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога
			|		ИЗ
			|			РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(&НаДату, НомерСтрокиТаблицы <> 0) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних) КАК ВставкиМеталла
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиМеталла.ОбъектЗалога
			|ГДЕ
			|	ИСТИНА
			|	И ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет = РеквизитыОбъектаЗалога.ЗалоговыйБилет
			|	И ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет = СостоянияОбъектовЗалога.ЗалоговыйБилет
			|	И ЛБ_ОбъектыЗалогаОстатки.КоличествоРасход > 0
			|	И 100 = 100
			|	И 200 = 200
			|	И 300 = 300
			|	И 400 = 400
			|	И 600 = 600
			|	И 700 = 700
			|	И 710 = 710
			|	И 720 = 720
			|	И 730 = 730
			|	И 740 = 740
			|	И 780 = 780
			|	И 800 = 800
			|	И 900 = 900
			|	И 444 = 444
			|	И 999 = 999
			|
			|УПОРЯДОЧИТЬ ПО
			|	Артикул";
			
		ИначеЕсли СумкаЗакрыта Тогда
			
			СтатусыВхождения = Новый Массив;
			СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ВключенВНакладную);
			СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ОбъявленТорг);
			
			//СтатусВНакладнойВхождение = Новый Массив;
			//СтатусВНакладнойВхождение.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.СумкаЗакрыта);
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "999 = 999", "ВЫБОР
			|			КОГДА СостоянияОбъектовЗалога.СтатусОбъектаЗалога В (&СтатусыВхождения)
			//|					И СтатусыОЗВНакладной.Статус В (&СтатусВНакладнойВхождение)
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ЛОЖЬ
			|		КОНЕЦ");
			
			Запрос.УстановитьПараметр("СтатусыВхождения", СтатусыВхождения);
			//Запрос.УстановитьПараметр("СтатусВНакладнойВхождение", СтатусВНакладнойВхождение);
			
			//+МАН 24.03.25
		ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога.Код КАК ОбъектЗалогаКод,
			|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
			|	РеквизитыОбъектаЗалога.Артикул КАК Артикул,
			|	СостоянияОбъектовЗалога.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
			|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ВидОперации КАК ЗалоговыйБилетВидОперации,
			|	РеквизитыОбъектаЗалога.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ЛБ_ОбъектыЗалогаОстатки.КоличествоКонечныйОстаток КАК Количество,
			|	ЛБ_ОбъектыЗалогаОстатки.КоличествоКонечныйОстаток КАК КоличествоФакт,
			|	СостоянияОбъектовЗалога.СуммаЗайма КАК СуммаЗайма,
			|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиКонечныйОстаток КАК СуммаОценки,
			|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиКонечныйОстаток КАК СуммаОценкиФакт,
			|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделия,
			|	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделияФакт,
			|	РеквизитыОбъектаЗалога.Проба КАК Проба,
			|	РеквизитыОбъектаЗалога.Проба КАК ПробаФакт,
			|	РеквизитыОбъектаЗалога.Категория КАК Категория,
			|	РеквизитыОбъектаЗалога.Категория КАК КатегорияФакт,
			|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМасса,
			|	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМассаФакт,
			|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталла,
			|	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталлаФакт,
			|	РеквизитыОбъектаЗалога.Проба.Владелец КАК Металл,
			|	РеквизитыОбъектаЗалога.Проба.Владелец КАК МеталлФакт,
			|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель КАК Залогодатель,
			|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Дата КАК ДатаОформленияЗайма,
			|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ОтветственныйСотрудник КАК Приемщик,
			|	РеквизитыОбъектаЗалога.Клеймо КАК Клеймо,
			|	РеквизитыОбъектаЗалога.Клеймо КАК КлеймоФакт,
			|	РеквизитыОбъектаЗалога.Именник КАК Именник,
			|	РеквизитыОбъектаЗалога.Именник КАК ИменникФакт,
			|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ОперацияЗайма,
			|	РасчетыСКлиентамиПоОбъектамЗалога.СуммаКонечныйОстаток КАК ОстатокЗайма,
			|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
			|	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлыФакт
			|ИЗ
			|	РегистрНакопления.ЛБ_ОбъектыЗалога.ОстаткиИОбороты(
			|			&СДаты,
			|			&ПоДату,
			|			Авто,
			|			,
			|			Ломбард = &Ломбард
			//+МАН 17.12.25
			|			И Склад = &Склад
			//-МАН
			|				И (ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог)
			|					ИЛИ ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление)
			|					ИЛИ ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога))
			|				И 500 = 500
			|				И 750 = 750
			|				И 760 = 760
			|				И 770 = 770) КАК ЛБ_ОбъектыЗалогаОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
			|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаЗайма КАК СуммаЗайма
			|		ИЗ
			//+МАН 03.06.25 Изменил, чтобы отбор шел по первоначальным документам.
			//|			РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(
			//|					&ПоДату,
			|			РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПервых(
			|					&СДаты,
			//-МАН
			|					Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|							И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|							И НЕ Регистратор В
			|									(ВЫБРАТЬ
			|										ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			|									ИЗ
			|										РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			|									ГДЕ
			|										ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (Регистратор))) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних) КАК СостоянияОбъектовЗалога
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = СостоянияОбъектовЗалога.ОбъектЗалога
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Клеймо КАК Клеймо,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК Вес,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесЧистый,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Именник КАК Именник,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Регистратор КАК Регистратор,
			|			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет
			|		ИЗ
			|			РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
			|					&ПоДату,
			|					Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|							И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|							И НЕ Регистратор В
			|								(ВЫБРАТЬ
			|									ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			|								ИЗ
			|									РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			|								ГДЕ
			|									ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (Регистратор))) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних) КАК РеквизитыОбъектаЗалога
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РеквизитыОбъектаЗалога.ОбъектЗалога
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты.ОбъектЗалога КАК ОбъектЗалога,
			|			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
			|		ИЗ
			|			РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.ОстаткиИОбороты(&СДаты, &ПоДату, Период, , ) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты) КАК РасчетыСКлиентамиПоОбъектамЗалога
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РасчетыСКлиентамиПоОбъектамЗалога.ОбъектЗалога
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель КАК Залогодатель,
			|			МАКСИМУМ(ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Период) КАК Период,
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус
			|		ИЗ
			|			РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(
			|					&ПоДату,
			|					Используется
			|						И ВЫБОР
			|							КОГДА СрокДействия <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|								ТОГДА ВЫБОР
			|										КОГДА СрокДействия <= &ПоДату
			|											ТОГДА ЛОЖЬ
			|										ИНАЧЕ ИСТИНА
			|									КОНЕЦ
			|							ИНАЧЕ ИСТИНА
			|						КОНЕЦ) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель,
			|			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			ЛБ_СтатусыЗалогодателейСрезПоследних.Залогодатель,
			|			ЛБ_СтатусыЗалогодателейСрезПоследних.Период,
			|			ЛБ_СтатусыЗалогодателейСрезПоследних.Статус
			|		ИЗ
			|			РегистрСведений.ЛБ_СтатусыЗалогодателей.СрезПоследних(, ) КАК ЛБ_СтатусыЗалогодателейСрезПоследних) КАК СтатусыЗалогодателей
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель = СтатусыЗалогодателей.Залогодатель
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Период КАК Период,
			|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			|			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки КАК ВидВставки
			|		ИЗ
			|			РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(&ПоДату, ) КАК ЛБ_ВставкиОбъектаЗалогаСрезПоследних) КАК ВставкиОЗ
			|		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиОЗ.ОбъектЗалога,
			|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|		ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога
			|	ИЗ
			|		РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(&ПоДату, НомерСтрокиТаблицы <> 0) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних) КАК ВставкиМеталла
			|ГДЕ
			|	ИСТИНА
			|	И НЕ СостоянияОбъектовЗалога.СтатусОбъектаЗалога ЕСТЬ NULL
			|	И (СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Принят)
			|			ИЛИ СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Возвращен))
			|	И ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет = РеквизитыОбъектаЗалога.ЗалоговыйБилет
			|	И ЛБ_ОбъектыЗалогаОстатки.Регистратор.Дата МЕЖДУ &СДаты И &ПоДату
			|	И ЛБ_ОбъектыЗалогаОстатки.Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|	И ЛБ_ОбъектыЗалогаОстатки.Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|	И НЕ ЛБ_ОбъектыЗалогаОстатки.Регистратор В(ВЫБРАТЬ
			|									ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
			|								ИЗ
			|									РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
			|								ГДЕ
			|									ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОбъектыЗалогаОстатки.Регистратор))
			|	И ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиКонечныйОстаток <> 0
			|	И 100 = 100
			|	И 200 = 200
			|	И 300 = 300
			|	И 400 = 400
			|	И 600 = 600
			|	И 700 = 700
			|	И 710 = 710
			|	И 720 = 720
			|	И 730 = 730
			|	И 740 = 740
			|	И 780 = 780
			|	И 800 = 800
			|	И 900 = 900
			|	И 444 = 444
			|	И 999 = 999
			|
			|УПОРЯДОЧИТЬ ПО
			|	Артикул";
			
			Запрос.УстановитьПараметр("СДаты", НачалоДня(Объект.Дата));    
			Запрос.УстановитьПараметр("ПоДату", ТекущаяДата());    
			//+МАН 17.12.25
			Запрос.УстановитьПараметр("Склад", Объект.Склад);
			//-МАН
		КонецЕсли;
		//-МАН
		
		Если Объект.ВидИнвентаризации = Перечисления.ЛБ_ВидИнвентаризации.Выборочная Тогда
			
			Если ЗначениеЗаполнено(Объект.ОтборДатаЗаймаОт) ИЛИ ЗначениеЗаполнено(Объект.ОтборДатаЗаймаДо) Тогда
				//Если ЗначениеЗаполнено(Объект.ОтборДатаЗаймаОт) И НЕ ЗначениеЗаполнено(Объект.ОтборДатаЗаймаДо) Тогда
				//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "500 = 500", "ЗалоговыйБилет.Дата >= &ОтборДатаЗаймаОт");
				//Если НЕ ЗначениеЗаполнено(Объект.ОтборДатаЗаймаОт) И ЗначениеЗаполнено(Объект.ОтборДатаЗаймаДо) Тогда
				//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "500 = 500", "ЗалоговыйБилет.Дата <= &ОтборДатаЗаймаДо");
				//Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "500 = 500", "ЗалоговыйБилет.Дата МЕЖДУ &ОтборДатаЗаймаОт И &ОтборДатаЗаймаДо"); //Мельников 14.05.24 Было "ЗалоговыйБилет.Дата <= &ОтборДатаЗаймаДо");
				//КонецЕсли;
				Запрос.УстановитьПараметр("ОтборДатаЗаймаОт", Объект.ОтборДатаЗаймаОт);
				Запрос.УстановитьПараметр("ОтборДатаЗаймаДо", Объект.ОтборДатаЗаймаДо);
			КонецЕсли;
			
			//15.05.24 Добавлен фильтр по статусу клиента.
			Если Объект.ФильтрСтатусыЗалогодателя.Количество() > 0 Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "400 = 400", "СтатусыЗалогодателей.Статус В (&СтатусЗалогодателя)"); 	
				Массив = ВернутьМассивИзФильтра(Объект.ФильтрСтатусыЗалогодателя, "Статус"); 				
				Запрос.УстановитьПараметр("СтатусЗалогодателя", Массив); 
			КонецЕсли;  
			
			//15.05.24 Добавлен фильтр по сумме оценки
			Если Объект.ОтборСуммаОценкиОт > 0 ИЛИ Объект.ОтборСуммаОценкиДо > 0 Тогда
				Если Остатки ИЛИ НаОХ ИЛИ СумкаЗакрыта Тогда
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "800 = 800", "ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток МЕЖДУ &ОтборСуммаОценкиОт И &ОтборСуммаОценкиДо");
				ИначеЕсли Изъятые Тогда
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "800 = 800", "ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиРасход МЕЖДУ &ОтборСуммаОценкиОт И &ОтборСуммаОценкиДо");
				ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "800 = 800", "ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиКонечныйОстаток МЕЖДУ &ОтборСуммаОценкиОт И &ОтборСуммаОценкиДо");
				КонецЕсли;
				
				Запрос.УстановитьПараметр("ОтборСуммаОценкиОт", Объект.ОтборСуммаОценкиОт );
				Запрос.УстановитьПараметр("ОтборСуммаОценкиДо", Объект.ОтборСуммаОценкиДо);
			КонецЕсли;	
			
			//+15.05.24 Добавлен фильтр по вставке
			Если Объект.ФильтрКамни.Количество() > 0 Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "710 = 710", "ВставкиОЗ.ВидВставки В (&ВидВставки)");
				Массив = ВернутьМассивИзФильтра(Объект.ФильтрКамни, "Вставка"); 				
				Запрос.УстановитьПараметр("ВидВставки", Массив); 
			КонецЕсли; 
			
			//+20.05.24 Добавлен фильтр по ОЗ без вставок
			Если Объект.ОтборБезВставок Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "720 = 720", "ВставкиОЗ.ВидВставки ЕСТЬ NULL");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "730 = 730", "ВставкиМеталла.ОбъектЗалога ЕСТЬ NULL");
			КонецЕсли; 
			
			//+20.05.24 Добавлен фильтр по вставкам металла
			Если Объект.ОтборВставкаМеталл Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "740 = 740", "НЕ ВставкиМеталла.ОбъектЗалога ЕСТЬ NULL");
			КонецЕсли; 
			
			//+27.05.24 Если добавляется строка
			Если НоваяСтрокаТЧ Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "770 = 770", "ОбъектЗалога = &ОбъектЗалога");
				Запрос.УстановитьПараметр("ОбъектЗалога", ДобавляемыйОЗ);
			КонецЕсли;
			
			//+МАН 21.03.25
			Если Объект.ОтборВставкаКомплектующие Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "780 = 780", "ТИПЗНАЧЕНИЯ(ВставкиОЗ.ВидВставки) = ТИП(Справочник.ЛБ_КомплектующиеИзделия)");
			КонецЕсли; 
			//-Мельников
			
			Если Объект.ФильтрЗалогодатели.Количество() > 0 тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "750 = 750", "ЗалоговыйБилет.Залогодатель В (&Клиенты)"); 	
				Массив = ВернутьМассивИзФильтра(Объект.ФильтрЗалогодатели, "Залогодатель"); 				
				Запрос.УстановитьПараметр("Клиенты", Массив); 
			КонецЕсли;  
			
			Если Объект.ФильтрПриемщики.Количество() > 0 тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "760 = 760", "ЗалоговыйБилет.Ответственный В (&Приемщики)"); 	
				Массив = ВернутьМассивИзФильтра(Объект.ФильтрПриемщики, "Приемщик"); 				
				Запрос.УстановитьПараметр("Приемщики", Массив); 
			КонецЕсли; 		
			
			Если Объект.ФильтрСтатусы.Количество() > 0 тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "444 = 444", "СостоянияОбъектовЗалога.СтатусОбъектаЗалога В (&СтатусОбъектаЗалога)"); 	
				Массив = ВернутьМассивИзФильтра(Объект.ФильтрСтатусы, "Статус"); 				
				Запрос.УстановитьПараметр("СтатусОбъектаЗалога", Массив); 
			КонецЕсли;
			
			//+МАН 25.11.24 Фильтры для реквизитов
			Если Объект.ФильтрВидыИзделий.Количество() > 0 Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "100 = 100", "РеквизитыОбъектаЗалога.ВидИзделия В (&ВидИзделия)");
				Массив = ВернутьМассивИзФильтра(Объект.ФильтрВидыИзделий, "ВидИзделия");
				Запрос.УстановитьПараметр("ВидИзделия", Массив);
			КонецЕсли;
			
			Если Объект.ФильтрКатегории.Количество() > 0 Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "200 = 200", "РеквизитыОбъектаЗалога.Категория В (&Категории)");
				Массив = ВернутьМассивИзФильтра(Объект.ФильтрКатегории, "Категория");
				Запрос.УстановитьПараметр("Категории", Массив);
			КонецЕсли;
			
			Если Объект.ФильтрПробы.Количество() > 0 Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "300 = 300", "РеквизитыОбъектаЗалога.Проба В (&Пробы)");
				Массив = ВернутьМассивИзФильтра(Объект.ФильтрПробы, "Проба");
				Запрос.УстановитьПараметр("Пробы", Массив);
			КонецЕсли;
			
			Если Объект.ОтборОбщаяМассаОт > 0 ИЛИ Объект.ОтборОбщаяМассаДо > 0 Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "700 = 700", "РеквизитыОбъектаЗалога.Вес МЕЖДУ &ОтборОбщаяМассаОт И &ОтборОбщаяМассаДо");
				Запрос.УстановитьПараметр("ОтборОбщаяМассаОт", Объект.ОтборОбщаяМассаОт);
				Запрос.УстановитьПараметр("ОтборОбщаяМассаДо", Объект.ОтборОбщаяМассаДо);
			КонецЕсли;
			
			Если Объект.ОтборМассаМеталлаОт > 0 ИЛИ Объект.ОтборМассаМеталлаДо > 0 Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "900 = 900", "РеквизитыОбъектаЗалога.ВесЧистый МЕЖДУ &ОтборМассаМеталлаОт И &ОтборМассаМеталлаДо");
				Запрос.УстановитьПараметр("ОтборМассаМеталлаОт", Объект.ОтборМассаМеталлаОт);
				Запрос.УстановитьПараметр("ОтборМассаМеталлаДо", Объект.ОтборМассаМеталлаДо);
			КонецЕсли;	
			
			//+15.05.24 Добавлен фильтр по именнику
			Если Объект.ОтборИменник Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "600 = 600", "РеквизитыОбъектаЗалога.Именник = &ОтборИменник");
				Запрос.УстановитьПараметр("ОтборИменник", ПредопределенноеЗначение("Перечисление.ЛБ_Именник.Да"));
			КонецЕсли;
		КонецЕсли;  
		
		тз = Запрос.Выполнить().Выгрузить();
		
		Если Остатки ИЛИ СумкаЗакрыта Тогда
			
			МассивУдаляемыхСтрокТЗ = Новый Массив;
			
			Для каждого Стр Из тз Цикл
				СтатусОЗ = ПолучитьСтатусОЗВнакладной(НачалоДня(Объект.Дата), Стр.ОбъектЗалога);
				
				Если Остатки Тогда
					Если СтатусОЗ = Неопределено
						ИЛИ СтатусОЗ = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.Факт
						ИЛИ СтатусОЗ = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.СумкаОткрыта
						ИЛИ СтатусОЗ = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.ИсключенИзНакладной Тогда
						
						Продолжить;					
					Иначе
						//тз.Удалить(Стр);
						МассивУдаляемыхСтрокТЗ.Добавить(Стр);
					КонецЕсли;
				ИначеЕсли СумкаЗакрыта Тогда
					Если СтатусОЗ = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.СумкаЗакрыта Тогда
						
						Продолжить;
					Иначе
						//тз.Удалить(Стр);
						МассивУдаляемыхСтрокТЗ.Добавить(Стр);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			Если МассивУдаляемыхСтрокТЗ.Количество() > 0 Тогда
				Для каждого СтрМассиваТЗ Из МассивУдаляемыхСтрокТЗ Цикл
					тз.Удалить(СтрМассиваТЗ);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;	
		
		Строка = Новый КвалификаторыСтроки(1024, ДопустимаяДлина.Переменная);
		М = Новый Массив;
		М.Добавить(Тип("Строка"));
		ТипС = Новый ОписаниеТипов(М,, Строка);
		
		//+МАН 28.10.24 Получачем описание из регистра сведений ЛБ_РеквизитыОбъектаЗалога т.к. в запрос невыбрать с неограниченной длиной
		СтрокаОписания = Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная);
		ТипСтрокиОписания = Новый ОписаниеТипов(М,, СтрокаОписания);
		тз.Колонки.Добавить("ОписаниеИзделия", ТипСтрокиОписания);
		//-МАН
		
		тз.Колонки.Добавить("Отклонения", ТипС);
		
		//+Мельников 17.05.24 Определение суммы займа по объекту залога
		Для каждого СтрТЗ Из тз Цикл
			
			//+МАН 28.10.24 Получачем описание из регистра сведений ЛБ_РеквизитыОбъектаЗалога т.к. в запрос невыбрать с неограниченной длиной
			НаборЗаписей = РегистрыСведений.ЛБ_РеквизитыОбъектаЗалога.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(СтрТЗ.ОперацияЗайма);
			НаборЗаписей.Прочитать();
			
			Для каждого СтрНЗ Из НаборЗаписей Цикл
				
				Если СтрНЗ.ОбъектЗалога <> СтрТЗ.ОбъектЗалога Тогда
					Продолжить;
				КонецЕсли;
				
				СтрТЗ.ОписаниеИзделия = СтрНЗ.ОписаниеИзделия;
				
			КонецЦикла;
			//-МАН
			
			СтрТЗ.Отклонения = ПолучитьОтклонениеПоОЗ(СтрТЗ.ОбъектЗалога);
			
		КонецЦикла;
		//-Мельников
		
		Если НЕ НоваяСтрокаТЧ Тогда
			//+МАН 25.11.24
			Если Остатки Тогда
				Объект.Товары.Загрузить(тз);
			ИначеЕсли НаОХ Тогда
				Объект.НаОХ.Загрузить(тз);
			ИначеЕсли Изъятые Тогда
				Объект.Изъятые.Загрузить(тз);
			ИначеЕсли СумкаЗакрыта Тогда
				Объект.СумкаЗакрыта.Загрузить(тз);
			ИначеЕсли НовыеОЗ Тогда
				Объект.НовыеОЗ.Загрузить(тз);
			ИначеЕсли ОбновитьНовыеОЗ Тогда
				Если тз.Количество() > 0 Тогда
					
					МассивУдаляемыхСтрок = Новый Массив;
					
					Для каждого СтрТЗ Из тз Цикл
						
						Отбор = Новый Структура;
						Отбор.Вставить("ОбъектЗалога", СтрТЗ.ОбъектЗалога);
						Отбор.Вставить("Артикул", СтрТЗ.Артикул);
						
						МассивНайденныхОЗ = Объект.НовыеОЗ.НайтиСтроки(Отбор);
						
						Если МассивНайденныхОЗ.Количество() > 0 Тогда
							МассивУдаляемыхСтрок.Добавить(СтрТЗ);
							Продолжить;
						КонецЕсли;
						
						НоваяСтр = Объект.НовыеОЗ.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтр, СтрТЗ);
						
					КонецЦикла;
					
					Если МассивУдаляемыхСтрок.Количество() > 0 Тогда
						Для каждого СтрМассива Из МассивУдаляемыхСтрок Цикл
							тз.Удалить(СтрМассива);
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			//-МАН
		Иначе
			Если тз.Количество() > 0 Тогда
				Для каждого СтрТЗ Из тз Цикл
					НоваяСтр = Объект.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтр, СтрТЗ)
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		МассивОЗ = тз.ВыгрузитьКолонку("ОбъектЗалога");
		
		ЗапросВставки = Новый Запрос;
		ЗапросВставки.Текст ="ВЫБРАТЬ
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Период КАК Период,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Регистратор КАК Регистратор,
		//|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.НомерСтроки КАК НомерСтроки,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Активность КАК Активность,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки КАК ВидВставки,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ФормаОгранки КАК ФормаОгранки,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидОгранки КАК ВидОгранки,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.КачествоОгранки КАК КачествоОгранки,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Длина КАК Длина,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Ширина КАК Ширина,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Высота КАК Высота,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Диаметр КАК Диаметр,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Диаметр1 КАК Диаметр1,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Диаметр2 КАК Диаметр2,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Вес КАК Вес,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВесГраммы КАК ВесГраммы,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Цена КАК Цена,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Количество КАК Количество,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.СуммаОценки КАК Сумма,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки КАК ВидВставкиФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ФормаОгранки КАК ФормаОгранкиФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидОгранки КАК ВидОгранкиФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.КачествоОгранки КАК КачествоОгранкиФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Длина КАК ДлинаФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Ширина КАК ШиринаФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Высота КАК ВысотаФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Диаметр КАК ДиаметрФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Диаметр1 КАК Диаметр1Факт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Диаметр2 КАК Диаметр2Факт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмеренияФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Вес КАК ВесФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВесГраммы КАК ВесГраммыФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Цена КАК ЦенаФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Количество КАК КоличествоФакт,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаФакт,
		//+Мельников 16.10.24 Инвентаризация. Заявка 2464
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.НеОценивать КАК НеОценивать,
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.НеОценивать КАК НеОцениватьФакт,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки) = ТИП(Справочник.ЛБ_ДрагоценныеКамни)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыКомплектующихИзделия.Вставка)
		|		КОГДА ТИПЗНАЧЕНИЯ(ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки) = ТИП(Справочник.ЛБ_КомплектующиеИзделия)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыКомплектующихИзделия.Комплектующее)
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Вид
		//-Мельников
		|ИЗ
		|	РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(100 = 100, ОбъектЗалога В (&МассивОЗ)) КАК ЛБ_ВставкиОбъектаЗалогаСрезПоследних
		|ГДЕ
		|	200 = 200
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ,
		|	НомерСтрокиТаблицы";
		
		Если Остатки ИЛИ НаОХ ИЛИ Изъятые ИЛИ СумкаЗакрыта Тогда
			ЗапросВставки.Текст = СтрЗаменить(ЗапросВставки.Текст, "100 = 100", "&НаДату");
			
			ЗапросВставки.УстановитьПараметр("НаДату", НачалоДня(Объект.Дата)); 
		ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
			ЗапросВставки.Текст = СтрЗаменить(ЗапросВставки.Текст, "100 = 100", "&ПоДату");
			ЗапросВставки.Текст = СтрЗаменить(ЗапросВставки.Текст, "200 = 200", "ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Период МЕЖДУ &СДаты И &ПоДату");
			
			ЗапросВставки.УстановитьПараметр("СДаты", НачалоДня(Объект.Дата)); 
			ЗапросВставки.УстановитьПараметр("ПоДату", ТекущаяДата()); 
		КонецЕсли;
		
		ЗапросВставки.УстановитьПараметр("МассивОЗ", МассивОЗ); 
		
		Если НЕ НоваяСтрокаТЧ ИЛИ НЕ ОбновитьНовыеОЗ Тогда
			//+МАН 25.11.24
			Если Остатки Тогда
				Объект.ВставкиФакт.Очистить();
			ИначеЕсли НаОХ Тогда
				Объект.ВставкиКамнейНаОХ.Очистить();
			ИначеЕсли Изъятые Тогда
				Объект.ВставкиКамнейИзъятые.Очистить();
			ИначеЕсли СумкаЗакрыта Тогда
				Объект.ВставкиКамнейСумкаЗакрыта.Очистить();
			ИначеЕсли НовыеОЗ Тогда
				Объект.ВставкиКамнейНовыеОЗ.Очистить();
			КонецЕсли;
			//-МАН
		КонецЕсли;
		
		//+Мельников 20.05.24
		ТзВствки = ЗапросВставки.Выполнить().Выгрузить();
		//-Мельников
		
		КоличествоВставок = 0;
		КоличествоЗагруженныхВставок = 0;
		
		ВыборкаВставки = ЗапросВставки.Выполнить().Выбрать();
		Пока ВыборкаВставки.Следующий() Цикл
			//+МАН 25.11.24
			Если Остатки Тогда
				КоличествоВставок = КоличествоВставок(ВыборкаВставки.ОбъектЗалога, НачалоДня(Объект.Дата));
				КоличествоЗагруженныхВставок = КоличествоЗагруженныхВставок(ВыборкаВставки.ОбъектЗалога, "ВставкиФакт");
				
				Если КоличествоЗагруженныхВставок <> КоличествоВставок Тогда
					НовСтрВставки = Объект.ВставкиФакт.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставки, ВыборкаВставки);
				Иначе
					Продолжить;
				КонецЕсли;
			ИначеЕсли НаОХ Тогда
				КоличествоВставок = КоличествоВставок(ВыборкаВставки.ОбъектЗалога, НачалоДня(Объект.Дата));
				КоличествоЗагруженныхВставок = КоличествоЗагруженныхВставок(ВыборкаВставки.ОбъектЗалога, "ВставкиКамнейНаОХ");
				
				Если КоличествоЗагруженныхВставок <> КоличествоВставок Тогда
					НовСтрВставки = Объект.ВставкиКамнейНаОХ.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставки, ВыборкаВставки);	
				Иначе
					Продолжить;
				КонецЕсли;
			ИначеЕсли Изъятые Тогда
				КоличествоВставок = КоличествоВставок(ВыборкаВставки.ОбъектЗалога, НачалоДня(Объект.Дата));
				КоличествоЗагруженныхВставок = КоличествоЗагруженныхВставок(ВыборкаВставки.ОбъектЗалога, "ВставкиКамнейИзъятые");
				
				Если КоличествоЗагруженныхВставок <> КоличествоВставок Тогда
					НовСтрВставки = Объект.ВставкиКамнейИзъятые.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставки, ВыборкаВставки);	
				Иначе
					Продолжить;
				КонецЕсли;
			ИначеЕсли СумкаЗакрыта Тогда
				КоличествоВставок = КоличествоВставок(ВыборкаВставки.ОбъектЗалога, НачалоДня(Объект.Дата));
				КоличествоЗагруженныхВставок = КоличествоЗагруженныхВставок(ВыборкаВставки.ОбъектЗалога, "ВставкиКамнейСумкаЗакрыта");
				
				Если КоличествоЗагруженныхВставок <> КоличествоВставок Тогда
					НовСтрВставки = Объект.ВставкиКамнейСумкаЗакрыта.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставки, ВыборкаВставки);	
				Иначе
					Продолжить;
				КонецЕсли;
			ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
				КоличествоВставок = КоличествоВставок(ВыборкаВставки.ОбъектЗалога, НачалоДня(Объект.Дата), Истина);
				КоличествоЗагруженныхВставок = КоличествоЗагруженныхВставок(ВыборкаВставки.ОбъектЗалога, "ВставкиКамнейНовыеОЗ");
				
				Если КоличествоЗагруженныхВставок <> КоличествоВставок Тогда
					НовСтрВставки = Объект.ВставкиКамнейНовыеОЗ.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставки, ВыборкаВставки);	
				Иначе
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			//-МАН
		КонецЦикла;
		
		//+Мельников 17.05.24 Добавлен поиск вставок металла
		ЗапросВставкиМеталла = Новый Запрос;
		ЗапросВставкиМеталла.Текст ="ВЫБРАТЬ
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ВесЧистый КАК Вес,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ВесВПробеЧистоты КАК ВесВПробеЧистоты,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценки,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.Проба КАК ПробаФакт,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесФакт,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ВесВПробеЧистоты КАК ВесВПробеЧистотыФакт,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмеренияФакт,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценкиФакт
		|ИЗ
		|	РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(
		|			100 = 100,
		|			ОбъектЗалога В (&МассивОЗ)
		|				И НомерСтрокиТаблицы <> 0) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних
		|ГДЕ
		|	200 = 200";
		Если Остатки ИЛИ НаОХ ИЛИ Изъятые ИЛИ СумкаЗакрыта Тогда
			ЗапросВставкиМеталла.Текст = СтрЗаменить(ЗапросВставкиМеталла.Текст, "100 = 100", "&НаДату");
			
			ЗапросВставкиМеталла.УстановитьПараметр("НаДату", НачалоДня(Объект.Дата)); 
		ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
			ЗапросВставкиМеталла.Текст = СтрЗаменить(ЗапросВставкиМеталла.Текст, "100 = 100", "&ПоДату");
			ЗапросВставкиМеталла.Текст = СтрЗаменить(ЗапросВставкиМеталла.Текст, "200 = 200", "ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.Период МЕЖДУ &СДаты И &ПоДату");
			
			ЗапросВставкиМеталла.УстановитьПараметр("СДаты", НачалоДня(Объект.Дата)); 
			ЗапросВставкиМеталла.УстановитьПараметр("ПоДату", ТекущаяДата()); 
		КонецЕсли;
		
		ЗапросВставкиМеталла.УстановитьПараметр("МассивОЗ", МассивОЗ); 
		
		Если НЕ НоваяСтрокаТЧ ИЛИ НЕ ОбновитьНовыеОЗ Тогда
			//+МАН 25.11.24
			Если Остатки Тогда
				Объект.ВставкиМеталла.Очистить();
			ИначеЕсли НаОХ Тогда
				Объект.ВставкиМеталлаНаОХ.Очистить();
			ИначеЕсли Изъятые Тогда
				Объект.ВставкиМеталлаИзъятые.Очистить();
			ИначеЕсли СумкаЗакрыта Тогда
				Объект.ВставкиМеталлаСумкаЗакрыта.Очистить();
			ИначеЕсли НовыеОЗ Тогда
				Объект.ВставкиМеталлаНовыеОЗ.Очистить();
			КонецЕсли;
			//-МАН
		КонецЕсли;
		
		ТзВствкиМеталла = ЗапросВставкиМеталла.Выполнить().Выгрузить();
		
		КоличествоВставокМеталла = 0;
		КоличествоЗагруженныхВставокМеталла = 0;
		
		ВыборкаВставкиМеталла = ЗапросВставкиМеталла.Выполнить().Выбрать();
		Пока ВыборкаВставкиМеталла.Следующий() Цикл
			//+МАН 25.11.24
			Если Остатки Тогда
				КоличествоВставокМеталла = КоличествоВставокМеталла(ВыборкаВставкиМеталла.ОбъектЗалога, НачалоДня(Объект.Дата));
				КоличествоЗагруженныхВставокМеталла = КоличествоЗагруженныхВставок(ВыборкаВставкиМеталла.ОбъектЗалога, "ВставкиМеталла");
				
				Если КоличествоЗагруженныхВставокМеталла <> КоличествоВставокМеталла Тогда
					НовСтрВставкиМеталла = Объект.ВставкиМеталла.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставкиМеталла, ВыборкаВставкиМеталла);	
				Иначе
					Продолжить;
				КонецЕсли;
			ИначеЕсли НаОХ Тогда
				КоличествоВставокМеталла = КоличествоВставокМеталла(ВыборкаВставкиМеталла.ОбъектЗалога, НачалоДня(Объект.Дата));
				КоличествоЗагруженныхВставокМеталла = КоличествоЗагруженныхВставок(ВыборкаВставкиМеталла.ОбъектЗалога, "ВставкиМеталлаНаОХ");
				
				Если КоличествоЗагруженныхВставокМеталла <> КоличествоВставокМеталла Тогда
					НовСтрВставкиМеталла = Объект.ВставкиМеталлаНаОХ.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставкиМеталла, ВыборкаВставкиМеталла);	
				Иначе
					Продолжить;
				КонецЕсли;
			ИначеЕсли Изъятые Тогда
				КоличествоВставокМеталла = КоличествоВставокМеталла(ВыборкаВставкиМеталла.ОбъектЗалога, НачалоДня(Объект.Дата));
				КоличествоЗагруженныхВставокМеталла = КоличествоЗагруженныхВставок(ВыборкаВставкиМеталла.ОбъектЗалога, "ВставкиМеталлаИзъятые");
				
				Если КоличествоЗагруженныхВставокМеталла <> КоличествоВставокМеталла Тогда
					НовСтрВставкиМеталла = Объект.ВставкиМеталлаИзъятые.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставкиМеталла, ВыборкаВставкиМеталла);	
				Иначе
					Продолжить;
				КонецЕсли;
			ИначеЕсли СумкаЗакрыта Тогда
				КоличествоВставокМеталла = КоличествоВставокМеталла(ВыборкаВставкиМеталла.ОбъектЗалога, НачалоДня(Объект.Дата));
				КоличествоЗагруженныхВставокМеталла = КоличествоЗагруженныхВставок(ВыборкаВставкиМеталла.ОбъектЗалога, "ВставкиМеталлаСумкаЗакрыта");
				
				Если КоличествоЗагруженныхВставокМеталла <> КоличествоВставокМеталла Тогда
					НовСтрВставкиМеталла = Объект.ВставкиМеталлаСумкаЗакрыта.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставкиМеталла, ВыборкаВставкиМеталла);	
				Иначе
					Продолжить;
				КонецЕсли;
			ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
				КоличествоВставокМеталла = КоличествоВставокМеталла(ВыборкаВставкиМеталла.ОбъектЗалога, НачалоДня(Объект.Дата), Истина);
				КоличествоЗагруженныхВставокМеталла = КоличествоЗагруженныхВставок(ВыборкаВставкиМеталла.ОбъектЗалога, "ВставкиМеталлаНовыеОЗ");
				
				Если КоличествоЗагруженныхВставокМеталла <> КоличествоВставокМеталла Тогда
					НовСтрВставкиМеталла = Объект.ВставкиМеталлаНовыеОЗ.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрВставкиМеталла, ВыборкаВставкиМеталла);	
				Иначе
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			//-МАН
		КонецЦикла;
		
		//+МАН 26.03.25
		Если Остатки Тогда
			ТЧВставки = Объект.ВставкиФакт;
			ТЧВставкиМеталла = Объект.ВставкиМеталла;
		ИначеЕсли НаОХ Тогда
			ТЧВставки = Объект.ВставкиКамнейНаОХ;
			ТЧВставкиМеталла = Объект.ВставкиМеталлаНаОХ;
		ИначеЕсли Изъятые Тогда
			ТЧВставки = Объект.ВставкиКамнейИзъятые;
			ТЧВставкиМеталла = Объект.ВставкиМеталлаИзъятые;
		ИначеЕсли СумкаЗакрыта Тогда
			ТЧВставки = Объект.ВставкиКамнейСумкаЗакрыта;
			ТЧВставкиМеталла = Объект.ВставкиМеталлаСумкаЗакрыта;
		ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
			ТЧВставки = Объект.ВставкиКамнейНовыеОЗ;
			ТЧВставкиМеталла = Объект.ВставкиМеталлаНовыеОЗ;
		КонецЕсли;
		//-МАН
		
		Для каждого СтрОЗВставка Из ТЧВставки Цикл //ТзВствки Цикл
			
			Отбор = Новый Структура;
			Отбор.Вставить("ОбъектЗалога",СтрОЗВставка.ОбъектЗалога);
			
			//+МАН 25.11.24
			Если Остатки Тогда
				НайденныйОЗ = Объект.Товары.НайтиСтроки(Отбор);
			ИначеЕсли НаОХ Тогда
				НайденныйОЗ = Объект.НаОХ.НайтиСтроки(Отбор);
			ИначеЕсли Изъятые Тогда
				НайденныйОЗ = Объект.Изъятые.НайтиСтроки(Отбор);
			ИначеЕсли СумкаЗакрыта Тогда
				НайденныйОЗ = Объект.СумкаЗакрыта.НайтиСтроки(Отбор);
			ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
				НайденныйОЗ = Объект.НовыеОЗ.НайтиСтроки(Отбор);
			КонецЕсли;
			//-МАН
			
			Для каждого СтрОЗНайденный Из НайденныйОЗ Цикл
				СтрОЗНайденный.Вставка = ?(СтрОЗНайденный.Вставка = "", СтрОЗНайденный.Вставка, СтрОЗНайденный.Вставка + ", ") + СтрОЗВставка.ВидВставки.КраткоеНаименование;
			КонецЦикла;
		КонецЦикла;
		
		Для каждого СтрОЗВставкаМеталла Из ТЧВставкиМеталла Цикл //ТзВствкиМеталла Цикл
			
			Отбор = Новый Структура;
			Отбор.Вставить("ОбъектЗалога",СтрОЗВставкаМеталла.ОбъектЗалога);
			
			//+МАН 25.11.24
			Если Остатки Тогда
				НайденныйОЗ = Объект.Товары.НайтиСтроки(Отбор);
			ИначеЕсли НаОХ Тогда
				НайденныйОЗ = Объект.НаОХ.НайтиСтроки(Отбор);
			ИначеЕсли Изъятые Тогда
				НайденныйОЗ = Объект.Изъятые.НайтиСтроки(Отбор);
			ИначеЕсли СумкаЗакрыта Тогда
				НайденныйОЗ = Объект.СумкаЗакрыта.НайтиСтроки(Отбор);
			ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
				НайденныйОЗ = Объект.НовыеОЗ.НайтиСтроки(Отбор);
			КонецЕсли;
			//-МАН
			
			Для каждого СтрОЗНайденный Из НайденныйОЗ Цикл
				СтрОЗНайденный.Вставка = ?(СтрОЗНайденный.Вставка = "", СтрОЗНайденный.Вставка, СтрОЗНайденный.Вставка + ", ") + СтрОЗВставкаМеталла.Проба.Наименование;
			КонецЦикла;
		КонецЦикла;
		//-Мельников
		
		//+МАН 25.11.24
		Если Остатки Тогда
			ЗаполнитьПоОстаткамОбъектовЗалога(,Истина);
			ЗаполнитьПоОстаткамОбъектовЗалога(,,Истина);
			ЗаполнитьПоОстаткамОбъектовЗалога(,,,Истина);
		КонецЕсли;
		//-МАН
	КонецЕсли;
КонецПроцедуры

//+МАН 21.01.26 Пока не удалять
Процедура ЗаполнитьПоОстаткамОбъектовЗалога_(Остатки = Ложь, НаОХ = Ложь, Изъятые = Ложь, СумкаЗакрыта = Ложь, НовыеОЗ = Ложь, ОбновитьНовыеОЗ = Ложь)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога.Код КАК ОбъектЗалогаКод,
	               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
	               |	РеквизитыОбъектаЗалога.Артикул КАК Артикул,
	               |	СостоянияОбъектовЗалога.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
	               |	РеквизитыОбъектаЗалога.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток КАК Количество,
	               |	ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток КАК КоличествоФакт,
	               |	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток КАК СуммаОценки,
	               |	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток КАК СуммаОценкиФакт,
	               |	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделия,
	               |	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделияФакт,
	               |	РеквизитыОбъектаЗалога.Проба КАК Проба,
	               |	РеквизитыОбъектаЗалога.Проба КАК ПробаФакт,
	               |	РеквизитыОбъектаЗалога.Категория КАК Категория,
	               |	РеквизитыОбъектаЗалога.Категория КАК КатегорияФакт,
	               |	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМасса,
	               |	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМассаФакт,
	               |	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталла,
	               |	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталлаФакт,
	               |	РеквизитыОбъектаЗалога.Проба.Владелец КАК Металл,
	               |	РеквизитыОбъектаЗалога.Проба.Владелец КАК МеталлФакт,
	               |	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель КАК Залогодатель,
	               |	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Дата КАК ДатаОформленияЗайма,
	               |	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ОтветственныйСотрудник КАК Приемщик,
	               |	РеквизитыОбъектаЗалога.Клеймо КАК Клеймо,
	               |	РеквизитыОбъектаЗалога.Клеймо КАК КлеймоФакт,
	               |	РеквизитыОбъектаЗалога.Именник КАК Именник,
	               |	РеквизитыОбъектаЗалога.Именник КАК ИменникФакт,
	               |	РеквизитыОбъектаЗалога.ДанныеИменника КАК ДанныеИменника,
	               |	РеквизитыОбъектаЗалога.ДанныеИменника КАК ДанныеИменникаФакт,
	               |	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ОперацияЗайма,
	               |	РасчетыСКлиентамиПоОбъектамЗалога.СуммаОстаток КАК ОстатокЗайма,
	               |	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
	               |	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлыФакт,
	               |	РеквизитыОбъектаЗалога.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
	               |	СостоянияОбъектовЗалога.СуммаЗайма КАК СуммаЗайма,
	               |	СостоянияОбъектовЗалога.СуммаДолгаЗайма КАК СуммаДолгаЗайма,
	               |	РеквизитыОбъектаЗалога.СостояниеИзделия КАК СостояниеИзделия,
	               |	РеквизитыОбъектаЗалога.Дефекты КАК Дефекты,
	               |	РеквизитыОбъектаЗалога.Вес30 КАК Вес30,
	               |	РеквизитыОбъектаЗалога.СуммаОценкиМакс КАК СуммаОценкиМакс
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(
	               |			&НаДату,
	               |			Ломбард = &Ломбард
	               |				И Склад = &Склад
	               |				И 500 = 500
	               |				И 750 = 750
	               |				И 760 = 760
	               |				И 770 = 770) КАК ЛБ_ОбъектыЗалогаОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	               |			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
	               |			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
	               |			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаДолгаЗайма КАК СуммаДолгаЗайма
	               |		ИЗ
	               |			РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(
	               |					&НаДату,
	               |					(Регистратор.Ломбард = &Ломбард
	               |						ИЛИ Регистратор.ЛомбардКуда = &Ломбард)
	               |						И ВЫБОР
	               |							КОГДА Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
	               |								ТОГДА Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
	               |										И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
	               |										И НЕ Регистратор В
	               |												(ВЫБРАТЬ
	               |													ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
	               |												ИЗ
	               |													РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&НаДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
	               |												ГДЕ
	               |													ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))
	               |							КОГДА НЕ Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
	               |								ТОГДА ИСТИНА
	               |						КОНЕЦ) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних) КАК СостоянияОбъектовЗалога
	               |		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = СостоянияОбъектовЗалога.ОбъектЗалога
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
	               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
	               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
	               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Клеймо КАК Клеймо,
	               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК Вес,
	               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесЧистый,
	               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Именник КАК Именник,
	               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ДанныеИменника КАК ДанныеИменника,
	               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
	               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
	               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
	               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СостояниеИзделия КАК СостояниеИзделия,
	               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Дефекты КАК Дефекты,
	               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОписаниеИзделия КАК ОписаниеИзделия,
	               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес30 КАК Вес30,
	               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМакс КАК СуммаОценкиМакс,
	               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет
	               |		ИЗ
	               |			РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
	               |					&НаДату,
	               |					Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
	               |						И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
	               |						И НЕ Регистратор В
	               |								(ВЫБРАТЬ
	               |									ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
	               |								ИЗ
	               |									РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&НаДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
	               |								ГДЕ
	               |									ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних) КАК РеквизитыОбъектаЗалога
	               |		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РеквизитыОбъектаЗалога.ОбъектЗалога
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
	               |			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки.СуммаОстаток КАК СуммаОстаток
	               |		ИЗ
	               |			РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Остатки(&НаДату, ) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки) КАК РасчетыСКлиентамиПоОбъектамЗалога
	               |		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РасчетыСКлиентамиПоОбъектамЗалога.ОбъектЗалога
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель КАК Залогодатель,
	               |			МАКСИМУМ(ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Период) КАК Период,
	               |			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус
	               |		ИЗ
	               |			РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(
	               |					&НаДату,
	               |					Используется
	               |						И ВЫБОР
	               |							КОГДА СрокДействия <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |								ТОГДА ВЫБОР
	               |										КОГДА СрокДействия <= &НаДату
	               |											ТОГДА ЛОЖЬ
	               |										ИНАЧЕ ИСТИНА
	               |									КОНЕЦ
	               |							ИНАЧЕ ИСТИНА
	               |						КОНЕЦ) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель,
	               |			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
	               |			ЛБ_СтатусыЗалогодателейСрезПоследних.Залогодатель,
	               |			ЛБ_СтатусыЗалогодателейСрезПоследних.Период,
	               |			ЛБ_СтатусыЗалогодателейСрезПоследних.Статус
	               |		ИЗ
	               |			РегистрСведений.ЛБ_СтатусыЗалогодателей.СрезПоследних(&НаДату, ) КАК ЛБ_СтатусыЗалогодателейСрезПоследних) КАК СтатусыЗалогодателей
	               |		ПО ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель = СтатусыЗалогодателей.Залогодатель
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Период КАК Период,
	               |			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	               |			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки КАК ВидВставки
	               |		ИЗ
	               |			РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(&НаДату, ) КАК ЛБ_ВставкиОбъектаЗалогаСрезПоследних) КАК ВставкиОЗ
	               |		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиОЗ.ОбъектЗалога
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |			ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога
	               |		ИЗ
	               |			РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(&НаДату, НомерСтрокиТаблицы <> 0) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних) КАК ВставкиМеталла
	               |		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиМеталла.ОбъектЗалога
	               |ГДЕ
	               |	ИСТИНА
	               |	И ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет = РеквизитыОбъектаЗалога.ЗалоговыйБилет
	               |	И 100 = 100
	               |	И 200 = 200
	               |	И 300 = 300
	               |	И 400 = 400
	               |	И 600 = 600
	               |	И 700 = 700
	               |	И 710 = 710
	               |	И 720 = 720
	               |	И 730 = 730
	               |	И 740 = 740
	               |	И 780 = 780
	               |	И 800 = 800
	               |	И 900 = 900
	               |	И 444 = 444
	               |	И 999 = 999
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Артикул";
	
	Запрос.УстановитьПараметр("НаДату", НачалоДня(Объект.Дата));    
	Запрос.УстановитьПараметр("Ломбард", Объект.Ломбард); 
	//+МАН 17.12.25
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	//-МАН
	
	//+МАН 21.11.24 Добавлены новые условия
	Если Остатки Тогда
		
		//СтатусВНакладнойВхождение = Новый Массив;
		//СтатусВНакладнойВхождение.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.Факт);
		//СтатусВНакладнойВхождение.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.СумкаОткрыта);
		//СтатусВНакладнойВхождение.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.ИсключенИзНакладной);

		СтатусыВхождения = Новый Массив;
		СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.Принят);
		СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.Продлен);
		СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.Возвращен);
		СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ВключенВНакладную);
		СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ОбъявленТорг);
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "999 = 999", "ВЫБОР
	               |			КОГДА СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Наследство)
	               |					И РасчетыСКлиентамиПоОбъектамЗалога.СуммаОстаток > 0
	               |				ТОГДА ИСТИНА
				   |			КОГДА СостоянияОбъектовЗалога.СтатусОбъектаЗалога В (&СтатусыВхождения)
				   //|					И (СтатусыОЗВНакладной.Статус В (&СтатусВНакладнойВхождение)
				   //|						ИЛИ СтатусыОЗВНакладной.Статус ЕСТЬ NULL)
				   |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ");
		
		//Запрос.УстановитьПараметр("СтатусВНакладнойВхождение", СтатусВНакладнойВхождение);
		Запрос.УстановитьПараметр("СтатусыВхождения", СтатусыВхождения);
		
	ИначеЕсли НаОХ Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "999 = 999", "ВЫБОР
					|			КОГДА СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Наследство)
					|					И РасчетыСКлиентамиПоОбъектамЗалога.СуммаОстаток ЕСТЬ NULL
					|				ТОГДА ИСТИНА
					|			КОГДА СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение)
					|				ТОГДА ИСТИНА
					|			ИНАЧЕ ЛОЖЬ
					|		КОНЕЦ");
		
	ИначеЕсли Изъятые Тогда
		
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога.Код КАК ОбъектЗалогаКод,
		               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
		               |	РеквизитыОбъектаЗалога.Артикул КАК Артикул,
		               |	СостоянияОбъектовЗалога.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
		               |	РеквизитыОбъектаЗалога.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		               |	ЛБ_ОбъектыЗалогаОстатки.КоличествоРасход КАК Количество,
		               |	ЛБ_ОбъектыЗалогаОстатки.КоличествоРасход КАК КоличествоФакт,
		               |	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиРасход КАК СуммаОценки,
		               |	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиРасход КАК СуммаОценкиФакт,
		               |	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделия,
		               |	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделияФакт,
		               |	РеквизитыОбъектаЗалога.Проба КАК Проба,
		               |	РеквизитыОбъектаЗалога.Проба КАК ПробаФакт,
		               |	РеквизитыОбъектаЗалога.Категория КАК Категория,
		               |	РеквизитыОбъектаЗалога.Категория КАК КатегорияФакт,
		               |	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМасса,
		               |	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМассаФакт,
		               |	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталла,
		               |	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталлаФакт,
		               |	РеквизитыОбъектаЗалога.Проба.Владелец КАК Металл,
		               |	РеквизитыОбъектаЗалога.Проба.Владелец КАК МеталлФакт,
		               |	РеквизитыОбъектаЗалога.Клеймо КАК Клеймо,
		               |	РеквизитыОбъектаЗалога.Клеймо КАК КлеймоФакт,
		               |	РеквизитыОбъектаЗалога.Именник КАК Именник,
		               |	РеквизитыОбъектаЗалога.Именник КАК ИменникФакт,
		               |	РеквизитыОбъектаЗалога.ДанныеИменника КАК ДанныеИменника,
		               |	РеквизитыОбъектаЗалога.ДанныеИменника КАК ДанныеИменникаФакт,
		               |	РасчетыСКлиентамиПоОбъектамЗалога.СуммаОстаток КАК ОстатокЗайма,
		               |	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
		               |	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлыФакт,
		               |	РеквизитыОбъектаЗалога.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
		               |	СостоянияОбъектовЗалога.СуммаЗайма КАК СуммаЗайма,
		               |	СостоянияОбъектовЗалога.СуммаДолгаЗайма КАК СуммаДолгаЗайма,
		               |	РеквизитыОбъектаЗалога.СостояниеИзделия КАК СостояниеИзделия,
		               |	РеквизитыОбъектаЗалога.Дефекты КАК Дефекты,
		               |	РеквизитыОбъектаЗалога.Вес30 КАК Вес30,
		               |	РеквизитыОбъектаЗалога.СуммаОценкиМакс КАК СуммаОценкиМакс,
		               |	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель КАК Залогодатель,
		               |	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Дата КАК ДатаОформленияЗайма,
		               |	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ОтветственныйСотрудник КАК Приемщик,
		               |	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ОперацияЗайма
		               |ИЗ
		               |	РегистрНакопления.ЛБ_ОбъектыЗалога.Обороты(
		               |			,
		               |			&НаДату,
		               |			Регистратор,
		               |			Ломбард = &Ломбард
		               |				И Склад = &Склад
		               |				И 500 = 500
		               |				И 750 = 750
		               |				И 760 = 760
		               |				И 770 = 770) КАК ЛБ_ОбъектыЗалогаОстатки
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		               |			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
		               |			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
		               |			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаДолгаЗайма КАК СуммаДолгаЗайма,
		               |			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет
		               |		ИЗ
		               |			РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(
		               |					&НаДату,
		               |					(Регистратор.Ломбард = &Ломбард
		               |						ИЛИ Регистратор.ЛомбардКуда = &Ломбард)
		               |						И ВЫБОР
		               |							КОГДА Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
		               |								ТОГДА Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		               |											И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		               |											И НЕ Регистратор В
		               |													(ВЫБРАТЬ
		               |														ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
		               |													ИЗ
		               |														РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&НаДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
		               |													ГДЕ
		               |														ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))
		               |							КОГДА НЕ Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
		               |								ТОГДА ИСТИНА
		               |						КОНЕЦ) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних
		               |		ГДЕ
		               |			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Изъят)) КАК СостоянияОбъектовЗалога
		               |		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = СостоянияОбъектовЗалога.ОбъектЗалога
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
		               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
		               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
		               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Клеймо КАК Клеймо,
		               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК Вес,
		               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесЧистый,
		               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Именник КАК Именник,
		               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ДанныеИменника КАК ДанныеИменника,
		               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
		               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
		               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
		               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СостояниеИзделия КАК СостояниеИзделия,
		               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Дефекты КАК Дефекты,
		               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОписаниеИзделия КАК ОписаниеИзделия,
		               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес30 КАК Вес30,
		               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМакс КАК СуммаОценкиМакс,
		               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет
		               |		ИЗ
		               |			РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
		               |					&НаДату,
		               |					Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		               |						И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		               |						И НЕ Регистратор В
		               |								(ВЫБРАТЬ
		               |									ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
		               |								ИЗ
		               |									РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&НаДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
		               |								ГДЕ
		               |									ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних) КАК РеквизитыОбъектаЗалога
		               |		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РеквизитыОбъектаЗалога.ОбъектЗалога
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
		               |			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки.СуммаОстаток КАК СуммаОстаток
		               |		ИЗ
		               |			РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Остатки(&НаДату, ) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки) КАК РасчетыСКлиентамиПоОбъектамЗалога
		               |		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РасчетыСКлиентамиПоОбъектамЗалога.ОбъектЗалога
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель КАК Залогодатель,
		               |			МАКСИМУМ(ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Период) КАК Период,
		               |			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус
		               |		ИЗ
		               |			РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(
		               |					&НаДату,
		               |					Используется
		               |						И ВЫБОР
		               |							КОГДА СрокДействия <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		               |								ТОГДА ВЫБОР
		               |										КОГДА СрокДействия <= &НаДату
		               |											ТОГДА ЛОЖЬ
		               |										ИНАЧЕ ИСТИНА
		               |									КОНЕЦ
		               |							ИНАЧЕ ИСТИНА
		               |						КОНЕЦ) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних
		               |		
		               |		СГРУППИРОВАТЬ ПО
		               |			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель,
		               |			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус
		               |		
		               |		ОБЪЕДИНИТЬ ВСЕ
		               |		
		               |		ВЫБРАТЬ
		               |			ЛБ_СтатусыЗалогодателейСрезПоследних.Залогодатель,
		               |			ЛБ_СтатусыЗалогодателейСрезПоследних.Период,
		               |			ЛБ_СтатусыЗалогодателейСрезПоследних.Статус
		               |		ИЗ
		               |			РегистрСведений.ЛБ_СтатусыЗалогодателей.СрезПоследних(&НаДату, ) КАК ЛБ_СтатусыЗалогодателейСрезПоследних) КАК СтатусыЗалогодателей
		               |		ПО ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель = СтатусыЗалогодателей.Залогодатель
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Период КАК Период,
		               |			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		               |			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки КАК ВидВставки
		               |		ИЗ
		               |			РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(&НаДату, ) КАК ЛБ_ВставкиОбъектаЗалогаСрезПоследних) КАК ВставкиОЗ
		               |		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиОЗ.ОбъектЗалога
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |			ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога
		               |		ИЗ
		               |			РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(&НаДату, НомерСтрокиТаблицы <> 0) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних) КАК ВставкиМеталла
		               |		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиМеталла.ОбъектЗалога
		               |ГДЕ
		               |	ИСТИНА
		               |	И ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет = РеквизитыОбъектаЗалога.ЗалоговыйБилет
		               |	И ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет = СостоянияОбъектовЗалога.ЗалоговыйБилет
		               |	И ЛБ_ОбъектыЗалогаОстатки.КоличествоРасход > 0
		               |	И 100 = 100
		               |	И 200 = 200
		               |	И 300 = 300
		               |	И 400 = 400
		               |	И 600 = 600
		               |	И 700 = 700
		               |	И 710 = 710
		               |	И 720 = 720
		               |	И 730 = 730
		               |	И 740 = 740
		               |	И 780 = 780
		               |	И 800 = 800
		               |	И 900 = 900
		               |	И 444 = 444
		               |	И 999 = 999
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Артикул";
		
	ИначеЕсли СумкаЗакрыта Тогда
		
		СтатусыВхождения = Новый Массив;
		СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ВключенВНакладную);
		СтатусыВхождения.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалога.ОбъявленТорг);
		
		//СтатусВНакладнойВхождение = Новый Массив;
		//СтатусВНакладнойВхождение.Добавить(Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.СумкаЗакрыта);

		Запрос.Текст = СтрЗаменить(Запрос.Текст, "999 = 999", "ВЫБОР
	               |			КОГДА СостоянияОбъектовЗалога.СтатусОбъектаЗалога В (&СтатусыВхождения)
	               //|					И СтатусыОЗВНакладной.Статус В (&СтатусВНакладнойВхождение)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ");
		
		Запрос.УстановитьПараметр("СтатусыВхождения", СтатусыВхождения);
		//Запрос.УстановитьПараметр("СтатусВНакладнойВхождение", СтатусВНакладнойВхождение);

	//+МАН 24.03.25
	ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
		//Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		//               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога.Код КАК ОбъектЗалогаКод,
		//               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
		//               |	РеквизитыОбъектаЗалога.Артикул КАК Артикул,
		//               |	СостоянияОбъектовЗалога.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
		//               |	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ВидОперации КАК ЗалоговыйБилетВидОперации,
		//               |	РеквизитыОбъектаЗалога.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		//               |	ЛБ_ОбъектыЗалогаОстатки.КоличествоКонечныйОстаток КАК Количество,
		//               |	ЛБ_ОбъектыЗалогаОстатки.КоличествоКонечныйОстаток КАК КоличествоФакт,
		//               |	СостоянияОбъектовЗалога.СуммаЗайма КАК СуммаЗайма,
		//               |	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиКонечныйОстаток КАК СуммаОценки,
		//               |	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиКонечныйОстаток КАК СуммаОценкиФакт,
		//               |	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделия,
		//               |	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделияФакт,
		//               |	РеквизитыОбъектаЗалога.Проба КАК Проба,
		//               |	РеквизитыОбъектаЗалога.Проба КАК ПробаФакт,
		//               |	РеквизитыОбъектаЗалога.Категория КАК Категория,
		//               |	РеквизитыОбъектаЗалога.Категория КАК КатегорияФакт,
		//               |	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМасса,
		//               |	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМассаФакт,
		//               |	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталла,
		//               |	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталлаФакт,
		//               |	РеквизитыОбъектаЗалога.Проба.Владелец КАК Металл,
		//               |	РеквизитыОбъектаЗалога.Проба.Владелец КАК МеталлФакт,
		//               |	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель КАК Залогодатель,
		//               |	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Дата КАК ДатаОформленияЗайма,
		//               |	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ОтветственныйСотрудник КАК Приемщик,
		//               |	РеквизитыОбъектаЗалога.Клеймо КАК Клеймо,
		//               |	РеквизитыОбъектаЗалога.Клеймо КАК КлеймоФакт,
		//               |	РеквизитыОбъектаЗалога.Именник КАК Именник,
		//               |	РеквизитыОбъектаЗалога.Именник КАК ИменникФакт,
		//               |	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ОперацияЗайма,
		//               |	РасчетыСКлиентамиПоОбъектамЗалога.СуммаКонечныйОстаток КАК ОстатокЗайма,
		//               |	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
		//               |	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлыФакт
		//               |ИЗ
		//               |	РегистрНакопления.ЛБ_ОбъектыЗалога.ОстаткиИОбороты(
		//               |			&СДаты,
		//               |			&ПоДату,
		//               |			Авто,
		//               |			,
		//               |			Ломбард = &Ломбард
		//			   //+МАН 17.12.25
		//			   |			И Склад = &Склад
		//			   //-МАН
		//               |				И (ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог)
		//               |					ИЛИ ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление)
		//               |					ИЛИ ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога))
		//               |				И 500 = 500
		//               |				И 750 = 750
		//               |				И 760 = 760
		//               |				И 770 = 770) КАК ЛБ_ОбъектыЗалогаОстатки
		//			   |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//               |			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		//               |			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
		//               |			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаЗайма КАК СуммаЗайма
		//               |		ИЗ
		//			   //+МАН 03.06.25 Изменил, чтобы отбор шел по первоначальным документам.
		//			   //|			РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(
		//			   //|					&ПоДату,
		//               |			РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПервых(
		//               |					&СДаты,
		//			   //-МАН
		//			   |					Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		//			   |							И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		//			   |							И НЕ Регистратор В
		//			   |									(ВЫБРАТЬ
		//			   |										ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
		//			   |									ИЗ
		//			   |										РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
		//			   |									ГДЕ
		//			   |										ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (Регистратор))) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних) КАК СостоянияОбъектовЗалога
		//               |		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = СостоянияОбъектовЗалога.ОбъектЗалога
		//               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		//               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
		//               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
		//               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
		//               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Клеймо КАК Клеймо,
		//               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК Вес,
		//               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесЧистый,
		//               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Именник КАК Именник,
		//               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
		//               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
		//               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		//               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Регистратор КАК Регистратор,
		//               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет
		//               |		ИЗ
		//               |			РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
		//               |					&ПоДату,
		//			   |					Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		//			   |							И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		//			   |							И НЕ Регистратор В
		//			   |								(ВЫБРАТЬ
		//			   |									ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
		//			   |								ИЗ
		//			   |									РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
		//			   |								ГДЕ
		//			   |									ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (Регистратор))) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних) КАК РеквизитыОбъектаЗалога
		//               |		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РеквизитыОбъектаЗалога.ОбъектЗалога
		//               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//               |			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты.ОбъектЗалога КАК ОбъектЗалога,
		//               |			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
		//               |		ИЗ
		//               |			РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.ОстаткиИОбороты(&СДаты, &ПоДату, Период, , ) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты) КАК РасчетыСКлиентамиПоОбъектамЗалога
		//               |		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РасчетыСКлиентамиПоОбъектамЗалога.ОбъектЗалога
		//               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//               |			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель КАК Залогодатель,
		//               |			МАКСИМУМ(ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Период) КАК Период,
		//               |			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус
		//               |		ИЗ
		//               |			РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(
		//               |					&ПоДату,
		//               |					Используется
		//               |						И ВЫБОР
		//               |							КОГДА СрокДействия <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//               |								ТОГДА ВЫБОР
		//               |										КОГДА СрокДействия <= &ПоДату
		//               |											ТОГДА ЛОЖЬ
		//               |										ИНАЧЕ ИСТИНА
		//               |									КОНЕЦ
		//               |							ИНАЧЕ ИСТИНА
		//               |						КОНЕЦ) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних
		//               |		
		//               |		СГРУППИРОВАТЬ ПО
		//               |			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель,
		//               |			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус
		//               |		
		//               |		ОБЪЕДИНИТЬ ВСЕ
		//               |		
		//               |		ВЫБРАТЬ
		//               |			ЛБ_СтатусыЗалогодателейСрезПоследних.Залогодатель,
		//               |			ЛБ_СтатусыЗалогодателейСрезПоследних.Период,
		//               |			ЛБ_СтатусыЗалогодателейСрезПоследних.Статус
		//               |		ИЗ
		//               |			РегистрСведений.ЛБ_СтатусыЗалогодателей.СрезПоследних(, ) КАК ЛБ_СтатусыЗалогодателейСрезПоследних) КАК СтатусыЗалогодателей
		//               |		ПО ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель = СтатусыЗалогодателей.Залогодатель
		//               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		//               |			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Период КАК Период,
		//               |			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		//               |			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки КАК ВидВставки
		//               |		ИЗ
		//               |			РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(&ПоДату, ) КАК ЛБ_ВставкиОбъектаЗалогаСрезПоследних) КАК ВставкиОЗ
		//               |		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиОЗ.ОбъектЗалога,
		//               |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		//               |		ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога
		//               |	ИЗ
		//               |		РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(&ПоДату, НомерСтрокиТаблицы <> 0) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних) КАК ВставкиМеталла
		//               |ГДЕ
		//               |	ИСТИНА
		//               |	И НЕ СостоянияОбъектовЗалога.СтатусОбъектаЗалога ЕСТЬ NULL
		//               |	И (СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Принят)
		//               |			ИЛИ СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Возвращен))
		//               |	И ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет = РеквизитыОбъектаЗалога.ЗалоговыйБилет
		//               |	И ЛБ_ОбъектыЗалогаОстатки.Регистратор.Дата МЕЖДУ &СДаты И &ПоДату
		//               |	И ЛБ_ОбъектыЗалогаОстатки.Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		//               |	И ЛБ_ОбъектыЗалогаОстатки.Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		//			   |	И НЕ ЛБ_ОбъектыЗалогаОстатки.Регистратор В(ВЫБРАТЬ
		//			   |									ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
		//			   |								ИЗ
		//			   |									РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
		//			   |								ГДЕ
		//			   |									ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОбъектыЗалогаОстатки.Регистратор))
		//               |	И ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиКонечныйОстаток <> 0
		//               |	И 100 = 100
		//               |	И 200 = 200
		//               |	И 300 = 300
		//               |	И 400 = 400
		//               |	И 600 = 600
		//               |	И 700 = 700
		//               |	И 710 = 710
		//               |	И 720 = 720
		//               |	И 730 = 730
		//               |	И 740 = 740
		//               |	И 780 = 780
		//               |	И 800 = 800
		//               |	И 900 = 900
		//               |	И 444 = 444
		//               |	И 999 = 999
		//               |
		//               |УПОРЯДОЧИТЬ ПО
		//               |	Артикул";
		
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога.Код КАК ОбъектЗалогаКод,
		               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
		               |	РеквизитыОбъектаЗалога.Артикул КАК Артикул,
		               |	СостоянияОбъектовЗалога.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
		               |	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ВидОперации КАК ЗалоговыйБилетВидОперации,
		               |	ЛБ_ОбъектыЗалогаОстатки.Склад КАК Склад,
		               |	РеквизитыОбъектаЗалога.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		               |	ЛБ_ОбъектыЗалогаОстатки.КоличествоКонечныйОстаток КАК Количество,
		               |	ЛБ_ОбъектыЗалогаОстатки.КоличествоКонечныйОстаток КАК КоличествоФакт,
		               |	СостоянияОбъектовЗалога.СуммаЗайма КАК СуммаЗайма,
		               |	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиКонечныйОстаток КАК СуммаОценки,
		               |	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиКонечныйОстаток КАК СуммаОценкиФакт,
		               |	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделия,
		               |	РеквизитыОбъектаЗалога.ВидИзделия КАК ВидИзделияФакт,
		               |	РеквизитыОбъектаЗалога.Проба КАК Проба,
		               |	РеквизитыОбъектаЗалога.Проба КАК ПробаФакт,
		               |	РеквизитыОбъектаЗалога.Категория КАК Категория,
		               |	РеквизитыОбъектаЗалога.Категория КАК КатегорияФакт,
		               |	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМасса,
		               |	РеквизитыОбъектаЗалога.Вес КАК ОбщаяМассаФакт,
		               |	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталла,
		               |	РеквизитыОбъектаЗалога.ВесЧистый КАК МассаМеталлаФакт,
		               |	РеквизитыОбъектаЗалога.Проба.Владелец КАК Металл,
		               |	РеквизитыОбъектаЗалога.Проба.Владелец КАК МеталлФакт,
		               |	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель КАК Залогодатель,
		               |	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Дата КАК ДатаОформленияЗайма,
		               |	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.ОтветственныйСотрудник КАК Приемщик,
		               |	РеквизитыОбъектаЗалога.Клеймо КАК Клеймо,
		               |	РеквизитыОбъектаЗалога.Клеймо КАК КлеймоФакт,
		               |	РеквизитыОбъектаЗалога.Именник КАК Именник,
		               |	РеквизитыОбъектаЗалога.Именник КАК ИменникФакт,
		               |	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ОперацияЗайма,
		               |	РасчетыСКлиентамиПоОбъектамЗалога.СуммаКонечныйОстаток КАК ОстатокЗайма,
		               |	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
		               |	РеквизитыОбъектаЗалога.СуммаОценкиМеталлы КАК СуммаОценкиМеталлыФакт
		               |ИЗ
		               |	РегистрНакопления.ЛБ_ОбъектыЗалога.ОстаткиИОбороты(
		               |			&СДаты,
		               |			&ПоДату,
		               |			Авто,
		               |			,
		               |			Ломбард = &Ломбард
		               |				И Склад = &Склад
		               |				И (ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог)
		               |					ИЛИ ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление)
		               |					ИЛИ ЗалоговыйБилет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога))
		               |				И 500 = 500
		               |				И 750 = 750
		               |				И 760 = 760
		               |				И 770 = 770) КАК ЛБ_ОбъектыЗалогаОстатки
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		               |			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
		               |			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
		               |			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога.Код КАК ОбъектЗалогаКод,
		               |			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.Регистратор КАК Регистратор
		               |		ИЗ
		               |			РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(
		               |					&ПоДату,
		               |					(Регистратор.Ломбард = &Ломбард
		               |						ИЛИ Регистратор.ЛомбардКуда = &Ломбард)
		               |						И ОбъектЗалога В
		               |							(ВЫБРАТЬ
		               |								ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога
		               |							ИЗ
		               |								РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПервых(&СДаты, (Регистратор.Ломбард = &Ломбард
		               |									ИЛИ Регистратор.ЛомбардКуда = &Ломбард)
		               |									И ВЫБОР
		               |										КОГДА Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
		               |											ТОГДА Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		               |													И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		               |													И НЕ Регистратор В
		               |															(ВЫБРАТЬ
		               |																ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
		               |															ИЗ
		               |																РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
		               |															ГДЕ
		               |																ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))
		               |										КОГДА НЕ Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
		               |											ТОГДА ИСТИНА
		               |									КОНЕЦ) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних
		               |							СГРУППИРОВАТЬ ПО
		               |								ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога)
		               |						И ВЫБОР
		               |							КОГДА Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
		               |								ТОГДА Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		               |										И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		               |										И НЕ Регистратор В
		               |												(ВЫБРАТЬ
		               |													ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
		               |												ИЗ
		               |													РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
		               |												ГДЕ
		               |													ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))
		               |							КОГДА НЕ Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
		               |								ТОГДА ИСТИНА
		               |						КОНЕЦ) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних) КАК СостоянияОбъектовЗалога
		               |		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = СостоянияОбъектовЗалога.ОбъектЗалога
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
		               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
		               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
		               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Клеймо КАК Клеймо,
		               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК Вес,
		               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесЧистый,
		               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Именник КАК Именник,
		               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
		               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
		               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Регистратор КАК Регистратор,
		               |			ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет
		               |		ИЗ
		               |			РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
		               |					&ПоДату,
		               |					Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		               |						И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		               |						И НЕ Регистратор В
		               |								(ВЫБРАТЬ
		               |									ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
		               |								ИЗ
		               |									РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
		               |								ГДЕ
		               |									ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор))) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних) КАК РеквизитыОбъектаЗалога
		               |		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РеквизитыОбъектаЗалога.ОбъектЗалога
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты.ОбъектЗалога КАК ОбъектЗалога,
		               |			ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
		               |		ИЗ
		               |			РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.ОстаткиИОбороты(&СДаты, &ПоДату, Период, , ) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты) КАК РасчетыСКлиентамиПоОбъектамЗалога
		               |		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = РасчетыСКлиентамиПоОбъектамЗалога.ОбъектЗалога
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель КАК Залогодатель,
		               |			МАКСИМУМ(ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Период) КАК Период,
		               |			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус
		               |		ИЗ
		               |			РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(
		               |					&ПоДату,
		               |					Используется
		               |						И ВЫБОР
		               |							КОГДА СрокДействия <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		               |								ТОГДА ВЫБОР
		               |										КОГДА СрокДействия <= &ПоДату
		               |											ТОГДА ЛОЖЬ
		               |										ИНАЧЕ ИСТИНА
		               |									КОНЕЦ
		               |							ИНАЧЕ ИСТИНА
		               |						КОНЕЦ) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних
		               |		
		               |		СГРУППИРОВАТЬ ПО
		               |			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Залогодатель,
		               |			ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус
		               |		
		               |		ОБЪЕДИНИТЬ ВСЕ
		               |		
		               |		ВЫБРАТЬ
		               |			ЛБ_СтатусыЗалогодателейСрезПоследних.Залогодатель,
		               |			ЛБ_СтатусыЗалогодателейСрезПоследних.Период,
		               |			ЛБ_СтатусыЗалогодателейСрезПоследних.Статус
		               |		ИЗ
		               |			РегистрСведений.ЛБ_СтатусыЗалогодателей.СрезПоследних(, ) КАК ЛБ_СтатусыЗалогодателейСрезПоследних) КАК СтатусыЗалогодателей
		               |		ПО ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Залогодатель = СтатусыЗалогодателей.Залогодатель
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Период КАК Период,
		               |			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		               |			ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки КАК ВидВставки
		               |		ИЗ
		               |			РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(&ПоДату, ) КАК ЛБ_ВставкиОбъектаЗалогаСрезПоследних) КАК ВставкиОЗ
		               |		ПО ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога = ВставкиОЗ.ОбъектЗалога,
		               |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |		ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога
		               |	ИЗ
		               |		РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(&ПоДату, НомерСтрокиТаблицы <> 0) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних) КАК ВставкиМеталла
		               |ГДЕ
		               |	ИСТИНА
		               |	И НЕ СостоянияОбъектовЗалога.СтатусОбъектаЗалога ЕСТЬ NULL
		               |	И (СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Принят)
		               |			ИЛИ СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Возвращен)
		               |			ИЛИ СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ПринятНаСклад)
		               |			ИЛИ СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение))
		               |	И ВЫБОР
		               |			КОГДА ЛБ_ОбъектыЗалогаОстатки.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
		               |				ТОГДА ЛБ_ОбъектыЗалогаОстатки.Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		               |						И ЛБ_ОбъектыЗалогаОстатки.Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
		               |						И НЕ ЛБ_ОбъектыЗалогаОстатки.Регистратор В
		               |								(ВЫБРАТЬ
		               |									ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
		               |								ИЗ
		               |									РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&ПоДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
		               |								ГДЕ
		               |									ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (ЛБ_ОбъектыЗалогаОстатки.Регистратор))
		               |			КОГДА НЕ ЛБ_ОбъектыЗалогаОстатки.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
		               |				ТОГДА ИСТИНА
		               |		КОНЕЦ
		               |	И ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиКонечныйОстаток <> 0
		               |	И ВЫБОР
		               |			КОГДА СостоянияОбъектовЗалога.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
		               |					И СостоянияОбъектовЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение)
		               |				ТОГДА ЛОЖЬ
		               |			ИНАЧЕ ИСТИНА
		               |		КОНЕЦ
		               |	И 100 = 100
		               |	И 200 = 200
		               |	И 300 = 300
		               |	И 400 = 400
		               |	И 600 = 600
		               |	И 700 = 700
		               |	И 710 = 710
		               |	И 720 = 720
		               |	И 730 = 730
		               |	И 740 = 740
		               |	И 780 = 780
		               |	И 800 = 800
		               |	И 900 = 900
		               |	И 444 = 444
		               |	И 999 = 999
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Артикул";
					   
	Запрос.УстановитьПараметр("СДаты", НачалоДня(Объект.Дата));    
	Запрос.УстановитьПараметр("ПоДату", ТекущаяДата());
	//+МАН 17.12.25
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	//-МАН
	КонецЕсли;
	//-МАН

	Если Объект.ВидИнвентаризации = Перечисления.ЛБ_ВидИнвентаризации.Выборочная Тогда
		
		Если ЗначениеЗаполнено(Объект.ОтборДатаЗаймаОт) ИЛИ ЗначениеЗаполнено(Объект.ОтборДатаЗаймаДо) Тогда
			//Если ЗначениеЗаполнено(Объект.ОтборДатаЗаймаОт) И НЕ ЗначениеЗаполнено(Объект.ОтборДатаЗаймаДо) Тогда
			//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "500 = 500", "ЗалоговыйБилет.Дата >= &ОтборДатаЗаймаОт");
			//Если НЕ ЗначениеЗаполнено(Объект.ОтборДатаЗаймаОт) И ЗначениеЗаполнено(Объект.ОтборДатаЗаймаДо) Тогда
			//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "500 = 500", "ЗалоговыйБилет.Дата <= &ОтборДатаЗаймаДо");
			//Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "500 = 500", "ЗалоговыйБилет.Дата МЕЖДУ &ОтборДатаЗаймаОт И &ОтборДатаЗаймаДо"); //Мельников 14.05.24 Было "ЗалоговыйБилет.Дата <= &ОтборДатаЗаймаДо");
			//КонецЕсли;
			Запрос.УстановитьПараметр("ОтборДатаЗаймаОт", Объект.ОтборДатаЗаймаОт);
			Запрос.УстановитьПараметр("ОтборДатаЗаймаДо", Объект.ОтборДатаЗаймаДо);
		КонецЕсли;
		
		//15.05.24 Добавлен фильтр по статусу клиента.
		Если Объект.ФильтрСтатусыЗалогодателя.Количество() > 0 Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "400 = 400", "СтатусыЗалогодателей.Статус В (&СтатусЗалогодателя)"); 	
			Массив = ВернутьМассивИзФильтра(Объект.ФильтрСтатусыЗалогодателя, "Статус"); 				
			Запрос.УстановитьПараметр("СтатусЗалогодателя", Массив); 
		КонецЕсли;  

		//15.05.24 Добавлен фильтр по сумме оценки
		Если Объект.ОтборСуммаОценкиОт > 0 ИЛИ Объект.ОтборСуммаОценкиДо > 0 Тогда
			Если Остатки ИЛИ НаОХ ИЛИ СумкаЗакрыта Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "800 = 800", "ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток МЕЖДУ &ОтборСуммаОценкиОт И &ОтборСуммаОценкиДо");
			ИначеЕсли Изъятые Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "800 = 800", "ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиРасход МЕЖДУ &ОтборСуммаОценкиОт И &ОтборСуммаОценкиДо");
			ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "800 = 800", "ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиКонечныйОстаток МЕЖДУ &ОтборСуммаОценкиОт И &ОтборСуммаОценкиДо");
			КонецЕсли;
			
			Запрос.УстановитьПараметр("ОтборСуммаОценкиОт", Объект.ОтборСуммаОценкиОт );
			Запрос.УстановитьПараметр("ОтборСуммаОценкиДо", Объект.ОтборСуммаОценкиДо);
		КонецЕсли;	

		//+15.05.24 Добавлен фильтр по вставке
		Если Объект.ФильтрКамни.Количество() > 0 Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "710 = 710", "ВставкиОЗ.ВидВставки В (&ВидВставки)");
			Массив = ВернутьМассивИзФильтра(Объект.ФильтрКамни, "Вставка"); 				
			Запрос.УстановитьПараметр("ВидВставки", Массив); 
		КонецЕсли; 

		//+20.05.24 Добавлен фильтр по ОЗ без вставок
		Если Объект.ОтборБезВставок Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "720 = 720", "ВставкиОЗ.ВидВставки ЕСТЬ NULL");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "730 = 730", "ВставкиМеталла.ОбъектЗалога ЕСТЬ NULL");
		КонецЕсли; 

		//+20.05.24 Добавлен фильтр по вставкам металла
		Если Объект.ОтборВставкаМеталл Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "740 = 740", "НЕ ВставкиМеталла.ОбъектЗалога ЕСТЬ NULL");
		КонецЕсли; 

		//+27.05.24 Если добавляется строка
		Если НоваяСтрокаТЧ Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "770 = 770", "ОбъектЗалога = &ОбъектЗалога");
			Запрос.УстановитьПараметр("ОбъектЗалога", ДобавляемыйОЗ);
		КонецЕсли;
		
		//+МАН 21.03.25
		Если Объект.ОтборВставкаКомплектующие Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "780 = 780", "ТИПЗНАЧЕНИЯ(ВставкиОЗ.ВидВставки) = ТИП(Справочник.ЛБ_КомплектующиеИзделия)");
		КонецЕсли; 
		//-Мельников
		
		Если Объект.ФильтрЗалогодатели.Количество() > 0 тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "750 = 750", "ЗалоговыйБилет.Залогодатель В (&Клиенты)"); 	
			Массив = ВернутьМассивИзФильтра(Объект.ФильтрЗалогодатели, "Залогодатель"); 				
			Запрос.УстановитьПараметр("Клиенты", Массив); 
		КонецЕсли;  
		
		Если Объект.ФильтрПриемщики.Количество() > 0 тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "760 = 760", "ЗалоговыйБилет.Ответственный В (&Приемщики)"); 	
			Массив = ВернутьМассивИзФильтра(Объект.ФильтрПриемщики, "Приемщик"); 				
			Запрос.УстановитьПараметр("Приемщики", Массив); 
		КонецЕсли; 		

		Если Объект.ФильтрСтатусы.Количество() > 0 тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "444 = 444", "СостоянияОбъектовЗалога.СтатусОбъектаЗалога В (&СтатусОбъектаЗалога)"); 	
			Массив = ВернутьМассивИзФильтра(Объект.ФильтрСтатусы, "Статус"); 				
			Запрос.УстановитьПараметр("СтатусОбъектаЗалога", Массив); 
		КонецЕсли;
		
		//+МАН 25.11.24 Фильтры для реквизитов
		Если Объект.ФильтрВидыИзделий.Количество() > 0 Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "100 = 100", "РеквизитыОбъектаЗалога.ВидИзделия В (&ВидИзделия)");
			Массив = ВернутьМассивИзФильтра(Объект.ФильтрВидыИзделий, "ВидИзделия");
			Запрос.УстановитьПараметр("ВидИзделия", Массив);
		КонецЕсли;
		
		Если Объект.ФильтрКатегории.Количество() > 0 Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "200 = 200", "РеквизитыОбъектаЗалога.Категория В (&Категории)");
			Массив = ВернутьМассивИзФильтра(Объект.ФильтрКатегории, "Категория");
			Запрос.УстановитьПараметр("Категории", Массив);
		КонецЕсли;
		
		Если Объект.ФильтрПробы.Количество() > 0 Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "300 = 300", "РеквизитыОбъектаЗалога.Проба В (&Пробы)");
			Массив = ВернутьМассивИзФильтра(Объект.ФильтрПробы, "Проба");
			Запрос.УстановитьПараметр("Пробы", Массив);
		КонецЕсли;
		
		Если Объект.ОтборОбщаяМассаОт > 0 ИЛИ Объект.ОтборОбщаяМассаДо > 0 Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "700 = 700", "РеквизитыОбъектаЗалога.Вес МЕЖДУ &ОтборОбщаяМассаОт И &ОтборОбщаяМассаДо");
			Запрос.УстановитьПараметр("ОтборОбщаяМассаОт", Объект.ОтборОбщаяМассаОт);
			Запрос.УстановитьПараметр("ОтборОбщаяМассаДо", Объект.ОтборОбщаяМассаДо);
		КонецЕсли;
		
		Если Объект.ОтборМассаМеталлаОт > 0 ИЛИ Объект.ОтборМассаМеталлаДо > 0 Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "900 = 900", "РеквизитыОбъектаЗалога.ВесЧистый МЕЖДУ &ОтборМассаМеталлаОт И &ОтборМассаМеталлаДо");
			Запрос.УстановитьПараметр("ОтборМассаМеталлаОт", Объект.ОтборМассаМеталлаОт);
			Запрос.УстановитьПараметр("ОтборМассаМеталлаДо", Объект.ОтборМассаМеталлаДо);
		КонецЕсли;	

		//+15.05.24 Добавлен фильтр по именнику
		Если Объект.ОтборИменник Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "600 = 600", "РеквизитыОбъектаЗалога.Именник = &ОтборИменник");
			Запрос.УстановитьПараметр("ОтборИменник", ПредопределенноеЗначение("Перечисление.ЛБ_Именник.Да"));
		КонецЕсли;
	КонецЕсли;  

	тз = Запрос.Выполнить().Выгрузить();

	Если Остатки ИЛИ СумкаЗакрыта Тогда
		
		МассивУдаляемыхСтрокТЗ = Новый Массив;
		
		Для каждого Стр Из тз Цикл
			СтатусОЗ = ПолучитьСтатусОЗВнакладной(НачалоДня(Объект.Дата), Стр.ОбъектЗалога);

			Если Остатки Тогда
				Если СтатусОЗ = Неопределено
					ИЛИ СтатусОЗ = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.Факт
					ИЛИ СтатусОЗ = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.СумкаОткрыта
					ИЛИ СтатусОЗ = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.ИсключенИзНакладной Тогда
				
					Продолжить;					
				Иначе
					//тз.Удалить(Стр);
					МассивУдаляемыхСтрокТЗ.Добавить(Стр);
				КонецЕсли;
			ИначеЕсли СумкаЗакрыта Тогда
				Если СтатусОЗ = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.СумкаЗакрыта Тогда
					
					Продолжить;
				Иначе
					//тз.Удалить(Стр);
					МассивУдаляемыхСтрокТЗ.Добавить(Стр);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если МассивУдаляемыхСтрокТЗ.Количество() > 0 Тогда
			Для каждого СтрМассиваТЗ Из МассивУдаляемыхСтрокТЗ Цикл
				тз.Удалить(СтрМассиваТЗ);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;	
	
	Строка = Новый КвалификаторыСтроки(1024, ДопустимаяДлина.Переменная);
	М = Новый Массив;
	М.Добавить(Тип("Строка"));
	ТипС = Новый ОписаниеТипов(М,, Строка);

	//+МАН 28.10.24 Получачем описание из регистра сведений ЛБ_РеквизитыОбъектаЗалога т.к. в запрос невыбрать с неограниченной длиной
	СтрокаОписания = Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная);
	ТипСтрокиОписания = Новый ОписаниеТипов(М,, СтрокаОписания);
	тз.Колонки.Добавить("ОписаниеИзделия", ТипСтрокиОписания);
	//-МАН

	тз.Колонки.Добавить("Отклонения", ТипС);
	
	//+Мельников 17.05.24 Определение суммы займа по объекту залога
	Для каждого СтрТЗ Из тз Цикл

		//+МАН 28.10.24 Получачем описание из регистра сведений ЛБ_РеквизитыОбъектаЗалога т.к. в запрос невыбрать с неограниченной длиной
		НаборЗаписей = РегистрыСведений.ЛБ_РеквизитыОбъектаЗалога.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(СтрТЗ.ОперацияЗайма);
		НаборЗаписей.Прочитать();
		
		Для каждого СтрНЗ Из НаборЗаписей Цикл
		
			Если СтрНЗ.ОбъектЗалога <> СтрТЗ.ОбъектЗалога Тогда
				Продолжить;
			КонецЕсли;
			
			СтрТЗ.ОписаниеИзделия = СтрНЗ.ОписаниеИзделия;
		
		КонецЦикла;
		//-МАН
		
		СтрТЗ.Отклонения = ПолучитьОтклонениеПоОЗ(СтрТЗ.ОбъектЗалога);
		
	КонецЦикла;
	//-Мельников
	
	Если НЕ НоваяСтрокаТЧ Тогда
		//+МАН 25.11.24
		Если Остатки Тогда
			Объект.Товары.Загрузить(тз);
		ИначеЕсли НаОХ Тогда
			Объект.НаОХ.Загрузить(тз);
		ИначеЕсли Изъятые Тогда
			Объект.Изъятые.Загрузить(тз);
		ИначеЕсли СумкаЗакрыта Тогда
			Объект.СумкаЗакрыта.Загрузить(тз);
		ИначеЕсли НовыеОЗ Тогда
			Объект.НовыеОЗ.Загрузить(тз);
		ИначеЕсли ОбновитьНовыеОЗ Тогда
			Если тз.Количество() > 0 Тогда
				
				МассивУдаляемыхСтрок = Новый Массив;
				
				Для каждого СтрТЗ Из тз Цикл
					
					Отбор = Новый Структура;
					Отбор.Вставить("ОбъектЗалога", СтрТЗ.ОбъектЗалога);
					Отбор.Вставить("Артикул", СтрТЗ.Артикул);
					
					МассивНайденныхОЗ = Объект.НовыеОЗ.НайтиСтроки(Отбор);
					
					Если МассивНайденныхОЗ.Количество() > 0 Тогда
						МассивУдаляемыхСтрок.Добавить(СтрТЗ);
						Продолжить;
					КонецЕсли;
					
					НоваяСтр = Объект.НовыеОЗ.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтр, СтрТЗ);
					
				КонецЦикла;
				
				Если МассивУдаляемыхСтрок.Количество() > 0 Тогда
					Для каждого СтрМассива Из МассивУдаляемыхСтрок Цикл
						тз.Удалить(СтрМассива);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		//-МАН
	Иначе
		Если тз.Количество() > 0 Тогда
			Для каждого СтрТЗ Из тз Цикл
				НоваяСтр = Объект.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтр, СтрТЗ)
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
		
	МассивОЗ = тз.ВыгрузитьКолонку("ОбъектЗалога");
	
	ЗапросВставки = Новый Запрос;
	ЗапросВставки.Текст ="ВЫБРАТЬ
	                     |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Период КАК Период,
	                     |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Регистратор КАК Регистратор,
	                     //|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.НомерСтроки КАК НомерСтроки,
	                     |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Активность КАК Активность,
	                     |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	                     |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
	                     |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки КАК ВидВставки,
	                     |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ФормаОгранки КАК ФормаОгранки,
	                     |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидОгранки КАК ВидОгранки,
	                     |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.КачествоОгранки КАК КачествоОгранки,
	                     |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Длина КАК Длина,
	                     |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Ширина КАК Ширина,
	                     |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Высота КАК Высота,
	                     |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Диаметр КАК Диаметр,
	                     |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Диаметр1 КАК Диаметр1,
	                     |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Диаметр2 КАК Диаметр2,
	                     |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                     |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Вес КАК Вес,
	                     |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВесГраммы КАК ВесГраммы,
	                     |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Цена КАК Цена,
	                     |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Количество КАК Количество,
	                     |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.СуммаОценки КАК Сумма,
	                     |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки КАК ВидВставкиФакт,
	                     |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ФормаОгранки КАК ФормаОгранкиФакт,
	                     |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидОгранки КАК ВидОгранкиФакт,
	                     |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.КачествоОгранки КАК КачествоОгранкиФакт,
	                     |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Длина КАК ДлинаФакт,
	                     |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Ширина КАК ШиринаФакт,
	                     |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Высота КАК ВысотаФакт,
	                     |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Диаметр КАК ДиаметрФакт,
	                     |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Диаметр1 КАК Диаметр1Факт,
	                     |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Диаметр2 КАК Диаметр2Факт,
	                     |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмеренияФакт,
	                     |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Вес КАК ВесФакт,
	                     |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВесГраммы КАК ВесГраммыФакт,
	                     |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Цена КАК ЦенаФакт,
	                     |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Количество КАК КоличествоФакт,
	                     |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаФакт,
						 //+Мельников 16.10.24 Инвентаризация. Заявка 2464
						 |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.НеОценивать КАК НеОценивать,
						 |	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.НеОценивать КАК НеОцениватьФакт,
						 |	ВЫБОР
						 |		КОГДА ТИПЗНАЧЕНИЯ(ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки) = ТИП(Справочник.ЛБ_ДрагоценныеКамни)
						 |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыКомплектующихИзделия.Вставка)
						 |		КОГДА ТИПЗНАЧЕНИЯ(ЛБ_ВставкиОбъектаЗалогаСрезПоследних.ВидВставки) = ТИП(Справочник.ЛБ_КомплектующиеИзделия)
						 |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыКомплектующихИзделия.Комплектующее)
						 |		ИНАЧЕ """"
						 |	КОНЕЦ КАК Вид
						 //-Мельников
                     	 |ИЗ
	                     |	РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(100 = 100, ОбъектЗалога В (&МассивОЗ)) КАК ЛБ_ВставкиОбъектаЗалогаСрезПоследних
						 |ГДЕ
						 |	200 = 200
						 |
						 |УПОРЯДОЧИТЬ ПО
						 |	Период УБЫВ,
						 |	НомерСтрокиТаблицы";

	Если Остатки ИЛИ НаОХ ИЛИ Изъятые ИЛИ СумкаЗакрыта Тогда
		ЗапросВставки.Текст = СтрЗаменить(ЗапросВставки.Текст, "100 = 100", "&НаДату");
		
		ЗапросВставки.УстановитьПараметр("НаДату", НачалоДня(Объект.Дата)); 
	ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
		ЗапросВставки.Текст = СтрЗаменить(ЗапросВставки.Текст, "100 = 100", "&ПоДату");
		ЗапросВставки.Текст = СтрЗаменить(ЗапросВставки.Текст, "200 = 200", "ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Период МЕЖДУ &СДаты И &ПоДату");
	
		ЗапросВставки.УстановитьПараметр("СДаты", НачалоДня(Объект.Дата)); 
		ЗапросВставки.УстановитьПараметр("ПоДату", ТекущаяДата()); 
	КонецЕсли;
	
	ЗапросВставки.УстановитьПараметр("МассивОЗ", МассивОЗ); 
						 
	Если НЕ НоваяСтрокаТЧ ИЛИ НЕ ОбновитьНовыеОЗ Тогда
		//+МАН 25.11.24
		Если Остатки Тогда
			Объект.ВставкиФакт.Очистить();
		ИначеЕсли НаОХ Тогда
			Объект.ВставкиКамнейНаОХ.Очистить();
		ИначеЕсли Изъятые Тогда
			Объект.ВставкиКамнейИзъятые.Очистить();
		ИначеЕсли СумкаЗакрыта Тогда
			Объект.ВставкиКамнейСумкаЗакрыта.Очистить();
		ИначеЕсли НовыеОЗ Тогда
			Объект.ВставкиКамнейНовыеОЗ.Очистить();
		КонецЕсли;
		//-МАН
	КонецЕсли;
	
	//+Мельников 20.05.24
	ТзВствки = ЗапросВставки.Выполнить().Выгрузить();
	//-Мельников
	
	КоличествоВставок = 0;
	КоличествоЗагруженныхВставок = 0;
	
	ВыборкаВставки = ЗапросВставки.Выполнить().Выбрать();
	Пока ВыборкаВставки.Следующий() Цикл
		//+МАН 25.11.24
		Если Остатки Тогда
			КоличествоВставок = КоличествоВставок(ВыборкаВставки.ОбъектЗалога, НачалоДня(Объект.Дата));
			КоличествоЗагруженныхВставок = КоличествоЗагруженныхВставок(ВыборкаВставки.ОбъектЗалога, "ВставкиФакт");
			
			Если КоличествоЗагруженныхВставок <> КоличествоВставок Тогда
				НовСтрВставки = Объект.ВставкиФакт.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрВставки, ВыборкаВставки);
			Иначе
				Продолжить;
			КонецЕсли;
		ИначеЕсли НаОХ Тогда
			КоличествоВставок = КоличествоВставок(ВыборкаВставки.ОбъектЗалога, НачалоДня(Объект.Дата));
			КоличествоЗагруженныхВставок = КоличествоЗагруженныхВставок(ВыборкаВставки.ОбъектЗалога, "ВставкиКамнейНаОХ");
			
			Если КоличествоЗагруженныхВставок <> КоличествоВставок Тогда
				НовСтрВставки = Объект.ВставкиКамнейНаОХ.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрВставки, ВыборкаВставки);	
			Иначе
				Продолжить;
			КонецЕсли;
		ИначеЕсли Изъятые Тогда
			КоличествоВставок = КоличествоВставок(ВыборкаВставки.ОбъектЗалога, НачалоДня(Объект.Дата));
			КоличествоЗагруженныхВставок = КоличествоЗагруженныхВставок(ВыборкаВставки.ОбъектЗалога, "ВставкиКамнейИзъятые");
			
			Если КоличествоЗагруженныхВставок <> КоличествоВставок Тогда
				НовСтрВставки = Объект.ВставкиКамнейИзъятые.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрВставки, ВыборкаВставки);	
			Иначе
				Продолжить;
			КонецЕсли;
		ИначеЕсли СумкаЗакрыта Тогда
			КоличествоВставок = КоличествоВставок(ВыборкаВставки.ОбъектЗалога, НачалоДня(Объект.Дата));
			КоличествоЗагруженныхВставок = КоличествоЗагруженныхВставок(ВыборкаВставки.ОбъектЗалога, "ВставкиКамнейСумкаЗакрыта");
			
			Если КоличествоЗагруженныхВставок <> КоличествоВставок Тогда
				НовСтрВставки = Объект.ВставкиКамнейСумкаЗакрыта.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрВставки, ВыборкаВставки);	
			Иначе
				Продолжить;
			КонецЕсли;
		ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
			КоличествоВставок = КоличествоВставок(ВыборкаВставки.ОбъектЗалога, НачалоДня(Объект.Дата), Истина);
			КоличествоЗагруженныхВставок = КоличествоЗагруженныхВставок(ВыборкаВставки.ОбъектЗалога, "ВставкиКамнейНовыеОЗ");
			
			Если КоличествоЗагруженныхВставок <> КоличествоВставок Тогда
				НовСтрВставки = Объект.ВставкиКамнейНовыеОЗ.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрВставки, ВыборкаВставки);	
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		//-МАН
	КонецЦикла;

	//+Мельников 17.05.24 Добавлен поиск вставок металла
	ЗапросВставкиМеталла = Новый Запрос;
	ЗапросВставкиМеталла.Текст ="ВЫБРАТЬ
                        |	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
                        |	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
                        |	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
                        |	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ВесЧистый КАК Вес,
                        |	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ВесВПробеЧистоты КАК ВесВПробеЧистоты,
                        |	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
                        |	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценки,
                        |	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.Проба КАК ПробаФакт,
                        |	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесФакт,
                        |	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ВесВПробеЧистоты КАК ВесВПробеЧистотыФакт,
                        |	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмеренияФакт,
                        |	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценкиФакт
                        |ИЗ
                        |	РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(
                        |			100 = 100,
                        |			ОбъектЗалога В (&МассивОЗ)
                        |				И НомерСтрокиТаблицы <> 0) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних
						|ГДЕ
						|	200 = 200";
	Если Остатки ИЛИ НаОХ ИЛИ Изъятые ИЛИ СумкаЗакрыта Тогда
		ЗапросВставкиМеталла.Текст = СтрЗаменить(ЗапросВставкиМеталла.Текст, "100 = 100", "&НаДату");
		
		ЗапросВставкиМеталла.УстановитьПараметр("НаДату", НачалоДня(Объект.Дата)); 
	ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
		ЗапросВставкиМеталла.Текст = СтрЗаменить(ЗапросВставкиМеталла.Текст, "100 = 100", "&ПоДату");
		ЗапросВставкиМеталла.Текст = СтрЗаменить(ЗапросВставкиМеталла.Текст, "200 = 200", "ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.Период МЕЖДУ &СДаты И &ПоДату");
	
		ЗапросВставкиМеталла.УстановитьПараметр("СДаты", НачалоДня(Объект.Дата)); 
		ЗапросВставкиМеталла.УстановитьПараметр("ПоДату", ТекущаяДата()); 
	КонецЕсли;

	ЗапросВставкиМеталла.УстановитьПараметр("МассивОЗ", МассивОЗ); 
						 
	Если НЕ НоваяСтрокаТЧ ИЛИ НЕ ОбновитьНовыеОЗ Тогда
		//+МАН 25.11.24
		Если Остатки Тогда
			Объект.ВставкиМеталла.Очистить();
		ИначеЕсли НаОХ Тогда
			Объект.ВставкиМеталлаНаОХ.Очистить();
		ИначеЕсли Изъятые Тогда
			Объект.ВставкиМеталлаИзъятые.Очистить();
		ИначеЕсли СумкаЗакрыта Тогда
			Объект.ВставкиМеталлаСумкаЗакрыта.Очистить();
		ИначеЕсли НовыеОЗ Тогда
			Объект.ВставкиМеталлаНовыеОЗ.Очистить();
		КонецЕсли;
		//-МАН
	КонецЕсли;
	
	ТзВствкиМеталла = ЗапросВставкиМеталла.Выполнить().Выгрузить();

	КоличествоВставокМеталла = 0;
	КоличествоЗагруженныхВставокМеталла = 0;

	ВыборкаВставкиМеталла = ЗапросВставкиМеталла.Выполнить().Выбрать();
	Пока ВыборкаВставкиМеталла.Следующий() Цикл
		//+МАН 25.11.24
		Если Остатки Тогда
			КоличествоВставокМеталла = КоличествоВставокМеталла(ВыборкаВставкиМеталла.ОбъектЗалога, НачалоДня(Объект.Дата));
			КоличествоЗагруженныхВставокМеталла = КоличествоЗагруженныхВставок(ВыборкаВставкиМеталла.ОбъектЗалога, "ВставкиМеталла");
			
			Если КоличествоЗагруженныхВставокМеталла <> КоличествоВставокМеталла Тогда
				НовСтрВставкиМеталла = Объект.ВставкиМеталла.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрВставкиМеталла, ВыборкаВставкиМеталла);	
			Иначе
				Продолжить;
			КонецЕсли;
		ИначеЕсли НаОХ Тогда
			КоличествоВставокМеталла = КоличествоВставокМеталла(ВыборкаВставкиМеталла.ОбъектЗалога, НачалоДня(Объект.Дата));
			КоличествоЗагруженныхВставокМеталла = КоличествоЗагруженныхВставок(ВыборкаВставкиМеталла.ОбъектЗалога, "ВставкиМеталлаНаОХ");
			
			Если КоличествоЗагруженныхВставокМеталла <> КоличествоВставокМеталла Тогда
				НовСтрВставкиМеталла = Объект.ВставкиМеталлаНаОХ.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрВставкиМеталла, ВыборкаВставкиМеталла);	
			Иначе
				Продолжить;
			КонецЕсли;
		ИначеЕсли Изъятые Тогда
			КоличествоВставокМеталла = КоличествоВставокМеталла(ВыборкаВставкиМеталла.ОбъектЗалога, НачалоДня(Объект.Дата));
			КоличествоЗагруженныхВставокМеталла = КоличествоЗагруженныхВставок(ВыборкаВставкиМеталла.ОбъектЗалога, "ВставкиМеталлаИзъятые");
			
			Если КоличествоЗагруженныхВставокМеталла <> КоличествоВставокМеталла Тогда
				НовСтрВставкиМеталла = Объект.ВставкиМеталлаИзъятые.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрВставкиМеталла, ВыборкаВставкиМеталла);	
			Иначе
				Продолжить;
			КонецЕсли;
		ИначеЕсли СумкаЗакрыта Тогда
			КоличествоВставокМеталла = КоличествоВставокМеталла(ВыборкаВставкиМеталла.ОбъектЗалога, НачалоДня(Объект.Дата));
			КоличествоЗагруженныхВставокМеталла = КоличествоЗагруженныхВставок(ВыборкаВставкиМеталла.ОбъектЗалога, "ВставкиМеталлаСумкаЗакрыта");
			
			Если КоличествоЗагруженныхВставокМеталла <> КоличествоВставокМеталла Тогда
				НовСтрВставкиМеталла = Объект.ВставкиМеталлаСумкаЗакрыта.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрВставкиМеталла, ВыборкаВставкиМеталла);	
			Иначе
				Продолжить;
			КонецЕсли;
		ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
			КоличествоВставокМеталла = КоличествоВставокМеталла(ВыборкаВставкиМеталла.ОбъектЗалога, НачалоДня(Объект.Дата), Истина);
			КоличествоЗагруженныхВставокМеталла = КоличествоЗагруженныхВставок(ВыборкаВставкиМеталла.ОбъектЗалога, "ВставкиМеталлаНовыеОЗ");
			
			Если КоличествоЗагруженныхВставокМеталла <> КоличествоВставокМеталла Тогда
				НовСтрВставкиМеталла = Объект.ВставкиМеталлаНовыеОЗ.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрВставкиМеталла, ВыборкаВставкиМеталла);	
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		//-МАН
	КонецЦикла;

	//+МАН 26.03.25
	Если Остатки Тогда
		ТЧВставки = Объект.ВставкиФакт;
		ТЧВставкиМеталла = Объект.ВставкиМеталла;
	ИначеЕсли НаОХ Тогда
		ТЧВставки = Объект.ВставкиКамнейНаОХ;
		ТЧВставкиМеталла = Объект.ВставкиМеталлаНаОХ;
	ИначеЕсли Изъятые Тогда
		ТЧВставки = Объект.ВставкиКамнейИзъятые;
		ТЧВставкиМеталла = Объект.ВставкиМеталлаИзъятые;
	ИначеЕсли СумкаЗакрыта Тогда
		ТЧВставки = Объект.ВставкиКамнейСумкаЗакрыта;
		ТЧВставкиМеталла = Объект.ВставкиМеталлаСумкаЗакрыта;
	ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
		ТЧВставки = Объект.ВставкиКамнейНовыеОЗ;
		ТЧВставкиМеталла = Объект.ВставкиМеталлаНовыеОЗ;
	КонецЕсли;
	//-МАН
		
	Для каждого СтрОЗВставка Из ТЧВставки Цикл //ТзВствки Цикл
	
		Отбор = Новый Структура;
		Отбор.Вставить("ОбъектЗалога",СтрОЗВставка.ОбъектЗалога);
		
		//+МАН 25.11.24
		Если Остатки Тогда
			НайденныйОЗ = Объект.Товары.НайтиСтроки(Отбор);
		ИначеЕсли НаОХ Тогда
			НайденныйОЗ = Объект.НаОХ.НайтиСтроки(Отбор);
		ИначеЕсли Изъятые Тогда
			НайденныйОЗ = Объект.Изъятые.НайтиСтроки(Отбор);
		ИначеЕсли СумкаЗакрыта Тогда
			НайденныйОЗ = Объект.СумкаЗакрыта.НайтиСтроки(Отбор);
		ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
			НайденныйОЗ = Объект.НовыеОЗ.НайтиСтроки(Отбор);
		КонецЕсли;
		//-МАН

		Для каждого СтрОЗНайденный Из НайденныйОЗ Цикл
			СтрОЗНайденный.Вставка = ?(СтрОЗНайденный.Вставка = "", СтрОЗНайденный.Вставка, СтрОЗНайденный.Вставка + ", ") + СтрОЗВставка.ВидВставки.КраткоеНаименование;
		КонецЦикла;
	КонецЦикла;

	Для каждого СтрОЗВставкаМеталла Из ТЧВставкиМеталла Цикл //ТзВствкиМеталла Цикл
	
		Отбор = Новый Структура;
		Отбор.Вставить("ОбъектЗалога",СтрОЗВставкаМеталла.ОбъектЗалога);
		
		//+МАН 25.11.24
		Если Остатки Тогда
			НайденныйОЗ = Объект.Товары.НайтиСтроки(Отбор);
		ИначеЕсли НаОХ Тогда
			НайденныйОЗ = Объект.НаОХ.НайтиСтроки(Отбор);
		ИначеЕсли Изъятые Тогда
			НайденныйОЗ = Объект.Изъятые.НайтиСтроки(Отбор);
		ИначеЕсли СумкаЗакрыта Тогда
			НайденныйОЗ = Объект.СумкаЗакрыта.НайтиСтроки(Отбор);
		ИначеЕсли НовыеОЗ ИЛИ ОбновитьНовыеОЗ Тогда
			НайденныйОЗ = Объект.НовыеОЗ.НайтиСтроки(Отбор);
		КонецЕсли;
		//-МАН
		
		Для каждого СтрОЗНайденный Из НайденныйОЗ Цикл
			СтрОЗНайденный.Вставка = ?(СтрОЗНайденный.Вставка = "", СтрОЗНайденный.Вставка, СтрОЗНайденный.Вставка + ", ") + СтрОЗВставкаМеталла.Проба.Наименование;
		КонецЦикла;
	КонецЦикла;
	//-Мельников
	
	//+МАН 25.11.24
	Если Остатки Тогда
		ЗаполнитьПоОстаткамОбъектовЗалога(,Истина);
		ЗаполнитьПоОстаткамОбъектовЗалога(,,Истина);
		ЗаполнитьПоОстаткамОбъектовЗалога(,,,Истина);
	КонецЕсли;
	//-МАН
	
КонецПроцедуры
//-МАН
#КонецОбласти //СтарыеПроцедурыЗаполненияОстатков

&НаСервере
Функция КоличествоВставок(ОЗ, Дата, НовыеОЗ = Ложь)
	
	Если НЕ НовыеОЗ Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛБ_ВставкиОбъектаЗалогаСрезПоследних.НомерСтрокиТаблицы) КАК НомерСтрокиТаблицы
		|ИЗ
		|	РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(&НаДату, ОбъектЗалога = &ОбъектЗалога) КАК ЛБ_ВставкиОбъектаЗалогаСрезПоследних";
		
		Запрос.УстановитьПараметр("НаДату", Дата);
		Запрос.УстановитьПараметр("ОбъектЗалога", ОЗ);
		
		Результат = Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() Тогда
			Возврат Результат.НомерСтрокиТаблицы;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛБ_ВставкиОбъектаЗалогаСрезПоследних.НомерСтрокиТаблицы) КАК НомерСтрокиТаблицы
		|ИЗ
		|	РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(&ПоДату, ОбъектЗалога = &ОбъектЗалога) КАК ЛБ_ВставкиОбъектаЗалогаСрезПоследних
		|ГДЕ
		|	ЛБ_ВставкиОбъектаЗалогаСрезПоследних.Период МЕЖДУ &СДаты И &ПоДату";
		
		Запрос.УстановитьПараметр("СДаты", Дата);    
		Запрос.УстановитьПараметр("ПоДату", ТекущаяДата());    
		Запрос.УстановитьПараметр("ОбъектЗалога", ОЗ);
		
		Результат = Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() Тогда
			Возврат Результат.НомерСтрокиТаблицы;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция КоличествоВставокМеталла(ОЗ, Дата, НовыеОЗ = Ложь)
	
	Если НЕ НовыеОЗ Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.НомерСтрокиТаблицы) КАК НомерСтрокиТаблицы
		|ИЗ
		|	РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(
		|			&НаДату,
		|			ОбъектЗалога = &ОбъектЗалога
		|				И НомерСтрокиТаблицы <> 0) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних";
		
		Запрос.УстановитьПараметр("НаДату", Дата);
		Запрос.УстановитьПараметр("ОбъектЗалога", ОЗ);
		
		Результат = Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() Тогда
			Возврат Результат.НомерСтрокиТаблицы;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.НомерСтрокиТаблицы) КАК НомерСтрокиТаблицы
		|ИЗ
		|	РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(
		|			&ПоДату,
		|			ОбъектЗалога = &ОбъектЗалога
		|				И НомерСтрокиТаблицы <> 0) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних
		|ГДЕ
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.Период МЕЖДУ &СДаты И &ПоДату";
		
		Запрос.УстановитьПараметр("СДаты", Дата);    
		Запрос.УстановитьПараметр("ПоДату", ТекущаяДата());    
		Запрос.УстановитьПараметр("ОбъектЗалога", ОЗ);
		
		Результат = Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() Тогда
			Возврат Результат.НомерСтрокиТаблицы;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция КоличествоЗагруженныхВставок(ОЗ, ТЧ)
	
	ТЗ = Объект[ТЧ].Выгрузить(, "ОбъектЗалога");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнешнийИсточник.ОбъектЗалога КАК ОбъектЗалога
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ВнешнийИсточник КАК ВнешнийИсточник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.ОбъектЗалога КАК ОбъектЗалога
		|ИЗ
		|	ВТ КАК ВТ
		|ГДЕ
		|	ВТ.ОбъектЗалога = &ОбъектЗалога";
	
	Запрос.УстановитьПараметр("ВнешнийИсточник", ТЗ);
	Запрос.УстановитьПараметр("ОбъектЗалога", ОЗ);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат	Результат.Количество();
	
КонецФункции

&НаСервере
Функция ПолучитьРеквизитыПоОЗ(ОбъектЗалога, ПолучитьКолонки = Ложь)
	
	//Получаем реквизиты по ОЗ
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделияФакт,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК ПробаФакт,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК КатегорияФакт,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК ОбщаяМасса,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК ОбщаяМассаФакт,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК МассаМеталла,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК МассаМеталлаФакт,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба.Владелец КАК Металл,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба.Владелец КАК МеталлФакт,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Клеймо КАК Клеймо,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Клеймо КАК КлеймоФакт,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Именник КАК Именник,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Именник КАК ИменникФакт,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ДанныеИменника КАК ДанныеИменника,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ДанныеИменника КАК ДанныеИменникаФакт,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы КАК СуммаОценкиМеталлыФакт,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СостояниеИзделия КАК СостояниеИзделия,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Дефекты КАК Дефекты,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес30 КАК Вес30,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМакс КАК СуммаОценкиМакс,
			   	//+МАН 25.11.24 Закомментировал т.к. вернул старый запрос.
	               //|	ИСТИНА КАК ОтказОтВыкупа
				//-МАН
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
	               |			&НаДату,
	               |			Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
	               |				И Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
	               |				И НЕ Регистратор В(ВЫБРАТЬ
				   |										ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
				   |									ИЗ
				   |										РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&НаДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
				   |									ГДЕ
				   |										ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (Регистратор))
	               |				И ОбъектЗалога = &ОбъектЗалога) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Период УБЫВ";
	
	Если ПолучитьКолонки Тогда
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
		
		МассивКолонок = Новый Массив;
		
		Для каждого СтрКолонок Из СхемаЗапроса.ПакетЗапросов[0].Колонки Цикл
			МассивКолонок.Добавить(СтрКолонок.Псевдоним)
		КонецЦикла;
		
		Возврат МассивКолонок;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НаДату", НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("ОбъектЗалога", ОбъектЗалога);

	Если Объект.ВидИнвентаризации = Перечисления.ЛБ_ВидИнвентаризации.Выборочная Тогда
		Если Объект.ФильтрВидыИзделий.Количество() > 0 Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "100 = 100", "РеквизитыОбъектаЗалога.ВидИзделия В (&ВидИзделия)");
			Массив = ВернутьМассивИзФильтра(Объект.ФильтрВидыИзделий, "ВидИзделия");
			Запрос.УстановитьПараметр("ВидИзделия", Массив);
		КонецЕсли;
		
		Если Объект.ФильтрКатегории.Количество() > 0 Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "200 = 200", "РеквизитыОбъектаЗалога.Категория В (&Категории)");
			Массив = ВернутьМассивИзФильтра(Объект.ФильтрКатегории, "Категория");
			Запрос.УстановитьПараметр("Категории", Массив);
		КонецЕсли;
		
		Если Объект.ФильтрПробы.Количество() > 0 Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "300 = 300", "РеквизитыОбъектаЗалога.Проба В (&Пробы)");
			Массив = ВернутьМассивИзФильтра(Объект.ФильтрПробы, "Проба");
			Запрос.УстановитьПараметр("Пробы", Массив);
		КонецЕсли;
		
		Если Объект.ОтборОбщаяМассаОт > 0 И Объект.ОтборОбщаяМассаДо > 0 Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "700 = 700", "РеквизитыОбъектаЗалога.Вес МЕЖДУ &ОтборОбщаяМассаОт И &ОтборОбщаяМассаДо");
			Запрос.УстановитьПараметр("ОтборОбщаяМассаОт", Объект.ОтборОбщаяМассаОт);
			Запрос.УстановитьПараметр("ОтборОбщаяМассаДо", Объект.ОтборОбщаяМассаДо);
		КонецЕсли;
		
		Если Объект.ОтборМассаМеталлаОт > 0 И Объект.ОтборМассаМеталлаДо > 0 Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "900 = 900", "РеквизитыОбъектаЗалога.Вес МЕЖДУ &ОтборМассаМеталлаОт И &ОтборМассаМеталлаДо");
			Запрос.УстановитьПараметр("ОтборМассаМеталлаОт", Объект.ОтборМассаМеталлаОт);
			Запрос.УстановитьПараметр("ОтборМассаМеталлаДо", Объект.ОтборМассаМеталлаДо);
		КонецЕсли;	

		//+15.05.24 Добавлен фильтр по именнику
		Если Объект.ОтборИменник Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "600 = 600", "РеквизитыОбъектаЗалога.Именник = &ОтборИменник");
			Запрос.УстановитьПараметр("ОтборИменник", ПредопределенноеЗначение("Перечисление.ЛБ_Именник.Да"));
		КонецЕсли;
		
	КонецЕсли;

	ЗапросВыкуп = Новый Запрос;
	ЗапросВыкуп.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	ЛБ_ОбъектыЗалогаОстатки.ОтказОтВыкупа КАК ОтказОтВыкупа
		               |ИЗ
		               |	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(&НаДату, ОбъектЗалога = &ОбъектЗалога) КАК ЛБ_ОбъектыЗалогаОстатки
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет.Дата УБЫВ";
	
	ЗапросВыкуп.УстановитьПараметр("НаДату", НачалоДня(Объект.Дата));
	ЗапросВыкуп.УстановитьПараметр("ОбъектЗалога", ОбъектЗалога);

	РезультатРеквизиты = Запрос.Выполнить().Выгрузить();
	
	Если РезультатРеквизиты.Количество() > 0 Тогда
		//+МАН 25.11.24 Закомментировал т.к. вернул старый запрос.
		//РезультатВыкуп = ЗапросВыкуп.Выполнить().Выгрузить();
		//
		//МассивИменКолонок = Новый Массив;
		//МассивИменКолонок.Добавить("ОтказОтВыкупа");
		//
		//Для Каждого ИмяКолонки Из МассивИменКолонок Цикл
		//	РезультатРеквизиты.ЗагрузитьКолонку(РезультатВыкуп.ВыгрузитьКолонку(ИмяКолонки), ИмяКолонки);
		//КонецЦикла;
		
		Возврат РезультатРеквизиты;
		//-МАН
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьОтклонениеПоОЗ(ОбъектЗалога)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияТовары.Отклонения КАК Отклонения
		|ИЗ
		|	Документ.ЛБ_Инвентаризация КАК ЛБ_Инвентаризация
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛБ_Инвентаризация.Товары КАК ЛБ_ИнвентаризацияТовары
		|		ПО ЛБ_Инвентаризация.Ссылка = ЛБ_ИнвентаризацияТовары.Ссылка
		|ГДЕ
		|	ЛБ_Инвентаризация.Проведен
		|	И НЕ ЛБ_Инвентаризация.ПометкаУдаления
		|	И ЛБ_ИнвентаризацияТовары.ОбъектЗалога <> ЗНАЧЕНИЕ(Справочник.ЛБ_ОбъектыЗалога.ПустаяСсылка)
		|	И ЛБ_ИнвентаризацияТовары.ОбъектЗалога = &ОбъектЗалога
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИнвентаризацияНовыеОЗ.Отклонения
		|ИЗ
		|	Документ.ЛБ_Инвентаризация КАК ЛБ_Инвентаризация
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛБ_Инвентаризация.НовыеОЗ КАК ЛБ_ИнвентаризацияНовыеОЗ
		|		ПО ЛБ_Инвентаризация.Ссылка = ЛБ_ИнвентаризацияНовыеОЗ.Ссылка
		|ГДЕ
		|	ЛБ_Инвентаризация.Проведен
		|	И НЕ ЛБ_Инвентаризация.ПометкаУдаления
		|	И ЛБ_ИнвентаризацияНовыеОЗ.ОбъектЗалога <> ЗНАЧЕНИЕ(Справочник.ЛБ_ОбъектыЗалога.ПустаяСсылка)
		|	И ЛБ_ИнвентаризацияНовыеОЗ.ОбъектЗалога = &ОбъектЗалога";
	
	Запрос.УстановитьПараметр("ОбъектЗалога", ОбъектЗалога);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Отклонения;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция ВернутьМассивИзФильтра(Фильтр, НазваниеКолонки)
	Массив = Новый Массив;
	Для каждого стр из Фильтр Цикл
		Массив.Добавить(стр[НазваниеКолонки]);
	КонецЦикла;
	
	Возврат Массив;	
КонецФункции

&НаСервереБезКонтекста
Функция СтатусКорректировкиСтоимостиНоменклатуры(Знач Организация, Знач Период)
	
	// ++ Сербаев 05.05.2023
	//Результат = Новый Структура;
	//Результат.Вставить("ОперацияВыполненаЗаТекущийМесяц",    Ложь);
	//Результат.Вставить("ОперацияВыполненаЗаПредыдущийМесяц", Ложь);

	//// Определяем, нужно ли выполнять корректировку себестоимости.
	//Результат.ОперацияВыполненаЗаТекущийМесяц = РаботаСПоследовательностями.ЕстьНеустаревшаяОперация(
	//	Организация,
	//	Период,
	//	Перечисления.ВидыРегламентныхОпераций.КорректировкаСтоимостиНоменклатуры);
	//
	//// Если себестоимость была неактуальна ещё в прошлом месяце, то текущий месяц не имеет значения.
	//Если Результат.ОперацияВыполненаЗаТекущийМесяц
	//	ИЛИ ЗакрытиеМесяца.ЭтоПервыйМесяцВеденияУчета(НачалоМесяца(Период), Организация) Тогда
	//	Результат.ОперацияВыполненаЗаПредыдущийМесяц = Истина;
	//Иначе
	//	Результат.ОперацияВыполненаЗаПредыдущийМесяц = РаботаСПоследовательностями.ЕстьНеустаревшаяОперация(
	//		Организация,
	//		ДобавитьМесяц(Период, -1),
	//		Перечисления.ВидыРегламентныхОпераций.КорректировкаСтоимостиНоменклатуры);
	//КонецЕсли;
	//
	//Возврат Результат;
	// -- Сербаев 05.05.2023
	
КонецФункции

&НаКлиенте
Процедура ОпределитьНеобходимостьАктуализацииСебестоимости(НазваниеДействия, СтатусКорректировкиСтоимости)
	
	Если СтатусКорректировкиСтоимости.ОперацияВыполненаЗаТекущийМесяц Тогда
		ЗаполнитьПоАктуальнымОстаткам(НазваниеДействия, Ложь);
	Иначе
	
		Оповещение = Новый ОписаниеОповещения("ВопросОНеобходимостиАктуализацииСебестоимостиЗавершение", ЭтотОбъект, НазваниеДействия);
		ТекстВопроса = НСтр("ru = 'Данные учета не актуальны. Необходимо рассчитать себестоимость номенклатуры.'");
		
		Кнопки = Новый СписокЗначений;
		Если СтатусКорректировкиСтоимости.ОперацияВыполненаЗаПредыдущийМесяц Тогда
			// Предлагаем актуализировать "бесшовно" (в фоновом задании).
			Кнопки.Добавить("ВыполнитьКорректировку",  НСтр("ru = 'Выполнить корректировку стоимости'"));
			Кнопки.Добавить("НеАктуализировать", НСтр("ru = 'Не актуализировать себестоимость'"));
		Иначе
			// Предлагаем перейти в "Закрытие месяца".
			Кнопки.Добавить("ПерейтиВЗакрытие",  НСтр("ru = 'Перейти в ""Закрытие месяца""'"));
			Кнопки.Добавить("НеАктуализировать", НСтр("ru = 'Не актуализировать себестоимость'"));
		КонецЕсли;
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки, , "НеАктуализировать");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросОНеобходимостиАктуализацииСебестоимостиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = "ВыполнитьКорректировку" Тогда
		
		ЗаполнитьПоАктуальнымОстаткам(ДополнительныеПараметры, Истина);
		
	ИначеЕсли Результат = "ПерейтиВЗакрытие" Тогда
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Организация",       Объект.Организация);
		ПараметрыОткрытия.Вставить("ПериодРегистрации", Объект.Дата);
		
		ОткрытьФорму("Обработка.ЗакрытиеМесяца.Форма", ПараметрыОткрытия, ЭтотОбъект, Объект.Ссылка);
		
	Иначе
		
		ЗаполнитьПоАктуальнымОстаткам(ДополнительныеПараметры, Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоАктуальнымОстаткам(НазваниеДействия, ВыполнитьКорректировкуСтоимости)
	
	// запускаем фоновое задание
	РезультатЗаполнения = ЗапуститьЗаполнениеПоОстаткам(НазваниеДействия, ВыполнитьКорректировкуСтоимости);
	
	Если РезультатЗаполнения.ЗаданиеВыполнено Тогда
		// Результат получен и уже обработан на стороне сервера
		СообщитьРезультатЗаполнения(РезультатЗаполнения);

	ИначеЕсли ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтотОбъект, ИдентификаторЗадания);
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ЗапуститьЗаполнениеПоОстаткам(НазваниеДействия, ВыполнитьКорректировкуСтоимости)
	
	
КонецФункции

&НаКлиенте
Процедура СообщитьРезультатЗаполнения(РезультатЗаполнения)
	
	Если Не РезультатЗаполнения.ОткрытьФормуОшибки Тогда
		// ТЧ "Товары" заполнена
		Возврат;
	КонецЕсли;
	
	// ++ Сербаев 05.05.2023
	//Если ЗначениеЗаполнено(РезультатЗаполнения.ОперацияКорректировкаСтоимости) Тогда
	//	ЗакрытиеМесяцаКлиент.ОткрытьФормуОшибок(РезультатЗаполнения.ОперацияКорректировкаСтоимости);
	//Иначе
	//	ТекстПредупреждения = НСтр("ru = 'Операция не выполнена'");
	//	ПоказатьПредупреждение(, ТекстПредупреждения);
	//КонецЕсли; 
	// -- Сербаев 05.05.2023
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	// ++ Сербаев 05.05.2023
	//Попытка
	//	Если ЗакрытиеМесяцаВызовСервера.ЗаданиеВыполнено(ИдентификаторЗадания) Тогда
	//		
	//		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
	//		
	//		РезультатЗаполнения = ПрочитатьРезультатЗаполнения();
	//		СообщитьРезультатЗаполнения(РезультатЗаполнения);
	//		
	//	Иначе
	//		ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
	//		ПодключитьОбработчикОжидания(
	//			"Подключаемый_ПроверитьВыполнениеЗадания", 
	//			ПараметрыОбработчикаОжидания.ТекущийИнтервал, 
	//			Истина);
	//	КонецЕсли;
	//Исключение
	//	ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
	//	ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	//КонецПопытки;
	// -- Сербаев 05.05.2023
	
КонецПроцедуры

&НаСервере
Функция ПрочитатьРезультатЗаполнения(ОперацияКорректировкаСтоимости = Неопределено)
	
	РезультатЗаполнения = Документы.ИнвентаризацияТоваровНаСкладе.НовыйРезультатЗаполнения();
	РезультатЗаполнения.ОперацияКорректировкаСтоимости = ОперацияКорректировкаСтоимости;
	
	РезультатЗаполнения.ЗаданиеВыполнено = Истина;
	
	Обработки.ЗакрытиеМесяца.ПрочитатьРезультатЗаполнения(АдресХранилища, РезультатЗаполнения, Объект);
	ЗаполнитьДобавленныеКолонкиТаблиц();
	
	Возврат РезультатЗаполнения;
	
КонецФункции

&НаКлиенте
Процедура ТоварыОбщаяМассаФактПриИзменении(Элемент)
	//СформироватьСтрокуОтклонения();
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	//ЦенаДрагоценногоМеталла(СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор());

	//ОтборВ = Новый Структура;
	//ОтборВ.Вставить("КлючСтроки", СтрокаТабличнойЧастиТовары.КлючСтроки);
	//Строки = Объект.Вставки.НайтиСтроки(ОтборВ);
	//СуммаОценкиКамни = 0;
	//Для каждого СтрокаТабличнойЧасти Из Строки Цикл		
	//    ЦенаДрагоценногоКамня(СтрокаТабличнойЧасти.ПолучитьИдентификатор(), СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор());
	//	СуммаОценкиКамни = СуммаОценкиКамни + СтрокаТабличнойЧасти.Сумма;
	//КонецЦикла;	
	//СтрокаТабличнойЧастиТовары.СуммаОценкиКамни = СуммаОценкиКамни;
	//ПересчитатьСуммТовары(СтрокаТабличнойЧастиТовары); 
КонецПроцедуры

&НаСервере
Процедура ЦенаДрагоценногоМеталла(Идентификатор, ИмяТабличнойЧасти = "Товары", ТЧ) 
	Стр = Объект[ИмяТабличнойЧасти].НайтиПоИдентификатору(Идентификатор);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Дата", 				НачалоДня(Стр.ОперацияЗайма.Дата));
	СтруктураПараметров.Вставить("Ломбард", 			Объект.Ломбард);
	СтруктураПараметров.Вставить("СхемаКредитования", 	Стр.ОперацияЗайма.СхемаКредитования);  
	СтруктураПараметров.Вставить("Проба", 				Стр.ПробаФакт);
	СтруктураПараметров.Вставить("Категория", 			Стр.КатегорияФакт);
	СтруктураПараметров.Вставить("ЕдиницаИзмерения", 	Стр.ЕдиницаИзмерения);
	//+Мельников 16.10.24 Инвентаризация. Заявка 2464
	СтруктураПараметров.Вставить("Залогодатель",		Стр.ОперацияЗайма.Залогодатель);
	//-Мельников
	
	Результат = ЛБ_ОбщийМодуль.ПолучитьЦенуМеталлаИзПрейскуранта(СтруктураПараметров);
	Цена = Результат.Цена;  
	
	Отбор = Новый Структура;
	Отбор.Вставить("ОбъектЗалога", Стр.ОбъектЗалога); //("КлючСтроки", Стр.КлючСтроки);
	СтрокиВ = Объект[ТЧ.ВставкаК].НайтиСтроки(Отбор);
	
	СуммаОценкиВставкиК = 0;
	СуммаОценкиВставкиМ = 0;
	ВесВставокК = 0;
	ВесВставокМ = 0;
	Стр.Вставка = "";
		
	Для каждого СтрВК Из СтрокиВ Цикл	
		//ЦенаДрагоценногоКамня(СтрВ.ПолучитьИдентификатор(), Идентификатор);
		СуммаОценкиВставкиК = СуммаОценкиВставкиК + СтрВК.СуммаФакт;
		ВесВставокК = ВесВставокК + СтрВК.ВесГраммыФакт;
		Стр.Вставка = ?(Стр.Вставка = "", Стр.Вставка, Стр.Вставка + ", ") + СтрВК.ВидВставкиФакт.КраткоеНаименование;
	КонецЦикла;		

	//ОтборВМ = Новый Структура;
	//ОтборВМ.Вставить("ОбъектЗалога", Стр.ОбъектЗалога);
	СтрокиВМ = Объект[ТЧ.ВставкаМ].НайтиСтроки(Отбор);
	
	Для каждого СтрВМ Из СтрокиВМ Цикл
		ВесВставокМ = ВесВставокМ + СтрВМ.ВесФакт;
		СуммаОценкиВставкиМ = СуммаОценкиВставкиМ + СтрВМ.СуммаОценкиФакт;
		Стр.Вставка = ?(Стр.Вставка = "", Стр.Вставка, Стр.Вставка + ", ") + СтрВМ.ПробаФакт.Наименование;
	КонецЦикла;
	
	стр.Ценафакт = Цена;
	
	//+Мельников 26.06.24
	Если НЕ ТЧ.Свойство("Форма") Тогда
		стр.МассаМеталлаФакт = Цел((стр.ОбщаяМассаФакт - (ВесВставокК + ВесВставокМ))*100)/100;
	КонецЕсли;
	//-Мельников
	
	//+МАН 04.06.25 Заявка 3211 (п. 27)
	//стр.СуммаОценкиМеталлыФакт = стр.МассаМеталлаФакт * Цена * стр.КоличествоФакт + СуммаОценкиВставкиМ;
	стр.СуммаОценкиМеталлыФакт = стр.МассаМеталлаФакт * Цена + СуммаОценкиВставкиМ;
	//-МАН
	стр.СуммаОценкиКамниФакт = СуммаОценкиВставкиК;
	//Стр.СуммаОценкиКамниФакт = СуммаОценкиКамни * стр.КоличествоФакт;;
	
	//ОтборДоп = Новый Структура;
	//ОтборДоп.Вставить("КлючСтроки", Стр.КлючСтроки);
	//СтрокиДоп = ДополнительныеМеталлы.НайтиСтроки(ОтборДоп);
	//Для каждого СтрДоп Из СтрокиДоп Цикл  
	//	СтруктураПараметров.Вставить("Проба", СтрДоп.Проба);
	//	СтруктураПараметров.Вставить("Категория", СтрДоп.Категория);
	//	СтруктураПараметров.Вставить("ЕдиницаИзмерения", СтрДоп.ЕдиницаИзмерения);
	//	СтрДоп.Цена = ЛБ_ОбщийМодуль.ПолучитьЦенуМеталлаИзПрейскуранта(СтруктураПараметров);
	//	СтрДоп.СуммаОценкиМеталлы = СтрДоп.Цена*СтрДоп.ВесЧистый;
	//	Стр.СуммаОценкиМеталлы = Стр.СуммаОценкиМеталлы + СтрДоп.СуммаОценкиМеталлы;
	//Конеццикла;	 
	
	Стр.СуммаОценкиФакт = Стр.СуммаОценкиМеталлыФакт + СуммаОценкиВставкиК;


КонецПроцедуры

&НаСервере
Процедура ЦенаДрагоценногоКамня(Идентификатор, ИдентификаторТовары, ТЧ) 
	СтрокаТабличнойЧастиВставки = Объект[ТЧ.ВставкаК].НайтиПоИдентификатору(Идентификатор);
	СтрокаТабличнойЧастиТовары = Объект[ТЧ.Основная].НайтиПоИдентификатору(ИдентификаторТовары);
	
	Если СтрокаТабличнойЧастиВставки.НеОценивать Тогда
        СтрокаТабличнойЧастиВставки.ЦенаФакт  = 0;
		СтрокаТабличнойЧастиВставки.СуммаФакт = 0;
	Иначе           
		СтруктураВставки = новый Структура; 
		СтруктураВставки.Вставить("Дата", НачалоДня(СтрокаТабличнойЧастиТовары.ОперацияЗайма.Дата)); //+Мельников 27.04.24 изменил Было: Объект.Дата); 
		СтруктураВставки.Вставить("Ломбард", Объект.Ломбард);
		СтруктураВставки.Вставить("ВидВставки", СтрокаТабличнойЧастиВставки.ВидВставкиФакт);
		СтруктураВставки.Вставить("ФормаОгранки", СтрокаТабличнойЧастиВставки.ФормаОгранкиФакт);
        СтруктураВставки.Вставить("ВидОгранки", СтрокаТабличнойЧастиВставки.ВидОгранкиФакт);
        СтруктураВставки.Вставить("КачествоОгранки", СтрокаТабличнойЧастиВставки.КачествоОгранкиФакт);
        СтруктураВставки.Вставить("ЕдиницаИзмерения", СтрокаТабличнойЧастиВставки.ЕдиницаИзмеренияФакт);
        СтруктураВставки.Вставить("Вес", ?(СтрокаТабличнойЧастиВставки.ЕдиницаИзмеренияФакт.Код = "162", СтрокаТабличнойЧастиВставки.ВесФакт, СтрокаТабличнойЧастиВставки.ВесГраммыФакт));
		//+Мельников 16.10.24 Инвентаризация. Заявка 2464
		СтруктураВставки.Вставить("СхемаКредитования", СтрокаТабличнойЧастиТовары.ОперацияЗайма.СхемаКредитования);
		СтруктураВставки.Вставить("Залогодатель", СтрокаТабличнойЧастиТовары.ОперацияЗайма.Залогодатель);
		//-Мельников
		
		Результат = ЛБ_ОбщийМодуль.ПолучитьЦенуДрагоценногоКамняИзПрейскуранта(СтруктураВставки);
	    СтрокаТабличнойЧастиВставки.ЦенаФакт = Результат.Цена;
        СтрокаТабличнойЧастиВставки.СуммаФакт = окр(СтрокаТабличнойЧастиВставки.ЦенаФакт * ?(НЕ СтрокаТабличнойЧастиВставки.ЭтоВесовойФакт, СтрокаТабличнойЧастиВставки.КоличествоФакт, СтрокаТабличнойЧастиВставки.ВесФакт), 2);
	КонецЕсли;	
КонецПроцедуры 

Процедура ПересчетСуммыОценкиФакт()
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПробаФактПриИзменении(Элемент)
	//СформироватьСтрокуОтклонения();
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	//ЦенаДрагоценногоМеталла(СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор());
КонецПроцедуры

Процедура СформироватьСтрокуОтклонения(ТЧ) 
	Идентификатор = Элементы[ТЧ.Основная].ТекущаяСтрока;
	ДанныеТекСтр  = Объект[ТЧ.Основная].НайтиПоИдентификатору(Идентификатор);

	ВставкаК = ПолучитьВставкуКамняПоОЗ(ДанныеТекСтр.ОбъектЗалога, ТЧ, Объект.Ссылка);
	//ВставкаК = ПолучитьВставкуМеталлаПоОЗ(ДанныеТекСтр.ОбъектЗалога, ТЧ);
	
	//печОткл = "";
	печОткл = ПолучитьОтклонениеПоОЗ(ДанныеТекСтр.ОбъектЗалога);

	//++ООВ 26.03.2026 Заявка 3757	
	//Если ДанныеТекСтр.Приемщик.Сотрудник.Наименование = "" Тогда		
		Если ДанныеТекСтр.Приемщик.Наименование = "" Тогда
	//--ООВ 26.03.2026 Заявка 3757

		ПользовательКраткоеИмя = "";
	Иначе
		ПользовательКраткоеИмя = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ДанныеТекСтр.Приемщик.Наименование);
	КонецЕсли;

	//ПользовательКраткоеИмя = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Пользователи.ТекущийПользователь().Наименование);
	
	Если ДанныеТекСтр.ВидИзделия <> ДанныеТекСтр.ВидИзделияФакт ИЛИ ДанныеТекСтр.Проба <> ДанныеТекСтр.ПробаФакт ИЛИ
		ДанныеТекСтр.Категория <> ДанныеТекСтр.КатегорияФакт ИЛИ ДанныеТекСтр.МассаМеталла <> ДанныеТекСтр.МассаМеталлаФакт ИЛИ
		ДанныеТекСтр.ОбщаяМасса <> ДанныеТекСтр.ОбщаяМассаФакт ИЛИ ДанныеТекСтр.Количество <> ДанныеТекСтр.КоличествоФакт 
		ИЛИ ВставкаК.Количество() > 0 Тогда
		
		печОткл = ?(печОткл = "", печОткл + ПользовательКраткоеИмя + ":", печОткл + ";");
		
		Если ДанныеТекСтр.ВидИзделия <> ДанныеТекСтр.ВидИзделияФакт Тогда
			НаимФакт = СтрЗаменить(ДанныеТекСтр.ОбъектЗалога.Наименование, ДанныеТекСтр.ВидИзделия, ДанныеТекСтр.ВидИзделияФакт);
			печОткл = ?(СтрНайти(печОткл, ";", НаправлениеПоиска.СКонца) = СтрДлина(печОткл), печОткл + " Наим: " + НаимФакт, печОткл + ", Наим: " + НаимФакт);
		КонецЕсли;
		
		Если ДанныеТекСтр.Категория <> ДанныеТекСтр.КатегорияФакт Тогда
			печОткл = ?(СтрНайти(печОткл, ";", НаправлениеПоиска.СКонца) = СтрДлина(печОткл),
			печОткл + " " + ДанныеТекСтр.Категория.Наименование + Символ(8594) + ДанныеТекСтр.КатегорияФакт.Наименование,
			печОткл + ДанныеТекСтр.Категория.Наименование + Символ(8594) + ДанныеТекСтр.КатегорияФакт.Наименование);
		КонецЕсли;
		
		Если ДанныеТекСтр.Металл <> ДанныеТекСтр.МеталлФакт Тогда
			печОткл = ?(СтрНайти(печОткл, ";", НаправлениеПоиска.СКонца) = СтрДлина(печОткл), печОткл + " Мет", печОткл + ", Мет");
		КонецЕсли;

		Если ДанныеТекСтр.Проба <> ДанныеТекСтр.ПробаФакт Тогда
			печОткл = ?(СтрНайти(печОткл, ";", НаправлениеПоиска.СКонца) = СтрДлина(печОткл), печОткл + " Проба", печОткл + ", Проба");
		КонецЕсли;

		Если ДанныеТекСтр.Количество <> ДанныеТекСтр.КоличествоФакт Тогда
			печОткл = ?(СтрНайти(печОткл, ";", НаправлениеПоиска.СКонца) = СтрДлина(печОткл), печОткл + " Шт", печОткл + ", Шт");
		КонецЕсли;
		
		ИзмВставкиБр = Ложь;
		ИзмВставкиНеБр = Ложь;
		
		Если ВставкаК <> Неопределено И ВставкаК.Количество() > 0 Тогда
			Для каждого СтрВст Из ВставкаК Цикл
				Для каждого СтрКолонка Из ВставкаК.Колонки Цикл
					
					ЭлементФакт = СтрНайти(СтрКолонка.Имя, "Факт");

					Если ЭлементФакт = 0 Тогда
						Если СтрВст[СтрКолонка.Имя] <> СтрВст[СтрКолонка.Имя + "Факт"] Тогда
							Если СтрВст.ВидВставки = Справочники.ЛБ_ДрагоценныеКамни.Бриллиант Тогда
								печОткл = ?(СтрНайти(печОткл, ";", НаправлениеПоиска.СКонца) = СтрДлина(печОткл), печОткл + " Оц.бр.", печОткл + ", Оц.бр.");
								ИзмВставкиБр = Истина;
							Иначе
								печОткл = ?(СтрНайти(печОткл, ";", НаправлениеПоиска.СКонца) = СтрДлина(печОткл), печОткл + " ВесМет", печОткл + ", ВесМет");
								ИзмВставкиНеБр = Истина;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		
		Если ДанныеТекСтр.ОбщаяМасса <> ДанныеТекСтр.ОбщаяМассаФакт Тогда
			печОткл = ?(СтрНайти(печОткл, ";", НаправлениеПоиска.СКонца) = СтрДлина(печОткл), печОткл + " ВесОбщ", печОткл + ", ВесОбщ");
			
			Если ДанныеТекСтр.МассаМеталла <> ДанныеТекСтр.МассаМеталлаФакт И НЕ ИзмВставкиНеБр Тогда
				печОткл = ?(СтрНайти(печОткл, ";", НаправлениеПоиска.СКонца) = СтрДлина(печОткл), печОткл + " ВесМет", печОткл + ", ВесМет");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	//КодСимвола("→") Символ(8594)
	
	печОткл = ?(СтрНайти(печОткл, ",") = 1, Сред(печОткл, 3), печОткл); 
	
	ДанныеТекСтр.Отклонения = печОткл;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВидИзделияФактПриИзменении(Элемент)
	//СформироватьСтрокуОтклонения();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыМеталлФактПриИзменении(Элемент)
	//СформироватьСтрокуОтклонения();
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	//ЦенаДрагоценногоМеталла(СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор());
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКатегорияФактПриИзменении(Элемент)
	//СформироватьСтрокуОтклонения();
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	//ЦенаДрагоценногоМеталла(СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор());
КонецПроцедуры

&НаКлиенте
Процедура ТоварыМассаМеталлаФактПриИзменении(Элемент)
	//СформироватьСтрокуОтклонения();
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	//ЦенаДрагоценногоМеталла(СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор());
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВставкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	а = 0;
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;

	//ПараметрыФормы = Новый Структура("ОбъектЗалога", Объект.Склад);
	//ОткрытьФорму("Документ.РасходнаяНакладная.Форма.ФормаПодбора", ПараметрыФормы, Элементы.СписокНоменклатуры, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	//+Мельников 22.05.24. Закомментировал
	//а = 0; 
	//Если Поле.Имя = "ТоварыВставкиФакт" Тогда
	//	//ПараметрыФормы = Новый Структура("ОбъектЗалога", Элементы.Товары.ТекущиеДанные.ОбъектЗалога);
	//	//
	//	//
	//	//массивСтрок = Объект.ВставкиФакт.НайтиСтроки(Новый Структура("ОбъектЗалога",Элементы.Товары.ТекущиеДанные.ОбъектЗалога));
	//	//
	//	//ПараметрыФормы = Новый Структура("ОбъектЗалога, МассивСтрок", Элементы.Товары.ТекущиеДанные.ОбъектЗалога, МассивСтрок);
	//	//
	//	//
	//	//ОткрытьФорму("Документ.ЛБ_Инвентаризация.Форма.ФормаРедактированияВставок", ПараметрыФормы, , , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	//	
	//	
	//	ТекДанные = Элементы.Товары.ТекущиеДанные;
	//	
	//	ПараметрыФормы = новый структура;
	//	ПараметрыФормы.Вставить("КатегорияОбъектаЗалога", 	ТекДанные.КатегорияФакт); 
	//	ПараметрыФормы.Вставить("Клеймо", 					ТекДанные.КлеймоФакт);
	//	ПараметрыФормы.Вставить("Количество", 				ТекДанные.Количество); 
	//	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораВставки",ЭтаФорма);
	//	ОткрытьФорму("Документ.ЛБ_Инвентаризация.Форма.КорректировкаВставки", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//  
	//КонецЕсли;
	
	//ОтклоненияОЗ(Истина);
	Если Элемент.ТекущийЭлемент.Имя <> "ТоварыКомментарий" Тогда
		ОткрытиеФормыОтклоненияОЗ(СформироватьСтруктуруТабличныхЧастей("Товары"));
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВыбораВставки(Результат, ДопПараметры) Экспорт  
	//+Мельников 23.05.24 Перенес ниже
	//Если Результат = неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//-Мельников
	
	СтрокаТабличнойЧастиТовары = Элементы[ДопПараметры.Основная].ТекущиеДанные;
	СтрокаТабличнойЧастиВставки = Элементы[ДопПараметры.ВставкаК].ТекущиеДанные; 
	
	//Объект.ВставкиФакт.НайтиПоИдентификатору(Результат.ИДНоваяСтрокаТЧ)
	
	//+Мельников 21.05.24 Изменил на запись в фактические данные. Старое закомментировал.	
	//СтрокаТабличнойЧасти.Количество = Результат.Количество; 
	//СтрокаТабличнойЧасти.ВидВставки = Результат.ВидВставки;
	//СтрокаТабличнойЧасти.ЕдиницаИзмерения = Результат.ЕдиницаИзмерения;
	//СтрокаТабличнойЧасти.ФормаОгранки = Результат.ФормаОгранки;
	//СтрокаТабличнойЧасти.ВидОгранки = Результат.ВидОгранки;
	//СтрокаТабличнойЧасти.КачествоОгранки = Результат.КачествоОгранки; 
	//СтрокаТабличнойЧасти.Диаметр = Результат.Диаметр;
	//СтрокаТабличнойЧасти.Диаметр1 = Результат.Диаметр1;
	//СтрокаТабличнойЧасти.Диаметр2 = Результат.Диаметр2; 
	//СтрокаТабличнойЧасти.Длина = Результат.Длина;  
	//СтрокаТабличнойЧасти.Ширина = Результат.Ширина;
	//СтрокаТабличнойЧасти.Высота = Результат.Высота;
	//СтрокаТабличнойЧасти.Вес = Результат.Вес; 
	//СтрокаТабличнойЧасти.ВесГраммы = Результат.ВесГраммы;
	//СтрокаТабличнойЧасти.ОписаниеРазмера = Результат.ОписаниеРазмера;  
	//СтрокаТабличнойЧасти.ЭтоВесовой = ПроверитьВесовой(СтрокаТабличнойЧасти.ЕдиницаИзмерения);

	Если Результат = Неопределено Тогда
		Возврат;
	ИначеЕсли ТипЗнч(Результат) = Тип("Структура") И Результат.НоваяСтрокаТЧ И Результат.Отмена Тогда
		Если Элементы[ДопПараметры.ВставкаК].ТекущиеДанные <> Неопределено Тогда
			//+МАН 30.05.25 Изменил удаление пустой строки.
			//Объект[ДопПараметры.ВставкаК].Удалить(Элементы[ДопПараметры.ВставкаК].ТекущиеДанные.НомерСтроки - 1);
			Объект[ДопПараметры.ВставкаК].Удалить(Результат.ИДНоваяСтрокаТЧ);
			//-МАН
		КонецЕсли;
	Иначе
		Если Результат.НоваяСтрокаТЧ Тогда
			СтрокаТабличнойЧастиВставки = Объект[ДопПараметры.ВставкаК].НайтиПоИдентификатору(Результат.ИДНоваяСтрокаТЧ);
		КонецЕсли;
		
		//+Мельников 15.10.24 Добавил проверку на комплектующее Заявка 2464
		Если НЕ Результат.Свойство("Комплектующее") Тогда
			СтрокаТабличнойЧастиВставки.КоличествоФакт = Результат.КоличествоФакт;
			СтрокаТабличнойЧастиВставки.ВидВставкиФакт = Результат.ВидВставкиФакт;
			СтрокаТабличнойЧастиВставки.ЕдиницаИзмеренияФакт = Результат.ЕдиницаИзмеренияФакт;
			СтрокаТабличнойЧастиВставки.ФормаОгранкиФакт = Результат.ФормаОгранкиФакт;
			СтрокаТабличнойЧастиВставки.ВидОгранкиФакт = Результат.ВидОгранкиФакт;
			СтрокаТабличнойЧастиВставки.КачествоОгранкиФакт = Результат.КачествоОгранкиФакт;
			СтрокаТабличнойЧастиВставки.ДиаметрФакт = Результат.ДиаметрФакт;
			СтрокаТабличнойЧастиВставки.Диаметр1Факт = Результат.Диаметр1Факт;
			СтрокаТабличнойЧастиВставки.Диаметр2Факт = Результат.Диаметр2Факт;
			СтрокаТабличнойЧастиВставки.ДлинаФакт = Результат.ДлинаФакт;
			СтрокаТабличнойЧастиВставки.ШиринаФакт = Результат.ШиринаФакт;
			СтрокаТабличнойЧастиВставки.ВысотаФакт = Результат.ВысотаФакт;
			//+МАН 25.03.25
			Если СтрокаТабличнойЧастиВставки.ВидВставкиФакт = ПредопределенноеЗначение("Справочник.ЛБ_ДрагоценныеКамни.Бриллиант") Тогда
				СтрокаТабличнойЧастиВставки.ВесФакт = Результат.ВесФакт;
			Иначе
				СтрокаТабличнойЧастиВставки.ВесФакт = 0;
			КонецЕсли;
			//-МАН
			СтрокаТабличнойЧастиВставки.ВесГраммыФакт = Результат.ВесГраммыФакт;
			СтрокаТабличнойЧастиВставки.ОписаниеРазмера = Результат.ОписаниеРазмераФакт;
			СтрокаТабличнойЧастиВставки.ЭтоВесовойФакт = ПроверитьВесовой(СтрокаТабличнойЧастиВставки.ЕдиницаИзмеренияФакт);
			СтрокаТабличнойЧастиВставки.НеОцениватьФакт = Результат.НеОцениватьФакт;
		//+Мельников 15.10.24 Заявка 2464	
		Иначе
			СтрокаТабличнойЧастиВставки.КоличествоФакт = Результат.КоличествоФакт;
			СтрокаТабличнойЧастиВставки.ВидВставкиФакт = Результат.ВидВставкиФакт;
			СтрокаТабличнойЧастиВставки.ЕдиницаИзмеренияФакт = Результат.ЕдиницаИзмеренияФакт;
			СтрокаТабличнойЧастиВставки.ВесГраммыФакт = Результат.ВесГраммыФакт;
			СтрокаТабличнойЧастиВставки.НеОцениватьФакт = Истина;
		КонецЕсли;
		//-Мельников
		
		Если Результат.НоваяСтрокаТЧ Тогда
			СтрокаТабличнойЧастиВставки.ОбъектЗалога = Результат.ОбъектЗалога;
			//+Мельников 17.10.24 Заявка 2464
			Если Результат.Свойство("Комплектующее") Тогда
				СтрокаТабличнойЧастиВставки.Вид = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыКомплектующихИзделия.Комплектующее");
			ИначеЕсли Результат.Свойство("Вставка") Тогда
				СтрокаТабличнойЧастиВставки.Вид = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыКомплектующихИзделия.Вставка");
			КонецЕсли;
			//-Мельников
		КонецЕсли;

		Если СтрокаТабличнойЧастиВставки.НеОцениватьФакт Тогда
			СтрокаТабличнойЧастиВставки.ЦенаФакт = 0;
			СтрокаТабличнойЧастиВставки.СуммаФакт = 0;
			ЦенаДрагоценногоМеталла(СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор(), ДопПараметры.Основная, ДопПараметры);
		Иначе	
			ЦенаДрагоценногоКамня(СтрокаТабличнойЧастиВставки.ПолучитьИдентификатор(), СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор(), ДопПараметры);
			ЦенаДрагоценногоМеталла(СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор(), ДопПараметры.Основная, ДопПараметры);
			
			//Если СтрокаТабличнойЧастиВставки.ЭтоВесовойФакт Тогда
			//	СтрокаТабличнойЧастиВставки.СуммаФакт = окр(СтрокаТабличнойЧастиВставки.ЦенаФакт * СтрокаТабличнойЧастиВставки.ВесФакт, 2);
			//Иначе
			//	СтрокаТабличнойЧастиВставки.СуммаФакт = окр(СтрокаТабличнойЧастиВставки.ЦенаФакт * СтрокаТабличнойЧастиВставки.КоличествоФакт, 2);
			//КонецЕсли;
		КонецЕсли;
		
		СформироватьСтрокуОтклонения(ДопПараметры);
		Модифицированность = Истина;

	КонецЕсли;

	//ПроверкаОценкиВставки(СтрокаТабличнойЧасти.ПолучитьИдентификатор(), СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор());

	Отбор = Новый Структура;
	Отбор.Вставить("ОбъектЗалога",СтрокаТабличнойЧастиТовары.ОбъектЗалога);

	Элементы[ДопПараметры.ВставкаК].ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);

	НайтиВставки(СформироватьСтруктуруТабличныхЧастей(ДопПараметры.Основная));
	
КонецПроцедуры 

&НаСервере
Функция ПроверитьВесовой(ЕдиницаИзмерения) 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЕдиницаИзмерения", ЕдиницаИзмерения); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ЕдиницыРасчетаДрагоценныхКамней.ЭтоВес КАК ЭтоВес
	               |ИЗ
	               |	РегистрСведений.ЛБ_ЕдиницыРасчетаДрагоценныхКамней КАК ЛБ_ЕдиницыРасчетаДрагоценныхКамней
	               |ГДЕ
	               |	ЛБ_ЕдиницыРасчетаДрагоценныхКамней.ЕдиницаИзмерения = &ЕдиницаИзмерения";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЭтоВес;
	КонецЕсли;
	Возврат ложь;
КонецФункции

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
    //Адрес = ПоместитьТоварыИзКорзиныВоВременноеХранилище();
    //ОповеститьОВыборе(Адрес);
КонецПроцедуры

&НаСервере
Функция ПоместитьТоварыИзКорзиныВоВременноеХранилище()
    //Возврат ПоместитьВоВременноеХранилище(Корзина.Выгрузить());
КонецФункции

&НаКлиенте 
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда) 
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект); 
КонецПроцедуры 

&НаКлиенте
Процедура ВставкиФактВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//+Мельников 21.05.24 Закомментировал сторое. Вызывается процедура команды.
	//СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	//СтрокаТабличнойЧасти       = Элементы.ВставкиФакт.ТекущиеДанные;  
	//ПараметрыФормы = новый структура;
	//ПараметрыФормы.Вставить("КатегорияОбъектаЗалога", СтрокаТабличнойЧастиТовары.Категория); 
	//ПараметрыФормы.Вставить("Именник", СтрокаТабличнойЧастиТовары.Именник);
	//ПараметрыФормы.Вставить("Количество", СтрокаТабличнойЧасти.Количество); 
	//ПараметрыФормы.Вставить("ВидВставки", СтрокаТабличнойЧасти.ВидВставки); 
	//ПараметрыФормы.Вставить("ФормаОгранки", СтрокаТабличнойЧасти.ФормаОгранки);
	//ПараметрыФормы.Вставить("ВидОгранки", СтрокаТабличнойЧасти.ВидОгранки);
	//ПараметрыФормы.Вставить("КачествоОгранки", СтрокаТабличнойЧасти.КачествоОгранки); 
	//ПараметрыФормы.Вставить("Диаметр", СтрокаТабличнойЧасти.Диаметр);
	//ПараметрыФормы.Вставить("Диаметр1", СтрокаТабличнойЧасти.Диаметр1);
	//ПараметрыФормы.Вставить("Диаметр2", СтрокаТабличнойЧасти.Диаметр2); 
	//ПараметрыФормы.Вставить("Длина", СтрокаТабличнойЧасти.Длина);  
	//ПараметрыФормы.Вставить("Ширина", СтрокаТабличнойЧасти.Ширина);
	//ПараметрыФормы.Вставить("Высота", СтрокаТабличнойЧасти.Высота);
	//ПараметрыФормы.Вставить("ВесКар", СтрокаТабличнойЧасти.Вес);
	//ПараметрыФормы.Вставить("Весграммы", СтрокаТабличнойЧасти.ВесГраммы);
	//
	//ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораВставки",ЭтаФорма);
	//ОткрытьФорму("Документ.ЛБ_Инвентаризация.Форма.КорректировкаВставки", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	Если ТекущийЭлемент.Имя = "Товары" ИЛИ ТекущийЭлемент.Имя = "ВставкиФакт" ИЛИ ТекущийЭлемент.Имя = "ВставкиМеталла" Тогда
		ОткрытьФормуОтклоненияВставки(СформироватьСтруктуруТабличныхЧастей("Товары"));
	ИначеЕсли ТекущийЭлемент.Имя = "НовыеОЗ" ИЛИ ТекущийЭлемент.Имя = "ВставкиКамнейНовыеОЗ" ИЛИ ТекущийЭлемент.Имя = "ВставкиМеталлаНовыеОЗ" Тогда
		ОткрытьФормуОтклоненияВставки(СформироватьСтруктуруТабличныхЧастей("НовыеОЗ"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВставкиФактПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	
	Отказ = (СтрокаТабличнойЧастиТовары = Неопределено) ИЛИ Копирование; 
	
	Если НЕ Отказ тогда   
		ВидВст = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыКомплектующихИзделия.Вставка");
		Если НЕ ВвестиЗначение(ВидВст, "Выберите вид вставки", Тип("ПеречислениеСсылка.ЛБ_ВидыКомплектующихИзделия")) Тогда
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВставкиФактПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	    СтрокаТабличнойЧасти       = Элементы.ВставкиФакт.ТекущиеДанные;
	
	    //ЗаполнитьКлючСтрокиВставки(СтрокаТабличнойЧасти,СтрокаТабличнойЧастиТовары);
        СтрокаТабличнойЧасти.Количество = 1;
		//СтрокаТабличнойЧасти.Вид = ВидВст; 
		
		//Если ВидВст = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыКомплектующихИзделия.Вставка") Тогда  
			ПараметрыФормы = новый структура;
			ПараметрыФормы.Вставить("КатегорияОбъектаЗалога", СтрокаТабличнойЧастиТовары.КатегорияФакт); 
			ПараметрыФормы.Вставить("Клеймо", СтрокаТабличнойЧастиТовары.КлеймоФакт);
			ПараметрыФормы.Вставить("Количество", СтрокаТабличнойЧасти.Количество); 
			ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораВставки",ЭтаФорма);
	        ОткрытьФорму("Документ.ЛБ_Инвентаризация.Форма.КорректировкаВставки", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	     //КонецЕсли;	
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьКлючСтрокиВставки(СтрокаТабличнойЧасти,СтрокаТабличнойЧастиТовары)
	
	Если СтрокаТабличнойЧастиТовары <> Неопределено И СтрокаТабличнойЧасти <> Неопределено Тогда 				
	    СтрокаТабличнойЧасти.КлючСтроки = СтрокаТабличнойЧастиТовары.КлючСтроки;  		
	КонецЕсли; 	

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	
	//+Мельников 05.06.24 Закомментировал и вынес в отдельную процедуру
	
	//СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	//
	////СвернутьРазвернутьПанелиВставкиДопМеталлы(СтрокаТабличнойЧастиТовары);
	//	
	//Если СтрокаТабличнойЧастиТовары <> неопределено Тогда		
	//	Отбор = Новый Структура;
	//	Отбор.Вставить("ОбъектЗалога",СтрокаТабличнойЧастиТовары.ОбъектЗалога);
	//	//+Мельников 20.05.24 Отбор вставок металла
	//	//Элементы.ВставкиФакт.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор); //Закомментировал				

	//	ЕстьВставка = Объект.ВставкиФакт.НайтиСтроки(Отбор).Количество() > 0;
	//	ЕстьВставкаМеталла = Объект.ВставкиМеталла.НайтиСтроки(Отбор).Количество() > 0;

	//	Если ЕстьВставка Тогда
	//		Элементы.ВставкиФакт.Видимость = Истина;
	//		Элементы.ВставкиФакт.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор); //!!!Если не закомментировано то не отображает новую строку, если не использовать стандартную команду.!!!
	//	Иначе
	//		Элементы.ВставкиФакт.Видимость = Ложь;
	//	КонецЕсли;
	//				
	//	Если ЕстьВставкаМеталла Тогда
	//		Элементы.ВставкиМеталла.Видимость = Истина;
	//		Элементы.ВставкиМеталла.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор); //!!!Если не закомментировано то не отображает новую строку. Даже если использовать стандартную команду!!!
	//	Иначе
	//		Элементы.ВставкиМеталла.Видимость = Ложь;
	//	КонецЕсли;
	//	//-Мельников
	//Иначе 	
	//	Отбор = Новый Структура;
	//	Отбор.Вставить("ОбъектЗалога",Неопределено);
	//	Элементы.ВставкиФакт.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);		
	//	//+Мельников 20.05.24 Отбор вставок металла
	//	Элементы.ВставкиМеталла.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
	//	
	//	Элементы.ВставкиФакт.Видимость = Элементы.ВставкиФакт.ТекущиеДанные <> Неопределено;
	//	Элементы.ВставкиМеталла.Видимость = Элементы.ВставкиМеталла.ТекущиеДанные <> Неопределено;
	//	//-Мельников
	//КонецЕсли;
	
	//-Мельников
	
	НайтиВставки(СформироватьСтруктуруТабличныхЧастей("Товары"));
	//+Мельников 17.10.24 Заявка 2464
	УстановитьВидимость();
	//-Мельников
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиВставки(ТЧ)
	СтрокаТабличнойЧастиТовары = Элементы[ТЧ.Основная].ТекущиеДанные;
	
	ЭлементВставкиК = Элементы[ТЧ.ВставкаК]; 
	ЭлементВставкиМ = Элементы[ТЧ.ВставкаМ];
	
	Если СтрокаТабличнойЧастиТовары <> неопределено Тогда		
		Отбор = Новый Структура;
		Отбор.Вставить("ОбъектЗалога",СтрокаТабличнойЧастиТовары.ОбъектЗалога);

		ЕстьВставка = Объект[ТЧ.ВставкаК].НайтиСтроки(Отбор).Количество() > 0;
		ЕстьВставкаМеталла = Объект[ТЧ.ВставкаМ].НайтиСтроки(Отбор).Количество() > 0;

		Если ЕстьВставка Тогда
			ЭлементВставкиК.Видимость = Истина;
			ЭлементВставкиК.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
		Иначе
			ЭлементВставкиК.Видимость = Ложь;
		КонецЕсли;
					
		Если ЕстьВставкаМеталла Тогда
			ЭлементВставкиМ.Видимость = Истина;
			ЭлементВставкиМ.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
		Иначе
			ЭлементВставкиМ.Видимость = Ложь;
		КонецЕсли;
	Иначе 	
		Отбор = Новый Структура;
		Отбор.Вставить("ОбъектЗалога",Неопределено);
		
		ЭлементВставкиК.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);		
		ЭлементВставкиМ.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
		
		ЭлементВставкиК.Видимость = ЭлементВставкиК.ТекущиеДанные <> Неопределено;
		ЭлементВставкиМ.Видимость = ЭлементВставкиМ.ТекущиеДанные <> Неопределено;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыИменникФактПриИзменении(Элемент)
	//СформироватьСтрокуОтклонения();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКлеймоФактПриИзменении(Элемент)
	//СформироватьСтрокуОтклонения();
КонецПроцедуры

&НаКлиенте
Процедура ВидИнвентаризацииПриИзменении(Элемент)
	//+Мельников 27.04.24
	Если ТекЗначение <> Строка(НовЗначение) Тогда
		Если Объект.Товары.Количество() > 0 Тогда
			
			Оповещение = Новый ОписаниеОповещения("ОчиститьТЧТовары", ЭтотОбъект);
			ПоказатьВопрос(Оповещение, "Список объектов залога не пуст.
			|При продолжении список будет очищен!
			|Продолжить?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
		КонецЕсли;
	Иначе
		Если НовЗначение = ПредопределенноеЗначение("Перечисление.ЛБ_ВидИнвентаризации.Полная") Тогда
			Объект.ВидИнвентаризации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидИнвентаризации.Полная");
		Иначе
			Объект.ВидИнвентаризации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидИнвентаризации.Выборочная");
		КонецЕсли;
	КонецЕсли;

	Если Объект.ВидИнвентаризации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидИнвентаризации.Выборочная") Тогда
		ЗаполнитьСписокВыбораКамней();
		ЗаполнитьСписокВыбораЗалогодателей();
	КонецЕсли;

	УстановитьВидимость();
	//-Мельников
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	Если Объект.ВидИнвентаризации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидИнвентаризации.Полная") Тогда
		Отказ = Истина;
	Иначе
		УдалитьВставкиПоОЗ(Элемент.ТекущиеДанные.ОбъектЗалога, СформироватьСтруктуруТабличныхЧастей("Товары"));
		ОбщееКоличествоОЗВДокументе();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоФактПриИзменении(Элемент)
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	//ЦенаДрагоценногоМеталла(СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор());

КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать 
// СтандартныеПодсистемы.ПодключаемыеКоманды 

#КонецОбласти

&НаКлиенте
Процедура ОчиститьТЧТовары(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.Товары.Очистить();
		Объект.ВставкиФакт.Очистить();
		Объект.ВставкиМеталла.Очистить();
		Объект.НовыеОЗ.Очистить();
		Объект.ВставкиКамнейНовыеОЗ.Очистить();
		Объект.ВставкиМеталлаНовыеОЗ.Очистить();
		Объект.НаОХ.Очистить();
		Объект.ВставкиКамнейНаОХ.Очистить();
		Объект.ВставкиМеталлаНаОХ.Очистить();
		Объект.Изъятые.Очистить();
		Объект.ВставкиКамнейИзъятые.Очистить();
		Объект.ВставкиМеталлаИзъятые.Очистить();
		Объект.СумкаЗакрыта.Очистить();
		Объект.ВставкиКамнейСумкаЗакрыта.Очистить();
		Объект.ВставкиМеталлаСумкаЗакрыта.Очистить();
	Иначе
		Если НовЗначение = ПредопределенноеЗначение("Перечисление.ЛБ_ВидИнвентаризации.Полная") Тогда
			Объект.ВидИнвентаризации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидИнвентаризации.Выборочная");
		Иначе
			Объект.ВидИнвентаризации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидИнвентаризации.Полная");
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
КонецПроцедуры

//+Мельников 27.04.24
&НаКлиенте
Процедура УстановитьВидимость(ТекСклад = Неопределено)

	СкладВитринаНеЦО = ?(ТекСклад = Неопределено, СтрНайти(Объект.Склад, "Витрина") > 0, СтрНайти(ТекСклад, "Витрина") > 0) И Объект.Ломбард <> ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис");

	СкладВитрина = ?(ТекСклад = Неопределено, СтрНайти(Объект.Склад, "Витрина") > 0, СтрНайти(ТекСклад, "Витрина") > 0);
	
	Если ЗначениеЗаполнено(Объект.ВидИнвентаризации) И ЗначениеЗаполнено(Объект.ТипИнвентаризации) Тогда
		
		Элементы.ГруппаПроведениеИнвентаризации.Видимость = ?(Объект.ВидИнвентаризации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидИнвентаризации.Полная"), Ложь, Истина);
		Элементы.ГруппаТовары.Видимость = Истина;
		//Элементы.ДокументОснование.Видимость = Истина;
		Элементы.ДокументОснованиеВид.Видимость = Истина;
		Элементы.НомерПриказа.Видимость = Истина;
		Элементы.ДатаПриказа.Видимость = Истина;
		Элементы.Инициатор.Видимость = Истина;
		//+МАН 17.10.24 Заявка 2464
		Элементы.ГруппаНовыеОЗ.Видимость = Истина;
		//+МАН 25.11.24
		Если СкладВитринаНеЦО Тогда
			Элементы.ГруппаНаОХ.Видимость = Ложь;
			Элементы.ГруппаИзъятые.Видимость = Ложь;
			Элементы.ГруппаСумкаЗакрыта.Видимость = Ложь;
		Иначе
			Элементы.ГруппаНаОХ.Видимость = Истина;
			Элементы.ГруппаИзъятые.Видимость = Истина;
			Элементы.ГруппаСумкаЗакрыта.Видимость = Истина;
		КонецЕсли;
		//-МАН
		Если Объект.ВидИнвентаризации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидИнвентаризации.Выборочная") Тогда
			Элементы.ТоварыДобавитьОЗ.Видимость = Истина;
		Иначе
			Элементы.ТоварыДобавитьОЗ.Видимость = Ложь;
		КонецЕсли;
		
	Иначе 
		Элементы.ГруппаПроведениеИнвентаризации.Видимость = Ложь;
		Элементы.ГруппаТовары.Видимость = Ложь;
		//Элементы.ДокументОснование.Видимость = Ложь;
		Элементы.ДокументОснованиеВид.Видимость = Ложь;
		Элементы.НомерПриказа.Видимость = Ложь;
		Элементы.ДатаПриказа.Видимость = Ложь;
		Элементы.Инициатор.Видимость = Ложь;
		//+МАН 17.10.24 Заявка 2464
		Элементы.ГруппаНовыеОЗ.Видимость = Ложь;
		//+МАН 25.11.24
		Элементы.ГруппаНаОХ.Видимость = Ложь;
		Элементы.ГруппаИзъятые.Видимость = Ложь;
		Элементы.ГруппаСумкаЗакрыта.Видимость = Ложь;
		//-МАН
	КонецЕсли;

	Если Объект.Проведен Тогда
		НеРедактировать = Истина;
		Элементы.ДекорацияСтатусДокумента.Заголовок = "Факт"; 
		Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноБордовый;  
		Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.ТусклоРозовый;
		ЭтотОбъект.ТолькоПросмотр = НеРедактировать;
	Иначе
		НеРедактировать = Ложь;
		Элементы.ДекорацияСтатусДокумента.Заголовок = "Проект"; 
		Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноЗеленый;
		Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.СветлоЗеленый;
		ЭтотОбъект.ТолькоПросмотр = НеРедактировать;
	КонецЕсли;

	//ЛомбардСсылка = ПолучитьСсылкуЛомбарда();
	ЭтоЛомбард = ПользовательЛомбард();
	
	//Если ЗначениеЗаполнено(ЛомбардСсылка) Тогда
	Если ЭтоЛомбард Тогда
		Элементы.Ломбард.ТолькоПросмотр = Истина;
	Иначе
		Элементы.Ломбард.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
	Если Объект.ФильтрСтатусы.Количество() > 0 Тогда
		Элементы.ФильтрСтатусыОчиститьСтатусыЗБ.Доступность = Истина;
	Иначе 
		Элементы.ФильтрСтатусыОчиститьСтатусыЗБ.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.ФильтрПробы.Количество() > 0 Тогда
		Элементы.ФильтрПробыОчиститьПробы.Доступность = Истина;
	Иначе 
		Элементы.ФильтрПробыОчиститьПробы.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.ФильтрКатегории.Количество() > 0 Тогда
		Элементы.ФильтрКатегорииОчиститьКатегории.Доступность = Истина;
	Иначе 
		Элементы.ФильтрКатегорииОчиститьКатегории.Доступность = Ложь;
	КонецЕсли;

	Если Объект.ФильтрВидыИзделий.Количество() > 0 Тогда
		Элементы.ФильтрВидыИзделийОчиститьВидыИзделия.Доступность = Истина;
	Иначе 
		Элементы.ФильтрВидыИзделийОчиститьВидыИзделия.Доступность = Ложь;
	КонецЕсли;

	Если Объект.ФильтрСтатусыЗалогодателя.Количество() > 0 Тогда
		Элементы.ФильтрСтатусыЗалогодателяОчиститьСтатусыЗалогодателя.Доступность = Истина;
	Иначе 
		Элементы.ФильтрСтатусыЗалогодателяОчиститьСтатусыЗалогодателя.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.ФильтрЗалогодатели.Количество() > 0 Тогда
		Элементы.ФильтрЗалогодателиОчиститьЗалогодателей.Доступность = Истина;
	Иначе 
		Элементы.ФильтрЗалогодателиОчиститьЗалогодателей.Доступность = Ложь;
	КонецЕсли;

	Если Объект.ФильтрПриемщики.Количество() > 0 Тогда
		Элементы.ФильтрПриемщикиОчиститьПриемщиков.Доступность = Истина;
	Иначе 
		Элементы.ФильтрПриемщикиОчиститьПриемщиков.Доступность = Ложь;
	КонецЕсли;

	Если Объект.ФильтрКамни.Количество() > 0 Тогда
		Элементы.ФильтрКамниОчиститьВставки.Доступность = Истина;
	Иначе 
		Элементы.ФильтрКамниОчиститьВставки.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.ОтборБезВставок Тогда
		Элементы.ФильтрКамни.Доступность = Ложь;
		Элементы.ОтборВставкаМеталл.Доступность = Ложь;
		Элементы.ОтборВставкаКомплектующие.Доступность = Ложь;
	Иначе 
		Элементы.ФильтрКамни.Доступность = Истина;
		Элементы.ОтборВставкаМеталл.Доступность = Истина;
		Элементы.ОтборВставкаКомплектующие.Доступность = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ОтборДатаЗаймаОт) ИЛИ ЗначениеЗаполнено(Объект.ОтборДатаЗаймаДо) Тогда
		Элементы.ОчиститьДатыЗайма.Доступность = Истина;
	Иначе
		Элементы.ОчиститьДатыЗайма.Доступность = Ложь;
	КонецЕсли;

	Если Объект.ОтборСуммаОценкиОт <> 0 ИЛИ Объект.ОтборСуммаОценкиДо <> 0 Тогда
		Элементы.ОчиститьСуммыОценки.Доступность = Истина;
	Иначе
		Элементы.ОчиститьСуммыОценки.Доступность = Ложь;
	КонецЕсли;

	Если Объект.ОтборОбщаяМассаОт <> 0 ИЛИ Объект.ОтборОбщаяМассаДо <> 0 Тогда
		Элементы.ОчиститьОбщиеМассы.Доступность = Истина;
	Иначе
		Элементы.ОчиститьОбщиеМассы.Доступность = Ложь;
	КонецЕсли;

	Если Объект.ОтборМассаМеталлаОт <> 0 ИЛИ Объект.ОтборМассаМеталлаДо <> 0 Тогда
		Элементы.ОчиститьМассыМеталла.Доступность = Истина;
	Иначе
		Элементы.ОчиститьМассыМеталла.Доступность = Ложь;
	КонецЕсли;

	//+Мельников 17.10.24 Заявка 2464
	Если Объект.Товары.Количество() = 0 Тогда
		Элементы.ВставкиФактДобавитьВставку.Доступность = Ложь;
		Элементы.ВставкиМеталлаДобавитьВставкуМеталла.Доступность = Ложь;
		Элементы.ТоварыОтклоненияОЗ.Доступность = Ложь;
		Элементы.ТоварыОчиститьТЧОЗ.Доступность = Ложь;
	Иначе
		Элементы.ВставкиФактДобавитьВставку.Доступность = Истина;
		Элементы.ВставкиМеталлаДобавитьВставкуМеталла.Доступность = Истина;
		Элементы.ТоварыОтклоненияОЗ.Доступность = Истина;
		Элементы.ТоварыОчиститьТЧОЗ.Доступность = Истина;
	КонецЕсли;
	
	Если Объект.НовыеОЗ.Количество() = 0 Тогда
		Элементы.ВставкиКамнейНовыеОЗДобавитьВставку.Доступность = Ложь;
		Элементы.ВставкиМеталлаНовыеОЗДобавитьВставкуМеталла.Доступность = Ложь;
		Элементы.ТоварыОтклоненияОЗНовыеОЗ.Доступность = Ложь;
	Иначе
		Элементы.ВставкиКамнейНовыеОЗДобавитьВставку.Доступность = Истина;
		Элементы.ВставкиМеталлаНовыеОЗДобавитьВставкуМеталла.Доступность = Истина;
		Элементы.ТоварыОтклоненияОЗНовыеОЗ.Доступность = Истина;
	КонецЕсли;
	//-Мельников

	Если СкладВитрина Тогда
		Если Объект.ТипИнвентаризации = ПредопределенноеЗначение("Перечисление.ЛБ_ТипИнвентаризации.Инвентаризация") Тогда
			Элементы.ФормаПечатьИНВ8.Видимость = Истина;
			Элементы.ФормаПечатьИНВ8Черновик.Видимость = Истина;
			Элементы.ФормаПечатьИНВ8Пустой.Видимость = Истина;
			Элементы.ФормаПечатьИНВ5.Видимость = Ложь;
			Элементы.ФормаПечатьИНВ5Пустой.Видимость = Ложь;
			Элементы.ФормаПечатьИНВ19Полная.Видимость = Истина;
			Элементы.ФормаПечатьИНВ19Новые.Видимость = Истина;
			Элементы.ФормаПечатьИНВ19Недостача.Видимость = Истина;
			Элементы.ФормаПечатьАктПроверкиДокументов.Видимость = Ложь;
			Элементы.ФормаПечатьОписьПосылок.Видимость = Ложь;
			Элементы.ФормаПечатьОписьПоступивших.Видимость = Истина;
			Элементы.ФормаПечатьОписьВыбывших.Видимость = Истина;
			Элементы.ФормаПечатьАктПроверкиОЗ.Видимость = Ложь;
		КонецЕсли;
	Иначе
		Если Объект.ТипИнвентаризации = ПредопределенноеЗначение("Перечисление.ЛБ_ТипИнвентаризации.КонтрольнаяПроверка") Тогда
			Элементы.ФормаПечатьИНВ8.Видимость = Ложь;
			Элементы.ФормаПечатьИНВ8Черновик.Видимость = Ложь;
			Элементы.ФормаПечатьИНВ8Пустой.Видимость = Ложь;
			Элементы.ФормаПечатьИНВ5.Видимость = Ложь;
			Элементы.ФормаПечатьИНВ5Пустой.Видимость = Ложь;
			Элементы.ФормаПечатьИНВ19Полная.Видимость = Ложь;
			Элементы.ФормаПечатьИНВ19Новые.Видимость = Ложь;
			Элементы.ФормаПечатьИНВ19Недостача.Видимость = Ложь;
			Элементы.ФормаПечатьАктПроверкиДокументов.Видимость = Ложь;
			Элементы.ФормаПечатьОписьПосылок.Видимость = Ложь;
			Элементы.ФормаПечатьОписьПоступивших.Видимость = Ложь;
			Элементы.ФормаПечатьОписьВыбывших.Видимость = Ложь;
			Элементы.ФормаПечатьАктПроверкиОЗ.Видимость = Истина;
		ИначеЕсли Объект.ТипИнвентаризации = ПредопределенноеЗначение("Перечисление.ЛБ_ТипИнвентаризации.Инвентаризация") Тогда
			Элементы.ФормаПечатьИНВ8.Видимость = Истина;
			Элементы.ФормаПечатьИНВ8Черновик.Видимость = Истина;
			Элементы.ФормаПечатьИНВ8Пустой.Видимость = Истина;
			Элементы.ФормаПечатьИНВ5.Видимость = Истина;
			Элементы.ФормаПечатьИНВ5Пустой.Видимость = Истина;
			Элементы.ФормаПечатьИНВ19Полная.Видимость = Истина;
			Элементы.ФормаПечатьИНВ19Новые.Видимость = Истина;
			Элементы.ФормаПечатьИНВ19Недостача.Видимость = Истина;
			Элементы.ФормаПечатьАктПроверкиДокументов.Видимость = Истина;
			Элементы.ФормаПечатьОписьПосылок.Видимость = Истина;
			Элементы.ФормаПечатьОписьПоступивших.Видимость = Истина;
			Элементы.ФормаПечатьОписьВыбывших.Видимость = Истина;
			Элементы.ФормаПечатьАктПроверкиОЗ.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Склад) Тогда
		Элементы.ГруппаКомиссия.Доступность = Истина;
	Иначе
		Элементы.ГруппаКомиссия.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСсылкуЛомбарда()
	Возврат ЛБ_ОбщийМодуль.ПолучитьСсылкуЛомбарда();
КонецФункции	

&НаСервереБезКонтекста
Функция ПользовательЛомбард()
	Возврат ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард;
КонецФункции	

&НаКлиенте
Процедура ТипИнвентаризацииПриИзменении(Элемент)
	
	//Объект.ДокументОснование = "";
	//
	//Если Объект.ТипИнвентаризации = ПредопределенноеЗначение("Перечисление.ЛБ_ТипИнвентаризации.Инвентаризация") Тогда
	//	
	//	Объект.ДокументОснование = "Приказ №  от";
	//	
	//ИначеЕсли Объект.ТипИнвентаризации = ПредопределенноеЗначение("Перечисление.ЛБ_ТипИнвентаризации.КонтрольнаяПроверка") Тогда
	//	
	//	Список = Новый Массив;
	//	Список.Добавить("Приказ №  от");
	//	Список.Добавить("Распоряжение №  от");
	//	
	//	Элементы.ДокументОснование.СписокВыбора.ЗагрузитьЗначения(Список);
	//	
	//КонецЕсли;

	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипИнвентаризацииОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	Если Элемент.ТекстРедактирования <> Строка(ВыбранноеЗначение) Тогда
		Объект.ДокументОснованиеВид = ПредопределенноеЗначение("Перечисление.ЛБ_ОснованиеИнвентаризации.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьВидимость();
	
	//++ИВВ 02.2026, вычеты для часов
	ОбновитьПредставлениеВидВставки();
    //--ИВВ
КонецПроцедуры

&НаКлиенте
Процедура ЛомбардНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Если Объект.Товары.Количество() > 0 ИЛИ Объект.МОЛы.Количество() > 0 ИЛИ Объект.ИнвентаризационнаяКомиссия.Количество() > 0 Тогда
		
		Ответ = Вопрос("При изменении ломбарда очистятся все списки с объектами залога, список МОЛ и список членов комиссии.
					   |Изменить ломбард?", РежимДиалогаВопрос.ДаНет);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.Товары.Очистить();
			Объект.ВставкиФакт.Очистить();
			Объект.ВставкиМеталла.Очистить();
			Объект.НовыеОЗ.Очистить();
			Объект.ВставкиКамнейНовыеОЗ.Очистить();
			Объект.ВставкиМеталлаНовыеОЗ.Очистить();
			Объект.НаОХ.Очистить();
			Объект.ВставкиКамнейНаОХ.Очистить();
			Объект.ВставкиМеталлаНаОХ.Очистить();
			Объект.Изъятые.Очистить();
			Объект.ВставкиКамнейИзъятые.Очистить();
			Объект.ВставкиМеталлаИзъятые.Очистить();
			Объект.СумкаЗакрыта.Очистить();
			Объект.ВставкиКамнейСумкаЗакрыта.Очистить();
			Объект.ВставкиМеталлаСумкаЗакрыта.Очистить();
			Объект.МОЛы.Очистить();
			Объект.ИнвентаризационнаяКомиссия.Очистить();
			ЗаполнитьТЧ();
			ДобавитьМОЛ();
		Иначе
            СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСтатусыЗБ(Команда)
	Объект.ФильтрСтатусы.Очистить();
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрСтатусыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Объект.ФильтрСтатусы.Количество() > 0 Тогда
		УдалитьПустуюСтрокуФильтра("ФильтрСтатусы", "ЛБ_СтатусыОбъектовЗалога", "Статус", "Перечисление");
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрСтатусыПослеУдаления(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПробы(Команда)
	Объект.ФильтрПробы.Очистить();
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПробыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

	Если Объект.ФильтрПробы.Количество() > 0 Тогда
		УдалитьПустуюСтрокуФильтра("ФильтрПробы", "ЛБ_Пробы", "Проба", "Справочник");
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПробыПослеУдаления(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКатегории(Команда)
	Объект.ФильтрКатегории.Очистить();
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрКатегорииПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

	Если Объект.ФильтрКатегории.Количество() > 0 Тогда
		УдалитьПустуюСтрокуФильтра("ФильтрКатегории", "ЛБ_КатегорииОбъектовЗалога", "Категория", "Справочник");
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрКатегорииПослеУдаления(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьВидыИзделия(Команда)
	Объект.ФильтрВидыИзделий.Очистить();
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрВидыИзделийПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

	Если Объект.ФильтрВидыИзделий.Количество() > 0 Тогда
		УдалитьПустуюСтрокуФильтра("ФильтрВидыИзделий", "ЛБ_ВидыИзделий", "ВидИзделия", "Справочник");
	КонецЕсли;

	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрВидыИзделийПослеУдаления(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСтатусыЗалогодателя(Команда)
	Объект.ФильтрСтатусыЗалогодателя.Очистить();
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрСтатусыЗалогодателяПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

	Если Объект.ФильтрСтатусыЗалогодателя.Количество() > 0 Тогда
		УдалитьПустуюСтрокуФильтра("ФильтрСтатусыЗалогодателя", "ЛБ_СтатусыЗалогодателей", "Статус", "Справочник");
	КонецЕсли;
	
	УстановитьВидимость();

КонецПроцедуры

&НаКлиенте
Процедура ФильтрСтатусыЗалогодателяПослеУдаления(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЗалогодателей(Команда)
	Объект.ФильтрЗалогодатели.Очистить();
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрЗалогодателиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

	Если Объект.ФильтрЗалогодатели.Количество() > 0 Тогда
		УдалитьПустуюСтрокуФильтра("ФильтрЗалогодатели", "ЛБ_Залогодатели", "Залогодатель", "Справочник");
	КонецЕсли;
	
	УстановитьВидимость();

КонецПроцедуры

&НаКлиенте
Процедура ФильтрЗалогодателиПослеУдаления(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПриемщиков(Команда)
	Объект.ФильтрПриемщики.Очистить();
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПриемщикиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

	Если Объект.ФильтрПриемщики.Количество() > 0 Тогда
		УдалитьПустуюСтрокуФильтра("ФильтрПриемщики", "Пользователи", "Приемщик", "Справочник");
	КонецЕсли;
	
	УстановитьВидимость();

КонецПроцедуры

&НаКлиенте
Процедура ФильтрПриемщикиПослеУдаления(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОбщиеМассы(Команда)
	Объект.ОтборОбщаяМассаОт = 0;
	Объект.ОтборОбщаяМассаДо = 0;
	Элементы.ОчиститьОбщиеМассы.Доступность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОтборОбщаяМассаОтОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Если Элемент.Имя = "ОтборОбщаяМассаОт" Тогда
		Если Текст <> "0,00" ИЛИ Объект.ОтборОбщаяМассаДо <> 0 Тогда
			Элементы.ОчиститьОбщиеМассы.Доступность = Истина;
		Иначе 
			Элементы.ОчиститьОбщиеМассы.Доступность = Ложь;
		КонецЕсли;
	ИначеЕсли Элемент.Имя = "ОтборОбщаяМассаДо" Тогда
		Если Текст <> "0,00" ИЛИ Объект.ОтборОбщаяМассаОт <> 0 Тогда
			Элементы.ОчиститьОбщиеМассы.Доступность = Истина;
		Иначе 
			Элементы.ОчиститьОбщиеМассы.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьМассыМеталла(Команда)
	Объект.ОтборМассаМеталлаОт = 0;
	Объект.ОтборМассаМеталлаДо = 0;
	Элементы.ОчиститьМассыМеталла.Доступность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОтборМассаМеталлаОтОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Если Элемент.Имя = "ОтборМассаМеталлаОт" Тогда
		Если Текст <> "0,00" ИЛИ Объект.ОтборМассаМеталлаДо <> 0 Тогда
			Элементы.ОчиститьМассыМеталла.Доступность = Истина;
		Иначе 
			Элементы.ОчиститьМассыМеталла.Доступность = Ложь;
		КонецЕсли;
	ИначеЕсли Элемент.Имя = "ОтборМассаМеталлаДо" Тогда
		Если Текст <> "0,00" ИЛИ Объект.ОтборМассаМеталлаОт <> 0 Тогда
			Элементы.ОчиститьМассыМеталла.Доступность = Истина;
		Иначе 
			Элементы.ОчиститьМассыМеталла.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСуммыОценки(Команда)
	Объект.ОтборСуммаОценкиОт = 0;
	Объект.ОтборСуммаОценкиДо = 0;
	Элементы.ОчиститьСуммыОценки.Доступность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОтборСуммаОценкиОтОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Если Элемент.Имя = "ОтборСуммаОценкиОт" Тогда
		Если Текст <> "0,00" ИЛИ Объект.ОтборСуммаОценкиДо <> 0 Тогда
			Элементы.ОчиститьСуммыОценки.Доступность = Истина;
		Иначе 
			Элементы.ОчиститьСуммыОценки.Доступность = Ложь;
		КонецЕсли;
	ИначеЕсли Элемент.Имя = "ОтборСуммаОценкиДо" Тогда
		Если Текст <> "0,00" ИЛИ Объект.ОтборСуммаОценкиОт <> 0 Тогда
			Элементы.ОчиститьСуммыОценки.Доступность = Истина;
		Иначе 
			Элементы.ОчиститьСуммыОценки.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДатыЗайма(Команда)
	Объект.ОтборДатаЗаймаОт = Дата(1,1,1);
	Объект.ОтборДатаЗаймаДо = Дата(1,1,1);
	Элементы.ОчиститьДатыЗайма.Доступность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОтборДатаЗаймаОтОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Если Элемент.Имя = "ОтборДатаЗаймаОт" Тогда
		Если Текст <> "  .  .    " ИЛИ Объект.ОтборДатаЗаймаДо <> Дата(1,1,1) Тогда
			Элементы.ОчиститьДатыЗайма.Доступность = Истина;
		Иначе 
			Элементы.ОчиститьДатыЗайма.Доступность = Ложь;
		КонецЕсли;
	ИначеЕсли Элемент.Имя = "ОтборДатаЗаймаДо" Тогда
		Если Текст <> "  .  .    " ИЛИ Объект.ОтборДатаЗаймаОт <> Дата(1,1,1) Тогда
			Элементы.ОчиститьДатыЗайма.Доступность = Истина;
		Иначе 
			Элементы.ОчиститьДатыЗайма.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьВставки(Команда)
	Объект.ФильтрКамни.Очистить();
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрКамниПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

	Если Объект.ФильтрКамни.Количество() > 0 Тогда
		УдалитьПустуюСтрокуФильтра("ФильтрКамни", "ЛБ_ДрагоценныеКамни", "Вставка", "Справочник");
	КонецЕсли;
	
	УстановитьВидимость();

КонецПроцедуры

&НаКлиенте
Процедура ФильтрКамниПослеУдаления(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ОтборБезВставокПриИзменении(Элемент)
	Если Объект.ОтборБезВставок Тогда
		Объект.ОтборВставкаМеталл = Ложь;
		Объект.ОтборВставкаКомплектующие = Ложь;
	КонецЕсли;
	ОчиститьВставки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОтклоненияВставки(Команда)
	
	//+Мельников 05.06.24 Вынес в отдельную процедуру
	
	//СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	//СтрокаТабличнойЧастиВставки = Элементы.ВставкиФакт.ТекущиеДанные;
	//
	//ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("КатегорияОбъектаЗалога", СтрокаТабличнойЧастиТовары.Категория); 
	//ПараметрыФормы.Вставить("Именник", СтрокаТабличнойЧастиТовары.Именник);
	//ПараметрыФормы.Вставить("Количество", СтрокаТабличнойЧастиВставки.Количество); 
	//ПараметрыФормы.Вставить("ВидВставки", СтрокаТабличнойЧастиВставки.ВидВставки); 
	//ПараметрыФормы.Вставить("ФормаОгранки", СтрокаТабличнойЧастиВставки.ФормаОгранки);
	//ПараметрыФормы.Вставить("ВидОгранки", СтрокаТабличнойЧастиВставки.ВидОгранки);
	//ПараметрыФормы.Вставить("КачествоОгранки", СтрокаТабличнойЧастиВставки.КачествоОгранки); 
	//ПараметрыФормы.Вставить("Диаметр", СтрокаТабличнойЧастиВставки.Диаметр);
	//ПараметрыФормы.Вставить("Диаметр1", СтрокаТабличнойЧастиВставки.Диаметр1);
	//ПараметрыФормы.Вставить("Диаметр2", СтрокаТабличнойЧастиВставки.Диаметр2); 
	//ПараметрыФормы.Вставить("Длина", СтрокаТабличнойЧастиВставки.Длина);  
	//ПараметрыФормы.Вставить("Ширина", СтрокаТабличнойЧастиВставки.Ширина);
	//ПараметрыФормы.Вставить("Высота", СтрокаТабличнойЧастиВставки.Высота);
	//ПараметрыФормы.Вставить("ВесКар", СтрокаТабличнойЧастиВставки.Вес);
	//ПараметрыФормы.Вставить("Весграммы", СтрокаТабличнойЧастиВставки.ВесГраммы);
	//ПараметрыФормы.Вставить("НеОценивать", СтрокаТабличнойЧастиВставки.НеОценивать);
	////Фактические
	//ПараметрыФормы.Вставить("КатегорияОбъектаЗалогаФакт", СтрокаТабличнойЧастиТовары.КатегорияФакт); 
	//ПараметрыФормы.Вставить("ИменникФакт", СтрокаТабличнойЧастиТовары.ИменникФакт);
	//ПараметрыФормы.Вставить("КоличествоФакт", СтрокаТабличнойЧастиВставки.КоличествоФакт); 
	//ПараметрыФормы.Вставить("ВидВставкиФакт", СтрокаТабличнойЧастиВставки.ВидВставкиФакт); 
	//ПараметрыФормы.Вставить("ФормаОгранкиФакт", СтрокаТабличнойЧастиВставки.ФормаОгранкиФакт);
	//ПараметрыФормы.Вставить("ВидОгранкиФакт", СтрокаТабличнойЧастиВставки.ВидОгранкиФакт);
	//ПараметрыФормы.Вставить("КачествоОгранкиФакт", СтрокаТабличнойЧастиВставки.КачествоОгранкиФакт); 
	//ПараметрыФормы.Вставить("ДиаметрФакт", СтрокаТабличнойЧастиВставки.ДиаметрФакт);
	//ПараметрыФормы.Вставить("Диаметр1Факт", СтрокаТабличнойЧастиВставки.Диаметр1Факт);
	//ПараметрыФормы.Вставить("Диаметр2Факт", СтрокаТабличнойЧастиВставки.Диаметр2Факт); 
	//ПараметрыФормы.Вставить("ДлинаФакт", СтрокаТабличнойЧастиВставки.ДлинаФакт);  
	//ПараметрыФормы.Вставить("ШиринаФакт", СтрокаТабличнойЧастиВставки.ШиринаФакт);
	//ПараметрыФормы.Вставить("ВысотаФакт", СтрокаТабличнойЧастиВставки.ВысотаФакт);
	//ПараметрыФормы.Вставить("ВесФакт", СтрокаТабличнойЧастиВставки.ВесФакт);
	//ПараметрыФормы.Вставить("ВесграммыФакт", СтрокаТабличнойЧастиВставки.ВесГраммыФакт);
	//ПараметрыФормы.Вставить("ЦенаФакт", СтрокаТабличнойЧастиВставки.ЦенаФакт);
	//ПараметрыФормы.Вставить("НеОцениватьФакт", СтрокаТабличнойЧастиВставки.НеОцениватьФакт);
	//
	//ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораВставки",ЭтаФорма);
	//ОткрытьФорму("Документ.ЛБ_Инвентаризация.Форма.КорректировкаВставки", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	//-Мельников
	
	Если ТекущийЭлемент.Имя = "Товары" ИЛИ ТекущийЭлемент.Имя = "ВставкиФакт" ИЛИ ТекущийЭлемент.Имя = "ВставкиМеталла" Тогда
		ОткрытьФормуОтклоненияВставки(СформироватьСтруктуруТабличныхЧастей("Товары"));
	ИначеЕсли ТекущийЭлемент.Имя = "НовыеОЗ" ИЛИ ТекущийЭлемент.Имя = "ВставкиКамнейНовыеОЗ" ИЛИ ТекущийЭлемент.Имя = "ВставкиМеталлаНовыеОЗ" Тогда
		ОткрытьФормуОтклоненияВставки(СформироватьСтруктуруТабличныхЧастей("НовыеОЗ"));
	ИначеЕсли ТекущийЭлемент.Имя = "НаОХ" ИЛИ ТекущийЭлемент.Имя = "ВставкиКамнейНаОХ" ИЛИ ТекущийЭлемент.Имя = "ВставкиМеталлаНаОХ" Тогда
		ОткрытьФормуОтклоненияВставки(СформироватьСтруктуруТабличныхЧастей("НаОХ"));
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОтклоненияВставки(ТЧ)
	
	СтрокаТабличнойЧастиТовары = Элементы[ТЧ.Основная].ТекущиеДанные;
	СтрокаТабличнойЧастиВставки = Элементы[ТЧ.ВставкаК].ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура;

	//+Мельников 15.10.24 Добавлена проверка вставка или комплектующее Заявка 2464.
	Если СтрокаТабличнойЧастиВставки.Вид = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыКомплектующихИзделия.Вставка") Тогда
		ПараметрыФормы.Вставить("КатегорияОбъектаЗалога", СтрокаТабличнойЧастиТовары.Категория); 
		ПараметрыФормы.Вставить("Именник", СтрокаТабличнойЧастиТовары.Именник);
		ПараметрыФормы.Вставить("Количество", СтрокаТабличнойЧастиВставки.Количество); 
		ПараметрыФормы.Вставить("ВидВставки", СтрокаТабличнойЧастиВставки.ВидВставки); 
		ПараметрыФормы.Вставить("ФормаОгранки", СтрокаТабличнойЧастиВставки.ФормаОгранки);
		ПараметрыФормы.Вставить("ВидОгранки", СтрокаТабличнойЧастиВставки.ВидОгранки);
		ПараметрыФормы.Вставить("КачествоОгранки", СтрокаТабличнойЧастиВставки.КачествоОгранки); 
		ПараметрыФормы.Вставить("Диаметр", СтрокаТабличнойЧастиВставки.Диаметр);
		ПараметрыФормы.Вставить("Диаметр1", СтрокаТабличнойЧастиВставки.Диаметр1);
		ПараметрыФормы.Вставить("Диаметр2", СтрокаТабличнойЧастиВставки.Диаметр2); 
		ПараметрыФормы.Вставить("Длина", СтрокаТабличнойЧастиВставки.Длина);  
		ПараметрыФормы.Вставить("Ширина", СтрокаТабличнойЧастиВставки.Ширина);
		ПараметрыФормы.Вставить("Высота", СтрокаТабличнойЧастиВставки.Высота);
		ПараметрыФормы.Вставить("ВесКар", СтрокаТабличнойЧастиВставки.Вес);
		ПараметрыФормы.Вставить("Весграммы", СтрокаТабличнойЧастиВставки.ВесГраммы);
		ПараметрыФормы.Вставить("НеОценивать", СтрокаТабличнойЧастиВставки.НеОценивать);
		//Фактические
		ПараметрыФормы.Вставить("КатегорияОбъектаЗалогаФакт", СтрокаТабличнойЧастиТовары.КатегорияФакт); 
		ПараметрыФормы.Вставить("ИменникФакт", СтрокаТабличнойЧастиТовары.ИменникФакт);
		ПараметрыФормы.Вставить("КоличествоФакт", СтрокаТабличнойЧастиВставки.КоличествоФакт); 
		ПараметрыФормы.Вставить("ВидВставкиФакт", СтрокаТабличнойЧастиВставки.ВидВставкиФакт); 
		ПараметрыФормы.Вставить("ФормаОгранкиФакт", СтрокаТабличнойЧастиВставки.ФормаОгранкиФакт);
		ПараметрыФормы.Вставить("ВидОгранкиФакт", СтрокаТабличнойЧастиВставки.ВидОгранкиФакт);
		ПараметрыФормы.Вставить("КачествоОгранкиФакт", СтрокаТабличнойЧастиВставки.КачествоОгранкиФакт); 
		ПараметрыФормы.Вставить("ДиаметрФакт", СтрокаТабличнойЧастиВставки.ДиаметрФакт);
		ПараметрыФормы.Вставить("Диаметр1Факт", СтрокаТабличнойЧастиВставки.Диаметр1Факт);
		ПараметрыФормы.Вставить("Диаметр2Факт", СтрокаТабличнойЧастиВставки.Диаметр2Факт); 
		ПараметрыФормы.Вставить("ДлинаФакт", СтрокаТабличнойЧастиВставки.ДлинаФакт);  
		ПараметрыФормы.Вставить("ШиринаФакт", СтрокаТабличнойЧастиВставки.ШиринаФакт);
		ПараметрыФормы.Вставить("ВысотаФакт", СтрокаТабличнойЧастиВставки.ВысотаФакт);
		ПараметрыФормы.Вставить("ВесФакт", СтрокаТабличнойЧастиВставки.ВесФакт);
		ПараметрыФормы.Вставить("ВесграммыФакт", СтрокаТабличнойЧастиВставки.ВесГраммыФакт);
		ПараметрыФормы.Вставить("ЦенаФакт", СтрокаТабличнойЧастиВставки.ЦенаФакт);
		ПараметрыФормы.Вставить("НеОцениватьФакт", СтрокаТабличнойЧастиВставки.НеОцениватьФакт);
		//+Мельников 17.10.24 Заявка 2464
		ПараметрыФормы.Вставить("ТЧ", ТЧ);
		ПараметрыФормы.Вставить("ОбъектЗалога", СтрокаТабличнойЧастиТовары.ОбъектЗалога);
		ПараметрыФормы.Вставить("ОбщаяМассаФакт", СтрокаТабличнойЧастиТовары.ОбщаяМассаФакт);
		ПараметрыФормы.Вставить("ТолькоПросмотр", Объект.Проведен);
		//-Мельников
		
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораВставки", ЭтаФорма, ТЧ);
		ОткрытьФорму("Документ.ЛБ_Инвентаризация.Форма.КорректировкаВставки", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	//+Мельников 15.10.24
	ИначеЕсли СтрокаТабличнойЧастиВставки.Вид = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыКомплектующихИзделия.Комплектующее") Тогда
		ПараметрыФормы.Вставить("ВидВставки", СтрокаТабличнойЧастиВставки.ВидВставки);
		ПараметрыФормы.Вставить("Количество", СтрокаТабличнойЧастиВставки.Количество);
		ПараметрыФормы.Вставить("ВесГраммы", СтрокаТабличнойЧастиВставки.ВесГраммы);
		ПараметрыФормы.Вставить("ВидВставкиФакт", СтрокаТабличнойЧастиВставки.ВидВставкиФакт);
		ПараметрыФормы.Вставить("КоличествоФакт", СтрокаТабличнойЧастиВставки.КоличествоФакт);
		ПараметрыФормы.Вставить("ВесГраммыФакт", СтрокаТабличнойЧастиВставки.ВесГраммыФакт);
		ПараметрыФормы.Вставить("ТЧ", ТЧ);
		ПараметрыФормы.Вставить("ОбъектЗалога", СтрокаТабличнойЧастиТовары.ОбъектЗалога);
		ПараметрыФормы.Вставить("ОбщаяМассаФакт", СтрокаТабличнойЧастиТовары.ОбщаяМассаФакт);
		ПараметрыФормы.Вставить("ТолькоПросмотр", Объект.Проведен);

		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораВставки", ЭтаФорма, ТЧ);
		ОткрытьФорму("Документ.ЛБ_Инвентаризация.Форма.КорректировкаКомплектующего", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	//-Мельников

КонецПроцедуры

&НаКлиенте
Процедура ОтклоненияВставкиМеталла(Команда)
	
	//+Мельников 05.06.24 Вынес в отдельную форму
	
	//СтрокаТабличнойЧастиТовары	= Элементы.Товары.ТекущиеДанные;
	//СтрокаТабличнойЧастиВставки	= Элементы.ВставкиМеталла.ТекущиеДанные;  
	//
	//ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("Проба", СтрокаТабличнойЧастиВставки.Проба); 
	//ПараметрыФормы.Вставить("Вес", СтрокаТабличнойЧастиВставки.Вес);
	//ПараметрыФормы.Вставить("ВесВПробеЧистоты", СтрокаТабличнойЧастиВставки.ВесВПробеЧистоты); 
	//ПараметрыФормы.Вставить("ЕдиницаИзмерения", СтрокаТабличнойЧастиВставки.ЕдиницаИзмерения); 
	//ПараметрыФормы.Вставить("СуммаОценки", СтрокаТабличнойЧастиВставки.СуммаОценки);
	//ПараметрыФормы.Вставить("ОсновнойМеталл", СтрокаТабличнойЧастиТовары.Проба);
	//ПараметрыФормы.Вставить("ОперацияЗайма", СтрокаТабличнойЧастиТовары.ОперацияЗайма);
	//ПараметрыФормы.Вставить("Категория", СтрокаТабличнойЧастиТовары.КатегорияФакт); 
	//ПараметрыФормы.Вставить("ОбъектЗалога", СтрокаТабличнойЧастиТовары.ОбъектЗалога); 
	////Фактические
	//ПараметрыФормы.Вставить("ПробаФакт", СтрокаТабличнойЧастиВставки.ПробаФакт); 
	//ПараметрыФормы.Вставить("ВесФакт", СтрокаТабличнойЧастиВставки.ВесФакт);
	//ПараметрыФормы.Вставить("ВесВПробеЧистотыФакт", СтрокаТабличнойЧастиВставки.ВесВПробеЧистотыФакт); 
	//ПараметрыФормы.Вставить("ЕдиницаИзмеренияФакт", СтрокаТабличнойЧастиВставки.ЕдиницаИзмеренияФакт); 
	//ПараметрыФормы.Вставить("СуммаОценкиФакт", СтрокаТабличнойЧастиВставки.СуммаОценкиФакт); 
	//
	//ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораВставкиМеталла",ЭтаФорма);
	//ОткрытьФорму("Документ.ЛБ_Инвентаризация.Форма.КорректировкаВставкиМеталла", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	//-Мельников
	
	Если ТекущийЭлемент.Имя = "Товары" ИЛИ ТекущийЭлемент.Имя = "ВставкиФакт" ИЛИ ТекущийЭлемент.Имя = "ВставкиМеталла" Тогда
		ОткрытьФормуОтклоненияВставкиМеталла(СформироватьСтруктуруТабличныхЧастей("Товары"));
	ИначеЕсли ТекущийЭлемент.Имя = "НовыеОЗ" ИЛИ ТекущийЭлемент.Имя = "ВставкиКамнейНовыеОЗ" ИЛИ ТекущийЭлемент.Имя = "ВставкиМеталлаНовыеОЗ" Тогда
		ОткрытьФормуОтклоненияВставкиМеталла(СформироватьСтруктуруТабличныхЧастей("НовыеОЗ"));
	ИначеЕсли ТекущийЭлемент.Имя = "НаОХ" ИЛИ ТекущийЭлемент.Имя = "ВставкиКамнейНаОХ" ИЛИ ТекущийЭлемент.Имя = "ВставкиМеталлаНаОХ" Тогда
		ОткрытьФормуОтклоненияВставкиМеталла(СформироватьСтруктуруТабличныхЧастей("НаОХ"));
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОтклоненияВставкиМеталла(ТЧ)
	
	СтрокаТабличнойЧастиТовары	= Элементы[ТЧ.Основная].ТекущиеДанные;
	СтрокаТабличнойЧастиВставки	= Элементы[ТЧ.ВставкаМ].ТекущиеДанные;  
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Проба", СтрокаТабличнойЧастиВставки.Проба); 
	ПараметрыФормы.Вставить("Вес", СтрокаТабличнойЧастиВставки.Вес);
	ПараметрыФормы.Вставить("ВесВПробеЧистоты", СтрокаТабличнойЧастиВставки.ВесВПробеЧистоты); 
	ПараметрыФормы.Вставить("ЕдиницаИзмерения", СтрокаТабличнойЧастиВставки.ЕдиницаИзмерения); 
	ПараметрыФормы.Вставить("СуммаОценки", СтрокаТабличнойЧастиВставки.СуммаОценки);
	ПараметрыФормы.Вставить("ОсновнойМеталл", СтрокаТабличнойЧастиТовары.Проба);
	ПараметрыФормы.Вставить("ОперацияЗайма", СтрокаТабличнойЧастиТовары.ОперацияЗайма);
	ПараметрыФормы.Вставить("Категория", СтрокаТабличнойЧастиТовары.КатегорияФакт); 
	ПараметрыФормы.Вставить("ОбъектЗалога", СтрокаТабличнойЧастиТовары.ОбъектЗалога); 
	ПараметрыФормы.Вставить("ТолькоПросмотр", Объект.Проведен);
	//Фактические
	ПараметрыФормы.Вставить("ПробаФакт", СтрокаТабличнойЧастиВставки.ПробаФакт); 
	ПараметрыФормы.Вставить("ВесФакт", СтрокаТабличнойЧастиВставки.ВесФакт);
	ПараметрыФормы.Вставить("ВесВПробеЧистотыФакт", СтрокаТабличнойЧастиВставки.ВесВПробеЧистотыФакт); 
	ПараметрыФормы.Вставить("ЕдиницаИзмеренияФакт", СтрокаТабличнойЧастиВставки.ЕдиницаИзмеренияФакт); 
	ПараметрыФормы.Вставить("СуммаОценкиФакт", СтрокаТабличнойЧастиВставки.СуммаОценкиФакт); 
	ПараметрыФормы.Вставить("ТЧ", ТЧ);
	ПараметрыФормы.Вставить("ОбщаяМассаФакт", СтрокаТабличнойЧастиТовары.ОбщаяМассаФакт);
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораВставкиМеталла", ЭтаФорма, ТЧ);
	ОткрытьФорму("Документ.ЛБ_Инвентаризация.Форма.КорректировкаВставкиМеталла", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораВставкиМеталла(Результат, ДопПараметры) Экспорт  
	
	СтрокаТабличнойЧастиТовары	= Элементы[ДопПараметры.Основная].ТекущиеДанные;
	СтрокаТабличнойЧастиВставки	= Элементы[ДопПараметры.ВставкаМ].ТекущиеДанные; 

	Если Результат = Неопределено Тогда
		Возврат;
	ИначеЕсли ТипЗнч(Результат) = Тип("Структура") И Результат.НоваяСтрокаТЧ И Результат.Отмена Тогда
		Если Элементы[ДопПараметры.ВставкаМ].ТекущиеДанные <> Неопределено Тогда
			//+МАН 30.05.25 Изменил удаление пустой строки.
			//Объект[ДопПараметры.ВставкаМ].Удалить(Элементы[ДопПараметры.ВставкаМ].ТекущиеДанные.НомерСтроки - 1);
			Объект[ДопПараметры.ВставкаМ].Удалить(Результат.ИДНоваяСтрокаТЧ);
			//-МАН
		КонецЕсли;
	Иначе
		Если Результат.НоваяСтрокаТЧ Тогда
			СтрокаТабличнойЧастиВставки = Объект[ДопПараметры.ВставкаМ].НайтиПоИдентификатору(Результат.ИДНоваяСтрокаТЧ);
		КонецЕсли;
		
		СтрокаТабличнойЧастиВставки.ПробаФакт = Результат.ПробаФакт;
		СтрокаТабличнойЧастиВставки.ВесФакт = Результат.ВесФакт;
		СтрокаТабличнойЧастиВставки.ВесВПробеЧистотыФакт = Результат.ВесВПробеЧистотыФакт;
		СтрокаТабличнойЧастиВставки.СуммаОценкиФакт = Результат.СуммаОценкиФакт;
		СтрокаТабличнойЧастиВставки.ЕдиницаИзмеренияФакт = Результат.ЕдиницаИзмерения;
		СтрокаТабличнойЧастиВставки.ЦенаФакт = Результат.ЦенаФакт;
		
		Если Результат.НоваяСтрокаТЧ Тогда
			СтрокаТабличнойЧастиВставки.ОбъектЗалога = Результат.ОбъектЗалога;
		КонецЕсли;
		
		СформироватьСтрокуОтклонения(ДопПараметры);
		Модифицированность = Истина;
		
	КонецЕсли;

	Отбор = Новый Структура;
	Отбор.Вставить("ОбъектЗалога",СтрокаТабличнойЧастиТовары.ОбъектЗалога);

	Элементы[ДопПараметры.ВставкаМ].ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);

	ЦенаДрагоценногоМеталла(СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор(), ДопПараметры.Основная, ДопПараметры);
	НайтиВставки(СформироватьСтруктуруТабличныхЧастей(ДопПараметры.Основная));

КонецПроцедуры 

&НаКлиенте
Процедура ОтклоненияОЗ(Команда)
	
    //+Мельников 05.06.24 Вынес в отдельную процедуру
	//СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	//
	//ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("Категория", СтрокаТабличнойЧастиТовары.Категория); 
	//ПараметрыФормы.Вставить("Именник", СтрокаТабличнойЧастиТовары.Именник);
	//ПараметрыФормы.Вставить("ДанныеИменника", СтрокаТабличнойЧастиТовары.ДанныеИменника);
	//ПараметрыФормы.Вставить("ВидИзделия", СтрокаТабличнойЧастиТовары.ВидИзделия);
	//ПараметрыФормы.Вставить("Клеймо", СтрокаТабличнойЧастиТовары.Клеймо);
	//ПараметрыФормы.Вставить("Количество", СтрокаТабличнойЧастиТовары.Количество);
	//ПараметрыФормы.Вставить("МассаМеталла", СтрокаТабличнойЧастиТовары.МассаМеталла);
	//ПараметрыФормы.Вставить("ОбщаяМасса", СтрокаТабличнойЧастиТовары.ОбщаяМасса);
	//ПараметрыФормы.Вставить("Проба", СтрокаТабличнойЧастиТовары.Проба);
	//ПараметрыФормы.Вставить("Дата", ПолучитьДанныеИзДокументаОперацииЗайма(СтрокаТабличнойЧастиТовары.ОперацияЗайма,, Истина));
	//ПараметрыФормы.Вставить("Ломбард", Объект.Ломбард);
	//ПараметрыФормы.Вставить("СхемаКредитования", ПолучитьДанныеИзДокументаОперацииЗайма(СтрокаТабличнойЧастиТовары.ОперацияЗайма, Истина));
	//ПараметрыФормы.Вставить("ЕдиницаИзмерения", СтрокаТабличнойЧастиТовары.ЕдиницаИзмерения);
	//
	////Фактические
	//ПараметрыФормы.Вставить("КатегорияФакт", СтрокаТабличнойЧастиТовары.КатегорияФакт); 
	//ПараметрыФормы.Вставить("ИменникФакт", СтрокаТабличнойЧастиТовары.ИменникФакт);
	//ПараметрыФормы.Вставить("ДанныеИменникаФакт", СтрокаТабличнойЧастиТовары.ДанныеИменникаФакт);
	//ПараметрыФормы.Вставить("ВидИзделияФакт", СтрокаТабличнойЧастиТовары.ВидИзделияФакт);
	//ПараметрыФормы.Вставить("КлеймоФакт", СтрокаТабличнойЧастиТовары.КлеймоФакт);
	//ПараметрыФормы.Вставить("КоличествоФакт", СтрокаТабличнойЧастиТовары.КоличествоФакт);
	//ПараметрыФормы.Вставить("МассаМеталлаФакт", СтрокаТабличнойЧастиТовары.МассаМеталлаФакт);
	//ПараметрыФормы.Вставить("ОбщаяМассаФакт", СтрокаТабличнойЧастиТовары.ОбщаяМассаФакт);
	//ПараметрыФормы.Вставить("ПробаФакт", СтрокаТабличнойЧастиТовары.ПробаФакт);
	//ПараметрыФормы.Вставить("ВесКамней", ПолучитьДанныеПоВставкам(СтрокаТабличнойЧастиТовары.ОбъектЗалога, "ВставкиФакт",, Истина));;
	//ПараметрыФормы.Вставить("ВесВставокМеталлов", ПолучитьДанныеПоВставкам(СтрокаТабличнойЧастиТовары.ОбъектЗалога, "ВставкиМеталла",, Истина));
	//
	//ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораОЗ",ЭтаФорма);
	//ОткрытьФорму("Документ.ЛБ_Инвентаризация.Форма.КорректировкаОЗ", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//-Мельников
	
	Если ТекущийЭлемент.Имя = "Товары" ИЛИ ТекущийЭлемент.Имя = "ВставкиФакт" ИЛИ ТекущийЭлемент.Имя = "ВставкиМеталла" Тогда
		ОткрытиеФормыОтклоненияОЗ(СформироватьСтруктуруТабличныхЧастей("Товары"));
	ИначеЕсли ТекущийЭлемент.Имя = "НовыеОЗ" ИЛИ ТекущийЭлемент.Имя = "ВставкиКамнейНовыеОЗ" ИЛИ ТекущийЭлемент.Имя = "ВставкиМеталлаНовыеОЗ" Тогда
		ОткрытиеФормыОтклоненияОЗ(СформироватьСтруктуруТабличныхЧастей("НовыеОЗ"));
	ИначеЕсли ТекущийЭлемент.Имя = "НаОХ" ИЛИ ТекущийЭлемент.Имя = "ВставкиКамнейНаОХ" ИЛИ ТекущийЭлемент.Имя = "ВставкиМеталлаНаОХ" Тогда
		ОткрытиеФормыОтклоненияОЗ(СформироватьСтруктуруТабличныхЧастей("НаОХ"));
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытиеФормыОтклоненияОЗ(ТЧ)
	
	СтрокаТабличнойЧастиТовары = Элементы[ТЧ.Основная].ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Категория", СтрокаТабличнойЧастиТовары.Категория); 
	ПараметрыФормы.Вставить("Именник", СтрокаТабличнойЧастиТовары.Именник);
	ПараметрыФормы.Вставить("ДанныеИменника", СтрокаТабличнойЧастиТовары.ДанныеИменника);
	ПараметрыФормы.Вставить("ВидИзделия", СтрокаТабличнойЧастиТовары.ВидИзделия);
	ПараметрыФормы.Вставить("Клеймо", СтрокаТабличнойЧастиТовары.Клеймо);
	ПараметрыФормы.Вставить("Количество", СтрокаТабличнойЧастиТовары.Количество);
	ПараметрыФормы.Вставить("МассаМеталла", СтрокаТабличнойЧастиТовары.МассаМеталла);
	ПараметрыФормы.Вставить("ОбщаяМасса", СтрокаТабличнойЧастиТовары.ОбщаяМасса);
	ПараметрыФормы.Вставить("Проба", СтрокаТабличнойЧастиТовары.Проба);
	ПараметрыФормы.Вставить("Дата", ПолучитьДанныеИзДокументаОперацииЗайма(СтрокаТабличнойЧастиТовары.ОперацияЗайма,, Истина));
	ПараметрыФормы.Вставить("Ломбард", Объект.Ломбард);
	ПараметрыФормы.Вставить("СхемаКредитования", ПолучитьДанныеИзДокументаОперацииЗайма(СтрокаТабличнойЧастиТовары.ОперацияЗайма, Истина));
	ПараметрыФормы.Вставить("ЕдиницаИзмерения", СтрокаТабличнойЧастиТовары.ЕдиницаИзмерения);
	ПараметрыФормы.Вставить("ТолькоПросмотр", Объект.Проведен);
	ПараметрыФормы.Вставить("Артикул", СтрокаТабличнойЧастиТовары.Артикул);
	
	//Фактические
	ПараметрыФормы.Вставить("КатегорияФакт", СтрокаТабличнойЧастиТовары.КатегорияФакт); 
	ПараметрыФормы.Вставить("ИменникФакт", СтрокаТабличнойЧастиТовары.ИменникФакт);
	ПараметрыФормы.Вставить("ДанныеИменникаФакт", СтрокаТабличнойЧастиТовары.ДанныеИменникаФакт);
	ПараметрыФормы.Вставить("ВидИзделияФакт", СтрокаТабличнойЧастиТовары.ВидИзделияФакт);
	ПараметрыФормы.Вставить("КлеймоФакт", СтрокаТабличнойЧастиТовары.КлеймоФакт);
	ПараметрыФормы.Вставить("КоличествоФакт", СтрокаТабличнойЧастиТовары.КоличествоФакт);
	ПараметрыФормы.Вставить("МассаМеталлаФакт", СтрокаТабличнойЧастиТовары.МассаМеталлаФакт);
	ПараметрыФормы.Вставить("ОбщаяМассаФакт", СтрокаТабличнойЧастиТовары.ОбщаяМассаФакт);
	ПараметрыФормы.Вставить("ПробаФакт", СтрокаТабличнойЧастиТовары.ПробаФакт);
	ПараметрыФормы.Вставить("ВесКамней", ПолучитьДанныеПоВставкам(СтрокаТабличнойЧастиТовары.ОбъектЗалога, "ВставкиФакт",, Истина));;
	ПараметрыФормы.Вставить("ВесВставокМеталлов", ПолучитьДанныеПоВставкам(СтрокаТабличнойЧастиТовары.ОбъектЗалога, "ВставкиМеталла",, Истина));
	
	ТЧ.Вставить("Форма", "КорректировкаОЗ");
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораОЗ", ЭтаФорма, ТЧ);
	ОткрытьФорму("Документ.ЛБ_Инвентаризация.Форма.КорректировкаОЗ", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьДанныеИзДокументаОперацииЗайма(ОперацияЗайма, СхемаКредитования = Ложь, ДатаДокумента = Ложь) Экспорт  
	Если СхемаКредитования Тогда
		Возврат ОперацияЗайма.СхемаКредитования;
	ИначеЕсли ДатаДокумента Тогда
		Возврат НачалоДня(ОперацияЗайма.Дата);
	КонецЕсли;		
КонецФункции

&НаСервере
Функция ПолучитьДанныеПоВставкам(ОбъектЗалога, ТЧ, Сумма = Ложь, Вес = Ложь) Экспорт  
	
	Отбор = Новый Структура;
	Отбор.Вставить("ОбъектЗалога", ОбъектЗалога);
	
	МассивВставок = Объект[ТЧ].НайтиСтроки(Отбор);

	Если Сумма Тогда
		
		СуммаВставок = 0;
		
		Если ТЧ = "ВставкиМеталла" Тогда
			Для каждого СтрМ Из МассивВставок Цикл
				СуммаВставок = СуммаВставок + СтрМ.СуммаОценкиФакт;
			КонецЦикла;
		Иначе
			Для каждого СтрМ Из МассивВставок Цикл
				СуммаВставок = СуммаВставок + СтрМ.СуммаФакт;
			КонецЦикла;
		КонецЕсли;
		
		Возврат СуммаВставок;
	ИначеЕсли Вес Тогда
		
		ВесВставок = 0;
		
		Если ТЧ = "ВставкиМеталла" Тогда
			Для каждого СтрМ Из МассивВставок Цикл
				ВесВставок = ВесВставок + СтрМ.ВесФакт;
			КонецЦикла;
		Иначе
			Для каждого СтрМ Из МассивВставок Цикл
				ВесВставок = ВесВставок + СтрМ.ВесГраммыФакт;
			КонецЦикла;
		КонецЕсли;
		
		Возврат ВесВставок;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПослеВыбораОЗ(Результат, ДопПараметры) Экспорт  
	
	СтрокаТабличнойЧастиТовары	= Элементы[ДопПараметры.Основная].ТекущиеДанные;

	НоваяСтрокаТЧ = Ложь;
	
	Если Результат = Неопределено Тогда
		Возврат;
	ИначеЕсли ТипЗнч(Результат) = Тип("Структура") И Результат.Отмена И Результат.НоваяСтрокаТЧ Тогда
		
		Объект[ДопПараметры.Основная].Удалить(Элементы[ДопПараметры.Основная].ТекущиеДанные.НомерСтроки - 1);
		
	ИначеЕсли ТипЗнч(Результат) = Тип("Структура") И НЕ Результат.Отмена И Результат.НоваяСтрокаТЧ Тогда
		
		НаличиеОЗВТЧ = ПроверитьОЗНаНаличиеВТЧ(Результат.ОбъектЗалога);
		
		Если НаличиеОЗВТЧ Тогда
			Предупреждение("Выбранный объект залога уже присутствует в таблице.");
		Иначе
			НоваяСтрокаТЧ = Результат.НоваяСтрокаТЧ;
			ДобавляемыйОЗ = Результат.ОбъектЗалога;
			УдалитьВставкиПоОЗ(Результат.ОбъектЗалога, ДопПараметры);
			//+МАН 22.11.24
			ЗаполнитьПоОстаткамОбъектовЗалога(Истина);
			//-МАН
		КонецЕсли;
		
		Объект[ДопПараметры.Основная].Удалить(Элементы[ДопПараметры.Основная].ТекущиеДанные.НомерСтроки - 1);
		
	Иначе
	
		СтрокаТабличнойЧастиТовары.ВидИзделияФакт = Результат.ВидИзделияФакт;
		СтрокаТабличнойЧастиТовары.ИменникФакт = Результат.ИменникФакт;
		СтрокаТабличнойЧастиТовары.ДанныеИменникаФакт = Результат.ДанныеИменникаФакт;
		СтрокаТабличнойЧастиТовары.КатегорияФакт = Результат.КатегорияФакт;
		СтрокаТабличнойЧастиТовары.КлеймоФакт = Результат.КлеймоФакт;
		СтрокаТабличнойЧастиТовары.ПробаФакт = Результат.ПробаФакт;
		СтрокаТабличнойЧастиТовары.КоличествоФакт = Результат.КоличествоФакт;
		СтрокаТабличнойЧастиТовары.ОбщаяМассаФакт = Результат.ОбщаяМассаФакт;
		СтрокаТабличнойЧастиТовары.МассаМеталлаФакт = Результат.МассаМеталлаФакт; 
		
		//++ООВ 26.03.2026 Заявка 3757
		Если Результат.КоличествоФакт = 0 Тогда
			СтрокаТабличнойЧастиТовары.Комментарий = "Изделие отсутствует";
			СтрокаТабличнойЧастиТовары.СтатусОбъектаЗалога = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыОбъектовЗалога.Недостача");
		КонецЕсли;
		//--ООВ 26.03.2026 Заявка 3757
		
		СформироватьСтрокуОтклонения(ДопПараметры);
		
		Модифицированность = Истина; 
		
		//++ООВ 06.04.2026 Заявка 3757
		Если СтрокаТабличнойЧастиТовары.Количество <> СтрокаТабличнойЧастиТовары.КоличествоФакт Тогда
			СтрокаТабличнойЧастиТовары.СуммаОценкиФакт = 0;
			СтрокаТабличнойЧастиТовары.СуммаОценкиМеталлыФакт = 0;
		Иначе
			//--ООВ 06.04.2026 Заявка 3757
			
			Если СтрокаТабличнойЧастиТовары.Категория <> СтрокаТабличнойЧастиТовары.КатегорияФакт ИЛИ
				//СтрокаТабличнойЧастиТовары.Проба <> СтрокаТабличнойЧастиТовары.ПробаФакт ИЛИ
				//СтрокаТабличнойЧастиТовары.Количество <> СтрокаТабличнойЧастиТовары.КоличествоФакт ИЛИ 
				
				//++ООВ 06.04.2026 Заявка 3757 
				(СтрокаТабличнойЧастиТовары.Проба <> СтрокаТабличнойЧастиТовары.ПробаФакт 
				И СтрокаТабличнойЧастиТовары.Количество = СтрокаТабличнойЧастиТовары.КоличествоФакт) ИЛИ
				//--ООВ 06.04.2026 Заявка 3757
				
				СтрокаТабличнойЧастиТовары.ОбщаяМасса <> СтрокаТабличнойЧастиТовары.ОбщаяМассаФакт ИЛИ
				СтрокаТабличнойЧастиТовары.МассаМеталла <> СтрокаТабличнойЧастиТовары.МассаМеталлаФакт Тогда
				
				ЦенаДрагоценногоМеталла(СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор(), ДопПараметры.Основная, ДопПараметры);
			Иначе
				СтрокаТабличнойЧастиТовары.СуммаОценкиФакт = СтрокаТабличнойЧастиТовары.СуммаОценки;
				СтрокаТабличнойЧастиТовары.СуммаОценкиМеталлыФакт = СтрокаТабличнойЧастиТовары.СуммаОценкиМеталлы;			
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;  
	
	ОбщееКоличествоОЗВДокументе();
КонецПроцедуры

&НаКлиенте
Процедура ВставкиМеталлаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ТекущийЭлемент.Имя = "Товары" ИЛИ ТекущийЭлемент.Имя = "ВставкиФакт" ИЛИ ТекущийЭлемент.Имя = "ВставкиМеталла" Тогда
		ОткрытьФормуОтклоненияВставкиМеталла(СформироватьСтруктуруТабличныхЧастей("Товары"));
	ИначеЕсли ТекущийЭлемент.Имя = "НовыеОЗ" ИЛИ ТекущийЭлемент.Имя = "ВставкиКамнейНовыеОЗ" ИЛИ ТекущийЭлемент.Имя = "ВставкиМеталлаНовыеОЗ" Тогда
		ОткрытьФормуОтклоненияВставкиМеталла(СформироватьСтруктуруТабличныхЧастей("НовыеОЗ"));
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПоследнююТекущуюСтроку()
    Элементы.ВставкиМеталла.ТекущаяСтрока=?(Объект.ВставкиМеталла.Количество()=0,0,Объект.ВставкиМеталла.Количество()-1);
КонецПроцедуры

&НаКлиенте
Процедура ВставкиФактПередУдалением(Элемент, Отказ)
	Если Объект.ВидИнвентаризации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидИнвентаризации.Полная") Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВставкиМеталлаПередУдалением(Элемент, Отказ)
	Если Объект.ВидИнвентаризации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидИнвентаризации.Полная") Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВставкуМеталла(Команда)

	//+Мельников 05.06.24 Вынес в отдельную процедуру

	////Необходимо убрать отбор иначе не добавляется новая строка
	//Элементы.ВставкиМеталла.ОтборСтрок = Неопределено; // Новый ФиксированнаяСтруктура(Отбор);
	////
	//
	//НоваяСтрокаТЧ = Истина;
	//
	//НоваяСтрока = Объект.ВставкиМеталла.Добавить();
	//Элементы.ВставкиМеталла.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();

	//СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	//СтрокаТабличнойЧастиВставки = Элементы.ВставкиМеталла.ТекущиеДанные;

	//СтрокаТабличнойЧастиВставки.ОбъектЗалога = СтрокаТабличнойЧастиТовары.ОбъектЗалога;

	//ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("Категория", СтрокаТабличнойЧастиТовары.КатегорияФакт); 
	//ПараметрыФормы.Вставить("ОсновнойМеталл", СтрокаТабличнойЧастиТовары.Проба);
	//ПараметрыФормы.Вставить("ОперацияЗайма", СтрокаТабличнойЧастиТовары.ОперацияЗайма);
	//ПараметрыФормы.Вставить("ЕдиницаИзмерения", СтрокаТабличнойЧастиВставки.ЕдиницаИзмерения); 
	//ПараметрыФормы.Вставить("НоваяСтрокаТЧ", НоваяСтрокаТЧ);
	//ПараметрыФормы.Вставить("ИДНоваяСтрокаТЧ", НоваяСтрока.ПолучитьИдентификатор());
	//ПараметрыФормы.Вставить("ОбъектЗалога", СтрокаТабличнойЧастиТовары.ОбъектЗалога); 

	//ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораВставкиМеталла",ЭтаФорма);
	//ОткрытьФорму("Документ.ЛБ_Инвентаризация.Форма.КорректировкаВставкиМеталла", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	//-Мельников

	Если ТекущийЭлемент.Имя = "Товары" ИЛИ ТекущийЭлемент.Имя = "ВставкиФакт" ИЛИ ТекущийЭлемент.Имя = "ВставкиМеталла" Тогда
		ОткрытьФормуДобавленияВставкиМеталла(СформироватьСтруктуруТабличныхЧастей("Товары"));
	ИначеЕсли ТекущийЭлемент.Имя = "НовыеОЗ" ИЛИ ТекущийЭлемент.Имя = "ВставкиКамнейНовыеОЗ" ИЛИ ТекущийЭлемент.Имя = "ВставкиМеталлаНовыеОЗ" Тогда
		ОткрытьФормуДобавленияВставкиМеталла(СформироватьСтруктуруТабличныхЧастей("НовыеОЗ"));
	ИначеЕсли ТекущийЭлемент.Имя = "НаОХ" ИЛИ ТекущийЭлемент.Имя = "ВставкиКамнейНаОХ" ИЛИ ТекущийЭлемент.Имя = "ВставкиМеталлаНаОХ" Тогда
		ОткрытьФормуДобавленияВставкиМеталла(СформироватьСтруктуруТабличныхЧастей("НаОХ"));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуДобавленияВставкиМеталла(ТЧ)

	//Необходимо убрать отбор иначе не добавляется новая строка
	//Элементы[ТЧ.ВставкаМ].ОтборСтрок = Неопределено; // Новый ФиксированнаяСтруктура(Отбор);
	//
	
	НоваяСтрокаТЧ = Истина;
	
	НоваяСтрока = Объект[ТЧ.ВставкаМ].Добавить();
	Элементы[ТЧ.ВставкаМ].ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();

	СтрокаТабличнойЧастиТовары = Элементы[ТЧ.Основная].ТекущиеДанные;
    СтрокаТабличнойЧастиВставки = Элементы[ТЧ.ВставкаМ].ТекущиеДанные;

    //СтрокаТабличнойЧастиВставки.ОбъектЗалога = СтрокаТабличнойЧастиТовары.ОбъектЗалога;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Категория", СтрокаТабличнойЧастиТовары.КатегорияФакт); 
	ПараметрыФормы.Вставить("ОсновнойМеталл", СтрокаТабличнойЧастиТовары.Проба);
	ПараметрыФормы.Вставить("ОперацияЗайма", СтрокаТабличнойЧастиТовары.ОперацияЗайма);
	ПараметрыФормы.Вставить("ЕдиницаИзмерения", СтрокаТабличнойЧастиТовары.ЕдиницаИзмерения); //СтрокаТабличнойЧастиВставки.ЕдиницаИзмерения); 
	ПараметрыФормы.Вставить("НоваяСтрокаТЧ", НоваяСтрокаТЧ);
	ПараметрыФормы.Вставить("ИДНоваяСтрокаТЧ", НоваяСтрока.ПолучитьИдентификатор());
	ПараметрыФормы.Вставить("ОбъектЗалога", СтрокаТабличнойЧастиТовары.ОбъектЗалога); 
	ПараметрыФормы.Вставить("ТЧ", ТЧ); 
	ПараметрыФормы.Вставить("ОбщаяМассаФакт", СтрокаТабличнойЧастиТовары.ОбщаяМассаФакт);

	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораВставкиМеталла", ЭтаФорма, ТЧ);
    ОткрытьФорму("Документ.ЛБ_Инвентаризация.Форма.КорректировкаВставкиМеталла", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВставку(Команда)
	
	//+Мельников 05.06.24 Вынес в отдельную процедуру
	
	////Необходимо убрать отбор иначе не добавляется новая строка
	//Элементы.ВставкиФакт.ОтборСтрок = Неопределено;
	////
	//
	//НоваяСтрокаТЧ = Истина;
	//
	//НоваяСтрока = Объект.ВставкиФакт.Добавить();
	//Элементы.ВставкиФакт.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();

	//СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	//СтрокаТабличнойЧастиВставки = Элементы.ВставкиФакт.ТекущиеДанные;
	//
	//ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("КатегорияОбъектаЗалога", СтрокаТабличнойЧастиТовары.Категория); 
	//ПараметрыФормы.Вставить("Именник", СтрокаТабличнойЧастиТовары.Именник);
	//ПараметрыФормы.Вставить("Количество", СтрокаТабличнойЧастиВставки.Количество); 
	//ПараметрыФормы.Вставить("ВидВставки", СтрокаТабличнойЧастиВставки.ВидВставки); 
	//ПараметрыФормы.Вставить("ФормаОгранки", СтрокаТабличнойЧастиВставки.ФормаОгранки);
	//ПараметрыФормы.Вставить("ВидОгранки", СтрокаТабличнойЧастиВставки.ВидОгранки);
	//ПараметрыФормы.Вставить("КачествоОгранки", СтрокаТабличнойЧастиВставки.КачествоОгранки); 
	//ПараметрыФормы.Вставить("Диаметр", СтрокаТабличнойЧастиВставки.Диаметр);
	//ПараметрыФормы.Вставить("Диаметр1", СтрокаТабличнойЧастиВставки.Диаметр1);
	//ПараметрыФормы.Вставить("Диаметр2", СтрокаТабличнойЧастиВставки.Диаметр2); 
	//ПараметрыФормы.Вставить("Длина", СтрокаТабличнойЧастиВставки.Длина);  
	//ПараметрыФормы.Вставить("Ширина", СтрокаТабличнойЧастиВставки.Ширина);
	//ПараметрыФормы.Вставить("Высота", СтрокаТабличнойЧастиВставки.Высота);
	//ПараметрыФормы.Вставить("ВесКар", СтрокаТабличнойЧастиВставки.Вес);
	//ПараметрыФормы.Вставить("Весграммы", СтрокаТабличнойЧастиВставки.ВесГраммы);
	////Фактические
	//ПараметрыФормы.Вставить("КатегорияОбъектаЗалогаФакт", СтрокаТабличнойЧастиТовары.КатегорияФакт); 
	//ПараметрыФормы.Вставить("ИменникФакт", СтрокаТабличнойЧастиТовары.ИменникФакт);
	//ПараметрыФормы.Вставить("КоличествоФакт", СтрокаТабличнойЧастиВставки.КоличествоФакт); 
	//ПараметрыФормы.Вставить("ВидВставкиФакт", СтрокаТабличнойЧастиВставки.ВидВставкиФакт); 
	//ПараметрыФормы.Вставить("ФормаОгранкиФакт", СтрокаТабличнойЧастиВставки.ФормаОгранкиФакт);
	//ПараметрыФормы.Вставить("ВидОгранкиФакт", СтрокаТабличнойЧастиВставки.ВидОгранкиФакт);
	//ПараметрыФормы.Вставить("КачествоОгранкиФакт", СтрокаТабличнойЧастиВставки.КачествоОгранкиФакт); 
	//ПараметрыФормы.Вставить("ДиаметрФакт", СтрокаТабличнойЧастиВставки.ДиаметрФакт);
	//ПараметрыФормы.Вставить("Диаметр1Факт", СтрокаТабличнойЧастиВставки.Диаметр1Факт);
	//ПараметрыФормы.Вставить("Диаметр2Факт", СтрокаТабличнойЧастиВставки.Диаметр2Факт); 
	//ПараметрыФормы.Вставить("ДлинаФакт", СтрокаТабличнойЧастиВставки.ДлинаФакт);  
	//ПараметрыФормы.Вставить("ШиринаФакт", СтрокаТабличнойЧастиВставки.ШиринаФакт);
	//ПараметрыФормы.Вставить("ВысотаФакт", СтрокаТабличнойЧастиВставки.ВысотаФакт);
	//ПараметрыФормы.Вставить("ВесФакт", СтрокаТабличнойЧастиВставки.ВесФакт);
	//ПараметрыФормы.Вставить("ВесграммыФакт", СтрокаТабличнойЧастиВставки.ВесГраммыФакт);
	//ПараметрыФормы.Вставить("НоваяСтрокаТЧ", НоваяСтрокаТЧ);
	//ПараметрыФормы.Вставить("ИДНоваяСтрокаТЧ", НоваяСтрока.ПолучитьИдентификатор());
	//ПараметрыФормы.Вставить("ОбъектЗалога", СтрокаТабличнойЧастиТовары.ОбъектЗалога); 
	//
	//ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораВставки",ЭтаФорма);
	//ОткрытьФорму("Документ.ЛБ_Инвентаризация.Форма.КорректировкаВставки", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
    //-Мельников
	
	//+МАН 17.10.24 Заявка 2464
	ВидВст = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыКомплектующихИзделия.Вставка");
	Если НЕ ВвестиЗначение(ВидВст, "Выберите вид вставки", Тип("ПеречислениеСсылка.ЛБ_ВидыКомплектующихИзделия")) Тогда
		Возврат;
	КонецЕсли;
	//-МАН
	
	Если ТекущийЭлемент.Имя = "Товары" ИЛИ ТекущийЭлемент.Имя = "ВставкиФакт" ИЛИ ТекущийЭлемент.Имя = "ВставкиМеталла" Тогда
		ОткрытьФормуДобавленияВставки(СформироватьСтруктуруТабличныхЧастей("Товары"), ВидВст);
	ИначеЕсли ТекущийЭлемент.Имя = "НовыеОЗ" ИЛИ ТекущийЭлемент.Имя = "ВставкиКамнейНовыеОЗ" ИЛИ ТекущийЭлемент.Имя = "ВставкиМеталлаНовыеОЗ" Тогда
		ОткрытьФормуДобавленияВставки(СформироватьСтруктуруТабличныхЧастей("НовыеОЗ"), ВидВст);
	ИначеЕсли ТекущийЭлемент.Имя = "НаОХ" ИЛИ ТекущийЭлемент.Имя = "ВставкиКамнейНаОХ" ИЛИ ТекущийЭлемент.Имя = "ВставкиМеталлаНаОХ" Тогда
		ОткрытьФормуДобавленияВставки(СформироватьСтруктуруТабличныхЧастей("НаОХ"), ВидВст);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуДобавленияВставки(ТЧ, ВидВст)
	
	//+МАН 30.05.25 Закомментировал т.к. стали отображаться суммы по вставкам при добавлении
	//Необходимо убрать отбор иначе не добавляется новая строка
	//Элементы[ТЧ.ВставкаК].ОтборСтрок = Неопределено;
	//
	
	НоваяСтрокаТЧ = Истина;
	
	НоваяСтрока = Объект[ТЧ.ВставкаК].Добавить();
	Элементы[ТЧ.ВставкаК].ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();

	СтрокаТабличнойЧастиТовары = Элементы[ТЧ.Основная].ТекущиеДанные;
	СтрокаТабличнойЧастиВставки = Элементы[ТЧ.ВставкаК].ТекущиеДанные;
	
	//+МАН 17.10.24 Заявка 2464
	Если ВидВст = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыКомплектующихИзделия.Вставка") Тогда
	//-МАН
		//ПараметрыФормы = Новый Структура;
		//ПараметрыФормы.Вставить("КатегорияОбъектаЗалога", СтрокаТабличнойЧастиТовары.Категория); 
		//ПараметрыФормы.Вставить("Именник", СтрокаТабличнойЧастиТовары.Именник);
		//ПараметрыФормы.Вставить("Количество", СтрокаТабличнойЧастиВставки.Количество); 
		//ПараметрыФормы.Вставить("ВидВставки", СтрокаТабличнойЧастиВставки.ВидВставки); 
		//ПараметрыФормы.Вставить("ФормаОгранки", СтрокаТабличнойЧастиВставки.ФормаОгранки);
		//ПараметрыФормы.Вставить("ВидОгранки", СтрокаТабличнойЧастиВставки.ВидОгранки);
		//ПараметрыФормы.Вставить("КачествоОгранки", СтрокаТабличнойЧастиВставки.КачествоОгранки); 
		//ПараметрыФормы.Вставить("Диаметр", СтрокаТабличнойЧастиВставки.Диаметр);
		//ПараметрыФормы.Вставить("Диаметр1", СтрокаТабличнойЧастиВставки.Диаметр1);
		//ПараметрыФормы.Вставить("Диаметр2", СтрокаТабличнойЧастиВставки.Диаметр2); 
		//ПараметрыФормы.Вставить("Длина", СтрокаТабличнойЧастиВставки.Длина);  
		//ПараметрыФормы.Вставить("Ширина", СтрокаТабличнойЧастиВставки.Ширина);
		//ПараметрыФормы.Вставить("Высота", СтрокаТабличнойЧастиВставки.Высота);
		//ПараметрыФормы.Вставить("ВесКар", СтрокаТабличнойЧастиВставки.Вес);
		//ПараметрыФормы.Вставить("Весграммы", СтрокаТабличнойЧастиВставки.ВесГраммы);
		////Фактические
		//ПараметрыФормы.Вставить("КатегорияОбъектаЗалогаФакт", СтрокаТабличнойЧастиТовары.КатегорияФакт); 
		//ПараметрыФормы.Вставить("ИменникФакт", СтрокаТабличнойЧастиТовары.ИменникФакт);
		//ПараметрыФормы.Вставить("КоличествоФакт", СтрокаТабличнойЧастиВставки.КоличествоФакт); 
		//ПараметрыФормы.Вставить("ВидВставкиФакт", СтрокаТабличнойЧастиВставки.ВидВставкиФакт); 
		//ПараметрыФормы.Вставить("ФормаОгранкиФакт", СтрокаТабличнойЧастиВставки.ФормаОгранкиФакт);
		//ПараметрыФормы.Вставить("ВидОгранкиФакт", СтрокаТабличнойЧастиВставки.ВидОгранкиФакт);
		//ПараметрыФормы.Вставить("КачествоОгранкиФакт", СтрокаТабличнойЧастиВставки.КачествоОгранкиФакт); 
		//ПараметрыФормы.Вставить("ДиаметрФакт", СтрокаТабличнойЧастиВставки.ДиаметрФакт);
		//ПараметрыФормы.Вставить("Диаметр1Факт", СтрокаТабличнойЧастиВставки.Диаметр1Факт);
		//ПараметрыФормы.Вставить("Диаметр2Факт", СтрокаТабличнойЧастиВставки.Диаметр2Факт); 
		//ПараметрыФормы.Вставить("ДлинаФакт", СтрокаТабличнойЧастиВставки.ДлинаФакт);  
		//ПараметрыФормы.Вставить("ШиринаФакт", СтрокаТабличнойЧастиВставки.ШиринаФакт);
		//ПараметрыФормы.Вставить("ВысотаФакт", СтрокаТабличнойЧастиВставки.ВысотаФакт);
		//ПараметрыФормы.Вставить("ВесФакт", СтрокаТабличнойЧастиВставки.ВесФакт);
		//ПараметрыФормы.Вставить("ВесграммыФакт", СтрокаТабличнойЧастиВставки.ВесГраммыФакт);
		//ПараметрыФормы.Вставить("НоваяСтрокаТЧ", НоваяСтрокаТЧ);
		//ПараметрыФормы.Вставить("ИДНоваяСтрокаТЧ", НоваяСтрока.ПолучитьИдентификатор());
		//ПараметрыФормы.Вставить("ОбъектЗалога", СтрокаТабличнойЧастиТовары.ОбъектЗалога); 
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("КатегорияОбъектаЗалога", СтрокаТабличнойЧастиТовары.Категория); 
		ПараметрыФормы.Вставить("Именник", СтрокаТабличнойЧастиТовары.Именник);
		//ПараметрыФормы.Вставить("Количество", 0); 
		//ПараметрыФормы.Вставить("ВидВставки", Справочники.ЛБ_ДрагоценныеКамни.ПустаяСсылка());
		//ПараметрыФормы.Вставить("ФормаОгранки", Справочники.ЛБ_ФормыОгранки.ПустаяСсылка());
		//ПараметрыФормы.Вставить("ВидОгранки", Справочники.ЛБ_ВидыОгранки.ПустаяСсылка());
		//ПараметрыФормы.Вставить("КачествоОгранки", Справочники.ЛБ_КачествоОгранки.ПустаяСсылка());
		//ПараметрыФормы.Вставить("Диаметр", 0);
		//ПараметрыФормы.Вставить("Диаметр1", 0);
		//ПараметрыФормы.Вставить("Диаметр2", 0); 
		//ПараметрыФормы.Вставить("Длина", 0);  
		//ПараметрыФормы.Вставить("Ширина", 0);
		//ПараметрыФормы.Вставить("Высота", 0);
		//ПараметрыФормы.Вставить("ВесКар", 0);
		//ПараметрыФормы.Вставить("Весграммы", 0);
		//Фактические
		ПараметрыФормы.Вставить("КатегорияОбъектаЗалогаФакт", СтрокаТабличнойЧастиТовары.КатегорияФакт); 
		ПараметрыФормы.Вставить("ИменникФакт", СтрокаТабличнойЧастиТовары.ИменникФакт);
		//ПараметрыФормы.Вставить("КоличествоФакт", 0); 
		//ПараметрыФормы.Вставить("ВидВставкиФакт", Справочники.ЛБ_ДрагоценныеКамни.ПустаяСсылка()); 
		//ПараметрыФормы.Вставить("ФормаОгранкиФакт", Справочники.ЛБ_ФормыОгранки.ПустаяСсылка());
		//ПараметрыФормы.Вставить("ВидОгранкиФакт", Справочники.ЛБ_ВидыОгранки.ПустаяСсылка());
		//ПараметрыФормы.Вставить("КачествоОгранкиФакт", Справочники.ЛБ_КачествоОгранки.ПустаяСсылка());
		//ПараметрыФормы.Вставить("ДиаметрФакт", 0);
		//ПараметрыФормы.Вставить("Диаметр1Факт", 0);
		//ПараметрыФормы.Вставить("Диаметр2Факт", 0); 
		//ПараметрыФормы.Вставить("ДлинаФакт", 0);  
		//ПараметрыФормы.Вставить("ШиринаФакт", 0);
		//ПараметрыФормы.Вставить("ВысотаФакт", 0);
		//ПараметрыФормы.Вставить("ВесФакт", 0);
		//ПараметрыФормы.Вставить("ВесграммыФакт", 0);
		ПараметрыФормы.Вставить("НоваяСтрокаТЧ", НоваяСтрокаТЧ);
		ПараметрыФормы.Вставить("ИДНоваяСтрокаТЧ", НоваяСтрока.ПолучитьИдентификатор());
		ПараметрыФормы.Вставить("ОбъектЗалога", СтрокаТабличнойЧастиТовары.ОбъектЗалога); 
		//+МАН 17.10.24 Заявка 2464
		ПараметрыФормы.Вставить("ТЧ", ТЧ);
		ПараметрыФормы.Вставить("ОбщаяМассаФакт", СтрокаТабличнойЧастиТовары.ОбщаяМассаФакт);
		//-МАН
		
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораВставки", ЭтаФорма, ТЧ);
		ОткрытьФорму("Документ.ЛБ_Инвентаризация.Форма.КорректировкаВставки", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//+МАН 17.10.24 Заявка 2464
	ИначеЕсли ВидВст = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыКомплектующихИзделия.Комплектующее") Тогда

		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ТЧ", ТЧ);
		ПараметрыФормы.Вставить("ОбъектЗалога", СтрокаТабличнойЧастиТовары.ОбъектЗалога);
		ПараметрыФормы.Вставить("ОбщаяМассаФакт", СтрокаТабличнойЧастиТовары.ОбщаяМассаФакт);
		ПараметрыФормы.Вставить("НоваяСтрокаТЧ", НоваяСтрокаТЧ);
		ПараметрыФормы.Вставить("ИДНоваяСтрокаТЧ", НоваяСтрока.ПолучитьИдентификатор());

		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораВставки", ЭтаФорма, ТЧ);
		ОткрытьФорму("Документ.ЛБ_Инвентаризация.Форма.КорректировкаКомплектующего", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	//-МАН
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОЗ(Команда)
	
	//+Мельников 06.06.24 Вынес в отдельную процедуру
	
	//НоваяСтрокаТЧ = Истина;
	//
	//НоваяСтрока = Объект.Товары.Добавить();
	//Элементы.Товары.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();

	//СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;

	//ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("НоваяСтрокаТЧ", НоваяСтрокаТЧ); 
	//ПараметрыФормы.Вставить("ИДНоваяСтрокаТЧ", НоваяСтрока.ПолучитьИдентификатор());
	//ПараметрыФормы.Вставить("Ломбард", Объект.Ломбард);
	//
	//ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораОЗ", ЭтаФорма, ТЧ);
	//ОткрытьФорму("Документ.ЛБ_Инвентаризация.Форма.ФормаПоискаОЗ", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	//-Мельников
	
	Если ТекущийЭлемент.Имя = "Товары" ИЛИ ТекущийЭлемент.Имя = "ВставкиФакт" ИЛИ ТекущийЭлемент.Имя = "ВставкиМеталла" Тогда
		ОткрытьФормуДобавленияОЗ(СформироватьСтруктуруТабличныхЧастей("Товары"));
	ИначеЕсли ТекущийЭлемент.Имя = "НовыеОЗ" ИЛИ ТекущийЭлемент.Имя = "ВставкиКамнейНовыеОЗ" ИЛИ ТекущийЭлемент.Имя = "ВставкиМеталлаНовыеОЗ" Тогда
		ОткрытьФормуДобавленияОЗ(СформироватьСтруктуруТабличныхЧастей("НовыеОЗ"));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуДобавленияОЗ(ТЧ)
	
	НоваяСтрокаТЧ = Истина;
	
	НоваяСтрока = Объект.Товары.Добавить();
	Элементы.Товары.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();

	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НоваяСтрокаТЧ", НоваяСтрокаТЧ); 
	ПараметрыФормы.Вставить("ИДНоваяСтрокаТЧ", НоваяСтрока.ПолучитьИдентификатор());
	ПараметрыФормы.Вставить("Ломбард", Объект.Ломбард);
	ПараметрыФормы.Вставить("ДатаИнвентаризации", НачалоДня(Объект.Дата));
	
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораОЗ", ЭтаФорма, ТЧ);
	ОткрытьФорму("Документ.ЛБ_Инвентаризация.Форма.ФормаПоискаОЗ", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


&НаСервере
Процедура УдалитьВставкиПоОЗ(ОбъектЗалога, ТЧ)
	
	Отбор = Новый Структура;
	Отбор.Вставить("ОбъектЗалога", ОбъектЗалога);
	
	МассивВставки = Объект[ТЧ.ВставкаК].НайтиСтроки(Отбор);
	МассивВставкиМеталла = Объект[ТЧ.ВставкаМ].НайтиСтроки(Отбор);
	
	Если МассивВставки.Количество() > 0 Тогда
		Для каждого СтрМ Из МассивВставки Цикл
			Объект[ТЧ.ВставкаК].Удалить(СтрМ.НомерСтроки - 1);
		КонецЦикла;
	КонецЕсли;

	Если МассивВставкиМеталла.Количество() > 0 Тогда
		Для каждого СтрМ Из МассивВставкиМеталла Цикл
			Объект[ТЧ.ВставкаМ].Удалить(СтрМ.НомерСтроки - 1);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
	
&НаСервере
Функция ПроверитьОЗНаНаличиеВТЧ(ОбъектЗалога)
	
	Отбор = Новый Структура;
	Отбор.Вставить("ОбъектЗалога", ОбъектЗалога);
	
	МассивОЗ = Объект.Товары.НайтиСтроки(Отбор);
	
	Если МассивОЗ.Количество() > 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура УдалитьПустуюСтрокуФильтра(Фильтр, Спр, НаименованиеСтолбца, Тип)

	Если Фильтр <> Неопределено И Спр <> Неопределено И НаименованиеСтолбца <> Неопределено Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить(НаименованиеСтолбца, ?(Тип = "Перечисление", Перечисления[Спр].ПустаяСсылка(), Справочники[Спр].ПустаяСсылка()));
		
		Стр = Объект[Фильтр].НайтиСтроки(Отбор);
		
		Если Стр.Количество() > 0 Тогда
			Объект[Фильтр].Удалить(Стр[0].НомерСтроки - 1);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТЧОЗ(Команда)
	Объект.Товары.Очистить();
	Объект.ВставкиФакт.Очистить();
	Объект.ВставкиМеталла.Очистить();
	Объект.НовыеОЗ.Очистить();
	Объект.ВставкиКамнейНовыеОЗ.Очистить();
	Объект.ВставкиМеталлаНовыеОЗ.Очистить();
	Объект.НаОХ.Очистить();
	Объект.ВставкиКамнейНаОХ.Очистить();
	Объект.ВставкиМеталлаНаОХ.Очистить();
	Объект.Изъятые.Очистить();
	Объект.ВставкиКамнейИзъятые.Очистить();
	Объект.ВставкиМеталлаИзъятые.Очистить();
	Объект.СумкаЗакрыта.Очистить();
	Объект.ВставкиКамнейСумкаЗакрыта.Очистить();
	Объект.ВставкиМеталлаСумкаЗакрыта.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура СброситьВсеФильтры(Команда)
	
	Объект.ФильтрВидыИзделий.Очистить();
	Объект.ФильтрКатегории.Очистить();
	Объект.ФильтрПробы.Очистить();
	Объект.ФильтрКамни.Очистить();
	Объект.ФильтрПриемщики.Очистить();
	Объект.ФильтрЗалогодатели.Очистить();
	Объект.ФильтрСтатусыЗалогодателя.Очистить();
	Объект.ФильтрСтатусы.Очистить();
	ОчиститьОбщиеМассы(Истина);
	ОчиститьМассыМеталла(Истина);
	ОчиститьСуммыОценки(Истина);
	ОчиститьДатыЗайма(Истина);
	ОтборИменник = Ложь;
	ОтборБезВставок = Ложь;
	ОтборВставкаМеталл = Ложь;
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьСтруктуруТабличныхЧастей(ТЧ)

	Если ТЧ = "Товары" Тогда
		
		ТЧ = Новый Структура;
		ТЧ.Вставить("Основная", "Товары");
		ТЧ.Вставить("ВставкаК", "ВставкиФакт");
		ТЧ.Вставить("ВставкаМ", "ВставкиМеталла");
		
		Возврат ТЧ;
	ИначеЕсли ТЧ = "НовыеОЗ" Тогда 

		ТЧ = Новый Структура;
		ТЧ.Вставить("Основная", "НовыеОЗ");
		ТЧ.Вставить("ВставкаК", "ВставкиКамнейНовыеОЗ");
		ТЧ.Вставить("ВставкаМ", "ВставкиМеталлаНовыеОЗ");
		
		Возврат ТЧ;
	ИначеЕсли ТЧ = "НаОХ" Тогда 

		ТЧ = Новый Структура;
		ТЧ.Вставить("Основная", "НаОХ");
		ТЧ.Вставить("ВставкаК", "ВставкиКамнейНаОХ");
		ТЧ.Вставить("ВставкаМ", "ВставкиМеталлаНаОХ");
		
		Возврат ТЧ;
	ИначеЕсли ТЧ = "Изъятые" Тогда 

		ТЧ = Новый Структура;
		ТЧ.Вставить("Основная", "Изъятые");
		ТЧ.Вставить("ВставкаК", "ВставкиКамнейИзъятые");
		ТЧ.Вставить("ВставкаМ", "ВставкиМеталлаИзъятые");
		
		Возврат ТЧ;
	ИначеЕсли ТЧ = "СумкаЗакрыта" Тогда 

		ТЧ = Новый Структура;
		ТЧ.Вставить("Основная", "СумкаЗакрыта");
		ТЧ.Вставить("ВставкаК", "ВставкиКамнейСумкаЗакрыта");
		ТЧ.Вставить("ВставкаМ", "ВставкиМеталлаСумкаЗакрыта");
		
		Возврат ТЧ;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура НовыеОЗПриАктивизацииСтроки(Элемент)
	НайтиВставки(СформироватьСтруктуруТабличныхЧастей("НовыеОЗ"));
	//+Мельников 17.10.24 Заявка 2464
	УстановитьВидимость();
	//-Мельников
КонецПроцедуры

&НаКлиенте
Процедура НовыеОЗВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытиеФормыОтклоненияОЗ(СформироватьСтруктуруТабличныхЧастей("НовыеОЗ"));
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НовыеОЗПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТЧНовыеОЗ(Команда)
	//ЗаполнитьПоОстаткамНовыеОбъектыЗалога(Истина);
	ЗаполнитьПоОстаткамОбъектовЗалога(,,,,,Истина);
	Модифицированность = Истина;
	ОбщееКоличествоОЗВДокументе();
КонецПроцедуры

&НаКлиенте
Процедура ВставкиКамнейНовыеОЗПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВставкиКамнейНовыеОЗВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ТекущийЭлемент.Имя = "Товары" ИЛИ ТекущийЭлемент.Имя = "ВставкиФакт" ИЛИ ТекущийЭлемент.Имя = "ВставкиМеталла" Тогда
		ОткрытьФормуОтклоненияВставки(СформироватьСтруктуруТабличныхЧастей("Товары"));
	ИначеЕсли ТекущийЭлемент.Имя = "НовыеОЗ" ИЛИ ТекущийЭлемент.Имя = "ВставкиКамнейНовыеОЗ" ИЛИ ТекущийЭлемент.Имя = "ВставкиМеталлаНовыеОЗ" Тогда
		ОткрытьФормуОтклоненияВставки(СформироватьСтруктуруТабличныхЧастей("НовыеОЗ"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВставкиМеталлаНовыеОЗПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВставкиМеталлаНовыеОЗВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ТекущийЭлемент.Имя = "Товары" ИЛИ ТекущийЭлемент.Имя = "ВставкиФакт" ИЛИ ТекущийЭлемент.Имя = "ВставкиМеталла" Тогда
		ОткрытьФормуОтклоненияВставкиМеталла(СформироватьСтруктуруТабличныхЧастей("Товары"));
	ИначеЕсли ТекущийЭлемент.Имя = "НовыеОЗ" ИЛИ ТекущийЭлемент.Имя = "ВставкиКамнейНовыеОЗ" ИЛИ ТекущийЭлемент.Имя = "ВставкиМеталлаНовыеОЗ" Тогда
		ОткрытьФормуОтклоненияВставкиМеталла(СформироватьСтруктуруТабличныхЧастей("НовыеОЗ"));
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура НаОХПриАктивизацииСтроки(Элемент)
	НайтиВставки(СформироватьСтруктуруТабличныхЧастей("НаОХ"));
КонецПроцедуры

&НаКлиенте
Процедура НаОХПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВставкиКамнейНаОХПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВставкиМеталлаНаОХПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИзъятыеПриАктивизацииСтроки(Элемент)
	НайтиВставки(СформироватьСтруктуруТабличныхЧастей("Изъятые"));
КонецПроцедуры

&НаКлиенте
Процедура ИзъятыеПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВставкиКамнейИзъятыеПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВставкиМеталлаИзъятыеПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СумкаЗакрытаПриАктивизацииСтроки(Элемент)
	НайтиВставки(СформироватьСтруктуруТабличныхЧастей("СумкаЗакрыта"));
КонецПроцедуры

&НаКлиенте
Процедура СумкаЗакрытаПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВставкиКамнейСумкаЗакрытаПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВставкиМеталлаСумкаЗакрытаПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЛомбардОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	ТекущийЭлемент = Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаКомиссия;
	ТекСтр = "МОЛы"; //СтрЗаменить(ТекущийЭлемент.Имя, "Группа", "");
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДолжность(Сотрудник)
    Возврат Сотрудник.Должность;
КонецФункции

&НаКлиенте
Процедура ИсторияЗалоговогоБилета(Команда)
	ТекСтрока = Элементы[ТекСтр].ТекущиеДанные; //Было: Элементы.Товары.ТекущиеДанные; 
	
	Если НЕ ТекСтрока = неопределено Тогда
		Результат = ПолучитьЗБ(ТекСтрока.ПолучитьИдентификатор(), ТекСтр);
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Клиент", Результат.Залогодатель);
		ПараметрыФормы.Вставить("ЗалоговыйБилет", Результат.ЗБ);	 
								
		ОткрытьФорму("Отчет.ЛБ_ИсторияЗалоговогоБилета.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗБ(Идентификатор, ТЧ) 
	Стр = Объект[ТЧ].НайтиПоИдентификатору(Идентификатор); 
	СтруктураВ = Новый Структура;
	СтруктураВ.Вставить("ЗБ", Стр.ОперацияЗайма);
	СтруктураВ.Вставить("Залогодатель", Стр.ОперацияЗайма.Залогодатель);
	Возврат СтруктураВ;
КонецФункции	

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ТекСтр = СтрЗаменить(ТекущаяСтраница.Имя, "Группа", "");
КонецПроцедуры

//+МАН 21.03.25
&НаКлиенте
Процедура ПроверитьДубли(ТЧ, Столбец, ВыбранноеЗначение)
	Отбор = Новый Структура;
	Отбор.Вставить(Столбец, ВыбранноеЗначение);
	
	НайденныеСтр = Объект[ТЧ].НайтиСтроки(Отбор);
	
	Если НайденныеСтр.Количество() > 0 Тогда
		Объект[ТЧ].Удалить(Объект[ТЧ].Количество() - 1);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФильтрВидыИзделийВидИзделияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	ПроверитьДубли(Элемент.Родитель.Имя, СтрЗаменить(Элемент.Имя, Элемент.Родитель.Имя, ""), ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура ФильтрКатегорииКатегорияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	ПроверитьДубли(Элемент.Родитель.Имя, СтрЗаменить(Элемент.Имя, Элемент.Родитель.Имя, ""), ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПробыПробаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	ПроверитьДубли(Элемент.Родитель.Имя, СтрЗаменить(Элемент.Имя, Элемент.Родитель.Имя, ""), ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура ФильтрКамниВставкаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	ПроверитьДубли(Элемент.Родитель.Имя, СтрЗаменить(Элемент.Имя, Элемент.Родитель.Имя, ""), ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПриемщикиПриемщикОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	ПроверитьДубли(Элемент.Родитель.Имя, СтрЗаменить(Элемент.Имя, Элемент.Родитель.Имя, ""), ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура ФильтрЗалогодателиЗалогодательОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	ПроверитьДубли(Элемент.Родитель.Имя, СтрЗаменить(Элемент.Имя, Элемент.Родитель.Имя, ""), ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура ФильтрСтатусыЗалогодателяСтатусОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	ПроверитьДубли(Элемент.Родитель.Имя, СтрЗаменить(Элемент.Имя, Элемент.Родитель.Имя, ""), ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура ФильтрСтатусыСтатусОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	ПроверитьДубли(Элемент.Родитель.Имя, СтрЗаменить(Элемент.Имя, Элемент.Родитель.Имя, ""), ВыбранноеЗначение);
КонецПроцедуры

//+МАН 27.03.25
&НаКлиенте
Процедура МОЛыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Объект.МОЛы.Количество() = 3 Тогда
		Предупреждение("Достигнуто максимально допустимое количество материально ответственных лиц.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораСотрудникаМОЛ", ЭтаФорма);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("МассивСотрудников", ПолучитьСотрудниковМОЛ());
	
	ОткрытьФорму("Справочник.ЛБ_Сотрудники.Форма.ФормаВыбораСотрудников",ПараметрыФормы,,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧ()
	
	ЕстьПредседатель = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_Инвентаризация.Ссылка КАК Ссылка,
		|	ЛБ_Инвентаризация.ИнвентаризационнаяКомиссия.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		ФизЛицо КАК ФизЛицо,
		|		Председатель КАК Председатель,
		|		Дистанционно КАК Дистанционно,
		|		Должность КАК Должность
		|	) КАК ИнвентаризационнаяКомиссия,
		|	ЛБ_Инвентаризация.МОЛы.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		ФизЛицо КАК ФизЛицо,
		|		Должность КАК Должность
		|	) КАК МОЛы
		|ИЗ
		|	Документ.ЛБ_Инвентаризация КАК ЛБ_Инвентаризация
		|ГДЕ
		|	НЕ ЛБ_Инвентаризация.ПометкаУдаления
		|	И ЛБ_Инвентаризация.Ломбард = &Ломбард
		|	И ЛБ_Инвентаризация.Дата МЕЖДУ &ДатаНач И &ДатаКон";
	
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДатаКон", ТекущаяДата());
	Запрос.УстановитьПараметр("Ломбард", Объект.Ломбард);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		
		ТЗИК = Результат.ИнвентаризационнаяКомиссия.Выгрузить();
		ТЗМОЛ = Результат.МОЛы.Выгрузить();
		
		Объект.ИнвентаризационнаяКомиссия.Загрузить(ТЗИК);
		Объект.МОЛы.Загрузить(ТЗМОЛ);
		
		Для каждого Стр Из ТЗИК Цикл
			Если Стр.Председатель Тогда
				ЕстьПредседатель = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьМОЛ()
	
	Если ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард Тогда
		Сотр = ПараметрыСеанса.ТекущийСотрудник;
	Иначе
		Сотр = Пользователи.ТекущийПользователь().Сотрудник;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ФизЛицо", Сотр); // Пользователи.ТекущийПользователь().Сотрудник);
	
	ЕстьСотрудник = Объект.МОЛы.НайтиСтроки(Отбор);
	Если ЕстьСотрудник.Количество() = 0 Тогда
		СтрМОЛы = Объект.МОЛы.Добавить();
		СтрМОЛы.ФизЛицо = Сотр;
		СтрМОЛы.Должность = Сотр.Должность;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСотрудниковМОЛ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.ЛБ_КадроваяИсторияСотрудников.СрезПоследних(
		|			&Дата,
		|			Подразделение В
		|					(ВЫБРАТЬ
		|						ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард
		|					ИЗ
		|						РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, Отделение В
		|							(ВЫБРАТЬ
		|								ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
		|							ИЗ
		|								РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, Ломбард = &Ломбард) КАК ЛБ_ОтделенияЛомбардовСрезПоследних)) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
		|					ГДЕ
		|						НЕ ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.Закрыт)
		|				И НЕ Сотрудник.ПометкаУдаления) КАК ЛБ_КадроваяИсторияСотрудниковСрезПоследних
		|ГДЕ
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыКадровыхСобытий.Увольнение)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник.Наименование";
	
	Запрос.УстановитьПараметр("Дата", ?(Объект.Дата = Дата(1,1,1), ТекущаяДата(), НачалоДня(Объект.Дата)));
	Запрос.УстановитьПараметр("Ломбард", Объект.Ломбард);
	
	//Возврат Запрос.Выполнить().Выгрузить();
	Результат = Запрос.Выполнить().Выгрузить();
	
	МассивВозврата = Новый Массив;
	
	Для каждого Стр Из Результат Цикл
		МассивВозврата.Добавить(Стр.Сотрудник);
	КонецЦикла;
	
	Возврат МассивВозврата;
	
КонецФункции

&НаСервере
Процедура ПослеВыбораСотрудникаМОЛ(Результат, ДопПараметры) Экспорт
	
	Отбор = Новый Структура;
	
	Если Результат <> Неопределено Тогда
		Отбор.Вставить("ФизЛицо", Результат);
		
		НайденныеСтроки = Объект.МОЛы.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			Сообщить("Сотрудник уже выбран.");
			
			Отбор.Вставить("ФизЛицо", Справочники.ЛБ_Сотрудники.ПустаяСсылка());
			
			НайденныеСтроки = Объект.МОЛы.НайтиСтроки(Отбор);
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				СтрокаДокумента = НайденныеСтроки[НайденныеСтроки.ВГраница()];
				
				ИндексСтр = Объект.МОЛы.Индекс(СтрокаДокумента);;
				Объект.МОЛы.Удалить(ИндексСтр);
				Возврат;
			КонецЕсли;
		КонецЕсли;			
	КонецЕсли;
	
	Отбор.Вставить("ФизЛицо", Справочники.ЛБ_Сотрудники.ПустаяСсылка());
	
	НайденныеСтроки = Объект.МОЛы.НайтиСтроки(Отбор);

	Если НайденныеСтроки.Количество() > 0 Тогда
		
		СтрокаДокумента = НайденныеСтроки[НайденныеСтроки.ВГраница()];
		
		Если Результат = Неопределено Тогда
			ИндексСтр = Объект.МОЛы.Индекс(СтрокаДокумента);;
			Объект.МОЛы.Удалить(ИндексСтр);
			Возврат;
		КонецЕсли;
		
		СтрокаДокумента.ФизЛицо = Результат;
		СтрокаДокумента.Должность = Результат.Должность;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвентаризационнаяКомиссияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Объект.ИнвентаризационнаяКомиссия.Количество() = 4 Тогда
		Предупреждение("Достигнуто максимально допустимое количество членов инвентаризационной комиссии.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораСотрудникаИК", ЭтаФорма);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("МассивСотрудников", ПолучитьСотрудниковИК());
	
	ОткрытьФорму("Справочник.ЛБ_Сотрудники.Форма.ФормаВыбораСотрудников",ПараметрыФормы,,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораСотрудникаИК(Результат, ДопПараметры) Экспорт
	
	Отбор = Новый Структура;
	
	Если Результат <> Неопределено Тогда
		Отбор.Вставить("ФизЛицо", Результат);
		
		НайденныеСтроки = Объект.ИнвентаризационнаяКомиссия.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			Сообщить("Сотрудник уже выбран.");
			
			Отбор.Вставить("ФизЛицо", Справочники.ЛБ_Сотрудники.ПустаяСсылка());
			
			НайденныеСтроки = Объект.ИнвентаризационнаяКомиссия.НайтиСтроки(Отбор);
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				СтрокаДокумента = НайденныеСтроки[НайденныеСтроки.ВГраница()];
				
				ИндексСтр = Объект.ИнвентаризационнаяКомиссия.Индекс(СтрокаДокумента);;
				Объект.ИнвентаризационнаяКомиссия.Удалить(ИндексСтр);
				Возврат;
			КонецЕсли;
		КонецЕсли;			
	КонецЕсли;
	
	Отбор.Вставить("ФизЛицо", Справочники.ЛБ_Сотрудники.ПустаяСсылка());
	
	НайденныеСтроки = Объект.ИнвентаризационнаяКомиссия.НайтиСтроки(Отбор);

	Если НайденныеСтроки.Количество() > 0 Тогда
		
		СтрокаДокумента = НайденныеСтроки[НайденныеСтроки.ВГраница()];
		
		Если Результат = Неопределено Тогда
			ИндексСтр = Объект.ИнвентаризационнаяКомиссия.Индекс(СтрокаДокумента);;
			Объект.ИнвентаризационнаяКомиссия.Удалить(ИндексСтр);
			Возврат;
		КонецЕсли;
		
		СтрокаДокумента.ФизЛицо = Результат;
		СтрокаДокумента.Должность = Результат.Должность;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСотрудниковИК()
	
	//Ломбарды
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность
		|ИЗ
		|	РегистрСведений.ЛБ_КадроваяИсторияСотрудников.СрезПоследних(
		|			&Дата,
		|			ВЫБОР
		|					КОГДА Подразделение = ЗНАЧЕНИЕ(Справочник.ЛБ_Ломбарды.ЦентральныйОфис)
		|						ТОГДА ИСТИНА
		|					КОГДА Подразделение В
		|							(ВЫБРАТЬ
		|								ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард
		|							ИЗ
		|								РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, Отделение В
		|									(ВЫБРАТЬ
		|										ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
		|									ИЗ
		|										РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, Ломбард = &Ломбард) КАК ЛБ_ОтделенияЛомбардовСрезПоследних)) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
		|							ГДЕ
		|								НЕ ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.Закрыт)
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ
		|				И НЕ Сотрудник.ПометкаУдаления) КАК ЛБ_КадроваяИсторияСотрудниковСрезПоследних
		|ГДЕ
		|	НЕ ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность В
		|				(ВЫБРАТЬ
		|					ЛБ_ДолжностиДляИнвентаризационнойКомиссии.Должность КАК Должность
		|				ИЗ
		|					РегистрСведений.ЛБ_ДолжностиДляИнвентаризационнойКомиссии КАК ЛБ_ДолжностиДляИнвентаризационнойКомиссии)
		|	И ЛБ_КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыКадровыхСобытий.Увольнение)
		|	И ВЫБОР
		|			КОГДА ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяНачальникомОтделения
		|				ТОГДА ИСТИНА
		|			КОГДА ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяЗаместителемНачальникаОтделения
		|				ТОГДА ИСТИНА
		|			КОГДА ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяУправляющимЛомбарда
		|				ТОГДА ИСТИНА
		|			КОГДА ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Подразделение = ЗНАЧЕНИЕ(Справочник.ЛБ_Ломбарды.ЦентральныйОфис)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник.Наименование";
	
	Запрос.УстановитьПараметр("Дата", ?(Объект.Дата = Дата(1,1,1), ТекущаяДата(), НачалоДня(Объект.Дата)));
	Запрос.УстановитьПараметр("Ломбард", Объект.Ломбард);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	МассивВозврата = Новый Массив;
	
	Пока Результат.Следующий() Цикл
		МассивВозврата.Добавить(Результат.Сотрудник);
	КонецЦикла;
	
	Возврат МассивВозврата;
	
КонецФункции

&НаКлиенте
Функция ПроверитьЗаполнениеТЧ()
	
	//ЕстьПредседатель = Объект.ИнвентаризационнаяКомиссия.НайтиСтроки(Новый Структура("Председатель", Истина));
	
	Если Объект.МОЛы.Количество() = 0 Тогда
		Предупреждение("Не заполнены МОЛ. Проведение документа запрещено!");
		Возврат Ложь;
	ИначеЕсли Объект.ИнвентаризационнаяКомиссия.Количество() = 0 Тогда
		Предупреждение("Не заполнены члены комиссии. Проведение документа запрещено!");
		Возврат Ложь;
	ИначеЕсли НЕ ЕстьПредседатель Тогда //.Количество() = 0 Тогда
		Предупреждение("Не выбран председатель комиссии. Проведение документа запрещено!");
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ОтборДатаЗаймаДоОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	Если Элемент.Имя = "ОтборДатаЗаймаОт" Тогда
		Если ВыбранноеЗначение <> Дата(1,1,1) ИЛИ Объект.ОтборДатаЗаймаДо <> Дата(1,1,1) Тогда
			Элементы.ОчиститьДатыЗайма.Доступность = Истина;
		Иначе 
			Элементы.ОчиститьДатыЗайма.Доступность = Ложь;
		КонецЕсли;
	ИначеЕсли Элемент.Имя = "ОтборДатаЗаймаДо" Тогда
		Если ВыбранноеЗначение <> Дата(1,1,1) ИЛИ Объект.ОтборДатаЗаймаОт <> Дата(1,1,1) Тогда
			Элементы.ОчиститьДатыЗайма.Доступность = Истина;
		Иначе 
			Элементы.ОчиститьДатыЗайма.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидИнвентаризацииОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	ТекЗначение = Элемент.ТекстРедактирования;
	НовЗначение = ВыбранноеЗначение;
КонецПроцедуры

&НаКлиенте
Процедура ИнвентаризационнаяКомиссияПредседательПриИзменении(Элемент)
	Если НЕ ЕстьПредседатель Тогда
		ЕстьПредседатель = Истина;
	ИначеЕсли НЕ Элементы.ИнвентаризационнаяКомиссия.ТекущиеДанные.Председатель	И ЕстьПредседатель Тогда
		ЕстьПредседатель = Ложь;
	Иначе
		Предупреждение("Председатель комиссии уже выбран.");
		Элементы.ИнвентаризационнаяКомиссия.ТекущиеДанные.Председатель = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаличиеПредседателя()
	Отбор = Новый Структура;
	Отбор.Вставить("Председатель", Истина);
	
	МассивПредседатель = Объект.ИнвентаризационнаяКомиссия.НайтиСтроки(Отбор);
	
	Если МассивПредседатель.Количество() >= 1 Тогда
		ЕстьПредседатель = Истина;
	Иначе
		ЕстьПредседатель = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСтатусОЗВнакладной(Дата, ОЗ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус КАК Статус,
		|	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.ЛБ_СтатусыОбъектовЗалогаВНакладной.СрезПоследних(&НаДату, ОбъектЗалога = &ОбъектЗалога) КАК ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("НаДату", дата);
	Запрос.УстановитьПараметр("ОбъектЗалога", ОЗ);
	
	Результат = Запрос.Выполнить().Выбрать();

	Если Результат.Следующий() Тогда
		Возврат Результат.Статус;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции	

&НаКлиенте
Процедура ОбщееКоличествоОЗВДокументе()
	ОбщееКоличество = Объект.Товары.Количество() + Объект.НовыеОЗ.Количество()
	+ Объект.НаОХ.Количество() + Объект.Изъятые.Количество() + Объект.СумкаЗакрыта.Количество();
	
	Элементы.ТоварыКнопкаОбщееКоличество.Заголовок = "Всего объектов залога " + ОбщееКоличество;
КонецПроцедуры

&НаСервере
Функция ПолучитьВставкуКамняПоОЗ(ОЗ, ТЧ, Док)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_Инвентаризация111.ВидВставки КАК ВидВставки,
		|	ЛБ_Инвентаризация111.ФормаОгранки КАК ФормаОгранки,
		|	ЛБ_Инвентаризация111.Длина КАК Длина,
		|	ЛБ_Инвентаризация111.Ширина КАК Ширина,
		|	ЛБ_Инвентаризация111.ГруппаЦвета КАК ГруппаЦвета,
		|	ЛБ_Инвентаризация111.ГруппаКачества КАК ГруппаКачества,
		|	ЛБ_Инвентаризация111.КачествоОгранки КАК КачествоОгранки,
		|	ЛБ_Инвентаризация111.Количество КАК Количество,
		|	ЛБ_Инвентаризация111.Вес КАК Вес,
		|	ЛБ_Инвентаризация111.Вид КАК Вид,
		|	ЛБ_Инвентаризация111.Диаметр КАК Диаметр,
		|	ЛБ_Инвентаризация111.Диаметр1 КАК Диаметр1,
		|	ЛБ_Инвентаризация111.Диаметр2 КАК Диаметр2,
		|	ЛБ_Инвентаризация111.Высота КАК Высота,
		|	ЛБ_Инвентаризация111.ВесГраммы КАК ВесГраммы,
		|	ЛБ_Инвентаризация111.ВидОгранки КАК ВидОгранки,
		|	ЛБ_Инвентаризация111.ФормаОгранкиФакт КАК ФормаОгранкиФакт,
		|	ЛБ_Инвентаризация111.ДлинаФакт КАК ДлинаФакт,
		|	ЛБ_Инвентаризация111.ШиринаФакт КАК ШиринаФакт,
		|	ЛБ_Инвентаризация111.ГруппаЦветаФакт КАК ГруппаЦветаФакт,
		|	ЛБ_Инвентаризация111.ГруппаКачестваФакт КАК ГруппаКачестваФакт,
		|	ЛБ_Инвентаризация111.КачествоОгранкиФакт КАК КачествоОгранкиФакт,
		|	ЛБ_Инвентаризация111.КоличествоФакт КАК КоличествоФакт,
		|	ЛБ_Инвентаризация111.ВесФакт КАК ВесФакт,
		|	ЛБ_Инвентаризация111.ВидФакт КАК ВидФакт,
		|	ЛБ_Инвентаризация111.ДиаметрФакт КАК ДиаметрФакт,
		|	ЛБ_Инвентаризация111.Диаметр1Факт КАК Диаметр1Факт,
		|	ЛБ_Инвентаризация111.Диаметр2Факт КАК Диаметр2Факт,
		|	ЛБ_Инвентаризация111.ВысотаФакт КАК ВысотаФакт,
		|	ЛБ_Инвентаризация111.ВесГраммыФакт КАК ВесГраммыФакт,
		|	ЛБ_Инвентаризация111.ВидОгранкиФакт КАК ВидОгранкиФакт,
		|	ЛБ_Инвентаризация111.ВидВставкиФакт КАК ВидВставкиФакт
		|ИЗ
		|	Документ.ЛБ_Инвентаризация.111 КАК ЛБ_Инвентаризация111
		|ГДЕ
		|	ЛБ_Инвентаризация111.ОбъектЗалога = &ОЗ
		|	И ЛБ_Инвентаризация111.Ссылка = &Док";
		//|	И ЛБ_Инвентаризация111.ВидВставки = ЗНАЧЕНИЕ(Справочник.ЛБ_ДрагоценныеКамни.Бриллиант)";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "111", ТЧ.ВставкаК);
	
	Запрос.УстановитьПараметр("ОЗ", ОЗ);
	Запрос.УстановитьПараметр("Док", Док);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() > 0 Тогда
		Возврат Результат;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

//lion+++ 18.08.2025
&НаСервереБезКонтекста
Функция получитьСписокОтвественныхЗБ(Ломбард)
	Запрос = Новый Запрос;
	//Вариант когда отбираются ответственные по одному выбранному ломбарду в документе инвентаризация
	//Запрос.Текст = 
	//	"ВЫБРАТЬ РАЗЛИЧНЫЕ Ответственный из Документ.ЛБ_ОперацияПоЗалогу 
	//	| ГДЕ Ломбард в()
	//	| УПОРЯДОЧИТЬ ПО Ответственный
	//	| ";
	
	//Выбирается отдел по ломбарду из документа инвентаризация, по отделению ломбарда выбираются все ломбарды и по ним отвественные из ЗБ 
	Запрос.Текст = 
		"
		|ВЫБРАТЬ РАЗЛИЧНЫЕ ОтветственныйСотрудник из Документ.ЛБ_ОперацияПоЗалогу 
		| ГДЕ Ломбард в (
		 
		| выбрать Различные Ломбард  из РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(,Отделение в(Выбрать Первые 1 Отделение из РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(,Ломбард=&Ломбард)))
		 
		| )
		| УПОРЯДОЧИТЬ ПО ОтветственныйСотрудник
		| ";
		 
	Запрос.Параметры.Вставить("Ломбард",Ломбард);
	РезультатЗапроса = Запрос.Выполнить();
	СписокОтвественных = Новый СписокЗначений;
	СписокОтвественных.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ОтветственныйСотрудник"));
    Возврат СписокОтвественных;
КонецФункции
	
&НаКлиенте
Процедура ФильтрПриемщикиПриемщикНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СписокОтвественныхЗБ=получитьСписокОтвественныхЗБ(Объект.Ломбард);
	СтандартнаяОбработка=Ложь;
	ДанныеВыбора=СписокОтвественныхЗБ.ВыбратьЭлемент("Ответственные");
	//Объект.ФильтрПриемщики.
	//Элемент.СписокВыбора.ЗагрузитьЗначения(СписокОтвественныхЗБ);
	Если ДанныеВыбора<>Неопределено тогда
		Элементы.ФильтрПриемщики.текущиеданные.Приемщик=ДанныеВыбора.Значение;
	КонецЕсли;
КонецПроцедуры
//lion--- 18.08.2025

&НаСервере
Процедура ЗаполнитьСписокВыбораКамней()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ДрагоценныеКамни.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЛБ_ДрагоценныеКамни КАК ЛБ_ДрагоценныеКамни
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_ДрагоценныеКамни.Наименование";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	МассивКамней = Новый Массив;
	
	Для каждого Стр Из РезультатЗапроса Цикл
		МассивКамней.Добавить(Стр.Ссылка);
	КонецЦикла;
	
	Если МассивКамней.Количество() > 0 Тогда
		Элементы.ФильтрКамниВставка.СписокВыбора.ЗагрузитьЗначения(МассивКамней);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораЗалогодателей()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СтатусыЗалогодателей.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЛБ_СтатусыЗалогодателей КАК ЛБ_СтатусыЗалогодателей
		|ГДЕ
		|	НЕ ЛБ_СтатусыЗалогодателей.ЭтоГруппа
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_СтатусыЗалогодателей.Наименование";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	МассивС = Новый Массив;
	
	Для каждого Стр Из РезультатЗапроса Цикл
		МассивС.Добавить(Стр.Ссылка);
	КонецЦикла;
	
	Если МассивС.Количество() > 0 Тогда
		Элементы.ФильтрСтатусыЗалогодателяСтатус.СписокВыбора.ЗагрузитьЗначения(МассивС);
	КонецЕсли;
	
КонецПроцедуры

//+МАН 17.12.25
&НаСервере
Функция ЗаполнитьСписокВыбораСкладов(Ломбард)

	МассивСкладов = Новый Массив;
	
	Если ЗначениеЗаполнено(Ломбард) И ТипЗнч(Ломбард) = Тип("СправочникСсылка.ЛБ_Ломбарды") Тогда
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_Склады.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.ЛБ_Склады КАК ЛБ_Склады
		               |ГДЕ
		               |	ЛБ_Склады.Владелец = &Владелец
		               |	И НЕ (ЛБ_Склады.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыСкладов.ОтходыДМ)
		               |			ИЛИ ЛБ_Склады.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыСкладов.ОтходыДМЦО)
		               |			ИЛИ ЛБ_Склады.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыСкладов.ОтходыДМОбщий))";
		Запрос.УстановитьПараметр("Владелец", Ломбард);

		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			МассивСкладов.Добавить(Выборка.Ссылка);
		Конеццикла;
	КонецЕсли;
	
	Возврат МассивСкладов;
КонецФункции

&НаСервере
Процедура ЗаполнитьСклады(НовыйДокумент = Ложь)
	Если ЗначениеЗаполнено(Объект.Ломбард) Тогда
		Склады = ЗаполнитьСписокВыбораСкладов(Объект.Ломбард);
		
		Если Склады.Количество() > 1 Тогда
			Элементы.Склад.СписокВыбора.Очистить();
			Элементы.Склад.СписокВыбора.ЗагрузитьЗначения(Склады);

			Если НовыйДокумент Тогда
				Объект.Склад = Справочники.ЛБ_Склады.ПустаяСсылка();
			КонецЕсли;
		ИначеЕсли Склады.Количество() = 1 Тогда
			Элементы.Склад.СписокВыбора.Очистить();
			Элементы.Склад.СписокВыбора.Добавить(Склады[0]);
			
			Если НовыйДокумент Тогда
				Объект.Склад = Склады[0];
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СкладОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	Если СтрНайти(ВыбранноеЗначение, "Витрина") > 0 Тогда
		Элементы.ТипИнвентаризации.СписокВыбора.Очистить();
		Элементы.ТипИнвентаризации.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ЛБ_ТипИнвентаризации.Инвентаризация"));
	Иначе
		Элементы.ТипИнвентаризации.СписокВыбора.Очистить();
		Элементы.ТипИнвентаризации.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ЛБ_ТипИнвентаризации.Инвентаризация"));
		Элементы.ТипИнвентаризации.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ЛБ_ТипИнвентаризации.КонтрольнаяПроверка"));
	КонецЕсли;
	
	Объект.ТипИнвентаризации = ПредопределенноеЗначение("Перечисление.ЛБ_ТипИнвентаризации.ПустаяСсылка");
	Объект.ВидИнвентаризации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидИнвентаризации.ПустаяСсылка");
	
	УстановитьВидимость(ВыбранноеЗначение);
	ТекущийЭлемент = Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаКомиссия;
	ТекСтр = "МОЛы";
	
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СкладНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Склад) Тогда
		Если Объект.Товары.Количество() > 0 ИЛИ Объект.НаОХ.Количество() > 0 ИЛИ Объект.Изъятые.Количество() > 0 ИЛИ Объект.СумкаЗакрыта.Количество() > 0
			ИЛИ Объект.НовыеОЗ.Количество() > 0 Тогда
			
			Ответ = Вопрос("При изменении склада очистятся все списки с объектами залога.
			|Изменить склад?", РежимДиалогаВопрос.ДаНет);
			
			Если Ответ = КодВозвратаДиалога.Да Тогда
				Объект.Товары.Очистить();
				Объект.ВставкиФакт.Очистить();
				Объект.ВставкиМеталла.Очистить();
				Объект.НовыеОЗ.Очистить();
				Объект.ВставкиКамнейНовыеОЗ.Очистить();
				Объект.ВставкиМеталлаНовыеОЗ.Очистить();
				Объект.НаОХ.Очистить();
				Объект.ВставкиКамнейНаОХ.Очистить();
				Объект.ВставкиМеталлаНаОХ.Очистить();
				Объект.Изъятые.Очистить();
				Объект.ВставкиКамнейИзъятые.Очистить();
				Объект.ВставкиМеталлаИзъятые.Очистить();
				Объект.СумкаЗакрыта.Очистить();
				Объект.ВставкиКамнейСумкаЗакрыта.Очистить();
				Объект.ВставкиМеталлаСумкаЗакрыта.Очистить();
			Иначе
				СтандартнаяОбработка = Ложь;
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЛомбардПриИзменении(Элемент)
	ЗаполнитьСклады(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьДокумента(Команда)
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_Инвентаризация");

		ПараметрыПечати = Новый Структура;

		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(Объект.Ссылка);
		
	Если НЕ Модифицированность Тогда
		Если СтрНайти(Команда.Имя, "ИНВ8") > 0 Тогда
			Если СтрНайти(Команда.Имя, "Черновик") > 0 Тогда
				ПараметрыФормы.Вставить("ИменаМакетов", "ИНВ8Черновик");
				//ПараметрыПечати.Вставить("ЗаголовокФормы", "Инвентаризация ОЗ " + Объект.Номер + " от " + Объект.Дата);		
				ПараметрыПечати.Вставить("ЗаголовокФормы", "ИНВ-8 Акт инвентаризации ДМ и изделий из них (черновик)");		
			ИначеЕсли СтрНайти(Команда.Имя, "Пустой") > 0 Тогда
				ПараметрыФормы.Вставить("ИменаМакетов", "ИНВ8Пустая");
				ПараметрыПечати.Вставить("ЗаголовокФормы", "ИНВ-8 Акт инвентаризации ДМ и изделий из них (пустой)");		
			Иначе
				ПараметрыФормы.Вставить("ИменаМакетов", "ИНВ8");
				ПараметрыПечати.Вставить("ЗаголовокФормы", "ИНВ-8 Акт инвентаризации ДМ и изделий из них");		
			КонецЕсли;
		ИначеЕсли СтрНайти(Команда.Имя, "ИНВ5") > 0 Тогда
			Если СтрНайти(Команда.Имя, "Пустой") > 0 Тогда
				ПараметрыФормы.Вставить("ИменаМакетов", "ИНВ5Пустая");
				ПараметрыПечати.Вставить("ЗаголовокФормы", "ИНВ-5 Акт инвентаризации ДМ на ОХ (пустой)");		
			Иначе
				ПараметрыФормы.Вставить("ИменаМакетов", "ИНВ5");
				ПараметрыПечати.Вставить("ЗаголовокФормы", "ИНВ-5 Акт инвентаризации ДМ на ОХ");		
			КонецЕсли;
		ИначеЕсли СтрНайти(Команда.Имя, "ИНВ19") > 0 Тогда
			Если СтрНайти(Команда.Имя, "Полная") > 0 Тогда
				ПараметрыФормы.Вставить("ИменаМакетов", "ИНВ19Полная");
				ПараметрыПечати.Вставить("ЗаголовокФормы", "ИНВ-19 Сличительная ведомость итогов инвентаризации (полная)");		
			ИначеЕсли СтрНайти(Команда.Имя, "Новые") > 0 Тогда
				ПараметрыФормы.Вставить("ИменаМакетов", "ИНВ19Новое");
				ПараметрыПечати.Вставить("ЗаголовокФормы", "ИНВ-19 Сличительная ведомость итогов инвентаризации (новые)");		
			Иначе
				ПараметрыФормы.Вставить("ИменаМакетов", "ИНВ19Недостача");
				ПараметрыПечати.Вставить("ЗаголовокФормы", "ИНВ-19 Сличительная ведомость итогов инвентаризации (недостача)");		
			КонецЕсли;
		ИначеЕсли СтрНайти(Команда.Имя, "АктПроверкиДокументов") > 0 Тогда
			ПараметрыФормы.Вставить("ИменаМакетов", "Изъятые");
			ПараметрыПечати.Вставить("ЗаголовокФормы", "Акт проверки документов, подтверждающих изъятие");		
		ИначеЕсли СтрНайти(Команда.Имя, "ОписьПосылок") > 0 Тогда
			ПараметрыФормы.Вставить("ИменаМакетов", "Посылки");
			ПараметрыПечати.Вставить("ЗаголовокФормы", "ИНВ-19 Опись не распакованных посылок с ценностями");		
		ИначеЕсли СтрНайти(Команда.Имя, "ОписьПоступивших") > 0 Тогда
			ПараметрыФормы.Вставить("ИменаМакетов", "ОписьПоступивших");
			ПараметрыПечати.Вставить("ЗаголовокФормы", "Опись ценностей, поступивших во время инвентаризации");		
		ИначеЕсли СтрНайти(Команда.Имя, "ОписьВыбывших") > 0 Тогда
			ПараметрыФормы.Вставить("ИменаМакетов", "ОписьВыбывших");
			ПараметрыПечати.Вставить("ЗаголовокФормы", "Опись ценностей, выбывших во время инвентаризации");		
		ИначеЕсли СтрНайти(Команда.Имя, "АктПроверкиОЗ") > 0 Тогда
			ПараметрыФормы.Вставить("ИменаМакетов", "АктПроверки");
			ПараметрыПечати.Вставить("ЗаголовокФормы", "Акт проверки предметов залога");		
		КонецЕсли;
	Иначе
		Сообщить("Были внесены изменения. Необходимо записать документ!");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
	ПараметрыФормы.Вставить("ПараметрыПечати", ПараметрыПечати);
	
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,);   
КонецПроцедуры
//-МАН

//++ИВВ 02.2026, вычеты для часов
&НаСервере
Процедура ОбновитьПредставлениеВидВставки()
	
	//Для Каждого Стр Из Объект.ВставкиФакт Цикл
	//	Если ЗначениеЗаполнено(Стр.РазмерСкидки) Тогда
	//		Стр.РазмерСкидкиПредставление = Строка(Стр.РазмерСкидки) + "%";
	//	КонецЕсли;
	//КонецЦикла;	

КонецПроцедуры

&НаКлиенте
Процедура ВставкиФактПриИзменении(Элемент)
	
	//ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	//Если ТекущиеДанные <> Неопределено Тогда
	//	Если ЗначениеЗаполнено(ТекущиеДанные.РазмерСкидки) Тогда
	//		ТекущиеДанные.РазмерСкидкиПредставление = Строка(ТекущиеДанные.РазмерСкидки) + "%";
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры
//--ИВВ




