
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Форма") Тогда
		Если Параметры.Форма = "Документ" Тогда
			Список.ТекстЗапроса = "ВЫБРАТЬ
			                      |	ЛБ_ОтходыДМВПутиОстатки.ЛомбардОтправитель КАК ЛомбардОтправитель,
			                      |	ЛБ_ОтходыДМВПутиОстатки.СкладОтправитель КАК СкладОтправитель,
			                      |	ЛБ_ОтходыДМВПутиОстатки.ЛомбардПолучатель КАК ЛомбардПолучатель,
			                      |	ЛБ_ОтходыДМВПутиОстатки.СкладПолучатель КАК СкладПолучатель,
			                      |	ЛБ_ОтходыДМВПутиОстатки.ВесНеттоОстаток КАК ВесНеттоОстаток,
			                      |	ЛБ_ОтходыДМВПутиОстатки.ДокументПеремещения КАК ДокументПеремещения,
			                      |	ЛБ_ОтходыДМВПутиОстатки.ДокументПеремещения.Дата КАК ДокументПеремещенияДата,
			                      |	ЛБ_ОтходыДМВПутиОстатки.ДокументПеремещения.НомерНакладной КАК ДокументПеремещенияНомерНакладной,
			                      |	ЛБ_ОтходыДМВПутиОстатки.ДокументПеремещения.Ответственный КАК ДокументПеремещенияОтветственный,
			                      |	ЛБ_ОтходыДМВПутиОстатки.ДокументПеремещения.Комментарий КАК ДокументПеремещенияКомментарий
			                      |ИЗ
			                      |	РегистрНакопления.ЛБ_ОтходыДМВПути.Остатки(
			                      |			,
			                      |			ЛомбардОтправитель = &ЛомбардОправитель
			                      |				И СкладОтправитель = &СкладОтправитель
			                      |				И ЛомбардПолучатель = &ЛомбардПолучатель
			                      |				И СкладПолучатель = &СкладПолучатель) КАК ЛБ_ОтходыДМВПутиОстатки";
			
			Список.Параметры.УстановитьЗначениеПараметра("ЛомбардОправитель", Параметры.ЛомбардОтправитель);
			Список.Параметры.УстановитьЗначениеПараметра("ЛомбардПолучатель", Параметры.ЛомбардПолучатель);
			Список.Параметры.УстановитьЗначениеПараметра("СкладОтправитель", Параметры.СкладОтправитель);
			Список.Параметры.УстановитьЗначениеПараметра("СкладПолучатель", Параметры.СкладПолучатель);
			
			ЭтаФорма.Заголовок = "Выбор документа перемещения";
		КонецЕсли;
		
		Если Параметры.Форма = "Журнал" Тогда
			Если Параметры.Свойство("Ломбард") Тогда
				Список.ТекстЗапроса = "ВЫБРАТЬ
									|	ЛБ_ОтходыДМВПутиОстатки.ЛомбардОтправитель КАК ЛомбардОтправитель,
									|	ЛБ_ОтходыДМВПутиОстатки.СкладОтправитель КАК СкладОтправитель,
									|	ЛБ_ОтходыДМВПутиОстатки.ЛомбардПолучатель КАК ЛомбардПолучатель,
									|	ЛБ_ОтходыДМВПутиОстатки.СкладПолучатель КАК СкладПолучатель,
									|	ЛБ_ОтходыДМВПутиОстатки.ВесНеттоОстаток КАК ВесНеттоОстаток,
									|	ЛБ_ОтходыДМВПутиОстатки.ДокументПеремещения КАК ДокументПеремещения,
									|	ЛБ_ОтходыДМВПутиОстатки.ДокументПеремещения.Дата КАК ДокументПеремещенияДата,
									|	ЛБ_ОтходыДМВПутиОстатки.ДокументПеремещения.НомерНакладной КАК ДокументПеремещенияНомерНакладной,
									|	ЛБ_ОтходыДМВПутиОстатки.ДокументПеремещения.Ответственный КАК ДокументПеремещенияОтветственный,
									|	ЛБ_ОтходыДМВПутиОстатки.ДокументПеремещения.Комментарий КАК ДокументПеремещенияКомментарий
									|ИЗ
									|	РегистрНакопления.ЛБ_ОтходыДМВПути.Остатки(
									|			,
									|			ЛомбардОтправитель В (&Ломбард)
									|				ИЛИ ЛомбардПолучатель В (&Ломбард)) КАК ЛБ_ОтходыДМВПутиОстатки";
				
				Список.Параметры.УстановитьЗначениеПараметра("Ломбард", Параметры.Ломбард);
			Иначе
				Список.ТекстЗапроса = "ВЫБРАТЬ
									|	ЛБ_ОтходыДМВПутиОстатки.ЛомбардОтправитель КАК ЛомбардОтправитель,
									|	ЛБ_ОтходыДМВПутиОстатки.СкладОтправитель КАК СкладОтправитель,
									|	ЛБ_ОтходыДМВПутиОстатки.ЛомбардПолучатель КАК ЛомбардПолучатель,
									|	ЛБ_ОтходыДМВПутиОстатки.СкладПолучатель КАК СкладПолучатель,
									|	ЛБ_ОтходыДМВПутиОстатки.ВесНеттоОстаток КАК ВесНеттоОстаток,
									|	ЛБ_ОтходыДМВПутиОстатки.ДокументПеремещения КАК ДокументПеремещения,
									|	ЛБ_ОтходыДМВПутиОстатки.ДокументПеремещения.Дата КАК ДокументПеремещенияДата,
									|	ЛБ_ОтходыДМВПутиОстатки.ДокументПеремещения.НомерНакладной КАК ДокументПеремещенияНомерНакладной,
									|	ЛБ_ОтходыДМВПутиОстатки.ДокументПеремещения.Ответственный КАК ДокументПеремещенияОтветственный,
									|	ЛБ_ОтходыДМВПутиОстатки.ДокументПеремещения.Комментарий КАК ДокументПеремещенияКомментарий
									|ИЗ
									|	РегистрНакопления.ЛБ_ОтходыДМВПути.Остатки(, ) КАК ЛБ_ОтходыДМВПутиОстатки";
			КонецЕсли;
			
			ЭтаФорма.Заголовок = "Просмотр перемещений в пути";
			Элементы.Выбрать.Видимость = Ложь;
			Элементы.Выбрать.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	ТекСтр = Элементы.Список.ТекущиеДанные;
	ЭтаФорма.Закрыть(ТекСтр.ДокументПеремещения);
КонецПроцедуры


