
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Отделение") Тогда                                         
		Список.Параметры.УстановитьЗначениеПараметра("Отделение", Параметры.Отделение); 
		Список.Параметры.УстановитьЗначениеПараметра("ВыборОтделение", Истина); 
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ВыборОтделение", Ложь);
	КонецЕсли;	    
	Если Параметры.Свойство("ТекДата") Тогда 
		Список.Параметры.УстановитьЗначениеПараметра("ТекДата", НачалоДня(Параметры.ТекДата));
	Иначе	
	    Список.Параметры.УстановитьЗначениеПараметра("ТекДата", НачалоДня(ТекущаяДата())); 
	КонецЕсли;	
	Список.Параметры.УстановитьЗначениеПараметра("ПустаяДата", Дата(1,1,1));
КонецПроцедуры
