
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)    
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	УстановитьВидимость();
КонецПроцедуры    

&НаСервере
Процедура УстановитьВидимость()
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыКорректировкиНакладной.ИсключениеЗБИзНакладной тогда 
		Элементы.ЗалоговыеБилетыОснованиеБлокировки.Видимость = Ложь;  
		Элементы.ЗалоговыеБилетыОтменитьБлокировку.Видимость = Ложь;
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыКорректировкиНакладной.БлокировкаВключенияЗБВНакладные тогда
		Элементы.ЗалоговыеБилетыНакладнаяНаОтгрузку.Видимость = Ложь;  
		Элементы.ЗалоговыеБилетыЗаблокировать.Видимость = Ложь; 
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыКорректировкиНакладной.ОтменаОтгрузкиНакладных ИЛИ
		      Объект.ВидОперации = Перечисления.ЛБ_ВидыКорректировкиНакладной.ОтгрузкаНакладных тогда
		Элементы.ЗалоговыеБилетыЗаблокировать.Видимость = Ложь;
		Элементы.ЗалоговыеБилетыДатаБлокировки.Видимость = Ложь;
		Элементы.ЗалоговыеБилетыОснованиеБлокировки.Видимость = Ложь;	
		Элементы.ЗалоговыеБилетыОтменитьБлокировку.Видимость = Ложь;
	КонецЕсли;	 
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыКорректировкиНакладной.ОтгрузкаНакладных тогда 
		Элементы.Инкассатор.Видимость = Истина;
		Элементы.Получатель.Видимость = Истина;   
		Элементы.СкладПолучатель.Видимость = Истина;
		Элементы.Ломбард.Видимость = Истина; 
		Элементы.ЗалоговыеБилетыЛомбард.Видимость = Ложь;
    КонецЕсли;
КонецПроцедуры	

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры   
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Функция ПолучитьЗаемщика(ЗБ) 
	Возврат ЗБ.Залогодатель;
КонецФункции

&НаКлиенте
Процедура ЗалогиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтрока = Элементы.ЗалоговыеБилеты.ТекущиеДанные;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Клиент", ТекСтрока.Залогодатель);
	ПараметрыФормы.Вставить("ЗалоговыйБилет", ПолучитьЗаемщика(ТекСтрока.ЗалоговыйБилет));	 
							
	ОткрытьФорму("Отчет.ЛБ_ИсторияЗалоговогоБилета.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

