
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ТекПользователь = ПараметрыСеанса.ТекущийПользователь;  
	Если УправлениеДоступом.ЕстьРоль("ЛБ_Суперпользователь") Тогда 
		ЭтоСуперпользователь = Истина;
	КонецЕсли;
	Если ТекПользователь.ЭтоЛомбард Тогда 
		ОбщегоНазначения.СообщитьПользователю("Документ «Установка скидки» доступен только сотрудникам ЦО.");
		Отказ = Истина; 
	ИначеЕсли НЕ УправлениеДоступом.ЕстьРоль("ЛБ_СотрудникЦО") И НЕ ЭтоСуперпользователь Тогда
		ОбщегоНазначения.СообщитьПользователю("Документ «Установка скидки» доступен только сотрудникам ЦО.");
		Отказ = Истина; 
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Ответственный = ТекПользователь; 
		Объект.Дата = ТекущаяДатаСеанса(); 
		Если НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		    ЗаполнитьТаблицу(); 
		КонецЕсли;	
	КонецЕсли;      
	ЗаполнитьСписокЛомбардов();
	УстановитьСостояниеДокумента();
	ПроверитьРеализацияОптДоступна();
	
	Если Объект.Проведен Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;  
		Элементы.СписокЛомбардов.ТолькоПросмотр = Истина;
	КонецЕсли;	

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);

КонецПроцедуры    

&НаСервере
Процедура ПроверитьРеализацияОптДоступна() 
	Если Объект.Ломбарды.Количество() = 0 Тогда
		РеализацияОптДоступна = Истина;
	ИначеЕсли Объект.Ломбарды.Количество() = 1 Тогда
		Если Объект.Ломбарды.Получить(0).Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис Тогда
			РеализацияОптДоступна = Истина;  
		Иначе
			РеализацияОптДоступна = Ложь;
		КонецЕсли;
	Иначе
		РеализацияОптДоступна = Ложь;
	КонецЕсли;
	Если НЕ РеализацияОптДоступна Тогда 
		Отбор = Новый Структура;
		Отбор.Вставить("СкидкаВДокументах", Перечисления.ЛБ_СкидкаВДокументах.РеализацияРозница);
		Строки = Объект.СкидкиВДокументах.НайтиСтроки(Отбор);
		Стр = Строки.Получить(0);
		Если Стр.Использовать Тогда
			Стр.Использовать = Ложь;
			Стр.Скидка = 0;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры	

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры   
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект);
	
КонецПроцедуры          

&НаСервере
Процедура ЗаполнитьТаблицу() 
	Для Каждого ЗначениеП Из Метаданные.Перечисления.ЛБ_СкидкаВДокументах.ЗначенияПеречисления Цикл   
		НоваяСтр = Объект.СкидкиВДокументах.Добавить(); 
		НоваяСтр.Использовать = Истина; 
		НоваяСтр.СкидкаВДокументах = Перечисления.ЛБ_СкидкаВДокументах[ЗначениеП.Имя]; 
		НоваяСтр.Отклонение = Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Относительное;  
		НоваяСтр.УвеличитьУменьшить = Перечисления.ЛБ_УвеличитьУменьшить.Уменьшить;  
		НоваяСтр.ДействуетС = Объект.Дата;
    КонецЦикла; 	 
КонецПроцедуры 	

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)  
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		// проверим заполнение таб. части 
		ЕстьИспользовать = Ложь;
		Для каждого стр Из Объект.СкидкиВДокументах Цикл
			Если стр.Использовать Тогда 
				ЕстьИспользовать = Истина; 
				Прервать;
			КонецЕсли;	
		КонецЦикла;    
		
		Если НЕ ЕстьИспользовать Тогда
			Предупреждение("Не выбраны документы для которых устанавливается скидка.", 60);
            Отказ = Истина;
		Иначе	   
			ЕстьСкидки = Истина;
			ЕстьДействует = Истина;
			Для каждого стр Из Объект.СкидкиВДокументах Цикл  
				Если стр.Использовать Тогда
					Если Стр.Скидка = 0 Тогда 
						Отказ = Истина;
						ЕстьСкидки = ложь;  
					КонецЕсли;
					Если Стр.ДействуетС = Дата(1,1,1) Тогда 
						Отказ = Истина;
						ЕстьДействует = ложь; 
					КонецЕсли;	
				КонецЕсли;	
			Конеццикла;      
			
			Если Отказ Тогда
				ТекстПредупреждения = "Для всех выбранных документов нужно заполнить значение ";
				Если НЕ ЕстьСкидки Тогда   
					ТекстПредупреждения = ТекстПредупреждения + "скидки";  
				КонецЕсли;  
				Если НЕ ЕстьДействует Тогда   
					ТекстПредупреждения = ТекстПредупреждения + ?(НЕ ЕстьСкидки, " и ", "") + "даты с которой действует скидка";  
				КонецЕсли;
				Предупреждение(ТекстПредупреждения, 60);
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СкидкиВДокументахИспользоватьПриИзменении(Элемент)
	ТекСтрока = Элементы.СкидкиВДокументах.ТекущиеДанные;
	Если НЕ ТекСтрока.Использовать Тогда 
		ТекСтрока.Скидка = 0;  
		ТекСтрока.ДействуетС = Дата(1,1,1);
	Иначе   
		ТекСтрока.ДействуетС = Объект.Дата;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СкидкиВДокументахДействуетСПриИзменении(Элемент)
	ТекСтрока = Элементы.СкидкиВДокументах.ТекущиеДанные;
	Если ТекСтрока.ДействуетС < НачалоДня(Объект.Дата) Тогда 
		Предупреждение("Дата начала действия скидки не может быть меньше даты документа!", 60);
		ТекСтрока.ДействуетС = Объект.Дата;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если НЕ ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда 
		Если НЕ НачалоДня(ТекущийОбъект.Дата) = НачалоДня(ТекущаяДатаСеанса()) Тогда
			Если НЕ ЭтоСуперпользователь Тогда 
				 Сообщить("Пользователь имеет право проводить документ только текущей датой. Измените дату документа.", статуссообщения.Важное);
			     Отказ = Истина;
				 Возврат;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛомбардовНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	
	ПараметрыФормы = Новый Структура;    
	ПараметрыФормы.Вставить("Ломбарды", Объект.Ломбарды); 
	ПараметрыФормы.Вставить("ДатаДок", Объект.Дата);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЛомбардов",ЭтаФорма);
	
	ОткрытьФорму("Обработка.ЛБ_ВыборЛомбардовИзСписка.Форма", ПараметрыФормы, Элементы.СписокЛомбардов,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокЛомбардов()
	Результат = "";
	Для каждого Стр Из Объект.Ломбарды Цикл
		Результат = Результат + ?(ПустаяСтрока(Результат), "", "; ") + ?(НЕ ПустаяСтрока(Стр.Ломбард.НаименованиеПолное), СокрЛП(Стр.Ломбард.НаименованиеПолное), СокрЛП(Стр.Ломбард.Наименование));
	КонецЦикла;	
	СписокЛомбардов = Результат;
	Объект.СтрокаЛомбарды = Результат;
КонецПроцедуры	
 
&НаСервере
Процедура ПослеВыбораЛомбардов(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;

	Объект.Ломбарды.Очистить();
	КоличествоВыбрано = Результат.Количество;
	Для сч = 1 По КоличествоВыбрано Цикл
		НоваяСтр = Объект.Ломбарды.Добавить();
		НоваяСтр.Ломбард = Результат["Значение" + Строка(сч)];
	КонецЦикла;	
	
	ЗаполнитьСписокЛомбардов();
	ПроверитьРеализацияОптДоступна();
КонецПроцедуры

&НаКлиенте
Процедура СписокЛомбардовОчистка(Элемент, СтандартнаяОбработка)
	Объект.Ломбарды.Очистить();
	СписокЛомбардов = "";
	Объект.СтрокаЛомбарды = "";  
	ПроверитьРеализацияОптДоступна();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьСостояниеДокумента();    
	
	Если ТекущийОбъект.Проведен Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;  
		Элементы.СписокЛомбардов.ТолькоПросмотр = Истина;
	КонецЕсли;	
КонецПроцедуры
