
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	Если Объект.Ссылка = Справочники.ЛБ_ГруппыЛомбардов.ЛомбардыВнеГрупп Тогда 
		Элементы.Ломбарды.Видимость = Ложь;
	Иначе 
		УстановитьОтборЛомбарды(); 
	КонецЕсли;	
КонецПроцедуры  

&НаСервере
Процедура УстановитьОтборЛомбарды() 
	ЭлементОтбора = Ломбарды.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Группа");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
КонецПроцедуры	

&НаСервере
Процедура ПослеУстановкиВГруппу(Результат, ДопПараметры) Экспорт 
	Ломбарды.Отбор.Элементы.Очистить();
	УстановитьОтборЛомбарды();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВГруппу(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Необходимо сначала записать элемент справочника", Статуссообщения.Информация);
		Возврат;
	КонецЕсли;	

	Параметрыформы = Новый структура;
	ПараметрыФормы.Вставить("Группа", Объект.Ссылка);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеУстановкиВГруппу", ЭтаФорма);
	ОткрытьФорму("Документ.ЛБ_УстановитьЛомбардыВГруппу.ФормаОбъекта", Параметрыформы, ЭтотОбъект,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

