&НаКлиенте
Перем ЗначенияРеквизитовКонтактныеДанные; 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	Дата = ТекущаяДата();
	//+МАН 18.09.25 Закомментировал по проьбе Марии
	//Если Параметры.Свойство("ЗакрыватьПриСохранении") Тогда
	//	ЗакрыватьПриСохранении = Истина; 
	//	Элементы.ФормаКнопкаЗаписать.Видимость = Ложь;
	//Иначе
	//	ЗакрыватьПриСохранении = Ложь; 
	//	Элементы.ФормаКнопкаЗаписать.Видимость = Истина;
	//КонецЕсли;
	//
	Если Параметры.Свойство("ТолькоПечатьАнкеты") Тогда
		ТолькоПечатьАнкеты = Истина;
	КонецЕсли;	
	Если Параметры.Свойство("Залогодатель") Тогда
		Залогодатель = Параметры.Залогодатель;
		Если Параметры.Свойство("Дата") Тогда 
			Дата = Параметры.Дата;
		КонецЕсли;	 
		//заполняем конт. информацию и документы
		ЗаполнитьКонтактнуюИнформацию();
		ЗаполнитьДокументы();  
		ЗаполнитьАнкету();  	
		ЗаполнитьТаблицуДоверенностей();
		ДатаГражданство = ОпределитьДатуГражданство(); 
		Если НЕ ПустаяСтрока(ИсточникПроисхожденияИмуществаИной) Тогда
			ИнойИсточникИмущества = Истина;
		КонецЕсли;	
		Если НЕ ПустаяСтрока(ИсточникПроисхожденияДенежныхСредствИной) Тогда
			ИнойИсточникДС = Истина;
		КонецЕсли;  
		ПроверкаКарточкаЗагружена();
		ПолучитьДатыНачалаОкончанияРаботыСКлиентом();
		ПолучитьДатуПоследнегоОбновленияАнкеты();
		Если АнкетаОбновлена = Дата(1,1,1) Тогда
			Элементы.ДекорацияИзменениеАнкеты.Видимость = Ложь;
		Иначе
			Элементы.ДекорацияИзменениеАнкеты.Заголовок = "Последнее обновление анкеты " + Формат(АнкетаОбновлена, "ДФ=dd.MM.yyyy");
		КонецЕсли;	
		Если Параметры.Свойство("ТолькоПросмотр") Тогда
			Элементы.ФормаКнопкаЗаписатьИЗакрыть.Доступность = ложь; 
			Элементы.ФормаКнопкаЗаписать.Доступность = ложь;
			Элементы.ГруппаФИО.Доступность = ложь;  
			Элементы.ГруппаКомментарий.Доступность = Ложь;
			Элементы.ГруппаКонтактнаяИнформация.Доступность = ложь;
			Элементы.ГруппаАдреса.Доступность = ложь;
			Элементы.ГруппаФИО_Англ.Доступность = ложь;
			Элементы.Гражданство.Доступность = ложь;
			Элементы.ДокументыГруппаДобавить.ТолькоПросмотр = Истина; 
			Элементы.ДокументыГруппаДобавить.Доступность = Ложь;
			Элементы.ГруппаФЛ.Доступность = ложь;  
			Элементы.ГруппаФЛ1.Доступность = ложь;
			Элементы.ГруппаАнкетаДоп.Доступность = ложь;
			//Элементы.ЗалогодательБенефициарныйВладелец.Доступность = Ложь;   
			Элементы.ГруппаВладельцы.Доступность = Ложь; 
			Элементы.ГруппаИПДЛ.Доступность = ложь;
			Элементы.ГруппаДЛПМО_РДПЛ.Доступность = ложь; 
			Элементы.ГруппаОтказ.Доступность = ложь; 
			Элементы.ТаблицаДопСтатусов.ТолькоПросмотр = Истина; 
			Элементы.ТаблицаСлужебныхСтатусов.ТолькоПросмотр = Истина;
			Элементы.ФормаКнопкаРедактировать.Видимость = Истина; 
			Если Параметры.Свойство("НеРедактировать") Тогда
				Элементы.ФормаКнопкаРедактировать.Доступность = Ложь;
				Элементы.ФормаКнопкаИстория.Доступность = Ложь;
			КонецЕсли;     
		КонецЕсли;	
		//+МАН 18.11.25
		СтруктураПроверки = ПроверитьСовпадениеСПеречнями();
		//-МАН
		ПроверитьПоПеречням(); 
		ЗаполнитьДатыПроверкиПеречней();
		ЗаполнитьТаблицуОтказов();  
		СтатусЗалогодателя = ЛБ_УправлениеЛомбардом.ПолучитьТекущийСтатусКлиента(Дата, Залогодатель);
		СогласиеНаСМСРассылку = ЛБ_УправлениеЛомбардом.ПолучитьСогласиеНаСМСРассылки(Дата, Залогодатель);
		//Иванов 06.2025 видимость кнопки ЭДО, согласия, контактные данные 
		Элементы.ЭДО.Доступность = Истина;
		Элементы.ЭДО.ТолькоПросмотр = Ложь;
		
		Элементы.Согласие.Доступность = Истина;
		Элементы.Согласие.ТолькоПросмотр = Ложь;
		
		Элементы.КонтактныеДанные.Доступность = Истина;
		Элементы.КонтактныеДанные.ТолькоПросмотр = Ложь;
		//
	Иначе
		ПричинаИзменения = Справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.НоваяКарточка;
		ТипФизЛица = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
		КатегорииФизЛица = СокрЛП(Перечисления.ЛБ_КатегорииФизЛица.Клиент);
		ХарактерОтношений = "Получение краткосрочного займа под залог ювелирных изделий на потребительские нужды";
		ФинансовоеПоложениеСтабильное = Истина;
		ДеловаяРепутацияПоложительная = Истина;  
		УровеньРиска = "Низкий, отсутствуют критерии повышенного риска"; 
		ЗалогодательБенефициарныйВладелец = Истина; 
		ДатаОформленияАнкеты = ТекущаяДата();   		
		ДатаГражданство = ТекущаяДата(); 
		Элементы.ИсточникПроисхожденияИмуществаИной.РедактированиеТекста = ложь; 
		Элементы.ИсточникПроисхожденияДенежныхСредствИной.РедактированиеТекста = ложь;  
		Элементы.ДекорацияИзменениеАнкеты.Видимость = Ложь;  
		Элементы.ДекорацияОбновленияАнкеты.Видимость = Ложь; 
		ЭтоНовыйКлиент = Истина; 
		СтатусЗалогодателя = Справочники.ЛБ_СтатусыЗалогодателей.Сверхновый;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(Гражданство) Тогда
		Гражданство = Справочники.СтраныМира.Россия;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(ТипФизЛица) Тогда
		ТипФизЛица = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
	КонецЕсли;	
	Если НЕ ДатаРождения = Дата(1,1,1)  Тогда
		ВозрастЗалогодателя = ЛБ_ОбщийМодуль.ВычислитьВозраст(ДатаРождения);
		ОписаниеВ = ЛБ_ОбщегоНазначения.ОписаниеВозраста(ВозрастЗалогодателя);
		Элементы.ДекорацияВозраст.Заголовок = "Возраст " + Строка(ВозрастЗалогодателя) + " " + ОписаниеВ;
	КонецЕсли;		
	Если НЕ ТаблицаДоверенностейПредставитель.Количество() = 0 Тогда
		Элементы.ГруппаЯвляетсяПредставителемКлиентов.Показать();
	КонецЕсли;  
	Если НЕ ТаблицаДоверенностей.Количество() = 0 Тогда
		Элементы.ГруппаДанныеПредставителя.Показать();
	КонецЕсли;
	Если ЯвляетсяИПДЛ Тогда
		Элементы.ГруппаИПДЛРасшифровка.Видимость = Истина;
	КонецЕсли;	
	Если ЯвляетсяДЛПМО_РДПЛ Тогда
		Элементы.ГруппаДЛПМО_РДПЛРасшифровка.Видимость = Истина;
	КонецЕсли;  
	Если НЕ РазрешениеИПДЛ Тогда
		Элементы.ОтветственноеЛицоИПДЛ.Видимость =ложь;
	КонецЕсли;	
	Если НЕ РазрешениеДЛПМО_РДПЛ Тогда
		Элементы.ОтветственноеЛицоДЛПМО_РДПЛ.Видимость =ложь;
	КонецЕсли;	
	Если ЗалогодательБенефициарныйВладелец Тогда
		Элементы.ГруппаБенефициары.Скрыть();
		Элементы.ГруппаБенефициары.Доступность = ложь;
	Иначе	
		Элементы.ГруппаБенефициары.Показать(); 
		Элементы.ГруппаБенефициары.Доступность = Истина;
	КонецЕсли;	    
	Если ОтказОпераций Тогда 
		ОтказОпераций = Ложь;
		ПричинаОтказа = "";
		ДатаОтказа = Дата(1,1,1);
		Элементы.ГруппаПричинаОтказа.Видимость = Ложь;
	КонецЕсли;	
	ПроверитьДействительностьДокументов();
	
	СписокВыбораСтран = ЗаполнитьСписокВыбораСтран();
	Для каждого Эл Из СписокВыбораСтран Цикл
		Элементы.Гражданство.СписокВыбора.Добавить(Эл.Значение);
	КонецЦикла;	
	Элементы.ДекорацияГражданство.Заголовок = " Действует с " + Формат(ДатаГражданство, "ДФ=dd.MM.yyyy");  
	ГражданствоТекущее = Гражданство; 
	ЗаполнитьТаблицуВыбораДопСтатусовКлиента();  
	ЗаполнитьТаблицуВыбораСлужебныхСтатусовКлиента();  
	
	// ++ Сербаев 11.05.2023
	Если Фамилия = "" Тогда
		//Элементы.Имя.РедактированиеТекста       = Ложь;
		//Элементы.Отчество.РедактированиеТекста  = Ложь;
		Элементы.Имя.Доступность                = Ложь;
		Элементы.Отчество.Доступность           = Ложь;
		Элементы.СтраницаКИ.Доступность         = Ложь;
		Элементы.СтраницаАнкета.Доступность     = Ложь;
		Элементы.СтраницаДопСтатусы.Доступность = Ложь;  
		Элементы.СтраницаЗБ.Доступность         = Ложь;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Гражданство) Тогда
		ПоказатьРезиденство();
	КонецЕсли;    
	
	Если НЕ ДатаСмерти = Дата(1,1,1) тогда
		Элементы.ДекорацияИнформацияОСмерти.Заголовок = "Клиент умер. Дата смерти " + Формат(ДатаСмерти, "ДФ=dd.MM.yyyy"); 
		Элементы.ГруппаСтатус.Видимость = Истина;
	Иначе 
		Элементы.ДекорацияИнформацияОСмерти.Заголовок = ""; 
		Элементы.ГруппаСтатус.Видимость = Ложь;
	КонецЕсли;	
	
	Элементы.ТелефонКонтактногоЛица.КнопкаВыбора = Ложь;
	Элементы.ТелефонДополнительный.КнопкаВыбора  = Ложь;
	Элементы.Телефон.КнопкаВыбора                = Ложь; 
	
	//Если Гражданство <> Справочники.СтраныМира.Россия Тогда
	//    Если ПустаяСтрока(Элементы.Фамилия_А) Тогда
	//	    Элементы.Имя_А.Доступность      = Ложь;
	//		Элементы.Отчество_А.Доступность = Ложь;
	//	КонецЕсли;
	//КонецЕсли;
	// -- Сербаев 11.05.2023 
	
	УстановитьСписокПечатныхФорм();  
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	//+МАН 12.03.26 Убрал. Заявка 3654
	////+МАН 17.11.25 Ответственный ломбард изменялся на тот кто отредактировал карточку. Этого не должно быть т.к. это поле фиксирует, то где карточка была создана.
	//ЛомбардСозданияКарточки = Справочники.ЛБ_Ломбарды.ПустаяСсылка();
	//
	//Если ЗначениеЗаполнено(Залогодатель) Тогда
	//	ЛомбардСозданияКарточки = ПроверитьЛомбардСоздания(Залогодатель);
	//КонецЕсли;
	////-МАН
	//-МАН
	
	Если НЕ ТекПользователь.ЭтоЛомбард Тогда
		Ответственный = ТекПользователь;
		//+МАН 12.03.26 Убрал. Заявка 3654
		////+МАН 17.11.25 Добавил проверку
		//Если НЕ ЗначениеЗаполнено(ЛомбардСозданияКарточки) Тогда
			ОтветственныйЛомбард = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();
		//Иначе
		//	ОтветственныйЛомбард = ЛомбардСозданияКарточки;
		//КонецЕсли;
		////-МАН
		//-МАН
	Иначе
		Ответственный = ПараметрыСеанса.ТекущийСотрудник; 
		//+МАН 12.03.26 Убрал. Заявка 3654
		////+МАН 17.11.25 Добавил проверку
		//Если НЕ ЗначениеЗаполнено(ЛомбардСозданияКарточки) Тогда
			ОтветственныйЛомбард = ПараметрыСеанса.ТекущийЛомбард;	//+++ МоисеевЕС 20250526
		//Иначе
		//	ОтветственныйЛомбард = ЛомбардСозданияКарточки;
		//КонецЕсли;
		////-МАН
		//-МАН
	КонецЕсли;  
	
	Если УправлениеДоступом.ЕстьРоль("ЛБ_СотрудникЦО") Тогда
		СотрудникЦО = Истина;
	КонецЕсли;
	
	//++ИВВ 04.2026, ТЗ отзыв на обработку ПДн сотрудником ЦО
	Если СотрудникЦО Тогда
		Элементы.ФормаОтзывСогласияНаОбработкуПД_ЦО.Видимость = Истина;
	КонецЕсли;	
	//--ИВВ
КонецПроцедуры  

&НаСервере
Процедура ПроверкаКарточкаЗагружена()  
	ЗапросК = новый Запрос;  
	ЗапросК.УстановитьПараметр("Залогодатель", Залогодатель);
	ЗапросК.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛБ_КонтактнаяИнформацияЗалогодателей.ПричинаИзменения КАК ПричинаИзменения
	|ИЗ
	|	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей КАК ЛБ_КонтактнаяИнформацияЗалогодателей
	|ГДЕ
	|	ЛБ_КонтактнаяИнформацияЗалогодателей.Залогодатель = &Залогодатель
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛБ_КонтактнаяИнформацияЗалогодателей.Период";
	ВыборкаК = ЗапросК.Выполнить().Выбрать();
	Если ВыборкаК.Следующий() Тогда  
		Если ВыборкаК.ПричинаИзменения = Справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.ЗагрузкаИзДругойБазы тогда 
			КарточкаЗагружена = Истина;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьТаблицуВыбораДопСтатусовКлиента() 		
	Запрос = Новый Запрос;  
	//+Мельников 25.09.24 Отдельная проверка и отметка ВИПа. ВИП. Заявка 2792.
	//Было: Запрос.УстановитьПараметр("Почетный", Справочники.ЛБ_СтатусыЗалогодателей.Почетный);
	МассивСтатусов = Новый Массив;
	//+МАН 20.11.25 Изменил т.к. ни как больше не проверялся статус "Почетный" кроме как по возрасту
	//МассивСтатусов.Добавить(Справочники.ЛБ_СтатусыЗалогодателей.Почетный);
	//-МАН
	МассивСтатусов.Добавить(Справочники.ЛБ_СтатусыЗалогодателей.VIP);
	
	Запрос.УстановитьПараметр("Статусы", МассивСтатусов);
	//-Мельников
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_СтатусыЗалогодателей.Ссылка КАК Статус
	|ИЗ
	|	Справочник.ЛБ_СтатусыЗалогодателей КАК ЛБ_СтатусыЗалогодателей
	|ГДЕ
	|	ЛБ_СтатусыЗалогодателей.ПометкаУдаления = ЛОЖЬ
	|	И ЛБ_СтатусыЗалогодателей.ЭтоГруппа = ЛОЖЬ
	|	И ЛБ_СтатусыЗалогодателей.ДоступенДляВыбораВручную = ИСТИНА
	//+Мельников 25.09.24 Убрал ВИПов из результата запроса. ВИП. Заявка 2792.
	//Было: |	И НЕ ЛБ_СтатусыЗалогодателей.Ссылка = &Почетный
	|	И НЕ ЛБ_СтатусыЗалогодателей.Ссылка В (&Статусы)
	//-Мельников
	|АВТОУПОРЯДОЧИВАНИЕ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	ТаблицаДопСтатусов.Загрузить(ТаблицаЗапроса);   

	//+МАН 20.11.25 Изменил т.к. ни как больше не проверялся статус "Почетный" кроме как по возрасту.
	//Если установить  ЛБ_СтатусыЗалогодателей.ДоступенДляВыбораВручную в положение ИСТИНА тогда отображется двумя строками в истории изменения.
	Новаястр = ТаблицаДопСтатусов.Добавить();
	НоваяСтр.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Почетный;
	НоваяСтр.Используется = Ложь;
	НоваяСтр.ТолькоПросмотр = Истина;
	//-МАН

	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус,
	|	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Используется КАК Используется,
	|	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.СрокДействия КАК СрокДействия,
	|	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(
	|			&Дата,
	|			Залогодатель = &Залогодатель
	|				И Статус = &Статус) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Период УБЫВ";
	Для каждого Стр Из ТаблицаДопСтатусов Цикл 
		Запрос.УстановитьПараметр("Залогодатель", Залогодатель);  
		Запрос.УстановитьПараметр("Дата", Дата); 
		Запрос.УстановитьПараметр("Статус", Стр.Статус);  
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Стр.Используется = Выборка.Используется;
			Если Выборка.Используется Тогда  
				Если ЗначениеЗаполнено(Выборка.СрокДействия) Тогда
					Если Выборка.СрокДействия >= НачалоДня(Этаформа.Дата) Тогда
						Стр.СрокДействия = Выборка.СрокДействия; 
						Стр.Комментарий = Выборка.Комментарий; 
					Иначе
						Стр.Используется = Ложь;
					КонецЕсли;    
				Иначе   
					Если Выборка.статус = ПредопределенноеЗначение("Справочник.ЛБ_СтатусыЗалогодателей.Сотрудник") Тогда
						Стр.Комментарий = ПолучитьСписокСотрудников();
					Иначе	
						Стр.Комментарий = Выборка.Комментарий;
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	   
	
	Если ЛБ_УправлениеЛомбардом.ПроверитьСтатусПочетный(ДатаРождения, Пол) Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("Статус", Справочники.ЛБ_СтатусыЗалогодателей.Почетный);
		СтрокиС = ТаблицаДопСтатусов.НайтиСтроки(Отбор);  
		Если СтрокиС.Количество() = 0 Тогда
			Новаястр = ТаблицаДопСтатусов.Добавить();
			НоваяСтр.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Почетный;
			НоваяСтр.Используется = Истина;   
			НоваяСтр.ТолькоПросмотр = Истина; 
		Иначе    
			СтрС = строкиС.Получить(0); 
			СтрС.Используется = Истина;
		КонецЕсли;	
	//+МАН 20.11.25 Убрал. Проверка на "Почетный" будет выше
	//	//+Мельников 25.09.24 Для красоты отобразим статус без галки "Используется". ВИП. Заявка 2792.
	//	//Было: КонецЕсли;
	//Иначе
	//	Новаястр = ТаблицаДопСтатусов.Добавить();
	//	НоваяСтр.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Почетный;
	//	НоваяСтр.Используется = Ложь;
	//	НоваяСтр.ТолькоПросмотр = Истина;
	//КонецЕсли;
	////-Мельников
	КонецЕсли;
	//-МАН
	
	//+Мельников 25.09.24 Добавляем и проверяем статус ВИП. ВИП. Заявка 2792.
	СтатусВИП = ПроверитьСтатусКлиентаВИП(Дата, Залогодатель); //, Справочники.ЛБ_СтатусыЗалогодателей.VIP);
	Если СтатусВИП.Используется Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("Статус", Справочники.ЛБ_СтатусыЗалогодателей.VIP);
		СтрокиС = ТаблицаДопСтатусов.НайтиСтроки(Отбор);
		Если СтрокиС.Количество() = 0 Тогда
			Новаястр = ТаблицаДопСтатусов.Добавить();
			НоваяСтр.Статус = Справочники.ЛБ_СтатусыЗалогодателей.VIP;
			НоваяСтр.Используется = СтатусВИП.Используется;
			НоваяСтр.СрокДействия = СтатусВИП.СрокДействия;
			НоваяСтр.Комментарий = СтатусВИП.Комментарий;
			НоваяСтр.ТолькоПросмотр = Истина;
		Иначе
			СтрС = строкиС.Получить(0);
			СтрС.Используется = СтатусВИП.Используется;
			СтрС.СрокДействия = СтатусВИП.СрокДействия;
			СтрС.Комментарий = СтатусВИП.Комментарий;
			СтрС.ТолькоПросмотр = Истина;
		КонецЕсли;
	Иначе
		Новаястр = ТаблицаДопСтатусов.Добавить();
		НоваяСтр.Статус = Справочники.ЛБ_СтатусыЗалогодателей.VIP;
		НоваяСтр.Используется = СтатусВИП.Используется;
		НоваяСтр.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ТаблицаДопСтатусов.Сортировать("Статус Возр");
	//-Мельников
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_СоответствиеДокументовИЛьготныхСтатусовСрезПоследних.ВидДокумента КАК ВидДокумента,
	|	ЛБ_СоответствиеДокументовИЛьготныхСтатусовСрезПоследних.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.ЛБ_СоответствиеДокументовИЛьготныхСтатусов.СрезПоследних(&Дата, НеАктуально = ЛОЖЬ) КАК ЛБ_СоответствиеДокументовИЛьготныхСтатусовСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Отбор = Новый структура;
		Отбор.Вставить("ВидДокумента", Выборка.ВидДокумента);
		
		СтрокиД = ДокументыЗалогодателя.НайтиСтроки(Отбор); 
		Если НЕ СтрокиД.Количество() = 0 тогда			
			СтрД = строкиД.Получить(0);  
			Если СтрД.ДокументНеДействителен Тогда
				Продолжить;				
			ИначеЕсли НЕ (СтрД.ДокументСрокДействия = Дата(1,1,1)) Тогда
				Если СтрД.ДокументСрокДействия < НачалоДня(Дата) Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			СтатусЛояльности = ЛБ_УправлениеЛомбардом.ПолучитьСтатусПоСистемеЛояльности(Дата, Выборка.статус);
			Если НЕ СтатусЛояльности = неопределено Тогда 
				Отбор = Новый Структура;
				Отбор.Вставить("Статус", СтатусЛояльности);
				Если ТаблицаДопСтатусов.НайтиСтроки(Отбор).Количество() = 0 Тогда
					Новаястр = ТаблицаДопСтатусов.Добавить();
					НоваяСтр.Статус = СтатусЛояльности;
					НоваяСтр.Используется = Истина; 
					НоваяСтр.ТолькоПросмотр = Истина;
					НоваяСтр.СрокДействия = СтрД.ДокументСрокДействия; 
				Иначе
					//+МАН 31.01.25 Закомментировал. Ранее выставляется статус. Заявка 2792
					//ТаблицаДопСтатусов.Получить(0).Используется = Истина; 
					//-МАН
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
	Конеццикла;	
КонецПроцедуры        

&НаСервере
Процедура ЗаполнитьТаблицуВыбораСлужебныхСтатусовКлиента() 		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СлужебныеСтатусы.Ссылка КАК Статус
	|ИЗ
	|	Справочник.ЛБ_СлужебныеСтатусыКлиентов КАК СлужебныеСтатусы
	|ГДЕ
	|	СлужебныеСтатусы.ПометкаУдаления = ЛОЖЬ
	|АВТОУПОРЯДОЧИВАНИЕ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	ТаблицаСлужебныхСтатусов.Загрузить(ТаблицаЗапроса); 
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_СтатусыЗалогодателейСлужебныеСрезПоследних.Статус КАК Статус,
	|	ЛБ_СтатусыЗалогодателейСлужебныеСрезПоследних.Используется КАК Используется,
	|	ЛБ_СтатусыЗалогодателейСлужебныеСрезПоследних.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.ЛБ_СтатусыЗалогодателейСлужебные.СрезПоследних(
	|			&Дата,
	|			Залогодатель = &Залогодатель
	|				И Статус = &Статус) КАК ЛБ_СтатусыЗалогодателейСлужебныеСрезПоследних";
	Для каждого Стр Из ТаблицаСлужебныхСтатусов Цикл 
		Запрос.УстановитьПараметр("Залогодатель", Залогодатель);  
		Запрос.УстановитьПараметр("Дата", Дата); 
		Запрос.УстановитьПараметр("Статус", Стр.Статус);  
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Стр.Используется = Выборка.Используется;
			Стр.Комментарий = Выборка.Комментарий;
		КонецЕсли;	
	КонецЦикла;	   
	
КонецПроцедуры 

&НаСервере
Процедура ПроверитьСтатусПочетный() 
	ЕстьПочетный = Ложь;
	Отбор = Новый Структура;
	Отбор.Вставить("Статус", Справочники.ЛБ_СтатусыЗалогодателей.Почетный);
	СтрокиС = ТаблицаДопСтатусов.НайтиСтроки(Отбор);
	Если НЕ СтрокиС.Количество() = 0 Тогда
		Если ЛБ_УправлениеЛомбардом.ПроверитьСтатусПочетный(ДатаРождения, Пол) Тогда 
			СтрокиС.Получить(0).Используется = Истина;
			ЕстьПочетный = Истина;
		Иначе
			СтрокиС.Получить(0).Используется = Ложь;
		КонецЕсли; 
	ИначеЕсли ЛБ_УправлениеЛомбардом.ПроверитьСтатусПочетный(ДатаРождения, Пол) Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("Статус", Справочники.ЛБ_СтатусыЗалогодателей.Почетный);
		Если ТаблицаДопСтатусов.НайтиСтроки(Отбор).Количество() = 0 Тогда
			Новаястр = ТаблицаДопСтатусов.Добавить();
			НоваяСтр.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Почетный;
			НоваяСтр.Используется = Истина;  
		Иначе       
			НоваяСтр = ТаблицаДопСтатусов.Получить(0);
			НоваяСтр.Используется = Истина; 
			НоваяСтр.СрокДействия = Дата(1,1,1);
		КонецЕсли;	
		ЕстьПочетный = Истина;
	КонецЕсли;  
	
	Если ЕстьПочетный Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_СоответствиеДокументовИЛьготныхСтатусовСрезПоследних.ВидДокумента КАК ВидДокумента,
	|	ЛБ_СоответствиеДокументовИЛьготныхСтатусовСрезПоследних.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.ЛБ_СоответствиеДокументовИЛьготныхСтатусов.СрезПоследних(&Дата, НеАктуально = ЛОЖЬ) КАК ЛБ_СоответствиеДокументовИЛьготныхСтатусовСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Отбор = Новый структура;
		Отбор.Вставить("ВидДокумента", Выборка.ВидДокумента);
		
		СтрокиД = ДокументыЗалогодателя.НайтиСтроки(Отбор); 
		Для сч = 0 По СтрокиД.Количество()- 1 Цикл			
			СтрД = строкиД.Получить(сч);   
			Если СтрД.ДокументНеДействителен Тогда
				Продолжить;	
			ИначеЕсли НЕ (СтрД.ДокументСрокДействия = Дата(1,1,1)) Тогда
				Если СтрД.ДокументСрокДействия < НачалоДня(Дата) Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			СтатусЛояльности = ЛБ_УправлениеЛомбардом.ПолучитьСтатусПоСистемеЛояльности(Дата, Выборка.статус);
			Если НЕ СтатусЛояльности = неопределено Тогда 
				Отбор = Новый Структура;
				Отбор.Вставить("Статус", СтатусЛояльности);
				СтрокиС = ТаблицаДопСтатусов.НайтиСтроки(Отбор);
				Если СтрокиС.Количество() = 0 Тогда
					Новаястр = ТаблицаДопСтатусов.Добавить();
					НоваяСтр.Статус = СтатусЛояльности;
					НоваяСтр.Используется = Истина; 
					НоваяСтр.ТолькоПросмотр = Истина;
					НоваяСтр.СрокДействия = СтрД.ДокументСрокДействия;				
				Иначе
					СтрС = СтрокиС.Получить(0);  
					СтрС.СрокДействия = ?(СтрД.ДокументСрокДействия = Дата(1,1,1) Или СтрС.СрокДействия < СтрД.ДокументСрокДействия, СтрД.ДокументСрокДействия, СтрС.СрокДействия);
					СтрС.Используется = Истина;
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;
	Конеццикла;	
	
КонецПроцедуры 	

&НаСервере
Процедура ПроверитьПоПеречням()   
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);  
	Запрос.УстановитьПараметр("Дата", Дата); 	
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_КлиентыВПеречняхСрезПоследних.ВидПеречня КАК ВидПеречня,
	|	ЛБ_КлиентыВПеречняхСрезПоследних.СтатусКлиентаВПеречне КАК Статус
	|ИЗ
	|	РегистрСведений.ЛБ_КлиентыВПеречнях.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КлиентыВПеречняхСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛБ_КлиентыВПеречняхСрезПоследних.Период УБЫВ"; 
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	ТаблицаКомплаенсСтатусов.Очистить();
	Отбор = Новый Структура;
	Отбор.Вставить("ВидПеречня", Перечисления.ЛБ_ВидыПеречней.Террористы);
	Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);  
	СтрК = ТаблицаКомплаенсСтатусов.Добавить();  
	СтрК.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.Террористы;
	Если НЕ Строки.Количество() = 0 Тогда
		Выборка = Строки.Получить(0);
		Если Выборка.Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен Тогда 
			ПроверкаПереченьТеррористов = Истина;  
			Элементы.ПроверкаПереченьТеррористов.ЦветТекстаЗаголовка = WebЦвета.Красный;  
			Элементы.ПроверкаПереченьТеррористов.ЦветРамки = WebЦвета.Красный; 
			Элементы.КнопкаТеррористы.Доступность = Истина; 
			СтрК.Статус = "Террорист"; 
			СтрК.Включен = Истина;
			ПроверкаПереченьТеррористов = Истина;
		ИначеЕсли Выборка.Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Исключен Тогда
			СтрК.Статус = "Исключен из перечня террористов"; 
			ПроверкаПереченьТеррористов = ложь;   
			//+МАН 21.10.25 Изменил т.к. с момента добавления кода, 02.09.24, на форме небыло элемента ПереченьТеррористов.
			//Элементы.ПереченьТеррористов.ЦветТекстаЗаголовка = WebЦвета.Черный; 
			//Элементы.ПереченьТеррористов.ЦветРамки = WebЦвета.СветлоСерый; 
			Элементы.ПроверкаПереченьТеррористов.ЦветТекстаЗаголовка = WebЦвета.Черный; 
			Элементы.ПроверкаПереченьТеррористов.ЦветРамки = WebЦвета.СветлоСерый; 
			//-МАН
		КонецЕсли;   
	Иначе
		СтрК.Статус = "Отсутствует в перечне террористов";
		ПроверкаПереченьТеррористов = ложь;
	КонецЕсли;
	
	Отбор.Вставить("ВидПеречня", Перечисления.ЛБ_ВидыПеречней.МВК);
	Строки = ТаблицаЗапроса.НайтиСтроки(Отбор); 
	СтрК = ТаблицаКомплаенсСтатусов.Добавить();  
	СтрК.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.МВК;
	Если НЕ Строки.Количество() = 0 Тогда
		Выборка = Строки.Получить(0);
		Если Выборка.Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен Тогда 
			ПроверкаСписокМВК = Истина;  
			Элементы.ПроверкаСписокМВК.ЦветТекстаЗаголовка = WebЦвета.Красный; 
			Элементы.ПроверкаСписокМВК.ЦветРамки = WebЦвета.Красный; 
			Элементы.КнопкаМВК.Доступность = Истина; 
			СтрК.Статус = "Замороженный"; 
			СтрК.Включен = Истина;
			ПроверкаСписокМВК = Истина;
		ИначеЕсли Выборка.Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Исключен Тогда
			СтрК.Статус = "Размороженный";	
			ПроверкаСписокМВК = Ложь; 
			Элементы.ПроверкаСписокМВК.ЦветТекстаЗаголовка = WebЦвета.Черный; 
			Элементы.ПроверкаСписокМВК.ЦветРамки = WebЦвета.СветлоСерый; 
		КонецЕсли;                        
	Иначе
		СтрК.Статус = "Отсутствует в перечне МВК";
		ПроверкаСписокМВК = Ложь;
	КонецЕсли;	
	
	Отбор.Вставить("ВидПеречня", Перечисления.ЛБ_ВидыПеречней.ФРОМУ);
	Строки = ТаблицаЗапроса.НайтиСтроки(Отбор); 
	СтрК = ТаблицаКомплаенсСтатусов.Добавить();  
	СтрК.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ФРОМУ;
	Если НЕ Строки.Количество() = 0 Тогда
		Выборка = Строки.Получить(0);
		Если Выборка.Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен Тогда 
			ПроверкаПереченьФРОМУ = Истина;    
			Элементы.ПроверкаПереченьФРОМУ.ЦветТекстаЗаголовка = WebЦвета.Красный; 
			Элементы.ПроверкаПереченьФРОМУ.ЦветРамки = WebЦвета.Красный; 
			Элементы.КнопкаФРОМУ.Доступность = Истина; 
			СтрК.Статус = "В перечне ФРОМУ"; 
			СтрК.Включен = Истина;
			ПроверкаПереченьФРОМУ = Истина;
		Иначе     
			СтрК.Статус = "Отсутствует в перечне ФРОМУ";
			ПроверкаПереченьФРОМУ = Ложь;
		КонецЕсли;  
	Иначе
		СтрК.Статус = "Отсутствует в перечне ФРОМУ"; 
		ПроверкаПереченьФРОМУ = Ложь; 
	КонецЕсли;     
	
	Отбор.Вставить("ВидПеречня", Перечисления.ЛБ_ВидыПеречней.ООН);
	Строки = ТаблицаЗапроса.НайтиСтроки(Отбор); 
	СтрК = ТаблицаКомплаенсСтатусов.Добавить();  
	СтрК.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ООН;
	Если НЕ Строки.Количество() = 0 Тогда
		Выборка = Строки.Получить(0);
		Если Выборка.Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен Тогда 
			ПроверкаПереченьООН = Истина;    
			Элементы.ПроверкаПереченьООН.ЦветТекстаЗаголовка = WebЦвета.Красный; 
			Элементы.ПроверкаПереченьООН.ЦветРамки = WebЦвета.Красный; 
			Элементы.КнопкаООН.Доступность = Истина; 
			СтрК.Статус = "В перечне ООН";
			СтрК.Включен = Истина;
			ПроверкаПереченьООН = Истина;
		Иначе
			СтрК.Статус = "Отсутствует в перечне ООН";
			ПроверкаПереченьООН = Ложь;
		КонецЕсли;  
	Иначе
		СтрК.Статус = "Отсутствует в перечне ООН";
		ПроверкаПереченьООН = Ложь;
	КонецЕсли;
	
	
	Отбор.Вставить("ВидПеречня", Перечисления.ЛБ_ВидыПеречней.ЦБ);
	Строки = ТаблицаЗапроса.НайтиСтроки(Отбор); 
	СтрК = ТаблицаКомплаенсСтатусов.Добавить();  
	СтрК.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ЦБ;
	Если НЕ Строки.Количество() = 0 Тогда
		СтрК.Статус = "Присутствует в перечне ЦБ"; 
		СтрК.Включен = Истина;
	Иначе  
		СтрК.Статус = "Отсутствует в перечне ЦБ";
	КонецЕсли;	
КонецПроцедуры	    

&НаСервере
Процедура ЗаполнитьДатыПроверкиПеречней()   
	ДатаАнкеты = Дата(1,1,1);
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", Дата); 
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);  
	ВидыОперации = Новый СписокЗначений; 
	ВидыОперации.Добавить(Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог);
	ВидыОперации.Добавить(Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление);
	ВидыОперации.Добавить(Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов);
	ВидыОперации.Добавить(Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога);
	Запрос.УстановитьПараметр("ВидыОперации", ВидыОперации);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	НАЧАЛОПЕРИОДА(ЛБ_КарточкаЗалогодателя.Дата, ДЕНЬ) КАК Период
	|ИЗ
	|	Документ.ЛБ_КарточкаЗалогодателя КАК ЛБ_КарточкаЗалогодателя
	|ГДЕ
	|	ЛБ_КарточкаЗалогодателя.Проведен = ИСТИНА
	|	И ЛБ_КарточкаЗалогодателя.Залогодатель = &Залогодатель
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ЛБ_ОперацияПоЗалогу.Дата, ДЕНЬ)
	|ИЗ
	|	Документ.ЛБ_ОперацияПоЗалогу КАК ЛБ_ОперацияПоЗалогу
	|ГДЕ
	|	ЛБ_ОперацияПоЗалогу.ВидОперации В(&ВидыОперации)
	|	И ЛБ_ОперацияПоЗалогу.Залогодатель = &Залогодатель
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();   
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда	
		ДатаАнкеты = ТаблицаЗапроса.Получить(0).Период;  
	КонецЕсли;   
	
	Запрос.Текст = "ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ЛБ_ДатыЗагрузкиПеречнейСрезПоследних.Период, ДЕНЬ) КАК Период,
	|	ЛБ_ДатыЗагрузкиПеречнейСрезПоследних.ВидПеречня КАК ВидПеречня
	|ИЗ
	|	РегистрСведений.ЛБ_ДатыЗагрузкиПеречней.СрезПоследних(&Дата, ) КАК ЛБ_ДатыЗагрузкиПеречнейСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидПеречня,
	|	Период УБЫВ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	Отбор = Новый Структура;
	Отбор.Вставить("ВидПеречня", Перечисления.ЛБ_ВидыПеречней.Террористы);
	Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
	Если Строки.Количество() = 0 Тогда 
		Элементы.ДекорацияТеррористы.Заголовок = ?(ДатаАнкеты = Дата(1,1,1), "", Формат(ДатаАнкеты, "ДФ=dd/MM/yyyy"));
	Иначе          
		Стр = Строки.Получить(0);
		ДатаПеречня = Стр.Период;
		ДатаПеречня = ?(ДатаАнкеты > ДатаПеречня, ДатаАнкеты, ДатаПеречня); 
		Элементы.ДекорацияТеррористы.Заголовок = Формат(ДатаПеречня, "ДФ=dd/MM/yyyy");
	КонецЕсли;	 
	
	Отбор.Вставить("ВидПеречня", Перечисления.ЛБ_ВидыПеречней.МВК);
	Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
	Если Строки.Количество() = 0 Тогда 
		Элементы.ДекорацияМВК.Заголовок = ?(ДатаАнкеты = Дата(1,1,1), "", Формат(ДатаАнкеты, "ДФ=dd/MM/yyyy"));
	Иначе                                 
		Стр = Строки.Получить(0);
		ДатаПеречня = Стр.Период;
		ДатаПеречня = ?(ДатаАнкеты > ДатаПеречня, ДатаАнкеты, ДатаПеречня); 
		Элементы.ДекорацияМВК.Заголовок = Формат(ДатаПеречня, "ДФ=dd/MM/yyyy");
	КонецЕсли;	
	
	Отбор.Вставить("ВидПеречня", Перечисления.ЛБ_ВидыПеречней.ФРОМУ);
	Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
	Если Строки.Количество() = 0 Тогда 
		Элементы.ДекорацияФРОМУ.Заголовок = ?(ДатаАнкеты = Дата(1,1,1), "", Формат(ДатаАнкеты, "ДФ=dd/MM/yyyy"));
	Иначе
		Стр = Строки.Получить(0);
		ДатаПеречня = Стр.Период;
		ДатаПеречня = ?(ДатаАнкеты > ДатаПеречня, ДатаАнкеты, ДатаПеречня); 
		Элементы.ДекорацияФРОМУ.Заголовок = Формат(ДатаПеречня, "ДФ=dd/MM/yyyy");
	КонецЕсли;	  
	
	Отбор.Вставить("ВидПеречня", Перечисления.ЛБ_ВидыПеречней.ООН);
	Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
	Если Строки.Количество() = 0 Тогда 
		Элементы.ДекорацияООН.Заголовок = ?(ДатаАнкеты = Дата(1,1,1), "", Формат(ДатаАнкеты, "ДФ=dd/MM/yyyy"));
	Иначе          
		Стр = Строки.Получить(0);
		ДатаПеречня = Стр.Период;
		ДатаПеречня = ?(ДатаАнкеты > ДатаПеречня, ДатаАнкеты, ДатаПеречня); 
		Элементы.ДекорацияООН.Заголовок = Формат(ДатаПеречня, "ДФ=dd/MM/yyyy");
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьТаблицуДоверенностей() 
	ЗапросД = Новый Запрос;
	ЗапросД.УстановитьПараметр("Клиент", Залогодатель); 
	ЗапросД.УстановитьПараметр("Дата", Дата);
	ЗапросД.УстановитьПараметр("СтатусДоверенности", Перечисления.ЛБ_СтатусыДоверенностей.ДоверенностьОформлена);
	ЗапросД.Текст ="ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЛБ_ДоверенностиСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	|	ЛБ_ДоверенностиСрезПоследних.Доверенность.ВидДоверенности КАК ВидДоверенности,
	|	ЛБ_ДоверенностиСрезПоследних.Доверенность.ПредставительКлиента КАК ПредставительКлиента,
	|	ЛБ_ДоверенностиСрезПоследних.Доверенность.СерияДоверенности КАК СерияДоверенности,
	|	ЛБ_ДоверенностиСрезПоследних.Доверенность.НомерДоверенности КАК НомерДоверенности,
	|	ЛБ_ДоверенностиСрезПоследних.Доверенность.ДатаДоверенности КАК ДатаНачала,
	|	ЛБ_ДоверенностиСрезПоследних.Доверенность.СрокДействияДоверенности КАК ДатаОкончания,
	|	ЛБ_ДоверенностиСрезПоследних.Доверенность КАК Доверенность,
	|	ЛБ_ДоверенностиСрезПоследних.Период КАК Период,
	|	ИСТИНА КАК Действует,  
	|	ЛОЖЬ КАК Наследство,
	|	ЛБ_ДоверенностиСрезПоследних.СтатусДоверенности КАК СтатусДоверенности
	|ИЗ
	|	РегистрСведений.ЛБ_Доверенности.СрезПоследних(&Дата, Клиент = &Клиент) КАК ЛБ_ДоверенностиСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	ТаблицаД = ЗапросД.Выполнить().Выгрузить();
	Для каждого стрД из ТаблицаД цикл   
		Если СтрД.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.ДоверенностьОформлена Тогда
			Если  СтрД.Доверенность.СрокДействияДоверенности >= НачалоДня(Дата) Тогда 
				Если НЕ ЛБ_ОбщийМодуль.ПроверитьЕстьДатаСмерти(СтрД.Доверенность.Клиент, Дата) = неопределено Тогда  
					СтрД.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.СмертьДоверителя; 
					СтрД.Действует = Ложь;
				ИначеЕсли НЕ ЛБ_ОбщийМодуль.ПроверитьЕстьДатаСмерти(СтрД.Доверенность.ПредставительКлиента, Дата) = неопределено Тогда  
					СтрД.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.СмертьДоверенногоЛица;
					СтрД.Действует = Ложь;					
				Иначе	
					СтрД.Действует = Истина;  
				КонецЕсли;	              
			ИначеЕсли СтрД.Доверенность.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Наследство Тогда
				СтрД.Наследство = Истина;
				Если НЕ ЛБ_ОбщийМодуль.ПроверитьЕстьДатаСмерти(СтрД.Доверенность.ПредставительКлиента, Дата) = неопределено Тогда  
					СтрД.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.СмертьДоверенногоЛица;
					СтрД.Действует = Ложь;	
				Иначе   
					СтрД.Действует = Истина;
				КонецЕсли;	
			Иначе                         	
				СтрД.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.ДействиеПрекращено;
				СтрД.Действует = Ложь;
			КонецЕсли;  
		Иначе
			СтрД.Действует = Ложь;
			Если СтрД.Доверенность.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Наследство Тогда
				СтрД.Наследство = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;  
	ТаблицаД.Сортировать("Действует Убыв, Период Убыв");
	
	ТаблицаДоверенностей.Загрузить(ТаблицаД);  
	
	ЗапросД.УстановитьПараметр("Клиент", Залогодатель); 
	ЗапросД.УстановитьПараметр("Дата", Дата);
	ЗапросД.УстановитьПараметр("СтатусДоверенности", Перечисления.ЛБ_СтатусыДоверенностей.ДоверенностьОформлена);
	ЗапросД.Текст ="ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЛБ_ДоверенностиСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	|	ЛБ_ДоверенностиСрезПоследних.Доверенность.ВидДоверенности КАК ВидДоверенности,
	|	ЛБ_ДоверенностиСрезПоследних.Клиент КАК Клиент,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
	|	ЛБ_ДоверенностиСрезПоследних.Доверенность.ДатаДоверенности КАК ДатаНачала,
	|	ЛБ_ДоверенностиСрезПоследних.Доверенность.СрокДействияДоверенности КАК ДатаОкончания,
	|	ЛБ_ДоверенностиСрезПоследних.Доверенность КАК Доверенность,
	|	ЛБ_ДоверенностиСрезПоследних.Период КАК Период,
	|	ИСТИНА КАК Действует,
	|	ЛОЖЬ КАК Наследство,
	|	ЛБ_ДоверенностиСрезПоследних.СтатусДоверенности КАК СтатусДоверенности
	|ИЗ
	|	РегистрСведений.ЛБ_Доверенности.СрезПоследних(&Дата, Доверенность.ПредставительКлиента = &Клиент) КАК ЛБ_ДоверенностиСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, ) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних
	|		ПО ЛБ_ДоверенностиСрезПоследних.Клиент = ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Залогодатель"; 
	ТаблицаДП = ЗапросД.Выполнить().Выгрузить();  
	Для каждого стрД из ТаблицаДП цикл
		Если СтрД.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.ДоверенностьОформлена Тогда
			Если  СтрД.Доверенность.СрокДействияДоверенности >= НачалоДня(Дата) Тогда 
				Если НЕ ЛБ_ОбщийМодуль.ПроверитьЕстьДатаСмерти(СтрД.Доверенность.Клиент, Дата) = неопределено Тогда  
					СтрД.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.СмертьДоверителя; 
					СтрД.Действует = Ложь;
				ИначеЕсли НЕ ЛБ_ОбщийМодуль.ПроверитьЕстьДатаСмерти(СтрД.Доверенность.ПредставительКлиента, Дата) = неопределено Тогда  
					СтрД.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.СмертьДоверенногоЛица;
					СтрД.Действует = Ложь;
				Иначе	
					СтрД.Действует = Истина;  
				КонецЕсли;	  
			ИначеЕсли СтрД.Доверенность.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Наследство Тогда 
				СтрД.Наследство = Истина;
				Если НЕ ЛБ_ОбщийМодуль.ПроверитьЕстьДатаСмерти(СтрД.Доверенность.ПредставительКлиента, Дата) = неопределено Тогда  
					СтрД.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.СмертьДоверенногоЛица;
					СтрД.Действует = Ложь;	
				Иначе   
					СтрД.Действует = Истина;
				КонецЕсли;		
			Иначе
				СтрД.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.ДействиеПрекращено;
				СтрД.Действует = Ложь;
			КонецЕсли;  
		Иначе
			СтрД.Действует = Ложь;  
			Если СтрД.Доверенность.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Наследство Тогда
				СтрД.Наследство = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;  
	ТаблицаДП.Сортировать("Действует Убыв, Период Убыв");
	ТаблицаДоверенностейПредставитель.Загрузить(ТаблицаДП);
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьТаблицуОтказов()
	ЗапросА = Новый Запрос;
	ЗапросА.УстановитьПараметр("Залогодатель", Залогодатель); 
	ЗапросА.УстановитьПараметр("Дата", Дата);
	ЗапросА.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""Анкета"" КАК Вид,
	|	ОтказыКлиента.ДатаОтказа КАК ДатаОтказа,
	|	ОтказыКлиента.ПричинаОтказа КАК ПричинаОтказа,
	|	ОтказыКлиента.СуммаЗаймаОтказ КАК СуммаЗаймаОтказ,
	|	ОтказыКлиента.Ответственный КАК Ответственный
	|ИЗ
	|	РегистрСведений.ЛБ_ОтказыКлиентамВОбслуживании КАК ОтказыКлиента
	|ГДЕ
	|	ОтказыКлиента.Залогодатель = &Залогодатель
	|	И ОтказыКлиента.Период <= &Дата";
	ТаблицаЗапроса = ЗапросА.Выполнить().Выгрузить();  
	ТаблицаОтказов.Загрузить(ТаблицаЗапроса); 
	
	ЗапросА.Текст = "ВЫБРАТЬ
	|	""ЦБ"" КАК Вид,
	|	ЛБ_КлиентыВПеречнях.ДатаПеречня КАК ДатаПеречня,
	|	ЛБ_КлиентыВПеречнях.ДатаВключенияВПеречень КАК ДатаОтказа,
	|	ЛБ_КлиентыВПеречнях.КодОтказа КАК КодОтказа,
	|	ЛБ_КлиентыВПеречнях.Ответственный КАК Ответственный
	|ИЗ
	|	РегистрСведений.ЛБ_КлиентыВПеречнях КАК ЛБ_КлиентыВПеречнях
	|ГДЕ
	|	ЛБ_КлиентыВПеречнях.Залогодатель = &Залогодатель
	|	И ЛБ_КлиентыВПеречнях.ВидПеречня = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыПеречней.ЦБ)
	|	И ЛБ_КлиентыВПеречнях.Период <= &Дата";
	ВыборкаА = ЗапросА.Выполнить().Выбрать();
	Пока ВыборкаА.Следующий() Цикл 
		СтрОтказ = ТаблицаОтказов.Добавить(); 
		СтрОтказ.Вид = ВыборкаА.Вид;   
		СтрОтказ.ДатаПеречня = ВыборкаА.ДатаПеречня;
		СтрОтказ.ДатаОтказа = ВыборкаА.ДатаОтказа; 
		СтрОтказ.КодОтказа = ВыборкаА.КодОтказа;           
		СтрОтказ.ПричинаОтказа  = "Код отказа " + СокрЛП(ВыборкаА.КодОтказа) + ", Дата списка " + Формат(ВыборкаА.ДатаПеречня, "ДФ=dd.MM.yyyy");
		СтрОтказ.Ответственный = ВыборкаА.Ответственный;
	КонецЦикла;	
	Если НЕ ТаблицаОтказов.Количество() = 0 Тогда  
		ТаблицаОтказов.Сортировать("ДатаПеречня, ДатаОтказа");
		Элементы.ГруппаОтказИстория.Показать();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтрокуПредставитель(Представитель)
	ЗапросП = Новый Запрос; 
	ЗапросП.УстановитьПараметр("Дата", Дата); 
	ЗапросП.УстановитьПараметр("Залогодатель", Представитель);
	ЗапросП.Текст = "ВЫБРАТЬ
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения
	|ИЗ
	|	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних"; 
	ВыборкаП = ЗапросП.Выполнить().Выбрать();
	Если ВыборкаП.Следующий() Тогда
		Возврат сокрЛП(Представитель) + ", дата рождения " + Формат(ВыборкаП.ДатаРождения, "ДФ=dd.MM.yyyy"); 
	КонецЕсли;
	Возврат сокрЛП(Представитель);	
КонецФункции

&НаСервере
Процедура ПолучитьДатыНачалаОкончанияРаботыСКлиентом() 
	РаботаНачата = Истина;
	ЭтоПредставитель = Ложь;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель); 
	Запрос.УстановитьПараметр("Дата", Дата);
	Если КарточкаЗагружена Тогда
		ДатаНачалаРаботыСКлиентом = Формат(ДатаОформленияАнкеты, "ДФ=dd.MM.yyyy");
	Иначе 
		ДатаНачала = Дата(1,1,1);
		ВидыОпераций = новый СписокЗначений; 
		ВидыОпераций.Добавить(Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог);
		ВидыОпераций.Добавить(Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов);
		Запрос.УстановитьПараметр("ВидыОпераций", ВидыОпераций);
		Запрос.Текст = "ВЫБРАТЬ
		|	ЛБ_ОборотыПоОперациямЗайма.Период КАК Период,
		|	ЛБ_ОборотыПоОперациямЗайма.Регистратор КАК Регистратор,
		|	0 КАК Вид
		|ИЗ
		|	РегистрНакопления.ЛБ_ОборотыПоОперациямЗайма КАК ЛБ_ОборотыПоОперациямЗайма
		|ГДЕ
		|	ЛБ_ОборотыПоОперациямЗайма.Регистратор.Залогодатель = &Залогодатель
		|	И ЛБ_ОборотыПоОперациямЗайма.ВидОперации В(&ВидыОпераций)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛБ_Доверенности.Период,
		|	ЛБ_Доверенности.Регистратор,
		|	1
		|ИЗ
		|	РегистрСведений.ЛБ_Доверенности КАК ЛБ_Доверенности
		|ГДЕ
		|	ЛБ_Доверенности.Доверенность.ПредставительКлиента = &Залогодатель
		|	И ЛБ_Доверенности.Период <= &Дата
		|	И ЛБ_Доверенности.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийДоверенность.Оформление)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Вид,
		|	Период";
		ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
		Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда 
			Выборка = ТаблицаЗапроса.Получить(0);  
			Если Выборка.Вид = 1 Тогда
				ЭтоПредставитель = Истина;
			КонецЕсли;	
			ДатаНачалаРаботыСКлиентом = Формат(Выборка.Период, "ДФ=dd.MM.yyyy"); 
			Если ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.ЛБ_ОперацияПоЗалогу") Тогда
				ДатаНачалаРаботыСКлиентом = ДатаНачалаРаботыСКлиентом + " (" + Строка(Выборка.Регистратор.ВидОперации) + ")";
			ИначеЕсли ЭтоПредставитель Тогда
				ДатаНачалаРаботыСКлиентом = ДатаНачалаРаботыСКлиентом + " (Оформление доверенности)";
			КонецЕсли;	
		Иначе	
			ДатаНачалаРаботыСКлиентом = "Работа не начата"; 
			РаботаНачата = Ложь;
		КонецЕсли;
	КонецЕсли;	  
	
	ДатаОкончанияРаботыСКлиентом = "";
	Если НЕ РаботаНачата Тогда		
		Возврат;
	КонецЕсли;	    
	
	Если НЕ ДатаСмерти = Дата(1,1,1) Тогда 
		ДатаОкончанияРаботыСКлиентом = "Работа прекращена " + Формат(ДатаСмерти, "ДФ=dd.MM.yyyy");
		Возврат;
	КонецЕсли;	
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета,
	|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.Период КАК Период
	|ИЗ
	|	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&Дата, ЗалоговыйБилет.Залогодатель = &Залогодатель) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";   	
	Выборка = Запрос.Выполнить().Выбрать();
	ВсеОпреацииЗакрыты = Истина;    
	ДатаОкончания = Дата(1,1,1);
	Если НЕ Выборка.Количество()= 0 Тогда 			
		Пока Выборка.Следующий() Цикл  
			Если НЕ Выборка.СтатусЗалоговогоБилета = перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт И НЕ Выборка.СтатусЗалоговогоБилета = перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтказОтОформления Тогда 
				ВсеОпреацииЗакрыты = ложь; 
				Прервать;
			КонецЕсли;	 
			ДатаОкончания = Выборка.Период;			
		КонецЦикла;	              
		Если НЕ ВсеОпреацииЗакрыты Тогда  
			ДатаОкончанияРаботыСКлиентом = "Работа не прекращена";
			Возврат;
		КонецЕсли;	
	КонецЕсли;  
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛБ_ОборотыПоОперациямЗайма.Период КАК Период
	|ИЗ
	|	РегистрНакопления.ЛБ_ОборотыПоОперациямЗайма КАК ЛБ_ОборотыПоОперациямЗайма
	|ГДЕ
	|	ЛБ_ОборотыПоОперациямЗайма.Регистратор.Залогодатель = &Залогодатель
	|	И ЛБ_ОборотыПоОперациямЗайма.ВидОперации = Значение(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 	
		ДатаОкончания =?(ДатаОкончания < Выборка.Период, Выборка.Период, ДатаОкончания); 
	КонецЕсли;
	
	Если ЭтоПредставитель Тогда
		ДатаОкончанияДоверенностей = ЛБ_УправлениеЛомбардом.ПолучитьДатуОкончанияДоверенностейКлиента(Дата, Залогодатель); 
		Если НЕ ДатаОкончанияДоверенностей = неопределено Тогда  
			ДатаОкончания = ?(ДатаОкончания < ДатаОкончанияДоверенностей, ДатаОкончанияДоверенностей, ДатаОкончания);
		Иначе
			ДатаОкончанияРаботыСКлиентом = "Работа не прекращена";
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	Если НЕ ДатаОкончания = Дата(1,1,1) Тогда	
		ДатаОкончанияРаботыСКлиентом = "Работа прекращена " + Формат(ДатаОкончания, "ДФ=dd.MM.yyyy");
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДатуПоследнегоОбновленияАнкеты()
	ЗапросА = Новый Запрос; 
	ЗапросА.УстановитьПараметр("Дата", Дата); 
	ЗапросА.УстановитьПараметр("Залогодатель", Залогодатель);
	ЗапросА.Текст = "ВЫБРАТЬ
	|	ЛБ_ДатыОбновленияАнкеты.ДатаАктуальности КАК ДатаАктуальности
	|ИЗ
	|	РегистрСведений.ЛБ_ДатыОбновленияАнкеты КАК ЛБ_ДатыОбновленияАнкеты
	|ГДЕ
	|	ЛБ_ДатыОбновленияАнкеты.Период <= &Дата
	|	И ЛБ_ДатыОбновленияАнкеты.Залогодатель = &Залогодатель
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛБ_ДатыОбновленияАнкеты.Период УБЫВ";
	ТаблицаЗапроса = ЗапросА.Выполнить().Выгрузить();
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда 
		АнкетаОбновлена = ТаблицаЗапроса.Получить(0).ДатаАктуальности;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ОпределитьДатуГражданство()
	ДатаГ = ТекущаяДата();
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_КонтактнаяИнформацияЗалогодателей.Период КАК Период,
	|	ЛБ_КонтактнаяИнформацияЗалогодателей.Гражданство КАК Гражданство
	|ИЗ
	|	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей КАК ЛБ_КонтактнаяИнформацияЗалогодателей
	|ГДЕ
	|	ЛБ_КонтактнаяИнформацияЗалогодателей.Период <= &Дата
	|	И ЛБ_КонтактнаяИнформацияЗалогодателей.Залогодатель = &Залогодатель
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл            			
		Если Выборка.Гражданство = Гражданство Тогда
			ДатаГ = Выборка.Период;
		Иначе
			Прервать;
		КонецЕсли;	
	Конеццикла;
	Возврат ДатаГ;
КонецФункции

&НаСервере                                                             
Процедура ПроверитьДействительностьДокументов() 
	Если НЕ ДатаСмерти = Дата(1,1,1) Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьСвидетельствоОРождении = Ложь;
	Для каждого Стр Из ДокументыЗалогодателя Цикл
		Если Стр.ДокументНЕДействителен Тогда
			Продолжить; 
		ИначеЕсли (Стр.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.СвидетельствоОРождении) Тогда
			ЕстьСвидетельствоОРождении = Истина;	
		КонецЕсли;	
		Стр.ПроверкаНеДействителен = ПроверитьПаспортВСпискеНеДействительных(Стр.ДокументСерия, стр.ДокументНомер);
		Если НЕ Стр.ПроверкаНеДействителен Тогда
			ЛБ_ОбщийМодуль.ПроверитьДействительностьДокумента(Стр, ДатаРождения, ложь, Дата);
		КонецЕсли; 
		
		// ++ Сербаев 26.05.2023 TODO: (проверка вида на жительства на действительность)
		Если ЗначениеЗаполнено(Стр.Гражданство) И 
			Не Стр.Гражданство = Справочники.СтраныМира.Россия И
			Стр.ВидДокументаЗалогодателя = 	Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийПравоПребыванияРФ И
			Стр.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ВидНаЖительство Тогда
			
			Стр.ПроверкаНеДействителен = НЕ ЛБ_ОбщийМодуль.ПроверитьДействительностьВидаНаЖительство(Стр, ДатаРождения, Дата);
		КонецЕсли;
		// -- Сербаев 26.05.2023
		
	КонецЦикла;
	
	Если ЕстьСвидетельствоОРождении Тогда
		//проверим недействительность свидетельства о рождении если есть паспорт
		ЛБ_ОбщийМодуль.ПроверитьДействительностьСвидетельствоОРождении(ДокументыЗалогодателя);
	КонецЕсли;	
	
	//дополнительная проверка вида на жительство по документу удостоверяющего личность
	//ОтборДок = Новый структура;
	//ОтборДок.Вставить("ВидДокумента", справочники.ВидыДокументовФизическихЛиц.ВидНаЖительство);
	//СтрокиДок = ДокументыЗалогодателя.НайтиСтроки(ОтборДок);
	//Для каждого стрДок Из СтрокиДок Цикл 
	//	Если СтрДок.ДокументНЕДействителен ИЛИ СтрДок.ПроверкаНеДействителен Тогда
	//		Продолжить;
	//	КонецЕсли;	
	//	//ДатаНачалаДействия = СтрДок.ДокументНачалоДействия;
	//	//Гражданство = СтрДок.Гражданство; 
	//	ЕстьДУЛ = Ложь;
	//	Для каждого Стр Из ДокументыЗалогодателя Цикл
	//		Если Стр.ДокументНЕДействителен ИЛИ Стр.ПроверкаНеДействителен Тогда
	//			Продолжить;
	//		КонецЕсли;	
	//		Если НЕ Стр.Гражданство = СтрДок.Гражданство Тогда
	//			Продолжить;
	//		КонецЕсли;	
	//		Если Стр.ДокументНачалоДействия <= СтрДок.ДокументНачалоДействия Тогда
	//			ЕстьДУЛ = Истина;
	//			Прервать;
	//		КонецЕсли;	
	//	КонецЦикла;	 
	//	СтрДок.ПроверкаНеДействителен = ?(НЕ ЕстьДУЛ, Ложь, СтрДок.ПроверкаНеДействителен);
	//КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСписокВыбораСтран()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СтраныМира.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтраныМира КАК СтраныМира
	|ГДЕ
	|	СтраныМира.ПометкаУдаления = ЛОЖЬ
	|	И СтраныМира.Предопределенный = ЛОЖЬ
	|АВТОУПОРЯДОЧИВАНИЕ";
	СписокСтран = Новый СписокЗначений;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокСтран.Добавить(Выборка.Ссылка);
	КонецЦикла;	
	Возврат СписокСтран;
КонецФункции	

&НаСервере
Процедура ЗаполнитьКонтактнуюИнформацию()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРождения КАК МестоРождения,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРожденияСтрана КАК МестоРожденияСтрана,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРожденияОбласть КАК МестоРожденияОбласть,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРожденияРайон КАК МестоРожденияРайон,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРожденияНаселенныйПункт КАК МестоРожденияНаселенныйПункт,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Пол КАК Пол,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК Телефон,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ТелефонСтруктура КАК ТелефонСтруктура,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Email КАК Email,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПрописке КАК АдресПоПрописке,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПропискеСтруктура КАК АдресПоПропискеСтруктура,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ФактическийАдрес КАК ФактическийАдрес,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ФактическийАдресСтруктура КАК ФактическийАдресСтруктура,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ПочтовыйАдресСтруктура КАК ПочтовыйАдресСтруктура,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ТелефонДополнительный КАК ТелефонДополнительный,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ТелефонДополнительныйСтруктура КАК ТелефонДополнительныйСтруктура,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.КонтактноеЛицо КАК КонтактноеЛицо,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ТелефонКонтактногоЛица КАК ТелефонКонтактногоЛица,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ТелефонКонтактногоЛицаСтруктура КАК ТелефонКонтактногоЛицаСтруктура,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ИсточникИнформации КАК ИсточникИнформации,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ИсточникИнформацииДругое КАК ИсточникИнформацииДругое,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПропискеВручную КАК АдресПоПропискеВручную,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ФактическийАдресВручную КАК ФактическийАдресВручную,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ПочтовыйАдресВручную КАК ПочтовыйАдресВручную,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Комментарий КАК Комментарий,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаСмерти КАК ДатаСмерти,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия_А КАК Фамилия_А,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя_А КАК Имя_А,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество_А КАК Отчество_А
	|ИЗ
	|	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Фамилия = Выборка.Фамилия;
		Имя = Выборка.Имя;
		Отчество = Выборка.Отчество;
		ДатаРождения = Выборка.ДатаРождения;
		МестоРождения = Выборка.МестоРождения;
		МестоРожденияСтрана = Выборка.МестоРожденияСтрана;
		МестоРожденияОбласть = Выборка.МестоРожденияОбласть;
		МестоРожденияРайон = Выборка.МестоРожденияРайон;
		МестоРожденияНаселенныйПункт = Выборка.МестоРожденияНаселенныйПункт;
		Гражданство = Выборка.Гражданство;
		Пол = Выборка.Пол;
		Телефон = Выборка.Телефон;
		ТелефонСтруктура = Выборка.ТелефонСтруктура;
		Email = Выборка.Email;
		АдресПоПрописке = Выборка.АдресПоПрописке;
		АдресПоПропискеСтруктура = Выборка.АдресПоПропискеСтруктура;
		ФактическийАдрес = Выборка.ФактическийАдрес;
		ФактическийАдресСтруктура = Выборка.ФактическийАдресСтруктура;
		ПочтовыйАдрес = Выборка.ПочтовыйАдрес;
		ПочтовыйАдресСтруктура = Выборка.ПочтовыйАдресСтруктура;
		ТелефонДополнительный = Выборка.ТелефонДополнительный;
		ТелефонДополнительныйСтруктура = Выборка.ТелефонДополнительныйСтруктура;
		КонтактноеЛицо = Выборка.КонтактноеЛицо;
		ТелефонКонтактногоЛица = Выборка.ТелефонКонтактногоЛица;
		ТелефонКонтактногоЛицаСтруктура = Выборка.ТелефонКонтактногоЛицаСтруктура;
		ИсточникИнформации = Выборка.ИсточникИнформации;
		ИсточникИнформацииДругое = Выборка.ИсточникИнформацииДругое;
		АдресПоПропискеВручную = Выборка.АдресПоПропискеВручную;
		ФактическийАдресВручную = Выборка.ФактическийАдресВручную;
		ПочтовыйАдресВручную = Выборка.ПочтовыйАдресВручную;
		ДатаСмерти = Выборка.ДатаСмерти;
		Комментарий = Выборка.Комментарий;
		Фамилия_А = Выборка.Фамилия_А;
		Имя_А = Выборка.Имя_А;
		Отчество_А = Выборка.Отчество_А;
	КонецЕсли;		
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьДокументы()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя КАК ДокументСсылка,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСтранаЭмитент КАК ДокументСтранаЭмитент,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ПричинаИзменения КАК ПричинаИзменения,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНаименованиеИногоДокумента КАК ДокументНаименованиеИногоДокумента,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНачалоДействия КАК ДокументНачалоДействия,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНеДействителен КАК ДокументНеДействителен,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДействителен КАК ДокументДействителен,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДатаСмерти КАК ДатаСмерти,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ОсновнойДУЛ КАК ОсновнойДУЛ,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ОсновнойДоп КАК ОсновнойДоп
	|ИЗ
	|	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&Дата, ДокументЗалогодателя.Владелец = &Залогодатель) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";
	ДокументыЗалогодателя.Загрузить(Запрос.Выполнить().Выгрузить());
	Ном = 0;
	ЕстьПаспорт = ложь;
	Для каждого Стр Из ДокументыЗалогодателя Цикл
		Ном = Ном + 1;
		Стр.КлючСтроки = Ном;   
		Стр.Основной = ?(Стр.ОсновнойДУЛ ИЛИ Стр.ОсновнойДоп, истина, ложь);
		
		//проверим недействительность документа
		//Если НЕ Стр.ДокументНеДействителен Тогда
		//	Если (Стр.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ) ИЛИ 
		//	(Стр.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ВидНаЖительство И Стр.ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность) Тогда
		//		Если ЗначениеЗаполнено(ДатаРождения) Тогда
		//			Если НЕ ЛБ_ОбщийМодуль.ПроверитьПаспортРФДействует(ДатаРождения, Стр.ДокументДатаВыдачи) Тогда
		//				Стр.ДокументНеДействителен = Истина;
		//			Иначе
		//				ЕстьПаспорт = Истина;
		//			КонецЕсли;	
		//		КонецЕсли;	
		//	ИначеЕсли Стр.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.СвидетельствоОРождении Тогда
		//		Если НЕ ЛБ_ОбщийМодуль.ПроверитьСвидетельствоОРожденииДействует(ДатаРождения) Тогда
		//			Стр.ДокументНеДействителен = Истина;
		//		КонецЕсли;	
		//	ИначеЕсли ЛБ_ОбщийМодуль.ДокументСоСрокомДействия(Стр.ВидДокументаЗалогодателя, Стр.ВидДокумента) Тогда
		//		Если Стр.ДокументСрокДействия < НачалоДня(ТекущаяДата()) Тогда
		//			Стр.ДокументНеДействителен = Истина;
		//		КонецЕсли;	
		//	КонецЕсли;	
		//КонецЕсли;
		
		// ++ Сербаев 08.06.2023  (Проверка документа Вид на жительство на действительность)
		//Если НЕ Стр.ДокументНеДействителен Тогда
		//    Если Стр.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ВидНаЖительство Тогда
		//	    Если Не ЛБ_ОбщийМодуль.ПроверитьДействительностьВидаНаЖительство(Стр, ДатаРождения) Тогда
		//		    Стр.ДокументНеДействителен = Истина;
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЕсли;
		// -- Сербаев 08.06.2023
		
	КонецЦикла;	
	
	//проверим недействительность свидетельства о рождении если есть паспорт
	//Если ЕстьПаспорт Тогда
	//	ОтборД = Новый структура;
	//	ОтборД.Вставить("ВидДокумента", Справочники.ВидыДокументовФизическихЛиц.СвидетельствоОРождении);
	//	ОтборД.Вставить("ДокументНеДействителен", Ложь);
	//	СтрокиД = ДокументыЗалогодателя.НайтиСтроки(ОтборД);
	//	Для каждого СтрД Из СтрокиД цикл
	//		СтрД.ДокументНеДействителен = Истина;
	//	Конеццикла;	
	//КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьАнкету() 
	ЗапросБ = Новый Запрос;
	ЗапросБ.УстановитьПараметр("Залогодатель", Залогодатель);  	
	ЗапросБ.Текст = "ВЫБРАТЬ
	|	ЛБ_БенефициарныеВладельцы.Бенефициар КАК Бенефициар,
	|	ЛБ_БенефициарныеВладельцы.ВидПолученияИнформации КАК ВидПолученияИнформации
	|ИЗ
	|	РегистрСведений.ЛБ_БенефициарныеВладельцы КАК ЛБ_БенефициарныеВладельцы
	|ГДЕ
	|	ЛБ_БенефициарныеВладельцы.Залогодатель = &Залогодатель
	|	И ЛБ_БенефициарныеВладельцы.Регистратор = &Регистратор
	|АВТОУПОРЯДОЧИВАНИЕ";  
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);  
	Запрос.Текст  = "ВЫБРАТЬ
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ДатаОформленияАнкеты КАК ДатаОформленияАнкеты,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ИНН КАК ИНН,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.СНИЛС КАК СНИЛС,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ТипФизЛица КАК ТипФизЛица,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.КатегорииФизЛица КАК КатегорииФизЛица,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ФинансовоеПоложениеСтабильное КАК ФинансовоеПоложениеСтабильное,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ДеловаяРепутацияПоложительная КАК ДеловаяРепутацияПоложительная,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ИсточникПроисхожденияИмущества КАК ИсточникПроисхожденияИмущества,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ИсточникПроисхожденияИмуществаИной КАК ИсточникПроисхожденияИмуществаИной,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ХарактерОтношений КАК ХарактерОтношений,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ИсточникПроисхожденияДенежныхСредств КАК ИсточникПроисхожденияДенежныхСредств,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ИсточникПроисхожденияДенежныхСредствИной КАК ИсточникПроисхожденияДенежныхСредствИной,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.УровеньРиска КАК УровеньРиска,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ЗалогодательБенефициарныйВладелец КАК ЗалогодательБенефициарныйВладелец,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ЯвляетсяИПДЛ КАК ЯвляетсяИПДЛ,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.КатегорияКлиентаИПДЛ КАК КатегорияКлиентаИПДЛ,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ДопИнформацияИПДЛ КАК ДопИнформацияИПДЛ,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ДолжностьИПДЛ КАК ДолжностьИПДЛ,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.РаботодательИПДЛ КАК РаботодательИПДЛ,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.РазрешениеИПДЛ КАК РазрешениеИПДЛ,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ЯвляетсяДЛПМО_РДПЛ КАК ЯвляетсяДЛПМО_РДПЛ,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.КатегорияДЛПМО_РДПЛ КАК КатегорияДЛПМО_РДПЛ,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ДопИнформацияДЛПМО_РДПЛ КАК ДопИнформацияДЛПМО_РДПЛ,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ДолжностьДЛПМО_РДПЛ КАК ДолжностьДЛПМО_РДПЛ,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.РаботодательДЛПМО_РДПЛ КАК РаботодательДЛПМО_РДПЛ,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.РазрешениеДЛПМО_РДПЛ КАК РазрешениеДЛПМО_РДПЛ,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ОтветственноеЛицоИПДЛ КАК ОтветственноеЛицоИПДЛ,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ОтветственноеЛицоДЛПМО_РДПЛ КАК ОтветственноеЛицоДЛПМО_РДПЛ,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.Регистратор КАК Регистратор,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ПричинаИзменения КАК ПричинаИзменения
	|ИЗ
	|	РегистрСведений.ЛБ_АнкетаЗалогодателя.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_АнкетаЗалогодателяСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Выборка); 
		
		Если НЕ ЗалогодательБенефициарныйВладелец Тогда 
			ЗапросБ.УстановитьПараметр("Регистратор", Выборка.Регистратор);
			ТаблицаБенефициаров = ЗапросБ.Выполнить().Выгрузить();
			Бенефициары.Загрузить(ТаблицаБенефициаров);
			Элементы.ГруппаБенефициары.Показать();
			Элементы.ГруппаБенефициары.Доступность = истина;
		КонецЕсли;
		ЕстьАнкета = Истина;
	Иначе
		ТипФизЛица = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
		КатегорииФизЛица = СокрЛП(Перечисления.ЛБ_КатегорииФизЛица.Клиент);
		ХарактерОтношений = "Получение краткосрочного займа под залог ювелирных изделий на потребительские нужды";
		ФинансовоеПоложениеСтабильное = Истина;
		ДеловаяРепутацияПоложительная = Истина;  
		УровеньРиска = "Низкий, отсутствуют критерии повышенного риска"; 
		ЗалогодательБенефициарныйВладелец = Истина; 
		ДатаОформленияАнкеты = ТекущаяДата();   
		ЕстьАнкета = Ложь;  
		Элементы.ГруппаБенефициары.Доступность = ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	Если ТолькоПечатьАнкеты Тогда 
		НапечататьАнкету();
		ЭтаФорма.Закрыть();
	КонецЕсли;	
	Если АдресПоПрописке = ФактическийАдрес Тогда
		ФактическийСовпадает = Истина;
	Иначе	
		ФактическийСовпадает = Ложь;
	КонецЕсли;	
	
	Если АдресПоПрописке = ПочтовыйАдрес Тогда
		ПочтовыйСовпадает = Истина;
	Иначе	
		ПочтовыйСовпадает = Ложь;
	КонецЕсли;	
	УстановитьДоступность();
	ПоказатьФИО_А();
	ДокументыЗалогодателя.Сортировать("Основной УБЫВ, ДокументНачалоДействия УБЫВ, ВидДокументаЗалогодателя");
	
	//Иванов ВВ, сохр. значения реквизитов для сравнения при сохранении, права на расторжение
	Если ЛБ_СоглашенияЭДОСервер.ПроверкаРоли_ЛБ_СотрудникЦО() Тогда 
		Элементы.РасторгнутьЭДО_ЦО.Доступность = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Залогодатель) Тогда
		ЗапомнитьЗначенияРеквизитовКонтактныеДанные();
		НаличиеЭДО = ЛБ_СоглашенияЭДОСервер.НаличиеДействующегоСоглашения(Залогодатель);
		НаличиеСогласия = ЛБ_СогласияНаИнформированиеСервер.НаличиеДействующегоСогласия(Залогодатель);
		
		Если НаличиеЭДО Тогда
			Элементы.СтатусЭДО.Заголовок = "есть";
		Иначе
			Элементы.СтатусЭДО.Заголовок = "нет";
		КонецЕсли;
		
		Если НаличиеСогласия Тогда
			Элементы.СтатусСогласия.Заголовок = "есть";
		Иначе
			Элементы.СтатусСогласия.Заголовок = "нет";
		КонецЕсли;
		ОтмененыИзменения = Ложь;
	КонецЕсли;
	//
КонецПроцедуры

&НаКлиенте
Процедура ЗапомнитьЗначенияРеквизитовКонтактныеДанные()
	ЗначенияРеквизитовКонтактныеДанные = Новый Структура;
	ЗначенияРеквизитовКонтактныеДанные.Вставить("Телефон",                Телефон);
	ЗначенияРеквизитовКонтактныеДанные.Вставить("ТелефонДополнительный",  ТелефонДополнительный);
	ЗначенияРеквизитовКонтактныеДанные.Вставить("Email",                  Email);
	ЗначенияРеквизитовКонтактныеДанные.Вставить("КонтактноеЛицо",         КонтактноеЛицо);
	ЗначенияРеквизитовКонтактныеДанные.Вставить("ТелефонКонтактногоЛица", ТелефонКонтактногоЛица);
	ЗначенияРеквизитовКонтактныеДанные.Вставить("ФактическийАдрес",       ФактическийАдрес);
	ЗначенияРеквизитовКонтактныеДанные.Вставить("ПочтовыйАдрес",          ПочтовыйАдрес);
КонецПроцедуры // ЗапомнитьЗначенияРеквизитовКонтактныхДанных()

&НаСервере 
Функция ПроверитьИзмененияДок(СтрДок, Изменения)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ДокументЗалогодателя", СтрДок.ДокументСсылка);
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
	// ++ Сербаев 25.05.2023 TODO: Сербаев
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСтранаЭмитент КАК ДокументСтранаЭмитент,
	// -- Сербаев 25.05.2023
	// ++ Сербаев 14.06.2023 (иной документ)
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНаименованиеИногоДокумента КАК ДокументНаименованиеИногоДокумента,
	// -- Сербаев 14.06.2023
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНачалоДействия КАК ДокументНачалоДействия,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНеДействителен КАК ДокументНеДействителен, 
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДействителен КАК ДокументДействителен,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ОсновнойДУЛ КАК ОсновнойДУЛ,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ОсновнойДоп КАК ОсновнойДоп
	|ИЗ
	|	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&Дата, ДокументЗалогодателя = &ДокументЗалогодателя) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ СтрДок.ВидДокументаЗалогодателя = Выборка.ВидДокументаЗалогодателя Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменен вид документа с " + ПолучитьПредставление(Строка(Выборка.ВидДокументаЗалогодателя)) + " на " + ПолучитьПредставление(Строка(СтрДок.ВидДокументаЗалогодателя));
		КонецЕсли;
		Если НЕ СтрДок.ВидДокумента = Выборка.ВидДокумента Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменено наименование документа с " + ПолучитьПредставление(СокрЛП(Выборка.ВидДокумента)) + " на " + ПолучитьПредставление(СокрЛП(СтрДок.ВидДокумента));
		КонецЕсли;
		Если НЕ СтрДок.Гражданство = Выборка.Гражданство Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменено гражданство с " + ПолучитьПредставление(СокрЛП(Выборка.Гражданство)) + " на " + ПолучитьПредставление(СокрЛП(СтрДок.Гражданство));
		КонецЕсли;
		Если НЕ СтрДок.ДокументДатаВыдачи = Выборка.ДокументДатаВыдачи Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменена дата выдачи документа с " + ПолучитьПредставление(Формат(Выборка.ДокументДатаВыдачи, "ДФ=dd.MM.yyyy")) + " на " + ПолучитьПредставление(Формат(СтрДок.ДокументДатаВыдачи, "ДФ=dd.MM.yyyy"));
		КонецЕсли;
		Если НЕ СтрДок.ДокументКемВыдан = Выборка.ДокументКемВыдан Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменено кем выдан документ с " + ПолучитьПредставление(СокрЛП(Выборка.ДокументКемВыдан)) + " на " + ПолучитьПредставление(СокрЛП(СтрДок.ДокументКемВыдан));
		КонецЕсли;
		Если НЕ СтрДок.ДокументКодПодразделения = Выборка.ДокументКодПодразделения Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменен код подразделения с " + ПолучитьПредставление(СокрЛП(Выборка.ДокументКодПодразделения)) + " на " + ПолучитьПредставление(СокрЛП(СтрДок.ДокументКодПодразделения));
		КонецЕсли;
		Если НЕ СтрДок.ДокументСерия = Выборка.ДокументСерия Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменена серия документа с " + ПолучитьПредставление(СокрЛП(Выборка.ДокументСерия)) + " на " + ПолучитьПредставление(СокрЛП(СтрДок.ДокументСерия));
		КонецЕсли;
		Если НЕ СтрДок.ДокументНомер = Выборка.ДокументНомер Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменен номер документа с " + ПолучитьПредставление(СокрЛП(Выборка.ДокументНомер)) + " на " + ПолучитьПредставление(СокрЛП(СтрДок.ДокументНомер));
		КонецЕсли;
		Если НЕ СтрДок.ДокументСрокДействия = Выборка.ДокументСрокДействия Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменен срок действия документа с " + ПолучитьПредставление(Формат(Выборка.ДокументСрокДействия, "ДФ=dd.MM.yyyy")) + " на " + ПолучитьПредставление(Формат(СтрДок.ДокументСрокДействия, "ДФ=dd.MM.yyyy"));
		КонецЕсли;
		Если НЕ СтрДок.ДокументНеДействителен = Выборка.ДокументНеДействителен Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменен документ не действитен с " + ?(СтрДок.ДокументНеДействителен, "не установлена на установлена", "установлена на не установлена");
		КонецЕсли;  
		Если НЕ СтрДок.ДокументДействителен = Выборка.ДокументДействителен Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменен документ действитен с " + ?(СтрДок.ДокументДействителен, "не установлена на установлена", "установлена на не установлена");
		КонецЕсли;
		Если НЕ СтрДок.ОсновнойДУЛ = Выборка.ОсновнойДУЛ Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменен признак Основной ДУЛ с " + ?(Выборка.ОсновнойДУЛ, "основной", "не основной") + " на " + ?(СтрДок.ОсновнойДУЛ, "основной", "не основной");
		КонецЕсли;     
		Если НЕ СтрДок.ОсновнойДоп = Выборка.ОсновнойДоп Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменен признак Основной документ на право пребывания в РФ с " + ?(Выборка.ОсновнойДоп, "основной", "не основной") + " на " + ?(СтрДок.ОсновнойДоп, "основной", "не основной");
		КонецЕсли;
		// ++ Сербаев 25.05.2023 TODO: Сербаев
		Если НЕ СтрДок.ДокументСтранаЭмитент = Выборка.ДокументСтранаЭмитент Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменено гражданство с " + ПолучитьПредставление(СокрЛП(Выборка.ДокументСтранаЭмитент)) + " на " + ПолучитьПредставление(СокрЛП(СтрДок.ДокументСтранаЭмитент));
		КонецЕсли;
		// -- Сербаев 25.05.2023
		// ++ Сербаев 14.06.2023 (иной документ)
		Если НЕ СтрДок.ДокументНаименованиеИногоДокумента = Выборка.ДокументНаименованиеИногоДокумента Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменено наименование иного документа с " + ПолучитьПредставление(СокрЛП(Выборка.ДокументНаименованиеИногоДокумента)) + " на " + ПолучитьПредставление(СокрЛП(СтрДок.ДокументНаименованиеИногоДокумента));
		КонецЕсли;
		// -- Сербаев 14.06.2023
	КонецЦикла;	
	Возврат Изменения;
КонецФункции

&НаСервере 
Функция СохранитьДокументы(НовыйДок)
	Результат = Ложь;
	Для каждого Стр Из ДокументыЗалогодателя Цикл
		Если Стр.ДокументИзменен Тогда
			ЗаписатьДокумент = ложь;
			Изменения = "";
			Если НЕ ЗначениеЗаполнено(Стр.ДокументСсылка) Тогда //новый документ
				СпрОбъект = Справочники.ЛБ_ДокументыЗалогодателя.СоздатьЭлемент();
				СпрОбъект.Владелец = Залогодатель;
				СпрОбъект.Гражданство = Стр.Гражданство;
				СпрОбъект.ВидДокументаЗалогодателя = Стр.ВидДокументаЗалогодателя;
				СпрОбъект.ВидДокумента = Стр.ВидДокумента;
				
				СпрОбъект.Наименование = ЛБ_ОбщийМодуль.СформироватьНаименованиеДокументаЗалогодателя(Стр);
				СпрОбъект.НаименованиеПолное = ЛБ_ОбщийМодуль.СформироватьПолноеНаименованиеДокументаЗалогодателя(Стр);
				СпрОбъект.Записать();
				Стр.ДокументСсылка = СпрОбъект.Ссылка;
				Изменения = "Создан новый документ";
				ЗаписатьДокумент = Истина;
			Иначе			
				Изменения = ПроверитьИзмененияДок(Стр, Изменения);  
				Если НЕ ПустаяСтрока(Изменения) Тогда 
					СпрОбъект = Стр.ДокументСсылка.ПолучитьОбъект();
					СпрОбъект.Наименование = ЛБ_ОбщийМодуль.СформироватьНаименованиеДокументаЗалогодателя(Стр);
					СпрОбъект.НаименованиеПолное = ЛБ_ОбщийМодуль.СформироватьПолноеНаименованиеДокументаЗалогодателя(Стр);
					СпрОбъект.Записать();
					ЗаписатьДокумент = Истина;
				КонецЕсли;	
			КонецЕсли;		
			
			Если ЗаписатьДокумент Тогда			
				НоваяСтр = НовыйДок.ДокументыЗалогодателя.Добавить();
				НоваяСтр.ДокументЗалогодателя     = Стр.ДокументСсылка;
				НоваяСтр.ВидДокумента             = Стр.ВидДокумента;
				НоваяСтр.ВидДокументаЗалогодателя = Стр.ВидДокументаЗалогодателя;
				НоваяСтр.Гражданство              = Стр.Гражданство;
				// ++ Сербаев 25.05.2023 TODO: Сербаев
				НоваяСтр.ДокументСтранаЭмитент    = Стр.ДокументСтранаЭмитент;        
				// -- Сербаев 25.05.2023
				// ++ Сербаев 14.06.2023 (иной документ)
				НоваяСтр.ДокументНаименованиеИногоДокумента = Стр.ДокументНаименованиеИногоДокумента;
				// -- Сербаев 14.06.2023
				НоваяСтр.ДокументДатаВыдачи       = Стр.ДокументДатаВыдачи;
				НоваяСтр.ДокументКемВыдан         = Стр.ДокументКемВыдан;
				НоваяСтр.ДокументКодПодразделения = Стр.ДокументКодПодразделения;
				НоваяСтр.ДокументНачалоДействия   = Стр.ДокументНачалоДействия;
				НоваяСтр.ДокументСерия            = Стр.ДокументСерия;
				НоваяСтр.ДокументНомер            = Стр.ДокументНомер;
				НоваяСтр.ДокументСрокДействия     = Стр.ДокументСрокДействия;
				НоваяСтр.ДокументНеДействителен   = Стр.ДокументНеДействителен; 
				НоваяСтр.ДокументДействителен     = Стр.ДокументДействителен;
				НоваяСтр.ПричинаИзменения         = Стр.ПричинаИзменения;
				НоваяСтр.ДатаСмерти               = Стр.ДатаСмерти;
				НоваяСтр.ОсновнойДУЛ              = Стр.ОсновнойДУЛ; 
				НоваяСтр.ОсновнойДоп              = Стр.ОсновнойДоп;
				НоваяСтр.ИзмененияДок             = Изменения;
				Результат                         = Истина;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаСервере
Функция ПолучитьПредставление(Значение)
	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		Возврат "<Пустое значение>";
	Иначе
		Возврат "<" + Значение + ">";
	КонецЕсли;	
КонецФункции

&НаСервере 
Функция ПроверитьИзмененияКИ(Изменения)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРождения КАК МестоРождения,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРожденияСтрана КАК МестоРожденияСтрана,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРожденияОбласть КАК МестоРожденияОбласть,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРожденияРайон КАК МестоРожденияРайон,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРожденияНаселенныйПункт КАК МестоРожденияНаселенныйПункт,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Пол КАК Пол,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК Телефон,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ТелефонСтруктура КАК ТелефонСтруктура,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Email КАК Email,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПрописке КАК АдресПоПрописке,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПропискеСтруктура КАК АдресПоПропискеСтруктура,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ФактическийАдрес КАК ФактическийАдрес,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ФактическийАдресСтруктура КАК ФактическийАдресСтруктура,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ПочтовыйАдресСтруктура КАК ПочтовыйАдресСтруктура,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ТелефонДополнительный КАК ТелефонДополнительный,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ТелефонДополнительныйСтруктура КАК ТелефонДополнительныйСтруктура,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.КонтактноеЛицо КАК КонтактноеЛицо,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ТелефонКонтактногоЛица КАК ТелефонКонтактногоЛица,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ТелефонКонтактногоЛицаСтруктура КАК ТелефонКонтактногоЛицаСтруктура,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ИсточникИнформации КАК ИсточникИнформации,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ИсточникИнформацииДругое КАК ИсточникИнформацииДругое,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Комментарий КАК Комментарий,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаСмерти КАК ДатаСмерти,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия_А КАК Фамилия_А,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя_А КАК Имя_А,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество_А КАК Отчество_А
	|ИЗ
	|	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если НЕ СокрЛП(Фамилия) = СокрЛП(Выборка.Фамилия) Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменена фамилия с " + ПолучитьПредставление(СокрЛП(Выборка.Фамилия)) + " на " + ПолучитьПредставление(СокрЛП(Фамилия));			
		КонецЕсли;	
		Если НЕ СокрЛП(Имя) = СокрЛП(Выборка.Имя) Тогда
			Изменения =  Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменено имя с " + ПолучитьПредставление(СокрЛП(Выборка.Имя)) + " на " + ПолучитьПредставление((Имя));			
		КонецЕсли;
		Если НЕ СокрЛП(Отчество) = СокрЛП(Выборка.Отчество) Тогда 
			Изменения =  Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменено отчество с " + ПолучитьПредставление(СокрЛП(Выборка.Отчество)) + " на " + ПолучитьПредставление(СокрЛП(Отчество));			 
		КонецЕсли;
		Если НЕ Гражданство = Выборка.Гражданство Тогда
			Изменения =  Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменено гражданство с " + ПолучитьПредставление(Строка(Выборка.Гражданство)) + " на " + ПолучитьПредставление(Строка(Гражданство));
		КонецЕсли;
		Если НЕ СокрЛП(Фамилия_А) = СокрЛП(Выборка.Фамилия_А) Тогда
			Изменения =  Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменена фамилия иностранного гражданина с " + ПолучитьПредставление(СокрЛП(Выборка.Фамилия_А)) + " на " + ПолучитьПредставление(СокрЛП(Фамилия_А));
		КонецЕсли;	
		Если НЕ СокрЛП(Имя_А) = СокрЛП(Выборка.Имя_А) Тогда
			Изменения =  Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменено имя иностранного гражданина с " + ПолучитьПредставление(СокрЛП(Выборка.Имя_А)) + " на " + ПолучитьПредставление((Имя_А));
		КонецЕсли;
		Если НЕ СокрЛП(Отчество_А) = СокрЛП(Выборка.Отчество_А) Тогда 
			Изменения =  Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменено отчество иностранного гражданина с " + ПолучитьПредставление(СокрЛП(Выборка.Отчество_А)) + " на " + ПолучитьПредставление(СокрЛП(Отчество_А));
		КонецЕсли;
		Если НЕ Пол = Выборка.Пол Тогда
			Изменения =  Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменен пол с " + ПолучитьПредставление(Строка(Выборка.Пол)) + " на " + ПолучитьПредставление(Строка(Пол));
		КонецЕсли; 
		Если НЕ ДатаРождения = Выборка.ДатаРождения Тогда
			Изменения =  Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменена дата рождения с " + ПолучитьПредставление(Формат(Выборка.ДатаРождения, "ДФ=dd.MM.yyyy")) + " на " + ПолучитьПредставление(Формат(ДатаРождения, "ДФ=dd.MM.yyyy"));
		КонецЕсли;
		Если НЕ СокрЛП(МестоРождения) = СокрЛП(Выборка.МестоРождения) Тогда
			Изменения =  Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменено место рождения с " + ПолучитьПредставление(СокрЛП(Выборка.МестоРождения)) + " на " + ПолучитьПредставление(СокрЛП(МестоРождения));
		КонецЕсли;
		Если НЕ СокрЛП(Телефон) = СокрЛП(Выборка.Телефон) Тогда
			Изменения =  Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменен осн. телефон с " + ПолучитьПредставление(СокрЛП(Выборка.Телефон)) + " на " + ПолучитьПредставление(СокрЛП(Телефон));
		КонецЕсли;
		Если НЕ СокрЛП(ТелефонДополнительный) = СокрЛП(Выборка.ТелефонДополнительный) Тогда
			Изменения =  Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменен доп. телефон с " + ПолучитьПредставление(СокрЛП(Выборка.ТелефонДополнительный)) + " на " + ПолучитьПредставление(СокрЛП(ТелефонДополнительный));
		КонецЕсли;
		Если НЕ СокрЛП(Email) = СокрЛП(Выборка.Email) Тогда
			Изменения =  Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменен Email с " + ПолучитьПредставление(СокрЛП(Выборка.Email)) + " на " + ПолучитьПредставление(СокрЛП(Email));
		КонецЕсли;
		Если НЕ СокрЛП(АдресПоПрописке) = СокрЛП(Выборка.АдресПоПрописке) Тогда
			Изменения =  Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменен адрес по прописке с " + ПолучитьПредставление(СокрЛП(Выборка.АдресПоПрописке)) + " на " + ПолучитьПредставление(СокрЛП(АдресПоПрописке));
		КонецЕсли;
		Если НЕ СокрЛП(ФактическийАдрес) = СокрЛП(Выборка.ФактическийАдрес) Тогда
			Изменения =  Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменен факт. адрес с " + ПолучитьПредставление(СокрЛП(Выборка.ФактическийАдрес)) + " на " + ПолучитьПредставление(СокрЛП(ФактическийАдрес));
		КонецЕсли;
		Если НЕ СокрЛП(ПочтовыйАдрес) = СокрЛП(Выборка.ПочтовыйАдрес) Тогда
			Изменения =  Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменен почтовый адрес с " + ПолучитьПредставление(СокрЛП(Выборка.ПочтовыйАдрес)) + " на " + ПолучитьПредставление(СокрЛП(ПочтовыйАдрес));
		КонецЕсли;
		Если НЕ СокрЛП(КонтактноеЛицо) = СокрЛП(Выборка.КонтактноеЛицо) Тогда
			Изменения =  Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменено контактное лицо с " + ПолучитьПредставление(СокрЛП(Выборка.КонтактноеЛицо)) + " на " + ПолучитьПредставление(СокрЛП(КонтактноеЛицо));
		КонецЕсли;
		Если НЕ СокрЛП(ТелефонКонтактногоЛица) = СокрЛП(Выборка.ТелефонКонтактногоЛица) Тогда
			Изменения =  Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменен осн. телефон конт. лица с " + ПолучитьПредставление(СокрЛП(Выборка.ТелефонКонтактногоЛица)) + " на " + ПолучитьПредставление(СокрЛП(ТелефонКонтактногоЛица));
		КонецЕсли;
		Если НЕ СокрЛП(ИсточникИнформации) = СокрЛП(Выборка.ИсточникИнформации) Тогда
			Изменения =  Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменены источники информации с " + ПолучитьПредставление(СокрЛП(Выборка.ИсточникИнформации)) + " на " + ПолучитьПредставление(СокрЛП(ИсточникИнформации));
		КонецЕсли;
		Если НЕ СокрЛП(ИсточникИнформацииДругое) = СокрЛП(Выборка.ИсточникИнформацииДругое) Тогда
			Изменения =  Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменены доп. источники информации с " + ПолучитьПредставление(СокрЛП(Выборка.ИсточникИнформацииДругое)) + " на " + ПолучитьПредставление(СокрЛП(ИсточникИнформацииДругое));
		КонецЕсли;
		Если НЕ СокрЛП(Комментарий) = СокрЛП(Выборка.Комментарий) Тогда
			Изменения =  Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменен комментарий с " + ПолучитьПредставление(СокрЛП(Выборка.Комментарий)) + " на " + ПолучитьПредставление(СокрЛП(Комментарий));
		КонецЕсли;
		Если НЕ ДатаСмерти = Выборка.ДатаСмерти Тогда
			Изменения =  Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменена дата смерти с " + ПолучитьПредставление(Формат(Выборка.ДатаСмерти, "ДФ=dd.MM.yyyy")) + " на " + ПолучитьПредставление(Формат(ДатаСмерти, "ДФ=dd.MM.yyyy"));
		КонецЕсли;
	КонецЕсли;
	Возврат Изменения;
КонецФункции

&НаСервере 
Функция ПроверитьИзмененияАнкеты(Изменения)
	
	ЗапросБ = Новый Запрос;
	ЗапросБ.УстановитьПараметр("Залогодатель", Залогодатель);  	
	ЗапросБ.Текст = "ВЫБРАТЬ
	|	ЛБ_БенефициарныеВладельцы.Бенефициар КАК Бенефициар,
	|	ЛБ_БенефициарныеВладельцы.ВидПолученияИнформации КАК ВидПолученияИнформации
	|ИЗ
	|	РегистрСведений.ЛБ_БенефициарныеВладельцы КАК ЛБ_БенефициарныеВладельцы
	|ГДЕ
	|	ЛБ_БенефициарныеВладельцы.Залогодатель = &Залогодатель
	|	И ЛБ_БенефициарныеВладельцы.Регистратор = &Регистратор
	|АВТОУПОРЯДОЧИВАНИЕ"; 
	
	ЗапросО = Новый Запрос;
	ЗапросО.УстановитьПараметр("Залогодатель", Залогодатель);
	ЗапросО.Текст = "ВЫБРАТЬ
	|	ЛБ_ОтказыКлиентамВОбслуживании.ПричинаОтказа КАК ПричинаОтказа,
	|	ЛБ_ОтказыКлиентамВОбслуживании.ДатаОтказа КАК ДатаОтказа,
	|	ЛБ_ОтказыКлиентамВОбслуживании.СуммаЗаймаОтказ КАК СуммаЗаймаОтказ
	|ИЗ
	|	РегистрСведений.ЛБ_ОтказыКлиентамВОбслуживании КАК ЛБ_ОтказыКлиентамВОбслуживании
	|ГДЕ
	|	ЛБ_ОтказыКлиентамВОбслуживании.Регистратор = &Регистратор
	|	И ЛБ_ОтказыКлиентамВОбслуживании.Залогодатель = &Залогодатель";
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ДатаОформленияАнкеты КАК ДатаОформленияАнкеты,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ИНН КАК ИНН,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.СНИЛС КАК СНИЛС,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ТипФизЛица КАК ТипФизЛица,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.КатегорииФизЛица КАК КатегорииФизЛица,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ФинансовоеПоложениеСтабильное КАК ФинансовоеПоложениеСтабильное,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ДеловаяРепутацияПоложительная КАК ДеловаяРепутацияПоложительная,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ИсточникПроисхожденияИмущества КАК ИсточникПроисхожденияИмущества,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ИсточникПроисхожденияИмуществаИной КАК ИсточникПроисхожденияИмуществаИной,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ХарактерОтношений КАК ХарактерОтношений,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ИсточникПроисхожденияДенежныхСредств КАК ИсточникПроисхожденияДенежныхСредств,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ИсточникПроисхожденияДенежныхСредствИной КАК ИсточникПроисхожденияДенежныхСредствИной,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.УровеньРиска КАК УровеньРиска,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ЗалогодательБенефициарныйВладелец КАК ЗалогодательБенефициарныйВладелец,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ЯвляетсяИПДЛ КАК ЯвляетсяИПДЛ,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.КатегорияКлиентаИПДЛ КАК КатегорияКлиентаИПДЛ,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ДопИнформацияИПДЛ КАК ДопИнформацияИПДЛ,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ДолжностьИПДЛ КАК ДолжностьИПДЛ,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.РаботодательИПДЛ КАК РаботодательИПДЛ,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.РазрешениеИПДЛ КАК РазрешениеИПДЛ,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ЯвляетсяДЛПМО_РДПЛ КАК ЯвляетсяДЛПМО_РДПЛ,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.КатегорияДЛПМО_РДПЛ КАК КатегорияДЛПМО_РДПЛ,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ДопИнформацияДЛПМО_РДПЛ КАК ДопИнформацияДЛПМО_РДПЛ,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ДолжностьДЛПМО_РДПЛ КАК ДолжностьДЛПМО_РДПЛ,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.РаботодательДЛПМО_РДПЛ КАК РаботодательДЛПМО_РДПЛ,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.РазрешениеДЛПМО_РДПЛ КАК РазрешениеДЛПМО_РДПЛ,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ОтветственноеЛицоИПДЛ КАК ОтветственноеЛицоИПДЛ,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.ОтветственноеЛицоДЛПМО_РДПЛ КАК ОтветственноеЛицоДЛПМО_РДПЛ,
	|	ЛБ_АнкетаЗалогодателяСрезПоследних.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрСведений.ЛБ_АнкетаЗалогодателя.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_АнкетаЗалогодателяСрезПоследних"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Если НЕ ДатаОформленияАнкеты = Выборка.ДатаОформленияАнкеты Тогда
			Изменения =  Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменена дата оформления с " + ПолучитьПредставление(Формат(Выборка.ДатаОформленияАнкеты, "ДФ=dd.MM.yyyy")) + " на " + ПолучитьПредставление(Формат(ДатаОформленияАнкеты, "ДФ=dd.MM.yyyy"));
		КонецЕсли;
		Если НЕ СокрЛП(ИНН) = СокрЛП(Выборка.ИНН) Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменен ИНН с " + ПолучитьПредставление(СокрЛП(Выборка.ИНН)) + " на " + ПолучитьПредставление(СокрЛП(ИНН));			
		КонецЕсли;   
		Если НЕ СокрЛП(СНИЛС) = СокрЛП(Выборка.СНИЛС) Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменен СНИЛС с " + ПолучитьПредставление(СокрЛП(Выборка.СНИЛС)) + " на " + ПолучитьПредставление(СокрЛП(СНИЛС));			
		КонецЕсли;
		Если НЕ КатегорииФизЛица = Выборка.КатегорииФизЛица Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменена категория физ. лица с " + ПолучитьПредставление(Выборка.КатегорииФизЛица) + " на " + ПолучитьПредставление(КатегорииФизЛица);			
		КонецЕсли; 
		Если НЕ ФинансовоеПоложениеСтабильное = Выборка.ФинансовоеПоложениеСтабильное Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменено фин. положение физ. лица с " + ?(Выборка.ФинансовоеПоложениеСтабильное, "стабильное", "не стабильное") + " на " + ?(ФинансовоеПоложениеСтабильное, "стабильное", "не стабильное");			
		КонецЕсли;
		Если НЕ ДеловаяРепутацияПоложительная = Выборка.ДеловаяРепутацияПоложительная Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменена положительная деловая репутация физ. лица с " + ?(Выборка.ДеловаяРепутацияПоложительная, "да", "нет") + " на " + ?(ДеловаяРепутацияПоложительная, "да", "нет");			
		КонецЕсли;  
		Если НЕ ИсточникПроисхожденияИмущества = Выборка.ИсточникПроисхожденияИмущества Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменен источник происхождения имущества с " + ПолучитьПредставление(Выборка.ИсточникПроисхожденияИмущества) + " на " + ПолучитьПредставление(ИсточникПроисхожденияИмущества);			
		КонецЕсли; 
		Если НЕ СокрЛП(ИсточникПроисхожденияИмуществаИной) = СокрЛП(Выборка.ИсточникПроисхожденияИмуществаИной) Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменен иной источник происхождения имущества с " + ПолучитьПредставление(СокрЛП(Выборка.ИсточникПроисхожденияИмуществаИной)) + " на " + ПолучитьПредставление(СокрЛП(ИсточникПроисхожденияИмуществаИной));			
		КонецЕсли;
		Если НЕ ИсточникПроисхожденияДенежныхСредств = Выборка.ИсточникПроисхожденияДенежныхСредств Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменен источник происхождения ден. средств с " + ПолучитьПредставление(Выборка.ИсточникПроисхожденияДенежныхСредств) + " на " + ПолучитьПредставление(ИсточникПроисхожденияДенежныхСредств);			
		КонецЕсли; 
		Если НЕ СокрЛП(ИсточникПроисхожденияДенежныхСредствИной) = СокрЛП(Выборка.ИсточникПроисхожденияДенежныхСредствИной) Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменен иной источник происхождения ден. средств с " + ПолучитьПредставление(СокрЛП(Выборка.ИсточникПроисхожденияДенежныхСредствИной)) + " на " + ПолучитьПредставление(СокрЛП(ИсточникПроисхожденияДенежныхСредствИной));			
		КонецЕсли; 
		Если НЕ СокрЛП(УровеньРиска) = СокрЛП(Выборка.УровеньРиска) Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменены сведения об уровне риска с " + ПолучитьПредставление(СокрЛП(Выборка.УровеньРиска)) + " на " + ПолучитьПредставление(СокрЛП(УровеньРиска));			
		КонецЕсли; 
		Если НЕ ЗалогодательБенефициарныйВладелец = Выборка.ЗалогодательБенефициарныйВладелец Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменен признак клиент-бенефициарный владелец с " + ?(Выборка.ЗалогодательБенефициарныйВладелец, "да", "нет") + " на " + ?(ЗалогодательБенефициарныйВладелец, "да", "нет");			
		КонецЕсли; 
		Если НЕ ЯвляетсяИПДЛ = Выборка.ЯвляетсяИПДЛ Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменен признак является ИПДЛ с " + ?(Выборка.ЯвляетсяИПДЛ, "да", "нет") + " на " + ?(ЯвляетсяИПДЛ, "да", "нет");			
		КонецЕсли; 
		Если НЕ КатегорияКлиентаИПДЛ = Выборка.КатегорияКлиентаИПДЛ Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменена категория ИПДЛ с " + ПолучитьПредставление(Выборка.КатегорияКлиентаИПДЛ) + " на " + ПолучитьПредставление(КатегорияКлиентаИПДЛ);			
		КонецЕсли;
		Если НЕ СокрЛП(ДопИнформацияИПДЛ) = СокрЛП(Выборка.ДопИнформацияИПДЛ) Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменена уточняющая информация ИПДЛ с " + ПолучитьПредставление(СокрЛП(Выборка.ДопИнформацияИПДЛ)) + " на " + ПолучитьПредставление(СокрЛП(ДопИнформацияИПДЛ));			
		КонецЕсли;
		Если НЕ СокрЛП(ДолжностьИПДЛ) = СокрЛП(Выборка.ДолжностьИПДЛ) Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменена информация о должности клиента ИПДЛ с " + ПолучитьПредставление(СокрЛП(Выборка.ДолжностьИПДЛ)) + " на " + ПолучитьПредставление(СокрЛП(ДолжностьИПДЛ));			
		КонецЕсли;
		Если НЕ СокрЛП(РаботодательИПДЛ) = СокрЛП(Выборка.РаботодательИПДЛ) Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменена информация о работодателе ИПДЛ с " + ПолучитьПредставление(СокрЛП(Выборка.РаботодательИПДЛ)) + " на " + ПолучитьПредставление(СокрЛП(РаботодательИПДЛ));			
		КонецЕсли;
		Если НЕ РазрешениеИПДЛ = Выборка.РазрешениеИПДЛ Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменено разрешение на обслуживание клиента ИПДЛ с " + ?(Выборка.РазрешениеИПДЛ, "да", "нет") + " на " + ?(РазрешениеИПДЛ, "да", "нет");			
		КонецЕсли;       
		Если НЕ ОтветственноеЛицоИПДЛ = Выборка.ОтветственноеЛицоИПДЛ Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменена информация об отв. лице, давшем разрешение на обслуживание клиента ИПДЛ с " + ПолучитьПредставление(Выборка.ОтветственноеЛицоИПДЛ) + " на " + ПолучитьПредставление(ОтветственноеЛицоИПДЛ);			
		КонецЕсли;
		Если НЕ ЯвляетсяДЛПМО_РДПЛ = Выборка.ЯвляетсяДЛПМО_РДПЛ Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменен признак является ДЛПМО/РДПЛ с " + ?(Выборка.ЯвляетсяДЛПМО_РДПЛ, "да", "нет") + " на " + ?(ЯвляетсяДЛПМО_РДПЛ, "да", "нет");			
		КонецЕсли; 
		Если НЕ КатегорияДЛПМО_РДПЛ = Выборка.КатегорияДЛПМО_РДПЛ Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменена категория ДЛПМО/РДПЛ с " + ПолучитьПредставление(Выборка.КатегорияДЛПМО_РДПЛ) + " на " + ПолучитьПредставление(КатегорияДЛПМО_РДПЛ);			
		КонецЕсли;
		Если НЕ СокрЛП(ДопИнформацияДЛПМО_РДПЛ) = СокрЛП(Выборка.ДопИнформацияДЛПМО_РДПЛ) Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменена уточняющая информация ДЛПМО/РДПЛ с " + ПолучитьПредставление(СокрЛП(Выборка.ДопИнформацияДЛПМО_РДПЛ)) + " на " + ПолучитьПредставление(СокрЛП(ДопИнформацияДЛПМО_РДПЛ));			
		КонецЕсли;
		Если НЕ СокрЛП(ДолжностьДЛПМО_РДПЛ) = СокрЛП(Выборка.ДолжностьДЛПМО_РДПЛ) Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменена информация о должности клиента ДЛПМО/РДПЛ с " + ПолучитьПредставление(СокрЛП(Выборка.ДолжностьДЛПМО_РДПЛ)) + " на " + ПолучитьПредставление(СокрЛП(ДолжностьДЛПМО_РДПЛ));			
		КонецЕсли;
		Если НЕ СокрЛП(РаботодательДЛПМО_РДПЛ) = СокрЛП(Выборка.РаботодательДЛПМО_РДПЛ) Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменена информация о работодателе ДЛПМО/РДПЛ с " + ПолучитьПредставление(СокрЛП(Выборка.РаботодательДЛПМО_РДПЛ)) + " на " + ПолучитьПредставление(СокрЛП(РаботодательДЛПМО_РДПЛ));			
		КонецЕсли;
		Если НЕ РазрешениеДЛПМО_РДПЛ = Выборка.РазрешениеДЛПМО_РДПЛ Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменено разрешение на обслуживание клиента ИПДЛ с " + ?(Выборка.РазрешениеДЛПМО_РДПЛ, "да", "нет") + " на " + ?(РазрешениеДЛПМО_РДПЛ, "да", "нет");			
		КонецЕсли; 
		Если НЕ ОтветственноеЛицоДЛПМО_РДПЛ = Выборка.ОтветственноеЛицоДЛПМО_РДПЛ Тогда
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменена информация об отв. лице, давшем разрешение на обслуживание клиента ДЛПМО_РДПЛ с " + ПолучитьПредставление(Выборка.ОтветственноеЛицоДЛПМО_РДПЛ) + " на " + ПолучитьПредставление(ОтветственноеЛицоДЛПМО_РДПЛ);			
		КонецЕсли;
		ЗапросБ.УстановитьПараметр("Регистратор", Выборка.Регистратор);
		ТаблицаБ = ЗапросБ.Выполнить().Выгрузить();  
		СписокБенефициаровНач = "";
		Для каждого Стр из ТаблицаБ Цикл 
			СписокБенефициаровНач = СписокБенефициаровНач + ?(ПустаяСтрока(СписокБенефициаровНач), "", "; ") + СокрЛП(Стр.Бенефициар) + " " + Строка(Стр.ВидПолученияИнформации);
		КонецЦикла;	  
		СписокБенефициаровКон = "";
		Для каждого Стр из Бенефициары Цикл 
			СписокБенефициаровКон = СписокБенефициаровКон + ?(ПустаяСтрока(СписокБенефициаровКон), "", "; ") + СокрЛП(Стр.Бенефициар) + " " + Строка(Стр.ВидПолученияИнформации);
		КонецЦикла;	
		Если НЕ СокрЛП(СписокБенефициаровНач) = СокрЛП(СписокБенефициаровКон) Тогда 
			Изменения = Изменения + ?(ПустаяСтрока(Изменения), "", Символы.ПС) + "Изменен список бенефициаров с " + ПолучитьПредставление(СписокБенефициаровНач) + " на " + ПолучитьПредставление(СписокБенефициаровКон);			
		КонецЕсли;
	КонецЕсли;
	Возврат Изменения;
КонецФункции

&НаСервере 
Функция ПроверитьИзмененияСтатусовКлиента() 
	ЕстьИзмененияСтатусов = ложь;  
	
	ПроверитьСтатусПочетный();
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", Дата); 
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель); 	
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус,
	|	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Используется КАК Используется,
	|	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.СрокДействия КАК СрокДействия,
	|	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Период УБЫВ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для каждого Стр Из ТаблицаДопСтатусов Цикл 	
		Отбор = Новый Структура;
		Отбор.Вставить("Статус", Стр.статус); 
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
		Если НЕ Строки.Количество() = 0 Тогда 
			СтрС = Строки.Получить(0);  
			ИспользуетсяС = СтрС.Используется;
			Если ИспользуетсяС  Тогда  
				Если ЗначениеЗаполнено(СтрС.СрокДействия) И СтрС.СрокДействия < НачалоДня(Дата) Тогда
					ИспользуетсяС = Ложь;
				КонецЕсли;	 
			КонецЕсли;	
			
			Если НЕ Стр.Используется = ИспользуетсяС Тогда	
				Стр.ЕстьИзменения = Истина; 
				ЕстьИзмененияСтатусов = Истина;	
			КонецЕсли;
			Если НЕ Стр.СрокДействия = СтрС.СрокДействия Тогда
				Стр.ЕстьИзменения = Истина; 
				ЕстьИзмененияСтатусов = Истина;	
			КонецЕсли; 
			Если НЕ СокрЛП(Стр.Комментарий) = СокрЛП(СтрС.Комментарий) Тогда
				Стр.ЕстьИзменения = Истина; 
				ЕстьИзмененияСтатусов = Истина;	
			КонецЕсли;
		Иначе
			Стр.ЕстьИзменения = Истина; 
			ЕстьИзмененияСтатусов = Истина;	
		КонецЕсли;		
	КонецЦикла;
	
	//Для каждого Стр Из ТаблицаЗапроса Цикл  
	//	Отбор = Новый Структура;
	//	Отбор.Вставить("Статус", Стр.статус); 
	//	Строки = ТаблицаДопСтатусов.НайтиСтроки(Отбор);
	//	Если Строки.Количество() = 0 Тогда 
	//		Если Стр.СрокДействия = Дата(1,1, 1) Тогда
	//			Продолжить;
	//		КонецЕсли;	
	//		Если Стр.СрокДействия < Дата И Стр.Используется Тогда
	//		    СтрС = Строки.Получить(0); 
	//			СтрС.ЕстьИзменения = Истина;
	//			ЕстьИзмененияСтатусов = Истина;
	//		КонецЕсли;
	//	КонецЕсли;	
	//Конеццикла;     	
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_СтатусыЗалогодателейСлужебныеСрезПоследних.Статус КАК Статус,
	|	ЛБ_СтатусыЗалогодателейСлужебныеСрезПоследних.Используется КАК Используется,
	|	ЛБ_СтатусыЗалогодателейСлужебныеСрезПоследних.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.ЛБ_СтатусыЗалогодателейСлужебные.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_СтатусыЗалогодателейСлужебныеСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛБ_СтатусыЗалогодателейСлужебныеСрезПоследних.Период УБЫВ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для каждого Стр Из ТаблицаСлужебныхСтатусов Цикл  
		Отбор = Новый Структура;
		Отбор.Вставить("Статус", Стр.статус); 
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
		Если НЕ Строки.Количество() = 0 Тогда 
			СтрС = Строки.Получить(0);
			
			Если НЕ Стр.Используется = СтрС.Используется Тогда	
				Стр.ЕстьИзменения = Истина; 
				ЕстьИзмененияСтатусов = Истина;		
			КонецЕсли;
			Если НЕ СокрЛП(Стр.Комментарий) = СокрЛП(СтрС.Комментарий) Тогда
				Стр.ЕстьИзменения = Истина; 
				ЕстьИзмененияСтатусов = Истина;	
			КонецЕсли;
		Иначе
			Стр.ЕстьИзменения = Истина; 
			ЕстьИзмененияСтатусов = Истина;	
		КонецЕсли;	
	КонецЦикла;	 
	
	Возврат ЕстьИзмененияСтатусов;
КонецФункции

&НаСервере 
Процедура СохранитьКарточкуЗалогодателя(Проверять = Истина)
	
	ЕстьИзменения = Ложь;
	НовыйДок = Документы.ЛБ_КарточкаЗалогодателя.СоздатьДокумент();
	НовыйДок.Дата = ТекущаяДата();
	НовыйДок.Залогодатель = Залогодатель;
	НовыйДок.ПричинаИзменения = ПричинаИзменения;
	НовыйДок.ПричинаИзмененияФИО = ПричинаИзмененияФИО;    
	НовыйДок.ОснованиеИзмененияФИО = ОснованиеИзмененияФИО;
	НовыйДок.ПричинаИзмененияАдресаПоПрописке = ПричинаИзмененияАдресаПоПрописке;
	НовыйДок.ПричинаИзмененияФактическогоАдреса = ПричинаИзмененияФактическогоАдреса;
	НовыйДок.ПричинаИзмененияПочтовогоАдреса = ПричинаИзмененияПочтовогоАдреса;	
	НовыйДок.Ответственный = ПараметрыСеанса.ТекущийСотрудник; 
	НовыйДок.ОтветственныйПользователь = ПараметрыСеанса.ТекущийПользователь;
	НовыйДок.ОтветственныйЛомбард = ОтветственныйЛомбард;	//+++ МоисеевЕС 20250526
	НовыйДок.СогласиеНаСМСРассылку = СогласиеНаСМСРассылку;
	
	ИзмененияКИ = "";  
	ИзмененияАнкета = ""; 
	ИзмененияСтатусов = ПроверитьИзмененияСтатусовКлиента();
	Если Проверять Тогда
		ИзмененияКИ = ПроверитьИзмененияКИ(ИзмененияКИ); 
		Если ЕстьАнкета Тогда
			ИзмененияАнкета = ПроверитьИзмененияАнкеты(ИзмененияАнкета); 
		Иначе	
			ИзмененияАнкета = "Заполнена анкета клиента"; 
		КонецЕсли;	 		
		Если НЕ ПустаяСтрока(ИзмененияКИ) ИЛИ НЕ ПустаяСтрока(ИзмененияАнкета) ИЛИ НЕ ПустаяСтрока(ИзмененияСтатусов) ИЛИ ОтказОпераций Тогда 
			НовыйДок.ИзмененияКИ = ИзмененияКИ;
			НовыйДок.ИзмененияАнкета = ИзмененияАнкета;  
			ЕстьИзменения = Истина;
		КонецЕсли;	
	Иначе	
		НовыйДок.ИзмененияКИ = "Создан новый клиент";
		НовыйДок.ИзмененияАнкета = "Заполнена анкета клиента";
		ЕстьИзменения = Истина;
	КонецЕсли;			
	НовыйДок.Email = Email;
	НовыйДок.АдресПоПрописке = АдресПоПрописке;                                          
	НовыйДок.АдресПоПропискеСтруктура = АдресПоПропискеСтруктура;
	НовыйДок.АдресПоПропискеВручную = АдресПоПропискеВручную;
	НовыйДок.Гражданство = Гражданство;
	НовыйДок.ДатаРождения = ДатаРождения;
	НовыйДок.МестоРождения = МестоРождения;
	НовыйДок.МестоРожденияСтрана = МестоРожденияСтрана;
	НовыйДок.МестоРожденияОбласть = МестоРожденияОбласть;
	НовыйДок.МестоРожденияРайон = МестоРожденияРайон;
	НовыйДок.МестоРожденияНаселенныйПункт = МестоРожденияНаселенныйПункт;
	НовыйДок.Пол = Пол;
	НовыйДок.ПочтовыйАдрес = ПочтовыйАдрес;
	НовыйДок.ПочтовыйАдресСтруктура = ПочтовыйАдресСтруктура;
	НовыйДок.ПочтовыйАдресВручную = ПочтовыйАдресВручную;
	НовыйДок.Телефон = Телефон;
	НовыйДок.ТелефонСтруктура = ТелефонСтруктура;
	НовыйДок.ФактическийАдрес = ФактическийАдрес;
	НовыйДок.ФактическийАдресСтруктура =  ФактическийАдресСтруктура;
	НовыйДок.ФактическийАдресВручную = ФактическийАдресВручную;
	НовыйДок.Имя = Имя;
	НовыйДок.Фамилия = Фамилия;
	НовыйДок.Отчество = Отчество;
	НовыйДок.ТелефонДополнительный = ТелефонДополнительный;
	НовыйДок.ТелефонДополнительныйСтруктура = ТелефонДополнительныйСтруктура;
	НовыйДок.КонтактноеЛицо = КонтактноеЛицо;
	НовыйДок.ТелефонКонтактногоЛица = ТелефонКонтактногоЛица;
	НовыйДок.ТелефонКонтактногоЛицаСтруктура = ТелефонКонтактногоЛицаСтруктура;
	НовыйДок.ДатаСмерти = ДатаСмерти;
	НовыйДок.Комментарий = Комментарий;
	НовыйДок.Имя_А = Имя_А;
	НовыйДок.Фамилия_А = Фамилия_А;
	НовыйДок.Отчество_А = Отчество_А;
	НовыйДок.ИсточникИнформации = ИсточникИнформации;
	НовыйДок.ИсточникИнформацииДругое = ИсточникИнформацииДругое; 
	НовыйДок.ДатаОформленияАнкеты = ДатаОформленияАнкеты;
	НовыйДок.ИНН = ИНН;   
	НовыйДок.СНИЛС = СНИЛС; 
	НовыйДок.ТипФизЛица = ТипФизЛица;
	НовыйДок.КатегорииФизЛица = КатегорииФизЛица;
	НовыйДок.ФинансовоеПоложениеСтабильное = ФинансовоеПоложениеСтабильное;
	НовыйДок.ДеловаяРепутацияПоложительная = ДеловаяРепутацияПоложительная;
	НовыйДок.ИсточникПроисхожденияИмущества = ИсточникПроисхожденияИмущества;
	НовыйДок.ИсточникПроисхожденияИмуществаИной = ИсточникПроисхожденияИмуществаИной;
	НовыйДок.ХарактерОтношений = ХарактерОтношений;
	НовыйДок.ИсточникПроисхожденияДенежныхСредств = ИсточникПроисхожденияДенежныхСредств;
	НовыйДок.ИсточникПроисхожденияДенежныхСредствИной = ИсточникПроисхожденияДенежныхСредствИной;
	НовыйДок.УровеньРиска = УровеньРиска;
	НовыйДок.ЗалогодательБенефициарныйВладелец = ЗалогодательБенефициарныйВладелец;
	НовыйДок.ЯвляетсяИПДЛ = ЯвляетсяИПДЛ;
	НовыйДок.КатегорияКлиентаИПДЛ = КатегорияКлиентаИПДЛ;
	НовыйДок.ДопИнформацияИПДЛ = ДопИнформацияИПДЛ;
	НовыйДок.ДолжностьИПДЛ = ДолжностьИПДЛ;
	НовыйДок.РаботодательИПДЛ = РаботодательИПДЛ;
	НовыйДок.РазрешениеИПДЛ = РазрешениеИПДЛ; 
	НовыйДок.ОтветственноеЛицоИПДЛ =ОтветственноеЛицоИПДЛ; 
	НовыйДок.ЯвляетсяДЛПМО_РДПЛ = ЯвляетсяДЛПМО_РДПЛ;
	НовыйДок.КатегорияДЛПМО_РДПЛ = КатегорияДЛПМО_РДПЛ;
	НовыйДок.ДопИнформацияДЛПМО_РДПЛ = ДопИнформацияДЛПМО_РДПЛ;
	НовыйДок.ДолжностьДЛПМО_РДПЛ = ДолжностьДЛПМО_РДПЛ;
	НовыйДок.РаботодательДЛПМО_РДПЛ = РаботодательДЛПМО_РДПЛ;
	НовыйДок.РазрешениеДЛПМО_РДПЛ = РазрешениеДЛПМО_РДПЛ;
	НовыйДок.ОтветственноеЛицоДЛПМО_РДПЛ = ОтветственноеЛицоДЛПМО_РДПЛ;	
	НовыйДок.СменилсяАдресПрописки = СменилсяАдресПрописки;  
	НовыйДок.СменилсяФактическийАдрес = СменилсяФактическийАдрес;
	НовыйДок.СменилсяПочтовыйАдрес = СменилсяПочтовыйАдрес; 
	//+МАН 16.01.25
	//НовыйДок.Резиденство = Резиденство;
	//-МАН
	
	//Савранин 19.09.2025
	ПроверитьНаСотрудника(НовыйДок);
	
	Для каждого СтрС из ТаблицаДопСтатусов Цикл 
		Если стрС.ЕстьИзменения Тогда
			НоваястрС = НовыйДок.ДополнительныеСтатусы.Добавить(); 
			НоваястрС.Статус = стрС.Статус; 
			НоваястрС.СрокДействия = стрС.СрокДействия;
			НоваястрС.Используется = стрС.Используется; 
			НоваястрС.Комментарий = стрС.Комментарий;
		КонецЕсли;	
	КонецЦикла; 
	
	Для каждого СтрС из ТаблицаСлужебныхСтатусов Цикл 
		Если стрС.ЕстьИзменения Тогда
			НоваястрС = НовыйДок.СлужебныеСтатусы.Добавить(); 
			НоваястрС.Статус = стрС.Статус;
			НоваястрС.Используется = стрС.Используется; 
			НоваястрС.Комментарий = стрС.Комментарий;
		КонецЕсли;	
	КонецЦикла;   
	
	Для каждого СтрБ из Бенефициары Цикл
		НоваястрБ = НовыйДок.Бенефициары.Добавить();
		НоваястрБ.Бенефициар = стрБ.Бенефициар;
		НоваястрБ.ВидПолученияИнформации = стрБ.ВидПолученияИнформации;
	Конеццикла;	  
	
	Если ОтказОпераций Тогда
		НоваяСтрО = НовыйДок.ОтказыКлиентам.Добавить();
		НоваяСтрО.ПричинаОтказа = ПричинаОтказа;
		НоваяСтрО.ДатаОтказа = ДатаОтказа; 
		НоваяСтрО.СуммаЗаймаОтказ = СуммаЗаймаОтказ; 
	КонецЕсли;	
	

	Результат = СохранитьДокументы(НовыйДок);
	ЕстьИзменения = ?(Результат, Результат, ЕстьИзменения);
	
	Если ЕстьИзменения Тогда		
		Попытка
			НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			НовыйДок.Записать(РежимЗаписиДокумента.Запись); 
			ОбщегоНазначения.СообщитьПользователю("Ошибка при записи карточки клиента! Обратитесь к разработчикам.");     
		КонецПопытки; 
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПроверитьФИОЗалогодателя()
	СтруктураВозврата = ЛБ_ОбщийМодуль.ПроверитьФИОЗалогодателя(Фамилия, Имя, Отчество);
	Если НЕ СтруктураВозврата.Результат Тогда
		Сообщить(СтруктураВозврата.Сообщение, СтатусСообщения.Важное);
	КонецЕсли;
	Возврат СтруктураВозврата.Результат;
КонецФункции

&НаСервере
Функция ПроверитьФИОЗалогодателя_А()
	Если НЕ ПустаяСтрока(Фамилия_А) ИЛИ НЕ ПустаяСтрока(Имя_А) ИЛИ НЕ ПустаяСтрока(Отчество_А) Тогда
		СтруктураВозврата = ЛБ_ОбщийМодуль.ПроверитьФИОЗалогодателя(Фамилия_А, Имя_А, Отчество_А, Ложь);
		Если НЕ СтруктураВозврата.Результат Тогда
			Сообщить(СтруктураВозврата.Сообщение, СтатусСообщения.Важное);
		КонецЕсли;
		Возврат СтруктураВозврата.Результат;
	Иначе
		Возврат Истина;
	КонецЕсли;	
КонецФункции

&НаСервере
Функция ПроверитьДатуРождения(ВозрастЗалогодателя = неопределено)
	Результат = Истина;
	Если ВозрастЗалогодателя = неопределено Тогда
		ВозрастЗалогодателя = ЛБ_ОбщийМодуль.ВычислитьВозраст(ДатаРождения);
	КонецЕсли;	
	ОписаниеВ = ЛБ_ОбщегоНазначения.ОписаниеВозраста(ВозрастЗалогодателя);
	Элементы.ДекорацияВозраст.Заголовок = "Возраст " + Строка(ВозрастЗалогодателя) + " " + ОписаниеВ;
	Если ДатаРождения > Дата Тогда
		//Сообщить("Дата рождения клиента позже текущей даты! Проверьте правильность ввода даты рождения.", СтатусСообщения.Информация);
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Дата рождения клиента позже текущей даты! Проверьте правильность ввода даты рождения.'"), , , "ДатаРождения");
		Результат = Ложь;
		// ++ Сербаев 15.06.2023 
		//ИначеЕсли ДатаРождения <= Дата(Год(Дата)-100, 01, 01) Тогда	
	ИначеЕсли ДатаРождения <= ДобавитьМесяц(ТекущаяДатаСеанса(), -12 * 100) Тогда
		// -- Сербаев 15.06.2023
		//Сообщить("Клиенту " + Строка(ВозрастЗалогодателя) + " " + ОписаниеВ + "?! Проверьте правильность ввода даты рождения.", СтатусСообщения.Информация);
		СообщениеТекст = СтрШаблон("Клиенту %1 %2?! Проверьте правильность ввода даты рождения.", Строка(ВозрастЗалогодателя), ОписаниеВ);
		ОбщегоНазначения.СообщитьПользователю(СообщениеТекст, , , "ДатаРождения");
		Результат = Ложь;
	ИначеЕсли ВозрастЗалогодателя < 18 Тогда
		//Сообщить("Внимание! Клиенту " + Строка(ВозрастЗалогодателя) + " " + ОписаниеВ + ". Выдача займов и прием оплаты по договору займа от лиц, не достигших 18 лет, не осуществляется!", СтатусСообщения.Важное);
		СообщениеТекст = СтрШаблон("Внимание! Клиенту %1 %2. Выдача займов и прием оплаты по договору займа от лиц, не достигших 18 лет, не осуществляется!", Строка(ВозрастЗалогодателя), ОписаниеВ);
		//ОбщегоНазначения.СообщитьПользователю(СообщениеТекст, , , "ДатаРождения");
		ОбщегоНазначения.СообщитьПользователю(СообщениеТекст, , , );
		//Результат = Ложь;
	КонецЕсли;	
	Возврат Результат;
КонецФункции

&НаСервере
Функция ПроверитьEmail()
	Если НЕ Пустаястрока(Email) И Найти(Email, "@") = 0 Тогда
		Сообщить("Не корректный адрес Email!");
		Возврат Ложь;
	КонецЕсли;   
	Возврат Истина;
КонецФункции

&НаСервере
Функция ПроверитьТелефоны()
	ТелефоныОК = Истина;
	Если НЕ ПустаяСтрока(Телефон) Тогда
		ТелефонДляПроверки = СокрЛП(Телефон);
		ТелефонДляПроверки = СтрЗаменить(ТелефонДляПроверки, " ", "");
		ТелефонДляПроверки = СтрЗаменить(ТелефонДляПроверки, "+", "");
		ТелефонДляПроверки = СтрЗаменить(ТелефонДляПроверки, "(", "");
		ТелефонДляПроверки = СтрЗаменить(ТелефонДляПроверки, ")", "");
		Если НЕ СтрДлина(ТелефонДляПроверки) = 11 Тогда
			ТелефоныОК = ложь;
			Сообщить("Неверная длина сотового телефона клиента!"); 
			// ++ Сербаев 07.06.2023 (снять запрет с указания одного номера сотового телефона в карточках разных клиентов)
			//ИначеЕсли НЕ ЗначениеЗаполнено(Залогодатель) Тогда
			//	Запрос = Новый Запрос; 
			//	Запрос.УстановитьПараметр("Телефон", СокрЛП(Телефон));
			//    Запрос.Текст = "ВЫБРАТЬ
			//           |	ЛБ_КонтактнаяИнформацияЗалогодателей.Залогодатель КАК Залогодатель
			//           |ИЗ
			//           |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей КАК ЛБ_КонтактнаяИнформацияЗалогодателей
			//           |ГДЕ
			//           |	ЛБ_КонтактнаяИнформацияЗалогодателей.Телефон = &Телефон"; 
			//	Выборка = Запрос.Выполнить().Выбрать();
			//	Если Выборка.Следующий() Тогда 
			//		ТелефоныОК = ложь;
			//        Сообщить("В базе уже есть клиент " + СокрЛП(Выборка.Залогодатель) + " с тем же номером сотового телефона!"); 
			//	КонецЕсли;
			// -- Сербаев 07.06.2023
		КонецЕсли;  
		ТолькоНули = Истина;   
		ТелефонДляПроверки = Прав(ТелефонДляПроверки, СтрДлина(ТелефонДляПроверки)-2);
		Для сч = 1 по СтрДлина(СокрЛП(ТелефонДляПроверки)) Цикл 
			Если Сред(СокрЛП(ТелефонДляПроверки), сч, 1) = "0" Тогда
				Продолжить;
			КонецЕсли;
			ТолькоНули = Ложь;
			Прервать;
		Конеццикла;	 
		Если ТолькоНули Тогда  
			Сообщить("Телефон клиента не может содержать только нули!"); 
			ТелефоныОК = ложь;
		КонецЕсли;	
	КонецЕсли;   
	Если НЕ ПустаяСтрока(ТелефонДополнительный) Тогда
		ТелефонДляПроверки = СокрЛП(ТелефонДополнительный);
		ТелефонДляПроверки = СтрЗаменить(ТелефонДляПроверки, " ", "");
		ТелефонДляПроверки = СтрЗаменить(ТелефонДляПроверки, "+", "");
		ТелефонДляПроверки = СтрЗаменить(ТелефонДляПроверки, "(", "");
		ТелефонДляПроверки = СтрЗаменить(ТелефонДляПроверки, ")", "");
		Если НЕ СтрДлина(ТелефонДляПроверки) = 11 Тогда
			ТелефоныОК = ложь;
			Сообщить("Неверная длина дополнительного телефона клиента!");
		КонецЕсли;   
		ТолькоНули = Истина; 
		ТелефонДляПроверки = Прав(ТелефонДляПроверки, СтрДлина(ТелефонДляПроверки)-1);
		Для сч = 1 по СтрДлина(СокрЛП(ТелефонДляПроверки)) Цикл 
			Если Сред(СокрЛП(ТелефонДляПроверки), сч, 1) = "0" Тогда
				Продолжить;
			КонецЕсли;
			ТолькоНули = Ложь;
			Прервать;
		Конеццикла;	 
		Если ТолькоНули Тогда  
			Сообщить("Дополнительный телефон клиента не может содержать только нули!"); 
			ТелефоныОК = ложь;
		КонецЕсли;	
	КонецЕсли;   
	Если НЕ ПустаяСтрока(ТелефонКонтактногоЛица) Тогда
		ТелефонДляПроверки = СокрЛП(ТелефонКонтактногоЛица);
		ТелефонДляПроверки = СтрЗаменить(ТелефонДляПроверки, " ", "");
		ТелефонДляПроверки = СтрЗаменить(ТелефонДляПроверки, "+", "");
		ТелефонДляПроверки = СтрЗаменить(ТелефонДляПроверки, "(", "");
		ТелефонДляПроверки = СтрЗаменить(ТелефонДляПроверки, ")", "");
		Если НЕ СтрДлина(ТелефонДляПроверки) = 11 Тогда
			ТелефоныОК = ложь;
			Сообщить("Не верная длина телефона контактного лица клиента!");
		КонецЕсли;  
		ТолькоНули = Истина;   
		ТелефонДляПроверки = Прав(ТелефонДляПроверки, СтрДлина(ТелефонДляПроверки)-1);
		Для сч = 1 по СтрДлина(СокрЛП(ТелефонДляПроверки)) Цикл 
			Если Сред(СокрЛП(ТелефонДляПроверки), сч, 1) = "0" Тогда
				Продолжить;
			КонецЕсли;
			ТолькоНули = Ложь;
			Прервать;
		Конеццикла;	 
		Если ТолькоНули Тогда  
			Сообщить("Телефон контактного лица клиента не может содержать только нули!"); 
			ТелефоныОК = ложь;
		КонецЕсли;	
	КонецЕсли;  
	Возврат ТелефоныОК;
КонецФункции

&НаСервере
Функция ПроверитьИсточникиИнформации() 
	Результат = Истина;
	Если ПустаяСтрока(ИсточникИнформации) И ПустаяСтрока(ИсточникИнформацииДругое) Тогда 
		//Сообщить("Не выбраны источники информации.");
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не выбраны источники информации.'"), , ,"ИсточникИнформации");     
		Возврат Ложь;
	КонецЕсли;	
	Возврат Результат;
КонецФункции

&НаСервере
Функция ПроверитьЗаполнениеДокументов() 
	Результат = Истина;	
	
	Если Гражданство = Справочники.СтраныМира.Россия Тогда
		ВидГражданства = Перечисления.ЛБ_ВидыГражданства.ГражданинРФ;
	ИначеЕсли Гражданство = Справочники.СтраныМира.БезГражданства Тогда
		ВидГражданства = Перечисления.ЛБ_ВидыГражданства.ЛицоБезГражданства;
	Иначе
		ВидГражданства = Перечисления.ЛБ_ВидыГражданства.ИностранныйГражданин;
	КонецЕсли;	
	
	
	ЗапросДок = Новый Запрос;
	ЗапросДок.Текст = "ВЫБРАТЬ
	|	ЛБ_ПереченьДокументовЗалогодателя.Гражданство КАК Гражданство,
	|	ЛБ_ПереченьДокументовЗалогодателя.ВидДокумента КАК ВидДокумента,
	|	ЛБ_ПереченьДокументовЗалогодателя.ТребуетсяДополнительныйДокумент КАК ТребуетсяДополнительныйДокумент
	|ИЗ
	|	РегистрСведений.ЛБ_ПереченьДокументовЗалогодателя КАК ЛБ_ПереченьДокументовЗалогодателя
	|ГДЕ
	|	ЛБ_ПереченьДокументовЗалогодателя.ВидДокументаЗалогодателя = &ВидДокументаЗалогодателя
	|	И ЛБ_ПереченьДокументовЗалогодателя.Гражданство В(&Гражданство)
	|	И ЛБ_ПереченьДокументовЗалогодателя.ВидГражданства = &ВидГражданства
	|
	|УПОРЯДОЧИТЬ ПО
	|	Гражданство УБЫВ";
	
	//проверим есть ДУЛ
	ЕстьДУЛ = ложь;	 
	ТребуетсяДополнительныйДокумент = Ложь;
	Для каждого Стр Из ДокументыЗалогодателя Цикл
		Если Стр.ДокументНЕДействителен ИЛИ Стр.ПроверкаНЕДействителен Тогда
			Продолжить;
		КонецЕсли;	
		Если (Стр.ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность) И Стр.ОсновнойДУЛ  Тогда
			Если НЕ Стр.Гражданство = Гражданство Тогда
				Продолжить;
			КонецЕсли;	
			Если (Стр.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ) ИЛИ 
				(Стр.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ВидНаЖительство И Стр.ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность) Тогда
				Если НЕ ЛБ_ОбщийМодуль.ПроверитьПаспортРФДействует(ДатаРождения, Стр.ДокументДатаВыдачи) Тогда
					Продолжить;
				КонецЕсли;	    
				Если Стр.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ Тогда
					Если ПроверитьПаспортВСпискеНеДействительных(Стр.ДокументСерия, Стр.ДокументНомер) И НЕ Стр.ДокументДействителен  Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли; 
				// ++ Сербаев 08.06.2023  (Проверка документа Вид на жительство на действительность)
				Если Стр.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ВидНаЖительство Тогда
					Если Не ЛБ_ОбщийМодуль.ПроверитьДействительностьВидаНаЖительство(Стр, ДатаРождения, Дата) Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				// -- Сербаев 08.06.2023
			ИначеЕсли ЛБ_ОбщийМодуль.ДокументСоСрокомДействия(Гражданство, Стр.ВидДокументаЗалогодателя, Стр.ВидДокумента) Тогда
				Если Стр.ДокументСрокДействия < НачалоДня(Дата) Тогда
					Продолжить;
				КонецЕсли;	
			КонецЕсли;	
			ЕстьДУЛ = Истина;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	Если НЕ ЕстьДУЛ Тогда
		Сообщить("У клиента не найден действующий основной документ удостоверяющего личность для установленного гражданства. Необходимо выбрать основной или завести новый ДУЛ.");
		Результат = Ложь; 
	КонецЕсли;	
	
	////проверим недействительность свидетельства о рождении если есть паспорт
	//ЕстьПаспорт = ложь;
	//ЕстьСвидетельствоОРождении = ложь;
	//Для каждого Стр Из ДокументыЗалогодателя Цикл
	//	Если (Стр.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ) И НЕ Стр.ДокументНЕДействителен Тогда
	//	    ЕстьПаспорт = Истина;
	//	ИначеЕсли (Стр.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.СвидетельствоОРождении) И НЕ Стр.Стр.ДокументНЕДействителен Тогда
	//		ЕстьСвидетельствоОРождении = Истина;
	//    КонецЕсли;
	//КонецЦикла;	
	//Если ЕстьПаспорт И ЕстьСвидетельствоОРождении Тогда
	//	ОтборД = Новый структура;
	//	ОтборД.Вставить("ВидДокумента", Справочники.ВидыДокументовФизическихЛиц.СвидетельствоОРождении);
	//	ОтборД.Вставить("ДокументНеДействителен", Ложь);
	//	СтрокиД = ДокументыЗалогодателя.НайтиСтроки(ОтборД);
	//	Для каждого СтрД Из СтрокиД цикл
	//		СтрД.ДокументНеДействителен = Истина;
	//	Конеццикла;	
	//КонецЕсли;	
	
	ЗапросДок.УстановитьПараметр("ВидДокументаЗалогодателя", Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность);
	ЗапросДок.УстановитьПараметр("ВидГражданства", ВидГражданства);
	
	МассивГ = Новый Массив;
	МассивГ.Добавить(Справочники.СтраныМира.ПустаяСсылка());
	//+МАН 22.04.25 
	//Было: МассивГ.Добавить(Стр.Гражданство);
	Если Стр <> Неопределено Тогда
		МассивГ.Добавить(Стр.Гражданство);
	КонецЕсли;
	//-МАН
	ЗапросДок.УстановитьПараметр("Гражданство", МассивГ);
	ТаблицаДок = ЗапросДок.Выполнить().Выгрузить();
	Отбор = Новый Структура;
	//+МАН 22.04.25 
	//Было: Отбор.Вставить("ВидДокумента", Стр.ВидДокумента);
	Если Стр <> Неопределено Тогда
		Отбор.Вставить("ВидДокумента", Стр.ВидДокумента);
	КонецЕсли;
	//-МАН
	СтрокиДок = ТаблицаДок.НайтиСтроки(Отбор);
	Если НЕ СтрокиДок.Количество() = 0 Тогда				 
		ТребуетсяДополнительныйДокумент = СтрокиДок.Получить(0).ТребуетсяДополнительныйДокумент;
	КонецЕсли;	 
	
	Если ТребуетсяДополнительныйДокумент Тогда
		ЕстьДопДокумент = ложь;
		ЗапросДок.УстановитьПараметр("ВидДокументаЗалогодателя", Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийПравоПребыванияРФ);
		ЗапросДок.УстановитьПараметр("ВидГражданства", ВидГражданства);
		МассивГ = Новый Массив;
		МассивГ.Добавить(Справочники.СтраныМира.ПустаяСсылка());
		МассивГ.Добавить(Гражданство);
		ЗапросДок.УстановитьПараметр("Гражданство", МассивГ);
		ТаблицаДок = ЗапросДок.Выполнить().Выгрузить();
		
		Для каждого Стр Из ДокументыЗалогодателя Цикл
			Если (Стр.ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийПравоПребыванияРФ) И Стр.Основной  Тогда
				Если НЕ Стр.Гражданство = Гражданство Тогда
					Продолжить;
				КонецЕсли;	
				Если Стр.ДокументНЕДействителен ИЛИ Стр.ПроверкаНЕДействителен Тогда
					Продолжить;
				КонецЕсли;	
				Если ЛБ_ОбщийМодуль.ДокументСоСрокомДействия(Гражданство, Стр.ВидДокументаЗалогодателя, Стр.ВидДокумента) Тогда
					Если Стр.ДокументСрокДействия < НачалоДня(Дата) Тогда
						Продолжить;
					КонецЕсли;	
					ЕстьДопДокумент = Истина;
					Прервать;
				Иначе	
					ЕстьДопДокумент = Истина;
					Прервать;
				КонецЕсли;	  
				Если Стр.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ВидНаЖительство Тогда
					Если Не ЛБ_ОбщийМодуль.ПроверитьДействительностьВидаНаЖительство(Стр, ДатаРождения, Дата) Тогда
						Продолжить;  
					Иначе
						ЕстьДопДокумент = Истина; 
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;
		
		Если НЕ ЕстьДопДокумент Тогда
			Сообщить("У клиента не найдены действующие основные документы, удостоверяющие право на пребывание в РФ. Необходимо выбрать документы или завести новые.");
			Результат = Ложь; 
		КонецЕсли;	
	КонецЕсли;	   
	
	//проверим одинаковые по виду документа (совпадение серии, номера)
	ВидыДокументов = ДокументыЗалогодателя.Выгрузить();
	ВидыДокументов.Свернуть("ВидДокументаЗалогодателя, ВидДокумента");
	
	Для каждого СтрВ из ВидыДокументов Цикл 
		Отбор = новый Структура;
		Отбор.Вставить("ВидДокументаЗалогодателя", СтрВ.ВидДокументаЗалогодателя); 
		Отбор.Вставить("ВидДокумента", СтрВ.ВидДокумента);   
		
		Строки = ДокументыЗалогодателя.НайтиСтроки(Отбор);
		Если Строки.Количество() > 1 Тогда
			Для каждого стр Из Строки Цикл   
				Если ЗначениеЗаполнено(Стр.ДокументСерия) ИЛИ ЗначениеЗаполнено(Стр.ДокументНомер) Тогда 
					Отбор.Вставить("ДокументСерия", Стр.ДокументСерия);
					Отбор.Вставить("ДокументНомер", Стр.ДокументНомер);
					
					СтрокиДок = ДокументыЗалогодателя.НайтиСтроки(Отбор); 
					Если СтрокиДок.Количество() > 1 Тогда
						Кол = СтрокиДок.Количество();
						Сообщить("У клиента найдены " + Строка(Кол) + " документа " + СокрЛП(Стр.ВидДокумента) + " с одинаковыми серией и номером!");
						Результат = Ложь;                                                                                                               
						Прервать;
					КонецЕсли;	
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;	
	Конеццикла;	
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция ПроверитьАнкету()  
	Результат = Истина;
	Если НЕ ПустаяСтрока(ИНН) Тогда
		Если СтрДлина(СокрЛП(ИНН)) < 12 Тогда
			Сообщить("Длина ИНН клиента должна быть 12 символов!"); 
			Результат = ложь;
		КонецЕсли; 
		ТолькоНули = Истина;
		Для сч = 1 по СтрДлина(СокрЛП(ИНН)) Цикл 
			Если Сред(СокрЛП(ИНН), сч, 1) = "0" Тогда
				Продолжить;
			КонецЕсли;
			ТолькоНули = Ложь;
			Прервать;
		Конеццикла;	 
		Если ТолькоНули Тогда  
			Сообщить("ИНН клиента не может содержать только нули!"); 
			Результат = ложь;
		КонецЕсли;	
	КонецЕсли;	
	Если НЕ ПустаяСтрока(СНИЛС) Тогда  
		ПроверкаСНИЛС = СтрЗаменить(СНИЛС, "-", "");
		Если СтрДлина(СокрЛП(ПроверкаСНИЛС)) < 10 Тогда
			Сообщить("Длина СНИЛС клиента должна быть 10 символов!"); 
			Результат = ложь;
		КонецЕсли; 
		ТолькоНули = Истина;                       
		СНИЛСПроверка = СтрЗаменить(СокрЛП(СНИЛС), "-", "");
		Для сч = 1 по СтрДлина(СокрЛП(СНИЛСПроверка)) Цикл 
			Если Сред(СНИЛСПроверка, сч, 1) = "0" Тогда
				Продолжить;
			КонецЕсли;
			ТолькоНули = Ложь;
			Прервать;
		Конеццикла;	 
		Если ТолькоНули Тогда  
			Сообщить("СНИЛС клиента не может содержать только нули!"); 
			Результат = ложь;
		КонецЕсли;	
	КонецЕсли;	   
	Если ЯвляетсяИПДЛ Тогда 
		Если КатегорияКлиентаИПДЛ = ПредопределенноеЗначение("Перечисление.ЛБ_КатегорииИПДЛ.ИПДЛ") ИЛИ
			КатегорияКлиентаИПДЛ = ПредопределенноеЗначение("Перечисление.ЛБ_КатегорииИПДЛ.СупругИПДЛ") Тогда  
			Если НЕ ЗначениеЗаполнено(КатегорияКлиентаИПДЛ) ИЛИ ПустаяСтрока(ДолжностьИПДЛ) ИЛИ ПустаяСтрока(РаботодательИПДЛ) Тогда
				Сообщить("Для клиента ИПДЛ необходимо заполнить все поля в группе ИПДЛ кроме уточняющей информации!"); 
				Результат = ложь;
			КонецЕсли;
		Иначе 
			Если НЕ ЗначениеЗаполнено(КатегорияКлиентаИПДЛ) ИЛИ ПустаяСтрока(ДопИнформацияИПДЛ) ИЛИ ПустаяСтрока(ДолжностьИПДЛ) ИЛИ ПустаяСтрока(РаботодательИПДЛ) Тогда
				Сообщить("Для клиента ИПДЛ необходимо заполнить все поля в группе ИПДЛ!"); 
				Результат = ложь;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	Если ЯвляетсяДЛПМО_РДПЛ Тогда 
		Если НЕ ЗначениеЗаполнено(КатегорияДЛПМО_РДПЛ) ИЛИ ПустаяСтрока(ДопИнформацияДЛПМО_РДПЛ) ИЛИ ПустаяСтрока(ДолжностьДЛПМО_РДПЛ) ИЛИ ПустаяСтрока(РаботодательДЛПМО_РДПЛ) Тогда
			Сообщить("Для клиента ДЛПМО_РДПЛ необходимо заполнить все поля в группе ДЛПМО_РДПЛ!"); 
			Результат = ложь;
		КонецЕсли;	
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ИсточникПроисхожденияИмущества) И ПустаяСтрока(ИсточникПроисхожденияИмуществаИной) Тогда
		//Сообщить("Не заполнена информация об источнике происхождения имущества клиента!");
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не заполнена информация об источнике происхождения имущества клиента!'"), , ,"ИсточникПроисхожденияИмущества");
		Результат = ложь;
	КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(ИсточникПроисхожденияДенежныхСредств) И ПустаяСтрока(ИсточникПроисхожденияДенежныхСредствИной) Тогда
		//Сообщить("Не заполнена информация об источнике происхождения денежных средств клиента!");
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не заполнена информация об источнике происхождения денежных средств клиента!'"), , ,"ИсточникПроисхожденияДенежныхСредств");
		Результат = ложь;
	КонецЕсли;
	Если НЕ ЗалогодательБенефициарныйВладелец Тогда
		Если Бенефициары.Количество() = 0 Тогда  
			Сообщить("Клиент не является бенефициарным владельцем. Необходимо установить бенефициарных владельцев!"); 
			Результат = ложь;  
		Иначе
			Для каждого Стр Из Бенефициары Цикл  
				Если НЕ ЗначениеЗаполнено(Стр.Бенефициар) ИЛИ  НЕ ЗначениеЗаполнено(Стр.ВидПолученияИнформации) Тогда 
					Сообщить("Для бенефициарных владельцев необходимо заполнить бенефициара и вид получения информации!"); 
					Результат = ложь;  
					Прервать;
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;	
	КонецЕсли;
	Возврат Результат;
КонецФункции	

&НаСервере
Функция ПроверитьСотрудников()          
	Отбор = Новый Структура;
	Отбор.Вставить("Статус", Справочники.ЛБ_СтатусыЗалогодателей.Сотрудник);
	СтрокиС = ТаблицаДопСтатусов.НайтиСтроки(Отбор);   
	Если СтрокиС.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	СтрС = строкиС.Получить(0);
	Если СтрС.Используется Тогда
		Если ПустаяСтрока(ПолучитьСписокСотрудников()) Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Клиент является сотрудником организации, нужно определить соответствие клиента и сотрудника.'"), , ,);     
			Возврат Ложь; 
		КонецЕсли;	
	КонецЕсли;
	Возврат Истина;
КонецФункции

&НаСервере
Функция ПроверитьИЗаписать(Сохранять = Истина)  	
	Если ДатаСмерти = Дата(1,1,1) Тогда
		Если НЕ ПроверитьЗаполнение() Тогда
			Возврат Ложь;
		КонецЕсли;
		Если НЕ ПроверитьФИОЗалогодателя() Тогда
			Возврат Ложь;
		КонецЕсли;	
		Если НЕ ПроверитьФИОЗалогодателя_А() Тогда
			Возврат Ложь;
		КонецЕсли;	
		Если НЕ ПроверитьДатуРождения()  Тогда
			Возврат Ложь;
		КонецЕсли;
		Если НЕ ПроверитьEmail()  Тогда
			Возврат Ложь;
		КонецЕсли;
		Если НЕ ПроверитьТелефоны()  Тогда
			Возврат Ложь;
		КонецЕсли;	
		Если НЕ ПроверитьЗаполнениеДокументов() Тогда
			Возврат Ложь;
		КонецЕсли;
		Если НЕ ПроверитьЗаполнениеАдресов() Тогда
			Возврат Ложь;
		КонецЕсли; 
		Если НЕ ПроверитьИсточникиИнформации() Тогда
			Возврат Ложь;
		КонецЕсли;
		Если НЕ ПроверитьАнкету() Тогда
			Возврат Ложь;
		КонецЕсли; 
		Если НЕ ПроверитьСотрудников() Тогда
			Возврат Ложь;
		КонецЕсли;  
	КонецЕсли;	
	
	//++ИвановВВ, проверка без сохранения
	Если Сохранять Тогда
		Если НЕ ЗначениеЗаполнено(Залогодатель) Тогда		
			Залогодатель = СоздатьЗалогодателя();
			СохранитьКарточкуЗалогодателя(Ложь);
		Иначе	
			ИзменитьЗалогодателя();
			СохранитьКарточкуЗалогодателя(); 
		КонецЕсли;
	КонецЕсли;
	//--ИвановВВ
	
	
	//проверим включение клиента в перечни
	Если ДатаСмерти = Дата(1,1,1) Тогда  
		//Если ПричинаИзменения = Справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.НоваяКарточка Тогда
		Дата = ТекущаяДатаСеанса();
		//+МАН 18.11.25
		СтруктураПроверки = ПроверитьСовпадениеСПеречнями();
		//-МАН
		//ЛБ_УправлениеЛомбардом.ПроверкаКлиентаПоПеречням(Дата, Залогодатель); //Выполняется проверка по всем перечням и ДУЛ
		Дата = ТекущаяДатаСеанса();
		ПроверитьПоПеречням()
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

Процедура ПроверитьНаСотрудника(ДокКарточка)
	Если ЭтотОбъект.ДокументыЗалогодателя.Количество() > 0 Тогда
		Для каждого БСтрока из ЭтотОбъект.ДокументыЗалогодателя Цикл
			
			
			Запрос0 = Новый Запрос;
			Запрос0.Текст = "ВЫБРАТЬ
			|	ЛБ_Сотрудники.Ссылка КАК Сотрудник,
			|	ЛБ_Сотрудники.ФизическоеЛицо.СерияДокумента КАК ФизическоеЛицоСерияДокумента,
			|	ЛБ_Сотрудники.ФизическоеЛицо.НомерДокумента КАК ФизическоеЛицоНомерДокумента
			|ИЗ
			|	Справочник.ЛБ_Сотрудники КАК ЛБ_Сотрудники
			|ГДЕ
			|	ЛБ_Сотрудники.ФизическоеЛицо.СерияДокумента = &СерияДокумента
			|	И ЛБ_Сотрудники.ФизическоеЛицо.НомерДокумента = &НомерДокумента";
			Запрос0.УстановитьПараметр("СерияДокумента", БСтрока.ДокументСерия);
			Запрос0.УстановитьПараметр("НомерДокумента", БСтрока.ДокументНомер); 
			
			Выборка = Запрос0.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Если ЗначениеЗаполнено(Выборка.Сотрудник) Тогда
					Для каждого строчка из ЭтотОбъект.ТаблицаДопСтатусов Цикл
						Если строчка.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Сотрудник Тогда
							строчка.Используется = Истина;   
						КонецЕсли;
					КонецЦикла; 
				КонецЕсли;
			КонецЕсли;  
		КонецЦикла;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_ДокументыЗалогодателей.ДокументЗалогодателя.Владелец КАК Клиент,
	|	ЛБ_ДокументыЗалогодателей.ДокументСерия КАК ДокументСерия,
	|	ЛБ_ДокументыЗалогодателей.ДокументНомер КАК ДокументНомер,
	|	ВложенныйЗапрос.СерияДокумента КАК СерияДокумента,
	|	ВложенныйЗапрос.НомерДокумента КАК НомерДокумента,
	|	ВложенныйЗапрос.Ссылка КАК Сотрудник
	|ИЗ
	|	РегистрСведений.ЛБ_ДокументыЗалогодателей КАК ЛБ_ДокументыЗалогодателей
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЛБ_Сотрудники.ФизическоеЛицо.СерияДокумента КАК СерияДокумента,
	|			ЛБ_Сотрудники.ФизическоеЛицо.НомерДокумента КАК НомерДокумента,
	|			ЛБ_Сотрудники.Ссылка КАК Ссылка
	|		ИЗ
	|			Справочник.ЛБ_Сотрудники КАК ЛБ_Сотрудники) КАК ВложенныйЗапрос
	|		ПО ЛБ_ДокументыЗалогодателей.ДокументСерия = ВложенныйЗапрос.СерияДокумента
	|			И ЛБ_ДокументыЗалогодателей.ДокументНомер = ВложенныйЗапрос.НомерДокумента
	|ГДЕ
	|	ЛБ_ДокументыЗалогодателей.ДокументЗалогодателя.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец", ДокКарточка.Залогодатель);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.Сотрудник) Тогда 
			ЕстьСтатус = Ложь;
			Для каждого строчка из ДокКарточка.ДополнительныеСтатусы Цикл
				Если строчка.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Сотрудник Тогда
					ЕстьСтатус = Истина;   
				КонецЕсли;
			КонецЦикла;
			Если НЕ ЕстьСтатус Тогда
				НовСтрока = ДокКарточка.ДополнительныеСтатусы.Добавить();
				НовСтрока.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Сотрудник;
				НовСтрока.Используется = Истина;
			КонецЕсли;			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	ЗакрыватьФормуПриСохранении = Истина;
	ЗаписатьКарточку();
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	ЗаписатьКарточку(); 	
	Дата = ОбщегоНазначенияКлиент.ДатаСеанса();
	//+МАН 05.11.25 Закомментировал. Есть проверка после записи.
	//ПроверитьПоПеречням(); 
	//-МАН
	ЗаполнитьДатыПроверкиПеречней();
	//+МАН 05.11.25 Убрал вывод сообщений т.к. они выводятся в новой проверке.
	//Если ПроверкаПереченьТеррористов ИЛИ ПроверкаСписокМВК ИЛИ ПроверкаПереченьФРОМУ ИЛИ ПроверкаПереченьООН Тогда
	//    Если ПроверкаПереченьТеррористов Тогда
	//	    Сообщить("Клиент найден в перечне террористов.");
	//    КонецЕсли; 
	//    Если ПроверкаСписокМВК Тогда
	//	    Сообщить("Клиент найден в списке МВК.");
	//    КонецЕсли; 
	//    Если ПроверкаПереченьФРОМУ Тогда
	//	    Сообщить("Клиент найден в перечне ФРОМУ.");
	//	КонецЕсли;  
	//	Если ПроверкаПереченьООН Тогда
	//	    Сообщить("Клиент найден в перечне ООН.");
	//    КонецЕсли; 
	//КонецЕсли;		
	//-МАН

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьКарточку()
	
	// ++ Сербаев 24.05.2023    Чтобы при нажатиях на Enter не пытался сохранить карточку и не выводил сообщения об ошибках
	Если ДатаРождения = Дата(1, 1, 1) Или ОшибкаВОтчестве Тогда
		Возврат;
	КонецЕсли;
	// -- Сербаев 24.05.2023
	
	Если ЗначениеЗаполнено(Залогодатель) Тогда
		СтруктураФИО = ПолучитьФИОКлиента();
		Если НЕ (СтруктураФИО.Фамилия = Фамилия) ИЛИ НЕ (СтруктураФИО.Имя = Имя) ИЛИ НЕ (СтруктураФИО.Отчество = Отчество) Тогда
			Если НЕ ЗначениеЗаполнено(ПричинаИзмененияФИО) Тогда   
				ВыбратьПричинуИзмененияФИО(); 
				Возврат;
			КонецЕсли;	
		КонецЕсли;			
	КонецЕсли;	
	Если ПроверитьИЗаписать() Тогда   		
		Если ЗакрыватьФормуПриСохранении Тогда 
			//+МАН 05.11.25 Закомментировал. Есть проверка после записи.
			//ПроверитьПоПеречням(); 
			//-МАН
			//+МАН 05.11.25 Пока закомментировал старое условие и сделал другое.
			//Если ПроверкаПереченьТеррористов ИЛИ ПроверкаСписокМВК ИЛИ ПроверкаПереченьФРОМУ ИЛИ ПроверкаПереченьООН Тогда 
			//	СообщениеПоПеречням = "";
			//    Если ПроверкаПереченьТеррористов Тогда
			//	    Сообщить("Клиент найден в перечне террористов.");
			//		СообщениеПоПеречням = СообщениеПоПеречням + ?(ПустаяСтрока(СообщениеПоПеречням), "Клиент найден в", ",") + " перечне террористов";
			//    КонецЕсли; 
			//    Если ПроверкаСписокМВК Тогда
			//	    Сообщить("Клиент найден в списке МВК."); 
			//		СообщениеПоПеречням = СообщениеПоПеречням + ?(ПустаяСтрока(СообщениеПоПеречням), "Клиент найден в", ",") + " списке МВК";
			//    КонецЕсли; 
			//    Если ПроверкаПереченьФРОМУ Тогда
			//	    Сообщить("Клиент найден в перечне ФРОМУ.");
			//		СообщениеПоПеречням = СообщениеПоПеречням + ?(ПустаяСтрока(СообщениеПоПеречням), "Клиент найден в", ",") + " перечне ФРОМУ";
			//	КонецЕсли;  
			//	Если ПроверкаПереченьООН Тогда
			//	    Сообщить("Клиент найден в перечне ООН.");
			//		СообщениеПоПеречням = СообщениеПоПеречням + ?(ПустаяСтрока(СообщениеПоПеречням), "Клиент найден в", ",") + " перечне ООН";
			//	КонецЕсли;
			//	Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросПроверкаПоПеречням", ЭтотОбъект); 
			//    ПоказатьВопрос(Оповещение, СообщениеПоПеречням + ". Продолжить сохранение?", РежимДиалогаВопрос.ДаНетОтмена, 0,,);
			СтруктураПроверки = ПроверитьСовпадениеСПеречнями();
			
			Если СтруктураПроверки.Совпадение Тогда 
				Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросПроверкаПоПеречням", ЭтотОбъект); 
	            ПоказатьВопрос(Оповещение, СтруктураПроверки.Текст + ". Продолжить сохранение?", РежимДиалогаВопрос.ДаНетОтмена, 0,,);
			//-МАН
			Иначе          
				Результат = Новый Структура;
				Результат.Вставить("Залогодатель", Залогодатель);
				Результат.Вставить("Гражданство", Гражданство);
				Результат.Вставить("ДатаРождения", ДатаРождения);
				Результат.Вставить("НомерТелефона", Телефон);
				// ++ Сербаев 01.06.2023
				Модифицированность = Ложь;
				// -- Сербаев 01.06.2023
				
				//++Иванов ВВ, сравнение значений реквизитов контактных данных после сохранения
					Если ЗначенияРеквизитовКонтактныеДанные <> Неопределено Тогда
						СравнитьЗначенияРеквизитовКонтактныеДанные(Результат);
					КонецЕсли;
				//--Иванов ВВ
				
			КонецЕсли;            
		Иначе	  
			//+МАН 18.11.25 Убрал
			////+МАН 05.11.25
			//СтруктураПроверки = ПроверитьСовпадениеСПеречнями();
			////-МАН
			//-МАН
			Дата = ОбщегоНазначенияКлиент.ДатаСеанса();
			Модифицированность = Ложь;	  
			ЭтоНовыйКлиент = Ложь;
			
			//++ИвановВВ, сравнение значений реквизитов контактных данных после сохранения
			Если ЗначенияРеквизитовКонтактныеДанные <> Неопределено Тогда
				СравнитьЗначенияРеквизитовКонтактныеДанные();
			КонецЕсли;
			//--ИвановВВ
	
		КонецЕсли;	
		//+МАН 04.12.25 Установка доступности после сохранения
		УстановитьДоступностьПослеСохранения();
		//-МАН
	КонецЕсли;	
КонецПроцедуры    

&НаКлиенте
Процедура ПослеОтветаНаВопросПроверкаПоПеречням(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда 
		Результат = Новый Структура;
		Результат.Вставить("Залогодатель", Залогодатель);
		Результат.Вставить("Гражданство", Гражданство);
		Результат.Вставить("ДатаРождения", ДатаРождения);
		Результат.Вставить("НомерТелефона", Телефон);
		// ++ Сербаев 01.06.2023
		Модифицированность = Ложь;
		// -- Сербаев 01.06.2023
		
		//++ИвановВВ, сравнение значений реквизитов контактных данных после сохранения
			Если ЗначенияРеквизитовКонтактныеДанные <> Неопределено И Не ЗаявлениеОбИзмененииРаспечатано Тогда
				СравнитьЗначенияРеквизитовКонтактныеДанные();
			КонецЕсли;
		//--ИвановВВ
		
		ЭтаФорма.Закрыть(Результат); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПричиныИзменеияФИО(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда 
		Сообщить("Не выбрана причина изменения фамилии, имени или отчества клиента!");
		Возврат	    
	КонецЕсли;	
	ПричинаИзмененияФИО = Результат.ПричинаИзмененияФИО;
	ОснованиеИзмененияФИО = Результат.ОснованиеИзмененияФИО;  
	Если ПроверитьИЗаписать() Тогда
		СообщениеПоПеречням = "";
		ПроверитьПоПеречням(); 
		Если ПроверкаПереченьТеррористов ИЛИ ПроверкаСписокМВК ИЛИ ПроверкаПереченьФРОМУ ИЛИ ПроверкаПереченьООН Тогда 			
			Если ПроверкаПереченьТеррористов Тогда
				Сообщить("Клиент найден в перечне террористов.");
				СообщениеПоПеречням = СообщениеПоПеречням + ?(ПустаяСтрока(СообщениеПоПеречням), "Клиент найден в", ",") + " перечне террористов";
			КонецЕсли; 
			Если ПроверкаСписокМВК Тогда
				Сообщить("Клиент найден в списке МВК."); 
				СообщениеПоПеречням = СообщениеПоПеречням + ?(ПустаяСтрока(СообщениеПоПеречням), "Клиент найден в", ",") + " списке МВК";
			КонецЕсли; 
			Если ПроверкаПереченьФРОМУ Тогда
				Сообщить("Клиент найден в перечне ФРОМУ.");
				СообщениеПоПеречням = СообщениеПоПеречням + ?(ПустаяСтрока(СообщениеПоПеречням), "Клиент найден в", ",") + " перечне ФРОМУ";
			КонецЕсли; 
			Если ПроверкаПереченьООН Тогда
				Сообщить("Клиент найден в перечне ООН.");
				СообщениеПоПеречням = СообщениеПоПеречням + ?(ПустаяСтрока(СообщениеПоПеречням), "Клиент найден в", ",") + " перечне ООН";
			КонецЕсли;
		КонецЕсли;	
		Если ЗакрыватьФормуПриСохранении Тогда
			Если ПроверкаПереченьТеррористов ИЛИ ПроверкаСписокМВК ИЛИ ПроверкаПереченьФРОМУ ИЛИ ПроверкаПереченьООН Тогда 
				Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросПроверкаПоПеречням", ЭтотОбъект); 
				ПоказатьВопрос(Оповещение, СообщениеПоПеречням + ". Продолжить сохранение?", РежимДиалогаВопрос.ДаНетОтмена, 0,,);
			Иначе          
				Результат = Новый Структура;
				Результат.Вставить("Залогодатель", Залогодатель);
				Результат.Вставить("Гражданство", Гражданство);
				Результат.Вставить("ДатаРождения", ДатаРождения);
				Результат.Вставить("НомерТелефона", Телефон);
				Модифицированность = Ложь;
				ЭтаФорма.Закрыть(Результат); 
			КонецЕсли;	 
		Иначе
			Модифицированность = Ложь;
			Дата = ОбщегоНазначенияКлиент.ДатаСеанса();
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПричинуИзмененияФИО()
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораПричиныИзменеияФИО", ЭтаФорма);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Залогодатель", Залогодатель);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПричинаИзмененияФИО", ПараметрыФормы, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры	

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(неопределено);
КонецПроцедуры

&НаСервере
Функция ПолучитьФИОКлиента()
	Результат = Новый Структура;
	Результат.Вставить("Фамилия", Залогодатель.Фамилия);
	Результат.Вставить("Имя", Залогодатель.Имя);
	Результат.Вставить("Отчество", Залогодатель.Отчество);
	Возврат Результат;
КонецФункции

&НаСервере
Функция ПроверитьЗаполнениеАдресов() 
	ВсеОК = Истина;
	
	Если НЕ ПустаяСтрока(АдресПоПропискеСтруктура) И НЕ АдресПоПропискеВручную Тогда
		//Савранин 27.04.2023 -->
		//СтруктураАдреса = УправлениеКонтактнойИнформациейСлужебный.СтрокаJSONВСтруктуру(АдресПоПропискеСтруктура);
		СтруктураАдреса = АдресныйКлассификаторСлужебный.КонтактнаяИнформацияВСтруктуруJSON(АдресПоПропискеСтруктура);
		//<-- Савранин 27.04.2023    
		АдресРФ = ложь;
		Если НЕ ЗначениеЗаполнено(СтруктураАдреса.Country) Тогда 
			ОбщегоНазначения.СообщитьПользователю((НСтр("ru = 'В адресе по прописке не заполнена страна.'")), , ,"АдресПоПрописке");      
			ВсеОК = ложь; 
		ИначеЕсли СтруктураАдреса.Country = "РОССИЯ" Тогда
			АдресРФ = Истина;
		КонецЕсли;	 
		Если НЕ АдресРФ Тогда 
			Если НЕ ЗначениеЗаполнено(СтруктураАдреса.area) И НЕ ЗначениеЗаполнено(СтруктураАдреса.city) Тогда
				ОбщегоНазначения.СообщитьПользователю((НСтр("ru = 'В адресе по прописке не заполнен город'")), , ,"АдресПоПрописке");
				ВсеОК = ложь; 
			КонецЕсли; 
		Иначе  
			Если НЕ ЗначениеЗаполнено(СтруктураАдреса.city) И НЕ ЗначениеЗаполнено(СтруктураАдреса.locality) Тогда
				Если НЕ ЛБ_ОбщийМодуль.ПроверитьГородФедеральногоЗначения(СтруктураАдреса.area) Тогда
					ОбщегоНазначения.СообщитьПользователю((НСтр("ru = 'В адресе по прописке не заполнен город или населенный пункт'")), , ,"АдресПоПрописке");
					ВсеОК = ложь; 
				КонецЕсли;	
			КонецЕсли; 
		КонецЕсли;	
		Если АдресРФ Тогда
			Если НЕ ЗначениеЗаполнено(СтруктураАдреса.ZIPcode) Тогда    
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'В адресе по прописке не заполнен индекс.'"), , ,"АдресПоПрописке");  
				ВсеОК = ложь; 
			Иначе	
				Если НЕ ЛБ_ОбщийМодуль.ПроверкаТолькоЦифры(СтруктураАдреса.ZIPcode) Тогда
					ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'В адресе по прописке индекс должен содержать только цифры.'"), , ,"АдресПоПрописке");
					ВсеОК = ложь;
				ИначеЕсли ЛБ_ОбщегоНазначения.ПроверкаВсеСимволыНули(СтруктураАдреса.ZIPcode) Тогда
					ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'В адресе по прописке индекс не должен содержать только нули.'"), , ,"АдресПоПрописке");
					ВсеОК = ложь;
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ФактическийСовпадает  Тогда
		Если НЕ ПустаяСтрока(ФактическийАдресСтруктура) И НЕ ФактическийАдресВручную Тогда
			//Савранин 27.04.2023 -->
			//СтруктураАдреса = УправлениеКонтактнойИнформациейСлужебный.СтрокаJSONВСтруктуру(ФактическийАдресСтруктура);
			СтруктураАдреса = АдресныйКлассификаторСлужебный.КонтактнаяИнформацияВСтруктуруJSON(ФактическийАдресСтруктура);
			//<-- Савранин 27.04.2023
			АдресРФ = Ложь;
			Если НЕ ЗначениеЗаполнено(СтруктураАдреса.Country) Тогда 
				Сообщить("В фактичеком адресе не заполнена страна.");
				ВсеОК = ложь;   
			ИначеЕсли СтруктураАдреса.Country = "РОССИЯ" Тогда
				АдресРФ = Истина;
			КонецЕсли;	 
			Если НЕ АдресРФ Тогда 
				Если НЕ ЗначениеЗаполнено(СтруктураАдреса.area) И НЕ ЗначениеЗаполнено(СтруктураАдреса.city) Тогда
					ОбщегоНазначения.СообщитьПользователю((НСтр("ru = 'В фактичеком адресе не заполнен город'")), , ,"ФактическийАдрес");
					ВсеОК = ложь; 
				КонецЕсли; 
			Иначе  
				Если НЕ ЗначениеЗаполнено(СтруктураАдреса.city) И НЕ ЗначениеЗаполнено(СтруктураАдреса.locality) Тогда 
					Если НЕ ЛБ_ОбщийМодуль.ПроверитьГородФедеральногоЗначения(СтруктураАдреса.area) Тогда
						Сообщить("В фактичеком адресе не заполнен город.");
						ВсеОК = ложь; 
					КонецЕсли;	
				КонецЕсли; 
			КонецЕсли;	    
			Если АдресРФ Тогда
				Если НЕ ЗначениеЗаполнено(СтруктураАдреса.ZIPcode) Тогда 
					Сообщить("В фактичеком адресе не заполнен индекс");
					ВсеОК = ложь;  
				Иначе	
					Если НЕ ЛБ_ОбщийМодуль.ПроверкаТолькоЦифры(СтруктураАдреса.ZIPcode) Тогда
						Сообщить("В фактичеком адресе индекс должен содержать только цифры.");
						ВсеОК = ложь;
					ИначеЕсли ЛБ_ОбщегоНазначения.ПроверкаВсеСимволыНули(СтруктураАдреса.ZIPcode) Тогда
						Сообщить("В фактичеком адресе индекс не должен содержать только нули.");
						ВсеОК = ложь;
					КонецЕсли;		
				КонецЕсли;    
			КонецЕсли;	
		КонецЕсли; 
	КонецЕсли;	
	
	Если НЕ ПочтовыйСовпадает Тогда
		Если НЕ ПустаяСтрока(ПочтовыйАдресСтруктура) И НЕ ПочтовыйАдресВручную Тогда
			//Савранин 27.04.2023 -->
			//СтруктураАдреса = УправлениеКонтактнойИнформациейСлужебный.СтрокаJSONВСтруктуру(ПочтовыйАдресСтруктура);
			СтруктураАдреса = АдресныйКлассификаторСлужебный.КонтактнаяИнформацияВСтруктуруJSON(ПочтовыйАдресСтруктура);
			//<-- Савранин 27.04.2023
			АдресРФ = Ложь;
			Если НЕ ЗначениеЗаполнено(СтруктураАдреса.Country) Тогда 
				Сообщить("В почтовом адресе не заполнена страна.");
				ВсеОК = ложь;
			ИначеЕсли СтруктураАдреса.Country = "РОССИЯ" Тогда
				АдресРФ = Истина;
			КонецЕсли;	 
			Если НЕ АдресРФ Тогда 
				Если НЕ ЗначениеЗаполнено(СтруктураАдреса.area) И НЕ ЗначениеЗаполнено(СтруктураАдреса.city) Тогда
					ОбщегоНазначения.СообщитьПользователю((НСтр("ru = 'В почтовом адресе не заполнен город'")), , ,"ПочтовыйАдрес");
					ВсеОК = ложь; 
				КонецЕсли; 
			Иначе  
				Если НЕ ЗначениеЗаполнено(СтруктураАдреса.city) И НЕ ЗначениеЗаполнено(СтруктураАдреса.locality) Тогда  
					Если НЕ ЛБ_ОбщийМодуль.ПроверитьГородФедеральногоЗначения(СтруктураАдреса.area) Тогда
						Сообщить("В почтовом адресе не заполнен город.");
						ВсеОК = ложь;  
					КонецЕсли;	
				КонецЕсли; 
			КонецЕсли;
			Если АдресРФ Тогда
				Если НЕ ЗначениеЗаполнено(СтруктураАдреса.ZIPcode) Тогда 
					Сообщить("В почтовом адресе не заполнен индекс");
					ВсеОК = ложь;
				Иначе	
					Если НЕ ЛБ_ОбщийМодуль.ПроверкаТолькоЦифры(СтруктураАдреса.ZIPcode) Тогда
						Сообщить("В почтовом адресе индекс должен содержать только цифры.");
						ВсеОК = ложь;
					ИначеЕсли ЛБ_ОбщегоНазначения.ПроверкаВсеСимволыНули(СтруктураАдреса.ZIPcode) Тогда
						Сообщить("В почтовом адресе индекс не должен содержать только нули.");
						ВсеОК = ложь;
					КонецЕсли;			
				КонецЕсли; 
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	Возврат ВсеОК;
КонецФункции	

&НаКлиенте
Процедура УстановитьДоступность()
	//Если ФактическийСовпадает Тогда
	//	Элементы.ФактическийАдрес.ТолькоПросмотр = Истина;
	//	Элементы.ФактическийАдресВручную.ТолькоПросмотр = Истина;
	//Иначе	
	//	Элементы.ФактическийАдрес.ТолькоПросмотр = ложь;
	//	Элементы.ФактическийАдресВручную.ТолькоПросмотр = Ложь;
	//КонецЕсли;	
	//
	//Если ПочтовыйСовпадает Тогда
	//	Элементы.ПочтовыйАдрес.ТолькоПросмотр = Истина;
	//	Элементы.ПочтовыйАдресВручную.ТолькоПросмотр = Истина;
	//Иначе	
	//	Элементы.ПочтовыйАдрес.ТолькоПросмотр = ложь;
	//	Элементы.ПочтовыйАдресВручную.ТолькоПросмотр = Ложь;
	//КонецЕсли; 
	//ЭтаФорма.ОбновитьОтображениеДанных(); 
	Если ФактическийСовпадает Тогда
		Элементы.ФактическийАдресВручную.Доступность = Ложь;
	Иначе
		Элементы.ФактическийАдресВручную.Доступность = Истина;
	КонецЕсли;	
	Если ПочтовыйСовпадает Тогда
		Элементы.ПочтовыйАдресВручную.Доступность = Ложь;
	Иначе
		Элементы.ПочтовыйАдресВручную.Доступность = Истина;
	КонецЕсли;	 
КонецПроцедуры	

&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	
	Фамилия = СокрЛП(ТРег(Фамилия));
	Если СтрДлина(Фамилия) > 0 Тогда
		ТекстОшибки = ЛБ_ОбщегоНазначения.СообщитьЕслиСтрокаНеправильная(Фамилия, "Фамилия");
		Если ТекстОшибки <> "" Тогда
			ЛБ_ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "Фамилия");
			Возврат;
		КонецЕсли; 
		
		// ++ Сербаев 07.06.2023
		//ТолькоКирилицаВСтроке = СтроковыеФункцииКлиентСервер.ТолькоКириллицаВСтроке(Фамилия);
		ТолькоКирилицаВСтроке = СтроковыеФункцииКлиентСерверРФ.ТолькоКириллицаВСтроке(Фамилия, , " -");
		// -- Сербаев 07.06.2023
		Если Не ТолькоКирилицаВСтроке Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Строка ""Фамилия"" должна содержать только символы кириллицы!'"), , , "Фамилия");
			Возврат;
		КонецЕсли;  
		
		Если Не ПустаяСтрока(Фамилия) Тогда	
			Элементы.Имя.Доступность = Истина;
		КонецЕсли; 
		
		Если Не ПустаяСтрока(Имя) И Не ДатаРождения = Дата(1, 1, 1) Тогда
			СтруктураПоиска = ПроверитьОднофамильцев();
			Если СтруктураПоиска.ЕстьСовпадения Тогда 
				ПоказатьОднофамильцев(СтруктураПоиска.СписокЗалогодателей, СтруктураПоиска.ДанныеЗалогодателей);
			КонецЕсли;	
		КонецЕсли;
	ИначеЕсли Фамилия = "" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Поле ""Фамилия"" не заполнено.'"), , , "Фамилия");
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	
	Имя = СокрЛП(ТРег(Имя));
	Если СтрДлина(Имя) > 0 Тогда
		
		ТекстОшибки = ЛБ_ОбщегоНазначения.СообщитьЕслиСтрокаНеправильная(Имя, "Имя");
		Если ТекстОшибки <> "" Тогда
			ЛБ_ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "Имя");
			Возврат;
		КонецЕсли;
		
		// ++ Сербаев 07.06.2023
		//ТолькоКирилицаВСтроке = СтроковыеФункцииКлиентСервер.ТолькоКириллицаВСтроке(Имя,," -");
		ТолькоКирилицаВСтроке = СтроковыеФункцииКлиентСерверРФ.ТолькоКириллицаВСтроке(Имя, , " -");
		// -- Сербаев 07.06.2023
		Если Не ТолькоКирилицаВСтроке Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Строка ""Имя"" должно содержать только символы кириллицы!'"), , , "Имя");
			Возврат;
		КонецЕсли;
		
	ИначеЕсли Имя = "" Тогда	
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Поле ""Имя"" не заполнено.'"), , , "Имя");
		Возврат;
	КонецЕсли;
	
	Если Не ПустаяСтрока(Имя) Тогда	
		
		Фамилия = ТРег(Фамилия);
		Если СтрДлина(Фамилия) > 0 Тогда
			
			ТекстОшибки = ЛБ_ОбщегоНазначения.СообщитьЕслиСтрокаНеправильная(Фамилия, "Фамилия");
			Если ТекстОшибки <> "" Тогда
				ЛБ_ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "Фамилия");
				Возврат;
			КонецЕсли;
			
			// ++ Сербаев 07.06.2023
			//ТолькоКирилицаВСтроке = СтроковыеФункцииКлиентСервер.ТолькоКириллицаВСтроке(Фамилия);
			ТолькоКирилицаВСтроке = СтроковыеФункцииКлиентСерверРФ.ТолькоКириллицаВСтроке(Фамилия, , " -");
			// -- Сербаев 07.06.2023
			Если Не ТолькоКирилицаВСтроке Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Строка ""Фамилия"" должна содержать только символы кириллицы!'"), , , "Фамилия");
				Возврат;
			КонецЕсли;
			
			Если ДатаРождения = Дата(1, 1, 1) Тогда
				УстановитьДоступностьЭлементовПриСозданииКлиента(Ложь);
			КонецЕсли;
		ИначеЕсли Фамилия = "" Тогда 
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Поле ""Фамилия"" не заполнено.'"), , , "Фамилия");
			Возврат; 	
		КонецЕсли;
		
	КонецЕсли; 
	
	Если Не ПустаяСтрока(Имя) И Не ПустаяСтрока(Фамилия) И Не ДатаРождения = Дата(1, 1, 1) Тогда
		СтруктураПоиска = ПроверитьОднофамильцев();
		Если СтруктураПоиска.ЕстьСовпадения Тогда 
			ПоказатьОднофамильцев(СтруктураПоиска.СписокЗалогодателей, СтруктураПоиска.ДанныеЗалогодателей);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	Отчество = СокрЛП(ТРег(Отчество)); 
	
	ОшибкаВОтчестве = Ложь;
	Если СтрДлина(Отчество) > 0 Тогда
		
		ТекстОшибки = ЛБ_ОбщегоНазначения.СообщитьЕслиСтрокаНеправильная(Отчество, "Отчество");
		Если ТекстОшибки <> "" Тогда
			ЛБ_ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "Отчество");
			ОшибкаВОтчестве = Истина;
			Возврат;
		КонецЕсли;    
		
		// ++ Сербаев 07.06.2023
		//ТолькоКирилицаВСтроке = СтроковыеФункцииКлиентСервер.ТолькоКириллицаВСтроке(Отчество);
		ТолькоКирилицаВСтроке = СтроковыеФункцииКлиентСерверРФ.ТолькоКириллицаВСтроке(Отчество, , " -");
		// -- Сербаев 07.06.2023
		Если Не ТолькоКирилицаВСтроке Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Строка ""Отчество"" должна содержать только символы кириллицы!'"), , , "Отчество"); 
			ОшибкаВОтчестве = Истина;
			Возврат;
		КонецЕсли;
		
	КонецЕсли; 
	
	Если Не ОшибкаВОтчестве И ДатаРождения <> Дата(1, 1, 1) Тогда
		УстановитьДоступностьЭлементовПриСозданииКлиента(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьЗалогодателя()		
	НовыйОбъектСпр = Справочники.ЛБ_Залогодатели.СоздатьЭлемент();
	НовыйОбъектСпр.Фамилия = Фамилия;
	НовыйОбъектСпр.Имя = Имя;
	НовыйОбъектСпр.Отчество = Отчество;
	НовыйОбъектСпр.Наименование = СокрЛП(Фамилия) + " " + СокрЛП(Имя) + " " + СокрЛП(Отчество);
	//+МАН 10.10.25 Заполнить техническое наименование
	НовыйОбъектСпр.ТехническоеНаименование = ЛБ_ОбщийМодуль.СформироватьТехническоеНаименование(НовыйОбъектСпр.Наименование);
	//-МАН
	НовыйОбъектСпр.Записать();
	
	Возврат НовыйОбъектСпр.Ссылка; 
КонецФункции

&НаСервере
Процедура ИзменитьЗалогодателя()
	ОбъектСпр = Залогодатель.ПолучитьОбъект();
	Если НЕ (ОбъектСпр.Фамилия = Фамилия) ИЛИ НЕ (ОбъектСпр.Имя = Имя) ИЛИ НЕ (ОбъектСпр.Отчество = Отчество) Тогда
		ОбъектСпр.Фамилия = Фамилия;
		ОбъектСпр.Имя = Имя;
		ОбъектСпр.Отчество = Отчество;
		ОбъектСпр.Наименование = СокрЛП(Фамилия) + " " + СокрЛП(Имя) + " " + СокрЛП(Отчество);
		//+МАН 10.10.25 Заполнить техническое наименование
		ОбъектСпр.ТехническоеНаименование = ЛБ_ОбщийМодуль.СформироватьТехническоеНаименование(ОбъектСпр.Наименование);
		//-МАН
		ОбъектСпр.Записать();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораАдресаПоПрописке(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;    
	
	АдресПоПропискеСтруктура = Результат.Значение;
	АдресПоПрописке = Результат.Представление;
	
	Если ФактическийСовпадает Тогда
		ФактическийАдрес = АдресПоПрописке;
		ФактическийАдресСтруктура = АдресПоПропискеСтруктура;
		ФактическийАдресВручную = АдресПоПропискеВручную;
	КонецЕсли;	
	Если ПочтовыйСовпадает Тогда
		ПочтовыйАдрес = АдресПоПрописке;
		ПочтовыйАдресСтруктура = АдресПоПропискеСтруктура;
		ПочтовыйАдресВручную = АдресПоПропискеВручную;
	КонецЕсли;
	УстановитьДоступность();
	
	Если ЗначениеЗаполнено(Залогодатель) тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВидАдреса", 0);
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораПричиныИзмененияАдресаПоПрописке",ЭтаФорма);
		ОткрытьФорму("ОбщаяФорма.ЛБ_ПричинаИзмененияАдреса", ПараметрыФормы, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры  

&НаКлиенте
Процедура ПослеВыбораПричиныИзмененияАдресаПоПрописке(Результат, ДопПараметры) Экспорт 
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	СменилсяАдресПрописки = Истина;
	ПричинаИзмененияАдресаПоПрописке = Результат.ПричинаИзменения;
	
	Если ФактическийСовпадает Тогда 
		СменилсяФактическийАдрес = СменилсяАдресПрописки; 
		ПричинаИзмененияФактическогоАдреса = Результат.ПричинаИзменения;
	КонецЕсли;
	
	Если ПочтовыйСовпадает Тогда
		СменилсяПочтовыйАдрес = СменилсяАдресПрописки;   
		ПричинаИзмененияПочтовогоАдреса = Результат.ПричинаИзменения;
	КонецЕсли;	
КонецПроцедуры	


&НаКлиенте
Процедура ПослеВыбораФактическогоАдреса(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ФактическийАдресСтруктура = Результат.Значение;
	ФактическийАдрес = Результат.Представление; 
	
	Если ЗначениеЗаполнено(Залогодатель) тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВидАдреса", 1);
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораПричиныИзмененияФактическогоАдреса",ЭтаФорма);
		ОткрытьФорму("ОбщаяФорма.ЛБ_ПричинаИзмененияАдреса", ПараметрыФормы, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры   

&НаКлиенте
Процедура ПослеВыбораПричиныИзмененияФактическогоАдреса(Результат, ДопПараметры) Экспорт
	Если НЕ Результат = Неопределено Тогда 
		СменилсяФактическийАдрес = Истина;
		ПричинаИзмененияФактическогоАдреса = Результат.ПричинаИзменения;
	КонецЕсли;  
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВыбораПочтовогоАдреса(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПочтовыйАдресСтруктура = Результат.Значение;
	ПочтовыйАдрес = Результат.Представление;
	
	Если ЗначениеЗаполнено(Залогодатель) тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВидАдреса", 2);
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораПричиныИзмененияПочтовогоАдреса",ЭтаФорма);
		ОткрытьФорму("ОбщаяФорма.ЛБ_ПричинаИзмененияАдреса", ПараметрыФормы, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	КонецЕсли;	
КонецПроцедуры   

&НаКлиенте
Процедура ПослеВыбораПричиныИзмененияПочтовогоАдреса(Результат, ДопПараметры) Экспорт
	Если НЕ Результат = Неопределено Тогда 
		СменилсяПочтовыйАдрес = Истина;
		ПричинаИзмененияПочтовогоАдреса = Результат.ПричинаИзменения;
	КонецЕсли;  
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВыбораТелефона(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТелефонСтруктура = Результат.Значение;
	Телефон = Результат.Представление;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораТелефонаДоп(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТелефонДополнительныйСтруктура = Результат.Значение;
	ТелефонДополнительный = Результат.Представление;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораТелефонаКЛ(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТелефонКонтактногоЛицаСтруктура = Результат.Значение;
	ТелефонКонтактногоЛица = Результат.Представление;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВКИ(Инд = 0)
	Если Инд = 0 Тогда
		Возврат Справочники.ВидыКонтактнойИнформации.АдресПоПрописке;
	ИначеЕсли Инд = 1 Тогда
		Возврат Справочники.ВидыКонтактнойИнформации.АдресФактический;
	ИначеЕсли Инд = 2 Тогда
		Возврат Справочники.ВидыКонтактнойИнформации.АдресПочтовый;
	КонецЕсли;
КонецФункции	

&НаСервере
Функция ПолучитьВКИТелефон()
	Возврат Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный;
КонецФункции	

&НаСервере 
Функция ВычислитьВозвратЗалогодателя()
	Возврат ЛБ_ОбщийМодуль.ВычислитьВозраст(ДатаРождения);
КонецФункции

&НаКлиенте
Процедура ДатаРожденияПриИзменении(Элемент)
	ВозрастЗалогодателя = ВычислитьВозвратЗалогодателя();
	ОписаниеВ = ЛБ_ОбщегоНазначения.ОписаниеВозраста(ВозрастЗалогодателя);
	Элементы.ДекорацияВозраст.Заголовок = "Возраст " + Строка(ВозрастЗалогодателя) + " " + ОписаниеВ;
	
	ПроверитьДатуРождения(ВозрастЗалогодателя);
	ПроверитьСтатусПочетный();
	ПроверитьДействительностьДокументов(); 
	ЭтаФорма.ОбновитьОтображениеДанных();
	
	// ++ Сербаев 15.05.2023 
	Модифицированность = Истина;
	
	Если Не ПустаяСтрока(Фамилия) И Не ПустаяСтрока(Имя) Тогда
		СтруктураПоиска = ПроверитьОднофамильцев();
		
		Если СтруктураПоиска.ЕстьСовпадения Тогда 
			ПоказатьОднофамильцев(СтруктураПоиска.СписокЗалогодателей, СтруктураПоиска.ДанныеЗалогодателей);
		КонецЕсли;
		
		Если Не ОшибкаВОтчестве Тогда
			УстановитьДоступностьЭлементовПриСозданииКлиента(Истина);
		КонецЕсли;
		
	КонецЕсли;
	// -- Сербаев 15.05.2023
	
КонецПроцедуры

// ++ Сербаев 15.05.2023
&НаКлиенте
Процедура УстановитьДоступностьЭлементовПриСозданииКлиента(ПризнакДоступности)
	
	Если Не ПризнакДоступности Тогда
		Элементы.Отчество.Доступность          = Истина;
		Элементы.СтраницаКИ.Доступность        = Истина;
		//Иванов 06.2025 видимость кнопки ЭДО, согласия, контактные данные		
		Элементы.ЭДО.Доступность               = Ложь;
		Элементы.ЭДО.ТолькоПросмотр            = Истина;
		
		Элементы.Согласие.Доступность = Ложь;
		Элементы.Согласие.ТолькоПросмотр = Истина;
		
		Элементы.КонтактныеДанные.Доступность = Ложь;
		Элементы.КонтактныеДанные.ТолькоПросмотр = Истина;
		//
		Элементы.Группа1.Доступность           = Ложь;
		Элементы.Группа10.Доступность          = Ложь;
		Элементы.ГруппаГражданство.Доступность = Ложь;
		Элементы.ГруппаФИО_Англ.Доступность    = Ложь;
		Элементы.ГруппаДокументы.Доступность   = Ложь;
		Элементы.Группа4.Доступность           = Ложь;
		Элементы.Пол.Доступность               = Ложь;
		Элементы.МестоРождения.Доступность     = Ложь;
		Элементы.Телефон.Доступность           = Ложь;
		Элементы.Email.Доступность             = Ложь;
	Иначе 
		Элементы.СтраницаДопСтатусы.Доступность = Истина;
		Элементы.СтраницаАнкета.Доступность     = Истина; 
		Элементы.СтраницаЗБ.Доступность         = Истина;
		Элементы.Группа1.Доступность            = Истина;
		Элементы.Группа10.Доступность           = Истина;
		Элементы.ГруппаГражданство.Доступность  = Истина;
		Элементы.ГруппаФИО_Англ.Доступность     = Истина;
		Элементы.ГруппаДокументы.Доступность    = Истина;
		Элементы.Группа4.Доступность            = Истина;
		Элементы.Пол.Доступность                = Истина;
		Элементы.МестоРождения.Доступность      = Истина;
		Элементы.Телефон.Доступность            = Истина;
		Элементы.Email.Доступность              = Истина;
	КонецЕсли; 
	
КонецПроцедуры	

&НаКлиенте
Процедура ПоказатьОднофамильцев(МассивСсылок, МассивДанных)
	
	ТекстРезультат = "";
	Для каждого Данные Из МассивДанных Цикл
		
		ТекстРезультат = ТекстРезультат + Символы.ПС + СтрШаблон("%1 %2 %3, дата рождения %4 г.", Данные.Фамилия, Данные.Имя, Данные.Отчество, Формат(Данные.ДатаРождения, "ДФ=dd.MM.yyyy"));
		
	КонецЦикла;
	
	ТекстОповещения = "" + СтрШаблон("В базе %1 с идентичными данными.", ?(МассивДанных.Количество() > 1, "обнаружены клиенты", "обнаружен клиент")) + " 
	| " + ТекстРезультат + "
	|
	|Создать нового клиента? 
	|
	|Да - создать нового клиента,
	|Нет - перейти в карточку клиента, не создавая нового клиента.";
	
	Оповещение = Новый ОписаниеОповещения("ВопросСоздатьНовогоКлиента", ЭтаФорма, МассивСсылок);
	ПоказатьВопрос(Оповещение, ТекстОповещения, РежимДиалогаВопрос.ДаНет, 0)
	
КонецПроцедуры 

&НаКлиенте
Процедура ВопросСоздатьНовогоКлиента(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		
		Отбор = Новый Структура("Ссылка", ДополнительныеПараметры);
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Отбор",        Отбор);
		ПараметрыОткрытия.Вставить("ДатаРождения", ДатаРождения);
		
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораОднофамильца", ЭтаФорма);
		ОткрытьФорму("ОбщаяФорма.ЛБ_ПросмотрСписокаОднофамильцев", ПараметрыОткрытия, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.Независимый);
		
		ЭтаФорма.Модифицированность = Ложь;
		ЭтаФорма.Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВыбораОднофамильца(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура("Залогодатель", Результат);
	ОткрытьФорму("ОбщаяФорма.ЛБ_КарточкаЗалогодателя", ПараметрыОткрытия);
	
КонецПроцедуры 	

&НаСервере
Функция ПроверитьОднофамильцев()
	
	СписокЗалогодателей = Новый Массив;
	ДанныеЗалогодателей = Новый Массив;
	
	Результат = Новый Структура("ЕстьСовпадения, СписокЗалогодателей, ДанныеЗалогодателей", Ложь, СписокЗалогодателей, ДанныеЗалогодателей);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛБ_Залогодатели.Ссылка КАК Ссылка,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения
	|ИЗ
	|	Справочник.ЛБ_Залогодатели КАК ЛБ_Залогодатели
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&ДатаСреза, ) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних
	|		ПО (ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Залогодатель = ЛБ_Залогодатели.Ссылка)
	|ГДЕ
	|	ЛБ_Залогодатели.Фамилия = &Фамилия
	|	И ЛБ_Залогодатели.Имя = &Имя
	|	И ЛБ_Залогодатели.Отчество = &Отчество
	|	И ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения = &ДатаРождения
	|	И НЕ ЛБ_Залогодатели.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("ДатаСреза", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ДатаРождения", ДатаРождения);
	Запрос.УстановитьПараметр("Имя", Имя);
	Запрос.УстановитьПараметр("Отчество", Отчество);
	Запрос.УстановитьПараметр("Фамилия", Фамилия); 
	Запрос.УстановитьПараметр("Ссылка", ЭтаФорма.Залогодатель);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда 
		Результат.ЕстьСовпадения = Истина;
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл 
			Результат.СписокЗалогодателей.Добавить(Выборка.Ссылка); 
			
			СтруктураДанных = Новый Структура("Фамилия, Имя, Отчество, ДатаРождения");
			ЗаполнитьЗначенияСвойств(СтруктураДанных,Выборка);
			Результат.ДанныеЗалогодателей.Добавить(СтруктураДанных);
		КонецЦикла;	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПроверитьНаРезиденство()  
	//проверим есть действительный документ вид на жительство 
	ОтборДок = Новый структура;
	ОтборДок.Вставить("ВидДокумента", Справочники.ВидыДокументовФизическихЛиц.ВидНаЖительство);  
	ОтборДок.Вставить("Гражданство", Гражданство);
	СтрокиДок = ДокументыЗалогодателя.НайтиСтроки(ОтборДок);
	Если СтрокиДок.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;	                
	ЕстьВидНаЖительство = Ложь;
	Для каждого СтрДок из СтрокиДок Цикл 
		Если СтрДок.ДокументНеДействителен ИЛИ СтрДок.ПроверкаНеДействителен Тогда
			Продолжить; 	
		КонецЕсли;
		ЕстьВидНаЖительство = Истина;
		Прервать;
	КонецЦикла;	                
	Возврат ЕстьВидНаЖительство;
КонецФункции

&НаСервере
Процедура ПоказатьРезиденство()
	
	Если Гражданство = Справочники.СтраныМира.Россия Тогда
		Элементы.ДекорацияРезиденство.Заголовок = Перечисления.ЛБ_ВидыРезидентства.Резидент;
		//+МАН 16.01.25
		//Резиденство = Перечисления.ЛБ_ВидыРезидентства.Резидент;
		//-МАН
	Иначе	
		//Резидент = ЛБ_ОбщийМодуль.ПроверитьНаРезиденство(Залогодатель, Дата)); 
		Резидент = ПроверитьНаРезиденство();
		
		Если Резидент Тогда
			Элементы.ДекорацияРезиденство.Заголовок = Перечисления.ЛБ_ВидыРезидентства.Резидент;
			//+МАН 16.01.25
			//Резиденство = Перечисления.ЛБ_ВидыРезидентства.Резидент;
			//-МАН
		Иначе
			Элементы.ДекорацияРезиденство.Заголовок = Перечисления.ЛБ_ВидыРезидентства.Нерезидент;
			//+МАН 16.01.25
			//Резиденство = Перечисления.ЛБ_ВидыРезидентства.Нерезидент;
			//-МАН
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ДекорацияРезиденствоНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура; 
	ПараметрыФормы.Вставить("Залогодатель", Залогодатель);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ИсторияИзмененияРезиденства", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры

&НаКлиенте
Процедура СогласиеНаОпробование(Команда)
	//++ИвановВВ 12.2025, замена на новую ПФ
	//было:
	//Если ЗначениеЗаполнено(Залогодатель) Тогда
	//	//НапечататьСогласиеНаОпробование_Word();
	//	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Макет");
	//	ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "Макет");
	//	
	//	// Формирование табличного документа
	//	ПечатнаяФорма.ТабличныйДокумент = ПечатьСогласиеНаОпробование_ТабДок();
	//	
	//	КлючУникальности = Строка(Новый УникальныйИдентификатор);
	//	ПараметрыОткрытия = Новый Структура("ИмяМенеджераПечати,ИменаМакетов,ПараметрКоманды,ПараметрыПечати");
	//	ПараметрыОткрытия.ПараметрКоманды = Новый Массив;
	//	ПараметрыОткрытия.ПараметрыПечати = Новый Структура;
	//	ПараметрыОткрытия.Вставить("КоллекцияПечатныхФорм", КоллекцияПечатныхФорм);
	//	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ВладелецФормы, КлючУникальности);		
	//Иначе
	//	ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Сохраните карточку клиента!'"));	
	//КонецЕсли;
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ИмяКоманды",   "ПечатьСогласияНаОпробование");
	СтруктураПараметров.Вставить("Клиент",       Залогодатель);
	
	ЛБ_СогласияНаОбработкуПД_Клиент.ОбработкаКоманд(СтруктураПараметров);
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаявлениеОбИзмененииКонтактныхДанных(Команда)
	
	Если ЗначениеЗаполнено(Залогодатель) Тогда
		//НапечататьЗаявлениеОбИзмененииКонтактныхДанных_Word();
		КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Макет");
		ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "Макет");
		
		// Формирование табличного документа
		ПечатнаяФорма.ТабличныйДокумент = ПечатьЗаявлениеОбИзмененииКонтактныхДанных_ТабДок();
		
		КлючУникальности = Строка(Новый УникальныйИдентификатор);
		ПараметрыОткрытия = Новый Структура("ИмяМенеджераПечати,ИменаМакетов,ПараметрКоманды,ПараметрыПечати");
		ПараметрыОткрытия.ПараметрКоманды = Новый Массив;
		ПараметрыОткрытия.ПараметрыПечати = Новый Структура;
		ПараметрыОткрытия.Вставить("КоллекцияПечатныхФорм", КоллекцияПечатныхФорм);
		ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ВладелецФормы, КлючУникальности);		
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Сохраните карточку клиента!'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявлениеНаВозвратБезналичнойОплаты(Команда) 
	
	Если ЗначениеЗаполнено(Залогодатель) Тогда 
		//НапечататьЗаявлениеНаВозвратБезналичнойОплаты_Word();
		КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Макет");
		ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "Макет");
		
		// Формирование табличного документа
		ПечатнаяФорма.ТабличныйДокумент = ПечатьЗаявлениеНаВозвратБезналичнойОплаты_ТабДок();
		
		КлючУникальности = Строка(Новый УникальныйИдентификатор);
		ПараметрыОткрытия = Новый Структура("ИмяМенеджераПечати,ИменаМакетов,ПараметрКоманды,ПараметрыПечати");
		ПараметрыОткрытия.ПараметрКоманды = Новый Массив;
		ПараметрыОткрытия.ПараметрыПечати = Новый Структура;
		ПараметрыОткрытия.Вставить("КоллекцияПечатныхФорм", КоллекцияПечатныхФорм);
		ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ВладелецФормы, КлючУникальности);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Сохраните карточку клиента!'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонЗаявленияНаВозвратБезналичнойОплаты(Команда)
	
	Если ЗначениеЗаполнено(Залогодатель) Тогда 
		//НапечататьШаблонЗаявленияНаВозвратБезналичнойОплаты_Word();
		КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Макет");
		ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "Макет");
		
		// Формирование табличного документа
		ПечатнаяФорма.ТабличныйДокумент = ПечатьШаблонЗаявленияНаВозвратБезналичнойОплаты_ТабДок();
		
		КлючУникальности = Строка(Новый УникальныйИдентификатор);
		ПараметрыОткрытия = Новый Структура("ИмяМенеджераПечати,ИменаМакетов,ПараметрКоманды,ПараметрыПечати");
		ПараметрыОткрытия.ПараметрКоманды = Новый Массив;
		ПараметрыОткрытия.ПараметрыПечати = Новый Структура;
		ПараметрыОткрытия.Вставить("КоллекцияПечатныхФорм", КоллекцияПечатныхФорм);
		ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ВладелецФормы, КлючУникальности);		
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Сохраните карточку клиента!'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоверенностьПриОформленииВЛомбардеОтличномОтМестаВыдачи(Команда)
	
	//Если ЗначениеЗаполнено(Залогодатель) Тогда 
	//	НапечататьДоверенностьПриОформленииВЛомбардеОтличномОтМестаВыдачи_Word();
	//Иначе
	//	Сообщить("Сохраните карточку клиента!");
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявлениеОПредоставленииСведенийОНаличииОбязательствИмущественногоХарактера(Команда)
	
	Если ЗначениеЗаполнено(Залогодатель) Тогда 
		//НапечататьЗаявлениеОПредоставленииСведенийОНаличииОбязательствИмущественногоХарактера_Word();
		КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Макет");
		ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "Макет");
		
		// Формирование табличного документа
		ПечатнаяФорма.ТабличныйДокумент = ПечатьЗаявлениеОПредоставленииСведенийОНаличииОбязательствИмущественногоХарактера_ТабДок();
		
		КлючУникальности = Строка(Новый УникальныйИдентификатор);
		ПараметрыОткрытия = Новый Структура("ИмяМенеджераПечати,ИменаМакетов,ПараметрКоманды,ПараметрыПечати");
		ПараметрыОткрытия.ПараметрКоманды = Новый Массив;
		ПараметрыОткрытия.ПараметрыПечати = Новый Структура;
		ПараметрыОткрытия.Вставить("КоллекцияПечатныхФорм", КоллекцияПечатныхФорм);
		ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ВладелецФормы, КлючУникальности);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Сохраните карточку клиента!'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АктОПолученииИзделийНаследниками(Команда)
	
	Если ДатаСмерти = Дата(1, 1, 1) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Залогодатель) Тогда 
		//НапечататьАктОПолученииИзделийНаследниками_Word();
		КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Макет");
		ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "Макет");
		
		// Формирование табличного документа
		ПечатнаяФорма.ТабличныйДокумент = ПечатьАктОПолученииИзделийНаследниками_ТабДок();
		
		КлючУникальности = Строка(Новый УникальныйИдентификатор);
		ПараметрыОткрытия = Новый Структура("ИмяМенеджераПечати,ИменаМакетов,ПараметрКоманды,ПараметрыПечати");
		ПараметрыОткрытия.ПараметрКоманды = Новый Массив;
		ПараметрыОткрытия.ПараметрыПечати = Новый Структура;
		ПараметрыОткрытия.Вставить("КоллекцияПечатныхФорм", КоллекцияПечатныхФорм);
		ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ВладелецФормы, КлючУникальности);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Сохраните карточку клиента!'"));
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявлениеВСвободнойФорме(Команда)
	
	Если ЗначениеЗаполнено(Залогодатель) Тогда 
		//НапечататьЗаявлениеВСвободнойФорме_Word();
		КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Макет");
		ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "Макет");
		
		// Формирование табличного документа
		ПечатнаяФорма.ТабличныйДокумент = ПечатьЗаявлениеВСвободнойФорме_ТабДок();
		
		КлючУникальности = Строка(Новый УникальныйИдентификатор);
		ПараметрыОткрытия = Новый Структура("ИмяМенеджераПечати,ИменаМакетов,ПараметрКоманды,ПараметрыПечати");
		ПараметрыОткрытия.ПараметрКоманды = Новый Массив;
		ПараметрыОткрытия.ПараметрыПечати = Новый Структура;
		ПараметрыОткрытия.Вставить("КоллекцияПечатныхФорм", КоллекцияПечатныхФорм);
		ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ВладелецФормы, КлючУникальности);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Сохраните карточку клиента!'"));
	КонецЕсли;КонецПроцедуры
	
&НаКлиенте
Процедура РаспоряжениеОбОтказеНедействительныйПаспорт(Команда)
	
	Если ЗначениеЗаполнено(Залогодатель) Тогда 
		//НапечататьРаспоряжениеОбОтказеНедействительныйПаспорт_Word();
		КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Макет");
		ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "Макет");
		
		// Формирование табличного документа
		ПечатнаяФорма.ТабличныйДокумент = ПечатьРаспоряжениеОбОтказеНедействительныйПаспорт_ТабДок();
		
		КлючУникальности = Строка(Новый УникальныйИдентификатор);
		ПараметрыОткрытия = Новый Структура("ИмяМенеджераПечати,ИменаМакетов,ПараметрКоманды,ПараметрыПечати");
		ПараметрыОткрытия.ПараметрКоманды = Новый Массив;
		ПараметрыОткрытия.ПараметрыПечати = Новый Структура;
		ПараметрыОткрытия.Вставить("КоллекцияПечатныхФорм", КоллекцияПечатныхФорм);
		ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ВладелецФормы, КлючУникальности);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Сохраните карточку клиента!'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
Процедура НапечататьСогласиеНаОпробование_Word()
	
	Shell   = Новый COMОбъект("WScript.Shell");
	temp    = Shell.ExpandEnvironmentStrings("%temp%");
	Каталог = temp + "\";
	Если ПустаяСтрока(Каталог) Тогда
		Сообщить("Не выбрана каталог временных файлов");
		Возврат;
	КонецЕсли;
	//ИмяФайла           = СокрЛП(Залогодатель) + "_" + Формат(ТекущаяДата(), "ДФ=dd-MM-yyyy");
	ИмяФайла           = СтрШаблон("%1_%2_%3", СокрЛП(Залогодатель), Формат(ТекущаяДата(), "ДФ=dd-MM-yyyy"), Элементы.ФормаСогласиеНаОпробование.Заголовок);
	ИмяФайла           = СтрЗаменить(ИмяФайла, " ", "_");
	ИмяВременногоФайла = Каталог + ИмяФайла + ".doc";
	
	ШаблонДокумента = ПредопределенноеЗначение("Справочник.ЛБ_ШаблоныПечатиДокументов.СогласиеНаОпробование");
	ДвоичныеДанные = МакетПечатнойФормы(ШаблонДокумента);	
	
	Если ДвоичныеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Попытка
		ДвоичныеДанные.Записать(ИмяВременногоФайла);
		Word = Новый COMОбъект("Word.Application");
		ВордДокумент = Word.Documents.Open(ИмяВременногоФайла); 
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось создать документ Word. " + ОписаниеОшибки());							
		Word = Неопределено;
		Возврат;
	КонецПопытки;
	
	ПаспортныеДанныеСтруктура = ПаспортныеДанныеКлиента();
	
	ActiveDocument = Word.ActiveDocument;
	ВывестиПараметрНаПечать(ActiveDocument, "ТекДата",              Формат(ОбщегоНазначенияКлиент.ДатаСеанса(),"ДФ=dd.MM.yyyy"));
	ВывестиПараметрНаПечать(ActiveDocument, "ФИО",                  СокрЛП(Фамилия) + " " + СокрЛП(Имя) + ?(НЕ ПустаяСтрока(Отчество), " " + СокрЛП(Отчество), ""));
	ВывестиПараметрНаПечать(ActiveDocument, "ДатаРождения",         Формат(ДатаРождения, "ДФ=dd.MM.yyyy"));
	ВывестиПараметрНаПечать(ActiveDocument, "ПаспортныеДанные",     ПаспортныеДанныеСтруктура.ПаспортныеДанные);
	ВывестиПараметрНаПечать(ActiveDocument, "АдресМестаЖительства", ?(Не ПустаяСтрока(АдресПоПрописке), АдресПоПрописке, ФактическийАдрес)); 
	ВывестиПараметрНаПечать(ActiveDocument, "Согласен",             ?(Пол = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Женский"), "согласна", "согласен"));
	
	ВордДокумент.Application.ActiveDocument.Protect(1, ИСТИНА, Строка(Этаформа.КлючУникальности), Ложь, ИСТИНА);
	ВордДокумент.SaveAs(ИмяВременногоФайла);
	ВордДокумент.Close(Истина); 
	
	ЗапуститьПриложение(ИмяВременногоФайла); 
	
КонецПроцедуры

&НаКлиенте 
Процедура НапечататьЗаявлениеОбИзмененииКонтактныхДанных_Word()
	
	Shell   = Новый COMОбъект("WScript.Shell");
	temp    = Shell.ExpandEnvironmentStrings("%temp%");
	Каталог = temp + "\";
	Если ПустаяСтрока(Каталог) Тогда
		Сообщить("Не выбрана каталог временных файлов");
		Возврат;
	КонецЕсли;
	//ИмяФайла           = СокрЛП(Залогодатель) + "_" + Формат(ТекущаяДата(), "ДФ=dd-MM-yyyy");
	ИмяФайла           = СтрШаблон("%1_%2_%3", СокрЛП(Залогодатель), Формат(ТекущаяДата(), "ДФ=dd-MM-yyyy"), Элементы.ФормаЗаявлениеОбИзмененииКонтактныхДанных.Заголовок);
	ИмяФайла           = СтрЗаменить(ИмяФайла, " ", "_");
	ИмяВременногоФайла = Каталог + ИмяФайла + ".doc";
	
	ШаблонДокумента = ПредопределенноеЗначение("Справочник.ЛБ_ШаблоныПечатиДокументов.ЗаявлениеОбИзмененииКонтактныхДанных");
	ДвоичныеДанные = МакетПечатнойФормы(ШаблонДокумента);	
	
	Если ДвоичныеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Попытка
		ДвоичныеДанные.Записать(ИмяВременногоФайла);
		Word = Новый COMОбъект("Word.Application");
		ВордДокумент = Word.Documents.Open(ИмяВременногоФайла); 
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось создать документ Word. " + ОписаниеОшибки());							
		Word = Неопределено;
		Возврат;
	КонецПопытки; 
	
	ПаспортныеДанныеСтруктура = ПаспортныеДанныеКлиента();
	
	ActiveDocument = Word.ActiveDocument;
	ВывестиПараметрНаПечать(ActiveDocument, "ТекущаяДата",      Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy"));
	ВывестиПараметрНаПечать(ActiveDocument, "ФИО",              СокрЛП(Фамилия) + " " + СокрЛП(Имя) + ?(НЕ ПустаяСтрока(Отчество), " " + СокрЛП(Отчество), ""));
	ВывестиПараметрНаПечать(ActiveDocument, "ДатаРождения",     СтрШаблон("%1 г.р.",Формат(ДатаРождения, "ДФ=dd.MM.yyyy")));
	ВывестиПараметрНаПечать(ActiveDocument, "ПаспортныеДанные", ПаспортныеДанныеСтруктура.ПаспортныеДанные);
	ВывестиПараметрНаПечать(ActiveDocument, "ФактическийАдрес", ?(Не ПустаяСтрока(АдресПоПрописке), АдресПоПрописке, ФактическийАдрес));
	
	ВордДокумент.Application.ActiveDocument.Protect(2,ИСТИНА,Строка(Этаформа.КлючУникальности),Ложь,ИСТИНА);
	ВордДокумент.SaveAs(ИмяВременногоФайла);
	ВордДокумент.Close(Истина); 
	
	ЗапуститьПриложение(ИмяВременногоФайла);
	
КонецПроцедуры

&НаКлиенте 
Процедура НапечататьЗаявлениеНаВозвратБезналичнойОплаты_Word()
	
	Shell   = Новый COMОбъект("WScript.Shell");
	temp    = Shell.ExpandEnvironmentStrings("%temp%");
	Каталог = temp + "\";
	Если ПустаяСтрока(Каталог) Тогда
		Сообщить("Не выбрана каталог временных файлов");
		Возврат;
	КонецЕсли;
	//ИмяФайла           = СокрЛП(Залогодатель) + "_" + Формат(ТекущаяДата(), "ДФ=dd-MM-yyyy");
	ИмяФайла           = СтрШаблон("%1_%2_%3", СокрЛП(Залогодатель), Формат(ТекущаяДата(), "ДФ=dd-MM-yyyy"), Элементы.ФормаЗаявлениеНаВозвратБезналичнойОплаты.Заголовок);
	ИмяФайла           = СтрЗаменить(ИмяФайла, " ", "_");
	ИмяВременногоФайла = Каталог + ИмяФайла + ".doc";
	
	ШаблонДокумента = ПредопределенноеЗначение("Справочник.ЛБ_ШаблоныПечатиДокументов.ЗаявлениеНаВозвратБезналичнойОплаты");
	ДвоичныеДанные = МакетПечатнойФормы(ШаблонДокумента);	
	
	Если ДвоичныеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Попытка
		ДвоичныеДанные.Записать(ИмяВременногоФайла);
		Word = Новый COMОбъект("Word.Application");
		ВордДокумент = Word.Documents.Open(ИмяВременногоФайла); 
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось создать документ Word. " + ОписаниеОшибки());							
		Word = Неопределено;
		Возврат;
	КонецПопытки; 
	
	ФИО = СокрЛП(Фамилия) + " " + СокрЛП(Имя) + ?(НЕ ПустаяСтрока(Отчество), " " + СокрЛП(Отчество), "");
	
	ДанныеДляПечати = ПолучитьДанныеДляПечатиЗаявлениеНаВозвратБезналичнойОплаты(ФИО);
	
	ActiveDocument = Word.ActiveDocument;
	ВывестиПараметрНаПечать(ActiveDocument, "Директор",               ДанныеДляПечати.Директор);
	ВывестиПараметрНаПечать(ActiveDocument, "ФИО",                    ФИО);
	ВывестиПараметрНаПечать(ActiveDocument, "ФИОСклон",               ДанныеДляПечати.ФИОСклон);
	ВывестиПараметрНаПечать(ActiveDocument, "Телефон",                ?(ПустаяСтрока(Телефон), "", Телефон));
	ВывестиПараметрНаПечать(ActiveDocument, "ПаспортныеДанные",       ДанныеДляПечати.ПаспортныеДанные);
	//ВывестиПараметрНаПечать(ActiveDocument, "СуммаДенежныхСредств",   );
	//ВывестиПараметрНаПечать(ActiveDocument, "НомерПоручения",         );
	//ВывестиПараметрНаПечать(ActiveDocument, "ДатаПоручения",          );
	//ВывестиПараметрНаПечать(ActiveDocument, "НомераЗалоговыхБилетов", );
	ВывестиПараметрНаПечать(ActiveDocument, "ТекущаяДата",            Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy"));
	
	ВордДокумент.Application.ActiveDocument.Protect(2,ИСТИНА,Строка(Этаформа.КлючУникальности),Ложь,ИСТИНА);
	ВордДокумент.SaveAs(ИмяВременногоФайла);
	ВордДокумент.Close(Истина); 
	
	ЗапуститьПриложение(ИмяВременногоФайла);
	
КонецПроцедуры	

&НаКлиенте 
Процедура НапечататьШаблонЗаявленияНаВозвратБезналичнойОплаты_Word() 
	
	Shell   = Новый COMОбъект("WScript.Shell");
	temp    = Shell.ExpandEnvironmentStrings("%temp%");
	Каталог = temp + "\";
	Если ПустаяСтрока(Каталог) Тогда
		Сообщить("Не выбрана каталог временных файлов");
		Возврат;
	КонецЕсли;
	//ИмяФайла           = СокрЛП(Залогодатель) + "_" + Формат(ТекущаяДата(), "ДФ=dd-MM-yyyy");
	ИмяФайла           = СтрШаблон("%1_%2_%3", СокрЛП(Залогодатель), Формат(ТекущаяДата(), "ДФ=dd-MM-yyyy"), Элементы.ФормаШаблонЗаявленияНаВозвратБезналичнойОплаты.Заголовок);
	ИмяФайла           = СтрЗаменить(ИмяФайла, " ", "_");
	ИмяВременногоФайла = Каталог + ИмяФайла + ".doc";
	
	ШаблонДокумента = ПредопределенноеЗначение("Справочник.ЛБ_ШаблоныПечатиДокументов.ШаблонЗаявленияНаВозвратБезналичнойОплаты");
	ДвоичныеДанные = МакетПечатнойФормы(ШаблонДокумента);	
	
	Если ДвоичныеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Попытка
		ДвоичныеДанные.Записать(ИмяВременногоФайла);
		Word = Новый COMОбъект("Word.Application");
		ВордДокумент = Word.Documents.Open(ИмяВременногоФайла); 
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось создать документ Word. " + ОписаниеОшибки());							
		Word = Неопределено;
		Возврат;
	КонецПопытки; 
	
	//ActiveDocument = Word.ActiveDocument;
	//ВывестиПараметрНаПечать(ActiveDocument, "", ); 
	
	ВордДокумент.Application.ActiveDocument.Protect(2,ИСТИНА,Строка(Этаформа.КлючУникальности),Ложь,ИСТИНА);
	ВордДокумент.SaveAs(ИмяВременногоФайла);
	ВордДокумент.Close(Истина); 
	
	ЗапуститьПриложение(ИмяВременногоФайла);
	
КонецПроцедуры	

&НаКлиенте 
Процедура НапечататьДоверенностьПриОформленииВЛомбардеОтличномОтМестаВыдачи_Word()
	
	Shell   = Новый COMОбъект("WScript.Shell");
	temp    = Shell.ExpandEnvironmentStrings("%temp%");
	Каталог = temp + "\";
	Если ПустаяСтрока(Каталог) Тогда
		Сообщить("Не выбрана каталог временных файлов");
		Возврат;
	КонецЕсли;
	//ИмяФайла           = СокрЛП(Залогодатель) + "_" + Формат(ТекущаяДата(), "ДФ=dd-MM-yyyy");
	ИмяФайла           = СтрШаблон("%1_%2_%3", СокрЛП(Залогодатель), Формат(ТекущаяДата(), "ДФ=dd-MM-yyyy"), Элементы.ФормаДоверенностьПриОформленииВЛомбардеОтличномОтМестаВыдачи.Заголовок);
	ИмяФайла           = СтрЗаменить(ИмяФайла, " ", "_");
	ИмяВременногоФайла = Каталог + ИмяФайла + ".doc";
	
	ШаблонДокумента = ПредопределенноеЗначение("Справочник.ЛБ_ШаблоныПечатиДокументов.ДоверенностьПриОформленииВЛомбардеОтличногоОтМестаВыдачи");
	ДвоичныеДанные = МакетПечатнойФормы(ШаблонДокумента);	
	
	Если ДвоичныеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Попытка
		ДвоичныеДанные.Записать(ИмяВременногоФайла);
		Word = Новый COMОбъект("Word.Application");
		ВордДокумент = Word.Documents.Open(ИмяВременногоФайла); 
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось создать документ Word. " + ОписаниеОшибки());							
		Word = Неопределено;
		Возврат;
	КонецПопытки; 
	
	//ActiveDocument = Word.ActiveDocument;
	//ВывестиПараметрНаПечать(ActiveDocument, "", ); 
	
	ВордДокумент.Application.ActiveDocument.Protect(2,ИСТИНА,Строка(Этаформа.КлючУникальности),Ложь,ИСТИНА);
	ВордДокумент.SaveAs(ИмяВременногоФайла);
	ВордДокумент.Close(Истина); 
	
	ЗапуститьПриложение(ИмяВременногоФайла);
	
КонецПроцедуры	

&НаКлиенте 
Процедура НапечататьЗаявлениеОПредоставленииСведенийОНаличииОбязательствИмущественногоХарактера_Word()
	
	Shell   = Новый COMОбъект("WScript.Shell");
	temp    = Shell.ExpandEnvironmentStrings("%temp%");
	Каталог = temp + "\";
	Если ПустаяСтрока(Каталог) Тогда
		Сообщить("Не выбрана каталог временных файлов");
		Возврат;
	КонецЕсли;
	//ИмяФайла           = СокрЛП(Залогодатель) + "_" + Формат(ТекущаяДата(), "ДФ=dd-MM-yyyy");
	ИмяФайла           = СтрШаблон("%1_%2_%3", СокрЛП(Залогодатель), Формат(ТекущаяДата(), "ДФ=dd-MM-yyyy"), Элементы.ФормаЗаявлениеОПредоставленииСведенийОНаличииОбязательствИмущественногоХарактера.Заголовок);
	ИмяФайла           = СтрЗаменить(ИмяФайла, " ", "_");
	ИмяВременногоФайла = Каталог + ИмяФайла + ".doc";
	
	ШаблонДокумента = ПредопределенноеЗначение("Справочник.ЛБ_ШаблоныПечатиДокументов.ЗаявлениеОПредоставленииСведенийОНаличииОбязательствИмущественногоХарактера");
	ДвоичныеДанные = МакетПечатнойФормы(ШаблонДокумента);	
	
	Если ДвоичныеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Попытка
		ДвоичныеДанные.Записать(ИмяВременногоФайла);
		Word = Новый COMОбъект("Word.Application");
		ВордДокумент = Word.Documents.Open(ИмяВременногоФайла); 
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось создать документ Word. " + ОписаниеОшибки());							
		Word = Неопределено;
		Возврат;
	КонецПопытки;  
	
	ФИО = СокрЛП(Фамилия) + " " + СокрЛП(Имя) + ?(НЕ ПустаяСтрока(Отчество), " " + СокрЛП(Отчество), "");
	
	ДанныеДляПечати = ПолучитьДанныеДляПечатиЗаявленияОПредоставленииСведенийОНаличииОбязательствИмущественногоХарактера(ФИО);
	
	ActiveDocument = Word.ActiveDocument;
	ВывестиПараметрНаПечать(ActiveDocument, "ФИОКлиентаПолностью",                 ДанныеДляПечати.ФИО);
	ВывестиПараметрНаПечать(ActiveDocument, "ДатаРожденияКлиента",                 СтрШаблон("%1 г.", Формат(ДатаРождения, "ДФ=dd.MM.yyyy")));
	ВывестиПараметрНаПечать(ActiveDocument, "ПаспортСерияНомер",                   ДанныеДляПечати.ПаспортСерияНомер);
	ВывестиПараметрНаПечать(ActiveDocument, "КогдаВыдан",                          ДанныеДляПечати.КогдаВыдан);
	ВывестиПараметрНаПечать(ActiveDocument, "КемВыдан",                            ДанныеДляПечати.КемВыдан);
	ВывестиПараметрНаПечать(ActiveDocument, "КодПодразделения",                    ДанныеДляПечати.КодПодразделения);
	ВывестиПараметрНаПечать(ActiveDocument, "Адрес",                               СтрШаблон("Адрес: %1",   ?(Не ПустаяСтрока(АдресПоПрописке), АдресПоПрописке, ФактическийАдрес)));
	ВывестиПараметрНаПечать(ActiveDocument, "Телефон",                             СтрШаблон("Телефон: %1", ?(ПустаяСтрока(Телефон), "", Телефон)));
	ВывестиПараметрНаПечать(ActiveDocument, "ТекущаяДата",                         Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy"));
	ВывестиПараметрНаПечать(ActiveDocument, "НаименованиеОтделенияИНомерЛомбарда", "");     //Не заполнен
	ВывестиПараметрНаПечать(ActiveDocument, "ФИОРаботника",                        ДанныеДляПечати.ФиоРаботника);     
	
	ВордДокумент.Application.ActiveDocument.Protect(2,ИСТИНА,Строка(Этаформа.КлючУникальности),Ложь,ИСТИНА);
	ВордДокумент.SaveAs(ИмяВременногоФайла);
	ВордДокумент.Close(Истина); 
	
	ЗапуститьПриложение(ИмяВременногоФайла);
	
КонецПроцедуры	

&НаКлиенте 
Процедура НапечататьАктОПолученииИзделийНаследниками_Word()
	
	Shell   = Новый COMОбъект("WScript.Shell");
	temp    = Shell.ExpandEnvironmentStrings("%temp%");
	Каталог = temp + "\";
	Если ПустаяСтрока(Каталог) Тогда
		Сообщить("Не выбрана каталог временных файлов");
		Возврат;
	КонецЕсли;
	//ИмяФайла           = СокрЛП(Залогодатель) + "_" + Формат(ТекущаяДата(), "ДФ=dd-MM-yyyy");
	ИмяФайла           = СтрШаблон("%1_%2_%3", СокрЛП(Залогодатель), Формат(ТекущаяДата(), "ДФ=dd-MM-yyyy"), Элементы.ФормаАктОПолученииИзделийНаследниками.Заголовок);
	ИмяФайла           = СтрЗаменить(ИмяФайла, " ", "_");
	ИмяВременногоФайла = Каталог + ИмяФайла + ".doc";
	
	ШаблонДокумента = ПредопределенноеЗначение("Справочник.ЛБ_ШаблоныПечатиДокументов.АктОПолученииИзделийНаследниками");
	ДвоичныеДанные = МакетПечатнойФормы(ШаблонДокумента);	
	
	Если ДвоичныеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Попытка
		ДвоичныеДанные.Записать(ИмяВременногоФайла);
		Word = Новый COMОбъект("Word.Application");
		ВордДокумент = Word.Documents.Open(ИмяВременногоФайла); 
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось создать документ Word. " + ОписаниеОшибки());							
		Word = Неопределено;
		Возврат;
	КонецПопытки; 
	
	ActiveDocument = Word.ActiveDocument;
	ВывестиПараметрНаПечать(ActiveDocument, "ТекущаяДата", Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy"));
	
	ВордДокумент.Application.ActiveDocument.Protect(2,ИСТИНА,Строка(Этаформа.КлючУникальности),Ложь,ИСТИНА);
	ВордДокумент.SaveAs(ИмяВременногоФайла);
	ВордДокумент.Close(Истина); 
	
	ЗапуститьПриложение(ИмяВременногоФайла);
	
КонецПроцедуры	

&НаКлиенте 
Процедура НапечататьЗаявлениеВСвободнойФорме_Word()
	
	Shell   = Новый COMОбъект("WScript.Shell");
	temp    = Shell.ExpandEnvironmentStrings("%temp%");
	Каталог = temp + "\";
	Если ПустаяСтрока(Каталог) Тогда
		Сообщить("Не выбрана каталог временных файлов");
		Возврат;
	КонецЕсли;
	//ИмяФайла           = СокрЛП(Залогодатель) + "_" + Формат(ТекущаяДата(), "ДФ=dd-MM-yyyy");
	ИмяФайла           = СтрШаблон("%1_%2_%3", СокрЛП(Залогодатель), Формат(ТекущаяДата(), "ДФ=dd-MM-yyyy"), Элементы.ФормаЗаявлениеВСвободнойФорме.Заголовок);
	ИмяФайла           = СтрЗаменить(ИмяФайла, " ", "_");
	ИмяВременногоФайла = Каталог + ИмяФайла + ".doc";
	
	ШаблонДокумента = ПредопределенноеЗначение("Справочник.ЛБ_ШаблоныПечатиДокументов.ЗаявлениеВСвободнойФорме");
	ДвоичныеДанные = МакетПечатнойФормы(ШаблонДокумента);	
	
	Если ДвоичныеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Попытка
		ДвоичныеДанные.Записать(ИмяВременногоФайла);
		Word = Новый COMОбъект("Word.Application");
		ВордДокумент = Word.Documents.Open(ИмяВременногоФайла); 
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось создать документ Word. " + ОписаниеОшибки());							
		Word = Неопределено;
		Возврат;
	КонецПопытки; 
	
	ФИО = СокрЛП(Фамилия) + " " + СокрЛП(Имя) + ?(НЕ ПустаяСтрока(Отчество), " " + СокрЛП(Отчество), "");
	
	ДанныеДляПечати = ПолучитьДанныеДляПечатиЗаявлениеВСвободнойФорме(ФИО); 
	
	ActiveDocument = Word.ActiveDocument;
	ВывестиПараметрНаПечать(ActiveDocument, "ТекущаяДата",         Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy"));
	ВывестиПараметрНаПечать(ActiveDocument, "Директор",            ДанныеДляПечати.Директор);
	ВывестиПараметрНаПечать(ActiveDocument, "ФИОКлиента",          ДанныеДляПечати.ФИОСклон);
	ВывестиПараметрНаПечать(ActiveDocument, "ДатаРожденияКлиента", Формат(ДатаРождения, "ДФ=dd.MM.yyyy"));
	ВывестиПараметрНаПечать(ActiveDocument, "ПаспортСерияНомер",   ДанныеДляПечати.ПаспортСерияНомер);
	ВывестиПараметрНаПечать(ActiveDocument, "КогдаВыдан",          ДанныеДляПечати.КогдаВыдан);
	ВывестиПараметрНаПечать(ActiveDocument, "КемВыдан",            ДанныеДляПечати.КемВыдан);
	ВывестиПараметрНаПечать(ActiveDocument, "Адрес",               СтрШаблон("Адрес: %1",   ?(Не ПустаяСтрока(АдресПоПрописке), АдресПоПрописке, ФактическийАдрес)));
	ВывестиПараметрНаПечать(ActiveDocument, "Телефон",             СтрШаблон("Телефон: %1", ?(ПустаяСтрока(Телефон), "", Телефон)));
	
	ВордДокумент.Application.ActiveDocument.Protect(2,ИСТИНА,Строка(Этаформа.КлючУникальности),Ложь,ИСТИНА);
	ВордДокумент.SaveAs(ИмяВременногоФайла);
	ВордДокумент.Close(Истина); 
	
	ЗапуститьПриложение(ИмяВременногоФайла);
	
КонецПроцедуры	

&НаКлиенте 
Процедура НапечататьРаспоряжениеОбОтказеНедействительныйПаспорт_Word()
	
	Shell   = Новый COMОбъект("WScript.Shell");
	temp    = Shell.ExpandEnvironmentStrings("%temp%");
	Каталог = temp + "\";
	Если ПустаяСтрока(Каталог) Тогда
		Сообщить("Не выбрана каталог временных файлов");
		Возврат;
	КонецЕсли;
	//ИмяФайла           = СокрЛП(Залогодатель) + "_" + Формат(ТекущаяДата(), "ДФ=dd-MM-yyyy");
	ИмяФайла           = СтрШаблон("%1_%2_%3", СокрЛП(Залогодатель), Формат(ТекущаяДата(), "ДФ=dd-MM-yyyy"), Элементы.ФормаРаспоряжениеОбОтказеНедействительныйПаспорт.Заголовок);
	ИмяФайла           = СтрЗаменить(ИмяФайла, " ", "_");
	ИмяВременногоФайла = Каталог + ИмяФайла + ".doc";
	
	ШаблонДокумента = ПредопределенноеЗначение("Справочник.ЛБ_ШаблоныПечатиДокументов.РаспоряжениеОбОтказеНедействительныйПаспорт");
	ДвоичныеДанные = МакетПечатнойФормы(ШаблонДокумента);	
	
	Если ДвоичныеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Попытка
		ДвоичныеДанные.Записать(ИмяВременногоФайла);
		Word = Новый COMОбъект("Word.Application");
		ВордДокумент = Word.Documents.Open(ИмяВременногоФайла); 
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось создать документ Word. " + ОписаниеОшибки());							
		Word = Неопределено;
		Возврат;
	КонецПопытки; 
	
	//ActiveDocument = Word.ActiveDocument;
	//ВывестиПараметрНаПечать(ActiveDocument, "", ); 
	
	ВордДокумент.Application.ActiveDocument.Protect(2,ИСТИНА,Строка(Этаформа.КлючУникальности),Ложь,ИСТИНА);
	ВордДокумент.SaveAs(ИмяВременногоФайла);
	ВордДокумент.Close(Истина); 
	
	ЗапуститьПриложение(ИмяВременногоФайла);
	
КонецПроцедуры	

&НаСервере
Функция МакетПечатнойФормы(ШаблонДокумента)
	
	Если НЕ ТипЗнч(ШаблонДокумента.ХранилищеШаблона.Получить()) = Тип("ДвоичныеДанные") Тогда
		Сообщить("Шаблон печати анкеты не загружен!");
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ШаблонДокумента.ХранилищеШаблона.Получить();
	
КонецФункции 

&НаКлиенте
Процедура ВывестиПараметрНаПечать(ОбъектДокумент, ИмяПараметра, ЗначениеПараметра) 
	
	ЗначениеДляПодстановки = "" + ЗначениеПараметра;
	
	Если Не ЗначениеЗаполнено(ЗначениеПараметра) Тогда
		ЗначениеДляПодстановки = "                    ";
	КонецЕсли;	
	
	СтрокаПоиска 	= "[" + ИмяПараметра + "]";
	ВесьДок			= ОбъектДокумент.Content;			// Присвоить переменной содержимое документа
	Поиск 			= Весьдок.Find;
	Поиск.Text 		= СтрокаПоиска;
	Поиск.Execute();		
	
	Пока Поиск.Found Цикл
		
		ВесьДок.Text 	= ЗначениеДляПодстановки;
		
		ВесьДок			= ОбъектДокумент.Content;			// Присвоить переменной содержимое документа
		Поиск 			= Весьдок.Find;
		Поиск.Text 		= СтрокаПоиска;
		Поиск.Execute();
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Функция ПаспортныеДанныеКлиента(ДокументСПрописнойБуквы = Ложь)
	
	Результат = Новый Структура("ПаспортныеДанные, ВидДокумента, Серия, Номер, КемВыдан, ДатаВыдачи, КодПодразделения", "", "", "", "", "", "", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента.Представление КАК ВидДокумента,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК Серия,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК Номер,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК КемВыдан,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА """"
	|		ИНАЧЕ ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи
	|	КОНЕЦ КАК ДатаВыдачи,
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК КодПодразделения
	|ИЗ
	|	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(, ДокументЗалогодателя.Владелец = &Залогодатель) КАК ЛБ_ДокументыЗалогодателейСрезПоследних
	|ГДЕ
	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя = &ДУЛ
	|	И НЕ ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНеДействителен
	|	И ЛБ_ДокументыЗалогодателейСрезПоследних.ОсновнойДУЛ";
	
	Запрос.УстановитьПараметр("ДУЛ", Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий(); 
		
		ВидДокументаВыборка = ?(ДокументСПрописнойБуквы, СтрШаблон("%1%2", НРег(Лев(Выборка.ВидДокумента, 1)), Сред(Выборка.ВидДокумента, 2)), Выборка.ВидДокумента);
		
		ВидДокумента     = ?(ПустаяСтрока(ВидДокументаВыборка),      "", СтрШаблон(" %1:",                    ВидДокументаВыборка));
		Серия            = ?(ПустаяСтрока(Выборка.Серия),            "", СтрШаблон(" серия %1",              Выборка.Серия));
		Номер            = ?(ПустаяСтрока(Выборка.Номер),            "", СтрШаблон(" номер %1,",              Выборка.Номер));
		КемВыдан         = ?(ПустаяСтрока(Выборка.КемВыдан),         "", СтрШаблон(" выдан: %1,",             Выборка.КемВыдан));
		ДатаВыдачи       = ?(ПустаяСтрока(Выборка.ДатаВыдачи),       "", СтрШаблон(" дата выдачи: %1,",       Формат(Выборка.ДатаВыдачи,"ДФ=dd.MM.yyyy")));
		КодПодразделения = ?(ПустаяСтрока(Выборка.КодПодразделения), "", СтрШаблон(" код подразделения: %1,", Выборка.КодПодразделения)); 
		
		Результат.Вставить("ПаспортныеДанные", СтрШаблон("%1%2%3%4%5%6", ВидДокумента, Серия, Номер, КемВыдан, ДатаВыдачи, КодПодразделения));
		Результат.Вставить("ВидДокумента",     Выборка.ВидДокумента);
		Результат.Вставить("Серия",            Выборка.Серия);
		Результат.Вставить("Номер",            Выборка.Номер);
		Результат.Вставить("КемВыдан",         Выборка.КемВыдан);
		Результат.Вставить("ДатаВыдачи",       Выборка.ДатаВыдачи);
		Результат.Вставить("КодПодразделения", Выборка.КодПодразделения);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

&НаСервере
Функция ПолучитьДанныеДляПечатиЗаявлениеНаВозвратБезналичнойОплаты(ФИО) 
	
	ДанныеДляПечати = Новый Структура;
	
	ПаспортныеДанныеСтруктура = ПаспортныеДанныеКлиента(); 
	
	ДанныеДляПечати.Вставить("Директор",         ПолучитьСклоненияСтроки(ФИОДиректора(), , "ПД=Дательный")[0]);
	ДанныеДляПечати.Вставить("ФИОСклон",         ПолучитьСклоненияСтроки(ФИО, , "ПД=Родительный")[0]);
	ДанныеДляПечати.Вставить("ПаспортныеДанные", ПаспортныеДанныеСтруктура.ПаспортныеДанные);
	
	Возврат ДанныеДляПечати;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеДляПечатиЗаявленияОПредоставленииСведенийОНаличииОбязательствИмущественногоХарактера(ФИО)
	
	ДанныеДляПечати = Новый Структура;
	
	ПаспортныеДанныеСтруктура = ПаспортныеДанныеКлиента();
	
	ДанныеДляПечати.Вставить("ПаспортСерияНомер", СтрШаблон("серия %1 № %2", ПаспортныеДанныеСтруктура.Серия, ПаспортныеДанныеСтруктура.Номер));
	ДанныеДляПечати.Вставить("КогдаВыдан",        СтрШаблон("выдан %1 г.", Формат(ПаспортныеДанныеСтруктура.ДатаВыдачи, "ДФ=dd.MM.yyyy")));
	ДанныеДляПечати.Вставить("КемВыдан",          ПаспортныеДанныеСтруктура.КемВыдан);
	ДанныеДляПечати.Вставить("КодПодразделения",  ПаспортныеДанныеСтруктура.КодПодразделения); 
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	Если НЕ ТекПользователь.ЭтоЛомбард Тогда
		Сотрудник = ТекПользователь.Сотрудник;
	Иначе
		Сотрудник = ПараметрыСеанса.ТекущийСотрудник;
	КонецЕсли;	
	ДанныеДляПечати.Вставить("ФиоРаботника",      Сотрудник);
	ДанныеДляПечати.Вставить("Фио",               ПолучитьСклоненияСтроки(ФИО, , "ПД=Родительный")[0]);
	
	Возврат ДанныеДляПечати;
	
КонецФункции	

&НаСервере
Функция ПолучитьДанныеДляПечатиЗаявлениеВСвободнойФорме(ФИО)
	
	ДанныеДляПечати = Новый Структура;
	
	ПаспортныеДанныеСтруктура = ПаспортныеДанныеКлиента();
	
	ДанныеДляПечати.Вставить("ПаспортСерияНомер", СтрШаблон("серия %1 № %2", ПаспортныеДанныеСтруктура.Серия, ПаспортныеДанныеСтруктура.Номер));
	ДанныеДляПечати.Вставить("Директор",          ПолучитьСклоненияСтроки(ФИОДиректора(), , "ПД=Дательный")[0]);
	ДанныеДляПечати.Вставить("ФИОСклон",         ПолучитьСклоненияСтроки(ФИО, , "ПД=Родительный")[0]);
	ДанныеДляПечати.Вставить("КогдаВыдан",        СтрШаблон("выдан %1 г.", Формат(ПаспортныеДанныеСтруктура.ДатаВыдачи, "ДФ=dd.MM.yyyy")));
	ДанныеДляПечати.Вставить("КемВыдан",          ПаспортныеДанныеСтруктура.КемВыдан);
	
	Возврат ДанныеДляПечати;
	
КонецФункции	

&НаСервере
Функция ФИОДиректора()
	
	Результат = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.Директор.Представление КАК Директор
	|ИЗ
	|	Константа.ЛБ_ОсновнаяОрганизация КАК ЛБ_ОсновнаяОрганизация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ЛБ_ОсновнаяОрганизация.Значение = Организации.Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.Директор;	
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

&НаКлиенте
Процедура НапечататьАнкетуВариант()
	
	Shell   = Новый COMОбъект("WScript.Shell");
	temp    = Shell.ExpandEnvironmentStrings("%temp%");
	Каталог = temp + "\";
	Если ПустаяСтрока(Каталог) Тогда
		Сообщить("Не выбран каталог временных файлов");
		Возврат;
	КонецЕсли;
	ИмяФайла           = СтрШаблон("%1_%2_%3", СокрЛП(Залогодатель), Формат(ТекущаяДата(), "ДФ=dd-MM-yyyy"), Элементы.ФормаКнопкаПечатьАнкеты.Заголовок);
	ИмяФайла           = СтрЗаменить(ИмяФайла, " ", "_");
	ИмяВременногоФайла = Каталог + ИмяФайла + ".doc";
	
	ШаблонДокумента = ПредопределенноеЗначение("Справочник.ЛБ_ШаблоныПечатиДокументов.Анкета");
	ДвоичныеДанные = МакетПечатнойФормы(ШаблонДокумента);	
	
	Если ДвоичныеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Попытка
		ДвоичныеДанные.Записать(ИмяВременногоФайла);
		Word = Новый COMОбъект("Word.Application");
		ВордДокумент = Word.Documents.Open(ИмяВременногоФайла); 
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось создать документ Word. " + ОписаниеОшибки());							
		Word = Неопределено;
		Возврат;
	КонецПопытки; 
	
	МассивВыбора = СтрРазделить(КатегорииФизЛица, ";", ложь);
	
	ДанныеДляПечати = ПолучитьДанныеДляПечатиАнкеты(МассивВыбора, Гражданство);
	
	Телефоны = "";
	Телефоны = ?(ПустаяСтрока(Телефон), "", Телефон); 
	Телефоны = Телефоны + ?(ПустаяСтрока(ТелефонДополнительный), "", ?(ПустаяСтрока(Телефоны), "", Символы.ПС) + ТелефонДополнительный);
	Контакты = КонтактноеЛицо + ?(ПустаяСтрока(ТелефонКонтактногоЛица), "", " тел. " +  ТелефонКонтактногоЛица);
	
	КлиентФИО = СокрЛП(Фамилия) + " " + СокрЛП(Имя) + ?(НЕ ПустаяСтрока(Отчество), " " + СокрЛП(Отчество), "");
	
	Если НЕ ЯвляетсяИПДЛ Тогда
		ИПДЛСтрокой = "Не является"; 
	Иначе   
		СтрокаИПДЛ = ""; 
		СтрокаИПДЛ = ?(ПустаяСтрока(СтрокаИПДЛ), "", Символы.ПС) + Строка(КатегорияКлиентаИПДЛ) +
		?(ПустаяСтрока(ДопИнформацияИПДЛ), "", " " + СокрЛП(ДопИнформацияИПДЛ));  
		Если НЕ ПустаяСтрока(ДолжностьИПДЛ) Тогда	   
			СтрокаИПДЛ = ?(ПустаяСтрока(СтрокаИПДЛ), "", Символы.ПС) + "Должность: " + СокрЛП(ДолжностьИПДЛ);
		КонецЕсли;
		Если НЕ ПустаяСтрока(РаботодательИПДЛ) Тогда	   
			СтрокаИПДЛ = ?(ПустаяСтрока(СтрокаИПДЛ), "", Символы.ПС) + "Работодатель: " + СокрЛП(РаботодательИПДЛ);
		КонецЕсли;	
		ИПДЛСтрокой = СтрокаИПДЛ; 
	КонецЕсли;  
	
	Если НЕ ЯвляетсяДЛПМО_РДПЛ Тогда
		ДЛПМО_РДПЛСтрокой = "Не является"; 
	Иначе   
		СтрокаДЛПМО_РДПЛ = ""; 
		СтрокаДЛПМО_РДПЛ = ?(ПустаяСтрока(СтрокаДЛПМО_РДПЛ), "", Символы.ПС) + Строка(КатегорияДЛПМО_РДПЛ) +
		?(ПустаяСтрока(ДопИнформацияИПДЛ), "", " " + СокрЛП(ДопИнформацияИПДЛ));  
		Если НЕ ПустаяСтрока(ДолжностьДЛПМО_РДПЛ) Тогда	   
			СтрокаДЛПМО_РДПЛ= ?(ПустаяСтрока(СтрокаДЛПМО_РДПЛ), "", Символы.ПС) + "Должность: " + СокрЛП(ДолжностьДЛПМО_РДПЛ);
		КонецЕсли;
		Если НЕ ПустаяСтрока(РаботодательДЛПМО_РДПЛ) Тогда	   
			СтрокаДЛПМО_РДПЛ = ?(ПустаяСтрока(СтрокаДЛПМО_РДПЛ), "", Символы.ПС) + "Работодатель: " + СокрЛП(РаботодательДЛПМО_РДПЛ);
		КонецЕсли;	
		ДЛПМО_РДПЛСтрокой = СтрокаДЛПМО_РДПЛ; 
	КонецЕсли;
	
	ИсточникиПроисхождения = "";  
	Если ЗначениеЗаполнено(ИсточникПроисхожденияДенежныхСредств) Тогда
		ИсточникиПроисхождения = ИсточникиПроисхождения + "Источник происхождения денежных средств: " + СокрЛП(ИсточникПроисхожденияДенежныхСредств);
	Иначе
		ИсточникиПроисхождения = ИсточникиПроисхождения + "Источник происхождения денежных средств: " + СокрЛП(ИсточникПроисхожденияДенежныхСредствИной); 
	КонецЕсли;	  	                  
	ИсточникиПроисхождения = ИсточникиПроисхождения + Символы.ПС;
	Если ЗначениеЗаполнено(ИсточникПроисхожденияИмущества) Тогда
		ИсточникиПроисхождения = ИсточникиПроисхождения + "Источник происхождения имущества: " + СокрЛП(ИсточникПроисхожденияИмущества);
	Иначе
		ИсточникиПроисхождения = ИсточникиПроисхождения + "Источник происхождения имущества: " + СокрЛП(ИсточникПроисхожденияИмуществаИной); 
	КонецЕсли;
	
	СтрокаБенефициарыОрг = "";
	Для каждого СтрБ из Бенефициары Цикл 
		Если СтрБ.ВидПолученияИнформации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПолученияИнформацииОБенефициарномВладельце.УстановленОрганизацией") ИЛИ 
			СтрБ.ВидПолученияИнформации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПолученияИнформацииОБенефициарномВладельце.ПредоставленКлиентомУстановленОрганизацией") Тогда
			СтрокаБенефициарыОрг = ?(Пустаястрока(СтрокаБенефициарыОрг), "", Символы.ПС) + сокрЛП(СтрБ.Бенефициар);
		КонецЕсли;	   
	Конеццикла;
	ОтстутствуютБенефициарыОрг = СтрШаблон("Иных лиц влияющих на принятие решений клиента не выявлено. Бенефициарным владельцем считается %1", КлиентФИО); 
	СтрокаБенефициарыОрг = ?(ПустаяСтрока(СтрокаБенефициарыОрг), ОтстутствуютБенефициарыОрг, СтрокаБенефициарыОрг); 
	
	СтрокаБенефициарыКл = "";
	Для каждого СтрБ из Бенефициары Цикл  
		Если СтрБ.ВидПолученияИнформации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПолученияИнформацииОБенефициарномВладельце.ПредоставленКлиентом") ИЛИ 
			СтрБ.ВидПолученияИнформации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПолученияИнформацииОБенефициарномВладельце.ПредоставленКлиентомУстановленОрганизацией") Тогда
			СтрокаБенефициарыКл = ?(Пустаястрока(СтрокаБенефициарыКл), "", Символы.ПС) + сокрЛП(СтрБ.Бенефициар);
		КонецЕсли;	   
	Конеццикла;
	ОтсутствуютБенефициарыКл = СтрШаблон("Бенефициарным владельцем является сам клиент %1", КлиентФИО);
	СтрокаБенефициарыКл = ?(ПустаяСтрока(СтрокаБенефициарыКл), ОтсутствуютБенефициарыКл, СтрокаБенефициарыКл);
	
	СведенияЦБСтрока = "";
	Для каждого СтрО Из ТаблицаОтказов Цикл
		Если СтрО.Вид = "ЦБ" Тогда
			СведенияЦБСтрока = СведенияЦБСтрока + ?(Пустаястрока(СведенияЦБСтрока), "", Символы.ПС) + "Дата отказа " + Формат(СтрО.ДатаОтказа, "ДФ=dd.MM.yyyy") + " " + СокрЛП(СтрО.ПричинаОтказа);// + " отв." + СокрЛП(СтрО.Ответственный);
		КонецЕсли;	   
	КонецЦикла;
	СведенияЦБ = ?(Пустаястрока(СведенияЦБСтрока), "Отсутствуют", СокрЛП(СведенияЦБСтрока));
	
	ОтказыСтрока = "";
	Для каждого СтрО Из ТаблицаОтказов Цикл
		Если СтрО.Вид = "Анкета" Тогда
			ОтказыСтрока = ОтказыСтрока + ?(Пустаястрока(ОтказыСтрока), "", Символы.ПС) + "Дата отказа " + Формат(СтрО.ДатаОтказа, "ДФ=dd.MM.yyyy") + " " + СокрЛП(СтрО.ПричинаОтказа) + " отв." + СокрЛП(СтрО.Ответственный);
		КонецЕсли;	   
	КонецЦикла;
	ОтказыСтрока = ?(Пустаястрока(ОтказыСтрока), "Отсутствуют", СокрЛП(ОтказыСтрока));             
	
	ActiveDocument = Word.ActiveDocument;
	ВывестиПараметрНаПечать(ActiveDocument, "Кл",                              ДанныеДляПечати.Клиент);
	ВывестиПараметрНаПечать(ActiveDocument, "ПКл",                             ДанныеДляПечати.ПредставительКлиента);
	ВывестиПараметрНаПечать(ActiveDocument, "Вп",                              ДанныеДляПечати.Выгодоприобретатель);
	ВывестиПараметрНаПечать(ActiveDocument, "Бен",                             ДанныеДляПечати.БенифициарныйВладелец);
	ВывестиПараметрНаПечать(ActiveDocument, "ФИО",                             КлиентФИО);
	ВывестиПараметрНаПечать(ActiveDocument, "ДатаМестоРождения",               Формат(ДатаРождения,"ДЛФ=DD") + ", " + СокрЛП(МестоРождения));
	ВывестиПараметрНаПечать(ActiveDocument, "Гражданство",                     СокрЛП(Гражданство));
	ВывестиПараметрНаПечать(ActiveDocument, "ДУЛ",                             ?(ДанныеДляПечати.ДУЛ = Неопределено, "", ДанныеДляПечати.ДУЛ));
	ВывестиПараметрНаПечать(ActiveDocument, "ДопДокумент",                     ДанныеДляПечати.ДопДокумент);
	ВывестиПараметрНаПечать(ActiveDocument, "АдресРегистрации",                ?(ПустаяСтрока(АдресПоПрописке), "Данные не предоставлены", СокрЛП(АдресПоПрописке)));
	ВывестиПараметрНаПечать(ActiveDocument, "ФактическийАдрес",                ?(ФактическийСовпадает, "Совпадает с адресом места жительства (регистрации)", СокрЛП(ФактическийАдрес)));
	ВывестиПараметрНаПечать(ActiveDocument, "ПочтовыйАдрес",                   ?(ПочтовыйСовпадает, "Совпадает с адресом места жительства (регистрации)",СокрЛП(ПочтовыйАдрес)));
	ВывестиПараметрНаПечать(ActiveDocument, "ИНН",                             ?(ПустаяСтрока(ИНН), "Данные не предоставлены", ИНН));
	ВывестиПараметрНаПечать(ActiveDocument, "СНИЛС",                           ?(ПустаяСтрока(СНИЛС), "Данные не предоставлены", СНИЛС));
	ВывестиПараметрНаПечать(ActiveDocument, "Телефоны",                        Телефоны);
	ВывестиПараметрНаПечать(ActiveDocument, "Контакты",                        ?(ПустаяСтрока(Контакты), "Данные не предоставлены", СокрЛП(Контакты)));
	ВывестиПараметрНаПечать(ActiveDocument, "ИПДЛ",                            ИПДЛСтрокой);
	ВывестиПараметрНаПечать(ActiveDocument, "ДЛПМО_РДПЛ",                      ДЛПМО_РДПЛСтрокой);
	ВывестиПараметрНаПечать(ActiveDocument, "ХарактерОтношений",               СокрЛП(ХарактерОтношений));
	ВывестиПараметрНаПечать(ActiveDocument, "Финансы",                         ?(ФинансовоеПоложениеСтабильное, "Стабильное", "Не стабильное"));
	ВывестиПараметрНаПечать(ActiveDocument, "ДеловаяРепутация",                ?(ДеловаяРепутацияПоложительная, "Положительная", "Негативная"));
	ВывестиПараметрНаПечать(ActiveDocument, "ИсточникиПроисхожденияИмущества", СокрЛП(ИсточникиПроисхождения));              //
	ВывестиПараметрНаПечать(ActiveDocument, "Представитель",                   ?(ТаблицаДоверенностей.Количество() = 0, "Отсутствует", ДанныеДляПечати.ПредставителиСтрока));
	ВывестиПараметрНаПечать(ActiveDocument, "БенефициарыОрганизация",          СтрокаБенефициарыОрг);
	ВывестиПараметрНаПечать(ActiveDocument, "БенефициарыКлиент",               СтрокаБенефициарыКл);
	ВывестиПараметрНаПечать(ActiveDocument, "СведенияЦБ",                      СведенияЦБ);
	ВывестиПараметрНаПечать(ActiveDocument, "Отказы",                          ОтказыСтрока);
	ВывестиПараметрНаПечать(ActiveDocument, "УровеньРиска",                    СокрЛП(УровеньРиска));
	ВывестиПараметрНаПечать(ActiveDocument, "ДатаОформления",                  Формат(ДатаОформленияАнкеты, "ДЛФ=DD"));
	ВывестиПараметрНаПечать(ActiveDocument, "ДатаНачалаОтношений",             СокрЛП(ДатаНачалаРаботыСКлиентом));
	ВывестиПараметрНаПечать(ActiveDocument, "ДатаОкончанияОтношений",          СокрЛП(ДатаОкончанияРаботыСКлиентом));
	ВывестиПараметрНаПечать(ActiveDocument, "ДатыОбновлений",                  ДанныеДляПечати.ДатыОбновлений);
	ВывестиПараметрНаПечать(ActiveDocument, "ОтветственныйАнкета",             ?(ДанныеДляПечати.ОтветсвенныйАнкета = Неопределено, "", СокрЛП(ДанныеДляПечати.ОтветсвенныйАнкета)));
	ВывестиПараметрНаПечать(ActiveDocument, "ОтветственныйОбновление",         ?(ДанныеДляПечати.ОтветсвенныйОбновление = Неопределено, "", СокрЛП(ДанныеДляПечати.ОтветсвенныйОбновление)));
	ВывестиПараметрНаПечать(ActiveDocument, "ПроверкаПоПеречням",              ДанныеДляПечати.ПроверкаПоПеречням);
	ВывестиПараметрНаПечать(ActiveDocument, "СверкаПоПеречням",                ДанныеДляПечати.СверкаПоПеречням);         
	
	//+Мельников 25.04.24 По просьбе КРО, до запуска в ломбардах, убрана блокировка вордовского файла.
	//ВордДокумент.Application.ActiveDocument.Protect(2,Истина,Строка(Этаформа.КлючУникальности),Ложь,Истина);
	//-Мельников
	ВордДокумент.SaveAs(ИмяВременногоФайла);
	ВордДокумент.Close(Истина); 
	
	ЗапуститьПриложение(ИмяВременногоФайла);
	
КонецПроцедуры

&НаСервере 
Функция ПолучитьДанныеДляПечатиАнкеты(МассивВыбора, Гражданство)
	
	ДанныеДляПечати = Новый Структура;
	
	РезультатК = ПолучитьКатегорииФизическогоЛица(МассивВыбора);
	РезультатО = ПолучитьИсториюОбновленийАнкеты();
	Если Гражданство = Справочники.СтраныМира.Россия Тогда 
		ДопДокумент = "Не требуется";
	Иначе	   
		ДопДокумент = ПолучитьДопДокумент();
		ДопДокумент = ?(ДопДокумент = Неопределено, "", ДопДокумент); 
	КонецЕсли;
	
	ДанныеДляПечати.Вставить("Клиент",                 РезультатК.Клиент);
	ДанныеДляПечати.Вставить("ПредставительКлиента",   РезультатК.ПредставительКлиента);
	ДанныеДляПечати.Вставить("Выгодоприобретатель",    РезультатК.Выгодоприобретатель);
	ДанныеДляПечати.Вставить("БенифициарныйВладелец",  РезультатК.БенифициарныйВладелец);               
	ДанныеДляПечати.Вставить("ДопДокумент",            ДопДокумент);
	ДанныеДляПечати.Вставить("ПредставителиСтрока",    ЗаполнитьПредставителей());
	ДанныеДляПечати.Вставить("ДатыОбновлений",         РезультатО.ДатыОбновлений);
	ДанныеДляПечати.Вставить("ОтветсвенныйАнкета",     РезультатО.ОтветсвенныйАнкета);
	ДанныеДляПечати.Вставить("ОтветсвенныйОбновление", РезультатО.ОтветсвенныйОбновление );
	ДанныеДляПечати.Вставить("ПроверкаПоПеречням",     ПолучитьДанныеГлобальныхПроверок());
	ДанныеДляПечати.Вставить("СверкаПоПеречням",       ПолучитьДанныеСверок());
	ДанныеДляПечати.Вставить("ДУЛ",                    ПолучитьДУЛ());
	
	Возврат ДанныеДляПечати; 
	
КонецФункции	

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемСохранитьКарточку", ЭтотОбъект);
		ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПередЗакрытиемСохранитьКарточку(Результат, ДополнительныеПараметры) Экспорт
	
	Если Модифицированность Тогда
		Модифицированность = Ложь;
		//+МАН 05.11.25 Добавил
		ЗакрыватьФормуПриСохранении = Истина;
		//-МАН
		ЗаписатьКарточку();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ПечатьСогласиеНаОпробование_ТабДок()
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб         = Истина;
	ТабДок.ОтображатьСетку     = Ложь;
	ТабДок.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ТабДок.ТолькоПросмотр      = Истина;
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		ТабДок.Защита = Истина;
	КонецЕсли;
	
	ИсходныйМакет = Справочники.ЛБ_ШаблоныМакетов.СогласиеНаОпробование.Наименование;
	Макет = ПолучитьИзмененныйМакет("ЛБ_СогласиеНаОпробование", ИсходныйМакет);
	
	ОбластьМакетаШапка  = Макет.ПолучитьОбласть("Шапка"); 
	ОбластьМакетаТекст  = Макет.ПолучитьОбласть("Текст");
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьМакетаШапка.Параметры.ОрганизацияНаименованиеПолное = НаименованиеОрганизации().НаименованиеПолное;
	
	ТабДок.Вывести(ОбластьМакетаШапка);
	
	ЗаемщикОтчество = ?(ПустаяСтрока(Отчество), "", СтрШаблон(" %1", Отчество));
	ЗаемщикТекстом  = СтрШаблон("%1 %2%3", Фамилия, Имя, ЗаемщикОтчество);
	ОбластьМакетаТекст.Параметры.Заемщик                        = ЗаемщикТекстом;
	ОбластьМакетаТекст.Параметры.ДатаРожденияЗаемщика           = Формат(ДатаРождения, "ДФ=dd.MM.yyyy");
	ОбластьМакетаТекст.Параметры.УдостоверяющийДокументЗаемщика = СокрЛП(ПаспортныеДанныеКлиента(Истина).ПаспортныеДанные);
	ОбластьМакетаТекст.Параметры.АдресРегистрацииЗаемщика       = ?(Не ПустаяСтрока(АдресПоПрописке), АдресПоПрописке, ФактическийАдрес);
	ОбластьМакетаТекст.Параметры.СимволСтепени                  = Символ(185);
	
	ТабДок.Вывести(ОбластьМакетаТекст);
	
	ОбластьМакетаПодвал.Параметры.Дата          = Формат(ТекущаяДатаСеанса(),"ДЛФ=ДД");
	ОбластьМакетаПодвал.Параметры.СимволСтепени = Символ(185);
	
	ТабДок.Вывести(ОбластьМакетаПодвал);
	
	Возврат ТабДок;
	
КонецФункции

&НаСервере
Функция ПечатьЗаявлениеОбИзмененииКонтактныхДанных_ТабДок()
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб         = Истина;
	ТабДок.ОтображатьСетку     = Ложь;
	ТабДок.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ТабДок.ТолькоПросмотр      = Истина;
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		ТабДок.Защита = Истина;
	КонецЕсли;
	
	ИсходныйМакет = Справочники.ЛБ_ШаблоныМакетов.ЗаявлениеОбИзмененииКонтактныхДанных.Наименование;
	Макет = ПолучитьИзмененныйМакет("ЛБ_ЗаявлениеОбИзмененииКонтактныхДанных", ИсходныйМакет);
	
	ОбластьМакетаШапка  = Макет.ПолучитьОбласть("Шапка"); 
	ОбластьМакетаТекст  = Макет.ПолучитьОбласть("Текст");
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьМакетаШапка.Параметры.ОрганизацияНаименованиеПолное = НаименованиеОрганизации().НаименованиеПолное;
	
	ТабДок.Вывести(ОбластьМакетаШапка);
	
	ЗаемщикОтчество = ?(ПустаяСтрока(Отчество), "", СтрШаблон(" %1", Отчество));
	ЗаемщикТекстом  = СтрШаблон("%1 %2%3", Фамилия, Имя, ЗаемщикОтчество);
	ОбластьМакетаТекст.Параметры.Заемщик                        = ЗаемщикТекстом;
	ОбластьМакетаТекст.Параметры.ДатаРожденияЗаемщика           = Формат(ДатаРождения, "ДФ=dd.MM.yyyy");
	ОбластьМакетаТекст.Параметры.УдостоверяющийДокументЗаемщика = СокрЛП(ПаспортныеДанныеКлиента(Истина).ПаспортныеДанные);
	ОбластьМакетаТекст.Параметры.АдресРегистрацииЗаемщика       = ?(Не ПустаяСтрока(АдресПоПрописке), АдресПоПрописке, ФактическийАдрес);
	
	ТабДок.Вывести(ОбластьМакетаТекст);
	
	ОбластьМакетаПодвал.Параметры.Дата          = Формат(ТекущаяДатаСеанса(),"ДЛФ=ДД");
	
	ТабДок.Вывести(ОбластьМакетаПодвал);
	
	Возврат ТабДок;
	
КонецФункции 

&НаСервере
Функция ПечатьШаблонЗаявленияНаВозвратБезналичнойОплаты_ТабДок()
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб         = Истина;
	ТабДок.ОтображатьСетку     = Ложь;
	ТабДок.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ТабДок.ТолькоПросмотр      = Истина;
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		ТабДок.Защита = Истина;
	КонецЕсли;
	
	ИсходныйМакет = Справочники.ЛБ_ШаблоныМакетов.ШаблонЗаявленияНаВозвратБезналичнойОплаты.Наименование;
	Макет = ПолучитьИзмененныйМакет("ЛБ_ШаблонЗаявленияНаВозвратБезналичнойОплаты", ИсходныйМакет);
	
	ОбластьМакетаШапка  = Макет.ПолучитьОбласть("Шапка"); 
	ОбластьМакетаТекст  = Макет.ПолучитьОбласть("Текст");
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьМакетаШапка.Параметры.ОрганизацияНаименованиеСокращенное = НаименованиеОрганизации().НаименованиеСокращенное;
	
	ТабДок.Вывести(ОбластьМакетаШапка);
	ТабДок.Вывести(ОбластьМакетаТекст);
	ТабДок.Вывести(ОбластьМакетаПодвал);
	
	Возврат ТабДок;
	
КонецФункции	

&НаСервере
Функция ПечатьЗаявлениеНаВозвратБезналичнойОплаты_ТабДок()
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб         = Истина;
	ТабДок.ОтображатьСетку     = Ложь;
	ТабДок.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ТабДок.ТолькоПросмотр      = Истина; 
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		ТабДок.Защита = Истина;
	КонецЕсли;
	
	ИсходныйМакет = Справочники.ЛБ_ШаблоныМакетов.ЗаявлениеНаВозвратБезналичнойОплаты.Наименование;
	Макет = ПолучитьИзмененныйМакет("ЛБ_ЗаявлениеНаВозвратБезналичнойОплаты", ИсходныйМакет);
	
	ОбластьМакетаШапка  = Макет.ПолучитьОбласть("Шапка"); 
	ОбластьМакетаТекст  = Макет.ПолучитьОбласть("Текст");                                          
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ЗаемщикОтчество = ?(ПустаяСтрока(Отчество), "", СтрШаблон(" %1", Отчество));
	ЗаемщикТекстом  = СтрШаблон("%1 %2%3", Фамилия, Имя, ЗаемщикОтчество);
	
	ОбластьМакетаШапка.Параметры.Директор = ПолучитьСклоненияСтроки(ФИОДиректора(), , "ПД=Дательный")[0]; 
	ОбластьМакетаШапка.Параметры.Заемщик  = ПолучитьСклоненияСтроки(ЗаемщикТекстом, , "ПД=Родительный")[0];
	ОбластьМакетаШапка.Параметры.Телефон  = ?(ПустаяСтрока(Телефон), "", Телефон);
	ОбластьМакетаШапка.Параметры.ОрганизацияНаименованиеСокращенное = НаименованиеОрганизации().НаименованиеСокращенное;
	
	ТабДок.Вывести(ОбластьМакетаШапка);
	
	УдостоверяющийДокументЗаемщика =СокрЛП(ПаспортныеДанныеКлиента(Истина).ПаспортныеДанные); 
	
	ОбластьМакетаТекст.Параметры.Заемщик                        = ЗаемщикТекстом;
	ОбластьМакетаТекст.Параметры.ДатаРожденияЗаемщика           = Формат(ДатаРождения, "ДФ=dd.MM.yyyy");
	ОбластьМакетаТекст.Параметры.УдостоверяющийДокументЗаемщика = УдостоверяющийДокументЗаемщика;
	ОбластьМакетаТекст.Параметры.АдресРегистрацииЗаемщика       = ?(Не ПустаяСтрока(АдресПоПрописке), АдресПоПрописке, ФактическийАдрес);
	
	ТабДок.Вывести(ОбластьМакетаТекст);
	
	ОбластьМакетаПодвал.Параметры.Дата = Формат(ТекущаяДатаСеанса(),"ДЛФ=ДД");
	
	ТабДок.Вывести(ОбластьМакетаПодвал);
	
	Возврат ТабДок;
	
КонецФункции	

&НаСервере
Функция ПечатьЗаявлениеОПредоставленииСведенийОНаличииОбязательствИмущественногоХарактера_ТабДок()
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб         = Истина;
	ТабДок.ОтображатьСетку     = Ложь;
	ТабДок.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ТабДок.ТолькоПросмотр      = Истина; 
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		ТабДок.Защита = Истина;
	КонецЕсли;
	
	ИсходныйМакет = Справочники.ЛБ_ШаблоныМакетов.ЗаявлениеОПредоставленииСведенийОНаличииОбязательствИмущХарактера.Наименование;
	Макет = ПолучитьИзмененныйМакет("ЛБ_ЗаявлениеОПредоставленииСведенийОНаличииОбязательствИмущХарактера", ИсходныйМакет);
	
	ОбластьМакетаШапка  = Макет.ПолучитьОбласть("Шапка"); 
	ОбластьМакетаТекст  = Макет.ПолучитьОбласть("Текст");         
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ЗаемщикОтчество = ?(ПустаяСтрока(Отчество), "", СтрШаблон(" %1", Отчество));
	ЗаемщикТекстом  = СтрШаблон("%1 %2%3", Фамилия, Имя, ЗаемщикОтчество);
	ОбластьМакетаШапка.Параметры.Заемщик                            = ПолучитьСклоненияСтроки(ЗаемщикТекстом, , "ПД=Родительный")[0];
	ОбластьМакетаШапка.Параметры.ДатаРожденияЗаемщика               = Формат(ДатаРождения, "ДФ=dd.MM.yyyy");
	ОбластьМакетаШапка.Параметры.УдостоверяющийДокументЗаемщика     = СокрЛП(ПаспортныеДанныеКлиента().ПаспортныеДанные);
	ОбластьМакетаШапка.Параметры.АдресРегистрацииЗаемщика           = ?(Не ПустаяСтрока(АдресПоПрописке), АдресПоПрописке, ФактическийАдрес);
	ОбластьМакетаШапка.Параметры.Телефон                            = ?(ПустаяСтрока(Телефон), "", Телефон);
	ОбластьМакетаШапка.Параметры.ОрганизацияНаименованиеСокращенное = НаименованиеОрганизации().НаименованиеСокращенное;
	
	ТабДок.Вывести(ОбластьМакетаШапка);
	
	ТабДок.Вывести(ОбластьМакетаТекст);
	
	ОбластьМакетаПодвал.Параметры.НаименованиеЛомбардаИНомерОтделения = "";    
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	Если НЕ ТекПользователь.ЭтоЛомбард Тогда
		Сотрудник = ТекПользователь.Сотрудник;
	Иначе
		Сотрудник = ПараметрыСеанса.ТекущийСотрудник;
	КонецЕсли;	
	ОбластьМакетаПодвал.Параметры.Работник                            = Сотрудник;
	ОбластьМакетаПодвал.Параметры.Дата                                = Формат(ТекущаяДатаСеанса(),"ДЛФ=ДД");
	
	ТабДок.Вывести(ОбластьМакетаПодвал);
	
	Возврат ТабДок;
	
КонецФункции

&НаСервере
Функция ПечатьАктОПолученииИзделийНаследниками_ТабДок()  
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб         = Истина;
	ТабДок.ОтображатьСетку     = Ложь;
	ТабДок.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ТабДок.ТолькоПросмотр      = Истина; 
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		ТабДок.Защита = Истина;
	КонецЕсли;
	
	ИсходныйМакет = Справочники.ЛБ_ШаблоныМакетов.АктОПолученииИзделийНаследниками.Наименование;
	Макет = ПолучитьИзмененныйМакет("ЛБ_АктОПолученииИзделийНаследниками", ИсходныйМакет);
	
	ОбластьМакетаШапка  = Макет.ПолучитьОбласть("Шапка"); 
	ОбластьМакетаТекст  = Макет.ПолучитьОбласть("Текст");
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьМакетаШапка.Параметры.АдресЛомбарда                      = "";
	ОбластьМакетаШапка.Параметры.Дата                               = Формат(ТекущаяДатаСеанса(),"ДЛФ=ДД"); 
	ОбластьМакетаШапка.Параметры.ОрганизацияНаименованиеСокращенное = НаименованиеОрганизации().НаименованиеСокращенное;
	
	ТабДок.Вывести(ОбластьМакетаШапка);
	
	ЗаемщикОтчество = ?(ПустаяСтрока(Отчество), "", СтрШаблон(" %1", Отчество));
	ЗаемщикТекстом  = СтрШаблон("%1 %2%3", Фамилия, Имя, ЗаемщикОтчество);
	ОбластьМакетаТекст.Параметры.Заемщик                        = ПолучитьСклоненияСтроки(ЗаемщикТекстом, , "ПД=Родительный")[0];
	ОбластьМакетаТекст.Параметры.УдостоверяющийДокументЗаемщика = СокрЛП(ПаспортныеДанныеКлиента(Истина).ПаспортныеДанные);
	
	ТабДок.Вывести(ОбластьМакетаТекст);
	
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	Если НЕ ТекПользователь.ЭтоЛомбард Тогда
		Сотрудник = ТекПользователь.Сотрудник;
	Иначе
		Сотрудник = ПараметрыСеанса.ТекущийСотрудник;
	КонецЕсли;	
	ОбластьМакетаПодвал.Параметры.Сотрудник = Сотрудник; 
	
	ТабДок.Вывести(ОбластьМакетаПодвал);
	
	Возврат ТабДок;
	
КонецФункции	

&НаСервере
Функция ПечатьЗаявлениеВСвободнойФорме_ТабДок()
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб         = Истина;
	ТабДок.ОтображатьСетку     = Ложь;
	ТабДок.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ТабДок.ТолькоПросмотр      = Истина; 
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		ТабДок.Защита = Истина;
	КонецЕсли;
	
	ИсходныйМакет = Справочники.ЛБ_ШаблоныМакетов.ЗаявлениеВСвободнойФорме.Наименование;
	Макет = ПолучитьИзмененныйМакет("ЛБ_ЗаявлениеВСвободнойФорме", ИсходныйМакет);
	
	ОбластьМакетаШапка  = Макет.ПолучитьОбласть("Шапка"); 
	ОбластьМакетаТекст  = Макет.ПолучитьОбласть("Текст");
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал"); 
	
	ЗаемщикОтчество = ?(ПустаяСтрока(Отчество), "", СтрШаблон(" %1", Отчество));
	ЗаемщикТекстом  = СтрШаблон("%1 %2%3", Фамилия, Имя, ЗаемщикОтчество);
	
	ОбластьМакетаШапка.Параметры.Директор                           = ПолучитьСклоненияСтроки(ФИОДиректора(), , "ПД=Дательный")[0]; 
	ОбластьМакетаШапка.Параметры.Заемщик                            = ПолучитьСклоненияСтроки(ЗаемщикТекстом, , "ПД=Родительный")[0];
	ОбластьМакетаШапка.Параметры.ДатаРожденияЗаемщика               = Формат(ДатаРождения, "ДФ=dd.MM.yyyy");
	ОбластьМакетаШапка.Параметры.УдостоверяющийДокументЗаемщика     = СокрЛП(ПаспортныеДанныеКлиента().ПаспортныеДанные);
	ОбластьМакетаШапка.Параметры.АдресРегистрацииЗаемщика           = ?(Не ПустаяСтрока(АдресПоПрописке), АдресПоПрописке, ФактическийАдрес);
	ОбластьМакетаШапка.Параметры.Телефон                            = ?(ПустаяСтрока(Телефон), "", Телефон);
	ОбластьМакетаШапка.Параметры.ОрганизацияНаименованиеСокращенное = НаименованиеОрганизации().НаименованиеСокращенное;
	
	ТабДок.Вывести(ОбластьМакетаШапка);
	ТабДок.Вывести(ОбластьМакетаТекст);
	ТабДок.Вывести(ОбластьМакетаПодвал);
	
	Возврат ТабДок;
	
КонецФункции	

&НаСервере
Функция ПечатьРаспоряжениеОбОтказеНедействительныйПаспорт_ТабДок()
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб         = Истина;
	ТабДок.ОтображатьСетку     = Ложь;
	ТабДок.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ТабДок.ТолькоПросмотр      = Истина; 
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		ТабДок.Защита = Истина;
	КонецЕсли;
	
	ИсходныйМакет = Справочники.ЛБ_ШаблоныМакетов.РаспоряжениеОбОтказе_НедействительныйПаспорт.Наименование;
	Макет = ПолучитьИзмененныйМакет("ЛБ_РаспоряжениеОбОтказе_НедействительныйПаспорт", ИсходныйМакет);
	
	ОбластьМакетаШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакетаТекст  = Макет.ПолучитьОбласть("Текст");
	
	ТабДок.Вывести(ОбластьМакетаШапка); 
	
	ОбластьМакетаТекст.Параметры.ОрганизацияНаименованиеСокращенное = НаименованиеОрганизации().НаименованиеСокращенное;
	
	ТабДок.Вывести(ОбластьМакетаТекст);
	
	Возврат ТабДок;
	
КонецФункции	

&НаСервере
Функция ПолучитьИзмененныйМакет(ИмяМакета, ИсходныйМакет = "")
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛБ_МакетыПечатныхФормСрезПоследних.Макет КАК Макет
	|ИЗ
	|	РегистрСведений.ЛБ_МакетыПечатныхФорм.СрезПоследних(&Период, ИсходныйМакет = &ИсходныйМакет) КАК ЛБ_МакетыПечатныхФормСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛБ_МакетыПечатныхФормСрезПоследних.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Период", ТекущаяУниверсальнаяДата());
	Запрос.УстановитьПараметр("ИсходныйМакет", ИсходныйМакет);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Макет = Выборка.Макет.Получить();
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПользовательскиеМакетыПечати.Макет КАК Макет,
		|	ПользовательскиеМакетыПечати.Использование КАК Использование
		|ИЗ
		|	РегистрСведений.ПользовательскиеМакетыПечати КАК ПользовательскиеМакетыПечати
		|ГДЕ
		|	ПользовательскиеМакетыПечати.ИмяМакета = &ИмяМакета";
		
		Запрос.УстановитьПараметр("ИмяМакета", ИмяМакета);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			Если Выборка.Использование Тогда
				Макет = Выборка.Макет.Получить();
			Иначе	
				Макет = ПолучитьОбщийМакет(ИмяМакета);
			КонецЕсли;
		Иначе
			Макет = ПолучитьОбщийМакет(ИмяМакета);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Макет;
	
КонецФункции 

&НаКлиенте
Процедура КнопкаПечать(Команда)
	УстановитьСписокПечатныхФорм();
КонецПроцедуры

&НаСервере
Процедура УстановитьСписокПечатныхФорм()
	
	СписокПечатныхФорм = ПланыВидовХарактеристик.ЛБ_НастройкиЛомбард.ПолучитьЗначениеНастройки(ПланыВидовХарактеристик.ЛБ_НастройкиЛомбард.СписокПечатныхФормКарточкиКлиента);
	
	ПечатныеФормы = Элементы.ФормаГруппаПечать.ПодчиненныеЭлементы;
	
	ПечатныеФормы.ФормаСогласиеНаОпробование.Видимость                     = ?(СписокПечатныхФорм.Найти(Перечисления.ЛБ_ПечатныеФормыКарточкиКлиента.СогласиеНаОпробование)                     = Неопределено, Ложь, Истина);
	ПечатныеФормы.ФормаЗаявлениеОбИзмененииКонтактныхДанных.Видимость      = ?(СписокПечатныхФорм.Найти(Перечисления.ЛБ_ПечатныеФормыКарточкиКлиента.ЗаявлениеОбИзмененииКонтактныхДанных)      = Неопределено, Ложь, Истина);
	ПечатныеФормы.ФормаЗаявлениеНаВозвратБезналичнойОплаты.Видимость       = ?(СписокПечатныхФорм.Найти(Перечисления.ЛБ_ПечатныеФормыКарточкиКлиента.ЗаявлениеНаВозвратБезналичнойОплаты)       = Неопределено, Ложь, Истина);
	ПечатныеФормы.ФормаШаблонЗаявленияНаВозвратБезналичнойОплаты.Видимость = ?(СписокПечатныхФорм.Найти(Перечисления.ЛБ_ПечатныеФормыКарточкиКлиента.ШаблонЗаявленияНаВозвратБезналичнойОплаты) = Неопределено, Ложь, Истина);
	ПечатныеФормы.ФормаЗаявлениеОПредоставленииСведенийОНаличииОбязательствИмущественногоХарактера.Видимость = ?(СписокПечатныхФорм.Найти(Перечисления.ЛБ_ПечатныеФормыКарточкиКлиента.ЗаявлениеОПредоставленииСведенийОНаличииОбязательствИмущественногоХарактера) = Неопределено, Ложь, Истина);
	ПечатныеФормы.ФормаАктОПолученииИзделийНаследниками.Видимость            = ?(СписокПечатныхФорм.Найти(Перечисления.ЛБ_ПечатныеФормыКарточкиКлиента.АктОПолученииИзделийНаследниками)            = Неопределено, Ложь, Истина);
	ПечатныеФормы.ФормаЗаявлениеВСвободнойФорме.Видимость                    = ?(СписокПечатныхФорм.Найти(Перечисления.ЛБ_ПечатныеФормыКарточкиКлиента.ЗаявлениеВСвободнойФорме)                    = Неопределено, Ложь, Истина);
	ПечатныеФормы.ФормаРаспоряжениеОбОтказеНедействительныйПаспорт.Видимость = ?(СписокПечатныхФорм.Найти(Перечисления.ЛБ_ПечатныеФормыКарточкиКлиента.РаспоряжениеОбОтказеНедействительныйПаспорт) = Неопределено, Ложь, Истина);
	ПечатныеФормы.ФормаКнопкаПечатьАнкеты.Видимость       = ?(СписокПечатныхФорм.Найти(Перечисления.ЛБ_ПечатныеФормыКарточкиКлиента.ПечатьАнкеты)       = Неопределено, Ложь, Истина);
	ПечатныеФормы.ФормаКнопкаПечатьАнкетыНаДату.Видимость = ?(СписокПечатныхФорм.Найти(Перечисления.ЛБ_ПечатныеФормыКарточкиКлиента.ПечатьАнкетыНаДату) = Неопределено, Ложь, Истина);
	
КонецПроцедуры	

&НаСервере
Функция НаименованиеОрганизации()
	
	Результат = Новый Структура("НаименованиеПолное, НаименованиеСокращенное", "", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛБ_ОсновнаяОрганизация.Значение.НаименованиеПолное КАК НаименованиеПолное,
	|	ЛБ_ОсновнаяОрганизация.Значение.НаименованиеСокращенное КАК НаименованиеСокращенное
	|ИЗ
	|	Константа.ЛБ_ОсновнаяОрганизация КАК ЛБ_ОсновнаяОрганизация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ЛБ_ОсновнаяОрганизация.Значение = Организации.Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат.НаименованиеПолное      = Выборка.НаименованиеПолное;
		Результат.НаименованиеСокращенное = Выборка.НаименованиеСокращенное;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
// -- Сербаев 15.05.2023

&НаКлиенте
Процедура ПолПриИзменении(Элемент)
	ПроверитьСтатусПочетный();
КонецПроцедуры

&НаКлиенте
Процедура ТелефонНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидКонтактнойИнформации", ПолучитьВКИТелефон());
	ПараметрыФормы.Вставить("Значение", ТелефонСтруктура);
	ПараметрыФормы.Вставить("Представление", Телефон);
	ПараметрыФормы.Вставить("ОткрытаПоСценарию", Истина);
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораТелефона",ЭтаФорма);
	ОткрытьФорму("Обработка.ВводКонтактнойИнформации.Форма", ПараметрыФормы, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ФактическийАдресНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)  
	СтандартнаяОбработка = ложь;  
	Если ФактическийСовпадает Тогда
		Возврат;
	КонецЕсли;	
	Если ЭтаФорма.ФактическийАдресВручную Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("АдресСтруктура", ФактическийАдресСтруктура);
		// ++ Сербаев 31.05.2023
		Если ПустаяСтрока(ФактическийАдрес) И ПустаяСтрока(ФактическийАдресСтруктура) Тогда
			ПараметрыФормы.Вставить("Гражданство", Гражданство);
		КонецЕсли;
		Если Не ПустаяСтрока(ФактическийАдрес) И ПустаяСтрока(ФактическийАдресСтруктура) Тогда
			ПараметрыФормы.Вставить("АдресВРучнуюСтрока", ФактическийАдрес);
		КонецЕсли;
		// -- Сербаев 31.05.2023
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораФактическогоАдреса",ЭтаФорма);
		ОткрытьФорму("ОбщаяФорма.ЛБ_РучнойВводАдреса", ПараметрыФормы, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе	
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВидКонтактнойИнформации", ПолучитьВКИ(1));
		ПараметрыФормы.Вставить("Значение", ФактическийАдресСтруктура);
		ПараметрыФормы.Вставить("Представление", ФактическийАдрес);
		ПараметрыФормы.Вставить("ОткрытаПоСценарию", истина);
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораФактическогоАдреса",ЭтаФорма);
		ОткрытьФорму("Обработка.РасширенныйВводКонтактнойИнформации.Форма.ВводАдреса", ПараметрыФормы, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПочтовыйАдресНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка) 
	СтандартнаяОбработка = ложь; 
	Если ПочтовыйСовпадает Тогда 
		Возврат
	КонецЕсли;	
	Если ЭтаФорма.ПочтовыйАдресВручную Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("АдресСтруктура", ПочтовыйАдресСтруктура);
		// ++ Сербаев 31.05.2023
		Если ПустаяСтрока(ПочтовыйАдрес) И ПустаяСтрока(ПочтовыйАдресСтруктура) Тогда
			ПараметрыФормы.Вставить("Гражданство", Гражданство);
		КонецЕсли;
		Если Не ПустаяСтрока(ПочтовыйАдрес) И ПустаяСтрока(ПочтовыйАдресСтруктура) Тогда
			ПараметрыФормы.Вставить("АдресВРучнуюСтрока", ПочтовыйАдрес);
		КонецЕсли;
		// -- Сербаев 31.05.2023
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораПочтовогоАдреса",ЭтаФорма);
		ОткрытьФорму("ОбщаяФорма.ЛБ_РучнойВводАдреса", ПараметрыФормы, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВидКонтактнойИнформации", ПолучитьВКИ(2));
		ПараметрыФормы.Вставить("Значение", ПочтовыйАдресСтруктура);
		ПараметрыФормы.Вставить("Представление", ПочтовыйАдрес);
		ПараметрыФормы.Вставить("ОткрытаПоСценарию", истина);
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораПочтовогоАдреса",ЭтаФорма);
		ОткрытьФорму("Обработка.РасширенныйВводКонтактнойИнформации.Форма.ВводАдреса", ПараметрыФормы, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФактическийСовпадаетПриИзменении(Элемент)
	Если ФактическийСовпадает Тогда
		ФактическийАдрес = АдресПоПрописке;
		ФактическийАдресСтруктура = АдресПоПропискеСтруктура;
		ФактическийАдресВручную = АдресПоПропискеВручную;
	КонецЕсли;	
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПочтовыйСовпадаетПриИзменении(Элемент)
	Если ПочтовыйСовпадает Тогда
		ПочтовыйАдрес = АдресПоПрописке;
		ПочтовыйАдресСтруктура = АдресПоПропискеСтруктура;
		ПочтовыйАдресВручную = АдресПоПропискеВручную;
	КонецЕсли;	
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура АдресПоПропискеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если ЭтаФорма.АдресПоПропискеВручную Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("АдресСтруктура", АдресПоПропискеСтруктура);
		// ++ Сербаев 31.05.2023
		Если ПустаяСтрока(АдресПоПрописке) И ПустаяСтрока(АдресПоПропискеСтруктура) Тогда
			ПараметрыФормы.Вставить("Гражданство", Гражданство);
		КонецЕсли;
		Если Не ПустаяСтрока(АдресПоПрописке) И ПустаяСтрока(АдресПоПропискеСтруктура) Тогда
			ПараметрыФормы.Вставить("АдресВРучнуюСтрока", АдресПоПрописке);
		КонецЕсли;
		// -- Сербаев 31.05.2023
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораАдресаПоПрописке",ЭтаФорма);
		ОткрытьФорму("ОбщаяФорма.ЛБ_РучнойВводАдреса", ПараметрыФормы, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе	
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВидКонтактнойИнформации", ПолучитьВКИ());
		ПараметрыФормы.Вставить("Значение", АдресПоПропискеСтруктура);
		ПараметрыФормы.Вставить("Представление", АдресПоПрописке);
		ПараметрыФормы.Вставить("ОткрытаПоСценарию", истина);
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораАдресаПоПрописке",ЭтаФорма);
		ОткрытьФорму("Обработка.РасширенныйВводКонтактнойИнформации.Форма.ВводАдреса", ПараметрыФормы, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораМестаРождения(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МестоРожденияСтрана = Результат.МестоРожденияСтрана;
	МестоРожденияОбласть = Результат.МестоРожденияОбласть;
	МестоРожденияРайон = Результат.МестоРожденияРайон;
	МестоРожденияНаселенныйПункт = Результат.МестоРожденияНаселенныйПункт;
	МестоРождения = Результат.МестоРождения;
	
КонецПроцедуры

&НаКлиенте
Процедура МестоРожденияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораМестаРождения",ЭтаФорма);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("МестоРожденияСтрана", МестоРожденияСтрана);
	ПараметрыФормы.Вставить("МестоРожденияОбласть", МестоРожденияОбласть);
	ПараметрыФормы.Вставить("МестоРожденияРайон", МестоРожденияРайон);
	ПараметрыФормы.Вставить("МестоРожденияНаселенныйПункт", МестоРожденияНаселенныйПункт);
	ПараметрыФормы.Вставить("МестоРождения", МестоРождения);
	ОткрытьФорму("Обработка.ЛБ_ПомощникВводаМестаРождения.Форма.Форма", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНовыйДокумент(Команда)
	Если НЕ ЗначениеЗаполнено(Гражданство) Тогда
		// ++ Сербаев 11.05.2023
		//Сообщить("Не выбрано гражданство клиента!");
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбрано гражданство клиента!'"), , ,"Гражданство");
		// -- Сербаев 11.05.2023
	Иначе	
		Оповещение = Новый ОписаниеОповещения("ПослеДобавленияДокумента", ЭтотОбъект);	
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Залогодатель", Залогодатель);
		ПараметрыФормы.Вставить("Гражданство", Гражданство);
		ПараметрыФормы.Вставить("ДатаРождения", ДатаРождения);
		ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаИзмененияДокументаЗалогодателя", ПараметрыФормы, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Функция ПолучитьКлючСтроки()
	
	ТаблицаКлючей = ДокументыЗалогодателя.Выгрузить(, "КлючСтроки");
	Если ТаблицаКлючей.Количество() = 1 Тогда
		Возврат 1;
	Иначе	
		ТаблицаКлючей.Сортировать("КлючСтроки Убыв");
		
		Возврат ТаблицаКлючей[0].КлючСтроки + 1;
	КонецЕсли;	
	
КонецФункции

&НаСервере
Функция ПроверитьЕстьСвидетельствоОСмерти()
	Отбор = Новый Структура;
	Отбор.Вставить("ВидДокумента", Справочники.ВидыДокументовФизическихЛиц.СвидетельствоОСмерти); 
	Отбор.Вставить("ДокументНеДействителен", Ложь);
	СтрокиДок = ДокументыЗалогодателя.НайтиСтроки(Отбор); 
	Если НЕ СтрокиДок.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;	
	Возврат Ложь;
КонецФункции	

&НаКлиенте
Процедура ПослеДобавленияДокумента(Результат, Параметры) Экспорт
	Если НЕ Результат = Неопределено Тогда 
		Если Результат.ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыДокументовФизическихЛиц.СвидетельствоОСмерти") Тогда
			Если ПроверитьЕстьСвидетельствоОСмерти() Тогда 
				Сообщить("Свидетельство о смерти клиента уже есть!", СтатусСообщения.Внимание);
				Возврат;    
			КонецЕсли;	
		КонецЕсли;		
		
		НоваяСтр = ДокументыЗалогодателя.Добавить();
		НоваяСтр.КлючСтроки = ПолучитьКлючСтроки();
		НоваяСтр.ВидДокументаЗалогодателя = Результат.ВидДокументаЗалогодателя; 
		НоваяСтр.ДокументНеДействителен = Результат.НеДействителен;
		НоваяСтр.ДокументДействителен = Результат.Действителен;
		НоваяСтр.ВидДокумента = Результат.ВидДокумента;
		НоваяСтр.Гражданство = Результат.Гражданство;
		// ++ Сербаев 25.05.2023 TODO: Сербаев
		НоваяСтр.ДокументСтранаЭмитент = Результат.СтранаЭмитент;
		// -- Сербаев 25.05.2023
		// ++ Сербаев 14.06.2023 (иной документ)
		НоваяСтр.ДокументНаименованиеИногоДокумента = Результат.НаименованиеИногоДокумента;
		// -- Сербаев 14.06.2023
		НоваяСтр.ДокументДатаВыдачи = Результат.ДатаВыдачи;
		НоваяСтр.ДокументКемВыдан = Результат.КемВыдан;
		НоваяСтр.ДокументКодПодразделения = Результат.КодПодразделения;
		НоваяСтр.ДокументСерия = Результат.Серия;
		НоваяСтр.ДокументНомер = Результат.Номер;
		НоваяСтр.ДокументСрокДействия = Результат.СрокДействия;
		НоваяСтр.ПричинаИзменения = ПредопределенноеЗначение("Справочник.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.НовыйДокумент");

		//+МАН 04.12.25
		НоваяСтр.ДокументНачалоДействия = Результат.НачалоДействия;
		//-МАН
		
		Если НоваяСтр.ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыДокументовФизическихЛиц.СвидетельствоОСмерти") Тогда
			НоваяСтр.ДатаСмерти = Результат.ДатаСмерти;
			ДатаСмерти = Результат.ДатаСмерти; 
			Элементы.ДекорацияИнформацияОСмерти.Заголовок = "Клиент умер. Дата смерти " + Формат(ДатаСмерти, "ДФ=dd.MM.yyyy"); 
			Элементы.ГруппаСтатус.Видимость = Истина;
		КонецЕсли;		   
		НоваяСтр.ДокументИзменен = Истина;
		
		//проверим недействительность свидетельства о рождении если есть паспорт
		//Если Результат.ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ") Тогда
		// 	ОтборД = Новый структура;
		// 	ОтборД.Вставить("ВидДокумента", ПредопределенноеЗначение("Справочник.ВидыДокументовФизическихЛиц.СвидетельствоОРождении"));
		// 	ОтборД.Вставить("ДокументНеДействителен", Ложь);
		// 	СтрокиД = ДокументыЗалогодателя.НайтиСтроки(ОтборД);
		// 	Для каждого СтрД Из СтрокиД цикл
		// 		СтрД.ДокументНеДействителен = Истина;
		// 	Конеццикла;	
		// КонецЕсли;
		ДокументыЗалогодателя.Сортировать("Основной УБЫВ, ДокументНачалоДействия УБЫВ, ВидДокументаЗалогодателя");
		
		// ++ Сербаев 16.05.2023
		ПоказатьРезиденство();
		// -- Сербаев 16.05.2023
		ПроверитьСтатусПочетный();
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ТелефонДополнительныйНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидКонтактнойИнформации", ПолучитьВКИТелефон());
	ПараметрыФормы.Вставить("Значение", ТелефонДополнительныйСтруктура);
	ПараметрыФормы.Вставить("Представление", ТелефонДополнительный);
	ПараметрыФормы.Вставить("ОткрытаПоСценарию", истина);
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораТелефонаДоп",ЭтаФорма);
	ОткрытьФорму("Обработка.ВводКонтактнойИнформации.Форма", ПараметрыФормы, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ТелефонКонтактногоЛицаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидКонтактнойИнформации", ПолучитьВКИТелефон());
	ПараметрыФормы.Вставить("Значение", ТелефонКонтактногоЛицаСтруктура);
	ПараметрыФормы.Вставить("Представление", ТелефонКонтактногоЛица);
	ПараметрыФормы.Вставить("ОткрытаПоСценарию", Истина);
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораТелефонаКЛ",ЭтаФорма);
	ОткрытьФорму("Обработка.ВводКонтактнойИнформации.Форма", ПараметрыФормы, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекСтрока = Элементы.Документы.ТекущиеДанные;
	// ++ Сербаев 26.05.2023  при выборе документа всегда подставляется исправление данных
	//ТекСтрока.ПричинаИзменения = ПредопределенноеЗначение("Справочник.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.ИсправлениеДанныхДокумент");
	// -- Сербаев 26.05.2023
	ПараметрыФормы = Новый Структура;
	//+МАН 04.12.25 Изменил
	//Было: ПараметрыФормы.Вставить("ТолькоПросмотр", Элементы.Документы.ТолькоПросмотр);
	ПараметрыФормы.Вставить("ТолькоПросмотр", НЕ Элементы.ФормаКнопкаЗаписать.Доступность);
	//-МАН
	ПараметрыФормы.Вставить("Залогодатель", Залогодатель);
	ПараметрыФормы.Вставить("ДатаРождения", ДатаРождения);
	ПараметрыФормы.Вставить("КлючСтроки", ТекСтрока.КлючСтроки);
	ПараметрыФормы.Вставить("ВидДокументаЗалогодателя", ТекСтрока.ВидДокументаЗалогодателя);
	ПараметрыФормы.Вставить("ВидДокумента", ТекСтрока.ВидДокумента);
	ПараметрыФормы.Вставить("Гражданство", ТекСтрока.Гражданство);
	ПараметрыФормы.Вставить("Серия", ТекСтрока.ДокументСерия);
	ПараметрыФормы.Вставить("Номер", ТекСтрока.ДокументНомер);
	ПараметрыФормы.Вставить("ДатаВыдачи", ТекСтрока.ДокументДатаВыдачи);
	ПараметрыФормы.Вставить("КемВыдан", ТекСтрока.ДокументКемВыдан);
	ПараметрыФормы.Вставить("КодПодразделения", ТекСтрока.ДокументКодПодразделения);
	ПараметрыФормы.Вставить("НачалоДействия", ТекСтрока.ДокументНачалоДействия);
	ПараметрыФормы.Вставить("СрокДействия", ТекСтрока.ДокументСрокДействия);
	ПараметрыФормы.Вставить("НеДействителен", ТекСтрока.ДокументНеДействителен); 
	ПараметрыФормы.Вставить("Действителен", ТекСтрока.ДокументДействителен);
	ПараметрыФормы.Вставить("ДатаСмерти", ТекСтрока.ДатаСмерти);  
	ПараметрыФормы.Вставить("ДокументЗалогодателя", ТекСтрока.ДокументСсылка);  
	
	Если ТекСтрока.ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыДокументовФизическихЛиц.СвидетельствоОСмерти") Тогда
		ДатаСмерти = ТекСтрока.ДатаСмерти; 
		Элементы.ДекорацияИнформацияОСмерти.Заголовок = "Клиент умер. Дата смерти " + Формат(ДатаСмерти, "ДФ=dd.MM.yyyy"); 
		Элементы.ГруппаСтатус.Видимость = Истина;
	КонецЕсли;		   
	
	
	// ++ Сербаев 24.05.2023 TODO: Сербаев
	ПараметрыФормы.Вставить("СтранаЭмитент", ТекСтрока.ДокументСтранаЭмитент);
	// -- Сербаев 24.05.2023
	// ++ Сербаев 14.06.2023 (иной документ)
	ПараметрыФормы.Вставить("НаименованиеИногоДокумента", ТекСтрока.ДокументНаименованиеИногоДокумента);
	// -- Сербаев 14.06.2023
	
	Оповещение = Новый ОписаниеОповещения("ПослеИзмененияДокумента", ЭтотОбъект);
	
	ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаИзмененияДокументаЗалогодателя", ПараметрыФормы, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзмененияДокумента(Результат, Параметры) Экспорт
	Если НЕ Результат = неопределено Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки", Результат.КлючСтроки);
		Строки = ДокументыЗалогодателя.НайтиСтроки(Отбор);
		Если НЕ Строки.Количество() = 0 Тогда
			НоваяСтр = Строки.Получить(0);
			ЕстьИзменения = ложь;
			Если НЕ НоваяСтр.Гражданство = Результат.Гражданство Тогда
				НоваяСтр.Гражданство = Результат.Гражданство;
				ЕстьИзменения = Истина;
			КонецЕсли;
			// ++ Сербаев 25.05.2023 TODO: Сербаев
			Если НЕ НоваяСтр.ДокументСтранаЭмитент = Результат.СтранаЭмитент Тогда
				НоваяСтр.ДокументСтранаЭмитент = Результат.СтранаЭмитент;
				ЕстьИзменения = Истина;
			КонецЕсли;
			// -- Сербаев 25.05.2023 
			// ++ Сербаев 14.06.2023 (иной документ)
			Если НЕ НоваяСтр.ДокументНаименованиеИногоДокумента = Результат.НаименованиеИногоДокумента Тогда
				НоваяСтр.ДокументНаименованиеИногоДокумента = Результат.НаименованиеИногоДокумента;
				ЕстьИзменения = Истина;
			КонецЕсли;
			// -- Сербаев 14.06.2023
			Если НЕ НоваяСтр.ДокументДатаВыдачи = Результат.ДатаВыдачи Тогда
				НоваяСтр.ДокументДатаВыдачи = Результат.ДатаВыдачи;
				ЕстьИзменения = Истина;
			КонецЕсли;
			Если НЕ НоваяСтр.ДокументКемВыдан = Результат.КемВыдан Тогда
				НоваяСтр.ДокументКемВыдан = Результат.КемВыдан;                 
				ЕстьИзменения = Истина;
			КонецЕсли;	
			Если НЕ НоваяСтр.ДокументКодПодразделения = Результат.КодПодразделения Тогда
				НоваяСтр.ДокументКодПодразделения = Результат.КодПодразделения;
				ЕстьИзменения = Истина;
			КонецЕсли;	
			Если НЕ НоваяСтр.ДокументСерия = Результат.Серия Тогда
				НоваяСтр.ДокументСерия = Результат.Серия;
				ЕстьИзменения = Истина;
			КонецЕсли;	
			Если НЕ НоваяСтр.ДокументНомер = Результат.Номер Тогда
				НоваяСтр.ДокументНомер = Результат.Номер;
				ЕстьИзменения = Истина;
			КонецЕсли;	
			Если НЕ НоваяСтр.ДокументСрокДействия = Результат.СрокДействия Тогда
				НоваяСтр.ДокументСрокДействия = Результат.СрокДействия;
				ЕстьИзменения = Истина;
			КонецЕсли;	
			Если НЕ НоваяСтр.ДокументНеДействителен = Результат.НеДействителен Тогда
				НоваяСтр.ДокументНеДействителен = Результат.НеДействителен;
				ЕстьИзменения = Истина;
				Если Результат.НеДействителен И НоваяСтр.ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыДокументовФизическихЛиц.СвидетельствоОСмерти") Тогда
					ДатаСмерти = Дата(1,1,1);
				КонецЕсли;	
			КонецЕсли;	 
			Если НЕ НоваяСтр.ДокументДействителен = Результат.Действителен Тогда
				НоваяСтр.ДокументДействителен = Результат.Действителен;
				ЕстьИзменения = Истина;
			КонецЕсли;	
			ЕстьИзмененияДатыСмерти = Ложь;
			Если НоваяСтр.ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыДокументовФизическихЛиц.СвидетельствоОСмерти") Тогда
				Если НЕ НоваяСтр.ДатаСмерти = Результат.ДатаСмерти Тогда
					НоваяСтр.ДатаСмерти = Результат.ДатаСмерти;
					ЕстьИзменения = Истина;    
					ЕстьИзмененияДатыСмерти = Истина;
					Если НЕ Результат.НеДействителен Тогда
						ДатаСмерти = Результат.ДатаСмерти;
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;	
			НоваяСтр.ДокументИзменен = ?(ЕстьИзменения, Истина, НоваяСтр.ДокументИзменен);
			Если ЕстьИзменения Тогда
				//+МАН 04.12.25 Закомментировал. Начало действия есть и его не нужно обнулять.
				//НоваяСтр.ДокументНачалоДействия = Дата(1,1,1);
				//-МАН
				// ++ Сербаев 25.05.2023 TODO: Сербаев
				НоваяСтр.ПричинаИзменения = ПредопределенноеЗначение("Справочник.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.ИсправлениеДанныхДокумент");
				// -- Сербаев 25.05.2023
			КонецЕсли;	
		КонецЕсли;	
		ПроверитьДействительностьДокументов();   
		ПроверитьСтатусПочетный();
		ПоказатьРезиденство();     
		Если ЕстьИзмененияДатыСмерти Тогда
			Если НЕ ДатаСмерти = Дата(1,1,1) тогда
				Элементы.ДекорацияИнформацияОСмерти.Заголовок = "Клиент умер. Дата смерти " + Формат(ДатаСмерти, "ДФ=dd.MM.yyyy"); 
				Элементы.ГруппаСтатус.Видимость = Истина;
			Иначе 
				Элементы.ДекорацияИнформацияОСмерти.Заголовок = ""; 
				Элементы.ГруппаСтатус.Видимость = Ложь;
			КонецЕсли;	
		КонецЕсли;
		ДокументыЗалогодателя.Сортировать("Основной УБЫВ, ДокументНачалоДействия УБЫВ, ВидДокументаЗалогодателя"); 
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура АдресПоПропискеВручнуюПриИзменении(Элемент)
	АдресПоПрописке = "";
	АдресПоПропискеСтруктура = "";
	
	Если ЭтаФорма.ФактическийСовпадает Тогда
		ФактическийАдрес = "";
		ФактическийАдресСтруктура = "";
	КонецЕсли;
	
	Если ЭтаФорма.ПочтовыйСовпадает Тогда
		ПочтовыйАдрес = "";
		ПочтовыйАдресСтруктура = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФактическийАдресВручнуюПриИзменении(Элемент) 
	ФактическийАдрес = "";
	ФактическийАдресСтруктура = "";
	Если ФактическийАдресВручную Тогда
		//ФактическийАдрес = "";
		//ФактическийАдресСтруктура = "";
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПочтовыйАдресВручнуюПриИзменении(Элемент)
	ПочтовыйАдрес = "";
	ПочтовыйАдресСтруктура = "";
	Если ПочтовыйАдресВручную Тогда
		//ПочтовыйАдрес = "";
		//ПочтовыйАдресСтруктура = ""; 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияИзменения(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Залогодатель", Залогодатель);
	ОткрытьФорму("Отчет.ЛБ_ОтчетИсторияИзмененияЗалогодателя.Форма.ФормаОтчета", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьСписокИсточниковИнформации(ИсточникиИнф, МассивВыбора)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_ИсточникиИнформации.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ЛБ_ИсточникиИнформации КАК ЛБ_ИсточникиИнформации";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СпрЗначение = СокрЛП(Выборка.Наименование);
		Если МассивВыбора.Найти(СпрЗначение) = неопределено Тогда
			Пометка = ложь;
		Иначе	
			Пометка = Истина;
		КонецЕсли;	
		ИсточникиИнф.Добавить(СпрЗначение, СпрЗначение, Пометка);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникИнформацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	
	ИсточникиИнф = Новый СписокЗначений;
	МассивВыбора = СтрРазделить(ИсточникИнформации, ";", ложь);
	ЗаполнитьСписокИсточниковИнформации(ИсточникиИнф, МассивВыбора);	
	
	// процедура ПослеОтметкиЭлементов определена чуть ниже
	ОповещениеПослеОтметкиЭлементов = Новый ОписаниеОповещения(
	"ПослеОтметкиЭлементовИИ", ЭтотОбъект
	);	
	
	ИсточникиИнф.ПоказатьОтметкуЭлементов(
	ОповещениеПослеОтметкиЭлементов,
	"Выберите источники информации"
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтметкиЭлементовИИ(Элементы, Параметры) Экспорт
	ИсточникИнформации = "";
	Если Элементы <> Неопределено Тогда
		Для Каждого Эл Из Элементы Цикл
			Если Эл.Пометка Тогда
				ИсточникИнформации = ИсточникИнформации + ?(ПустаяСтрока(ИсточникИнформации), "", ";") + Эл.Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура EmailПриИзменении(Элемент)
	ПроверитьEmail();
КонецПроцедуры

&НаКлиенте
Процедура ДокументыНеДействителенПриИзменении(Элемент)
	ТекСтрока = Элементы.Документы.ТекущиеДанные; 
	ТекСтрока.ДокументИзменен = Истина;
	Если ТекСтрока.ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыДокументовФизическихЛиц.СвидетельствоОСмерти") Тогда
		Если ТекСтрока.ДокументНеДействителен Тогда
			ДатаСмерти = Дата(1,1,1);
		Иначе	
			ДатаСмерти = ТекСтрока.ДатаСмерти;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПроверитьПаспортВСпискеНеДействительных(ДокументСерия, ДокументНомер)
	Парам = Новый Структура("Серия, Номер", СокрЛП(ДокументСерия), СокрЛП(ДокументНомер));
	Возврат ЛБ_ОбменLX.ПаспортНедействителен(Парам);
КонецФункции

&НаКлиенте
Процедура ДокументыОсновнойПриИзменении(Элемент)
	ТекСтрока = Элементы.Документы.ТекущиеДанные;
	ТекСтрока.ОсновнойДУЛ = ложь;  
	ТекСтрока.ОсновнойДоп = ложь;
	
	Если ТекСтрока.Основной И НЕ Гражданство = ТекСтрока.Гражданство Тогда
		ТекСтрока.Основной = ложь; 
		Сообщить("Гражданство документа не совпадает с гражданством клиента, выбранным в карточке!");
		Возврат;
	КонецЕсли; 
	
	Если ТекСтрока.Основной И (ТекСтрока.ДокументНеДействителен ИЛИ ТекСтрока.ПроверкаНеДействителен) Тогда
		ТекСтрока.Основной = Ложь; 
		Сообщить("Документ не действителен, он не может быть основным!");
		Возврат;   
	КонецЕсли;	
	
	Если ТекСтрока.ВидДокументаЗалогодателя = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность") Тогда 
		ТекСтрока.ОсновнойДУЛ = ТекСтрока.Основной;   
		ТекСтрока.ДокументИзменен = Истина;
	ИначеЕсли ТекСтрока.ВидДокументаЗалогодателя = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийПравоПребыванияРФ") Тогда 
		ТекСтрока.ОсновнойДоп = ТекСтрока.Основной; 
		ТекСтрока.ДокументИзменен = Истина;
	КонецЕсли;	      
	
	Стр0 = ДокументыЗалогодателя.НайтиПоИдентификатору(ТекСтрока.ПолучитьИдентификатор());
	Если ТекСтрока.ОсновнойДУЛ Тогда
		Если НЕ ТекСтрока.ДокументДействителен Тогда   
			ДокНеОК = ложь;
			Если ТекСтрока.ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ") Тогда
				Если ПроверитьПаспортВСпискеНеДействительных(ТекСтрока.ДокументСерия, ТекСтрока.ДокументНомер) Тогда
					ДокНеОК = Истина;
					ТекСтрока.ОсновнойДУЛ = Ложь; 
					ТекСтрока.Основной = Ложь;
					Сообщить("Документ найден в списке недействительных паспортов и не может быть основным документом удостоверяющим личность!");
				КонецЕсли;
			КонецЕсли;	
			Если НЕ ДокНеОК Тогда
				Для каждого Стр Из ДокументыЗалогодателя Цикл
					Если Стр.ОсновнойДУЛ И НЕ (Стр = Стр0) Тогда
						Стр.ОсновнойДУЛ = Ложь; 
						Стр.Основной = Ложь; 
						Стр.ДокументИзменен = Истина;
					КонецЕсли;	
				КонецЦикла;  
				//ТекСтрока.ДокументИзменен = Истина;
			КонецЕсли;	
		КонецЕсли;    	
	Иначе
		//ТекСтрока.ДокументИзменен = Истина;
	КонецЕсли;	      
	
	Если ТекСтрока.ОсновнойДоп Тогда
		Для каждого Стр Из ДокументыЗалогодателя Цикл
			Если Стр.ОсновнойДоп И НЕ (Стр = Стр0) Тогда
				Стр.ОсновнойДоп = Ложь; 
				Стр.Основной = Ложь; 
				Стр.ДокументИзменен = Истина;
			КонецЕсли;	
		КонецЦикла;  
		//ТекСтрока.ДокументИзменен = Истина;   	
	Иначе
		//ТекСтрока.ДокументИзменен = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЯвляетсяИПДЛПриИзменении(Элемент)
	Если ЯвляетсяИПДЛ Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросИДПЛ", ЭтотОбъект); 
		ПоказатьВопрос(Оповещение, "Вы уверены, что клиент ИПДЛ? В этом случае допускается обслуживание клиента только по разрешению Директора.", РежимДиалогаВопрос.ДаНетОтмена, 0,,);
	Иначе
		Элементы.ГруппаИПДЛРасшифровка.Видимость = Ложь; 
		КатегорияКлиентаИПДЛ = ПредопределенноеЗначение("Перечисление.ЛБ_КатегорииИПДЛ.ПустаяСсылка");
		ДопИнформацияИПДЛ = "";
		ДолжностьИПДЛ = "";
		РаботодательИПДЛ = "";
		РазрешениеИПДЛ = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросИДПЛ(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если ЯвляетсяДЛПМО_РДПЛ Тогда
			ЯвляетсяДЛПМО_РДПЛ = ложь;
			Элементы.ГруппаДЛПМО_РДПЛРасшифровка.Видимость = Ложь;		    
		КонецЕсли;	
		Элементы.ГруппаИПДЛРасшифровка.Видимость = Истина;
	Иначе
		ЯвляетсяИПДЛ = Ложь;
		Элементы.ГруппаИПДЛРасшифровка.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЯвляетсяДЛПМО_РДПЛПриИзменении(Элемент)
	Если ЯвляетсяДЛПМО_РДПЛ Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросДЛПМО_РДПЛП", ЭтотОбъект); 
		ПоказатьВопрос(Оповещение, "Вы уверены, что клиент является публичным должностным лицом? Для дальнейших действий позвоните в группу финансового мониторинга.", РежимДиалогаВопрос.ДаНетОтмена, 0,,);
	Иначе
		Элементы.ГруппаДЛПМО_РДПЛРасшифровка.Видимость = Ложь;
		КатегорияДЛПМО_РДПЛ = ПредопределенноеЗначение("Перечисление.ЛБ_КатегорииДЛПМО_РДПЛ.ПустаяСсылка");
		ДопИнформацияДЛПМО_РДПЛ = "";
		ДолжностьДЛПМО_РДПЛ = "";
		РаботодательДЛПМО_РДПЛ = "";
		РазрешениеДЛПМО_РДПЛ = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросДЛПМО_РДПЛП(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если ЯвляетсяИПДЛ Тогда
			ЯвляетсяИПДЛ = Ложь;
			Элементы.ГруппаИПДЛРасшифровка.Видимость = Ложь;
		КонецЕсли;	
		Элементы.ГруппаДЛПМО_РДПЛРасшифровка.Видимость = Истина;
	Иначе
		ЯвляетсяДЛПМО_РДПЛ = Ложь;
		Элементы.ГруппаДЛПМО_РДПЛРасшифровка.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОчиститьОсновнойДок()  
	Для каждого стр из ДокументыЗалогодателя Цикл
		Если НЕ Стр.Основной Тогда
			Продолжить;
		КонецЕсли;	
		Если НЕ стр.Гражданство = Гражданство Тогда
			Стр.Основной = Ложь;
			Стр.ОсновнойДУЛ = ?(Стр.ОсновнойДУЛ, Ложь, Стр.ОсновнойДУЛ);
			Стр.ОсновнойДоп = ?(Стр.ОсновнойДоп, Ложь, Стр.ОсновнойДоп);
			Стр.ДокументИзменен = Истина;
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры	

&НаКлиенте
Процедура ГражданствоПриИзменении(Элемент)
	Если Гражданство = ПредопределенноеЗначение("Справочник.СтраныМира.Россия") Тогда
		Если НЕ ПустаяСтрока(Фамилия_А) Тогда
			Фамилия_А = "";
		ИначеЕсли НЕ ПустаяСтрока(Имя_А) Тогда
			Имя_А = "";
		ИначеЕсли НЕ ПустаяСтрока(Отчество_А) Тогда
			Отчество_А = "";
		КонецЕсли;	
	КонецЕсли;	
	ПоказатьФИО_А();  
	Если НЕ ГражданствоТекущее = Гражданство Тогда   
		ОчиститьОсновнойДок();
		Элементы.ДекорацияГражданство.Заголовок = " Действует с " + Формат(ОбщегоНазначенияКлиент.ДатаСеанса(), "ДФ=dd.MM.yyyy"); 
	Иначе
		Элементы.ДекорацияГражданство.Заголовок = " Действует с " + Формат(ДатаГражданство, "ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	// ++ Сербаев 16.05.2023
	ПоказатьРезиденство();
	// -- Сербаев 16.05.2023
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФИО_А()
	Если Гражданство = ПредопределенноеЗначение("Справочник.СтраныМира.Россия") Тогда		
		Элементы.ГруппаФИО_Англ.Видимость = ложь;
	Иначе
		Элементы.ГруппаФИО_Англ.Видимость = Истина;
		Если НЕ ПустаяСтрока(Фамилия_А) ИЛИ НЕ ПустаяСтрока(Имя_А) ИЛИ НЕ ПустаяСтрока(Отчество_А) Тогда
			Элементы.ГруппаФИО_Англ.Показать();
		КонецЕсли;
		Если ПустаяСтрока(Фамилия_А) Тогда
			Элементы.Имя_А.Доступность      = Ложь;
			Элементы.Отчество_А.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура Фамилия_АПриИзменении(Элемент)
	
	Фамилия_А = ТРег(Фамилия_А); 
	Если СтрДлина(Фамилия_А) > 0 Тогда 
		
		ТекстОшибки = ЛБ_ОбщегоНазначения.СообщитьЕслиСтрокаНеправильная(Фамилия_А, "Фамилия");
		Если ТекстОшибки <> "" Тогда
			ЛБ_ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "Фамилия_А");
			Возврат;
		КонецЕсли;
		
		// ++ Сербаев 07.06.2023
		ТолькоЛатиницаВСтроке = СтроковыеФункцииКлиентСервер.ТолькоЛатиницаВСтроке(Фамилия_А, , " -");
		//ТолькоЛатиницаВСтроке = СтроковыеФункцииКлиентКлиентСерверРФ.ТолькоЛатиницаВСтроке(Фамилия_А, , " -");
		// -- Сербаев 07.06.2023
		Если Не ТолькоЛатиницаВСтроке Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Строка ""Фамилия"" должна содержать только символы кириллицы!'"), , ,"Фамилия_А");
			Возврат;
		КонецЕсли;
		
		Элементы.Имя_А.Доступность = Истина;
		
	ИначеЕсли Фамилия_А = "" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Поле ""Фамилия"" не заполнено.'"), , , "Фамилия_А");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Имя_АПриИзменении(Элемент) 
	
	Имя_А = ТРег(Имя_А);
	Если СтрДлина(Имя_А) > 0 Тогда
		ТекстОшибки = ЛБ_ОбщегоНазначения.СообщитьЕслиСтрокаНеправильная(Имя_А, "Имя");
		Если ТекстОшибки <> "" Тогда
			ЛБ_ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "Имя_А");
			Возврат;
		КонецЕсли; 
		
		// ++ Сербаев 07.06.2023
		ТолькоЛатиницаВСтроке = СтроковыеФункцииКлиентСервер.ТолькоЛатиницаВСтроке(Имя_А, , " -");
		//ТолькоЛатиницаВСтроке = СтроковыеФункцииКлиентСерверРФ.ТолькоЛатиницаВСтроке(Имя_А, , " -");
		// -- Сербаев 07.06.2023
		Если Не ТолькоЛатиницаВСтроке Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Строка ""Имя"" должна содержать только символы кириллицы!'"), , ,"Имя_А");
			Возврат;
		КонецЕсли;
		
		Элементы.Отчество_А.Доступность = Истина;
		
	ИначеЕсли Имя_А = "" Тогда	
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Поле ""Имя"" не заполнено.'"), , , "Имя_А");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отчество_АПриИзменении(Элемент)
	
	Отчество_А = ТРег(Отчество_А);
	Если СтрДлина(Отчество_А) > 0 Тогда
		ТекстОшибки = ЛБ_ОбщегоНазначения.СообщитьЕслиСтрокаНеправильная(Отчество_А, "Отчество");
		Если ТекстОшибки <> "" Тогда
			ЛБ_ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "Отчество_А");
			Возврат;
		КонецЕсли;
		
		// ++ Сербаев 07.06.2023
		ТолькоЛатиницаВСтроке = СтроковыеФункцииКлиентСервер.ТолькоЛатиницаВСтроке(Отчество_А, , " -");
		//ТолькоЛатиницаВСтроке = СтроковыеФункцииКлиентСерверРФ.ТолькоЛатиницаВСтроке(Отчество_А, , " -");
		// -- Сербаев 07.06.2023
		Если Не ТолькоЛатиницаВСтроке Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Строка ""Отчество"" должна содержать только символы кириллицы!'"), , ,"Отчество_А");
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРедактироватьНаСервере()
	//заполняем конт. информацию и документы
	ЭтоНовыйКлиент = Ложь;
	ЗаполнитьКонтактнуюИнформацию();
	ЗаполнитьДокументы();  
	ЗаполнитьАнкету();	 
	ЗаполнитьТаблицуДоверенностей();
	
	Элементы.ФормаКнопкаЗаписать.Доступность = Истина;
	Элементы.ФормаКнопкаЗаписатьИЗакрыть.Доступность = Истина;
	Элементы.ГруппаФИО.Доступность = Истина;  
	Элементы.ГруппаКомментарий.Доступность = Истина;
	Элементы.ГруппаКонтактнаяИнформация.Доступность = Истина; 
	Элементы.ГруппаАдреса.Доступность = Истина;
	Элементы.ГруппаФИО_Англ.Доступность = Истина;
	Элементы.Гражданство.Доступность = Истина;
	Элементы.ДокументыГруппаДобавить.ТолькоПросмотр = ложь; 
	Элементы.ДокументыГруппаДобавить.Доступность = Истина;
	Элементы.ГруппаФЛ.Доступность = Истина; 
	Элементы.ГруппаФЛ1.Доступность = Истина;
	Элементы.ГруппаАнкетаДоп.Доступность = Истина;
	//Элементы.ЗалогодательБенефициарныйВладелец.Доступность = Истина;
	Элементы.ГруппаВладельцы.Доступность = Истина;
	Элементы.ГруппаИПДЛ.Доступность = Истина;
	Элементы.ГруппаДЛПМО_РДПЛ.Доступность = Истина; 
	Элементы.ГруппаОтказ.Доступность = Истина;   
	Элементы.ТаблицаДопСтатусов.ТолькоПросмотр = Ложь; 
	Элементы.ТаблицаСлужебныхСтатусов.ТолькоПросмотр = ложь;
	Элементы.ФормаКнопкаРедактировать.Видимость = Истина;
	//Иванов 06.2025 видимость кнопки ЭДО, согласия, контактные данные		
	Элементы.ЭДО.Доступность = Ложь;
	Элементы.ЭДО.ТолькоПросмотр = Истина;
	
	Элементы.Согласие.Доступность = Ложь;
	Элементы.Согласие.ТолькоПросмотр = Истина;
	
	Элементы.КонтактныеДанные.Доступность = Ложь;
	Элементы.КонтактныеДанные.ТолькоПросмотр = Истина;
	//
	Если ИнойИсточникИмущества Тогда
		Элементы.ИсточникПроисхожденияИмущества.Доступность = Ложь; 
	Иначе
		Элементы.ИсточникПроисхожденияИмуществаИной.РедактированиеТекста = Ложь;
	КонецЕсли;	
	Если ИнойИсточникДС Тогда
		Элементы.ИсточникПроисхожденияДенежныхСредств.Доступность = Ложь; 
	Иначе
		Элементы.ИсточникПроисхожденияДенежныхСредствИной.РедактированиеТекста = Ложь;
	КонецЕсли;	 
	
	ПричинаИзменения = ПредопределенноеЗначение("Справочник.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.ИсправлениеДанныхКонтактнаяИнформация");  
	Если АдресПоПрописке = ФактическийАдрес Тогда
		ФактическийСовпадает = Истина;
	Иначе	
		ФактическийСовпадает = Ложь;
	КонецЕсли;	
	
	Если АдресПоПрописке = ПочтовыйАдрес Тогда
		ПочтовыйСовпадает = Истина;
	Иначе	
		ПочтовыйСовпадает = Ложь;
	КонецЕсли;	
	ДокументыЗалогодателя.Сортировать("Основной УБЫВ, ДокументНачалоДействия УБЫВ, ВидДокументаЗалогодателя");
	ПроверитьПоПеречням(); 
	ЗаполнитьДатыПроверкиПеречней();
	ЗаполнитьТаблицуОтказов();  
	ПроверитьДействительностьДокументов();
	
	Если ОтказОпераций Тогда 
		ОтказОпераций = Ложь;
		ПричинаОтказа = "";
		ДатаОтказа = Дата(1,1,1); 
		СуммаЗаймаОтказ = 0;
		Элементы.ГруппаПричинаОтказа.Видимость = Ложь;
	КонецЕсли;	
	//ЭтаФорма.ОбновитьОтображениеДанных(); 
КонецПроцедуры

&НаКлиенте
Процедура Редактировать(Команда)
	
	Модифицированность = Истина; // Сербаев 01.06.2023  
	
	ОбработатьРедактироватьНаСервере(); 
	УстановитьДоступность();
	ПоказатьФИО_А();
КонецПроцедуры

&НаКлиенте
Процедура ЗалогодательБенефициарныйВладелецПриИзменении(Элемент)
	Если ЗалогодательБенефициарныйВладелец Тогда 
		Элементы.ГруппаБенефициары.Скрыть();
		Бенефициары.Очистить();
		Элементы.ГруппаБенефициары.Доступность = ложь;
	Иначе
		Элементы.ГруппаБенефициары.Показать(); 
		Элементы.ГруппаБенефициары.Доступность = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОтказПриИзменении(Элемент)
	Если ОтказОпераций Тогда
		Элементы.ГруппаПричинаОтказа.Видимость = Истина;
		ДатаОтказа = ?(ДатаОтказа = Дата(1,1,1), ТекущаяДата(), ДатаОтказа);
	Иначе                                   
		ДатаОтказа = Дата(1,1,1);
		ПричинаОтказа = "";   
		СуммаЗаймаОтказ = 0;
		Элементы.ГруппаПричинаОтказа.Видимость = ложь;  		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораБенефициара(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;    
	
	Отбор = Новый Структура;
	Отбор.Вставить("Бенефициар", Результат.Залогодатель);     
	
	Строки = Бенефициары.НайтиСтроки(Отбор); 
	Если Строки.Количество() = 0 Тогда
		НоваяСтр = Бенефициары.Добавить();
		НоваяСтр.Бенефициар = Результат.Залогодатель;
		НоваяСтр.ДатаРождения = Результат.ДатаРождения;
		НоваяСтр.ВидПолученияИнформации = Перечисления.ЛБ_ВидыПолученияИнформацииОБенефициарномВладельце.ПредоставленКлиентомУстановленОрганизацией;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьБенефициара(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("БезДокументов", истина);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораБенефициара",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателя", , ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораДоверенности(Результат, ДопПараметры) Экспорт	
	ЗаполнитьТаблицуДоверенностей();
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьСписокКатегорийФизическогоЛица(КатегорииФЛ, МассивВыбора)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_КатегорииФизЛица.Ссылка КАК Ссылка
	|ИЗ
	|	Перечисление.ЛБ_КатегорииФизЛица КАК ЛБ_КатегорииФизЛица";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Синоним = СокрЛП(Выборка.Ссылка);
		Если МассивВыбора.Найти(Синоним) = неопределено Тогда
			Пометка = ложь;
		Иначе	
			Пометка = Истина;
		КонецЕсли;	
		КатегорииФЛ.Добавить(Синоним, Синоним, Пометка);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура КатегорииФизЛицаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	
	КатегорииФЛ = Новый СписокЗначений;
	МассивВыбора = СтрРазделить(КатегорииФизЛица, ";", ложь);
	ЗаполнитьСписокКатегорийФизическогоЛица(КатегорииФЛ, МассивВыбора);	
	
	ОповещениеПослеОтметкиЭлементов = Новый ОписаниеОповещения("ПослеОтметкиЭлементовКФЛ", ЭтотОбъект);	
	
	КатегорииФЛ.ПоказатьОтметкуЭлементов(
	ОповещениеПослеОтметкиЭлементов,
	"Выберите категории физического лица"
	);
КонецПроцедуры  

&НаКлиенте
Процедура ПослеОтметкиЭлементовКФЛ(Элементы, Параметры) Экспорт
	КатегорииФизЛица = "";
	Если Элементы <> Неопределено Тогда
		Для Каждого Эл Из Элементы Цикл
			Если Эл.Пометка Тогда
				КатегорииФизЛица = КатегорииФизЛица + ?(ПустаяСтрока(КатегорииФизЛица), "", ";") + Эл.Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнойИсточникИмуществаПриИзменении(Элемент)
	Если ИнойИсточникИмущества Тогда
		ИсточникПроисхожденияИмущества = ПредопределенноеЗначение("Справочник.ЛБ_ИсточникиПроисхожденияИмущества.ПустаяСсылка");
		Элементы.ИсточникПроисхожденияИмущества.Доступность = Ложь;
		Элементы.ИсточникПроисхожденияИмуществаИной.РедактированиеТекста = Истина;
	Иначе  
		ИсточникПроисхожденияИмуществаИной = "";
		Элементы.ИсточникПроисхожденияИмущества.Доступность = Истина; 
		Элементы.ИсточникПроисхожденияИмуществаИной.РедактированиеТекста = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ИнойИсточникДСПриИзменении(Элемент)
	Если ИнойИсточникДС Тогда
		ИсточникПроисхожденияДенежныхСредств = ПредопределенноеЗначение("Справочник.ЛБ_ИсточникиПроисхожденияДенежныхСредств.ПустаяСсылка");
		Элементы.ИсточникПроисхожденияДенежныхСредств.Доступность = Ложь; 
		Элементы.ИсточникПроисхожденияДенежныхСредствИной.РедактированиеТекста = Истина;
	Иначе      
		ИсточникПроисхожденияДенежныхСредствИной = "";
		Элементы.ИсточникПроисхожденияДенежныхСредств.Доступность = Истина; 
		Элементы.ИсточникПроисхожденияДенежныхСредствИной.РедактированиеТекста = Ложь;
	КонецЕсли;	 
КонецПроцедуры

&НаКлиенте
Процедура ОтветственноеЛицоИПДЛНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь; 
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораОтветственногоЛицаИПДЛ",ЭтаФорма);
	ОткрытьФорму("РегистрСведений.ЛБ_ОтвественныеЛицаОрганизации.Форма.ФормаВыбора", , ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры  

&НаСервере
Процедура ПослеВыбораОтветственногоЛицаИПДЛ(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтветственноеЛицоИПДЛ = Результат;
КонецПроцедуры

&НаКлиенте
Процедура ОтветственноеЛицоДЛПМО_РДПЛНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь; 
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораОтветственногоЛицаДЛПМО_РДПЛ",ЭтаФорма);
	ОткрытьФорму("РегистрСведений.ЛБ_ОтвественныеЛицаОрганизации.Форма.ФормаВыбора", , ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораОтветственногоЛицаДЛПМО_РДПЛ(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтветственноеЛицоДЛПМО_РДПЛ = Результат;
КонецПроцедуры

&НаКлиенте
Процедура РазрешениеИПДЛПриИзменении(Элемент)
	Если НЕ РазрешениеИПДЛ Тогда 
		ОтветственноеЛицоИПДЛ = ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
		Элементы.ОтветственноеЛицоИПДЛ.Видимость = ложь;
	Иначе
		Элементы.ОтветственноеЛицоИПДЛ.Видимость = Истина;
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура РазрешениеДЛПМО_РДПЛПриИзменении(Элемент)
	Если НЕ РазрешениеДЛПМО_РДПЛ Тогда  
		ОтветственноеЛицоДЛПМО_РДПЛ = ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
		Элементы.ОтветственноеЛицоДЛПМО_РДПЛ.Видимость =ложь; 
	Иначе
		Элементы.ОтветственноеЛицоДЛПМО_РДПЛ.Видимость =Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КатегорияКлиентаИПДЛПриИзменении(Элемент)
	Если КатегорияКлиентаИПДЛ = ПредопределенноеЗначение("Перечисление.ЛБ_КатегорииИПДЛ.ИПДЛ") ИЛИ
		КатегорияКлиентаИПДЛ = ПредопределенноеЗначение("Перечисление.ЛБ_КатегорииИПДЛ.СупругИПДЛ") Тогда  
		ДопИнформацияИПДЛ = "";
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОбновленияАнкетыНажатие(Элемент)
	ПараметрыФормы = Новый Структура; 
	ПараметрыФормы.Вставить("Залогодатель", Залогодатель);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ИсторияОбновленияАнкетыКлиента", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДоверенностейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтрока = Элементы.ТаблицаДоверенностей.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда   
		СтандартнаяОбработка = ложь;
		СсылкаНаЭлемент = ТекСтрока.Доверенность;
		ПараметрыФормы = Новый Структура("Ключ", СсылкаНаЭлемент); 
		ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
		ОткрытьФорму("Документ.ЛБ_Доверенности.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры   

&НаКлиенте
Процедура ТаблицаДоверенностейПредставительВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтрока = Элементы.ТаблицаДоверенностейП.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда   
		СтандартнаяОбработка = ложь;
		СсылкаНаЭлемент = ТекСтрока.Доверенность;
		ПараметрыФормы = Новый Структура("Ключ", СсылкаНаЭлемент); 
		ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
		ОткрытьФорму("Документ.ЛБ_Доверенности.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры   

&НаСервере
Функция ПолучитьДУЛ() 
	ДУЛы = ДокументыЗалогодателя.Выгрузить();
	ДУЛы.Сортировать("Основной Убыв, Период Убыв"); 
	Отбор = Новый Структура;
	Отбор.Вставить("ВидДокументаЗалогодателя", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность"));  
	//Отбор.Вставить("Гражданство", Гражданство);
	Отбор.Вставить("ДокументНеДействителен", Ложь); 
	Отбор.Вставить("ПроверкаНеДействителен", Ложь);
	СтрокиД = Дулы.НайтиСтроки(Отбор);   
	Если НЕ СтрокиД.Количество() = 0 Тогда
		Для каждого СтрД Из СтрокиД Цикл
			ДУЛ = "";
			//ДУЛ = ДУЛ + ?(ПустаяСтрока(ДУЛ), "", Символ(94) + Символ(112)) + СокрЛП(СтрД.ВидДокумента);
			ДУЛ = ДУЛ + ?(ПустаяСтрока(ДУЛ), "", Символы.ПС) + СокрЛП(СтрД.ВидДокумента);
			ДУЛ = ДУЛ + ?(ПустаяСтрока(СтрД.ДокументСерия), "", " " + СокрЛП(СтрД.ДокументСерия));
			ДУЛ = ДУЛ + ?(ПустаяСтрока(СтрД.ДокументНомер), "", " № " + СокрЛП(СтрД.ДокументНомер));
			ДУЛ = ДУЛ + ?(СтрД.ДокументДатаВыдачи = Дата(1,1,1), "", " выдан " + Формат(СтрД.ДокументДатаВыдачи, "ДФ=dd.MM.yyyy")); 
			ДУЛ = ДУЛ + ?(ПустаяСтрока(СтрД.ДокументКемВыдан), "", " " + СокрЛП(СтрД.ДокументКемВыдан));
			ДУЛ = ДУЛ + ?(ПустаяСтрока(СтрД.ДокументКодПодразделения), "", " к/п " + СокрЛП(СтрД.ДокументКодПодразделения));
			ДУЛ = ДУЛ + ?(СтрД.ДокументСрокДействия = Дата(1,1,1), "", " действует до " + Формат(СтрД.ДокументСрокДействия, "ДФ=dd.MM.yyyy"));
		КонецЦикла;
		Возврат ДУЛ;
	КонецЕсли;
	Возврат неопределено;
КонецФункции

&НаСервере
Функция ПолучитьДопДокумент() 
	ДокументыДоп = ДокументыЗалогодателя.Выгрузить();
	ДокументыДоп.Сортировать("Период Убыв"); 
	Отбор = Новый Структура;
	Отбор.Вставить("ВидДокументаЗалогодателя", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийПравоПребыванияРФ"));
	Отбор.Вставить("ДокументНеДействителен", Ложь); 
	Отбор.Вставить("ПроверкаНеДействителен", Ложь);
	СтрокиД = ДокументыДоп.НайтиСтроки(Отбор);
	Если НЕ СтрокиД.Количество() = 0 Тогда  
		Для каждого СтрД Из СтрокиД Цикл
			ДокументДоп = "";
			//ДокументДоп = ДокументДоп + ?(ПустаяСтрока(ДокументДоп), "", Символ(94) + Символ(112)) + СокрЛП(СтрД.ВидДокумента);
			ДокументДоп = ДокументДоп + ?(ПустаяСтрока(ДокументДоп), "", Символы.ПС) + СокрЛП(СтрД.ВидДокумента);
			ДокументДоп = ДокументДоп + ?(ПустаяСтрока(СтрД.ДокументСерия), "", " " + СокрЛП(СтрД.ДокументСерия));
			ДокументДоп = ДокументДоп + ?(ПустаяСтрока(СтрД.ДокументНомер), "", " № " + СокрЛП(СтрД.ДокументНомер));
			ДокументДоп = ДокументДоп + ?(СтрД.ДокументДатаВыдачи = Дата(1,1,1), "", " выдан " + Формат(СтрД.ДокументДатаВыдачи, "ДФ=dd.MM.yyyy")); 
			ДокументДоп = ДокументДоп + ?(ПустаяСтрока(СтрД.ДокументКемВыдан), "", " " + СокрЛП(СтрД.ДокументКемВыдан));
			ДокументДоп = ДокументДоп + ?(ПустаяСтрока(СтрД.ДокументКодПодразделения), "", " к/п " + СокрЛП(СтрД.ДокументКодПодразделения));
			ДокументДоп = ДокументДоп + ?(СтрД.ДокументСрокДействия = Дата(1,1,1), "", " действует до " + Формат(СтрД.ДокументСрокДействия, "ДФ=dd.MM.yyyy"));
		КонецЦикла;	
		Возврат ДокументДоп;
	КонецЕсли;	
	Возврат неопределено;
КонецФункции 

&НаСервере
Функция ПолучитьИсториюОбновленийАнкеты()
	Результат = Новый Структура;
	Результат.Вставить("ДатыОбновлений"); 
	Результат.Вставить("ОтветсвенныйАнкета");
	Результат.Вставить("ОтветсвенныйОбновление");
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	
	// ++ Сербаев 11.07.2023
	//Запрос.УстановитьПараметр("Дата", Дата); 
	Запрос.УстановитьПараметр("Дата", Дата);
	//Запрос.Текст ="ВЫБРАТЬ РАЗЛИЧНЫЕ
	//              |	ЛБ_ДатыОбновленияАнкеты.Период КАК Период,
	//              |	ЛБ_ДатыОбновленияАнкеты.Регистратор.Ответственный КАК Ответственный
	//              |ИЗ
	//              |	РегистрСведений.ЛБ_ДатыОбновленияАнкеты КАК ЛБ_ДатыОбновленияАнкеты
	//              |ГДЕ
	//              |	ЛБ_ДатыОбновленияАнкеты.Залогодатель = &Залогодатель
	//              |	И ЛБ_ДатыОбновленияАнкеты.Период <= &Дата
	//              |
	//              |УПОРЯДОЧИТЬ ПО 
	//              |	Период УБЫВ"; 
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(ЛБ_ДатыОбновленияАнкеты.Период) КАК Период,
	|	НАЧАЛОПЕРИОДА(ЛБ_ДатыОбновленияАнкеты.Период, ДЕНЬ) КАК НачалоДня
	|ПОМЕСТИТЬ ВТ_ВремяПоследнегоИзмененияВДень
	|ИЗ
	|	РегистрСведений.ЛБ_ДатыОбновленияАнкеты КАК ЛБ_ДатыОбновленияАнкеты
	|ГДЕ
	|	ЛБ_ДатыОбновленияАнкеты.Залогодатель = &Залогодатель
	|	И ЛБ_ДатыОбновленияАнкеты.Период <= &Дата
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ЛБ_ДатыОбновленияАнкеты.Период, ДЕНЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВремяПоследнегоИзмененияВДень.Период КАК Период,
	|	ВТ_ВремяПоследнегоИзмененияВДень.НачалоДня КАК НачалоДня,
	|	ЛБ_ДатыОбновленияАнкеты.Регистратор.Ответственный КАК РегистраторОтветственный
	|ПОМЕСТИТЬ ВТ_ДанныеДляГруппировки
	|ИЗ
	|	ВТ_ВремяПоследнегоИзмененияВДень КАК ВТ_ВремяПоследнегоИзмененияВДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ДатыОбновленияАнкеты КАК ЛБ_ДатыОбновленияАнкеты
	|		ПО ВТ_ВремяПоследнегоИзмененияВДень.Период = ЛБ_ДатыОбновленияАнкеты.Период
	|ГДЕ
	|	ЛБ_ДатыОбновленияАнкеты.Период <= &Дата
	|	И ЛБ_ДатыОбновленияАнкеты.Залогодатель = &Залогодатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеДляГруппировки.Период КАК Период,
	|	ВТ_ДанныеДляГруппировки.РегистраторОтветственный КАК Ответственный
	|ИЗ
	|	ВТ_ДанныеДляГруппировки КАК ВТ_ДанныеДляГруппировки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеДляГруппировки.Период,
	|	ВТ_ДанныеДляГруппировки.РегистраторОтветственный
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	// -- Сербаев 11.07.2023
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();  
	ДатыОбновлений = "";
	Ном = 0; 
	СписокДат = новый СписокЗначений;
	Для каждого Стр Из ТаблицаЗапроса Цикл 
		Если Ном = 0 Тогда
			Ном = Ном + 1;
			Результат.ОтветсвенныйАнкета = стр.Ответственный; 
		Иначе
			Результат.ОтветсвенныйОбновление = стр.Ответственный;
		КонецЕсли;	   
		ДатаО = Формат(Стр.Период, "ДФ=dd.MM.yyyy");
		Если СписокДат.НайтиПоЗначению(ДатаО) = неопределено Тогда
			СписокДат.Добавить(ДатаО); 
		КонецЕсли;	
		//ДатыОбновлений = ДатыОбновлений + ?(ПустаяСтрока(ДатыОбновлений), "", ", ") + Формат(Стр.Период, "ДФ=dd.MM.yyyy");
	Конеццикла;	 
	Для каждого Элемент Из списокДат Цикл  
		ДатыОбновлений = ДатыОбновлений + ?(ПустаяСтрока(ДатыОбновлений), "", ", ") + Элемент.Значение;
	Конеццикла;	
	Результат.ДатыОбновлений = ДатыОбновлений;
	
	Возврат Результат;
КонецФункции 

&НаСервере 
Функция ПолучитьКатегорииФизическогоЛица(МассивВыбора)
	Результат = Новый Структура;
	Результат.Вставить("Клиент");
	Результат.Вставить("ПредставительКлиента");
	Результат.Вставить("Выгодоприобретатель");
	Результат.Вставить("БенифициарныйВладелец");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_КатегорииФизЛица.Ссылка КАК Ссылка
	|ИЗ
	|	Перечисление.ЛБ_КатегорииФизЛица КАК ЛБ_КатегорииФизЛица";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Синоним = СокрЛП(Выборка.Ссылка);
		Если МассивВыбора.Найти(Синоним) = неопределено Тогда
			Пометка = ложь;
		Иначе	
			Пометка = Истина;
		КонецЕсли;
		Если Выборка.Ссылка = Перечисления.ЛБ_КатегорииФизЛица.Клиент Тогда
			Результат.Клиент = ?(Пометка, Символ(10004), " ");
		ИначеЕсли Выборка.Ссылка = Перечисления.ЛБ_КатегорииФизЛица.ПредставительКлиента Тогда
			Результат.ПредставительКлиента = ?(Пометка, Символ(10004), " ");
		ИначеЕсли Выборка.Ссылка = Перечисления.ЛБ_КатегорииФизЛица.Выгодоприобретатель Тогда
			Результат.Выгодоприобретатель = ?(Пометка, Символ(10004), " ");
		ИначеЕсли Выборка.Ссылка = Перечисления.ЛБ_КатегорииФизЛица.БенифициарныйВладелец Тогда
			Результат.БенифициарныйВладелец = ?(Пометка, Символ(10004), " ");
		КонецЕсли;	
	КонецЦикла;	 
	
	Возврат Результат;
КонецФункции

&НаСервере 
Функция ЗаполнитьПредставителей()
	ПредставителиСтрока = "";
	Для каждого СтрД Из ТаблицаДоверенностей Цикл 
		//ПредставителиСтрока = ?(Пустаястрока(ПредставителиСтрока), ПредставителиСтрока, ПредставителиСтрока + Символ(94) + Символ(112));
		ПредставителиСтрока = ?(Пустаястрока(ПредставителиСтрока), ПредставителиСтрока, ПредставителиСтрока + Символы.ПС);
		//ПредставителиСтрока = ПредставителиСтрока + СокрЛП(СтрД.ПредставительКлиента) + Символ(94) + Символ(112) +
		ПредставителиСтрока = ПредставителиСтрока + СокрЛП(СтрД.ПредставительКлиента) + Символы.ПС +
		"Доверенность " + нрег(Строка(СтрД.ВидДоверенности)) + " № " + СокрЛП(СтрД.НомерДоверенности) + " от " + СокрЛП(Формат(СтрД.ДатаНачала, "ДЛФ=DD")) +
		" действует до " + СокрЛП(Формат(СтрД.ДатаОкончания, "ДЛФ=DD")) + ", № залогового билета " + СокрЛП(СтрД.ЗалоговыйБилет.НомерЗалоговогоБилета);			       		
	Конеццикла;	 
	Возврат ПредставителиСтрока;
КонецФункции

&НаКлиенте
Процедура НапечататьАнкету()
	
	// ++ Сербаев 23.05.2023
	НапечататьАнкетуВариант();
	
	// Shell = Новый COMОбъект("WScript.Shell");
	// temp = Shell.ExpandEnvironmentStrings("%temp%");
	// Каталог = temp + "\";
	// Если ПустаяСтрока(Каталог) Тогда
	// 	Сообщить("Не выбрана каталог временных файлов");
	// 	Возврат;
	// КонецЕсли;
	// ИмяФайла = СокрЛП(Залогодатель) + "_" + Формат(ТекущаяДата(), "ДФ=dd-MM-yyyy");
	// ИмяФайла = СтрЗаменить(ИмяФайла, " ", "_");
	// ИмяВременногоФайла = Каталог + ИмяФайла + ".doc";
	
	// ДД = СохранитьФайлНаСервере();
	// Если ДД = неопределено Тогда
	//    Возврат;
	// КонецЕсли;
	// ДД.Записать(ИмяВременногоФайла); 	   
	//
	//ПараметрыПечати = Новый Структура;   
	//МассивВыбора = СтрРазделить(КатегорииФизЛица, ";", ложь);  
	//РезультатК = ПолучитьКатегорииФизическогоЛица(МассивВыбора); 
	//ПараметрыПечати.Вставить("Кл", РезультатК.Клиент);
	//ПараметрыПечати.Вставить("ПКл", РезультатК.ПредставительКлиента);
	//ПараметрыПечати.Вставить("Вп", РезультатК.Выгодоприобретатель);
	//ПараметрыПечати.Вставить("Бен", РезультатК.БенифициарныйВладелец);	    
	//ПараметрыПечати.Вставить("ФИО", СокрЛП(Фамилия) + " " + СокрЛП(Имя) + ?(НЕ ПустаяСтрока(Отчество), " " + СокрЛП(Отчество), ""));
	//ПараметрыПечати.Вставить("ДатаМестоРождения", Формат(ДатаРождения,"ДЛФ=DD") + ", " + СокрЛП(МестоРождения));
	//ПараметрыПечати.Вставить("Гражданство", СокрЛП(Гражданство)); 
	//ДУЛ = ПолучитьДУЛ();
	//ДУЛ = ?(ДУЛ = неопределено, "", ДУЛ);
	//ПараметрыПечати.Вставить("ДУЛ", ДУЛ);
	//Если Гражданство = ПредопределенноеЗначение("Справочник.СтраныМира.Россия") Тогда 
	//    ДопДокумент = "Не требуется";
	//Иначе	   
	//    ДопДокумент = ПолучитьДопДокумент();
	//    ДопДокумент = ?(ДопДокумент = неопределено, "", ДопДокумент); 
	//КонецЕсли;	   
	//ПараметрыПечати.Вставить("ДопДокумент", ДопДокумент);
	//ПараметрыПечати.Вставить("АдресРегистрации",СокрЛП(АдресПоПрописке));
	//ПараметрыПечати.Вставить("ФактическийАдрес", ?(ФактическийСовпадает, "Совпадает с адресом места жительства (регистрации)", СокрЛП(ФактическийАдрес)));
	//ПараметрыПечати.Вставить("ПочтовыйАдрес", ?(ПочтовыйСовпадает, "Совпадает с адресом места жительства (регистрации)",СокрЛП(ПочтовыйАдрес)));
	//ПараметрыПечати.Вставить("ИНН", ?(ПустаяСтрока(ИНН), "Данные не предоставлены", ИНН));  
	//ПараметрыПечати.Вставить("СНИЛС", ?(ПустаяСтрока(СНИЛС), "Данные не предоставлены", СНИЛС)); 
	//Телефоны = "";
	//Телефоны = ?(ПустаяСтрока(Телефон), "", Телефон); 
	//Телефоны = Телефоны + ?(ПустаяСтрока(ТелефонДополнительный), "", ?(ПустаяСтрока(Телефоны), "", Символ(94) + Символ(112)) + ТелефонДополнительный);
	//ПараметрыПечати.Вставить("Телефоны", Телефоны); 
	//Контакты = КонтактноеЛицо + ?(ПустаяСтрока(ТелефонКонтактногоЛица), "", " тел. " +  ТелефонКонтактногоЛица);
	//ПараметрыПечати.Вставить("Контакты", ?(ПустаяСтрока(Контакты), "Данные не предоставлены", СокрЛП(Контакты))); 
	//Если НЕ ЯвляетсяИПДЛ Тогда
	//    ПараметрыПечати.Вставить("ИПДЛ", "Не является"); 
	//Иначе   
	//    СтрокаИПДЛ = ""; 
	//    СтрокаИПДЛ = ?(ПустаяСтрока(СтрокаИПДЛ), "", Символ(94) + Символ(112)) + Строка(КатегорияКлиентаИПДЛ) + 
	//        ?(ПустаяСтрока(ДопИнформацияИПДЛ), "", " " + СокрЛП(ДопИнформацияИПДЛ));  
	//    Если НЕ ПустаяСтрока(ДолжностьИПДЛ) Тогда	   
	//        СтрокаИПДЛ = ?(ПустаяСтрока(СтрокаИПДЛ), "", Символ(94) + Символ(112)) + "Должность: " + СокрЛП(ДолжностьИПДЛ); 
	//    КонецЕсли;
	//    Если НЕ ПустаяСтрока(РаботодательИПДЛ) Тогда	   
	//        СтрокаИПДЛ = ?(ПустаяСтрока(СтрокаИПДЛ), "", Символ(94) + Символ(112)) + "Работодатель: " + СокрЛП(РаботодательИПДЛ); 
	//    КонецЕсли;	
	//    ПараметрыПечати.Вставить("ИПДЛ", СтрокаИПДЛ); 
	//КонецЕсли;	
	//Если НЕ ЯвляетсяДЛПМО_РДПЛ Тогда
	//    ПараметрыПечати.Вставить("ДЛПМО_РДПЛ", "Не является"); 
	//Иначе   
	//    СтрокаДЛПМО_РДПЛ = ""; 
	//    СтрокаДЛПМО_РДПЛ = ?(ПустаяСтрока(СтрокаДЛПМО_РДПЛ), "", Символ(94) + Символ(112)) + Строка(КатегорияДЛПМО_РДПЛ) + 
	//        ?(ПустаяСтрока(ДопИнформацияИПДЛ), "", " " + СокрЛП(ДопИнформацияИПДЛ));  
	//    Если НЕ ПустаяСтрока(ДолжностьДЛПМО_РДПЛ) Тогда	   
	//        СтрокаДЛПМО_РДПЛ= ?(ПустаяСтрока(СтрокаДЛПМО_РДПЛ), "", Символ(94) + Символ(112)) + "Должность: " + СокрЛП(ДолжностьДЛПМО_РДПЛ); 
	//    КонецЕсли;
	//    Если НЕ ПустаяСтрока(РаботодательДЛПМО_РДПЛ) Тогда	   
	//        СтрокаДЛПМО_РДПЛ = ?(ПустаяСтрока(СтрокаДЛПМО_РДПЛ), "", Символ(94) + Символ(112)) + "Работодатель: " + СокрЛП(РаботодательДЛПМО_РДПЛ); 
	//    КонецЕсли;	
	//    ПараметрыПечати.Вставить("ДЛПМО_РДПЛ", СтрокаДЛПМО_РДПЛ); 
	//КонецЕсли;	  
	//ПараметрыПечати.Вставить("ХарактерОтношений",СокрЛП(ХарактерОтношений));
	//ПараметрыПечати.Вставить("Финансы", ?(ФинансовоеПоложениеСтабильное, "Стабильное", "Не стабильное"));
	//ПараметрыПечати.Вставить("ДеловаяРепутация", ?(ДеловаяРепутацияПоложительная, "Положительная", "Негативная"));  
	//ИсточникиПроисхождения = "";  
	//Если ЗначениеЗаполнено(ИсточникПроисхожденияДенежныхСредств) Тогда
	//     ИсточникиПроисхождения = ИсточникиПроисхождения + "Источник происхождения денежных средств: " + СокрЛП(ИсточникПроисхожденияДенежныхСредств);
	//Иначе
	// 	ИсточникиПроисхождения = ИсточникиПроисхождения + "Источник происхождения денежных средств: " + СокрЛП(ИсточникПроисхожденияДенежныхСредствИной); 
	//КонецЕсли;	  	                  
	//ИсточникиПроисхождения = ИсточникиПроисхождения + Символ(94) + Символ(112);	
	//Если ЗначениеЗаполнено(ИсточникПроисхожденияИмущества) Тогда
	//     ИсточникиПроисхождения = ИсточникиПроисхождения + "Источник происхождения имущества: " + СокрЛП(ИсточникПроисхожденияИмущества);
	//Иначе
	// 	ИсточникиПроисхождения = ИсточникиПроисхождения + "Источник происхождения имущества: " + СокрЛП(ИсточникПроисхожденияИмуществаИной); 
	//КонецЕсли;		
	//ПараметрыПечати.Вставить("ИсточникиПроисхожденияИмущества", СокрЛП(ИсточникиПроисхождения));
	//Если ТаблицаДоверенностей.Количество() = 0 Тогда
	//    ПараметрыПечати.Вставить("Представитель", "Отсутствует");
	//Иначе                 
	//    ПредставителиСтрока = ЗаполнитьПредставителей();
	//    ПараметрыПечати.Вставить("Представитель", ПредставителиСтрока);
	//КонецЕсли;	   
	//СтрокаБенефициары = "";
	//Для каждого СтрБ из Бенефициары Цикл 
	//    Если СтрБ.ВидПолученияИнформации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПолученияИнформацииОБенефициарномВладельце.УстановленОрганизацией") ИЛИ 
	// 	      СтрБ.ВидПолученияИнформации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПолученияИнформацииОБенефициарномВладельце.ПредоставленКлиентомУстановленОрганизацией") Тогда
	//        СтрокаБенефициары = ?(Пустаястрока(СтрокаБенефициары), "", Символ(94) + Символ(112)) + сокрЛП(СтрБ.Бенефициар);
	//     КонецЕсли;	   
	//Конеццикла;	
	//Если ПустаяСтрока(СтрокаБенефициары) Тогда 
	//    ПараметрыПечати.Вставить("БенефициарыОрганизация", "Отсутствуют");
	//Иначе	   
	//    ПараметрыПечати.Вставить("БенефициарыОрганизация", СтрокаБенефициары);
	//КонецЕсли;	     
	//СтрокаБенефициары = "";
	//Для каждого СтрБ из Бенефициары Цикл  
	//    Если СтрБ.ВидПолученияИнформации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПолученияИнформацииОБенефициарномВладельце.ПредоставленКлиентом") ИЛИ 
	// 	      СтрБ.ВидПолученияИнформации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПолученияИнформацииОБенефициарномВладельце.ПредоставленКлиентомУстановленОрганизацией") Тогда
	//        СтрокаБенефициары = ?(Пустаястрока(СтрокаБенефициары), "", Символ(94) + Символ(112)) + сокрЛП(СтрБ.Бенефициар);
	//    КонецЕсли;	   
	//Конеццикла;	 
	//Если ПустаяСтрока(СтрокаБенефициары) Тогда 
	//    ПараметрыПечати.Вставить("БенефициарыКлиент", "Отсутствуют");
	//Иначе	   
	//    ПараметрыПечати.Вставить("БенефициарыКлиент", СтрокаБенефициары);
	//КонецЕсли;	   
	//СведенияЦБ = "";
	//Для каждого СтрО Из ТаблицаОтказов Цикл
	//    Если СтрО.Вид = "ЦБ" Тогда
	// 	   СведенияЦБСтрока = СведенияЦБСтрока + ?(Пустаястрока(СведенияЦБСтрока), "", Символ(94) + Символ(112)) + Формат(СтрО.ДатаОтказа, "ДФ=dd.MM.yyyy") + " " + СокрЛП(СтрО.ПричинаОтказа) + " отв." + СокрЛП(СтрО.Ответственный); 
	//    КонецЕсли;	   
	//КонецЦикла;	   
	//ПараметрыПечати.Вставить("СведенияЦБ", ?(Пустаястрока(СведенияЦБСтрока), "Отсутствуют", СокрЛП(СведенияЦБСтрока)));
	//ОтказыСтрока = "";
	//Для каждого СтрО Из ТаблицаОтказов Цикл
	//    Если СтрО.Вид = "Анкета" Тогда
	// 	   ОтказыСтрока = ОтказыСтрока + ?(Пустаястрока(ОтказыСтрока), "", Символ(94) + Символ(112)) + Формат(СтрО.ДатаОтказа, "ДФ=dd.MM.yyyy") + " " + СокрЛП(СтрО.ПричинаОтказа) + " отв." + СокрЛП(СтрО.Ответственный); 
	//    КонецЕсли;	   
	//КонецЦикла;	   
	//ПараметрыПечати.Вставить("Отказы", ?(Пустаястрока(ОтказыСтрока), "Отсутствуют", СокрЛП(ОтказыСтрока)));
	//ПараметрыПечати.Вставить("УровеньРиска", СокрЛП(УровеньРиска));		
	//ПараметрыПечати.Вставить("ДатаОформления", Формат(ДатаОформленияАнкеты, "ДЛФ=DD"));
	//ПараметрыПечати.Вставить("ДатаНачалаОтношений", СокрЛП(ДатаНачалаРаботыСКлиентом)); 
	//ПараметрыПечати.Вставить("ДатаОкончанияОтношений", СокрЛП(ДатаОкончанияРаботыСКлиентом));	   
	//РезультатО = ПолучитьИсториюОбновленийАнкеты();   
	//ПараметрыПечати.Вставить("ДатыОбновлений", РезультатО.ДатыОбновлений); 
	//ПараметрыПечати.Вставить("ОтветственныйАнкета", ?(РезультатО.ОтветсвенныйАнкета = неопределено, "", СокрЛП(РезультатО.ОтветсвенныйАнкета)));
	//ПараметрыПечати.Вставить("ОтветственныйОбновление", ?(РезультатО.ОтветсвенныйОбновление = неопределено, "", СокрЛП(РезультатО.ОтветсвенныйОбновление)));
	//ПараметрыПечати.Вставить("ПроверкаПоПеречням", ПолучитьДанныеГлобальныхПроверок());
	//ПараметрыПечати.Вставить("СверкаПоПеречням", ПолучитьДанныеСверок());
	//
	//Ворд = Новый COMОбъект("Word.Application");
	//ДокументВорд = Ворд.Documents.Open(ИмяВременногоФайла); 
	// 
	// //ДокументВорд = Word.Documents.ADD(ПолныйПутьКФайлу);
	// 
	// Для Каждого КлючИЗначение Из ПараметрыПечати Цикл
	// 	Замена = ДокументВорд.Content.Find;  
	// 	ЗначениеК = СокрЛП(КлючИЗначение.Значение);
	// 	Если СтрДлина(ЗначениеК) > 255 Тогда
	// 		ЗначениеК = Лев(ЗначениеК, 255);                
	// 	КонецЕсли;	
	// 	Замена.Execute("[" + КлючИЗначение.Ключ + "]", Ложь, Истина, Ложь,,,Истина,,Ложь, ЗначениеК,2);
	// КонецЦикла;    
	// 
	// //Для Каждого КлючИЗначение Из ПараметрыПечати Цикл 
	// //	Ключ = КлючИЗначение.Ключ;                    
	// //	Если НЕ Ключ = "ПроверкаПоПеречням" И НЕ Ключ = "СверкаПоПеречням" Тогда
	// //		Продолжить;
	// //	КонецЕсли;	
	// //    ДокументВорд.Bookmarks(Ключ).Select();
	// //    ДокументВорд.Application.Selection.TypeText(СокрЛП(КлючИЗначение.Значение));
	// //КонецЦикла;
	
	// ДокументВорд.SaveAs(ИмяВременногоФайла);    
	// 
	// ДокументВорд.Close(Истина); 
	// 
	// // открываем файл
	// ЗапуститьПриложение(ИмяВременногоФайла);
	// -- Сербаев 23.05.2023
	
КонецПроцедуры	

&НаКлиенте
Процедура ПечатьАнкеты(Команда) 
	Если ЗначениеЗаполнено(Залогодатель) Тогда 
		НапечататьАнкету();
	Иначе
		Сообщить("Сохраните карточку клиента!");
	КонецЕсли;	
КонецПроцедуры	   

&НаКлиенте
Процедура ПечатьАнкетыНаДату(Команда) 
	Если НЕ ЗначениеЗаполнено(Залогодатель) Тогда
		Сообщить("Сохраните карточку клиента!");
		Возврат;
	КонецЕсли;	
	ДатаАнкеты = ТекущаяДата();
	Если НЕ ВвестиДату(ДатаАнкеты, "Дата анкеты") Тогда
		Возврат;
	КонецЕсли;     
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Залогодатель", Залогодатель);
	ПараметрыФормы.Вставить("Дата", ДатаАнкеты);
	ПараметрыФормы.Вставить("ТолькоПечатьАнкеты", истина);
	
	ОткрытьФорму("ОбщаяФорма.ЛБ_КарточкаЗалогодателя", ПараметрыФормы);
КонецПроцедуры 

&НаСервере 
Функция ПолучитьДанныеГлобальныхПроверок()
	Если НЕ ПроверкаПереченьТеррористов И НЕ ПроверкаПереченьФРОМУ И НЕ ПроверкаСписокМВК И НЕ ПроверкаПереченьООН Тогда 
		СтрокаРезультат = "Проверка проведена по Перечню террористов, Списку МВК, Перечню ФРОМУ - информация о причастности отсутствует даты проверки: ";
		Запрос = Новый Запрос;  
		Запрос.УстановитьПараметр("Дата", Дата); 
		Запрос.УстановитьПараметр("ДатаОформленияАнкеты", ДатаОформленияАнкеты);
		Запрос.Текст = "ВЫБРАТЬ
		|	ЛБ_ДатыЗагрузкиПеречней.Период КАК Период
		|ИЗ
		|	РегистрСведений.ЛБ_ДатыЗагрузкиПеречней КАК ЛБ_ДатыЗагрузкиПеречней
		|ГДЕ
		|	ЛБ_ДатыЗагрузкиПеречней.ВидПроверки = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыПроверкиПеречней.ГлобальнаяПроверка)
		|	И ЛБ_ДатыЗагрузкиПеречней.Период <= &Дата
		|	И ЛБ_ДатыЗагрузкиПеречней.Период >= &ДатаОформленияАнкеты
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";  
		ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();  
		Для каждого стр из ТаблицаЗапроса Цикл 
			Стр.Период = НачалоДня(Стр.Период);
		КонецЦикла;	 
		ТаблицаЗапроса.Свернуть("Период");
		
		Ном = 0;
		Для каждого Стр из ТаблицаЗапроса Цикл 
			СтрокаРезультат = СтрокаРезультат + ?(Ном = 0, "", ", ") + Формат(Стр.Период, "ДФ=dd.MM.yyyy");
			Ном = Ном + 1;
			Если Ном = 14 Тогда
				Прервать;
			КонецЕсли;	
		КонецЦикла;	  
		КолСтр = ТаблицаЗапроса.Количество();
		Если КолСтр >= 15 Тогда
			СтрокаРезультат = СтрокаРезультат + "... " +  Формат(ТаблицаЗапроса.Получить(КолСтр-1).Период, "ДФ=dd.MM.yyyy");
		КонецЕсли;	
		
		Возврат СтрокаРезультат; 
	Иначе      
		СтрокаРезультат = "";
		Если ПроверкаПереченьТеррористов Тогда
			СтрокаРезультат = "Присутствует в перечнях террористов. Даты проверки: "; 
			Запрос = Новый Запрос;   			
			Запрос.УстановитьПараметр("Залогодатель", Залогодатель); 
			Запрос.УстановитьПараметр("Дата", Дата);
			Запрос.Текст = "ВЫБРАТЬ
			|	ЛБ_КлиентыВПеречнях.ДатаПеречня КАК ДатаПеречня,
			|	ЛБ_КлиентыВПеречнях.Период КАК Период
			|ИЗ
			|	РегистрСведений.ЛБ_КлиентыВПеречнях КАК ЛБ_КлиентыВПеречнях
			|ГДЕ
			|	ЛБ_КлиентыВПеречнях.Залогодатель = &Залогодатель
			|	И ЛБ_КлиентыВПеречнях.ВидПеречня = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыПеречней.Террористы)
			|	И ЛБ_КлиентыВПеречнях.ВидПроверки = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыПроверкиПеречней.ГлобальнаяПроверка)
			|	И ЛБ_КлиентыВПеречнях.Период <= &Дата
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период УБЫВ";
			ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
			Для каждого стр из ТаблицаЗапроса Цикл 
				Стр.Период = НачалоДня(Стр.Период);
			КонецЦикла;	 
			ТаблицаЗапроса.Свернуть("Период, ДатаПеречня");
			
			Ном = 0;
			Для каждого Стр из ТаблицаЗапроса Цикл 
				СтрокаРезультат = СтрокаРезультат + ?(Ном = 0, "", ", ") + Формат(Стр.Период, "ДФ=dd.MM.yyyy") + " перечень от " + Формат(Стр.ДатаПеречня, "ДФ=dd.MM.yyyy");
				Ном = Ном + 1;
				Если Ном = 14 Тогда
					Прервать;
				КонецЕсли;	
			КонецЦикла;	  
			КолСтр = ТаблицаЗапроса.Количество();
			Если КолСтр >= 15 Тогда
				СтрокаРезультат = СтрокаРезультат + "... " + Формат(ТаблицаЗапроса.Получить(КолСтр-1).Период, "ДФ=dd.MM.yyyy") + " перечень от " +  Формат(ТаблицаЗапроса.Получить(КолСтр-1).ДатаПеречня, "ДФ=dd.MM.yyyy");
			КонецЕсли;	
		КонецЕсли;  
		
		Если ПроверкаСписокМВК Тогда
			//СтрокаРезультат = ?(ПустаяСтрока(СтрокаРезультат), "", Символ(94) + Символ(112)) + "Присутствует в списках МВК. Даты проверки: ";
			СтрокаРезультат = ?(ПустаяСтрока(СтрокаРезультат), "", Символы.ПС) + "Присутствует в списках МВК. Даты проверки: ";
			Запрос = Новый Запрос;   			
			Запрос.УстановитьПараметр("Залогодатель", Залогодатель); 
			Запрос.УстановитьПараметр("Дата", Дата);
			Запрос.Текст = "ВЫБРАТЬ
			|	ЛБ_КлиентыВПеречнях.ДатаПеречня КАК ДатаПеречня,
			|	ЛБ_КлиентыВПеречнях.Период КАК Период
			|ИЗ
			|	РегистрСведений.ЛБ_КлиентыВПеречнях КАК ЛБ_КлиентыВПеречнях
			|ГДЕ
			|	ЛБ_КлиентыВПеречнях.Залогодатель = &Залогодатель
			|	И ЛБ_КлиентыВПеречнях.ВидПеречня = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыПеречней.МВК)
			|	И ЛБ_КлиентыВПеречнях.ВидПроверки = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыПроверкиПеречней.ГлобальнаяПроверка)
			|	И ЛБ_КлиентыВПеречнях.Период <= &Дата
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период УБЫВ";
			ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
			Для каждого стр из ТаблицаЗапроса Цикл 
				Стр.Период = НачалоДня(Стр.Период);
			КонецЦикла;	 
			ТаблицаЗапроса.Свернуть("Период, ДатаПеречня");
			
			Ном = 0;
			Для каждого Стр из ТаблицаЗапроса Цикл 
				СтрокаРезультат = СтрокаРезультат + ?(Ном = 0, "", ", ") + Формат(Стр.Период, "ДФ=dd.MM.yyyy") + " список от " + Формат(Стр.ДатаПеречня, "ДФ=dd.MM.yyyy");
				Ном = Ном + 1;
				Если Ном = 14 Тогда
					Прервать;
				КонецЕсли;	
			КонецЦикла;	  
			КолСтр = ТаблицаЗапроса.Количество();
			Если КолСтр >= 15 Тогда
				СтрокаРезультат = СтрокаРезультат + "... " + Формат(ТаблицаЗапроса.Получить(КолСтр-1).Период, "ДФ=dd.MM.yyyy") + " перечень от " +  Формат(ТаблицаЗапроса.Получить(КолСтр-1).ДатаПеречня, "ДФ=dd.MM.yyyy");
			КонецЕсли;	
		КонецЕсли; 
		
		Если ПроверкаПереченьФРОМУ Тогда
			//СтрокаРезультат = ?(ПустаяСтрока(СтрокаРезультат), "", Символ(94) + Символ(112)) + "Присутствует в перечнях ФРОМУ. Даты проверки: ";
			СтрокаРезультат = ?(ПустаяСтрока(СтрокаРезультат), "", Символы.ПС) + "Присутствует в перечнях ФРОМУ. Даты проверки: ";
			Запрос = Новый Запрос;   			
			Запрос.УстановитьПараметр("Залогодатель", Залогодатель); 
			Запрос.УстановитьПараметр("Дата", Дата);
			Запрос.Текст = "ВЫБРАТЬ
			|	ЛБ_КлиентыВПеречнях.ДатаПеречня КАК ДатаПеречня,
			|	ЛБ_КлиентыВПеречнях.Период КАК Период
			|ИЗ
			|	РегистрСведений.ЛБ_КлиентыВПеречнях КАК ЛБ_КлиентыВПеречнях
			|ГДЕ
			|	ЛБ_КлиентыВПеречнях.Залогодатель = &Залогодатель
			|	И ЛБ_КлиентыВПеречнях.ВидПеречня = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыПеречней.ФРОМУ)
			|	И ЛБ_КлиентыВПеречнях.ВидПроверки = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыПроверкиПеречней.ГлобальнаяПроверка)
			|	И ЛБ_КлиентыВПеречнях.Период <= &Дата
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период УБЫВ";
			ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
			Для каждого стр из ТаблицаЗапроса Цикл 
				Стр.Период = НачалоДня(Стр.Период);
			КонецЦикла;	 
			ТаблицаЗапроса.Свернуть("Период, ДатаПеречня");
			
			Ном = 0;
			Для каждого Стр из ТаблицаЗапроса Цикл 
				СтрокаРезультат = СтрокаРезультат + ?(Ном = 0, "", ", ") + Формат(Стр.Период, "ДФ=dd.MM.yyyy") + " список от " + Формат(Стр.ДатаПеречня, "ДФ=dd.MM.yyyy");
				Ном = Ном + 1;
				Если Ном = 14 Тогда
					Прервать;
				КонецЕсли;	
			КонецЦикла;	  
			КолСтр = ТаблицаЗапроса.Количество();
			Если КолСтр >= 15 Тогда
				СтрокаРезультат = СтрокаРезультат + "... " + Формат(ТаблицаЗапроса.Получить(КолСтр-1).Период, "ДФ=dd.MM.yyyy") + " перечень от " +  Формат(ТаблицаЗапроса.Получить(КолСтр-1).ДатаПеречня, "ДФ=dd.MM.yyyy");
			КонецЕсли;	
		КонецЕсли;   
		
		Если ПроверкаПереченьООН Тогда
			//СтрокаРезультат = ?(ПустаяСтрока(СтрокаРезультат), "", Символ(94) + Символ(112)) + "Присутствует в перечнях ООН. Даты проверки: ";
			СтрокаРезультат = ?(ПустаяСтрока(СтрокаРезультат), "", Символы.ПС) + "Присутствует в перечнях ООН. Даты проверки: ";
			Запрос = Новый Запрос;   			
			Запрос.УстановитьПараметр("Залогодатель", Залогодатель); 
			Запрос.УстановитьПараметр("Дата", Дата);
			Запрос.Текст = "ВЫБРАТЬ
			|	ЛБ_КлиентыВПеречнях.ДатаПеречня КАК ДатаПеречня,
			|	ЛБ_КлиентыВПеречнях.Период КАК Период
			|ИЗ
			|	РегистрСведений.ЛБ_КлиентыВПеречнях КАК ЛБ_КлиентыВПеречнях
			|ГДЕ
			|	ЛБ_КлиентыВПеречнях.Залогодатель = &Залогодатель
			|	И ЛБ_КлиентыВПеречнях.ВидПеречня = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыПеречней.ООН)
			|	И ЛБ_КлиентыВПеречнях.ВидПроверки = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыПроверкиПеречней.ГлобальнаяПроверка)
			|	И ЛБ_КлиентыВПеречнях.Период <= &Дата
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период УБЫВ";
			ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
			Для каждого стр из ТаблицаЗапроса Цикл 
				Стр.Период = НачалоДня(Стр.Период);
			КонецЦикла;	 
			ТаблицаЗапроса.Свернуть("Период, ДатаПеречня");
			
			Ном = 0;
			Для каждого Стр из ТаблицаЗапроса Цикл 
				СтрокаРезультат = СтрокаРезультат + ?(Ном = 0, "", ", ") + Формат(Стр.Период, "ДФ=dd.MM.yyyy") + " список от " + Формат(Стр.ДатаПеречня, "ДФ=dd.MM.yyyy");
				Ном = Ном + 1;
				Если Ном = 14 Тогда
					Прервать;
				КонецЕсли;	
			КонецЦикла;	  
			КолСтр = ТаблицаЗапроса.Количество();
			Если КолСтр >= 15 Тогда
				СтрокаРезультат = СтрокаРезультат + "... " + Формат(ТаблицаЗапроса.Получить(КолСтр-1).Период, "ДФ=dd.MM.yyyy") + " перечень от " +  Формат(ТаблицаЗапроса.Получить(КолСтр-1).ДатаПеречня, "ДФ=dd.MM.yyyy");
			КонецЕсли;	
		КонецЕсли;   		
		
		Возврат СтрокаРезультат;
	КонецЕсли;	
КонецФункции

&НаСервере 
Функция ПолучитьДанныеСверок()
	Если НЕ ПроверкаПереченьТеррористов И НЕ ПроверкаПереченьФРОМУ И НЕ ПроверкаСписокМВК  И НЕ ПроверкаПереченьООН Тогда 
		СтрокаРезультат = "Информация о причастности отсутствует: даты проверки.";
		Запрос = Новый Запрос; 
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("ДатаОформленияАнкеты", ДатаОформленияАнкеты);
		Запрос.Текст = "ВЫБРАТЬ
		|	ЛБ_ДатыЗагрузкиПеречней.ВидПеречня КАК ВидПеречня,
		|	ЛБ_ДатыЗагрузкиПеречней.ДатаПеречня КАК ДатаПеречня
		|ИЗ
		|	РегистрСведений.ЛБ_ДатыЗагрузкиПеречней КАК ЛБ_ДатыЗагрузкиПеречней
		|ГДЕ
		|	ЛБ_ДатыЗагрузкиПеречней.ВидПроверки = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыПроверкиПеречней.ПроверкаПоПеречню)
		|	И ЛБ_ДатыЗагрузкиПеречней.Период <= &Дата
		|	И ЛБ_ДатыЗагрузкиПеречней.Период >= &ДатаОформленияАнкеты
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПеречня УБЫВ";  
		ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();  
		
		Отбор = Новый Структура;
		Отбор.Вставить("ВидПеречня", Перечисления.ЛБ_ВидыПеречней.Террористы);
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор); 
		
		Если НЕ Строки.Количество() = 0 Тогда
			Ном = 0;   
			//СтрокаРезультат = СтрокаРезультат + Символ(94) + Символ(112) + "Проверка по перечням террористов: ";
			СтрокаРезультат = СтрокаРезультат + Символы.ПС + "Проверка по перечням террористов: ";
			Для каждого Стр из Строки Цикл 
				СтрокаРезультат = СтрокаРезультат + ?(Ном = 0, "", ", ") + Формат(Стр.ДатаПеречня, "ДФ=dd.MM.yyyy");
				Ном = Ном + 1;
				Если Ном = 14 Тогда
					Прервать;
				КонецЕсли;	
			КонецЦикла;	  
			КолСтр = Строки.Количество();
			Если КолСтр >= 15 Тогда
				СтрокаРезультат = СтрокаРезультат + "... " +  Формат(Строки.Получить(КолСтр-1).ДатаПеречня, "ДФ=dd.MM.yyyy");
			КонецЕсли;
		КонецЕсли;	
		
		Отбор = Новый Структура;
		Отбор.Вставить("ВидПеречня", Перечисления.ЛБ_ВидыПеречней.МВК);
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор); 
		
		Если НЕ Строки.Количество() = 0 Тогда
			Ном = 0;   
			//СтрокаРезультат = СтрокаРезультат + Символ(94) + Символ(112) + "Проверка по списку МВК: ";
			СтрокаРезультат = СтрокаРезультат + Символы.ПС + "Проверка по списку МВК: ";
			Для каждого Стр из Строки Цикл 
				СтрокаРезультат = СтрокаРезультат + ?(Ном = 0, "", ", ") + Формат(Стр.ДатаПеречня, "ДФ=dd.MM.yyyy");
				Ном = Ном + 1;
				Если Ном = 14 Тогда
					Прервать;
				КонецЕсли;	
			КонецЦикла;	  
			КолСтр = Строки.Количество();
			Если КолСтр >= 15 Тогда
				СтрокаРезультат = СтрокаРезультат + "... " +  Формат(Строки.Получить(КолСтр-1).ДатаПеречня, "ДФ=dd.MM.yyyy");
			КонецЕсли;
		КонецЕсли;	
		
		Отбор = Новый Структура;
		Отбор.Вставить("ВидПеречня", Перечисления.ЛБ_ВидыПеречней.ФРОМУ);
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор); 
		
		Если НЕ Строки.Количество() = 0 Тогда
			Ном = 0;   
			//СтрокаРезультат = СтрокаРезультат + Символ(94) + Символ(112) + "Проверка по перечням ФРОМУ: ";
			СтрокаРезультат = СтрокаРезультат + Символы.ПС + "Проверка по перечням ФРОМУ: ";
			Для каждого Стр из Строки Цикл 
				СтрокаРезультат = СтрокаРезультат + ?(Ном = 0, "", ", ") + Формат(Стр.ДатаПеречня, "ДФ=dd.MM.yyyy");
				Ном = Ном + 1;
				Если Ном = 14 Тогда
					Прервать;
				КонецЕсли;	
			КонецЦикла;	  
			КолСтр = Строки.Количество();
			Если КолСтр >= 15 Тогда
				СтрокаРезультат = СтрокаРезультат + "... " +  Формат(Строки.Получить(КолСтр-1).ДатаПеречня, "ДФ=dd.MM.yyyy");
			КонецЕсли;
		КонецЕсли;	
		
		Отбор = Новый Структура;
		Отбор.Вставить("ВидПеречня", Перечисления.ЛБ_ВидыПеречней.ООН);
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор); 
		
		Если НЕ Строки.Количество() = 0 Тогда
			Ном = 0;   
			//СтрокаРезультат = СтрокаРезультат + Символ(94) + Символ(112) + "Проверка по перечням ФРОМУ: ";
			СтрокаРезультат = СтрокаРезультат + Символы.ПС + "Проверка по перечням ООН: ";
			Для каждого Стр из Строки Цикл 
				СтрокаРезультат = СтрокаРезультат + ?(Ном = 0, "", ", ") + Формат(Стр.ДатаПеречня, "ДФ=dd.MM.yyyy");
				Ном = Ном + 1;
				Если Ном = 14 Тогда
					Прервать;
				КонецЕсли;	
			КонецЦикла;	  
			КолСтр = Строки.Количество();
			Если КолСтр >= 15 Тогда
				СтрокаРезультат = СтрокаРезультат + "... " +  Формат(Строки.Получить(КолСтр-1).ДатаПеречня, "ДФ=dd.MM.yyyy");
			КонецЕсли;
		КонецЕсли;	
		
		
		Запрос.УстановитьПараметр("Залогодатель", Залогодатель); 
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.Текст = "ВЫБРАТЬ
		|	ЛБ_ДатыОбновленияАнкеты.Период КАК Период
		|ИЗ
		|	РегистрСведений.ЛБ_ДатыОбновленияАнкеты КАК ЛБ_ДатыОбновленияАнкеты
		|ГДЕ
		|	ЛБ_ДатыОбновленияАнкеты.Залогодатель = &Залогодатель
		|	И ЛБ_ДатыОбновленияАнкеты.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
		|	И ЛБ_ДатыОбновленияАнкеты.Период <= &Дата
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
		ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
		Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
			//СтрокаРезультат = СтрокаРезультат + Символ(94) + Символ(112) + "Проверка по принятым билетам: ";
			СтрокаРезультат = СтрокаРезультат + Символы.ПС + "Проверка по принятым билетам: ";
			Ном = 0;
			Для каждого Стр из ТаблицаЗапроса Цикл 
				СтрокаРезультат = СтрокаРезультат + ?(Ном = 0, "", ", ") + Формат(Стр.Период, "ДФ=dd.MM.yyyy");
				Ном = Ном + 1;			
			КонецЦикла;	  
		КонецЕсли;	
		Возврат СтрокаРезультат;  
	Иначе
		СтрокаРезультат = "";
		Если ПроверкаПереченьТеррористов Тогда
			СтрокаРезультат = "Присутствует в перечнях террористов. Даты проверки: "; 
			Запрос = Новый Запрос;   			
			Запрос.УстановитьПараметр("Залогодатель", Залогодатель); 
			Запрос.УстановитьПараметр("Дата", Дата);
			Запрос.Текст = "ВЫБРАТЬ
			|	ЛБ_КлиентыВПеречнях.ДатаПеречня КАК ДатаПеречня,
			|	ЛБ_КлиентыВПеречнях.Период КАК Период
			|ИЗ
			|	РегистрСведений.ЛБ_КлиентыВПеречнях КАК ЛБ_КлиентыВПеречнях
			|ГДЕ
			|	ЛБ_КлиентыВПеречнях.Залогодатель = &Залогодатель
			|	И ЛБ_КлиентыВПеречнях.ВидПеречня = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыПеречней.Террористы)
			|	И ЛБ_КлиентыВПеречнях.ВидПроверки = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыПроверкиПеречней.ПроверкаПоПеречню)
			|	И ЛБ_КлиентыВПеречнях.Период <= &Дата
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период УБЫВ";
			ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
			Для каждого стр из ТаблицаЗапроса Цикл 
				Стр.Период = НачалоДня(Стр.Период);
			КонецЦикла;	 
			ТаблицаЗапроса.Свернуть("Период, ДатаПеречня");
			
			Ном = 0;
			Для каждого Стр из ТаблицаЗапроса Цикл 
				СтрокаРезультат = СтрокаРезультат + ?(Ном = 0, "", ", ") + Формат(Стр.Период, "ДФ=dd.MM.yyyy") + " перечень от " + Формат(Стр.ДатаПеречня, "ДФ=dd.MM.yyyy");
				Ном = Ном + 1;
				Если Ном = 14 Тогда
					Прервать;
				КонецЕсли;	
			КонецЦикла;	  
			КолСтр = ТаблицаЗапроса.Количество();
			Если КолСтр >= 15 Тогда
				СтрокаРезультат = СтрокаРезультат + "... " + Формат(ТаблицаЗапроса.Получить(КолСтр-1).Период, "ДФ=dd.MM.yyyy") + " перечень от " +  Формат(ТаблицаЗапроса.Получить(КолСтр-1).ДатаПеречня, "ДФ=dd.MM.yyyy");
			КонецЕсли;	
		КонецЕсли;  
		
		Если ПроверкаСписокМВК Тогда
			//СтрокаРезультат = ?(ПустаяСтрока(СтрокаРезультат), "", Символ(94) + Символ(112)) + "Присутствует в списках МВК. Даты проверки: ";
			СтрокаРезультат = ?(ПустаяСтрока(СтрокаРезультат), "", Символы.ПС) + "Присутствует в списках МВК. Даты проверки: ";
			Запрос = Новый Запрос;   			
			Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
			Запрос.УстановитьПараметр("Дата", Дата);
			Запрос.Текст = "ВЫБРАТЬ
			|	ЛБ_КлиентыВПеречнях.ДатаПеречня КАК ДатаПеречня,
			|	ЛБ_КлиентыВПеречнях.Период КАК Период
			|ИЗ
			|	РегистрСведений.ЛБ_КлиентыВПеречнях КАК ЛБ_КлиентыВПеречнях
			|ГДЕ
			|	ЛБ_КлиентыВПеречнях.Залогодатель = &Залогодатель
			|	И ЛБ_КлиентыВПеречнях.ВидПеречня = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыПеречней.МВК)
			|	И ЛБ_КлиентыВПеречнях.ВидПроверки = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыПроверкиПеречней.ПроверкаПоПеречню)
			|	И ЛБ_КлиентыВПеречнях.Период <= &Дата
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период УБЫВ";
			ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
			Для каждого стр из ТаблицаЗапроса Цикл 
				Стр.Период = НачалоДня(Стр.Период);
			КонецЦикла;	 
			ТаблицаЗапроса.Свернуть("Период, ДатаПеречня");
			
			Ном = 0;
			Для каждого Стр из ТаблицаЗапроса Цикл 
				СтрокаРезультат = СтрокаРезультат + ?(Ном = 0, "", ", ") + Формат(Стр.Период, "ДФ=dd.MM.yyyy") + " список от " + Формат(Стр.ДатаПеречня, "ДФ=dd.MM.yyyy");
				Ном = Ном + 1;
				Если Ном = 14 Тогда
					Прервать;
				КонецЕсли;	
			КонецЦикла;	  
			КолСтр = ТаблицаЗапроса.Количество();
			Если КолСтр >= 15 Тогда
				СтрокаРезультат = СтрокаРезультат + "... " + Формат(ТаблицаЗапроса.Получить(КолСтр-1).Период, "ДФ=dd.MM.yyyy") + " перечень от " +  Формат(ТаблицаЗапроса.Получить(КолСтр-1).ДатаПеречня, "ДФ=dd.MM.yyyy");
			КонецЕсли;	
		КонецЕсли; 
		
		Если ПроверкаПереченьФРОМУ Тогда
			//СтрокаРезультат = ?(ПустаяСтрока(СтрокаРезультат), "", Символ(94) + Символ(112)) + "Присутствует в перечнях ФРОМУ. Даты проверки: ";
			СтрокаРезультат = ?(ПустаяСтрока(СтрокаРезультат), "", Символы.ПС) + "Присутствует в перечнях ФРОМУ. Даты проверки: ";
			Запрос = Новый Запрос;   			
			Запрос.УстановитьПараметр("Залогодатель", Залогодатель); 
			Запрос.УстановитьПараметр("Дата", Дата);
			Запрос.Текст = "ВЫБРАТЬ
			|	ЛБ_КлиентыВПеречнях.ДатаПеречня КАК ДатаПеречня,
			|	ЛБ_КлиентыВПеречнях.Период КАК Период
			|ИЗ
			|	РегистрСведений.ЛБ_КлиентыВПеречнях КАК ЛБ_КлиентыВПеречнях
			|ГДЕ
			|	ЛБ_КлиентыВПеречнях.Залогодатель = &Залогодатель
			|	И ЛБ_КлиентыВПеречнях.ВидПеречня = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыПеречней.ФРОМУ)
			|	И ЛБ_КлиентыВПеречнях.ВидПроверки = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыПроверкиПеречней.ПроверкаПоПеречню)
			|	И ЛБ_КлиентыВПеречнях.Период <= &Дата
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период УБЫВ";
			ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
			Для каждого стр из ТаблицаЗапроса Цикл 
				Стр.Период = НачалоДня(Стр.Период);
			КонецЦикла;	 
			ТаблицаЗапроса.Свернуть("Период, ДатаПеречня");
			
			Ном = 0;
			Для каждого Стр из ТаблицаЗапроса Цикл 
				СтрокаРезультат = СтрокаРезультат + ?(Ном = 0, "", ", ") + Формат(Стр.Период, "ДФ=dd.MM.yyyy") + " список от " + Формат(Стр.ДатаПеречня, "ДФ=dd.MM.yyyy");
				Ном = Ном + 1;
				Если Ном = 14 Тогда
					Прервать;
				КонецЕсли;	
			КонецЦикла;	  
			КолСтр = ТаблицаЗапроса.Количество();
			Если КолСтр >= 15 Тогда
				СтрокаРезультат = СтрокаРезультат + "... " + Формат(ТаблицаЗапроса.Получить(КолСтр-1).Период, "ДФ=dd.MM.yyyy") + " перечень от " +  Формат(ТаблицаЗапроса.Получить(КолСтр-1).ДатаПеречня, "ДФ=dd.MM.yyyy");
			КонецЕсли;	
		КонецЕсли;   
		
		Если ПроверкаПереченьООН Тогда
			//СтрокаРезультат = ?(ПустаяСтрока(СтрокаРезультат), "", Символ(94) + Символ(112)) + "Присутствует в перечнях ООН. Даты проверки: ";
			СтрокаРезультат = ?(ПустаяСтрока(СтрокаРезультат), "", Символы.ПС) + "Присутствует в перечнях ООН. Даты проверки: ";
			Запрос = Новый Запрос;   			
			Запрос.УстановитьПараметр("Залогодатель", Залогодатель); 
			Запрос.УстановитьПараметр("Дата", Дата);
			Запрос.Текст = "ВЫБРАТЬ
			|	ЛБ_КлиентыВПеречнях.ДатаПеречня КАК ДатаПеречня,
			|	ЛБ_КлиентыВПеречнях.Период КАК Период
			|ИЗ
			|	РегистрСведений.ЛБ_КлиентыВПеречнях КАК ЛБ_КлиентыВПеречнях
			|ГДЕ
			|	ЛБ_КлиентыВПеречнях.Залогодатель = &Залогодатель
			|	И ЛБ_КлиентыВПеречнях.ВидПеречня = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыПеречней.ООН)
			|	И ЛБ_КлиентыВПеречнях.ВидПроверки = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыПроверкиПеречней.ПроверкаПоПеречню)
			|	И ЛБ_КлиентыВПеречнях.Период <= &Дата
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период УБЫВ";
			ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
			Для каждого стр из ТаблицаЗапроса Цикл 
				Стр.Период = НачалоДня(Стр.Период);
			КонецЦикла;	 
			ТаблицаЗапроса.Свернуть("Период, ДатаПеречня");
			
			Ном = 0;
			Для каждого Стр из ТаблицаЗапроса Цикл 
				СтрокаРезультат = СтрокаРезультат + ?(Ном = 0, "", ", ") + Формат(Стр.Период, "ДФ=dd.MM.yyyy") + " список от " + Формат(Стр.ДатаПеречня, "ДФ=dd.MM.yyyy");
				Ном = Ном + 1;
				Если Ном = 14 Тогда
					Прервать;
				КонецЕсли;	
			КонецЦикла;	  
			КолСтр = ТаблицаЗапроса.Количество();
			Если КолСтр >= 15 Тогда
				СтрокаРезультат = СтрокаРезультат + "... " + Формат(ТаблицаЗапроса.Получить(КолСтр-1).Период, "ДФ=dd.MM.yyyy") + " перечень от " +  Формат(ТаблицаЗапроса.Получить(КолСтр-1).ДатаПеречня, "ДФ=dd.MM.yyyy");
			КонецЕсли;	
		КонецЕсли;   		
		
		Возврат СтрокаРезультат;
	КонецЕсли;	
КонецФункции

&НаСервере
Функция СохранитьФайлНаСервере()
	СтандартДокумента = ПредопределенноеЗначение("Справочник.ЛБ_ШаблоныПечатиДокументов.Анкета");
	Если НЕ ТипЗнч(СтандартДокумента.ХранилищеШаблона.Получить()) = Тип("ДвоичныеДанные") Тогда
		Сообщить("Шаблон печати анкеты не загружен!");
		Возврат неопределено;
	КонецЕсли;
	
	//Shell = Новый COMОбъект("WScript.Shell");
	//temp = Shell.ExpandEnvironmentStrings("%temp%");
	//Каталог = temp + "\";//КаталогВременныхФайлов();//Константы.ЛБ_КаталогВременныхФайлов.Получить();
	//Если ПустаяСтрока(Каталог) Тогда
	//	Сообщить("Не выбрана каталог временных файлов");
	//	Возврат неопределено;
	//КонецЕсли;
	//ИмяФайла = СокрЛП(Залогодатель.Код) + "_" + Формат(ТекущаяДата(), "ДФ=dd-MM-yyyy");
	//ИмяФайла = СтрЗаменить(ИмяФайла, "\", "-");
	//ИмяФайла = СтрЗаменить(ИмяФайла, "/", "-");
	//ПолноеИмяФайла = Каталог + ИмяФайла + ".doc";
	
	ДД = СтандартДокумента.ХранилищеШаблона.Получить();
	//ДД.Записать(ПолноеИмяФайла);
	
	Возврат ДД;
	
КонецФункции

&НаСервере
Функция ПолучитьИДКлиентаВПеречне(ВидПеречня)
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);  
	Запрос.УстановитьПараметр("ВидПеречня", ВидПеречня);
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_КлиентыВПеречнях.ИД КАК ИД
	|ИЗ
	|	РегистрСведений.ЛБ_КлиентыВПеречнях КАК ЛБ_КлиентыВПеречнях
	|ГДЕ
	|	ЛБ_КлиентыВПеречнях.Залогодатель = &Залогодатель
	|	И ЛБ_КлиентыВПеречнях.ВидПеречня = &ВидПеречня
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛБ_КлиентыВПеречнях.Период УБЫВ";  
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда    
		Возврат Выборка.ИД;
	КонецЕсли;	           
	Возврат "";
КонецФункции	

&НаКлиенте
Процедура ОтчетТеррористы(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Клиент", Залогодатель); 
	ПараметрыФормы.Вставить("ВидПеречня", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПеречней.Террористы"));
	ПараметрыФормы.Вставить("ИД", ПолучитьИДКлиентаВПеречне(ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПеречней.Террористы")));
	ОткрытьФорму("Отчет.ЛБ_ОтчетКлиентВПеречне.Форма.ФормаОтчета", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетМВК(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Клиент", Залогодатель); 
	ПараметрыФормы.Вставить("ВидПеречня", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПеречней.МВК"));
	ПараметрыФормы.Вставить("ИД", ПолучитьИДКлиентаВПеречне(ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПеречней.МВК")));
	ОткрытьФорму("Отчет.ЛБ_ОтчетКлиентВПеречне.Форма.ФормаОтчета", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетФРОМУ(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Клиент", Залогодатель); 
	ПараметрыФормы.Вставить("ВидПеречня", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПеречней.ФРОМУ"));
	ПараметрыФормы.Вставить("ИД", ПолучитьИДКлиентаВПеречне(ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПеречней.ФРОМУ")));
	ОткрытьФорму("Отчет.ЛБ_ОтчетКлиентВПеречне.Форма.ФормаОтчета", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры  

&НаКлиенте
Процедура ОтчетООН(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Клиент", Залогодатель); 
	ПараметрыФормы.Вставить("ВидПеречня", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПеречней.ООН"));
	ПараметрыФормы.Вставить("ИД", ПолучитьИДКлиентаВПеречне(ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПеречней.ООН")));
	ОткрытьФорму("Отчет.ЛБ_ОтчетКлиентВПеречне.Форма.ФормаОтчета", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияТеррористыНажатие(Элемент)
	ПараметрыФормы = Новый Структура; 
	ПараметрыФормы.Вставить("ВидПеречня", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПеречней.Террористы"));  
	ПараметрыФормы.Вставить("ДатаПроверки", Дата);
	ПараметрыФормы.Вставить("Клиент", Залогодатель);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаИсторииОбновленияПеречней", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияМВКНажатие(Элемент)
	ПараметрыФормы = Новый Структура; 
	ПараметрыФормы.Вставить("ВидПеречня", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПеречней.МВК"));
	ПараметрыФормы.Вставить("ДатаПроверки", Дата);
	ПараметрыФормы.Вставить("Клиент", Залогодатель);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаИсторииОбновленияПеречней", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияФромуНажатие(Элемент)
	ПараметрыФормы = Новый Структура; 
	ПараметрыФормы.Вставить("ВидПеречня", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПеречней.ФРОМУ"));   
	ПараметрыФормы.Вставить("ДатаПроверки", Дата);
	ПараметрыФормы.Вставить("Клиент", Залогодатель);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаИсторииОбновленияПеречней", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияООННажатие(Элемент)
	ПараметрыФормы = Новый Структура; 
	ПараметрыФормы.Вставить("ВидПеречня", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПеречней.ООН"));   
	ПараметрыФормы.Вставить("ДатаПроверки", Дата);
	ПараметрыФормы.Вставить("Клиент", Залогодатель);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаИсторииОбновленияПеречней", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура СписокДопСтатусовПередНачаломИзменения(Элемент, Отказ) 
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСлужебныхСтатусовИспользуетсяПриИзменении(Элемент) 
	ТекСтрока = Элементы.ТаблицаСлужебныхСтатусов.ТекущиеДанные;
	Если  ТекСтрока.Используется Тогда
		Для каждого Стр Из ТаблицаСлужебныхСтатусов цикл 
			Если Стр.Используется И НЕ (Стр.Статус = ТекСтрока.Статус) Тогда
				Стр.Используется = Ложь;
			КонецЕсли;	
		КонецЦикла; 
	Иначе
		ТекСтрока.Комментарий = "";
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТелефонИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Если СокрЛП(Текст) = "+7 (   )" Тогда
		Возврат;
	КонецЕсли;	
	СтандартнаяОбработка = ложь; 
	ПерваяЦифра = Сред(Текст, 5, 1);
	Если НЕ Перваяцифра = "9" Тогда 
		Телефон = Сред(Текст, 1, 4) + "9" + Сред(Текст, 6);
		ТекстСообщения = "Телефон должен начинаться с 9 и содержать 10 цифр"; 
		Предупреждение(ТекстСообщения, 10);
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ТелефонПриИзменении(Элемент)  	  
	//+МАН 15.12.25 Добавлены условия
	Если СтрДлина(Элемент.Маска) = СтрДлина(СокрЛП(Элемент.ТекстРедактирования))
		И СокрЛП(Элемент.ТекстРедактирования) <> "+7 (   )" Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросСМСРассылки", ЭтаФорма); 
		ПоказатьВопрос(Оповещение, "На указанный номер будут приходить СМС оповещения об окончании льготного срока",
		РежимДиалогаВопрос.ОК, 0,,"Проинформируйте клиента:");
	ИначеЕсли СокрЛП(Элемент.ТекстРедактирования) = "+7 (   )" Тогда
		СогласиеНаСМСРассылку = Ложь;
	КонецЕсли;
	
	//Было:
	//Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросСМСРассылки", ЭтаФорма); 
	//ПоказатьВопрос(Оповещение, "На указанный номер будут приходить СМС оповещения об окончании льготного срока",
	//РежимДиалогаВопрос.ОК, 0,,"Проинформируйте клиента:");
	//-МАН
КонецПроцедуры

//+МАН 15.12.25
&НаКлиенте
Процедура ТелефонОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)

	Если СокрЛП(Текст) = "+7 (   )" Тогда
		Возврат;
	КонецЕсли;

	СтруктураПроверки = ПроверитьМобильныйТелефон(Текст);
	
	Если СтруктураПроверки.ТолькоНули Тогда
		Предупреждение("Телефон клиента не может содержать только нули!");
		ПодключитьОбработчикОжидания("ВернутьКурсорНаПолеВвода", 0.1, Истина);
	КонецЕсли;
	
	Если НЕ СтруктураПроверки.ТелефонОК Тогда
		Предупреждение("Телефон должен начинаться с 9 и содержать 10 цифр. Введите корректное значение или очистите поле.");
		ПодключитьОбработчикОжидания("ВернутьКурсорНаПолеВвода", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьКурсорНаПолеВвода()
	ЭтотОбъект.ТекущийЭлемент = ЭтотОбъект.Элементы.Телефон;
	СогласиеНаСМСРассылку = Ложь;
КонецПроцедуры	
//-МАН

&НаКлиенте
Процедура ПослеОтветаНаВопросСМСРассылки(Результат, Параметры) Экспорт  
	СогласиеНаСМСРассылку = ?(Результат = КодВозвратаДиалога.ОК, Истина, ложь);
КонецПроцедуры

&НаСервере 
Процедура ОчиститьСотрудниковВРегистреСоответствия()
	НаборЗаписей = РегистрыСведений.ЛБ_СоответствиеКлиентовИСотрудниковОрганизации.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Клиент.Установить(Залогодатель);
	НаборЗаписей.Записать(); 
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДопСтатусовФлВклПриИзменении(Элемент)
	ТекСтрокаДоп = Элементы.ТаблицаДопСтатусов.ТекущиеДанные;
	Если НЕ ТекСтрокаДоп.Используется Тогда 
		ТекСтрокаДоп.СрокДействия = Дата(1,1,1); 
		ТекСтрокаДоп.Комментарий = ""; 
		
		Если ТекСтрокаДоп.Статус = ПредопределенноеЗначение("Справочник.ЛБ_СтатусыЗалогодателей.Сотрудник") Тогда 
			ОчиститьСотрудниковВРегистреСоответствия();
		КонецЕсли;	
	ИначеЕсли ТекСтрокаДоп.Статус = ПредопределенноеЗначение("Справочник.ЛБ_СтатусыЗалогодателей.Сотрудник") Тогда	
		Если НЕ ЭтоНовыйКлиент Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Клиент", Залогодатель); 
			ПараметрыФормы.Вставить("ТолькоПросмотр", Ложь);
			Оповещение = Новый ОписаниеОповещения("ПослеВыбораСотрудников", ЭтаФорма);
			ОткрытьФорму("ОбщаяФорма.ЛБ_ВыборСтрудниковДляСтатусаСотрудник", ПараметрыФормы,,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
		Иначе   
			Предупреждение("Выбор сотрудников возможен только после сохранения карточки клиента.", 60);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры  

&НаСервере
Функция ПолучитьСписокСотрудников() 
	ТекстСотрудники = "";
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Клиент", Залогодатель);
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_СоответствиеКлиентовИСотрудниковОрганизации.Сотрудник КАК Сотрудник
	|ИЗ
	|	РегистрСведений.ЛБ_СоответствиеКлиентовИСотрудниковОрганизации КАК ЛБ_СоответствиеКлиентовИСотрудниковОрганизации
	|ГДЕ
	|	ЛБ_СоответствиеКлиентовИСотрудниковОрганизации.Клиент = &Клиент";
	Выборка = Запрос.Выполнить().Выбрать();  
	Пока Выборка.Следующий() Цикл
		ТекстСотрудники = ТекстСотрудники + ?(ПустаяСтрока(ТекстСотрудники), "", "; ") + СокрЛП(Выборка.Сотрудник);
	КонецЦикла;                                                                          
	Возврат ТекстСотрудники;
КонецФункции

&НаКлиенте
Процедура ПослеВыбораСотрудников(Результат, ДопПараметры) Экспорт  
	ТекСтрокаДоп = Элементы.ТаблицаДопСтатусов.ТекущиеДанные;
	ТекСтрокаДоп.Комментарий = ПолучитьСписокСотрудников();	
КонецПроцедуры

&НаКлиенте
Процедура СтатистикаПоКлиенту(Команда) 
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.Залогодатель) Тогда
		Возврат;
	КонецЕсли;	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Клиент", Залогодатель);
	ПараметрыФормы.Вставить("Дата", Дата);	 
	
	ОткрытьФорму("Отчет.ЛБ_СтатистикаОбращенийКлиента.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
КонецПроцедуры

&НаКлиенте
Процедура ПрисоединитьСкан(Команда)
	ТекСтрока = Элементы.Документы.ТекущиеДанные;  
	Если ЗначениеЗаполнено(ТекСтрока.ДокументСсылка) тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВладелецФайла",  ТекСтрока.ДокументСсылка);
		ПараметрыФормы.Вставить("ТолькоПросмотр", ложь);
		
		ОткрытьФорму("Обработка.РаботаСФайлами.Форма.ПрисоединенныеФайлы", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.Независимый);
	Иначе
		Сообщить("Документ не сохранен!", СтатусСообщения.Информация);
	КонецЕсли;	
КонецПроцедуры

//+Мельников 14.10.24 ВИП. Заявка 2792
&НаКлиенте
Процедура ТаблицаДопСтатусовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные.Статус = ПредопределенноеЗначение("Справочник.ЛБ_СтатусыЗалогодателей.VIP") Тогда
		//+МАН 11.11.24 Убрал проверку есть статус ВИП или нет, чтобы можно было смотреть историю. Заявка 2792
		//Элемент.ТекущиеДанные.Используется
		//-МАН
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Залогодатель", Залогодатель);
		
		ОткрытьФорму("ОбщаяФорма.ЛБ_ИнформацияВИП", ПараметрыФормы,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ИначеЕсли Элемент.ТекущиеДанные.Статус = ПредопределенноеЗначение("Справочник.ЛБ_СтатусыЗалогодателей.Сотрудник") Тогда
		Если Элемент.ТекущиеДанные.Используется Тогда 
			
			Если ЗначениеЗаполнено(Залогодатель) Тогда
				ПараметрыФормы = Новый Структура;
				ПараметрыФормы.Вставить("Клиент", Залогодатель); 				
				
				Если Элементы.ТаблицаДопСтатусов.ТолькоПросмотр ИЛИ НЕ СотрудникЦО Тогда  
					ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
					ОткрытьФорму("ОбщаяФорма.ЛБ_ВыборСтрудниковДляСтатусаСотрудник", ПараметрыФормы,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
				Иначе                    
					ПараметрыФормы.Вставить("ТолькоПросмотр", Ложь);
					Оповещение = Новый ОписаниеОповещения("ПослеВыбораСотрудников", ЭтаФорма);
					ОткрытьФорму("ОбщаяФорма.ЛБ_ВыборСтрудниковДляСтатусаСотрудник", ПараметрыФормы,,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
				КонецЕсли;	 
			Иначе 
				Предупреждение("Выбор сотрудников возможен только после сохранения карточки клиента.", 60);
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьСтатусКлиентаВИП(Дата, Залогодатель)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	
	Запрос.Текст = 
	//+МАН 02.11.24 Изменил запрос.
	//	"ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК Регистратор,
	//	|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	//	|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор.Комментарий КАК Комментарий
	//	|ИЗ
	//	|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
	//	|ГДЕ
	//	|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель = &Залогодатель
	//	|	И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период УБЫВ";
	//
	//РезультатСтавка = Запрос.Выполнить().Выгрузить();
	//
	//Запрос.Текст = 
	//	"ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор КАК Регистратор,
	//	|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	//	|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор.Комментарий КАК Комментарий
	//	|ИЗ
	//	|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
	//	|ГДЕ
	//	|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель = &Залогодатель
	//	|	И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период УБЫВ";
	//
	//РезультатМеталл = Запрос.Выполнить().Выгрузить();
	
	//Запрос.Текст = 
	//	"ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор КАК Регистратор,
	//	|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	//	|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор.Комментарий КАК Комментарий
	//	|ИЗ
	//	|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
	//	|ГДЕ
	//	|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель = &Залогодатель
	//	|	И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период УБЫВ";
	//
	//РезультатВставка = Запрос.Выполнить().Выгрузить();
	//
	//ПромежуточнаяТЗ = Новый ТаблицаЗначений;
	//ПромежуточнаяТЗ.Колонки.Добавить("Регистратор");
	//ПромежуточнаяТЗ.Колонки.Добавить("ДатаОкончанияДействия");
	//ПромежуточнаяТЗ.Колонки.Добавить("Комментарий");
	//
	//Если РезультатСтавка.Количество() > 0 Тогда
	//	Для каждого Стр Из РезультатСтавка Цикл
	//		НоваяСтрока = ПромежуточнаяТЗ.Добавить();
	//		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
	//	КонецЦикла;
	//КонецЕсли;
	//
	//Если РезультатМеталл.Количество() > 0 Тогда
	//	Для каждого Стр Из РезультатМеталл Цикл
	//		НоваяСтрока = ПромежуточнаяТЗ.Добавить();
	//		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
	//	КонецЦикла;
	//КонецЕсли;
	
	//Если РезультатВставка.Количество() > 0 Тогда
	//	Для каждого Стр Из РезультатВставка Цикл
	//		НоваяСтрока = ПромежуточнаяТЗ.Добавить();
	//		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
	//	КонецЦикла;
	//КонецЕсли;
	
	//ПромежуточнаяТЗ.Сортировать("ДатаОкончанияДействия Убыв");
	
	//"ВЫБРАТЬ
	//|	НастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК Регистратор,
	//|	НастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	//|	НастройкаПрейскурантаПроцентныхСтавок.Комментарий КАК Комментарий,
	//|	НастройкаПрейскурантаПроцентныхСтавок.Период КАК Период
	//|ИЗ
	//|	(ВЫБРАТЬ ПЕРВЫЕ 1
	//|		ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК Регистратор,
	//|		ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	//|		ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор.Комментарий КАК Комментарий,
	//|		ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период КАК Период
	//|	ИЗ
	//|		РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
	//|	ГДЕ
	//|		ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель = &Залогодатель
	//|		И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
	//|	
	//|	УПОРЯДОЧИТЬ ПО
	//|		ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период УБЫВ) КАК НастройкаПрейскурантаПроцентныхСтавок
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	НастройкаРасчетаОценкиЗалога.Регистратор,
	//|	НастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия,
	//|	НастройкаРасчетаОценкиЗалога.Комментарий,
	//|	НастройкаРасчетаОценкиЗалога.Период
	//|ИЗ
	//|	(ВЫБРАТЬ ПЕРВЫЕ 1
	//|		ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор КАК Регистратор,
	//|		ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	//|		ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор.Комментарий КАК Комментарий,
	//|		ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период КАК Период
	//|	ИЗ
	//|		РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
	//|	ГДЕ
	//|		ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель = &Залогодатель
	//|		И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
	//|	
	//|	УПОРЯДОЧИТЬ ПО
	//|		ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период УБЫВ) КАК НастройкаРасчетаОценкиЗалога
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	НастройкаОценкиДрагоценныхВставок.Регистратор,
	//|	НастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия,
	//|	НастройкаОценкиДрагоценныхВставок.Комментарий,
	//|	НастройкаОценкиДрагоценныхВставок.Период
	//|ИЗ
	//|	(ВЫБРАТЬ ПЕРВЫЕ 1
	//|		ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор КАК Регистратор,
	//|		ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	//|		ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор.Комментарий КАК Комментарий,
	//|		ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период КАК Период
	//|	ИЗ
	//|		РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
	//|	ГДЕ
	//|		ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель = &Залогодатель
	//|		И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
	//|	
	//|	УПОРЯДОЧИТЬ ПО
	//|		ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период УБЫВ) КАК НастройкаОценкиДрагоценныхВставок
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Период УБЫВ";
	
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК Регистратор,
	|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор.Комментарий КАК Комментарий,
	|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период КАК Период
	|ИЗ
	|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
	|ГДЕ
	|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель = &Залогодатель
	|	И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор КАК Регистратор,
	|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор.Комментарий КАК Комментарий,
	|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период КАК Период
	|ИЗ
	|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
	|ГДЕ
	|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель = &Залогодатель
	|	И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор КАК Регистратор,
	|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор.Комментарий КАК Комментарий,
	|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период КАК Период
	|ИЗ
	|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
	|ГДЕ
	|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель = &Залогодатель
	|	И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период УБЫВ";
	
	//Результат = Запрос.Выполнить().Выгрузить();
	Пакеты = Запрос.ВыполнитьПакет();
	
	ИспользуютсяСтавки = Ложь;
	ИспользуютсяМаталлы = Ложь;
	ИспользуютсяВставки = Ложь;
	Используется = Ложь;
	СрокДействия = Дата(1,1,1);
	Комментарий = "";
	
	Ставки = Пакеты[0].Выбрать();
	Металлы = Пакеты[1].Выбрать();
	Вставки = Пакеты[2].Выбрать();
	
	Если Ставки.Следующий() Тогда
		Если Ставки.Регистратор.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП Тогда
			Если Ставки.ДатаОкончанияДействия >= Дата ИЛИ Ставки.ДатаОкончанияДействия = Дата(1,1,1) Тогда
				ИспользуютсяСтавки = Ложь;
			КонецЕсли;	
		Иначе
			Если Ставки.ДатаОкончанияДействия >= Дата ИЛИ Ставки.ДатаОкончанияДействия = Дата(1,1,1) Тогда
				ИспользуютсяСтавки = Истина;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	Если Металлы.Следующий() Тогда
		Если Металлы.Регистратор.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП Тогда
			Если Металлы.ДатаОкончанияДействия >= Дата ИЛИ Металлы.ДатаОкончанияДействия = Дата(1,1,1) Тогда
				ИспользуютсяМаталлы = Ложь;
			КонецЕсли;	
		Иначе
			Если Металлы.ДатаОкончанияДействия >= Дата ИЛИ Металлы.ДатаОкончанияДействия = Дата(1,1,1) Тогда
				ИспользуютсяМаталлы = Истина;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	Если Вставки.Следующий() Тогда
		Если Вставки.Регистратор.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП Тогда
			Если Вставки.ДатаОкончанияДействия >= Дата ИЛИ Вставки.ДатаОкончанияДействия = Дата(1,1,1) Тогда
				ИспользуютсяВставки = Ложь;
			КонецЕсли;	
		Иначе
			Если Вставки.ДатаОкончанияДействия >= Дата ИЛИ Вставки.ДатаОкончанияДействия = Дата(1,1,1) Тогда
				ИспользуютсяВставки = Истина;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	////Для каждого Стр Из ПромежуточнаяТЗ Цикл
	//Для каждого Стр Из Результат Цикл
	//	Если Стр.Регистратор.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП Тогда
	//		Если Стр.ДатаОкончанияДействия >= Дата ИЛИ Стр.ДатаОкончанияДействия = Дата(1,1,1) Тогда
	//			Используется = Ложь;
	//			СрокДействия = Стр.ДатаОкончанияДействия;
	//			Комментарий = Стр.Комментарий;
	//		КонецЕсли;	
	//		
	//		//Если Стр.ДатаОкончанияДействия = Дата(1,1,1) Тогда
	//		//	Используется = Истина;
	//		//	СрокДействия = Стр.ДатаОкончанияДействия;
	//		//	Комментарий = Стр.Комментарий;
	//		//КонецЕсли;
	//	Иначе
	//		Если Стр.ДатаОкончанияДействия >= Дата ИЛИ Стр.ДатаОкончанияДействия = Дата(1,1,1) Тогда
	//			Используется = Истина;
	//			СрокДействия = Стр.ДатаОкончанияДействия;
	//			Комментарий = Стр.Комментарий;
	//		КонецЕсли;	
	//		
	//		//Если Стр.ДатаОкончанияДействия = Дата(1,1,1) Тогда
	//		//	Используется = Истина;
	//		//	СрокДействия = Стр.ДатаОкончанияДействия;
	//		//	Комментарий = Стр.Комментарий;
	//		//КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;	
	
	Если ИспользуютсяСтавки ИЛИ ИспользуютсяМаталлы ИЛИ ИспользуютсяВставки Тогда
		Используется = Истина;
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Используется", Используется);
	СтруктураВозврата.Вставить("СрокДействия", СрокДействия);
	СтруктураВозврата.Вставить("Комментарий", Комментарий);
	
	Возврат СтруктураВозврата;
	
КонецФункции
//-Мельников

//++ИвановВВ, ЭДО
#Область ЭДО 

&НаКлиенте
Процедура ЗаключитьЭДО(Команда)
	Проверка = ПроверитьИЗаписать(Ложь);
	Если Проверка Тогда
		Если ДатаСмерти = Дата(1,1,1) Тогда
			Если ЗначениеЗаполнено(Телефон) Тогда
				ЛБ_СоглашенияЭДОКлиент.ОбработкаКоманд(Команда.Имя, Залогодатель,,,ЭтаФорма);
				НаличиеЭДО = ЛБ_СоглашенияЭДОСервер.НаличиеДействующегоСоглашения(Залогодатель);
				
				Если НаличиеЭДО Тогда
					Элементы.СтатусЭДО.Заголовок = "есть";
				Иначе
					Элементы.СтатусЭДО.Заголовок = "нет";
				КонецЕсли;
			Иначе
				Предупреждение("Для заключения ЭДО заполните номер телефона",, "Номер телефона не заполнен");
			КонецЕсли;
		Иначе
			Предупреждение("Клиент умер. Дата смерти " + Формат(ДатаСмерти, "ДФ=dd.MM.yyyy"));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасторгнутьЭДОКлиент(Команда)
	ОписаниеОповещенияРасторгнутьЭДОКлиентПродолжить = Новый ОписаниеОповещения("РасторгнутьЭДОКлиентПродолжить", ЭтотОбъект);
	//ЛБ_СоглашенияЭДОКлиент.ОбработкаКоманд(Команда.Имя, Залогодатель, ОписаниеОповещенияСтатусЭДО);
	ЛБ_СоглашенияЭДОКлиент.ОбработкаКоманд(Команда.Имя, Залогодатель,ОписаниеОповещенияРасторгнутьЭДОКлиентПродолжить,,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусЭДО(Результат, ДополнительныеПараметры) Экспорт
	НаличиеЭДО = ЛБ_СоглашенияЭДОСервер.НаличиеДействующегоСоглашения(Залогодатель);
	
	Если НаличиеЭДО Тогда
		Элементы.СтатусЭДО.Заголовок = "есть";
	Иначе
		Элементы.СтатусЭДО.Заголовок = "нет";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасторгнутьЭДОКлиентПродолжить(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		Если Результат Тогда
			ОписаниеОповещенияРасторгнутьЭДОКлиентЗавершение = Новый ОписаниеОповещения("РасторгнутьЭДОКлиентЗавершение", ЭтотОбъект);
			ЛБ_СоглашенияЭДОКлиент.ОбработкаКоманд("РасторгнутьЭДОКлиентПродолжить", Залогодатель,ОписаниеОповещенияРасторгнутьЭДОКлиентЗавершение,,ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасторгнутьЭДОКлиентЗавершение(Результат, ДополнительныеПараметры) Экспорт
	ОтветРасторжениеПодписано = Вопрос("Заявление о расторжении ЭДО подписано клиентом?",
	РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да);
	Если ОтветРасторжениеПодписано = КодВозвратаДиалога.Да Тогда
		РезультатРасторженияЭДО = ЛБ_СоглашенияЭДОСервер.РасторгнутьЭДОСервер(Залогодатель);
		Если РезультатРасторженияЭДО Тогда
			Элементы.СтатусЭДО.Заголовок = "нет";
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасторгнутьЭДО_ЦО(Команда)
	ЛБ_СоглашенияЭДОКлиент.ОбработкаКоманд(Команда.Имя, Залогодатель);
	НаличиеЭДО = ЛБ_СоглашенияЭДОСервер.НаличиеДействующегоСоглашения(Залогодатель);
	
	Если НаличиеЭДО Тогда
		Элементы.СтатусЭДО.Заголовок = "есть";
	Иначе
		Элементы.СтатусЭДО.Заголовок = "нет";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЭДО(Команда)
	ЛБ_СоглашенияЭДОКлиент.ОбработкаКоманд(Команда.Имя, Залогодатель);
	НаличиеЭДО = ЛБ_СоглашенияЭДОСервер.НаличиеДействующегоСоглашения(Залогодатель);
	
	Если НаличиеЭДО Тогда
		Элементы.СтатусЭДО.Заголовок = "есть";
	Иначе
		Элементы.СтатусЭДО.Заголовок = "нет";
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СтатусЭДОНажатие(Элемент)
	ЛБ_СоглашенияЭДОКлиент.ОбработкаКоманд("ИсторияЭДО", Залогодатель);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСогласиеОбЭДО(Команда)
	ЛБ_СоглашенияЭДОКлиент.ОбработкаКоманд(Команда.Имя, Залогодатель,,,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьРасторженияЭДО(Команда)
	ЛБ_СоглашенияЭДОКлиент.ОбработкаКоманд(Команда.Имя, Залогодатель,,,ЭтаФорма);
КонецПроцедуры	

#КонецОбласти
//--ИвановВВ

//++ИвановВВ, согласия
#Область Согласия
&НаКлиенте
Процедура ЗаключитьСогласие(Команда)
	Проверка = ПроверитьИЗаписать(Ложь);
	Если Проверка Тогда
		Если ДатаСмерти = Дата(1,1,1) Тогда
			Если ЗначениеЗаполнено(Телефон) Тогда	
				ЛБ_СогласияНаИнформированиеКлиент.ОбработкаКоманд(Команда.Имя, Залогодатель,,,ЭтаФорма);
				НаличиеСогласия = ЛБ_СогласияНаИнформированиеСервер.НаличиеДействующегоСогласия(Залогодатель);
			
				Если НаличиеСогласия Тогда
					Элементы.СтатусСогласия.Заголовок = "есть";
				Иначе
					Элементы.СтатусСогласия.Заголовок = "нет";
				КонецЕсли;
			Иначе
				Предупреждение("Для заключения согласия на информирование заполните номер телефона",, "Номер телефона не заполнен");
			КонецЕсли;
		Иначе
			Предупреждение("Клиент умер. Дата смерти " + Формат(ДатаСмерти, "ДФ=dd.MM.yyyy"));
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтозватьСогласие(Команда)
	ОписаниеОповещенияОтозватьСогласиеПродолжить = Новый ОписаниеОповещения("ОтозватьСогласиеПродолжить", ЭтотОбъект);
	ЛБ_СогласияНаИнформированиеКлиент.ОбработкаКоманд(Команда.Имя, Залогодатель,ОписаниеОповещенияОтозватьСогласиеПродолжить,,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусСогласия(Результат, ДополнительныеПараметры) Экспорт
	НаличиеСогласия = ЛБ_СогласияНаИнформированиеСервер.НаличиеДействующегоСогласия(Залогодатель);
	
	Если НаличиеСогласия Тогда
		Элементы.СтатусСогласия.Заголовок = "есть";
	Иначе
		Элементы.СтатусСогласия.Заголовок = "нет";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтозватьСогласиеПродолжить(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		Если Результат Тогда
			ОписаниеОповещенияОтозватьСогласиеЗавершение = Новый ОписаниеОповещения("ОтозватьСогласиеЗавершение", ЭтотОбъект);
			ЛБ_СогласияНаИнформированиеКлиент.ОбработкаКоманд("ОтозватьСогласиеПродолжить", Залогодатель,ОписаниеОповещенияОтозватьСогласиеЗавершение,,ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтозватьСогласиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	ОтветРасторжениеПодписано = Вопрос("Заявление на отзыв Согласия на информирование подписано клиентом?",
	РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да);
	Если ОтветРасторжениеПодписано = КодВозвратаДиалога.Да Тогда
		РезультатОтзываСогласия = ЛБ_СогласияНаИнформированиеСервер.ОтозватьСогласиеНаИнформирование(Залогодатель);
		Если РезультатОтзываСогласия Тогда
			Элементы.СтатусСогласия.Заголовок = "нет";
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСогласие(Команда)
	ЛБ_СогласияНаИнформированиеКлиент.ОбработкаКоманд(Команда.Имя, Залогодатель);
	НаличиеСогласия = ЛБ_СогласияНаИнформированиеСервер.НаличиеДействующегоСогласия(Залогодатель);
	
	Если НаличиеСогласия Тогда
		Элементы.СтатусСогласия.Заголовок = "есть";
	Иначе
		Элементы.СтатусСогласия.Заголовок = "нет";
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СтатусСогласияНажатие(Элемент)
	ЛБ_СогласияНаИнформированиеКлиент.ОбработкаКоманд("ИсторияСогласия", Залогодатель);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСогласиеНаИнформирование(Команда)
	ЛБ_СогласияНаИнформированиеКлиент.ОбработкаКоманд(Команда.Имя, Залогодатель,,,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьОтзывСогласияНаИнформирование(Команда)
	ЛБ_СогласияНаИнформированиеКлиент.ОбработкаКоманд(Команда.Имя, Залогодатель,,,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ЗаключитьСогласиеПродолжить(Результат, ДополнительныеПараметры) Экспорт
	ЭтаФорма.Закрыть(ДополнительныеПараметры);
КонецПроцедуры

#КонецОбласти

#Область КонтактныеДанные

&НаКлиенте
Процедура ОтменитьИзменениеКонтактныхДанных(Команда)
	ПараметрыФормы = Новый Структура("Клиент, Печать", Залогодатель, Ложь);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ЗаявленияОбИзмененииКонтактныхДанных", ПараметрыФормы,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры

#КонецОбласти


#Область ИзменениеКонтактныхДанных

&НаКлиенте
Процедура СравнитьЗначенияРеквизитовКонтактныеДанные(Результат = Неопределено)
	
	Если Не ОтмененыИзменения Тогда
		
		МассивЗначенийРеквизитовКонтактныеДанные = Новый Массив;
		СтруктураРеквизитовКонтактныеДанныеДляПечати = Новый Структура;
		
		Выборка = ПолучитьСтруктуруИзмененныхКонтактныхДанных();
		
		Если Выборка.Количество() > 0 Тогда		
			
			Если ЗначенияРеквизитовКонтактныеДанные.Телефон <> Выборка.Телефон Тогда
				МассивЗначенийРеквизитовКонтактныеДанные.Добавить(Символы.ПС + "- Телефон сотовый");
				СтруктураРеквизитовКонтактныеДанныеДляПечати.Вставить("Телефон", "Телефон сотовый: " + Выборка.Телефон);
			Иначе
				МассивЗначенийРеквизитовКонтактныеДанные.Добавить("");
			КонецЕсли;
			Если ЗначенияРеквизитовКонтактныеДанные.ТелефонДополнительный <> Выборка.ТелефонДополнительный Тогда
				МассивЗначенийРеквизитовКонтактныеДанные.Добавить(Символы.ПС + "- Телефон дополнительный");
				СтруктураРеквизитовКонтактныеДанныеДляПечати.Вставить("ТелефонДополнительный", "Телефон дополнительный: " + Выборка.ТелефонДополнительный);
			Иначе
				МассивЗначенийРеквизитовКонтактныеДанные.Добавить("");
			КонецЕсли;
			Если ЗначенияРеквизитовКонтактныеДанные.Email <> Выборка.Email Тогда
				МассивЗначенийРеквизитовКонтактныеДанные.Добавить(Символы.ПС + "- Email");
				СтруктураРеквизитовКонтактныеДанныеДляПечати.Вставить("Email", "Email: " + Выборка.Email);
			Иначе
				МассивЗначенийРеквизитовКонтактныеДанные.Добавить("");
			КонецЕсли;
			Если ЗначенияРеквизитовКонтактныеДанные.КонтактноеЛицо <> Выборка.КонтактноеЛицо Тогда
				МассивЗначенийРеквизитовКонтактныеДанные.Добавить(Символы.ПС + "- Контактное лицо");
				СтруктураРеквизитовКонтактныеДанныеДляПечати.Вставить("КонтактноеЛицо", "Контактное лицо: " + Выборка.КонтактноеЛицо);
			Иначе
				МассивЗначенийРеквизитовКонтактныеДанные.Добавить("");
			КонецЕсли;
			Если ЗначенияРеквизитовКонтактныеДанные.ТелефонКонтактногоЛица <> Выборка.ТелефонКонтактногоЛица Тогда
				МассивЗначенийРеквизитовКонтактныеДанные.Добавить(Символы.ПС + "- Телефон контактного лица");
				СтруктураРеквизитовКонтактныеДанныеДляПечати.Вставить("ТелефонКонтактногоЛица", "Телефон контактного лица: " + Выборка.ТелефонКонтактногоЛица);
			Иначе
				МассивЗначенийРеквизитовКонтактныеДанные.Добавить("");
			КонецЕсли;
			Если ЗначенияРеквизитовКонтактныеДанные.ФактическийАдрес <> Выборка.ФактическийАдрес Тогда
				МассивЗначенийРеквизитовКонтактныеДанные.Добавить(Символы.ПС + "- Фактический адрес");
				СтруктураРеквизитовКонтактныеДанныеДляПечати.Вставить("ФактическийАдрес", "Фактический адрес: " + Выборка.ФактическийАдрес);
			Иначе
				МассивЗначенийРеквизитовКонтактныеДанные.Добавить("");
			КонецЕсли;
			Если ЗначенияРеквизитовКонтактныеДанные.ПочтовыйАдрес <> Выборка.ПочтовыйАдрес Тогда
				МассивЗначенийРеквизитовКонтактныеДанные.Добавить(Символы.ПС + "- Почтовый адрес");
				СтруктураРеквизитовКонтактныеДанныеДляПечати.Вставить("ПочтовыйАдрес", "Почтовый адрес: " + Выборка.ПочтовыйАдрес);
			Иначе
				МассивЗначенийРеквизитовКонтактныеДанные.Добавить("");
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтруктураРеквизитовКонтактныеДанныеДляПечати.Количество() > 0 Тогда
			
			СтруктураРеквизитовКонтактныеДанныеДляПечати.Вставить("Период", Выборка.Период);
			
			ТекстВопросаЗаявление = СтрШаблон("В следующие контактные данные были внесены изменения: %1%2%3%4%5%6%7" + Символы.ПС +
			"Будет распечатано одно заявление о смене контактных данных", 
			МассивЗначенийРеквизитовКонтактныеДанные.Получить(0),
			МассивЗначенийРеквизитовКонтактныеДанные.Получить(1),
			МассивЗначенийРеквизитовКонтактныеДанные.Получить(2),
			МассивЗначенийРеквизитовКонтактныеДанные.Получить(3),
			МассивЗначенийРеквизитовКонтактныеДанные.Получить(4),
			МассивЗначенийРеквизитовКонтактныеДанные.Получить(5),
			МассивЗначенийРеквизитовКонтактныеДанные.Получить(6));
			Вопрос(ТекстВопросаЗаявление, РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК);
			
			//+МАН 08.12.25 Вернул как было
			//+МАН 27.11.25 Т.к. сравнение производится уже после записи карточки, то необходимо записывать данные и в регистр изменений
			//Было:
			ПечатьЗаявленияНаСменуКонтактныхДанных(,СтруктураРеквизитовКонтактныеДанныеДляПечати, Результат);
			//ЗаявлениеОбИзмененииРаспечатано = Истина;
			ЗапомнитьЗначенияРеквизитовКонтактныеДанные();
			
			//ЛБ_СоглашенияЭДОСервер.ЗаписатьИзмененияКонтактныхДанных(Залогодатель, СтруктураРеквизитовКонтактныеДанныеДляПечати, ЗначенияРеквизитовКонтактныеДанные);
			//ЗапомнитьЗначенияРеквизитовКонтактныеДанные();
			//
			//Если ОтветЗаявление = КодВозвратаДиалога.Да Тогда
			//	ПечатьЗаявленияНаСменуКонтактныхДанных(,СтруктураРеквизитовКонтактныеДанныеДляПечати);
			//	//ЗаявлениеОбИзмененииРаспечатано = Истина;
			//КонецЕсли;
			//-МАН
		Иначе
			//++ИвановВВ, убрал закрытие тут, оно будет после проверки наличия согласия на инф.
			//Если ЗакрыватьФормуПриСохранении Тогда
			//	ЭтаФорма.Закрыть(Результат);
			//КонецЕсли;
			//--ИвановВВ
		КонецЕсли;
	Иначе
		//++ИвановВВ, убрал закрытие тут, оно будет после проверки наличия согласия на инф.
		//Если ЗакрыватьФормуПриСохранении Тогда
		//	ЭтаФорма.Закрыть(Результат);
		//КонецЕсли;
		//--ИвановВВ
	КонецЕсли;
		
КонецПроцедуры // СравнитьЗначенияРеквизитовКонтактныеДанные()

&НаСервере
Функция ПолучитьСтруктуруИзмененныхКонтактныхДанных()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК Телефон,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ТелефонДополнительный КАК ТелефонДополнительный,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Email КАК Email,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.КонтактноеЛицо КАК КонтактноеЛицо,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ТелефонКонтактногоЛица КАК ТелефонКонтактногоЛица,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ФактическийАдрес КАК ФактическийАдрес,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Период КАК Период
	|ИЗ
	|	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&ТекущаяДата, Залогодатель = &Клиент) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	
	Запрос.УстановитьПараметр("Клиент", Залогодатель);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктураИзмененныхДанных = Новый Структура;
	Если Выборка.Следующий() Тогда
		СтруктураИзмененныхДанных.Вставить("Телефон",                Выборка.Телефон);
		СтруктураИзмененныхДанных.Вставить("ТелефонДополнительный",  Выборка.ТелефонДополнительный);
		СтруктураИзмененныхДанных.Вставить("Email",                  Выборка.Email);
		СтруктураИзмененныхДанных.Вставить("КонтактноеЛицо",         Выборка.КонтактноеЛицо);
		СтруктураИзмененныхДанных.Вставить("ТелефонКонтактногоЛица", Выборка.ТелефонКонтактногоЛица);
		СтруктураИзмененныхДанных.Вставить("ФактическийАдрес",       Выборка.ФактическийАдрес);
		СтруктураИзмененныхДанных.Вставить("ПочтовыйАдрес",          Выборка.ПочтовыйАдрес);
		СтруктураИзмененныхДанных.Вставить("Период",                 Выборка.Период);
	КонецЕсли;
	Возврат СтруктураИзмененныхДанных;
КонецФункции

&НаКлиенте
Процедура ПечатьИзменениеКонтактныхДанных(Команда)
	ПараметрыФормы = Новый Структура("Клиент, Печать", Залогодатель, Истина);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ЗаявленияОбИзмененииКонтактныхДанных", ПараметрыФормы,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЗаявленияНаСменуКонтактныхДанных(ИзФормыПечати = Ложь, СтруктураРеквизитовКонтактныеДанныеДляПечати = Неопределено, Результат)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СтруктураРеквизитовКонтактныеДанныеДляПечати", СтруктураРеквизитовКонтактныеДанныеДляПечати);
	ДополнительныеПараметры.Вставить("Результат", Результат);
	
	ОписаниеОповещенияПродолжитьИзменение = Новый ОписаниеОповещения("ИзменениеКонтактныхДанныхПродолжить", ЭтотОбъект, ДополнительныеПараметры);
	
	ТабличныйДокумент = ЛБ_СоглашенияЭДОСервер.ПечатьЗаявлениеИзменениеКонтактныхДанных(Залогодатель, Неопределено, ИзФормыПечати, СтруктураРеквизитовКонтактныеДанныеДляПечати);
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЛБ_ИзменениеКонтактныхДанных");    
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
	КоллекцияПечатныхФорм[0].СинонимМакета = "Заявление об изменении контактных данных"; 
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено, ЭтаФорма, ОписаниеОповещенияПродолжитьИзменение);
	
КонецПроцедуры // ПечатьЗаявленияНаСменуКонтактныхДанных()

&НаКлиенте
Процедура ИзменениеКонтактныхДанныхПродолжить(Результат, ДополнительныеПараметры) Экспорт
	ОтветПодпись = Вопрос("Заявление об изменении контактных данных подписано клиентом?", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да);
	Если ОтветПодпись = КодВозвратаДиалога.Да Тогда
		ЛБ_СоглашенияЭДОСервер.ЗаписатьИзмененияКонтактныхДанных(Залогодатель, ДополнительныеПараметры.СтруктураРеквизитовКонтактныеДанныеДляПечати, ЗначенияРеквизитовКонтактныеДанные);
		Вопрос("Факт подписания клиентом заявления об изменении контактных данных зафиксирован.", РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК);
	КонецЕсли;
	
	Если Не ЗакрыватьФормуПриСохранении Тогда
		//++ИвановВВ 2025_11, согласия на информирование	
		Элементы.КонтактныеДанные.Доступность = Истина;
		Элементы.КонтактныеДанные.ТолькоПросмотр = Ложь;
		Если ДатаСмерти = Дата(1,1,1) Тогда
			НаличиеСогласия = ЛБ_СогласияНаИнформированиеСервер.НаличиеДействующегоСогласия(Залогодатель);	
			Если Не НаличиеСогласия Тогда
				ОтветУдалить = Вопрос("При согласии клиенту будет поступать информация о ремонтах/переездах/изменении режима работы ломбардов и проводимых акциях"
				+ Символы.ПС + "Создаем согласие на информирование?"
				,РежимДиалогаВопрос.ДаНет, 0,КодВозвратаДиалога.Да, "У клиента не оформлено согласие на информирование.");
				Если ОтветУдалить = КодВозвратаДиалога.Да Тогда
					Если ЗначениеЗаполнено(Телефон) Тогда	
						ЛБ_СогласияНаИнформированиеКлиент.ОбработкаКоманд("ЗаключитьСогласие", Залогодатель,,,ЭтаФорма);		
					Иначе
						Предупреждение("Для заключения согласия на информирование заполните номер телефона",, "Номер телефона не заполнен");
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;	
		//--ИвановВВ 2025_11
		
	Иначе	
		//++ИвановВВ 2025_11, согласия на информирование
		Элементы.КонтактныеДанные.Доступность = Истина;
		Элементы.КонтактныеДанные.ТолькоПросмотр = Ложь;
		Если ДатаСмерти = Дата(1,1,1) Тогда
			НаличиеСогласия = ЛБ_СогласияНаИнформированиеСервер.НаличиеДействующегоСогласия(Залогодатель);	
			Если Не НаличиеСогласия Тогда
				ОтветСогласие = Вопрос("При согласии клиенту будет поступать информация о ремонтах/переездах/изменении режима работы ломбардов и проводимых акциях" + Символы.ПС + "Создаем согласие на информирование?"
				,РежимДиалогаВопрос.ДаНет, 0,КодВозвратаДиалога.Да, "У клиента не оформлено согласие на информирование.");
				Если ОтветСогласие = КодВозвратаДиалога.Да Тогда
					Если ЗначениеЗаполнено(Телефон) Тогда
						ОписаниеОповещенияЗаключитьСогласиеПродолжить = Новый ОписаниеОповещения("ЗаключитьСогласиеПродолжить", ЭтотОбъект, ДополнительныеПараметры.Результат);
						ЛБ_СогласияНаИнформированиеКлиент.ОбработкаКоманд("ЗаключитьСогласие", Залогодатель,ОписаниеОповещенияЗаключитьСогласиеПродолжить,,ЭтаФорма);
					Иначе
						Предупреждение("Для заключения согласия на информирование заполните номер телефона",, "Номер телефона не заполнен");
					КонецЕсли;
				Иначе
					ЭтаФорма.Закрыть(ДополнительныеПараметры.Результат);
				КонецЕсли;
			Иначе	
				ЭтаФорма.Закрыть(ДополнительныеПараметры.Результат);
			КонецЕсли;
		КонецЕсли;	
		//--ИвановВВ 2025_11
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаПД

&НаКлиенте
Процедура ПечатьСогласиеНаОбработкуПД(Команда)
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ИмяКоманды",   Команда.Имя);
	СтруктураПараметров.Вставить("Залогодатель", Залогодатель);
	СтруктураПараметров.Вставить("Форма",     ЭтаФорма);
	ЛБ_СогласияНаОбработкуПД_Клиент.ОбработкаКоманд(СтруктураПараметров);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьОтзывСогласияНаОбработкуПД(Команда)
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ИмяКоманды",   Команда.Имя);
	СтруктураПараметров.Вставить("Залогодатель", Залогодатель);
	СтруктураПараметров.Вставить("Форма",     ЭтаФорма);
	ЛБ_СогласияНаОбработкуПД_Клиент.ОбработкаКоманд(СтруктураПараметров);
	
	НаличиеСогласия = ЛБ_СогласияНаИнформированиеСервер.НаличиеДействующегоСогласия(Залогодатель);
	
	Если НаличиеСогласия Тогда
		Элементы.СтатусСогласия.Заголовок = "есть";
	Иначе
		Элементы.СтатусСогласия.Заголовок = "нет";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтзывСогласияНаОбработкуПД_ЦО(Команда)
	
	Результат = ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаОтзываСогласияПД_ЦО",,,,,,
		Новый ОписаниеОповещения("ОтзывСогласияНаОбработкуПД_ЦО_Продолжить", ЭтаФорма),
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
КонецПроцедуры

&НаКлиенте
Процедура ОтзывСогласияНаОбработкуПД_ЦО_Продолжить(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ИмяКоманды",   "ОтзывСогласияНаОбработкуПД_ЦО");
		СтруктураПараметров.Вставить("Залогодатель", Залогодатель);
		СтруктураПараметров.Вставить("Форма",     ЭтаФорма);
		СтруктураПараметров.Вставить("Комментарий",  Результат);
		ЛБ_СогласияНаОбработкуПД_Клиент.ОбработкаКоманд(СтруктураПараметров);
		
		НаличиеСогласия = ЛБ_СогласияНаИнформированиеСервер.НаличиеДействующегоСогласия(Залогодатель);
		
		Если НаличиеСогласия Тогда
			Элементы.СтатусСогласия.Заголовок = "есть";
		Иначе
			Элементы.СтатусСогласия.Заголовок = "нет";
		КонецЕсли
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//--ИвановВВ

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница.Имя = "СтраницаЗБ" И ТаблицаЗБ.Количество() = 0 Тогда
		ВыборЗБ = 1; 
		ТекущийВыборЗБ = 1;
	    ПолучитьСписокЗБ();
		ЗаполнитьСписокЛомбардов(); 
		УстановитьОтборНаСервере();  
		
		ЗапуститьФоновоеЗадание();
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьФоновоеЗадание()
    ИдентификаторЗадания = ЗапуститьФоновоеЗаданиеНаСервере();
    ОжиданиеВыполнения = Новый ОписаниеОповещения("ПроверитьВыполнениеЗадания", ЭтаФорма);
    ПодключитьОбработчикОжидания("ПроверитьВыполнениеЗадания", 1, Ложь);
КонецПроцедуры

&НаСервере
Функция ЗапуститьФоновоеЗаданиеНаСервере()
    ПараметрыЗадания = Новый Массив;
	СписокЗБ = Новый СписокЗначений;
	Для Каждого Стр Из ТаблицаЗБ Цикл
	    СписокЗБ.Добавить(Стр.ЗалоговыйБилет);
	КонецЦикла;    
	ПараметрыЗадания.Добавить(СписокЗБ);   
	ПараметрыЗадания.Добавить(ДатаСмерти);
	ФоновоеЗадание = ФоновыеЗадания.Выполнить("ЛБ_УправлениеЛомбардом.ВыполнитьОбработкуДанныхТаблицыЗБ", ПараметрыЗадания);
    Возврат ФоновоеЗадание.УникальныйИдентификатор;
КонецФункции

&НаКлиенте
Процедура ПроверитьВыполнениеЗадания() Экспорт
    Результат = ПроверитьВыполнениеЗаданияНаСервере();
    
    Если Результат.Выполнено Тогда
        ОтключитьОбработчикОжидания("ПроверитьВыполнениеЗадания");
        //ПоказатьОповещениеПользователя("Результат обработки", , Результат.ТекстРезультата);
    КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверитьВыполнениеЗаданияНаСервере()
    Результат = Новый Структура("Выполнено, ТекстРезультата", Ложь, "");
    
    ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания); 
	СообщенияИзФона = ФоновоеЗадание.ПолучитьСообщенияПользователю(Истина);
	Для Каждого Сообщ Из СообщенияИзФона Цикл
		ОбработатьСообщениеФЗ(Сообщ.Текст);
	КонецЦикла;
    
    Если ФоновоеЗадание <> Неопределено И ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
        Результат.Выполнено = Истина;
       // Результат.ТекстРезультата = ФоновоеЗадание.ПолучитьРезультат();
	   ФоновоеЗадание.Отменить();
    КонецЕсли;
    
    Возврат Результат;
КонецФункции     

&НаСервере
Процедура ОбработатьСообщениеФЗ(Сообщ)
	Поз = Найти(Сообщ, ";");
	НомерЗБ = Лев(Сообщ, Поз-1);
	Сообщ = Сред(Сообщ, Поз+1);
	
	Поз = Найти(Сообщ, ";"); 
	ПроцентнаяСтавка = СокрЛП(Лев(Сообщ, Поз-1));
	Сообщ = Сред(Сообщ, Поз+1);

	Поз = Найти(Сообщ, ";"); 
	СуммаПроцентовВДень = СокрЛП(Лев(Сообщ, Поз-1));
	Сообщ = Сред(Сообщ, Поз+1);
	
	Поз = Найти(Сообщ, ";");   
	//Попытка
	    Долг = Число(СокрЛП(Лев(Сообщ, Поз-1))); 
	//Исключение   
	//	Долг = 0;
	//КонецПопытки;   
	Сообщ = Сред(Сообщ, Поз+1);
	
	ЕстьДоверенность = СокрЛП(Сообщ);
	
	Отбор = Новый Структура;
	Отбор.Вставить("НомерЗБ", НомерЗБ);
	СтрокиЗБ = ТаблицаЗБ.НайтиСтроки(Отбор);
	Если НЕ СтрокиЗБ.Количество() = 0 Тогда 
		 СтрЗБ = СтрокиЗБ.Получить(0); 
		 СтрЗБ.ПроцентнаяСтавка = ПроцентнаяСтавка;
		 СтрЗБ.СуммаПроцентовВДень = СуммаПроцентовВДень; 
		 СтрЗБ.Долг = Долг;  
		 СтрЗБ.Доверенность = ?(ЕстьДоверенность = "да", истина, ложь);  
		 
		 Элементы.ТаблицаЗБ.Обновить();
    КонецЕсли;
КонецПроцедуры 


&НаКлиенте
Процедура ВыборЗБПриИзменении(Элемент)
	Если ВыборЗБ = 3 Тогда 
		Параметрыформы = Новый структура;
		Параметрыформы.Вставить("НомерЗБ", НомерЗБ);  
		ОбработкаВвода = Новый ОписаниеОповещения("ПослеВводаНомераЗБ", ЭтаФорма);
		ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаВводаНомераЗБ", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВвода, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе            
		//ЗаполнитьСписокЛомбардов();
		УстановитьОтборНаСервере();  
		Элементы.НомерЗБ.Видимость = Ложь; 
		ТекущийВыборЗБ = ВыборЗБ;
	КонецЕсли;	
	
КонецПроцедуры    

&НаКлиенте
Процедура ПослеВводаНомераЗБ(Результат, ДопПараметры) Экспорт  
	Если Результат = Неопределено Тогда
		ВыборЗБ = ТекущийВыборЗБ;
		Возврат;
	КонецЕсли;
	
	НомерЗБ = Результат;
	СообщениеЗБ = ПолучитьЗБОдин();  
	Если Пустаястрока(СообщениеЗБ) Тогда
		Элементы.НомерЗБ.Видимость = Истина;   
		СтрокаНомерЗБ = "№ ЗБ " + СокрЛП(НомерЗБ); 			
		ТекущийВыборЗБ = 3; 
	Иначе      
		Предупреждение(СообщениеЗБ, 60);
		ОбработкаВвода = Новый ОписаниеОповещения("ПослеВводаНомераЗБ", ЭтаФорма);
		ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаВводаНомераЗБ", , ЭтаФорма,,,,ОбработкаВвода, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьЗБОдин() 
	ЗБ = ЛБ_ОбщийМодуль.ПолучитьЗБПоНомеру(СокрЛП(НомерЗБ), Ложь);  
	Если ЗначениеЗаполнено(ЗБ) Тогда
		Если ЗБ.Залогодатель = Залогодатель Тогда
			Элементы.Ломбард.СписокВыбора.Очистить();
			Ломбард = Справочники.ЛБ_Ломбарды.ПустаяСсылка();
		   	УстановитьОтборНаСервере(ЗБ);
	        Возврат "";  
		Иначе
			Возврат "Залоговый билет клиента № " + СокрЛП(НомерЗБ) + " не найден!";
		КонецЕсли;
	Иначе 
		Возврат "Залоговый билет клиента № " + СокрЛП(НомерЗБ) + " не найден!";
	КонецЕсли;	
КонецФункции

&НаСервере
Процедура УстановитьОтборНаСервере(ЗБ = неопределено)
	Отбор = Новый Структура;
	Если НЕ ЗБ = неопределено Тогда
		Отбор.Вставить("ЗалоговыйБилет", ЗБ);
	Иначе
		Если ЗначениеЗаполнено(Ломбард) Тогда
			Отбор.Вставить("Ломбард", Ломбард);
		КонецЕсли;	
		Если ВыборЗБ = 2 Тогда 
			Отбор.Вставить("Действующий", Истина);
		КонецЕсли;	   
		//+МАН 17.02.26
		ЗаполнитьСписокЛомбардов();
		//-МАН
	КонецЕсли;	   
	
	Элементы.ТаблицаЗБ.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
	Элементы.ТаблицаЗБ.Обновить();
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокЗБ() 	
	ТаблицаЗапроса = ЛБ_ОбщийМодуль.ПолучитьСписокЗБКлиента(Залогодатель);   
	ЗаполнитьТаблицуЗБ(ТаблицаЗапроса)
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьСписокЛомбардов()
	Элементы.Ломбард.СписокВыбора.Очистить(); 
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	Если ТекПользователь.ЭтоЛомбард Тогда
		ТекЛомбард = ПараметрыСеанса.ТекущийЛомбард;  
		//+МАН 28.01.26 Заявка 3649
		ТЗЛомбардыОтделения = ПолучитьЛомбардыОтделения(ТекЛомбард);
		//-МАН
	Иначе
		ТекЛомбард = неопределено;
	КонецЕсли;  

	//+МАН 28.01.26 Изменение порядка ломбардов в списке выбора. Заявка 3649
	ТЗЛомбарды = ТаблицаЗБ.Выгрузить(, "Ломбард");
	ТЗЛомбарды.Свернуть("Ломбард");
			
	Если ТекЛомбард <> Неопределено Тогда
		Если ТЗЛомбардыОтделения <> Неопределено Тогда
			
			МассивУдалениИзСпискаЛомбардов = Новый Массив;
			МассивУдалениИзСпискаОтделения = Новый Массив;
			
			Для каждого СтрЛомб Из ТЗЛомбардыОтделения Цикл
				Отбор = Новый Структура;
				Отбор.Вставить("Ломбард", СтрЛомб.Ломбард);
				
				НайденныйЛомбард = ТЗЛомбарды.НайтиСтроки(Отбор);
				
				Если СтрЛомб.Ломбард = ТекЛомбард И НайденныйЛомбард.Количество() > 0 Тогда
					МассивУдалениИзСпискаЛомбардов.Добавить(НайденныйЛомбард[0]);
					МассивУдалениИзСпискаОтделения.Добавить(СтрЛомб);
				ИначеЕсли НайденныйЛомбард.Количество() > 0 Тогда
					МассивУдалениИзСпискаЛомбардов.Добавить(НайденныйЛомбард[0]);
				Иначе
					МассивУдалениИзСпискаОтделения.Добавить(СтрЛомб);
				КонецЕсли;
			КонецЦикла;
			
			Для каждого СтрМ Из МассивУдалениИзСпискаЛомбардов Цикл
				ТЗЛомбарды.Удалить(СтрМ);
			КонецЦикла;
			
			Для каждого СтрМ Из МассивУдалениИзСпискаОтделения Цикл
				ТЗЛомбардыОтделения.Удалить(СтрМ);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	//+МАН 28.01.26 Закомментировал, то что было ранее.
	//Для каждого Стр Из ТаблицаЗБ цикл  
	//	Если Элементы.Ломбард.СписокВыбора.НайтиПоЗначению(стр.Ломбард) = неопределено Тогда 
	//		Если НЕ стр.Ломбард = ТекЛомбард Тогда
	//		    Элементы.Ломбард.СписокВыбора.Добавить(стр.Ломбард, стр.Ломбард.НаименованиеПолное);  
	//		КонецЕсли;	
	//	КонецЕсли;	
	//Конеццикла;      	
	//Элементы.Ломбард.СписокВыбора.СортироватьПоПредставлению();

	ТЗЛомбарды = СортироватьТЗЛомбарды(ТЗЛомбарды);

	Для каждого Стр Из ТЗЛомбарды Цикл
		Если Элементы.Ломбард.СписокВыбора.НайтиПоЗначению(стр.Ломбард) = Неопределено Тогда
		    Элементы.Ломбард.СписокВыбора.Добавить(стр.Ломбард, стр.Ломбард.НаименованиеПолное);
		КонецЕсли;
	Конеццикла;
	
	//Элементы.Ломбард.СписокВыбора.СортироватьПоПредставлению();
	
	Если ТекЛомбард <> Неопределено Тогда
		Для каждого Стр Из ТЗЛомбардыОтделения Цикл
			Если Элементы.Ломбард.СписокВыбора.НайтиПоЗначению(стр.Ломбард) = Неопределено Тогда
				Элементы.Ломбард.СписокВыбора.Вставить(0, стр.Ломбард, стр.Ломбард.НаименованиеПолное); 
			КонецЕсли;
		Конеццикла;
	КонецЕсли;
	//-МАН
	
	Если НЕ ТекЛомбард = неопределено Тогда
		Элементы.Ломбард.СписокВыбора.Вставить(0, ТекЛомбард, ТекЛомбард.НаименованиеПолное); 
	КонецЕсли;	
	Если Элементы.Ломбард.СписокВыбора.Количество() > 1 Тогда 
		Элементы.Ломбард.СписокВыбора.Добавить(Справочники.ЛБ_Ломбарды.ПустаяСсылка(), "Все ломбарды");
	КонецЕсли;    
	Если НЕ ЗначениеЗаполнено(Ломбард) Тогда
		Если Элементы.Ломбард.СписокВыбора.Количество() > 0 Тогда 
			Если НЕ ТекЛомбард = неопределено Тогда
		         Ломбард = Элементы.Ломбард.СписокВыбора.Получить(0).Значение;
			Иначе
				 Ломбард = Справочники.ЛБ_Ломбарды.ПустаяСсылка();
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Функция СоздатьНовуюОплатуПроцентов(Дата, ЗалоговыйБилет)
	ДокументОбъект = Документы.ЛБ_ОперацияПоЗалогу.СоздатьДокумент(); 
	ДокументОбъект.ПредыдущаяОперация = ЗалоговыйБилет; 
	ДокументОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов;
	ДокументОбъект.Дата = Дата; 
	ДокументОбъект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить();
	ДокументОбъект.ПроцентнаяСхема = ЗалоговыйБилет.ПроцентнаяСхема;  
	Возврат ДокументОбъект; 
КонецФункции

&НаСервере
Функция РасчитатьДолгПоПроцентам(Дата, ЗалоговыйБилет, СуммаЗайма, ПричинаПримененияПроцентнойСхемы, ДатаНачалаРасчета) 
	ДокументОбъект = СоздатьНовуюОплатуПроцентов(Дата, ЗалоговыйБилет); 	    
		   
	СтруктураП = ЛБ_УправлениеЛомбардом.ПолучитьПредельныеЗначенияПроцентов(ЗалоговыйБилет.Дата, ЗалоговыйБилет.Организация);
	Если НЕ СтруктураП = неопределено Тогда
	    ПланкаПроцентов = СтруктураП.ПланкаПроцентов;
		ПредельноеЗначениеПроцентов = ЗалоговыйБилет.СуммаСсуды*СтруктураП.ПланкаПроцентов; 
	Иначе
		ПредельноеЗначениеПроцентов = 0;
	КонецЕсли;   
	СтруктураОкр = ЛБ_УправлениеЛомбардом.ПолучитьУсловияОкругленияПроцентов(ЗалоговыйБилет);
	Установки = ЛБ_УправлениеЛомбардом.ПолучитьУсловияПоДоговору(ЗалоговыйБилет); 	
	Результат = ЛБ_ОбщийМодуль.РассчитатьСуммуПроцентовОплата(ДокументОбъект, ДатаНачалаРасчета, ПредельноеЗначениеПроцентов, ПричинаПримененияПроцентнойСхемы, Установки, СтруктураОкр); 
			
	Возврат Результат.СуммаПроцентов;
КонецФункции

&НаСервере
Функция ЕстьДоверенности(ЗБ)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗБ);  
	Запрос.УстановитьПараметр("СтатусДоверенности", Перечисления.ЛБ_СтатусыДоверенностей.ДоверенностьОформлена);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДоверенностиСрезПоследних.Доверенность КАК Доверенность,
	               |	ЛБ_ДоверенностиСрезПоследних.СтатусДоверенности КАК СтатусДоверенности
	               |ИЗ
	               |	РегистрСведений.ЛБ_Доверенности.СрезПоследних(, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_ДоверенностиСрезПоследних
	               |ГДЕ
	               |	ЛБ_ДоверенностиСрезПоследних.СтатусДоверенности = &СтатусДоверенности";
	ТаблицаД = Запрос.Выполнить().Выгрузить();
	ДатаПроверки = ТекущаяДатаСеанса();
	Для каждого стрД из ТаблицаД цикл   
		Если СтрД.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.ДоверенностьОформлена Тогда
			ДоверенностьДействует = Истина;
			Если СтрД.Доверенность.СрокДействияДоверенности >= НачалоДня(ДатаПроверки) Тогда 
				Если НЕ ЛБ_ОбщийМодуль.ПроверитьЕстьДатаСмерти(СтрД.Доверенность.Клиент, ДатаПроверки) = неопределено Тогда   
					ДоверенностьДействует = Ложь;
				ИначеЕсли НЕ ЛБ_ОбщийМодуль.ПроверитьЕстьДатаСмерти(СтрД.Доверенность.ПредставительКлиента, ДатаПроверки) = неопределено Тогда  
                    ДоверенностьДействует = Ложь;					
				КонецЕсли;	              
			ИначеЕсли СтрД.Доверенность.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Наследство Тогда
				Если НЕ ЛБ_ОбщийМодуль.ПроверитьЕстьДатаСмерти(СтрД.Доверенность.ПредставительКлиента, ДатаПроверки) = неопределено Тогда  
					ДоверенностьДействует = Ложь;	
				КонецЕсли;	
			Иначе                         	
				ДоверенностьДействует = Ложь;
			КонецЕсли;  
		Иначе
			ДоверенностьДействует = Ложь;
		КонецЕсли; 
		Если ДоверенностьДействует Тогда  
			Возврат Истина;
        КонецЕсли;
	КонецЦикла;  
  	Возврат Ложь;
КонецФункции

&НаСервере
Функция ПолучитьТекущуюПроцентнуюСтавку(ЗалоговыйБилет, ПричинаПрименения)
	СтавкаП = 0;
	ДатаКонРезультат = ТекущаяДатаСеанса();
	
	ТаблицаСтавок = ЗалоговыйБилет.ПроцентныеСтавкиПоПериодам.Выгрузить();
	УдСтроки = новый СписокЗначений;
	Для каждого стр Из ТаблицаСтавок Цикл 
		Если Стр.ПричинаПрименения =  ПричинаПрименения Тогда
			Продолжить;
		КонецЕсли;
		УдСтроки.Добавить(Стр);
	Конеццикла;	               
	Для каждого Эл из УдСтроки Цикл 
		ТаблицаСтавок.Удалить(Эл.Значение);
	Конеццикла;	  
	
	Если ТаблицаСтавок.Количество() > 0 Тогда
		СтрС = ТаблицаСтавок.Получить(0);  
		СтавкаП = СтрС.ПроцентнаяСтавка; 
		Если СтрС.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Акционная Тогда
			Если НЕ СтрС.ПроцентнаяСтавкаАкция = 0 Тогда
				СтавкаП = СтрС.ПроцентнаяСтавкаАкция;
			ИначеЕсли НЕ СтрС.ОтклонениеАкцияОтносительное = 0 Тогда	 
				СтавкаП = СтрС.ПроцентнаяСтавка + СтрС.ПроцентнаяСтавка*СтрС.ОтклонениеАкцияОтносительное/100;
			ИначеЕсли НЕ СтрС.ОтклонениеАкцияАбсолютное = 0 Тогда
				СтавкаП = СтрС.ПроцентнаяСтавка + СтрС.ОтклонениеАкцияАбсолютное;
		    КонецЕсли; 
		КонецЕсли;	
	КонецЕсли;	
  
   	Возврат СтавкаП;
КонецФункции

&НаСервере
Процедура ЗаполнитьСтрокуТаблицыЗБ(Стр, НоваяСтр)
	НоваяСтр.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
	НоваяСтр.ДатаЗБ = Стр.ЗалоговыйБилет.Дата; 
	НоваяСтр.НомерЗБ = Стр.ЗалоговыйБилет.НомерЗалоговогоБилета;
	НоваяСтр.Ломбард = Стр.Ломбард;
	НоваяСтр.СтатусЗалоговогоБилета = Стр.СтатусЗалоговогоБилета;
	НоваяСтр.СуммаЗайма = Стр.ЗалоговыйБилет.СуммаСсуды;  
	НоваяСтр.СуммаОценки = Стр.ЗалоговыйБилет.Товары.Итог("СуммаОценкиМаксимальная"); 
	НоваяСтр.ДатаВозврата = стр.ДатаВыкупа; 
	НоваяСтр.ДатаВозвратаЛьготная = стр.ДатаВыкупаЛьготныйСрок; 
	НоваяСтр.Действующий = стр.Действующий;   
	Если стр.Действующий Тогда
	    НоваяСтр.ТекСрокЗайма = (НачалоДня(ТекущаяДатаСеанса()) - НачалоДня(Стр.ЗалоговыйБилет.Дата)) / (60 * 60 * 24);  
	Иначе
		НоваяСтр.ТекСрокЗайма = 0;
	КонецЕсли;	
		
	Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("ЗалоговыйБилет", Стр.ЗалоговыйБилет); 
	Запрос.УстановитьПараметр("Дата", Стр.ЗалоговыйБилет.Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПредельныйСрокЗайма КАК ПредельныйСрокЗайма,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПредельныйСрокЗаймаДни КАК ПредельныйСрокЗаймаДни
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&Дата, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда  
	    ПредельныйСрокЗайма = Выборка.ПредельныйСрокЗайма;
		ПредельныйСрокЗаймаДни = Выборка.ПредельныйСрокЗаймаДни;
		НоваяСтр.ПСЗ = Формат(ПредельныйСрокЗайма, "ДФ=dd.MM.yyyy") + " (" + Строка(ПредельныйСрокЗаймаДни) + ")";
	КонецЕсли;  
	СК = ?(Не ПустаяСтрока(Стр.СхемаКредитования.НаименованиеДляПечати), Стр.СхемаКредитования.НаименованиеДляПечати, Стр.СхемаКредитования.Наименование);  
    НоваяСтр.ВидСрок = СокрЛП(СК) + "/" + Строка(Стр.ЗалоговыйБилет.срокЗалога);  
	НоваяСтр.ГибкийПроцент = Стр.СхемаКредитования.ПризнакПримененияГибкогоПроцента; 
	//НачисленоПроценты = 0;   
	//НачисленияОстановлены = Ложь;
	//Если Стр.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят ИЛИ 
	//	 Стр.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен ИЛИ
	//	 Стр.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Остановлен Тогда   
	//	НачисленияОстановлены = Истина;
	//КонецЕсли;	

	//Если НЕ ДатаСмерти = Дата(1,1,1) Тогда   
	//	ПредыдущийСтатусЗБ = ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(ДатаСмерти-1, Стр.ЗалоговыйБилет); 
	//	Если ПредыдущийСтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят ИЛИ 
	//	     ПредыдущийСтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен ИЛИ
	//	     ПредыдущийСтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Остановлен Тогда 
	//		НачисленияОстановлены = Истина; 
	//	КонецЕсли; 
	//КонецЕсли;
	//
	//Если НЕ Стр.СуммаЗайма = 0 Тогда 
	//	СтавкаП = ПолучитьТекущуюПроцентнуюСтавку(Стр.ЗалоговыйБилет, Стр.ПричинаПрименения); 
	//	НоваяСтр.ПроцентнаяСтавка = Формат(СтавкаП, "ЧЦ=10; ЧДЦ=3"); 
	//	Если НачисленияОстановлены Тогда  
	//		НачисленоПроценты = ЛБ_ОбщийМодуль.ПолучитьОстатокПроцентов(, Стр.ЗалоговыйБилет);
	//		НоваяСтр.СуммаПроцентовВДень = "0,00";
	//	Иначе	
	//		ВидОкругленияСуммыПроцентов = ПолучитьВидОкругленияСуммыПроцентов(Стр.ЗалоговыйБилет.Дата);
	//		Если ВидОкругленияСуммыПроцентов = Перечисления.ЛБ_ВидыОкругленияСуммыПроцентов.ОкруглениеПослеУмноженияНаКоличествоДней Тогда
	//	        НоваяСтр.СуммаПроцентовВДень = Формат(Стр.СуммаЗайма*СтавкаП/100, "ЧЦ=15; ЧДЦ=5");   
	//		Иначе
	//			НоваяСтр.СуммаПроцентовВДень = Формат(Стр.СуммаЗайма*СтавкаП/100, "ЧЦ=15; ЧДЦ=2");
	//		КонецЕсли;		
	//		
	//		НачисленоПроценты = РасчитатьДолгПоПроцентам(ТекущаяДатаСеанса(), Стр.ЗалоговыйБилет, Стр.СуммаЗайма, Стр.ПричинаПрименения, Стр.ДатаНачалаРасчетаПроцентов);
	//		//Если НЕ ТаблицаНачислений.Количество() = 0 Тогда
	//		//	НачисленоПроценты = ТаблицаНачислений.Итог("СуммаПроцентов");			
	//		//КонецЕсли; 
	//	КонецЕсли;
	//КонецЕсли;	
	//НоваяСтр.Долг = Стр.СуммаЗайма + НачисленоПроценты;
	//НоваяСтр.Доверенность = ЕстьДоверенности(Стр.ЗалоговыйБилет);
КонецПроцедуры    

&НаСервере
Процедура ЗаполнитьТаблицуЗБ(ТаблицаЗапроса)
	ТаблицаЗБ.Очистить();
	Для каждого Стр Из ТаблицаЗапроса Цикл
		НоваяСтр = ТаблицаЗБ.Добавить();   
		ЗаполнитьСтрокуТаблицыЗБ(Стр, НоваяСтр);
	КонецЦикла;	
	ТаблицаЗБ.Сортировать("ДатаЗБ Убыв");
КонецПроцедуры	

&НаКлиенте
Процедура ТекущееСостояниеЗБ(Команда)  
	ТекСтрока = Элементы.ТаблицаЗБ.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда 
		Параметрыформы = Новый структура;
		Параметрыформы.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет); 
		ОписаниеОповещения = новый ОписаниеОповещения("ПослеВыбораТекущееСостояниеЗБ",ЭтотОбъект, );
		ОткрытьФорму("ОбщаяФорма.ЛБ_ТекущееСостояниеЗалога", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВыбораТекущееСостояниеЗБ(Результат,Параметры) Экспорт
	ТекСтрока = Элементы.ТаблицаЗБ.ТекущиеДанные;
    ПерезаполнитьСтрокуПоЗБ(ТекСтрока.ПолучитьИдентификатор());
КонецПроцедуры	

&НаСервере
Процедура ПерезаполнитьСтрокуПоЗБ(Идентификатор)
	СтрТаб = ТаблицаЗБ.НайтиПоИдентификатору(Идентификатор);
	ТаблицаЗапроса = ЛБ_ОбщийМодуль.ПолучитьСписокЗБКлиента(Залогодатель, СтрТаб.ЗалоговыйБилет);
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
		Стр = ТаблицаЗапроса.Получить(0);
	    ЗаполнитьСтрокуТаблицыЗБ(Стр, СтрТаб); 
	КонецЕсли;
	
	//проверим создание нового ЗБ 
	ТаблицаЗапроса = ЛБ_ОбщийМодуль.ПолучитьСписокЗБКлиента(Залогодатель);
	Для каждого Стр из ТаблицаЗапроса Цикл  
		Отбор = Новый Структура;
		Отбор.Вставить("ЗалоговыйБилет", Стр.ЗалоговыйБилет); 
		Строки = ТаблицаЗБ.НайтиСтроки(Отбор);
		Если Строки.Количество() = 0 Тогда  
			НоваяСтр = ТаблицаЗБ.Добавить();   
		    ЗаполнитьСтрокуТаблицыЗБ(Стр, НоваяСтр); 
			Элементы.ТаблицаЗБ.ТекущаяСтрока = НоваяСтр.ПолучитьИдентификатор();
		КонецЕсли;	
	КонецЦикла;	
	ТаблицаЗБ.Сортировать("ДатаЗБ Убыв");	
КонецПроцедуры	

&НаКлиенте
Процедура ИсторияЗБ(Команда)  
	ТекСтрока = Элементы.ТаблицаЗБ.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда 
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Клиент", Залогодатель);
		ПараметрыФормы.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет);	 
								
		ОткрытьФорму("Отчет.ЛБ_ИсторияЗалоговогоБилета.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЛомбардПриИзменении(Элемент)
	УстановитьОтборНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьВидОкругленияСуммыПроцентов(Дата)
	Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("Организация", Константы.ЛБ_ОсновнаяОрганизация.Получить());
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	УсловияПредоставленияКредита.ВидОкругленияСуммыПроцентов КАК ВидОкругленияСуммыПроцентов
				   |ИЗ
	               |	РегистрСведений.ЛБ_НастройкиЗаймаВерхнегоУровня.СрезПоследних(&Дата, Организация = &Организация) КАК УсловияПредоставленияКредита";
	Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда  
	    Возврат Выборка.ВидОкругленияСуммыПроцентов;
	КонецЕсли;  
	Возврат Перечисления.ЛБ_ВидыОкругленияСуммыПроцентов.ОкруглениеДоУмноженияНаКоличествоДней;
КонецФункции	

&НаКлиенте
Процедура ТаблицаЗБВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтрока = Элементы.ТаблицаЗБ.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда 
		Параметрыформы = Новый структура;
		Параметрыформы.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет); 
		ОписаниеОповещения = новый ОписаниеОповещения("ПослеВыбораТекущееСостояниеЗБ",ЭтотОбъект, );
		ОткрытьФорму("ОбщаяФорма.ЛБ_ТекущееСостояниеЗалога", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры

//+МАН 27.10.25
&НаСервере
Функция ПроверитьСовпадениеСПеречнями();

	СтруктураПроверкиВРегистре = ЛБ_ОбщегоНазначения.НайтиЗаписьВРегистре(ТекущаяДата(), Залогодатель);
	
	Если СтруктураПроверкиВРегистре.Количество <> 0 И (СтруктураПроверкиВРегистре.ТребуетПроверки
		ИЛИ СтруктураПроверкиВРегистре.Запрещено ИЛИ СтруктураПроверкиВРегистре.Разрешено) Тогда
		ВидСовпадения = Перечисления.ЛБ_ВидыЧастичныхСовпадений.ПустаяСсылка();
		//ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ПустаяСсылка();
		
		ЛБ_ОбщегоНазначения.ЗаписатьВРегистр(ТекущаяДата(), Залогодатель, ВидСовпадения, "", Ложь);
	КонецЕсли;

	СтруктураПроверки = ЛБ_ОбщегоНазначения.ПроверитьКлиентаПоПеречням(Залогодатель);
	
	//Если СтруктураПроверки.Совпадение И СтруктураПроверки.ВидСовпадения = "Частичное" Тогда
	//	
	//	СтруктураПроверки.Совпадение = Ложь;
	//	
	//	Возврат СтруктураПроверки;
	//	
	//ИначеЕсли СтруктураПроверки.Совпадение И СтруктураПроверки.ВидСовпадения <> "Частичное" Тогда
	//	Возврат СтруктураПроверки;
	//КонецЕсли;

	Возврат СтруктураПроверки;
	
КонецФункции

&НаКлиенте
Процедура СортироватьВ(Команда) 
	ТекущийЭлемент = Элементы.ТаблицаЗБ; 
	ТЭ_имя_объект=ТекущийЭлемент.Имя;
    ТЭ_поле = ТекущийЭлемент.ТекущийЭлемент.имя;

    имяКолонки=СтрЗаменить(ТЭ_поле,ТЭ_имя_объект,"");
    СортироватьНасервере(имяКолонки, "Возр");
КонецПроцедуры

&НаКлиенте
Процедура СортироватьУ(Команда)
	ТекущийЭлемент = Элементы.ТаблицаЗБ; 
	ТЭ_имя_объект=ТекущийЭлемент.Имя;
	ТЭ_поле = ТекущийЭлемент.ТекущийЭлемент.имя;

    имяКолонки = СтрЗаменить(ТЭ_поле,ТЭ_имя_объект,"");
    СортироватьНасервере(имяКолонки,"Убыв");
КонецПроцедуры

&НаСервере
Процедура сортироватьНасервере(имяКолонки,ВидСортировки) 
	тз= ТаблицаЗБ.Выгрузить();
    КолонкаСортировки = тз.Колонки.Найти(имяКолонки);
	Если КолонкаСортировки <> Неопределено тогда   
		Если ИмяКолонки = "Ломбард" Тогда
			 тз.Колонки.Добавить("НомерЛ");
			 Для каждого Стр Из тз Цикл   
				 Попытка 
				     Стр.НомерЛ = Число(Стр.Ломбард.НомерЛомбарда); 
				 Исключение	 
					 Стр.НомерЛ = 0;
				 КонецПопытки;	 
			 Конеццикла;
			 тз.Сортировать("НомерЛ" + " " + ВидСортировки); 
			 ТаблицаЗБ.Загрузить(тз);
		Иначе	
            ТаблицаЗБ.Сортировать(имяКолонки + " " + ВидСортировки);
		КонецЕсли;	
     КонецЕсли;
конецпроцедуры

&НаСервере
Функция ПроверитьЛомбардСоздания(Залогодатель)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПервых.ОтветственныйЛомбард КАК ОтветственныйЛомбард
		|ИЗ
		|	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПервых(, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПервых
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПервых.Период";
	
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Возврат РезультатЗапроса.ОтветственныйЛомбард;
	КонецЕсли;
	
	Возврат Справочники.ЛБ_Ломбарды.ПустаяСсылка();
	
КонецФункции

//+МАН 27.11.25
&НаСервере
Функция ПроверитьНаличиеДанных(Клиент, Дата)
	//++ИвановВВ 12.2025, по ТЗ на согласия
	//было:
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ЛБ_ИзменениеКонтактныхДанныхКлиентаСрезПоследних.Период КАК Период,
	//	|	ЛБ_ИзменениеКонтактныхДанныхКлиентаСрезПоследних.Клиент КАК Клиент
	//	|ИЗ
	//	|	РегистрСведений.ЛБ_ИзменениеКонтактныхДанныхКлиента.СрезПоследних(&Дата, Клиент = &Клиент) КАК ЛБ_ИзменениеКонтактныхДанныхКлиентаСрезПоследних";
	//
	//Запрос.УстановитьПараметр("Клиент", Клиент);
	//Запрос.УстановитьПараметр("Дата", Дата);
	//
	//РезультатЗапроса = Запрос.Выполнить().Выбрать();
	//
	//Если РезультатЗапроса.Следующий() Тогда
	//	Возврат Истина;
	//КонецЕсли;
	//
	//Возврат Ложь;
	//стало:
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ИзменениеКонтактныхДанныхКлиентаСрезПоследних.Ошибочное КАК Ошибочное
		|ИЗ
		|	РегистрСведений.ЛБ_ИзменениеКонтактныхДанныхКлиента.СрезПоследних(
		|			&Дата,
		|			Клиент = &Клиент
		|				И Статус = &Статус) КАК ЛБ_ИзменениеКонтактныхДанныхКлиентаСрезПоследних";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Статус", Перечисления.ЛБ_СтатусыИзмененийКонтактныхДанных.Изменены);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если Выборка.Ошибочное Тогда
			Возврат "Ошибочное";
		Иначе	
			Возврат Истина;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;

	//--ИвановВВ
КонецФункции

//+МАН 04.12.25
&НаКлиенте
Процедура УстановитьДоступностьПослеСохранения()
	Элементы.ФормаКнопкаЗаписатьИЗакрыть.Доступность = Ложь;
	Элементы.ФормаКнопкаЗаписать.Доступность = Ложь;
	Элементы.ГруппаФИО.Доступность = Ложь;
	Элементы.ГруппаКомментарий.Доступность = Ложь;
	Элементы.ГруппаКонтактнаяИнформация.Доступность = Ложь;
	Элементы.ГруппаАдреса.Доступность = Ложь;
	Элементы.ГруппаФИО_Англ.Доступность = Ложь;
	Элементы.Гражданство.Доступность = Ложь;
	Элементы.ДокументыГруппаДобавить.ТолькоПросмотр = Истина;
	Элементы.ДокументыГруппаДобавить.Доступность = Ложь;
	Элементы.ГруппаФЛ.Доступность = Ложь;
	Элементы.ГруппаФЛ1.Доступность = Ложь;
	Элементы.ГруппаАнкетаДоп.Доступность = Ложь;
	Элементы.ГруппаВладельцы.Доступность = Ложь;
	Элементы.ГруппаИПДЛ.Доступность = Ложь;
	Элементы.ГруппаДЛПМО_РДПЛ.Доступность = Ложь;
	Элементы.ГруппаОтказ.Доступность = Ложь;
	Элементы.ТаблицаДопСтатусов.ТолькоПросмотр = Истина;
	Элементы.ТаблицаСлужебныхСтатусов.ТолькоПросмотр = Истина;
	Элементы.ФормаКнопкаРедактировать.Видимость = Истина;
	Элементы.ЭДО.Доступность = Истина;
	Элементы.ЭДО.ТолькоПросмотр = Ложь;
	Элементы.Согласие.Доступность = Истина;
	Элементы.Согласие.ТолькоПросмотр = Ложь;
	
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры

//+МАН 15.12.25 Обрезанная версия функции ПроверитьТелефоны.
&НаСервере
Функция ПроверитьМобильныйТелефон(ВводимыйТелефон)
	ТелефонОК = Истина;
	Если НЕ ПустаяСтрока(ВводимыйТелефон) Тогда
		ТелефонДляПроверки = СокрЛП(ВводимыйТелефон);
		ТелефонДляПроверки = СтрЗаменить(ТелефонДляПроверки, " ", "");
		ТелефонДляПроверки = СтрЗаменить(ТелефонДляПроверки, "+", "");
		ТелефонДляПроверки = СтрЗаменить(ТелефонДляПроверки, "(", "");
		ТелефонДляПроверки = СтрЗаменить(ТелефонДляПроверки, ")", "");
		Если НЕ СтрДлина(ТелефонДляПроверки) = 11 Тогда
			ТелефонОК = Ложь;
		КонецЕсли;
		ТолькоНули = Истина;
		ТелефонДляПроверки = Прав(ТелефонДляПроверки, СтрДлина(ТелефонДляПроверки)-2);
		Для сч = 1 по СтрДлина(СокрЛП(ТелефонДляПроверки)) Цикл
			Если Сред(СокрЛП(ТелефонДляПроверки), сч, 1) = "0" Тогда
				Продолжить;
			КонецЕсли;
			ТолькоНули = Ложь;
			Прервать;
		Конеццикла;
		Если ТолькоНули Тогда  
			ТелефоныОК = Ложь;
		КонецЕсли;	
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ТелефонОК", ТелефонОК);
	СтруктураВозврата.Вставить("ТолькоНули", ТолькоНули);
	
	Возврат СтруктураВозврата;
КонецФункции

&НаКлиенте
Процедура СогласиеНаСМСРассылкуПриИзменении(Элемент)
	
	Если СокрЛП(Телефон) = "" Тогда
		Предупреждение("Номер телефона не заполнен.");
		СогласиеНаСМСРассылку = Ложь;
		Возврат;
	КонецЕсли;
	
	СтруктураПроверки = ПроверитьМобильныйТелефон(Телефон);
	
	Если НЕ СтруктураПроверки.ТелефонОК ИЛИ СтруктураПроверки.ТолькоНули Тогда
		Предупреждение("Телефон должен начинаться с 9 и содержать 10 цифр. Введите корректное значение или очистите поле.");
		СогласиеНаСМСРассылку = Ложь;
		Возврат;
	КонецЕсли;
	
	Если СтруктураПроверки.ТелефонОК И СогласиеНаСМСРассылку Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросСМСРассылки", ЭтаФорма); 
		ПоказатьВопрос(Оповещение, "На указанный номер будут приходить СМС оповещения об окончании льготного срока",
		РежимДиалогаВопрос.ОК, 0,,"Проинформируйте клиента:");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗБПриАктивизацииСтроки(Элемент)
	ЭтоЛомбард = ПользовательЛомбард();
	
	ТекСтр = Элементы.ТаблицаЗБ.ТекущиеДанные;
	
	Если ТекСтр <> Неопределено Тогда
		Если ТекСтр.СтатусЗалоговогоБилета = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыЗалоговыхБилетов.Реализован") И ЭтоЛомбард  Тогда
			Элементы.ТекущееСостояниеЗБ.Доступность = Ложь;
		Иначе
			Элементы.ТекущееСостояниеЗБ.Доступность = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПользовательЛомбард()
	Возврат ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард;
КонецФункции

&НаСервере
Функция ПолучитьЛомбардыОтделения(Ломбард)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард
		|ИЗ
		|	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(
		|			,
		|			ВЫБОР
		|				КОГДА Отделение В
		|						(ВЫБРАТЬ
		|							ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
		|						ИЗ
		|							РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(, Ломбард = &Ломбард) КАК ЛБ_ОтделенияЛомбардовСрезПоследних)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
		//|ГДЕ
		//|	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард <> &Ломбард
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.НомерЧисловой  УБЫВ";
		//|	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.НомерЛомбарда  УБЫВ";
	
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() > 0 Тогда
		Возврат Результат;
	КонецЕсли;

	Возврат Неопределено;
КонецФункции

&НаСервере
Функция СортироватьТЗЛомбарды(ТЗЛомбарды)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВнешнийИсточник.Ломбард КАК Ломбард
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ВнешнийИсточник КАК ВнешнийИсточник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Ломбард КАК Ломбард
	|ИЗ
	|	ВТ КАК ВТ
	|	
	|УПОРЯДОЧИТЬ ПО
	|	ВТ.Ломбард.НомерЧисловой";
	
	Запрос.УстановитьПараметр("ВнешнийИсточник", ТЗЛомбарды);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
//-МАН
//-Мельников

	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
