
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСписокПроб()
	СписокПроба = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_Пробы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЛБ_Пробы КАК ЛБ_Пробы
	               |ГДЕ
	               |	ЛБ_Пробы.ПометкаУдаления = ЛОЖЬ
	               |АВТОУПОРЯДОЧИВАНИЕ";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		Если НЕ ПробыМеталла.НайтиПоЗначению(Выборка.Ссылка) = неопределено Тогда
			Пометка = Истина; 
		Иначе
			Пометка = Ложь;
		КонецЕсли;
		СписокПроба.Добавить(Выборка.Ссылка, Выборка.Ссылка, Пометка);
	Конеццикла;   	    
    Возврат СписокПроба;
КонецФункции	

&НаКлиенте
Процедура СтрокаПробыМеталлаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	СтандартнаяОбработка = Ложь;
	
	СписокПроба = ЗаполнитьСписокПроб();	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", "Выберите пробы металлов"); 
	ПараметрыФормы.Вставить("Список", СписокПроба); 
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораПроб", ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаВыбораИзСписка", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПроб(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;   
	
	СтрокаПробыМеталла = "";
	ПробыМеталла.Очистить(); 
    Для Каждого Проба Из Результат Цикл
		Если Проба.Пометка Тогда   
			ПробыМеталла.Добавить(Проба.Значение);
            СтрокаПробыМеталла = СтрокаПробыМеталла + ?(ПустаяСтрока(СтрокаПробыМеталла), "", "; ") + СокрЛП(Проба.Значение);
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ИзделияСБриллиантамиПриИзменении(Элемент)
	Если ИзделияСБриллиантами Тогда
		ИзделияБезВставок = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ИзделияБезВставокПриИзменении(Элемент)
	Если ИзделияБезВставок Тогда
		ИзделияСБриллиантами = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСписокКатегорий()
	СписокКатегория = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КатегорииОбъектовЗалога.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЛБ_КатегорииОбъектовЗалога КАК ЛБ_КатегорииОбъектовЗалога
	               |ГДЕ
	               |	ЛБ_КатегорииОбъектовЗалога.ПометкаУдаления = ЛОЖЬ
	               |АВТОУПОРЯДОЧИВАНИЕ";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		Если НЕ Категории.НайтиПоЗначению(Выборка.Ссылка) = неопределено Тогда
			Пометка = Истина; 
		Иначе
			Пометка = Ложь;
		КонецЕсли;
		СписокКатегория.Добавить(Выборка.Ссылка, Выборка.Ссылка, Пометка);
	Конеццикла;   	    
    Возврат СписокКатегория;
КонецФункции	

&НаКлиенте
Процедура СтрокаКатегорииНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	СписокКатегория = ЗаполнитьСписокКатегорий();	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", "Выберите категории"); 
	ПараметрыФормы.Вставить("Список", СписокКатегория); 
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораКатегорий", ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаВыбораИзСписка", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКатегорий(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;   
	
	СтрокаКатегории = "";
	Категории.Очистить(); 
    Для Каждого Категория Из Результат Цикл
		Если Категория.Пометка Тогда   
			Категории.Добавить(Категория.Значение);
            СтрокаКатегории = СтрокаКатегории + ?(ПустаяСтрока(СтрокаКатегории), "", "; ") + СокрЛП(Категория.Значение);
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры    

&НаСервере
Функция ЗаполнитьСписокГрупп()
	СписокГрупп = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ГруппыОбъектовЗалога.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЛБ_ГруппыОбъектовЗалога КАК ЛБ_ГруппыОбъектовЗалога
	               |ГДЕ
	               |	ЛБ_ГруппыОбъектовЗалога.ПометкаУдаления = ЛОЖЬ
	               |АВТОУПОРЯДОЧИВАНИЕ";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		Если НЕ Группы.НайтиПоЗначению(Выборка.Ссылка) = неопределено Тогда
			Пометка = Истина; 
		Иначе
			Пометка = Ложь;
		КонецЕсли;
		СписокГрупп.Добавить(Выборка.Ссылка, Выборка.Ссылка, Пометка);
	Конеццикла;   	    
    Возврат СписокГрупп;
КонецФункции	


&НаКлиенте
Процедура СтрокаГруппыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	СписокГрупп = ЗаполнитьСписокГрупп();	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", "Выберите группы"); 
	ПараметрыФормы.Вставить("Список", СписокГрупп); 
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораГрупп", ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаВыбораИзСписка", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораГрупп(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;   
	
	СтрокаГруппы = "";
	Группы.Очистить(); 
    Для Каждого Группа Из Результат Цикл
		Если Группа.Пометка Тогда   
			Группы.Добавить(Группа.Значение);
            СтрокаГруппы = СтрокаГруппы + ?(ПустаяСтрока(СтрокаГруппы), "", "; ") + СокрЛП(Группа.Значение);
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ПробыМеталла", ПробыМеталла);
	СтруктураОтбора.Вставить("Категории", Категории);
    СтруктураОтбора.Вставить("Группы", Группы);
	СтруктураОтбора.Вставить("ИзделияБезВставок", ИзделияБезВставок);
	СтруктураОтбора.Вставить("ИзделияСБриллиантами", ИзделияСБриллиантами);
	СтруктураОтбора.Вставить("ИзделияСНесколькимиМеталлами", ИзделияСНесколькимиМеталлами);

	ЭтаФорма.Закрыть(СтруктураОтбора);
КонецПроцедуры


&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры



