
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;  
	
	ДанныеВыбора = Новый СписокЗначений;   
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыТабеля.Контроль")); 
	Если НЕ ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыТабеля.Факт"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыТабеля.Проект"));
	КонецЕсли;
	

КонецПроцедуры
