
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Документ") Тогда
		Приказ = Параметры.Документ.Ссылка;  
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Приказ) Тогда 
		Сообщить("Не выбран приказ!");
		Возврат;
	КонецЕсли;     
	Если Параметры.ТолькоПросмотр = Истина Тогда
		Элементы.СохранитьИзменения.Доступность = ложь;
		Элементы.ТаблицаСК.ТолькоПросмотр = Истина;
	КонецЕсли;	
	
	ТаблицаСтавок.Загрузить(Приказ.СтавкиПроцентов.Выгрузить());
	ТаблицаДоп = ТаблицаСтавок.Выгрузить(, "СхемаКредитования");
	ТаблицаДоп.Свернуть("СхемаКредитования");   
	Если Параметры.Свойство("СхемаКредитования") Тогда
		СхемаКредитования = Параметры.СхемаКредитования;
	КонецЕсли;	                                        
	Если НЕ ЗначениеЗаполнено(СхемаКредитования) Тогда		
	    СхемаКредитования = ТаблицаДоп.Получить(0).СхемаКредитования; 
	КонецЕсли;	
	МассивСК = Новый Массив;    
	Для каждого СтрДоп Из ТаблицаДоп Цикл 
		МассивСК.Добавить(СтрДоп.СхемаКредитования);
	Конеццикла;	
	Элементы.СхемаКредитования.СписокВыбора.ЗагрузитьЗначения(МассивСК);
	
	ЗаполнитьТаблицыИзПриказа();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицыИзПриказа() 		
	ПараметрОтбора = Новый Структура;
	ПараметрОтбора.Вставить("СхемаКредитования", СхемаКредитования);
	ДиапазоныДоп = ТаблицаСтавок.Выгрузить(ПараметрОтбора, "ДиапазонСумм");
	ДиапазоныДоп.Свернуть("ДиапазонСумм");   
	
	КлючСтроки = 0; 
	ДиапазоныСК.Очистить();
	Для каждого СтрД Из ДиапазоныДоп Цикл 
		КлючСтроки = КлючСтроки + 1;
		НоваяСтрД = ДиапазоныСК.Добавить(); 
		НоваяСтрД.КлючСтроки = КлючСтроки; 
		НоваяСтрД.ДиапазонСумм = СтрД.ДиапазонСумм;
		НоваяСтрД.Порядок = СтрД.ДиапазонСумм.ПорядокСортировки;
	КонецЦикла;  
	ДиапазоныСК.Сортировать("Порядок");
	
	Для каждого СтрД Из ДиапазоныСК Цикл
	    ДобавитьКолонкуДоп(СтрД.КлючСтроки, СтрД.ДиапазонСумм);
	КонецЦикла;   
	
	ТаблицаСтавокДоп = ТаблицаСтавок.Выгрузить();
	//ТаблицаСтавокДоп.Свернуть("СхемаКредитования, ПричинаПрименения, СтатусЗалогодателя, ДеньНачалаПрименения");
	ТаблицаСтавокДоп.Свернуть("СхемаКредитования");
	
	ТаблицаСК.Очистить();
	Отбор = Новый Структура;
	Отбор.Вставить("СхемаКредитования", СхемаКредитования);
    Строки = ТаблицаСтавокДоп.НайтиСтроки(Отбор);
	Для каждого Стр Из Строки Цикл
		НоваяСтр = ТаблицаСК.Добавить();		 
		НоваяСтр.СхемаКредитования = Стр.СхемаКредитования; 
		//НоваяСтр.ПричинаПрименения = Стр.ПричинаПрименения;
		//НоваяСтр.СтатусЗалогодателя = Стр.СтатусЗалогодателя;   
		//НоваяСтр.ДеньНачалаПрименения = Стр.ДеньНачалаПрименения;
		
		ОтборД = Новый Структура;
		ОтборД.Вставить("СхемаКредитования", Стр.СхемаКредитования);
		//ОтборД.Вставить("ПричинаПрименения", Стр.ПричинаПрименения);
		//ОтборД.Вставить("СтатусЗалогодателя", Стр.СтатусЗалогодателя);
		//ОтборД.Вставить("ДеньНачалаПрименения", Стр.ДеньНачалаПрименения);
		Для каждого СтрД Из ДиапазоныСК Цикл
			ОтборД.Вставить("ДиапазонСумм", СтрД.ДиапазонСумм);
			СтрокиСК = ТаблицаСтавок.НайтиСтроки(ОтборД);
			Если НЕ СтрокиСК.Количество() = 0 Тогда 
				СтрК = СтрокиСК.Получить(0);
			    НоваяСтр["Диапазон_" + Строка(СтрД.КлючСтроки)] = СтрК.Ставка;  
			Иначе
				НоваяСтр["Диапазон_" + Строка(СтрД.КлючСтроки)] = 0; 
				НоваяСтрСтавок = ТаблицаСтавок.Добавить(); 
				НоваяСтрСтавок.СхемаКредитования = Стр.СхемаКредитования;
				//НоваяСтрСтавок.ПричинаПрименения = Стр.ПричинаПрименения;
				//НоваяСтрСтавок.СтатусЗалогодателя = Стр.СтатусЗалогодателя;
				//НоваяСтрСтавок.ДеньНачалаПрименения = Стр.ДеньНачалаПрименения;
				НоваяСтрСтавок.ДиапазонСумм = СтрД.ДиапазонСумм;
			КонецЕсли;	
        Конеццикла;
	Конеццикла;	 
	//ТаблицаСК.Сортировать("ПричинаПрименения, СтатусЗалогодателя, ДеньНачалаПрименения");
КонецПроцедуры   

&НаСервере
Процедура ДобавитьКолонкуДоп(КлючСтроки, Диапазон)
	МассивДобавляемыхРеквизитов = Новый Массив; 
	СписокТипов = Новый Массив;
    СписокТипов.Добавить(Тип("Число"));
     ОписаниеСоставногоТипа = Новый ОписаниеТипов(СписокТипов,,,Новый КвалификаторыЧисла(10,3));
	НовыйРеквизит = Новый РеквизитФормы("Диапазон_" + СокрЛП(КлючСтроки), ОписаниеСоставногоТипа, "ТаблицаСК");
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	 
	ПолеВвода = Элементы.Добавить(
		"Диапазон_" + СокрЛП(КлючСтроки),    //Имя элемента формы
		Тип("ПолеФормы"), //Тип, всегда ПолеФормы
		Элементы.ТаблицаСК); //Контейнер для поля ввода (Форма,Группа,Страница)
		
	ПолеВвода.Заголовок = СокрЛП(Диапазон);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	
	//Установка связи элемента с данными
	ПолеВвода.ПутьКДанным = "ТаблицаСК.Диапазон_" + СокрЛП(КлючСтроки); 
	ПолеВвода.ВыбиратьТип = Ложь;
	ПолеВвода.КнопкаСоздания = Ложь;
	ПолеВвода.КнопкаОткрытия = Ложь;
	//+МАН 19.02.25 Заявка 2792
	ПолеВвода.РежимРедактирования = РежимРедактированияКолонки.Непосредственно;
	//-МАН
КонецПроцедуры	

&НаСервере
Функция РасчетПСКГод(СхемаКредитования, ПричинаПрименения, СтатусЗалогодателя, ДиапазонСумм, СрокЗалога, НачислятьПроцентыЗаДеньЗалога)                                                                                                       
	СуммарнаяПроцентнаяСтавка = 0; 
	
	ОтборС = Новый структура;
	ОтборС.Вставить("СхемаКредитования", СхемаКредитования);
	ОтборС.Вставить("ПричинаПрименения", ПричинаПрименения);
	ОтборС.Вставить("СтатусЗалогодателя", СтатусЗалогодателя);
	ОтборС.Вставить("ДиапазонСумм", ДиапазонСумм);
	СтрокиС = ТаблицаСтавок.НайтиСтроки(ОтборС);
	Для сч = 0 По СтрокиС.Количество() - 1 Цикл 
		СтрС = строкиС.Получить(сч);
		ДеньНач = СтрС.ДеньНачалаПрименения;
		
		сч1 = сч + 1;
		Если сч1 >= СтрокиС.Количество() Тогда
			ДеньКон = СрокЗалога; 
		Иначе      
			СтрС1 = СтрокиС.Получить(сч1);
			ДеньКон = СтрС1.ДеньНачалаПрименения;  
			Если ДеньКон > СрокЗалога Тогда
				ДеньКон = СрокЗалога;
			КонецЕсли;	
		КонецЕсли;	

		КолДней = ДеньКон-ДеньНач+1;
		Ставка = СтрС.Ставка;
		СуммарнаяПроцентнаяСтавка = СуммарнаяПроцентнаяСтавка + Ставка*КолДней;
		Если ДеньКон = СрокЗалога Тогда  
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	Возврат ЛБ_УправлениеЛомбардом.РасчетПСКГодПрейскурант(Приказ.Дата, ?(НачислятьПроцентыЗаДеньЗалога, СрокЗалога+1, СрокЗалога), СуммарнаяПроцентнаяСтавка);  
КонецФункции

&НаСервере
Функция ПроверитьПСК() 
	Запрос = новый Запрос;  
	Запрос.УстановитьПараметр("Дата", Приказ.Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_УсловияПредоставленияКредитаСрезПоследних.СхемаКредитования КАК СхемаКредитования,
	               |	ЛБ_УсловияПредоставленияКредитаСрезПоследних.СрокЗалога КАК СрокЗалога
	               |ИЗ
	               |	РегистрСведений.ЛБ_УсловияПредоставленияКредита.СрезПоследних(&Дата, ) КАК ЛБ_УсловияПредоставленияКредитаСрезПоследних"; 
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	НачислятьПроцентыЗаДеньЗалога = Ложь;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_НастройкиЗаймаВерхнегоУровняСрезПоследних.НачислятьПроцентыЗаДеньЗалога КАК НачислятьПроцентыЗаДеньЗалога
	               |ИЗ
	               |	РегистрСведений.ЛБ_НастройкиЗаймаВерхнегоУровня.СрезПоследних(&Дата, ) КАК ЛБ_НастройкиЗаймаВерхнегоУровняСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НачислятьПроцентыЗаДеньЗалога = Выборка.НачислятьПроцентыЗаДеньЗалога;
	КонецЕсли;	
	
	ПСКГод = 0; 
	ВсеОК = Истина;
    СтруктураП = ЛБ_УправлениеЛомбардом.ПолучитьПредельныеЗначенияПроцентов(Приказ.Дата, Константы.ЛБ_ОсновнаяОрганизация.Получить());  
	Если НЕ СтруктураП = неопределено Тогда		
	    ПСКГод = СтруктураП.ПСКГод; 
	КонецЕсли;  
	Если НЕ ПСКГод = 0 Тогда
	    ТабДляПроверки = ТаблицаСтавок.Выгрузить(); 
		ТабДляПроверки.Свернуть("СхемаКредитования, ПричинаПрименения, СтатусЗалогодателя, ДиапазонСумм");
		ТабДляПроверки.Колонки.Добавить("СрокЗалога");
		ТабДляПроверки.Колонки.Добавить("НачислятьПроцентыЗаДеньЗалога");  
		Отбор = Новый структура;
		Для каждого Стр Из ТабДляПроверки Цикл 			
			Отбор.Вставить("СхемаКредитования", Стр.СхемаКредитования); 
			Строки = ТаблицаЗапроса.НайтиСтроки(Отбор); 
			Если Строки.Количество()= 0 Тогда   
				Стр.СрокЗалога = 0; 
			Иначе	
			    Стр.СрокЗалога = Строки.Получить(0).СрокЗалога; 
			КонецЕсли;
			Стр.НачислятьПроцентыЗаДеньЗалога = НачислятьПроцентыЗаДеньЗалога;
		КонецЦикла;	
		
		Для каждого Стр Из ТабДляПроверки Цикл
			ПСКГодРасчетная = РасчетПСКГод(Стр.СхемаКредитования, Стр.ПричинаПрименения, Стр.СтатусЗалогодателя, Стр.ДиапазонСумм, Стр.СрокЗалога, Стр.НачислятьПроцентыЗаДеньЗалога);
			Если ПСКГодРасчетная > ПСКГод Тогда 
				ВсеОК = ложь;
				Сообщить(СокрЛП(Стр.ПричинаПрименения) + " " + СокрЛП(Стр.СхемаКредитования) + ", статус клиента " + ?(ЗначениеЗаполнено(Стр.СтатусЗалогодателя),СокрЛП((Стр.СтатусЗалогодателя)), "любой") +
				         ": ПСК в диапазоне " + СокрЛП(Стр.ДиапазонСумм) + " (" + Формат(ПСКГодРасчетная, "ЧЦ=10; ЧДЦ=3") + ") превышает предельный размер ставки кредитования в год (" + Формат(ПСКГод, "ЧЦ=10; ЧДЦ=3") + ").");
			КонецЕсли;	
		Конеццикла;	
	КонецЕсли;
	Если ВсеОК Тогда 
		Возврат Истина;
	Иначе   
		Возврат ложь;
	КонецЕсли;	
КонецФункции	


&НаКлиенте
Процедура СохранитьИзменения(Команда)
	СохранитьИзмененияСтавокСФормы(); 
	Если ПроверитьПСК() Тогда
		СохранитьПриказ();
		ЭтаФорма.Закрыть(Истина); 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СохранитьПриказ()
	ДокументОбъект = Приказ.ПолучитьОбъект();
	ДокументОбъект.СтавкиПроцентов.Загрузить(ТаблицаСтавок.Выгрузить());
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ДиапазоныУдаленитьНаСервере(МассивУдаляемыхРеквизитов)	         
    ИзменитьРеквизиты( ,МассивУдаляемыхРеквизитов); 
КонецПроцедуры


&НаСервере
Процедура СохранитьИзмененияСтавокСФормы()
	Для каждого Стр Из ТаблицаСК Цикл  
		Отбор = Новый Структура;
		Отбор.Вставить("СхемаКредитования", Стр.СхемаКредитования);
		//Отбор.Вставить("ПричинаПрименения", Стр.ПричинаПрименения);
		//Отбор.Вставить("СтатусЗалогодателя", Стр.СтатусЗалогодателя);
		//Отбор.Вставить("ДеньНачалаПрименения", Стр.ДеньНачалаПрименения);
		
		СтрокиС = ТаблицаСтавок.НайтиСтроки(Отбор);
		Для каждого СтрС Из СтрокиС Цикл 
			//СтрС.ДеньНачалаПрименения = Стр.ДеньНачалаПрименения;
			ОтборД = Новый Структура;  
			ОтборД.Вставить("ДиапазонСумм", СтрС.ДиапазонСумм);
			СтрокиД = ДиапазоныСК.НайтиСтроки(ОтборД); 
			Если НЕ СтрокиД.Количество() = 0 Тогда
				КлючСтроки = СтрокиД.Получить(0).КлючСтроки;
				СтрС.Ставка = Стр["Диапазон_" + Строка(КлючСтроки)];
			КонецЕсли;	
		Конеццикла;	
	Конеццикла;	
КонецПроцедуры	

&НаКлиенте
Процедура СхемаКредитованияПриИзменении(Элемент)
	СохранитьИзмененияСтавокСФормы(); 
	
	//удалим дополнительные колонки 
	МассивУдаляемыхРеквизитов = Новый Массив;
	Для каждого СтрД Из ДиапазоныСК Цикл 
		МассивУдаляемыхРеквизитов.Добавить("ТаблицаСК.Диапазон_" + Строка(СтрД.КлючСтроки));
	КонецЦикла;	
	ДиапазоныУдаленитьНаСервере(МассивУдаляемыхРеквизитов);

    ЗаполнитьТаблицыИзПриказа();
КонецПроцедуры

