// @strict-types
#Область ПрограммныйИнтерфейс

// При создании на сервере.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Отказ - Булево
//  СтандартнаяОбработка - Булево - Стандартная обработка
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт

КонецПроцедуры

// Скорректировать текст.
// 
// Параметры:
//  Ключ - Строка - Ключ, по которому определяется источник текста
//  Текст - Строка - Переопределяемый текст
Процедура СкорректироватьТекст(Ключ, Текст) Экспорт

КонецПроцедуры

// Переопределяет обязательность заполнения характеристики.
// 
// Параметры:
//  Запись - ДанныеФормыСтруктура, РегистрСведенийМенеджерЗаписи.СтатусыПубликацииТоваровЭТП
//  Элемент - ПолеФормы - Элемент характеристики
//  Отказ - Булево, Неопределено - Результат
Процедура ПриОпределенииОбязательностиЗаполненияХарактеристики(Запись, Элемент, Отказ = Неопределено) Экспорт

КонецПроцедуры

// Переопределяет поля формирования представления товара или услуги.
// 
// Параметры:
//  ПоляФормированияПредставления - СписокЗначений - Строковые представления реквизитов установленного типа
//	см. ОпределяемыеТипы.НоменклатураИнтеграцияСЭлектроннымиТорговымиПлощадками
Процедура ПриОпределенииПолейПредставления(ПоляФормированияПредставления) Экспорт

КонецПроцедуры

// См. КоммерческиеПредложенияДокументыПереопределяемый.ПриОпределенииНастроекУчета
//
Процедура ПриОпределенииНастроекУчета(Настройки) Экспорт

КонецПроцедуры

#Область УсловияОтбораНоменклатуры

// Переопределяет текст запроса получения таблицы товаров или услуг по отбору.
// 
// Параметры:
//  ТекстЗапроса - Строка - Текст запроса
//
Процедура ТекстЗапросаОтбораНоменклатуры(ТекстЗапроса) Экспорт

КонецПроцедуры

// Переопределяет список колонок полученной таблицы товаров или услуг.
// 
// Параметры:
//  ИменаКолонокРезультатаОтбора - Строка - перечисленные через "," имена колонок (без пробелов)
//
Процедура ИменаКолонокРезультатаОтбора(ИменаКолонокРезультатаОтбора) Экспорт

КонецПроцедуры

#КонецОбласти

#Область РаботаСЕдиницамиИзмерения

// Дополняет текст запроса, подменяет указанный параметр единицей измерения номенклатуры.
//
// Параметры:
// 	ТекстЗапроса - Строка - текст запроса, где необходимо указать путь к единице измерения номенклатуры.
// 	ИмяПараметра - Строка - имя параметра, которое подменяет.
// 	ИмяТаблицы - Строка - имя таблицы.
//
Процедура ДополнитьТекстЗапросаЕдиницейИзмеренияНоменклатуры(ТекстЗапроса, Знач ИмяПараметра, Знач ИмяТаблицы) Экспорт

КонецПроцедуры

#КонецОбласти

// Дополняет текст запроса и настройки схемы компоновки данных 
// 
// Параметры:
//  СхемаКомпоновкиДанных - СхемаКомпоновкиДанных
//  ДополнительныеПараметры - Структура - содержит значения ключевых полей объекта 
Процедура ДополнитьСКДПодбораТоваровПоОтбору(СхемаКомпоновкиДанных, ДополнительныеПараметры) Экспорт

КонецПроцедуры

// Дополняет настройки схемы компоновки данных 
// 
// Параметры:
//  НастройкиСКД - НастройкиКомпоновкиДанных
//  ДополнительныеПараметры - Структура - содержит значения ключевых полей объекта
//
Процедура ДополнитьНастройкиСКДПодбораТоваровПоОтбору(НастройкиСКД, ДополнительныеПараметры) Экспорт

КонецПроцедуры

// Переносит значения используемых отбров в параметры
// 
// Параметры:
//  НастройкиСКД - НастройкиКомпоновкиДанных - Настройки
//
Процедура ПеренестиОтборВПараметры(НастройкиСКД) Экспорт

КонецПроцедуры

// Дополнить структуру настроек.
// 
// Параметры:
//  Форма Форма - форма обработки "Подбор товаров по отбору"
//  СтруктураНастроек - Структура
Процедура ДополнитьСтруктуруНастроекПодбораТоваровПоОтбору(Форма, СтруктураНастроек) Экспорт

КонецПроцедуры

#КонецОбласти
