
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// ++ Сербаев 05.05.2023
	//ОбщегоНазначенияБПВызовСервера.УстановитьОтборПоОсновнойОрганизации(ЭтаФорма);
	// -- Сербаев 05.05.2023
	
	// ++ Сербаев 10.05.2023
	//МожноРедактировать = ПравоДоступа("Редактирование", Метаданные.Документы.ИнвентаризацияТоваровНаСкладе);
	МожноРедактировать = ПравоДоступа("Редактирование", Метаданные.Документы.ЛБ_Инвентаризация);
	// -- Сербаев 10.05.2023
	
	Элементы.СписокКонтекстноеМенюИзменитьВыделенные.Видимость = МожноРедактировать;
	
	// ++ Сербаев 05.05.2023
	//ОбщегоНазначенияБП.УстановитьВидимостьКолонокДополнительнойИнформации(ЭтотОбъект);
	//
	//ТарификацияБП.РазместитьИнформациюОбОграниченииПоКоличествуОбъектов(ЭтотОбъект);
	// -- Сербаев 05.05.2023
	
	АдресХранилищаНастройкиДинСпискаДляРеестра = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ++ Сербаев 05.05.2023
	//Если ИмяСобытия = "ИзменениеОсновнойОрганизации" Тогда
	//	ОбщегоНазначенияБПКлиент.ИзменитьОтборПоОсновнойОрганизации(Список, ,Параметр);
	//КонецЕсли;
	//
	//ПрисоединенныеФайлыБПКлиент.ОбновитьСписокПослеДобавленияФайла(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	// -- Сербаев 05.05.2023
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ++ Сербаев 05.05.2023
	//ОбщегоНазначенияБПКлиент.ПроверитьНаличиеОрганизаций();
	// -- Сербаев 05.05.2023
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Список

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки)
	
	// ++ Сербаев 10.05.2023
	//ОбщегоНазначенияБП.ВосстановитьОтборСписка(Список, Настройки, "Организация");
	// -- Сербаев 10.05.2023
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	КлючеваяОперация = "СозданиеФормыИнвентаризацияТоваровНаСкладе";
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, КлючеваяОперация);

КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)

	КлючеваяОперация = "ОткрытиеФормыИнвентаризацияТоваровНаСкладе";
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, КлючеваяОперация);

КонецПроцедуры

&НаКлиенте
Процедура СписокПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)

	// ++ Сербаев 05.05.2023
	//Если Строка <> Неопределено Тогда
	//	
	//	Если ПрисоединенныеФайлыБПКлиент.ПараметрыПеретаскиванияСодержатФайлы(ПараметрыПеретаскивания) Тогда
	//		
	//		СтандартнаяОбработка = Ложь;
	//		
	//		ДополнительныеПараметры = Новый Структура;
	//		ДополнительныеПараметры.Вставить("Ссылка"                 , Строка);
	//		ДополнительныеПараметры.Вставить("ПараметрыПеретаскивания", ПараметрыПеретаскивания);
	//		ДополнительныеПараметры.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	//		
	//		ОписаниеОповещения = Новый ОписаниеОповещения("ПеретаскиваниеФайловОтветПолучен",
	//			ПрисоединенныеФайлыБПКлиент,
	//			ДополнительныеПараметры);
	//		ШаблонВопроса = НСтр("ru='Присоединить файлы к документу %1?'");
	//		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонВопроса, Строка);
	//		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса,РежимДиалогаВопрос.ДаНет);
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	// -- Сербаев 05.05.2023
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ БСП

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)

	Если Команда.Имя = "ПодменюПечатьОбычное_АктПроверки"
		И Элементы.Список.ТекущиеДанные.ТипИнвентаризации <> ПредопределенноеЗначение("Перечисление.ЛБ_ТипИнвентаризации.КонтрольнаяПроверка") Тогда
		Сообщить("""Акт проверки"" можно распечатать только по ""Контрольной проверке""");
		Возврат;
	КонецЕсли;
		
	Если Команда.Имя = "ПодменюПечатьОбычное_ИНВ8"
		И Элементы.Список.ТекущиеДанные.ТипИнвентаризации <> ПредопределенноеЗначение("Перечисление.ЛБ_ТипИнвентаризации.Инвентаризация") Тогда
		
		Сообщить("""ИНВ-8 Акт инвентаризации ДМ и изделий из них"" можно распечатать только по полной или выборочной инвентаризации");
		Возврат;
	КонецЕсли;

	Если Команда.Имя = "ПодменюПечатьОбычное_ИНВ8Черновик"
		И Элементы.Список.ТекущиеДанные.ТипИнвентаризации <> ПредопределенноеЗначение("Перечисление.ЛБ_ТипИнвентаризации.Инвентаризация") Тогда
		
		Сообщить("""ИНВ-8 Акт инвентаризации ДМ и изделий из них (черновик)"" можно распечатать только по полной или выборочной инвентаризации");
		Возврат;
	КонецЕсли;

	Если Команда.Имя = "ПодменюПечатьОбычное_ИНВ8Пустая"
		И Элементы.Список.ТекущиеДанные.ТипИнвентаризации <> ПредопределенноеЗначение("Перечисление.ЛБ_ТипИнвентаризации.Инвентаризация") Тогда
		
		Сообщить("""ИНВ-8 Акт инвентаризации ДМ и изделий из них (пустой)"" можно распечатать только по полной или выборочной инвентаризации");
		Возврат;
	КонецЕсли;
	
	Если Команда.Имя = "ПодменюПечатьОбычное_ИНВ5"
		И Элементы.Список.ТекущиеДанные.ТипИнвентаризации <> ПредопределенноеЗначение("Перечисление.ЛБ_ТипИнвентаризации.Инвентаризация") Тогда
		
		Сообщить("""ИНВ-5 Акт инвентаризации ДМ на ОХ"" можно распечатать только по полной или выборочной инвентаризации");
		Возврат;
	КонецЕсли;

	Если Команда.Имя = "ПодменюПечатьОбычное_ИНВ5Пустая"
		И Элементы.Список.ТекущиеДанные.ТипИнвентаризации <> ПредопределенноеЗначение("Перечисление.ЛБ_ТипИнвентаризации.Инвентаризация") Тогда
		
		Сообщить("""ИНВ-5 Акт инвентаризации ДМ на ОХ (пустой)"" можно распечатать только по полной или выборочной инвентаризации");
		Возврат;
	КонецЕсли;
	
	Если Команда.Имя = "ПодменюПечатьОбычное_Изъятые"
		И Элементы.Список.ТекущиеДанные.ТипИнвентаризации <> ПредопределенноеЗначение("Перечисление.ЛБ_ТипИнвентаризации.Инвентаризация") Тогда
		
		Сообщить("""Акт проверки документов, подтверждающих изъятие"" можно распечатать только по полной или выборочной инвентаризации");
		Возврат;
	КонецЕсли;

	Если Команда.Имя = "ПодменюПечатьОбычное_ОписьПоступивших"
		И Элементы.Список.ТекущиеДанные.ТипИнвентаризации <> ПредопределенноеЗначение("Перечисление.ЛБ_ТипИнвентаризации.Инвентаризация") Тогда
		
		Сообщить("""Опись ценностей, поступивших во время инвентаризации"" можно распечатать только по полной или выборочной инвентаризации");
		Возврат;
	КонецЕсли;

	Если Команда.Имя = "ПодменюПечатьОбычное_ОписьВыбывших"
		И Элементы.Список.ТекущиеДанные.ТипИнвентаризации <> ПредопределенноеЗначение("Перечисление.ЛБ_ТипИнвентаризации.Инвентаризация") Тогда
		
		Сообщить("""Опись ценностей, выбывших во время инвентаризации"" можно распечатать только по полной или выборочной инвентаризации");
		Возврат;
	КонецЕсли;
	
	Если Команда.Имя = "ПодменюПечатьОбычное_Посылки"
		И Элементы.Список.ТекущиеДанные.ТипИнвентаризации <> ПредопределенноеЗначение("Перечисление.ЛБ_ТипИнвентаризации.Инвентаризация") Тогда
		
		Сообщить("""Опись не распакованных посылок с ценностями"" можно распечатать только по полной или выборочной инвентаризации");
		Возврат;
	КонецЕсли;
	
	//Если Команда.Имя = "ПодменюПечатьОбычное_Реестр" Тогда
	//	НастройкиДинамическогоСписка();
	//КонецЕсли;
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура НастройкиДинамическогоСписка()
	
	Отчеты.РеестрДокументов.НастройкиДинамическогоСписка(ЭтотОбъект);
	
КонецПроцедуры

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость();
	СкладВитрина = СтрНайти(Элементы.Список.ТекущиеДанные.Склад, "Витрина") > 0;
	
	Если СкладВитрина Тогда
		Если Элементы.Список.ТекущиеДанные.ТипИнвентаризации = ПредопределенноеЗначение("Перечисление.ЛБ_ТипИнвентаризации.Инвентаризация") Тогда
			Элементы.ФормаПечатьИНВ8.Видимость = Истина;
			Элементы.ФормаПечатьИНВ8Черновик.Видимость = Истина;
			Элементы.ФормаПечатьИНВ8Пустой.Видимость = Истина;
			Элементы.ФормаПечатьИНВ5.Видимость = Ложь;
			Элементы.ФормаПечатьИНВ5Пустой.Видимость = Ложь;
			Элементы.ФормаПечатьИНВ19Полная.Видимость = Истина;
			Элементы.ФормаПечатьИНВ19Новые.Видимость = Истина;
			Элементы.ФормаПечатьИНВ19Недостача.Видимость = Истина;
			Элементы.ФормаПечатьАктПроверкиДокументов.Видимость = Ложь;
			Элементы.ФормаПечатьОписьПосылок.Видимость = Ложь;
			Элементы.ФормаПечатьОписьПоступивших.Видимость = Истина;
			Элементы.ФормаПечатьОписьВыбывших.Видимость = Истина;
			Элементы.ФормаПечатьАктПроверкиОЗ.Видимость = Ложь;
		КонецЕсли;
	Иначе
		Если Элементы.Список.ТекущиеДанные.ТипИнвентаризации = ПредопределенноеЗначение("Перечисление.ЛБ_ТипИнвентаризации.КонтрольнаяПроверка") Тогда
			Элементы.ФормаПечатьИНВ8.Видимость = Ложь;
			Элементы.ФормаПечатьИНВ8Черновик.Видимость = Ложь;
			Элементы.ФормаПечатьИНВ8Пустой.Видимость = Ложь;
			Элементы.ФормаПечатьИНВ5.Видимость = Ложь;
			Элементы.ФормаПечатьИНВ5Пустой.Видимость = Ложь;
			Элементы.ФормаПечатьИНВ19Полная.Видимость = Ложь;
			Элементы.ФормаПечатьИНВ19Новые.Видимость = Ложь;
			Элементы.ФормаПечатьИНВ19Недостача.Видимость = Ложь;
			Элементы.ФормаПечатьАктПроверкиДокументов.Видимость = Ложь;
			Элементы.ФормаПечатьОписьПосылок.Видимость = Ложь;
			Элементы.ФормаПечатьОписьПоступивших.Видимость = Ложь;
			Элементы.ФормаПечатьОписьВыбывших.Видимость = Ложь;
			Элементы.ФормаПечатьАктПроверкиОЗ.Видимость = Истина;
		ИначеЕсли Элементы.Список.ТекущиеДанные.ТипИнвентаризации = ПредопределенноеЗначение("Перечисление.ЛБ_ТипИнвентаризации.Инвентаризация") Тогда
			Элементы.ФормаПечатьИНВ8.Видимость = Истина;
			Элементы.ФормаПечатьИНВ8Черновик.Видимость = Истина;
			Элементы.ФормаПечатьИНВ8Пустой.Видимость = Истина;
			Элементы.ФормаПечатьИНВ5.Видимость = Истина;
			Элементы.ФормаПечатьИНВ5Пустой.Видимость = Истина;
			Элементы.ФормаПечатьИНВ19Полная.Видимость = Истина;
			Элементы.ФормаПечатьИНВ19Новые.Видимость = Истина;
			Элементы.ФормаПечатьИНВ19Недостача.Видимость = Истина;
			Элементы.ФормаПечатьАктПроверкиДокументов.Видимость = Истина;
			Элементы.ФормаПечатьОписьПосылок.Видимость = Истина;
			Элементы.ФормаПечатьОписьПоступивших.Видимость = Истина;
			Элементы.ФормаПечатьОписьВыбывших.Видимость = Истина;
			Элементы.ФормаПечатьАктПроверкиОЗ.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьДокумента(Команда)
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_Инвентаризация");

		ПараметрыПечати = Новый Структура;

		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(Элементы.Список.ТекущиеДанные.Ссылка);
		
	Если НЕ Модифицированность Тогда
		Если СтрНайти(Команда.Имя, "ИНВ8") > 0 Тогда
			Если СтрНайти(Команда.Имя, "Черновик") > 0 Тогда
				ПараметрыФормы.Вставить("ИменаМакетов", "ИНВ8Черновик");
				//ПараметрыПечати.Вставить("ЗаголовокФормы", "Инвентаризация ОЗ " + Объект.Номер + " от " + Объект.Дата);		
				ПараметрыПечати.Вставить("ЗаголовокФормы", "ИНВ-8 Акт инвентаризации ДМ и изделий из них (черновик)");		
			ИначеЕсли СтрНайти(Команда.Имя, "Пустой") > 0 Тогда
				ПараметрыФормы.Вставить("ИменаМакетов", "ИНВ8Пустая");
				ПараметрыПечати.Вставить("ЗаголовокФормы", "ИНВ-8 Акт инвентаризации ДМ и изделий из них (пустой)");		
			Иначе
				ПараметрыФормы.Вставить("ИменаМакетов", "ИНВ8");
				ПараметрыПечати.Вставить("ЗаголовокФормы", "ИНВ-8 Акт инвентаризации ДМ и изделий из них");		
			КонецЕсли;
		ИначеЕсли СтрНайти(Команда.Имя, "ИНВ5") > 0 Тогда
			Если СтрНайти(Команда.Имя, "Пустой") > 0 Тогда
				ПараметрыФормы.Вставить("ИменаМакетов", "ИНВ5Пустая");
				ПараметрыПечати.Вставить("ЗаголовокФормы", "ИНВ-5 Акт инвентаризации ДМ на ОХ (пустой)");		
			Иначе
				ПараметрыФормы.Вставить("ИменаМакетов", "ИНВ5");
				ПараметрыПечати.Вставить("ЗаголовокФормы", "ИНВ-5 Акт инвентаризации ДМ на ОХ");		
			КонецЕсли;
		ИначеЕсли СтрНайти(Команда.Имя, "ИНВ19") > 0 Тогда
			Если СтрНайти(Команда.Имя, "Полная") > 0 Тогда
				ПараметрыФормы.Вставить("ИменаМакетов", "ИНВ19Полная");
				ПараметрыПечати.Вставить("ЗаголовокФормы", "ИНВ-19 Сличительная ведомость итогов инвентаризации (полная)");		
			ИначеЕсли СтрНайти(Команда.Имя, "Новые") > 0 Тогда
				ПараметрыФормы.Вставить("ИменаМакетов", "ИНВ19Новое");
				ПараметрыПечати.Вставить("ЗаголовокФормы", "ИНВ-19 Сличительная ведомость итогов инвентаризации (новые)");		
			Иначе
				ПараметрыФормы.Вставить("ИменаМакетов", "ИНВ19Недостача");
				ПараметрыПечати.Вставить("ЗаголовокФормы", "ИНВ-19 Сличительная ведомость итогов инвентаризации (недостача)");		
			КонецЕсли;
		ИначеЕсли СтрНайти(Команда.Имя, "АктПроверкиДокументов") > 0 Тогда
			ПараметрыФормы.Вставить("ИменаМакетов", "Изъятые");
			ПараметрыПечати.Вставить("ЗаголовокФормы", "Акт проверки документов, подтверждающих изъятие");		
		ИначеЕсли СтрНайти(Команда.Имя, "ОписьПосылок") > 0 Тогда
			ПараметрыФормы.Вставить("ИменаМакетов", "Посылки");
			ПараметрыПечати.Вставить("ЗаголовокФормы", "ИНВ-19 Опись не распакованных посылок с ценностями");		
		ИначеЕсли СтрНайти(Команда.Имя, "ОписьПоступивших") > 0 Тогда
			ПараметрыФормы.Вставить("ИменаМакетов", "ОписьПоступивших");
			ПараметрыПечати.Вставить("ЗаголовокФормы", "Опись ценностей, поступивших во время инвентаризации");		
		ИначеЕсли СтрНайти(Команда.Имя, "ОписьВыбывших") > 0 Тогда
			ПараметрыФормы.Вставить("ИменаМакетов", "ОписьВыбывших");
			ПараметрыПечати.Вставить("ЗаголовокФормы", "Опись ценностей, выбывших во время инвентаризации");		
		ИначеЕсли СтрНайти(Команда.Имя, "АктПроверкиОЗ") > 0 Тогда
			ПараметрыФормы.Вставить("ИменаМакетов", "АктПроверки");
			ПараметрыПечати.Вставить("ЗаголовокФормы", "Акт проверки предметов залога");		
		КонецЕсли;
	Иначе
		Сообщить("Были внесены изменения. Необходимо записать документ!");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
	ПараметрыФормы.Вставить("ПараметрыПечати", ПараметрыПечати);
	
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,);   
КонецПроцедуры
#КонецОбласти
