#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

  &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
  // Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы
  // Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Ок(Команда)
	ЭтаФорма.Закрыть(Комментарий);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
  // Код процедур и функций
#КонецОбласти
