Процедура ОбработкаПроведения(Отказ, РежимПроведения)  
	Движения.ЛБ_ТекущийШаблонПриказа.Записывать = Истина; 
	Если ЭтотОбъект.Ломбарды.Количество() = 0 Тогда
		Движение = Движения.ЛБ_ТекущийШаблонПриказа.Добавить();
	    Движение.Период = Дата; 
		Движение.ВидПрейскуранта = Перечисления.ЛБ_ВидыПрейскурантов.Вставки;
		Движение.ШаблонПриказа = Шаблон;    
	Иначе  
		Для каждого стр Из ЭтотОбъект.Ломбарды Цикл
			Движение = Движения.ЛБ_ТекущийШаблонПриказа.Добавить();
		    Движение.Период = Дата; 
			Движение.ВидПрейскуранта = Перечисления.ЛБ_ВидыПрейскурантов.Вставки; 
			Движение.Ломбард = Стр.Ломбард;
			Движение.ШаблонПриказа = Шаблон;    
		Конеццикла;	
	КонецЕсли;	
КонецПроцедуры
