&НаКлиенте
Перем ДополнительныеПараметры;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстройствоЗанято = Ложь;
	
	РабочееМесто = МенеджерОборудованияВызовСервера.РабочееМестоКлиента();
	ПолучитьОборудованиеНаСервере();
	
	КассирФИО = НСтр("ru='Иванов П.П.'");
	КассирИНН = "526317984689";    
	КонтрольнаяМарка = "";
	
	СТ_РегистрацияПройдена = Ложь;
	СТ_АварийныйРежим = Ложь;
	СТ_ЛМЧЗГотов = Ложь;
	СТ_АвторизацияПройдена = Ложь;      
	СТ_ГотовКПроверкеКМOnline = Ложь; 
	СТ_ГотовКПроверкеКМOffline = Ложь;  
	СТ_АварийныйРежим = Ложь; 
	СТ_ПостАварийныйРежим = Ложь;    
	СТ_Error = "";
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ТестовыеДанные");
	Для Индекс = 1 по Макет.ВысотаТаблицы Цикл   
		Строка = ТестовыеДанные.Добавить();  
		Строка.Номер = Макет.Область(Индекс,1).Текст;   
		КодМаркировки = СокрЛП(Макет.Область(Индекс,2).Текст);   
		Если СтрНачинаетсяС(КодМаркировки, "0") Тогда            
			КодМаркировки = СтрЗаменить(КодМаркировки, "\u001d", МенеджерОборудованияМаркировкаКлиентСервер.РазделительGS1());
			КодМаркировки = МенеджерОборудованияКлиентСервер.ШтрихкодВBase64(КодМаркировки);
		КонецЕсли;  
		Строка.GTIN = СокрЛП(Макет.Область(Индекс,3).Текст);
		Строка.КодМаркировки = КодМаркировки;   
		Строка.Цена = Число(СокрЛП(Макет.Область(Индекс,4).Текст));       
		Строка.Наименование = СокрЛП(Макет.Область(Индекс,5).Текст); 
		Строка.Название = Строка(Строка.Номер) + "." + СокрЛП(Макет.Область(Индекс,6).Текст);      
	КонецЦикла; 
	
	ИдентификаторФискальнойЗаписи = Новый УникальныйИдентификатор();      
	Элементы.СтраницаСтатусТСПИоТИдетНастройка.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДополнительныеПараметры = МенеджерОборудованияКлиентСервер.ДополнительныеПараметрыОперации(Истина);      
	
	ПоддерживаемыеТипы = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
	ПоддерживаемыеТипы.СканерШтрихкода = Истина;
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПоТипу(Неопределено, УникальныйИдентификатор, ПоддерживаемыеТипы);   
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ПоддерживаемыеТипы = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
	ПоддерживаемыеТипы.СканерШтрихкода = Истина;
	ПоддерживаемыеТипы.ККТ = Истина;
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованияПоТипу(Неопределено, УникальныйИдентификатор, ПоддерживаемыеТипы);   
	
КонецПроцедуры   

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ПодключаемоеОборудование" Тогда
		КонтрольнаяМарка = Параметр[0]; 
		Если ИмяСобытия = "ScanData" Тогда
			Штрихкод = Параметр[0];
			ДанныеМаркировки = МенеджерОборудованияМаркировкаКлиентСервер.РазобратьШтриховойКодТовара(Штрихкод);
			Если ДанныеМаркировки.Разобран Тогда
				Если ДанныеМаркировки.ТипИдентификатораТовара = ПредопределенноеЗначение("Перечисление.ТипыИдентификаторовТовараККТ.КодТовараВФорматеEAN13") Или
					ДанныеМаркировки.ТипИдентификатораТовара = ПредопределенноеЗначение("Перечисление.ТипыИдентификаторовТовараККТ.КодТовараВФорматеITF14") Тогда 
					ПоказатьПредупреждение(, НСтр("ru='Считайте средство идентификации маркированного товара.'"));
				Иначе
					КонтрольнаяМарка = МенеджерОборудованияКлиентСервер.ШтрихкодВBase64(Штрихкод); 
					НачатьДобавлениеКМ(КонтрольнаяМарка); 
					Сообщить(НСтр("ru='Сканирована КМ:'")+ Штрихкод);
				КонецЕсли; 
			Иначе            
				ПоказатьПредупреждение(, НСтр("ru='Штрихкод не является средством идентификации маркированного товара.'"));
			КонецЕсли; 
		КонецЕсли;                                            
	КонецЕсли;       
	
	// считать средство идентификации маркированного товара
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьСмену(Команда)
	
	Если Не ЗначениеЗаполнено(ККТ) Тогда      
		ПоказатьПредупреждение(Неопределено, НСтр("ru='ККТ не выбран.'"));
		Возврат;
	КонецЕсли;
	
	
	Элементы.Главная.Доступность = Ложь;
	
	Если УстройствоЗанято Тогда
		ТекстСообщения = НСтр("ru='Устройство уже выполняет команду.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);    
		Возврат;
	КонецЕсли;
		
	УстройствоЗанято = Истина;
	
	ПараметрыОперации = ПараметрыВыполненияОперации();
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьОткрытиеСменыНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, ККТ, ПараметрыОперации, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСмену(Команда)
	
	Если Не ЗначениеЗаполнено(ККТ) Тогда      
		ПоказатьПредупреждение(Неопределено, НСтр("ru='ККТ не выбран.'"));
		Возврат;
	КонецЕсли;
	
	Элементы.Главная.Доступность = Ложь;      
	
	Если УстройствоЗанято Тогда
		ТекстСообщения = НСтр("ru='Устройство уже выполняет команду.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);    
		Возврат;
	КонецЕсли;
	
	ПараметрыОперации = ПараметрыВыполненияОперации();
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьЗакрытиеСменыНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, ККТ, ПараметрыОперации, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключить(Команда)
	
	Если Не ЗначениеЗаполнено(ККТ) Тогда      
		ПоказатьПредупреждение(Неопределено, НСтр("ru='ККТ не выбран.'"));
		Возврат;
	КонецЕсли;
	
	Элементы.Главная.Доступность = Ложь;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("КомандаПодключитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПолучениеТекущегоСостоянияФискальногоУстройства(ОповещениеПриЗавершении, УникальныйИдентификатор, ККТ, Неопределено, ДополнительныеПараметры);
	
КонецПроцедуры    

&НаКлиенте
Процедура ПодключитьСканерШтрихкода(Команда)
	
	Если Не ЗначениеЗаполнено(СканерШтрихкода) Тогда      
		ПоказатьПредупреждение(Неопределено, НСтр("ru='Сканер штрихкода не выбран.'"));
		Возврат;
	КонецЕсли;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("КомандаВыполнитьЗавершение", ЭтотОбъект);                              
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПоИдентификатору(ОповещениеПриЗавершении, УникальныйИдентификатор, СканерШтрихкода);
		
КонецПроцедуры

&НаКлиенте
Процедура Аутентификация(Команда)  
	
	Если Не ЗначениеЗаполнено(ККТ) Тогда      
		ПоказатьПредупреждение(Неопределено, НСтр("ru='ККТ не выбран.'"));
		Возврат;
	КонецЕсли;
	
	//Элементы.Главная.Доступность = Ложь;        
	
	Элементы.СтраницаСтатусТСПИоТИдетНастройка.Видимость = Истина;
	
	ПараметрыОперации = Неопределено;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ПослеПроверкиСтатусаГотовностиТСПИоТ", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьРаботуПИоТ(ОповещениеПриЗавершении, УникальныйИдентификатор, ККТ, ПараметрыОперации, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапросСтатуса(Команда)
	
	Если Не ЗначениеЗаполнено(ККТ) Тогда      
		ПоказатьПредупреждение(Неопределено, НСтр("ru='ККТ не выбран.'"));
		Возврат;
	КонецЕсли;
	
	Элементы.Главная.Доступность = Ложь;
	
	ПараметрыОперации = Неопределено;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПолучениеСтатусаПИоТ(ОповещениеПриЗавершении, УникальныйИдентификатор, ККТ, ПараметрыОперации, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеСлужебнойИнформации(Команда)
	
	Если Не ЗначениеЗаполнено(ККТ) Тогда      
		ПоказатьПредупреждение(Неопределено, НСтр("ru='ККТ не выбран.'"));
		Возврат;
	КонецЕсли;
	
	Элементы.Главная.Доступность = Ложь;
	
	ПараметрыОперации = Неопределено;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПолучениеСлужебнойИнформацииПИоТ(ОповещениеПриЗавершении, УникальныйИдентификатор, ККТ, ПараметрыОперации, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьЭкземплярСРегистрацииПИоТ(Команда)
	
	Если Не ЗначениеЗаполнено(ККТ) Тогда      
		ПоказатьПредупреждение(Неопределено, НСтр("ru='ККТ не выбран.'"));
		Возврат;
	КонецЕсли;
	
	Элементы.Главная.Доступность = Ложь;
	
	ПараметрыОперации = Неопределено;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьСнятьЭкземплярСРегистрацииПИоТ(ОповещениеПриЗавершении, УникальныйИдентификатор, ККТ, ПараметрыОперации, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура НовыйЧек(Команда)
	
	Если Не ЗначениеЗаполнено(ККТ) Тогда      
		ПоказатьПредупреждение(Неопределено, НСтр("ru='ККТ не выбран.'"));
		Возврат;
	КонецЕсли;
	
	Товары.Очистить();
	
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьОткрытиеСессииРегистрацииКМ(Неопределено, УникальныйИдентификатор, ККТ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПробитьЧек(Команда)
	
	Если Не ЗначениеЗаполнено(ККТ) Тогда      
		ПоказатьПредупреждение(Неопределено, НСтр("ru='ККТ не выбран.'"));
		Возврат;
	КонецЕсли;
	
	Состояние(НСтр("ru = 'Фискализация чека...'"), , НСтр("ru = 'Фискализация чека...'"));
	Элементы.Главная.Доступность = Ложь;
	
	НачатьПроверитьКМ();
	
КонецПроцедуры             

&НаКлиенте
Процедура ДобавитьТовар(Команда)   
	
	НачатьДобавлениеКМ(КонтрольнаяМарка);   
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьШаблонЧека(ККТ)
	
	// Общие параметры чека
	ОбщиеПараметры = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииЧекаКоррекции();     
	ОбщиеПараметры.ИдентификаторФискальнойЗаписи = ИдентификаторФискальнойЗаписи;
	ОбщиеПараметры.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств;
	ОбщиеПараметры.ПокупательEmail = "test@1c.ru";
	ОбщиеПараметры.ПокупательНомер = Неопределено;     
	
	Строка = ККТ.ПараметрыРегистрации.Найти("ОрганизацияНазвание", "НаименованиеПараметра");
	ОбщиеПараметры.ОрганизацияНазвание = Строка.ЗначениеПараметра;
	Строка = ККТ.ПараметрыРегистрации.Найти("ОрганизацияИНН", "НаименованиеПараметра");
	ОбщиеПараметры.ОрганизацияИНН = Строка.ЗначениеПараметра;
	
	ОбщиеПараметры.Кассир     = КассирФИО;
	ОбщиеПараметры.КассирИНН  = КассирИНН;

	ОбщиеПараметры.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.ОСН;
	ОбщиеПараметры.АдресРасчетов  = "г.Москва, Дмитровское ш. д.9";
	ОбщиеПараметры.МестоРасчетов  = "Торговый островок на 1 этаже";
	
	СуммаЧека = 0;
	
	Для Каждого Товар Из Товары Цикл   
		СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
		СтрокаПозицииЧека.Наименование = Товар.Наименование;
		СтрокаПозицииЧека.Количество   = Товар.Количество; 
		СтрокаПозицииЧека.Цена         = Мин(Товар.Цена, 100);
		СтрокаПозицииЧека.Сумма        = Окр(СтрокаПозицииЧека.Количество * СтрокаПозицииЧека.Цена, 2);
		СтрокаПозицииЧека.СтавкаНДС    = Товар.НДС;
		СтрокаПозицииЧека.КодЕдиницыИзмерения = "796";
		СтрокаПозицииЧека.ПризнакСпособаРасчета  = Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
		СтрокаПозицииЧека.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ТоварМаркируемыйСИИмеющийКМ;
		СтрокаПозицииЧека.КонтрольнаяМарка = Товар.КонтрольнаяМарка;   
		СтрокаПозицииЧека.ЗапросПроверкиКода.ИдентификаторЗапроса = Товар.ИдентификаторЗапросаРазрешения;
		СтрокаПозицииЧека.ЗапросПроверкиКода.ВременнаяМетка = Товар.ВремяЗапросаРазрешения;     
		СтрокаПозицииЧека.ЗапросПроверкиКода.ИдентификаторЭкземпляра = Товар.ИдентификаторЭкземпляра;
		СтрокаПозицииЧека.ЗапросПроверкиКода.ВерсияБазы = Товар.ВерсияБазы;
		ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
		СуммаЧека = СуммаЧека + СтрокаПозицииЧека.Сумма;
	КонецЦикла;
	
	СтрокаОплаты = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты(СуммаЧека);
	СтрокаОплаты.ТипОплаты = Перечисления.ТипыОплатыККТ.Наличные;
	ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	
	Возврат ОбщиеПараметры;
	
КонецФункции

&НаКлиенте
Функция ПараметрыВыполненияОперации();
	
	ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОткрытияЗакрытияСмены();
	ПараметрыОперации.Кассир = КассирФИО;
	ПараметрыОперации.КассирИНН = КассирИНН;
	ПараметрыОперации.АдресРасчетов = "Дмитровское ш. д.9";
	ПараметрыОперации.МестоРасчетов = "1 Этаж";
	Возврат ПараметрыОперации;
	
КонецФункции    

&НаКлиенте
Процедура ОбновитьДанные(РезультатВыполнения);
	
	Если РезультатВыполнения.Свойство("НомерЧекаККТ") Тогда
		НомерЧека = РезультатВыполнения.НомерЧекаККТ;
	КонецЕсли;
		
	Если РезультатВыполнения.Свойство("НомерСменыККТ") Тогда
		НомерСмены = РезультатВыполнения.НомерСменыККТ;
	КонецЕсли;
		
	Если РезультатВыполнения.Свойство("СтатусСмены") Тогда  
		Если РезультатВыполнения.СтатусСмены = 1 Тогда
			СтатусСмены = НСтр("ru='Закрыта'")
		ИначеЕсли РезультатВыполнения.СтатусСмены = 2 Тогда
			СтатусСмены = НСтр("ru='Открыта'")
		Иначе
			СтатусСмены = НСтр("ru='Истекла'")
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры     

&НаКлиенте
Процедура ОбновитьСтатусСостояния(СтатусСостояния);
	
	СТ_РегистрацияПройдена = СтатусСостояния.РегистрацияПройдена;
	СТ_ГотовКПроверкеКМOnline = СтатусСостояния.ГотовКПроверкеКМOnline; 
	СТ_ГотовКПроверкеКМOffline = СтатусСостояния.ГотовКПроверкеКМOffline; 
	СТ_АварийныйРежим = СтатусСостояния.АварийныйРежим;
	СТ_ПостАварийныйРежим = СтатусСостояния.ПостАварийныйРежим;
	СТ_ЛМЧЗГотов = СтатусСостояния.ЛМЧЗГотов;
	СТ_АвторизацияПройдена = СтатусСостояния.АвторизацияПройдена;
	СТ_ЛМЧЗСтатус = СтатусСостояния.ЛМЧЗСтатус;       
	СТ_Error =  СтатусСостояния.ТекстОшибки;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнитьЧекЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	ОчиститьСообщения();
	Элементы.Главная.Доступность = Истина;
	
	НомерСмены  = Неопределено; 
	НомерЧека   = Неопределено;
	СтатусСмены = Неопределено;
	
	Если РезультатВыполнения.Результат Тогда
		Если РезультатВыполнения.Свойство("ФискальныеДанные") Тогда     
			ОбновитьДанные(РезультатВыполнения.ФискальныеДанные)
		Иначе
			ОбновитьДанные(РезультатВыполнения);
		КонецЕсли;                              
		
		ТекстСообщения = НСтр("ru='Операция завершена.'");
	Иначе
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
	КонецЕсли;
	
	ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры     

&НаКлиенте
Процедура КомандаВыполнитьЧекФискализацияЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	ОчиститьСообщения();
	Элементы.Главная.Доступность = Истина;
	
	НомерСмены  = Неопределено; 
	НомерЧека   = Неопределено;
	СтатусСмены = Неопределено;
	
	Если РезультатВыполнения.Результат Тогда
		Если РезультатВыполнения.Свойство("ФискальныеДанные") Тогда     
			ОбновитьДанные(РезультатВыполнения.ФискальныеДанные)
		Иначе
			ОбновитьДанные(РезультатВыполнения);
		КонецЕсли;                              
		Товары.Очистить();
		ТекстСообщения = НСтр("ru='Чек фискализизирован.'");
		ИдентификаторФискальнойЗаписи = Новый УникальныйИдентификатор();
	Иначе
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
	КонецЕсли;
	
	ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);      
	
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьОткрытиеСессииРегистрацииКМ(Неопределено, УникальныйИдентификатор, ККТ);
	
КонецПроцедуры         

&НаКлиенте
Процедура ПроверкаСтатусаГотовностиТСПИоТ() Экспорт
	
	ОповещениеПослеВыполнения = Новый ОписаниеОповещения("ПослеПроверкиСтатусаГотовностиТСПИоТ", ЭтотОбъект);
	
	ПараметрыОперации = Неопределено;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ПослеПроверкиСтатусаГотовностиТСПИоТ", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПолучениеСтатусаПИоТ(ОповещениеПриЗавершении, УникальныйИдентификатор, ККТ, ПараметрыОперации, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПроверкиСтатусаГотовностиТСПИоТ(РезультатВыполнения, Параметры) Экспорт
	
	Если Не РезультатВыполнения.Результат Тогда
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;  
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		УстройствоЗанято = Ложь;
	ИначеЕсли РезультатВыполнения.Свойство("СтатусСостояния") И  РезультатВыполнения.СтатусСостояния <> Неопределено  Тогда
		ОбновитьСтатусСостояния(РезультатВыполнения.СтатусСостояния);
		Если Не СТ_ГотовКПроверкеКМOnline Или Не СТ_ГотовКПроверкеКМOffline Тогда
			ПодключитьОбработчикОжидания("ПроверкаСтатусаГотовностиТСПИоТ", 1, Истина);
		Иначе
			УстройствоЗанято = Ложь;   
			Элементы.СтраницаСтатусТСПИоТИдетНастройка.Видимость = Ложь;
		КонецЕсли
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнитьЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	ОчиститьСообщения();                     
	УстройствоЗанято = Ложь;
	Элементы.Главная.Доступность = Истина;
	
	Если РезультатВыполнения.Результат Тогда
		Если РезультатВыполнения.Свойство("ФискальныеДанные") Тогда     
			ОбновитьДанные(РезультатВыполнения.ФискальныеДанные);
		Иначе
			ОбновитьДанные(РезультатВыполнения);
		КонецЕсли;                                
		
		Если РезультатВыполнения.Свойство("СлужебнаяИнформация") Тогда      
			СлужебнаяИнформация = РезультатВыполнения.СлужебнаяИнформация;
			ПИоТ_Имя = СлужебнаяИнформация.Наименование + " " + СлужебнаяИнформация.Версия;
			ПИоТ_ПустьКЛогам = СлужебнаяИнформация.ПустьКЛогам;
			ПИоТ_ПустьКФайламСобытия = СлужебнаяИнформация.ПустьКФайламСобытия;
		КонецЕсли;                                
		
		Если РезультатВыполнения.Свойство("СтатусСостояния") И  РезультатВыполнения.СтатусСостояния <> Неопределено Тогда 
			ОбновитьСтатусСостояния(РезультатВыполнения.СтатусСостояния);
		КонецЕсли;
		
		ТекстСообщения = НСтр("ru='Операция завершена.'");
	Иначе
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
	КонецЕсли;
	
	ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры      

&НаКлиенте
Процедура КомандаПодключитьЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	ОчиститьСообщения();  
	Элементы.Главная.Доступность = Истина;
	Элементы.ГруппаИнфо.Доступность = Истина;
	Элементы.ОткрытьФайлЛогирования.Доступность = Истина;
	
	НомерСмены  = Неопределено; 
	НомерЧека   = Неопределено;
	СтатусСмены = Неопределено;
	
	Если РезультатВыполнения.Результат Тогда
		Если РезультатВыполнения.Свойство("ФискальныеДанные") Тогда     
			ОбновитьДанные(РезультатВыполнения.ФискальныеДанные);
		КонецЕсли;                                
		
		ПараметрыОперации = Неопределено;
		ОповещениеПриЗавершении = Новый ОписаниеОповещения("КомандаВыполнитьЗавершение", ЭтотОбъект);
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПолучениеСлужебнойИнформацииПИоТ(ОповещениеПриЗавершении, УникальныйИдентификатор, ККТ, ПараметрыОперации, ДополнительныеПараметры);
		
	Иначе
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
	КонецЕсли;
	
	ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписьВЖурналОперацийПроверкиКМ(ПараметрыОперации);
	
	ПараметрыЗаписи = МенеджерОборудованияМаркировка.ПараметрыЗаписиОперацииПроверкиКМ();  
	ПараметрыЗаписи.ЗапросРазрешенияПродажиКМ = Истина;           
	ПараметрыЗаписи.Наименование = ПараметрыОперации.Наименование;
	ПараметрыЗаписи.КонтрольнаяМарка = ПараметрыОперации.КонтрольнаяМарка;       
	ПараметрыЗаписи.ТекстЗапросаРазрешения = ПараметрыОперации.ЗапросПроверки;   
	ПараметрыЗаписи.КодОтветаРазрешения = "200";
	ПараметрыЗаписи.РезультатЗапросаРазрешения = ПараметрыОперации.РезультатПроверки;
	ПараметрыЗаписи.ИдентификаторЗапросаРазрешения = ПараметрыОперации.ИдентификаторЗапросаРазрешения;   
	ПараметрыЗаписи.ВремяЗапросаРазрешения = ПараметрыОперации.ВремяЗапросаРазрешения;
	ПараметрыЗаписи.ПродажаРазрешена = ПараметрыОперации.ПродажаРазрешена;
	
	МенеджерОборудованияМаркировка.ДобавитьЗаписьВЖурналОперацийПроверкиКМ(ПараметрыЗаписи);
	
КонецПроцедуры
 
&НаКлиенте
Процедура НачатьДобавлениеКМЗавершение(РезультатВыполнения, ПараметрыОперации) Экспорт
	
	ОчиститьСообщения();
	Элементы.Главная.Доступность = Истина;
	
	Если РезультатВыполнения.Свойство("СтатусСостояния") И  РезультатВыполнения.СтатусСостояния <> Неопределено Тогда 
		ОбновитьСтатусСостояния(РезультатВыполнения.СтатусСостояния);
	КонецЕсли;
		
	Если РезультатВыполнения.Результат Тогда
		
		РезультатПроверки = ""; 
		РезультатОтвета = Новый Структура();
		Если РезультатВыполнения.Свойство("РезультатПроверки") Тогда     
			РезультатОтвета = РасшифроватьОтветПИоТ(РезультатВыполнения.РезультатПроверки);    
			РезультатПроверки = ОбщегоНазначенияБПОСлужебныйВызовСервера.ФорматироватьJSON(РезультатВыполнения.РезультатПроверки);
		КонецЕсли;                      
		
		ИдентификаторЗапросаРазрешения = ?(РезультатОтвета.Свойство("reqId"), РезультатОтвета.reqId, "");
		ВремяЗапросаРазрешения = ?(РезультатОтвета.Свойство("reqTimestamp"), РезультатОтвета.reqTimestamp, "");  
		ИдентификаторЭкземпляра  = ?(РезультатОтвета.Свойство("inst"), РезультатОтвета.inst, "");     
		ВерсияБазы  = ?(РезультатОтвета.Свойство("version"), РезультатОтвета.version, ""); 
		GTIN = ?(РезультатОтвета.Свойство("gtin"), РезультатОтвета.gtin, "");
		CIS = СокрЛП(?(РезультатОтвета.Свойство("cis"), РезультатОтвета.cis, ""));   
		CIS = СтрЗаменить(CIS, ОбщегоНазначенияБПОКлиентСервер.РазделительGS1(), "");
		
		ПараметрыСтроки = ПараметрыСтрокиЧека();  
		ПараметрыСтроки.КонтрольнаяМарка = ПараметрыОперации.КодМаркировки; 
		ПараметрыСтроки.Вставить("ИдентификаторЗапросаРазрешения", ИдентификаторЗапросаРазрешения);
		ПараметрыСтроки.Вставить("ВремяЗапросаРазрешения"  , ВремяЗапросаРазрешения); 
		ПараметрыСтроки.Вставить("ИдентификаторЭкземпляра" , ИдентификаторЭкземпляра); 
		ПараметрыСтроки.Вставить("ВерсияБазы"              , ВерсияБазы); 
		ПараметрыСтроки.Вставить("GTIN", GTIN); 
		ПараметрыСтроки.Вставить("CIS", CIS);   
		ПараметрыСтроки.Вставить("РезультатПроверки", РезультатВыполнения.РезультатПроверки);
		ПараметрыСтроки.Вставить("ЗапросПроверки", РезультатВыполнения.ЗапросПроверки);
		
		РезультатПараметры = РезультатВыполнения.РезультатПараметры; 
		
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(РезультатПроверки + Символы.ПС));
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Принятие решения ПМСР'") + Символы.ПС , КрупныйШрифтТекста(), ));
		Если РезультатПараметры.РезультатПроверки Тогда
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Товар доступен к продаже'"), КрупныйШрифтТекста(), ЦветСтиляАкцента()));
		Иначе
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'ЗАПРЕТ ПРОДАЖИ'") 
				+ "(" + РезультатПараметры.ОписаниеРезультата + ")", КрупныйШрифтТекста(), ЦветСтиляОтрицательногоЧисла()));
		КонецЕсли;
		ФормСтрока = Новый ФорматированнаяСтрока(МассивСтрок);      
			
		Кнопки = Новый СписокЗначений();    
		Если РезультатПараметры.РезультатПроверки Тогда
			Кнопки.Добавить("ДобавитьТовар", НСтр("ru = 'Добавить товар в чек'"));
		КонецЕсли;
		Кнопки.Добавить("ЗапретПродажи",  НСтр("ru = 'Отмена'"));
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ДобавитьТоварВЧекПродолжить", ЭтотОбъект, ПараметрыСтроки),
			ФормСтрока,
			Кнопки,,, НСтр("ru = 'Добавить товар в чек?'"));
	Иначе
		ПоказатьПредупреждение(Неопределено, РезультатВыполнения.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТоварВЧекПродолжить(Ответ, ПараметрыОперации) Экспорт
	
	Результат = Ответ = "ДобавитьТовар";
	
	ПараметрыОперации.Вставить("ПродажаРазрешена", Результат); 
	ЗаписьВЖурналОперацийПроверкиКМ(ПараметрыОперации);
	
	Если Результат Тогда
		ДобавитьТоварВЧек(ПараметрыОперации);   
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПроверкаКМЗавершение(РезультатВыполнения, ПараметрыОперации) Экспорт
	
	ОчиститьСообщения();
	Элементы.Главная.Доступность = Истина;
	
	Если РезультатВыполнения.Результат Тогда
		
		ПараметрыОперации = ПолучитьШаблонЧека(ККТ);
		
		ОповещениеПриЗавершении = Новый ОписаниеОповещения("КомандаВыполнитьЧекФискализацияЗавершение", ЭтотОбъект);
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьФискализациюЧекаНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, ККТ, ПараметрыОперации, ДополнительныеПараметры);
	
	Иначе
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
	КонецЕсли;
	
	ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыСтрокиЧека()  
	
	Результат = Новый Структура();
	Результат.Вставить("Наименование", "Наименование товара");
	Результат.Вставить("GTIN");
	Результат.Вставить("CIS");
	Результат.Вставить("КонтрольнаяМарка");
	Результат.Вставить("Цена", 0);
	Результат.Вставить("Количество", 1);   
	Результат.Вставить("ИдентификаторЗапросаРазрешения");
	Результат.Вставить("ВремяЗапросаРазрешения");              
	Результат.Вставить("ИдентификаторЭкземпляра"); 
	Результат.Вставить("ВерсияБазы"); 
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ДобавитьТоварВЧек(ПараметрыСтроки)
	
	Наименование = ПараметрыСтроки.Наименование; 
	Цена = 99;
	
	ШтриховойКод = МенеджерОборудованияМаркировкаКлиентСервер.РазобратьШтриховойКодТовара(ПараметрыСтроки.КонтрольнаяМарка, Истина);
	
	Если ШтриховойКод.Разобран Тогда 
		Отбор = Новый Структура;
		Отбор.Вставить("GTIN", ШтриховойКод.GTIN);
		Результат = ТестовыеДанные.НайтиСтроки(Отбор);
		Если Результат.Количество() > 0 Тогда
			Наименование = Результат[0].Наименование;       
			Цена = Результат[0].Цена;           
			Если ШтриховойКод.ЕстьМРЦ Тогда
				Цена = ШтриховойКод.МРЦ;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Строка = Товары.Добавить();
	Строка.Наименование =Наименование;  
	Строка.GTIN = ПараметрыСтроки.GTIN;
	Строка.CIS = ПараметрыСтроки.CIS;
	Строка.НДС = 20;
	Строка.Цена = Цена;
	Строка.Количество = ПараметрыСтроки.Количество;   
	Строка.КонтрольнаяМарка = ПараметрыСтроки.КонтрольнаяМарка;
	Строка.Сумма = Строка.Количество * Строка.Цена;    
	Строка.ИдентификаторЗапросаРазрешения = ПараметрыСтроки.ИдентификаторЗапросаРазрешения;
	Строка.ВремяЗапросаРазрешения = ПараметрыСтроки.ВремяЗапросаРазрешения;      
	Строка.ИдентификаторЭкземпляра = ПараметрыСтроки.ИдентификаторЭкземпляра; 
	Строка.ВерсияБазы = ПараметрыСтроки.ВерсияБазы; 
	
КонецПроцедуры    

&НаКлиенте
Процедура НачатьДобавлениеКМ(КонтрольнаяМарка)   
	
	Если Не ЗначениеЗаполнено(ККТ) Тогда      
		ПоказатьПредупреждение(Неопределено, НСтр("ru='ККТ не выбран.'"));
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("КонтрольнаяМарка", КонтрольнаяМарка);
	Результат = Товары.НайтиСтроки(Отбор);
	Если Результат.Количество() > 0 Тогда
		ТекстСообщения = НСтр("ru='Данная позиция уже добавлена в чек.'");
		ПоказатьПредупреждение(Неопределено, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если НЕ (СТ_ГотовКПроверкеКМOnline Или СТ_ГотовКПроверкеКМOffline) Тогда    
		ТекстСообщения = НСтр("ru='""ТС ПИоТ"" не находиться в статусе готовности к проверке КМ.'") 
			+ Символы.ПС + НСтр("ru='Обновите статус ТС ПИоТ.'");
		ПоказатьПредупреждение(Неопределено, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если СТ_АварийныйРежим  Тогда    
		ТекстСообщения = НСтр("ru='Введен аварийный режим. Проверка КМ не выполняется.'");
		ПоказатьПредупреждение(Неопределено, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Элементы.Главная.Доступность = Ложь;
	
	ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыПроверкиКМПИоТ();     
	ПараметрыОперации.КодМаркировки = КонтрольнаяМарка;  
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("НачатьДобавлениеКМЗавершение", ЭтотОбъект, ПараметрыОперации);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПроверкаКМПИоТ(ОповещениеПриЗавершении, УникальныйИдентификатор, ККТ, ПараметрыОперации, ДополнительныеПараметры);
	
КонецПроцедуры  

&НаКлиенте
Процедура НачатьПроверитьКМ()
	
	ККТ_ПланируемыйСтатусТовара = ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.ШтучныйТоварРеализован");
	
	// Создание структуры параметров
	ПараметрыПакетнойОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыПроверкиКМ();
	ПараметрыПакетнойОперации.ОтображатьФорму = Ложь;
	Для Каждого Товар Из Товары Цикл
		ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыЗапросКМ();
		ПараметрыОперации.ЗапросПроверкиКМСредствамиККТ = Истина;      
		ПараметрыОперации.ИдентификаторЗапросаРазрешения = Товар.ИдентификаторЗапросаРазрешения;
		ПараметрыОперации.ВремяЗапросаРазрешения = Товар.ВремяЗапросаРазрешения;
		ПараметрыОперации.Наименование = Товар.Наименование;
		ПараметрыОперации.ИгнорироватьРезультатПроверкиКМ = Истина;
		ПараметрыОперации.ОжидатьПолучениеОтветаОИСМ = Ложь;   
		ПараметрыОперации.ЗапросРазрешенияПродажиКМ = Истина;
		ПараметрыОперации.Количество = Товар.Количество;  
		ПараметрыОперации.ПланируемыйСтатусТовара = ККТ_ПланируемыйСтатусТовара;
		ПараметрыОперации.КонтрольнаяМарка = Товар.КонтрольнаяМарка;
		ПараметрыПакетнойОперации.ЗапросыКМ.Добавить(ПараметрыОперации);
	КонецЦикла;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("НачатьПроверкаКМЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПроверкуКМ(ОповещениеПриЗавершении, УникальныйИдентификатор, ККТ, ПараметрыПакетнойОперации, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Функция РасшифроватьОтветПИоТ(Текст) 
	
	Результат = Новый Структура();      
	
	Если СтрНачинаетсяС(Текст, "{") Или СтрНачинаетсяС(Текст, "[") Тогда
		
		ЧтениеJSON = Новый ЧтениеJSON();
		ЧтениеJSON.УстановитьСтроку(Текст);
		Данные = ПрочитатьJSON(ЧтениеJSON, Истина);    
		Для Каждого КлючЗначение Из Данные Цикл    
			Если КлючЗначение.Ключ = "codesResponse" Тогда  
				Для Каждого ОтветЗначение Из КлючЗначение.Значение Цикл  
					Если ОтветЗначение.Ключ = "codesResponse" Тогда    
						Для Каждого ЭлементОтвета Из ОтветЗначение.Значение[0] Цикл 
							Значение = ЭлементОтвета.Значение;
							Если ТипЗнч(Значение) = Тип("Число") Тогда
								Значение = Формат(Значение,"ЧГ=0"); 
							КонецЕсли;
							Результат.Вставить(ЭлементОтвета.Ключ, Значение);
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		Если Результат.Свойство("codes") Тогда
			Для Каждого ЭлементОтвета Из Результат.codes[0] Цикл  
				Значение = ЭлементОтвета.Значение;
				Если ТипЗнч(Значение) = Тип("Число") Тогда
					Значение = Формат(Значение,"ЧГ=0"); 
				КонецЕсли;
				Результат.Вставить(ЭлементОтвета.Ключ, Значение);
			КонецЦикла;
		КонецЕсли;        
		
		Если Результат.Свойство("results") Тогда
			Для Каждого ЭлементОтвета Из Результат.results[0] Цикл  
				Значение = ЭлементОтвета.Значение;
				Если ТипЗнч(Значение) = Тип("Число") Тогда
					Значение = Формат(Значение,"ЧГ=0"); 
				КонецЕсли;
				Результат.Вставить(ЭлементОтвета.Ключ, Значение);
				
				Если ЭлементОтвета.Ключ = "codes" Тогда
					Для Каждого ЭлементОтвета Из Значение[0] Цикл  
						ЗначениеЛок = ЭлементОтвета.Значение;
						Если ТипЗнч(ЗначениеЛок) = Тип("Число") Тогда
						Значение = Формат(ЗначениеЛок,"ЧГ=0"); 
						КонецЕсли;
					Результат.Вставить(ЭлементОтвета.Ключ, ЗначениеЛок);
					КонецЦикла;    
				КонецЕсли;
				
			КонецЦикла;    
			
		КонецЕсли;

	КонецЕсли;
	
	Возврат Результат;  
	
КонецФункции

&НаКлиенте
Процедура ТестовыеДанныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = ТестовыеДанные.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если ТекущиеДанные <> Неопределено Тогда
		СообщениеТекст = ТекущиеДанные.Название + Символы.ПС +   
						ТекущиеДанные.Наименование  + Символы.ПС + 
						НСтр("ru = 'Цена: '") + ТекущиеДанные.Цена + Символы.ПС + 
						ТекущиеДанные.КодМаркировки;
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить("Продолжить", НСтр("ru = 'Продолжить'"));
		Кнопки.Добавить("Отмена",  НСтр("ru = 'Отмена'"));
		ПоказатьВопрос(Новый ОписаниеОповещения("ТестовыеДанныеВыборПродолжить", ЭтотОбъект, ТекущиеДанные),
			СообщениеТекст,
			Кнопки,,, НСтр("ru = 'Добавить позиции по сценарию'"))
	КонецЕсли

КонецПроцедуры       

&НаКлиенте
Процедура ТестовыеДанныеВыборПродолжить(Ответ, ПараметрыОперации) Экспорт
	
	Если Ответ <> "Продолжить" Тогда
		Возврат; 
	КонецЕсли;                          
	
	НачатьДобавлениеКМ(ПараметрыОперации.КодМаркировки);   
	
КонецПроцедуры

&НаСервере
Функция КрупныйШрифтТекста();
	
	Возврат ШрифтыСтиля.КрупныйШрифтТекста;
	
КонецФункции

&НаСервере
Функция ЦветСтиляАкцента();
	
	Возврат ЦветаСтиля.ЦветАкцента;
	
КонецФункции

&НаСервере
Функция ЦветСтиляОтрицательногоЧисла();
	
	Возврат ЦветаСтиля.ЦветОтрицательногоЧисла
	
КонецФункции

&НаКлиенте
Процедура ФайлЛогированияНажатиеЗавершение(КодВозврата, ДополнительныйПараметр) Экспорт
		
	ТекстСообщения = НСтр("ru='Операция завершена.'");
	ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);

КонецПроцедуры 

&НаКлиенте
Процедура ФайлЛогированияНажатие(Элемент)
	
	Оповещение = Новый ОписаниеОповещения("ФайлЛогированияНажатиеЗавершение", ЭтотОбъект);
	НачатьЗапускПриложения(Оповещение, ПИоТ_ПустьКЛогам,, Истина); 
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьУдаленниеФискальныеОперацииНаСервере()
	
	НаборЗаписей = РегистрыСведений.ФискальныеОперации.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.ОперацииПроверкиКМ.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
КонецПроцедуры     

&НаКлиенте
Процедура ОчиститьПроверки(Команда)         
	
	ВыполнитьУдаленниеФискальныеОперацииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьОборудованиеНаСервере()

	Отбор = Новый Структура("РабочееМесто", РабочееМесто);
	ОборудованиеРМ = Справочники.ПодключаемоеОборудование.Выбрать(,, Отбор);
	Пока ОборудованиеРМ.Следующий() Цикл
		Если НЕ ОборудованиеРМ.УстройствоИспользуется Или ОборудованиеРМ.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		_ТипОборудования = ОборудованиеРМ.ТипОборудования;
		Если _ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.СканерШтрихкода Тогда
			СканерШтрихкода = ОборудованиеРМ.Ссылка;
		ИначеЕсли _ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ Тогда
			ККТ = ОборудованиеРМ.Ссылка;
		Иначе
			Продолжить;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
