
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ГруппыСК.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьГруппу(Команда)
	Если Не Параметры.Ключ.Пустая() Тогда
		ПараметрыФормы = новый Структура("Группа");
		ПараметрыФормы.Группа = Объект.Ссылка;
		ОткрытьФорму("РегистрСведений.ЛБ_ГруппыСхемКредитования.ФормаЗаписи", ПараметрыФормы, ЭтаФорма,,,,
		Новый ОписаниеОповещения("ОбработкаКомандыЗавершение",ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе                        
		Сообщить("Перед добавлением необходимо записать справочник!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыЗавершение(Результат,ДополнительныеПараметры) Экспорт
		
	ГруппыСК.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);	
	
КонецПроцедуры

