
&НаКлиенте
Процедура Печать(Команда)
	ЭтаФорма.Закрыть(Истина);
КонецПроцедуры

&НаКлиенте
Процедура Просмотр(Команда)
	ЭтаФорма.Закрыть(Ложь);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//+МАН 15.12.25 Для заполнения заголовка
	Если Параметры.Свойство("Период") Тогда
		Если Параметры.Период Тогда
			ЭтаФорма.Заголовок = "Пакет отчетов по кассе за период " + Формат(Параметры.ДатаНач, "ДФ=dd.MM.yyyy") + " - " + Формат(Параметры.ДатаКон, "ДФ=dd.MM.yyyy");
		Иначе
			ЭтаФорма.Заголовок = "Пакет отчетов по кассе за день " + Формат(Параметры.ДатаНач, "ДФ=dd.MM.yyyy");
		КонецЕсли;
	КонецЕсли;
	//-МАН
КонецПроцедуры
