
&НаСервере
Процедура Команда1НаСервере()    
	Парамс = Новый Структура;
	Парамс.Вставить("НачДата",         Формат(Нач,"ДФ=dd.MM.yyyy"));
	Парамс.Вставить("КонДата",         Формат(Кон,"ДФ=dd.MM.yyyy"));
	Парамс.Вставить("ТолькоКлиенты",   ТолькоКлиенты);
	Парамс.Вставить("НеГрузитьАдреса", НеГрузитьАдреса); 
	
	Если ЗначениеЗаполнено(Лом) Тогда
		Парамс.Вставить("Ломбард", СокрЛП(Лом));

   		ЛБ_ОбменLX.ЗагрузитьВыдачуЗаймов(Парамс); 	
	Иначе

	//2,5,7,8,25,46,47,48,61,67,71,73,87,100,121,149,158,162
	//        
	Парамс.Вставить("Ломбард", "1");  	ЛБ_ОбменLX.ЗагрузитьВыдачуЗаймов(Парамс);
	Парамс.Вставить("Ломбард", "2");  	ЛБ_ОбменLX.ЗагрузитьВыдачуЗаймов(Парамс);
	Парамс.Вставить("Ломбард", "5");  	ЛБ_ОбменLX.ЗагрузитьВыдачуЗаймов(Парамс);
	Парамс.Вставить("Ломбард", "7");  	ЛБ_ОбменLX.ЗагрузитьВыдачуЗаймов(Парамс);
	Парамс.Вставить("Ломбард", "8");  	ЛБ_ОбменLX.ЗагрузитьВыдачуЗаймов(Парамс);
	Парамс.Вставить("Ломбард", "25");  	ЛБ_ОбменLX.ЗагрузитьВыдачуЗаймов(Парамс);
	Парамс.Вставить("Ломбард", "46");  	ЛБ_ОбменLX.ЗагрузитьВыдачуЗаймов(Парамс);
	Парамс.Вставить("Ломбард", "47");  	ЛБ_ОбменLX.ЗагрузитьВыдачуЗаймов(Парамс);
	Парамс.Вставить("Ломбард", "48");  	ЛБ_ОбменLX.ЗагрузитьВыдачуЗаймов(Парамс); 
	Парамс.Вставить("Ломбард", "61");  	ЛБ_ОбменLX.ЗагрузитьВыдачуЗаймов(Парамс);
	Парамс.Вставить("Ломбард", "67");  	ЛБ_ОбменLX.ЗагрузитьВыдачуЗаймов(Парамс);
	Парамс.Вставить("Ломбард", "71");  	ЛБ_ОбменLX.ЗагрузитьВыдачуЗаймов(Парамс);
	Парамс.Вставить("Ломбард", "73");  	ЛБ_ОбменLX.ЗагрузитьВыдачуЗаймов(Парамс);
	Парамс.Вставить("Ломбард", "87");  	ЛБ_ОбменLX.ЗагрузитьВыдачуЗаймов(Парамс); 
	Парамс.Вставить("Ломбард", "100");  	ЛБ_ОбменLX.ЗагрузитьВыдачуЗаймов(Парамс);
	Парамс.Вставить("Ломбард", "121");  	ЛБ_ОбменLX.ЗагрузитьВыдачуЗаймов(Парамс);
	Парамс.Вставить("Ломбард", "149");  	ЛБ_ОбменLX.ЗагрузитьВыдачуЗаймов(Парамс);
	Парамс.Вставить("Ломбард", "158");  	ЛБ_ОбменLX.ЗагрузитьВыдачуЗаймов(Парамс);
	Парамс.Вставить("Ломбард", "162");  	ЛБ_ОбменLX.ЗагрузитьВыдачуЗаймов(Парамс);
	
	Парамс.Вставить("Ломбард", "51");  	ЛБ_ОбменLX.ЗагрузитьВыдачуЗаймов(Парамс);
	Парамс.Вставить("Ломбард", "60");  	ЛБ_ОбменLX.ЗагрузитьВыдачуЗаймов(Парамс);
	Парамс.Вставить("Ломбард", "66");  	ЛБ_ОбменLX.ЗагрузитьВыдачуЗаймов(Парамс);
	Парамс.Вставить("Ломбард", "69");  	ЛБ_ОбменLX.ЗагрузитьВыдачуЗаймов(Парамс);
	Парамс.Вставить("Ломбард", "83");  	ЛБ_ОбменLX.ЗагрузитьВыдачуЗаймов(Парамс);
	Парамс.Вставить("Ломбард", "91");  	ЛБ_ОбменLX.ЗагрузитьВыдачуЗаймов(Парамс);
	Парамс.Вставить("Ломбард", "93");  	ЛБ_ОбменLX.ЗагрузитьВыдачуЗаймов(Парамс);
	Парамс.Вставить("Ломбард", "97");  	ЛБ_ОбменLX.ЗагрузитьВыдачуЗаймов(Парамс);
	Парамс.Вставить("Ломбард", "103");  	ЛБ_ОбменLX.ЗагрузитьВыдачуЗаймов(Парамс); 
	Парамс.Вставить("Ломбард", "136");  	ЛБ_ОбменLX.ЗагрузитьВыдачуЗаймов(Парамс);
	Парамс.Вставить("Ломбард", "145");  	ЛБ_ОбменLX.ЗагрузитьВыдачуЗаймов(Парамс);
	Парамс.Вставить("Ломбард", "160");  	ЛБ_ОбменLX.ЗагрузитьВыдачуЗаймов(Парамс);


    КонецЕсли;




	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагруитьВозвратНаСервере()  
	Если ЗначениеЗаполнено(Лом) Тогда
		ЛБ_ОбменLX.ЗагрузитьВозвратЗаймов(Формат(Нач,"ДФ=dd.MM.yyyy"), Формат(Кон,"ДФ=dd.MM.yyyy"), СокрЛП(Лом));
	Иначе
	
	ЛБ_ОбменLX.ЗагрузитьВозвратЗаймов(Формат(Нач,"ДФ=dd.MM.yyyy"), Формат(Кон,"ДФ=dd.MM.yyyy"), СокрЛП("1")); 
    //возврат;
	ЛБ_ОбменLX.ЗагрузитьВозвратЗаймов(Формат(Нач,"ДФ=dd.MM.yyyy"), Формат(Кон,"ДФ=dd.MM.yyyy"), СокрЛП("2")); 
	ЛБ_ОбменLX.ЗагрузитьВозвратЗаймов(Формат(Нач,"ДФ=dd.MM.yyyy"), Формат(Кон,"ДФ=dd.MM.yyyy"), СокрЛП("5")); 
	ЛБ_ОбменLX.ЗагрузитьВозвратЗаймов(Формат(Нач,"ДФ=dd.MM.yyyy"), Формат(Кон,"ДФ=dd.MM.yyyy"), СокрЛП("7"));
	ЛБ_ОбменLX.ЗагрузитьВозвратЗаймов(Формат(Нач,"ДФ=dd.MM.yyyy"), Формат(Кон,"ДФ=dd.MM.yyyy"), СокрЛП("8"));
	ЛБ_ОбменLX.ЗагрузитьВозвратЗаймов(Формат(Нач,"ДФ=dd.MM.yyyy"), Формат(Кон,"ДФ=dd.MM.yyyy"), СокрЛП("25")); 
	ЛБ_ОбменLX.ЗагрузитьВозвратЗаймов(Формат(Нач,"ДФ=dd.MM.yyyy"), Формат(Кон,"ДФ=dd.MM.yyyy"), СокрЛП("46")); 
	ЛБ_ОбменLX.ЗагрузитьВозвратЗаймов(Формат(Нач,"ДФ=dd.MM.yyyy"), Формат(Кон,"ДФ=dd.MM.yyyy"), СокрЛП("47")); 
	ЛБ_ОбменLX.ЗагрузитьВозвратЗаймов(Формат(Нач,"ДФ=dd.MM.yyyy"), Формат(Кон,"ДФ=dd.MM.yyyy"), СокрЛП("48"));  
	ЛБ_ОбменLX.ЗагрузитьВозвратЗаймов(Формат(Нач,"ДФ=dd.MM.yyyy"), Формат(Кон,"ДФ=dd.MM.yyyy"), СокрЛП("61")); 
	ЛБ_ОбменLX.ЗагрузитьВозвратЗаймов(Формат(Нач,"ДФ=dd.MM.yyyy"), Формат(Кон,"ДФ=dd.MM.yyyy"), СокрЛП("67"));
	ЛБ_ОбменLX.ЗагрузитьВозвратЗаймов(Формат(Нач,"ДФ=dd.MM.yyyy"), Формат(Кон,"ДФ=dd.MM.yyyy"), СокрЛП("71"));
	ЛБ_ОбменLX.ЗагрузитьВозвратЗаймов(Формат(Нач,"ДФ=dd.MM.yyyy"), Формат(Кон,"ДФ=dd.MM.yyyy"), СокрЛП("73"));
	ЛБ_ОбменLX.ЗагрузитьВозвратЗаймов(Формат(Нач,"ДФ=dd.MM.yyyy"), Формат(Кон,"ДФ=dd.MM.yyyy"), СокрЛП("87"));
	ЛБ_ОбменLX.ЗагрузитьВозвратЗаймов(Формат(Нач,"ДФ=dd.MM.yyyy"), Формат(Кон,"ДФ=dd.MM.yyyy"), СокрЛП("100"));
	ЛБ_ОбменLX.ЗагрузитьВозвратЗаймов(Формат(Нач,"ДФ=dd.MM.yyyy"), Формат(Кон,"ДФ=dd.MM.yyyy"), СокрЛП("121"));
	ЛБ_ОбменLX.ЗагрузитьВозвратЗаймов(Формат(Нач,"ДФ=dd.MM.yyyy"), Формат(Кон,"ДФ=dd.MM.yyyy"), СокрЛП("149"));
	ЛБ_ОбменLX.ЗагрузитьВозвратЗаймов(Формат(Нач,"ДФ=dd.MM.yyyy"), Формат(Кон,"ДФ=dd.MM.yyyy"), СокрЛП("158")); 
	ЛБ_ОбменLX.ЗагрузитьВозвратЗаймов(Формат(Нач,"ДФ=dd.MM.yyyy"), Формат(Кон,"ДФ=dd.MM.yyyy"), СокрЛП("162")); 
	//
	////51,60,66,69,83,91,93,97,103,136,145,160	
	ЛБ_ОбменLX.ЗагрузитьВозвратЗаймов(Формат(Нач,"ДФ=dd.MM.yyyy"), Формат(Кон,"ДФ=dd.MM.yyyy"), СокрЛП("51"));
	ЛБ_ОбменLX.ЗагрузитьВозвратЗаймов(Формат(Нач,"ДФ=dd.MM.yyyy"), Формат(Кон,"ДФ=dd.MM.yyyy"), СокрЛП("60"));
	ЛБ_ОбменLX.ЗагрузитьВозвратЗаймов(Формат(Нач,"ДФ=dd.MM.yyyy"), Формат(Кон,"ДФ=dd.MM.yyyy"), СокрЛП("66"));
	ЛБ_ОбменLX.ЗагрузитьВозвратЗаймов(Формат(Нач,"ДФ=dd.MM.yyyy"), Формат(Кон,"ДФ=dd.MM.yyyy"), СокрЛП("69"));
	ЛБ_ОбменLX.ЗагрузитьВозвратЗаймов(Формат(Нач,"ДФ=dd.MM.yyyy"), Формат(Кон,"ДФ=dd.MM.yyyy"), СокрЛП("83"));
	ЛБ_ОбменLX.ЗагрузитьВозвратЗаймов(Формат(Нач,"ДФ=dd.MM.yyyy"), Формат(Кон,"ДФ=dd.MM.yyyy"), СокрЛП("91"));
	ЛБ_ОбменLX.ЗагрузитьВозвратЗаймов(Формат(Нач,"ДФ=dd.MM.yyyy"), Формат(Кон,"ДФ=dd.MM.yyyy"), СокрЛП("93"));
	ЛБ_ОбменLX.ЗагрузитьВозвратЗаймов(Формат(Нач,"ДФ=dd.MM.yyyy"), Формат(Кон,"ДФ=dd.MM.yyyy"), СокрЛП("97")); 
	ЛБ_ОбменLX.ЗагрузитьВозвратЗаймов(Формат(Нач,"ДФ=dd.MM.yyyy"), Формат(Кон,"ДФ=dd.MM.yyyy"), СокрЛП("103"));  
	ЛБ_ОбменLX.ЗагрузитьВозвратЗаймов(Формат(Нач,"ДФ=dd.MM.yyyy"), Формат(Кон,"ДФ=dd.MM.yyyy"), СокрЛП("136"));
	ЛБ_ОбменLX.ЗагрузитьВозвратЗаймов(Формат(Нач,"ДФ=dd.MM.yyyy"), Формат(Кон,"ДФ=dd.MM.yyyy"), СокрЛП("145")); 
	ЛБ_ОбменLX.ЗагрузитьВозвратЗаймов(Формат(Нач,"ДФ=dd.MM.yyyy"), Формат(Кон,"ДФ=dd.MM.yyyy"), СокрЛП("160"));  
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗагруитьВозврат(Команда)
	ЗагруитьВозвратНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	а = 0;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	а =0 ;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьОХНаСервере()
	Если Не ЗначениеЗаполнено(Ломбард) Тогда
		Сообщить("Выберите ломбард");
		Возврат ;
	КонецЕсли;

	ЛБ_ОбменLX.ЗагрузитьВыдачуОтветхранения(Формат(Нач,"ДФ=dd.MM.yyyy"), Формат(Кон,"ДФ=dd.MM.yyyy"), СокрЛП(Ломбард.id_LX));

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОХ(Команда)
	ЗагрузитьОХНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьРеквизитыНаСервере()
	ЛБ_ОбменLX.ЗаполнитьРеквизитыЛомбардов();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьРеквизиты(Команда)
	ЗагрузитьРеквизитыНаСервере();
КонецПроцедуры
