Перем мСуммаПроцентовДень Экспорт;
Перем мСуммаПроцентовСрок Экспорт;
Перем КассоваяСмена Экспорт;
Перем СводныйПКО Экспорт;
Перем СводныйРКО Экспорт; 
Перем ПроводитьПоКассовойСмене Экспорт; 
Перем СкладЛомбарда Экспорт;
//Перем ДатаПереводаВИтоговыйСтатусБН Экспорт;
	  	
Процедура ЗакрытьДоверенностиПоЗалоговомуБилету(Клиент, ЗалоговыйБилет) 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.УстановитьПараметр("Клиент", Клиент); 	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДоверенностиСрезПоследних.Доверенность КАК Доверенность,
	               |	ЛБ_ДоверенностиСрезПоследних.СтатусДоверенности КАК СтатусДоверенности,
	               |	ЛБ_ДоверенностиСрезПоследних.ВидОперации КАК ВидОперации,
	               |	ЛБ_ДоверенностиСрезПоследних.Ломбард КАК Ломбард,
	               |	ЛБ_ДоверенностиСрезПоследних.Ответственный КАК Ответственный
	               |ИЗ
	               |	РегистрСведений.ЛБ_Доверенности.СрезПоследних(
	               |			&Дата,
	               |			ЗалоговыйБилет = &ЗалоговыйБилет
	               |				И Клиент = &Клиент) КАК ЛБ_ДоверенностиСрезПоследних";  
	Выборка = Запрос.Выполнить().Выбрать(); 
	Пока Выборка.Следующий() Цикл   
		Если НЕ Выборка.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.ДоверенностьОформлена Тогда
			Продолжить; 
		ИначеЕсли НЕ (Выборка.Доверенность.СрокДействияДоверенности = Дата(1,1,1)) И (Выборка.Доверенность.СрокДействияДоверенности < ЭтотОбъект.Дата) Тогда
			Продолжить;	
		КонецЕсли;	
		
		Движения.ЛБ_Доверенности.Записывать = Истина;
		Движение = Движения.ЛБ_Доверенности.Добавить();
        Движение.Период = Дата; 
		Движение.Доверенность = Выборка.Доверенность;
		Движение.Клиент = Клиент;
		Движение.ЗалоговыйБилет = ЗалоговыйБилет;  
		Движение.ВидОперации = Выборка.ВидОперации; 
		Движение.Ломбард = Выборка.Ломбард;
        Движение.Ответственный = Выборка.Ответственный;				
		Движение.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.ДействиеПрекращеноЗаймВыкуплен; 
	КонецЦикла;	
КонецПроцедуры

Процедура ВосстановитьДоверенностиПоЗалоговомуБилету(Клиент, ЗалоговыйБилет) 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.УстановитьПараметр("Клиент", Клиент); 	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДоверенностиСрезПоследних.Доверенность КАК Доверенность,
	               |	ЛБ_ДоверенностиСрезПоследних.СтатусДоверенности КАК СтатусДоверенности,
	               |	ЛБ_ДоверенностиСрезПоследних.ВидОперации КАК ВидОперации,
	               |	ЛБ_ДоверенностиСрезПоследних.Ломбард КАК Ломбард,
	               |	ЛБ_ДоверенностиСрезПоследних.Ответственный КАК Ответственный
	               |ИЗ
	               |	РегистрСведений.ЛБ_Доверенности.СрезПоследних(
	               |			&Дата,
	               |			ЗалоговыйБилет = &ЗалоговыйБилет
	               |				И Клиент = &Клиент) КАК ЛБ_ДоверенностиСрезПоследних";  
	Выборка = Запрос.Выполнить().Выбрать(); 
	Пока Выборка.Следующий() Цикл   
		Если Выборка.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.ДоверенностьОформлена Тогда
			Продолжить; 
		ИначеЕсли НЕ (Выборка.Доверенность.СрокДействияДоверенности = Дата(1,1,1)) И (Выборка.Доверенность.СрокДействияДоверенности < ЭтотОбъект.Дата) Тогда
			Продолжить;	
		КонецЕсли;	
		
		Движения.ЛБ_Доверенности.Записывать = Истина;
		Движение = Движения.ЛБ_Доверенности.Добавить();
        Движение.Период = Дата; 
		Движение.Доверенность = Выборка.Доверенность;
		Движение.Клиент = Клиент;
		Движение.ЗалоговыйБилет = ЗалоговыйБилет;  
		Движение.ВидОперации = Выборка.ВидОперации; 
		Движение.Ломбард = Выборка.Ломбард;
        Движение.Ответственный = Выборка.Ответственный;				
		Движение.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.ДоверенностьОформлена; 
	КонецЦикла;	
КонецПроцедуры

//+МАН 09.12.25
Процедура ВосстановитьДоверенностиПоЗалоговомуБилетуПослеОтменыОперации(Клиент, ЗалоговыйБилет) 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДоверенностиСрезПоследних.Доверенность КАК Доверенность,
	               |	ЛБ_ДоверенностиСрезПоследних.СтатусДоверенности КАК СтатусДоверенности,
	               |	ЛБ_ДоверенностиСрезПоследних.ВидОперации КАК ВидОперации,
	               |	ЛБ_ДоверенностиСрезПоследних.Ломбард КАК Ломбард,
	               |	ЛБ_ДоверенностиСрезПоследних.Ответственный КАК Ответственный
	               |ИЗ
	               |	РегистрСведений.ЛБ_Доверенности.СрезПоследних(
	               |			&Дата,
	               |			ЗалоговыйБилет = &ЗалоговыйБилет
	               |				И Клиент = &Клиент) КАК ЛБ_ДоверенностиСрезПоследних";  

	Запрос.УстановитьПараметр("Дата", ЭтотОбъект.ОтмененныйДокумент.Дата - 1);
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.СтатусДоверенности <> Перечисления.ЛБ_СтатусыДоверенностей.ДоверенностьОформлена Тогда
			Продолжить;
		ИначеЕсли Выборка.Доверенность.СрокДействияДоверенности <> Дата(1,1,1) И Выборка.Доверенность.СрокДействияДоверенности < ЭтотОбъект.ОтмененныйДокумент.Дата Тогда
			Продолжить;
		КонецЕсли;
		
		Движения.ЛБ_Доверенности.Записывать = Истина;
		Движение = Движения.ЛБ_Доверенности.Добавить();
        Движение.Период = Дата;
		Движение.Доверенность = Выборка.Доверенность;
		Движение.Клиент = Клиент;
		Движение.ЗалоговыйБилет = ЗалоговыйБилет;
		Движение.ВидОперации = Выборка.ВидОперации;
		Движение.Ломбард = Выборка.Ломбард;
        Движение.Ответственный = Выборка.Ответственный;
		Движение.СтатусДоверенности = Выборка.СтатусДоверенности;
	КонецЦикла;
КонецПроцедуры
//-МАН

Процедура УдалитьИзделияИзНакладнойНаОтгузку(ЗалоговыйБилет, ЭтоИзъятие = ложь) 
	Движения.ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Записывать = Истина;
	Движения.ЛБ_СтатусыОбъектовЗалогаВНакладной.Записывать = Истина; 
	Движения.ЛБ_СтатусыНакладнойНаОтгрузку.Записывать = Истина;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата-1); 
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.Организация КАК Организация,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.Ломбард КАК Ломбард,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.КоличествоОстаток КАК Количество,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.ВесОстаток КАК Вес,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.СуммаОценкиОстаток КАК СуммаОценки
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Остатки(&Дата, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();   
	Если  ТаблицаЗапроса.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоИзъятие Тогда 
		УдСтроки = Новый СписокЗначений;
		Для каждого Стр Из ТаблицаЗапроса Цикл 
			Отбор = Новый Структура;
			Отбор.Вставить("ОбъектЗалога", Стр.ОбъектЗалога);
			Строки = ЭтотОбъект.ТоварыИзъятыеВозвращенные.НайтиСтроки(Отбор); 
			Если Строки.Количество() = 0 Тогда 
				УдСтроки.Добавить(Стр);
			КонецЕсли;	
		КонецЦикла;	                 
		
		Для каждого Эл Из УдСтроки Цикл
			ТаблицаЗапроса.Удалить(Эл.Значение);
		КонецЦикла;	
	КонецЕсли;	
	
	Накладная = ТаблицаЗапроса.Получить(0).НакладнаяНаОтгрузку;
	
	Запрос.УстановитьПараметр("ДатаДок", Дата-1);
	Запрос.УстановитьПараметр("Накладная", Накладная);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус КАК Статус
	               |ИЗ
	               |	РегистрСведений.ЛБ_СтатусыОбъектовЗалогаВНакладной.СрезПоследних(&ДатаДок, НакладнаяНаОтгрузку = &Накладная) КАК ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних";
	ТаблицаСтатусовВНакладной = Запрос.Выполнить().Выгрузить();		
	
	КолИсключить = 0;
	ВесИсключить = 0;  
	СуммаОценкиИсключить = 0;
    Для каждого СтрЗапроса Из ТаблицаЗапроса Цикл 
		Движение = Движения.ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Добавить();
		Движение.Период = Дата;
		Движение.Организация = СтрЗапроса.Организация; 
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Ломбард = СтрЗапроса.Ломбард;
		Движение.НакладнаяНаОтгрузку = СтрЗапроса.НакладнаяНаОтгрузку;
		Движение.ЗалоговыйБилет = СтрЗапроса.ЗалоговыйБилет;
		Движение.ОбъектЗалога = СтрЗапроса.ОбъектЗалога;
		Движение.Количество = СтрЗапроса.Количество; 
		Движение.Вес = СтрЗапроса.Вес; 
		Движение.СуммаОценки = СтрЗапроса.СуммаОценки; 
		
		Движение = Движения.ЛБ_СтатусыОбъектовЗалогаВНакладной.Добавить();
		Движение.Период = Дата;
		Движение.ЗалоговыйБилет = СтрЗапроса.ЗалоговыйБилет; 
        Движение.НакладнаяНаОтгрузку = СтрЗапроса.НакладнаяНаОтгрузку;
		Движение.ОбъектЗалога = СтрЗапроса.ОбъектЗалога;
		Движение.Статус = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.ИсключенИзНакладной;  
		
		Отбор = Новый Структура;
		Отбор.Вставить("НакладнаяНаОтгрузку", СтрЗапроса.НакладнаяНаОтгрузку); 
		Отбор.Вставить("ЗалоговыйБилет", СтрЗапроса.ЗалоговыйБилет);
        Отбор.Вставить("ОбъектЗалога", СтрЗапроса.ОбъектЗалога);

        Строки = ТаблицаСтатусовВНакладной.НайтиСтроки(Отбор);
		Если НЕ Строки.Количество() = 0 Тогда 
			Стр = строки.Получить(0);
			Стр.Статус = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.ИсключенИзНакладной;
		КонецЕсли;	
	КонецЦикла;	  
	
	ВсеИсключенные = Истина; 
	Для каждого СтрС Из ТаблицаСтатусовВНакладной Цикл  
		Если НЕ СтрС.Статус = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.ИсключенИзНакладной Тогда 
			ВсеИсключенные = Ложь;
			Продолжить;
		КонецЕсли;	   
	КонецЦикла;
	
	Если ВсеИсключенные Тогда
		ЗапросН = Новый Запрос; 
		ЗапросН.УстановитьПараметр("Дата", Дата-1); 
		ЗапросН.УстановитьПараметр("НакладнаяНаОтгрузку", Накладная);
		ЗапросН.Текст = "ВЫБРАТЬ
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.НомерНакладной КАК НомерНакладной,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.ДатаНакладной КАК ДатаНакладной,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.ОтказОтВыкупа КАК ОтказОтВыкупа,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.ПовышеннаяОценка КАК ПовышеннаяОценка,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.СтатусНакладной КАК СтатусНакладной,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.Получатель КАК Получатель,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.Инкассатор КАК Инкассатор,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.Комментарий КАК Комментарий
		                |ИЗ
		                |	РегистрСведений.ЛБ_СтатусыНакладнойНаОтгрузку.СрезПоследних(&Дата, НакладнаяНаОтгрузку = &НакладнаяНаОтгрузку) КАК ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних";
	    ВыборкаН = ЗапросН.Выполнить().Выбрать();
		Если ВыборкаН.Следующий() Тогда
			Движение = Движения.ЛБ_СтатусыНакладнойНаОтгрузку.Добавить(); 
			Движение.Период = Дата;
			Движение.НакладнаяНаОтгрузку = ВыборкаН.НакладнаяНаОтгрузку; 
			Движение.НомерНакладной = ВыборкаН.НомерНакладной;
			Движение.ДатаНакладной = ВыборкаН.ДатаНакладной;
			Движение.ОтказОтВыкупа = ВыборкаН.ОтказОтВыкупа;
			Движение.ПовышеннаяОценка = ВыборкаН.ПовышеннаяОценка;
			Движение.СтатусНакладной = ВыборкаН.СтатусНакладной;
			Движение.Комментарий = ВыборкаН.Комментарий; 				
			Движение.ОтветственныйСотрудник = ЭтотОбъект.ОтветственныйСотрудник; 
			Движение.ОтветственныйПользователь = ЭтотОбъект.ОтветственныйПользователь;
			Движение.Пустой = Истина;
		КонецЕсли;		
	КонецЕсли;	
		
КонецПроцедуры	 

Процедура ВосстановитьИзделияВНакладнойНаОтгузку(ОтмененныйДокумент) 
	НаборЗаписей = РегистрыНакопления.ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ОтмененныйДокумент);
	НаборЗаписей.Прочитать(); 
	
	Если  НаборЗаписей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	Движения.ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Записывать = Истина;
	Для каждого Запись Из НаборЗаписей Цикл  
		Движение = Движения.ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Запись.Организация; 
		Движение.ВидДвижения = Запись.ВидДвижения;
		Движение.Ломбард = Запись.Ломбард;
		Движение.НакладнаяНаОтгрузку = Запись.НакладнаяНаОтгрузку;
		Движение.ЗалоговыйБилет = Запись.ЗалоговыйБилет;
		Движение.ОбъектЗалога = Запись.ОбъектЗалога;
		Движение.Количество = -Запись.Количество; 
		Движение.Вес = -Запись.Вес; 
		Движение.СуммаОценки = -Запись.СуммаОценки;
	КонецЦикла;	  
	
	НаборЗаписей = РегистрыСведений.ЛБ_СтатусыОбъектовЗалогаВНакладной.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ОтмененныйДокумент);
	НаборЗаписей.Прочитать(); 
	
	Движения.ЛБ_СтатусыОбъектовЗалогаВНакладной.Записывать = Истина;
	Для каждого Запись Из НаборЗаписей Цикл   
		Движение = Движения.ЛБ_СтатусыОбъектовЗалогаВНакладной.Добавить();
		Движение.Период = Дата;
		Движение.ЗалоговыйБилет = Запись.ЗалоговыйБилет; 
        Движение.НакладнаяНаОтгрузку = Запись.НакладнаяНаОтгрузку;
		Движение.ОбъектЗалога = Запись.ОбъектЗалога;
		Движение.Статус = ЛБ_УправлениеЛомбардом.ПолучитьСтатусОбъектаЗалогаВНакладнойНаОтгрузку(ОтмененныйДокумент.Дата-1, Запись.НакладнаяНаОтгрузку, Запись.ЗалоговыйБилет, Запись.ОбъектЗалога);
	КонецЦикла;	   
	
	НаборЗаписей = РегистрыСведений.ЛБ_СтатусыНакладнойНаОтгрузку.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ОтмененныйДокумент);
	НаборЗаписей.Прочитать(); 
	
	Если НЕ НаборЗаписей.Количество() = 0 Тогда
		Движения.ЛБ_СтатусыНакладнойНаОтгрузку.Записывать = Истина;
		ТаблицаН = НаборЗаписей.Выгрузить();
		Накладная = ТаблицаН.Получить(0).НакладнаяНаОтгрузку;
		
	    ЗапросН = Новый Запрос; 
		ЗапросН.УстановитьПараметр("Дата", ОтмененныйДокумент.Дата-1); 
		ЗапросН.УстановитьПараметр("НакладнаяНаОтгрузку", Накладная);
		ЗапросН.Текст = "ВЫБРАТЬ
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.НомерНакладной КАК НомерНакладной,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.ДатаНакладной КАК ДатаНакладной,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.ОтказОтВыкупа КАК ОтказОтВыкупа,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.ПовышеннаяОценка КАК ПовышеннаяОценка,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.СтатусНакладной КАК СтатусНакладной,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.Получатель КАК Получатель,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.Инкассатор КАК Инкассатор,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.Комментарий КАК Комментарий
		                |ИЗ
		                |	РегистрСведений.ЛБ_СтатусыНакладнойНаОтгрузку.СрезПоследних(&Дата, НакладнаяНаОтгрузку = &НакладнаяНаОтгрузку) КАК ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних";
	    ВыборкаН = ЗапросН.Выполнить().Выбрать();
		Если ВыборкаН.Следующий() Тогда
			Движение = Движения.ЛБ_СтатусыНакладнойНаОтгрузку.Добавить(); 
			Движение.Период = Дата;
			Движение.НакладнаяНаОтгрузку = ВыборкаН.НакладнаяНаОтгрузку; 
			Движение.НомерНакладной = ВыборкаН.НомерНакладной;
			Движение.ДатаНакладной = ВыборкаН.ДатаНакладной;
			Движение.ОтказОтВыкупа = ВыборкаН.ОтказОтВыкупа;
			Движение.ПовышеннаяОценка = ВыборкаН.ПовышеннаяОценка;
			Движение.СтатусНакладной = ВыборкаН.СтатусНакладной;
			Движение.Комментарий = ВыборкаН.Комментарий; 				
			Движение.ОтветственныйСотрудник = ЭтотОбъект.ОтветственныйСотрудник; 
			Движение.ОтветственныйПользователь = ЭтотОбъект.ОтветственныйПользователь;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры	 

Функция ФИОКлиента(Клиент, Дата) 
	Если ЗначениеЗаполнено(Клиент) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Клиент", Клиент); 
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
		               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
		               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество
		               |ИЗ
		               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Клиент) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат СокрЛП(Выборка.Фамилия) + " " + СокрЛП(Выборка.Имя) + ?(НЕ ПустаяСтрока(Выборка.Отчество), " " + СокрЛП(Выборка.Отчество), "");
		КонецЕсли; 
	КонецЕсли;	
	Возврат "";
КонецФункции	

Функция ДокументКлиентаВСтроку(Документ)  
	Если ЗначениеЗаполнено(Документ) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Дата", Дата);  
		Запрос.УстановитьПараметр("ДокументЗалогодателя", Документ);
		Запрос.Текст = "ВЫБРАТЬ
			               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
			               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
			               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
			               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
			               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
			               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
			               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
			               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНачалоДействия КАК ДокументНачалоДействия,
			               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
			               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство
			               |ИЗ
			               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(
			               |			&Дата,
			               |			ДокументЗалогодателя = &ДокументЗалогодателя
			               |				И ОсновнойДУЛ = ИСТИНА) КАК ЛБ_ДокументыЗалогодателейСрезПоследних
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Период УБЫВ";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			Информация = "";
			Информация = СокрЛП(Выборка.ВидДокумента);
			Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументСерия), " " + СокрЛП(Выборка.ДокументСерия), "");
			Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументНомер), " " + СокрЛП(Выборка.ДокументНомер), "");
			Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументКемВыдан), " выдан " + СокрЛП(Выборка.ДокументКемВыдан), "");
			Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументДатаВыдачи), " " + Формат(Выборка.ДокументДатаВыдачи,"ДФ=dd.MM.yyyy"), "");
			Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументКодПодразделения), " код подр. " + СокрЛП(Выборка.ДокументКодПодразделения), "");
			Возврат Информация;
		КонецЕсли;  
	КонецЕсли;	
	Возврат	"";	
КонецФункции 

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	//Если ЭтотОбъект.БезналичнаяОплата ИЛИ ЭтотОбъект.ОтмененныйДокумент.БезналичнаяОплата Тогда
	//	ДатаПереводаВИтоговыйСтатусБН = Дата(1,1,1);
	//	Запрос = Новый Запрос;
	//	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	//	Запрос.Текст = "ВЫБРАТЬ
	//	               |	ЛБ_РеестрБезначныхПлатежей.ДатаПеревода КАК ДатаПеревода
	//	               |ИЗ
	//	               |	РегистрСведений.ЛБ_РеестрБезначныхПлатежей КАК ЛБ_РеестрБезначныхПлатежей
	//	               |ГДЕ
	//	               |	ЛБ_РеестрБезначныхПлатежей.Регистратор = &Регистратор";
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Если Выборка.Следующий() Тогда  
	//		ДатаПереводаВИтоговыйСтатусБН = Выборка.ДатаПеревода;
	//	КонецЕсли;	
	//КонецЕсли;	
    СкладЛомбарда = ЛБ_Общиймодуль.ПолучитьСклад(ЭтотОбъект.Ломбард, Перечисления.ЛБ_ВидыСкладов.Залоги); 
	Если НЕ ЗначениеЗаполнено(СкладЛомбарда) Тогда
		СкладЛомбарда = ЛБ_Общиймодуль.ПолучитьСклад(ЭтотОбъект.ПредыдущаяОперация.Ломбард, Перечисления.ЛБ_ВидыСкладов.Залоги);
	КонецЕсли;
	Если ПометкаУдаления Тогда
		ЗапросП = Новый Запрос;
		ЗапросП.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
		ЗапросП.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
		Если ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог ИЛИ ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда
			ЗапросП.УстановитьПараметр("ЗБ", Ссылка); 
			НомерЗБ = ЭтотОбъект.НомерЗалоговогоБилета; 
		Иначе	 
			ЗапросП.УстановитьПараметр("ЗБ", ЭтотОбъект.ПредыдущаяОперация);
			НомерЗБ = ЭтотОбъект.ПредыдущаяОперация.НомерЗалоговогоБилета; 
		КонецЕсли;	
		ЗапросП.Текст = "ВЫБРАТЬ
		                |	ЛБ_ОборотыПоОперациямЗаймаОбороты.Регистратор КАК Регистратор
		                |ИЗ
		                |	РегистрНакопления.ЛБ_ОборотыПоОперациямЗайма.Обороты(&Дата, , Регистратор, ЗалоговыйБилет = &ЗБ) КАК ЛБ_ОборотыПоОперациямЗаймаОбороты
		                |ГДЕ
		                |	ЛБ_ОборотыПоОперациямЗаймаОбороты.Регистратор <> &Регистратор";
		ВыборкаП = ЗапросП.Выполнить().Выбрать();
		Если ВыборкаП.Следующий() тогда 
			Сообщить("По залоговому билету " + СокрЛП(НомерЗБ) + " есть более поздние операции. Документ нельзя пометить на удаление.");  
			Отказ = Истина;
			Возврат;
		КонецЕсли;    
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	    Если ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога Тогда	
			Запрос = новый Запрос;   
			Запрос.УстановитьПараметр("ЗалоговыйБилет", ЭтотОбъект.ПредыдущаяОперация);
			Запрос.УстановитьПараметр("Ломбард", ЭтотОбъект.Ломбард);
		    Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
			Запрос.УстановитьПараметр("Склад", СкладЛомбарда);
			Запрос.Текст = "ВЫБРАТЬ
			               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
			               |	ЛБ_ОбъектыЗалогаОстатки.Ломбард КАК Ломбард,
			               |	СУММА(ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток) КАК Количество,
			               |	СУММА(ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток) КАК СуммаОценки
			               |ИЗ
			               |	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(
			               |			&Дата,
			               |			ЗалоговыйБилет = &ЗалоговыйБилет
			               |				И Склад = &Склад) КАК ЛБ_ОбъектыЗалогаОстатки
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога,
			               |	ЛБ_ОбъектыЗалогаОстатки.Ломбард";
		    ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
			
			ЕстьНеВыкупленные = ложь;
		   	Для каждого Стр Из ЭтотОбъект.ТоварыВыкупленные цикл   
				Отбор = Новый структура;
				Отбор.Вставить("Ломбард", ЭтотОбъект.Ломбард); 
				Отбор.Вставить("ОбъектЗалога", Стр.ОбъектЗалога); 
				
				Строки = ТаблицаОстатков.НайтиСтроки(Отбор);
				Если Строки.Количество() = 0 Тогда
					ЕстьНеВыкупленные = Истина;
					ОбщегоНазначения.СообщитьПользователю("Объект залога " + СокрЛП(Стр.ОбъектЗалога) + " в ломбарде " + СокрЛП(ЭтотОбъект.Ломбард) + " не найден. Выдача невозможна!"); 
				КонецЕсли;
			КонецЦикла;	
            Если ЕстьНеВыкупленные тогда
				Отказ = Истина;
			КонецЕсли;
			
		ИначеЕсли ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ИзъятиеОбъектовЗалога Тогда
	        Запрос = новый Запрос;   
			Запрос.УстановитьПараметр("ЗалоговыйБилет", ЭтотОбъект.ПредыдущаяОперация);
			Запрос.УстановитьПараметр("Ломбард", ЭтотОбъект.Ломбард);
		    Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);	
			Запрос.УстановитьПараметр("Склад", СкладЛомбарда); 
			ОтборСклад = "";
			Если  НЕ ЭтотОбъект.Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис Тогда 
				ОтборСклад = " И Склад = &Склад";
			КонецЕсли;	
			Запрос.Текст = "ВЫБРАТЬ
			               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
			               |	ЛБ_ОбъектыЗалогаОстатки.Ломбард КАК Ломбард,
			               |	СУММА(ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток) КАК Количество,
			               |	СУММА(ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток) КАК СуммаОценки
			               |ИЗ
			               |	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(
			               |			&Дата,
			               |			ЗалоговыйБилет = &ЗалоговыйБилет";
			Запрос.Текст = Запрос.Текст + ОтборСклад + ") КАК ЛБ_ОбъектыЗалогаОстатки
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога,
			               |	ЛБ_ОбъектыЗалогаОстатки.Ломбард";
		    ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
			
			ЕстьОшибки = Ложь;
			Для каждого Стр Из ЭтотОбъект.ТоварыИзъятыеВозвращенные цикл  
				Отбор = Новый структура;
				Отбор.Вставить("Ломбард", ЭтотОбъект.Ломбард); 
				Отбор.Вставить("ОбъектЗалога", Стр.ОбъектЗалога); 
				
				Строки = ТаблицаОстатков.НайтиСтроки(Отбор);
				Если Строки.Количество() = 0 Тогда
					ОбщегоНазначения.СообщитьПользователю("Объект залога " + СокрЛП(Стр.ОбъектЗалога) + " в ломбарде " + СокрЛП(ЭтотОбъект.Ломбард) + " не найден. Изъятие невозможно!"); 
					ЕстьОшибки = Истина;
				КонецЕсли;;
			КонецЦикла;                 
			Если ЕстьОшибки тогда
				Отказ = Истина;
			КонецЕсли;	
		КонецЕсли;	
		
		Если НЕ Отказ Тогда   
			Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог ИЛИ 
				 ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаЗалога ИЛИ  
				 ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление ИЛИ 
				 ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаПереоформления ИЛИ  
				 ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов ИЛИ 
				 ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаОплаты Тогда 
				РезультатКС = ЛБ_ОбщийМодуль.ПолучитьОткрытуюКассовуюСмену(Дата, Организация, Ломбард); 
				Если НЕ РезультатКС = неопределено Тогда 
				    КассоваяСмена = РезультатКС.КассоваяСмена;
					СводныйПКО = РезультатКС.ПКОСводный;  
					СводныйРКО = РезультатКС.РКОСводный;
				КонецЕсли;	  
   			КонецЕсли;	 
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("ДокументСсылка.ЛБ_ОперацияПоЗалогу") Тогда
		//Или ТипДанныхЗаполнения = Тип("СправочникСсылка.ЮС_ЗалоговыеБилеты") Тогда

		// Заполнение реквизитов из стандартного набора по документу основанию.
		//ЮС_УправлениеЛомбардом.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, ДанныеЗаполнения);
		
		// Заполнение реквизитов шапки по документу основанию.
		//Если ВидОперации = Перечисления.ЮС_ВидыОперацийОперацияПоЗалогу.Выкуп
		//	ИЛИ ВидОперации = Перечисления.ЮС_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов Тогда
		//	
		//	ЗалоговыйБилет = ДанныеЗаполнения.ЗалоговыйБилет;
		//	
		//КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог ИЛИ ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда 
		ЭтоЗБ = Истина;
	Иначе  
		ЭтоЗБ = ложь;
	КонецЕсли;    
	
	СкладЛомбарда = ЛБ_Общиймодуль.ПолучитьСклад(ЭтотОбъект.Ломбард, Перечисления.ЛБ_ВидыСкладов.Залоги); 
	Если НЕ ЗначениеЗаполнено(СкладЛомбарда) Тогда
		СкладЛомбарда = ЛБ_Общиймодуль.ПолучитьСклад(ЭтотОбъект.ПредыдущаяОперация.Ломбард, Перечисления.ЛБ_ВидыСкладов.Залоги);
	КонецЕсли;
	
	Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог Тогда 
		//СтруктураОкр = ЛБ_УправлениеЛомбардом.ПолучитьУсловияОкругленияПроцентов(ЭтотОбъект);
		//УсловияПоДоговору = ЛБ_УправлениеЛомбардом.ПолучитьУсловияПоДоговору(ЭтотОбъект);
		//Если УсловияПоДоговору = неопределено тогда 
		//	НачислятьПроцентыЗаДеньЗалога = ложь;
		//Иначе                                    
		//	НачислятьПроцентыЗаДеньЗалога = УсловияПоДоговору.НачислятьПроцентыЗаДеньЗалога;
		//КонецЕсли;	
		//Результат = ЛБ_ОбщийМодуль.РассчитатьСуммуПроцентов(Дата, ПроцентнаяСхема, ДатаВыкупа, ЭтотОбъект.СуммаСсуды, НачислятьПроцентыЗаДеньЗалога, СтруктураОкр); 
		//мСуммаПроцентовСрок = Результат.СуммаПроцентов;
		//мСуммаПроцентовДень = Результат.СуммаПроцентовДень; 
		
		Отбор = Новый Структура;
		Отбор.Вставить("ДеньНач", 1);
		Строки = ЭтотОбъект.ГрафикПлатежей.НайтиСтроки(Отбор);
		Если НЕ Строки.Количество() = 0 Тогда
		    мСуммаПроцентовДень = строки.Получить(0).СуммаПроцентовДень;  
			ДатаНачалаРасчета = строки.Получить(0).ДатаНач; 
		Иначе
			мСуммаПроцентовДень = 0;  
			ДатаНачалаРасчета = НачалоДня(Дата);
		КонецЕсли;
		мСуммаПроцентовСрок = ЭтотОбъект.ГрафикПлатежей.Итог("СуммаПроцентов");

		Движения.ЛБ_ОборотыПоОперациямЗайма.Записывать = Истина;
		Движение = Движения.ЛБ_ОборотыПоОперациямЗайма.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Ломбард = Ломбард;
		Движение.ЗалоговыйБилет = Этотобъект.Ссылка;
		Движение.Залогодатель = ЭтотОбъект.Залогодатель;
		Движение.ВидОперации = ЭтотОбъект.ВидОперации;		
		Движение.СуммаСсуды = ЭтотОбъект.СуммаСсуды;     
				
		Движения.ЛБ_ОперацииПоСистемеЛояльности.Записывать = Истина;
		Движение = Движения.ЛБ_ОперацииПоСистемеЛояльности.Добавить();
		Движение.Период = Дата;
		Движение.Залогодатель = ЭтотОбъект.Залогодатель;
		Движение.КоличествоЗалогов = ЭтотОбъект.Товары.Итог("Количество");
		Движение.СуммаЗаймов = ЭтотОбъект.СуммаСсуды;

		Движения.ЛБ_ДвиженияДенежныхСредств.Записывать = Истина;
		Движение = Движения.ЛБ_ДвиженияДенежныхСредств.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Ломбард = Ломбард;
		Движение.ВидДенежныхСредств = Перечисления.ЛБ_ВидыДенежныхСредств.Наличные;
		Движение.ВидДвиженияДС = Перечисления.ЛБ_ВидыДвиженияДС.Расход;	
		Движение.КассоваяСмена = КассоваяСмена;
		Если ЗначениеЗаполнено(КассоваяСмена) Тогда  
			Если НЕ ЗначениеЗаполнено(СводныйРКО) Тогда  
				СводныйРКО = ЛБ_ОбщийМодуль.СоздатьСводныйРКО(КассоваяСмена.Дата, Организация, Ломбард); 				
				ПроводитьПоКассовойСмене = Истина;
			КонецЕсли;
			Движение.КассоваяОперация = СводныйРКО;  
			Движение.Номер = СводныйРКО.ПредставлениеНомераРКО;
		КонецЕсли;	
		Движение.Сумма = ЭтотОбъект.СуммаСсуды;   
		Движение.Контрагент = ЭтотОбъект.Залогодатель; 
		Движение.ФизическоеЛицо = ЭтотОбъект.Залогодатель;
		Движение.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ВыдачаЗайма; 
		Движение.ДополнительнаяИнформация = "Залоговый билет № " + СокрЛП(ЭтотОбъект.НомерЗалоговогоБилета) + " от " + Формат(Дата, "ДФ=dd.MM.yyyy");
		Движение.Основание = "Выдача денежных средств по договору займа № " + СокрЛП(ЭтотОбъект.НомерЗалоговогоБилета) + " от " + Формат(Дата, "ДФ=dd.MM.yyyy");
		Движение.ФИО = ФИОКлиента(Залогодатель, Дата); 
		Движение.ДУЛ = ДокументКлиентаВСтроку(ЭтотОбъект.ДокументЗалогодателя);
		Результат = ЛБ_ОбщийМодуль.ЗаполнитьДтКт(Движение.ВидОперации);
	    Движение.Дт = Результат.Дт;
	    Движение.Кт = Результат.Кт;
    		
		
		Движения.ЛБ_ДенежныеСредства.Записывать = Истина;
		Движение = Движения.ЛБ_ДенежныеСредства.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Ломбард = Ломбард;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.ВидДенежныхСредств = Перечисления.ЛБ_ВидыДенежныхСредств.Наличные;	
		Движение.Сумма = ЭтотОбъект.СуммаСсуды;
		
		Движения.ЛБ_РасчетыСКлиентами.Записывать = Истина;
		Движение = Движения.ЛБ_РасчетыСКлиентами.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ДатаНачалаРасчета = Этотобъект.Дата;
		Движение.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоОсновномуДолгу;
		Движение.Клиент = ЭтотОбъект.Залогодатель;
		Движение.ЗалоговыйБилет = Этотобъект.Ссылка;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Сумма = ЭтотОбъект.СуммаСсуды;
		
		Движения.ЛБ_ОбъектыЗалога.Записывать = Истина;  
		Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Записывать = Истина;
		Движения.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Записывать = Истина;
		Для каждого Стр Из ЭтотОбъект.Товары цикл
			Движение = Движения.ЛБ_ОбъектыЗалога.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Ломбард = Ломбард;   
			Движение.Склад = СкладЛомбарда;
			Движение.ЗалоговыйБилет = Этотобъект.Ссылка;
			Движение.ОбъектЗалога = Стр.ОбъектЗалога;
			Движение.Количество = Стр.Количество;  
			//Движение.СуммаОценкиНачальная = Стр.СуммаОценки;
			Движение.СуммаОценки = Стр.СуммаОценкиМаксимальная; 			
											
			Движение = Движения.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Клиент = ЭтотОбъект.Залогодатель;
			Движение.ЗалоговыйБилет = Этотобъект.Ссылка;
			Движение.ОбъектЗалога = Стр.ОбъектЗалога;
			Движение.Сумма = Стр.СуммаСсуды; 
			
			Движение = Движения.ЛБ_РасчетыСКлиентамиБУ.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;      
			Движение.Организация = ЭтотОбъект.Организация;   
			Движение.Ломбард = ЭтотОбъект.Ломбард;  
			Движение.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоОсновномуДолгу;
			Движение.Клиент = ЭтотОбъект.Залогодатель;
			Движение.ЗалоговыйБилет = Этотобъект.Ссылка;
			Движение.ОбъектЗалога = Стр.ОбъектЗалога;  
			//Движение.ДатаНачалаРасчета = Дата;
			Движение.Сумма = Стр.СуммаСсуды;
		КонецЦикла;	   
		Движение = Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Добавить(); 
		Движение.Период = Дата;
		Движение.Организация = Организация;  
		Движение.ПодразделениеОсновное = Ломбард;  
		Движение.СкладОсновной = СкладЛомбарда;
		Движение.ПодразделениеПолучатель = Ломбард;
        Движение.СкладПолучатель = СкладЛомбарда; 
		Движение.Количество = ЭтотОбъект.Товары.Итог("Количество");  
		Движение.Ответственный = ЭтотОбъект.ОтветственныйСотрудник; 
		Движение.НомерЗБ =  ЭтотОбъект.НомерЗалоговогоБилета; 
		Движение.ВидОперации = "Выдача займа";

		
		Движения.ЛБ_СостояниеЗалоговогоБилета.Записывать = Истина;
		Движение = Движения.ЛБ_СостояниеЗалоговогоБилета.Добавить();
		Движение.Период = Дата; 
		Движение.Залогодатель = ЭтотОбъект.Залогодатель;
		Движение.ЗалоговыйБилет = Этотобъект.Ссылка;
		Движение.НомерЗалоговогоБилета = Этотобъект.НомерЗалоговогоБилета;
		Движение.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Оформлен;
		Движение.СхемаКредитования = ЭтотОбъект.СхемаКредитования;
		Движение.ПричинаПрименения = Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма;
		Движение.ДатаВыкупа = Этотобъект.ДатаВыкупа;
		Движение.ДатаВыкупаЛьготныйСрок = Этотобъект.ДатаВыкупаЛьготная;	
		Движение.ДатаНачалаРасчетаПроцентов = ДатаНачалаРасчета;
		Движение.СуммаЗайма = ЭтотОбъект.СуммаСсуды;
		Движение.СуммаПроцентовДень = мСуммаПроцентовДень;
        Движение.СуммаПроцентовСрок = мСуммаПроцентовСрок;
		Движение.ПредельныйСрокЗайма = ЭтотОбъект.ПредельныйСрокЗайма;
		Движение.ПредельныйСрокЗаймаДни = ЭтотОбъект.ПредельныйСрокЗаймаДни;
		
        Движения.ЛБ_СостояниеОбъектаЗалога.Записывать = Истина;
		Для каждого Стр Из ЭтотОбъект.Товары цикл
		    Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить();
			Движение.Период = Дата;
			Движение.ЗалоговыйБилет = Этотобъект.Ссылка;
			Движение.ОбъектЗалога = Стр.ОбъектЗалога;
			Движение.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.Принят;
			Движение.СуммаОценки = Стр.СуммаОценкиМаксимальная;	
			Движение.СуммаОценкиНачальная = Стр.СуммаОценки;
			Движение.СуммаЗайма = стр.СуммаСсуды;
			Движение.СуммаДолгаЗайма = стр.СуммаСсуды;
		КонецЦикла;      
		
		Если ЭтотОбъект.СтатусЗалогодателя = Справочники.ЛБ_СтатусыЗалогодателей.Сверхновый Тогда
			Движения.ЛБ_СтатусыЗалогодателей.Записывать = Истина; 
			Движение = Движения.ЛБ_СтатусыЗалогодателей.Добавить();
			Движение.Период = Дата;
			Движение.Залогодатель = ЭтотОбъект.Залогодатель;
		    Движение.Статус =  Справочники.ЛБ_СтатусыЗалогодателей.Новый;
		КонецЕсли; 
		
		Движения.ЛБ_РеквизитыОбъектаЗалога.Записывать = Истина;
		Движения.ЛБ_ВставкиОбъектаЗалога.Записывать = Истина;
        Движения.ЛБ_ДополнительныеМатериалыОбъектаЗалога.Записывать = Истина;

        Для каждого Стр Из ЭтотОбъект.Товары цикл
			Движение = Движения.ЛБ_РеквизитыОбъектаЗалога.Добавить();
			Движение.Период = Дата;
			Движение.ОбъектЗалога 	= стр.ОбъектЗалога;
			Движение.ЗалоговыйБилет = ЭтотОбъект.Ссылка;
			Движение.НомерСтрокиТаблицы = Стр.НомерСтроки;
			Движение.ВидИзделия 	= стр.ВидИзделия; 
			//Движение.Артикул = ЛБ_УправлениеЛомбардом.АртикулОбъектаЗалога(ЭтотОбъект.Ссылка, стр.НомерСтроки); 
			//Савранин
			Движение.Артикул = ЛБ_УправлениеЛомбардом.АртикулОбъектаЗалогаБыстр(Ломбард.НомерЛомбарда, стр.НомерСтроки, НомерЗалоговогоБилета);
			Движение.Проба 			= стр.Проба;
			Движение.Категория 		= стр.Категория;
			Движение.Клеймо 		= стр.Клеймо; 
			Движение.Именник        = стр.Именник;				
			Движение.ДанныеИменника = стр.ДанныеИменника;
			Движение.Дефекты        = стр.Дефекты;
			Движение.СостояниеИзделия = стр.СостояниеИзделия;
			Движение.ЕдиницаИзмерения = стр.ЕдиницаИзмерения;
			Движение.Вес 			= стр.Вес;
			//Движение.ВесВПробеЧистоты = стр.ВесВПробеЧистоты; 
			Движение.ВесЧистый 		= стр.ВесЧистый; 
			Движение.Цена = стр.Цена;
			Движение.СуммаОценки = Стр.СуммаОценки;  
			Движение.СуммаОценкиМакс = Стр.СуммаОценкиМаксимальная;
			Движение.СуммаСсуды = Стр.СуммаСсуды;
			Движение.СуммаОценкиМеталлы = Стр.СуммаОценкиМеталлы; 
			//Движение.СуммаОценкиКамни = Стр.СуммаОценкиКамни;
			//+Мельников 09.10.24 Скидка 30%. Добавил запись в регистр. Заявка 2732.
			Движение.Вес30 = стр.Вес30;
			//-Мельников
			//+МАН 21.05.25 Добавлена запись значения "Описание"
			Движение.ОписаниеОЗ = Стр.Описание;
			//-МАН
			ОписаниеИзделия = СокрЛП(Стр.ВидИзделия) + " " + СокрЛП(Формат(Стр.Вес, "ЧЦ=10; ЧДЦ=2")) + " " + сокрЛП(Стр.ЕдиницаИзмерения); 
			ОписаниеМ = СокрЛП(Стр.Проба);  
			
			Отбор = Новый Структура;
			Отбор.Вставить("Ключстроки", Стр.КлючСтроки);
			
			ОписаниеВставок = "";  
			СуммаОценкиВставки = 0;
			СтрокиВ = Вставки.НайтиСтроки(Отбор); 
			Если НЕ СтрокиВ.Количество() = 0 Тогда 
				Движение.Вставки = Истина;
				Для каждого стрВ Из СтрокиВ цикл  
					ДвижениеВ = Движения.ЛБ_ВставкиОбъектаЗалога.Добавить();
					ДвижениеВ.Период = Дата;
					ДвижениеВ.ОбъектЗалога = стр.ОбъектЗалога;  
					ДвижениеВ.ЗалоговыйБилет = ЭтотОбъект.Ссылка;
					ДвижениеВ.НомерСтрокиТаблицы = СтрВ.НомерСтроки;
	                ДвижениеВ.Вес  = стрВ.Вес;
					ДвижениеВ.ВесГраммы = стрВ.ВесГраммы;
					ДвижениеВ.ВидВставки = стрВ.ВидВставки;
					ДвижениеВ.ВидОгранки = стрВ.ВидОгранки;
					ДвижениеВ.ФормаОгранки = стрВ.ФормаОгранки;
					ДвижениеВ.КачествоОгранки = СтрВ.КачествоОгранки;
					ДвижениеВ.Длина = стрВ.Длина;
					ДвижениеВ.Ширина = стрВ.Ширина;
					ДвижениеВ.Высота = стрВ.Высота;
					ДвижениеВ.Диаметр = стрВ.Диаметр;
					ДвижениеВ.Диаметр1 = стрВ.Диаметр1;
					ДвижениеВ.Диаметр2 = стрВ.Диаметр2;
					ДвижениеВ.ЕдиницаИзмерения = стрВ.ЕдиницаИзмерения;
					ДвижениеВ.Количество = стрВ.Количество;
					ДвижениеВ.Цена = стрВ.Цена;
					ДвижениеВ.СуммаОценки = стрВ.Сумма; 
					//+МАН 25.03.25 Не записывается значение "не оценивать". Заявка 2464
					ДвижениеВ.НеОценивать = стрВ.НеОценивать;
					//-МАН
					
					////++ИВВ 02.2026, вычеты для часов
					//ДвижениеВ.РазмерСкидки = стрВ.РазмерСкидки;
					////--ИВВ
					СуммаОценкиВставки = СуммаОценкиВставки + ДвижениеВ.СуммаОценки; 
					
					ОписаниеВставок = ОписаниеВставок + ?(Пустаястрока(ОписаниеВставок), "; ", ", ") + Строка(СтрВ.Количество) + " " + СокрЛП(СтрВ.ВидВставки) + 
					     ?(ЗначениеЗаполнено(СтрВ.ВидОгранки), " " + СокрЛП(СтрВ.ВидОгранки), "") + ?(ЗначениеЗаполнено(СтрВ.КачествоОгранки), " " + СокрЛП(СтрВ.КачествоОгранки), "");
					ОписаниеРазмера = "";
					Если НЕ СтрВ.Диаметр = 0 Тогда
						ОписаниеРазмера = СокрЛП(СтрВ.Диаметр) + " мм";
					ИначеЕсли НЕ СтрВ.Диаметр1 = 0 Тогда	   
						ОписаниеРазмера = СокрЛП(СтрВ.Диаметр1) + ?(НЕ СтрВ.Диаметр2 = 0, "х" + СокрЛП(СтрВ.Диаметр2), "") + " мм";
					ИначеЕсли НЕ СтрВ.Длина = 0 Тогда  
						ОписаниеРазмера = СокрЛП(СтрВ.Длина) + ?(НЕ СтрВ.Ширина = 0, "х" + СокрЛП(СтрВ.Ширина), "") + ?(НЕ СтрВ.Высота = 0, "х" + СокрЛП(СтрВ.Высота), "") + " мм";
					КонецЕсли;	
					ОписаниеВставок = ОписаниеВставок + " " + ОписаниеРазмера;  
					ОписаниеВставок = ОписаниеВставок + " " + СокрЛП(Формат(СтрВ.Вес, "ЧЦ=10; ЧДЦ=3")) + " " + сокрЛП(стрВ.ЕдиницаИзмерения);
				КонецЦикла;	 
				Движение.СуммаОценкиКамни = Движение.СуммаОценкиКамни + СуммаОценкиВставки;
			КонецЕсли;	
			
			ВесДопМеталлов = 0;  
			СуммаОценкиДопМеталлы = 0;
			СтрокиД = ДополнительныеМеталлы.НайтиСтроки(Отбор); 
			Если НЕ СтрокиД.Количество() = 0 Тогда 
				Для каждого стрД Из СтрокиД цикл 
					ДвижениеМ = Движения.ЛБ_ДополнительныеМатериалыОбъектаЗалога.Добавить();
					ДвижениеМ.Период = Дата;
					ДвижениеМ.ОбъектЗалога 	= стр.ОбъектЗалога; 
					ДвижениеМ.ЗалоговыйБилет = ЭтотОбъект.Ссылка;
					ДвижениеМ.НомерСтрокиТаблицы = СтрД.НомерСтроки;
					ДвижениеМ.Проба 			= стрД.Проба;
					ДвижениеМ.ЕдиницаИзмерения = стрД.ЕдиницаИзмерения;
					ДвижениеМ.ВесЧистый			= стрД.ВесЧистый;
					//ДвижениеМ.ВесВПробеЧистоты = стрД.ВесВПробеЧистоты;    
					ДвижениеМ.ВесВПробеЧистоты = ЛБ_ОбщийМодуль.ПеревестиВЧистоту(стрД.ВесЧистый, стрД.Проба);
					ДвижениеМ.Цена = стрД.Цена;
					ДвижениеМ.СуммаОценки = СтрД.СуммаОценкиМеталлы; 
					СуммаОценкиДопМеталлы = СуммаОценкиДопМеталлы + СтрД.СуммаОценкиМеталлы;
					ВесДопМеталлов = ВесДопМеталлов + стрД.ВесЧистый;  
					Движение.ВесВПробеЧистоты = Движение.ВесВПробеЧистоты + ДвижениеМ.ВесВПробеЧистоты;
					ОписаниеМ = ОписаниеМ + "+" + СокрЛП(СтрД.Проба);  
					Движение.ВесЧистый = Движение.ВесЧистый + ДвижениеМ.ВесЧистый;
				Конеццикла; 
			КонецЕсли;
			
			ДвижениеМ = Движения.ЛБ_ДополнительныеМатериалыОбъектаЗалога.Добавить(); //основной металл
			ДвижениеМ.Период = Дата;
			ДвижениеМ.ОбъектЗалога 	= стр.ОбъектЗалога;
			ДвижениеМ.ЗалоговыйБилет = ЭтотОбъект.Ссылка;
			ДвижениеМ.Проба 			= стр.Проба;
			ДвижениеМ.ЕдиницаИзмерения = стр.ЕдиницаИзмерения;
			ДвижениеМ.ВесЧистый			= стр.ВесЧистый;
			ДвижениеМ.ВесВПробеЧистоты = ЛБ_ОбщийМодуль.ПеревестиВЧистоту(ДвижениеМ.ВесЧистый, ДвижениеМ.Проба); 
			ДвижениеМ.Цена = стр.Цена;
			ДвижениеМ.СуммаОценки = Стр.СуммаОценкиМеталлы - СуммаОценкиДопМеталлы; 
			
			Движение.ВесВПробеЧистоты = Движение.ВесВПробеЧистоты + ДвижениеМ.ВесВПробеЧистоты;
			Движение.ОписаниеИзделия = ОписаниеИзделия + " " + ОписаниеМ + ?(ПустаяСтрока(ОписаниеВставок), "", "; " + ОписаниеВставок); 
		КонецЦикла;			
		
		Движения.ЛБ_ГрафикПлатежей.Записывать = Истина;
		Для каждого Стр из Этотобъект.ПроцентныеСтавкиПоПериодам Цикл
			Движение = Движения.ЛБ_ГрафикПлатежей.Добавить();
			Движение.Период = Дата;     
			Движение.ЗалоговыйБилет = ЭтотОбъект.Ссылка;  
			Движение.ПричинаПрименения = Стр.ПричинаПрименения;
            Движение.ВидПроцентнойСтавки = стр.ВидПроцентнойСтавки;
			Движение.ДеньНачалаПрименения = стр.ДеньНачалаПрименения;
			Движение.ПроцентнаяСтавкаБазовая = Стр.ПроцентнаяСтавка;
			Движение.ПроцентнаяСтавкаАкция = Стр.ПроцентнаяСтавкаАкция;
			Движение.ОтклонениеАкцияАбсолютное = Стр.ОтклонениеАкцияАбсолютное;
			Движение.ОтклонениеАкцияОтностельное = Стр.ОтклонениеАкцияОтносительное;
		КонецЦикла;	
		
		//Движения.ЛБ_СогласиеНаСМСРассылку.Записывать = Истина; 
		//СогласиеНаСМС = ЛБ_УправлениеЛомбардом.ПолучитьСогласиеНаСМСРассылки(Этотобъект.Дата, ЭтотОбъект.Залогодатель);
		//Если НЕ ЭтотОбъект.СогласиеНаСМСРассылку = СогласиеНаСМС Тогда 
		//	Движение = Движения.ЛБ_СогласиеНаСМСРассылку.Добавить();
		//	Движение.Период = Дата; 
		//	Движение.Залогодатель = ЭтотОбъект.Залогодатель;
		//	Движение.Согласен = ЭтотОбъект.СогласиеНаСМСРассылку;
		//КонецЕсли;	      
		
		Движения.ЛБ_ДатыОбновленияАнкеты.Записывать = Истина;  
		Движение = Движения.ЛБ_ДатыОбновленияАнкеты.Добавить();
		Движение.Период = Дата; 
		Движение.Залогодатель = ЭтотОбъект.Залогодатель;
	    Движение.ДатаАктуальности = Дата;  
		
		Если НЕ ЭтотОбъект.СогласиеНаСМСРассылку = ЛБ_УправлениеЛомбардом.ПолучитьСогласиеНаСМСРассылки(ЭтотОбъект.Дата, ЭтотОбъект.Залогодатель) Тогда  
			Движения.ЛБ_СогласиеНаСМСРассылку.Записывать = Истина;
			Движение = Движения.ЛБ_СогласиеНаСМСРассылку.Добавить();
			Движение.Период = Дата; 
			Движение.Залогодатель = ЭтотОбъект.Залогодатель;
		    Движение.Согласен = ЭтотОбъект.СогласиеНаСМСРассылку;  
		КонецЕсли;	 
		
		Движения.ЛБ_ПриказыВОперацияхЗайма.Записывать = Истина; 
		//+МАН 03.02.25 Добавил условие.
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ПриказВИПСтавки) Тогда
		//-МАН                
		    ЗаписьПоБазовомуПриказу  = Истина;
		    Если ЗначениеЗаполнено(ЭтотОбъект.ПриказАкцияСтавки) Тогда
				Движение = Движения.ЛБ_ПриказыВОперацияхЗайма.Добавить();
				Движение.Период = Дата; 
				Движение.ВидПриказа = Перечисления.ЛБ_ВидыОперацийПриказы.Акция;
				Движение.Приказ = ПриказАкцияСтавки;      
				Движение.Установить = Перечисления.ЛБ_УстановитьВПриказе.Ставки;
				Движение.ОтклонениеПоАкции = ЭтотОбъект.ОтклонениеПоАкции; 
				
				Если НЕ ЭтотОбъект.ОтклонениеПоАкции Тогда 
					ЗаписьПоБазовомуПриказу  = Ложь;
				КонецЕсли;	
			КонецЕсли;	

			Если ЗначениеЗаполнено(ЭтотОбъект.ПриказСтавки) И  ЗаписьПоБазовомуПриказу Тогда
				Движение = Движения.ЛБ_ПриказыВОперацияхЗайма.Добавить();
				Движение.Период = Дата; 
				Движение.ВидПриказа = Перечисления.ЛБ_ВидыОперацийПриказы.Базовый; 
				Движение.Установить = Перечисления.ЛБ_УстановитьВПриказе.Ставки;
				Движение.Приказ = ПриказСтавки;
			КонецЕсли;
			
		КонецЕсли;
		
		//+МАН 10.12.25
		СписокПриказовВИПМ = Новый СписокЗначений;
		СписокПриказовВИПВ = Новый СписокЗначений;
		//-МАН
		
		СписокПриказовМ = Новый СписокЗначений;
		Для каждого Стр Из ЭтотОбъект.Товары Цикл 
			Если ЗначениеЗаполнено(Стр.Приказ) Тогда
				Если СписокПриказовМ.НайтиПоЗначению(Стр.Приказ) = неопределено Тогда
					СписокПриказовМ.Добавить(Стр.Приказ);
				КонецЕсли;	
			КонецЕсли;	
			//+МАН 10.12.25
			Если ЗначениеЗаполнено(Стр.ПриказВИПМеталлы) Тогда
				Если СписокПриказовВИПМ.НайтиПоЗначению(Стр.ПриказВИПМеталлы) = Неопределено Тогда
					СписокПриказовВИПМ.Добавить(Стр.ПриказВИПМеталлы);
				КонецЕсли;
			КонецЕсли;
			//-МАН
		КонецЦикла;	 
		
		Для каждого Стр Из ЭтотОбъект.ДополнительныеМеталлы Цикл 
			Если ЗначениеЗаполнено(Стр.Приказ) Тогда
				Если СписокПриказовМ.НайтиПоЗначению() = неопределено Тогда
					СписокПриказовМ.Добавить(Стр.Приказ);
				КонецЕсли;	
			КонецЕсли;	
			//+МАН 10.12.25
			Если ЗначениеЗаполнено(Стр.ПриказВИПМеталлы) Тогда
				Если СписокПриказовВИПМ.НайтиПоЗначению(Стр.ПриказВИПМеталлы) = неопределено Тогда
					СписокПриказовВИПМ.Добавить(Стр.ПриказВИПМеталлы);
				КонецЕсли;
			КонецЕсли;
			//-МАН
		КонецЦикла;	
		
		Если НЕ СписокПриказовМ.Количество() = 0 Тогда     
			Для каждого Эл Из СписокПриказовМ Цикл
				Движение = Движения.ЛБ_ПриказыВОперацияхЗайма.Добавить();
				Движение.Период = Дата; 
		        Движение.ВидПриказа = Перечисления.ЛБ_ВидыОперацийПриказы.Базовый;
				Движение.Приказ = Эл.Значение;      
				Движение.Установить = Перечисления.ЛБ_УстановитьВПриказе.Металлы;
			КонецЦикла;	
		КонецЕсли;	 
		
		СписокПриказовВ = Новый СписокЗначений;
		Для каждого Стр Из ЭтотОбъект.Вставки Цикл 
			Если ЗначениеЗаполнено(Стр.Приказ) Тогда
				Если СписокПриказовВ.НайтиПоЗначению(Стр.Приказ) = неопределено Тогда
					СписокПриказовВ.Добавить(Стр.Приказ);
				КонецЕсли;	
			КонецЕсли;	
			//+МАН 10.12.25
			Если ЗначениеЗаполнено(Стр.ПриказВИПВставки) Тогда
				Если СписокПриказовВИПВ.НайтиПоЗначению(Стр.ПриказВИПВставки) = Неопределено Тогда
					СписокПриказовВИПВ.Добавить(Стр.ПриказВИПВставки);
				КонецЕсли;
			КонецЕсли;
			//-МАН
		КонецЦикла;	 
			
		Если НЕ СписокПриказовВ.Количество() = 0 Тогда     
			Для каждого Эл Из СписокПриказовВ Цикл
				Движение = Движения.ЛБ_ПриказыВОперацияхЗайма.Добавить();
				Движение.Период = Дата; 
		        Движение.ВидПриказа = Перечисления.ЛБ_ВидыОперацийПриказы.Базовый;
				Движение.Приказ = Эл.Значение;      
				Движение.Установить = Перечисления.ЛБ_УстановитьВПриказе.Вставки;
			КонецЦикла;	
		КонецЕсли;	
		
		//+МАН 10.12.25
		Если ЗначениеЗаполнено(ЭтотОбъект.ПриказВИПСтавки) Тогда
			Движение = Движения.ЛБ_ПриказыВОперацияхЗайма.Добавить();
			Движение.Период = Дата; 
			Движение.ВидПриказа = Перечисления.ЛБ_ВидыОперацийПриказы.ВИП;
			Движение.Приказ = ЭтотОбъект.ПриказВИПСтавки;
			Движение.Установить = Перечисления.ЛБ_УстановитьВПриказе.Ставки;
		КонецЕсли;

		Если СписокПриказовВИПМ.Количество() <> 0 Тогда     
			Для каждого Эл Из СписокПриказовВИПМ Цикл
				Движение = Движения.ЛБ_ПриказыВОперацияхЗайма.Добавить();
				Движение.Период = Дата; 
				Движение.ВидПриказа = Перечисления.ЛБ_ВидыОперацийПриказы.ВИП;
				Движение.Приказ = Эл.Значение;
				Движение.Установить = Перечисления.ЛБ_УстановитьВПриказе.Металлы;
			КонецЦикла;	
		КонецЕсли;	 
		
		Если НЕ СписокПриказовВИПВ.Количество() = 0 Тогда     
			Для каждого Эл Из СписокПриказовВИПВ Цикл
				Движение = Движения.ЛБ_ПриказыВОперацияхЗайма.Добавить();
				Движение.Период = Дата; 
				Движение.ВидПриказа = Перечисления.ЛБ_ВидыОперацийПриказы.ВИП;
				Движение.Приказ = Эл.Значение;
				Движение.Установить = Перечисления.ЛБ_УстановитьВПриказе.Вставки;
			КонецЦикла;	
		КонецЕсли;	
		//-МАН
		
	ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда
		// сначала закроем старый ЗБ
		СтруктураРез = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗалоговогоБилета(ЭтотОбъект, ПредыдущаяОперация); 
		СтруктураОкр = ЛБ_УправлениеЛомбардом.ПолучитьУсловияОкругленияПроцентов(ПредыдущаяОперация); 
		ДатаНачалаРасчетаНач = СтруктураРез.ДатаНачалаРасчета; 
		СуммаЗаймаНач = СтруктураРез.СуммаЗайма;  
		СтатусЗалоговогоБилетаНач = СтруктураРез.СтатусЗалоговогоБилета; 
		ПричинаПримененияНач = Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ОплатаПроцентов; 
		НомерДопСоглашения = СтруктураРез.НомерДопСоглашения;
		БезПродленияДоговора = ЭтотОбъект.ПредыдущаяОперация.СхемаКредитования.БезПродленияДоговора;	
			
		Если ЭтотОбъект.НачислениеПроцентовДетально.Количество() = 0 Тогда 
			СуммаПроцентовНачислено = 0;  
			мСуммаПроцентовДень = 0;  
			ПроцентнаяСхема = 0;
		Иначе	
			СуммаПроцентовНачислено = ЭтотОбъект.НачислениеПроцентовДетально.Итог("СуммаПроцентов");
			СтрН = ЭтотОбъект.НачислениеПроцентовДетально.Получить(0); 
			мСуммаПроцентовДень = СтрН.СуммаПроцентовДень; 
			ПроцентнаяСхема = СтрН.ПроцентнаяСтавкаБазовая; 
			Если СтрН.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Акционная Тогда
				Если НЕ СтрН.ПроцентнаяСтавкаАкция = 0 Тогда
					ПроцентнаяСхема = СтрН.ПроцентнаяСтавкаАкция;
				ИначеЕсли НЕ СтрН.ОтклонениеАкцияОтносительное = 0 Тогда	 
					ПроцентнаяСхема = СтрН.ПроцентнаяСтавкаБазовая + СтрН.ПроцентнаяСтавкаБазовая*СтрН.ОтклонениеАкцияОтносительное/100;
				ИначеЕсли НЕ СтрН.ОтклонениеАкцияАбсолютное = 0 Тогда
					ПроцентнаяСхема = СтрН.ПроцентнаяСтавкаБазовая + СтрН.ОтклонениеАкцияАбсолютное;
			    КонецЕсли; 
			КонецЕсли;
		КонецЕсли;	
		
		ПродлитьДоговорДни = 0;
		ДатаНачалаРасчетаПроцентов = ДатаНачалаРасчетаНач;
		
		//Если НЕ ЭтотОбъект.СуммаОплаты = 0 Тогда
			Движения.ЛБ_ОборотыПоОперациямЗайма.Записывать = Истина;
			Движение = Движения.ЛБ_ОборотыПоОперациямЗайма.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Этотобъект.ПредыдущаяОперация.Организация;
			Движение.Ломбард = Этотобъект.ПредыдущаяОперация.Ломбард;
			Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация; 
			Движение.Залогодатель = ЭтотОбъект.ПредыдущаяОперация.Залогодатель;
			Движение.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление;  
			Движение.СуммаСсуды = СуммаЗаймаНач;
			Движение.СуммаОплатыЗайм = ЭтотОбъект.СуммаОплатыСсуда;
			Движение.СуммаОплатыПроценты = ЭтотОбъект.СуммаОплатыПроценты;    
		//КонецЕсли;	      
		
		
				
		Если НЕ (ЭтотОбъект.СуммаОплатыПроценты + ЭтотОбъект.СуммаОплатыСсуда) = 0  Тогда
			Движения.ЛБ_ДвиженияДенежныхСредств.Записывать = Истина;
			Движение = Движения.ЛБ_ДвиженияДенежныхСредств.Добавить();
			Движение.Период = Дата-1;
			Движение.Организация = ЭтотОбъект.ПредыдущаяОперация.Организация;
			Движение.Ломбард = ЭтотОбъект.ПредыдущаяОперация.Ломбард;
			Движение.ВидДенежныхСредств = Перечисления.ЛБ_ВидыДенежныхСредств.Наличные;
			Движение.ВидДвиженияДС = Перечисления.ЛБ_ВидыДвиженияДС.Приход;		
			Движение.Сумма = ЭтотОбъект.СуммаОплатыПроценты + ЭтотОбъект.СуммаОплатыСсуда; 
			Если ЗначениеЗаполнено(ЭтотОбъект.Представитель) Тогда 
				Движение.Контрагент = ЭтотОбъект.Представитель; 
				Движение.ФИО = ФИОКлиента(Представитель, Дата); 
		        Движение.ДУЛ = ДокументКлиентаВСтроку(ЭтотОбъект.ДокументПредставителя);
			Иначе	                                            
				Движение.Контрагент = ЭтотОбъект.Залогодатель; 
				Движение.ФИО = ФИОКлиента(Залогодатель, Дата); 
		        Движение.ДУЛ = ДокументКлиентаВСтроку(ДокументЗалогодателя);
			КонецЕсли;	
			Движение.ФизическоеЛицо = Движение.Контрагент;
	        Движение.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ОплатаПоЗаймуПереоформление; 
			Движение.КассоваяСмена = КассоваяСмена;
			Если ЗначениеЗаполнено(КассоваяСмена) Тогда  
				Если НЕ ЗначениеЗаполнено(СводныйПКО) Тогда  
					СводныйПКО = ЛБ_ОбщийМодуль.СоздатьСводныйПКО(КассоваяСмена.Дата, Организация, Ломбард); 				
					ПроводитьПоКассовойСмене = Истина;
				КонецЕсли;
				Движение.КассоваяОперация = СводныйПКО;  
				Движение.Номер = СводныйПКО.ПредставлениеНомераПКО;
			КонецЕсли;	
			Движение.ДополнительнаяИнформация = "Залоговый билет № " + СокрЛП(ЭтотОбъект.ПредыдущаяОперация.НомерЗалоговогоБилета) + " от " + Формат(ЭтотОбъект.ПредыдущаяОперация.Дата, "ДФ=dd.MM.yyyy");
			ОснованиеП = "";    
			Если НЕ ЭтотОбъект.СуммаОплатыПроценты = 0 Тогда
				ОснованиеП = ОснованиеП + "Оплата процентов в сумме " + СокрЛП(Формат(ЭтотОбъект.СуммаОплатыПроценты, "ЧЦ=15; ЧДЦ=2"));
			КонецЕсли;	   
			Если НЕ ЭтотОбъект.СуммаОплатыСсуда = 0 Тогда
				ОснованиеП = ОснованиеП + ?(ПустаяСтрока(ОснованиеП), "Возврат займа в сумме ", ", возврат займа в сумме ") + СокрЛП(Формат(ЭтотОбъект.СуммаОплатыСсуда, "ЧЦ=15; ЧДЦ=2"));
			КонецЕсли;
			Движение.Основание = ОснованиеП + 
			                     " по договору займа (ЗБ № " + СокрЛП(ЭтотОбъект.ПредыдущаяОперация.НомерЗалоговогоБилета) + " " + ФИОКлиента(ЭтотОбъект.ПредыдущаяОперация.Залогодатель, ЭтотОбъект.ПредыдущаяОперация.Дата) + ")";
			Результат = ЛБ_ОбщийМодуль.ЗаполнитьДтКт(Движение.ВидОперации);
		    Движение.Дт = Результат.Дт;
		    Движение.Кт = Результат.Кт;
		КонецЕсли;	
			
		Если НЕ ЭтотОбъект.СуммаОплаты = 0 Тогда
			Движения.ЛБ_ДенежныеСредства.Записывать = Истина;
			Движение = Движения.ЛБ_ДенежныеСредства.Добавить();
			Движение.Период = Дата-1;
			Движение.Организация = ЭтотОбъект.ПредыдущаяОперация.Организация;
			Движение.Ломбард = ЭтотОбъект.ПредыдущаяОперация.Ломбард;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.ВидДенежныхСредств = Перечисления.ЛБ_ВидыДенежныхСредств.Наличные;	
			Движение.Сумма = ЭтотОбъект.СуммаОплаты;   
		КонецЕсли;	
		
		СуммаНачисленоБУ = 0;  
		Движения.ЛБ_РасчетыСКлиентамиБУ.Записывать = Истина;

		ЗапросРасчеты = Новый Запрос;  
		ЗапросРасчеты.УстановитьПараметр("ЗалоговыйБилет", ЭтотОбъект.ПредыдущаяОперация);
		ЗапросРасчеты.УстановитьПараметр("Организация", ЭтотОбъект.ПредыдущаяОперация.Организация); 
		ЗапросРасчеты.УстановитьПараметр("ДатаНачалаРасчета", ДатаНачалаРасчетаНач);  
		ЗапросРасчеты.УстановитьПараметр("Дата", ЭтотОбъект.Дата); 
		ЗапросРасчеты.Текст = "ВЫБРАТЬ
		                      |	ЛБ_РасчетыСКлиентамиБУ.Регистратор КАК Регистратор,
		                      |	ЛБ_РасчетыСКлиентамиБУ.ЗалоговыйБилет КАК ЗалоговыйБилет,
		                      |	ЛБ_РасчетыСКлиентамиБУ.Сумма КАК Сумма
		                      |ИЗ
		                      |	РегистрНакопления.ЛБ_РасчетыСКлиентамиБУ КАК ЛБ_РасчетыСКлиентамиБУ
		                      |ГДЕ
		                      |	ЛБ_РасчетыСКлиентамиБУ.ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыРасчетов.ПоПроцентам)
		                      |	И ЛБ_РасчетыСКлиентамиБУ.ЗалоговыйБилет = &ЗалоговыйБилет
		                      |	И ЛБ_РасчетыСКлиентамиБУ.Организация = &Организация
		                      |	И ЛБ_РасчетыСКлиентамиБУ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		                      |	И ЛБ_РасчетыСКлиентамиБУ.ДатаНачалаРасчета = &ДатаНачалаРасчета
		                      |	И ЛБ_РасчетыСКлиентамиБУ.Период < &Дата
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	ЛБ_РасчетыСКлиентамиБУ.Период УБЫВ";
		ВыборкаБУ = ЗапросРасчеты.Выполнить().Выбрать(); 
		СуммаОтмены = 0;
		Пока ВыборкаБУ.Следующий() Цикл 
			Если НЕ ТипЗнч(ВыборкаБУ.Регистратор) = Тип("ДокументСсылка.ЛБ_РегламентноеНачислениеПроцентов") Тогда
				Если ВыборкаБУ.Сумма < 0 Тогда //отмена 
					СуммаОтмены = ВыборкаБУ.Сумма;
					Продолжить;
				ИначеЕсли (ВыборкаБУ.Сумма + СуммаОтмены) = 0 Тогда 
					СуммаОтмены = 0;
					Продолжить;
				Иначе	
				    Прервать;
				КонецЕсли;	
			КонецЕсли;	
			СуммаНачисленоБУ = СуммаНачисленоБУ + ВыборкаБУ.Сумма;
		Конеццикла;	 
		СуммаПроцентовНачисленоБУ = СуммаПроцентовНачислено - СуммаНачисленоБУ;
		Если НЕ СуммаПроцентовНачисленоБУ = 0 Тогда 
			Движение = Движения.ЛБ_РасчетыСКлиентамиБУ.Добавить();
			Движение.Период = Дата;     
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Организация = ЭтотОбъект.ПредыдущаяОперация.Организация; 
			Движение.Ломбард = ЭтотОбъект.ПредыдущаяОперация.Ломбард;
			Движение.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам;
			Движение.Клиент = ЭтотОбъект.ПредыдущаяОперация.Залогодатель;
			Движение.ЗалоговыйБилет = ЭтотОбъект.ПредыдущаяОперация;				
			Движение.ДатаНачалаРасчета = ДатаНачалаРасчетаНач;		
			Движение.Сумма = СуммаПроцентовНачисленоБУ;     
		КонецЕсли;	
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ЗалоговыйБилет", Этотобъект.ПредыдущаяОперация);
		Запрос.УстановитьПараметр("Дата", Этотобъект.МоментВремени());
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_РасчетыСКлиентамиОстатки.ДатаНачалаРасчета КАК ДатаНачалаРасчета,
		               |	СУММА(ЛБ_РасчетыСКлиентамиОстатки.СуммаОстаток) КАК Сумма
		               |ИЗ
		               |	РегистрНакопления.ЛБ_РасчетыСКлиентами.Остатки(
		               |			&Дата,
		               |			ЗалоговыйБилет = &ЗалоговыйБилет
		               |				И ВидРасчета = &ВидРасчета) КАК ЛБ_РасчетыСКлиентамиОстатки
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЛБ_РасчетыСКлиентамиОстатки.ДатаНачалаРасчета"; 
		
		Если НЕ ЭтотОбъект.СуммаОплатыПроценты = 0 Тогда
			Запрос.УстановитьПараметр("ВидРасчета", Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам);
			ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
			СуммаОплатить = ЭтотОбъект.СуммаОплатыПроценты;
			
			Для каждого Стр Из ТаблицаОстатков Цикл
				Если стр.Сумма = 0 Тогда
					Продолжить;
				КонецЕсли;
				Если СуммаОплатить = 0 Тогда
					Прервать;
				КонецЕсли;
				
				Движения.ЛБ_РасчетыСКлиентами.Записывать = Истина;
				Движение = Движения.ЛБ_РасчетыСКлиентами.Добавить();
				Движение.Период = Дата;
				Движение.Организация = ЭтотОбъект.ПредыдущаяОперация.Организация;
				Движение.ДатаНачалаРасчета = Стр.ДатаНачалаРасчета;
				Движение.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам;
				Движение.Клиент = ЭтотОбъект.ПредыдущаяОперация.Залогодатель;
				Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация;
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Если Стр.Сумма < СуммаОплатить Тогда
				    Движение.Сумма = Стр.Сумма;
					СуммаОплатить = СуммаОплатить - Стр.Сумма;
				Иначе
					Движение.Сумма = СуммаОплатить;
					СуммаОплатить = 0;
				КонецЕсли; 
				Движение.Комментарий = "Оплачены проценты за период с " + Формат(Стр.ДатаНачалаРасчета, "ДФ=dd.MM.yyyy") + " по " + Формат(ДатаНачалаРасчетаНач, "ДФ=dd.MM.yyyy");
				//Движение.КоличествоДнейРасчета = ?(НачалоДня(Стр.ДатаНачалаРасчета) = НачалоДня(ДатаНачалаРасчетаНач), 1, (НачалоДня(Стр.ДатаНачалаРасчета)-НачалоДня(ДатаНачалаРасчетаНач)) / (60 * 60 * 24));   
			КонецЦикла;	
			
			Движение = Движения.ЛБ_РасчетыСКлиентамиБУ.Добавить();
			Движение.Период = Дата;     
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Организация = ЭтотОбъект.ПредыдущаяОперация.Организация; 
			Движение.Ломбард = ЭтотОбъект.ПредыдущаяОперация.Ломбард;
			Движение.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам;
			Движение.Клиент = ЭтотОбъект.ПредыдущаяОперация.Залогодатель;
			Движение.ЗалоговыйБилет = ЭтотОбъект.ПредыдущаяОперация;				
			Движение.ДатаНачалаРасчета = ДатаНачалаРасчетаНач;		
			Движение.Сумма = ЭтотОбъект.СуммаОплатыПроценты;     

			
			КоличествоДнейРасчета = ?(НачалоДня(ДатаНачалаРасчетаНач) = НачалоДня(Дата), 0, (НачалоДня(Дата) - НачалоДня(ДатаНачалаРасчетаНач)) / (60 * 60 * 24)) + 1;  
			Если НЕ СуммаПроцентовНачислено = 0 Тогда 							
				Движения.ЛБ_РасчетыСКлиентами.Записывать = Истина;
				Движение = Движения.ЛБ_РасчетыСКлиентами.Добавить();
				Движение.Период = Дата;
				Движение.Организация = ЭтотОбъект.ПредыдущаяОперация.Организация;
				Движение.ДатаНачалаРасчета = ДатаНачалаРасчетаНач;
				Движение.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам;
				Движение.Клиент = ЭтотОбъект.ПредыдущаяОперация.Залогодатель;
				Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация;
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Сумма = СуммаПроцентовНачислено; 
				Движение.Комментарий = "Начисленены проценты за период с " + Формат(ДатаНачалаРасчетаНач, "ДФ=dd.MM.yyyy") + " по " + Формат(Дата, "ДФ=dd.MM.yyyy"); 
				Движение.КоличествоДнейРасчета = КоличествоДнейРасчета;
            КонецЕсли;

			Если НЕ СуммаОплатить = 0 Тогда 
				Движения.ЛБ_РасчетыСКлиентами.Записывать = Истина;
				Движение = Движения.ЛБ_РасчетыСКлиентами.Добавить();
				Движение.Период = Дата;
				Движение.Организация = ЭтотОбъект.ПредыдущаяОперация.Организация;
				Движение.ДатаНачалаРасчета = ДатаНачалаРасчетаНач;
				Движение.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам;
				Движение.Клиент = ЭтотОбъект.ПредыдущаяОперация.Залогодатель;
				Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация;
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Сумма = СуммаОплатить; 
				Движение.Комментарий = "Оплачены проценты за период с " + Формат(ДатаНачалаРасчетаНач, "ДФ=dd.MM.yyyy") + " по " + Формат(Дата, "ДФ=dd.MM.yyyy");
				Движение.КоличествоДнейРасчета = КоличествоДнейРасчета;
			КонецЕсли;	
		КонецЕсли;
		
		Если НЕ ЭтотОбъект.СуммаОплатыСсуда = 0 Тогда
			Движения.ЛБ_РасчетыСКлиентами.Записывать = Истина;
			Движение = Движения.ЛБ_РасчетыСКлиентами.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Этотобъект.ПредыдущаяОперация.Организация;
			Движение.ДатаНачалаРасчета = ДатаНачалаРасчетаНач;
			Движение.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоОсновномуДолгу;
			Движение.Клиент = ЭтотОбъект.ПредыдущаяОперация.Залогодатель;
			Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Сумма = ЭтотОбъект.СуммаОплатыСсуда;
		КонецЕсли;	
		
	    Запрос = новый Запрос;   
		Запрос.УстановитьПараметр("ЗалоговыйБилет", ЭтотОбъект.ПредыдущаяОперация);
		Запрос.УстановитьПараметр("Ломбард", ЭтотОбъект.Ломбард);
	    Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
		Запрос.УстановитьПараметр("Склад", СкладЛомбарда);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
		               |	ЛБ_ОбъектыЗалогаОстатки.Ломбард КАК Ломбард,
		               |	СУММА(ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток) КАК Количество,
		               |	СУММА(ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток) КАК СуммаОценки, 
					   |	СУММА(ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток) КАК СуммаОценкиНач
		               //|	СУММА(ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиНачальнаяОстаток) КАК СуммаОценкиНач
		               |ИЗ
		               |	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(&Дата, ЗалоговыйБилет = &ЗалоговыйБилет И Склад = &Склад) КАК ЛБ_ОбъектыЗалогаОстатки
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога,
		               |	ЛБ_ОбъектыЗалогаОстатки.Ломбард";
	    ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
		
		ЕстьНеВыкупленные = Ложь;
		Движения.ЛБ_ОбъектыЗалога.Записывать = Истина;
		Движения.ЛБ_СостояниеОбъектаЗалога.Записывать = Истина; 
		Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Записывать = Истина;
		КоличествоВыкупов = 0;
		СуммаВыкупов = 0;
		Для каждого СтрТовары Из ЭтотОбъект.ПредыдущаяОперация.Товары цикл	
			Если ЭтотОбъект.ПредыдущаяОперация.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление И НЕ СтрТовары.Переоформить Тогда
				Продолжить;
			КонецЕсли;	

			Отбор = Новый структура;
			Отбор.Вставить("ОбъектЗалога", СтрТовары.ОбъектЗалога);
			Отбор.Вставить("Ломбард", ЭтотОбъект.ПредыдущаяОперация.Ломбард);
			Строки = ТаблицаОстатков.НайтиСтроки(Отбор);
			Если Строки.Количество() = 0 Тогда       
				Если НЕ ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектаЗалога(Дата, СтрТовары.ОбъектЗалога, ЭтотОбъект.ПредыдущаяОперация) = Перечисления.ЛБ_СтатусыОбъектовЗалога.Изъят Тогда
					ЕстьНеВыкупленные = Истина; 
				    ОбщегоНазначения.СообщитьПользователю("Объект залога " + СокрЛП(СтрТовары.ОбъектЗалога) + " в ломбарде " + СокрЛП(ЭтотОбъект.Ломбард) + " не найден!");
				КонецЕсли;	
				Продолжить;
			Иначе	
			    СтрОст = Строки.Получить(0); 
				КоличествоВыкупов = КоличествоВыкупов + СтрОст.Количество;
				Движение = Движения.ЛБ_ОбъектыЗалога.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Организация = ЭтотОбъект.ПредыдущаяОперация.Организация;
				Движение.Ломбард = ЭтотОбъект.ПредыдущаяОперация.Ломбард; 
				Движение.Склад = СкладЛомбарда;
				Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация;
				Движение.ОбъектЗалога = СтрТовары.ОбъектЗалога;
				Движение.Количество = СтрОст.Количество;
				Движение.СуммаОценки = СтрОст.СуммаОценки; 
				//Движение.СуммаОценкиНачальная = СтрОст.СуммаОценкиНач; 
										
				СтруктураСостояниеОЗ = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектовЗалогаЗалоговогоБилета(ЭтотОбъект.Дата, Этотобъект.ПредыдущаяОперация, СтрТовары.ОбъектЗалога); 
				Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить();
				Движение.Период = Дата;
				Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация;
				Движение.ОбъектЗалога = СтрТовары.ОбъектЗалога;
				Движение.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.Выкуплен;
				Движение.СуммаОценки = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОценки);
				Движение.СуммаОценкиНачальная = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОценкиНач);
				Движение.СуммаЗайма = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаЗайма);
				Движение.СуммаОплаты = Движение.СуммаЗайма;    
				Движение.СуммаДолгаЗайма = 0;
			КонецЕсли;		 
		КонецЦикла;   
		
		Движение = Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Добавить(); 
		Движение.Период = Дата;
		Движение.Организация = Организация;  
		Движение.ПодразделениеОсновное = ЭтотОбъект.ПредыдущаяОперация.Ломбард; 
		Движение.СкладОсновной = СкладЛомбарда;
		Движение.ПодразделениеОтправитель = ЭтотОбъект.ПредыдущаяОперация.Ломбард;
        Движение.СкладОтправитель = СкладЛомбарда; 
		Движение.Количество = КоличествоВыкупов;   
        Движение.Ответственный = ЭтотОбъект.ОтветственныйСотрудник; 
		Движение.НомерЗБ =  ЭтотОбъект.ПредыдущаяОперация.НомерЗалоговогоБилета; 
		Движение.ВидОперации = "Переоформление (выкуп)";
		
		Запрос = новый Запрос;   
		Запрос.УстановитьПараметр("ЗалоговыйБилет", ЭтотОбъект.ПредыдущаяОперация);
		Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);	
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
		               |	СУММА(ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки.СуммаОстаток) КАК Сумма
		               |ИЗ
		               |	РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Остатки(&Дата, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки.ОбъектЗалога";
	    ТаблицаОстатковРасчетыОЗ = Запрос.Выполнить().Выгрузить();
		Для каждого стрОст Из ТаблицаОстатковРасчетыОЗ Цикл
			Движение = Движения.ЛБ_РасчетыСКлиентамиБУ.Добавить();
			Движение.Период = Дата;     
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Организация = ЭтотОбъект.ПредыдущаяОперация.Организация; 
			Движение.Ломбард = ЭтотОбъект.ПредыдущаяОперация.Ломбард;
			Движение.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоОсновномуДолгу;
			Движение.Клиент = ЭтотОбъект.ПредыдущаяОперация.Залогодатель;
			Движение.ЗалоговыйБилет = ЭтотОбъект.ПредыдущаяОперация;
			Движение.ОбъектЗалога = СтрОст.ОбъектЗалога;         
			Движение.Сумма = СтрОст.Сумма;  
			
			Движение = Движения.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Клиент = ЭтотОбъект.ПредыдущаяОперация.Залогодатель;
			Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация;
			Движение.ОбъектЗалога = СтрОст.ОбъектЗалога;
			Движение.Сумма = СтрОст.Сумма; 				
		Конеццикла;
		
		//Движения.ЛБ_ОперацииПоСистемеЛояльности.Записывать = Истина;
		//Движение = Движения.ЛБ_ОперацииПоСистемеЛояльности.Добавить();
		//Движение.Период = Дата;
		//Движение.Залогодатель = ЭтотОбъект.ПредыдущаяОперация.Залогодатель;
		//Движение.СуммаЗаймов = ЭтотОбъект.СуммаОплатыСсуда;
		//Движение.СуммаОплаченныхПроцентов = ЭтотОбъект.СуммаОплатыПроценты; 		
		//Движение.КоличествоВыкупов = КоличествоВыкупов;
		//Движение.СуммаВыкупов = ЭтотОбъект.СуммаОплатыСсуда + ЭтотОбъект.СуммаОплатыПроценты;	

		
		Если НЕ ЕстьНеВыкупленные Тогда
		    ЗакрытьДоверенностиПоЗалоговомуБилету(ЭтотОбъект.ПредыдущаяОперация.Залогодатель, ЭтотОбъект.ПредыдущаяОперация); 
		КонецЕсли;
		
		Если ЛБ_УправлениеЛомбардом.ПроверитьСхемуКредитованияУчастиеВРасчетеСтатусовПоСистемеЛояльности(Дата, ЭтотОбъект.ПредыдущаяОперация.СхемаКредитования) Тогда
			Если НЕ СтатусЗалоговогоБилетаНач = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Наследство Тогда
				СтатусСтарый = ЛБ_УправлениеЛомбардом.ПолучитьТекущийСтатусКлиента(Дата, ЭтотОбъект.ПредыдущаяОперация.Залогодатель);
				НовыйСтатусЗалогодаталя = ЛБ_УправлениеЛомбардом.ПроверкаСтатусаЗалогодателя(Дата, ЭтотОбъект.ПредыдущаяОперация.Залогодатель, СтатусСтарый, Истина);
				Если НЕ СтатусСтарый = НовыйСтатусЗалогодаталя Тогда
					Движения.ЛБ_СтатусыЗалогодателей.Записывать = Истина; 
					Движение = Движения.ЛБ_СтатусыЗалогодателей.Добавить();
					Движение.Период = Дата;
					Движение.Залогодатель = ЭтотОбъект.ПредыдущаяОперация.Залогодатель;
				    Движение.Статус =  НовыйСтатусЗалогодаталя;
				КонецЕсли;	
			КонецЕсли;	 
		КонецЕсли;	
		
		Движения.ЛБ_СостояниеЗалоговогоБилета.Записывать = Истина;
		Движение = Движения.ЛБ_СостояниеЗалоговогоБилета.Добавить();
		Движение.Период = Дата;
		Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация;  
		Движение.Залогодатель = Этотобъект.ПредыдущаяОперация.Залогодатель;
		Движение.НомерЗалоговогоБилета = Этотобъект.ПредыдущаяОперация.НомерЗалоговогоБилета;
		Движение.СтатусЗалоговогоБилета = ?(НЕ ЕстьНеВыкупленные, Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт, ?(СтатусЗалоговогоБилетаНач = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Наследство, СтатусЗалоговогоБилетаНач, Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтвественноеХранение));
		Движение.СхемаКредитования = Этотобъект.ПредыдущаяОперация.СхемаКредитования;
		Движение.ПричинаПрименения = ПричинаПримененияНач;
		Движение.НомерДопСоглашения = НомерДопСоглашения;
		Движение.СуммаЗайма = 0;			
								
		Движения.ЛБ_НачислениеПроцентовДетально.Записывать = Истина;
		Для каждого Стр из Этотобъект.НачислениеПроцентовДетально Цикл	
			Движение = Движения.ЛБ_НачислениеПроцентовДетально.Добавить();
			Движение.Период = Дата;     
			Движение.ЗалоговыйБилет = ЭтотОбъект.ПредыдущаяОперация; 
			Движение.ДатаНачалаРасчета = ДатаНачалаРасчетаНач;
            Движение.ВидПроцентнойСтавки = стр.ВидПроцентнойСтавки;
			Движение.ДатаНач = стр.ДатаНач;
			Движение.ДатаКон = стр.ДатаКон;
			Движение.ДеньНач = Стр.ДеньНач;
			Движение.ДеньКон = Стр.ДеньКон;
			Движение.СуммаПроцентов = Стр.СуммаПроцентов;
			Движение.СуммаПроцентовДень = Стр.СуммаПроцентовДень;
			Движение.ПроцентнаяСтавкаБазовая = Стр.ПроцентнаяСтавкаБазовая;
			Движение.ПроцентнаяСтавкаАкция = Стр.ПроцентнаяСтавкаАкция;
			Движение.ОтклонениеАкцияАбсолютное = Стр.ОтклонениеАкцияАбсолютное;
			Движение.ОтклонениеАкцияОтностельное = Стр.ОтклонениеАкцияОтносительное;
		КонецЦикла;	
		
		УдалитьИзделияИзНакладнойНаОтгузку(ЭтотОбъект.ПредыдущаяОперация);
		
		// потом обработаем новый ЗБ
		Отбор = Новый Структура;
		Отбор.Вставить("ДеньНач", 1);
		Строки = ЭтотОбъект.ГрафикПлатежей.НайтиСтроки(Отбор);
		Если НЕ Строки.Количество() = 0 Тогда
		    мСуммаПроцентовДень = строки.Получить(0).СуммаПроцентовДень;  
			ДатаНачалаРасчета = строки.Получить(0).ДатаНач; 
		Иначе
			мСуммаПроцентовДень = 0;  
			ДатаНачалаРасчета = НачалоДня(Дата);
		КонецЕсли;
		мСуммаПроцентовСрок = ЭтотОбъект.ГрафикПлатежей.Итог("СуммаПроцентов");

		Движения.ЛБ_ОборотыПоОперациямЗайма.Записывать = Истина;
		Движение = Движения.ЛБ_ОборотыПоОперациямЗайма.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Ломбард = Ломбард;
		Движение.ЗалоговыйБилет = Этотобъект.Ссылка;
		Движение.Залогодатель = ЭтотОбъект.Залогодатель;
		Движение.ВидОперации = ЭтотОбъект.ВидОперации;		
		Движение.СуммаСсуды = ЭтотОбъект.СуммаСсуды;     
		
		Движения.ЛБ_ДвиженияДенежныхСредств.Записывать = Истина;
		Движение = Движения.ЛБ_ДвиженияДенежныхСредств.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Ломбард = Ломбард;
		Движение.ВидДенежныхСредств = Перечисления.ЛБ_ВидыДенежныхСредств.Наличные;
		Движение.ВидДвиженияДС = Перечисления.ЛБ_ВидыДвиженияДС.Расход;	
		Движение.КассоваяСмена = КассоваяСмена;
		Если ЗначениеЗаполнено(КассоваяСмена) Тогда  
			Если НЕ ЗначениеЗаполнено(СводныйРКО) Тогда  
				СводныйРКО = ЛБ_ОбщийМодуль.СоздатьСводныйРКО(КассоваяСмена.Дата, Организация, Ломбард); 				
				ПроводитьПоКассовойСмене = Истина;
			КонецЕсли;
			Движение.КассоваяОперация = СводныйРКО;  
			Движение.Номер = СводныйРКО.ПредставлениеНомераРКО;
		КонецЕсли;	
		Движение.Сумма = ЭтотОбъект.СуммаСсуды; 
		Если ЗначениеЗаполнено(ЭтотОбъект.Представитель) Тогда 
			Движение.Контрагент = ЭтотОбъект.Представитель; 
			Движение.ФИО = ФИОКлиента(Представитель, Дата); 
	        Движение.ДУЛ = ДокументКлиентаВСтроку(ЭтотОбъект.ДокументПредставителя);
		Иначе	                                            
			Движение.Контрагент = ЭтотОбъект.Залогодатель; 
			Движение.ФИО = ФИОКлиента(Залогодатель, Дата); 
	        Движение.ДУЛ = ДокументКлиентаВСтроку(ДокументЗалогодателя);
		КонецЕсли;	
		Движение.ФизическоеЛицо = ЭтотОбъект.Залогодатель;
		Движение.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ВыдачаЗаймаПереоформление; 
		Движение.ДополнительнаяИнформация = "Залоговый билет № " + СокрЛП(ЭтотОбъект.НомерЗалоговогоБилета) + " от " + Формат(Дата, "ДФ=dd.MM.yyyy");
		Движение.Основание = "Выдача денежных средств по договору займа № " + СокрЛП(ЭтотОбъект.НомерЗалоговогоБилета) + " от " + Формат(Дата, "ДФ=dd.MM.yyyy");
		Результат = ЛБ_ОбщийМодуль.ЗаполнитьДтКт(Движение.ВидОперации);
	    Движение.Дт = Результат.Дт;
	    Движение.Кт = Результат.Кт;
       		
		Движения.ЛБ_ДенежныеСредства.Записывать = Истина;
		Движение = Движения.ЛБ_ДенежныеСредства.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Ломбард = Ломбард;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.ВидДенежныхСредств = Перечисления.ЛБ_ВидыДенежныхСредств.Наличные;	
		Движение.Сумма = ЭтотОбъект.СуммаСсуды;
		
		Движения.ЛБ_РасчетыСКлиентами.Записывать = Истина;
		Движение = Движения.ЛБ_РасчетыСКлиентами.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ДатаНачалаРасчета = Этотобъект.Дата;
		Движение.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоОсновномуДолгу;
		Движение.Клиент = ЭтотОбъект.Залогодатель;
		Движение.ЗалоговыйБилет = Этотобъект.Ссылка;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Сумма = ЭтотОбъект.СуммаСсуды;
		
		КоличествоЗалогов = 0; 
		Движения.ЛБ_ОбъектыЗалога.Записывать = Истина; 
		Движения.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Записывать = Истина; 
		Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Записывать = Истина;
		Для каждого Стр Из ЭтотОбъект.Товары цикл 
			Если Стр.Переоформить Тогда     
				КоличествоЗалогов = КоличествоЗалогов + Стр.Количество;				
				Движение = Движения.ЛБ_ОбъектыЗалога.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Организация = Организация;
				Движение.Ломбард = Ломбард;  
				Движение.Склад = СкладЛомбарда;
				Движение.ЗалоговыйБилет = Этотобъект.Ссылка;
				Движение.ОбъектЗалога = Стр.ОбъектЗалога;
				Движение.Количество = Стр.Количество;
				Движение.СуммаОценки = Стр.СуммаОценкиМаксимальная; 
				//Движение.СуммаОценкиНачальная = Стр.СуммаОценки;   
							
				Движение = Движения.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Клиент = ЭтотОбъект.Залогодатель;
				Движение.ЗалоговыйБилет = Этотобъект.Ссылка;
				Движение.ОбъектЗалога = Стр.ОбъектЗалога;
				Движение.Сумма = Стр.СуммаСсуды;    
				
				Движение = Движения.ЛБ_РасчетыСКлиентамиБУ.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;      
				Движение.Организация = ЭтотОбъект.Организация;   
				Движение.Ломбард = ЭтотОбъект.Ломбард;  
				Движение.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоОсновномуДолгу;
				Движение.Клиент = ЭтотОбъект.Залогодатель;
				Движение.ЗалоговыйБилет = Этотобъект.Ссылка;
				Движение.ОбъектЗалога = Стр.ОбъектЗалога; 
				Движение.Сумма = Стр.СуммаСсуды;
			КонецЕсли;	
		КонецЦикла;	         
		Если НЕ КоличествоЗалогов = 0 Тогда
			Движение = Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Добавить(); 
			Движение.Период = Дата;
			Движение.Организация = Организация;  
			Движение.ПодразделениеОсновное = Ломбард; 
			Движение.СкладОсновной = СкладЛомбарда;
			Движение.ПодразделениеПолучатель = Ломбард;
	        Движение.СкладПолучатель = СкладЛомбарда; 
			Движение.Количество = КоличествоЗалогов;  
			Движение.Ответственный = ЭтотОбъект.ОтветственныйСотрудник; 
			Движение.НомерЗБ =  ЭтотОбъект.НомерЗалоговогоБилета; 
		    Движение.ВидОперации = "Переоформление (займ)";
		КонецЕсли;
						
		Движения.ЛБ_ОперацииПоСистемеЛояльности.Записывать = Истина;
		Движение = Движения.ЛБ_ОперацииПоСистемеЛояльности.Добавить();
		Движение.Период = Дата;
		Движение.Залогодатель = ЭтотОбъект.Залогодатель;
		Движение.КоличествоЗалогов = КоличествоЗалогов;
		Движение.СуммаЗаймов = ЭтотОбъект.СуммаСсуды;
	
		Движения.ЛБ_СостояниеЗалоговогоБилета.Записывать = Истина;
		Движение = Движения.ЛБ_СостояниеЗалоговогоБилета.Добавить();
		Движение.Период = Дата; 
		Движение.Залогодатель = ЭтотОбъект.Залогодатель;
		Движение.ЗалоговыйБилет = Этотобъект.Ссылка;
		Движение.НомерЗалоговогоБилета = Этотобъект.НомерЗалоговогоБилета;
		Движение.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Оформлен;
		Движение.СхемаКредитования = ЭтотОбъект.СхемаКредитования;
		Движение.ПричинаПрименения = Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма;
		Движение.ДатаВыкупа = Этотобъект.ДатаВыкупа;
		Движение.ДатаВыкупаЛьготныйСрок = Этотобъект.ДатаВыкупаЛьготная;	
		Движение.ДатаНачалаРасчетаПроцентов = ДатаНачалаРасчета;
		Движение.СуммаЗайма = ЭтотОбъект.СуммаСсуды;
		Движение.СуммаПроцентовДень = мСуммаПроцентовДень;
        Движение.СуммаПроцентовСрок = мСуммаПроцентовСрок;
		Движение.ПредельныйСрокЗайма = ЭтотОбъект.ПредельныйСрокЗайма;
		Движение.ПредельныйСрокЗаймаДни = ЭтотОбъект.ПредельныйСрокЗаймаДни;
		
        Движения.ЛБ_СостояниеОбъектаЗалога.Записывать = Истина;
		Для каждого Стр Из ЭтотОбъект.Товары цикл  
			Если НЕ Стр.Переоформить Тогда
				Продолжить;
			КонецЕсли;	
		    Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить();
			Движение.Период = Дата;
			Движение.ЗалоговыйБилет = Этотобъект.Ссылка;
			Движение.ОбъектЗалога = Стр.ОбъектЗалога;
			Движение.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.Принят;
			Движение.СуммаОценки = Стр.СуммаОценкиМаксимальная;	
			Движение.СуммаОценкиНачальная = Стр.СуммаОценки;
			Движение.СуммаЗайма = Стр.СуммаСсуды;
			Движение.СуммаДолгаЗайма = Стр.СуммаСсуды;
		КонецЦикла;      
				
		Движения.ЛБ_РеквизитыОбъектаЗалога.Записывать = Истина;
		Движения.ЛБ_ВставкиОбъектаЗалога.Записывать = Истина;
        Движения.ЛБ_ДополнительныеМатериалыОбъектаЗалога.Записывать = Истина;
		
		НомСтр = 0;
		Для каждого Стр Из ЭтотОбъект.Товары цикл 
			Если НЕ Стр.Переоформить Тогда
				Продолжить;
			КонецЕсли;     
			НомСтр = НомСтр + 1;
			Движение = Движения.ЛБ_РеквизитыОбъектаЗалога.Добавить();
			Движение.Период = Дата;
			Движение.ОбъектЗалога 	= стр.ОбъектЗалога; 
			Движение.ЗалоговыйБилет = ЭтотОбъект.Ссылка;
			Движение.НомерСтрокиТаблицы = Стр.НомерСтроки;
			Движение.ВидИзделия 	= стр.ВидИзделия; 
			Движение.Артикул = ЛБ_УправлениеЛомбардом.АртикулОбъектаЗалога(ЭтотОбъект.Ссылка, НомСтр);
			Движение.Проба 			= стр.Проба;
			Движение.Категория 		= стр.Категория;
			Движение.Клеймо 		= стр.Клеймо; 
			Движение.Именник        = стр.Именник;				
			Движение.ДанныеИменника = стр.ДанныеИменника;
			Движение.Дефекты        = стр.Дефекты;
			Движение.СостояниеИзделия = стр.СостояниеИзделия;
			Движение.ЕдиницаИзмерения = стр.ЕдиницаИзмерения;
			Движение.Вес 			= стр.Вес;
			//Движение.ВесВПробеЧистоты = стр.ВесВПробеЧистоты; 
			Движение.ВесЧистый 		= стр.ВесЧистый; 
			Движение.Цена = стр.Цена;
			Движение.СуммаОценки = Стр.СуммаОценки; 
			Движение.СуммаОценкиМакс = Стр.СуммаОценкиМаксимальная;
			Движение.СуммаСсуды = Стр.СуммаСсуды;
			Движение.СуммаОценкиМеталлы = Стр.СуммаОценкиМеталлы; 
			//Движение.СуммаОценкиКамни = Стр.СуммаОценкиКамни;
			//+Мельников 09.10.24 Скидка 30%. Добавил запись в регистр. Заявка 2732.
			Движение.Вес30 = стр.Вес30;
			//-Мельников
			//+МАН 21.05.25 Добавлена запись значения "Описание"
			Движение.ОписаниеОЗ = Стр.Описание;
			//-МАН
			ОписаниеИзделия = СокрЛП(Стр.ВидИзделия) + " " + СокрЛП(Формат(Стр.Вес, "ЧЦ=10; ЧДЦ=2")) + " " + сокрЛП(Стр.ЕдиницаИзмерения); 
			ОписаниеМ = СокрЛП(Стр.Проба);  
			
			Отбор = Новый Структура;
			Отбор.Вставить("Ключстроки", Стр.КлючСтроки);
			
			СуммаОценкиВставки = 0;
			ОписаниеВставок = "";
			СтрокиВ = Вставки.НайтиСтроки(Отбор);  
			Если НЕ СтрокиВ.Количество() = 0 Тогда 
				Движение.Вставки = Истина;
				Для каждого стрВ Из СтрокиВ цикл  
					ДвижениеВ = Движения.ЛБ_ВставкиОбъектаЗалога.Добавить();
					ДвижениеВ.Период = Дата;
					ДвижениеВ.ОбъектЗалога = стр.ОбъектЗалога; 
					ДвижениеВ.ЗалоговыйБилет = ЭтотОбъект.Ссылка;
					ДвижениеВ.НомерСтрокиТаблицы = СтрВ.НомерСтроки;
	                ДвижениеВ.Вес  = стрВ.Вес;
					ДвижениеВ.ВесГраммы = стрВ.ВесГраммы;
					ДвижениеВ.ВидВставки = стрВ.ВидВставки;
					ДвижениеВ.ВидОгранки = стрВ.ВидОгранки;
					ДвижениеВ.ФормаОгранки = стрВ.ФормаОгранки;
					ДвижениеВ.КачествоОгранки = СтрВ.КачествоОгранки;
					ДвижениеВ.Длина = стрВ.Длина;
					ДвижениеВ.Ширина = стрВ.Ширина;
					ДвижениеВ.Высота = стрВ.Высота;
					ДвижениеВ.Диаметр = стрВ.Диаметр;
					ДвижениеВ.Диаметр1 = стрВ.Диаметр1;
					ДвижениеВ.Диаметр2 = стрВ.Диаметр2;
					ДвижениеВ.ЕдиницаИзмерения = стрВ.ЕдиницаИзмерения;
					ДвижениеВ.Количество = стрВ.Количество;
					ДвижениеВ.Цена = стрВ.Цена;
					ДвижениеВ.СуммаОценки = стрВ.Сумма;
					СуммаОценкиВставки = СуммаОценкиВставки + ДвижениеВ.СуммаОценки;
					
					ОписаниеВставок = ОписаниеВставок + ?(Пустаястрока(ОписаниеВставок), "; ", ", ") + Строка(СтрВ.Количество) + " " + СокрЛП(СтрВ.ВидВставки) + 
					     ?(ЗначениеЗаполнено(СтрВ.ВидОгранки), " " + СокрЛП(СтрВ.ВидОгранки), "") + ?(ЗначениеЗаполнено(СтрВ.КачествоОгранки), " " + СокрЛП(СтрВ.КачествоОгранки), "");
					ОписаниеРазмера = "";
					Если НЕ СтрВ.Диаметр = 0 Тогда
						ОписаниеРазмера = СокрЛП(СтрВ.Диаметр) + " мм";
					ИначеЕсли НЕ СтрВ.Диаметр1 = 0 Тогда	   
						ОписаниеРазмера = СокрЛП(СтрВ.Диаметр1) + ?(НЕ СтрВ.Диаметр2 = 0, "х" + СокрЛП(СтрВ.Диаметр2), "") + " мм";
					ИначеЕсли НЕ СтрВ.Длина = 0 Тогда  
						ОписаниеРазмера = СокрЛП(СтрВ.Длина) + ?(НЕ СтрВ.Ширина = 0, "х" + СокрЛП(СтрВ.Ширина), "") + ?(НЕ СтрВ.Высота = 0, "х" + СокрЛП(СтрВ.Высота), "") + " мм";
					КонецЕсли;	
					ОписаниеВставок = ОписаниеВставок + " " + ОписаниеРазмера;  
					ОписаниеВставок = ОписаниеВставок + " " + СокрЛП(Формат(СтрВ.Вес, "ЧЦ=10; ЧДЦ=3")) + " " + сокрЛП(стрВ.ЕдиницаИзмерения);
				КонецЦикла;	  
				Движение.СуммаОценкиКамни = Движение.СуммаОценкиКамни + СуммаОценкиВставки;
			КонецЕсли;	
			
			ВесДопМеталлов = 0;  
			СуммаОценкиДопМеталлы = 0;
			СтрокиД = ДополнительныеМеталлы.НайтиСтроки(Отбор);
			Если НЕ СтрокиД.Количество() = 0 Тогда 
				Для каждого стрД Из СтрокиД цикл 
					ДвижениеМ = Движения.ЛБ_ДополнительныеМатериалыОбъектаЗалога.Добавить();
					ДвижениеМ.Период = Дата;
					ДвижениеМ.ОбъектЗалога 	= стр.ОбъектЗалога;  
					ДвижениеМ.ЗалоговыйБилет = ЭтотОбъект.Ссылка;
					ДвижениеМ.НомерСтрокиТаблицы = СтрД.НомерСтроки;
					ДвижениеМ.Проба 			= стрД.Проба;
					ДвижениеМ.ЕдиницаИзмерения = стрД.ЕдиницаИзмерения;
					ДвижениеМ.ВесЧистый			= стрД.ВесЧистый;
					//ДвижениеМ.ВесВПробеЧистоты = стрД.ВесВПробеЧистоты;    
					ДвижениеМ.ВесВПробеЧистоты = ЛБ_ОбщийМодуль.ПеревестиВЧистоту(стрД.ВесЧистый, стрД.Проба);
					ДвижениеМ.Цена = стрД.Цена;
					ДвижениеМ.СуммаОценки = СтрД.СуммаОценкиМеталлы; 
					СуммаОценкиДопМеталлы = СуммаОценкиДопМеталлы + СтрД.СуммаОценкиМеталлы;
					ВесДопМеталлов = ВесДопМеталлов + стрД.ВесЧистый;  
					Движение.ВесВПробеЧистоты = Движение.ВесВПробеЧистоты + ДвижениеМ.ВесВПробеЧистоты;
					ОписаниеМ = ОписаниеМ + "+" + СокрЛП(СтрД.Проба);  
					Движение.ВесЧистый = Движение.ВесЧистый + ДвижениеМ.ВесЧистый;
				Конеццикла;   
			КонецЕсли;
			
			ДвижениеМ = Движения.ЛБ_ДополнительныеМатериалыОбъектаЗалога.Добавить(); //основной металл
			ДвижениеМ.Период = Дата;
			ДвижениеМ.ОбъектЗалога 	= стр.ОбъектЗалога;
			ДвижениеМ.ЗалоговыйБилет = ЭтотОбъект.Ссылка;
			ДвижениеМ.Проба 			= стр.Проба;
			ДвижениеМ.ЕдиницаИзмерения = стр.ЕдиницаИзмерения;
			ДвижениеМ.ВесЧистый			= стр.ВесЧистый;
			ДвижениеМ.ВесВПробеЧистоты = ЛБ_ОбщийМодуль.ПеревестиВЧистоту(ДвижениеМ.ВесЧистый, ДвижениеМ.Проба); 
			ДвижениеМ.Цена = стр.Цена;
			ДвижениеМ.СуммаОценки = Стр.СуммаОценкиМеталлы - СуммаОценкиДопМеталлы; 
			
			Движение.ВесВПробеЧистоты = Движение.ВесВПробеЧистоты + ДвижениеМ.ВесВПробеЧистоты;
			Движение.ОписаниеИзделия = ОписаниеИзделия + " " + ОписаниеМ + ?(ПустаяСтрока(ОписаниеВставок), "", "; " + ОписаниеВставок); 
		КонецЦикла;			
		
		Движения.ЛБ_ГрафикПлатежей.Записывать = Истина;
		Для каждого Стр из Этотобъект.ПроцентныеСтавкиПоПериодам Цикл
			Движение = Движения.ЛБ_ГрафикПлатежей.Добавить();
			Движение.Период = Дата;     
			Движение.ЗалоговыйБилет = ЭтотОбъект.Ссылка;  
			Движение.ПричинаПрименения = Стр.ПричинаПрименения;
            Движение.ВидПроцентнойСтавки = стр.ВидПроцентнойСтавки;
			Движение.ДеньНачалаПрименения = стр.ДеньНачалаПрименения;
			Движение.ПроцентнаяСтавкаБазовая = Стр.ПроцентнаяСтавка;
			Движение.ПроцентнаяСтавкаАкция = Стр.ПроцентнаяСтавкаАкция;
			Движение.ОтклонениеАкцияАбсолютное = Стр.ОтклонениеАкцияАбсолютное;
			Движение.ОтклонениеАкцияОтностельное = Стр.ОтклонениеАкцияОтносительное;
		КонецЦикла;	
				
		Движения.ЛБ_ДатыОбновленияАнкеты.Записывать = Истина;  
		Движение = Движения.ЛБ_ДатыОбновленияАнкеты.Добавить();
		Движение.Период = Дата; 
		Движение.Залогодатель = ЭтотОбъект.Залогодатель;
	    Движение.ДатаАктуальности = Дата;  
		
		Если НЕ ЭтотОбъект.СогласиеНаСМСРассылку = ЛБ_УправлениеЛомбардом.ПолучитьСогласиеНаСМСРассылки(ЭтотОбъект.Дата, ЭтотОбъект.Залогодатель) Тогда  
			Движения.ЛБ_СогласиеНаСМСРассылку.Записывать = Истина;
			Движение = Движения.ЛБ_СогласиеНаСМСРассылку.Добавить();
			Движение.Период = Дата; 
			Движение.Залогодатель = ЭтотОбъект.Залогодатель;
		    Движение.Согласен = ЭтотОбъект.СогласиеНаСМСРассылку;  
		КонецЕсли;
				
		Движения.ЛБ_ПриказыВОперацияхЗайма.Записывать = Истина; 
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ПриказВИПСтавки) Тогда	        
			ЗаписьПоБазовомуПриказу  = Истина;
		    Если ЗначениеЗаполнено(ЭтотОбъект.ПриказАкцияСтавки) Тогда
				Движение = Движения.ЛБ_ПриказыВОперацияхЗайма.Добавить();
				Движение.Период = Дата; 
				Движение.ВидПриказа = Перечисления.ЛБ_ВидыОперацийПриказы.Акция;
				Движение.Приказ = ПриказАкцияСтавки;      
				Движение.Установить = Перечисления.ЛБ_УстановитьВПриказе.Ставки;
				Движение.ОтклонениеПоАкции = ЭтотОбъект.ОтклонениеПоАкции; 
				
				Если НЕ ЭтотОбъект.ОтклонениеПоАкции Тогда 
					ЗаписьПоБазовомуПриказу  = Ложь;
				КонецЕсли;	
			КонецЕсли;	

			Если ЗначениеЗаполнено(ЭтотОбъект.ПриказСтавки) И  ЗаписьПоБазовомуПриказу Тогда
				Движение = Движения.ЛБ_ПриказыВОперацияхЗайма.Добавить();
				Движение.Период = Дата; 
				Движение.ВидПриказа = Перечисления.ЛБ_ВидыОперацийПриказы.Базовый; 
				Движение.Установить = Перечисления.ЛБ_УстановитьВПриказе.Ставки;
				Движение.Приказ = ПриказСтавки;
			КонецЕсли; 
		КонецЕсли;	

		//+МАН 10.12.25
		СписокПриказовВИПМ = Новый СписокЗначений;
		СписокПриказовВИПВ = Новый СписокЗначений;
		//-МАН
		
		СписокПриказовМ = Новый СписокЗначений;
		Для каждого Стр Из ЭтотОбъект.Товары Цикл 
			Если ЗначениеЗаполнено(Стр.Приказ) Тогда
				Если СписокПриказовМ.НайтиПоЗначению(Стр.Приказ) = неопределено Тогда
					СписокПриказовМ.Добавить(Стр.Приказ);
				КонецЕсли;	
			КонецЕсли;	
			//+МАН 10.12.25
			Если ЗначениеЗаполнено(Стр.ПриказВИПМеталлы) Тогда
				Если СписокПриказовВИПМ.НайтиПоЗначению(Стр.ПриказВИПМеталлы) = Неопределено Тогда
					СписокПриказовВИПМ.Добавить(Стр.ПриказВИПМеталлы);
				КонецЕсли;
			КонецЕсли;
			//-МАН
		КонецЦикла;	 
		
		Для каждого Стр Из ЭтотОбъект.ДополнительныеМеталлы Цикл 
			Если ЗначениеЗаполнено(Стр.Приказ) Тогда
				Если СписокПриказовМ.НайтиПоЗначению(Стр.Приказ) = неопределено Тогда
					СписокПриказовМ.Добавить(Стр.Приказ);
				КонецЕсли;	
			КонецЕсли;	
			//+МАН 10.12.25
			Если ЗначениеЗаполнено(Стр.ПриказВИПМеталлы) Тогда
				Если СписокПриказовВИПМ.НайтиПоЗначению(Стр.ПриказВИПМеталлы) = неопределено Тогда
					СписокПриказовВИПМ.Добавить(Стр.ПриказВИПМеталлы);
				КонецЕсли;
			КонецЕсли;
			//-МАН
		КонецЦикла;	
		
		Если НЕ СписокПриказовМ.Количество() = 0 Тогда     
			Для каждого Эл Из СписокПриказовМ Цикл
				Движение = Движения.ЛБ_ПриказыВОперацияхЗайма.Добавить();
				Движение.Период = Дата; 
		        Движение.ВидПриказа = Перечисления.ЛБ_ВидыОперацийПриказы.Базовый;
				Движение.Приказ = Эл.Значение;      
				Движение.Установить = Перечисления.ЛБ_УстановитьВПриказе.Металлы;
			КонецЦикла;	
		КонецЕсли;	 
		
		СписокПриказовВ = Новый СписокЗначений;
		Для каждого Стр Из ЭтотОбъект.Вставки Цикл 
			Если ЗначениеЗаполнено(Стр.Приказ) Тогда
				Если СписокПриказовВ.НайтиПоЗначению(Стр.Приказ) = неопределено Тогда
					СписокПриказовВ.Добавить(Стр.Приказ);
				КонецЕсли;	
			КонецЕсли;	
			//+МАН 10.12.25
			Если ЗначениеЗаполнено(Стр.ПриказВИПВставки) Тогда
				Если СписокПриказовВИПВ.НайтиПоЗначению(Стр.ПриказВИПВставки) = Неопределено Тогда
					СписокПриказовВИПВ.Добавить(Стр.ПриказВИПВставки);
				КонецЕсли;
			КонецЕсли;
			//-МАН
		КонецЦикла;	 
			
		Если НЕ СписокПриказовВ.Количество() = 0 Тогда     
			Для каждого Эл Из СписокПриказовВ Цикл
				Движение = Движения.ЛБ_ПриказыВОперацияхЗайма.Добавить();
				Движение.Период = Дата; 
		        Движение.ВидПриказа = Перечисления.ЛБ_ВидыОперацийПриказы.Базовый;
				Движение.Приказ = Эл.Значение;      
				Движение.Установить = Перечисления.ЛБ_УстановитьВПриказе.Вставки;
			КонецЦикла;	
		КонецЕсли;	

		//+МАН 10.12.25
		Если ЗначениеЗаполнено(ЭтотОбъект.ПриказВИПСтавки) Тогда
			Движение = Движения.ЛБ_ПриказыВОперацияхЗайма.Добавить();
			Движение.Период = Дата; 
			Движение.ВидПриказа = Перечисления.ЛБ_ВидыОперацийПриказы.ВИП;
			Движение.Приказ = ЭтотОбъект.ПриказВИПСтавки;
			Движение.Установить = Перечисления.ЛБ_УстановитьВПриказе.Ставки;
		КонецЕсли;

		Если СписокПриказовВИПМ.Количество() <> 0 Тогда     
			Для каждого Эл Из СписокПриказовВИПМ Цикл
				Движение = Движения.ЛБ_ПриказыВОперацияхЗайма.Добавить();
				Движение.Период = Дата; 
				Движение.ВидПриказа = Перечисления.ЛБ_ВидыОперацийПриказы.ВИП;
				Движение.Приказ = Эл.Значение;
				Движение.Установить = Перечисления.ЛБ_УстановитьВПриказе.Металлы;
			КонецЦикла;	
		КонецЕсли;	 
		
		Если НЕ СписокПриказовВИПВ.Количество() = 0 Тогда     
			Для каждого Эл Из СписокПриказовВИПВ Цикл
				Движение = Движения.ЛБ_ПриказыВОперацияхЗайма.Добавить();
				Движение.Период = Дата; 
				Движение.ВидПриказа = Перечисления.ЛБ_ВидыОперацийПриказы.ВИП;
				Движение.Приказ = Эл.Значение;
				Движение.Установить = Перечисления.ЛБ_УстановитьВПриказе.Вставки;
			КонецЦикла;	
		КонецЕсли;	
		//-МАН

	ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаЗалога Тогда 
		ЗалоговыйБилет = ЭтотОбъект.ПредыдущаяОперация;
		
		Движения.ЛБ_ОборотыПоОперациямЗайма.Записывать = Истина;
		Движение = Движения.ЛБ_ОборотыПоОперациямЗайма.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Ломбард = Ломбард;
		Движение.ЗалоговыйБилет = ЗалоговыйБилет;
		Движение.Залогодатель = ЗалоговыйБилет.Залогодатель;
		Движение.ВидОперации = ЭтотОбъект.ВидОперации;		
		Движение.СуммаСсуды = -ЗалоговыйБилет.Товары.Итог("СуммаСсуды");     
				
		Движения.ЛБ_ОперацииПоСистемеЛояльности.Записывать = Истина;
		Движение = Движения.ЛБ_ОперацииПоСистемеЛояльности.Добавить();
		Движение.Период = Дата;
		Движение.Залогодатель = ЗалоговыйБилет.Залогодатель;
		Движение.КоличествоЗалогов = -ЗалоговыйБилет.Товары.Итог("Количество");
		Движение.СуммаЗаймов = -ЗалоговыйБилет.СуммаСсуды;
		
		НаборЗаписей = РегистрыНакопления.ЛБ_ДвиженияДенежныхСредств.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ЗалоговыйБилет);
		НаборЗаписей.Прочитать(); 

		Движения.ЛБ_ДвиженияДенежныхСредств.Записывать = Истина;
		Для каждого Запись Из НаборЗаписей Цикл				
			Движение = Движения.ЛБ_ДвиженияДенежныхСредств.Добавить();
			Движение.Период = Дата;  
			Движение.Организация = Запись.Организация;
			Движение.ВидДенежныхСредств = Запись.ВидДенежныхСредств;
			Движение.Ломбард = Запись.Ломбард;	
			Движение.ВидДвиженияДС = Перечисления.ЛБ_ВидыДвиженияДС.Расход; 
			Движение.Сумма = -Запись.Сумма; 
			Движение.БанковскаяКарта = Запись.БанковскаяКарта;
			Движение.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ОтменаВыдачиЗайма;
			Если ЗначениеЗаполнено(КассоваяСмена) Тогда  
				Если НЕ ЗначениеЗаполнено(СводныйРКО) Тогда  
					СводныйРКО = ЛБ_ОбщийМодуль.СоздатьСводныйРКО(КассоваяСмена.Дата, Организация, Ломбард); 				
					ПроводитьПоКассовойСмене = Истина;
				КонецЕсли;
				Движение.КассоваяОперация = СводныйРКО;  
				Движение.Номер = СводныйРКО.ПредставлениеНомераРКО;
			КонецЕсли;	
			Движение.КассоваяСмена = КассоваяСмена;
			Движение.ДополнительнаяИнформация = Запись.ДополнительнаяИнформация;
			Результат = ЛБ_ОбщийМодуль.ЗаполнитьДтКт(Движение.ВидОперации);
		    Движение.Дт = Результат.Дт;
		    Движение.Кт = Результат.Кт;
         	Движение.ДУЛ = Запись.ДУЛ;
			Движение.Контрагент = Запись.Контрагент;
			Движение.Основание = Запись.Основание;
			Движение.ФизическоеЛицо = Запись.ФизическоеЛицо;
			Движение.ФИО = Запись.ФИО;
		КонецЦикла;
  		
		Движения.ЛБ_ДенежныеСредства.Записывать = Истина;
		Движение = Движения.ЛБ_ДенежныеСредства.Добавить();
		Движение.Период = Дата;
		Движение.Организация = ЗалоговыйБилет.Организация;
		Движение.Ломбард = ЗалоговыйБилет.Ломбард;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.ВидДенежныхСредств = Перечисления.ЛБ_ВидыДенежныхСредств.Наличные;	
		Движение.Сумма = -ЗалоговыйБилет.Товары.Итог("СуммаСсуды");
		
		Движения.ЛБ_РасчетыСКлиентами.Записывать = Истина;
		Движение = Движения.ЛБ_РасчетыСКлиентами.Добавить();
		Движение.Период = Дата;
		Движение.Организация = ЗалоговыйБилет.Организация;
		Движение.ДатаНачалаРасчета = ЗалоговыйБилет.Дата;
		Движение.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоОсновномуДолгу;
		Движение.Клиент = ЗалоговыйБилет.Залогодатель;
		Движение.ЗалоговыйБилет = ЗалоговыйБилет;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Сумма = -ЗалоговыйБилет.Товары.Итог("СуммаСсуды");
		
		Движения.ЛБ_ОбъектыЗалога.Записывать = Истина; 
		Движения.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Записывать = Истина;  
		Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Записывать = Истина;
		Для каждого Стр Из ЗалоговыйБилет.Товары цикл
			Движение = Движения.ЛБ_ОбъектыЗалога.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Организация = ЗалоговыйБилет.Организация;
			Движение.Ломбард = ЗалоговыйБилет.Ломбард;
			Движение.Склад = СкладЛомбарда;
			Движение.ЗалоговыйБилет = ЗалоговыйБилет;
			Движение.ОбъектЗалога = Стр.ОбъектЗалога;
			Движение.Количество = -Стр.Количество;
			Движение.СуммаОценки = -Стр.СуммаОценкиМаксимальная; 
			//Движение.СуммаОценкиНачальная = -Стр.СуммаОценки;
					
			Движение = Движения.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Клиент = ЗалоговыйБилет.Залогодатель;
			Движение.ЗалоговыйБилет = ЗалоговыйБилет;
			Движение.ОбъектЗалога = Стр.ОбъектЗалога;
			Движение.Сумма = -Стр.СуммаСсуды;
		КонецЦикла;	 
		Движение = Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Добавить(); 
		Движение.Период = Дата;
		Движение.Организация = ЗалоговыйБилет.Организация;
		Движение.ПодразделениеОсновное = ЗалоговыйБилет.Ломбард;
		Движение.ПодразделениеПолучатель = ЗалоговыйБилет.Ломбард;
        Движение.СкладПолучатель = СкладЛомбарда; 
		Движение.Количество = -ЗалоговыйБилет.Товары.Итог("Количество");  
		Движение.Ответственный = ЭтотОбъект.ОтветственныйСотрудник;
		Движение.НомерЗБ =  ЭтотОбъект.ПредыдущаяОперация.НомерЗалоговогоБилета; 
		Движение.ВидОперации = "Отмена выдачи займа";
		
		Движения.ЛБ_СостояниеЗалоговогоБилета.Записывать = Истина;
		Движение = Движения.ЛБ_СостояниеЗалоговогоБилета.Добавить();
		Движение.Период = Дата; 
		Движение.Залогодатель = ЗалоговыйБилет.Залогодатель;
		Движение.ЗалоговыйБилет = ЗалоговыйБилет;
		Движение.НомерЗалоговогоБилета = ЗалоговыйБилет.НомерЗалоговогоБилета;
		Движение.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтказОтОформления;
		Движение.СхемаКредитования = ЗалоговыйБилет.СхемаКредитования;
		Движение.ПричинаПрименения = Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма;
		//Движение.ДатаВыкупа = ЗалоговыйБилет.ДатаВыкупа;
		//Движение.ДатаВыкупаЛьготныйСрок = ЗалоговыйБилет.ДатаВыкупаЛьготная;	
		//Движение.ДатаНачалаРасчетаПроцентов = ДатаНачалаРасчета;
		//Движение.СуммаЗайма = ЗалоговыйБилет.СуммаСсуды;
		//Движение.СуммаПроцентовДень = мСуммаПроцентовДень;
		//Движение.СуммаПроцентовСрок = мСуммаПроцентовСрок;
		
        Движения.ЛБ_СостояниеОбъектаЗалога.Записывать = Истина;
		Движения.ЛБ_РасчетыСКлиентамиБУ.Записывать = Истина;
		Для каждого Стр Из ЗалоговыйБилет.Товары цикл
		    Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить();
			Движение.Период = Дата;
			//+Мельников 25.04.24 В регистр должен записываться изначальный ЗБ, а не документ отмены.
			//Движение.ЗалоговыйБилет = Этотобъект.Ссылка;
			Движение.ЗалоговыйБилет = ЗалоговыйБилет;
			//-Мельников
			Движение.ОбъектЗалога = Стр.ОбъектЗалога;
			Движение.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ОтказОтОформления; 
			Движение.СуммаЗайма = Стр.СуммаСсуды;
			Движение.СуммаДолгаЗайма = Стр.СуммаСсуды;
			Движение.СуммаОценкиНачальная  = Стр.СуммаОценки;
			Движение.СуммаОценки = Стр.СуммаОценкиМаксимальная;  
			
			Движение = Движения.ЛБ_РасчетыСКлиентамиБУ.Добавить();
			Движение.Период = Дата;     
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Организация = ЭтотОбъект.Организация; 
			Движение.Ломбард = ЭтотОбъект.Ломбард;
			Движение.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоОсновномуДолгу;
			Движение.Клиент = ЗалоговыйБилет.Залогодатель;
			Движение.ЗалоговыйБилет = ЗалоговыйБилет;
			Движение.ОбъектЗалога = Стр.ОбъектЗалога;         
			Движение.Сумма = -Стр.СуммаСсуды;  
		КонецЦикла;   		
		
		//+МАН 17.06.25 Запись отмены операции в регистр
		Движения.ЛБ_ОтменыОперацийЗБ.Записывать = Истина;
		Движение = Движения.ЛБ_ОтменыОперацийЗБ.Добавить();
		Движение.Период = Дата;
		Движение.ОтмененныйДокумент = ЭтотОбъект.ОтмененныйДокумент;
		Движение.ВидОперации = ЭтотОбъект.ОтмененныйДокумент.ВидОперации;
		Движение.НомерЗалоговогоБилета = ЭтотОбъект.НомерЗалоговогоБилета;
		//-МАН
		
	ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаПереоформления Тогда 
		ЗалоговыйБилет = ЭтотОбъект.ПредыдущаяОперация;
		
		НаборЗаписей = РегистрыНакопления.ЛБ_ОборотыПоОперациямЗайма.СоздатьНаборЗаписей();
	    НаборЗаписей.Отбор.Регистратор.Установить(ЗалоговыйБилет);
	    НаборЗаписей.Прочитать();   
		
		Движения.ЛБ_ОборотыПоОперациямЗайма.Записывать = Истина;
		Для каждого Запись Из НаборЗаписей Цикл				
			Движение = Движения.ЛБ_ОборотыПоОперациямЗайма.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Запись.Организация;
			Движение.Ломбард = Запись.Ломбард;
			Движение.ЗалоговыйБилет = Запись.ЗалоговыйБилет;
			Движение.Залогодатель = Запись.ЗалоговыйБилет.Залогодатель;
			Движение.ВидОперации = ЭтотОбъект.ВидОперации;		
			Движение.СуммаСсуды = -Запись.СуммаСсуды; 
			Движение.СуммаОплатыЗайм = -Запись.СуммаОплатыЗайм;
		    Движение.СуммаОплатыПроценты = -Запись.СуммаОплатыПроценты; 
			Движение.НакладнаяНаОтгрузку = ЛБ_УправлениеЛомбардом.ПолучитьНакладнуюНаОтгрузкуЗалогоговогоБилета(ЭтотОбъект.ОтмененныйДокумент.Дата - 1, ЗалоговыйБилет);
		КонецЦикла;	 
		
		НаборЗаписей = РегистрыНакопления.ЛБ_ДенежныеСредства.СоздатьНаборЗаписей();
	    НаборЗаписей.Отбор.Регистратор.Установить(ЗалоговыйБилет);
	    НаборЗаписей.Прочитать(); 
		
		Движения.ЛБ_ДенежныеСредства.Записывать = Истина;
		Для каждого Запись Из НаборЗаписей Цикл				
			Движение = Движения.ЛБ_ДенежныеСредства.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Запись.Организация;
			Движение.ВидДвижения = Запись.ВидДвижения;
			Если Запись.ВидДвижения = ВидДвиженияНакопления.Приход Тогда  
				Движение.Период = Дата-1;
			КонецЕсли;	
			Движение.ВидДенежныхСредств = Запись.ВидДенежныхСредств;
			Движение.Ломбард = Запись.Ломбард;		
			Движение.Сумма = -Запись.Сумма; 
		КонецЦикла;	 
  		
		НаборЗаписей = РегистрыНакопления.ЛБ_ДвиженияДенежныхСредств.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ЗалоговыйБилет);
		НаборЗаписей.Прочитать(); 

		Движения.ЛБ_ДвиженияДенежныхСредств.Записывать = Истина;
		Для каждого Запись Из НаборЗаписей Цикл				
			Движение = Движения.ЛБ_ДвиженияДенежныхСредств.Добавить();
			Движение.Период = Дата;   
			Движение.Номер = Запись.Номер;
			Движение.Организация = Запись.Организация;
			Движение.ВидДенежныхСредств = Запись.ВидДенежныхСредств;
			Движение.Ломбард = Запись.Ломбард;				
			Движение.Сумма = -Запись.Сумма; 
			Движение.БанковскаяКарта = Запись.БанковскаяКарта;    
			Если Запись.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ОплатаПоЗаймуПереоформление Тогда 
				Движение.Период = Дата-1;
			    Движение.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ОтменаОплатыПоЗаймуПереоформлению; 
				Движение.ВидДвиженияДС = Перечисления.ЛБ_ВидыДвиженияДС.Приход; 
				Если ЗначениеЗаполнено(КассоваяСмена) Тогда  
					Если НЕ ЗначениеЗаполнено(СводныйПКО) Тогда  
						СводныйПКО = ЛБ_ОбщийМодуль.СоздатьСводныйПКО(КассоваяСмена.Дата, Организация, Ломбард); 				
						ПроводитьПоКассовойСмене = Истина;
					КонецЕсли;
					Движение.КассоваяОперация = СводныйПКО;  
					Движение.Номер = СводныйПКО.ПредставлениеНомераПКО;
				КонецЕсли;	
			ИначеЕсли Запись.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ВыдачаЗаймаПереоформление Тогда
			    Движение.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ОтменаВыдачиЗайма; 
				Движение.ВидДвиженияДС = Перечисления.ЛБ_ВидыДвиженияДС.Расход; 
				Если ЗначениеЗаполнено(КассоваяСмена) Тогда  
					Если НЕ ЗначениеЗаполнено(СводныйРКО) Тогда  
						СводныйРКО = ЛБ_ОбщийМодуль.СоздатьСводныйРКО(КассоваяСмена.Дата, Организация, Ломбард); 				
						ПроводитьПоКассовойСмене = Истина;
					КонецЕсли;
					Движение.КассоваяОперация = СводныйРКО;  
					Движение.Номер = СводныйРКО.ПредставлениеНомераРКО;
				КонецЕсли;	
			КонецЕсли;	   
			Движение.КассоваяСмена = КассоваяСмена;
			Движение.ДополнительнаяИнформация = Запись.ДополнительнаяИнформация;
			Результат = ЛБ_ОбщийМодуль.ЗаполнитьДтКт(Движение.ВидОперации);
		    Движение.Дт = Результат.Дт;
		    Движение.Кт = Результат.Кт;
			Движение.ДУЛ = Запись.ДУЛ;
			Движение.Контрагент = Запись.Контрагент;
			Движение.Основание = Запись.Основание;
			Движение.ФизическоеЛицо = Запись.ФизическоеЛицо;
			Движение.ФИО = Запись.ФИО;
		КонецЦикла;
		
		НаборЗаписей = РегистрыНакопления.ЛБ_ОперацииПоСистемеЛояльности.СоздатьНаборЗаписей();
	    НаборЗаписей.Отбор.Регистратор.Установить(ЗалоговыйБилет);
	    НаборЗаписей.Прочитать(); 
		
		Движения.ЛБ_ОперацииПоСистемеЛояльности.Записывать = Истина;
		Для каждого Запись Из НаборЗаписей Цикл				
			Движение = Движения.ЛБ_ОперацииПоСистемеЛояльности.Добавить();
			Движение.Период = Дата;
			Движение.Залогодатель = Запись.Залогодатель;
			Движение.КоличествоЗалогов = -Запись.КоличествоЗалогов; 
			Движение.СуммаЗаймов = -Запись.СуммаЗаймов;
		КонецЦикла;	 
		
		НаборЗаписей = РегистрыНакопления.ЛБ_РасчетыСКлиентами.СоздатьНаборЗаписей();
	    НаборЗаписей.Отбор.Регистратор.Установить(ЗалоговыйБилет);
	    НаборЗаписей.Прочитать(); 
		
		Движения.ЛБ_РасчетыСКлиентами.Записывать = Истина;
		Для каждого Запись Из НаборЗаписей Цикл				
			Движение = Движения.ЛБ_РасчетыСКлиентами.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Запись.Организация;
			Движение.ВидДвижения = Запись.ВидДвижения;
			Движение.ВидРасчета = Запись.ВидРасчета;
			Движение.ДатаНачалаРасчета = Запись.ДатаНачалаРасчета;	
			Движение.ЗалоговыйБилет = Запись.ЗалоговыйБилет; 
			Движение.Клиент = Запись.Клиент; 
			Движение.КоличествоДнейРасчета = Запись.КоличествоДнейРасчета;
			Движение.Комментарий = Запись.Комментарий;
			Движение.Сумма = -Запись.Сумма; 
		КонецЦикла;	   

        НаборЗаписей = РегистрыНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.СоздатьНаборЗаписей();
	    НаборЗаписей.Отбор.Регистратор.Установить(ЗалоговыйБилет);
	    НаборЗаписей.Прочитать(); 
		
		Движения.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Записывать = Истина;
		Для каждого Запись Из НаборЗаписей Цикл				
			Движение = Движения.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Добавить();
			Движение.Период = Дата;
			Движение.ВидДвижения = Запись.ВидДвижения;//?(Запись.ВидДвижения = ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход);
			Движение.ЗалоговыйБилет = Запись.ЗалоговыйБилет; 
			Движение.Клиент = Запись.Клиент; 
			Движение.ОбъектЗалога = Запись.ОбъектЗалога;
			Движение.Сумма = -Запись.Сумма; 
		КонецЦикла;	    
		
		НаборЗаписей = РегистрыНакопления.ЛБ_НачислениеПроцентовДетально.СоздатьНаборЗаписей();
	    НаборЗаписей.Отбор.Регистратор.Установить(ЗалоговыйБилет);
	    НаборЗаписей.Прочитать(); 
		
		Движения.ЛБ_НачислениеПроцентовДетально.Записывать = Истина;
		Для каждого Запись Из НаборЗаписей Цикл				
			Движение = Движения.ЛБ_НачислениеПроцентовДетально.Добавить();
			Движение.Период = Дата;
			Движение.ВидПроцентнойСтавки = Запись.ВидПроцентнойСтавки;
			Движение.ЗалоговыйБилет = Запись.ЗалоговыйБилет; 
			Движение.ДатаНачалаРасчета = Запись.ДатаНачалаРасчета;
			Движение.ДатаНач = Запись.ДатаНач; 
			Движение.ДатаКон = Запись.ДатаКон;
			Движение.ДеньНач = Запись.ДеньНач; 
			Движение.ДеньКон = Запись.ДеньКон;
			Движение.ОтклонениеАкцияАбсолютное = Запись.ОтклонениеАкцияАбсолютное; 
			Движение.ОтклонениеАкцияОтностельное = Запись.ОтклонениеАкцияОтностельное;
            Движение.ПроцентнаяСтавкаАкция = Запись.ПроцентнаяСтавкаАкция;
            Движение.ПроцентнаяСтавкаБазовая = Запись.ПроцентнаяСтавкаБазовая;
			Движение.СуммаПроцентов = -Запись.СуммаПроцентов;  
			Движение.СуммаПроцентовДень = Запись.СуммаПроцентовДень;
		КонецЦикла;	   
		
		НаборЗаписей = РегистрыНакопления.ЛБ_ОбъектыЗалога.СоздатьНаборЗаписей();
	    НаборЗаписей.Отбор.Регистратор.Установить(ЗалоговыйБилет);
	    НаборЗаписей.Прочитать(); 
		
		Движения.ЛБ_ОбъектыЗалога.Записывать = Истина;
		Для каждого Запись Из НаборЗаписей Цикл				
			Движение = Движения.ЛБ_ОбъектыЗалога.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Запись.Организация;
			Движение.ВидДвижения = Запись.ВидДвижения;
			Движение.ЗалоговыйБилет = Запись.ЗалоговыйБилет; 
			Движение.Ломбард = Запись.Ломбард;  
			Движение.Склад = Запись.Склад;
			Движение.ОбъектЗалога = Запись.ОбъектЗалога; 
			Движение.Количество = -Запись.Количество;
			Движение.СуммаОценки = -Запись.СуммаОценки; 
			//Движение.СуммаОценкиНачальная = -Запись.СуммаОценкиНачальная;
		КонецЦикла;	
		
		НаборЗаписей = РегистрыСведений.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.СоздатьНаборЗаписей();
	    НаборЗаписей.Отбор.Регистратор.Установить(ЗалоговыйБилет);
	    НаборЗаписей.Прочитать(); 

		Для каждого Запись Из НаборЗаписей Цикл  
			Движение = Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Запись.Организация; 
			Движение.ПодразделениеОсновное = Запись.ПодразделениеОсновное;
			Движение.СкладОсновной = Запись.СкладОсновной;
			Движение.ПодразделениеПолучатель = Запись.ПодразделениеПолучатель;
            Движение.СкладПолучатель = Запись.СкладПолучатель; 
			Движение.ПодразделениеОтправитель = Запись.ПодразделениеОтправитель;
			Движение.СкладОтправитель = Запись.СкладОтправитель;
			Движение.Количество = -Запись.Количество;    
			Движение.Ответственный = ЭтотОбъект.ОтветственныйСотрудник;  
			Движение.НомерЗБ =  Запись.НомерЗБ; 
		    Движение.ВидОперации = ?(НЕ Найти(Запись.ВидОперации, "выкуп") = 0, "Отмена переоформления (выкуп)", "Отмена переоформления (займ)");
		КонецЦикла;	    

        Движения.ЛБ_СостояниеОбъектаЗалога.Записывать = Истина; 
		Для каждого Стр Из ЭтотОбъект.ТоварыОтмена Цикл   
			СтруктураСостояниеОЗ = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектовЗалогаЗалоговогоБилета(ЭтотОбъект.Дата, Этотобъект.ПредыдущаяОперация, Стр.ОбъектЗалога);
			Если НЕ Стр.Статус = Перечисления.ЛБ_СтатусыОбъектовЗалога.Выкуплен Тогда
				Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить();
				Движение.Период = Дата; 			
			    Движение.ЗалоговыйБилет = ЭтотОбъект.ПредыдущаяОперация; 	
				Движение.ОбъектЗалога = Стр.ОбъектЗалога;
				Движение.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ОтказОтОформления;
				Движение.СуммаОценки = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОценки);
				Движение.СуммаЗайма = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаЗайма);
				Движение.СуммаОплаты = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОплаты); 
				Движение.СуммаОценкиНачальная = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОценкиНач);
				Движение.СуммаДолгаЗайма = 0;
		   КонецЕсли;		
				СтруктураСостояниеОЗ = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектовЗалогаЗалоговогоБилета(Этотобъект.ПредыдущаяОперация.Дата-1, Этотобъект.ПредыдущаяОперация.ПредыдущаяОперация, Стр.ОбъектЗалога);
				Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить();
				Движение.Период = Дата; 			
			    Движение.ЗалоговыйБилет = ЭтотОбъект.ПредыдущаяОперация.ПредыдущаяОперация; 	
				Движение.ОбъектЗалога = Стр.ОбъектЗалога;
				Движение.СтатусОбъектаЗалога = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СтатусОбъектаЗалога);
				Движение.СуммаОценки = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОценки);
				Движение.СуммаЗайма = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаЗайма);
				Движение.СуммаОплаты = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОплаты); 
				Движение.СуммаДолгаЗайма = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаДолгаЗайма); 
				Движение.СуммаОценкиНачальная = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОценкиНач);
		Конеццикла;
		
		Движения.ЛБ_СостояниеЗалоговогоБилета.Записывать = Истина;
		Движение = Движения.ЛБ_СостояниеЗалоговогоБилета.Добавить();
		Движение.Период = Дата; 
		Движение.Залогодатель = ЭтотОбъект.ПредыдущаяОперация.Залогодатель;
		Движение.ЗалоговыйБилет = ЭтотОбъект.ПредыдущаяОперация;
		Движение.НомерЗалоговогоБилета = ЭтотОбъект.ПредыдущаяОперация.НомерЗалоговогоБилета;
		Движение.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтказОтОформления;
		Движение.СхемаКредитования = ЭтотОбъект.ПредыдущаяОперация.СхемаКредитования;
		Движение.ПричинаПрименения = Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма;
		
		СтарыйЗБ = ЭтотОбъект.ПредыдущаяОперация.ПредыдущаяОперация;
		ЗапросС = Новый Запрос; 
		ЗапросС.УстановитьПараметр("ЗалоговыйБилет", СтарыйЗБ); 
		ЗапросС.УстановитьПараметр("Дата", ЭтотОбъект.ПредыдущаяОперация.Дата-1);
		ЗапросС.Текст = "ВЫБРАТЬ
		                |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.Залогодатель КАК Залогодатель,
		                |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
		                |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.НомерЗалоговогоБилета КАК НомерЗалоговогоБилета,
		                |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СхемаКредитования КАК СхемаКредитования,
		                |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПричинаПрименения КАК ПричинаПрименения,
		                |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета,
		                |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
		                |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.НомерДопСоглашения КАК НомерДопСоглашения,
		                |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаВыкупа КАК ДатаВыкупа,
		                |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаВыкупаЛьготныйСрок КАК ДатаВыкупаЛьготныйСрок,
		                |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаПроцентовДень КАК СуммаПроцентовДень,
		                |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаПроцентовСрок КАК СуммаПроцентовСрок,
		                |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПредельныйСрокЗайма КАК ПредельныйСрокЗайма,
		                |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПредельныйСрокЗаймаДни КАК ПредельныйСрокЗаймаДни,
		                |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаОстановкиНачислений КАК ДатаОстановкиНачислений,
		                |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаНачалаРасчетаПроцентов КАК ДатаНачалаРасчетаПроцентов
		                |ИЗ
		                |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&Дата, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних";
		ВыборкаС = Запросс.Выполнить().Выбрать();
		Если ВыборкаС.Следующий() Тогда
			Движение = Движения.ЛБ_СостояниеЗалоговогоБилета.Добавить();
		    Движение.Период = Дата;   
			Движение.ЗалоговыйБилет = ВыборкаС.ЗалоговыйБилет;
			Движение.Залогодатель = ВыборкаС.Залогодатель;
			Движение.НомерЗалоговогоБилета = ВыборкаС.НомерЗалоговогоБилета;  			
		    Движение.СтатусЗалоговогоБилета = ВыборкаС.СтатусЗалоговогоБилета; 
			Движение.СхемаКредитования = ВыборкаС.СхемаКредитования;
			Движение.ПричинаПрименения = ВыборкаС.ПричинаПрименения;
			Движение.ДатаНачалаРасчетаПроцентов = ВыборкаС.ДатаНачалаРасчетаПроцентов; 
			Движение.ДатаВыкупа = ВыборкаС.ДатаВыкупа;
			Движение.ДатаВыкупаЛьготныйСрок = ВыборкаС.ДатаВыкупаЛьготныйСрок;		
			Движение.НомерДопСоглашения = ВыборкаС.НомерДопСоглашения;
			Движение.СуммаЗайма = ВыборкаС.СуммаЗайма;  
			Движение.СуммаПроцентовДень = ВыборкаС.СуммаПроцентовДень;   
            Движение.СуммаПроцентовСрок = ВыборкаС.СуммаПроцентовСрок;
			Движение.ПредельныйСрокЗайма = ВыборкаС.ПредельныйСрокЗайма; 
			Движение.ПредельныйСрокЗаймаДни = ВыборкаС.ПредельныйСрокЗаймаДни;
			Движение.ДатаОстановкиНачислений = ВыборкаС.ДатаОстановкиНачислений;
		КонецЕсли;   
		
		НаборЗаписей = РегистрыНакопления.ЛБ_РасчетыСКлиентамиБУ.СоздатьНаборЗаписей();
	    НаборЗаписей.Отбор.Регистратор.Установить(ЗалоговыйБилет);
	    НаборЗаписей.Прочитать(); 
		
		Движения.ЛБ_РасчетыСКлиентамиБУ.Записывать = Истина;
		Для каждого Запись Из НаборЗаписей Цикл				
			Движение = Движения.ЛБ_РасчетыСКлиентамиБУ.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Запись.Организация;
			Движение.ВидДвижения = Запись.ВидДвижения;
			Движение.ВидРасчета = Запись.ВидРасчета;
			Движение.ЗалоговыйБилет = Запись.ЗалоговыйБилет; 
			Движение.Ломбард = Запись.Ломбард; 
			Движение.ОбъектЗалога = Запись.ОбъектЗалога; 
			Движение.Клиент = Запись.Клиент; //+Мельников 06.05.24 Не указывался клиент к регистре.
			Движение.Сумма = -Запись.Сумма; 
		КонецЦикла;	    
			
		ЗалоговыйБилетСтарый = ЭтотОбъект.ПредыдущаяОперация.ПредыдущаяОперация;
		КлиентСтарый = ЗалоговыйБилетСтарый.Залогодатель;
		ВосстановитьДоверенностиПоЗалоговомуБилету(КлиентСтарый, ЗалоговыйБилетСтарый);
		
		ВосстановитьИзделияВНакладнойНаОтгузку(ЭтотОбъект.ПредыдущаяОперация);

		//+МАН 17.06.25 Запись отмены операции в регистр
		Движения.ЛБ_ОтменыОперацийЗБ.Записывать = Истина;
		Движение = Движения.ЛБ_ОтменыОперацийЗБ.Добавить();
		Движение.Период = Дата;
		Движение.ОтмененныйДокумент = ЭтотОбъект.ОтмененныйДокумент;
		Движение.ВидОперации = ЭтотОбъект.ОтмененныйДокумент.ВидОперации;
		Движение.НомерЗалоговогоБилета = ЭтотОбъект.НомерЗалоговогоБилета;
		//-МАН

		//+МАН 09.12.25 Восстановление доверенности после отмены операции
		ВосстановитьДоверенностиПоЗалоговомуБилетуПослеОтменыОперации(ЭтотОбъект.ПредыдущаяОперация.Залогодатель, ЭтотОбъект.ПредыдущаяОперация)
		//-МАН
		
	ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов Тогда
		СтруктураРез = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗалоговогоБилета(ЭтотОбъект, ПредыдущаяОперация); 
		СтруктураОкр = ЛБ_УправлениеЛомбардом.ПолучитьУсловияОкругленияПроцентов(ПредыдущаяОперация); 
		ДатаНачалаРасчетаНач = СтруктураРез.ДатаНачалаРасчета; 
		СуммаЗаймаНач = СтруктураРез.СуммаЗайма;  
		СтатусЗалоговогоБилетаНач = СтруктураРез.СтатусЗалоговогоБилета; 
		ПричинаПримененияНач = СтруктураРез.ПричинаПрименения; 
		НомерДопСоглашения = СтруктураРез.НомерДопСоглашения;
		НаОХ = Ложь;
		Если ЭтотОбъект.БезналичнаяОплата И 
			 (НачалоДня(ЭтотОбъект.Дата) = НачалоДня(ЭтотОбъект.ПредыдущаяОперация.Дата)) Тогда
			РезультатПроверки = ЛБ_ОбщийМодуль.ПроверитьРасчетыПоЗалоговомуБилету(Дата, ЭтотОбъект.ПредыдущаяОперация, Истина); 
			Если (РезультатПроверки.ОстатокПроценты + РезультатПроверки.ОстатокЗайм) > ЭтотОбъект.СуммаПлатежа И
			     ЭтотОбъект.СуммаПлатежа >= РезультатПроверки.ОстатокЗайм Тогда
				НаОХ = Истина;
				БезПродленияДоговора = Истина;
			КонецЕсли;	
		КонецЕсли;
		Если НЕ НаОХ Тогда
			Если СтатусЗалоговогоБилетаНач = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят ИЛИ 
				 СтатусЗалоговогоБилетаНач = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен ИЛИ
				 СтатусЗалоговогоБилетаНач = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Остановлен ИЛИ 
				 СтатусЗалоговогоБилетаНач = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Наследство тогда  
				БезПродленияДоговора = Истина;
			Иначе	
			    БезПродленияДоговора = ЭтотОбъект.СхемаКредитования.БезПродленияДоговора;
			КонецЕсли;
		КонецЕсли;	
			
		Если ЭтотОбъект.НачислениеПроцентовДетально.Количество() = 0 Тогда 
			СуммаПроцентовНачислено = 0;  
			//мСуммаПроцентовДень = 0;  
			//ПроцентнаяСхема = 0;
		Иначе	
			СуммаПроцентовНачислено = ЭтотОбъект.НачислениеПроцентовДетально.Итог("СуммаПроцентов");
			//СтрН = ЭтотОбъект.НачислениеПроцентовДетально.Получить(0); 
			//мСуммаПроцентовДень = СтрН.СуммаПроцентовДень; 
			//ПроцентнаяСхема = СтрН.ПроцентнаяСтавкаБазовая; 
			//Если СтрН.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Акционная Тогда
			//	Если НЕ СтрН.ПроцентнаяСтавкаАкция = 0 Тогда
			//		ПроцентнаяСхема = СтрН.ПроцентнаяСтавкаАкция;
			//	ИначеЕсли НЕ СтрН.ОтклонениеАкцияОтносительное = 0 Тогда	 
			//		ПроцентнаяСхема = СтрН.ПроцентнаяСтавкаБазовая + СтрН.ПроцентнаяСтавкаБазовая*СтрН.ОтклонениеАкцияОтносительное/100;
			//	ИначеЕсли НЕ СтрН.ОтклонениеАкцияАбсолютное = 0 Тогда
			//		ПроцентнаяСхема = СтрН.ПроцентнаяСтавкаБазовая + СтрН.ОтклонениеАкцияАбсолютное;
			//    КонецЕсли; 
			//КонецЕсли;
		КонецЕсли;
		ПроцентнаяСхема = ЛБ_ОбщийМодуль.ПолучитьПроцентнуюСхемуЗБ(ЭтотОбъект.ПредыдущаяОперация, ПричинаПримененияНач);
		мСуммаПроцентовДень = СуммаЗаймаНач*ПроцентнаяСхема/100;
		
		Если НЕ БезПродленияДоговора Тогда
			Если ЭтотОбъект.Выкуп Тогда
                ПродлитьДоговорДни = 0;				
			Иначе	       
				//Если мСуммаПроцентовДень = 0 Тогда
				//	ПродлитьДоговорДни = 0;
				//Иначе	                 
					СуммаПроцентовДеньРасчет = СуммаЗаймаНач*ПроцентнаяСхема/100; 
					ОстатокПроцентовНаНачалоРасчета = ЛБ_ОбщийМодуль.ПолучитьОстатокПроцентовНаДату(ДатаНачалаРасчетаНач, ЭтотОбъект.ПредыдущаяОперация);
					СуммаПроцентовНачисления = ЛБ_ОбщийМодуль.ПолучитьНачисленияПроцентов(ЭтотОбъект.Ссылка, ЭтотОбъект.ПредыдущаяОперация, ДатаНачалаРасчетаНач);
					//СуммаПроцентовНачислено = СуммаПроцентовНачислено + ОстатокПроцентовНаНачалоРасчета; 
					СуммаПроцентовНачисления = СуммаПроцентовНачисления + ОстатокПроцентовНаНачалоРасчета;
					
					ДолгПоПроцентам = ЛБ_ОбщийМодуль.ПолучитьОстатокПроцентов(ЭтотОбъект.Ссылка, ЭтотОбъект.ПредыдущаяОперация);				
					СуммаНачисленияДок = ЭтотОбъект.НачислениеПроцентовДетально.Итог("СуммаПроцентов") + ДолгПоПроцентам; 
					СуммаОплатыДляПродленияДоговора = окр(СуммаНачисленияДок*90/100, 2);
					ПроцентДляПродленияДоговора = ?(СуммаНачисленияДок = 0, 0, ЭтотОбъект.СуммаОплатыПроценты/СуммаНачисленияДок);
					Если ЭтотОбъект.СуммаОплатыПроценты >= СуммаОплатыДляПродленияДоговора Тогда
						Если ПроцентДляПродленияДоговора = 1 Тогда 							
							Если СуммаПроцентовНачисления = 0 Тогда
								СуммаПроцентовНачисления = СуммаПроцентовНачисления + СуммаНачисленияДок;
							Иначе	
							    СуммаПроцентовНачисления = СуммаПроцентовНачисления + СуммаНачисленияДок - ДолгПоПроцентам;  
							КонецЕсли;	
							Коэфф = СуммаПроцентовНачисления/СуммаПроцентовДеньРасчет;  
						    ПродлитьДоговорДни = Цел(Коэфф) + ?(Коэфф = Цел(Коэфф), 0, 1);
						Иначе	                 
							СуммаПроцентовНачисления = СуммаПроцентовНачисления + СуммаПроцентовНачислено;
							Коэфф = СуммаПроцентовНачисления/СуммаПроцентовДеньРасчет;  
							ПродлитьДоговорДни = Цел(Коэфф) + ?(Коэфф = Цел(Коэфф), 0, 1);
							
							СуммаПроцентовДолг = СуммаНачисленияДок - СуммаОплатыПроценты;
							Коэфф = СуммаПроцентовДолг/СуммаПроцентовДеньРасчет;  
							КорректировкаПоДолгу = Цел(Коэфф) + ?(Коэфф = Цел(Коэфф), 0, 1);  
							
							ПродлитьДоговорДни = ПродлитьДоговорДни - КорректировкаПоДолгу;  
						КонецЕсли;	
		          	Иначе      
						ПродлитьДоговорДни = 0;
					КонецЕсли;  
                //КонецЕсли;
			КонецЕсли;	
		Иначе
			ПродлитьДоговорДни = 0;
		КонецЕсли;	 
		
		Если ПродлитьДоговорДни = 0 Тогда 
			ДатаНачалаРасчетаПроцентов = ДатаНачалаРасчетаНач;
		Иначе	
		    ДатаНачалаРасчетаПроцентов = НачалоДня(Дата) + (60 * 60 * 24) + 1;  
		КонецЕсли;	
	
		Движения.ЛБ_ОборотыПоОперациямЗайма.Записывать = Истина;
		Движение = Движения.ЛБ_ОборотыПоОперациямЗайма.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Ломбард = Ломбард;
		Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация; 
		Движение.Залогодатель = ЭтотОбъект.ПредыдущаяОперация.Залогодатель;
		Движение.ВидОперации = ЭтотОбъект.ВидОперации;  
		Движение.СуммаСсуды = СуммаЗаймаНач - ЭтотОбъект.СуммаОплатыСсуда;
		Движение.СуммаОплатыЗайм = ЭтотОбъект.СуммаОплатыСсуда;
		Движение.СуммаОплатыПроценты = ЭтотОбъект.СуммаОплатыПроценты;   
		Если СтатусЗалоговогоБилетаНач = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ВключенВНакладную ИЛИ
	         СтатусЗалоговогоБилетаНач = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОбъявленТорг Тогда
			 Если НЕ ЭтотОбъект.Выкуп И ПродлитьДоговорДни = 0 Тогда
				 НакладнаяНаОтгрузку = ЛБ_УправлениеЛомбардом.ПолучитьНакладнуюНаОтгрузкуЗалогоговогоБилета(Дата, ЭтотОбъект.ПредыдущаяОперация);
				 Если НЕ НакладнаяНаОтгрузку = неопределено Тогда
				     Движение.НакладнаяНаОтгрузку = НакладнаяНаОтгрузку;
				 КонецЕсли;	 
		    КонецЕсли;	
		КонецЕсли;
		Если ЭтотОбъект.БезналичнаяОплата Тогда 
			Движение.РеестрПлатежей = ЭтотОбъект.РеестрПлатежей; 
			Если ЗначениеЗаполнено(ЭтотОбъект.РеестрПлатежей) Тогда 
				Если ЭтотОбъект.РеестрПлатежей = Перечисления.ЛБ_ВидыБезналичныхПлатежей.РасчетыйСчет Тогда 
			        Движение.Комментарий = "п/п № " + СокрЛП(ЭтотОбъект.ИдентификаторПлатежа) + " от " + Формат(ЭтотОбъект.ДатаПлатежа, "ДФ=dd.MM.yyyy") + "/" + СокрЛП(ЭтотОбъект.РеестрПлатежей.ИмяФайла);  
				Иначе	
					Движение.Комментарий = СокрЛП(ЭтотОбъект.ИдентификаторПлатежа) + " от " + Формат(ЭтотОбъект.ДатаПлатежа, "ДФ=dd.MM.yyyy") + "/" + СокрЛП(ЭтотОбъект.РеестрПлатежей.ИмяФайла);
				КонецЕсли;
				СуммаОплаты = ЭтотОбъект.СуммаОплатыПроценты + ЭтотОбъект.СуммаОплатыСсуда;
				Если ЭтотОбъект.СуммаПлатежа > СуммаОплаты Тогда  
					Переплата = ЭтотОбъект.СуммаПлатежа - СуммаОплаты;
				Иначе
					Переплата = 0;
				КонецЕсли;
				Если НЕ Переплата = 0 Тогда
					СтрокаПереплата = "Переплата " + СокрЛП(Формат(Переплата, "ЧЦ=15; ЧДЦ=2")) + " руб.; "; 
					Движение.Комментарий = СтрокаПереплата + Движение.Комментарий; 
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
		
		//Движения.ЛБ_ОперацииПоСистемеЛояльности.Записывать = Истина;
		//Движение = Движения.ЛБ_ОперацииПоСистемеЛояльности.Добавить();
		//Движение.Период = Дата;
		//Движение.Залогодатель = ЭтотОбъект.ПредыдущаяОперация.Залогодатель;
		//Движение.СуммаЗаймов = ЭтотОбъект.СуммаОплатыСсуда;
		//Движение.СуммаОплаченныхПроцентов = ЭтотОбъект.СуммаОплатыПроценты;
		//Если ЭтотОбъект.Выкуп Тогда      
		//	КоличествоВыкуплено = 0;
		//	Для каждого СтрТ Из ЭтотОбъект.Товары Цикл 
		//		СтатусОЗ = ЛБ_УправлениеЛомбардом.ПолучитьСтатусОбъектаЗалога(Дата, ЭтотОбъект.ПредыдущаяОперация, СтрТ.ОбъектЗалога); 
		//		Если НЕ СтатусОЗ = Перечисления.ЛБ_СтатусыОбъектовЗалога.Реализован Тогда
		//			КоличествоВыкуплено = КоличествоВыкуплено + 1;
		//		КонецЕсли;	
		//	КонецЦикла;	
		//	Движение.КоличествоВыкупов = КоличествоВыкуплено;
		//	Движение.СуммаВыкупов = ЭтотОбъект.СуммаСсуды;
		//КонецЕсли;	
		
		Если НЕ (ЭтотОбъект.СуммаОплатыПроценты +  ЭтотОбъект.СуммаОплатыСсуда) = 0  Тогда
			Движения.ЛБ_ДвиженияДенежныхСредств.Записывать = Истина;
			Движение = Движения.ЛБ_ДвиженияДенежныхСредств.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Ломбард = Ломбард;    
			Движение.ВидДвиженияДС = Перечисления.ЛБ_ВидыДвиженияДС.Приход;	
			Если ЭтотОбъект.БезналичнаяОплата Тогда 
				Движение.ВидДенежныхСредств = Перечисления.ЛБ_ВидыДенежныхСредств.Безналичные; 
			Иначе	
			    Движение.ВидДенежныхСредств = Перечисления.ЛБ_ВидыДенежныхСредств.Наличные;  
				Движение.КассоваяСмена = КассоваяСмена;
				Если ЗначениеЗаполнено(КассоваяСмена) Тогда  
					Если НЕ ЗначениеЗаполнено(СводныйПКО) Тогда  
						СводныйПКО = ЛБ_ОбщийМодуль.СоздатьСводныйПКО(КассоваяСмена.Дата, Организация, Ломбард); 				
						ПроводитьПоКассовойСмене = Истина;
					КонецЕсли;
					Движение.КассоваяОперация = СводныйПКО;  
					Движение.Номер = СводныйПКО.ПредставлениеНомераПКО;
				КонецЕсли;
			КонецЕсли;	
			Движение.Сумма = ЭтотОбъект.СуммаОплатыПроценты + ЭтотОбъект.СуммаОплатыСсуда;
			Движение.Контрагент = ЭтотОбъект.Залогодатель;  
			Движение.ФизическоеЛицо = ЭтотОбъект.Залогодатель;
	        Движение.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ОплатаПоЗайму;
			НомерДС = ?(ПродлитьДоговорДни = 0, ?(НЕ БезПродленияДоговора И НЕ ЭтотОбъект.СуммаОплатыСсуда = 0, НомерДопСоглашения+1, НомерДопСоглашения), НомерДопСоглашения+1);
			Если НомерДС = 0 Тогда
			    Движение.ДополнительнаяИнформация = "Залоговый билет № " + СокрЛП(ЭтотОбъект.ПредыдущаяОперация.НомерЗалоговогоБилета) + " от " + Формат(ЭтотОбъект.ПредыдущаяОперация.Дата, "ДФ=dd.MM.yyyy"); 
			Иначе                    
				Движение.ДополнительнаяИнформация = "Дополнительное соглашение № " + Строка(НомерДС) + " к договору займа № " + СокрЛП(ЭтотОбъект.ПредыдущаяОперация.НомерЗалоговогоБилета) + " от " + Формат(ЭтотОбъект.ПредыдущаяОперация.Дата, "ДФ=dd.MM.yyyy");
			КонецЕсли;	      
			Если НЕ ЭтотОбъект.БезналичнаяОплата Тогда
				ОснованиеП = "";    
				Если НЕ ЭтотОбъект.СуммаОплатыПроценты = 0 Тогда
					ОснованиеП = ОснованиеП + "Оплата процентов в сумме " + СокрЛП(Формат(ЭтотОбъект.СуммаОплатыПроценты, "ЧЦ=15; ЧДЦ=2"));
				КонецЕсли;	   
				Если НЕ ЭтотОбъект.СуммаОплатыСсуда = 0 Тогда
					ОснованиеП = ОснованиеП + ?(ПустаяСтрока(ОснованиеП), "Возврат займа в сумме ", ", возврат займа в сумме ") + СокрЛП(Формат(ЭтотОбъект.СуммаОплатыСсуда, "ЧЦ=15; ЧДЦ=2"));
				КонецЕсли;
				Движение.Основание = ОснованиеП + 
				                     " по договору займа (ЗБ № " + СокрЛП(ЭтотОбъект.ПредыдущаяОперация.НомерЗалоговогоБилета) + " " + ФИОКлиента(ЭтотОбъект.ПредыдущаяОперация.Залогодатель, ЭтотОбъект.ПредыдущаяОперация.Дата) + ")";
			
				Движение.ФИО = ФИОКлиента(Залогодатель, Дата); 
			    Движение.ДУЛ = ДокументКлиентаВСтроку(ДокументЗалогодателя);
				Результат = ЛБ_ОбщийМодуль.ЗаполнитьДтКт(Движение.ВидОперации);
			    Движение.Дт = Результат.Дт;
			    Движение.Кт = Результат.Кт;
			КонецЕсли;	
		КонецЕсли;	
		
		Если НЕ ЭтотОбъект.СуммаОплаты = 0 Тогда
			Движения.ЛБ_ДенежныеСредства.Записывать = Истина;
			Движение = Движения.ЛБ_ДенежныеСредства.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Ломбард = Ломбард;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход; 
			Если ЭтотОбъект.БезналичнаяОплата Тогда 
				Движение.ВидДенежныхСредств = Перечисления.ЛБ_ВидыДенежныхСредств.Безналичные;
			Иначе	
			    Движение.ВидДенежныхСредств = Перечисления.ЛБ_ВидыДенежныхСредств.Наличные;
			КонецЕсли;	 
			Движение.Сумма = ЭтотОбъект.СуммаОплаты; 
		КонецЕсли;	
		
		СуммаНачисленоБУ = 0;  
		Движения.ЛБ_РасчетыСКлиентамиБУ.Записывать = Истина;

		ЗапросРасчеты = Новый Запрос;  
		ЗапросРасчеты.УстановитьПараметр("ЗалоговыйБилет", ЭтотОбъект.ПредыдущаяОперация);
		ЗапросРасчеты.УстановитьПараметр("Организация", ЭтотОбъект.ПредыдущаяОперация.Организация); 
		ЗапросРасчеты.УстановитьПараметр("ДатаНачалаРасчета", ДатаНачалаРасчетаНач); 
		ЗапросРасчеты.УстановитьПараметр("Дата", Этотобъект.Дата); 
		ЗапросРасчеты.Текст = "ВЫБРАТЬ
		                      |	ЛБ_РасчетыСКлиентамиБУ.Регистратор КАК Регистратор,
		                      |	ЛБ_РасчетыСКлиентамиБУ.ЗалоговыйБилет КАК ЗалоговыйБилет,
		                      |	ЛБ_РасчетыСКлиентамиБУ.Сумма КАК Сумма
		                      |ИЗ
		                      |	РегистрНакопления.ЛБ_РасчетыСКлиентамиБУ КАК ЛБ_РасчетыСКлиентамиБУ
		                      |ГДЕ
		                      |	ЛБ_РасчетыСКлиентамиБУ.ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыРасчетов.ПоПроцентам)
		                      |	И ЛБ_РасчетыСКлиентамиБУ.ЗалоговыйБилет = &ЗалоговыйБилет
		                      |	И ЛБ_РасчетыСКлиентамиБУ.Организация = &Организация
		                      |	И ЛБ_РасчетыСКлиентамиБУ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		                      |	И ЛБ_РасчетыСКлиентамиБУ.ДатаНачалаРасчета = &ДатаНачалаРасчета
		                      |	И ЛБ_РасчетыСКлиентамиБУ.Период < &Дата
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	ЛБ_РасчетыСКлиентамиБУ.Период УБЫВ";
		ВыборкаБУ = ЗапросРасчеты.Выполнить().Выбрать(); 
		СуммаОтмены = 0;
		Пока ВыборкаБУ.Следующий() Цикл 
			Если НЕ ТипЗнч(ВыборкаБУ.Регистратор) = Тип("ДокументСсылка.ЛБ_РегламентноеНачислениеПроцентов") Тогда
				Если ВыборкаБУ.Сумма < 0 Тогда //отмена 
					СуммаОтмены = ВыборкаБУ.Сумма;
					Продолжить;
				ИначеЕсли (ВыборкаБУ.Сумма + СуммаОтмены) = 0 Тогда 
					СуммаОтмены = 0;
					Продолжить;
				Иначе	
				    Прервать;
				КонецЕсли;	
			КонецЕсли;	
			СуммаНачисленоБУ = СуммаНачисленоБУ + ВыборкаБУ.Сумма;
		КонецЦикла;	 
		СуммаПроцентовНачисленоБУ = СуммаПроцентовНачислено - СуммаНачисленоБУ;
		Если НЕ СуммаПроцентовНачисленоБУ = 0 Тогда 
			Движение = Движения.ЛБ_РасчетыСКлиентамиБУ.Добавить();
			Движение.Период = Дата;     
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Организация = ЭтотОбъект.ПредыдущаяОперация.Организация; 
			Движение.Ломбард = ЭтотОбъект.ПредыдущаяОперация.Ломбард;
			Движение.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам;
			Движение.Клиент = ЭтотОбъект.ПредыдущаяОперация.Залогодатель;
			Движение.ЗалоговыйБилет = ЭтотОбъект.ПредыдущаяОперация;				
			Движение.ДатаНачалаРасчета = ДатаНачалаРасчетаНач;		
			Движение.Сумма = СуммаПроцентовНачисленоБУ;     
		КонецЕсли;	

		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ЗалоговыйБилет", Этотобъект.ПредыдущаяОперация);
		Запрос.УстановитьПараметр("Дата", Этотобъект.МоментВремени());
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_РасчетыСКлиентамиОстатки.ДатаНачалаРасчета КАК ДатаНачалаРасчета,
		               |	СУММА(ЛБ_РасчетыСКлиентамиОстатки.СуммаОстаток) КАК Сумма
		               |ИЗ
		               |	РегистрНакопления.ЛБ_РасчетыСКлиентами.Остатки(
		               |			&Дата,
		               |			ЗалоговыйБилет = &ЗалоговыйБилет
		               |				И ВидРасчета = &ВидРасчета) КАК ЛБ_РасчетыСКлиентамиОстатки
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЛБ_РасчетыСКлиентамиОстатки.ДатаНачалаРасчета";
		
		Если НЕ ЭтотОбъект.СуммаОплатыПроценты = 0 Тогда
			Запрос.УстановитьПараметр("ВидРасчета", Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам);
			ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
			СуммаОплатить = ЭтотОбъект.СуммаОплатыПроценты;
			Для каждого Стр Из ТаблицаОстатков Цикл
				Если стр.Сумма = 0 Тогда
					Продолжить;
				КонецЕсли;
				Если СуммаОплатить = 0 Тогда
					Прервать;
				КонецЕсли;
				
				Движения.ЛБ_РасчетыСКлиентами.Записывать = Истина;
				Движение = Движения.ЛБ_РасчетыСКлиентами.Добавить();
				Движение.Период = Дата;
				Движение.Организация = Организация;
				Движение.ДатаНачалаРасчета = Стр.ДатаНачалаРасчета;
				Движение.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам;
				Движение.Клиент = ЭтотОбъект.ПредыдущаяОперация.Залогодатель;
				Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация;
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Если Стр.Сумма < СуммаОплатить Тогда
				    Движение.Сумма = Стр.Сумма;
					СуммаОплатить = СуммаОплатить - Стр.Сумма;
				Иначе
					Движение.Сумма = СуммаОплатить;
					СуммаОплатить = 0;
				КонецЕсли; 
				Движение.Комментарий = "Оплачены проценты за период с " + Формат(Стр.ДатаНачалаРасчета, "ДФ=dd.MM.yyyy") + " по " + Формат(ДатаНачалаРасчетаНач, "ДФ=dd.MM.yyyy");
				//Движение.КоличествоДнейРасчета = ?(НачалоДня(Стр.ДатаНачалаРасчета) = НачалоДня(ДатаНачалаРасчетаНач), 1, (НачалоДня(Стр.ДатаНачалаРасчета)-НачалоДня(ДатаНачалаРасчетаНач)) / (60 * 60 * 24));  
			КонецЦикла;	
			
			Движение = Движения.ЛБ_РасчетыСКлиентамиБУ.Добавить();
			Движение.Период = Дата;     
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Организация = ЭтотОбъект.ПредыдущаяОперация.Организация; 
			Движение.Ломбард = ЭтотОбъект.ПредыдущаяОперация.Ломбард;
			Движение.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам;
			Движение.Клиент = ЭтотОбъект.ПредыдущаяОперация.Залогодатель;
			Движение.ЗалоговыйБилет = ЭтотОбъект.ПредыдущаяОперация;				
			Движение.ДатаНачалаРасчета = ДатаНачалаРасчетаНач;		
			Движение.Сумма = ЭтотОбъект.СуммаОплатыПроценты;   
			
			КоличествоДнейРасчета = ?(НачалоДня(ДатаНачалаРасчетаНач) = НачалоДня(Дата), 0, (НачалоДня(Дата) - НачалоДня(ДатаНачалаРасчетаНач)) / (60 * 60 * 24)) + 1;  
			Если НЕ СуммаПроцентовНачислено = 0 Тогда 							
				Движения.ЛБ_РасчетыСКлиентами.Записывать = Истина;
				Движение = Движения.ЛБ_РасчетыСКлиентами.Добавить();
				Движение.Период = Дата;
				Движение.Организация = Организация;
				Движение.ДатаНачалаРасчета = ДатаНачалаРасчетаНач;
				Движение.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам;
				Движение.Клиент = ЭтотОбъект.ПредыдущаяОперация.Залогодатель;
				Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация;
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Сумма = СуммаПроцентовНачислено; 
				Движение.Комментарий = "Начисленены проценты за период с " + Формат(ДатаНачалаРасчетаНач, "ДФ=dd.MM.yyyy") + " по " + Формат(Дата, "ДФ=dd.MM.yyyy"); 
				Движение.КоличествоДнейРасчета = КоличествоДнейРасчета;
            КонецЕсли;

			Если НЕ СуммаОплатить = 0 Тогда 
				Движения.ЛБ_РасчетыСКлиентами.Записывать = Истина;
				Движение = Движения.ЛБ_РасчетыСКлиентами.Добавить();
				Движение.Период = Дата;
				Движение.Организация = Организация;
				Движение.ДатаНачалаРасчета = ДатаНачалаРасчетаНач;
				Движение.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам;
				Движение.Клиент = ЭтотОбъект.ПредыдущаяОперация.Залогодатель;
				Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация;
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Сумма = СуммаОплатить; 
				Движение.Комментарий = "Оплачены проценты за период с " + Формат(ДатаНачалаРасчетаНач, "ДФ=dd.MM.yyyy") + " по " + Формат(Дата, "ДФ=dd.MM.yyyy");
				Движение.КоличествоДнейРасчета = КоличествоДнейРасчета;
			КонецЕсли;	
		КонецЕсли;
		
		Если НЕ ЭтотОбъект.СуммаОплатыСсуда = 0 Тогда
			Движения.ЛБ_РасчетыСКлиентами.Записывать = Истина;
			Движение = Движения.ЛБ_РасчетыСКлиентами.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.ДатаНачалаРасчета = Этотобъект.ПредыдущаяОперация.Дата;
			Движение.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоОсновномуДолгу;
			Движение.Клиент = ЭтотОбъект.ПредыдущаяОперация.Залогодатель;
			Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Сумма = ЭтотОбъект.СуммаОплатыСсуда;
		КонецЕсли;	
		
		Если ЭтотОбъект.Выкуп Тогда 
			
		    Запрос = новый Запрос;   
			Запрос.УстановитьПараметр("ЗалоговыйБилет", ЭтотОбъект.ПредыдущаяОперация);
			Запрос.УстановитьПараметр("Ломбард", ЭтотОбъект.Ломбард);
		    Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);	  
			Запрос.УстановитьПараметр("Склад", СкладЛомбарда);
			Запрос.Текст = "ВЫБРАТЬ
			               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
			               |	ЛБ_ОбъектыЗалогаОстатки.Ломбард КАК Ломбард,
			               |	СУММА(ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток) КАК Количество,
			               |	СУММА(ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток) КАК СуммаОценки, 
						   |	СУММА(ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток) КАК СуммаОценкиНач
			               //|	СУММА(ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиНачальнаяОстаток) КАК СуммаОценкиНач
			               |ИЗ
			               |	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(
			               |			&Дата,
			               |			ЗалоговыйБилет = &ЗалоговыйБилет
			               |				И Склад = &Склад) КАК ЛБ_ОбъектыЗалогаОстатки
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога,
			               |	ЛБ_ОбъектыЗалогаОстатки.Ломбард";
		    ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
			
			ЕстьНеВыкупленные = ложь;
		    Движения.ЛБ_ОбъектыЗалога.Записывать = Истина;
			Движения.ЛБ_СостояниеОбъектаЗалога.Записывать = Истина;
			Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Записывать = Истина; 
			КоличествоВыкупов = 0;
			СуммаВыкупов = 0;
			Для каждого СтрТовары Из ЭтотОбъект.Товары цикл   
				Отбор = Новый структура;
				Отбор.Вставить("ОбъектЗалога", СтрТовары.ОбъектЗалога);
				
				СтруктураСостояниеОЗ = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектовЗалогаЗалоговогоБилета(ЭтотОбъект.Дата, ЭтотОбъект.ПредыдущаяОперация, СтрТовары.ОбъектЗалога); 
				Если СтруктураСостояниеОЗ.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.Реализован Тогда
					Продолжить;
				КонецЕсли;	
				СтрокиВыдача  = ЭтотОбъект.ТоварыВыкупленные.НайтиСтроки(Отбор); 
				Если СтрокиВыдача.Количество() = 0 Тогда  
					ЕстьНеВыкупленные = Истина;
					Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить();
					Движение.Период = Дата;
					Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация;
					Движение.ОбъектЗалога = СтрТовары.ОбъектЗалога;  
					Если СтатусЗалоговогоБилетаНач = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Отгружен Тогда                                                                                                                                           
						Движение.СтатусОбъектаЗалога = ?(СтатусЗалоговогоБилетаНач = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Наследство, Перечисления.ЛБ_СтатусыОбъектовЗалога.Наследство, Перечисления.ЛБ_СтатусыОбъектовЗалога.ГотовКОтправкеОХ);
					Иначе	
					    Движение.СтатусОбъектаЗалога = ?(СтатусЗалоговогоБилетаНач = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Наследство, Перечисления.ЛБ_СтатусыОбъектовЗалога.Наследство, Перечисления.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение);
					КонецЕсли;	
					Движение.СуммаОценки = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОценки);
					Движение.СуммаОценкиНачальная = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОценкиНач);
					Движение.СуммаЗайма = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаЗайма);
					Движение.СуммаОплаты = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаЗайма); 
					СуммаВыкупов = СуммаВыкупов + Движение.СуммаОценкиНачальная;
				Иначе     
					Стр = СтрокиВыдача.Получить(0);
					Отбор.Вставить("Ломбард", ЭтотОбъект.Ломбард);
					Строки = ТаблицаОстатков.НайтиСтроки(Отбор);
					Если Строки.Количество() = 0 Тогда
						Если НЕ ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектаЗалога(Дата, Стр.ОбъектЗалога, ЭтотОбъект.ПредыдущаяОперация) = Перечисления.ЛБ_СтатусыОбъектовЗалога.Изъят Тогда
							ЕстьНеВыкупленные = Истина; 
						    ОбщегоНазначения.СообщитьПользователю("Объект залога " + СокрЛП(Стр.ОбъектЗалога) + " в ломбарде " + СокрЛП(ЭтотОбъект.Ломбард) + " не найден!");
							Продолжить;
						Иначе	
							Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить();
							Движение.Период = Дата;
							Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация;
							Движение.ОбъектЗалога = Стр.ОбъектЗалога;
							Движение.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.Изъят;	 
							Движение.СуммаОценки = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОценки); 
							Движение.СуммаОценкиНачальная = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОценкиНач);
							Движение.СуммаЗайма = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаЗайма);
							Движение.СуммаОплаты = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаЗайма); 
						КонецЕсли;	
					Иначе	
					    СтрОст = Строки.Получить(0);   
						КоличествоВыкупов = КоличествоВыкупов + 1;
						Движение = Движения.ЛБ_ОбъектыЗалога.Добавить();
						Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
						Движение.Период = Дата;
						Движение.Организация = Организация;
						Движение.Ломбард = Ломбард;  
						Движение.Склад = СкладЛомбарда;
						Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация;
						Движение.ОбъектЗалога = Стр.ОбъектЗалога;
						Движение.Количество = СтрОст.Количество;
						Движение.СуммаОценки = СтрОст.СуммаОценки;  
						//Движение.СуммаОценкиНачальная = СтрОст.СуммаОценкиНач; 
								
						Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить();
						Движение.Период = Дата;
						Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация;
						Движение.ОбъектЗалога = Стр.ОбъектЗалога;
						Движение.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.Выкуплен;	 
						Движение.СуммаОценки = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОценки); 
						Движение.СуммаОценкиНачальная = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОценкиНач);
						Движение.СуммаЗайма = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаЗайма);
						Движение.СуммаОплаты = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаЗайма); 
						СуммаВыкупов = СуммаВыкупов + Движение.СуммаОценкиНачальная;
					КонецЕсли;	
				КонецЕсли;	 
			КонецЦикла;   
			Если НЕ КоличествоВыкупов = 0 Тогда		
				Движение = Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Добавить(); 
				Движение.Период = Дата;
				Движение.Организация = Организация; 
				Движение.ПодразделениеОсновное = ЭтотОбъект.ПредыдущаяОперация.Ломбард; 
				Движение.СкладОсновной = СкладЛомбарда;
				Движение.ПодразделениеОтправитель = ЭтотОбъект.ПредыдущаяОперация.Ломбард;
	            Движение.СкладОтправитель = СкладЛомбарда; 
				Движение.Количество = КоличествоВыкупов;    
				Движение.Ответственный = ЭтотОбъект.ОтветственныйСотрудник;
				Движение.НомерЗБ =  ЭтотОбъект.ПредыдущаяОперация.НомерЗалоговогоБилета; 
		        Движение.ВидОперации = "Выкуп залогового билета";  
			КонецЕсли;
			
			Если НЕ ЕстьНеВыкупленные ИЛИ СтатусЗалоговогоБилетаНач = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Отгружен Тогда
			    ЗакрытьДоверенностиПоЗалоговомуБилету(ЭтотОбъект.ПредыдущаяОперация.Залогодатель, ЭтотОбъект.ПредыдущаяОперация); 
			КонецЕсли;
			
			//Движения.ЛБ_СостояниеОбъектаЗалога.Записывать = Истина;
			//Для каждого Стр Из ЭтотОбъект.Товары цикл
			//    Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить();
			//	Движение.Период = Дата;
			//	Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация;
			//	Движение.ОбъектЗалога = Стр.ОбъектЗалога;
			//	Движение.СтатусОбъектаЗалога = ?(ЭтотОбъект.ВыдачаЗалога, Перечисления.ЛБ_СтатусыОбъектовЗалога.Выкуплен, Перечисления.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение);
			//	Движение.СуммаОценки = Стр.СуммаОценки;			
			//КонецЦикла;	  
			
			Если ЛБ_УправлениеЛомбардом.ПроверитьСхемуКредитованияУчастиеВРасчетеСтатусовПоСистемеЛояльности(Дата, ЭтотОбъект.ПредыдущаяОперация.СхемаКредитования) Тогда
				Если НЕ СтатусЗалоговогоБилетаНач = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Наследство Тогда
					СтатусСтарый = ЛБ_УправлениеЛомбардом.ПолучитьТекущийСтатусКлиента(Дата, ЭтотОбъект.ПредыдущаяОперация.Залогодатель);
					НовыйСтатусЗалогодаталя = ЛБ_УправлениеЛомбардом.ПроверкаСтатусаЗалогодателя(Дата, ЭтотОбъект.ПредыдущаяОперация.Залогодатель, СтатусСтарый, Истина);
					Если НЕ СтатусСтарый = НовыйСтатусЗалогодаталя Тогда
						Движения.ЛБ_СтатусыЗалогодателей.Записывать = Истина; 
						Движение = Движения.ЛБ_СтатусыЗалогодателей.Добавить();
						Движение.Период = Дата;
						Движение.Залогодатель = ЭтотОбъект.ПредыдущаяОперация.Залогодатель;
					    Движение.Статус =  НовыйСтатусЗалогодаталя;
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	        
		
		//ЕстьДатаСмерти = ?(ЛБ_ОбщийМодуль.ПроверитьЕстьДатаСмерти(ЭтотОбъект.ПредыдущаяОперация.Залогодатель, Дата) = Неопределено, Ложь, Истина);

		Если НЕ (ПродлитьДоговорДни = 0) Тогда
			Движения.ЛБ_СостояниеЗалоговогоБилета.Записывать = Истина;
			Движение = Движения.ЛБ_СостояниеЗалоговогоБилета.Добавить();
			Движение.Период = Дата;  			
			Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация;
			Движение.Залогодатель = Движение.ЗалоговыйБилет.Залогодатель;
			Движение.НомерЗалоговогоБилета = Этотобъект.НомерЗалоговогоБилета;  			
		    Движение.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Продлен; 
			Движение.СхемаКредитования = ЭтотОбъект.СхемаКредитования;
			Если СхемаКредитования.ПризнакПримененияГибкогоПроцента Тогда 
				ПричинаПримененияПроцентнойСхемы = ЛБ_УправлениеЛомбардом.ПолучитьПричинуПримененияГибкийПроцент(СхемаКредитования, Движение.СтатусЗалоговогоБилета);
				Если НЕ ПричинаПримененияПроцентнойСхемы = неопределено Тогда
				    Движение.ПричинаПрименения = ПричинаПримененияПроцентнойСхемы;
				Иначе   
					Движение.ПричинаПрименения = ПричинаПримененияНач;
				КонецЕсли;	
			Иначе
				Движение.ПричинаПрименения = ПричинаПримененияНач;
			КонецЕсли;	
			Движение.ДатаНачалаРасчетаПроцентов = ДатаНачалаРасчетаПроцентов; 
			Если НЕ ПродлитьДоговорДни = 0 Тогда
				ДатаВыкупаНовая = Этотобъект.ДатаВыкупа + ПродлитьДоговорДни*(60 * 60 * 24);
				ДатаВыкупаНовая = ?(ДатаВыкупаНовая < ДатаНачалаРасчетаПроцентов, ДатаНачалаРасчетаПроцентов, ДатаВыкупаНовая);
				ЛБ_УправлениеЛомбардом.ИсключитьДатаВыкупаПразничныйДень(ДатаВыкупаНовая);
				ДатаВыкупаЛьготнаяНовая = ЛБ_УправлениеЛомбардом.ПолучитьЛьготныйСрокЗалоговогоБилета(ДатаВыкупаНовая);
				Движение.ДатаВыкупа = ДатаВыкупаНовая;
				Движение.ДатаВыкупаЛьготныйСрок = ДатаВыкупаЛьготнаяНовая;	
			Иначе
				Движение.ДатаВыкупа = ЭтотОбъект.ДатаВыкупа;
				Движение.ДатаВыкупаЛьготныйСрок = ЭтотОбъект.ДатаВыкупаЛьготная;	
			КонецЕсли;	
			Движение.НомерДопСоглашения = НомерДопСоглашения + 1;
			Движение.СуммаЗайма = СуммаЗаймаНач - ЭтотОбъект.СуммаОплатыСсуда;  
			ПроцентнаяСхемаКон = ЛБ_ОбщийМодуль.ПолучитьПроцентнуюСхемуЗБ(ЭтотОбъект.ПредыдущаяОперация, Движение.ПричинаПрименения);
		    Движение.СуммаПроцентовДень = Движение.СуммаЗайма*ПроцентнаяСхемаКон/100;
						
			Если СтатусЗалоговогоБилетаНач = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ВключенВНакладную ИЛИ
				 СтатусЗалоговогоБилетаНач = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОбъявленТорг Тогда
				Если НЕ ЭтотОбъект.БезналичнаяОплата Тогда
				    УдалитьИзделияИзНакладнойНаОтгузку(ЭтотОбъект.ПредыдущаяОперация);  
				Иначе
					Если ЛБ_ОбщийМодуль.ПолучитьПредельныйСрокЗаймаДата(ЭтотОбъект.ПредыдущаяОперация) < ЭтотОбъект.Дата Тогда //достигнут предельный срок займа 
						Движение.СтатусЗалоговогоБилета = СтатусЗалоговогоБилетаНач;
					Иначе    
						УдалитьИзделияИзНакладнойНаОтгузку(ЭтотОбъект.ПредыдущаяОперация);
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;	
			
			//измененим статус объекта залога если нужно
			Для каждого СтрТовары Из ЭтотОбъект.Товары Цикл 
			    СтруктураСостояниеОЗ = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектовЗалогаЗалоговогоБилета(ЭтотОбъект.Дата, ЭтотОбъект.ПредыдущаяОперация, СтрТовары.ОбъектЗалога);
			 
				Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить();
				Движение.Период = Дата;
				Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация;
				Движение.ОбъектЗалога = СтрТовары.ОбъектЗалога;   
				Если СтруктураСостояниеОЗ.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.Принят Тогда 
					Движение.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.Продлен;   
				ИначеЕсли (СтруктураСостояниеОЗ.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ВключенВНакладную ИЛИ
					 СтруктураСостояниеОЗ.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ОбъявленТорг) И НЕ ЭтотОбъект.БезналичнаяОплата Тогда 
					Движение.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.Продлен; 	
				Иначе	
				    Движение.СтатусОбъектаЗалога = СтруктураСостояниеОЗ.СтатусОбъектаЗалога; 
				КонецЕсли;	
				Движение.СуммаОценки = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОценки); 
				Движение.СуммаОценкиНачальная = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОценкиНач);
				//Движение.СуммаЗайма = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаЗайма);
				//Движение.СуммаОплаты = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОплаты + СтрТовары.СуммаОплаты);  
				Движение.СуммаЗайма = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаДолгаЗайма); 
				Движение.СуммаОплаты = СтрТовары.СуммаОплаты;
				Движение.СуммаДолгаЗайма = Движение.СуммаЗайма - Движение.СуммаОплаты;	
			Конеццикла;
			
		ИначеЕсли ЭтотОбъект.Выкуп Тогда
			Движения.ЛБ_СостояниеЗалоговогоБилета.Записывать = Истина;
			Движение = Движения.ЛБ_СостояниеЗалоговогоБилета.Добавить();
			Движение.Период = Дата;
			Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация;  
			Движение.Залогодатель = Движение.ЗалоговыйБилет.Залогодатель;
			Движение.НомерЗалоговогоБилета = Этотобъект.НомерЗалоговогоБилета; 
			Если СтатусЗалоговогоБилетаНач = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Отгружен тогда
				Движение.СтатусЗалоговогоБилета = ?(СтатусЗалоговогоБилетаНач = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Наследство, СтатусЗалоговогоБилетаНач, Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ГотовКОтправкеОХ);
			Иначе	
				Если ЭтотОбъект.БезналичнаяОплата Тогда 
					Движение.СтатусЗалоговогоБилета = ?(СтатусЗалоговогоБилетаНач = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Наследство, СтатусЗалоговогоБилетаНач, Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтвественноеХранение);
				Иначе	
				    Движение.СтатусЗалоговогоБилета = ?(НЕ ЕстьНеВыкупленные, Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт, ?(СтатусЗалоговогоБилетаНач = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Наследство, СтатусЗалоговогоБилетаНач, Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтвественноеХранение));
				КонецЕсли;	
			КонецЕсли;	
			Движение.СхемаКредитования = ЭтотОбъект.СхемаКредитования;
			Движение.ПричинаПрименения = ПричинаПримененияНач;
			//Движение.ДатаВыкупа = Этотобъект.Дата;
			//Движение.ДатаВыкупаЛьготныйСрок = Этотобъект.Дата;	
			//Движение.ДатаНачалаРасчетаПроцентов = ДатаНачалаРасчетаНач;
			Движение.НомерДопСоглашения = НомерДопСоглашения;
			Движение.СуммаЗайма = 0;
			УдалитьИзделияИзНакладнойНаОтгузку(ЭтотОбъект.ПредыдущаяОперация);
		Иначе	
			Движения.ЛБ_СостояниеЗалоговогоБилета.Записывать = Истина;  
			
			//НакладнаяНаОтгрузку = ЛБ_УправлениеЛомбардом.ПолучитьНакладнуюНаОтгрузкуЗалогоговогоБилета(Дата-1, Этотобъект.ПредыдущаяОперация);
			//Если ЗначениеЗаполнено(НакладнаяНаОтгрузку) Тогда
			//	ДолгПоПроцентам = ЛБ_ОбщийМодуль.ПолучитьОстатокПроцентов(ЭтотОбъект.Ссылка, ЭтотОбъект.ПредыдущаяОперация);				
			//	СуммаНачисленияДок = ЭтотОбъект.НачислениеПроцентовДетально.Итог("СуммаПроцентов") + ДолгПоПроцентам; 
			//	ПроцентДляИсключенияИзНакладной = ?(СуммаНачисленияДок = 0, 0, ЭтотОбъект.СуммаОплатыПроценты/СуммаНачисленияДок);
			//	Если ПроцентДляИсключенияИзНакладной >= 0.9 Тогда 
			//		ИсключитьИзНакладной = Истина;
			//	Иначе                           
			//		ИсключитьИзНакладной = Ложь;
			//	КонецЕсли;	
			//Иначе	
			//	ИсключитьИзНакладной = Ложь;	
			//КонецЕсли;
			//
			Движение = Движения.ЛБ_СостояниеЗалоговогоБилета.Добавить();
			Движение.Период = Дата;
			Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация;   
			Движение.Залогодатель = Движение.ЗалоговыйБилет.Залогодатель;
			Движение.НомерЗалоговогоБилета = Этотобъект.НомерЗалоговогоБилета;
			Если НаОХ И НЕ СтатусЗалоговогоБилетаНач = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Наследство Тогда  
				Движение.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтвественноеХранение;
			Иначе	
			    Движение.СтатусЗалоговогоБилета = СтатусЗалоговогоБилетаНач; 
			КонецЕсли;	
			Движение.СхемаКредитования = ЭтотОбъект.СхемаКредитования;
			Движение.ПричинаПрименения = ПричинаПримененияНач;
			Движение.ДатаНачалаРасчетаПроцентов = ДатаНачалаРасчетаНач;  
			Если НЕ БезПродленияДоговора И НЕ ЭтотОбъект.СуммаОплатыСсуда = 0 Тогда 
				Движение.НомерДопСоглашения = НомерДопСоглашения + 1;
			Иначе	
			    Движение.НомерДопСоглашения = НомерДопСоглашения;    
			КонецЕсли;
			Движение.ДатаОплатыБезПродления = ЭтотОбъект.Дата;
			Движение.ДатаВыкупа = СтруктураРез.ДатаВыкупа;
			Движение.ДатаВыкупаЛьготныйСрок = СтруктураРез.ДатаВыкупаЛьготныйСрок;	
			Движение.СуммаЗайма = СуммаЗаймаНач - ЭтотОбъект.СуммаОплатыСсуда; 
			ПроцентнаяСхемаКон = ЛБ_ОбщийМодуль.ПолучитьПроцентнуюСхемуЗБ(ЭтотОбъект.ПредыдущаяОперация, Движение.ПричинаПрименения);
		    Движение.СуммаПроцентовДень = Движение.СуммаЗайма*ПроцентнаяСхемаКон/100;
			
			//Если мСуммаПроцентовДень = 0 Тогда
			//	ПроцентнаяСтавка = 0; 
			//	ДатаКон = ?(НачалоДня(ДатаНачалаРасчетаНач) > НачалоДня(ЭтотОбъект.Дата), ДатаНачалаРасчетаНач, ЭтотОбъект.Дата); 
			//	КолДней = ?(НачалоДня(ДатаКон) = НачалоДня(ДатаНачалаРасчетаНач), 0, (НачалоДня(ДатаКон) - НачалоДня(ДатаНачалаРасчетаНач)) / (60 * 60 * 24)) + 1;
			//	ОтборП = Новый структура;
			//	ОтборП.Вставить("ПричинаПрименения", ПричинаПримененияНач);
			//	СтрокиН = ЭтотОбъект.ПредыдущаяОперация.ПроцентныеСтавкиПоПериодам.НайтиСтроки(ОтборП); 
			//	Если СтрокиН.Количество() > 0 Тогда 
			//		Сч1 = 0;
			//		Для сч = 0 По СтрокиН.Количество()-1 Цикл
			//			Если СтрокиН.Получить(Сч).ДеньНачалаПрименения <= КолДней Тогда
			//			   Сч1= сч;
			//		    Иначе  
			//			   Прервать;
			//			КонецЕсли;   
			//		Конеццикла;  
			//		СтрН = СтрокиН.Получить(Сч1);
			//		ПроцентнаяСтавка = СтрН.ПроцентнаяСтавка; 
			//		Если СтрН.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Акционная Тогда
			//			Если НЕ СтрН.ПроцентнаяСтавкаАкция = 0 Тогда
			//				ПроцентнаяСтавка = СтрН.ПроцентнаяСтавкаАкция;
			//			ИначеЕсли НЕ СтрН.ОтклонениеАкцияОтносительное = 0 Тогда	 
			//				ПроцентнаяСтавка = СтрН.ПроцентнаяСтавка + СтрН.ПроцентнаяСтавка*СтрН.ОтклонениеАкцияОтносительное/100;
			//			ИначеЕсли НЕ СтрН.ОтклонениеАкцияАбсолютное = 0 Тогда
			//				ПроцентнаяСтавка = СтрН.ПроцентнаяСтавка + СтрН.ОтклонениеАкцияАбсолютное;
			//		    КонецЕсли; 
			//		КонецЕсли;
			//    КонецЕсли;
			//	Движение.СуммаПроцентовДень = Движение.СуммаЗайма*ПроцентнаяСтавка/100; 
			//Иначе   
			//	Движение.СуммаПроцентовДень = мСуммаПроцентовДень;
			//КонецЕсли;      
			
			//Если ИсключитьИзНакладной Тогда 
			//    УдалитьИзделияИзНакладнойНаОтгузку(ЭтотОбъект.ПредыдущаяОперация); 
			//КонецЕсли;	
			
			//измененим статус объекта залога если нужно
			Для каждого СтрТовары Из ЭтотОбъект.Товары Цикл   
				//Если ИсключитьИзНакладной Тогда 
				//	СтруктураСостояниеОЗ = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектовЗалогаЗалоговогоБилета(НакладнаяНаОтгрузку.Дата-1, ЭтотОбъект.ПредыдущаяОперация, СтрТовары.ОбъектЗалога);
				//Иначе	
			        СтруктураСостояниеОЗ = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектовЗалогаЗалоговогоБилета(ЭтотОбъект.Дата, ЭтотОбъект.ПредыдущаяОперация, СтрТовары.ОбъектЗалога);
				//КонецЕсли;	
			 
				Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить();
				Движение.Период = Дата;
				Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация;
				Движение.ОбъектЗалога = СтрТовары.ОбъектЗалога;  
				Если НаОХ Тогда
					Движение.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение;
				Иначе	
				    Движение.СтатусОбъектаЗалога = СтруктураСостояниеОЗ.СтатусОбъектаЗалога;
				КонецЕсли;	
				Движение.СуммаОценки = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОценки); 
				Движение.СуммаОценкиНачальная = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОценкиНач);
				//Движение.СуммаЗайма = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаЗайма); 
				Движение.СуммаЗайма = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаДолгаЗайма);
				//Движение.СуммаОплаты = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОплаты + СтрТовары.СуммаОплаты); 
				Движение.СуммаОплаты = СтрТовары.СуммаОплаты;
				Движение.СуммаДолгаЗайма = Движение.СуммаЗайма - Движение.СуммаОплаты;	
			Конеццикла;
		КонецЕсли;	  
		
		Движения.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Записывать = Истина;  
		Движения.ЛБ_РасчетыСКлиентамиБУ.Записывать = Истина;
		Для каждого Стр Из ЭтотОбъект.Товары Цикл 
			Если Стр.СуммаОплаты = 0 Тогда
				Продолжить;
			КонецЕсли;	
		    Движение = Движения.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Клиент = ЭтотОбъект.ПредыдущаяОперация.Залогодатель;
			Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация;
			Движение.ОбъектЗалога = Стр.ОбъектЗалога;
			Движение.Сумма = Стр.СуммаОплаты;   
			
			Движение = Движения.ЛБ_РасчетыСКлиентамиБУ.Добавить();
			Движение.Период = Дата;     
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Организация = ЭтотОбъект.ПредыдущаяОперация.Организация; 
			Движение.Ломбард = ЭтотОбъект.ПредыдущаяОперация.Ломбард;
			Движение.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоОсновномуДолгу;
			Движение.Клиент = ЭтотОбъект.ПредыдущаяОперация.Залогодатель;
			Движение.ЗалоговыйБилет = ЭтотОбъект.ПредыдущаяОперация;				
			Движение.ОбъектЗалога = Стр.ОбъектЗалога;  
			Движение.Сумма = Стр.СуммаОплаты; 
       КонецЦикла;
	   
	   		
	   Если НЕ СтатусЗалоговогоБилетаНач = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят И 
			 НЕ СтатусЗалоговогоБилетаНач = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен И
			 НЕ СтатусЗалоговогоБилетаНач = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Остановлен тогда 
			Движения.ЛБ_НачислениеПроцентовДетально.Записывать = Истина;
			Для каждого Стр из Этотобъект.НачислениеПроцентовДетально Цикл	
				Движение = Движения.ЛБ_НачислениеПроцентовДетально.Добавить();
				Движение.Период = Дата;     
				Движение.ЗалоговыйБилет = ЭтотОбъект.ПредыдущаяОперация; 
				Движение.ДатаНачалаРасчета = ДатаНачалаРасчетаНач;
	            Движение.ВидПроцентнойСтавки = стр.ВидПроцентнойСтавки;
				Движение.ДатаНач = стр.ДатаНач;
				Движение.ДатаКон = стр.ДатаКон;
				Движение.ДеньНач = Стр.ДеньНач;
				Движение.ДеньКон = Стр.ДеньКон;
				Движение.СуммаПроцентов = Стр.СуммаПроцентов;
				Движение.СуммаПроцентовДень = Стр.СуммаПроцентовДень;
				Движение.ПроцентнаяСтавкаБазовая = Стр.ПроцентнаяСтавкаБазовая;
				Движение.ПроцентнаяСтавкаАкция = Стр.ПроцентнаяСтавкаАкция;
				Движение.ОтклонениеАкцияАбсолютное = Стр.ОтклонениеАкцияАбсолютное;
				Движение.ОтклонениеАкцияОтностельное = Стр.ОтклонениеАкцияОтносительное;
			КонецЦикла;				
	   КонецЕсли;	
	   	  
	   Если ЗначениеЗаполнено(Этотобъект.Залогодатель) И
		    НЕ Этотобъект.Залогодатель = ЭтотОбъект.ПредыдущаяОперация.Залогодатель Тогда
		   Движения.ЛБ_ПлательщикиКлиента.Записывать = Истина; 
		   Движение = Движения.ЛБ_ПлательщикиКлиента.Добавить();
		   Движение.Период = Дата;
           Движение.Клиент = ЭтотОбъект.ПредыдущаяОперация.Залогодатель;
		   Движение.Плательщик = Этотобъект.Залогодатель;
		КонецЕсли;	                                       
		
		Если ЭтотОбъект.Залогодатель = ЭтотОбъект.ПредыдущаяОперация.Залогодатель Тогда
			Движения.ЛБ_ДатыОбновленияАнкеты.Записывать = Истина;  
			Движение = Движения.ЛБ_ДатыОбновленияАнкеты.Добавить();
			Движение.Период = Дата; 
			Движение.Залогодатель = ЭтотОбъект.Залогодатель;
		    Движение.ДатаАктуальности = Дата;
		КонецЕсли;	
		//Иначе        
			//Если ЗначениеЗаполнено(ЭтотОбъект.РеестрПлатежей) Тогда      
			//	Движения.ЛБ_БезналичныеПлатежиКРаспределению.Записывать = Истина;
			//	Движения.ЛБ_РаспределенныеБезналичныеПлатежи.Записывать = Истина;
			//	Движения.ЛБ_РеестрБезначныхПлатежей.Записывать = Истина;     
			//	  
			//	СуммаОплаты = ЭтотОбъект.СуммаОплатыПроценты + ЭтотОбъект.СуммаОплатыСсуда;
			//	Если ЭтотОбъект.СуммаПлатежа > СуммаОплаты Тогда  
			//		Переплата = ЭтотОбъект.СуммаПлатежа - СуммаОплаты;
			//	Иначе
			//		Переплата = 0;
			//	КонецЕсли;
			//	
			//	Движение = Движения.ЛБ_РеестрБезначныхПлатежей.Добавить();
			//	Движение.Период = Дата; 
			//	Движение.РеестрПлатежей = ЭтотОбъект.РеестрПлатежей;
			//	Движение.ДатаПлатежа = ДатаПлатежа;
			//	Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
			//	Движение.НомерЗБ = ЭтотОбъект.НомерЗБПлатежа;
			//	Движение.ЗалоговыйБилет = ЭтотОбъект.ПредыдущаяОперация;
			//	Движение.СуммаПлатежа = СуммаПлатежа;
			//	Движение.СтатусПлатежа = ?(Переплата = 0, Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ЗачисленоПолностью, Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ЗачисленоЧастично);
			//	Движение.ОплатаПроценты = ЭтотОбъект.СуммаОплатыПроценты;
			//	Движение.ОплатаЗайм = ЭтотОбъект.СуммаОплатыСсуда;
			//	Движение.Переплата = Переплата; 
			//	Движение.ДатаПеревода = ?(ДатаПереводаВИтоговыйСтатусБН = Дата(1,1,1), ТекущаяДатаСеанса(), ДатаПереводаВИтоговыйСтатусБН);
			//	Движение.Ответственный = ЭтотОбъект.Ответственный; 
			//	Движение.ДокументОплаты = ЭтотОбъект.Ссылка;
			//	
			//	ТекущийСтатусПлатежа = ЛБ_ОбщийМодуль.ПолучитьИтоговыйСтатусБезналичногоПлатежа(Дата-1, РеестрПлатежей, ИдентификаторПлатежа, ДатаПлатежа, НомерЗБПлатежа);
			//	Если ТекущийСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ДоВыяснения ИЛИ
			//		 ТекущийСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.КВозврату Тогда
			//		Запрос = Новый Запрос;   
			//		Запрос.УстановитьПараметр("Дата", Дата-1);
			//		Запрос.УстановитьПараметр("РеестрПлатежей", РеестрПлатежей); 
			//		Запрос.УстановитьПараметр("ДатаПлатежа", ДатаПлатежа);
			//		Запрос.УстановитьПараметр("ИдентификаторПлатежа", ИдентификаторПлатежа);
			//		Запрос.УстановитьПараметр("НомерЗБ", НомерЗБПлатежа);
			//		Запрос.Текст =  "ВЫБРАТЬ
			//		                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.РеестрПлатежей КАК РеестрПлатежей,
			//		                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.НомерЗБ КАК НомерЗБ,
			//		                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.ДатаПлатежа КАК ДатаПлатежа,
			//		                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
			//		                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.СуммаПлатежа КАК СуммаПлатежа,
			//		                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.ЗалоговыйБилет КАК ЗалоговыйБилет,
			//		                |	СУММА(ЛБ_РаспределенныеБезналичныеПлатежиОбороты.КВозвратуОборот) КАК КВозврату,
			//		                |	СУММА(ЛБ_РаспределенныеБезналичныеПлатежиОбороты.ДоВыясненияОборот) КАК ДоВыяснения
			//		                |ИЗ
			//		                |	РегистрНакопления.ЛБ_РаспределенныеБезналичныеПлатежи.Обороты(
			//		                |			,
			//		                |			&Дата,
			//		                |			,
			//		                |			РеестрПлатежей = &РеестрПлатежей
			//		                |				И ДатаПлатежа = &ДатаПлатежа
			//		                |				И ИдентификаторПлатежа = &ИдентификаторПлатежа
			//		                |				И НомерЗБ = &НомерЗБ) КАК ЛБ_РаспределенныеБезналичныеПлатежиОбороты
			//		                |
			//		                |СГРУППИРОВАТЬ ПО
			//		                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.РеестрПлатежей,
			//		                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.ЗалоговыйБилет,
			//		                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.ИдентификаторПлатежа,
			//		                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.ДатаПлатежа,
			//		                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.НомерЗБ,
			//		                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.СуммаПлатежа"; 
			//		ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
			//		Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
			//			Стр = ТаблицаЗапроса.Получить(0);
			//			Если ТекущийСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ДоВыяснения И НЕ (Стр.ДоВыяснения = 0) Тогда
			//				Движение = Движения.ЛБ_РаспределенныеБезналичныеПлатежи.Добавить();
			//				Движение.Период = Дата;                              
			//				Движение.РеестрПлатежей = ЭтотОбъект.РеестрПлатежей;
			//				Движение.ДатаПлатежа = ДатаПлатежа;
			//				Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
			//				Движение.НомерЗБ = НомерЗБПлатежа;   
			//				Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
			//				Движение.СуммаПлатежа = СуммаПлатежа; 
			//                Движение.ДоВыяснения = -Стр.ДоВыяснения;				
			//			ИначеЕсли ТекущийСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.КВозврату И НЕ (Стр.КВозврату = 0) Тогда	  
			//				Движение = Движения.ЛБ_РаспределенныеБезналичныеПлатежи.Добавить();
			//				Движение.Период = Дата;                              
			//				Движение.РеестрПлатежей = ЭтотОбъект.РеестрПлатежей;
			//				Движение.ДатаПлатежа = ДатаПлатежа;
			//				Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
			//				Движение.НомерЗБ = НомерЗБПлатежа;   
			//				Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
			//				Движение.СуммаПлатежа = СуммаПлатежа; 
			//                Движение.КВозврату = -Стр.КВозврату;		
			//			КонецЕсли;  
			//		КонецЕсли;	
			//	КонецЕсли;	

			//	
			//	Запрос = Новый Запрос;
			//	Запрос.УстановитьПараметр("Дата", РеестрПлатежей.Дата);
			//	Запрос.УстановитьПараметр("РеестрПлатежей", РеестрПлатежей); 
			//	Запрос.УстановитьПараметр("ДатаПлатежа", ДатаПлатежа);
			//	Запрос.УстановитьПараметр("ИдентификаторПлатежа", ИдентификаторПлатежа);
			//	Запрос.УстановитьПараметр("НомерЗБ", НомерЗБПлатежа);
			//	Запрос.Текст = "ВЫБРАТЬ
			//	               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.РеестрПлатежей КАК РеестрПлатежей,
			//	               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.НомерЗБ КАК НомерЗБ,
			//	               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
			//	               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.ДатаПлатежа КАК ДатаПлатежа,
			//	               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.СуммаПлатежа КАК СуммаПлатежа,
			//	               |	СУММА(ЛБ_БезналичныеПлатежиКРаспределениюОстатки.СуммаОстаток) КАК Сумма
			//	               |ИЗ
			//	               |	РегистрНакопления.ЛБ_БезналичныеПлатежиКРаспределению.Остатки(
			//	               |			&Дата,
			//	               |			РеестрПлатежей = &РеестрПлатежей
			//	               |				И ИдентификаторПлатежа = &ИдентификаторПлатежа
			//	               |				И НомерЗБ = &НомерЗБ
			//	               |				И ДатаПлатежа = &ДатаПлатежа) КАК ЛБ_БезналичныеПлатежиКРаспределениюОстатки
			//	               |
			//	               |СГРУППИРОВАТЬ ПО
			//	               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.НомерЗБ,
			//	               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.РеестрПлатежей,
			//	               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.ДатаПлатежа,
			//	               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.СуммаПлатежа,
			//	               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.ИдентификаторПлатежа"; 
			//	Выборка = Запрос.Выполнить().Выбрать();
			//	Если Выборка.Следующий() Тогда  
			//		СуммаРасход = СуммаОплаты;
			//		Если СуммаРасход > Выборка.Сумма Тогда
			//			СуммаРасход = Выборка.Сумма;
			//			ОбщегоНазначения.СообщитьПользователю("Остаток по безналичным платежам к распределению " + СокрЛП(Формат(Выборка.Сумма, "ЧЦ=15; ЧДЦ=2")) + " меньше оплаты по ЗБ № " + СокрЛП(ЭтотОбъект.ПредыдущаяОперация.НомерЗалоговогоБилета));
			//		КонецЕсли;	
			//		Движение = Движения.ЛБ_БезналичныеПлатежиКРаспределению.ДобавитьРасход();
			//	    Движение.Период = Дата;   
			//		Движение.РеестрПлатежей = Выборка.РеестрПлатежей; 
			//		Движение.ДатаПлатежа = Выборка.ДатаПлатежа;
			//		Движение.ИдентификаторПлатежа = Выборка.ИдентификаторПлатежа;
			//		Движение.НомерЗБ = Выборка.НомерЗБ; 
			//		Движение.СуммаПлатежа = Выборка.СуммаПлатежа;
			//        Движение.Сумма = СуммаРасход;
			//	КонецЕсли;	
			//	
			//	Движение = Движения.ЛБ_РаспределенныеБезналичныеПлатежи.Добавить();
			//	Движение.Период = Дата;                              
			//	Движение.РеестрПлатежей = ЭтотОбъект.РеестрПлатежей; 
			//	Движение.ДатаПлатежа = ДатаПлатежа;
			//	Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
			//	Движение.НомерЗБ = НомерЗБПлатежа;
			//	Движение.СуммаПлатежа = СуммаПлатежа; 
			//	Движение.ЗалоговыйБилет = ЭтотОбъект.ПредыдущаяОперация;
			//	Если НЕ ЭтотОбъект.СуммаОплатыПроценты = 0 Тогда
			//	    Движение.ОплатаПроценты = ЭтотОбъект.СуммаОплатыПроценты;
			//	КонецЕсли;
			//	Если НЕ ЭтотОбъект.СуммаОплатыСсуда = 0 Тогда
			//	    Движение.ОплатаЗайм = ЭтотОбъект.СуммаОплатыСсуда;
			//	КонецЕсли;	
			//    Если НЕ Переплата = 0 Тогда
			//	    Движение.Переплата = Переплата;
			//	КонецЕсли;	
			//КонецЕсли;
		//КонецЕсли;	

	ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога Тогда
		СтруктураРез = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗалоговогоБилета(ЭтотОбъект, ПредыдущаяОперация); 
		ДатаНачалаРасчетаНач = СтруктураРез.ДатаНачалаРасчета; 
		ДатаВыкупа = Этотобъект.ДатаВыкупа;
		ДатаВыкупаЛьготная = Этотобъект.ДатаВыкупаЛьготная;  
		ПричинаПримененияНач = СтруктураРез.ПричинаПрименения; 
		НомерДопСоглашения = СтруктураРез.НомерДопСоглашения;
		СтатусНачальный = СтруктураРез.СтатусЗалоговогоБилета;
	
		Движения.ЛБ_ОборотыПоОперациямЗайма.Записывать = Истина;
		Движение = Движения.ЛБ_ОборотыПоОперациямЗайма.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Ломбард = Ломбард;
		Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация;
		Движение.Залогодатель = ЭтотОбъект.ПредыдущаяОперация.Залогодатель;
		Движение.ВидОперации = ЭтотОбъект.ВидОперации;    
		
		Запрос = новый Запрос;   
		Запрос.УстановитьПараметр("ЗалоговыйБилет", ЭтотОбъект.ПредыдущаяОперация);
		Запрос.УстановитьПараметр("Ломбард", ЭтотОбъект.Ломбард);
		Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);	 
		Запрос.УстановитьПараметр("Склад", СкладЛомбарда);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
		               |	ЛБ_ОбъектыЗалогаОстатки.Ломбард КАК Ломбард,
		               |	СУММА(ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток) КАК Количество,
		               |	СУММА(ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток) КАК СуммаОценки, 
					   |	СУММА(ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток) КАК СуммаОценкиНач
		               //|	СУММА(ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиНачальнаяОстаток) КАК СуммаОценкиНач
		               |ИЗ
		               |	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(
		               |			&Дата,
		               |			ЗалоговыйБилет = &ЗалоговыйБилет
		               |				И Склад = &Склад) КАК ЛБ_ОбъектыЗалогаОстатки
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога,
		               |	ЛБ_ОбъектыЗалогаОстатки.Ломбард";
		ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
		
		ЕстьНеВыкупленные = ложь;
		КоличествоВыдано = 0;
	    Движения.ЛБ_ОбъектыЗалога.Записывать = Истина;
		Движения.ЛБ_СостояниеОбъектаЗалога.Записывать = Истина; 
		Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Записывать = Истина;
		Для каждого Стр Из ЭтотОбъект.ТоварыВыкупленные цикл   
			Отбор = Новый структура;
			Отбор.Вставить("Ломбард", ЭтотОбъект.Ломбард); 
			Отбор.Вставить("ОбъектЗалога", Стр.ОбъектЗалога); 
			
			Строки = ТаблицаОстатков.НайтиСтроки(Отбор);
			Если Строки.Количество() = 0 Тогда
				//ЕстьНеВыкупленные = Истина;
				//ОбщегоНазначения.СообщитьПользователю("Объект залога " + СокрЛП(Стр.ОбъектЗалога) + " в ломбарде " + СокрЛП(ЭтотОбъект.Ломбард) + " не найден!");
				Продолжить;
			Иначе	
			    СтрОст = Строки.Получить(0); 
				КоличествоВыдано = КоличествоВыдано + 1;
				Движение = Движения.ЛБ_ОбъектыЗалога.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Организация = Организация;
				Движение.Ломбард = Ломбард;   
				Движение.Склад = СкладЛомбарда;
				Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация;
				Движение.ОбъектЗалога = Стр.ОбъектЗалога;
				Движение.Количество = СтрОст.Количество;
				Движение.СуммаОценки = СтрОст.СуммаОценки;  
				//Движение.СуммаОценкиНачальная = СтрОст.СуммаОценкиНач; 
							
				СтруктураСостояниеОЗ = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектовЗалогаЗалоговогоБилета(ЭтотОбъект.Дата, ЭтотОбъект.ПредыдущаяОперация, Стр.ОбъектЗалога);
				Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить();
				Движение.Период = Дата;
				Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация;
				Движение.ОбъектЗалога = Стр.ОбъектЗалога;
				Движение.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.Выкуплен;
				Движение.СуммаОценки = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОценки);	
				Движение.СуммаОценкиНачальная = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОценкиНач);	
				Движение.СуммаЗайма = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаЗайма);
				Движение.СуммаОплаты = Движение.СуммаЗайма; 
			КонецЕсли;	
		КонецЦикла;      
		Если НЕ КоличествоВыдано = 0 Тогда				
			Движение = Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Добавить(); 
			Движение.Период = Дата;
			Движение.Организация = Организация;  
			Движение.ПодразделениеОсновное = ЭтотОбъект.Ломбард;
			Движение.СкладОсновной = СкладЛомбарда;
			Движение.ПодразделениеОтправитель = ЭтотОбъект.Ломбард;
            Движение.СкладОтправитель = СкладЛомбарда; 
			Движение.Количество = КоличествоВыдано;  
			Движение.Ответственный = ЭтотОбъект.ОтветственныйСотрудник; 
			Движение.НомерЗБ = ЭтотОбъект.ПредыдущаяОперация.НомерЗалоговогоБилета;
			Движение.ВидОперации = "Выдача с ОХ";
        КонецЕсли;
		
		Движения.ЛБ_СостояниеЗалоговогоБилета.Записывать = Истина;
		Движение = Движения.ЛБ_СостояниеЗалоговогоБилета.Добавить();
		Движение.Период = Дата;
		Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация; 
		Движение.Залогодатель = Движение.ЗалоговыйБилет.Залогодатель;
		Движение.НомерЗалоговогоБилета = Этотобъект.НомерЗалоговогоБилета;
		Движение.СтатусЗалоговогоБилета = ?(ЕстьНеВыкупленные, ЕстьНеВыкупленные, Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт); 
		Движение.СхемаКредитования = ЭтотОбъект.СхемаКредитования;
		Движение.ПричинаПрименения = ПричинаПримененияНач;  
		Движение.ДатаНачалаРасчетаПроцентов = ДатаНачалаРасчетаНач; 
		//Движение.ДатаВыкупа = Этотобъект.Дата;
		//Движение.ДатаВыкупаЛьготныйСрок = Этотобъект.Дата;			
		//Движение.НомерДопСоглашения = НомерДопСоглашения;
		Движение.СуммаЗайма = 0; 
		
		Если ЭтотОбъект.Залогодатель = ЭтотОбъект.ПредыдущаяОперация.Залогодатель Тогда
			Движения.ЛБ_ДатыОбновленияАнкеты.Записывать = Истина;  
			Движение = Движения.ЛБ_ДатыОбновленияАнкеты.Добавить();
			Движение.Период = Дата; 
			Движение.Залогодатель = ЭтотОбъект.Залогодатель;
		    Движение.ДатаАктуальности = Дата;
		КонецЕсли;	
		
		Если НЕ ЕстьНеВыкупленные Тогда
		    ЗакрытьДоверенностиПоЗалоговомуБилету(ЭтотОбъект.ПредыдущаяОперация.Залогодатель, ЭтотОбъект.ПредыдущаяОперация);
		КонецЕсли;	
		
	ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ИзъятиеОбъектовЗалога Тогда
		СтруктураРез = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗалоговогоБилета(ЭтотОбъект, ПредыдущаяОперация); 
		ДатаНачалаРасчетаНач = СтруктураРез.ДатаНачалаРасчета; 
		ДатаВыкупа = СтруктураРез.ДатаВыкупа;
		ДатаВыкупаЛьготная = СтруктураРез.ДатаВыкупаЛьготныйСрок;  
		СуммаЗайма = СтруктураРез.СуммаЗайма;                 
		ПричинаПримененияНач = СтруктураРез.ПричинаПрименения;
		НомерДопСоглашения = СтруктураРез.НомерДопСоглашения;
		СтатусНачальный = СтруктураРез.СтатусЗалоговогоБилета;
		
		Движения.ЛБ_ОборотыПоОперациямЗайма.Записывать = Истина;
		Движение = Движения.ЛБ_ОборотыПоОперациямЗайма.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Ломбард = Ломбард;
		Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация;
		Движение.Залогодатель = ЭтотОбъект.ПредыдущаяОперация.Залогодатель;
		Движение.ВидОперации = ЭтотОбъект.ВидОперации; 
		Движение.СуммаСсуды = СуммаЗайма;   
		Если НЕ ЭтотОбъект.Товары.Итог("СуммаОплаты") = 0 Тогда
		    Движение.СуммаОплатыЗайм = ЭтотОбъект.Товары.Итог("СуммаОплаты");  
		КонецЕсли;	
	
		Запрос = новый Запрос;   
		Запрос.УстановитьПараметр("ЗалоговыйБилет", ЭтотОбъект.ПредыдущаяОперация);
		Запрос.УстановитьПараметр("Ломбард", ЭтотОбъект.Ломбард);
		Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
		Запрос.УстановитьПараметр("Склад", СкладЛомбарда);  
		ОтборСклад = "";
		Если  НЕ ЭтотОбъект.Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис Тогда 
			ОтборСклад = " И Склад = &Склад";
		КонецЕсли;	

		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
		               |	ЛБ_ОбъектыЗалогаОстатки.Ломбард КАК Ломбард,
		               |	ЛБ_ОбъектыЗалогаОстатки.Склад КАК Склад,
		               |	СУММА(ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток) КАК Количество,
		               |	СУММА(ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток) КАК СуммаОценки,
		               |	СУММА(ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток) КАК СуммаОценкиНач
		               |ИЗ
		               |	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(
		               |			&Дата,
		               |			ЗалоговыйБилет = &ЗалоговыйБилет";
		Запрос.Текст = Запрос.Текст + ОтборСклад + ") КАК ЛБ_ОбъектыЗалогаОстатки
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога,
		               |	ЛБ_ОбъектыЗалогаОстатки.Ломбард,
		               |	ЛБ_ОбъектыЗалогаОстатки.Склад";
		ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
		
		КоличествоИзъятых = 0;
		
	    Движения.ЛБ_ОбъектыЗалога.Записывать = Истина;
		Движения.ЛБ_СостояниеОбъектаЗалога.Записывать = Истина;
		Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Записывать = Истина;
		Для каждого Стр Из ЭтотОбъект.ТоварыИзъятыеВозвращенные цикл  
			Отбор = Новый структура;
			Отбор.Вставить("Ломбард", ЭтотОбъект.Ломбард); 
			Отбор.Вставить("ОбъектЗалога", Стр.ОбъектЗалога); 
			
			Строки = ТаблицаОстатков.НайтиСтроки(Отбор);
			Если Строки.Количество() = 0 Тогда
				//ОбщегоНазначения.СообщитьПользователю("Объект залога " + СокрЛП(Стр.ОбъектЗалога) + " в ломбарде " + СокрЛП(ЭтотОбъект.Ломбард) + " не найден!");
				Продолжить;
			Иначе	    
				СтрОст = Строки.Получить(0);
				Движение = Движения.ЛБ_ОбъектыЗалога.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Организация = Этотобъект.ПредыдущаяОперация.Организация;
				Движение.Ломбард = Ломбард;    
				Движение.Склад = СтрОст.Склад;
				Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация;
				Движение.ОбъектЗалога = Стр.ОбъектЗалога;
				Движение.Количество = СтрОст.Количество;
				Движение.СуммаОценки = СтрОст.СуммаОценки; 
				//Движение.СуммаОценкиНачальная = СтрОст.СуммаОценкиНач;  
							
				СтруктураСостояниеОЗ = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектовЗалогаЗалоговогоБилета(ЭтотОбъект.Дата, ЭтотОбъект.ПредыдущаяОперация, Стр.ОбъектЗалога);
			    Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить();
				Движение.Период = Дата;
				Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация;
				Движение.ОбъектЗалога = Стр.ОбъектЗалога;
				Движение.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.Изъят; 
				Движение.СуммаОценки = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОценки);	
				Движение.СуммаОценкиНачальная = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОценкиНач);	
				Движение.СуммаЗайма = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаЗайма);
				Движение.СуммаОплаты = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОплаты); 
				Движение.СуммаДолгаЗайма = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаДолгаЗайма); 

				КоличествоИзъятых = КоличествоИзъятых + 1;  
			КонецЕсли;	
		КонецЦикла; 
		Если НЕ КоличествоИзъятых = 0 Тогда	
			Если ЭтотОбъект.Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис Тогда
				ТаблицаСписано = Движения.ЛБ_ОбъектыЗалога.Выгрузить();   
				ТаблицаСкладов = ТаблицаСписано.Скопировать();  
				ТаблицаСкладов.Свернуть("Склад");
				Для каждого СтрС Из ТаблицаСкладов Цикл
					ОтборС = Новый Структура;
					ОтборС.Вставить("Склад", СтрС.Склад);
					
					СтрокиС = ТаблицаСписано.НайтиСтроки(ОтборС); 
					Движение = Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Добавить(); 
					Движение.Период = Дата;
					Движение.Организация = Организация;   
					Движение.ПодразделениеОсновное = ЭтотОбъект.Ломбард; 
					Движение.СкладОсновной = СтрС.Склад;
					Движение.ПодразделениеОтправитель = ЭтотОбъект.Ломбард;
				    Движение.СкладОтправитель = СтрС.Склад; 
					Движение.Количество = СтрокиС.Количество();  		
					Движение.Ответственный = ЭтотОбъект.ОтветственныйСотрудник; 
					Движение.НомерЗБ = ЭтотОбъект.ПредыдущаяОперация.НомерЗалоговогоБилета;
					Движение.ВидОперации = "Изъятие залогов"; 
				Конеццикла;	
			Иначе	
				Движение = Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Добавить(); 
				Движение.Период = Дата;
				Движение.Организация = Организация;   
				Движение.ПодразделениеОсновное = ЭтотОбъект.ПредыдущаяОперация.Ломбард; 
				Движение.СкладОсновной = СкладЛомбарда;
				Движение.ПодразделениеОтправитель = ЭтотОбъект.ПредыдущаяОперация.Ломбард;
			    Движение.СкладОтправитель = СкладЛомбарда; 
				Движение.Количество = КоличествоИзъятых;  		
				Движение.Ответственный = ЭтотОбъект.ОтветственныйСотрудник; 
				Движение.НомерЗБ = ЭтотОбъект.ПредыдущаяОперация.НомерЗалоговогоБилета;
				Движение.ВидОперации = "Изъятие залогов"; 
			КонецЕсли;	
		КонецЕсли;	


		Движения.ЛБ_СостояниеЗалоговогоБилета.Записывать = Истина;
		Движение = Движения.ЛБ_СостояниеЗалоговогоБилета.Добавить();
		Движение.Период = Дата;
		Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация; 
		Движение.Залогодатель = Движение.ЗалоговыйБилет.Залогодатель;
		Движение.НомерЗалоговогоБилета = Этотобъект.Этотобъект.ПредыдущаяОперация.НомерЗалоговогоБилета;
		Движение.СтатусЗалоговогоБилета = ?(КоличествоИзъятых = 0, СтатусНачальный, Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят); 
		Движение.СхемаКредитования = Этотобъект.ПредыдущаяОперация.СхемаКредитования;
		Движение.ПричинаПрименения = ПричинаПримененияНач;
		Движение.ДатаВыкупа = ДатаВыкупа;
		Движение.ДатаВыкупаЛьготныйСрок = ДатаВыкупаЛьготная;	
		Движение.НомерДопСоглашения = НомерДопСоглашения;  
		Движение.ДатаНачалаРасчетаПроцентов = ДатаНачалаРасчетаНач;
		Движение.СуммаЗайма = СуммаЗайма - ЭтотОбъект.Товары.Итог("СуммаОплаты");
		
		УдалитьИзделияИзНакладнойНаОтгузку(Этотобъект.ПредыдущаяОперация, Истина);
		
		Движения.ЛБ_НачислениеПроцентовДетально.Записывать = Истина;
		Для каждого Стр из Этотобъект.НачислениеПроцентовДетально Цикл	
			Движение = Движения.ЛБ_НачислениеПроцентовДетально.Добавить();
			Движение.Период = Дата;     
			Движение.ЗалоговыйБилет = ЭтотОбъект.ПредыдущаяОперация;
			Движение.ДатаНачалаРасчета = ДатаНачалаРасчетаНач;
            Движение.ВидПроцентнойСтавки = стр.ВидПроцентнойСтавки;
			Движение.ДатаНач = стр.ДатаНач;
			Движение.ДатаКон = стр.ДатаКон;
			Движение.ДеньНач = Стр.ДеньНач;
			Движение.ДеньКон = Стр.ДеньКон;
			Движение.СуммаПроцентов = Стр.СуммаПроцентов;
			Движение.СуммаПроцентовДень = Стр.СуммаПроцентовДень;
			Движение.ПроцентнаяСтавкаБазовая = Стр.ПроцентнаяСтавкаБазовая;
			Движение.ПроцентнаяСтавкаАкция = Стр.ПроцентнаяСтавкаАкция;
			Движение.ОтклонениеАкцияАбсолютное = Стр.ОтклонениеАкцияАбсолютное;
			Движение.ОтклонениеАкцияОтностельное = Стр.ОтклонениеАкцияОтносительное;
		КонецЦикла;	    
		
		Если НЕ Этотобъект.НачислениеПроцентовДетально.Количество() = 0 Тогда
	        Движения.ЛБ_РасчетыСКлиентами.Записывать = Истина;
			Движение = Движения.ЛБ_РасчетыСКлиентами.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Этотобъект.ПредыдущаяОперация.Организация;
			Движение.ДатаНачалаРасчета = ДатаНачалаРасчетаНач;
			Движение.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам;
			Движение.Клиент = ЭтотОбъект.ПредыдущаяОперация.Залогодатель;
			Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Сумма = НачислениеПроцентовДетально.Итог("СуммаПроцентов");   
			
			СуммаНачисленоБУ = 0;  
			ЗапросРасчеты = Новый Запрос;  
			ЗапросРасчеты.УстановитьПараметр("ЗалоговыйБилет", ЭтотОбъект.ПредыдущаяОперация);
			ЗапросРасчеты.УстановитьПараметр("Организация", ЭтотОбъект.ПредыдущаяОперация.Организация); 
			ЗапросРасчеты.УстановитьПараметр("ДатаНачалаРасчета", ДатаНачалаРасчетаНач); 
			ЗапросРасчеты.УстановитьПараметр("Дата", Этотобъект.Дата); 
			ЗапросРасчеты.Текст = "ВЫБРАТЬ
			                      |	ЛБ_РасчетыСКлиентамиБУ.Регистратор КАК Регистратор,
			                      |	ЛБ_РасчетыСКлиентамиБУ.ЗалоговыйБилет КАК ЗалоговыйБилет,
			                      |	ЛБ_РасчетыСКлиентамиБУ.Сумма КАК Сумма
			                      |ИЗ
			                      |	РегистрНакопления.ЛБ_РасчетыСКлиентамиБУ КАК ЛБ_РасчетыСКлиентамиБУ
			                      |ГДЕ
			                      |	ЛБ_РасчетыСКлиентамиБУ.ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыРасчетов.ПоПроцентам)
			                      |	И ЛБ_РасчетыСКлиентамиБУ.ЗалоговыйБилет = &ЗалоговыйБилет
			                      |	И ЛБ_РасчетыСКлиентамиБУ.Организация = &Организация
			                      |	И ЛБ_РасчетыСКлиентамиБУ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			                      |	И ЛБ_РасчетыСКлиентамиБУ.ДатаНачалаРасчета = &ДатаНачалаРасчета
			                      |	И ЛБ_РасчетыСКлиентамиБУ.Период < &Дата
			                      |
			                      |УПОРЯДОЧИТЬ ПО
			                      |	ЛБ_РасчетыСКлиентамиБУ.Период УБЫВ";
			ВыборкаБУ = ЗапросРасчеты.Выполнить().Выбрать();
			СуммаОтмены = 0;
			Пока ВыборкаБУ.Следующий() Цикл 
				Если НЕ ТипЗнч(ВыборкаБУ.Регистратор) = Тип("ДокументСсылка.ЛБ_РегламентноеНачислениеПроцентов") Тогда
					Если ВыборкаБУ.Сумма < 0 Тогда //отмена 
						СуммаОтмены = ВыборкаБУ.Сумма;
						Продолжить;
					ИначеЕсли (ВыборкаБУ.Сумма + СуммаОтмены) = 0 Тогда 
						СуммаОтмены = 0;
						Продолжить;
					Иначе	
					    Прервать;
					КонецЕсли;	
				КонецЕсли;	
				СуммаНачисленоБУ = СуммаНачисленоБУ + ВыборкаБУ.Сумма;
			КонецЦикла;	 
			СуммаПроцентовНачисленоБУ = НачислениеПроцентовДетально.Итог("СуммаПроцентов") - СуммаНачисленоБУ;
			
			Если НЕ СуммаПроцентовНачисленоБУ = 0 Тогда
				Движение = Движения.ЛБ_РасчетыСКлиентамиБУ.Добавить();
				Движение.Период = Дата;     
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Организация = ЭтотОбъект.ПредыдущаяОперация.Организация; 
				Движение.Ломбард = ЭтотОбъект.ПредыдущаяОперация.Ломбард;
				Движение.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам;
				Движение.Клиент = ЭтотОбъект.ПредыдущаяОперация.Залогодатель;
				Движение.ЗалоговыйБилет = ЭтотОбъект.ПредыдущаяОперация;
				Движение.ДатаНачалаРасчета = ДатаНачалаРасчетаНач;
				Движение.Сумма = СуммаПроцентовНачисленоБУ; 
			КонецЕсли;	
		КонецЕсли;	
		
		Если НЕ ЭтотОбъект.Товары.Итог("СуммаОплаты") = 0 Тогда  
			Движение = Движения.ЛБ_РасчетыСКлиентами.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Этотобъект.ПредыдущаяОперация.Организация;
			Движение.ДатаНачалаРасчета = Этотобъект.Дата;
			Движение.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоОсновномуДолгу;
			Движение.Клиент = ЭтотОбъект.ПредыдущаяОперация.Залогодатель;
			Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Сумма = ЭтотОбъект.Товары.Итог("СуммаОплаты"); 
			
			Движения.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Записывать = Истина;
			Для каждого Стр Из ЭтотОбъект.Товары Цикл 
				Если Стр.СуммаОплаты = 0 Тогда
					Продолжить;
				КонецЕсли;	
			    Движение = Движения.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Клиент = ЭтотОбъект.ПредыдущаяОперация.Залогодатель;
				Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация;
				Движение.ОбъектЗалога = Стр.ОбъектЗалога;
				Движение.Сумма = Стр.СуммаОплаты;
	       КонецЦикла;
	   КонецЕсли;	  
	   
	   Если ЛБ_УправлениеЛомбардом.ПроверитьСхемуКредитованияУчастиеВРасчетеСтатусовПоСистемеЛояльности(Дата, ЭтотОбъект.ПредыдущаяОперация.СхемаКредитования) Тогда
		   СтатусСтарый = ЛБ_УправлениеЛомбардом.ПолучитьТекущийСтатусКлиента(Дата, ЭтотОбъект.ПредыдущаяОперация.Залогодатель);
		   НовыйСтатусЗалогодаталя = ЛБ_УправлениеЛомбардом.ПроверкаСтатусаЗалогодателя(Дата, ЭтотОбъект.ПредыдущаяОперация.Залогодатель, СтатусСтарый, , Истина);
		   Если НЕ СтатусСтарый = НовыйСтатусЗалогодаталя Тогда
				Движения.ЛБ_СтатусыЗалогодателей.Записывать = Истина; 
				Движение = Движения.ЛБ_СтатусыЗалогодателей.Добавить();
				Движение.Период = Дата;
				Движение.Залогодатель = ЭтотОбъект.ПредыдущаяОперация.Залогодатель;
			    Движение.Статус =  НовыйСтатусЗалогодаталя;
		   КонецЕсли;	 
       КонецЕсли;
		
    ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога Тогда
		СтруктураРез = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗалоговогоБилета(ЭтотОбъект, ПредыдущаяОперация); 
		ДатаНачалаРасчетаНач = СтруктураРез.ДатаНачалаРасчета; 
		ДатаВыкупа = СтруктураРез.ДатаВыкупа;
		ДатаВыкупаЛьготная = СтруктураРез.ДатаВыкупаЛьготныйСрок;  
		СуммаЗайма = СтруктураРез.СуммаЗайма;  
		ПричинаПримененияНач = СтруктураРез.ПричинаПрименения; 
		НомерДопСоглашения = СтруктураРез.НомерДопСоглашения;
		
		Движения.ЛБ_ОборотыПоОперациямЗайма.Записывать = Истина;
		Движение = Движения.ЛБ_ОборотыПоОперациямЗайма.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Этотобъект.ПредыдущаяОперация.Организация;
		Движение.Ломбард = Ломбард;
		Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация;
		Движение.Залогодатель = ЭтотОбъект.ПредыдущаяОперация.Залогодатель;
		Движение.ВидОперации = ЭтотОбъект.ВидОперации; 
		Движение.СуммаСсуды = СуммаЗайма;
		
		ЗапросИзъят = Новый Запрос;
		ЗапросИзъят.УстановитьПараметр("Дата", Дата); 
		ЗапросИзъят.УстановитьПараметр("ЗалоговыйБилет", ЭтотОбъект.ПредыдущаяОперация);
		ЗапросИзъят.Текст ="ВЫБРАТЬ
		                   |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога
		                   |ИЗ
		                   |	РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(
		                   |			&Дата,
		                   |			ЗалоговыйБилет = &ЗалоговыйБилет
		                   |				И СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Изъят)) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних";
		ТаблицаИзъят = ЗапросИзъят.Выполнить().Выгрузить();
		УдСтрокиИзъят = Новый СписокЗначений;
		
		КоличествоВозвращено = 0;
	    Движения.ЛБ_ОбъектыЗалога.Записывать = Истина;
		Движения.ЛБ_СостояниеОбъектаЗалога.Записывать = Истина;
		Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Записывать = Истина;
		Для каждого Стр Из ЭтотОбъект.ТоварыИзъятыеВозвращенные цикл  
			СтруктураСостояниеОЗ = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектовЗалогаЗалоговогоБилета(ЭтотОбъект.Дата, ЭтотОбъект.ПредыдущаяОперация, Стр.ОбъектЗалога);
			Движение = Движения.ЛБ_ОбъектыЗалога.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Организация = Этотобъект.ПредыдущаяОперация.Организация;
			Движение.Ломбард = Ломбард;
			Если Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис тогда 
				Движение.Склад = ЛБ_ОбщийМодуль.ПолучитьСклад(Ломбард, Перечисления.ЛБ_ВидыСкладов.ОбщийСкладЦО);
			Иначе	
			    Движение.Склад = СкладЛомбарда;  
			КонецЕсли;	
			Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация;
			Движение.ОбъектЗалога = Стр.ОбъектЗалога;
			Движение.Количество = 1;
			Движение.СуммаОценки = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОценки);  
			//Движение.СуммаОценкиНачальная = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОценкиНач);		
			КоличествоВозвращено = КоличествоВозвращено + 1;
			
		    Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить();
			Движение.Период = Дата;
			Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация;
			Движение.ОбъектЗалога = Стр.ОбъектЗалога;
			Движение.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.Возвращен; 
			Движение.СуммаОценки = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОценки);
			Движение.СуммаОценкиНачальная = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОценкиНач);
			Движение.СуммаЗайма = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаЗайма);
			Движение.СуммаОплаты = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОплаты); 
			Движение.СуммаДолгаЗайма = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаДолгаЗайма); 
		
			ОтборИзъят = новый Структура; 
			ОтборИзъят.Вставить("ОбъектЗалога", Стр.ОбъектЗалога);
			СтрокиИ = ТаблицаИзъят.НайтиСтроки(ОтборИзъят);
			Если НЕ СтрокиИ.Количество() = 0 Тогда 
				УдСтрокиИзъят.Добавить(СтрокиИ.Получить(0)); 
			КонецЕсли;	
		КонецЦикла;  
		
		Для каждого Эл Из УдСтрокиИзъят Цикл
			ТаблицаИзъят.Удалить(Эл.Значение);
		КонецЦикла;	  
		
		Если НЕ КоличествоВозвращено = 0 Тогда
			Движение = Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Добавить(); 
			Движение.Период = Дата;
			Движение.Организация = Этотобъект.ПредыдущаяОперация.Организация; 
			Если Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис тогда   
				Движение.ПодразделениеОсновное = ЭтотОбъект.Ломбард;  
				Движение.СкладОсновной = ЛБ_ОбщийМодуль.ПолучитьСклад(Ломбард, Перечисления.ЛБ_ВидыСкладов.ОбщийСкладЦО);
				Движение.ПодразделениеПолучатель = Движение.ПодразделениеОсновное;
		        Движение.СкладПолучатель = Движение.СкладОсновной;
			Иначе	
				Движение.ПодразделениеОсновное = ЭтотОбъект.ПредыдущаяОперация.Ломбард;  
				Движение.СкладОсновной = СкладЛомбарда;
				Движение.ПодразделениеПолучатель = ЭтотОбъект.ПредыдущаяОперация.Ломбард;
		        Движение.СкладПолучатель = СкладЛомбарда;
			КонецЕсли;	
			Движение.Количество = КоличествоВозвращено;  
			Движение.Ответственный = ЭтотОбъект.ОтветственныйСотрудник; 
			Движение.НомерЗБ = ЭтотОбъект.ПредыдущаяОперация.НомерЗалоговогоБилета;
			Движение.ВидОперации = "Возврат залогов";
		КонецЕсли;	

		Движения.ЛБ_СостояниеЗалоговогоБилета.Записывать = Истина;
		Движение = Движения.ЛБ_СостояниеЗалоговогоБилета.Добавить();
		Движение.Период = Дата;
		Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация; 
		Движение.Залогодатель = Движение.ЗалоговыйБилет.Залогодатель;
		Движение.НомерЗалоговогоБилета = Этотобъект.ПредыдущаяОперация.НомерЗалоговогоБилета;
		Движение.СтатусЗалоговогоБилета = ?(ТаблицаИзъят.Количество() = 0, Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен, Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят); 
		Движение.СхемаКредитования = Этотобъект.ПредыдущаяОперация.СхемаКредитования;
		Движение.ПричинаПрименения = ПричинаПримененияНач;
		Движение.ДатаВыкупа = ДатаВыкупа;
		Движение.ДатаВыкупаЛьготныйСрок = ДатаВыкупаЛьготная;
		Движение.ДатаНачалаРасчетаПроцентов = ДатаНачалаРасчетаНач;
		Движение.НомерДопСоглашения = НомерДопСоглашения;
		Движение.СуммаЗайма = СуммаЗайма;  
		
	ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОстановкаПроцентов Тогда
		СтруктураРез = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗалоговогоБилета(ЭтотОбъект, ПредыдущаяОперация); 
		ДатаНачалаРасчетаНач = СтруктураРез.ДатаНачалаРасчета; 
		ДатаВыкупа = СтруктураРез.ДатаВыкупа;
		ДатаВыкупаЛьготная = СтруктураРез.ДатаВыкупаЛьготныйСрок;  
		СуммаЗайма = СтруктураРез.СуммаЗайма;                 
		ПричинаПримененияНач = СтруктураРез.ПричинаПрименения; 
		СтатусНачальный = СтруктураРез.СтатусЗалоговогоБилета;
		
		Движения.ЛБ_ОборотыПоОперациямЗайма.Записывать = Истина;
		Движение = Движения.ЛБ_ОборотыПоОперациямЗайма.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Этотобъект.ПредыдущаяОперация.Организация;
		Движение.Ломбард = Ломбард;
		Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация;
		Движение.Залогодатель = ЭтотОбъект.ПредыдущаяОперация.Залогодатель;
		Движение.ВидОперации = ЭтотОбъект.ВидОперации; 
		Движение.СуммаСсуды = СуммаЗайма;   
		Если НЕ ЭтотОбъект.Товары.Итог("СуммаОплаты") = 0 Тогда
		    Движение.СуммаОплатыЗайм = ЭтотОбъект.Товары.Итог("СуммаОплаты");  
		КонецЕсли;	
			
		Движения.ЛБ_СостояниеЗалоговогоБилета.Записывать = Истина;
		Движение = Движения.ЛБ_СостояниеЗалоговогоБилета.Добавить();
		Движение.Период = Дата;
		Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация; 
		Движение.Залогодатель = Движение.ЗалоговыйБилет.Залогодатель;
		Движение.НомерЗалоговогоБилета = Этотобъект.ПредыдущаяОперация.НомерЗалоговогоБилета;
		Движение.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Остановлен; 
		Движение.СхемаКредитования = ЭтотОбъект.ПредыдущаяОперация.СхемаКредитования;
		Движение.ПричинаПрименения = ПричинаПримененияНач;
		Движение.ДатаВыкупа = ДатаВыкупа;
		Движение.ДатаВыкупаЛьготныйСрок = ДатаВыкупаЛьготная;	
		Движение.СуммаЗайма = СуммаЗайма; 
		
		Движения.ЛБ_НачислениеПроцентовДетально.Записывать = Истина;
		Для каждого Стр из Этотобъект.НачислениеПроцентовДетально Цикл	
			Движение = Движения.ЛБ_НачислениеПроцентовДетально.Добавить();
			Движение.Период = Дата;     
			Движение.ЗалоговыйБилет = ЭтотОбъект.ПредыдущаяОперация; 
			Движение.ДатаНачалаРасчета = ДатаНачалаРасчетаНач;
            Движение.ВидПроцентнойСтавки = стр.ВидПроцентнойСтавки;
			Движение.ДатаНач = стр.ДатаНач;
			Движение.ДатаКон = стр.ДатаКон;
			Движение.ДеньНач = Стр.ДеньНач;
			Движение.ДеньКон = Стр.ДеньКон;
			Движение.СуммаПроцентов = Стр.СуммаПроцентов;
			Движение.СуммаПроцентовДень = Стр.СуммаПроцентовДень;
			Движение.ПроцентнаяСтавкаБазовая = Стр.ПроцентнаяСтавкаБазовая;
			Движение.ПроцентнаяСтавкаАкция = Стр.ПроцентнаяСтавкаАкция;
			Движение.ОтклонениеАкцияАбсолютное = Стр.ОтклонениеАкцияАбсолютное;
			Движение.ОтклонениеАкцияОтностельное = Стр.ОтклонениеАкцияОтносительное;
		КонецЦикла;	    
		
		Если НЕ Этотобъект.НачислениеПроцентовДетально.Количество() = 0 Тогда
	        Движения.ЛБ_РасчетыСКлиентами.Записывать = Истина;
			Движение = Движения.ЛБ_РасчетыСКлиентами.Добавить();
			Движение.Период = Дата;  
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Организация = Этотобъект.ПредыдущаяОперация.Организация;
			Движение.ДатаНачалаРасчета = Этотобъект.Дата;
			Движение.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам;
			Движение.Клиент = ЭтотОбъект.ПредыдущаяОперация.Залогодатель;
			Движение.ЗалоговыйБилет = Этотобъект.ПредыдущаяОперация;
			Движение.Сумма = НачислениеПроцентовДетально.Итог("СуммаПроцентов"); 
			
			СуммаНачисленоБУ = 0;  
			ЗапросРасчеты = Новый Запрос;  
			ЗапросРасчеты.УстановитьПараметр("ЗалоговыйБилет", ЭтотОбъект.ПредыдущаяОперация);
			ЗапросРасчеты.УстановитьПараметр("Организация", ЭтотОбъект.ПредыдущаяОперация.Организация); 
			ЗапросРасчеты.УстановитьПараметр("ДатаНачалаРасчета", ДатаНачалаРасчетаНач); 
			ЗапросРасчеты.УстановитьПараметр("Дата", Этотобъект.Дата); 
			ЗапросРасчеты.Текст = "ВЫБРАТЬ
			                      |	ЛБ_РасчетыСКлиентамиБУ.Регистратор КАК Регистратор,
			                      |	ЛБ_РасчетыСКлиентамиБУ.ЗалоговыйБилет КАК ЗалоговыйБилет,
			                      |	ЛБ_РасчетыСКлиентамиБУ.Сумма КАК Сумма
			                      |ИЗ
			                      |	РегистрНакопления.ЛБ_РасчетыСКлиентамиБУ КАК ЛБ_РасчетыСКлиентамиБУ
			                      |ГДЕ
			                      |	ЛБ_РасчетыСКлиентамиБУ.ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыРасчетов.ПоПроцентам)
			                      |	И ЛБ_РасчетыСКлиентамиБУ.ЗалоговыйБилет = &ЗалоговыйБилет
			                      |	И ЛБ_РасчетыСКлиентамиБУ.Организация = &Организация
			                      |	И ЛБ_РасчетыСКлиентамиБУ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			                      |	И ЛБ_РасчетыСКлиентамиБУ.ДатаНачалаРасчета = &ДатаНачалаРасчета
			                      |	И ЛБ_РасчетыСКлиентамиБУ.Период < &Дата
			                      |
			                      |УПОРЯДОЧИТЬ ПО
			                      |	ЛБ_РасчетыСКлиентамиБУ.Период УБЫВ";
			ВыборкаБУ = ЗапросРасчеты.Выполнить().Выбрать(); 
			СуммаОтмены = 0;
			Пока ВыборкаБУ.Следующий() Цикл 
				Если НЕ ТипЗнч(ВыборкаБУ.Регистратор) = Тип("ДокументСсылка.ЛБ_РегламентноеНачислениеПроцентов") Тогда
					Если ВыборкаБУ.Сумма < 0 Тогда //отмена 
						СуммаОтмены = ВыборкаБУ.Сумма;
						Продолжить;
					ИначеЕсли (ВыборкаБУ.Сумма + СуммаОтмены) = 0 Тогда 
						СуммаОтмены = 0;
						Продолжить;
					Иначе	
					    Прервать;
					КонецЕсли;	
				КонецЕсли;	
				СуммаНачисленоБУ = СуммаНачисленоБУ + ВыборкаБУ.Сумма;
			КонецЦикла;	 
			СуммаПроцентовНачисленоБУ = НачислениеПроцентовДетально.Итог("СуммаПроцентов") - СуммаНачисленоБУ;
			
			Если НЕ СуммаПроцентовНачисленоБУ = 0 Тогда
				Движение = Движения.ЛБ_РасчетыСКлиентамиБУ.Добавить();
				Движение.Период = Дата;     
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Организация = ЭтотОбъект.ПредыдущаяОперация.Организация; 
				Движение.Ломбард = ЭтотОбъект.ПредыдущаяОперация.Ломбард;
				Движение.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам;
				Движение.Клиент = ЭтотОбъект.ПредыдущаяОперация.Залогодатель;
				Движение.ЗалоговыйБилет = ЭтотОбъект.ПредыдущаяОперация;
				Движение.ДатаНачалаРасчета = ДатаНачалаРасчетаНач;
				Движение.Сумма = СуммаПроцентовНачисленоБУ; 
			КонецЕсли;	
		КонецЕсли;	
		
	//+Мельников 25.05.24 Отмена операции
	ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаОплаты Тогда

		ЗалоговыйБилет = ЭтотОбъект.ПредыдущаяОперация; 
		Если ЭтотОбъект.ОтмененныйДокумент.БезналичнаяОплата Тогда  
			СостояниеДоОтменяемойОперации = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБПриОтменеБезналичнойОплаты(ЗалоговыйБилет, ЭтотОбъект.ОтмененныйДокумент);
		Иначе	
		    СостояниеДоОтменяемойОперации = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(ЗалоговыйБилет.НомерЗалоговогоБилета, ЭтотОбъект.ОтмененныйДокумент.Дата-1);
		КонецЕсли;
		
		НаборЗаписей = РегистрыНакопления.ЛБ_ОборотыПоОперациямЗайма.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.ОтмененныйДокумент);
		НаборЗаписей.Прочитать();   

		Движения.ЛБ_ОборотыПоОперациямЗайма.Записывать = Истина;
		Для каждого Запись Из НаборЗаписей Цикл				
			Движение = Движения.ЛБ_ОборотыПоОперациямЗайма.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Запись.Организация;
			Движение.Ломбард = Запись.Ломбард;
			Движение.ЗалоговыйБилет = Запись.ЗалоговыйБилет;
			Движение.Залогодатель = Запись.ЗалоговыйБилет.Залогодатель;
			Движение.ВидОперации = ЭтотОбъект.ВидОперации;		
			//Движение.СуммаСсуды = СостояниеДоОтменяемойОперации.Регистратор.СуммаСсуды;  
			Движение.СуммаСсуды = СостояниеДоОтменяемойОперации.СуммаЗайма; //ов-03.10.2024 регистратор Накладная на отгрузку
			Движение.СуммаОплатыЗайм = -Запись.СуммаОплатыЗайм;
			Движение.СуммаОплатыПроценты = -Запись.СуммаОплатыПроценты;  
			Движение.НакладнаяНаОтгрузку = ЛБ_УправлениеЛомбардом.ПолучитьНакладнуюНаОтгрузкуЗалогоговогоБилета(ЭтотОбъект.ОтмененныйДокумент.Дата - 1, ЗалоговыйБилет); 
			Движение.РеестрПлатежей = Запись.РеестрПлатежей; 
			Если ЗначениеЗаполнено(Движение.РеестрПлатежей) Тогда 
				Если Движение.РеестрПлатежей = Перечисления.ЛБ_ВидыБезналичныхПлатежей.РасчетыйСчет Тогда 
			        Комментарий = "п/п № " + СокрЛП(ЭтотОбъект.ОтмененныйДокумент.ИдентификаторПлатежа) + " от " + Формат(ЭтотОбъект.ОтмененныйДокумент.ДатаПлатежа, "ДФ=dd.MM.yyyy") + "/" + СокрЛП(ЭтотОбъект.ОтмененныйДокумент.РеестрПлатежей.ИмяФайла);  
				Иначе	
					Комментарий = СокрЛП(ЭтотОбъект.ОтмененныйДокумент.ИдентификаторПлатежа) + " от " + Формат(ЭтотОбъект.ОтмененныйДокумент.ДатаПлатежа, "ДФ=dd.MM.yyyy") + "/" + СокрЛП(ЭтотОбъект.ОтмененныйДокумент.РеестрПлатежей.ИмяФайла);
				КонецЕсли;  
				Движение.Комментарий = "Отмена платежа " + Комментарий + " сотрудником ЦО";
			КонецЕсли;	
		КонецЦикла;	 

		НаборЗаписей = РегистрыНакопления.ЛБ_ДенежныеСредства.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.ОтмененныйДокумент);
		НаборЗаписей.Прочитать();
		
		Движения.ЛБ_ДенежныеСредства.Записывать = Истина;
		Для каждого Запись Из НаборЗаписей Цикл				
			Движение = Движения.ЛБ_ДенежныеСредства.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Запись.Организация;
			Движение.ВидДвижения = Запись.ВидДвижения;
			Движение.ВидДенежныхСредств = Запись.ВидДенежныхСредств;
			Движение.Ломбард = Запись.Ломбард;		
			Движение.Сумма = -Запись.Сумма; 
		КонецЦикла;	 

		НаборЗаписей = РегистрыНакопления.ЛБ_ДвиженияДенежныхСредств.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.ОтмененныйДокумент);
		НаборЗаписей.Прочитать(); 

		Движения.ЛБ_ДвиженияДенежныхСредств.Записывать = Истина;
		Для каждого Запись Из НаборЗаписей Цикл				
			Движение = Движения.ЛБ_ДвиженияДенежныхСредств.Добавить();
			Движение.Период = Дата; 
			Движение.Номер = Запись.Номер;
			Движение.Организация = Запись.Организация;
			Движение.ВидДенежныхСредств = Запись.ВидДенежныхСредств;
			Движение.Ломбард = Запись.Ломбард;	
			Движение.ВидДвиженияДС = Перечисления.ЛБ_ВидыДвиженияДС.Приход; 
			Движение.Сумма = -Запись.Сумма; 
			Движение.БанковскаяКарта = Запись.БанковскаяКарта;
			Движение.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ОтменаОплатыПоЗаймуПереоформлению;
			Движение.КассоваяСмена = Запись.КассоваяСмена;
			Если ЗначениеЗаполнено(КассоваяСмена) Тогда  
				Если НЕ ЗначениеЗаполнено(СводныйПКО) Тогда  
					СводныйПКО = ЛБ_ОбщийМодуль.СоздатьСводныйПКО(КассоваяСмена.Дата, Организация, Ломбард); 				
					ПроводитьПоКассовойСмене = Истина;
				КонецЕсли;
				Движение.КассоваяОперация = СводныйПКО;  
				Движение.Номер = СводныйПКО.ПредставлениеНомераПКО;
			КонецЕсли;	
			Движение.ДополнительнаяИнформация = Запись.ДополнительнаяИнформация;
			Результат = ЛБ_ОбщийМодуль.ЗаполнитьДтКт(Движение.ВидОперации);
		    Движение.Дт = Результат.Дт;
		    Движение.Кт = Результат.Кт;
			Движение.ДУЛ = Запись.ДУЛ;
			Движение.Контрагент = Запись.Контрагент;
			Движение.Основание = Запись.Основание;
			Движение.ФизическоеЛицо = Запись.ФизическоеЛицо;
			Движение.ФИО = Запись.ФИО;
		КонецЦикла;

		//НаборЗаписей = РегистрыНакопления.ЛБ_ОперацииПоСистемеЛояльности.СоздатьНаборЗаписей();
		//НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.ОтмененныйДокумент);
		//НаборЗаписей.Прочитать(); 

		//Движения.ЛБ_ОперацииПоСистемеЛояльности.Записывать = Истина;
		//Для каждого Запись Из НаборЗаписей Цикл				
		//	Движение = Движения.ЛБ_ОперацииПоСистемеЛояльности.Добавить();
		//	Движение.Период = Дата;
		//	Движение.Залогодатель = Запись.Залогодатель;
		//	Движение.КоличествоВыкупов = -Запись.КоличествоВыкупов;	
		//	Движение.КоличествоЗалогов = -Запись.КоличествоЗалогов; 
		//	Движение.СуммаВыкупов = -Запись.СуммаВыкупов; 
		//	Движение.СуммаЗаймов = -Запись.СуммаЗаймов;
		//	Движение.СуммаОплаченныхПроцентов = -Запись.СуммаОплаченныхПроцентов;
		//КонецЦикла;	 

		НаборЗаписей = РегистрыНакопления.ЛБ_РасчетыСКлиентами.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.ОтмененныйДокумент);
		НаборЗаписей.Прочитать(); 

		Движения.ЛБ_РасчетыСКлиентами.Записывать = Истина;
		Для каждого Запись Из НаборЗаписей Цикл				
			Движение = Движения.ЛБ_РасчетыСКлиентами.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Запись.Организация;
			Движение.ВидДвижения = Запись.ВидДвижения;
			Движение.ВидРасчета = Запись.ВидРасчета;
			Движение.ДатаНачалаРасчета = Запись.ДатаНачалаРасчета;	
			Движение.ЗалоговыйБилет = Запись.ЗалоговыйБилет; 
			Движение.Клиент = Запись.Клиент; 
			Движение.КоличествоДнейРасчета = Запись.КоличествоДнейРасчета;
			Движение.Комментарий = Запись.Комментарий;
			Движение.Сумма = -Запись.Сумма; 
		КонецЦикла;	   

		НаборЗаписей = РегистрыНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.ОтмененныйДокумент);
		НаборЗаписей.Прочитать(); 

		Движения.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Записывать = Истина;
		Для каждого Запись Из НаборЗаписей Цикл				
			Движение = Движения.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Добавить();
			Движение.Период = Дата;
			Движение.ВидДвижения = ?(Запись.ВидДвижения = ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);
			Движение.ЗалоговыйБилет = Запись.ЗалоговыйБилет; 
			Движение.Клиент = Запись.Клиент; 
			Движение.ОбъектЗалога = Запись.ОбъектЗалога;
			Движение.Сумма = -Запись.Сумма; 
		КонецЦикла;	    

		НаборЗаписей = РегистрыНакопления.ЛБ_НачислениеПроцентовДетально.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.ОтмененныйДокумент);
		НаборЗаписей.Прочитать(); 

		Движения.ЛБ_НачислениеПроцентовДетально.Записывать = Истина;
		Для каждого Запись Из НаборЗаписей Цикл				
			Движение = Движения.ЛБ_НачислениеПроцентовДетально.Добавить();
			Движение.Период = Дата;
			Движение.ВидПроцентнойСтавки = Запись.ВидПроцентнойСтавки;
			Движение.ЗалоговыйБилет = Запись.ЗалоговыйБилет; 
			Движение.ДатаНачалаРасчета = Запись.ДатаНачалаРасчета;
			Движение.ДатаНач = Запись.ДатаНач; 
			Движение.ДатаКон = Запись.ДатаКон;
			Движение.ДеньНач = Запись.ДеньНач; 
			Движение.ДеньКон = Запись.ДеньКон;
			Движение.ОтклонениеАкцияАбсолютное = Запись.ОтклонениеАкцияАбсолютное; 
			Движение.ОтклонениеАкцияОтностельное = Запись.ОтклонениеАкцияОтностельное;
			Движение.ПроцентнаяСтавкаАкция = Запись.ПроцентнаяСтавкаАкция;
			Движение.ПроцентнаяСтавкаБазовая = Запись.ПроцентнаяСтавкаБазовая;
			Движение.СуммаПроцентов = -Запись.СуммаПроцентов;  
			Движение.СуммаПроцентовДень = -Запись.СуммаПроцентовДень;
		КонецЦикла;	   

		НаборЗаписей = РегистрыНакопления.ЛБ_ОбъектыЗалога.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.ОтмененныйДокумент);
		НаборЗаписей.Прочитать(); 

		Движения.ЛБ_ОбъектыЗалога.Записывать = Истина;
		Для каждого Запись Из НаборЗаписей Цикл				
			Движение = Движения.ЛБ_ОбъектыЗалога.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Запись.Организация;
			Движение.ВидДвижения = Запись.ВидДвижения;
			Движение.ЗалоговыйБилет = Запись.ЗалоговыйБилет; 
			Движение.Ломбард = Запись.Ломбард;                 
			Движение.Склад = Запись.Склад;
			Движение.ОбъектЗалога = Запись.ОбъектЗалога; 
			Движение.Количество = -Запись.Количество;
			Движение.СуммаОценки = -Запись.СуммаОценки; 
			//Движение.СуммаОценкиНачальная = -Запись.СуммаОценкиНачальная;  
		КонецЦикла;	      
		
		НаборЗаписей = РегистрыСведений.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.ОтмененныйДокумент);
		НаборЗаписей.Прочитать(); 

		Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Записывать = Истина;
		Для каждого Запись Из НаборЗаписей Цикл				
			Движение = Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Добавить(); 
			Движение.Период = Дата;
			Движение.Организация = Запись.Организация;         
			Движение.ПодразделениеОсновное = Запись.ПодразделениеОсновное;
			Движение.СкладОсновной = Запись.СкладОсновной;
			Движение.ПодразделениеОтправитель = Запись.ПодразделениеОтправитель; 
			Движение.СкладОтправитель = Запись.СкладОтправитель; 
			Движение.ПодразделениеПолучатель = Запись.ПодразделениеПолучатель;
            Движение.СкладПолучатель = Запись.СкладПолучатель; 
			Движение.Количество = -Запись.Количество;  
			Движение.Ответственный = ЭтотОбъект.ОтветственныйСотрудник;
			Движение.НомерЗБ = Запись.НомерЗБ;
			Движение.ВидОперации = "Отмена выкупа";
		КонецЦикла;	    


		Движения.ЛБ_СостояниеОбъектаЗалога.Записывать = Истина; 
		Для каждого Стр Из ЭтотОбъект.ТоварыОтмена Цикл

			Если Стр.Статус <> Перечисления.ЛБ_СтатусыОбъектовЗалога.Выкуплен Тогда
				СтруктураСостояниеОЗ = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектовЗалогаЗалоговогоБилета(ЭтотОбъект.Дата, ЗалоговыйБилет, Стр.ОбъектЗалога, Истина, СостояниеДоОтменяемойОперации.Регистратор);
				
				Если СтруктураСостояниеОЗ <> Неопределено Тогда
					Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить();
					Движение.Период = Дата; 			
					Движение.ЗалоговыйБилет = ЗалоговыйБилет; 	
					Движение.ОбъектЗалога = Стр.ОбъектЗалога;
					Движение.СтатусОбъектаЗалога = Стр.Статус;
					Движение.СуммаОценки = СтруктураСостояниеОЗ.СуммаОценки; 
					Движение.СуммаОценкиНачальная = СтруктураСостояниеОЗ.СуммаОценкиНач;
					Движение.СуммаЗайма = СтруктураСостояниеОЗ.СуммаЗайма;
					Движение.СуммаОплаты = СтруктураСостояниеОЗ.СуммаОплаты;
					Движение.СуммаДолгаЗайма = СтруктураСостояниеОЗ.СуммаДолгаЗайма;// + СтруктураСостояниеОЗ.СуммаОплаты;
				КонецЕсли;
				
			Иначе
				СтруктураСостояниеОЗ = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектовЗалогаЗалоговогоБилета(Этотобъект.ОтмененныйДокумент.Дата-1, ЗалоговыйБилет, Стр.ОбъектЗалога);

				Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить();
				Движение.Период = Дата; 			
				Движение.ЗалоговыйБилет = ЗалоговыйБилет;
				Движение.ОбъектЗалога = Стр.ОбъектЗалога;
				Движение.СтатусОбъектаЗалога = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СтатусОбъектаЗалога);
				Движение.СуммаОценки = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОценки);
				Движение.СуммаЗайма = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаЗайма);
				Движение.СуммаОплаты = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОплаты); 
				Движение.СуммаДолгаЗайма = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаДолгаЗайма);

			КонецЕсли;

		Конеццикла;

		Движения.ЛБ_СостояниеЗалоговогоБилета.Записывать = Истина;

		Если СостояниеДоОтменяемойОперации <> Неопределено Тогда
			Движение = Движения.ЛБ_СостояниеЗалоговогоБилета.Добавить();
			Движение.Период = Дата; 
			Движение.Залогодатель = ЗалоговыйБилет.Залогодатель;
			Движение.ЗалоговыйБилет = ЗалоговыйБилет;
			Движение.НомерЗалоговогоБилета = ЗалоговыйБилет.НомерЗалоговогоБилета;
			Движение.СхемаКредитования = ЗалоговыйБилет.СхемаКредитования;
			Движение.ПричинаПрименения = СостояниеДоОтменяемойОперации.ПричинаПрименения;
			Движение.СтатусЗалоговогоБилета = СостояниеДоОтменяемойОперации.СтатусЗалоговогоБилета;
			Движение.СуммаЗайма = СостояниеДоОтменяемойОперации.СуммаЗайма;
			Движение.ДатаНачалаРасчетаПроцентов = СостояниеДоОтменяемойОперации.ДатаНачалаРасчетаПроцентов;
			Движение.НомерДопСоглашения = СостояниеДоОтменяемойОперации.НомерДопСоглашения;
			Движение.ДатаВыкупа = СостояниеДоОтменяемойОперации.ДатаВыкупа;
			Движение.ДатаВыкупаЛьготныйСрок = СостояниеДоОтменяемойОперации.ДатаВыкупаЛьготныйСрок;
			Движение.СуммаПроцентовСрок = СостояниеДоОтменяемойОперации.СуммаПроцентовСрок;
			Движение.СуммаПроцентовДень = -СостояниеДоОтменяемойОперации.СуммаПроцентовДень;
			Движение.ПредельныйСрокЗаймаДни = СостояниеДоОтменяемойОперации.ПредельныйСрокЗаймаДни;
			Движение.ДатаОстановкиНачислений = СостояниеДоОтменяемойОперации.ДатаОстановкиНачислений;
		КонецЕсли;

		НаборЗаписей = РегистрыНакопления.ЛБ_РасчетыСКлиентамиБУ.СоздатьНаборЗаписей();
	    НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.ОтмененныйДокумент);
	    НаборЗаписей.Прочитать(); 
		
		Движения.ЛБ_РасчетыСКлиентамиБУ.Записывать = Истина;
		Для каждого Запись Из НаборЗаписей Цикл				
			Движение = Движения.ЛБ_РасчетыСКлиентамиБУ.Добавить();
			Движение.Период = Дата;
			Движение.ДатаНачалаРасчета = Запись.ДатаНачалаРасчета;
			Движение.Организация = Запись.Организация;
			Движение.ВидДвижения = Запись.ВидДвижения;
			Движение.ВидРасчета = Запись.ВидРасчета;
			Движение.ЗалоговыйБилет = Запись.ЗалоговыйБилет; 
			Движение.Ломбард = Запись.Ломбард; 
			Движение.ОбъектЗалога = Запись.ОбъектЗалога; 
			Движение.Клиент = Запись.Клиент;
			Движение.Сумма = -Запись.Сумма; 
		КонецЦикла;	    
		
		ВосстановитьИзделияВНакладнойНаОтгузку(ЭтотОбъект.ОтмененныйДокумент); 
		
		//+МАН 17.06.25 Запись отмены операции в регистр
		Движения.ЛБ_ОтменыОперацийЗБ.Записывать = Истина;
		Движение = Движения.ЛБ_ОтменыОперацийЗБ.Добавить();
		Движение.Период = Дата;
		Движение.ОтмененныйДокумент = ЭтотОбъект.ОтмененныйДокумент;
		Движение.ВидОперации = ЭтотОбъект.ОтмененныйДокумент.ВидОперации;
		Движение.НомерЗалоговогоБилета = ЭтотОбъект.НомерЗалоговогоБилета;
		//-МАН
		
		//+МАН 09.12.25 Восстановление доверенности после отмены операции
		ВосстановитьДоверенностиПоЗалоговомуБилетуПослеОтменыОперации(ЭтотОбъект.ПредыдущаяОперация.Залогодатель, ЭтотОбъект.ПредыдущаяОперация)
		//-МАН
		
		//Если ЭтотОбъект.ОтмененныйДокумент.БезналичнаяОплата Тогда 
		//	Движения.ЛБ_БезналичныеПлатежиКРаспределению.Записывать = Истина;
		//	Движения.ЛБ_РаспределенныеБезналичныеПлатежи.Записывать = Истина;
		//	Движения.ЛБ_РеестрБезначныхПлатежей.Записывать = Истина;   
		//		
		//	НаборЗаписей = РегистрыСведений.ЛБ_РеестрБезначныхПлатежей.СоздатьНаборЗаписей();
		//    НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.ОтмененныйДокумент);
		//    НаборЗаписей.Прочитать(); 
		//	
		//	Для каждого Запись Из НаборЗаписей Цикл	
		//	    Движение = Движения.ЛБ_РеестрБезначныхПлатежей.Добавить();
		//		Движение.Период = Дата; 
		//		Движение.РеестрПлатежей = Запись.РеестрПлатежей;
		//		Движение.ДатаПлатежа = Запись.ДатаПлатежа;
		//		Движение.ИдентификаторПлатежа = Запись.ИдентификаторПлатежа;
		//		Движение.НомерЗБ = Запись.НомерЗБ;
		//		Движение.СуммаПлатежа = Запись.СуммаПлатежа; 
		//		Движение.СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.Отменен;
		//		Движение.ЗалоговыйБилет = ЭтотОбъект.ОтмененныйДокумент.ПредыдущаяОперация;
		//		Движение.ОплатаПроценты = 0;
		//		Движение.ОплатаЗайм = 0;
		//		Движение.Переплата = 0; 
		//		Движение.ДатаПеревода = ?(ДатаПереводаВИтоговыйСтатусБН = Дата(1,1,1), ТекущаяДатаСеанса(), ДатаПереводаВИтоговыйСтатусБН);
		//		Движение.Ответственный = ЭтотОбъект.Ответственный; 	
		//	КонецЦикла;	 
		//	
		//	НаборЗаписей = РегистрыНакопления.ЛБ_РаспределенныеБезналичныеПлатежи.СоздатьНаборЗаписей();
		//    НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.ОтмененныйДокумент);
		//    НаборЗаписей.Прочитать(); 

		//	Для каждого Запись Из НаборЗаписей Цикл	
		//		Движение = Движения.ЛБ_РаспределенныеБезналичныеПлатежи.Добавить();
		//		Движение.Период = Дата;                              
		//		Движение.РеестрПлатежей = Запись.РеестрПлатежей;
		//		Движение.ДатаПлатежа = Запись.ДатаПлатежа;
		//		Движение.ИдентификаторПлатежа = Запись.ИдентификаторПлатежа;
		//		Движение.НомерЗБ = Запись.НомерЗБ;   
		//		Движение.ЗалоговыйБилет = Запись.ЗалоговыйБилет;
		//		Движение.СуммаПлатежа = Запись.СуммаПлатежа; 
		//        Движение.ДоВыяснения = -Запись.ДоВыяснения;				
		//		Движение.КВозврату = -Запись.КВозврату;	
		//		Движение.ОплатаПроценты = -Запись.ОплатаПроценты;
		//		Движение.ОплатаЗайм = -Запись.ОплатаЗайм;
		//	    Движение.Переплата = -Запись.Переплата;
		//	КонецЦикла;	 
		//	
		//	Движение = Движения.ЛБ_РаспределенныеБезналичныеПлатежи.Добавить();
		//	Движение.Период = Дата;                              
		//	Движение.РеестрПлатежей = ЭтотОбъект.ОтмененныйДокумент.РеестрПлатежей;
		//	Движение.ДатаПлатежа = ЭтотОбъект.ОтмененныйДокумент.ДатаПлатежа;
		//	Движение.ИдентификаторПлатежа = ЭтотОбъект.ОтмененныйДокумент.ИдентификаторПлатежа;
		//	Движение.НомерЗБ = ЭтотОбъект.ОтмененныйДокумент.НомерЗБПлатежа;   
		//	Движение.ЗалоговыйБилет = ЭтотОбъект.ОтмененныйДокумент.ПредыдущаяОперация;
		//	Движение.СуммаПлатежа = ЭтотОбъект.ОтмененныйДокумент.СуммаПлатежа; 
		//    Движение.Отмена = ЭтотОбъект.ОтмененныйДокумент.СуммаОплаты;							
		//	
		//	НаборЗаписей = РегистрыНакопления.ЛБ_БезналичныеПлатежиКРаспределению.СоздатьНаборЗаписей();
		//    НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.ОтмененныйДокумент);
		//    НаборЗаписей.Прочитать(); 

		//	Для каждого Запись Из НаборЗаписей Цикл
		//	    Движение = Движения.ЛБ_БезналичныеПлатежиКРаспределению.ДобавитьРасход();
		//	    Движение.Период = Дата;   
		//		Движение.РеестрПлатежей = Запись.РеестрПлатежей; 
		//		Движение.ДатаПлатежа = Запись.ДатаПлатежа;
		//		Движение.ИдентификаторПлатежа = Запись.ИдентификаторПлатежа;
		//		Движение.НомерЗБ = Запись.НомерЗБ; 
		//		Движение.СуммаПлатежа = Запись.СуммаПлатежа;
		//        Движение.Сумма = -Запись.Сумма;  
		//	КонецЦикла;	
		//КонецЕсли;	
		
	ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаОстановкиНачисленияПроцентов Тогда
		ЗалоговыйБилет = ПредыдущаяОперация;
		СтруктураРез = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗалоговогоБилета(ЭтотОбъект, ЗалоговыйБилет);
		ДатаНачалаРасчетаНач = СтруктураРез.ДатаНачалаРасчета; 
		ДатаВыкупа = СтруктураРез.ДатаВыкупа;
		ДатаВыкупаЛьготная = СтруктураРез.ДатаВыкупаЛьготныйСрок;  
		СуммаЗайма = СтруктураРез.СуммаЗайма;                 
		ПричинаПримененияНач = СтруктураРез.ПричинаПрименения; 
		СтатусНачальный = СтруктураРез.СтатусЗалоговогоБилета;

		СостояниеДоОтменяемойОперации = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(НомерЗалоговогоБилета, ЭтотОбъект.ОтмененныйДокумент.Дата-1);

		Движения.ЛБ_ОборотыПоОперациямЗайма.Записывать = Истина;
		Движение = Движения.ЛБ_ОборотыПоОперациямЗайма.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Ломбард = Этотобъект.Ломбард;
		Движение.ЗалоговыйБилет = ЗалоговыйБилет;
		Движение.Залогодатель = ЭтотОбъект.ОтмененныйДокумент.Залогодатель;
		Движение.ВидОперации = ЭтотОбъект.ВидОперации; 
		Движение.СуммаСсуды = СуммаЗайма;   
		Если НЕ ЭтотОбъект.Товары.Итог("СуммаОплаты") = 0 Тогда
			Движение.СуммаОплатыЗайм = ЭтотОбъект.Товары.Итог("СуммаОплаты");  
		КонецЕсли;	

		Если СостояниеДоОтменяемойОперации <> Неопределено Тогда
			Движения.ЛБ_СостояниеЗалоговогоБилета.Записывать = Истина;
			Движение = Движения.ЛБ_СостояниеЗалоговогоБилета.Добавить();
			Движение.Период = Дата;
			Движение.ЗалоговыйБилет = ЗалоговыйБилет; 
			Движение.Залогодатель = СостояниеДоОтменяемойОперации.Залогодатель;
			Движение.НомерЗалоговогоБилета = СостояниеДоОтменяемойОперации.НомерЗалоговогоБилета;
			Движение.СтатусЗалоговогоБилета = СостояниеДоОтменяемойОперации.СтатусЗалоговогоБилета; 
			Движение.СхемаКредитования = СостояниеДоОтменяемойОперации.СхемаКредитования;
			Движение.ПричинаПрименения = СостояниеДоОтменяемойОперации.ПричинаПрименения;
			Движение.ДатаВыкупа = СостояниеДоОтменяемойОперации.ДатаВыкупа;
			Движение.ДатаВыкупаЛьготныйСрок = СостояниеДоОтменяемойОперации.ДатаВыкупаЛьготныйСрок;	
			Движение.СуммаЗайма = СостояниеДоОтменяемойОперации.СуммаЗайма;
			Движение.ДатаНачалаРасчетаПроцентов = СостояниеДоОтменяемойОперации.ДатаНачалаРасчетаПроцентов;
			Движение.НомерДопСоглашения = СостояниеДоОтменяемойОперации.НомерДопСоглашения;
			Движение.СуммаПроцентовСрок = СостояниеДоОтменяемойОперации.СуммаПроцентовСрок;
			Движение.ПредельныйСрокЗаймаДни = СостояниеДоОтменяемойОперации.ПредельныйСрокЗаймаДни;
			Движение.ДатаОстановкиНачислений = СостояниеДоОтменяемойОперации.ДатаОстановкиНачислений;
		КонецЕсли;

		НаборЗаписей = РегистрыНакопления.ЛБ_НачислениеПроцентовДетально.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.ОтмененныйДокумент);
		НаборЗаписей.Прочитать(); 

		Движения.ЛБ_НачислениеПроцентовДетально.Записывать = Истина;
		Для каждого Стр из НаборЗаписей Цикл	
			Движение = Движения.ЛБ_НачислениеПроцентовДетально.Добавить();
			Движение.Период = Дата;     
			Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет; 
			Движение.ДатаНачалаРасчета = Стр.ДатаНачалаРасчета;
			Движение.ВидПроцентнойСтавки = Стр.ВидПроцентнойСтавки;
			Движение.ДатаНач = Стр.ДатаНач;
			Движение.ДатаКон = Стр.ДатаКон;
			Движение.ДеньНач = Стр.ДеньНач;
			Движение.ДеньКон = Стр.ДеньКон;
			Движение.СуммаПроцентов = -Стр.СуммаПроцентов;
			Движение.СуммаПроцентовДень = -Стр.СуммаПроцентовДень;
			Движение.ПроцентнаяСтавкаБазовая = Стр.ПроцентнаяСтавкаБазовая;
			Движение.ПроцентнаяСтавкаАкция = Стр.ПроцентнаяСтавкаАкция;
			Движение.ОтклонениеАкцияАбсолютное = Стр.ОтклонениеАкцияАбсолютное;
			Движение.ОтклонениеАкцияОтностельное = Стр.ОтклонениеАкцияОтностельное;
		КонецЦикла;	    

		НаборЗаписей = РегистрыНакопления.ЛБ_РасчетыСКлиентами.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.ОтмененныйДокумент);
		НаборЗаписей.Прочитать(); 

		Движения.ЛБ_РасчетыСКлиентами.Записывать = Истина;
		Для каждого Стр Из НаборЗаписей Цикл
			Движение = Движения.ЛБ_РасчетыСКлиентами.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Стр.Организация;
			Движение.ДатаНачалаРасчета = Этотобъект.Дата;
			Движение.ВидРасчета = Стр.ВидРасчета;
			Движение.Клиент = Стр.Клиент;
			Движение.ЗалоговыйБилет = ЗалоговыйБилет;
			Движение.ВидДвижения = ?(Стр.ВидДвижения = ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);
			Движение.Сумма = -Стр.Сумма;
		КонецЦикла;

		НаборЗаписей = РегистрыНакопления.ЛБ_РасчетыСКлиентамиБУ.СоздатьНаборЗаписей();
	    НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.ОтмененныйДокумент);
	    НаборЗаписей.Прочитать(); 
		
		Движения.ЛБ_РасчетыСКлиентамиБУ.Записывать = Истина;
		Для каждого Запись Из НаборЗаписей Цикл				
			Движение = Движения.ЛБ_РасчетыСКлиентамиБУ.Добавить();
			Движение.Период = Дата;
			Движение.ДатаНачалаРасчета = Запись.ДатаНачалаРасчета;
			Движение.Организация = Запись.Организация;
			Движение.ВидДвижения = Запись.ВидДвижения;
			Движение.ВидРасчета = Запись.ВидРасчета;
			Движение.ЗалоговыйБилет = Запись.ЗалоговыйБилет; 
			Движение.Ломбард = Запись.Ломбард; 
			Движение.ОбъектЗалога = Запись.ОбъектЗалога; 
			Движение.Клиент = Запись.Клиент;
			Движение.Сумма = -Запись.Сумма; 
		КонецЦикла;	    

		//+МАН 17.06.25 Запись отмены операции в регистр
		Движения.ЛБ_ОтменыОперацийЗБ.Записывать = Истина;
		Движение = Движения.ЛБ_ОтменыОперацийЗБ.Добавить();
		Движение.Период = Дата;
		Движение.ОтмененныйДокумент = ЭтотОбъект.ОтмененныйДокумент;
		Движение.ВидОперации = ЭтотОбъект.ОтмененныйДокумент.ВидОперации;
		Движение.НомерЗалоговогоБилета = ЭтотОбъект.НомерЗалоговогоБилета;
		//-МАН
		
	ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаИзъятия Тогда
		ЗалоговыйБилет = ПредыдущаяОперация;
		СтруктураРез = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗалоговогоБилета(ЭтотОбъект, ЗалоговыйБилет);
		ДатаНачалаРасчетаНач = СтруктураРез.ДатаНачалаРасчета; 
		ДатаВыкупа = СтруктураРез.ДатаВыкупа;
		ДатаВыкупаЛьготная = СтруктураРез.ДатаВыкупаЛьготныйСрок;  
		СуммаЗайма = СтруктураРез.СуммаЗайма;                 
		ПричинаПримененияНач = СтруктураРез.ПричинаПрименения;
		НомерДопСоглашения = СтруктураРез.НомерДопСоглашения;
		СтатусНачальный = СтруктураРез.СтатусЗалоговогоБилета;

		Движения.ЛБ_ОборотыПоОперациямЗайма.Записывать = Истина;
		Движение = Движения.ЛБ_ОборотыПоОперациямЗайма.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Ломбард = Этотобъект.Ломбард;
		Движение.ЗалоговыйБилет = ЗалоговыйБилет;
		Движение.Залогодатель = ЭтотОбъект.ОтмененныйДокумент.Залогодатель;
		Движение.ВидОперации = ЭтотОбъект.ВидОперации; 
		Движение.СуммаСсуды = СуммаЗайма;   
		Если НЕ ЭтотОбъект.Товары.Итог("СуммаОплаты") = 0 Тогда
			Движение.СуммаОплатыЗайм = ЭтотОбъект.Товары.Итог("СуммаОплаты"); 			
		КонецЕсли;	                                                          
		Движение.НакладнаяНаОтгрузку = ЛБ_УправлениеЛомбардом.ПолучитьНакладнуюНаОтгрузкуЗалогоговогоБилета(ЭтотОбъект.ОтмененныйДокумент.Дата - 1, ЗалоговыйБилет);
                  
		Запрос = новый Запрос;   
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_ОбъектыЗалогаОбороты.ОбъектЗалога КАК ОбъектЗалога,
		               |	ЛБ_ОбъектыЗалогаОбороты.Ломбард КАК Ломбард,
		               |	ЛБ_ОбъектыЗалогаОбороты.Склад КАК Склад,
		               |	ЛБ_ОбъектыЗалогаОбороты.КоличествоРасход КАК КоличествоРасход,
		               |	ЛБ_ОбъектыЗалогаОбороты.СуммаОценкиРасход КАК СуммаОценкиРасход,
		               |	ЛБ_ОбъектыЗалогаОбороты.СуммаОценкиРасход КАК СуммаОценкиНачальнаяРасход
		               |ИЗ
		               |	РегистрНакопления.ЛБ_ОбъектыЗалога.Обороты(, &Дата, Регистратор, ЗалоговыйБилет = &ЗалоговыйБилет" + ОтборСклад +") КАК ЛБ_ОбъектыЗалогаОбороты
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ЛБ_ОбъектыЗалогаОбороты.Период УБЫВ";

		Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
		Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);	
        Запрос.УстановитьПараметр("Склад", СкладЛомбарда);  
		ОтборСклад = "";
		Если  НЕ ЭтотОбъект.Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис Тогда 
			ОтборСклад = " И Склад = &Склад";
		КонецЕсли;	
		
		ТаблицаОстатков = Запрос.Выполнить().Выгрузить();

		КоличествоИзъятых = 0;

		СостояниеДоОтменяемойОперации = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(НомерЗалоговогоБилета, ЭтотОбъект.ОтмененныйДокумент.Дата-1);

		Движения.ЛБ_ОбъектыЗалога.Записывать = Истина;
		Движения.ЛБ_СостояниеОбъектаЗалога.Записывать = Истина;  
		Для каждого Стр Из ЭтотОбъект.ТоварыИзъятыеВозвращенные цикл  
			Отбор = Новый структура;
			Отбор.Вставить("Ломбард", ЭтотОбъект.Ломбард); 
			Отбор.Вставить("ОбъектЗалога", Стр.ОбъектЗалога); 

			Строки = ТаблицаОстатков.НайтиСтроки(Отбор);
			Если Строки.Количество() = 0 Тогда
				Продолжить;
			Иначе	 
				СтрОст = Строки.Получить(0);
				Движение = Движения.ЛБ_ОбъектыЗалога.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Организация = Организация;
				Движение.Ломбард = Этотобъект.Ломбард;
				Движение.Склад = СтрОст.Склад;
				Движение.ЗалоговыйБилет = ЗалоговыйБилет;
				Движение.ОбъектЗалога = Стр.ОбъектЗалога;
				Движение.Количество = -СтрОст.КоличествоРасход;
				Движение.СуммаОценки = -СтрОст.СуммаОценкиРасход; 
				//Движение.СуммаОценкиНачальная = -СтрОст.СуммаОценкиНачальнаяРасход; 
				
				СтруктураСостояниеОЗ = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектовЗалогаЗалоговогоБилета(ЭтотОбъект.ОтмененныйДокумент.Дата-1, ЗалоговыйБилет, Стр.ОбъектЗалога);
				
				Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить();
				Движение.Период = Дата;
				Движение.ЗалоговыйБилет = ЗалоговыйБилет;
				Движение.ОбъектЗалога = Стр.ОбъектЗалога;
				Движение.СтатусОбъектаЗалога = СтруктураСостояниеОЗ.СтатусОбъектаЗалога; 
				Движение.СуммаОценки = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОценки);	 
				Движение.СуммаОценкиНачальная = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОценкиНач);	
				Движение.СуммаЗайма = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаЗайма);
				Движение.СуммаОплаты = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОплаты); 
				Движение.СуммаДолгаЗайма = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаДолгаЗайма); 

				КоличествоИзъятых = КоличествоИзъятых + 1;
			КонецЕсли;	
		КонецЦикла;     
		
	    НаборЗаписей = РегистрыСведений.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.ОтмененныйДокумент);
		НаборЗаписей.Прочитать(); 

		Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Записывать = Истина;
		Для каждого Запись Из НаборЗаписей Цикл				
			Движение = Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Добавить(); 
			Движение.Период = Дата;
			Движение.Организация = Запись.Организация; 
			Движение.ПодразделениеОсновное = Запись.ПодразделениеОсновное;
			Движение.СкладОсновной = Запись.СкладОсновной;
			Движение.ПодразделениеОтправитель = Запись.ПодразделениеОтправитель; 
			Движение.СкладОтправитель = Запись.СкладОтправитель; 
			Движение.ПодразделениеПолучатель = Запись.ПодразделениеПолучатель;
            Движение.СкладПолучатель = Запись.СкладПолучатель; 
			Движение.Количество = -Запись.Количество;   
			Движение.Ответственный = ЭтотОбъект.ОтветственныйСотрудник; 
			Движение.НомерЗБ = Запись.НомерЗБ;
			Движение.ВидОперации = "Отмена изъятия";
		КонецЦикла;	    

		Если СостояниеДоОтменяемойОперации <> Неопределено Тогда
			Движения.ЛБ_СостояниеЗалоговогоБилета.Записывать = Истина;
			Движение = Движения.ЛБ_СостояниеЗалоговогоБилета.Добавить();
			Движение.Период = Дата;
			Движение.ЗалоговыйБилет = ЗалоговыйБилет; 
			Движение.Залогодатель = СостояниеДоОтменяемойОперации.Залогодатель;
			Движение.НомерЗалоговогоБилета = СостояниеДоОтменяемойОперации.НомерЗалоговогоБилета;
			Движение.СтатусЗалоговогоБилета = СостояниеДоОтменяемойОперации.СтатусЗалоговогоБилета;
			Движение.СхемаКредитования = СостояниеДоОтменяемойОперации.СхемаКредитования;
			Движение.ПричинаПрименения = СостояниеДоОтменяемойОперации.ПричинаПрименения;
			Движение.ДатаВыкупа = СостояниеДоОтменяемойОперации.ДатаВыкупа;
			Движение.ДатаВыкупаЛьготныйСрок = СостояниеДоОтменяемойОперации.ДатаВыкупаЛьготныйСрок;	
			Движение.НомерДопСоглашения = СостояниеДоОтменяемойОперации.НомерДопСоглашения;
			Движение.СуммаЗайма = СостояниеДоОтменяемойОперации.СуммаЗайма;
			Движение.ДатаНачалаРасчетаПроцентов = СостояниеДоОтменяемойОперации.ДатаНачалаРасчетаПроцентов;
			Движение.СуммаПроцентовСрок = СостояниеДоОтменяемойОперации.СуммаПроцентовСрок;
			Движение.ПредельныйСрокЗаймаДни = СостояниеДоОтменяемойОперации.ПредельныйСрокЗаймаДни;
			Движение.ДатаОстановкиНачислений = СостояниеДоОтменяемойОперации.ДатаОстановкиНачислений;
		КонецЕсли;

		НаборЗаписей = РегистрыНакопления.ЛБ_НачислениеПроцентовДетально.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.ОтмененныйДокумент);
		НаборЗаписей.Прочитать();

		Движения.ЛБ_НачислениеПроцентовДетально.Записывать = Истина;
		Для каждого Стр из НаборЗаписей Цикл	
			Движение = Движения.ЛБ_НачислениеПроцентовДетально.Добавить();
			Движение.Период = Дата;     
			Движение.ЗалоговыйБилет = ЗалоговыйБилет;
			Движение.ДатаНачалаРасчета = СостояниеДоОтменяемойОперации.ДатаНачалаРасчетаПроцентов;
			Движение.ВидПроцентнойСтавки = стр.ВидПроцентнойСтавки;
			Движение.ДатаНач = стр.ДатаНач;
			Движение.ДатаКон = стр.ДатаКон;
			Движение.ДеньНач = Стр.ДеньНач;
			Движение.ДеньКон = Стр.ДеньКон;
			Движение.СуммаПроцентов = -Стр.СуммаПроцентов;
			Движение.СуммаПроцентовДень = -Стр.СуммаПроцентовДень;
			Движение.ПроцентнаяСтавкаБазовая = Стр.ПроцентнаяСтавкаБазовая;
			Движение.ПроцентнаяСтавкаАкция = Стр.ПроцентнаяСтавкаАкция;
			Движение.ОтклонениеАкцияАбсолютное = Стр.ОтклонениеАкцияАбсолютное;
			Движение.ОтклонениеАкцияОтностельное = Стр.ОтклонениеАкцияОтностельное;
		КонецЦикла;	    

		НаборЗаписей = РегистрыНакопления.ЛБ_РасчетыСКлиентами.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.ОтмененныйДокумент);
		НаборЗаписей.Прочитать(); 

		Движения.ЛБ_РасчетыСКлиентами.Записывать = Истина;
		Для каждого Стр Из НаборЗаписей Цикл
			Движение = Движения.ЛБ_РасчетыСКлиентами.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Стр.Организация;
			Движение.ДатаНачалаРасчета = Стр.ДатаНачалаРасчета;
			Движение.ВидРасчета = Стр.ВидРасчета;
			Движение.Клиент = ЗалоговыйБилет.Залогодатель;
			Движение.ЗалоговыйБилет = ЗалоговыйБилет;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Сумма = -Стр.Сумма;
		КонецЦикла;

		Если НЕ ЭтотОбъект.Товары.Итог("СуммаОплаты") = 0 Тогда  
			Движение = Движения.ЛБ_РасчетыСКлиентами.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.ДатаНачалаРасчета = Этотобъект.Дата;
			Движение.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоОсновномуДолгу;
			Движение.Клиент = ЭтотОбъект.ОтмененныйДокумент.Залогодатель;
			Движение.ЗалоговыйБилет = ЗалоговыйБилет;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Сумма = -ЭтотОбъект.Товары.Итог("СуммаОплаты"); 

			Движения.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Записывать = Истина;
			Для каждого Стр Из ЭтотОбъект.Товары Цикл 
				Если Стр.СуммаОплаты = 0 Тогда
					Продолжить;
				КонецЕсли;	
				Движение = Движения.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Клиент = ЭтотОбъект.ОтмененныйДокумент.Залогодатель;
				Движение.ЗалоговыйБилет = ЗалоговыйБилет;
				Движение.ОбъектЗалога = Стр.ОбъектЗалога;
				Движение.Сумма = -Стр.СуммаОплаты;
			КонецЦикла;
		КонецЕсли;	  

		СтатусСтарый = ЛБ_УправлениеЛомбардом.ПолучитьТекущийСтатусКлиента(Дата, ЭтотОбъект.ОтмененныйДокумент.Залогодатель);
		НовыйСтатусЗалогодаталя = ЛБ_УправлениеЛомбардом.ПроверкаСтатусаЗалогодателя(Дата, ЭтотОбъект.ОтмененныйДокумент.Залогодатель, СтатусСтарый, , Истина);
		Если НЕ СтатусСтарый = НовыйСтатусЗалогодаталя Тогда
			Движения.ЛБ_СтатусыЗалогодателей.Записывать = Истина; 
			Движение = Движения.ЛБ_СтатусыЗалогодателей.Добавить();
			Движение.Период = Дата;
			Движение.Залогодатель = ЭтотОбъект.ОтмененныйДокумент.Залогодатель;
			Движение.Статус =  НовыйСтатусЗалогодаталя;
		КонецЕсли;	 

		НаборЗаписей = РегистрыНакопления.ЛБ_РасчетыСКлиентамиБУ.СоздатьНаборЗаписей();
	    НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.ОтмененныйДокумент);
	    НаборЗаписей.Прочитать(); 
		
		Движения.ЛБ_РасчетыСКлиентамиБУ.Записывать = Истина;
		Для каждого Запись Из НаборЗаписей Цикл				
			Движение = Движения.ЛБ_РасчетыСКлиентамиБУ.Добавить();
			Движение.Период = Дата;
			Движение.ДатаНачалаРасчета = Запись.ДатаНачалаРасчета;
			Движение.Организация = Запись.Организация;
			Движение.ВидДвижения = Запись.ВидДвижения;
			Движение.ВидРасчета = Запись.ВидРасчета;
			Движение.ЗалоговыйБилет = Запись.ЗалоговыйБилет; 
			Движение.Ломбард = Запись.Ломбард; 
			Движение.ОбъектЗалога = Запись.ОбъектЗалога; 
			Движение.Клиент = Запись.Клиент;
			Движение.Сумма = -Запись.Сумма; 
		КонецЦикла;	 
		
		ВосстановитьИзделияВНакладнойНаОтгузку(ЭтотОбъект.ОтмененныйДокумент);

		//+МАН 17.06.25 Запись отмены операции в регистр
		Движения.ЛБ_ОтменыОперацийЗБ.Записывать = Истина;
		Движение = Движения.ЛБ_ОтменыОперацийЗБ.Добавить();
		Движение.Период = Дата;
		Движение.ОтмененныйДокумент = ЭтотОбъект.ОтмененныйДокумент;
		Движение.ВидОперации = ЭтотОбъект.ОтмененныйДокумент.ВидОперации;
		Движение.НомерЗалоговогоБилета = ЭтотОбъект.НомерЗалоговогоБилета;
		//-МАН
		
	ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаВозвратаИзъятого Тогда
		ЗалоговыйБилет = ПредыдущаяОперация;
		СтруктураРез = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗалоговогоБилета(ЭтотОбъект, ЗалоговыйБилет); 
		ДатаНачалаРасчетаНач = СтруктураРез.ДатаНачалаРасчета; 
		ДатаВыкупа = СтруктураРез.ДатаВыкупа;
		ДатаВыкупаЛьготная = СтруктураРез.ДатаВыкупаЛьготныйСрок;  
		СуммаЗайма = СтруктураРез.СуммаЗайма;  
		ПричинаПримененияНач = СтруктураРез.ПричинаПрименения; 
		НомерДопСоглашения = СтруктураРез.НомерДопСоглашения;

		Движения.ЛБ_ОборотыПоОперациямЗайма.Записывать = Истина;
		Движение = Движения.ЛБ_ОборотыПоОперациямЗайма.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Ломбард = Этотобъект.Ломбард;
		Движение.ЗалоговыйБилет = ЗалоговыйБилет;
		Движение.Залогодатель = ЗалоговыйБилет.Залогодатель;
		Движение.ВидОперации = ЭтотОбъект.ВидОперации; 
		Движение.СуммаСсуды = СуммаЗайма;

		Движения.ЛБ_ОбъектыЗалога.Записывать = Истина;
		Движения.ЛБ_СостояниеОбъектаЗалога.Записывать = Истина;
		Для каждого Стр Из ЭтотОбъект.ТоварыИзъятыеВозвращенные цикл  
			СтруктураСостояниеОЗ = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектовЗалогаЗалоговогоБилета(ЭтотОбъект.Дата, ЗалоговыйБилет, Стр.ОбъектЗалога);

			Движение = Движения.ЛБ_ОбъектыЗалога.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Ломбард = Этотобъект.Ломбард;
			Если Этотобъект.Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис Тогда    
				Движение.Склад = ЛБ_ОбщийМодуль.ПолучитьСклад(Этотобъект.Ломбард, Перечисления.ЛБ_ВидыСкладов.ОбщийСкладЦО);
			Иначе	
			    Движение.Склад = СкладЛомбарда;  
			КонецЕсли;	
			Движение.ЗалоговыйБилет = ЗалоговыйБилет;
			Движение.ОбъектЗалога = Стр.ОбъектЗалога;
			Движение.Количество = -1;
			Движение.СуммаОценки = ?(СтруктураСостояниеОЗ = неопределено, 0, -СтруктураСостояниеОЗ.СуммаОценки);
			//Движение.СуммаОценкиНачальная = ?(СтруктураСостояниеОЗ = неопределено, 0, -СтруктураСостояниеОЗ.СуммаОценкиНач);

			Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить();
			Движение.Период = Дата;
			Движение.ЗалоговыйБилет = ЗалоговыйБилет;
			Движение.ОбъектЗалога = Стр.ОбъектЗалога;
			Движение.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.Изъят; 
			Движение.СуммаОценки = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОценки);
			Движение.СуммаОценкиНачальная = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОценкиНач);	
			Движение.СуммаЗайма = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаЗайма);
			Движение.СуммаОплаты = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОплаты); 
			Движение.СуммаДолгаЗайма = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаДолгаЗайма); 

		КонецЦикла;    
		
		НаборЗаписей = РегистрыСведений.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.ОтмененныйДокумент);
		НаборЗаписей.Прочитать(); 

		Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Записывать = Истина;
		Для каждого Запись Из НаборЗаписей Цикл				
			Движение = Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Добавить(); 
			Движение.Период = Дата;
			Движение.Организация = Запись.Организация;  
			Движение.ПодразделениеОсновное = Запись.ПодразделениеОсновное; 
			Движение.СкладОсновной = Запись.СкладОсновной;
			Движение.ПодразделениеОтправитель = Запись.ПодразделениеОтправитель; 
			Движение.СкладОтправитель = Запись.СкладОтправитель; 
			Движение.ПодразделениеПолучатель = Запись.ПодразделениеПолучатель;
            Движение.СкладПолучатель = Запись.СкладПолучатель; 
			Движение.Количество = -Запись.Количество;  
			Движение.Ответственный = ЭтотОбъект.ОтветственныйСотрудник;  
			Движение.НомерЗБ = Запись.НомерЗБ;
			Движение.ВидОперации = "Отмена возврата залогов";
		КонецЦикла;	    

		Движения.ЛБ_СостояниеЗалоговогоБилета.Записывать = Истина;
		Движение = Движения.ЛБ_СостояниеЗалоговогоБилета.Добавить();
		Движение.Период = Дата;
		Движение.ЗалоговыйБилет = ЗалоговыйБилет; 
		Движение.Залогодатель = ЗалоговыйБилет.Залогодатель;
		Движение.НомерЗалоговогоБилета = Этотобъект.НомерЗалоговогоБилета;
		Движение.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят;
		Движение.СхемаКредитования = ЭтотОбъект.СхемаКредитования;
		Движение.ПричинаПрименения = ПричинаПримененияНач;
		Движение.ДатаВыкупа = ДатаВыкупа;
		Движение.ДатаВыкупаЛьготныйСрок = ДатаВыкупаЛьготная;	
		Движение.НомерДопСоглашения = НомерДопСоглашения;
		Движение.СуммаЗайма = СуммаЗайма;  
		//УдалитьИзделияИзНакладнойНаОтгузку(ЗалоговыйБилет);

		НаборЗаписей = РегистрыНакопления.ЛБ_РасчетыСКлиентамиБУ.СоздатьНаборЗаписей();
	    НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.ОтмененныйДокумент);
	    НаборЗаписей.Прочитать(); 
		
		Движения.ЛБ_РасчетыСКлиентамиБУ.Записывать = Истина;
		Для каждого Запись Из НаборЗаписей Цикл				
			Движение = Движения.ЛБ_РасчетыСКлиентамиБУ.Добавить();
			Движение.Период = Дата;
			Движение.ДатаНачалаРасчета = Запись.ДатаНачалаРасчета;
			Движение.Организация = Запись.Организация;
			Движение.ВидДвижения = Запись.ВидДвижения;
			Движение.ВидРасчета = Запись.ВидРасчета;
			Движение.ЗалоговыйБилет = Запись.ЗалоговыйБилет; 
			Движение.Ломбард = Запись.Ломбард; 
			Движение.ОбъектЗалога = Запись.ОбъектЗалога; 
			Движение.Клиент = Запись.Клиент;
			Движение.Сумма = -Запись.Сумма; 
		КонецЦикла;	    

		//+МАН 17.06.25 Запись отмены операции в регистр
		Движения.ЛБ_ОтменыОперацийЗБ.Записывать = Истина;
		Движение = Движения.ЛБ_ОтменыОперацийЗБ.Добавить();
		Движение.Период = Дата;
		Движение.ОтмененныйДокумент = ЭтотОбъект.ОтмененныйДокумент;
		Движение.ВидОперации = ЭтотОбъект.ОтмененныйДокумент.ВидОперации;
		Движение.НомерЗалоговогоБилета = ЭтотОбъект.НомерЗалоговогоБилета;
		//-МАН
		
	ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаВыдачиСОХ Тогда
		
		ЗалоговыйБилет = ПредыдущаяОперация;

		СостояниеДоОтменяемойОперации = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(НомерЗалоговогоБилета, ЭтотОбъект.ОтмененныйДокумент.Дата-1,, Истина);

		ДатаНачалаРасчетаНач = СостояниеДоОтменяемойОперации.ДатаНачалаРасчетаПроцентов; 
		ДатаВыкупа = Этотобъект.ДатаВыкупа;
		ДатаВыкупаЛьготная = Этотобъект.ДатаВыкупаЛьготная;  
		ПричинаПримененияНач = СостояниеДоОтменяемойОперации.ПричинаПрименения; 
		НомерДопСоглашения = СостояниеДоОтменяемойОперации.НомерДопСоглашения;
		СтатусНачальный = СостояниеДоОтменяемойОперации.СтатусЗалоговогоБилета;

		Движения.ЛБ_ОборотыПоОперациямЗайма.Записывать = Истина;
		Движение = Движения.ЛБ_ОборотыПоОперациямЗайма.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Ломбард = Ломбард;
		Движение.ЗалоговыйБилет = ЗалоговыйБилет;
		Движение.Залогодатель = ЗалоговыйБилет.Залогодатель;
		Движение.ВидОперации = ЭтотОбъект.ВидОперации;    

		Запрос = новый Запрос;   
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_ОбъектыЗалогаОбороты.ОбъектЗалога КАК ОбъектЗалога,
		               |	ЛБ_ОбъектыЗалогаОбороты.Ломбард КАК Ломбард,
		               |	ЛБ_ОбъектыЗалогаОбороты.КоличествоРасход КАК КоличествоРасход,
		               |	ЛБ_ОбъектыЗалогаОбороты.СуммаОценкиРасход КАК СуммаОценкиРасход, 
					   |	ЛБ_ОбъектыЗалогаОбороты.СуммаОценкиРасход КАК СуммаОценкиНачальнаяРасход
		               //|	ЛБ_ОбъектыЗалогаОбороты.СуммаОценкиНачальнаяРасход КАК СуммаОценкиНачальнаяРасход
		               |ИЗ
		               |	РегистрНакопления.ЛБ_ОбъектыЗалога.Обороты(, &Дата, , ЗалоговыйБилет = &ЗалоговыйБилет И Склад = &Склад) КАК ЛБ_ОбъектыЗалогаОбороты";

		Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
		Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
		Запрос.УстановитьПараметр("Склад", СкладЛомбарда);
		
		ТаблицаОстатков = Запрос.Выполнить().Выгрузить();

		Движения.ЛБ_ОбъектыЗалога.Записывать = Истина;
		Движения.ЛБ_СостояниеОбъектаЗалога.Записывать = Истина;
		Для каждого Стр Из ЭтотОбъект.ТоварыВыкупленные цикл   
			Отбор = Новый Структура;
			Отбор.Вставить("Ломбард", ЭтотОбъект.Ломбард); 
			Отбор.Вставить("ОбъектЗалога", Стр.ОбъектЗалога); 

			Строки = ТаблицаОстатков.НайтиСтроки(Отбор);
			Если Строки.Количество() = 0 Тогда
				Продолжить;
			Иначе	
				СтрОст = Строки.Получить(0);
				Движение = Движения.ЛБ_ОбъектыЗалога.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Организация = Организация;
				Движение.Ломбард = Ломбард;    
				Движение.Склад = СкладЛомбарда;
				Движение.ЗалоговыйБилет = ЗалоговыйБилет;
				Движение.ОбъектЗалога = Стр.ОбъектЗалога;
				Движение.Количество = -СтрОст.КоличествоРасход;
				Движение.СуммаОценки = -СтрОст.СуммаОценкиРасход;
				//Движение.СуммаОценкиНачальная = -СтрОст.СуммаОценкиНачальнаяРасход;
	
				СтруктураСостояниеОЗ = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектовЗалогаЗалоговогоБилета(ЭтотОбъект.Дата, ЗалоговыйБилет, Стр.ОбъектЗалога, Истина, СостояниеДоОтменяемойОперации.Регистратор);
				Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить();
				Движение.Период = Дата;
				Движение.ЗалоговыйБилет = ЗалоговыйБилет;
				Движение.ОбъектЗалога = Стр.ОбъектЗалога;
				Движение.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение;
				Движение.СуммаОценки = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОценки);/////
				Движение.СуммаОценкиНачальная = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаОценкиНач);
				Движение.СуммаЗайма = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаЗайма);///////
				Движение.СуммаОплаты = Движение.СуммаЗайма; 
				Движение.СуммаДолгаЗайма = ?(СтруктураСостояниеОЗ = неопределено, 0, СтруктураСостояниеОЗ.СуммаДолгаЗайма);
			КонецЕсли;	
		КонецЦикла; 
		
		НаборЗаписей = РегистрыСведений.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.ОтмененныйДокумент);
		НаборЗаписей.Прочитать(); 

		Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Записывать = Истина;
		Для каждого Запись Из НаборЗаписей Цикл				
			Движение = Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Добавить(); 
			Движение.Период = Дата;
			Движение.Организация = Запись.Организация;
			Движение.ПодразделениеОсновное = Запись.ПодразделениеОсновное;
			Движение.СкладОсновной = Запись.СкладОсновной;
			Движение.ПодразделениеОтправитель = Запись.ПодразделениеОтправитель; 
			Движение.СкладОтправитель = Запись.СкладОтправитель; 
			Движение.ПодразделениеПолучатель = Запись.ПодразделениеПолучатель;
            Движение.СкладПолучатель = Запись.СкладПолучатель; 
			Движение.Количество = -Запись.Количество;  
			Движение.Ответственный = ЭтотОбъект.ОтветственныйСотрудник;  
			Движение.НомерЗБ = Запись.НомерЗБ;
			Движение.ВидОперации = "Отмена выдачи с ОХ";
		КонецЦикла;	    

		Движения.ЛБ_СостояниеЗалоговогоБилета.Записывать = Истина;
		Движение = Движения.ЛБ_СостояниеЗалоговогоБилета.Добавить();
		Движение.Период = Дата;
		Движение.ЗалоговыйБилет = ЗалоговыйБилет; 
		Движение.Залогодатель = Движение.ЗалоговыйБилет.Залогодатель;
		Движение.НомерЗалоговогоБилета = Этотобъект.НомерЗалоговогоБилета;
		Движение.СтатусЗалоговогоБилета = СостояниеДоОтменяемойОперации.СтатусЗалоговогоБилета;
		Движение.СхемаКредитования = ЭтотОбъект.СхемаКредитования;
		Движение.ПричинаПрименения = ПричинаПримененияНач;  
		Движение.ДатаНачалаРасчетаПроцентов = ДатаНачалаРасчетаНач; 
		Движение.СуммаЗайма = СостояниеДоОтменяемойОперации.СуммаЗайма; 

		Если ЭтотОбъект.Залогодатель = ЗалоговыйБилет.Залогодатель Тогда
			Движения.ЛБ_ДатыОбновленияАнкеты.Записывать = Истина;  
			Движение = Движения.ЛБ_ДатыОбновленияАнкеты.Добавить();
			Движение.Период = Дата; 
			Движение.Залогодатель = ЭтотОбъект.Залогодатель;
			Движение.ДатаАктуальности = Дата;
		КонецЕсли;	

		НаборЗаписей = РегистрыНакопления.ЛБ_РасчетыСКлиентамиБУ.СоздатьНаборЗаписей();
	    НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.ОтмененныйДокумент);
	    НаборЗаписей.Прочитать(); 
		
		Движения.ЛБ_РасчетыСКлиентамиБУ.Записывать = Истина;
		Для каждого Запись Из НаборЗаписей Цикл				
			Движение = Движения.ЛБ_РасчетыСКлиентамиБУ.Добавить();
			Движение.Период = Дата;
			Движение.ДатаНачалаРасчета = Запись.ДатаНачалаРасчета;
			Движение.Организация = Запись.Организация;
			Движение.ВидДвижения = Запись.ВидДвижения;
			Движение.ВидРасчета = Запись.ВидРасчета;
			Движение.ЗалоговыйБилет = Запись.ЗалоговыйБилет; 
			Движение.Ломбард = Запись.Ломбард; 
			Движение.ОбъектЗалога = Запись.ОбъектЗалога; 
			Движение.Клиент = Запись.Клиент;
			Движение.Сумма = -Запись.Сумма; 
		КонецЦикла;	    
		
		ВосстановитьДоверенностиПоЗалоговомуБилету(ЗалоговыйБилет.Залогодатель, ЗалоговыйБилет);
		
		//+МАН 17.06.25 Запись отмены операции в регистр
		Движения.ЛБ_ОтменыОперацийЗБ.Записывать = Истина;
		Движение = Движения.ЛБ_ОтменыОперацийЗБ.Добавить();
		Движение.Период = Дата;
		Движение.ОтмененныйДокумент = ЭтотОбъект.ОтмененныйДокумент;
		Движение.ВидОперации = ЭтотОбъект.ОтмененныйДокумент.ВидОперации;
		Движение.НомерЗалоговогоБилета = ЭтотОбъект.НомерЗалоговогоБилета;
		//-МАН
		
		//-Мельников
	КонецЕсли;  
	
	Если ПроводитьПоКассовойСмене Тогда
		КассоваяСменаОбъект = КассоваяСмена.ПолучитьОбъект(); 
		КассоваяСменаОбъект.СводныйПКО = СводныйПКО; 
		КассоваяСменаОбъект.СводныйРКО = СводныйРКО;   
		Попытка
		    КассоваяСменаОбъект.Записать(РежимЗаписиДокумента.Проведение); 
		Исключение 
			ОбщегоНазначения.СообщитьПользователю("Ошибка при корректировке кассовой операции. Обратитесь к разработчикам.");
		Конецпопытки;	 
	КонецЕсли;	
	
	//ПочетныйСтатус = Справочники.ЛБ_СтатусыЗалогодателей.Почетный;
	//Запрос = Новый Запрос; 
	//Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата); 
	//Запрос.УстановитьПараметр("Залогодатель", ?(ЭтоЗБ, ЭтотОбъект.Залогодатель, ЭтотОбъект.ПредыдущаяОперация.Залогодатель)); 
	//Запрос.УстановитьПараметр("Статус", ПочетныйСтатус); 
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Используется КАК Используется
	//               |ИЗ
	//               |	РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(
	//               |			&Дата,
	//               |			Залогодатель = &Залогодатель
	//               |				И Статус = &Статус) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних
	//               |
	//               |УПОРЯДОЧИТЬ ПО
	//               |	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Период УБЫВ";
	//ВыборкаСтатусов = Запрос.Выполнить().Выбрать(); 
	//Если ВыборкаСтатусов.Следующий() Тогда
	//	СтарыйСтатус = ВыборкаСтатусов.Используется;
	//Иначе
	//	СтарыйСтатус = ложь;
	//КонецЕсли;	
	//	
	//НовыйСтатус = ЛБ_УправлениеЛомбардом.ПроверитьСтатусПочетный(?(ЭтоЗБ, ДатаРождения, ПредыдущаяОперация.ДатаРождения), ?(ЭтоЗБ, Пол, ПредыдущаяОперация.Пол));
	//Если НЕ НовыйСтатус = СтарыйСтатус Тогда
	//	Движения.ЛБ_СтатусыЗалогодателейДополнительные.Записывать = Истина; 
	//	Движение = Движения.ЛБ_СтатусыЗалогодателейДополнительные.Добавить();
	//	Движение.Период = Дата; 
	//	Движение.Залогодатель = ?(ЭтоЗБ, ЭтотОбъект.Залогодатель, ЭтотОбъект.ПредыдущаяОперация.Залогодатель);
	//	Движение.Статус = ПочетныйСтатус;
	//	Движение.Используется = НовыйСтатус; 
	//КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения()

// Процедура - обработчик события "ОбработкаУдаленияПроведения".
//
Процедура ОбработкаУдаленияПроведения(Отказ)
		
	Если ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов И ЭтотОбъект.БезналичнаяОплата Тогда
		Сообщить("Снятие операции безналичной оплаты с проведения запрещено.");  
		Отказ = Истина;
		Возврат;   
	ИначеЕсли ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаОплаты И ЭтотОбъект.ОтмененныйДокумент.БезналичнаяОплата Тогда
		Сообщить("Снятие операции отмены безналичной оплаты с проведения запрещено.");  
		Отказ = Истина;
		Возврат;	
	КонецЕсли;
		
	ЗапросП = Новый Запрос;
	ЗапросП.УстановитьПараметр("Дата", ЭтотОбъект.Дата); 
	ЗапросП.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	Если ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог ИЛИ ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда
		ЗапросП.УстановитьПараметр("ЗБ", Ссылка); 
		НомерЗБ = ЭтотОбъект.НомерЗалоговогоБилета; 
	Иначе	 
		ЗапросП.УстановитьПараметр("ЗБ", ЭтотОбъект.ПредыдущаяОперация);
		НомерЗБ = ЭтотОбъект.ПредыдущаяОперация.НомерЗалоговогоБилета; 
	КонецЕсли;	
	ЗапросП.Текст = "ВЫБРАТЬ
	                |	ЛБ_ОборотыПоОперациямЗаймаОбороты.Регистратор КАК Регистратор
	                |ИЗ
	                |	РегистрНакопления.ЛБ_ОборотыПоОперациямЗайма.Обороты(&Дата, , Регистратор, ЗалоговыйБилет = &ЗБ) КАК ЛБ_ОборотыПоОперациямЗаймаОбороты
	                |ГДЕ
	                |	ЛБ_ОборотыПоОперациямЗаймаОбороты.Регистратор <> &Регистратор";
	ВыборкаП = ЗапросП.Выполнить().Выбрать();
	Если ВыборкаП.Следующий() тогда 
		Сообщить("По залоговому билету " + СокрЛП(НомерЗБ) + " есть более поздние операции. Снятие документа с проведения запрещено.");  
		Отказ = Истина;
		Возврат;
	КонецЕсли;                                        
		
КонецПроцедуры // ОбработкаУдаленияПроведения()

мСуммаПроцентовДень = 0;
мСуммаПроцентовСрок = 0;  
КассоваяСмена = Документы.ЛБ_ОперацииКассовойСмены.ПустаяСсылка();
СводныйПКО = Документы.ЛБ_ПриходныйКассовыйОрдер.ПустаяСсылка();
СводныйРКО = Документы.ЛБ_РасходныйКассовыйОрдер.ПустаяСсылка(); 
ПроводитьПоКассовойСмене = Ложь; 

