
Функция ПечатьКассовыйЛистСервер(ПараметрыОтчета) Экспорт
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Защита = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КассовыйЛист";
	//+МАН 02.12.25 Добавил параметры
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	//-МАН
	Макет = ПолучитьОбщийМакет("ЛБ_ПФ_КассовыйЛист");
	
	ОбластьШапка   = Макет.ПолучитьОбласть("Шапка");
	ОбластьТаблица = Макет.ПолучитьОбласть("ОбластьТаблица");
	ОбластьПодвал  = Макет.ПолучитьОбласть("ОбластьПодвал");
	
	ОбластьШапка.Параметры.Организация = ПараметрыОтчета.Организация.НаименованиеСокращенное;
	ОбластьШапка.Параметры.Ломбард = ПараметрыОтчета.Ломбард;
	
	АдресЛомбарда = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПараметрыОтчета.Ломбард.ПолучитьОбъект(),,ПараметрыОтчета.Период);
	СтруктураАдреса = фПрочитатьJSON(ПараметрыОтчета.Ломбард.КонтактнаяИнформация[0].Значение);
	ОбластьШапка.Параметры.Город = "г. " + ?(СтруктураАдреса.Свойство("city"), СтруктураАдреса.city, "");
	
	Результат = ЛБ_ОбщийМодуль.ПолучитьНомерКассовогоЛиста(НачалоДня(ПараметрыОтчета.Период), КонецДня(ПараметрыОтчета.Период), ПараметрыОтчета.Организация, ПараметрыОтчета.Ломбард);
	НомерКЛ = Результат.Номер;
	ОбластьШапка.Параметры.НомерЛиста = НомерКЛ;
	ОбластьШапка.Параметры.Дата = Формат(ПараметрыОтчета.Период, "ДФ='дд ММММ гггг'");
	
	//Остатки
	Запрос = Новый Запрос;   
	Запрос.УстановитьПараметр("Дата1", НачалоДня(ПараметрыОтчета.Период));  
	Запрос.УстановитьПараметр("Дата2", КонецДня(ПараметрыОтчета.Период));
	Запрос.УстановитьПараметр("Организация", ПараметрыОтчета.Организация);
	Запрос.УстановитьПараметр("Ломбард", ПараметрыОтчета.Ломбард);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДенежныеСредстваОстаткиИОбороты.Ломбард КАК Ломбард,
	               |	СУММА(ЛБ_ДенежныеСредстваОстаткиИОбороты.СуммаНачальныйОстаток) КАК СуммаНач,
	               |	СУММА(ЛБ_ДенежныеСредстваОстаткиИОбороты.СуммаКонечныйОстаток) КАК СуммаКон,
	               |	СУММА(ЛБ_ДенежныеСредстваОстаткиИОбороты.СуммаПриход) КАК СуммаПриход,
	               |	СУММА(ЛБ_ДенежныеСредстваОстаткиИОбороты.СуммаРасход) КАК СуммаРасход
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ДенежныеСредства.ОстаткиИОбороты(
	               |			&Дата1,
	               |			&Дата2,
	               |			,
	               |			,
	               |			Организация = &Организация
	               |				И ВидДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДенежныхСредств.Наличные)
	               |				И Ломбард = &Ломбард) КАК ЛБ_ДенежныеСредстваОстаткиИОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ДенежныеСредстваОстаткиИОбороты.Ломбард";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		СуммаОстатокНачало = Выборка.СуммаНач;
		СуммаОстатокКонец = Выборка.СуммаКон; 
		СуммаПриход = Выборка.СуммаПриход;
		СуммаРасход = Выборка.СуммаРасход;
	Иначе
		СуммаОстатокНачало = 0;
		СуммаОстатокКонец = 0; 
		СуммаПриход = 0;
		СуммаРасход = 0;
	КонецЕсли;
	
	ОбластьШапка.Параметры.ОстатокНачало = СуммаОстатокНачало;
	ТабличныйДокумент.Вывести(ОбластьШапка);
	//Обороты
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ДвиженияДенежныхСредств.Номер КАК НомерДокумента,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЛБ_ДвиженияДенежныхСредств.Регистратор) = ТИП(Документ.ЛБ_ОперацияПоЗалогу)
		|				И ЛБ_ДвиженияДенежныхСредств.ВидДвиженияДС = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДвиженияДС.Приход)
		|			ТОГДА ""Залогодателей с применением ККT""
		|		КОГДА ТИПЗНАЧЕНИЯ(ЛБ_ДвиженияДенежныхСредств.Регистратор) = ТИП(Документ.ЛБ_ОперацияПоЗалогу)
		|				И ЛБ_ДвиженияДенежныхСредств.ВидДвиженияДС = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДвиженияДС.Расход)
		|			ТОГДА ""Залогодателям с применением ККT""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЛБ_ДвиженияДенежныхСредств.ФизическоеЛицо = НЕОПРЕДЕЛЕНО
		|					ТОГДА ЛБ_ДвиженияДенежныхСредств.ФИО
		|				КОГДА ЛБ_ДвиженияДенежныхСредств.ФизическоеЛицо = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|					ТОГДА ЛБ_ДвиженияДенежныхСредств.Контрагент
		|				ИНАЧЕ ЛБ_ДвиженияДенежныхСредств.ФизическоеЛицо
		|			КОНЕЦ
		|	КОНЕЦ КАК Контрагент,
		|	СУММА(ЛБ_ДвиженияДенежныхСредств.Сумма) КАК Сумма,
		|	ЛБ_ДвиженияДенежныхСредств.ВидДвиженияДС КАК ВидДвиженияДС,
		|	ЛБ_ДвиженияДенежныхСредств.Кт КАК Кт,
		|	ЛБ_ДвиженияДенежныхСредств.Дт КАК Дт
		|ПОМЕСТИТЬ ВТ1
		|ИЗ
		|	РегистрНакопления.ЛБ_ДвиженияДенежныхСредств КАК ЛБ_ДвиженияДенежныхСредств
		|ГДЕ
		|	ЛБ_ДвиженияДенежныхСредств.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ЛБ_ДвиженияДенежныхСредств.Организация = &Организация
		|	И ЛБ_ДвиженияДенежныхСредств.Ломбард = &Ломбард
		|	И ЛБ_ДвиженияДенежныхСредств.ВидДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДенежныхСредств.Наличные)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛБ_ДвиженияДенежныхСредств.Номер,
		|	ЛБ_ДвиженияДенежныхСредств.ВидДвиженияДС,
		|	ЛБ_ДвиженияДенежныхСредств.Кт,
		|	ЛБ_ДвиженияДенежныхСредств.Дт,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЛБ_ДвиженияДенежныхСредств.Регистратор) = ТИП(Документ.ЛБ_ОперацияПоЗалогу)
		|				И ЛБ_ДвиженияДенежныхСредств.ВидДвиженияДС = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДвиженияДС.Приход)
		|			ТОГДА ""Залогодателей с применением ККT""
		|		КОГДА ТИПЗНАЧЕНИЯ(ЛБ_ДвиженияДенежныхСредств.Регистратор) = ТИП(Документ.ЛБ_ОперацияПоЗалогу)
		|				И ЛБ_ДвиженияДенежныхСредств.ВидДвиженияДС = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДвиженияДС.Расход)
		|			ТОГДА ""Залогодателям с применением ККT""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЛБ_ДвиженияДенежныхСредств.ФизическоеЛицо = НЕОПРЕДЕЛЕНО
		|					ТОГДА ЛБ_ДвиженияДенежныхСредств.ФИО
		|				КОГДА ЛБ_ДвиженияДенежныхСредств.ФизическоеЛицо = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|					ТОГДА ЛБ_ДвиженияДенежныхСредств.Контрагент
		|				ИНАЧЕ ЛБ_ДвиженияДенежныхСредств.ФизическоеЛицо
		|			КОНЕЦ
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ1.НомерДокумента КАК НомерДокумента,
		|	ВТ1.Контрагент КАК Контрагент,
		|	ВТ1.Сумма КАК Сумма,
		|	ВТ1.ВидДвиженияДС КАК ВидДвиженияДС,
		|	ВТ1.Кт КАК Кт,
		|	ВТ1.Дт КАК Дт
		|ИЗ
		|	ВТ1 КАК ВТ1
		|ГДЕ
		|	ВТ1.Сумма <> 0";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ПараметрыОтчета.Период));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПараметрыОтчета.Период));
	Запрос.УстановитьПараметр("Ломбард", ПараметрыОтчета.Ломбард);
	Запрос.УстановитьПараметр("Организация", ПараметрыОтчета.Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	КоличествоПриходных = 0;
	КоличествоРасходных = 0;
	
	Пока Выборка.Следующий() Цикл
		ОбластьТаблица.Параметры.НомерДокумента = Выборка.НомерДокумента;
		ОбластьТаблица.Параметры.Контрагент = Выборка.Контрагент;
		Если Выборка.Дт = "20202" Тогда 
			ОбластьТаблица.Параметры.НомерСчета = Выборка.Кт;
		ИначеЕсли Выборка.Кт = "20202" Тогда
			ОбластьТаблица.Параметры.НомерСчета = Выборка.Дт;
		КонецЕсли;
		Если Выборка.ВидДвиженияДС = Перечисления.ЛБ_ВидыДвиженияДС.Приход Тогда
			ОбластьТаблица.Параметры.СуммаПриход = Выборка.Сумма;
			ОбластьТаблица.Параметры.СуммаРасход = " ";
			КоличествоПриходных = КоличествоПриходных + 1;
			ТабличныйДокумент.Вывести(ОбластьТаблица);
		Иначе
			ОбластьТаблица.Параметры.СуммаРасход = Выборка.Сумма;
			ОбластьТаблица.Параметры.СуммаПриход = " ";
			КоличествоРасходных = КоличествоРасходных + 1;
			ТабличныйДокумент.Вывести(ОбластьТаблица);
		КонецЕсли;
	КонецЦикла;
	
	Ответственный              = ПараметрыСеанса.ТекущийСотрудник;	
	ФИООтветственного          = СтрРазделить(Строка(Ответственный), " ");
	
	Если ФИООтветственного.Количество() > 0 Тогда
		ФамилияОтветственного  = ФИООтветственного[0]; 
		ИнициалыОтветственного = Лев(ФИООтветственного[1], 1) + "." + Лев(ФИООтветственного[2], 1) + ".";
	Иначе
		ФамилияОтветственного  = ""; 
		ИнициалыОтветственного = "";
	КонецЕсли;
	
	ОбластьПодвал.Параметры.ИтогоПриход = СуммаПриход;
	ОбластьПодвал.Параметры.ИтогоРасход = СуммаРасход;
	ОбластьПодвал.Параметры.ОстатокКонец = СуммаОстатокКонец;
	
	ОбластьПодвал.Параметры.ФИОКассира = ФамилияОтветственного + " " + ИнициалыОтветственного;
	
	ОбластьПодвал.Параметры.КоличествоПриходных = ЧислоПрописью(КоличествоПриходных,"НП=Ложь",",,,,,,,,0");
	ОбластьПодвал.Параметры.КоличествоРасходных = ЧислоПрописью(КоличествоРасходных,"НП=Ложь",",,,,,,,,0");
	
	ДанныеНачальника_Управляющего = ПолучитьНачальникаОтделения_Управляющего(ПараметрыОтчета.Ломбард, ТекущаяДата());
	Бухгалтер = ?(ДанныеНачальника_Управляющего.Свойство("Сотрудник"), Строка(ДанныеНачальника_Управляющего.Сотрудник), "");
	
	ФИОБухгалтера          = СтрРазделить(Строка(Бухгалтер), " ");
	
	Если ФИОБухгалтера.Количество() > 0 Тогда
		ФамилияБухгалтера  = ФИОБухгалтера[0]; 
		ИнициалыБухгалтера = Лев(ФИОБухгалтера[1], 1) + "." + Лев(ФИОБухгалтера[2], 1) + ".";
	Иначе
		ФамилияБухгалтера  = ""; 
		ИнициалыБухгалтера = "";
	КонецЕсли;
	
	ОбластьПодвал.Параметры.ФИОБухгалтера = ФамилияБухгалтера + " " + ИнициалыБухгалтера;
	
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	ТабличныйДокумент.НижнийКолонтитул.Выводить = Истина;
	ТабличныйДокумент.НижнийКолонтитул.НачальнаяСтраница = 1;
	ТабличныйДокумент.НижнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
	ТабличныйДокумент.НижнийКолонтитул.ТекстСлева = Строка(ТекущаяДата()) + 
	" " + ФамилияОтветственного + " " + ИнициалыОтветственного;
	ТабличныйДокумент.НижнийКолонтитул.ТекстВЦентре = "КАССА за " + Формат(ПараметрыОтчета.Период, "ДФ='дд ММММ гггг'") + " года";
	ТабличныйДокумент.НижнийКолонтитул.ТекстСправа = "Страница [&НомерСтраницы] из [&СтраницВсего]";
	Шрифт = Новый Шрифт("Times New Roman", 8);
	ТабличныйДокумент.НижнийКолонтитул.Шрифт = Шрифт;
	
	Возврат ТабличныйДокумент;
КонецФункции

Функция фПрочитатьJSON(ТекстJSON) Экспорт
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(ТекстJSON);
	Структура = ЗаполнитьСтруктуруИзОтветаJSON(Чтение);	
	Чтение.Закрыть();
	Возврат Структура;
КонецФункции

Функция ЗаполнитьСтруктуруИзОтветаJSON(Знач Чтение) Экспорт
	Результат = Новый Структура;

	ПоследнееИмяРеквизита = Неопределено;
	
	Пока Чтение.Прочитать() Цикл
		Тип = Чтение.ТипТекущегоЗначения;
		Если Тип = ТипЗначенияJSON.НачалоОбъекта И ПоследнееИмяРеквизита<>Неопределено Тогда 
			Результат[ПоследнееИмяРеквизита] = ЗаполнитьСтруктуруИзОтветаJSON(Чтение);
		ИначеЕсли Тип = ТипЗначенияJSON.КонецОбъекта Тогда 
			Возврат Результат;
			ПоследнееИмяРеквизита = Неопределено;
		ИначеЕсли Тип = ТипЗначенияJSON.ИмяСвойства Тогда 
			Результат.Вставить(Чтение.ТекущееЗначение, Неопределено);
			ПоследнееИмяРеквизита = Чтение.ТекущееЗначение;
		ИначеЕсли Тип = ТипЗначенияJSON.Булево или Тип = ТипЗначенияJSON.Строка
			или Тип = ТипЗначенияJSON.Число или Тип = ТипЗначенияJSON.Null Тогда 
			Результат[ПоследнееИмяРеквизита] = Чтение.ТекущееЗначение;
		ИначеЕсли Тип = ТипЗначенияJSON.НачалоМассива Тогда 
			Результат[ПоследнееИмяРеквизита] = ЗаполнитьМассивИзОтветаJSON(Чтение);
		КонецЕсли;
	КонецЦикла;  
		
	Возврат Результат;
КонецФункции

Функция ЗаполнитьМассивИзОтветаJSON(Знач Чтение)
	Результат = Новый Массив;
	
	Пока Чтение.Прочитать() Цикл
		Тип = Чтение.ТипТекущегоЗначения;
		Если Тип = ТипЗначенияJSON.НачалоОбъекта Тогда 
			Результат.Добавить(ЗаполнитьСтруктуруИзОтветаJSON(Чтение));
		ИначеЕсли Тип = ТипЗначенияJSON.КонецМассива Тогда 
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;  
	
	Возврат Результат;
КонецФункции

Функция ПолучитьНачальникаОтделения_Управляющего(Ломбард, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
		|ПОМЕСТИТЬ ВТОтделение
		|ИЗ
		|	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, Ломбард = &Ломбард) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард
		|ПОМЕСТИТЬ ЛомбардыОтделения
		|ИЗ
		|	ВТОтделение КАК ВТОтделение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, ) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
		|		ПО ВТОтделение.Отделение = ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
		|	ВЫБОР
		|		КОГДА ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяНачальникомОтделения
		|			ТОГДА ""Начальник отделения ломбардов""
		|		КОГДА ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяЗаместителемНачальникаОтделения
		|			ТОГДА ""Начальник отделения ломбардов""
		|		КОГДА ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяУправляющимЛомбарда
		|			ТОГДА ""Управляющий ломбарда""
		|	КОНЕЦ КАК Должность
		|ИЗ
		|	ЛомбардыОтделения КАК ЛомбардыОтделения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КадроваяИсторияСотрудников.СрезПоследних(&Дата, ) КАК ЛБ_КадроваяИсторияСотрудниковСрезПоследних
		|		ПО ЛомбардыОтделения.Ломбард = ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Подразделение
		|ГДЕ
		|	(ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяНачальникомОтделения
		|			ИЛИ ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяЗаместителемНачальникаОтделения
		|			ИЛИ ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяУправляющимЛомбарда)
		|	И ЛБ_КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия <> &ВидСобытияУвольнение";
	
	Запрос.УстановитьПараметр("ВидСобытияУвольнение", Перечисления.ЛБ_ВидыКадровыхСобытий.Увольнение);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	
	Выборка = Запрос.Выполнить().Выбрать();
	СтруктураВозврата = Новый Структура;
	Если Выборка.Следующий() Тогда	
		Заместитель = ПроверкаЗаместителя(Выборка.Сотрудник, Дата);
		Если ЗначениеЗаполнено(Заместитель) Тогда
			СтруктураВозврата.Вставить("Сотрудник", Заместитель);
		Иначе
			СтруктураВозврата.Вставить("Сотрудник", Выборка.Сотрудник);
		КонецЕсли;
		СтруктураВозврата.Вставить("Должность", Выборка.Должность);
	КонецЕсли;
    Возврат СтруктураВозврата;
КонецФункции 

Функция ПроверкаЗаместителя(Сотрудник, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ЗаместителиСрезПоследних.Заместитель КАК Заместитель
		|ИЗ
		|	РегистрСведений.ЛБ_Заместители.СрезПоследних(
		|			&Дата,
		|			СотрудникКогоЗамещают = &Сотрудник
		|				И ОкончаниеЗамещения >= &Дата) КАК ЛБ_ЗаместителиСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Заместитель;
	Иначе
		Возврат Справочники.ЛБ_Сотрудники.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Функция ПечатьОтчетДДССервер(ПараметрыОтчета) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Защита = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетДДС";
	//+МАН 02.12.25 Добавил параметры
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	//-МАН
	Макет = ПолучитьОбщийМакет("ЛБ_ПФ_ДДС");
	
	ОбластьШапка   = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьСвоиБилеты = Макет.ПолучитьОбласть("ОбластьСвоиБилеты");
	ОбластьИтогоСвоиБилеты = Макет.ПолучитьОбласть("ОбластьИтогоСвоиБилеты");
	ОбластьДругиеБилеты = Макет.ПолучитьОбласть("ОбластьДругиеБилеты");
	ОбластьИтогоДругиеБилеты = Макет.ПолучитьОбласть("ОбластьИтогоДругиеБилеты");
	ОбластьИтого = Макет.ПолучитьОбласть("ОбластьИтого");
	ОбластьПодвал  = Макет.ПолучитьОбласть("ОбластьПодвал");
	
	ОбластьШапка.Параметры.Ломбард = ПараметрыОтчета.Ломбард;
	
	АдресЛомбарда = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПараметрыОтчета.Ломбард.ПолучитьОбъект(),,ПараметрыОтчета.НачалоПериода);
	СтруктураАдреса = фПрочитатьJSON(ПараметрыОтчета.Ломбард.КонтактнаяИнформация[0].Значение);
	ОбластьШапка.Параметры.Город = "г. " + ?(СтруктураАдреса.Свойство("city"), СтруктураАдреса.city, "");
	
	Если НачалоДня(ПараметрыОтчета.НачалоПериода) = НачалоДня(ПараметрыОтчета.КонецПериода) Тогда
		ОбластьШапка.Параметры.Период = Формат(ПараметрыОтчета.НачалоПериода, "ДФ='дд ММММ гггг'") + " года";
	Иначе
		ОбластьШапка.Параметры.Период = Формат(ПараметрыОтчета.НачалоПериода, "ДФ='дд ММММ гггг'") + " года" + "-" + Формат(ПараметрыОтчета.КонецПериода, "ДФ='дд ММММ гггг'") + " года";
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	//СвоиЗБ	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ДвиженияДенежныхСредств.Ломбард КАК Ломбард,
		|	ЛБ_ДвиженияДенежныхСредств.Регистратор КАК Регистратор,
		|	ЛБ_ДвиженияДенежныхСредств.Сумма КАК Сумма,
		|	ЛБ_ДвиженияДенежныхСредств.ВидОперации КАК ВидОперации,
		|	ЛБ_ДвиженияДенежныхСредств.Регистратор.НомерЗалоговогоБилета КАК РегистраторНомерЗалоговогоБилета,
		|	ЛБ_ДвиженияДенежныхСредств.Регистратор.СуммаОплатыПроценты КАК РегистраторСуммаОплатыПроценты,
		|	ЛБ_ДвиженияДенежныхСредств.Регистратор.СуммаОплаты КАК РегистраторСуммаОплаты,
		|	ЛБ_ДвиженияДенежныхСредств.Регистратор.СуммаОплатыСсуда КАК РегистраторСуммаОплатыСсуда,
		|	ЛБ_ДвиженияДенежныхСредств.Регистратор.Залогодатель КАК РегистраторЗалогодатель
		|ПОМЕСТИТЬ ДДС
		|ИЗ
		|	РегистрНакопления.ЛБ_ДвиженияДенежныхСредств КАК ЛБ_ДвиженияДенежныхСредств
		|ГДЕ
		|	ЛБ_ДвиженияДенежныхСредств.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ТИПЗНАЧЕНИЯ(ЛБ_ДвиженияДенежныхСредств.Регистратор) = ТИП(Документ.ЛБ_ОперацияПоЗалогу)
		|	И ЛБ_ДвиженияДенежныхСредств.Ломбард = &Ломбард
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПервых.Период КАК Период,
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПервых.НомерЗалоговогоБилета КАК НомерЗалоговогоБилета,
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПервых.Залогодатель КАК Залогодатель,
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПервых.Регистратор.Ломбард КАК РегистраторЛомбард
		|ПОМЕСТИТЬ СостояниеЗБ
		|ИЗ
		|	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПервых(, СтатусЗалоговогоБилета = &СтатусЗБ) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПервых
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДДС.Ломбард КАК Ломбард,
		|	ДДС.Регистратор КАК Регистратор,
		|	ДДС.Сумма КАК Сумма,
		|	ДДС.ВидОперации КАК ВидОперации,
		|	ВЫБОР
		|		КОГДА ДДС.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПКО.ОплатаПоЗаймуПереоформление)
		|			ТОГДА ДДС.Регистратор.ПредыдущаяОперация.НомерЗалоговогоБилета
		|		ИНАЧЕ ДДС.Регистратор.НомерЗалоговогоБилета
		|	КОНЕЦ КАК НомерЗалоговогоБилета,
		|	СостояниеЗБ.Период КАК ДатаВыдачиЗайма,
		|	ДДС.РегистраторСуммаОплаты КАК СуммаОплаты,
		|	ДДС.РегистраторСуммаОплатыПроценты КАК СуммаОплатыПроценты,
		|	ДДС.РегистраторСуммаОплатыСсуда КАК СуммаОплатыДолг,
		|	СостояниеЗБ.Залогодатель КАК Залогодатель,
		|	ДДС.РегистраторЗалогодатель КАК Плательщик,
		|	ДДС.Регистратор.Дата КАК РегистраторДата,
		|	ДДС.Регистратор.ОтмененныйДокумент КАК РегистраторОтмененныйДокумент,
		|	ДДС.Регистратор.ПредыдущаяОперация КАК ПредыдущаяОперация,
		|	ДДС.Регистратор.ПредыдущаяОперация.НомерЗалоговогоБилета КАК ПредыдущаяОперацияНомерЗалоговогоБилета
		|ИЗ
		|	ДДС КАК ДДС
		|		ЛЕВОЕ СОЕДИНЕНИЕ СостояниеЗБ КАК СостояниеЗБ
		|		ПО (ВЫБОР
		|				КОГДА ДДС.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПКО.ОплатаПоЗаймуПереоформление)
		|					ТОГДА ДДС.Регистратор.ПредыдущаяОперация.НомерЗалоговогоБилета = СостояниеЗБ.НомерЗалоговогоБилета
		|				ИНАЧЕ ДДС.Регистратор.НомерЗалоговогоБилета = СостояниеЗБ.НомерЗалоговогоБилета
		|			КОНЕЦ)
		|ГДЕ
		|	СостояниеЗБ.РегистраторЛомбард = &Ломбард
		|
		|УПОРЯДОЧИТЬ ПО
		|	РегистраторДата,
		|	ВидОперации";
	
	Запрос.УстановитьПараметр("КонецПериода", ПараметрыОтчета.КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("Период", ПараметрыОтчета.КонецПериода);
	Запрос.УстановитьПараметр("СтатусЗБ", Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Оформлен);
	Запрос.УстановитьПараметр("Ломбард", ПараметрыОтчета.Ломбард);
	
	//исключение отмененных операций
	Выборка = Запрос.Выполнить().Выгрузить();
	МассивСтрокКУдалению = Новый Массив;
	
	Для Каждого ТекущаяСтрока Из Выборка Цикл
		Если ЗначениеЗаполнено(ТекущаяСтрока.РегистраторОтмененныйДокумент) Тогда
			МассивСтрокКУдалению.Добавить(ТекущаяСтрока);
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Регистратор", ТекущаяСтрока.РегистраторОтмененныйДокумент);
			СтруктураПоиска.Вставить("Сумма", -ТекущаяСтрока.Сумма);
			ОтмененнаяОперация = Выборка.НайтиСтроки(СтруктураПоиска);
			Если ОтмененнаяОперация.Количество() > 0 Тогда
				МассивСтрокКУдалению.Добавить(ОтмененнаяОперация[0]);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Элемент Из МассивСтрокКУдалению Цикл
		Выборка.Удалить(Элемент);
	КонецЦикла;
	//
	
	НомерПП = 0;
	ИтогоВыданныеСвои = 0;
	ИтогоВозвращенныеСвои = 0;
	ИтогоПроцентыСвои = 0;
	//+МАН 01.12.25 Вывод суммы по возвращенным и процентам
	ИтогоВозвращеноИПроцентыСвои = 0;
	//-МАН
	Для Каждого ТекущаяСтрока Из Выборка Цикл
		НомерПП = НомерПП + 1;
		ОбластьСвоиБилеты.Параметры.НомерПП = НомерПП;
		ОбластьСвоиБилеты.Параметры.НомерЛомбарда = ПараметрыОтчета.Ломбард.НомерЛомбарда;
		ОбластьСвоиБилеты.Параметры.НомерБилета = ТекущаяСтрока.НомерЗалоговогоБилета;
		ОбластьСвоиБилеты.Параметры.ДатаЗалога = ТекущаяСтрока.ДатаВыдачиЗайма;
		Если (ТекущаяСтрока.СуммаОплатыДолг = 0 И ТекущаяСтрока.СуммаОплатыПроценты = 0 И ТекущаяСтрока.Сумма > 0)
			Или ТекущаяСтрока.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ВыдачаЗаймаПереоформление Тогда
			ОбластьСвоиБилеты.Параметры.СуммаВыданного = ТекущаяСтрока.Сумма;
			ОбластьСвоиБилеты.Параметры.СуммаВозвращенного = "-";
			ОбластьСвоиБилеты.Параметры.СуммаПроцентов = "-";
			ОбластьСвоиБилеты.Параметры.Операция = " ";
			ИтогоВыданныеСвои = ИтогоВыданныеСвои + ТекущаяСтрока.Сумма;
			//+МАН 01.12.25 Вывод суммы по возвращенным и процентам
			ОбластьСвоиБилеты.Параметры.СуммаВозвращеноИПроценты = "-";
			//-МАН
			ТабличныйДокумент.Вывести(ОбластьСвоиБилеты);
		ИначеЕсли ТекущаяСтрока.СуммаОплатыДолг > 0 Или ТекущаяСтрока.СуммаОплатыПроценты > 0 Тогда
			ОбластьСвоиБилеты.Параметры.СуммаВыданного = "-";
			ОбластьСвоиБилеты.Параметры.СуммаВозвращенного = ?(ТекущаяСтрока.СуммаОплатыДолг > 0, ТекущаяСтрока.СуммаОплатыДолг, "-");
			ОбластьСвоиБилеты.Параметры.СуммаПроцентов = ?(ТекущаяСтрока.СуммаОплатыПроценты > 0, ТекущаяСтрока.СуммаОплатыПроценты, "-"); 
			//+МАН 30.10.25 Не было проверки "ПереходНаОХ", что вызывало ошибку. Дата 30.10.2025, ломб "95", плат "Крутиков Иван Андреевич"
			ПереходНаОХ = ПроверкаБилетаНаОХ(ТекущаяСтрока.НомерЗалоговогоБилета, ТекущаяСтрока.РегистраторДата + 2);
			//Было: ОбластьСвоиБилеты.Параметры.Операция = ОпределениеВидаОперации(ТекущаяСтрока.Регистратор, ТекущаяСтрока.Плательщик, ТекущаяСтрока.Залогодатель, ТекущаяСтрока.ВидОперации);
			ОбластьСвоиБилеты.Параметры.Операция = ОпределениеВидаОперации(ТекущаяСтрока.Регистратор, ТекущаяСтрока.Плательщик, ТекущаяСтрока.Залогодатель, ТекущаяСтрока.ВидОперации, ПереходНаОХ);
			//-МАН
			ИтогоВозвращенныеСвои = ИтогоВозвращенныеСвои + ТекущаяСтрока.СуммаОплатыДолг;
	        ИтогоПроцентыСвои = ИтогоПроцентыСвои + ТекущаяСтрока.СуммаОплатыПроценты;
			//+МАН 01.12.25 Вывод суммы по возвращенным и процентам
			СуммаВозвращеноИПроценты = ТекущаяСтрока.СуммаОплатыДолг + ТекущаяСтрока.СуммаОплатыПроценты;
			ОбластьСвоиБилеты.Параметры.СуммаВозвращеноИПроценты = ?(СуммаВозвращеноИПроценты > 0, СуммаВозвращеноИПроценты, "-");
			ИтогоВозвращеноИПроцентыСвои = ИтогоВозвращеноИПроцентыСвои + СуммаВозвращеноИПроценты;
			//-МАН
			ТабличныйДокумент.Вывести(ОбластьСвоиБилеты);
		КонецЕсли;
	КонецЦикла;
	ОбластьИтогоСвоиБилеты.Параметры.ИтогоВыданныеСвои = ИтогоВыданныеСвои;
	ОбластьИтогоСвоиБилеты.Параметры.ИтогоВозвращенныеСвои = ИтогоВозвращенныеСвои;
	ОбластьИтогоСвоиБилеты.Параметры.ИтогоПроцентыСвои = ИтогоПроцентыСвои;
	//+МАН 01.12.25 Вывод суммы по возвращенным и процентам
	ОбластьИтогоСвоиБилеты.Параметры.ИтогоВозвращеноИПроцентыСвои = ИтогоВозвращеноИПроцентыСвои;
	//-МАН
	ТабличныйДокумент.Вывести(ОбластьИтогоСвоиБилеты);
	
	//ДругиеЗБ	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ДвиженияДенежныхСредств.Ломбард КАК Ломбард,
		|	ЛБ_ДвиженияДенежныхСредств.Регистратор КАК Регистратор,
		|	ЛБ_ДвиженияДенежныхСредств.Сумма КАК Сумма,
		|	ЛБ_ДвиженияДенежныхСредств.ВидОперации КАК ВидОперации,
		|	ЛБ_ДвиженияДенежныхСредств.Регистратор.НомерЗалоговогоБилета КАК РегистраторНомерЗалоговогоБилета,
		|	ЛБ_ДвиженияДенежныхСредств.Регистратор.СуммаОплатыПроценты КАК РегистраторСуммаОплатыПроценты,
		|	ЛБ_ДвиженияДенежныхСредств.Регистратор.СуммаОплаты КАК РегистраторСуммаОплаты,
		|	ЛБ_ДвиженияДенежныхСредств.Регистратор.СуммаОплатыСсуда КАК РегистраторСуммаОплатыСсуда,
		|	ЛБ_ДвиженияДенежныхСредств.Регистратор.Залогодатель КАК РегистраторЗалогодатель
		|ПОМЕСТИТЬ ДДС
		|ИЗ
		|	РегистрНакопления.ЛБ_ДвиженияДенежныхСредств КАК ЛБ_ДвиженияДенежныхСредств
		|ГДЕ
		|	ЛБ_ДвиженияДенежныхСредств.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ТИПЗНАЧЕНИЯ(ЛБ_ДвиженияДенежныхСредств.Регистратор) = ТИП(Документ.ЛБ_ОперацияПоЗалогу)
		|	И ЛБ_ДвиженияДенежныхСредств.Ломбард = &Ломбард
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПервых.Период КАК Период,
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПервых.НомерЗалоговогоБилета КАК НомерЗалоговогоБилета,
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПервых.Залогодатель КАК Залогодатель,
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПервых.Регистратор.Ломбард КАК РегистраторЛомбард
		|ПОМЕСТИТЬ СостояниеЗБ
		|ИЗ
		|	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПервых(, СтатусЗалоговогоБилета = &СтатусЗБ) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПервых
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДДС.Ломбард КАК Ломбард,
		|	ДДС.Регистратор КАК Регистратор,
		|	ДДС.Сумма КАК Сумма,
		|	ДДС.ВидОперации КАК ВидОперации,
		|	ВЫБОР
		|		КОГДА ДДС.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПКО.ОплатаПоЗаймуПереоформление)
		|			ТОГДА ДДС.Регистратор.ПредыдущаяОперация.НомерЗалоговогоБилета
		|		ИНАЧЕ ДДС.Регистратор.НомерЗалоговогоБилета
		|	КОНЕЦ КАК НомерЗалоговогоБилета,
		|	СостояниеЗБ.Период КАК ДатаВыдачиЗайма,
		|	ДДС.РегистраторСуммаОплаты КАК СуммаОплаты,
		|	ДДС.РегистраторСуммаОплатыПроценты КАК СуммаОплатыПроценты,
		|	ДДС.РегистраторСуммаОплатыСсуда КАК СуммаОплатыДолг,
		|	СостояниеЗБ.Залогодатель КАК Залогодатель,
		|	ДДС.РегистраторЗалогодатель КАК Плательщик,
		|	ДДС.Регистратор.Дата КАК РегистраторДата,
		|	ДДС.Регистратор.ОтмененныйДокумент КАК РегистраторОтмененныйДокумент,
		|	ДДС.Регистратор.ПредыдущаяОперация КАК ПредыдущаяОперация,
		|	ДДС.Регистратор.ПредыдущаяОперация.НомерЗалоговогоБилета КАК ПредыдущаяОперацияНомерЗалоговогоБилета
		|ИЗ
		|	ДДС КАК ДДС
		|		ЛЕВОЕ СОЕДИНЕНИЕ СостояниеЗБ КАК СостояниеЗБ
		|		ПО (ВЫБОР
		|				КОГДА ДДС.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПКО.ОплатаПоЗаймуПереоформление)
		|					ТОГДА ДДС.Регистратор.ПредыдущаяОперация.НомерЗалоговогоБилета = СостояниеЗБ.НомерЗалоговогоБилета
		|				ИНАЧЕ ДДС.Регистратор.НомерЗалоговогоБилета = СостояниеЗБ.НомерЗалоговогоБилета
		|			КОНЕЦ)
		|ГДЕ
		|	СостояниеЗБ.РегистраторЛомбард <> &Ломбард
		|
		|УПОРЯДОЧИТЬ ПО
		|	РегистраторДата,
		|	ВидОперации";
	
	Запрос.УстановитьПараметр("КонецПериода", ПараметрыОтчета.КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("Период", ПараметрыОтчета.КонецПериода);
	Запрос.УстановитьПараметр("СтатусЗБ", Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Оформлен);
	Запрос.УстановитьПараметр("Ломбард", ПараметрыОтчета.Ломбард);
	
	//исключение отмененных операций
	Выборка = Запрос.Выполнить().Выгрузить();
	МассивСтрокКУдалению = Новый Массив;
	
	Для Каждого ТекущаяСтрока Из Выборка Цикл
		Если ЗначениеЗаполнено(ТекущаяСтрока.РегистраторОтмененныйДокумент) Тогда
			МассивСтрокКУдалению.Добавить(ТекущаяСтрока);
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Регистратор", ТекущаяСтрока.РегистраторОтмененныйДокумент);
			СтруктураПоиска.Вставить("Сумма", -ТекущаяСтрока.Сумма);
			ОтмененнаяОперация = Выборка.НайтиСтроки(СтруктураПоиска);
			Если ОтмененнаяОперация.Количество() > 0 Тогда
				МассивСтрокКУдалению.Добавить(ОтмененнаяОперация[0]);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Элемент Из МассивСтрокКУдалению Цикл
		Выборка.Удалить(Элемент);
	КонецЦикла;
	//
	
	НомерПП = 0;
	ИтогоВыданныеДругие = 0;
	ИтогоВозвращенныеДругие = 0;
	ИтогоПроцентыДругие = 0;
	//+МАН 01.12.25 Вывод суммы по возвращенным и процентам
	ИтогоВозвращеноИПроцентыДругие = 0;
	//-МАН
	
	Для Каждого ТекущаяСтрока Из Выборка Цикл
		НомерПП = НомерПП + 1;
		ОбластьДругиеБилеты.Параметры.НомерПП = НомерПП;
		ОбластьДругиеБилеты.Параметры.НомерЛомбарда = ПараметрыОтчета.Ломбард.НомерЛомбарда;
		ОбластьДругиеБилеты.Параметры.НомерБилета = ТекущаяСтрока.НомерЗалоговогоБилета;
		ОбластьДругиеБилеты.Параметры.ДатаЗалога = ТекущаяСтрока.ДатаВыдачиЗайма;
		Если (ТекущаяСтрока.СуммаОплатыДолг = 0 И ТекущаяСтрока.СуммаОплатыПроценты = 0 И ТекущаяСтрока.Сумма > 0)
			Или ТекущаяСтрока.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ВыдачаЗаймаПереоформление Тогда
			ОбластьДругиеБилеты.Параметры.СуммаВыданного = ТекущаяСтрока.Сумма;
			ОбластьДругиеБилеты.Параметры.СуммаВозвращенного = "-";
			ОбластьДругиеБилеты.Параметры.СуммаПроцентов = "-";
			ОбластьДругиеБилеты.Параметры.Операция = " ";
			ИтогоВыданныеДругие = ИтогоВыданныеДругие + ТекущаяСтрока.Сумма;
			//+МАН 01.12.25 Вывод суммы по возвращенным и процентам
			ОбластьДругиеБилеты.Параметры.СуммаВозвращеноИПроценты = "-";
			//-МАН			
			ТабличныйДокумент.Вывести(ОбластьДругиеБилеты);
		ИначеЕсли ТекущаяСтрока.СуммаОплатыДолг > 0 Или ТекущаяСтрока.СуммаОплатыПроценты > 0 Тогда
			ОбластьДругиеБилеты.Параметры.СуммаВыданного = "-";
			ОбластьДругиеБилеты.Параметры.СуммаВозвращенного = ?(ТекущаяСтрока.СуммаОплатыДолг > 0, ТекущаяСтрока.СуммаОплатыДолг, "-");
			ОбластьДругиеБилеты.Параметры.СуммаПроцентов = ?(ТекущаяСтрока.СуммаОплатыПроценты > 0, ТекущаяСтрока.СуммаОплатыПроценты, "-");
			ПереходНаОХ = ПроверкаБилетаНаОХ(ТекущаяСтрока.НомерЗалоговогоБилета, ТекущаяСтрока.РегистраторДата + 2);
			ОбластьДругиеБилеты.Параметры.Операция = ОпределениеВидаОперации(ТекущаяСтрока.Регистратор, ТекущаяСтрока.Плательщик, ТекущаяСтрока.Залогодатель, ТекущаяСтрока.ВидОперации, ПереходНаОХ);
			ИтогоВозвращенныеДругие = ИтогоВозвращенныеДругие + ТекущаяСтрока.СуммаОплатыДолг;
	        ИтогоПроцентыДругие = ИтогоПроцентыДругие + ТекущаяСтрока.СуммаОплатыПроценты;
			//+МАН 01.12.25 Вывод суммы по возвращенным и процентам
			СуммаВозвращеноИПроценты = ТекущаяСтрока.СуммаОплатыДолг + ТекущаяСтрока.СуммаОплатыПроценты;
			ОбластьДругиеБилеты.Параметры.СуммаВозвращеноИПроценты = ?(СуммаВозвращеноИПроценты > 0, СуммаВозвращеноИПроценты, "-");
			ИтогоВозвращеноИПроцентыДругие = ИтогоВозвращеноИПроцентыДругие + СуммаВозвращеноИПроценты;
			//-МАН
			ТабличныйДокумент.Вывести(ОбластьДругиеБилеты);
		КонецЕсли;
	КонецЦикла;
	
	ОбластьИтогоДругиеБилеты.Параметры.ИтогоВыданныеДругие = ИтогоВыданныеДругие;
	ОбластьИтогоДругиеБилеты.Параметры.ИтогоВозвращенныеДругие = ИтогоВозвращенныеДругие;
	ОбластьИтогоДругиеБилеты.Параметры.ИтогоПроцентыДругие = ИтогоПроцентыДругие;
	//+МАН 01.12.25 Вывод суммы по возвращенным и процентам
	ОбластьИтогоДругиеБилеты.Параметры.ИтогоВозвращеноИПроцентыДругие = ИтогоВозвращеноИПроцентыДругие;
	//-МАН
	ТабличныйДокумент.Вывести(ОбластьИтогоДругиеБилеты);
	
	ИтогоВыданные = ИтогоВыданныеСвои + ИтогоВыданныеДругие;
	ИтогоВозвращенные = ИтогоВозвращенныеСвои + ИтогоВозвращенныеДругие;
	ИтогоПроценты = ИтогоПроцентыСвои + ИтогоПроцентыДругие;
	//+МАН 01.12.25 Вывод суммы по возвращенным и процентам
	ИтогоВозвращеноИПроценты = ИтогоВозвращеноИПроцентыСвои + ИтогоВозвращеноИПроцентыДругие;
	//-МАН
	
	ОбластьИтого.Параметры.ИтогоВыданные = ИтогоВыданные;
	ОбластьИтого.Параметры.ИтогоВозвращенные = ИтогоВозвращенные;
	ОбластьИтого.Параметры.ИтогоПроценты = ИтогоПроценты;
	//+МАН 01.12.25 Вывод суммы по возвращенным и процентам
	ОбластьИтого.Параметры.ИтогоВозвращеноИПроценты = ИтогоВозвращеноИПроценты;
	//-МАН
	ТабличныйДокумент.Вывести(ОбластьИтого);
	
	ОбластьПодвал.Параметры.ИтогоВыданныеПрописью = ЧислоПрописью(ИтогоВыданные,"Л=ru_RU; ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж" );
	ОбластьПодвал.Параметры.ИтогоВозвращенныеПрописью = ЧислоПрописью(ИтогоВозвращенные,"Л=ru_RU; ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж" );
	ОбластьПодвал.Параметры.ИтогоПроцентыПропиьсю = ЧислоПрописью(ИтогоПроценты,"Л=ru_RU; ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж" );
	//+МАН 01.12.25 Вывод суммы по возвращенным и процентам
	ОбластьПодвал.Параметры.ИтогоВозвращеноИПроцентыПропиьсю = ЧислоПрописью(ИтогоВозвращеноИПроценты,"Л=ru_RU; ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж" );
	//-МАН
	
	Ответственный              = ПараметрыСеанса.ТекущийСотрудник;
	
	ФИООтветственного          = СтрРазделить(Строка(Ответственный), " ");
	
	Если ФИООтветственного.Количество() > 0 Тогда
		ФамилияОтветственного  = ФИООтветственного[0]; 
		ИнициалыОтветственного = Лев(ФИООтветственного[1], 1) + "." + Лев(ФИООтветственного[2], 1) + ".";
	Иначе
		ФамилияОтветственного  = ""; 
		ИнициалыОтветственного = "";
	КонецЕсли; 
	
	ОбластьПодвал.Параметры.Ответственный = ФамилияОтветственного + " " + ИнициалыОтветственного;
	
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	ТабличныйДокумент.НижнийКолонтитул.Выводить = Истина;
	ТабличныйДокумент.НижнийКолонтитул.НачальнаяСтраница = 1;
	ТабличныйДокумент.НижнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
	ТабличныйДокумент.НижнийКолонтитул.ТекстСлева = Строка(ТекущаяДата()) + 
	" " + ФамилияОтветственного + " " + ИнициалыОтветственного;
	ТабличныйДокумент.НижнийКолонтитул.ТекстВЦентре = "Отчёт о движении денежных средств за период " + ОбластьШапка.Параметры.Период;
	ТабличныйДокумент.НижнийКолонтитул.ТекстСправа = "Страница [&НомерСтраницы] из [&СтраницВсего]";
	Шрифт = Новый Шрифт("Times New Roman", 8);
	ТабличныйДокумент.НижнийКолонтитул.Шрифт = Шрифт; 
	
	Возврат ТабличныйДокумент;
	
КонецФункции 

Функция ОпределениеВидаОперации(Операция, Плательщик, Залогодатель, ВидОперации = Неопределено, ПереходНаОХ = Неопределено)
	Если Операция.Выкуп И Операция.ВыдачаЗалога Тогда
		Если Плательщик = Залогодатель Тогда
			Обозначение = "В(Заемщ.)";
		Иначе
			Обозначение = "В(Дов. лицо)";
		КонецЕсли;
	ИначеЕсли ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ОплатаПоЗаймуПереоформление Тогда
		Если Плательщик = Залогодатель Тогда
			Обозначение = "В(Заемщ.)";
		Иначе
			Обозначение = "В(Дов. лицо)";
		КонецЕсли;
	ИначеЕсли Операция.Выкуп И НЕ Операция.ВыдачаЗалога Тогда
		Если ПереходНаОХ Тогда
			Если Плательщик = Залогодатель Тогда
				Обозначение = "В(Заемщ.)";
			ИначеЕсли Плательщик <> Залогодатель Тогда
				Если ПроверкаДоверенногоЛица(Залогодатель, Плательщик, Операция.Дата, Операция.НомерЗалоговогоБилета) Тогда
					Обозначение = "В(Дов. лицо)";
				Иначе
					Обозначение = "В(3л.)";
				КонецЕсли;	
			КонецЕсли;
		Иначе	
		Обозначение = "В(3л.)";
		КонецЕсли;
	ИначеЕсли (Операция.СуммаОплатыПроценты <> 0 И Операция.СуммаОплатыСсуда <> 0)
		Или (Операция.СуммаОплатыПроценты = 0 И Операция.СуммаОплатыСсуда <> 0) Тогда
		
		Если Плательщик = Залогодатель Тогда
			Обозначение = "В Част.(Заемщ.)";
		ИначеЕсли Плательщик <> Залогодатель Тогда
			Если ПроверкаДоверенногоЛица(Залогодатель, Плательщик, Операция.Дата, Операция.НомерЗалоговогоБилета) Тогда
				Обозначение = "В Част.(Дов. лицо)";
			Иначе
				Обозначение = "В Част.(3л.)";
			КонецЕсли;	
		КонецЕсли;
	ИначеЕсли Операция.СуммаОплатыПроценты <> 0 И Операция.СуммаОплатыСсуда = 0  Тогда
		ПредыдущаяДатаВыкупа = ПолучитьДатуВыкупа(Операция.НомерЗалоговогоБилета, Операция.Дата - 1);
		НоваяДатаВыкупа = ПолучитьДатуВыкупа(Операция.НомерЗалоговогоБилета, Операция.Дата);
		Если Плательщик = Залогодатель Тогда
			Если НоваяДатаВыкупа <> ПредыдущаяДатаВыкупа Тогда
				Обозначение = "П(Заемщ. с продлен. срока займа)";
			Иначе
				Обозначение = "П(Заемщ. без продлен. срока займа)";
			КонецЕсли;
		ИначеЕсли Плательщик <> Залогодатель Тогда
			Если ПроверкаДоверенногоЛица(Залогодатель, Плательщик, Операция.Дата, Операция.НомерЗалоговогоБилета) Тогда
				Если НоваяДатаВыкупа <> ПредыдущаяДатаВыкупа Тогда
				Обозначение = "П(Дов. лицо с продлен. срока займа)";
			Иначе
				Обозначение = "П(Дов. лицо без продлен. срока займа)";
			КонецЕсли;
			Иначе
				Если НоваяДатаВыкупа <> ПредыдущаяДатаВыкупа Тогда
				Обозначение = "П(3л. с продлен. срока займа)";
			Иначе
				Обозначение = "П(3л. без продлен. срока займа)";
			КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	Возврат Обозначение;
КонецФункции

Функция ПроверкаДоверенногоЛица(Залогодатель, Плательщик, Период, НомерЗБ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛБ_ДоверенностиСрезПоследних.Доверенность КАК Доверенность,
		|	ЛБ_ДоверенностиСрезПоследних.СтатусДоверенности КАК СтатусДоверенности,
		|	ЛБ_ДоверенностиСрезПоследних.Доверенность.СрокДействияДоверенности КАК ДоверенностьСрокДействияДоверенности
		|ИЗ
		|	РегистрСведений.ЛБ_Доверенности.СрезПоследних(
		|			&Период,
		|			Клиент = &Залогодатель
		|				И Доверенность.ПредставительКлиента = &Плательщик
		|				И ЗалоговыйБилет.НомерЗалоговогоБилета = &НомерЗБ
		|				И СтатусДоверенности = &Действует
		|				И Доверенность.СрокДействияДоверенности > &Период) КАК ЛБ_ДоверенностиСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.УстановитьПараметр("Плательщик", Плательщик);
	Запрос.УстановитьПараметр("НомерЗБ", НомерЗБ);
	Запрос.УстановитьПараметр("Действует", Перечисления.ЛБ_СтатусыДоверенностей.ДоверенностьОформлена);
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Если Выборка.Следующий() Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДатуВыкупа(НомерЗБ, Период)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаВыкупаЛьготныйСрок КАК Дата
		|ИЗ
		|	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&Период, НомерЗалоговогоБилета = &НомерЗБ) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних";
	
	Запрос.УстановитьПараметр("НомерЗБ", НомерЗБ);
	Запрос.УстановитьПараметр("Период", Период);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Дата;
	Иначе
		Возврат Период;
	КонецЕсли;	

КонецФункции

Функция ПечатьОтчетОплатаБилетовВДругихЛомбардахСервер(ПараметрыОтчета) Экспорт
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Защита = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетОплатаБилетовВДругихЛомбардах";
	//+МАН 02.12.25 Добавил параметры
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	//-МАН
	Макет = ПолучитьОбщийМакет("ЛБ_ПФ_ОплатаБилетовВДругихЛомбардах");
	
	ОбластьШапка   = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьБилеты = Макет.ПолучитьОбласть("ОбластьБилеты");
	ОбластьИтого = Макет.ПолучитьОбласть("ОбластьИтого");
	ОбластьПодвал  = Макет.ПолучитьОбласть("ОбластьПодвал");
	
	ОбластьШапка.Параметры.НомерЛомбарда = ПараметрыОтчета.Ломбард.НомерЛомбарда;
	
	Если НачалоДня(ПараметрыОтчета.НачалоПериода) = НачалоДня(ПараметрыОтчета.КонецПериода) Тогда
		ОбластьШапка.Параметры.Период = Формат(ПараметрыОтчета.НачалоПериода, "ДФ='дд ММММ гггг'") + " года";
	Иначе
		ОбластьШапка.Параметры.Период = Формат(ПараметрыОтчета.НачалоПериода, "ДФ='дд ММММ гггг'") + " года" + "-" + Формат(ПараметрыОтчета.КонецПериода, "ДФ='дд ММММ гггг'") + " года";
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.НомерЗалоговогоБилета КАК Билет
		|ПОМЕСТИТЬ ВТБилеты
		|ИЗ
		|	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(
		|			&КонецПериода,
		|			СтатусЗалоговогоБилета = &СтатусПринят
		|				И ЗалоговыйБилет.Ломбард = &Ломбард) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ДвиженияДенежныхСредств.Регистратор.НомерЗалоговогоБилета КАК РегистраторНомерЗалоговогоБилета,
		|	ЛБ_ДвиженияДенежныхСредств.Ломбард КАК Ломбард,
		|	ЛБ_ДвиженияДенежныхСредств.Регистратор.СуммаОплатыПроценты КАК СуммаПроценты,
		|	ЛБ_ДвиженияДенежныхСредств.Регистратор.СуммаОплатыСсуда КАК СуммаДолг,
		|	ЛБ_ДвиженияДенежныхСредств.Регистратор.Залогодатель КАК РегистраторЗалогодатель,
		|	ЛБ_ДвиженияДенежныхСредств.Регистратор КАК Регистратор,
		|	ЛБ_ДвиженияДенежныхСредств.Сумма КАК Сумма,
		|	ЛБ_ДвиженияДенежныхСредств.ВидОперации КАК ВидОперации
		|ПОМЕСТИТЬ ВТ_ОплатыБилетов
		|ИЗ
		|	РегистрНакопления.ЛБ_ДвиженияДенежныхСредств КАК ЛБ_ДвиженияДенежныхСредств
		|ГДЕ
		|	ЛБ_ДвиженияДенежныхСредств.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ЛБ_ДвиженияДенежныхСредств.ВидОперации В(&ВидОперации)
		|	И ЛБ_ДвиженияДенежныхСредств.Ломбард <> &Ломбард
		|	И ЛБ_ДвиженияДенежныхСредств.Регистратор.НомерЗалоговогоБилета В
		|			(ВЫБРАТЬ
		|				ВТБилеты.Билет
		|			ИЗ
		|				ВТБилеты)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПервых.Период КАК ДатаЗалога,
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПервых.НомерЗалоговогоБилета КАК НомерЗалоговогоБилета,
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПервых.СуммаЗайма КАК СуммаЗайма,
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПервых.Залогодатель КАК Залогодатель
		|ПОМЕСТИТЬ ВТ_СуммыЗаймов
		|ИЗ
		|	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПервых(, СтатусЗалоговогоБилета = &СтатусПринят) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПервых
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОплатыБилетов.РегистраторНомерЗалоговогоБилета КАК РегистраторНомерЗалоговогоБилета,
		|	ВТ_ОплатыБилетов.Ломбард КАК Ломбард,
		|	ВТ_ОплатыБилетов.СуммаПроценты КАК СуммаПроценты,
		|	ВТ_ОплатыБилетов.СуммаДолг КАК СуммаДолг,
		|	ВТ_СуммыЗаймов.СуммаЗайма КАК СуммаЗайма,
		|	ВТ_СуммыЗаймов.ДатаЗалога КАК ДатаВыдачиЗайма,
		|	ВТ_СуммыЗаймов.Залогодатель КАК Залогодатель,
		|	ВТ_ОплатыБилетов.РегистраторЗалогодатель КАК Плательщик,
		|	ВТ_ОплатыБилетов.Регистратор КАК Регистратор,
		|	ВТ_ОплатыБилетов.Регистратор.ОтмененныйДокумент КАК РегистраторОтмененныйДокумент,
		|	ВТ_ОплатыБилетов.Сумма КАК Сумма,
		|	ВТ_ОплатыБилетов.ВидОперации КАК ВидОперации
		|ИЗ
		|	ВТ_ОплатыБилетов КАК ВТ_ОплатыБилетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммыЗаймов КАК ВТ_СуммыЗаймов
		|		ПО ВТ_ОплатыБилетов.РегистраторНомерЗалоговогоБилета = ВТ_СуммыЗаймов.НомерЗалоговогоБилета";
	
	СписокВидОперации = Новый СписокЗначений;
	СписокВидОперации.Добавить(Перечисления.ЛБ_ВидыОперацийПКО.ОплатаПоЗайму);
	СписокВидОперации.Добавить(Перечисления.ЛБ_ВидыОперацийПКО.ОплатаПоЗаймуПереоформление);
	
	Запрос.УстановитьПараметр("ВидОперации", СписокВидОперации);
	Запрос.УстановитьПараметр("КонецПериода", ПараметрыОтчета.КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("СтатусПринят", Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Оформлен);
	Запрос.УстановитьПараметр("Ломбард", ПараметрыОтчета.Ломбард);
	
	//исключение отмененных операций
	Выборка = Запрос.Выполнить().Выгрузить();
	МассивСтрокКУдалению = Новый Массив;
	
	Для Каждого ТекущаяСтрока Из Выборка Цикл
		Если ЗначениеЗаполнено(ТекущаяСтрока.РегистраторОтмененныйДокумент) Тогда
			МассивСтрокКУдалению.Добавить(ТекущаяСтрока);
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Регистратор", ТекущаяСтрока.РегистраторОтмененныйДокумент);
			СтруктураПоиска.Вставить("Сумма", -ТекущаяСтрока.Сумма);
			ОтмененнаяОперация = Выборка.НайтиСтроки(СтруктураПоиска);
			Если ОтмененнаяОперация.Количество() > 0 Тогда
				МассивСтрокКУдалению.Добавить(ОтмененнаяОперация[0]);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Элемент Из МассивСтрокКУдалению Цикл
		Выборка.Удалить(Элемент);
	КонецЦикла;
	//
	
	НомерПП = 0;
	ИтогоВыданные = 0;
	ИтогоВозвращенные = 0;
	ИтогоПроценты = 0;
	Для Каждого ТекущаяСтрока Из Выборка Цикл
		НомерПП = НомерПП + 1;
		ОбластьБилеты.Параметры.НомерПП = НомерПП;
		ОбластьБилеты.Параметры.НомерЛомбарда = ТекущаяСтрока.Ломбард.НомерЛомбарда;
		ОбластьБилеты.Параметры.НомерБилета = ТекущаяСтрока.РегистраторНомерЗалоговогоБилета;
		ОбластьБилеты.Параметры.ДатаЗалога = ТекущаяСтрока.ДатаВыдачиЗайма;
		ОбластьБилеты.Параметры.СуммаВыданного = ТекущаяСтрока.СуммаЗайма;
		ОбластьБилеты.Параметры.СуммаВозвращенного = ТекущаяСтрока.СуммаДолг;
		ОбластьБилеты.Параметры.СуммаПроцентов = ?(ТекущаяСтрока.СуммаПроценты = 0, "-", ТекущаяСтрока.СуммаПроценты);
		ПереходНаОХ = ПроверкаБилетаНаОХ(ТекущаяСтрока.РегистраторНомерЗалоговогоБилета, ТекущаяСтрока.Регистратор.Дата + 2);
		ОбластьБилеты.Параметры.Операция = ОпределениеВидаОперации(ТекущаяСтрока.Регистратор, ТекущаяСтрока.Плательщик, ТекущаяСтрока.Залогодатель, ТекущаяСтрока.ВидОперации, ПереходНаОХ);
		ИтогоВозвращенные = ИтогоВозвращенные + ТекущаяСтрока.СуммаДолг;
		ИтогоПроценты = ИтогоПроценты + ТекущаяСтрока.СуммаПроценты;
		ТабличныйДокумент.Вывести(ОбластьБилеты);
	КонецЦикла;

	ОбластьИтого.Параметры.ИтогоВозвращенные = ИтогоВозвращенные;
	ОбластьИтого.Параметры.ИтогоПроценты = ИтогоПроценты;
	ТабличныйДокумент.Вывести(ОбластьИтого);	
	
	ОбластьПодвал.Параметры.ИтогоВозвращенныеПрописью = ЧислоПрописью(ИтогоВозвращенные,"Л=ru_RU; ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж" );
	ОбластьПодвал.Параметры.ИтогоПроцентыПропиьсю = ЧислоПрописью(ИтогоПроценты,"Л=ru_RU; ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж" );
	
	Ответственный              = ПараметрыСеанса.ТекущийСотрудник;
	
	ФИООтветственного          = СтрРазделить(Строка(Ответственный), " ");
	
	Если ФИООтветственного.Количество() > 0 Тогда
		ФамилияОтветственного  = ФИООтветственного[0]; 
		ИнициалыОтветственного = Лев(ФИООтветственного[1], 1) + "." + Лев(ФИООтветственного[2], 1) + ".";
	Иначе
		ФамилияОтветственного  = ""; 
		ИнициалыОтветственного = "";
	КонецЕсли; 
	
	ОбластьПодвал.Параметры.Ответственный = ФамилияОтветственного + " " + ИнициалыОтветственного;
	
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	ТабличныйДокумент.НижнийКолонтитул.Выводить = Истина;

	ТабличныйДокумент.НижнийКолонтитул.НачальнаяСтраница = 1;
	ТабличныйДокумент.НижнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
	ТабличныйДокумент.НижнийКолонтитул.ТекстСлева = Строка(ТекущаяДата()) + 
	" " + ФамилияОтветственного + " " + ИнициалыОтветственного;
	ТабличныйДокумент.НижнийКолонтитул.ТекстВЦентре = "Отчет по оплатам билетов ломбарда № " + ОбластьШапка.Параметры.НомерЛомбарда + " в других ломбардах за период " + ОбластьШапка.Параметры.Период;
	ТабличныйДокумент.НижнийКолонтитул.ТекстСправа = "Страница [&НомерСтраницы] из [&СтраницВсего]";
	Шрифт = Новый Шрифт("Times New Roman", 8);
	ТабличныйДокумент.НижнийКолонтитул.Шрифт = Шрифт;
	
	Возврат ТабличныйДокумент;
КонецФункции

Функция ПечатьОтчетВыданныеСОХСервер(ПараметрыОтчета) Экспорт
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Защита = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетВыданныеСОХ";
	//+МАН 02.12.25 Добавил параметры
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	//-МАН
	Макет = ПолучитьОбщийМакет("ЛБ_ПФ_ВыданныеСОХ");
	
	ОбластьШапка   = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьБилеты = Макет.ПолучитьОбласть("ОбластьБилеты");
	ОбластьИтого = Макет.ПолучитьОбласть("ОбластьИтого");
	ОбластьПодвал  = Макет.ПолучитьОбласть("ОбластьПодвал");
	
	ОбластьШапка.Параметры.Ломбард = ПараметрыОтчета.Ломбард;
	
	АдресЛомбарда = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПараметрыОтчета.Ломбард.ПолучитьОбъект(),,ПараметрыОтчета.НачалоПериода);
	СтруктураАдреса = фПрочитатьJSON(ПараметрыОтчета.Ломбард.КонтактнаяИнформация[0].Значение);
	ОбластьШапка.Параметры.Город = "г. " + ?(СтруктураАдреса.Свойство("city"), СтруктураАдреса.city, "");
	
	Если НачалоДня(ПараметрыОтчета.НачалоПериода) = НачалоДня(ПараметрыОтчета.КонецПериода) Тогда
		ВыводЗаПериод = Ложь;
		ОбластьШапка.Параметры.Период = Формат(ПараметрыОтчета.НачалоПериода, "ДФ='дд ММММ гггг'") + " года";
	Иначе
		ВыводЗаПериод = Истина;
		ОбластьШапка.Параметры.Период = Формат(ПараметрыОтчета.НачалоПериода, "ДФ='дд ММММ гггг'") + " года" + "-" + Формат(ПараметрыОтчета.КонецПериода, "ДФ='дд ММММ гггг'") + " года";
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СостояниеЗалоговогоБилета.НомерЗалоговогоБилета КАК НомерЗалоговогоБилета,
		|	ЛБ_СостояниеЗалоговогоБилета.Период КАК Период,
		|	ЛБ_СостояниеЗалоговогоБилета.Регистратор.Ломбард КАК РегистраторЛомбард,
		|	ЛБ_СостояниеЗалоговогоБилета.Регистратор КАК Регистратор,
		|	ЛБ_СостояниеЗалоговогоБилета.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета
		|ПОМЕСТИТЬ ВТ1
		|ИЗ
		|	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета КАК ЛБ_СостояниеЗалоговогоБилета
		|ГДЕ
		|	ЛБ_СостояниеЗалоговогоБилета.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ЛБ_СостояниеЗалоговогоБилета.Регистратор.Ломбард = &Ломбард
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ОперацияПоЗалогуТовары.Ссылка КАК Ссылка,
		|	ЛБ_ОперацияПоЗалогуТовары.НомерСтроки КАК НомерСтроки,
		|	ЛБ_ОперацияПоЗалогуТовары.СуммаОценкиМаксимальная КАК СуммаОценкиМаксимальная,
		|	ЛБ_ОперацияПоЗалогуТовары.ВидИзделия КАК ВидИзделия,
		|	ЛБ_ОперацияПоЗалогуТовары.Ссылка.СуммаОплаты КАК СуммаОплаты,
		|	ЛБ_ОперацияПоЗалогуТовары.ОбъектЗалога КАК ОбъектЗалога
		|ПОМЕСТИТЬ ВТ2
		|ИЗ
		|	Документ.ЛБ_ОперацияПоЗалогу.Товары КАК ЛБ_ОперацияПоЗалогуТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ1.НомерЗалоговогоБилета КАК НомерЗалоговогоБилета,
		|	ВТ1.Период КАК Период,
		|	ВТ1.РегистраторЛомбард КАК РегистраторЛомбард,
		|	ВТ2.НомерСтроки КАК НомерСтроки,
		|	ВТ2.СуммаОценкиМаксимальная КАК СуммаОценкиМаксимальная,
		|	ВТ2.Ссылка.Залогодатель КАК СсылкаЗалогодатель,
		|	ВТ2.ВидИзделия КАК ВидИзделия,
		|	ВТ1.Регистратор.ОтмененныйДокумент КАК РегистраторОтмененныйДокумент,
		|	ВТ1.Регистратор КАК Регистратор,
		|	ВТ1.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета,
		|	ЕСТЬNULL(ВТ2.СуммаОплаты, 0) КАК Сумма,
		|	ВТ2.ОбъектЗалога КАК ОбъектЗалога
		|ИЗ
		|	ВТ1 КАК ВТ1
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ2 КАК ВТ2
		|		ПО ВТ1.Регистратор = ВТ2.Ссылка";
	
	Запрос.УстановитьПараметр("КонецПериода", ПараметрыОтчета.КонецПериода);
	Запрос.УстановитьПараметр("Ломбард", ПараметрыОтчета.Ломбард);
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.НачалоПериода);
	
	//исключение отмененных операций
	Выборка = Запрос.Выполнить().Выгрузить();
	МассивСтрокКУдалению = Новый Массив;
	
	Для Каждого ТекущаяСтрока Из Выборка Цикл
		Если ЗначениеЗаполнено(ТекущаяСтрока.РегистраторОтмененныйДокумент) Тогда
			МассивСтрокКУдалению.Добавить(ТекущаяСтрока);
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Регистратор", ТекущаяСтрока.РегистраторОтмененныйДокумент);
			СтруктураПоиска.Вставить("Сумма", -ТекущаяСтрока.Сумма);
			ОтмененнаяОперация = Выборка.НайтиСтроки(СтруктураПоиска);
			Если ОтмененнаяОперация.Количество() > 0 Тогда
				МассивСтрокКУдалению.Добавить(ОтмененнаяОперация[0]);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Элемент Из МассивСтрокКУдалению Цикл
		Выборка.Удалить(Элемент);
	КонецЦикла;
	//
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОХ_Итог.НомерЗалоговогоБилета КАК НомерЗалоговогоБилета,
		|	ОХ_Итог.Период КАК Период,
		|	ОХ_Итог.РегистраторЛомбард КАК РегистраторЛомбард,
		|	ОХ_Итог.НомерСтроки КАК НомерСтроки,
		|	ОХ_Итог.СуммаОценкиМаксимальная КАК СуммаОценкиМаксимальная,
		|	ОХ_Итог.СсылкаЗалогодатель КАК СсылкаЗалогодатель,
		|	ОХ_Итог.ВидИзделия КАК ВидИзделия,
		|	ОХ_Итог.РегистраторОтмененныйДокумент КАК РегистраторОтмененныйДокумент,
		|	ОХ_Итог.Регистратор КАК Регистратор,
		|	ОХ_Итог.ОбъектЗалога КАК ОбъектЗалога,
		|	ОХ_Итог.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета
		|ПОМЕСТИТЬ ОХ_Итог
		|ИЗ
		|	&ОХ_Итог КАК ОХ_Итог
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОХ_Итог.НомерЗалоговогоБилета КАК НомерЗалоговогоБилета,
		|	ОХ_Итог.Период КАК Период,
		|	ОХ_Итог.РегистраторЛомбард КАК РегистраторЛомбард,
		|	ОХ_Итог.НомерСтроки КАК НомерСтроки,
		|	ОХ_Итог.СуммаОценкиМаксимальная КАК СуммаОценкиМаксимальная,
		|	ОХ_Итог.СсылкаЗалогодатель КАК СсылкаЗалогодатель,
		|	ОХ_Итог.ВидИзделия КАК ВидИзделия,
		|	ОХ_Итог.РегистраторОтмененныйДокумент КАК РегистраторОтмененныйДокумент,
		|	ОХ_Итог.Регистратор КАК Регистратор,
		|	ОХ_Итог.ОбъектЗалога КАК ОбъектЗалога
		|ИЗ
		|	ОХ_Итог КАК ОХ_Итог
		|ГДЕ
		|	ОХ_Итог.СтатусЗалоговогоБилета = &СтатусЗалоговогоБилета";
	
    Запрос.УстановитьПараметр("ОХ_Итог", Выборка);
	Запрос.УстановитьПараметр("СтатусЗалоговогоБилета", Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт);
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	НомерПП = 0;
	ИтогоСуммаОценки = 0;

	Для Каждого ТекущаяСтрока Из Выборка Цикл
		Если ПроверкаОбъектаНаОХ(ТекущаяСтрока.ОбъектЗалога, ТекущаяСтрока.Период) Тогда
		НомерПП = НомерПП + 1;
		ОбластьБилеты.Параметры.НомерПП = НомерПП;
		ОбластьБилеты.Параметры.НомерЗБ = ТекущаяСтрока.НомерЗалоговогоБилета + "-" + Строка(ТекущаяСтрока.НомерСтроки);
		ОбластьБилеты.Параметры.Залог = ТекущаяСтрока.ВидИзделия;
		ОбластьБилеты.Параметры.СуммаОценки = ТекущаяСтрока.СуммаОценкиМаксимальная;
		ИтогоСуммаОценки = ИтогоСуммаОценки + ТекущаяСтрока.СуммаОценкиМаксимальная;
		ОбластьБилеты.Параметры.ФИО = ТекущаяСтрока.СсылкаЗалогодатель;
		ТабличныйДокумент.Вывести(ОбластьБилеты);
		КонецЕсли;
	КонецЦикла;

	ОбластьИтого.Параметры.Количество = НомерПП;
	ОбластьИтого.Параметры.ИтогоСуммаОценки = ИтогоСуммаОценки;
	ТабличныйДокумент.Вывести(ОбластьИтого);	
	
	Ответственный              = ПараметрыСеанса.ТекущийСотрудник;
	
	ФИООтветственного          = СтрРазделить(Строка(Ответственный), " ");
	
	Если ФИООтветственного.Количество() > 0 Тогда
		ФамилияОтветственного  = ФИООтветственного[0]; 
		ИнициалыОтветственного = Лев(ФИООтветственного[1], 1) + "." + Лев(ФИООтветственного[2], 1) + ".";
	Иначе
		ФамилияОтветственного  = ""; 
		ИнициалыОтветственного = "";
	КонецЕсли; 
	
	ОбластьПодвал.Параметры.Ответственный = ФамилияОтветственного + " " + ИнициалыОтветственного;
	
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	ТабличныйДокумент.НижнийКолонтитул.Выводить = Истина;
	ТабличныйДокумент.НижнийКолонтитул.НачальнаяСтраница = 1;
	ТабличныйДокумент.НижнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
	ТабличныйДокумент.НижнийКолонтитул.ТекстСлева = Строка(ТекущаяДата()) + 
	" " + ФамилияОтветственного + " " + ИнициалыОтветственного;
	ТабличныйДокумент.НижнийКолонтитул.ТекстВЦентре = "Отчет о выданных предметах залога с ответственного хранения за " + ОбластьШапка.Параметры.Период;
	ТабличныйДокумент.НижнийКолонтитул.ТекстСправа = "Страница [&НомерСтраницы] из [&СтраницВсего]";
	Шрифт = Новый Шрифт("Times New Roman", 8);
	ТабличныйДокумент.НижнийКолонтитул.Шрифт = Шрифт;
	
	Возврат ТабличныйДокумент;
КонецФункции

Функция ПроверкаБилетаНаОХ(НомерЗБ, Период)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.НомерЗалоговогоБилета КАК НомерЗалоговогоБилета,
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета
		|ИЗ
		|	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&Период, НомерЗалоговогоБилета = &НомерЗБ) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних";
	
	Запрос.УстановитьПараметр("НомерЗБ", НомерЗБ);
	Запрос.УстановитьПараметр("Период", Период - 1);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если Выборка.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтвественноеХранение 
			Или Выборка.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ГотовКОтправкеОХ
			Или Выборка.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ВПутиОХ Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

Функция ПроверкаОбъектаНаОХ(ОбъектЗалога, Период)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога
		|ИЗ
		|	РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(&Период, ОбъектЗалога = &ОбъектЗалога) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних";
	
	Запрос.УстановитьПараметр("ОбъектЗалога", ОбъектЗалога);
	Запрос.УстановитьПараметр("Период", Период - 1);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если Выборка.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение 
			Или Выборка.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ГотовКОтправкеОХ
			Или Выборка.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ВПутиОХ
			Или Выборка.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ПринятНаСклад Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

//+МАН 24.02.26 Изменил запросы. Неизмененная функция ниже. Заявка 3269.
Функция ПечатьЖурналДвиженияДМ_Измененная(ПараметрыОтчета) Экспорт 
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	//ТабличныйДокумент.Защита = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЖурналДвиженияДМ";
	//+МАН 02.12.25 Добавил параметры
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	//-МАН
	Макет = ПолучитьОбщийМакет("ЛБ_ПФ_ЖурналДвиженияДМ");
	
	ОбластьШапка                  = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьШапкаОстатокНачало     = Макет.ПолучитьОбласть("ОбластьШапкаОстатокНачало");
	ОбластьОстатокНачало          = Макет.ПолучитьОбласть("ОбластьОстатокНачало");	
	ОбластьИтогоОстатокНачало     = Макет.ПолучитьОбласть("ОбластьИтогоОстатокНачало");
	ОбластьШапкаПриход            = Макет.ПолучитьОбласть("ОбластьШапкаПриход");
	ОбластьПриход                 = Макет.ПолучитьОбласть("ОбластьПриход");
	ОбластьВставкаПриход          = Макет.ПолучитьОбласть("ОбластьВставкаПриход");
	ОбластьВставкаБриллиантПриход = Макет.ПолучитьОбласть("ОбластьВставкаБриллиантПриход");
	ОбластьИтогоПриход            = Макет.ПолучитьОбласть("ОбластьИтогоПриход");
	ОбластьШапкаРасход            = Макет.ПолучитьОбласть("ОбластьШапкаРасход");
	ОбластьРасход                 = Макет.ПолучитьОбласть("ОбластьРасход");
	ОбластьВставкаРасход          = Макет.ПолучитьОбласть("ОбластьВставкаРасход");
	ОбластьВставкаБриллиантРасход = Макет.ПолучитьОбласть("ОбластьВставкаБриллиантРасход");
	ОбластьИтогоРасход            = Макет.ПолучитьОбласть("ОбластьИтогоРасход");
	ОбластьШапкаОстатокКонец      = Макет.ПолучитьОбласть("ОбластьШапкаОстатокКонец");
	ОбластьОстатокКонец           = Макет.ПолучитьОбласть("ОбластьОстатокКонец");
	ОбластьИтогоОстатокКонец      = Макет.ПолучитьОбласть("ОбластьИтогоОстатокКонец");
	ОбластьПодвал                 = Макет.ПолучитьОбласть("ОбластьПодвал");
	
	
	ОбластьШапка.Параметры.НомерЛомбарда = ПараметрыОтчета.Ломбард.НомерЛомбарда;
	
	СтруктураАдреса = фПрочитатьJSON(ПараметрыОтчета.Ломбард.КонтактнаяИнформация[0].Значение);
	ОбластьШапка.Параметры.АдресЛомбарда = СтруктураАдреса.value;
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	ОбластьШапкаОстатокНачало.Параметры.НачалоПериода = Формат(ПараметрыОтчета.НачалоПериода, "ДЛФ=DD");
	ТабличныйДокумент.Вывести(ОбластьШапкаОстатокНачало);
				
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_Объекты
		|ИЗ
		|	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(&Период, Ломбард = &Ломбард) КАК ЛБ_ОбъектыЗалогаОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_РеквизитыОбъектаЗалога.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_РеквизитыОбъектаЗалога.Проба.Владелец КАК ПробаВладелец,
		|	ЛБ_РеквизитыОбъектаЗалога.Проба.Проба КАК ПробаПроба,
		|	ЛБ_РеквизитыОбъектаЗалога.Вес КАК Вес,
		|	ЛБ_РеквизитыОбъектаЗалога.ВесЧистый КАК ВесЧистый,
		|	ЛБ_РеквизитыОбъектаЗалога.СуммаОценкиМакс КАК СуммаОценкиМакс,
		|	ЛБ_РеквизитыОбъектаЗалога.Проба КАК Проба
		|ПОМЕСТИТЬ ВТ_Характеристики
		|ИЗ
		|	ВТ_Объекты КАК ВТ_Объекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(&Период, ) КАК ЛБ_РеквизитыОбъектаЗалога
		|		ПО ВТ_Объекты.ОбъектЗалога = ЛБ_РеквизитыОбъектаЗалога.ОбъектЗалога
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Характеристики.ПробаВладелец.Наименование КАК ПробаВладелец,
		|	ВТ_Характеристики.ПробаПроба КАК ПробаПроба,
		|	СУММА(ВТ_Объекты.КоличествоОстаток) КАК КоличествоОстаток,
		|	СУММА(ВТ_Характеристики.Вес) КАК Вес,
		|	СУММА(ВТ_Характеристики.ВесЧистый) КАК МассаЛигатуры,
		|	СУММА(ВТ_Характеристики.СуммаОценкиМакс) КАК СуммаОценкиМакс,
		|	СУММА(ВТ_Характеристики.ВесЧистый * (ВТ_Характеристики.ПробаПроба / 10 / 100)) КАК МассаХим,
		|	ВТ_Объекты.ОбъектЗалога КАК ОбъектЗалога,
		|	ВТ_Характеристики.Проба КАК Проба
		|ПОМЕСТИТЬ ВТ_ИтогОбъекты
		|ИЗ
		|	ВТ_Объекты КАК ВТ_Объекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Характеристики КАК ВТ_Характеристики
		|		ПО ВТ_Объекты.ОбъектЗалога = ВТ_Характеристики.ОбъектЗалога
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Характеристики.ПробаПроба,
		|	ВТ_Объекты.ОбъектЗалога,
		|	ВТ_Характеристики.ПробаВладелец.Наименование,
		|	ВТ_Характеристики.Проба
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ВставкиОбъектаЗалога.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ВставкиОбъектаЗалога.ВидВставки КАК ВидВставки,
		|	ВЫБОР
		|		КОГДА ЛБ_ВставкиОбъектаЗалога.Вес <> 0
		|			ТОГДА ЛБ_ВставкиОбъектаЗалога.Вес
		|		ИНАЧЕ ЛБ_ВставкиОбъектаЗалога.ВесГраммы
		|	КОНЕЦ КАК Вес,
		|	ЛБ_ВставкиОбъектаЗалога.СуммаОценки КАК СуммаОценки,
		|	ЛБ_ВставкиОбъектаЗалога.Количество КАК КоличествоКамней
		|ПОМЕСТИТЬ ВТ_Вставки
		|ИЗ
		|	ВТ_Объекты КАК ВТ_Объекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(&Период, ) КАК ЛБ_ВставкиОбъектаЗалога
		|		ПО ВТ_Объекты.ОбъектЗалога = ЛБ_ВставкиОбъектаЗалога.ОбъектЗалога
		|ГДЕ
		|	ЛБ_ВставкиОбъектаЗалога.ВидВставки.ВидКамня В(&ВидКамня)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Вставки.ВидВставки КАК ВидВставки,
		|	СУММА(ВТ_Объекты.КоличествоОстаток) КАК КоличествоОстаток,
		|	СУММА(ВТ_Вставки.Вес) КАК Вес,
		|	СУММА(ВТ_Вставки.СуммаОценки) КАК СуммаОценки,
		|	ВТ_Объекты.ОбъектЗалога КАК ОбъектЗалога,
		|	СУММА(ВТ_Вставки.КоличествоКамней) КАК КоличествоКамней,
		|	ВТ_Характеристики.Проба КАК Проба
		|ПОМЕСТИТЬ ВТ_ИтогКамни
		|ИЗ
		|	ВТ_Объекты КАК ВТ_Объекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Вставки КАК ВТ_Вставки
		|		ПО ВТ_Объекты.ОбъектЗалога = ВТ_Вставки.ОбъектЗалога
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Характеристики КАК ВТ_Характеристики
		|		ПО ВТ_Объекты.ОбъектЗалога = ВТ_Характеристики.ОбъектЗалога
		|ГДЕ
		|	НЕ ВТ_Вставки.ВидВставки ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Вставки.ВидВставки,
		|	ВТ_Объекты.ОбъектЗалога,
		|	ВТ_Характеристики.Проба
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.Проба.Владелец КАК ПробаВладелец,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.Проба.Проба КАК ПробаПроба,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.ВесЧистый КАК ВесЧистый,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.СуммаОценки КАК СуммаОценки,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.Проба КАК Проба
		|ПОМЕСТИТЬ ВТ_ДопМеталлы
		|ИЗ
		|	ВТ_Объекты КАК ВТ_Объекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(&Период, ) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалога
		|		ПО ВТ_Объекты.ОбъектЗалога = ЛБ_ДополнительныеМатериалыОбъектаЗалога.ОбъектЗалога
		|ГДЕ
		|	НЕ ЛБ_ДополнительныеМатериалыОбъектаЗалога.Проба.Владелец ЕСТЬ NULL
		|	И ЛБ_ДополнительныеМатериалыОбъектаЗалога.НомерСтрокиТаблицы <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДопМеталлы.ПробаВладелец КАК ПробаВладелецМеталл,
		|	ВТ_ДопМеталлы.ПробаПроба КАК ПробаПробаМеталл,
		|	СУММА(ВТ_ДопМеталлы.ВесЧистый) КАК МассаЛигатуры,
		|	СУММА(ВТ_ДопМеталлы.ВесЧистый * (ВТ_ДопМеталлы.ПробаПроба / 10 / 100)) КАК МассаХим,
		|	ВТ_ДопМеталлы.СуммаОценки КАК СуммаОценки,
		|	ВТ_ИтогОбъекты.ПробаВладелец КАК ПробаВладелецОбъект,
		|	ВТ_ИтогОбъекты.ПробаПроба КАК ПробаПробаОбъект,
		|	ВТ_ИтогОбъекты.ОбъектЗалога КАК ОбъектЗалога,
		|	ВТ_ДопМеталлы.Проба КАК Проба
		|ПОМЕСТИТЬ ВТ_ИтогДопМеталлы
		|ИЗ
		|	ВТ_ИтогОбъекты КАК ВТ_ИтогОбъекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДопМеталлы КАК ВТ_ДопМеталлы
		|		ПО ВТ_ИтогОбъекты.ОбъектЗалога = ВТ_ДопМеталлы.ОбъектЗалога
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДопМеталлы.ПробаВладелец,
		|	ВТ_ДопМеталлы.ПробаПроба,
		|	ВТ_ДопМеталлы.СуммаОценки,
		|	ВТ_ИтогОбъекты.ПробаВладелец,
		|	ВТ_ИтогОбъекты.ПробаПроба,
		|	ВТ_ИтогОбъекты.ОбъектЗалога,
		|	ВТ_ДопМеталлы.Проба
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИтогОбъекты.ПробаВладелец КАК ПробаВладелец,
		|	ВТ_ИтогОбъекты.ПробаПроба КАК ПробаПроба,
		|	СУММА(ВТ_ИтогОбъекты.КоличествоОстаток) КАК КоличествоОстаток,
		|	СУММА(ВТ_ИтогОбъекты.Вес) КАК Вес,
		|	СУММА(ВТ_ИтогОбъекты.МассаЛигатуры) КАК МассаЛигатуры,
		|	СУММА(ВТ_ИтогОбъекты.МассаХим) КАК МассаХим,
		|	ЕСТЬNULL(ВТ_ИтогОбъекты.СуммаОценкиМакс, 0) - ЕСТЬNULL(ВТ_ИтогКамни.СуммаОценки, 0) - ЕСТЬNULL(ВТ_ИтогДопМеталлы.СуммаОценки, 0) КАК СуммаОценкиМакс,
		|	"""" КАК ВидВставки,
		|	"""" КАК ПробаВладелецМеталл,
		|	"""" КАК ПробаПробаМеталл,
		|	0 КАК КоличествоКамней,
		|	ВТ_ИтогОбъекты.Проба КАК Проба,
		|	ВТ_ИтогОбъекты.Проба.Наименование КАК ПробаНаименование
		|ПОМЕСТИТЬ ВТ_ИТОГ
		|ИЗ
		|	ВТ_ИтогОбъекты КАК ВТ_ИтогОбъекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтогКамни КАК ВТ_ИтогКамни
		|		ПО ВТ_ИтогОбъекты.ОбъектЗалога = ВТ_ИтогКамни.ОбъектЗалога
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтогДопМеталлы КАК ВТ_ИтогДопМеталлы
		|		ПО ВТ_ИтогОбъекты.ОбъектЗалога = ВТ_ИтогДопМеталлы.ОбъектЗалога
		|			И ВТ_ИтогОбъекты.ПробаВладелец <> ВТ_ИтогДопМеталлы.ПробаВладелецМеталл
		|			И ВТ_ИтогОбъекты.ПробаПроба <> ВТ_ИтогДопМеталлы.ПробаПробаМеталл
		|ГДЕ
		|	НЕ ВТ_ИтогОбъекты.ПробаВладелец ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИтогОбъекты.ПробаПроба,
		|	ВТ_ИтогОбъекты.ПробаВладелец,
		|	ВТ_ИтогКамни.СуммаОценки,
		|	ВТ_ИтогДопМеталлы.СуммаОценки,
		|	ЕСТЬNULL(ВТ_ИтогОбъекты.СуммаОценкиМакс, 0) - ЕСТЬNULL(ВТ_ИтогКамни.СуммаОценки, 0) - ЕСТЬNULL(ВТ_ИтогДопМеталлы.СуммаОценки, 0),
		|	ВТ_ИтогОбъекты.Проба,
		|	ВТ_ИтогОбъекты.Проба.Наименование
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	"""",
		|	"""",
		|	СУММА(0),
		|	СУММА(ВТ_ИтогКамни.Вес),
		|	СУММА(0),
		|	СУММА(0),
		|	ВТ_ИтогКамни.СуммаОценки,
		|	ВТ_ИтогКамни.ВидВставки,
		|	"""",
		|	"""",
		|	СУММА(ВТ_ИтогКамни.КоличествоКамней),
		|	""Камень"",
		|	""Камень""
		|ИЗ
		|	ВТ_ИтогКамни КАК ВТ_ИтогКамни
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИтогКамни.ВидВставки,
		|	ВТ_ИтогКамни.СуммаОценки
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_ИтогДопМеталлы.ПробаВладелецМеталл,
		|	ВТ_ИтогДопМеталлы.ПробаПробаМеталл,
		|	СУММА(0),
		|	СУММА(0),
		|	СУММА(ВТ_ИтогДопМеталлы.МассаЛигатуры),
		|	СУММА(ВТ_ИтогДопМеталлы.МассаХим),
		|	СУММА(ВТ_ИтогДопМеталлы.СуммаОценки),
		|	"""",
		|	ВТ_ИтогДопМеталлы.ПробаВладелецМеталл,
		|	ВТ_ИтогДопМеталлы.ПробаПробаМеталл,
		|	СУММА(0),
		|	ВТ_ИтогДопМеталлы.Проба,
		|	ВТ_ИтогДопМеталлы.Проба.Наименование
		|ИЗ
		|	ВТ_ИтогДопМеталлы КАК ВТ_ИтогДопМеталлы
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИтогДопМеталлы.Проба,
		|	ВТ_ИтогДопМеталлы.ПробаВладелецМеталл,
		|	ВТ_ИтогДопМеталлы.ПробаПробаМеталл,
		|	ВТ_ИтогДопМеталлы.Проба.Наименование,
		|	ВТ_ИтогДопМеталлы.ПробаВладелецМеталл,
		|	ВТ_ИтогДопМеталлы.ПробаПробаМеталл
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИТОГ.ПробаВладелец КАК ПробаВладелец,
		|	ВТ_ИТОГ.ПробаПроба КАК ПробаПроба,
		|	СУММА(ВТ_ИТОГ.КоличествоОстаток) КАК КоличествоОстаток,
		|	СУММА(ЕСТЬNULL(ВТ_ИТОГ.Вес, 0)) КАК Вес,
		|	СУММА(ВТ_ИТОГ.МассаЛигатуры) КАК МассаЛигатуры,
		|	СУММА(ВТ_ИТОГ.МассаХим) КАК МассаХим,
		|	СУММА(ВТ_ИТОГ.СуммаОценкиМакс) КАК СуммаОценкиМакс,
		|	ВТ_ИТОГ.ВидВставки КАК ВидВставки,
		|	ВТ_ИТОГ.ПробаВладелецМеталл КАК ПробаВладелецМеталл,
		|	ВТ_ИТОГ.ПробаПробаМеталл КАК ПробаПробаМеталл,
		|	СУММА(ВТ_ИТОГ.КоличествоКамней) КАК КоличествоКамней,
		|	ВТ_ИТОГ.Проба КАК Проба,
		|	ВТ_ИТОГ.ПробаНаименование КАК ПробаНаименование
		|ИЗ
		|	ВТ_ИТОГ КАК ВТ_ИТОГ
		|ГДЕ
		|	НЕ ВТ_ИТОГ.ПробаВладелецМеталл ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИТОГ.ПробаВладелец,
		|	ВТ_ИТОГ.ПробаПроба,
		|	ВТ_ИТОГ.ВидВставки,
		|	ВТ_ИТОГ.ПробаВладелецМеталл,
		|	ВТ_ИТОГ.ПробаПробаМеталл,
		|	ВТ_ИТОГ.Проба,
		|	ВТ_ИТОГ.ПробаНаименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидВставки,
		|	ПробаНаименование";
	
	ВидыКамней = Новый СписокЗначений;
	ВидыКамней.Добавить(Перечисления.ЛБ_ВидыКамней.Драгоценные);
	ВидыКамней.Добавить(Перечисления.ЛБ_ВидыКамней.Полудрагоценные);
	ВидыКамней.Добавить(Перечисления.ЛБ_ВидыКамней.Синтетические);
	
	Запрос.УстановитьПараметр("ВидКамня", ВидыКамней);
	Запрос.УстановитьПараметр("Ломбард", ПараметрыОтчета.Ломбард);
	Запрос.УстановитьПараметр("Период", ПараметрыОтчета.НачалоПериода);
	
	//+МАН 24.02.26 Заявка 3269
	ВыборкаПоПакетно = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	ТЗИтогОЗ = ВыборкаПоПакетно[2].Выгрузить();
	ТЗИтогКамни = ВыборкаПоПакетно[4].Выгрузить();
	ТЗИтогДопМеталлы = ВыборкаПоПакетно[6].Выгрузить();
	ТЗИтог = ВыборкаПоПакетно[8].Выгрузить();
	ТЗПроб = ТЗИтог.Скопировать(, "Проба");
	ТЗПроб.Свернуть("Проба");
	//-МАН
	
	ИтогоОстатокОбщаяМасса = 0;
	ИтогоОстатокМассаЛигатуры = 0;
	ИтогоОстатокМассаХим = 0;
	ИтогоОстатокВесДК = 0;
	ИтогоОстатокКоличество = 0;
	ИтогоОстатокСтоимость = 0;
	//+МАН 01.12.25 Добавлено количество камней
	ИтогоОстатокКоличествоКамней = 0;
	//-МАН
	
	Для каждого Стр Из ТЗПроб Цикл
		Если ТипЗнч(Стр.Проба) = Тип("СправочникСсылка.ЛБ_Пробы") Тогда
			
			ОтборНачало = Новый Структура;
			ОтборНачало.Вставить("Проба", Стр.Проба);
			
			СтрОЗ = ТЗИтогОЗ.Скопировать(ОтборНачало, "Вес, КоличествоОстаток, МассаЛигатуры, МассаХим, СуммаОценкиМакс");
			СтрК = ТЗИтогКамни.Скопировать(ОтборНачало, "СуммаОценки");
			СтрМ = ТЗИтогДопМеталлы.Скопировать(ОтборНачало, "СуммаОценки");
			
			Если СтрК.Количество() = 0 Тогда
				СуммаК = 0;
			Иначе
				СуммаК = СтрК.Итог("СуммаОценки");
			КонецЕсли;
			
			Если СтрМ.Количество() = 0 Тогда
				СуммаМ = 0;
			Иначе
				СуммаМ = СтрМ.Итог("СуммаОценки");
			КонецЕсли;
			
			ОбластьОстатокНачало.Параметры.Проба = Строка(Стр.Проба);
			ОбластьОстатокНачало.Параметры.ОбщаяМасса = СтрОЗ.Итог("Вес");
			ИтогоОстатокОбщаяМасса = ИтогоОстатокОбщаяМасса + СтрОЗ.Итог("Вес");
			ОбластьОстатокНачало.Параметры.МассаЛигатуры = СтрОЗ.Итог("МассаЛигатуры");
			ИтогоОстатокМассаЛигатуры = ИтогоОстатокМассаЛигатуры + СтрОЗ.Итог("МассаЛигатуры");
			ОбластьОстатокНачало.Параметры.МассаХим = СтрОЗ.Итог("МассаХим");
			ИтогоОстатокМассаХим = ИтогоОстатокМассаХим + СтрОЗ.Итог("МассаХим");
			ОбластьОстатокНачало.Параметры.ВесДК = "";
			ОбластьОстатокНачало.Параметры.Количество = СтрОЗ.Итог("КоличествоОстаток");
			ИтогоОстатокКоличество = ИтогоОстатокКоличество + СтрОЗ.Итог("КоличествоОстаток");
			ОбластьОстатокНачало.Параметры.Стоимость = СтрОЗ.Итог("СуммаОценкиМакс") - СуммаК - СуммаМ;
			ИтогоОстатокСтоимость = ИтогоОстатокСтоимость + (СтрОЗ.Итог("СуммаОценкиМакс") - СуммаК - СуммаМ);
			ТабличныйДокумент.Вывести(ОбластьОстатокНачало);
		Иначе
			ОтборНачало = Новый Структура;
			ОтборНачало.Вставить("Проба", Стр.Проба);
			
			СтрИтогК = ТЗИтог.Скопировать(ОтборНачало);
			
			//Если Выборка.Вес <> 0 Тогда
			Для каждого Стр Из СтрИтогК Цикл
				ОбластьОстатокНачало.Параметры.Проба = Стр.ВидВставки;
				ОбластьОстатокНачало.Параметры.ОбщаяМасса = "";
				ОбластьОстатокНачало.Параметры.МассаЛигатуры = "";
				ОбластьОстатокНачало.Параметры.МассаХим = "";
				ОбластьОстатокНачало.Параметры.ВесДК = Стр.Вес;
				ИтогоОстатокВесДК = ИтогоОстатокВесДК + Стр.Вес;
				ОбластьОстатокНачало.Параметры.Количество = Стр.КоличествоОстаток;
				ИтогоОстатокКоличество = ИтогоОстатокКоличество + Стр.КоличествоОстаток;
				ОбластьОстатокНачало.Параметры.Стоимость = Стр.СуммаОценкиМакс;
				ИтогоОстатокСтоимость = ИтогоОстатокСтоимость + Стр.СуммаОценкиМакс;
				//+МАН 01.12.25 Добавлено количество камней
				ИтогоОстатокКоличествоКамней = ИтогоОстатокКоличествоКамней + Стр.КоличествоКамней;
				ОбластьОстатокНачало.Параметры.КоличествоДК = Стр.КоличествоКамней;
				//-МАН
				ТабличныйДокумент.Вывести(ОбластьОстатокНачало);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	ОбластьИтогоОстатокНачало.Параметры.ИтогоОбщаяМасса = ИтогоОстатокОбщаяМасса;
	ОбластьИтогоОстатокНачало.Параметры.ИтогоМассаЛигатуры = ИтогоОстатокМассаЛигатуры;
	ОбластьИтогоОстатокНачало.Параметры.ИтогоМассаХим = ИтогоОстатокМассаХим;
	ОбластьИтогоОстатокНачало.Параметры.ИтогоВесДК = ИтогоОстатокВесДК;
	ОбластьИтогоОстатокНачало.Параметры.ИтогоКоличество = ИтогоОстатокКоличество;
	ОбластьИтогоОстатокНачало.Параметры.ИтогоСтоимость = ИтогоОстатокСтоимость;
	//+МАН 01.12.25 Добавлено количество камней
	ОбластьИтогоОстатокНачало.Параметры.ИтогоКоличествоДК = ИтогоОстатокКоличествоКамней;
	//-МАН
	ТабличныйДокумент.Вывести(ОбластьИтогоОстатокНачало);
	
	//Приход	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОбъектыЗалогаОбороты.ОбъектЗалога КАК ОбъектЗалога,
		|	СУММА(ЛБ_ОбъектыЗалогаОбороты.КоличествоПриход) КАК КоличествоПриход,
		|	ЛБ_ОбъектыЗалогаОбороты.ЗалоговыйБилет КАК ЗалоговыйБилет
		|ПОМЕСТИТЬ ВТ_Объекты
		|ИЗ
		|	РегистрНакопления.ЛБ_ОбъектыЗалога.Обороты(&НачалоПериода, &КонецПериода, , Ломбард = &Ломбард) КАК ЛБ_ОбъектыЗалогаОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛБ_ОбъектыЗалогаОбороты.ОбъектЗалога,
		|	ЛБ_ОбъектыЗалогаОбороты.ЗалоговыйБилет
		|
		|ИМЕЮЩИЕ
		|	СУММА(ЛБ_ОбъектыЗалогаОбороты.КоличествоПриход) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_РеквизитыОбъектаЗалога.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_РеквизитыОбъектаЗалога.Проба.Владелец КАК ПробаВладелец,
		|	ЛБ_РеквизитыОбъектаЗалога.Проба.Проба КАК ПробаПроба,
		|	ЛБ_РеквизитыОбъектаЗалога.Вес КАК Вес,
		|	ЛБ_РеквизитыОбъектаЗалога.ВесЧистый КАК ВесЧистый,
		|	ЛБ_РеквизитыОбъектаЗалога.СуммаОценкиМакс КАК СуммаОценкиМакс,
		|	ЛБ_РеквизитыОбъектаЗалога.Артикул КАК Артикул,
		|	ЛБ_РеквизитыОбъектаЗалога.ЗалоговыйБилет.НомерЗалоговогоБилета КАК ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ЛБ_РеквизитыОбъектаЗалога.ЗалоговыйБилет КАК ЗалоговыйБилет,
		|	ЛБ_РеквизитыОбъектаЗалога.Проба КАК Проба
		|ПОМЕСТИТЬ ВТ_Характеристики
		|ИЗ
		|	ВТ_Объекты КАК ВТ_Объекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(&КонецПериода, ) КАК ЛБ_РеквизитыОбъектаЗалога
		|		ПО ВТ_Объекты.ОбъектЗалога = ЛБ_РеквизитыОбъектаЗалога.ОбъектЗалога
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Характеристики.ПробаВладелец.Наименование КАК ПробаВладелец,
		|	ВТ_Характеристики.ПробаПроба КАК ПробаПроба,
		|	СУММА(ВТ_Объекты.КоличествоПриход) КАК КоличествоПриход,
		|	СУММА(ВТ_Характеристики.Вес) КАК Вес,
		|	СУММА(ВТ_Характеристики.ВесЧистый) КАК МассаЛигатуры,
		|	СУММА(ВТ_Характеристики.СуммаОценкиМакс) КАК СуммаОценкиМакс,
		|	СУММА(ВТ_Характеристики.ВесЧистый * (ВТ_Характеристики.ПробаПроба / 10 / 100)) КАК МассаХим,
		|	ВТ_Объекты.ОбъектЗалога КАК ОбъектЗалога,
		|	ВТ_Характеристики.Артикул КАК Артикул,
		|	ВТ_Характеристики.ЗалоговыйБилетНомерЗалоговогоБилета КАК ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_Объекты.ЗалоговыйБилет КАК ЗалоговыйБилет,
		|	ВТ_Характеристики.Проба КАК Проба
		|ПОМЕСТИТЬ ВТ_ИтогОбъекты
		|ИЗ
		|	ВТ_Объекты КАК ВТ_Объекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Характеристики КАК ВТ_Характеристики
		|		ПО ВТ_Объекты.ОбъектЗалога = ВТ_Характеристики.ОбъектЗалога
		|			И ВТ_Объекты.ЗалоговыйБилет = ВТ_Характеристики.ЗалоговыйБилет
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Характеристики.ПробаПроба,
		|	ВТ_Объекты.ОбъектЗалога,
		|	ВТ_Характеристики.Артикул,
		|	ВТ_Характеристики.ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_Объекты.ЗалоговыйБилет,
		|	ВТ_Характеристики.ПробаВладелец.Наименование,
		|	ВТ_Характеристики.Проба
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ВставкиОбъектаЗалога.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ВставкиОбъектаЗалога.ВидВставки КАК ВидВставки,
		|	ВЫБОР
		|		КОГДА ЛБ_ВставкиОбъектаЗалога.Вес <> 0
		|			ТОГДА ЛБ_ВставкиОбъектаЗалога.Вес
		|		ИНАЧЕ ЛБ_ВставкиОбъектаЗалога.ВесГраммы
		|	КОНЕЦ КАК Вес,
		|	ЛБ_ВставкиОбъектаЗалога.СуммаОценки КАК СуммаОценки,
		|	ЛБ_ВставкиОбъектаЗалога.ЗалоговыйБилет.НомерЗалоговогоБилета КАК ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ЛБ_ВставкиОбъектаЗалога.ЗалоговыйБилет КАК ЗалоговыйБилет,
		|	ЛБ_ВставкиОбъектаЗалога.Количество КАК КоличествоКамней
		|ПОМЕСТИТЬ ВТ_Вставки
		|ИЗ
		|	ВТ_Объекты КАК ВТ_Объекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(&КонецПериода, ) КАК ЛБ_ВставкиОбъектаЗалога
		|		ПО ВТ_Объекты.ОбъектЗалога = ЛБ_ВставкиОбъектаЗалога.ОбъектЗалога
		|ГДЕ
		|	ЛБ_ВставкиОбъектаЗалога.ВидВставки.ВидКамня В(&ВидКамня)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Вставки.ВидВставки КАК ВидВставки,
		|	СУММА(ВТ_Объекты.КоличествоПриход) КАК КоличествоПриход,
		|	СУММА(ВТ_Вставки.Вес) КАК Вес,
		|	СУММА(ВТ_Вставки.СуммаОценки) КАК СуммаОценки,
		|	ВТ_Вставки.ЗалоговыйБилетНомерЗалоговогоБилета КАК ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_Объекты.ОбъектЗалога КАК ОбъектЗалога,
		|	ВТ_Объекты.ЗалоговыйБилет КАК ЗалоговыйБилет,
		|	СУММА(ВТ_Вставки.КоличествоКамней) КАК КоличествоКамней
		|ПОМЕСТИТЬ ВТ_ИтогКамни
		|ИЗ
		|	ВТ_Объекты КАК ВТ_Объекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Вставки КАК ВТ_Вставки
		|		ПО ВТ_Объекты.ОбъектЗалога = ВТ_Вставки.ОбъектЗалога
		|			И ВТ_Объекты.ЗалоговыйБилет = ВТ_Вставки.ЗалоговыйБилет
		|ГДЕ
		|	НЕ ВТ_Вставки.ВидВставки ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Вставки.ВидВставки,
		|	ВТ_Вставки.ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_Объекты.ОбъектЗалога,
		|	ВТ_Объекты.ЗалоговыйБилет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.Проба.Владелец.Наименование КАК ПробаВладелец,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.Проба.Проба КАК ПробаПроба,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.ВесЧистый КАК ВесЧистый,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.СуммаОценки КАК СуммаОценки,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.ЗалоговыйБилет.НомерЗалоговогоБилета КАК ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.ЗалоговыйБилет КАК ЗалоговыйБилет
		|ПОМЕСТИТЬ ВТ_ДопМеталлы
		|ИЗ
		|	ВТ_Объекты КАК ВТ_Объекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(&КонецПериода, ) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалога
		|		ПО ВТ_Объекты.ОбъектЗалога = ЛБ_ДополнительныеМатериалыОбъектаЗалога.ОбъектЗалога
		|ГДЕ
		|	НЕ ЛБ_ДополнительныеМатериалыОбъектаЗалога.Проба.Владелец ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДопМеталлы.ПробаВладелец КАК ПробаВладелецМеталл,
		|	ВТ_ДопМеталлы.ПробаПроба КАК ПробаПробаМеталл,
		|	СУММА(ВТ_ДопМеталлы.ВесЧистый) КАК МассаЛигатуры,
		|	СУММА(ВТ_ДопМеталлы.ВесЧистый * (ВТ_ДопМеталлы.ПробаПроба / 10 / 100)) КАК МассаХим,
		|	СУММА(ВТ_ДопМеталлы.СуммаОценки) КАК СуммаОценки,
		|	ВТ_ДопМеталлы.ЗалоговыйБилетНомерЗалоговогоБилета КАК ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_ИтогОбъекты.ОбъектЗалога КАК ОбъектЗалога,
		|	ВТ_ИтогОбъекты.ПробаВладелец КАК ПробаВладелецОбъект,
		|	ВТ_ИтогОбъекты.ПробаПроба КАК ПробаПробаОбъект,
		|	ВТ_ИтогОбъекты.ЗалоговыйБилет КАК ЗалоговыйБилет,
		|	ВТ_ИтогОбъекты.Проба КАК Проба
		|ПОМЕСТИТЬ ВТ_ИтогДопМеталлы
		|ИЗ
		|	ВТ_ИтогОбъекты КАК ВТ_ИтогОбъекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДопМеталлы КАК ВТ_ДопМеталлы
		|		ПО ВТ_ИтогОбъекты.ОбъектЗалога = ВТ_ДопМеталлы.ОбъектЗалога
		|			И ВТ_ИтогОбъекты.ЗалоговыйБилет = ВТ_ДопМеталлы.ЗалоговыйБилет
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДопМеталлы.ПробаВладелец,
		|	ВТ_ДопМеталлы.ПробаПроба,
		|	ВТ_ДопМеталлы.ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_ИтогОбъекты.ОбъектЗалога,
		|	ВТ_ИтогОбъекты.ПробаВладелец,
		|	ВТ_ИтогОбъекты.ПробаПроба,
		|	ВТ_ИтогОбъекты.ЗалоговыйБилет,
		|	ВТ_ИтогОбъекты.Проба
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИтогОбъекты.Артикул КАК Артикул,
		|	ВТ_ИтогОбъекты.ПробаВладелец КАК ПробаВладелец,
		|	ВТ_ИтогОбъекты.ПробаПроба КАК ПробаПроба,
		|	СУММА(ВТ_ИтогОбъекты.КоличествоПриход) КАК КоличествоПриход,
		|	СУММА(ВТ_ИтогОбъекты.Вес) КАК Вес,
		|	СУММА(ВТ_ИтогОбъекты.МассаЛигатуры) КАК МассаЛигатуры,
		|	СУММА(ВТ_ИтогОбъекты.МассаХим) КАК МассаХим,
		|	СУММА(ВТ_ИтогОбъекты.СуммаОценкиМакс) КАК СуммаОценкиМакс,
		|	"""" КАК ВидВставки,
		|	ВТ_ИтогОбъекты.ЗалоговыйБилетНомерЗалоговогоБилета КАК ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_ИтогОбъекты.ОбъектЗалога КАК ОбъектЗалога,
		|	"""" КАК ПробаВладелецМеталл,
		|	"""" КАК ПробаПробаМеталл,
		|	СУММА(0) КАК КоличествоКамней,
		|	ВТ_ИтогОбъекты.Проба КАК Проба
		|ИЗ
		|	ВТ_ИтогОбъекты КАК ВТ_ИтогОбъекты
		|ГДЕ
		|	НЕ ВТ_ИтогОбъекты.ПробаВладелец ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИтогОбъекты.ПробаПроба,
		|	ВТ_ИтогОбъекты.ПробаВладелец,
		|	ВТ_ИтогОбъекты.Артикул,
		|	ВТ_ИтогОбъекты.ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_ИтогОбъекты.ОбъектЗалога,
		|	ВТ_ИтогОбъекты.Проба
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	""Вставка"",
		|	"""",
		|	"""",
		|	СУММА(0),
		|	СУММА(ВТ_ИтогКамни.Вес),
		|	СУММА(0),
		|	СУММА(0),
		|	ВТ_ИтогКамни.СуммаОценки,
		|	ВТ_ИтогКамни.ВидВставки,
		|	ВТ_ИтогКамни.ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_ИтогКамни.ОбъектЗалога,
		|	"""",
		|	"""",
		|	СУММА(ВТ_ИтогКамни.КоличествоКамней),
		|	ЗНАЧЕНИЕ(Справочник.ЛБ_Пробы.ПустаяСсылка)
		|ИЗ
		|	ВТ_ИтогКамни КАК ВТ_ИтогКамни
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИтогКамни.ВидВставки,
		|	ВТ_ИтогКамни.СуммаОценки,
		|	ВТ_ИтогКамни.ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_ИтогКамни.ОбъектЗалога
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	""Вставка"",
		|	ВТ_ИтогДопМеталлы.ПробаВладелецОбъект,
		|	ВТ_ИтогДопМеталлы.ПробаПробаОбъект,
		|	СУММА(0),
		|	СУММА(0),
		|	СУММА(ВТ_ИтогДопМеталлы.МассаЛигатуры),
		|	СУММА(ВТ_ИтогДопМеталлы.МассаХим),
		|	СУММА(ВТ_ИтогДопМеталлы.СуммаОценки),
		|	"""",
		|	ВТ_ИтогДопМеталлы.ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_ИтогДопМеталлы.ОбъектЗалога,
		|	ВТ_ИтогДопМеталлы.ПробаВладелецМеталл,
		|	ВТ_ИтогДопМеталлы.ПробаПробаМеталл,
		|	СУММА(0),
		|	ВТ_ИтогДопМеталлы.Проба
		|ИЗ
		|	ВТ_ИтогДопМеталлы КАК ВТ_ИтогДопМеталлы
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИтогДопМеталлы.ОбъектЗалога,
		|	ВТ_ИтогДопМеталлы.ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_ИтогДопМеталлы.ПробаВладелецОбъект,
		|	ВТ_ИтогДопМеталлы.ПробаПробаОбъект,
		|	ВТ_ИтогДопМеталлы.ПробаВладелецМеталл,
		|	ВТ_ИтогДопМеталлы.ПробаПробаМеталл,
		|	ВТ_ИтогДопМеталлы.Проба
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ОбъектЗалога,
		|	ВидВставки,
		|	Артикул";
	
	Запрос.УстановитьПараметр("ВидКамня", ВидыКамней);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("Ломбард", ПараметрыОтчета.Ломбард);
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.НачалоПериода);
	
	//+МАН 24.02.26 Заявка 3269
	ВыборкаПоПакетно = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	ТЗИтогКамни = ВыборкаПоПакетно[4].Выгрузить();
	ТЗИтогДопМеталлы = ВыборкаПоПакетно[6].Выгрузить();
	//-МАН
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ИтогоПриходОбщаяМасса = 0;
	ИтогоПриходМассаЛигатуры = 0;
	ИтогоПриходМассаХим = 0;
	ИтогоПриходВесДК = 0;
	ИтогоПриходКоличество = 0;
	ИтогоПриходСтоимость = 0;
	НомерПП = 1;
	ШапкаПриход = Ложь;
	//+МАН 01.12.25 Добавлено количество камней
	ИтогоПриходКоличествоКамней = 0;
	//-МАН
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ШапкаПриход Тогда 
			Если НачалоДня(ПараметрыОтчета.НачалоПериода) = НачалоДня(ПараметрыОтчета.КонецПериода) Тогда
				ОбластьШапкаПриход.Параметры.Период = Формат(ПараметрыОтчета.НачалоПериода, "ДЛФ=DD");
			Иначе
				ОбластьШапкаПриход.Параметры.Период = Формат(ПараметрыОтчета.НачалоПериода, "ДЛФ=DD") + "-" + Формат(ПараметрыОтчета.КонецПериода, "ДЛФ=DD");
			КонецЕсли;
			ТабличныйДокумент.Вывести(ОбластьШапкаПриход);
			ШапкаПриход = Истина;
		КонецЕсли;
		
		Если Выборка.Артикул = "Вставка" И ЗначениеЗаполнено(Выборка.ВидВставки) Тогда
			ОбластьВставкаБриллиантПриход.Параметры.Проба = Выборка.ВидВставки;
			ОбластьВставкаБриллиантПриход.Параметры.ВесДК = Выборка.Вес;
			ИтогоПриходВесДК = ИтогоПриходВесДК + Выборка.Вес;
			ОбластьВставкаБриллиантПриход.Параметры.Количество = Выборка.КоличествоПриход;
			ИтогоПриходКоличество = ИтогоПриходКоличество + Выборка.КоличествоПриход;
			ОбластьВставкаБриллиантПриход.Параметры.Стоимость = Выборка.СуммаОценкиМакс;
			ИтогоПриходСтоимость = ИтогоПриходСтоимость + Выборка.СуммаОценкиМакс;
			//+МАН 01.12.25 Добавлено количество камней
			ИтогоПриходКоличествоКамней = ИтогоПриходКоличествоКамней + Выборка.КоличествоКамней;
			ОбластьВставкаБриллиантПриход.Параметры.КоличествоДК = Выборка.КоличествоКамней;
			//-МАН
			ТабличныйДокумент.Вывести(ОбластьВставкаБриллиантПриход);
		ИначеЕсли Выборка.Артикул = "Вставка" И Не ЗначениеЗаполнено(Выборка.ВидВставки) Тогда
			ПробаОбъект = Строка(Выборка.ПробаВладелец) + Строка(Выборка.ПробаПроба);
			ПробаМеталл = Строка(Выборка.ПробаВладелецМеталл) + Строка(Выборка.ПробаПробаМеталл);
			Если ПробаОбъект <> ПробаМеталл Тогда
			ОбластьВставкаПриход.Параметры.Проба = Строка(Выборка.ПробаВладелецМеталл) + " " + Строка(Выборка.ПробаПробаМеталл);
			ОбластьВставкаПриход.Параметры.МассаЛигатуры = Выборка.МассаЛигатуры;
			ИтогоПриходМассаЛигатуры = ИтогоПриходМассаЛигатуры + Выборка.МассаЛигатуры;
			ОбластьВставкаПриход.Параметры.МассаХим = Выборка.МассаХим;
			ИтогоПриходМассаХим = ИтогоПриходМассаХим + Выборка.МассаХим;
			ОбластьВставкаПриход.Параметры.ВесДК = "";
			ОбластьВставкаПриход.Параметры.Стоимость = Выборка.СуммаОценкиМакс;
			ИтогоПриходСтоимость = ИтогоПриходСтоимость + Выборка.СуммаОценкиМакс;
			//+МАН 01.12.25 Добавлено количество камней
			ОбластьВставкаПриход.Параметры.КоличествоДК = "";
			//-МАН
			ТабличныйДокумент.Вывести(ОбластьВставкаПриход);
			КонецЕсли;
		Иначе
			
		//+МАН 24.02.26 Заявка 3269
		Отбор = Новый Структура;
		Отбор.Вставить("ОбъектЗалога", Выборка.ОбъектЗалога);
		
		ТЗСтрокК = ТЗИтогКамни.Скопировать(Отбор, "СуммаОценки");
		ТЗСтрокМ = ТЗИтогДопМеталлы.Скопировать(Отбор);
		
		СуммаДопМ = 0;
		Для каждого Стр Из ТЗСтрокМ Цикл
			Если Выборка.Проба <> Стр.Проба Тогда
				СуммаДопМ = СуммаДопМ + Стр.СуммаОценки;
			КонецЕсли;
		КонецЦикла;
		
		ИтогоСумма = Выборка.СуммаОценкиМакс - ТЗСтрокК.Итог("СуммаОценки") - СуммаДопМ;
		//-МАН
			
		ОбластьПриход.Параметры.НомерПП = НомерПП;
		НомерПП = НомерПП + 1;
		ОбластьПриход.Параметры.Наименование = Выборка.ОбъектЗалога;
		ОбластьПриход.Параметры.НомерЗБ = Выборка.Артикул;
		ОбластьПриход.Параметры.Проба = Строка(Выборка.ПробаВладелец) + " " + Строка(Выборка.ПробаПроба);
		ОбластьПриход.Параметры.ОбщаяМасса = Выборка.Вес * Выборка.КоличествоПриход;
		ИтогоПриходОбщаяМасса = ИтогоПриходОбщаяМасса + (Выборка.Вес * Выборка.КоличествоПриход);
		ОбластьПриход.Параметры.МассаЛигатуры = Выборка.МассаЛигатуры * Выборка.КоличествоПриход;
		ИтогоПриходМассаЛигатуры = ИтогоПриходМассаЛигатуры + (Выборка.МассаЛигатуры * Выборка.КоличествоПриход);
		ОбластьПриход.Параметры.МассаХим = Выборка.МассаХим * Выборка.КоличествоПриход;
		ИтогоПриходМассаХим = ИтогоПриходМассаХим + (Выборка.МассаХим * Выборка.КоличествоПриход);
		ОбластьПриход.Параметры.ВесДК = "";
		ОбластьПриход.Параметры.Количество = Выборка.КоличествоПриход;
		ИтогоПриходКоличество = ИтогоПриходКоличество + Выборка.КоличествоПриход;
		//+МАН 24.02.26
		//ОбластьПриход.Параметры.Стоимость = Выборка.СуммаОценкиМакс * Выборка.КоличествоПриход;
		//ИтогоПриходСтоимость = ИтогоПриходСтоимость + (Выборка.СуммаОценкиМакс * Выборка.КоличествоПриход);
		ОбластьПриход.Параметры.Стоимость = ИтогоСумма * Выборка.КоличествоПриход;
		ИтогоПриходСтоимость = ИтогоПриходСтоимость + (ИтогоСумма * Выборка.КоличествоПриход);
		//-МАН
		//+МАН 01.12.25 Добавлено количество камней
		ОбластьПриход.Параметры.КоличествоДК = "";
		//-МАН
		ТабличныйДокумент.Вывести(ОбластьПриход);
		КонецЕсли;
	
	КонецЦикла;
	
	Если ИтогоПриходКоличество > 0 Тогда	
		Если НачалоДня(ПараметрыОтчета.НачалоПериода) = НачалоДня(ПараметрыОтчета.КонецПериода) Тогда
			ОбластьИтогоПриход.Параметры.Период = Формат(ПараметрыОтчета.НачалоПериода, "ДЛФ=DD");
		Иначе
			ОбластьИтогоПриход.Параметры.Период = Формат(ПараметрыОтчета.НачалоПериода, "ДЛФ=DD") + "-" + Формат(ПараметрыОтчета.КонецПериода, "ДЛФ=DD");
		КонецЕсли;
		ОбластьИтогоПриход.Параметры.ИтогоОбщаяМасса = ИтогоПриходОбщаяМасса;
		ОбластьИтогоПриход.Параметры.ИтогоМассаЛигатуры = ИтогоПриходМассаЛигатуры;
		ОбластьИтогоПриход.Параметры.ИтогоМассаХим = ИтогоПриходМассаХим;
		ОбластьИтогоПриход.Параметры.ИтогоВесДК = ИтогоПриходВесДК;
		ОбластьИтогоПриход.Параметры.ИтогоКоличество = ИтогоПриходКоличество;
		ОбластьИтогоПриход.Параметры.ИтогоСтоимость = ИтогоПриходСтоимость;
		//+МАН 01.12.25 Добавлено количество камней
		ОбластьИтогоПриход.Параметры.ИтогоКоличествоДК = ИтогоПриходКоличествоКамней;
		//-МАН
		ТабличныйДокумент.Вывести(ОбластьИтогоПриход);
	КонецЕсли;
	
	//Расход
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОбъектыЗалогаОбороты.ОбъектЗалога.Код КАК ОбъектЗалогаКод,
		|	ЛБ_ОбъектыЗалогаОбороты.ОбъектЗалога КАК ОбъектЗалога,
		|	СУММА(ЛБ_ОбъектыЗалогаОбороты.КоличествоРасход) КАК КоличествоРасход,
		|	ЛБ_ОбъектыЗалогаОбороты.ЗалоговыйБилет КАК ЗалоговыйБилет,
		|	ЛБ_ОбъектыЗалогаОбороты.Регистратор.НакладнаяНаОтгрузку.ПредставлениеНомераНакладной КАК РегистраторНакладнаяНаОтгрузкуНомер
		|ПОМЕСТИТЬ ВТ_Объекты
		|ИЗ
		|	РегистрНакопления.ЛБ_ОбъектыЗалога.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Ломбард = &Ломбард) КАК ЛБ_ОбъектыЗалогаОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки КАК ЛБ_ОбъектыЗалогаОстатки
		|		ПО ЛБ_ОбъектыЗалогаОбороты.ОбъектЗалога = ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток ЕСТЬ NULL
		|				ТОГДА ИСТИНА
		|			КОГДА ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток = 0
		|				ТОГДА ИСТИНА
		|		КОНЕЦ
		|	И ЛБ_ОбъектыЗалогаОбороты.КоличествоРасход > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛБ_ОбъектыЗалогаОбороты.ЗалоговыйБилет,
		|	ЛБ_ОбъектыЗалогаОбороты.Регистратор.НакладнаяНаОтгрузку.ПредставлениеНомераНакладной,
		|	ЛБ_ОбъектыЗалогаОбороты.ОбъектЗалога,
		|	ЛБ_ОбъектыЗалогаОбороты.ОбъектЗалога.Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_РеквизитыОбъектаЗалога.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_РеквизитыОбъектаЗалога.Проба.Владелец КАК ПробаВладелец,
		|	ЛБ_РеквизитыОбъектаЗалога.Проба.Проба КАК ПробаПроба,
		|	ЛБ_РеквизитыОбъектаЗалога.Вес КАК Вес,
		|	ЛБ_РеквизитыОбъектаЗалога.ВесЧистый КАК ВесЧистый,
		|	ЛБ_РеквизитыОбъектаЗалога.СуммаОценкиМакс КАК СуммаОценкиМакс,
		|	ЛБ_РеквизитыОбъектаЗалога.Артикул КАК Артикул,
		|	ЛБ_РеквизитыОбъектаЗалога.ЗалоговыйБилет.НомерЗалоговогоБилета КАК ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ЛБ_РеквизитыОбъектаЗалога.ЗалоговыйБилет КАК ЗалоговыйБилет,
		|	ЛБ_РеквизитыОбъектаЗалога.Проба КАК Проба
		|ПОМЕСТИТЬ ВТ_Характеристики
		|ИЗ
		|	ВТ_Объекты КАК ВТ_Объекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(&КонецПериода, ) КАК ЛБ_РеквизитыОбъектаЗалога
		|		ПО ВТ_Объекты.ОбъектЗалога = ЛБ_РеквизитыОбъектаЗалога.ОбъектЗалога
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Характеристики.ПробаВладелец.Наименование КАК ПробаВладелец,
		|	ВТ_Характеристики.ПробаПроба КАК ПробаПроба,
		|	СУММА(ВТ_Объекты.КоличествоРасход) КАК КоличествоРасход,
		|	СУММА(ВТ_Характеристики.Вес) КАК Вес,
		|	СУММА(ВТ_Характеристики.ВесЧистый) КАК МассаЛигатуры,
		|	СУММА(ВТ_Характеристики.СуммаОценкиМакс) КАК СуммаОценкиМакс,
		|	СУММА(ВТ_Характеристики.ВесЧистый * (ВТ_Характеристики.ПробаПроба / 10 / 100)) КАК МассаХим,
		|	ВТ_Объекты.ОбъектЗалога КАК ОбъектЗалога,
		|	ВТ_Характеристики.Артикул КАК Артикул,
		|	ВТ_Характеристики.ЗалоговыйБилетНомерЗалоговогоБилета КАК ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_Объекты.ЗалоговыйБилет КАК ЗалоговыйБилет,
		|	ВТ_Объекты.РегистраторНакладнаяНаОтгрузкуНомер КАК РегистраторНакладнаяНаОтгрузкуНомер,
		|	ВТ_Характеристики.Проба КАК Проба
		|ПОМЕСТИТЬ ВТ_ИтогОбъекты
		|ИЗ
		|	ВТ_Объекты КАК ВТ_Объекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Характеристики КАК ВТ_Характеристики
		|		ПО ВТ_Объекты.ОбъектЗалога = ВТ_Характеристики.ОбъектЗалога
		|			И ВТ_Объекты.ЗалоговыйБилет = ВТ_Характеристики.ЗалоговыйБилет
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Характеристики.ПробаПроба,
		|	ВТ_Объекты.ОбъектЗалога,
		|	ВТ_Характеристики.Артикул,
		|	ВТ_Характеристики.ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_Объекты.ЗалоговыйБилет,
		|	ВТ_Объекты.РегистраторНакладнаяНаОтгрузкуНомер,
		|	ВТ_Характеристики.ПробаВладелец.Наименование,
		|	ВТ_Характеристики.Проба
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ВставкиОбъектаЗалога.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ВставкиОбъектаЗалога.ВидВставки КАК ВидВставки,
		|	ВЫБОР
		|		КОГДА ЛБ_ВставкиОбъектаЗалога.Вес <> 0
		|			ТОГДА ЛБ_ВставкиОбъектаЗалога.Вес
		|		ИНАЧЕ ЛБ_ВставкиОбъектаЗалога.ВесГраммы
		|	КОНЕЦ КАК Вес,
		|	ЛБ_ВставкиОбъектаЗалога.СуммаОценки КАК СуммаОценки,
		|	ЛБ_ВставкиОбъектаЗалога.ЗалоговыйБилет.НомерЗалоговогоБилета КАК ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ЛБ_ВставкиОбъектаЗалога.ЗалоговыйБилет КАК ЗалоговыйБилет,
		|	ЛБ_ВставкиОбъектаЗалога.Количество КАК КоличествоКамней
		|ПОМЕСТИТЬ ВТ_Вставки
		|ИЗ
		|	ВТ_Объекты КАК ВТ_Объекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(&КонецПериода, ) КАК ЛБ_ВставкиОбъектаЗалога
		|		ПО ВТ_Объекты.ОбъектЗалога = ЛБ_ВставкиОбъектаЗалога.ОбъектЗалога
		|ГДЕ
		|	ЛБ_ВставкиОбъектаЗалога.ВидВставки.ВидКамня В(&ВидКамня)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Вставки.ВидВставки КАК ВидВставки,
		|	СУММА(ВТ_Объекты.КоличествоРасход) КАК КоличествоРасход,
		|	СУММА(ВТ_Вставки.Вес) КАК Вес,
		|	СУММА(ВТ_Вставки.СуммаОценки) КАК СуммаОценки,
		|	ВТ_Вставки.ЗалоговыйБилетНомерЗалоговогоБилета КАК ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_Объекты.ОбъектЗалога КАК ОбъектЗалога,
		|	ВТ_Объекты.ЗалоговыйБилет КАК ЗалоговыйБилет,
		|	СУММА(ВТ_Вставки.КоличествоКамней) КАК КоличествоКамней
		|ПОМЕСТИТЬ ВТ_ИтогКамни
		|ИЗ
		|	ВТ_Объекты КАК ВТ_Объекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Вставки КАК ВТ_Вставки
		|		ПО ВТ_Объекты.ОбъектЗалога = ВТ_Вставки.ОбъектЗалога
		|			И ВТ_Объекты.ЗалоговыйБилет = ВТ_Вставки.ЗалоговыйБилет
		|ГДЕ
		|	НЕ ВТ_Вставки.ВидВставки ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Вставки.ВидВставки,
		|	ВТ_Вставки.ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_Объекты.ОбъектЗалога,
		|	ВТ_Объекты.ЗалоговыйБилет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.Проба.Владелец.Наименование КАК ПробаВладелец,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.Проба.Проба КАК ПробаПроба,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.ВесЧистый КАК ВесЧистый,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.СуммаОценки КАК СуммаОценки,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.ЗалоговыйБилет.НомерЗалоговогоБилета КАК ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.ЗалоговыйБилет КАК ЗалоговыйБилет
		|ПОМЕСТИТЬ ВТ_ДопМеталлы
		|ИЗ
		|	ВТ_Объекты КАК ВТ_Объекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(&КонецПериода, ) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалога
		|		ПО ВТ_Объекты.ОбъектЗалога = ЛБ_ДополнительныеМатериалыОбъектаЗалога.ОбъектЗалога
		|ГДЕ
		|	НЕ ЛБ_ДополнительныеМатериалыОбъектаЗалога.Проба.Владелец ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДопМеталлы.ПробаВладелец КАК ПробаВладелецМеталл,
		|	ВТ_ДопМеталлы.ПробаПроба КАК ПробаПробаМеталл,
		|	СУММА(ВТ_ДопМеталлы.ВесЧистый) КАК МассаЛигатуры,
		|	СУММА(ВТ_ДопМеталлы.ВесЧистый * (ВТ_ДопМеталлы.ПробаПроба / 10 / 100)) КАК МассаХим,
		|	СУММА(ВТ_ДопМеталлы.СуммаОценки) КАК СуммаОценки,
		|	ВТ_ДопМеталлы.ЗалоговыйБилетНомерЗалоговогоБилета КАК ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_ИтогОбъекты.ОбъектЗалога КАК ОбъектЗалога,
		|	ВТ_ИтогОбъекты.РегистраторНакладнаяНаОтгрузкуНомер КАК РегистраторНакладнаяНаОтгрузкуНомер,
		|	ВТ_ИтогОбъекты.ПробаВладелец КАК ПробаВладелецОбъект,
		|	ВТ_ИтогОбъекты.ПробаПроба КАК ПробаПробаОбъект,
		|	ВТ_ИтогОбъекты.ЗалоговыйБилет КАК ЗалоговыйБилет,
		|	ВТ_ИтогОбъекты.Проба КАК Проба
		|ПОМЕСТИТЬ ВТ_ИтогДопМеталлы
		|ИЗ
		|	ВТ_ИтогОбъекты КАК ВТ_ИтогОбъекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДопМеталлы КАК ВТ_ДопМеталлы
		|		ПО ВТ_ИтогОбъекты.ОбъектЗалога = ВТ_ДопМеталлы.ОбъектЗалога
		|			И ВТ_ИтогОбъекты.ЗалоговыйБилет = ВТ_ДопМеталлы.ЗалоговыйБилет
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДопМеталлы.ПробаВладелец,
		|	ВТ_ДопМеталлы.ПробаПроба,
		|	ВТ_ДопМеталлы.ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_ИтогОбъекты.ОбъектЗалога,
		|	ВТ_ИтогОбъекты.РегистраторНакладнаяНаОтгрузкуНомер,
		|	ВТ_ИтогОбъекты.ПробаВладелец,
		|	ВТ_ИтогОбъекты.ПробаПроба,
		|	ВТ_ИтогОбъекты.ЗалоговыйБилет,
		|	ВТ_ИтогОбъекты.Проба
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИтогОбъекты.Артикул КАК Артикул,
		|	ВТ_ИтогОбъекты.ПробаВладелец КАК ПробаВладелец,
		|	ВТ_ИтогОбъекты.ПробаПроба КАК ПробаПроба,
		|	СУММА(ВТ_ИтогОбъекты.КоличествоРасход) КАК КоличествоРасход,
		|	СУММА(ВТ_ИтогОбъекты.Вес) КАК Вес,
		|	СУММА(ВТ_ИтогОбъекты.МассаЛигатуры) КАК МассаЛигатуры,
		|	СУММА(ВТ_ИтогОбъекты.МассаХим) КАК МассаХим,
		|	СУММА(ВТ_ИтогОбъекты.СуммаОценкиМакс) КАК СуммаОценкиМакс,
		|	"""" КАК ВидВставки,
		|	ВТ_ИтогОбъекты.ЗалоговыйБилетНомерЗалоговогоБилета КАК ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_ИтогОбъекты.ОбъектЗалога КАК ОбъектЗалога,
		|	ЕСТЬNULL(ВТ_ИтогОбъекты.РегистраторНакладнаяНаОтгрузкуНомер, """") КАК РегистраторНакладнаяНаОтгрузкуНомер,
		|	"""" КАК ПробаВладелецМеталл,
		|	"""" КАК ПробаПробаМеталл,
		|	СУММА(0) КАК КоличествоКамней,
		|	ВТ_ИтогОбъекты.Проба КАК Проба
		|ИЗ
		|	ВТ_ИтогОбъекты КАК ВТ_ИтогОбъекты
		|ГДЕ
		|	НЕ ВТ_ИтогОбъекты.ПробаВладелец ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИтогОбъекты.ПробаПроба,
		|	ВТ_ИтогОбъекты.ПробаВладелец,
		|	ВТ_ИтогОбъекты.Артикул,
		|	ВТ_ИтогОбъекты.ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_ИтогОбъекты.ОбъектЗалога,
		|	ЕСТЬNULL(ВТ_ИтогОбъекты.РегистраторНакладнаяНаОтгрузкуНомер, """"),
		|	ВТ_ИтогОбъекты.Проба
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	""Вставка"",
		|	"""",
		|	"""",
		|	СУММА(0),
		|	СУММА(ВТ_ИтогКамни.Вес),
		|	СУММА(0),
		|	СУММА(0),
		|	ВТ_ИтогКамни.СуммаОценки,
		|	ВТ_ИтогКамни.ВидВставки,
		|	ВТ_ИтогКамни.ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_ИтогКамни.ОбъектЗалога,
		|	"""",
		|	"""",
		|	"""",
		|	СУММА(ВТ_ИтогКамни.КоличествоКамней),
		|	ЗНАЧЕНИЕ(Справочник.ЛБ_Пробы.ПустаяСсылка)
		|ИЗ
		|	ВТ_ИтогКамни КАК ВТ_ИтогКамни
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИтогКамни.ВидВставки,
		|	ВТ_ИтогКамни.СуммаОценки,
		|	ВТ_ИтогКамни.ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_ИтогКамни.ОбъектЗалога
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	""Вставка"",
		|	ВТ_ИтогДопМеталлы.ПробаВладелецОбъект,
		|	ВТ_ИтогДопМеталлы.ПробаПробаОбъект,
		|	СУММА(0),
		|	СУММА(0),
		|	СУММА(ВТ_ИтогДопМеталлы.МассаЛигатуры),
		|	СУММА(ВТ_ИтогДопМеталлы.МассаХим),
		|	СУММА(ВТ_ИтогДопМеталлы.СуммаОценки),
		|	"""",
		|	ВТ_ИтогДопМеталлы.ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_ИтогДопМеталлы.ОбъектЗалога,
		|	"""",
		|	ВТ_ИтогДопМеталлы.ПробаВладелецМеталл,
		|	ВТ_ИтогДопМеталлы.ПробаПробаМеталл,
		|	СУММА(0),
		|	ВТ_ИтогДопМеталлы.Проба
		|ИЗ
		|	ВТ_ИтогДопМеталлы КАК ВТ_ИтогДопМеталлы
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИтогДопМеталлы.ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_ИтогДопМеталлы.ОбъектЗалога,
		|	ВТ_ИтогДопМеталлы.ПробаВладелецМеталл,
		|	ВТ_ИтогДопМеталлы.ПробаПробаМеталл,
		|	ВТ_ИтогДопМеталлы.ПробаВладелецОбъект,
		|	ВТ_ИтогДопМеталлы.ПробаПробаОбъект,
		|	ВТ_ИтогДопМеталлы.Проба
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ОбъектЗалога,
		|	ВидВставки,
		|	Артикул";
	
	Запрос.УстановитьПараметр("ВидКамня", ВидыКамней);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("Ломбард", ПараметрыОтчета.Ломбард);
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.НачалоПериода);
	
	//+МАН 24.02.26 Заявка 3269
	ВыборкаПоПакетно = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	ТЗИтогКамни = ВыборкаПоПакетно[4].Выгрузить();
	ТЗИтогДопМеталлы = ВыборкаПоПакетно[6].Выгрузить();
	//-МАН
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ИтогоРасходОбщаяМасса = 0;
	ИтогоРасходМассаЛигатуры = 0;
	ИтогоРасходМассаХим = 0;
	ИтогоРасходВесДК = 0;
	ИтогоРасходКоличество = 0;
	ИтогоРасходСтоимость = 0;
	НомерПП = 1;
	ШапкаРасход = Ложь;
	//+МАН 01.12.25 Добавлено количество камней
	ИтогоРасходКоличествоКамней = 0;
	//-МАН
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ШапкаРасход Тогда
			Если НачалоДня(ПараметрыОтчета.НачалоПериода) = НачалоДня(ПараметрыОтчета.КонецПериода) Тогда
				ОбластьШапкаРасход.Параметры.Период = Формат(ПараметрыОтчета.НачалоПериода, "ДЛФ=DD");
			Иначе
				ОбластьШапкаРасход.Параметры.Период = Формат(ПараметрыОтчета.НачалоПериода, "ДЛФ=DD") + "-" + Формат(ПараметрыОтчета.КонецПериода, "ДЛФ=DD");
			КонецЕсли;
			ТабличныйДокумент.Вывести(ОбластьШапкаРасход);
			ШапкаРасход = Истина;
		КонецЕсли;
		
		Если Выборка.Артикул = "Вставка" И ЗначениеЗаполнено(Выборка.ВидВставки) Тогда
			ОбластьВставкаБриллиантРасход.Параметры.Проба = Выборка.ВидВставки;
			ОбластьВставкаБриллиантРасход.Параметры.ВесДК = Выборка.Вес;
			ИтогоРасходВесДК = ИтогоРасходВесДК + Выборка.Вес;
			ОбластьВставкаБриллиантРасход.Параметры.Количество = Выборка.КоличествоРасход;
			ИтогоРасходКоличество = ИтогоРасходКоличество + Выборка.КоличествоРасход;
			ОбластьВставкаБриллиантРасход.Параметры.Стоимость = Выборка.СуммаОценкиМакс;
			ИтогоРасходСтоимость = ИтогоРасходСтоимость + Выборка.СуммаОценкиМакс;
			//+МАН 01.12.25 Добавлено количество камней
			ИтогоРасходКоличествоКамней = ИтогоРасходКоличествоКамней + Выборка.КоличествоКамней;
			ОбластьВставкаБриллиантРасход.Параметры.КоличествоДК = Выборка.КоличествоКамней;
			//-МАН
			ТабличныйДокумент.Вывести(ОбластьВставкаБриллиантРасход);
		ИначеЕсли Выборка.Артикул = "Вставка" И Не ЗначениеЗаполнено(Выборка.ВидВставки) Тогда
			ПробаОбъект = Строка(Выборка.ПробаВладелец) + Строка(Выборка.ПробаПроба);
			ПробаМеталл = Строка(Выборка.ПробаВладелецМеталл) + Строка(Выборка.ПробаПробаМеталл);
			Если ПробаОбъект <> ПробаМеталл Тогда
			ОбластьВставкаРасход.Параметры.Проба = Строка(Выборка.ПробаВладелецМеталл) + " " + Строка(Выборка.ПробаПробаМеталл);
			ОбластьВставкаРасход.Параметры.МассаЛигатуры = Выборка.МассаЛигатуры;
			ИтогоРасходМассаЛигатуры = ИтогоРасходМассаЛигатуры + Выборка.МассаЛигатуры;
			ОбластьВставкаРасход.Параметры.МассаХим = Выборка.МассаХим;
			ИтогоРасходМассаХим = ИтогоРасходМассаХим + Выборка.МассаХим;
			ОбластьВставкаРасход.Параметры.ВесДК = "";
			ОбластьВставкаРасход.Параметры.Стоимость = Выборка.СуммаОценкиМакс;
			ИтогоРасходСтоимость = ИтогоРасходСтоимость + Выборка.СуммаОценкиМакс;
			//+МАН 01.12.25 Добавлено количество камней
			ОбластьВставкаРасход.Параметры.КоличествоДК = "";
			//-МАН
			ТабличныйДокумент.Вывести(ОбластьВставкаРасход);
			КонецЕсли;
		Иначе	
			
		//+МАН 24.02.26 Заявка 3269
		Отбор = Новый Структура;
		Отбор.Вставить("ОбъектЗалога", Выборка.ОбъектЗалога);
		
		ТЗСтрокК = ТЗИтогКамни.Скопировать(Отбор, "СуммаОценки");
		ТЗСтрокМ = ТЗИтогДопМеталлы.Скопировать(Отбор);
		
		СуммаДопМ = 0;
		Для каждого Стр Из ТЗСтрокМ Цикл
			Если Выборка.Проба <> Стр.Проба Тогда
				СуммаДопМ = СуммаДопМ + Стр.СуммаОценки;
			КонецЕсли;
		КонецЦикла;
		
		ИтогоСумма = Выборка.СуммаОценкиМакс - ТЗСтрокК.Итог("СуммаОценки") - СуммаДопМ;
		//-МАН
		
		ОбластьРасход.Параметры.НомерПП = НомерПП;
		НомерПП = НомерПП + 1;
		ОбластьРасход.Параметры.Наименование = Выборка.ОбъектЗалога;
		ОбластьРасход.Параметры.НомерНакладной = Выборка.РегистраторНакладнаяНаОтгрузкуНомер;
		ОбластьРасход.Параметры.НомерЗБ = Выборка.Артикул;
		ОбластьРасход.Параметры.Проба = Строка(Выборка.ПробаВладелец) + " " + Строка(Выборка.ПробаПроба);
		ОбластьРасход.Параметры.ОбщаяМасса = Выборка.Вес * Выборка.КоличествоРасход;
		ИтогоРасходОбщаяМасса = ИтогоРасходОбщаяМасса + (Выборка.Вес * Выборка.КоличествоРасход);
		ОбластьРасход.Параметры.МассаЛигатуры = Выборка.МассаЛигатуры * Выборка.КоличествоРасход;
		ИтогоРасходМассаЛигатуры = ИтогоРасходМассаЛигатуры + (Выборка.МассаЛигатуры * Выборка.КоличествоРасход);
		ОбластьРасход.Параметры.МассаХим = Выборка.МассаХим * Выборка.КоличествоРасход;
		ИтогоРасходМассаХим = ИтогоРасходМассаХим + (Выборка.МассаХим * Выборка.КоличествоРасход);
		ОбластьРасход.Параметры.ВесДК = "";
		ОбластьРасход.Параметры.Количество = Выборка.КоличествоРасход;
		ИтогоРасходКоличество = ИтогоРасходКоличество + Выборка.КоличествоРасход;
		//+МАН 24.02.26 Заявка 3269
		//ОбластьРасход.Параметры.Стоимость = Выборка.СуммаОценкиМакс * Выборка.КоличествоРасход;
		//ИтогоРасходСтоимость = ИтогоРасходСтоимость + (Выборка.СуммаОценкиМакс * Выборка.КоличествоРасход);
		ОбластьРасход.Параметры.Стоимость = ИтогоСумма * Выборка.КоличествоРасход;
		ИтогоРасходСтоимость = ИтогоРасходСтоимость + (ИтогоСумма * Выборка.КоличествоРасход);
		//-МАН
		//+МАН 01.12.25 Добавлено количество камней
		ОбластьРасход.Параметры.КоличествоДК = "";
		//-МАН
		ТабличныйДокумент.Вывести(ОбластьРасход);
		КонецЕсли;
	
	КонецЦикла;
	
	Если ИтогоРасходКоличество > 0 Тогда
		Если НачалоДня(ПараметрыОтчета.НачалоПериода) = НачалоДня(ПараметрыОтчета.КонецПериода) Тогда
			ОбластьИтогоРасход.Параметры.Период = Формат(ПараметрыОтчета.НачалоПериода, "ДЛФ=DD");
		Иначе
			ОбластьИтогоРасход.Параметры.Период = Формат(ПараметрыОтчета.НачалоПериода, "ДЛФ=DD") + "-" + Формат(ПараметрыОтчета.КонецПериода, "ДЛФ=DD");
		КонецЕсли;
		
		ОбластьИтогоРасход.Параметры.ИтогоОбщаяМасса = ИтогоРасходОбщаяМасса;
		ОбластьИтогоРасход.Параметры.ИтогоМассаЛигатуры = ИтогоРасходМассаЛигатуры;
		ОбластьИтогоРасход.Параметры.ИтогоМассаХим = ИтогоРасходМассаХим;
		ОбластьИтогоРасход.Параметры.ИтогоВесДК = ИтогоРасходВесДК;
		ОбластьИтогоРасход.Параметры.ИтогоКоличество = ИтогоРасходКоличество;
		ОбластьИтогоРасход.Параметры.ИтогоСтоимость = ИтогоРасходСтоимость;
		//+МАН 01.12.25 Добавлено количество камней
		ОбластьИтогоРасход.Параметры.ИтогоКоличествоДК = ИтогоРасходКоличествоКамней;
		//-МАН
		ТабличныйДокумент.Вывести(ОбластьИтогоРасход);
	КонецЕсли;
	
	ОбластьШапкаОстатокКонец.Параметры.КонецПериода = Формат(ПараметрыОтчета.КонецПериода, "ДЛФ=DD");
	ТабличныйДокумент.Вывести(ОбластьШапкаОстатокКонец);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_Объекты
		|ИЗ
		|	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(&Период, Ломбард = &Ломбард) КАК ЛБ_ОбъектыЗалогаОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_РеквизитыОбъектаЗалога.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_РеквизитыОбъектаЗалога.Проба.Владелец КАК ПробаВладелец,
		|	ЛБ_РеквизитыОбъектаЗалога.Проба.Проба КАК ПробаПроба,
		|	ЛБ_РеквизитыОбъектаЗалога.Вес КАК Вес,
		|	ЛБ_РеквизитыОбъектаЗалога.ВесЧистый КАК ВесЧистый,
		|	ЛБ_РеквизитыОбъектаЗалога.СуммаОценкиМакс КАК СуммаОценкиМакс,
		|	ЛБ_РеквизитыОбъектаЗалога.Проба КАК Проба
		|ПОМЕСТИТЬ ВТ_Характеристики
		|ИЗ
		|	ВТ_Объекты КАК ВТ_Объекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(&Период, ) КАК ЛБ_РеквизитыОбъектаЗалога
		|		ПО ВТ_Объекты.ОбъектЗалога = ЛБ_РеквизитыОбъектаЗалога.ОбъектЗалога
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Характеристики.ПробаВладелец.Наименование КАК ПробаВладелец,
		|	ВТ_Характеристики.ПробаПроба КАК ПробаПроба,
		|	СУММА(ВТ_Объекты.КоличествоОстаток) КАК КоличествоОстаток,
		|	СУММА(ВТ_Характеристики.Вес) КАК Вес,
		|	СУММА(ВТ_Характеристики.ВесЧистый) КАК МассаЛигатуры,
		|	СУММА(ВТ_Характеристики.СуммаОценкиМакс) КАК СуммаОценкиМакс,
		|	СУММА(ВТ_Характеристики.ВесЧистый * (ВТ_Характеристики.ПробаПроба / 10 / 100)) КАК МассаХим,
		|	ВТ_Объекты.ОбъектЗалога КАК ОбъектЗалога,
		|	ВТ_Характеристики.Проба КАК Проба
		|ПОМЕСТИТЬ ВТ_ИтогОбъекты
		|ИЗ
		|	ВТ_Объекты КАК ВТ_Объекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Характеристики КАК ВТ_Характеристики
		|		ПО ВТ_Объекты.ОбъектЗалога = ВТ_Характеристики.ОбъектЗалога
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Характеристики.ПробаПроба,
		|	ВТ_Объекты.ОбъектЗалога,
		|	ВТ_Характеристики.ПробаВладелец.Наименование,
		|	ВТ_Характеристики.Проба
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ВставкиОбъектаЗалога.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ВставкиОбъектаЗалога.ВидВставки КАК ВидВставки,
		|	ВЫБОР
		|		КОГДА ЛБ_ВставкиОбъектаЗалога.Вес <> 0
		|			ТОГДА ЛБ_ВставкиОбъектаЗалога.Вес
		|		ИНАЧЕ ЛБ_ВставкиОбъектаЗалога.ВесГраммы
		|	КОНЕЦ КАК Вес,
		|	ЛБ_ВставкиОбъектаЗалога.СуммаОценки КАК СуммаОценки,
		|	ЛБ_ВставкиОбъектаЗалога.Количество КАК КоличествоКамней
		|ПОМЕСТИТЬ ВТ_Вставки
		|ИЗ
		|	ВТ_Объекты КАК ВТ_Объекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ВставкиОбъектаЗалога.СрезПоследних(&Период, ) КАК ЛБ_ВставкиОбъектаЗалога
		|		ПО ВТ_Объекты.ОбъектЗалога = ЛБ_ВставкиОбъектаЗалога.ОбъектЗалога
		|ГДЕ
		|	ЛБ_ВставкиОбъектаЗалога.ВидВставки.ВидКамня В(&ВидКамня)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Вставки.ВидВставки КАК ВидВставки,
		|	СУММА(ВТ_Объекты.КоличествоОстаток) КАК КоличествоОстаток,
		|	СУММА(ВТ_Вставки.Вес) КАК Вес,
		|	СУММА(ВТ_Вставки.СуммаОценки) КАК СуммаОценки,
		|	ВТ_Объекты.ОбъектЗалога КАК ОбъектЗалога,
		|	СУММА(ВТ_Вставки.КоличествоКамней) КАК КоличествоКамней,
		|	ВТ_Характеристики.Проба КАК Проба
		|ПОМЕСТИТЬ ВТ_ИтогКамни
		|ИЗ
		|	ВТ_Объекты КАК ВТ_Объекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Вставки КАК ВТ_Вставки
		|		ПО ВТ_Объекты.ОбъектЗалога = ВТ_Вставки.ОбъектЗалога
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Характеристики КАК ВТ_Характеристики
		|		ПО ВТ_Объекты.ОбъектЗалога = ВТ_Характеристики.ОбъектЗалога
		|ГДЕ
		|	НЕ ВТ_Вставки.ВидВставки ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Вставки.ВидВставки,
		|	ВТ_Объекты.ОбъектЗалога,
		|	ВТ_Характеристики.Проба
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.Проба.Владелец КАК ПробаВладелец,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.Проба.Проба КАК ПробаПроба,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.ВесЧистый КАК ВесЧистый,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.СуммаОценки КАК СуммаОценки,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.Проба КАК Проба
		|ПОМЕСТИТЬ ВТ_ДопМеталлы
		|ИЗ
		|	ВТ_Объекты КАК ВТ_Объекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(&Период, ) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалога
		|		ПО ВТ_Объекты.ОбъектЗалога = ЛБ_ДополнительныеМатериалыОбъектаЗалога.ОбъектЗалога
		|ГДЕ
		|	НЕ ЛБ_ДополнительныеМатериалыОбъектаЗалога.Проба.Владелец ЕСТЬ NULL
		|	И ЛБ_ДополнительныеМатериалыОбъектаЗалога.НомерСтрокиТаблицы <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДопМеталлы.ПробаВладелец КАК ПробаВладелецМеталл,
		|	ВТ_ДопМеталлы.ПробаПроба КАК ПробаПробаМеталл,
		|	СУММА(ВТ_ДопМеталлы.ВесЧистый) КАК МассаЛигатуры,
		|	СУММА(ВТ_ДопМеталлы.ВесЧистый * (ВТ_ДопМеталлы.ПробаПроба / 10 / 100)) КАК МассаХим,
		|	ВТ_ДопМеталлы.СуммаОценки КАК СуммаОценки,
		|	ВТ_ИтогОбъекты.ПробаВладелец КАК ПробаВладелецОбъект,
		|	ВТ_ИтогОбъекты.ПробаПроба КАК ПробаПробаОбъект,
		|	ВТ_ИтогОбъекты.ОбъектЗалога КАК ОбъектЗалога,
		|	ВТ_ДопМеталлы.Проба КАК Проба
		|ПОМЕСТИТЬ ВТ_ИтогДопМеталлы
		|ИЗ
		|	ВТ_ИтогОбъекты КАК ВТ_ИтогОбъекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДопМеталлы КАК ВТ_ДопМеталлы
		|		ПО ВТ_ИтогОбъекты.ОбъектЗалога = ВТ_ДопМеталлы.ОбъектЗалога
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДопМеталлы.ПробаВладелец,
		|	ВТ_ДопМеталлы.ПробаПроба,
		|	ВТ_ДопМеталлы.СуммаОценки,
		|	ВТ_ИтогОбъекты.ПробаВладелец,
		|	ВТ_ИтогОбъекты.ПробаПроба,
		|	ВТ_ИтогОбъекты.ОбъектЗалога,
		|	ВТ_ДопМеталлы.Проба
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИтогОбъекты.ПробаВладелец КАК ПробаВладелец,
		|	ВТ_ИтогОбъекты.ПробаПроба КАК ПробаПроба,
		|	СУММА(ВТ_ИтогОбъекты.КоличествоОстаток) КАК КоличествоОстаток,
		|	СУММА(ВТ_ИтогОбъекты.Вес) КАК Вес,
		|	СУММА(ВТ_ИтогОбъекты.МассаЛигатуры) КАК МассаЛигатуры,
		|	СУММА(ВТ_ИтогОбъекты.МассаХим) КАК МассаХим,
		|	ЕСТЬNULL(ВТ_ИтогОбъекты.СуммаОценкиМакс, 0) - ЕСТЬNULL(ВТ_ИтогКамни.СуммаОценки, 0) - ЕСТЬNULL(ВТ_ИтогДопМеталлы.СуммаОценки, 0) КАК СуммаОценкиМакс,
		|	"""" КАК ВидВставки,
		|	"""" КАК ПробаВладелецМеталл,
		|	"""" КАК ПробаПробаМеталл,
		|	0 КАК КоличествоКамней,
		|	ВТ_ИтогОбъекты.Проба КАК Проба,
		|	ВТ_ИтогОбъекты.Проба.Наименование КАК ПробаНаименование
		|ПОМЕСТИТЬ ВТ_ИТОГ
		|ИЗ
		|	ВТ_ИтогОбъекты КАК ВТ_ИтогОбъекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтогКамни КАК ВТ_ИтогКамни
		|		ПО ВТ_ИтогОбъекты.ОбъектЗалога = ВТ_ИтогКамни.ОбъектЗалога
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтогДопМеталлы КАК ВТ_ИтогДопМеталлы
		|		ПО ВТ_ИтогОбъекты.ОбъектЗалога = ВТ_ИтогДопМеталлы.ОбъектЗалога
		|			И ВТ_ИтогОбъекты.ПробаВладелец <> ВТ_ИтогДопМеталлы.ПробаВладелецМеталл
		|			И ВТ_ИтогОбъекты.ПробаПроба <> ВТ_ИтогДопМеталлы.ПробаПробаМеталл
		|ГДЕ
		|	НЕ ВТ_ИтогОбъекты.ПробаВладелец ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИтогОбъекты.ПробаПроба,
		|	ВТ_ИтогОбъекты.ПробаВладелец,
		|	ВТ_ИтогКамни.СуммаОценки,
		|	ВТ_ИтогДопМеталлы.СуммаОценки,
		|	ЕСТЬNULL(ВТ_ИтогОбъекты.СуммаОценкиМакс, 0) - ЕСТЬNULL(ВТ_ИтогКамни.СуммаОценки, 0) - ЕСТЬNULL(ВТ_ИтогДопМеталлы.СуммаОценки, 0),
		|	ВТ_ИтогОбъекты.Проба,
		|	ВТ_ИтогОбъекты.Проба.Наименование
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	"""",
		|	"""",
		|	СУММА(0),
		|	СУММА(ВТ_ИтогКамни.Вес),
		|	СУММА(0),
		|	СУММА(0),
		|	ВТ_ИтогКамни.СуммаОценки,
		|	ВТ_ИтогКамни.ВидВставки,
		|	"""",
		|	"""",
		|	СУММА(ВТ_ИтогКамни.КоличествоКамней),
		|	""Камень"",
		|	""Камень""
		|ИЗ
		|	ВТ_ИтогКамни КАК ВТ_ИтогКамни
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИтогКамни.ВидВставки,
		|	ВТ_ИтогКамни.СуммаОценки
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_ИтогДопМеталлы.ПробаВладелецМеталл,
		|	ВТ_ИтогДопМеталлы.ПробаПробаМеталл,
		|	СУММА(0),
		|	СУММА(0),
		|	СУММА(ВТ_ИтогДопМеталлы.МассаЛигатуры),
		|	СУММА(ВТ_ИтогДопМеталлы.МассаХим),
		|	СУММА(ВТ_ИтогДопМеталлы.СуммаОценки),
		|	"""",
		|	ВТ_ИтогДопМеталлы.ПробаВладелецМеталл,
		|	ВТ_ИтогДопМеталлы.ПробаПробаМеталл,
		|	СУММА(0),
		|	ВТ_ИтогДопМеталлы.Проба,
		|	ВТ_ИтогДопМеталлы.Проба.Наименование
		|ИЗ
		|	ВТ_ИтогДопМеталлы КАК ВТ_ИтогДопМеталлы
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИтогДопМеталлы.Проба,
		|	ВТ_ИтогДопМеталлы.ПробаВладелецМеталл,
		|	ВТ_ИтогДопМеталлы.ПробаПробаМеталл,
		|	ВТ_ИтогДопМеталлы.Проба.Наименование,
		|	ВТ_ИтогДопМеталлы.ПробаВладелецМеталл,
		|	ВТ_ИтогДопМеталлы.ПробаПробаМеталл
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИТОГ.ПробаВладелец КАК ПробаВладелец,
		|	ВТ_ИТОГ.ПробаПроба КАК ПробаПроба,
		|	СУММА(ВТ_ИТОГ.КоличествоОстаток) КАК КоличествоОстаток,
		|	СУММА(ЕСТЬNULL(ВТ_ИТОГ.Вес, 0)) КАК Вес,
		|	СУММА(ВТ_ИТОГ.МассаЛигатуры) КАК МассаЛигатуры,
		|	СУММА(ВТ_ИТОГ.МассаХим) КАК МассаХим,
		|	СУММА(ВТ_ИТОГ.СуммаОценкиМакс) КАК СуммаОценкиМакс,
		|	ВТ_ИТОГ.ВидВставки КАК ВидВставки,
		|	ВТ_ИТОГ.ПробаВладелецМеталл КАК ПробаВладелецМеталл,
		|	ВТ_ИТОГ.ПробаПробаМеталл КАК ПробаПробаМеталл,
		|	СУММА(ВТ_ИТОГ.КоличествоКамней) КАК КоличествоКамней,
		|	ВТ_ИТОГ.Проба КАК Проба,
		|	ВТ_ИТОГ.ПробаНаименование КАК ПробаНаименование
		|ИЗ
		|	ВТ_ИТОГ КАК ВТ_ИТОГ
		|ГДЕ
		|	НЕ ВТ_ИТОГ.ПробаВладелецМеталл ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИТОГ.ПробаВладелец,
		|	ВТ_ИТОГ.ПробаПроба,
		|	ВТ_ИТОГ.ВидВставки,
		|	ВТ_ИТОГ.ПробаВладелецМеталл,
		|	ВТ_ИТОГ.ПробаПробаМеталл,
		|	ВТ_ИТОГ.Проба,
		|	ВТ_ИТОГ.ПробаНаименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидВставки,
		|	ПробаНаименование";
	
	Запрос.УстановитьПараметр("ВидКамня", ВидыКамней);
	Запрос.УстановитьПараметр("Ломбард", ПараметрыОтчета.Ломбард);
	Запрос.УстановитьПараметр("Период", КонецДня(ПараметрыОтчета.КонецПериода));

	//+МАН 24.02.26 Заявка 3269
	ВыборкаПоПакетно = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	ТЗИтогОЗ = ВыборкаПоПакетно[2].Выгрузить();
	ТЗИтогКамни = ВыборкаПоПакетно[4].Выгрузить();
	ТЗИтогДопМеталлы = ВыборкаПоПакетно[6].Выгрузить();
	ТЗИтог = ВыборкаПоПакетно[8].Выгрузить();
	ТЗПроб = ТЗИтог.Скопировать(, "Проба");
	ТЗПроб.Свернуть("Проба");
	//-МАН

	ИтогоОстатокКонецОбщаяМасса = 0;
	ИтогоОстатокКонецМассаЛигатуры = 0;
	ИтогоОстатокКонецМассаХим = 0;
	ИтогоОстатокКонецВесДК = 0;
	ИтогоОстатокКонецКоличество = 0;
	ИтогоОстатокКонецСтоимость = 0;
	//+МАН 01.12.25 Добавлено количество камней
	ИтогоОстатокКонецКоличествоКамней = 0;
	//-МАН
	
	Для каждого Стр Из ТЗПроб Цикл
		Если ТипЗнч(Стр.Проба) = Тип("СправочникСсылка.ЛБ_Пробы") Тогда
			
			ОтборНачало = Новый Структура;
			ОтборНачало.Вставить("Проба", Стр.Проба);
			
			СтрОЗ = ТЗИтогОЗ.Скопировать(ОтборНачало, "Вес, КоличествоОстаток, МассаЛигатуры, МассаХим, СуммаОценкиМакс");
			СтрК = ТЗИтогКамни.Скопировать(ОтборНачало, "СуммаОценки");
			СтрМ = ТЗИтогДопМеталлы.Скопировать(ОтборНачало, "СуммаОценки");
			
			Если СтрК.Количество() = 0 Тогда
				СуммаК = 0;
			Иначе
				СуммаК = СтрК.Итог("СуммаОценки");
			КонецЕсли;
			
			Если СтрМ.Количество() = 0 Тогда
				СуммаМ = 0;
			Иначе
				СуммаМ = СтрМ.Итог("СуммаОценки");
			КонецЕсли;
			
			ОбластьОстатокКонец.Параметры.Проба = Строка(Стр.Проба);
			ОбластьОстатокКонец.Параметры.ОбщаяМасса = СтрОЗ.Итог("Вес");
			ИтогоОстатокКонецОбщаяМасса = ИтогоОстатокКонецОбщаяМасса + СтрОЗ.Итог("Вес");
			ОбластьОстатокКонец.Параметры.МассаЛигатуры = СтрОЗ.Итог("МассаЛигатуры");
			ИтогоОстатокКонецМассаЛигатуры = ИтогоОстатокКонецМассаЛигатуры + СтрОЗ.Итог("МассаЛигатуры");
			ОбластьОстатокКонец.Параметры.МассаХим = СтрОЗ.Итог("МассаХим");
			ИтогоОстатокКонецМассаХим = ИтогоОстатокКонецМассаХим + СтрОЗ.Итог("МассаХим");
			ОбластьОстатокКонец.Параметры.ВесДК = "";
			ОбластьОстатокКонец.Параметры.Количество = СтрОЗ.Итог("КоличествоОстаток");
			ИтогоОстатокКонецКоличество = ИтогоОстатокКонецКоличество + СтрОЗ.Итог("КоличествоОстаток");
			ОбластьОстатокКонец.Параметры.Стоимость = СтрОЗ.Итог("СуммаОценкиМакс") - СуммаК - СуммаМ;
			ИтогоОстатокКонецСтоимость = ИтогоОстатокКонецСтоимость + (СтрОЗ.Итог("СуммаОценкиМакс") - СуммаК - СуммаМ);
			//+МАН 01.12.25 Добавлено количество камней
			ОбластьОстатокКонец.Параметры.КоличествоДК = "";
			//-МАН
			ТабличныйДокумент.Вывести(ОбластьОстатокКонец);
		Иначе
			ОтборНачало = Новый Структура;
			ОтборНачало.Вставить("Проба", Стр.Проба);
			
			СтрИтогК = ТЗИтог.Скопировать(ОтборНачало);
			
			Для каждого Стр Из СтрИтогК Цикл
				ОбластьОстатокКонец.Параметры.Проба = Стр.ВидВставки;
				ОбластьОстатокКонец.Параметры.ОбщаяМасса = "";
				ОбластьОстатокКонец.Параметры.МассаЛигатуры = "";
				ОбластьОстатокКонец.Параметры.МассаХим = "";
				ОбластьОстатокКонец.Параметры.ВесДК = Стр.Вес;
				ИтогоОстатокКонецВесДК = ИтогоОстатокКонецВесДК + Стр.Вес;
				ОбластьОстатокКонец.Параметры.Количество = Стр.КоличествоОстаток;
				ИтогоОстатокКонецКоличество = ИтогоОстатокКонецКоличество + Стр.КоличествоОстаток;
				ОбластьОстатокКонец.Параметры.Стоимость = Стр.СуммаОценкиМакс;
				ИтогоОстатокКонецСтоимость = ИтогоОстатокКонецСтоимость + Стр.СуммаОценкиМакс;
				//+МАН 01.12.25 Добавлено количество камней
				ОбластьОстатокКонец.Параметры.КоличествоДК = Стр.КоличествоКамней;
				ИтогоОстатокКонецКоличествоКамней = ИтогоОстатокКонецКоличествоКамней + Стр.КоличествоКамней;
				//-МАН
				ТабличныйДокумент.Вывести(ОбластьОстатокКонец);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	ОбластьИтогоОстатокКонец.Параметры.ИтогоОбщаяМасса = ИтогоОстатокКонецОбщаяМасса;
	ОбластьИтогоОстатокКонец.Параметры.ИтогоМассаЛигатуры = ИтогоОстатокКонецМассаЛигатуры;
	ОбластьИтогоОстатокКонец.Параметры.ИтогоМассаХим = ИтогоОстатокКонецМассаХим;
	ОбластьИтогоОстатокКонец.Параметры.ИтогоВесДК = ИтогоОстатокКонецВесДК;
	ОбластьИтогоОстатокКонец.Параметры.ИтогоКоличество = ИтогоОстатокКонецКоличество;
	ОбластьИтогоОстатокКонец.Параметры.ИтогоСтоимость = ИтогоОстатокКонецСтоимость;
	//+МАН 01.12.25 Добавлено количество камней
	ОбластьИтогоОстатокКонец.Параметры.ИтогоКоличествоДК = ИтогоОстатокКонецКоличествоКамней;
	//-МАН
	ТабличныйДокумент.Вывести(ОбластьИтогоОстатокКонец);
	
	ОбластьПодвал.Параметры.ДатаСоставления = Формат(ПараметрыОтчета.КонецПериода, "ДЛФ=DD");
	
	Ответственный              = ПараметрыСеанса.ТекущийСотрудник;	
	ФИООтветственного          = СтрРазделить(Строка(Ответственный), " ");
	
	Если ФИООтветственного.Количество() > 0 Тогда
		ФамилияОтветственного  = ФИООтветственного[0]; 
		ИнициалыОтветственного = Лев(ФИООтветственного[1], 1) + "." + Лев(ФИООтветственного[2], 1) + ".";
	Иначе
		ФамилияОтветственного  = ""; 
		ИнициалыОтветственного = "";
	КонецЕсли;
		
	ОбластьПодвал.Параметры.Ответственный = ФамилияОтветственного + " " + ИнициалыОтветственного;
	
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

//+МАН 24.02.26 Сохранил прежнюю функцию без изменени. Посмотри Функцию выше. Там уже все исправлено и быстрей происходит обработка.
Функция ПечатьЖурналДвиженияДМ(ПараметрыОтчета) Экспорт 
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	//ТабличныйДокумент.Защита = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЖурналДвиженияДМ";
	//+МАН 02.12.25 Добавил параметры
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	//-МАН
	Макет = ПолучитьОбщийМакет("ЛБ_ПФ_ЖурналДвиженияДМ");
	
	ОбластьШапка                  = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьШапкаОстатокНачало     = Макет.ПолучитьОбласть("ОбластьШапкаОстатокНачало");
	ОбластьОстатокНачало          = Макет.ПолучитьОбласть("ОбластьОстатокНачало");	
	ОбластьИтогоОстатокНачало     = Макет.ПолучитьОбласть("ОбластьИтогоОстатокНачало");
	ОбластьШапкаПриход            = Макет.ПолучитьОбласть("ОбластьШапкаПриход");
	ОбластьПриход                 = Макет.ПолучитьОбласть("ОбластьПриход");
	ОбластьВставкаПриход          = Макет.ПолучитьОбласть("ОбластьВставкаПриход");
	ОбластьВставкаБриллиантПриход = Макет.ПолучитьОбласть("ОбластьВставкаБриллиантПриход");
	ОбластьИтогоПриход            = Макет.ПолучитьОбласть("ОбластьИтогоПриход");
	ОбластьШапкаРасход            = Макет.ПолучитьОбласть("ОбластьШапкаРасход");
	ОбластьРасход                 = Макет.ПолучитьОбласть("ОбластьРасход");
	ОбластьВставкаРасход          = Макет.ПолучитьОбласть("ОбластьВставкаРасход");
	ОбластьВставкаБриллиантРасход = Макет.ПолучитьОбласть("ОбластьВставкаБриллиантРасход");
	ОбластьИтогоРасход            = Макет.ПолучитьОбласть("ОбластьИтогоРасход");
	ОбластьШапкаОстатокКонец      = Макет.ПолучитьОбласть("ОбластьШапкаОстатокКонец");
	ОбластьОстатокКонец           = Макет.ПолучитьОбласть("ОбластьОстатокКонец");
	ОбластьИтогоОстатокКонец      = Макет.ПолучитьОбласть("ОбластьИтогоОстатокКонец");
	ОбластьПодвал                 = Макет.ПолучитьОбласть("ОбластьПодвал");
	
	
	ОбластьШапка.Параметры.НомерЛомбарда = ПараметрыОтчета.Ломбард.НомерЛомбарда;
	
	СтруктураАдреса = фПрочитатьJSON(ПараметрыОтчета.Ломбард.КонтактнаяИнформация[0].Значение);
	ОбластьШапка.Параметры.АдресЛомбарда = СтруктураАдреса.value;
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	ОбластьШапкаОстатокНачало.Параметры.НачалоПериода = Формат(ПараметрыОтчета.НачалоПериода, "ДЛФ=DD");
	ТабличныйДокумент.Вывести(ОбластьШапкаОстатокНачало);
				
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ЗалоговыйБилет
		|ПОМЕСТИТЬ ВТ_Объекты
		|ИЗ
		|	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(&Период, Ломбард = &Ломбард) КАК ЛБ_ОбъектыЗалогаОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_РеквизитыОбъектаЗалога.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_РеквизитыОбъектаЗалога.Проба.Владелец КАК ПробаВладелец,
		|	ЛБ_РеквизитыОбъектаЗалога.Проба.Проба КАК ПробаПроба,
		|	ЛБ_РеквизитыОбъектаЗалога.Вес КАК Вес,
		|	ЛБ_РеквизитыОбъектаЗалога.ВесЧистый КАК ВесЧистый,
		|	ЛБ_РеквизитыОбъектаЗалога.СуммаОценкиМакс КАК СуммаОценкиМакс,
		|	ЛБ_РеквизитыОбъектаЗалога.ЗалоговыйБилет КАК ЗалоговыйБилет
		|ПОМЕСТИТЬ ВТ_Характеристики
		|ИЗ
		|	РегистрСведений.ЛБ_РеквизитыОбъектаЗалога КАК ЛБ_РеквизитыОбъектаЗалога
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Характеристики.ПробаВладелец.Наименование КАК ПробаВладелец,
		|	ВТ_Характеристики.ПробаПроба КАК ПробаПроба,
		|	СУММА(ВТ_Объекты.КоличествоОстаток) КАК КоличествоОстаток,
		|	СУММА(ВТ_Характеристики.Вес) КАК Вес,
		|	СУММА(ВТ_Характеристики.ВесЧистый) КАК МассаЛигатуры,
		|	СУММА(ВТ_Характеристики.СуммаОценкиМакс) КАК СуммаОценкиМакс,
		|	СУММА(ВТ_Характеристики.ВесЧистый * (ВТ_Характеристики.ПробаПроба / 10 / 100)) КАК МассаХим,
		|	ВТ_Объекты.ОбъектЗалога КАК ОбъектЗалога,
		|	ВТ_Объекты.ЗалоговыйБилет КАК ЗалоговыйБилет
		|ПОМЕСТИТЬ ВТ_ИтогОбъекты
		|ИЗ
		|	ВТ_Объекты КАК ВТ_Объекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Характеристики КАК ВТ_Характеристики
		|		ПО ВТ_Объекты.ОбъектЗалога = ВТ_Характеристики.ОбъектЗалога
		|			И ВТ_Объекты.ЗалоговыйБилет = ВТ_Характеристики.ЗалоговыйБилет
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Характеристики.ПробаПроба,
		|	ВТ_Объекты.ОбъектЗалога,
		|	ВТ_Объекты.ЗалоговыйБилет,
		|	ВТ_Характеристики.ПробаВладелец.Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ВставкиОбъектаЗалога.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ВставкиОбъектаЗалога.ВидВставки КАК ВидВставки,
		|	ВЫБОР
		|		КОГДА ЛБ_ВставкиОбъектаЗалога.Вес <> 0
		|			ТОГДА ЛБ_ВставкиОбъектаЗалога.Вес
		|		ИНАЧЕ ЛБ_ВставкиОбъектаЗалога.ВесГраммы
		|	КОНЕЦ КАК Вес,
		|	ЛБ_ВставкиОбъектаЗалога.СуммаОценки КАК СуммаОценки,
		|	ЛБ_ВставкиОбъектаЗалога.ЗалоговыйБилет КАК ЗалоговыйБилет,
		//+МАН 01.12.25 Добавлено количество камней
		|	ЛБ_ВставкиОбъектаЗалога.Количество КАК КоличествоКамней
		//-МАН
		|ПОМЕСТИТЬ ВТ_Вставки
		|ИЗ
		|	РегистрСведений.ЛБ_ВставкиОбъектаЗалога КАК ЛБ_ВставкиОбъектаЗалога
		|ГДЕ
		|	ЛБ_ВставкиОбъектаЗалога.ВидВставки.ВидКамня В(&ВидКамня)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Вставки.ВидВставки КАК ВидВставки,
		|	СУММА(ВТ_Объекты.КоличествоОстаток) КАК КоличествоОстаток,
		|	СУММА(ВТ_Вставки.Вес) КАК Вес,
		|	СУММА(ВТ_Вставки.СуммаОценки) КАК СуммаОценки,
		|	ВТ_Объекты.ОбъектЗалога КАК ОбъектЗалога,
		|	ВТ_Объекты.ЗалоговыйБилет КАК ЗалоговыйБилет,
		//+МАН 01.12.25 Добавлено количество камней
		|	СУММА(ВТ_Вставки.КоличествоКамней) КАК КоличествоКамней
		//-МАН
		|ПОМЕСТИТЬ ВТ_ИтогКамни
		|ИЗ
		|	ВТ_Объекты КАК ВТ_Объекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Вставки КАК ВТ_Вставки
		|		ПО ВТ_Объекты.ОбъектЗалога = ВТ_Вставки.ОбъектЗалога
		|			И ВТ_Объекты.ЗалоговыйБилет = ВТ_Вставки.ЗалоговыйБилет
		|ГДЕ
		|	НЕ ВТ_Вставки.ВидВставки ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Вставки.ВидВставки,
		|	ВТ_Объекты.ОбъектЗалога,
		|	ВТ_Объекты.ЗалоговыйБилет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.Проба.Владелец КАК ПробаВладелец,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.Проба.Проба КАК ПробаПроба,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.ВесЧистый КАК ВесЧистый,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.СуммаОценки КАК СуммаОценки,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.ЗалоговыйБилет КАК ЗалоговыйБилет
		|ПОМЕСТИТЬ ВТ_ДопМеталлы
		|ИЗ
		|	РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога КАК ЛБ_ДополнительныеМатериалыОбъектаЗалога
		|ГДЕ
		|	НЕ ЛБ_ДополнительныеМатериалыОбъектаЗалога.Проба.Владелец ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДопМеталлы.ПробаВладелец КАК ПробаВладелецМеталл,
		|	ВТ_ДопМеталлы.ПробаПроба КАК ПробаПробаМеталл,
		|	СУММА(ВТ_ДопМеталлы.ВесЧистый) КАК МассаЛигатуры,
		|	СУММА(ВТ_ДопМеталлы.ВесЧистый * (ВТ_ДопМеталлы.ПробаПроба / 10 / 100)) КАК МассаХим,
		|	ВТ_ДопМеталлы.СуммаОценки КАК СуммаОценки,
		|	ВТ_ИтогОбъекты.ПробаВладелец КАК ПробаВладелецОбъект,
		|	ВТ_ИтогОбъекты.ПробаПроба КАК ПробаПробаОбъект,
		|	ВТ_ИтогОбъекты.ОбъектЗалога КАК ОбъектЗалога,
		|	ВТ_ИтогОбъекты.ЗалоговыйБилет КАК ЗалоговыйБилет
		|ПОМЕСТИТЬ ВТ_ИтогДопМеталлы
		|ИЗ
		|	ВТ_ИтогОбъекты КАК ВТ_ИтогОбъекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДопМеталлы КАК ВТ_ДопМеталлы
		|		ПО ВТ_ИтогОбъекты.ОбъектЗалога = ВТ_ДопМеталлы.ОбъектЗалога
		|			И ВТ_ИтогОбъекты.ЗалоговыйБилет = ВТ_ДопМеталлы.ЗалоговыйБилет
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДопМеталлы.ПробаВладелец,
		|	ВТ_ДопМеталлы.ПробаПроба,
		|	ВТ_ДопМеталлы.СуммаОценки,
		|	ВТ_ИтогОбъекты.ПробаВладелец,
		|	ВТ_ИтогОбъекты.ПробаПроба,
		|	ВТ_ИтогОбъекты.ОбъектЗалога,
		|	ВТ_ИтогОбъекты.ЗалоговыйБилет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИтогОбъекты.ПробаВладелец КАК ПробаВладелец,
		|	ВТ_ИтогОбъекты.ПробаПроба КАК ПробаПроба,
		|	СУММА(ВТ_ИтогОбъекты.КоличествоОстаток) КАК КоличествоОстаток,
		|	СУММА(ВТ_ИтогОбъекты.Вес) КАК Вес,
		|	СУММА(ВТ_ИтогОбъекты.МассаЛигатуры) КАК МассаЛигатуры,
		|	СУММА(ВТ_ИтогОбъекты.МассаХим) КАК МассаХим,
		|	СУММА(ЕСТЬNULL(ВТ_ИтогОбъекты.СуммаОценкиМакс, 0) - ЕСТЬNULL(ВТ_ИтогКамни.СуммаОценки, 0) - ЕСТЬNULL(ВТ_ИтогДопМеталлы.СуммаОценки, 0)) КАК СуммаОценкиМакс,
		|	"""" КАК ВидВставки,
		|	"""" КАК ПробаВладелецМеталл,
		|	"""" КАК ПробаПробаМеталл,
		//+МАН 01.12.25 Добавлено количество камней
		|	СУММА(0) КАК КоличествоКамней
		//-МАН
		|ПОМЕСТИТЬ ВТ_ИТОГ
		|ИЗ
		|	ВТ_ИтогОбъекты КАК ВТ_ИтогОбъекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтогКамни КАК ВТ_ИтогКамни
		|		ПО ВТ_ИтогОбъекты.ОбъектЗалога = ВТ_ИтогКамни.ОбъектЗалога
		|			И ВТ_ИтогОбъекты.ЗалоговыйБилет = ВТ_ИтогКамни.ЗалоговыйБилет
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтогДопМеталлы КАК ВТ_ИтогДопМеталлы
		|		ПО ВТ_ИтогОбъекты.ОбъектЗалога = ВТ_ИтогДопМеталлы.ОбъектЗалога
		|			И ВТ_ИтогОбъекты.ЗалоговыйБилет = ВТ_ИтогДопМеталлы.ЗалоговыйБилет
		|			И ВТ_ИтогОбъекты.ПробаВладелец <> ВТ_ИтогДопМеталлы.ПробаВладелецМеталл
		|			И ВТ_ИтогОбъекты.ПробаПроба <> ВТ_ИтогДопМеталлы.ПробаПробаМеталл
		|ГДЕ
		|	НЕ ВТ_ИтогОбъекты.ПробаВладелец ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИтогОбъекты.ПробаПроба,
		|	ВТ_ИтогОбъекты.ПробаВладелец
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	"""",
		|	"""",
		|	СУММА(0),
		|	СУММА(ВТ_ИтогКамни.Вес),
		|	СУММА(0),
		|	СУММА(0),
		|	ВТ_ИтогКамни.СуммаОценки,
		|	ВТ_ИтогКамни.ВидВставки,
		|	"""",
		|	"""",
		//+МАН 01.12.25 Добавлено количество камней
		|	СУММА(ВТ_ИтогКамни.КоличествоКамней)
		//-МАН
		|ИЗ
		|	ВТ_ИтогКамни КАК ВТ_ИтогКамни
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИтогКамни.ВидВставки,
		|	ВТ_ИтогКамни.СуммаОценки
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_ИтогДопМеталлы.ПробаВладелецОбъект,
		|	ВТ_ИтогДопМеталлы.ПробаПробаОбъект,
		|	СУММА(0),
		|	СУММА(0),
		|	СУММА(ВТ_ИтогДопМеталлы.МассаЛигатуры),
		|	СУММА(ВТ_ИтогДопМеталлы.МассаХим),
		|	СУММА(ВТ_ИтогДопМеталлы.СуммаОценки),
		|	"""",
		|	ВТ_ИтогДопМеталлы.ПробаВладелецМеталл,
		|	ВТ_ИтогДопМеталлы.ПробаПробаМеталл,
		//+МАН 01.12.25 Добавлено количество камней
		|	СУММА(0)
		//-МАН
		|ИЗ
		|	ВТ_ИтогДопМеталлы КАК ВТ_ИтогДопМеталлы
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИтогДопМеталлы.ПробаВладелецМеталл,
		|	ВТ_ИтогДопМеталлы.ПробаПробаМеталл,
		|	ВТ_ИтогДопМеталлы.ПробаВладелецОбъект,
		|	ВТ_ИтогДопМеталлы.ПробаПробаОбъект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИТОГ.ПробаВладелец КАК ПробаВладелец,
		|	ВТ_ИТОГ.ПробаПроба КАК ПробаПроба,
		|	СУММА(ВТ_ИТОГ.КоличествоОстаток) КАК КоличествоОстаток,
		|	СУММА(ЕСТЬNULL(ВТ_ИТОГ.Вес, 0)) КАК Вес,
		|	СУММА(ВТ_ИТОГ.МассаЛигатуры) КАК МассаЛигатуры,
		|	СУММА(ВТ_ИТОГ.МассаХим) КАК МассаХим,
		|	СУММА(ВТ_ИТОГ.СуммаОценкиМакс) КАК СуммаОценкиМакс,
		|	ВТ_ИТОГ.ВидВставки КАК ВидВставки,
		|	ВТ_ИТОГ.ПробаВладелецМеталл КАК ПробаВладелецМеталл,
		|	ВТ_ИТОГ.ПробаПробаМеталл КАК ПробаПробаМеталл,
		//+МАН 01.12.25 Добавлено количество камней
		|	СУММА(ВТ_ИТОГ.КоличествоКамней) КАК КоличествоКамней
		//-МАН
		|ИЗ
		|	ВТ_ИТОГ КАК ВТ_ИТОГ
		|ГДЕ
		|	НЕ ВТ_ИТОГ.ПробаВладелецМеталл ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИТОГ.ПробаВладелец,
		|	ВТ_ИТОГ.ПробаПроба,
		|	ВТ_ИТОГ.ВидВставки,
		|	ВТ_ИТОГ.ПробаВладелецМеталл,
		|	ВТ_ИТОГ.ПробаПробаМеталл
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидВставки,
		|	ПробаВладелец,
		|	ПробаПроба";
	
	ВидыКамней = Новый СписокЗначений;
	ВидыКамней.Добавить(Перечисления.ЛБ_ВидыКамней.Драгоценные);
	ВидыКамней.Добавить(Перечисления.ЛБ_ВидыКамней.Полудрагоценные);
	ВидыКамней.Добавить(Перечисления.ЛБ_ВидыКамней.Синтетические);
	
	Запрос.УстановитьПараметр("ВидКамня", ВидыКамней);
	Запрос.УстановитьПараметр("Ломбард", ПараметрыОтчета.Ломбард);
	Запрос.УстановитьПараметр("Период", ПараметрыОтчета.НачалоПериода);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ИтогоОстатокОбщаяМасса = 0;
	ИтогоОстатокМассаЛигатуры = 0;
	ИтогоОстатокМассаХим = 0;
	ИтогоОстатокВесДК = 0;
	ИтогоОстатокКоличество = 0;
	ИтогоОстатокСтоимость = 0;
	//+МАН 01.12.25 Добавлено количество камней
	ИтогоОстатокКоличествоКамней = 0;
	//-МАН
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ПробаВладелец) Тогда
		ПробаОбъект = Строка(Выборка.ПробаВладелец) + Строка(Выборка.ПробаПроба);
		ПробаМеталл = Строка(Выборка.ПробаВладелецМеталл) + Строка(Выборка.ПробаПробаМеталл);
		Если ПробаОбъект = ПробаМеталл Тогда
			Продолжить;
		Иначе
			Если ЗначениеЗаполнено(Выборка.ПробаВладелецМеталл) Тогда
				ОбластьОстатокНачало.Параметры.Проба = Строка(Выборка.ПробаВладелецМеталл) + " " + Строка(Выборка.ПробаПробаМеталл);
			Иначе
				ОбластьОстатокНачало.Параметры.Проба = Строка(Выборка.ПробаВладелец) + " " + Строка(Выборка.ПробаПроба);
			КонецЕсли;
		КонецЕсли;
		ОбластьОстатокНачало.Параметры.ОбщаяМасса = Выборка.Вес;
		ИтогоОстатокОбщаяМасса = ИтогоОстатокОбщаяМасса + Выборка.Вес;
		ОбластьОстатокНачало.Параметры.МассаЛигатуры = Выборка.МассаЛигатуры;
		ИтогоОстатокМассаЛигатуры = ИтогоОстатокМассаЛигатуры + Выборка.МассаЛигатуры;
		ОбластьОстатокНачало.Параметры.МассаХим = Выборка.МассаХим;
		ИтогоОстатокМассаХим = ИтогоОстатокМассаХим + Выборка.МассаХим;
		ОбластьОстатокНачало.Параметры.ВесДК = "";
		ОбластьОстатокНачало.Параметры.Количество = Выборка.КоличествоОстаток;
		ИтогоОстатокКоличество = ИтогоОстатокКоличество + Выборка.КоличествоОстаток;
		ОбластьОстатокНачало.Параметры.Стоимость = Выборка.СуммаОценкиМакс;
		ИтогоОстатокСтоимость = ИтогоОстатокСтоимость + Выборка.СуммаОценкиМакс;
		ТабличныйДокумент.Вывести(ОбластьОстатокНачало);
	Иначе
		Если Выборка.Вес <> 0 Тогда
		ОбластьОстатокНачало.Параметры.Проба = Выборка.ВидВставки;
		ОбластьОстатокНачало.Параметры.ОбщаяМасса = "";
		ОбластьОстатокНачало.Параметры.МассаЛигатуры = "";
		ОбластьОстатокНачало.Параметры.МассаХим = "";
		ОбластьОстатокНачало.Параметры.ВесДК = Выборка.Вес;
		ИтогоОстатокВесДК = ИтогоОстатокВесДК + Выборка.Вес;
		ОбластьОстатокНачало.Параметры.Количество = Выборка.КоличествоОстаток;
		ИтогоОстатокКоличество = ИтогоОстатокКоличество + Выборка.КоличествоОстаток;
		ОбластьОстатокНачало.Параметры.Стоимость = Выборка.СуммаОценкиМакс;
		ИтогоОстатокСтоимость = ИтогоОстатокСтоимость + Выборка.СуммаОценкиМакс;
		//+МАН 01.12.25 Добавлено количество камней
        ИтогоОстатокКоличествоКамней = ИтогоОстатокКоличествоКамней + Выборка.КоличествоКамней;
		ОбластьОстатокНачало.Параметры.КоличествоДК = Выборка.КоличествоКамней;
		//-МАН
		ТабличныйДокумент.Вывести(ОбластьОстатокНачало);
		КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ОбластьИтогоОстатокНачало.Параметры.ИтогоОбщаяМасса = ИтогоОстатокОбщаяМасса;
	ОбластьИтогоОстатокНачало.Параметры.ИтогоМассаЛигатуры = ИтогоОстатокМассаЛигатуры;
	ОбластьИтогоОстатокНачало.Параметры.ИтогоМассаХим = ИтогоОстатокМассаХим;
	ОбластьИтогоОстатокНачало.Параметры.ИтогоВесДК = ИтогоОстатокВесДК;
	ОбластьИтогоОстатокНачало.Параметры.ИтогоКоличество = ИтогоОстатокКоличество;
	ОбластьИтогоОстатокНачало.Параметры.ИтогоСтоимость = ИтогоОстатокСтоимость;
	//+МАН 01.12.25 Добавлено количество камней
	ОбластьИтогоОстатокНачало.Параметры.ИтогоКоличествоДК = ИтогоОстатокКоличествоКамней;
	//-МАН
	ТабличныйДокумент.Вывести(ОбластьИтогоОстатокНачало);
	
	//Приход	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОбъектыЗалогаОбороты.ОбъектЗалога КАК ОбъектЗалога,
		|	СУММА(ЛБ_ОбъектыЗалогаОбороты.КоличествоПриход) КАК КоличествоПриход,
		|	ЛБ_ОбъектыЗалогаОбороты.ЗалоговыйБилет КАК ЗалоговыйБилет
		|ПОМЕСТИТЬ ВТ_Объекты
		|ИЗ
		|	РегистрНакопления.ЛБ_ОбъектыЗалога.Обороты(&НачалоПериода, &КонецПериода, , Ломбард = &Ломбард) КАК ЛБ_ОбъектыЗалогаОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛБ_ОбъектыЗалогаОбороты.ОбъектЗалога,
		|	ЛБ_ОбъектыЗалогаОбороты.ЗалоговыйБилет
		|
		|ИМЕЮЩИЕ
		|	СУММА(ЛБ_ОбъектыЗалогаОбороты.КоличествоПриход) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_РеквизитыОбъектаЗалога.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_РеквизитыОбъектаЗалога.Проба.Владелец КАК ПробаВладелец,
		|	ЛБ_РеквизитыОбъектаЗалога.Проба.Проба КАК ПробаПроба,
		|	ЛБ_РеквизитыОбъектаЗалога.Вес КАК Вес,
		|	ЛБ_РеквизитыОбъектаЗалога.ВесЧистый КАК ВесЧистый,
		|	ЛБ_РеквизитыОбъектаЗалога.СуммаОценкиМакс КАК СуммаОценкиМакс,
		|	ЛБ_РеквизитыОбъектаЗалога.Артикул КАК Артикул,
		|	ЛБ_РеквизитыОбъектаЗалога.ЗалоговыйБилет.НомерЗалоговогоБилета КАК ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ЛБ_РеквизитыОбъектаЗалога.ЗалоговыйБилет КАК ЗалоговыйБилет
		|ПОМЕСТИТЬ ВТ_Характеристики
		|ИЗ
		|	РегистрСведений.ЛБ_РеквизитыОбъектаЗалога КАК ЛБ_РеквизитыОбъектаЗалога
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Характеристики.ПробаВладелец.Наименование КАК ПробаВладелец,
		|	ВТ_Характеристики.ПробаПроба КАК ПробаПроба,
		|	СУММА(ВТ_Объекты.КоличествоПриход) КАК КоличествоПриход,
		|	СУММА(ВТ_Характеристики.Вес) КАК Вес,
		|	СУММА(ВТ_Характеристики.ВесЧистый) КАК МассаЛигатуры,
		|	СУММА(ВТ_Характеристики.СуммаОценкиМакс) КАК СуммаОценкиМакс,
		|	СУММА(ВТ_Характеристики.ВесЧистый * (ВТ_Характеристики.ПробаПроба / 10 / 100)) КАК МассаХим,
		|	ВТ_Объекты.ОбъектЗалога КАК ОбъектЗалога,
		|	ВТ_Характеристики.Артикул КАК Артикул,
		|	ВТ_Характеристики.ЗалоговыйБилетНомерЗалоговогоБилета КАК ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_Объекты.ЗалоговыйБилет КАК ЗалоговыйБилет
		|ПОМЕСТИТЬ ВТ_ИтогОбъекты
		|ИЗ
		|	ВТ_Объекты КАК ВТ_Объекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Характеристики КАК ВТ_Характеристики
		|		ПО ВТ_Объекты.ОбъектЗалога = ВТ_Характеристики.ОбъектЗалога
		|			И ВТ_Объекты.ЗалоговыйБилет = ВТ_Характеристики.ЗалоговыйБилет
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Характеристики.ПробаПроба,
		|	ВТ_Объекты.ОбъектЗалога,
		|	ВТ_Характеристики.Артикул,
		|	ВТ_Характеристики.ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_Объекты.ЗалоговыйБилет,
		|	ВТ_Характеристики.ПробаВладелец.Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ВставкиОбъектаЗалога.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ВставкиОбъектаЗалога.ВидВставки КАК ВидВставки,
		|	ВЫБОР
		|		КОГДА ЛБ_ВставкиОбъектаЗалога.Вес <> 0
		|			ТОГДА ЛБ_ВставкиОбъектаЗалога.Вес
		|		ИНАЧЕ ЛБ_ВставкиОбъектаЗалога.ВесГраммы
		|	КОНЕЦ КАК Вес,
		|	ЛБ_ВставкиОбъектаЗалога.СуммаОценки КАК СуммаОценки,
		|	ЛБ_ВставкиОбъектаЗалога.ЗалоговыйБилет.НомерЗалоговогоБилета КАК ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ЛБ_ВставкиОбъектаЗалога.ЗалоговыйБилет КАК ЗалоговыйБилет,
		|	ЛБ_ВставкиОбъектаЗалога.Количество КАК КоличествоКамней
		|ПОМЕСТИТЬ ВТ_Вставки
		|ИЗ
		|	РегистрСведений.ЛБ_ВставкиОбъектаЗалога КАК ЛБ_ВставкиОбъектаЗалога
		|ГДЕ
		|	ЛБ_ВставкиОбъектаЗалога.ВидВставки.ВидКамня В(&ВидКамня)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Вставки.ВидВставки КАК ВидВставки,
		|	ВТ_Объекты.КоличествоПриход КАК КоличествоПриход,
		|	ВТ_Вставки.Вес КАК Вес,
		|	СУММА(ВТ_Вставки.СуммаОценки) КАК СуммаОценки,
		|	ВТ_Вставки.ЗалоговыйБилетНомерЗалоговогоБилета КАК ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_Объекты.ОбъектЗалога КАК ОбъектЗалога,
		|	ВТ_Объекты.ЗалоговыйБилет КАК ЗалоговыйБилет,
		|	СУММА(ВТ_Вставки.КоличествоКамней) КАК КоличествоКамней
		|ПОМЕСТИТЬ ВТ_ИтогКамни
		|ИЗ
		|	ВТ_Объекты КАК ВТ_Объекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Вставки КАК ВТ_Вставки
		|		ПО ВТ_Объекты.ОбъектЗалога = ВТ_Вставки.ОбъектЗалога
		|			И ВТ_Объекты.ЗалоговыйБилет = ВТ_Вставки.ЗалоговыйБилет
		|ГДЕ
		|	НЕ ВТ_Вставки.ВидВставки ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Вставки.ВидВставки,
		|	ВТ_Вставки.ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_Объекты.ОбъектЗалога,
		|	ВТ_Объекты.ЗалоговыйБилет,
		|	ВТ_Объекты.КоличествоПриход,
		|	ВТ_Вставки.Вес
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.Проба.Владелец.Наименование КАК ПробаВладелец,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.Проба.Проба КАК ПробаПроба,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.ВесЧистый КАК ВесЧистый,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.СуммаОценки КАК СуммаОценки,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.ЗалоговыйБилет.НомерЗалоговогоБилета КАК ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.ЗалоговыйБилет КАК ЗалоговыйБилет
		|ПОМЕСТИТЬ ВТ_ДопМеталлы
		|ИЗ
		|	РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога КАК ЛБ_ДополнительныеМатериалыОбъектаЗалога
		|ГДЕ
		|	НЕ ЛБ_ДополнительныеМатериалыОбъектаЗалога.Проба.Владелец ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДопМеталлы.ПробаВладелец КАК ПробаВладелецМеталл,
		|	ВТ_ДопМеталлы.ПробаПроба КАК ПробаПробаМеталл,
		|	СУММА(ВТ_ДопМеталлы.ВесЧистый) КАК МассаЛигатуры,
		|	СУММА(ВТ_ДопМеталлы.ВесЧистый * (ВТ_ДопМеталлы.ПробаПроба / 10 / 100)) КАК МассаХим,
		|	СУММА(ВТ_ДопМеталлы.СуммаОценки) КАК СуммаОценки,
		|	ВТ_ДопМеталлы.ЗалоговыйБилетНомерЗалоговогоБилета КАК ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_ИтогОбъекты.ОбъектЗалога КАК ОбъектЗалога,
		|	ВТ_ИтогОбъекты.ПробаВладелец КАК ПробаВладелецОбъект,
		|	ВТ_ИтогОбъекты.ПробаПроба КАК ПробаПробаОбъект,
		|	ВТ_ИтогОбъекты.ЗалоговыйБилет КАК ЗалоговыйБилет
		|ПОМЕСТИТЬ ВТ_ИтогДопМеталлы
		|ИЗ
		|	ВТ_ИтогОбъекты КАК ВТ_ИтогОбъекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДопМеталлы КАК ВТ_ДопМеталлы
		|		ПО ВТ_ИтогОбъекты.ОбъектЗалога = ВТ_ДопМеталлы.ОбъектЗалога
		|			И ВТ_ИтогОбъекты.ЗалоговыйБилет = ВТ_ДопМеталлы.ЗалоговыйБилет
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДопМеталлы.ПробаВладелец,
		|	ВТ_ДопМеталлы.ПробаПроба,
		|	ВТ_ДопМеталлы.ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_ИтогОбъекты.ОбъектЗалога,
		|	ВТ_ИтогОбъекты.ПробаВладелец,
		|	ВТ_ИтогОбъекты.ПробаПроба,
		|	ВТ_ИтогОбъекты.ЗалоговыйБилет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИтогОбъекты.Артикул КАК Артикул,
		|	ВТ_ИтогОбъекты.ПробаВладелец КАК ПробаВладелец,
		|	ВТ_ИтогОбъекты.ПробаПроба КАК ПробаПроба,
		|	ВТ_ИтогОбъекты.КоличествоПриход КАК КоличествоПриход,
		|	ВТ_ИтогОбъекты.Вес КАК Вес,
		|	ВТ_ИтогОбъекты.МассаЛигатуры КАК МассаЛигатуры,
		|	ВТ_ИтогОбъекты.МассаХим КАК МассаХим,
		|	ЕСТЬNULL(ВТ_ИтогОбъекты.СуммаОценкиМакс, 0) - СУММА(ЕСТЬNULL(ВТ_ИтогКамни.СуммаОценки, 0)) - ЕСТЬNULL(ВТ_ИтогДопМеталлы.СуммаОценки, 0) КАК СуммаОценкиМакс,
		|	"""" КАК ВидВставки,
		|	ВТ_ИтогОбъекты.ЗалоговыйБилетНомерЗалоговогоБилета КАК ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_ИтогОбъекты.ОбъектЗалога КАК ОбъектЗалога,
		|	"""" КАК ПробаВладелецМеталл,
		|	"""" КАК ПробаПробаМеталл,
		|	СУММА(0) КАК КоличествоКамней
		|ИЗ
		|	ВТ_ИтогОбъекты КАК ВТ_ИтогОбъекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтогКамни КАК ВТ_ИтогКамни
		|		ПО ВТ_ИтогОбъекты.ОбъектЗалога = ВТ_ИтогКамни.ОбъектЗалога
		|			И ВТ_ИтогОбъекты.ЗалоговыйБилет = ВТ_ИтогКамни.ЗалоговыйБилет
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтогДопМеталлы КАК ВТ_ИтогДопМеталлы
		|		ПО ВТ_ИтогОбъекты.ОбъектЗалога = ВТ_ИтогДопМеталлы.ОбъектЗалога
		|			И ВТ_ИтогОбъекты.ЗалоговыйБилет = ВТ_ИтогДопМеталлы.ЗалоговыйБилет
		|			И ВТ_ИтогОбъекты.ПробаВладелец <> ВТ_ИтогДопМеталлы.ПробаВладелецМеталл
		|			И ВТ_ИтогОбъекты.ПробаПроба <> ВТ_ИтогДопМеталлы.ПробаПробаМеталл
		|ГДЕ
		|	НЕ ВТ_ИтогОбъекты.ПробаВладелец ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИтогОбъекты.ПробаПроба,
		|	ВТ_ИтогОбъекты.ПробаВладелец,
		|	ВТ_ИтогОбъекты.Артикул,
		|	ВТ_ИтогОбъекты.ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_ИтогОбъекты.ОбъектЗалога,
		|	ВТ_ИтогОбъекты.КоличествоПриход,
		|	ВТ_ИтогОбъекты.Вес,
		|	ВТ_ИтогОбъекты.МассаЛигатуры,
		|	ВТ_ИтогОбъекты.МассаХим,
		|	ВТ_ИтогОбъекты.СуммаОценкиМакс,
		|	ВТ_ИтогДопМеталлы.СуммаОценки
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	""Вставка"",
		|	"""",
		|	"""",
		|	СУММА(0),
		|	СУММА(ВТ_ИтогКамни.Вес),
		|	СУММА(0),
		|	СУММА(0),
		|	ВТ_ИтогКамни.СуммаОценки,
		|	ВТ_ИтогКамни.ВидВставки,
		|	ВТ_ИтогКамни.ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_ИтогКамни.ОбъектЗалога,
		|	"""",
		|	"""",
		|	СУММА(ВТ_ИтогКамни.КоличествоКамней)
		|ИЗ
		|	ВТ_ИтогКамни КАК ВТ_ИтогКамни
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИтогКамни.ВидВставки,
		|	ВТ_ИтогКамни.СуммаОценки,
		|	ВТ_ИтогКамни.ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_ИтогКамни.ОбъектЗалога
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	""Вставка"",
		|	ВТ_ИтогДопМеталлы.ПробаВладелецОбъект,
		|	ВТ_ИтогДопМеталлы.ПробаПробаОбъект,
		|	СУММА(0),
		|	СУММА(0),
		|	СУММА(ВТ_ИтогДопМеталлы.МассаЛигатуры),
		|	СУММА(ВТ_ИтогДопМеталлы.МассаХим),
		|	СУММА(ВТ_ИтогДопМеталлы.СуммаОценки),
		|	"""",
		|	ВТ_ИтогДопМеталлы.ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_ИтогДопМеталлы.ОбъектЗалога,
		|	ВТ_ИтогДопМеталлы.ПробаВладелецМеталл,
		|	ВТ_ИтогДопМеталлы.ПробаПробаМеталл,
		|	СУММА(0)
		|ИЗ
		|	ВТ_ИтогДопМеталлы КАК ВТ_ИтогДопМеталлы
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИтогДопМеталлы.ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_ИтогДопМеталлы.ОбъектЗалога,
		|	ВТ_ИтогДопМеталлы.ПробаВладелецОбъект,
		|	ВТ_ИтогДопМеталлы.ПробаПробаОбъект,
		|	ВТ_ИтогДопМеталлы.ПробаВладелецМеталл,
		|	ВТ_ИтогДопМеталлы.ПробаПробаМеталл
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВидВставки,
		|	Артикул";
	
	Запрос.УстановитьПараметр("ВидКамня", ВидыКамней);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("Ломбард", ПараметрыОтчета.Ломбард);
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.НачалоПериода);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ИтогоПриходОбщаяМасса = 0;
	ИтогоПриходМассаЛигатуры = 0;
	ИтогоПриходМассаХим = 0;
	ИтогоПриходВесДК = 0;
	ИтогоПриходКоличество = 0;
	ИтогоПриходСтоимость = 0;
	НомерПП = 1;
	ШапкаПриход = Ложь;
	//+МАН 01.12.25 Добавлено количество камней
	ИтогоПриходКоличествоКамней = 0;
	//-МАН
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ШапкаПриход Тогда 
			Если НачалоДня(ПараметрыОтчета.НачалоПериода) = НачалоДня(ПараметрыОтчета.КонецПериода) Тогда
				ОбластьШапкаПриход.Параметры.Период = Формат(ПараметрыОтчета.НачалоПериода, "ДЛФ=DD");
			Иначе
				ОбластьШапкаПриход.Параметры.Период = Формат(ПараметрыОтчета.НачалоПериода, "ДЛФ=DD") + "-" + Формат(ПараметрыОтчета.КонецПериода, "ДЛФ=DD");
			КонецЕсли;
			ТабличныйДокумент.Вывести(ОбластьШапкаПриход);
			ШапкаПриход = Истина;
		КонецЕсли;
		
		Если Выборка.Артикул = "Вставка" И ЗначениеЗаполнено(Выборка.ВидВставки) Тогда
			ОбластьВставкаБриллиантПриход.Параметры.Проба = Выборка.ВидВставки;
			ОбластьВставкаБриллиантПриход.Параметры.ВесДК = Выборка.Вес;
			ИтогоПриходВесДК = ИтогоПриходВесДК + Выборка.Вес;
			ОбластьВставкаБриллиантПриход.Параметры.Количество = Выборка.КоличествоПриход;
			ИтогоПриходКоличество = ИтогоПриходКоличество + Выборка.КоличествоПриход;
			ОбластьВставкаБриллиантПриход.Параметры.Стоимость = Выборка.СуммаОценкиМакс;
			ИтогоПриходСтоимость = ИтогоПриходСтоимость + Выборка.СуммаОценкиМакс;
			//+МАН 01.12.25 Добавлено количество камней
			ИтогоПриходКоличествоКамней = ИтогоПриходКоличествоКамней + Выборка.КоличествоКамней;
			ОбластьВставкаБриллиантПриход.Параметры.КоличествоДК = Выборка.КоличествоКамней;
			//-МАН
			ТабличныйДокумент.Вывести(ОбластьВставкаБриллиантПриход);
		ИначеЕсли Выборка.Артикул = "Вставка" И Не ЗначениеЗаполнено(Выборка.ВидВставки) Тогда
			ПробаОбъект = Строка(Выборка.ПробаВладелец) + Строка(Выборка.ПробаПроба);
			ПробаМеталл = Строка(Выборка.ПробаВладелецМеталл) + Строка(Выборка.ПробаПробаМеталл);
			Если ПробаОбъект <> ПробаМеталл Тогда
			ОбластьВставкаПриход.Параметры.Проба = Строка(Выборка.ПробаВладелецМеталл) + " " + Строка(Выборка.ПробаПробаМеталл);
			ОбластьВставкаПриход.Параметры.МассаЛигатуры = Выборка.МассаЛигатуры;
			ИтогоПриходМассаЛигатуры = ИтогоПриходМассаЛигатуры + Выборка.МассаЛигатуры;
			ОбластьВставкаПриход.Параметры.МассаХим = Выборка.МассаХим;
			ИтогоПриходМассаХим = ИтогоПриходМассаХим + Выборка.МассаХим;
			ОбластьВставкаПриход.Параметры.ВесДК = "";
			ОбластьВставкаПриход.Параметры.Стоимость = Выборка.СуммаОценкиМакс;
			ИтогоПриходСтоимость = ИтогоПриходСтоимость + Выборка.СуммаОценкиМакс;
			//+МАН 01.12.25 Добавлено количество камней
			ОбластьВставкаПриход.Параметры.КоличествоДК = "";
			//-МАН
			ТабличныйДокумент.Вывести(ОбластьВставкаПриход);
			КонецЕсли;
		Иначе
			
			
		ОбластьПриход.Параметры.НомерПП = НомерПП;
		НомерПП = НомерПП + 1;
		ОбластьПриход.Параметры.Наименование = Выборка.ОбъектЗалога;
		ОбластьПриход.Параметры.НомерЗБ = Выборка.Артикул;
		ОбластьПриход.Параметры.Проба = Строка(Выборка.ПробаВладелец) + " " + Строка(Выборка.ПробаПроба);
		ОбластьПриход.Параметры.ОбщаяМасса = Выборка.Вес * Выборка.КоличествоПриход;
		ИтогоПриходОбщаяМасса = ИтогоПриходОбщаяМасса + (Выборка.Вес * Выборка.КоличествоПриход);
		ОбластьПриход.Параметры.МассаЛигатуры = Выборка.МассаЛигатуры * Выборка.КоличествоПриход;
		ИтогоПриходМассаЛигатуры = ИтогоПриходМассаЛигатуры + (Выборка.МассаЛигатуры * Выборка.КоличествоПриход);
		ОбластьПриход.Параметры.МассаХим = Выборка.МассаХим * Выборка.КоличествоПриход;
		ИтогоПриходМассаХим = ИтогоПриходМассаХим + (Выборка.МассаХим * Выборка.КоличествоПриход);
		ОбластьПриход.Параметры.ВесДК = "";
		ОбластьПриход.Параметры.Количество = Выборка.КоличествоПриход;
		ИтогоПриходКоличество = ИтогоПриходКоличество + Выборка.КоличествоПриход;
		ОбластьПриход.Параметры.Стоимость = Выборка.СуммаОценкиМакс * Выборка.КоличествоПриход;
		ИтогоПриходСтоимость = ИтогоПриходСтоимость + (Выборка.СуммаОценкиМакс * Выборка.КоличествоПриход);
		//+МАН 01.12.25 Добавлено количество камней
		ОбластьПриход.Параметры.КоличествоДК = "";
		//-МАН
		ТабличныйДокумент.Вывести(ОбластьПриход);
		КонецЕсли;
	
	КонецЦикла;
	
	Если ИтогоПриходКоличество > 0 Тогда	
		Если НачалоДня(ПараметрыОтчета.НачалоПериода) = НачалоДня(ПараметрыОтчета.КонецПериода) Тогда
			ОбластьИтогоПриход.Параметры.Период = Формат(ПараметрыОтчета.НачалоПериода, "ДЛФ=DD");
		Иначе
			ОбластьИтогоПриход.Параметры.Период = Формат(ПараметрыОтчета.НачалоПериода, "ДЛФ=DD") + "-" + Формат(ПараметрыОтчета.КонецПериода, "ДЛФ=DD");
		КонецЕсли;
		ОбластьИтогоПриход.Параметры.ИтогоОбщаяМасса = ИтогоПриходОбщаяМасса;
		ОбластьИтогоПриход.Параметры.ИтогоМассаЛигатуры = ИтогоПриходМассаЛигатуры;
		ОбластьИтогоПриход.Параметры.ИтогоМассаХим = ИтогоПриходМассаХим;
		ОбластьИтогоПриход.Параметры.ИтогоВесДК = ИтогоПриходВесДК;
		ОбластьИтогоПриход.Параметры.ИтогоКоличество = ИтогоПриходКоличество;
		ОбластьИтогоПриход.Параметры.ИтогоСтоимость = ИтогоПриходСтоимость;
		//+МАН 01.12.25 Добавлено количество камней
		ОбластьИтогоПриход.Параметры.ИтогоКоличествоДК = ИтогоПриходКоличествоКамней;
		//-МАН
		ТабличныйДокумент.Вывести(ОбластьИтогоПриход);
	КонецЕсли;
	
	//Расход
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОбъектыЗалогаОбороты.ОбъектЗалога КАК ОбъектЗалога,
		|	СУММА(ЛБ_ОбъектыЗалогаОбороты.КоличествоРасход) КАК КоличествоРасход,
		|	ЛБ_ОбъектыЗалогаОбороты.ЗалоговыйБилет КАК ЗалоговыйБилет
		|ПОМЕСТИТЬ ВТ_Объекты_БезНакладных
		|ИЗ
		|	РегистрНакопления.ЛБ_ОбъектыЗалога.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Ломбард = &Ломбард) КАК ЛБ_ОбъектыЗалогаОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛБ_ОбъектыЗалогаОбороты.ЗалоговыйБилет,
		|	ЛБ_ОбъектыЗалогаОбороты.ОбъектЗалога
		|
		|ИМЕЮЩИЕ
		|	СУММА(ЛБ_ОбъектыЗалогаОбороты.КоличествоРасход) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ОбъектыЗалогаОбороты.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ОбъектыЗалогаОбороты.ЗалоговыйБилет КАК ЗалоговыйБилет,
		|	ЛБ_ОбъектыЗалогаОбороты.Регистратор.НакладнаяНаОтгрузку.ПредставлениеНомераНакладной КАК РегистраторНакладнаяНаОтгрузкуНомер
		|ПОМЕСТИТЬ ВТ_Объекты_НомераНакладных
		|ИЗ
		|	РегистрНакопления.ЛБ_ОбъектыЗалога.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Ломбард = &Ломбард) КАК ЛБ_ОбъектыЗалогаОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛБ_ОбъектыЗалогаОбороты.ЗалоговыйБилет,
		|	ЛБ_ОбъектыЗалогаОбороты.Регистратор.НакладнаяНаОтгрузку.ПредставлениеНомераНакладной,
		|	ЛБ_ОбъектыЗалогаОбороты.ОбъектЗалога
		|
		|ИМЕЮЩИЕ
		|	СУММА(ЛБ_ОбъектыЗалогаОбороты.КоличествоРасход) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Объекты_БезНакладных.ОбъектЗалога КАК ОбъектЗалога,
		|	ВТ_Объекты_БезНакладных.КоличествоРасход КАК КоличествоРасход,
		|	ВТ_Объекты_БезНакладных.ЗалоговыйБилет КАК ЗалоговыйБилет,
		|	ВТ_Объекты_НомераНакладных.РегистраторНакладнаяНаОтгрузкуНомер КАК РегистраторНакладнаяНаОтгрузкуНомер
		|ПОМЕСТИТЬ ВТ_Объекты
		|ИЗ
		|	ВТ_Объекты_БезНакладных КАК ВТ_Объекты_БезНакладных
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Объекты_НомераНакладных КАК ВТ_Объекты_НомераНакладных
		|		ПО (ВТ_Объекты_НомераНакладных.ОбъектЗалога = ВТ_Объекты_БезНакладных.ОбъектЗалога)
		|			И (ВТ_Объекты_НомераНакладных.ЗалоговыйБилет = ВТ_Объекты_БезНакладных.ЗалоговыйБилет)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_РеквизитыОбъектаЗалога.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_РеквизитыОбъектаЗалога.Проба.Владелец КАК ПробаВладелец,
		|	ЛБ_РеквизитыОбъектаЗалога.Проба.Проба КАК ПробаПроба,
		|	ЛБ_РеквизитыОбъектаЗалога.Вес КАК Вес,
		|	ЛБ_РеквизитыОбъектаЗалога.ВесЧистый КАК ВесЧистый,
		|	ЛБ_РеквизитыОбъектаЗалога.СуммаОценкиМакс КАК СуммаОценкиМакс,
		|	ЛБ_РеквизитыОбъектаЗалога.Артикул КАК Артикул,
		|	ЛБ_РеквизитыОбъектаЗалога.ЗалоговыйБилет.НомерЗалоговогоБилета КАК ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ЛБ_РеквизитыОбъектаЗалога.ЗалоговыйБилет КАК ЗалоговыйБилет
		|ПОМЕСТИТЬ ВТ_Характеристики
		|ИЗ
		|	РегистрСведений.ЛБ_РеквизитыОбъектаЗалога КАК ЛБ_РеквизитыОбъектаЗалога
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Характеристики.ПробаВладелец.Наименование КАК ПробаВладелец,
		|	ВТ_Характеристики.ПробаПроба КАК ПробаПроба,
		|	СУММА(ВТ_Объекты.КоличествоРасход) КАК КоличествоРасход,
		|	СУММА(ВТ_Характеристики.Вес) КАК Вес,
		|	СУММА(ВТ_Характеристики.ВесЧистый) КАК МассаЛигатуры,
		|	СУММА(ВТ_Характеристики.СуммаОценкиМакс) КАК СуммаОценкиМакс,
		|	СУММА(ВТ_Характеристики.ВесЧистый * (ВТ_Характеристики.ПробаПроба / 10 / 100)) КАК МассаХим,
		|	ВТ_Объекты.ОбъектЗалога КАК ОбъектЗалога,
		|	ВТ_Характеристики.Артикул КАК Артикул,
		|	ВТ_Характеристики.ЗалоговыйБилетНомерЗалоговогоБилета КАК ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_Объекты.ЗалоговыйБилет КАК ЗалоговыйБилет,
		|	ВТ_Объекты.РегистраторНакладнаяНаОтгрузкуНомер КАК РегистраторНакладнаяНаОтгрузкуНомер
		|ПОМЕСТИТЬ ВТ_ИтогОбъекты
		|ИЗ
		|	ВТ_Объекты КАК ВТ_Объекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Характеристики КАК ВТ_Характеристики
		|		ПО ВТ_Объекты.ОбъектЗалога = ВТ_Характеристики.ОбъектЗалога
		|			И ВТ_Объекты.ЗалоговыйБилет = ВТ_Характеристики.ЗалоговыйБилет
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Характеристики.ПробаПроба,
		|	ВТ_Объекты.ОбъектЗалога,
		|	ВТ_Характеристики.Артикул,
		|	ВТ_Характеристики.ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_Объекты.ЗалоговыйБилет,
		|	ВТ_Объекты.РегистраторНакладнаяНаОтгрузкуНомер,
		|	ВТ_Характеристики.ПробаВладелец.Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ВставкиОбъектаЗалога.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ВставкиОбъектаЗалога.ВидВставки КАК ВидВставки,
		|	ВЫБОР
		|		КОГДА ЛБ_ВставкиОбъектаЗалога.Вес <> 0
		|			ТОГДА ЛБ_ВставкиОбъектаЗалога.Вес
		|		ИНАЧЕ ЛБ_ВставкиОбъектаЗалога.ВесГраммы
		|	КОНЕЦ КАК Вес,
		|	ЛБ_ВставкиОбъектаЗалога.СуммаОценки КАК СуммаОценки,
		|	ЛБ_ВставкиОбъектаЗалога.ЗалоговыйБилет.НомерЗалоговогоБилета КАК ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ЛБ_ВставкиОбъектаЗалога.ЗалоговыйБилет КАК ЗалоговыйБилет,
		|	ЛБ_ВставкиОбъектаЗалога.Количество КАК КоличествоКамней
		|ПОМЕСТИТЬ ВТ_Вставки
		|ИЗ
		|	РегистрСведений.ЛБ_ВставкиОбъектаЗалога КАК ЛБ_ВставкиОбъектаЗалога
		|ГДЕ
		|	ЛБ_ВставкиОбъектаЗалога.ВидВставки.ВидКамня В(&ВидКамня)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Вставки.ВидВставки КАК ВидВставки,
		|	СУММА(ВТ_Объекты.КоличествоРасход) КАК КоличествоРасход,
		|	СУММА(ВТ_Вставки.Вес) КАК Вес,
		|	СУММА(ВТ_Вставки.СуммаОценки) КАК СуммаОценки,
		|	ВТ_Вставки.ЗалоговыйБилетНомерЗалоговогоБилета КАК ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_Объекты.ОбъектЗалога КАК ОбъектЗалога,
		|	ВТ_Объекты.ЗалоговыйБилет КАК ЗалоговыйБилет,
		|	СУММА(ВТ_Вставки.КоличествоКамней) КАК КоличествоКамней
		|ПОМЕСТИТЬ ВТ_ИтогКамни
		|ИЗ
		|	ВТ_Объекты КАК ВТ_Объекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Вставки КАК ВТ_Вставки
		|		ПО ВТ_Объекты.ОбъектЗалога = ВТ_Вставки.ОбъектЗалога
		|			И ВТ_Объекты.ЗалоговыйБилет = ВТ_Вставки.ЗалоговыйБилет
		|ГДЕ
		|	НЕ ВТ_Вставки.ВидВставки ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Вставки.ВидВставки,
		|	ВТ_Вставки.ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_Объекты.ОбъектЗалога,
		|	ВТ_Объекты.ЗалоговыйБилет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.Проба.Владелец.Наименование КАК ПробаВладелец,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.Проба.Проба КАК ПробаПроба,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.ВесЧистый КАК ВесЧистый,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.СуммаОценки КАК СуммаОценки,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.ЗалоговыйБилет.НомерЗалоговогоБилета КАК ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.ЗалоговыйБилет КАК ЗалоговыйБилет
		|ПОМЕСТИТЬ ВТ_ДопМеталлы
		|ИЗ
		|	РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога КАК ЛБ_ДополнительныеМатериалыОбъектаЗалога
		|ГДЕ
		|	НЕ ЛБ_ДополнительныеМатериалыОбъектаЗалога.Проба.Владелец ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДопМеталлы.ПробаВладелец КАК ПробаВладелецМеталл,
		|	ВТ_ДопМеталлы.ПробаПроба КАК ПробаПробаМеталл,
		|	СУММА(ВТ_ДопМеталлы.ВесЧистый) КАК МассаЛигатуры,
		|	СУММА(ВТ_ДопМеталлы.ВесЧистый * (ВТ_ДопМеталлы.ПробаПроба / 10 / 100)) КАК МассаХим,
		|	СУММА(ВТ_ДопМеталлы.СуммаОценки) КАК СуммаОценки,
		|	ВТ_ДопМеталлы.ЗалоговыйБилетНомерЗалоговогоБилета КАК ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_ИтогОбъекты.ОбъектЗалога КАК ОбъектЗалога,
		|	ВТ_ИтогОбъекты.РегистраторНакладнаяНаОтгрузкуНомер КАК РегистраторНакладнаяНаОтгрузкуНомер,
		|	ВТ_ИтогОбъекты.ПробаВладелец КАК ПробаВладелецОбъект,
		|	ВТ_ИтогОбъекты.ПробаПроба КАК ПробаПробаОбъект,
		|	ВТ_ИтогОбъекты.ЗалоговыйБилет КАК ЗалоговыйБилет
		|ПОМЕСТИТЬ ВТ_ИтогДопМеталлы
		|ИЗ
		|	ВТ_ИтогОбъекты КАК ВТ_ИтогОбъекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДопМеталлы КАК ВТ_ДопМеталлы
		|		ПО ВТ_ИтогОбъекты.ОбъектЗалога = ВТ_ДопМеталлы.ОбъектЗалога
		|			И ВТ_ИтогОбъекты.ЗалоговыйБилет = ВТ_ДопМеталлы.ЗалоговыйБилет
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДопМеталлы.ПробаВладелец,
		|	ВТ_ДопМеталлы.ПробаПроба,
		|	ВТ_ДопМеталлы.ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_ИтогОбъекты.ОбъектЗалога,
		|	ВТ_ИтогОбъекты.РегистраторНакладнаяНаОтгрузкуНомер,
		|	ВТ_ИтогОбъекты.ПробаВладелец,
		|	ВТ_ИтогОбъекты.ПробаПроба,
		|	ВТ_ИтогОбъекты.ЗалоговыйБилет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИтогОбъекты.Артикул КАК Артикул,
		|	ВТ_ИтогОбъекты.ПробаВладелец КАК ПробаВладелец,
		|	ВТ_ИтогОбъекты.ПробаПроба КАК ПробаПроба,
		|	СУММА(ВТ_ИтогОбъекты.КоличествоРасход) КАК КоличествоРасход,
		|	СУММА(ВТ_ИтогОбъекты.Вес) КАК Вес,
		|	СУММА(ВТ_ИтогОбъекты.МассаЛигатуры) КАК МассаЛигатуры,
		|	СУММА(ВТ_ИтогОбъекты.МассаХим) КАК МассаХим,
		|	СУММА(ЕСТЬNULL(ВТ_ИтогОбъекты.СуммаОценкиМакс, 0) - ЕСТЬNULL(ВТ_ИтогКамни.СуммаОценки, 0) - ЕСТЬNULL(ВТ_ИтогДопМеталлы.СуммаОценки, 0)) КАК СуммаОценкиМакс,
		|	"""" КАК ВидВставки,
		|	ВТ_ИтогОбъекты.ЗалоговыйБилетНомерЗалоговогоБилета КАК ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_ИтогОбъекты.ОбъектЗалога КАК ОбъектЗалога,
		|	ЕСТЬNULL(ВТ_ИтогОбъекты.РегистраторНакладнаяНаОтгрузкуНомер, """") КАК РегистраторНакладнаяНаОтгрузкуНомер,
		|	"""" КАК ПробаВладелецМеталл,
		|	"""" КАК ПробаПробаМеталл,
		|	СУММА(0) КАК КоличествоКамней
		|ИЗ
		|	ВТ_ИтогОбъекты КАК ВТ_ИтогОбъекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтогКамни КАК ВТ_ИтогКамни
		|		ПО ВТ_ИтогОбъекты.ОбъектЗалога = ВТ_ИтогКамни.ОбъектЗалога
		|			И ВТ_ИтогОбъекты.ЗалоговыйБилет = ВТ_ИтогКамни.ЗалоговыйБилет
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтогДопМеталлы КАК ВТ_ИтогДопМеталлы
		|		ПО ВТ_ИтогОбъекты.ОбъектЗалога = ВТ_ИтогДопМеталлы.ОбъектЗалога
		|			И ВТ_ИтогОбъекты.ЗалоговыйБилет = ВТ_ИтогДопМеталлы.ЗалоговыйБилет
		|			И ВТ_ИтогОбъекты.ПробаВладелец <> ВТ_ИтогДопМеталлы.ПробаВладелецМеталл
		|			И ВТ_ИтогОбъекты.ПробаПроба <> ВТ_ИтогДопМеталлы.ПробаПробаМеталл
		|ГДЕ
		|	НЕ ВТ_ИтогОбъекты.ПробаВладелец ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИтогОбъекты.ПробаПроба,
		|	ВТ_ИтогОбъекты.ПробаВладелец,
		|	ВТ_ИтогОбъекты.Артикул,
		|	ВТ_ИтогОбъекты.ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_ИтогОбъекты.ОбъектЗалога,
		|	ЕСТЬNULL(ВТ_ИтогОбъекты.РегистраторНакладнаяНаОтгрузкуНомер, """")
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	""Вставка"",
		|	"""",
		|	"""",
		|	СУММА(0),
		|	СУММА(ВТ_ИтогКамни.Вес),
		|	СУММА(0),
		|	СУММА(0),
		|	ВТ_ИтогКамни.СуммаОценки,
		|	ВТ_ИтогКамни.ВидВставки,
		|	ВТ_ИтогКамни.ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_ИтогКамни.ОбъектЗалога,
		|	"""",
		|	"""",
		|	"""",
		|	СУММА(ВТ_ИтогКамни.КоличествоКамней)
		|ИЗ
		|	ВТ_ИтогКамни КАК ВТ_ИтогКамни
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИтогКамни.ВидВставки,
		|	ВТ_ИтогКамни.СуммаОценки,
		|	ВТ_ИтогКамни.ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_ИтогКамни.ОбъектЗалога
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	""Вставка"",
		|	ВТ_ИтогДопМеталлы.ПробаВладелецОбъект,
		|	ВТ_ИтогДопМеталлы.ПробаПробаОбъект,
		|	СУММА(0),
		|	СУММА(0),
		|	СУММА(ВТ_ИтогДопМеталлы.МассаЛигатуры),
		|	СУММА(ВТ_ИтогДопМеталлы.МассаХим),
		|	СУММА(ВТ_ИтогДопМеталлы.СуммаОценки),
		|	"""",
		|	ВТ_ИтогДопМеталлы.ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_ИтогДопМеталлы.ОбъектЗалога,
		|	"""",
		|	ВТ_ИтогДопМеталлы.ПробаВладелецМеталл,
		|	ВТ_ИтогДопМеталлы.ПробаПробаМеталл,
		|	СУММА(0)
		|ИЗ
		|	ВТ_ИтогДопМеталлы КАК ВТ_ИтогДопМеталлы
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИтогДопМеталлы.ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВТ_ИтогДопМеталлы.ОбъектЗалога,
		|	ВТ_ИтогДопМеталлы.ПробаВладелецМеталл,
		|	ВТ_ИтогДопМеталлы.ПробаПробаМеталл,
		|	ВТ_ИтогДопМеталлы.ПробаВладелецОбъект,
		|	ВТ_ИтогДопМеталлы.ПробаПробаОбъект
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗалоговыйБилетНомерЗалоговогоБилета,
		|	ВидВставки,
		|	Артикул";
	
	Запрос.УстановитьПараметр("ВидКамня", ВидыКамней);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("Ломбард", ПараметрыОтчета.Ломбард);
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.НачалоПериода);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ИтогоРасходОбщаяМасса = 0;
	ИтогоРасходМассаЛигатуры = 0;
	ИтогоРасходМассаХим = 0;
	ИтогоРасходВесДК = 0;
	ИтогоРасходКоличество = 0;
	ИтогоРасходСтоимость = 0;
	НомерПП = 1;
	ШапкаРасход = Ложь;
	//+МАН 01.12.25 Добавлено количество камней
	ИтогоРасходКоличествоКамней = 0;
	//-МАН
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ШапкаРасход Тогда
			Если НачалоДня(ПараметрыОтчета.НачалоПериода) = НачалоДня(ПараметрыОтчета.КонецПериода) Тогда
				ОбластьШапкаРасход.Параметры.Период = Формат(ПараметрыОтчета.НачалоПериода, "ДЛФ=DD");
			Иначе
				ОбластьШапкаРасход.Параметры.Период = Формат(ПараметрыОтчета.НачалоПериода, "ДЛФ=DD") + "-" + Формат(ПараметрыОтчета.КонецПериода, "ДЛФ=DD");
			КонецЕсли;
			ТабличныйДокумент.Вывести(ОбластьШапкаРасход);
			ШапкаРасход = Истина;
		КонецЕсли;
		
		Если Выборка.Артикул = "Вставка" И ЗначениеЗаполнено(Выборка.ВидВставки) Тогда
			ОбластьВставкаБриллиантРасход.Параметры.Проба = Выборка.ВидВставки;
			ОбластьВставкаБриллиантРасход.Параметры.ВесДК = Выборка.Вес;
			ИтогоРасходВесДК = ИтогоРасходВесДК + Выборка.Вес;
			ОбластьВставкаБриллиантРасход.Параметры.Количество = Выборка.КоличествоРасход;
			ИтогоРасходКоличество = ИтогоРасходКоличество + Выборка.КоличествоРасход;
			ОбластьВставкаБриллиантРасход.Параметры.Стоимость = Выборка.СуммаОценкиМакс;
			ИтогоРасходСтоимость = ИтогоРасходСтоимость + Выборка.СуммаОценкиМакс;
			//+МАН 01.12.25 Добавлено количество камней
			ИтогоРасходКоличествоКамней = ИтогоРасходКоличествоКамней + Выборка.КоличествоКамней;
			ОбластьВставкаБриллиантРасход.Параметры.КоличествоДК = Выборка.КоличествоКамней;
			//-МАН
			ТабличныйДокумент.Вывести(ОбластьВставкаБриллиантРасход);
		ИначеЕсли Выборка.Артикул = "Вставка" И Не ЗначениеЗаполнено(Выборка.ВидВставки) Тогда
			ПробаОбъект = Строка(Выборка.ПробаВладелец) + Строка(Выборка.ПробаПроба);
			ПробаМеталл = Строка(Выборка.ПробаВладелецМеталл) + Строка(Выборка.ПробаПробаМеталл);
			Если ПробаОбъект <> ПробаМеталл Тогда
			ОбластьВставкаРасход.Параметры.Проба = Строка(Выборка.ПробаВладелецМеталл) + " " + Строка(Выборка.ПробаПробаМеталл);
			ОбластьВставкаРасход.Параметры.МассаЛигатуры = Выборка.МассаЛигатуры;
			ИтогоРасходМассаЛигатуры = ИтогоРасходМассаЛигатуры + Выборка.МассаЛигатуры;
			ОбластьВставкаРасход.Параметры.МассаХим = Выборка.МассаХим;
			ИтогоРасходМассаХим = ИтогоРасходМассаХим + Выборка.МассаХим;
			ОбластьВставкаРасход.Параметры.ВесДК = "";
			ОбластьВставкаРасход.Параметры.Стоимость = Выборка.СуммаОценкиМакс;
			ИтогоРасходСтоимость = ИтогоРасходСтоимость + Выборка.СуммаОценкиМакс;
			//+МАН 01.12.25 Добавлено количество камней
			ОбластьВставкаРасход.Параметры.КоличествоДК = "";
			//-МАН
			ТабличныйДокумент.Вывести(ОбластьВставкаРасход);
			КонецЕсли;
		Иначе	
		ОбластьРасход.Параметры.НомерПП = НомерПП;
		НомерПП = НомерПП + 1;
		ОбластьРасход.Параметры.Наименование = Выборка.ОбъектЗалога;
		ОбластьРасход.Параметры.НомерНакладной = Выборка.РегистраторНакладнаяНаОтгрузкуНомер;
		ОбластьРасход.Параметры.НомерЗБ = Выборка.Артикул;
		ОбластьРасход.Параметры.Проба = Строка(Выборка.ПробаВладелец) + " " + Строка(Выборка.ПробаПроба);
		ОбластьРасход.Параметры.ОбщаяМасса = Выборка.Вес * Выборка.КоличествоРасход;
		ИтогоРасходОбщаяМасса = ИтогоРасходОбщаяМасса + (Выборка.Вес * Выборка.КоличествоРасход);
		ОбластьРасход.Параметры.МассаЛигатуры = Выборка.МассаЛигатуры * Выборка.КоличествоРасход;
		ИтогоРасходМассаЛигатуры = ИтогоРасходМассаЛигатуры + (Выборка.МассаЛигатуры * Выборка.КоличествоРасход);
		ОбластьРасход.Параметры.МассаХим = Выборка.МассаХим * Выборка.КоличествоРасход;
		ИтогоРасходМассаХим = ИтогоРасходМассаХим + (Выборка.МассаХим * Выборка.КоличествоРасход);
		ОбластьРасход.Параметры.ВесДК = "";
		ОбластьРасход.Параметры.Количество = Выборка.КоличествоРасход;
		ИтогоРасходКоличество = ИтогоРасходКоличество + Выборка.КоличествоРасход;
		ОбластьРасход.Параметры.Стоимость = Выборка.СуммаОценкиМакс * Выборка.КоличествоРасход;
		ИтогоРасходСтоимость = ИтогоРасходСтоимость + (Выборка.СуммаОценкиМакс * Выборка.КоличествоРасход);
		//+МАН 01.12.25 Добавлено количество камней
		ОбластьРасход.Параметры.КоличествоДК = "";
		//-МАН
		ТабличныйДокумент.Вывести(ОбластьРасход);
		КонецЕсли;
	
	КонецЦикла;
	
	Если ИтогоРасходКоличество > 0 Тогда
		Если НачалоДня(ПараметрыОтчета.НачалоПериода) = НачалоДня(ПараметрыОтчета.КонецПериода) Тогда
			ОбластьИтогоРасход.Параметры.Период = Формат(ПараметрыОтчета.НачалоПериода, "ДЛФ=DD");
		Иначе
			ОбластьИтогоРасход.Параметры.Период = Формат(ПараметрыОтчета.НачалоПериода, "ДЛФ=DD") + "-" + Формат(ПараметрыОтчета.КонецПериода, "ДЛФ=DD");
		КонецЕсли;
		
		ОбластьИтогоРасход.Параметры.ИтогоОбщаяМасса = ИтогоРасходОбщаяМасса;
		ОбластьИтогоРасход.Параметры.ИтогоМассаЛигатуры = ИтогоРасходМассаЛигатуры;
		ОбластьИтогоРасход.Параметры.ИтогоМассаХим = ИтогоРасходМассаХим;
		ОбластьИтогоРасход.Параметры.ИтогоВесДК = ИтогоРасходВесДК;
		ОбластьИтогоРасход.Параметры.ИтогоКоличество = ИтогоРасходКоличество;
		ОбластьИтогоРасход.Параметры.ИтогоСтоимость = ИтогоРасходСтоимость;
		//+МАН 01.12.25 Добавлено количество камней
		ОбластьИтогоРасход.Параметры.ИтогоКоличествоДК = ИтогоРасходКоличествоКамней;
		//-МАН
		ТабличныйДокумент.Вывести(ОбластьИтогоРасход);
	КонецЕсли;
	
	ОбластьШапкаОстатокКонец.Параметры.КонецПериода = Формат(ПараметрыОтчета.КонецПериода, "ДЛФ=DD");
	ТабличныйДокумент.Вывести(ОбластьШапкаОстатокКонец);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ЛБ_ОбъектыЗалогаОстатки.ЗалоговыйБилет КАК ЗалоговыйБилет
		|ПОМЕСТИТЬ ВТ_Объекты
		|ИЗ
		|	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(&Период, Ломбард = &Ломбард) КАК ЛБ_ОбъектыЗалогаОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_РеквизитыОбъектаЗалога.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_РеквизитыОбъектаЗалога.Проба.Владелец КАК ПробаВладелец,
		|	ЛБ_РеквизитыОбъектаЗалога.Проба.Проба КАК ПробаПроба,
		|	ЛБ_РеквизитыОбъектаЗалога.Вес КАК Вес,
		|	ЛБ_РеквизитыОбъектаЗалога.ВесЧистый КАК ВесЧистый,
		|	ЛБ_РеквизитыОбъектаЗалога.СуммаОценкиМакс КАК СуммаОценкиМакс,
		|	ЛБ_РеквизитыОбъектаЗалога.ЗалоговыйБилет КАК ЗалоговыйБилет
		|ПОМЕСТИТЬ ВТ_Характеристики
		|ИЗ
		|	РегистрСведений.ЛБ_РеквизитыОбъектаЗалога КАК ЛБ_РеквизитыОбъектаЗалога
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Характеристики.ПробаВладелец.Наименование КАК ПробаВладелец,
		|	ВТ_Характеристики.ПробаПроба КАК ПробаПроба,
		|	СУММА(ВТ_Объекты.КоличествоОстаток) КАК КоличествоОстаток,
		|	СУММА(ВТ_Характеристики.Вес) КАК Вес,
		|	СУММА(ВТ_Характеристики.ВесЧистый) КАК МассаЛигатуры,
		|	СУММА(ВТ_Характеристики.СуммаОценкиМакс) КАК СуммаОценкиМакс,
		|	СУММА(ВТ_Характеристики.ВесЧистый * (ВТ_Характеристики.ПробаПроба / 10 / 100)) КАК МассаХим,
		|	ВТ_Объекты.ОбъектЗалога КАК ОбъектЗалога,
		|	ВТ_Объекты.ЗалоговыйБилет КАК ЗалоговыйБилет
		|ПОМЕСТИТЬ ВТ_ИтогОбъекты
		|ИЗ
		|	ВТ_Объекты КАК ВТ_Объекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Характеристики КАК ВТ_Характеристики
		|		ПО ВТ_Объекты.ОбъектЗалога = ВТ_Характеристики.ОбъектЗалога
		|			И ВТ_Объекты.ЗалоговыйБилет = ВТ_Характеристики.ЗалоговыйБилет
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Характеристики.ПробаПроба,
		|	ВТ_Объекты.ОбъектЗалога,
		|	ВТ_Объекты.ЗалоговыйБилет,
		|	ВТ_Характеристики.ПробаВладелец.Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ВставкиОбъектаЗалога.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ВставкиОбъектаЗалога.ВидВставки КАК ВидВставки,
		|	ВЫБОР
		|		КОГДА ЛБ_ВставкиОбъектаЗалога.Вес <> 0
		|			ТОГДА ЛБ_ВставкиОбъектаЗалога.Вес
		|		ИНАЧЕ ЛБ_ВставкиОбъектаЗалога.ВесГраммы
		|	КОНЕЦ КАК Вес,
		|	ЛБ_ВставкиОбъектаЗалога.СуммаОценки КАК СуммаОценки,
		|	ЛБ_ВставкиОбъектаЗалога.ЗалоговыйБилет КАК ЗалоговыйБилет,
		//+МАН 01.12.25 Добавлено количество камней
		|	ЛБ_ВставкиОбъектаЗалога.Количество КАК КоличествоКамней
		//-МАН
		|ПОМЕСТИТЬ ВТ_Вставки
		|ИЗ
		|	РегистрСведений.ЛБ_ВставкиОбъектаЗалога КАК ЛБ_ВставкиОбъектаЗалога
		|ГДЕ
		|	ЛБ_ВставкиОбъектаЗалога.ВидВставки.ВидКамня В(&ВидКамня)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Вставки.ВидВставки КАК ВидВставки,
		|	СУММА(ВТ_Объекты.КоличествоОстаток) КАК КоличествоОстаток,
		|	СУММА(ВТ_Вставки.Вес) КАК Вес,
		|	СУММА(ВТ_Вставки.СуммаОценки) КАК СуммаОценки,
		|	ВТ_Объекты.ОбъектЗалога КАК ОбъектЗалога,
		|	ВТ_Объекты.ЗалоговыйБилет КАК ЗалоговыйБилет,
		//+МАН 01.12.25 Добавлено количество камней
		|	СУММА(ВТ_Вставки.КоличествоКамней) КАК КоличествоКамней
		//-МАН
		|ПОМЕСТИТЬ ВТ_ИтогКамни
		|ИЗ
		|	ВТ_Объекты КАК ВТ_Объекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Вставки КАК ВТ_Вставки
		|		ПО ВТ_Объекты.ОбъектЗалога = ВТ_Вставки.ОбъектЗалога
		|			И ВТ_Объекты.ЗалоговыйБилет = ВТ_Вставки.ЗалоговыйБилет
		|ГДЕ
		|	НЕ ВТ_Вставки.ВидВставки ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Вставки.ВидВставки,
		|	ВТ_Объекты.ОбъектЗалога,
		|	ВТ_Объекты.ЗалоговыйБилет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.ОбъектЗалога КАК ОбъектЗалога,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.Проба.Владелец КАК ПробаВладелец,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.Проба.Проба КАК ПробаПроба,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.ВесЧистый КАК ВесЧистый,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.СуммаОценки КАК СуммаОценки,
		|	ЛБ_ДополнительныеМатериалыОбъектаЗалога.ЗалоговыйБилет КАК ЗалоговыйБилет
		|ПОМЕСТИТЬ ВТ_ДопМеталлы
		|ИЗ
		|	РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога КАК ЛБ_ДополнительныеМатериалыОбъектаЗалога
		|ГДЕ
		|	НЕ ЛБ_ДополнительныеМатериалыОбъектаЗалога.Проба.Владелец ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДопМеталлы.ПробаВладелец КАК ПробаВладелецМеталл,
		|	ВТ_ДопМеталлы.ПробаПроба КАК ПробаПробаМеталл,
		|	СУММА(ВТ_ДопМеталлы.ВесЧистый) КАК МассаЛигатуры,
		|	СУММА(ВТ_ДопМеталлы.ВесЧистый * (ВТ_ДопМеталлы.ПробаПроба / 10 / 100)) КАК МассаХим,
		|	ВТ_ДопМеталлы.СуммаОценки КАК СуммаОценки,
		|	ВТ_ИтогОбъекты.ПробаВладелец КАК ПробаВладелецОбъект,
		|	ВТ_ИтогОбъекты.ПробаПроба КАК ПробаПробаОбъект,
		|	ВТ_ИтогОбъекты.ОбъектЗалога КАК ОбъектЗалога,
		|	ВТ_ИтогОбъекты.ЗалоговыйБилет КАК ЗалоговыйБилет
		|ПОМЕСТИТЬ ВТ_ИтогДопМеталлы
		|ИЗ
		|	ВТ_ИтогОбъекты КАК ВТ_ИтогОбъекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДопМеталлы КАК ВТ_ДопМеталлы
		|		ПО ВТ_ИтогОбъекты.ОбъектЗалога = ВТ_ДопМеталлы.ОбъектЗалога
		|			И ВТ_ИтогОбъекты.ЗалоговыйБилет = ВТ_ДопМеталлы.ЗалоговыйБилет
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДопМеталлы.ПробаВладелец,
		|	ВТ_ДопМеталлы.ПробаПроба,
		|	ВТ_ДопМеталлы.СуммаОценки,
		|	ВТ_ИтогОбъекты.ПробаВладелец,
		|	ВТ_ИтогОбъекты.ПробаПроба,
		|	ВТ_ИтогОбъекты.ОбъектЗалога,
		|	ВТ_ИтогОбъекты.ЗалоговыйБилет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИтогОбъекты.ПробаВладелец КАК ПробаВладелец,
		|	ВТ_ИтогОбъекты.ПробаПроба КАК ПробаПроба,
		|	СУММА(ВТ_ИтогОбъекты.КоличествоОстаток) КАК КоличествоОстаток,
		|	СУММА(ВТ_ИтогОбъекты.Вес) КАК Вес,
		|	СУММА(ВТ_ИтогОбъекты.МассаЛигатуры) КАК МассаЛигатуры,
		|	СУММА(ВТ_ИтогОбъекты.МассаХим) КАК МассаХим,
		|	СУММА(ЕСТЬNULL(ВТ_ИтогОбъекты.СуммаОценкиМакс, 0) - ЕСТЬNULL(ВТ_ИтогКамни.СуммаОценки, 0) - ЕСТЬNULL(ВТ_ИтогДопМеталлы.СуммаОценки, 0)) КАК СуммаОценкиМакс,
		|	"""" КАК ВидВставки,
		|	"""" КАК ПробаВладелецМеталл,
		|	"""" КАК ПробаПробаМеталл,
		//+МАН 01.12.25 Добавлено количество камней
		|	СУММА(0) КАК КоличествоКамней
		//-МАН
		|ПОМЕСТИТЬ ВТ_ИТОГ
		|ИЗ
		|	ВТ_ИтогОбъекты КАК ВТ_ИтогОбъекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтогКамни КАК ВТ_ИтогКамни
		|		ПО ВТ_ИтогОбъекты.ОбъектЗалога = ВТ_ИтогКамни.ОбъектЗалога
		|			И ВТ_ИтогОбъекты.ЗалоговыйБилет = ВТ_ИтогКамни.ЗалоговыйБилет
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтогДопМеталлы КАК ВТ_ИтогДопМеталлы
		|		ПО ВТ_ИтогОбъекты.ОбъектЗалога = ВТ_ИтогДопМеталлы.ОбъектЗалога
		|			И ВТ_ИтогОбъекты.ЗалоговыйБилет = ВТ_ИтогДопМеталлы.ЗалоговыйБилет
		|			И ВТ_ИтогОбъекты.ПробаВладелец <> ВТ_ИтогДопМеталлы.ПробаВладелецМеталл
		|			И ВТ_ИтогОбъекты.ПробаПроба <> ВТ_ИтогДопМеталлы.ПробаПробаМеталл
		|ГДЕ
		|	НЕ ВТ_ИтогОбъекты.ПробаВладелец ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИтогОбъекты.ПробаПроба,
		|	ВТ_ИтогОбъекты.ПробаВладелец
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	"""",
		|	"""",
		|	СУММА(0),
		|	СУММА(ВТ_ИтогКамни.Вес),
		|	СУММА(0),
		|	СУММА(0),
		|	ВТ_ИтогКамни.СуммаОценки,
		|	ВТ_ИтогКамни.ВидВставки,
		|	"""",
		|	"""",
		//+МАН 01.12.25 Добавлено количество камней
		|	СУММА(ВТ_ИтогКамни.КоличествоКамней)
		//-МАН
		|ИЗ
		|	ВТ_ИтогКамни КАК ВТ_ИтогКамни
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИтогКамни.ВидВставки,
		|	ВТ_ИтогКамни.СуммаОценки
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_ИтогДопМеталлы.ПробаВладелецОбъект,
		|	ВТ_ИтогДопМеталлы.ПробаПробаОбъект,
		|	СУММА(0),
		|	СУММА(0),
		|	СУММА(ВТ_ИтогДопМеталлы.МассаЛигатуры),
		|	СУММА(ВТ_ИтогДопМеталлы.МассаХим),
		|	СУММА(ВТ_ИтогДопМеталлы.СуммаОценки),
		|	"""",
		|	ВТ_ИтогДопМеталлы.ПробаВладелецМеталл,
		|	ВТ_ИтогДопМеталлы.ПробаПробаМеталл,
		//+МАН 01.12.25 Добавлено количество камней
		|	СУММА(0)
		//-МАН
		|ИЗ
		|	ВТ_ИтогДопМеталлы КАК ВТ_ИтогДопМеталлы
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИтогДопМеталлы.ПробаВладелецМеталл,
		|	ВТ_ИтогДопМеталлы.ПробаПробаМеталл,
		|	ВТ_ИтогДопМеталлы.ПробаВладелецОбъект,
		|	ВТ_ИтогДопМеталлы.ПробаПробаОбъект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИТОГ.ПробаВладелец КАК ПробаВладелец,
		|	ВТ_ИТОГ.ПробаПроба КАК ПробаПроба,
		|	СУММА(ВТ_ИТОГ.КоличествоОстаток) КАК КоличествоОстаток,
		|	СУММА(ЕСТЬNULL(ВТ_ИТОГ.Вес, 0)) КАК Вес,
		|	СУММА(ВТ_ИТОГ.МассаЛигатуры) КАК МассаЛигатуры,
		|	СУММА(ВТ_ИТОГ.МассаХим) КАК МассаХим,
		|	СУММА(ВТ_ИТОГ.СуммаОценкиМакс) КАК СуммаОценкиМакс,
		|	ВТ_ИТОГ.ВидВставки КАК ВидВставки,
		|	ВТ_ИТОГ.ПробаВладелецМеталл КАК ПробаВладелецМеталл,
		|	ВТ_ИТОГ.ПробаПробаМеталл КАК ПробаПробаМеталл,
		//+МАН 01.12.25 Добавлено количество камней
		|	СУММА(ВТ_ИТОГ.КоличествоКамней) КАК КоличествоКамней
		//-МАН
		|ИЗ
		|	ВТ_ИТОГ КАК ВТ_ИТОГ
		|ГДЕ
		|	НЕ ВТ_ИТОГ.ПробаВладелецМеталл ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИТОГ.ПробаВладелец,
		|	ВТ_ИТОГ.ПробаПроба,
		|	ВТ_ИТОГ.ВидВставки,
		|	ВТ_ИТОГ.ПробаВладелецМеталл,
		|	ВТ_ИТОГ.ПробаПробаМеталл
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидВставки,
		|	ПробаВладелец,
		|	ПробаПроба";
	
	Запрос.УстановитьПараметр("ВидКамня", ВидыКамней);
	Запрос.УстановитьПараметр("Ломбард", ПараметрыОтчета.Ломбард);
	Запрос.УстановитьПараметр("Период", КонецДня(ПараметрыОтчета.КонецПериода));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ИтогоОстатокКонецОбщаяМасса = 0;
	ИтогоОстатокКонецМассаЛигатуры = 0;
	ИтогоОстатокКонецМассаХим = 0;
	ИтогоОстатокКонецВесДК = 0;
	ИтогоОстатокКонецКоличество = 0;
	ИтогоОстатокКонецСтоимость = 0;
	//+МАН 01.12.25 Добавлено количество камней
	ИтогоОстатокКонецКоличествоКамней = 0;
	//-МАН
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ПробаВладелец) Тогда	
		ПробаОбъект = Строка(Выборка.ПробаВладелец) + Строка(Выборка.ПробаПроба);
		ПробаМеталл = Строка(Выборка.ПробаВладелецМеталл) + Строка(Выборка.ПробаПробаМеталл);
		Если ПробаОбъект = ПробаМеталл Тогда
			Продолжить;
		Иначе
			Если ЗначениеЗаполнено(Выборка.ПробаВладелецМеталл) Тогда
				ОбластьОстатокКонец.Параметры.Проба = Строка(Выборка.ПробаВладелецМеталл) + " " + Строка(Выборка.ПробаПробаМеталл);
			Иначе
				ОбластьОстатокКонец.Параметры.Проба = Строка(Выборка.ПробаВладелец) + " " + Строка(Выборка.ПробаПроба);
			КонецЕсли;
		КонецЕсли;
		ОбластьОстатокКонец.Параметры.ОбщаяМасса = Выборка.Вес;
		ИтогоОстатокКонецОбщаяМасса = ИтогоОстатокКонецОбщаяМасса + Выборка.Вес;
		ОбластьОстатокКонец.Параметры.МассаЛигатуры = Выборка.МассаЛигатуры;
		ИтогоОстатокКонецМассаЛигатуры = ИтогоОстатокКонецМассаЛигатуры + Выборка.МассаЛигатуры;
		ОбластьОстатокКонец.Параметры.МассаХим = Выборка.МассаХим;
		ИтогоОстатокКонецМассаХим = ИтогоОстатокКонецМассаХим + Выборка.МассаХим;
		ОбластьОстатокКонец.Параметры.ВесДК = "";
		ОбластьОстатокКонец.Параметры.Количество = Выборка.КоличествоОстаток;
		ИтогоОстатокКонецКоличество = ИтогоОстатокКонецКоличество + Выборка.КоличествоОстаток;
		ОбластьОстатокКонец.Параметры.Стоимость = Выборка.СуммаОценкиМакс;
		ИтогоОстатокКонецСтоимость = ИтогоОстатокКонецСтоимость + Выборка.СуммаОценкиМакс;
		//+МАН 01.12.25 Добавлено количество камней
		ОбластьОстатокКонец.Параметры.КоличествоДК = "";
		//-МАН
		ТабличныйДокумент.Вывести(ОбластьОстатокКонец);
	Иначе
		Если Выборка.Вес <> 0 Тогда
		ОбластьОстатокКонец.Параметры.Проба = Выборка.ВидВставки;
		ОбластьОстатокКонец.Параметры.ОбщаяМасса = "";
		ОбластьОстатокКонец.Параметры.МассаЛигатуры = "";
		ОбластьОстатокКонец.Параметры.МассаХим = "";
		ОбластьОстатокКонец.Параметры.ВесДК = Выборка.Вес;
		ИтогоОстатокКонецВесДК = ИтогоОстатокКонецВесДК + Выборка.Вес;
		ОбластьОстатокКонец.Параметры.Количество = Выборка.КоличествоОстаток;
		ИтогоОстатокКонецКоличество = ИтогоОстатокКонецКоличество + Выборка.КоличествоОстаток;
		ОбластьОстатокКонец.Параметры.Стоимость = Выборка.СуммаОценкиМакс;
		ИтогоОстатокКонецСтоимость = ИтогоОстатокКонецСтоимость + Выборка.СуммаОценкиМакс;
		//+МАН 01.12.25 Добавлено количество камней
		ОбластьОстатокКонец.Параметры.КоличествоДК = Выборка.КоличествоКамней;
		ИтогоОстатокКонецКоличествоКамней = ИтогоОстатокКонецКоличествоКамней + Выборка.КоличествоКамней;
		//-МАН
		ТабличныйДокумент.Вывести(ОбластьОстатокКонец);
		КонецЕсли;
	КонецЕсли;
	КонецЦикла;
	
	ОбластьИтогоОстатокКонец.Параметры.ИтогоОбщаяМасса = ИтогоОстатокКонецОбщаяМасса;
	ОбластьИтогоОстатокКонец.Параметры.ИтогоМассаЛигатуры = ИтогоОстатокКонецМассаЛигатуры;
	ОбластьИтогоОстатокКонец.Параметры.ИтогоМассаХим = ИтогоОстатокКонецМассаХим;
	ОбластьИтогоОстатокКонец.Параметры.ИтогоВесДК = ИтогоОстатокКонецВесДК;
	ОбластьИтогоОстатокКонец.Параметры.ИтогоКоличество = ИтогоОстатокКонецКоличество;
	ОбластьИтогоОстатокКонец.Параметры.ИтогоСтоимость = ИтогоОстатокКонецСтоимость;
	//+МАН 01.12.25 Добавлено количество камней
	ОбластьИтогоОстатокКонец.Параметры.ИтогоКоличествоДК = ИтогоОстатокКонецКоличествоКамней;
	//-МАН
	ТабличныйДокумент.Вывести(ОбластьИтогоОстатокКонец);
	
	ОбластьПодвал.Параметры.ДатаСоставления = Формат(ПараметрыОтчета.КонецПериода, "ДЛФ=DD");
	
	Ответственный              = ПараметрыСеанса.ТекущийСотрудник;	
	ФИООтветственного          = СтрРазделить(Строка(Ответственный), " ");
	
	Если ФИООтветственного.Количество() > 0 Тогда
		ФамилияОтветственного  = ФИООтветственного[0]; 
		ИнициалыОтветственного = Лев(ФИООтветственного[1], 1) + "." + Лев(ФИООтветственного[2], 1) + ".";
	Иначе
		ФамилияОтветственного  = ""; 
		ИнициалыОтветственного = "";
	КонецЕсли;
		
	ОбластьПодвал.Параметры.Ответственный = ФамилияОтветственного + " " + ИнициалыОтветственного;
	
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

//+МАН 02.12.25 Вызов функции по формированию табличного документа ПКО
Функция СформироватьТабличныйДокументПКО(ПараметрыОтчета) Экспорт
	Возврат Документы.ЛБ_ОперацияПоЗалогу.ПечатьПКО(ПараметрыОтчета, Неопределено);
КонецФункции

//Вызов функции по формированию табличного документа РКО
Функция СформироватьТабличныйДокументРКО(ПараметрыОтчета) Экспорт
	Возврат Документы.ЛБ_ОперацияПоЗалогу.ПечатьРКО(ПараметрыОтчета, Неопределено);
КонецФункции
//-МАН


