#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


//Код Ольги Зыковой
/// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт   
	КомандаПечати1 = КомандыПечати.Добавить(); 
	КомандаПечати1.МенеджерПечати = "Документ.ЛБ_Реализация";
	КомандаПечати1.Идентификатор = "Реализация";
	КомандаПечати1.Представление = НСтр("ru = 'Реализация невостребованных залогов (изделия)'");
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати1, "ВидОперации", Перечисления.ЛБ_ВидыОперацийРеализация.РеализацияЦООпт);
	КомандаПечати1.ПроверкаПроведенияПередПечатью = Истина;
	
	КомандаПечати2 = КомандыПечати.Добавить(); 
	КомандаПечати2.МенеджерПечати = "Документ.ЛБ_Реализация";
	КомандаПечати2.Идентификатор = "РеализацияЛом";
	КомандаПечати2.Представление = НСтр("ru = 'Реализация невостребованных залогов (лом)'");
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати2, "ВидОперации", Перечисления.ЛБ_ВидыОперацийРеализация.РеализацияЦООпт); 
	КомандаПечати2.ПроверкаПроведенияПередПечатью = Истина;
	
	СписокК = Новый СписокЗначений; 
	СписокК.Добавить(Перечисления.ЛБ_ВидыОперацийРеализация.РеализацияЛомбард);
	СписокК.Добавить(Перечисления.ЛБ_ВидыОперацийРеализация.РеализацияЦОРозница);

	КомандаПечати3 = КомандыПечати.Добавить(); 
	КомандаПечати3.МенеджерПечати = "Документ.ЛБ_Реализация";
	КомандаПечати3.Идентификатор = "КассовыйЧек";
	КомандаПечати3.Представление = НСтр("ru = 'Кассовый чек'");
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати3, "ВидОперации", СписокК,  ВидСравненияКомпоновкиДанных.ВСписке);  
	КомандаПечати3.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры	

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт	
	
	// Устанавливаем признак доступности печати покомплектно.
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
		
	Если КоллекцияПечатныхФорм.Получить(0).ИмяМакета = "Реализация"  Тогда
		// Проверяем, нужно ли для макета ЗаключениеОбОценке формировать табличный документ.
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Реализация") Тогда
		
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Реализация", "Реализация", 
				ПечатьРеализации(МассивОбъектов, ОбъектыПечати), , "ОбщиеМакеты.ЛБ_ТоварнаяНакладная");
		КонецЕсли;  
	ИначеЕсли КоллекцияПечатныхФорм.Получить(0).ИмяМакета = "РеализацияЛом"  Тогда
		// Проверяем, нужно ли для макета ЗаключениеОбОценке формировать табличный документ.
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РеализацияЛом") Тогда
		
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "РеализацияЛом", "РеализацияЛом", 
				ПечатьРеализацииЛом(МассивОбъектов, ОбъектыПечати), , "ОбщиеМакеты.ЛБ_ТоварнаяНакладнаяЛом");
		КонецЕсли;	
	ИначеЕсли КоллекцияПечатныхФорм.Получить(0).ИмяМакета = "КассовыйЧек"  Тогда
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "КассовыйЧек") Тогда
		     УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "КассовыйЧек", "КассовыйЧек", 
				ПечатьКассовыйЧек(МассивОбъектов, ОбъектыПечати), , "ОбщиеМакеты.ЛБ_ТоварнаяНакладная");
		КонецЕсли;	
    КонецЕсли;	
		
КонецПроцедуры

Функция ПолучитьДанныеПоставщика(Организация)
	Описание = СокрЛП(Организация.НаименованиеСокращенное);
	ЗапросК = Новый Запрос; 
	ЗапросК.УстановитьПараметр("Ссылка", Организация);
	ЗапросК.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес); 
	ЗапросК.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ЮридическийАдресОрганизации);
	ЗапросК.Текст = "ВЫБРАТЬ
	                |	ОрганизацииКонтактнаяИнформация.Представление КАК Представление
	                |ИЗ
	                |	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	                |ГДЕ
	                |	ОрганизацииКонтактнаяИнформация.Ссылка = &Ссылка
	                |	И ОрганизацииКонтактнаяИнформация.Тип = &Тип
	                |	И ОрганизацииКонтактнаяИнформация.Вид = &Вид";
	ВыборкаК = ЗапросК.Выполнить().Выбрать();
	Если ВыборкаК.Следующий() Тогда 
		Описание = Описание + ", " + ВыборкаК.Представление;
	КонецЕсли;
	
	ЗапросК.Текст = "ВЫБРАТЬ
	                |	_ДемоБанковскиеСчета.Банк КАК Банк,
	                |	_ДемоБанковскиеСчета.НомерСчета КАК НомерСчета
	                |ИЗ
	                |	Справочник._ДемоБанковскиеСчета КАК _ДемоБанковскиеСчета
	                |ГДЕ
	                |	_ДемоБанковскиеСчета.Владелец = &Ссылка
	                |	И _ДемоБанковскиеСчета.ПометкаУдаления = ЛОЖЬ";
	ВыборкаК = ЗапросК.Выполнить().Выбрать();
	Если ВыборкаК.Следующий() Тогда 
		ПредставлениеРС = "р/с " + СокрЛП(ВыборкаК.НомерСчета) + " в " + СокрЛП(ВыборкаК.Банк.Наименование) + " " + СокрЛП(ВыборкаК.Банк.Город) + 
		         ", к/с " + СокрЛП(ВыборкаК.Банк.КоррСчет) + ", БИК " + СокрЛП(ВыборкаК.Банк.Код);
		Описание = Описание + ", " + ПредставлениеРС;
	КонецЕсли;

	Если НЕ ПустаяСтрока(Организация.ИНН) Тогда
		Описание = Описание + ", ИНН " + СокрЛП(Организация.ИНН); 
	КонецЕсли;	
	
	Если НЕ ПустаяСтрока(Организация.КПП) Тогда
		Описание = Описание + ", КПП " + СокрЛП(Организация.КПП); 
	КонецЕсли;	

	Возврат Описание;
КонецФункции   

Функция ПолучитьДанныеПокупателя(Контрагент) 
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат "";
	КонецЕсли;
	
	Описание = СокрЛП(Контрагент); 
	ТаблицаКИ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Контрагент, , ТекущаяДата(), Ложь);
 	Для Каждого СтрокаКИ Из ТаблицаКИ Цикл 
		Если СтрокаКИ.Тип =  Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
		    Описание = Описание + ", " + СтрокаКИ.Представление; 
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	ЗапросК = Новый Запрос; 
	ЗапросК.УстановитьПараметр("Ссылка", Контрагент);

	ЗапросК.Текст = "ВЫБРАТЬ
	                |	_ДемоБанковскиеСчета.Банк КАК Банк,
	                |	_ДемоБанковскиеСчета.НомерСчета КАК НомерСчета
	                |ИЗ
	                |	Справочник._ДемоБанковскиеСчета КАК _ДемоБанковскиеСчета
	                |ГДЕ
	                |	_ДемоБанковскиеСчета.Владелец = &Ссылка
	                |	И _ДемоБанковскиеСчета.ПометкаУдаления = ЛОЖЬ";
	ВыборкаК = ЗапросК.Выполнить().Выбрать();
	Если ВыборкаК.Следующий() Тогда 
		ПредставлениеРС = "р/с " + СокрЛП(ВыборкаК.НомерСчета) + " в " + СокрЛП(ВыборкаК.Банк.Наименование) + " " + СокрЛП(ВыборкаК.Банк.Город) + 
		         ", к/с " + СокрЛП(ВыборкаК.Банк.КоррСчет) + ", БИК " + СокрЛП(ВыборкаК.Банк.Код);
		Описание = Описание + ", " + ПредставлениеРС;
	КонецЕсли;

	Если НЕ ПустаяСтрока(Контрагент.ИНН) Тогда
		Описание = Описание + ", ИНН " + СокрЛП(Контрагент.ИНН); 
	КонецЕсли;	
	
	Если НЕ ПустаяСтрока(Контрагент.КПП) Тогда
		Описание = Описание + ", КПП " + СокрЛП(Контрагент.КПП); 
	КонецЕсли;	

	Возврат Описание;
КонецФункции

Функция ПечатьРеализации(МассивОбъектов, ОбъектыПечати)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ТолькоПросмотр = Истина;
	ТабДокумент.АвтоМасштаб    = Истина;
	ТабДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_Реализация";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_Реализация.Дата КАК Дата,
	               |	ЛБ_Реализация.ПредставлениеНомера КАК Номер,
	               |	ЛБ_Реализация.Основание КАК Основание,
	               |	ЛБ_Реализация.Организация КАК Организация,
	               |	ЛБ_Реализация.Контрагент КАК Контрагент
	               |ИЗ
	               |	Документ.ЛБ_Реализация КАК ЛБ_Реализация
	               |ГДЕ
	               |	ЛБ_Реализация.Ссылка В(&МассивОбъектов)
	               |	И ЛБ_Реализация.Проведен = ИСТИНА";
	               	           	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);          	
	ВыборкаДанныеРеализация = Запрос.Выполнить().Выбрать();
	ВыборкаДанныеРеализация.Следующий();
	
	// Получаем макет
	Макет = ПолучитьОбщийМакет("ЛБ_ТоварнаяНакладная");
	
	Грузоотправитель = ПолучитьДанныеПоставщика(ВыборкаДанныеРеализация.Организация); 
	Грузополучатель = ПолучитьДанныеПокупателя(ВыборкаДанныеРеализация.Контрагент);
	
	// Формируем основную часть.
	ОбластьМакетаШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакетаШапка.Параметры.ПредставлениеПоставщика = Грузоотправитель;
	ОбластьМакетаШапка.Параметры.ПредставлениеГрузополучателя = Грузополучатель;
    ОбластьМакетаШапка.Параметры.ПредставлениеПлательщика = Грузополучатель;
	ОбластьМакетаШапка.Параметры.Основание = ВыборкаДанныеРеализация.Основание;
	ОбластьМакетаШапка.Параметры.ДатаДокумента 			= Формат(ВыборкаДанныеРеализация.Дата, "ДФ=dd.MM.yyyy"); 
	ОбластьМакетаШапка.Параметры.НомерДокумента 			= ВыборкаДанныеРеализация.Номер;
	ОбластьМакетаШапка.Параметры.ПредставлениеОрганизации 	=  ВыборкаДанныеРеализация.Организация.Наименование;  
	ТабДокумент.Вывести(ОбластьМакетаШапка); 
	
	
	Запрос.УстановитьПараметр("Дата", ВыборкаДанныеРеализация.Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеализованныеОбъектыЗалога.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_РеализованныеОбъектыЗалога.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_РеализованныеОбъектыЗалога.Количество КАК Количество,
	               |	ЛБ_РеализованныеОбъектыЗалога.СуммаРеализации КАК СуммаРеализации,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК Вес,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вставки КАК Вставки
	               |ИЗ
	               |	РегистрНакопления.ЛБ_РеализованныеОбъектыЗалога КАК ЛБ_РеализованныеОбъектыЗалога
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(&Дата, ) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	               |		ПО ЛБ_РеализованныеОбъектыЗалога.ЗалоговыйБилет = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет
	               |			И ЛБ_РеализованныеОбъектыЗалога.ОбъектЗалога = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога
	               |ГДЕ
	               |	ЛБ_РеализованныеОбъектыЗалога.Регистратор В(&МассивОбъектов)";
	ЗапросТовары = Запрос.Выполнить().Выгрузить();
	
	НомерСтраницы   = 1;
	
	КоличествоСтрок = ЗапросТовары.Количество();
	
	// инициализация итогов по документу
	ИтогоМассаБрутто = 0;
	ИтогоМест        = 0;
	ИтогоКоличество  = 0;
	ИтогоСуммаСНДС   = 0;
	ИтогоСумма       = 0;
	ИтогоНДС         = 0;
	Ном              = 0;   
	
	ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаб"); 
	ОбластьМакета           = Макет.ПолучитьОбласть("Строка");
	ОбластьВсего            = Макет.ПолучитьОбласть("Всего");
	ОбластьПодвала          = Макет.ПолучитьОбласть("Подвал");
	
	// Создаем массив для проверки вывода
	МассивВыводимыхОбластей = Новый Массив;

	Для каждого Выборка Из ЗапросТовары Цикл 
		Ном = Ном + 1;
		ОбластьМакета.Параметры.Номер = Ном;
		ОбластьМакета.Параметры.ТоварПроба = Выборка.Проба;
		ОбластьМакета.Параметры.ТоварНаименование = Выборка.Артикул + " " + Выборка.ВидИзделия + " " + ?(Выборка.Вставки, "с/в", "б/в");  
		ОбластьМакета.Параметры.БазоваяЕдиницаНаименование = "шт"; //как определять пара не понятно
		ОбластьМакета.Параметры.БазоваяЕдиницаКодПоОКЕИ = "796";
		ОбластьМакета.Параметры.КоличествоМест = Выборка.Количество; 
		ИтогоМест = ИтогоМест + Выборка.Количество;
		ОбластьМакета.Параметры.Количество = Выборка.Вес;  
		ИтогоКоличество  = ИтогоКоличество  + Выборка.Вес;
        ОбластьМакета.Параметры.Цена = Выборка.СуммаРеализации; 
		ОбластьМакета.Параметры.СуммаБезНДС = Выборка.СуммаРеализации;
        ОбластьМакета.Параметры.СуммаСНДС = Выборка.СуммаРеализации; 
		ИтогоСумма       = ИтогоСумма       + Выборка.СуммаРеализации;
		ИтогоСуммаСНДС   = ИтогоСуммаСНДС   + Выборка.СуммаРеализации;
        ОбластьМакета.Параметры.СтавкаНДС = "НДС не облагается"; 
		
		Если Ном = 1 Тогда // первая срока
		
			ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);
			
		Иначе
			
			МассивВыводимыхОбластей.Очистить();
			МассивВыводимыхОбластей.Добавить(ОбластьМакета);
			Если Ном = КоличествоСтрок Тогда
				МассивВыводимыхОбластей.Добавить(ОбластьВсего);
				МассивВыводимыхОбластей.Добавить(ОбластьПодвала);
			КонецЕсли;		
			
			Если Ном <> 1 И НЕ ТабДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
							
				НомерСтраницы = НомерСтраницы + 1;
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);
				
			КонецЕсли;
			
		КонецЕсли;		
		
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;
	
	// Выводим итоги по документу в целом
	ОбластьМакета = Макет.ПолучитьОбласть("Всего");
	ОбластьМакета.Параметры.ИтогМест        = ИтогоМест;
	ОбластьМакета.Параметры.ИтогКоличество  = ИтогоКоличество;
	ОбластьМакета.Параметры.ИтогСуммы       = ИтогоСумма;
	//ОбластьМакета.Параметры.ИтогНДС         = ИтогоНДС;
	//ОбластьМакета.Параметры.ИтогСуммыСНДС   = ИтогоСуммаСНДС;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	// Выводим подвал документа
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	
	ПолнаяДатаДокумента = Формат(ВыборкаДанныеРеализация.Дата, "ДФ=""дд ММММ гггг """"года""""""");
	ДлинаСтроки = СтрДлина(ПолнаяДатаДокумента);
	ПервыйРазделитель = Найти(ПолнаяДатаДокумента," ");
	ВторойРазделитель = Найти(Прав(ПолнаяДатаДокумента,ДлинаСтроки-ПервыйРазделитель)," ")+ПервыйРазделитель;
	ОбластьМакета.Параметры.ДатаДокументаДень     = """"+Лев(ПолнаяДатаДокумента,ПервыйРазделитель-1)+"""";
	ОбластьМакета.Параметры.ДатаДокументаМесяц    = Сред(ПолнаяДатаДокумента,ПервыйРазделитель+1,ВторойРазделитель-ПервыйРазделитель-1);
	ОбластьМакета.Параметры.ДатаДокументаГод      = Прав(ПолнаяДатаДокумента,ДлинаСтроки-ВторойРазделитель);	
	
	//ДолжностьДиректор = Справочники.Должности.НайтиПоНаименованию("Директор", истина);   /// не корректно!!!
	//ДолжностьГБ = Справочники.Должности.НайтиПоНаименованию("Главный бухгалтер", истина);
	//Запрос = Новый Запрос; 	
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	СправочникЛБ_Сотрудники.Ссылка КАК Сотрудник
	//               |ИЗ
	//               |	Справочник.ЛБ_Сотрудники КАК СправочникЛБ_Сотрудники
	//               |ГДЕ
	//               |	СправочникЛБ_Сотрудники.ПометкаУдаления = ЛОЖЬ
	//               |	И СправочникЛБ_Сотрудники.ВАрхиве = ЛОЖЬ
	//               |	И СправочникЛБ_Сотрудники.Должность = &Должность
	//               |	И СправочникЛБ_Сотрудники.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1)";
	//Запрос.УстановитьПараметр("Должность", ДолжностьДиректор); 
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//	ОбластьМакета.Параметры.ФИОРуководителя = ?(ЗначениеЗаполнено(Выборка.Сотрудник.ФизическоеЛицо), Выборка.Сотрудник.ФизическоеЛицо.Фамилия + " " + Выборка.Сотрудник.ФизическоеЛицо.Инициалы, Выборка.Сотрудник);
	//    ОбластьМакета.Параметры.ДолжностьРуководителя = ДолжностьДиректор; 
	//КонецЕсли;	
	//Запрос.УстановитьПараметр("Должность", ДолжностьГБ); 
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//	ОбластьМакета.Параметры.ФИОГлавБухгалтера = ?(ЗначениеЗаполнено(Выборка.Сотрудник.ФизическоеЛицо), Выборка.Сотрудник.ФизическоеЛицо.Фамилия + " " + Выборка.Сотрудник.ФизическоеЛицо.Инициалы, Выборка.Сотрудник);
	// КонецЕсли;	
	
	ОбластьМакета.Параметры.ДолжностьРуководителя  = "Директор";
	ОбластьМакета.Параметры.ФИОРуководителя = ?(ЗначениеЗаполнено(ВыборкаДанныеРеализация.Организация.Директор), ВыборкаДанныеРеализация.Организация.Директор.Фамилия + " " + ВыборкаДанныеРеализация.Организация.Директор.Инициалы, ВыборкаДанныеРеализация.Организация.Директорк);
	ОбластьМакета.Параметры.ФИОГлавБухгалтера = ?(ЗначениеЗаполнено(ВыборкаДанныеРеализация.Организация.ГлавныйБухгалтер), ВыборкаДанныеРеализация.Организация.ГлавныйБухгалтер.Фамилия + " " + ВыборкаДанныеРеализация.Организация.ГлавныйБухгалтер.Инициалы, ВыборкаДанныеРеализация.Организация.ГлавныйБухгалтер);
	
	ПараметрыПредмета = "целая, целых, целых, ж, сотая, сотых, сотых, ж, 2";
  
	ОбластьМакета.Параметры.МассаГрузаПрописью = ЧислоПрописью(ИтогоКоличество, ,ПараметрыПредмета);
		
	Если ИтогоМест > 0 Тогда
		ОбластьМакета.Параметры.ВсегоМестПрописью = ЧислоПрописью(ИтогоМест, ,",,,,,,,,0");
	КонецЕсли;
	
	ОбластьМакета.Параметры.КоличествоПорядковыхНомеровЗаписейПрописью = ЧислоПрописью(КоличествоСтрок, ,",,,,,,,,0"); 
	ВалютаУчета = Справочники.Валюты.НайтиПоКоду("643");
	ОбластьМакета.Параметры.СуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(ИтогоСуммаСНДС, ВалютаУчета);
	ТабДокумент.Вывести(ОбластьМакета);   
	
	ТабДокумент.НижнийКолонтитул.Выводить = Истина; 
	ТабДокумент.НижнийКолонтитул.НачальнаяСтраница = 1;
	ТабДокумент.НижнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Низ;
	ТабДокумент.НижнийКолонтитул.ТекстСправа = "Накладная № " + СокрЛП(ВыборкаДанныеРеализация.Номер) + ", стр. [&НомерСтраницы] из [&СтраницВсего]";
	
	Возврат ТабДокумент;

КонецФункции

Функция ПечатьРеализацииЛом(МассивОбъектов, ОбъектыПечати)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ТолькоПросмотр = Истина;
	ТабДокумент.АвтоМасштаб    = Истина;
	ТабДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_Реализация";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_Реализация.Дата КАК Дата,
	               |	ЛБ_Реализация.ПредставлениеНомера КАК Номер,
	               |	ЛБ_Реализация.Основание КАК Основание,
	               |	ЛБ_Реализация.Организация КАК Организация,
	               |	ЛБ_Реализация.Контрагент КАК Контрагент
	               |ИЗ
	               |	Документ.ЛБ_Реализация КАК ЛБ_Реализация
	               |ГДЕ
	               |	ЛБ_Реализация.Ссылка В(&МассивОбъектов)
	               |	И ЛБ_Реализация.Проведен = ИСТИНА";
	               	           	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);          	
	ВыборкаДанныеРеализация = Запрос.Выполнить().Выбрать();
	ВыборкаДанныеРеализация.Следующий();
	
	// Получаем макет
	Макет = ПолучитьОбщийМакет("ЛБ_ТоварнаяНакладнаяЛом");
	
	Грузоотправитель = ПолучитьДанныеПоставщика(ВыборкаДанныеРеализация.Организация); 
	Грузополучатель = ПолучитьДанныеПокупателя(ВыборкаДанныеРеализация.Контрагент);
	
	// Формируем основную часть.
	ОбластьМакетаШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакетаШапка.Параметры.ПредставлениеПоставщика = Грузоотправитель;
	ОбластьМакетаШапка.Параметры.ПредставлениеГрузополучателя = Грузополучатель;
    ОбластьМакетаШапка.Параметры.ПредставлениеПлательщика = Грузополучатель;
	ОбластьМакетаШапка.Параметры.Основание = ВыборкаДанныеРеализация.Основание;
	ОбластьМакетаШапка.Параметры.ДатаДокумента 			= Формат(ВыборкаДанныеРеализация.Дата, "ДФ=dd.MM.yyyy"); 
	ОбластьМакетаШапка.Параметры.НомерДокумента 			= ВыборкаДанныеРеализация.Номер;
	ОбластьМакетаШапка.Параметры.ПредставлениеОрганизации 	=  ВыборкаДанныеРеализация.Организация.Наименование;  
	ТабДокумент.Вывести(ОбластьМакетаШапка); 
	
	
	Запрос.УстановитьПараметр("Дата", ВыборкаДанныеРеализация.Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеализованныеОбъектыЗалога.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_РеализованныеОбъектыЗалога.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_РеализованныеОбъектыЗалога.Количество КАК Количество,
	               |	ЛБ_РеализованныеОбъектыЗалога.СуммаРеализации КАК СуммаРеализации,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК Вес,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесМеталла,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вставки КАК Вставки
	               |ИЗ
	               |	РегистрНакопления.ЛБ_РеализованныеОбъектыЗалога КАК ЛБ_РеализованныеОбъектыЗалога
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(&Дата, ) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	               |		ПО ЛБ_РеализованныеОбъектыЗалога.ЗалоговыйБилет = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет
	               |			И ЛБ_РеализованныеОбъектыЗалога.ОбъектЗалога = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога
	               |ГДЕ
	               |	ЛБ_РеализованныеОбъектыЗалога.Регистратор В(&МассивОбъектов)";
	ЗапросТовары = Запрос.Выполнить().Выгрузить();
	
	НомерСтраницы   = 1;
	
	КоличествоСтрок = ЗапросТовары.Количество();
	
	// инициализация итогов по документу
	ИтогоВесИзделия = 0;
	ИтогоМест        = 0;
	ИтогоКоличество  = 0;
	ИтогоСуммаСНДС   = 0;
	ИтогоСумма       = 0;
	ИтогоНДС         = 0;
	Ном              = 0;   
	
	ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаб"); 
	ОбластьМакета           = Макет.ПолучитьОбласть("Строка");
	ОбластьВсего            = Макет.ПолучитьОбласть("Всего"); 
	ОбластьПроба            = Макет.ПолучитьОбласть("ИтогоПроба");
	ОбластьПодвала          = Макет.ПолучитьОбласть("Подвал");
	
	// Создаем массив для проверки вывода
	МассивВыводимыхОбластей = Новый Массив;

	Для каждого Выборка Из ЗапросТовары Цикл 
		Ном = Ном + 1;
		ОбластьМакета.Параметры.Номер = Ном;
		ОбластьМакета.Параметры.ТоварПроба = Выборка.Проба;
		ОбластьМакета.Параметры.ТоварНаименование = Выборка.Артикул + " " + Выборка.ВидИзделия + " " + ?(Выборка.Вставки, "с/в", "б/в");  
		ОбластьМакета.Параметры.БазоваяЕдиницаНаименование = Выборка.ЕдиницаИзмерения.Наименование;
		ОбластьМакета.Параметры.БазоваяЕдиницаКодПоОКЕИ = Выборка.ЕдиницаИзмерения.Код;
		ОбластьМакета.Параметры.КоличествоМест = Выборка.Количество; 
		ИтогоМест = ИтогоМест + Выборка.Количество;
		ОбластьМакета.Параметры.Количество = Выборка.ВесМеталла;  
		ИтогоКоличество  = ИтогоКоличество  + Выборка.ВесМеталла;   
		ОбластьМакета.Параметры.ВесИзделия = Выборка.Вес;  
		ИтогоВесИзделия  = ИтогоВесИзделия  + Выборка.Вес;
		Цена = ?(Выборка.ВесМеталла = 0, 0, Выборка.СуммаРеализации/Выборка.ВесМеталла); 
        ОбластьМакета.Параметры.Цена = окр(Цена, 2, режимОкругления.Окр15как20); 
		ОбластьМакета.Параметры.СуммаБезНДС = Выборка.СуммаРеализации;
        ОбластьМакета.Параметры.СуммаСНДС = Выборка.СуммаРеализации; 
		ИтогоСумма       = ИтогоСумма       + Выборка.СуммаРеализации;
		ИтогоСуммаСНДС   = ИтогоСуммаСНДС   + Выборка.СуммаРеализации;
        ОбластьМакета.Параметры.СтавкаНДС = "НДС не облагается"; 
		
		Если Ном = 1 Тогда // первая срока
		
			ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);
			
		Иначе
			
			МассивВыводимыхОбластей.Очистить();
			МассивВыводимыхОбластей.Добавить(ОбластьМакета);
			Если Ном = КоличествоСтрок Тогда  
				МассивВыводимыхОбластей.Добавить(ОбластьПроба);
				МассивВыводимыхОбластей.Добавить(ОбластьВсего);
				МассивВыводимыхОбластей.Добавить(ОбластьПодвала);
			КонецЕсли;		
			
			Если Ном <> 1 И НЕ ТабДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
							
				НомерСтраницы = НомерСтраницы + 1;
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);
				
			КонецЕсли;
			
		КонецЕсли;		
		
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;     
	
	// Выводим итоги по пробамм
	ТаблицаПроб = ЗапросТовары.Скопировать();
    ТаблицаПроб.Свернуть("Проба", "Количество, Вес, ВесМеталла, СуммаРеализации");  
	ТаблицаПроб.Сортировать("Проба");  
	
	Ном = 0;
	Для каждого Выборка Из ТаблицаПроб Цикл 
		ОбластьПроба.Параметры.ИтогоПроба = ?(Ном = 0, "Итого проба", "");
		ОбластьПроба.Параметры.Проба = Выборка.Проба;
		ОбластьПроба.Параметры.КоличествоМест = Выборка.Количество; 
		ОбластьПроба.Параметры.Количество = Выборка.ВесМеталла;   
		ОбластьПроба.Параметры.ВесИзделия = Выборка.Вес;  
		Цена = ?(Выборка.ВесМеталла = 0, 0, Выборка.СуммаРеализации/Выборка.ВесМеталла); 
        ОбластьПроба.Параметры.Цена = окр(Цена, 2, режимОкругления.Окр15как20); 
		ОбластьПроба.Параметры.СуммаБезНДС = Выборка.СуммаРеализации;
        ОбластьПроба.Параметры.СуммаСНДС = Выборка.СуммаРеализации; 
		ОбластьПроба.Параметры.СтавкаНДС = "НДС не облагается"; 
			
		ТабДокумент.Вывести(ОбластьПроба); 
		Ном = Ном + 1;
	КонецЦикла;     
   	
	// Выводим итоги по документу в целом
	ОбластьМакета = Макет.ПолучитьОбласть("Всего");
	ОбластьМакета.Параметры.ИтогМест        = ИтогоМест;
	ОбластьМакета.Параметры.ИтогКоличество  = ИтогоКоличество; 
	ОбластьМакета.Параметры.ИтогВесИзделия  = ИтогоВесИзделия;
	ОбластьМакета.Параметры.ИтогСуммы       = ИтогоСумма;
	//ОбластьМакета.Параметры.ИтогНДС         = ИтогоНДС;
	//ОбластьМакета.Параметры.ИтогСуммыСНДС   = ИтогоСуммаСНДС;
	
	ТабДокумент.Вывести(ОбластьМакета);   
		
	// Выводим подвал документа
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	
	ПолнаяДатаДокумента = Формат(ВыборкаДанныеРеализация.Дата, "ДФ=""дд ММММ гггг """"года""""""");
	ДлинаСтроки = СтрДлина(ПолнаяДатаДокумента);
	ПервыйРазделитель = Найти(ПолнаяДатаДокумента," ");
	ВторойРазделитель = Найти(Прав(ПолнаяДатаДокумента,ДлинаСтроки-ПервыйРазделитель)," ")+ПервыйРазделитель;
	ОбластьМакета.Параметры.ДатаДокументаДень     = """"+Лев(ПолнаяДатаДокумента,ПервыйРазделитель-1)+"""";
	ОбластьМакета.Параметры.ДатаДокументаМесяц    = Сред(ПолнаяДатаДокумента,ПервыйРазделитель+1,ВторойРазделитель-ПервыйРазделитель-1);
	ОбластьМакета.Параметры.ДатаДокументаГод      = Прав(ПолнаяДатаДокумента,ДлинаСтроки-ВторойРазделитель);	
	
	//ДолжностьДиректор = Справочники.Должности.НайтиПоНаименованию("Директор", истина);   /// не корректно!!!
	//ДолжностьГБ = Справочники.Должности.НайтиПоНаименованию("Главный бухгалтер", истина);
	//Запрос = Новый Запрос; 	
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	СправочникЛБ_Сотрудники.Ссылка КАК Сотрудник
	//               |ИЗ
	//               |	Справочник.ЛБ_Сотрудники КАК СправочникЛБ_Сотрудники
	//               |ГДЕ
	//               |	СправочникЛБ_Сотрудники.ПометкаУдаления = ЛОЖЬ
	//               |	И СправочникЛБ_Сотрудники.ВАрхиве = ЛОЖЬ
	//               |	И СправочникЛБ_Сотрудники.Должность = &Должность
	//               |	И СправочникЛБ_Сотрудники.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1)";
	//Запрос.УстановитьПараметр("Должность", ДолжностьДиректор); 
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//	ОбластьМакета.Параметры.ФИОРуководителя = ?(ЗначениеЗаполнено(Выборка.Сотрудник.ФизическоеЛицо), Выборка.Сотрудник.ФизическоеЛицо.Фамилия + " " + Выборка.Сотрудник.ФизическоеЛицо.Инициалы, Выборка.Сотрудник);
	//    ОбластьМакета.Параметры.ДолжностьРуководителя = ДолжностьДиректор; 
	//КонецЕсли;	
	//Запрос.УстановитьПараметр("Должность", ДолжностьГБ); 
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//	ОбластьМакета.Параметры.ФИОГлавБухгалтера = ?(ЗначениеЗаполнено(Выборка.Сотрудник.ФизическоеЛицо), Выборка.Сотрудник.ФизическоеЛицо.Фамилия + " " + Выборка.Сотрудник.ФизическоеЛицо.Инициалы, Выборка.Сотрудник);
	//КонецЕсли;	
	
	ОбластьМакета.Параметры.ДолжностьРуководителя  = "Директор";
	ОбластьМакета.Параметры.ФИОРуководителя = ?(ЗначениеЗаполнено(ВыборкаДанныеРеализация.Организация.Директор), ВыборкаДанныеРеализация.Организация.Директор.Фамилия + " " + ВыборкаДанныеРеализация.Организация.Директор.Инициалы, ВыборкаДанныеРеализация.Организация.Директорк);
	ОбластьМакета.Параметры.ФИОГлавБухгалтера = ?(ЗначениеЗаполнено(ВыборкаДанныеРеализация.Организация.ГлавныйБухгалтер), ВыборкаДанныеРеализация.Организация.ГлавныйБухгалтер.Фамилия + " " + ВыборкаДанныеРеализация.Организация.ГлавныйБухгалтер.Инициалы, ВыборкаДанныеРеализация.Организация.ГлавныйБухгалтер);
	  	
	ПараметрыПредмета = "целая, целых, целых, ж, сотая, сотых, сотых, ж, 2";
  
	ОбластьМакета.Параметры.МассаГрузаПрописью = ЧислоПрописью(ИтогоКоличество, ,ПараметрыПредмета); 
	ОбластьМакета.Параметры.ВесИзделийПрописью = ЧислоПрописью(ИтогоВесИзделия, ,ПараметрыПредмета);
		
	Если ИтогоМест > 0 Тогда
		ОбластьМакета.Параметры.ВсегоМестПрописью = ЧислоПрописью(ИтогоМест, ,",,,,,,,,0");
	КонецЕсли;
	
	ОбластьМакета.Параметры.КоличествоПорядковыхНомеровЗаписейПрописью = ЧислоПрописью(КоличествоСтрок, ,",,,,,,,,0"); 
	ВалютаУчета = Справочники.Валюты.НайтиПоКоду("643");
	ОбластьМакета.Параметры.СуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(ИтогоСуммаСНДС, ВалютаУчета);
	ТабДокумент.Вывести(ОбластьМакета);
	
	ТабДокумент.НижнийКолонтитул.Выводить = Истина; 
	ТабДокумент.НижнийКолонтитул.НачальнаяСтраница = 1;
	ТабДокумент.НижнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Низ;
	ТабДокумент.НижнийКолонтитул.ТекстСправа = "Накладная № " + СокрЛП(ВыборкаДанныеРеализация.Номер) + ", стр. [&НомерСтраницы] из [&СтраницВсего]";

	Возврат ТабДокумент;

КонецФункции

Функция ПечатьКассовыйЧек(МассивОбъектов, ОбъектыПечати)
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ТолькоПросмотр = Истина;
	ТабДокумент.АвтоМасштаб    = Истина;
	
	Возврат ТабДокумент;

КонецФункции	

#КонецЕсли