
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастройкаОценкиДрагоценныхВставок.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
	НастройкаОценкиЗалога.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗаписьВставки(Команда)
	Если Не Параметры.Ключ.Пустая() Тогда
		
		ПараметрыФормы = новый Структура("КатегорияОбъектаЗалога");
		ПараметрыФормы.КатегорияОбъектаЗалога = Объект.Ссылка;
		ОткрытьФорму("РегистрСведений.ЛБ_НастройкаОценкиДрагоценныхВставок.ФормаЗаписи",ПараметрыФормы,ЭтаФорма,,,,
		Новый ОписаниеОповещения("ОбработкаКомандыЗавершениеВставки",ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе                        
		Сообщить("Перед добавлением необходимо записать справочник!");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыЗавершениеВставки(Результат,ДополнительныеПараметры) Экспорт
		
	НастройкаОценкиДрагоценныхВставок.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);	
	
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьЗаписьМеталлы(Команда)
	Если Не Параметры.Ключ.Пустая() Тогда
		
		ПараметрыФормы = новый Структура("КатегорияОбъектаЗалога");
		ПараметрыФормы.КатегорияОбъектаЗалога = Объект.Ссылка;
		ОткрытьФорму("РегистрСведений.ЛБ_НастройкаРасчетаОценкиЗалога.ФормаЗаписи",ПараметрыФормы,ЭтаФорма,,,,
		Новый ОписаниеОповещения("ОбработкаКомандыЗавершениеМеталлы",ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе                        
		Сообщить("Перед добавлением необходимо записать справочник!");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыЗавершениеМеталлы(Результат,ДополнительныеПараметры) Экспорт
		
	НастройкаОценкиЗалога.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);	
	
КонецПроцедуры


