
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Очистить();

	Если Параметры.Свойство("Отделение") Тогда
		Элементы.СписокЛомбард.Видимость = Ложь;
		Если Параметры.Список.Количество() = 0 Тогда
			ЗаполнитьСписокОтделений();
		Иначе
			ЗаполнитьСписокОтделений(Параметры.Список);
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("Ломбард") Тогда
		Элементы.СписокОтделение.Видимость = Ложь;
		Если Параметры.Список.Количество() = 0 Тогда
			ЗаполнитьСписокЛомбардов();
		Иначе
			ЗаполнитьСписокЛомбардов(Параметры.Список);
		КонецЕсли;
	КонецЕсли;
	
	Дата = Параметры.Дата;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	Для каждого Стр из Список Цикл 
		Стр.Флаг = Истина;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)
	Для каждого Стр из Список Цикл 
		Стр.Флаг = Ложь;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокОтделений(СписокОтделений = Неопределено)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ЛБ_ОтделенияЛомбардов.Ссылка В (&Отделение)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Флаг,
		|	ЛБ_ОтделенияЛомбардов.Ссылка КАК Отделение
		|ИЗ
		|	Справочник.ЛБ_ОтделенияЛомбардов КАК ЛБ_ОтделенияЛомбардов
		|ГДЕ
		|	НЕ ЛБ_ОтделенияЛомбардов.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_ОтделенияЛомбардов.Наименование";
	
	Если СписокОтделений = Неопределено Тогда
		Запрос.УстановитьПараметр("Отделение", Справочники.ЛБ_ОтделенияЛомбардов.ПустаяСсылка());
	Иначе
		Запрос.УстановитьПараметр("Отделение", СписокОтделений);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() > 0 Тогда
		Список.Загрузить(РезультатЗапроса);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокЛомбардов(СписокЛомбардов = Неопределено)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ЛБ_Ломбарды.Ссылка В (&Ломбард)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Флаг,
		|	ЛБ_Ломбарды.Ссылка КАК Ломбард
		|ИЗ
		|	Справочник.ЛБ_Ломбарды КАК ЛБ_Ломбарды
		|ГДЕ
		|	НЕ ЛБ_Ломбарды.ПометкаУдаления
		|	И НЕ ЛБ_Ломбарды.ЭтоГруппа
		|	И ЛБ_Ломбарды.НомерЛомбарда <> """"
		|	И НЕ ЛБ_Ломбарды.Ссылка = ЗНАЧЕНИЕ(Справочник.ЛБ_Ломбарды.ЦентральныйОфис)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_Ломбарды.НомерЧисловой";
	
	Если СписокЛомбардов = Неопределено Тогда
		Запрос.УстановитьПараметр("Ломбард", Справочники.ЛБ_Ломбарды.ПустаяСсылка());
	Иначе
		Запрос.УстановитьПараметр("Ломбард", СписокЛомбардов);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() > 0 Тогда
		Список.Загрузить(РезультатЗапроса);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	МВозврата = СормироватьСписокВозврата();
	ЭтаФорма.Закрыть(МВозврата);
КонецПроцедуры

&НаСервере
Функция СормироватьСписокВозврата()
	
	Отбор = Новый Структура("Флаг", Истина);
	
	Если ЗначениеЗаполнено(Список[0].Отделение) Тогда
    	ТЗСтрок = Список.Выгрузить(Отбор, "Отделение");
		Возврат ТЗСтрок.ВыгрузитьКолонку("Отделение")
	Иначе
    	ТЗСтрок = Список.Выгрузить(Отбор, "Ломбард");
		Возврат ТЗСтрок.ВыгрузитьКолонку("Ломбард")
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокЛомбардов(Дата, Отделение)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард,
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
		|ИЗ
		|	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(
		|			&Дата,
		|			Отделение В (&Отделение)
		|				И НЕ Ломбард.Закрыт
		|				И НЕ Ломбард.ПометкаУдаления) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.НомерЛомбарда";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Отделение", Отделение);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры






