
Функция ПолучитьЗначениеНастройки(Настройка) Экспорт
	
	ЗначениеНастройки = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЛБ_НастройкиЛомбард.Значение КАК Значение
	|ИЗ
	|	ПланВидовХарактеристик.ЛБ_НастройкиЛомбард КАК ЛБ_НастройкиЛомбард
	|ГДЕ
	|	ЛБ_НастройкиЛомбард.Ссылка = &Ссылка
	|	И НЕ ЛБ_НастройкиЛомбард.ЗначениеВСписке
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЛБ_НастройкиЛомбардСписокЗначений.Значение
	|ИЗ
	|	ПланВидовХарактеристик.ЛБ_НастройкиЛомбард.СписокЗначений КАК ЛБ_НастройкиЛомбардСписокЗначений
	|ГДЕ
	|	ЛБ_НастройкиЛомбардСписокЗначений.Ссылка = &Ссылка
	|	И ЛБ_НастройкиЛомбардСписокЗначений.Ссылка.ЗначениеВСписке";
	
	Запрос.УстановитьПараметр("Ссылка", Настройка);
	
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		ЗначениеНастройки.Добавить(Результат.Значение);
	КонецЦикла;
	
	Возврат ЗначениеНастройки;
	
КонецФункции


