&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Документ") Тогда
		Документ = Параметры.Документ; 
		Если Документ.Проведен тогда
		   СостояниеДокумента = 1;
		ИначеЕсли Документ.ПометкаУдаления тогда
		   СостояниеДокумента = 2;
        КонецЕсли;
		ЗаполнитьСписокНакладныхДокументу();
		ЗаполнитьТаблицу();
		Элементы.ГруппаДокумент.Видимость = Истина; 
		Элементы.ГруппаДокументПодвал.Видимость = Истина;   
		Элементы.ТаблицаВыбора.КоманднаяПанель.Видимость = Ложь;
		Элементы.ТаблицаВыбораВкл.Видимость = Ложь;  
		ЭтаФорма.Заголовок = Метаданные.Документы.ЛБ_КорректировкаНакладной.Синоним + ": " + Строка(Документ.ВидОперации);
	Иначе
		Если Параметры.Свойство("Организация") Тогда
			Организация = Параметры.Организация; 
		КонецЕсли;	
		Если Параметры.Свойство("Ломбард") Тогда
			Ломбард = Параметры.Ломбард; 
		КонецЕсли;    
		ЭтаФорма.Заголовок = "Отмена отгрузки накладных";
	КонецЕсли;	

КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьСписокНакладныхДокументу()
	СписокНакладных.Очистить();
	Для каждого стр Из Документ.ЗалоговыеБилеты Цикл 
		Если СписокНакладных.НайтиПоЗначению(Стр.НакладнаяНаОтгрузку) = неопределено Тогда 
			СписокНакладных.Добавить(Стр.НакладнаяНаОтгрузку);
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьНакладные(Команда)
	ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Организация", Организация); 
	ПараметрыФормы.Вставить("Ломбард", Ломбард); 
	ПараметрыФормы.Вставить("ВидОперации", 1);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораНакладных", ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ВыборНакладных", ПараметрыФормы ,,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьТаблицу()
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Список", СписокНакладных);
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Документ), Документ.Дата-1, ТекущаяДатаСеанса())); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИСТИНА КАК Вкл,
	               |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
	               |	0 КАК КоличествоИзделий,
	               |	0 КАК ВесИзделий,
	               |	0 КАК СуммаОценки,
	               |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.СтатусНакладной КАК СтатусНакладной,
	               |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.Период КАК ДатаОтгрузки,
	               |	ЗНАЧЕНИЕ(Перечисление.ЛБ_статусыНакладнойНаОтгрузку.СумкаЗакрыта) КАК СтатусНакладнойНовый,
				   //+МАН 03.12.24 Добавлено для заполнения Ломбарда
	               |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.НакладнаяНаОтгрузку.Ломбард КАК Ломбард
				   //-МАН
	               |ИЗ
	               |	РегистрСведений.ЛБ_СтатусыНакладнойНаОтгрузку.СрезПоследних(&Дата, НакладнаяНаОтгрузку В (&Список)) КАК ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних
	               |ГДЕ
	               |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.СтатусНакладной = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыНакладнойНаОтгрузку.Отгружена)"; 
  	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();   
		
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Период КАК Период,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
	               |	СУММА(ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Количество) КАК Количество,
	               |	СУММА(ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Вес) КАК Вес,
	               |	СУММА(ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.СуммаОценки) КАК СуммаОценки
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке КАК ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке
	               |ГДЕ
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.НакладнаяНаОтгрузку = &НакладнаяНаОтгрузку
	               |	И ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |	И ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Период < &Дата
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.НакладнаяНаОтгрузку,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Период
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ";
	Для каждого Стр Из ТаблицаЗапроса Цикл 
		Запрос.УстановитьПараметр("НакладнаяНаОтгрузку", Стр.НакладнаяНаОтгрузку);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда  
			Стр.КоличествоИзделий = Выборка.Количество;
			Стр.ВесИзделий = Выборка.Вес;
			Стр.СуммаОценки = Выборка.СуммаОценки;
		КонецЕсли;	
	Конеццикла;	
		
	//Если НЕ ЗначениеЗаполнено(Документ) Тогда 
	//	Запрос.Текст = "ВЫБРАТЬ
	//	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
	//	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	//	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	//	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус КАК Статус
	//	               |ИЗ
	//	               |	РегистрСведений.ЛБ_СтатусыОбъектовЗалогаВНакладной.СрезПоследних(, НакладнаяНаОтгрузку В (&Список)) КАК ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних
	//	               |ГДЕ
	//	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.ИсключенИзНакладной)";
	//	ТаблицаСтатусовВНакладной = Запрос.Выполнить().Выгрузить();  
	//	
	//	Для каждого СтрЗ Из ТаблицаЗапроса Цикл 
	//		Для каждого Стр Из СтрЗ.НакладнаяНаОтгрузку.Залоги Цикл
	//			Отбор = Новый Структура;
	//			Отбор.Вставить("НакладнаяНаОтгрузку", СтрЗ.НакладнаяНаОтгрузку);
	//			Отбор.Вставить("ЗалоговыйБилет", Стр.ЗалоговыйБилет);
	//			Отбор.Вставить("ОбъектЗалога", Стр.ОбъектЗалога); 
	//			
	//			Строки = ТаблицаСтатусовВНакладной.НайтиСтроки(Отбор); 
	//			Если НЕ Строки.Количество() = 0 тогда
	//				СтрЗ.КоличествоИзделий = СтрЗ.КоличествоИзделий - Стр.Количество;  
	//				СтрЗ.ВесИзделий = СтрЗ.ВесИзделий - Стр.Вес;
	//				СтрЗ.СуммаОценки = СтрЗ.СуммаОценки - Стр.СуммаОценки;
	//			КонецЕсли	
	//		Конеццикла;	
	//	КонецЦикла; 
	//Иначе         
	Если ЗначениеЗаполнено(Документ) Тогда 
		ТаблицаЗапроса.ЗаполнитьЗначения(Перечисления.ЛБ_статусыНакладнойНаОтгрузку.ПустаяСсылка(), "СтатусНакладнойНовый");
		Запрос.УстановитьПараметр("Регистратор", Документ);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_СтатусыНакладнойНаОтгрузку.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
		               |	ЛБ_СтатусыНакладнойНаОтгрузку.СтатусНакладной КАК СтатусНакладной
		               |ИЗ
		               |	РегистрСведений.ЛБ_СтатусыНакладнойНаОтгрузку КАК ЛБ_СтатусыНакладнойНаОтгрузку
		               |ГДЕ
		               |	ЛБ_СтатусыНакладнойНаОтгрузку.Регистратор = &Регистратор";  
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл 
			Отбор = Новый Структура;
			Отбор.Вставить("НакладнаяНаОтгрузку", Выборка.НакладнаяНаОтгрузку);
			строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
			Для каждого Стр Из Строки Цикл
				Стр.СтатусНакладнойНовый = Выборка.СтатусНакладной;
            Конеццикла;
		КонецЦикла;	
	КонецЕсли;	
	
	ТаблицаВыбора.Загрузить(ТаблицаЗапроса);     
КонецПроцедуры	
	
&НаКлиенте
Процедура ПослеВыбораНакладных(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
	    Возврат;
	КонецЕсли; 
	
	СписокНакладных = Результат; 
	ЗаполнитьТаблицу();  
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОтгрузку(Команда)       
	СписокНакладныхДляОтмены = Новый СписокЗначений;  
	Для каждого стр Из ТаблицаВыбора Цикл    
		Если Стр.Вкл Тогда 
			СписокНакладныхДляОтмены.Добавить(Стр.НакладнаяНаОтгрузку);
		КонецЕсли;	
	КонецЦикла;	
	Если СписокНакладныхДляОтмены.Количество() = 0 Тогда
		Предупреждение("Не выбраны накладные для отмены отгрузки", 60); 
	Иначе  
		Закрыть(СписокНакладныхДляОтмены);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры



