
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", Дата);  
	Запрос.УстановитьПараметр("Отделение", Отделение);  
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард
	               |ИЗ
	               |	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, Отделение = &Отделение) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
	               |ГДЕ
	               |	НЕ ЛБ_ОтделенияЛомбардовСрезПоследних.Регистратор = &Регистратор";
	ТаблицаЛомбардов = Запрос.Выполнить().Выгрузить();
	
	Движения.ЛБ_ОтделенияЛомбардов.Записывать = Истина;  
	Для каждого стр Из ЭтотОбъект.Ломбарды Цикл 
		Отбор = Новый Структура;
		Отбор.Вставить("Ломбард", стр.Ломбард);
		СтрокиЛ = ТаблицаЛомбардов.НайтиСтроки(Отбор);  
		Если СтрокиЛ.Количество() = 0 Тогда
			Движение = Движения.ЛБ_ОтделенияЛомбардов.Добавить();
		    Движение.Период = Дата; 
			Движение.Ломбард = Стр.Ломбард;
			Движение.Отделение = ЭтотОбъект.Отделение; 
			Движение.Центральный = Стр.ЦентральныйЛомбард;
		КонецЕсли; 
	КонецЦикла;	
	
КонецПроцедуры
