#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//СК [21.12.2018] (штрихкодирование)
Процедура ПередЗаписью(Отказ)
	
	//Если ОбменДанными.Загрузка ИЛИ ПометкаУдаления ИЛИ ЭтоГруппа Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//Если ЭтоНовый() Тогда
	//	//Для проверки КодДляСозданияШК на уникальность
	//	УстановитьСсылкуНового(Ссылка);
	//	
	//	//Заполнение КодДляСозданияШК
	//	УстановитьНовыйКод();
	//	
	//	НовыйКод = Прав(СокрЛП(Код),3);
	//	
	//КонецЕсли;	
	
КонецПроцедуры


#КонецЕсли	