
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("ОткрытьКарточкуНеОбрабатыватьВыбор", );
	//lion 12.08.2025
	ПараметрыФормы = Новый Структура("ОткрытьКарточкуНеОбрабатыватьВыбор",true );
	//+++ Моисеев 20250526
	//ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателяРедактирование", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	ФормаДляОткрытияЗалогодателя = ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателя", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	//--- Моисеев 20250526
КонецПроцедуры
