#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт

//	ПараметрыПроведения = Новый Структура;
//	
//	Запрос = Новый Запрос;
//	
//	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
//	Запрос.Текст = ТекстЗапросаРеквизитыДокумента();
//	Результат = Запрос.Выполнить();
//	ПараметрыПроведения.Вставить("ТаблицаРеквизитов", Результат.Выгрузить());
//	
//	Реквизиты = ПараметрыПроведения.ТаблицаРеквизитов[0];
//	
//	Запрос.УстановитьПараметр("НеПроводитьНулевыеЗначения", Реквизиты.НеПроводитьНулевыеЗначения);
//	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета());
//	
//	
//	НомераТаблиц = Новый Структура;
//	Запрос.Текст = ТекстЗапросаУстановкаЦен(НомераТаблиц);
//		
//	Результат = Запрос.ВыполнитьПакет();
//	
//	Для каждого НомерТаблицы Из НомераТаблиц Цикл
//		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
//	КонецЦикла;
//	
//	Возврат ПараметрыПроведения;
//	
//КонецФункции 
//	
/////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ДВИЖЕНИЙ

//Процедура СформироватьДвиженияУстановкаЦен(Таблица, ТаблицаРеквизитов, Движения, Отказ) Экспорт
//	
//	Если Таблица.Количество() = 0 Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Реквизиты = ТаблицаРеквизитов[0];
//	
//	Дата   = Реквизиты.Период;
//	ТипЦен = Реквизиты.ТипЦен;
//	
//	Для каждого СтрокаТовара Из Таблица Цикл

//		Движение = Движения.ЦеныНоменклатуры.Добавить();
//		
//		Движение.Период 	  = Дата;
//		Движение.ТипЦен       = ТипЦен;
//		Движение.Номенклатура = СтрокаТовара.Номенклатура;
//		Движение.Цена   	  = СтрокаТовара.Цена;
//		Движение.Валюта 	  = СтрокаТовара.Валюта;
//		
//	КонецЦикла;
//	
//	Движения.ЦеныНоменклатуры.Записывать = Истина;
//	
//КонецПроцедуры

#КонецЕсли