
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьТабличнуюЧастьМакеты();
	
КонецПроцедуры
  
&НаКлиенте
Процедура ПослеРедактированияМакета(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
	    Возврат;
	КонецЕсли; 
	
	ЗаполнитьТабличнуюЧастьМакеты();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличнуюЧастьМакеты()
	
	ТаблицаМакетов.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_МакетыПечатныхФорм.ВерсияМакета КАК ВерсияМакета
		|ИЗ
		|	РегистрСведений.ЛБ_МакетыПечатныхФорм КАК ЛБ_МакетыПечатныхФорм
		|ГДЕ
		|	ЛБ_МакетыПечатныхФорм.ИсходныйМакет = &ИсходныйМакет
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_МакетыПечатныхФорм.Период";
	
	Запрос.УстановитьПараметр("ИсходныйМакет", Объект.Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ТаблицаМакетов.Добавить();
			НоваяСтрока.Макет = Выборка.ВерсияМакета;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМакетовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр) 
	
	ИмяДокумента = Объект.Наименование;              
	ИмяОбъектаМетаданныхМакета = СтрШаблон("ОбщийМакет.ЛБ_%1", Объект.ИмяПредопределенныхДанных);
	
	Оповещение = Новый ОписаниеОповещения("ПослеРедактированияМакета", ЭтотОбъект);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ИмяОбъектаМетаданныхМакета", ИмяОбъектаМетаданныхМакета);
	ПараметрыОткрытия.Вставить("ТипМакета", "MXL");
	ПараметрыОткрытия.Вставить("СохранитьВерсиюМакета", Истина);
	ПараметрыОткрытия.Вставить("ИмяДокумента", ИмяДокумента);
	ПараметрыОткрытия.Вставить("Редактирование", Истина); 
	
	ОткрытьФорму("ОбщаяФорма.РедактированиеТабличногоДокумента", ПараметрыОткрытия, ЭтотОбъект, , , , Оповещение);
	Возврат; 
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьМакет(Команда)

	ТекущиеДанные = Элементы.ТаблицаМакетов.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		
		ИмяДокумента = Объект.Наименование;
		
		Оповещение = Новый ОписаниеОповещения("ПослеРедактированияМакета", ЭтотОбъект);
		
		ПараметрыОткрытия = Новый Структура;
		//ПараметрыОткрытия.Вставить("ИмяОбъектаМетаданныхМакета", ИмяОбъектаМетаданныхМакета);
		//ПараметрыОткрытия.Вставить("ТипМакета", "MXL");
		ПараметрыОткрытия.Вставить("СохранитьВерсиюМакета", Истина);
		ПараметрыОткрытия.Вставить("ИмяДокумента", ИмяДокумента);
		ПараметрыОткрытия.Вставить("Редактирование", Истина);
		ПараметрыОткрытия.Вставить("ВерсияМакета", ПолучитьВерсиюМакета(ТекущиеДанные.Макет));
		
		ОткрытьФорму("ОбщаяФорма.РедактированиеТабличногоДокумента", ПараметрыОткрытия, ЭтотОбъект, , , , Оповещение);
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьМакет(Команда)
	
    ТекущиеДанные = Элементы.ТаблицаМакетов.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
	    УдалитьМакетНаСервере(ТекущиеДанные.Макет);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьМакетНаСервере(ВерсияМакета)
	
	НаборЗаписей = РегистрыСведений.ЛБ_МакетыПечатныхФорм.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИсходныйМакет.Установить(Объект.Наименование);
	НаборЗаписей.Отбор.ВерсияМакета.Установить(ВерсияМакета);
	
	НаборЗаписей.Записать();
	
	ЗаполнитьТабличнуюЧастьМакеты();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВерсиюМакета(ВерсияМакета)
	
	ПараметрыМакета = Новый Структура("ТабличныйДокумент, ДатаМакета", Неопределено, Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_МакетыПечатныхФорм.Макет КАК Макет,
		|	ЛБ_МакетыПечатныхФорм.Период КАК Период
		|ИЗ
		|	РегистрСведений.ЛБ_МакетыПечатныхФорм КАК ЛБ_МакетыПечатныхФорм
		|ГДЕ
		|	ЛБ_МакетыПечатныхФорм.ИсходныйМакет = &ИсходныйМакет
		|	И ЛБ_МакетыПечатныхФорм.ВерсияМакета = &ВерсияМакета";
	
	Запрос.УстановитьПараметр("ВерсияМакета", ВерсияМакета);
	Запрос.УстановитьПараметр("ИсходныйМакет", Объект.Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ПараметрыМакета.ТабличныйДокумент = Выборка.Макет.Получить();
			ПараметрыМакета.ДатаМакета        = Выборка.Период;
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат ПараметрыМакета;
	
КонецФункции   

























