// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	
	Движения.ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Записывать = Истина;  
	Движения.ЛБ_СостояниеОбъектаЗалога.Записывать = Истина;
	Движения.ЛБ_СтатусыОбъектовЗалогаВНакладной.Записывать = Истина;
	Для каждого Стр Из ЭтотОбъект.Залоги Цикл
		Движение = Движения.ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
	    Движение.Организация = Организация; 
		Движение.Ломбард = Ломбард;   
		Движение.НакладнаяНаОтгрузку = ЭтотОбъект.Ссылка;
		Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
		Движение.ОбъектЗалога = Стр.ОбъектЗалога;
		Движение.Количество = Стр.Количество;   
		Движение.Вес = Стр.Вес;
		Движение.СуммаОценки = Стр.СуммаОценки; 
		
		Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить();
        Движение.Период = Дата;
		Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
		Движение.ОбъектЗалога = Стр.ОбъектЗалога;
		Если ЭтотОбъект.ПовышеннаяОценка Тогда  
			Движение.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ОбъявленТорг;
		Иначе 
			Движение.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ВключенВНакладную;
		КонецЕсли;	   
		СтруктураОЗ = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектовЗалогаЗалоговогоБилета(Дата, Стр.ЗалоговыйБилет, Стр.ОбъектЗалога);
		Если НЕ СтруктураОЗ = неопределено Тогда
			Движение.СуммаЗайма = СтруктураОЗ.СуммаЗайма; 
			Движение.СуммаДолгаЗайма = СтруктураОЗ.СуммаДолгаЗайма;
			Движение.СуммаОплаты = СтруктураОЗ.СуммаОплаты;
			Движение.СуммаОценки = СтруктураОЗ.СуммаОценки; 
			Движение.СуммаОценкиНачальная = СтруктураОЗ.СуммаОценкиНач;
		КонецЕсли;
		
		Движение = Движения.ЛБ_СтатусыОбъектовЗалогаВНакладной.Добавить();
		Движение.Период = Дата;
		Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
		Движение.ОбъектЗалога = Стр.ОбъектЗалога;
       	Движение.НакладнаяНаОтгрузку = ЭтотОбъект.Ссылка;
		Движение.Статус = ?(ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыНакладнойНаОтгрузку.Автоматически, Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.Факт, Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.СумкаЗакрыта);
	Конеццикла;	  
	
	Движения.ЛБ_СтатусыНакладнойНаОтгрузку.Записывать = Истина;
	Движение = Движения.ЛБ_СтатусыНакладнойНаОтгрузку.Добавить(); 
	Движение.Период = Дата;
	Движение.НакладнаяНаОтгрузку = ЭтотОбъект.Ссылка; 
	Движение.НомерНакладной = ЭтотОбъект.ПредставлениеНомераНакладной;
	Движение.ДатаНакладной = ЭтотОбъект.Дата;
	Движение.ОтказОтВыкупа = ЭтотОбъект.ОтказОтВыкупа;
	Движение.ПовышеннаяОценка = ЭтотОбъект.ПовышеннаяОценка;
	Движение.СтатусНакладной = ?(ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыНакладнойНаОтгрузку.Автоматически, Перечисления.ЛБ_СтатусыНакладнойНаОтгрузку.Факт, Перечисления.ЛБ_СтатусыНакладнойНаОтгрузку.СумкаЗакрыта); 
	Движение.Комментарий = ЭтотОбъект.Комментарий;   
	Движение.ОтветственныйСотрудник = ПараметрыСеанса.ТекущийСотрудник;
	Движение.ОтветственныйПользователь = ПараметрыСеанса.ТекущийПользователь;
		
	ТаблицаЗБ = ЭтотОбъект.Залоги.Выгрузить(); 
	ТаблицаЗБ.Свернуть("ЗалоговыйБилет");
	Движения.ЛБ_СостояниеЗалоговогоБилета.Записывать = Истина;  
	Движения.ЛБ_ОборотыПоОперациямЗайма.Записывать = Истина;
	Для каждого стрЗБ Из ТаблицаЗБ Цикл 
		Движение = Движения.ЛБ_ОборотыПоОперациямЗайма.Добавить();
		Движение.Период = Дата;
		Движение.ЗалоговыйБилет = СтрЗБ.ЗалоговыйБилет;
        Движение.Залогодатель = СтрЗБ.ЗалоговыйБилет.Залогодатель;
        Движение.Организация = ЭтотОбъект.Организация;
		Движение.Ломбард = ЭтотОбъект.Ломбард; 
		Движение.НакладнаяНаОтгрузку = ЭтотОбъект.Ссылка;
		
	    Движение = Движения.ЛБ_СостояниеЗалоговогоБилета.Добавить(); 
		Движение.Период = Дата;
		Движение.ЗалоговыйБилет = СтрЗБ.ЗалоговыйБилет;
		Движение.Залогодатель = СтрЗБ.ЗалоговыйБилет.Залогодатель;
		Движение.НомерЗалоговогоБилета = СтрЗБ.ЗалоговыйБилет.НомерЗалоговогоБилета; 
		Движение.СхемаКредитования = СтрЗБ.ЗалоговыйБилет.СхемаКредитования; 
		СтруктураЗБ = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗалоговогоБилета(ЭтотОбъект.Ссылка, СтрЗБ.ЗалоговыйБилет);
		Если НЕ СтруктураЗБ = неопределено Тогда
		    Движение.СуммаЗайма = СтруктураЗБ.СуммаЗайма; 
			Движение.ДатаНачалаРасчетаПроцентов = СтруктураЗБ.ДатаНачалаРасчета;
			Движение.ДатаВыкупа = СтруктураЗБ.ДатаВыкупа;
			Движение.ДатаВыкупаЛьготныйСрок = СтруктураЗБ.ДатаВыкупаЛьготныйСрок;
			Движение.НомерДопСоглашения = СтруктураЗБ.НомерДопСоглашения;
			Движение.ПричинаПрименения = СтруктураЗБ.ПричинаПрименения;  			
		КонецЕсли;	
		Если ЭтотОбъект.ПовышеннаяОценка Тогда
		    Движение.СтатусЗалоговогоБилета =  Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОбъявленТорг;
		Иначе  
			Движение.СтатусЗалоговогоБилета =  Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ВключенВНакладную;
		КонецЕсли;	
	КонецЦикла;	   
	
КонецПроцедуры	

// Процедура - обработчик события "ОбработкаУдаленияПроведения".
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	ЗапросП = Новый Запрос; 
	ЗапросП.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	ЗапросП.Текст = "ВЫБРАТЬ
	                |	ЛБ_СтатусыНакладнойНаОтгрузку.Регистратор КАК Регистратор
	                |ИЗ
	                |	РегистрСведений.ЛБ_СтатусыНакладнойНаОтгрузку КАК ЛБ_СтатусыНакладнойНаОтгрузку
	                |ГДЕ
	                |	ЛБ_СтатусыНакладнойНаОтгрузку.Регистратор <> &Регистратор
	                |	И ЛБ_СтатусыНакладнойНаОтгрузку.НакладнаяНаОтгрузку = &Регистратор";
	ВыборкаП = ЗапросП.Выполнить().Выбрать();
	Если ВыборкаП.Следующий() тогда 
		Сообщить("По накладной на отгрузку есть более поздние операции. Снятие документа с проведения запрещено.");  
		Отказ = Истина;
		Возврат;
	КонецЕсли;      
	
	ЗапросП = Новый Запрос; 
	ЗапросП.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	ЗапросП.Текст = "ВЫБРАТЬ
	                |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Регистратор КАК Регистратор
	                |ИЗ
	                |	РегистрНакопления.ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке КАК ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке
	                |ГДЕ
	                |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Регистратор <> &Регистратор
	                |	И ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.НакладнаяНаОтгрузку = &Регистратор";
	ВыборкаП = ЗапросП.Выполнить().Выбрать();
	Если ВыборкаП.Следующий() тогда 
		Сообщить("По накладной на отгрузку есть более поздние операции. Снятие документа с проведения запрещено.");  
		Отказ = Истина;
		Возврат;
	КонецЕсли;              
КонецПроцедуры // ОбработкаУдаленияПроведения()

