// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ШаблонПриказа) Тогда 
			ОбщегоНазначения.СообщитьПользователю("Не выбран шаблон приказа для отмены!");
			Отказ = Истина;      
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры
	
// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)  
	Движения.ЛБ_УстановкаОтменаШаблонаПриказа.Записывать = Истина;
		
	ОбменДаннымиСервер.УдалитьДвиженияУДокумента(ЭтотОбъект);
	
	
	Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийУстановитьШаблонПриказа.ПроцентныеСтавки Тогда 
		Для каждого Стр Из ЭтотОбъект.Ломбарды Цикл
			ДвижениеШаблон = Движения.ЛБ_УстановкаОтменаШаблонаПриказа.Добавить();
			ДвижениеШаблон.Период = Дата;
			ДвижениеШаблон.Ломбард = Стр.Ломбард;
			ДвижениеШаблон.СхемаКредитования = ЭтотОбъект.СхемаКредитования;  
			ДвижениеШаблон.ВидШаблона = ЭтотОбъект.ВидОперации;
			ДвижениеШаблон.ШаблонПриказа = ЭтотОбъект.ШаблонПриказа;
            ДвижениеШаблон.Отменен = Истина;
		КонецЦикла;	
	ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийУстановитьШаблонПриказа.ПроцентныеСтавкиАкция Тогда 
		Для каждого Стр Из ЭтотОбъект.Ломбарды Цикл
			ДвижениеШаблон = Движения.ЛБ_УстановкаОтменаШаблонаПриказа.Добавить();
			ДвижениеШаблон.Период = Дата;
			ДвижениеШаблон.Ломбард = Стр.Ломбард;
			ДвижениеШаблон.Акция = ЭтотОбъект.Акция;  
			ДвижениеШаблон.ВидШаблона = ЭтотОбъект.ВидОперации;
			ДвижениеШаблон.ШаблонПриказа = ЭтотОбъект.ШаблонПриказа;
            ДвижениеШаблон.Отменен = Истина;
		КонецЦикла;	
	Иначе
		Для каждого Стр Из ЭтотОбъект.Ломбарды Цикл
			ДвижениеШаблон = Движения.ЛБ_УстановкаОтменаШаблонаПриказа.Добавить();
			ДвижениеШаблон.Период = Дата;
			ДвижениеШаблон.Ломбард = Стр.Ломбард;
			ДвижениеШаблон.ВидШаблона = ЭтотОбъект.ВидОперации;
			ДвижениеШаблон.ШаблонПриказа = ЭтотОбъект.ШаблонПриказа;
            ДвижениеШаблон.Отменен = Истина;
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры	

//+МАН 16.03.26 Добавлена запись номера без нулей. Завка 3654.
Процедура ПриЗаписи(Отказ)
	Если ПустаяСтрока(ЭтотОбъект.НомерДокументаБезНулей) Тогда
		ЭтотОбъект.НомерДокументаБезНулей = СтроковыеФункцииКлиентСервер.УдалитьПовторяющиесяСимволы(ЭтотОбъект.Номер, "0");
		ЭтотОбъект.Записать();
	КонецЕсли;
КонецПроцедуры
//-МАН
