
&НаКлиенте
Процедура ВидСкладаОткудаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВидСкладаНачалоВыбора(Элемент, "Откуда");	                                                
КонецПроцедуры

&НаКлиенте
Процедура ВидСкладаКудаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВидСкладаНачалоВыбора(Элемент, "Куда");	
КонецПроцедуры

&НаКлиенте
Процедура ВидСкладаНачалоВыбора(Элемент, Направление)
	ЭтоЦО = Ложь;
	Если Направление = "Откуда" И Запись.Откуда = ПредопределенноеЗначение("Перечисление.ЛБ_ДвиженияОбъектовЗалога.ЦО") Тогда
		ЭтоЦО = Истина;
	ИначеЕсли Направление = "Куда" И Запись.Куда = ПредопределенноеЗначение("Перечисление.ЛБ_ДвиженияОбъектовЗалога.ЦО") Тогда
		ЭтоЦО = Истина;
	КонецЕсли;	       
	
	Если ЭтоЦО Тогда
	    СписокВыбора = ПолучитьСписокВыбораЦО();
	Иначе	
		СписокВыбора = Новый СписокЗначений; 

		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ЛБ_ВидыСкладов.Залоги")); 
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ЛБ_ВидыСкладов.Витрина"));
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ЛБ_ВидыСкладов.ОтходыДМ"));
	КонецЕсли;
	
	ВыбранноеЗначение = ВыбратьИзСписка(СписокВыбора, Элемент); 

	Если ВыбранноеЗначение <> Неопределено Тогда
		Если Направление = "Откуда" Тогда
	        Запись.ВидСкладаОткуда = ВыбранноеЗначение.Значение; 
		Иначе 
			Запись.ВидСкладаКуда = ВыбранноеЗначение.Значение;
		КонецЕсли;	
	КонецЕсли;        	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокВыбораЦО() 
	СписокВыбора = Новый СписокЗначений;
	Для каждого ЗначениеПеречисления Из Перечисления.ЛБ_ВидыСкладов Цикл 
		Если ЗначениеПеречисления = Перечисления.ЛБ_ВидыСкладов.Залоги Тогда
			Продолжить;  
		ИначеЕсли ЗначениеПеречисления = Перечисления.ЛБ_ВидыСкладов.Витрина Тогда
			Продолжить;	   
		ИначеЕсли ЗначениеПеречисления = Перечисления.ЛБ_ВидыСкладов.ОтходыДМ Тогда
			Продолжить;		
		Иначе	
		    СписокВыбора.Добавить(ЗначениеПеречисления);
		КонецЕсли;	
	КонецЦикла;	
	Возврат СписокВыбора;
КонецФункции	

&НаКлиенте
Процедура ОткудаПриИзменении(Элемент)
	Запись.ВидСкладаОткуда = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыСкладов.ПустаяСсылка");
КонецПроцедуры

&НаКлиенте
Процедура КудаПриИзменении(Элемент)
	Запись.ВидСкладаКуда = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыСкладов.ПустаяСсылка");
КонецПроцедуры
