&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Если Параметры.Свойство("ВидОперации") Тогда
			Объект.ВидОперации = Параметры.ВидОперации; 
		Иначе
			Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.Базовый;
		КонецЕсли;  
		Объект.Дата = ТекущаяДата();
		Объект.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;                
	
    УстановитьСостояниеДокумента();   
	ЛБ_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(, Объект, ЭтаФорма);
КонецПроцедуры 

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость() 
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.Базовый") Тогда 
		Элементы.ШаблоныАкция.Видимость = ложь;
		Элементы.Шаблон.Видимость = Истина; 
		Элементы.СписокЛомбардов.Видимость = Истина;
	Иначе   
		Элементы.ШаблоныАкция.Видимость = Истина;
		Элементы.Шаблон.Видимость = ложь;  
		Элементы.СписокЛомбардов.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    ЗаполнитьСписокЛомбардов();
	Элементы.СписокЛомбардов.Подсказка = Элементы.СписокЛомбардов.Заголовок;
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент) 
	Объект.Шаблон = ПредопределенноеЗначение("Справочник.ЛБ_ШаблоныПриказовМеталлы.ПустаяСсылка");
	Объект.ШаблоныАкция.Очистить();  
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)   
	Объект.СтрокаЛомбарды = СписокЛомбардов;
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись тогда
		Возврат;
	КонецЕсли;		
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.Базовый") Тогда 
		Если НЕ ЗначениеЗаполнено(Объект.Шаблон) Тогда  
			Сообщить("Не выбран шаблон!"); 
			Отказ = Истина;
		КонецЕсли;	
	Иначе        
		ВсеОК = Истина;    
		Для каждого Стр из Объект.ШаблоныАкция Цикл 
			Если НЕ ЗначениеЗаполнено(Стр.Акция) Тогда  
				Сообщить("Ошибка заполнения. В строке № " + Строка(Стр.НомерСтроки) + " не заполнена акция!"); 
				ВсеОК = ложь;
			КонецЕсли;	
			Если НЕ ЗначениеЗаполнено(Стр.Шаблон) Тогда  
				Сообщить("Ошибка заполнения. В строке № " + Строка(Стр.НомерСтроки) + " не выбран шаблон!"); 
				ВсеОК = ложь;
			КонецЕсли;
		КонецЦикла;	
        Если НЕ ВсеОК Тогда
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;	    
КонецПроцедуры

&НаКлиенте
Процедура СписокЛомбардовНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	
	ПараметрыФормы = Новый Структура;    
	ПараметрыФормы.Вставить("Ломбарды", Объект.Ломбарды); 
	ПараметрыФормы.Вставить("ДатаДок", Объект.Дата);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЛомбардов",ЭтаФорма);
	
	ОткрытьФорму("Обработка.ЛБ_ВыборЛомбардовИзСписка.Форма", ПараметрыФормы, Элементы.СписокЛомбардов,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокЛомбардов()
	Результат = "";
	Для каждого Стр Из Объект.Ломбарды Цикл
		Результат = Результат + ?(ПустаяСтрока(Результат), "", "; ") + ?(НЕ ПустаяСтрока(Стр.Ломбард.НаименованиеПолное), СокрЛП(Стр.Ломбард.НаименованиеПолное), СокрЛП(Стр.Ломбард.Наименование));
	КонецЦикла;	
	СписокЛомбардов = Результат;
КонецПроцедуры	
 
&НаСервере
Процедура ПослеВыбораЛомбардов(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;

	Объект.Ломбарды.Очистить();
	КоличествоВыбрано = Результат.Количество;
	Для сч = 1 По КоличествоВыбрано Цикл
		НоваяСтр = Объект.Ломбарды.Добавить();
		НоваяСтр.Ломбард = Результат["Значение" + Строка(сч)];
	КонецЦикла;	
	
	ЗаполнитьСписокЛомбардов();
	Элементы.СписокЛомбардов.Подсказка = Элементы.СписокЛомбардов.Заголовок;
КонецПроцедуры



