
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьИДоступностьЭлементов()
	
	Элементы.Значение.Видимость				= Не Объект.ЭтоСписок И Не Объект.ЭтоСтрокаВнутренняя;
	Элементы.ЭтоПароль.Видимость			= Не Объект.ЭтоСписок И Не Объект.ЭтоСтрокаВнутренняя;
	Элементы.Список.Видимость				= Объект.ЭтоСписок;
	Элементы.ЭтоПароль.Доступность			= РольДоступна("ПолныеПрава") ИЛИ Объект.Ссылка.Пустая();
	Элементы.СписокЭтоПароль.Доступность	= Элементы.ЭтоПароль.Доступность;
	Элементы.Значение.РежимПароля			= Объект.ЭтоПароль;
	Элементы.ЭтоСписок.Видимость			= Не Объект.ЭтоПароль И Не Объект.ЭтоСтрокаВнутренняя;
	Элементы.ЭтоСтрокаВнутренняя.Видимость	= Не Объект.ЭтоСписок И Не Объект.ЭтоПароль;
	Элементы.Значение0.Видимость			= Объект.ЭтоСтрокаВнутренняя;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтоПарольПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтоСписокПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтоСтрокаВнутренняяПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступностьЭлементов();
	
КонецПроцедуры
