&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_Дефекты.Ссылка КАК Ссылка,
	               |	ЛБ_Дефекты.Представление КАК Представление
	               |ИЗ
	               |	Справочник.ЛБ_Дефекты КАК ЛБ_Дефекты
	               |ГДЕ
	               |	ЛБ_Дефекты.ПометкаУдаления = ЛОЖЬ
	               |АВТОУПОРЯДОЧИВАНИЕ";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокДефектов.Добавить(Выборка.Ссылка, Выборка.Представление);
	Конеццикла;	 
	
	Если Параметры.Свойство("Дефекты") Тогда
		Для каждого Эл из Параметры.Дефекты Цикл  
			НайденныйЭлемент = СписокДефектов.НайтиПоЗначению(Эл.Значение);
			Если НЕ НайденныйЭлемент = неопределено Тогда
				НайденныйЭлемент.Пометка = Истина;
			КонецЕсли;	
		Конеццикла;	
	КонецЕсли;   
	
	Если Параметры.Свойство("ДругиеДефекты") Тогда
		ДругиеДефекты = Параметры.ДругиеДефекты;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)  
	СтруктураВозврата = Новый структура;
	СтруктураВозврата.Вставить("СписокДефектов", СписокДефектов);
	СтруктураВозврата.Вставить("ДругиеДефекты", ДругиеДефекты);
	
	ЭтаФорма.Закрыть(СтруктураВозврата);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

