
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Для каждого Стр Из ЭтотОбъект.Лимиты Цикл
		Движения.ЛБ_КассовыеЛимиты.Записывать = Истина;
		Движение = Движения.ЛБ_КассовыеЛимиты.Добавить();
		Движение.Регистратор = ЭтотОбъект.Ссылка;
		Движение.Период = ЭтотОбъект.Дата;
		Движение.Отделение = Стр.Отделение;
		Движение.Ломбард = Стр.Ломбард;
		//Движение.ДатаНачала = Стр.ДатаНачала;
		//Движение.ДатаКонца = Стр.ДатаКонца;
		Движение.РассчетныйЛимит = Стр.РассчетныйЛимит;
		Движение.ФактическийЛимит = Стр.ФактическийЛимит;
	КонецЦикла;
КонецПроцедуры
