

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Приказ = Параметры.Документ.Ссылка;
	ЦеныМеталлы.Загрузить(Приказ.Ссылка.ЦеныМеталлы.Выгрузить()); 
	Если Параметры.ТолькоПросмотр Тогда
		Просмотр = Истина;   
		Элементы.ФормаСохранить.Доступность =ложь;
		Элементы.ВыбратьСхемыКредитования.Доступность = Ложь;
	КонецЕсли;	
	
	МассивСК = Параметры.МассивСК;
	СхемыКредитования.Загрузить(ЛБ_УправлениеЛомбардом.ПреобразованиеМассивВТаблицуЗначений(МассивСК));
	
	Если НЕ СхемыКредитования.Количество() = 0 Тогда 
		Номер = 0;
		Для Каждого Стр Из СхемыКредитования Цикл  
			Номер = Номер + 1;
			Стр.НомерЦвета = Номер;
			ДобавитьКолонкуЦен(Стр.СхемаКредитования, Стр.НомерЦвета);
			ЗаполнитьДопКолонкуМеталлы(Стр.СхемаКредитования);
		КонецЦикла;  
	//+МАН 05.03.25
	Иначе
		Если Параметры.Документ.СхемыКредитования.Количество() = 0 Тогда
			Элементы.НастройкаОтклоненияДобавить.Доступность = Ложь;
		Иначе
			Элементы.НастройкаОтклоненияДобавить.Доступность = Истина;
		КонецЕсли;
	//-МАН
	КонецЕсли;	 
	
	Элементы.НастройкаОтклоненияСхемаКредитования.СписокВыбора.Очистить();
	
	Для каждого СтрСК Из Приказ.СхемыКредитования Цикл
		Элементы.НастройкаОтклоненияСхемаКредитования.СписокВыбора.Добавить(СтрСК.СхемаКредитования);
	КонецЦикла;
	
	Если Просмотр Тогда 
		Элементы.НастройкаОтклонений.Видимость =ложь;
	Иначе                                            
		ЗаполнитьНастройкуОтклонений();
	КонецЕсли;	

	Если ЦеныМеталлы.Количество() > 0 Тогда
		ЗаполнитьСписокВыбораМеталлов();
	Иначе
		Элементы.НастройкаОтклоненияМеталл.СписокВыбора.Очистить();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораМеталлов()
	ТЗ = ЦеныМеталлы.Выгрузить();
	ТЗ.Свернуть("Металл");
	
	Элементы.НастройкаОтклоненияМеталл.СписокВыбора.Очистить();
	
	Для каждого СтрТЗ Из ТЗ Цикл
	    Элементы.НастройкаОтклоненияМеталл.СписокВыбора.Добавить(СтрТЗ.Металл);	
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкуОтклонений() 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Приказ.Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОтносительныеОтклоненияОтБазовыхЦенМеталлыСрезПоследних.СхемаКредитования КАК СхемаКредитования,
	               |	ЛБ_ОтносительныеОтклоненияОтБазовыхЦенМеталлыСрезПоследних.Металл КАК Металл,
	               |	ЛБ_ОтносительныеОтклоненияОтБазовыхЦенМеталлыСрезПоследних.ПроцентОтклонения КАК ПроцентОтклонения,
	               |	ЛБ_ОтносительныеОтклоненияОтБазовыхЦенМеталлыСрезПоследних.УстанавливатьОтклонение КАК УстановитьОтклонение
	               |ИЗ
	               |	РегистрСведений.ЛБ_ОтносительныеОтклоненияОтБазовыхЦенМеталлы.СрезПоследних(&Дата, ) КАК ЛБ_ОтносительныеОтклоненияОтБазовыхЦенМеталлыСрезПоследних";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	НастройкаОтклонения.Загрузить(ТаблицаЗапроса);
КонецПроцедуры	
	
&НаКлиенте
Процедура ВыбратьСхемыКредитования(Команда) 
	СК = ЗаполнитьСписокСК();  
	
	// процедура ПослеОтметкиЭлементов определена чуть ниже
    ОповещениеПослеОтметкиЭлементов = Новый ОписаниеОповещения(
        "ПослеОтметкиЭлементов", ЭтотОбъект
    );	
 
    СК.ПоказатьОтметкуЭлементов(
        ОповещениеПослеОтметкиЭлементов,
        "Выберите схемы кредитования"
    );
КонецПроцедуры

&НаСервере 
Функция ЗаполнитьСписокСК() 
	СК = Новый СписокЗначений;
	//Запрос = Новый Запрос; 
	//Запрос.УстановитьПараметр("Дата", Приказ.Дата);
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ЛБ_СхемыКредитования.Ссылка КАК СхемаКредитования
	//               |ИЗ
	//               |	Справочник.ЛБ_СхемыКредитования КАК ЛБ_СхемыКредитования
	//               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_УсловияПредоставленияКредита.СрезПоследних(&Дата, ) КАК ЛБ_УсловияПредоставленияКредитаСрезПоследних
	//               |		ПО (ЛБ_УсловияПредоставленияКредитаСрезПоследних.СхемаКредитования = ЛБ_СхемыКредитования.Ссылка)
	//               |ГДЕ
	//               |	ЛБ_СхемыКредитования.ПометкаУдаления = ЛОЖЬ
	//               |	И ЛБ_УсловияПредоставленияКредитаСрезПоследних.НеАктуальная = ЛОЖЬ";
	//ТЗ = Запрос.Выполнить().Выгрузить();     
	//Массив = ТЗ.ВыгрузитьКолонку("СхемаКредитования");//выгружаем таблицу значений в массив
	//СК.ЗагрузитьЗначения(Массив);//загружаем массив в список значений  
	
	Массив = Приказ.СхемыКредитования.ВыгрузитьКолонку("СхемаКредитования");
	СК.ЗагрузитьЗначения(Массив);
	
	//Для каждого Стр Из СхемыКредитования Цикл 
	//Для каждого Стр Из СхемыКредитования Цикл
	//	Эл = СК.НайтиПоЗначению(Стр.СхемаКредитования);
	//	Если НЕ Эл = неопределено Тогда
	//        Эл.Пометка = Истина; 
	//	КонецЕсли;
	//Конеццикла;
	Возврат СК;
КонецФункции

&НаКлиенте
Процедура ПослеОтметкиЭлементов(Элементы, Параметры) Экспорт
   	Если Элементы <> Неопределено Тогда
	    Для Каждого Эл Из Элементы Цикл
			Если Эл.Пометка Тогда  
				Отбор = Новый Структура;
				Отбор.Вставить("СхемаКредитования", Эл.Значение);
                Строки = СхемыКредитования.НайтиСтроки(Отбор);
				Если НЕ Строки.Количество() = 0 тогда
					Для каждого Стр Из Строки Цикл
					   СхемыКредитования.Удалить(Стр);
					   УдалитьКолонкуЦен(Стр.СхемаКредитования);
					КонецЦикла;
				КонецЕсли;
			//Иначе
			//	Отбор = Новый Структура;
			//	Отбор.Вставить("СхемаКредитования", Эл.Значение);
			//    Строки = СхемыКредитования.НайтиСтроки(Отбор);
			//	Если Строки.Количество() = 0 тогда 
			//		Номер = СхемыКредитования.Количество()+1;
			//		НоваяСтр = СхемыКредитования.Добавить(); 
			//		НоваяСтр.НомерЦвета = Номер;
			//		НоваяСтр.СхемаКредитования = Эл.Значение; 
			//		ДобавитьКолонкуЦен(НоваяСтр.СхемаКредитования, НоваяСтр.НомерЦвета);
			//		ЗаполнитьДопКолонкуМеталлы(НоваяСтр.СхемаКредитования);
				//КонецЕсли;
            КонецЕсли;
		КонецЦикла;  
    КонецЕсли;
 
КонецПроцедуры  

&НаСервере
Процедура УдалитьКолонкуЦен(СК) 
	ИмяСК = СокрЛП(СК.НаименованиеКраткое);
	МассивУдаляемыхРеквизитов = Новый Массив;   
	МассивУдаляемыхРеквизитов.Добавить("ЦеныМеталлы.Отклонение_" + ИмяСК); 
	МассивУдаляемыхРеквизитов.Добавить("ЦеныМеталлы.ВидОтклонения_" + ИмяСК);
	МассивУдаляемыхРеквизитов.Добавить("ЦеныМеталлы.Цена_" + ИмяСК);
	ИзменитьРеквизиты(, МассивУдаляемыхРеквизитов);
КонецПроцедуры	 
 
 &НаСервере
Процедура ДобавитьКолонкуЦен(СК, НомерЦвета) 
	ИмяСК = СокрЛП(СК.НаименованиеКраткое); 
	МассивДобавляемыхРеквизитов = Новый Массив; 
	НовыйРеквизит = Новый РеквизитФормы("Цена_" + ИмяСК, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)), "ЦеныМеталлы");
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	Если НЕ Просмотр Тогда
		НовыйРеквизит = Новый РеквизитФормы("Отклонение_" + ИмяСК, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10,3)), "ЦеныМеталлы");
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);  
		НовыйРеквизит = Новый РеквизитФормы("ВидОтклонения_" + ИмяСК, Новый ОписаниеТипов("ПеречислениеСсылка.ЛБ_ОтклонениеОтБазовойЦены"), "ЦеныМеталлы");
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит); 
	КонецЕсли;	
	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов); 
	
	Если НомерЦвета%2=0 Тогда
		ЦветФона = WebЦвета.СветлоЖелтый;
	Иначе  
		ЦветФона = WebЦвета.НейтральноЗеленый;
	КонецЕсли;
	
	Если НЕ Просмотр Тогда
		ПолеВвода0 = Элементы.Добавить(
			"ВидОтклонения_" + ИмяСК, Тип("ПолеФормы"), Элементы.ЦеныМеталлы);			
		ПолеВвода0.Заголовок = "Вид откл. (" + ИмяСК+ ")";
		ПолеВвода0.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВвода0.ЦветФона = ЦветФона;	
		ПолеВвода0.ПутьКДанным = "ЦеныМеталлы."+"ВидОтклонения_" + ИмяСК;  
	    ПолеВвода0.ТолькоПросмотр = Истина;

		ПолеВвода1 = Элементы.Добавить(
			"Отклонение_" + ИмяСК, Тип("ПолеФормы"), Элементы.ЦеныМеталлы);			
		ПолеВвода1.Заголовок = "Откл. (" + ИмяСК+ ")";
		ПолеВвода1.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВвода1.ЦветФона = ЦветФона; 
		ПолеВвода1.ПутьКДанным = "ЦеныМеталлы."+"Отклонение_" + ИмяСК;  
	    ПолеВвода1.ТолькоПросмотр = Истина;
	КонецЕсли;	

	//ПолеВвода2 = Элементы.Добавить(
	//	"Цена_" + ИмяСК, Тип("ПолеФормы"), Элементы.ЦеныМеталлы);			
	//ПолеВвода2.Заголовок = "Цена (" + ИмяСК+ ")";
	//ПолеВвода2.Вид = ВидПоляФормы.ПолеВвода;
	//ПолеВвода2.ЦветФона = ЦветФона;
	//ПолеВвода2.ПутьКДанным = "ЦеныМеталлы."+"Цена_" + ИмяСК; 
	//Если Просмотр Тогда
	//    ПолеВвода2.ТолькоПросмотр = Истина; 
	//Иначе	
	//    ПолеВвода2.УстановитьДействие("ПриИзменении", "ПриИзмененииЦеныСК"); 
	//КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ПриИзмененииЦеныСК(Элемент)
	ТекСтрока = Элементы.ЦеныМеталлы.ТекущиеДанные; 
	Поз = Найти(Элемент.Имя, "_");
	Если НЕ Поз = 0 Тогда 
		ТекстСК = Сред(Элемент.Имя, Поз);		
		ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
		ПересчитатьОтклонениеНаСервере(ИдентификаторСтроки, ТекстСК); 
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура ПересчитатьОтклонениеНаСервере(Идентификатор, СК)
	СтрокаТаблицы = ЦеныМеталлы.НайтиПоИдентификатору(Идентификатор);  
	 
	ИмяКолонкиВидОтклонения = "ВидОтклонения" + СК;
	ИмяКолонкиОтклонение = "Отклонение" + СК;
	ИмяКолонкиЦена = "Цена" + СК; 
	
	Если СтрокаТаблицы[ИмяКолонкиВидОтклонения] = ПредопределенноеЗначение("Перечисление.ЛБ_ОтклонениеОтБазовойЦены.Относительное") Тогда
		СтрокаТаблицы[ИмяКолонкиОтклонение] = ?(СтрокаТаблицы.Цена = 0, 0, (СтрокаТаблицы[ИмяКолонкиЦена]/СтрокаТаблицы.Цена - 1)*100);
	Иначе  
		СтрокаТаблицы[ИмяКолонкиОтклонение] = СтрокаТаблицы[ИмяКолонкиЦена] - СтрокаТаблицы.Цена; 
	КонецЕсли;  		
КонецПроцедуры

&НаСервере
Функция ПолучитьЦенуСКМеталлы(СхемаКредитования, Категория, Проба, Цена) 
	Запрос = Новый Запрос;

	//+Мельников 05.09.24 Добавлено условие для приказов по ВИПам. Заявка 2792.
	Если ТипЗнч(Параметры.Документ.Ссылка) <> Тип("ДокументСсылка.ЛБ_ПриказИндивидуальныеУсловия") Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_ПриказУсловияПредоставленияЗаймовНастройкаОтклоненийОтБазовыхЦенМеталлы.Проба КАК Проба,
		               |	ЛБ_ПриказУсловияПредоставленияЗаймовНастройкаОтклоненийОтБазовыхЦенМеталлы.КатегорияОбъектаЗалога КАК Категория,
		               |	ЛБ_ПриказУсловияПредоставленияЗаймовНастройкаОтклоненийОтБазовыхЦенМеталлы.СхемаКредитования КАК СхемаКредитования,
		               |	ЛБ_ПриказУсловияПредоставленияЗаймовНастройкаОтклоненийОтБазовыхЦенМеталлы.ОтклонениеОтБазовойЦены КАК ОтклонениеОтБазовойЦены,
		               |	ЛБ_ПриказУсловияПредоставленияЗаймовНастройкаОтклоненийОтБазовыхЦенМеталлы.ЗначениеОтклонения КАК ЗначениеОтклонения
		               |ИЗ
		               |	Документ.ЛБ_ПриказУсловияПредоставленияЗаймов.НастройкаОтклоненийОтБазовыхЦенМеталлы КАК ЛБ_ПриказУсловияПредоставленияЗаймовНастройкаОтклоненийОтБазовыхЦенМеталлы
		               |ГДЕ
		               |	ЛБ_ПриказУсловияПредоставленияЗаймовНастройкаОтклоненийОтБазовыхЦенМеталлы.Ссылка = &Ссылка
		               |	И ЛБ_ПриказУсловияПредоставленияЗаймовНастройкаОтклоненийОтБазовыхЦенМеталлы.Проба В(&Пробы)
		               |	И ЛБ_ПриказУсловияПредоставленияЗаймовНастройкаОтклоненийОтБазовыхЦенМеталлы.КатегорияОбъектаЗалога В(&Категории)
		               |	И ЛБ_ПриказУсловияПредоставленияЗаймовНастройкаОтклоненийОтБазовыхЦенМеталлы.СхемаКредитования В(&СхемыКредитования)";
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_ПриказИндивидуальныеУсловияНастройкаОтклоненийОтБазовыхЦенМеталлы.Проба КАК Проба,
		               |	ЛБ_ПриказИндивидуальныеУсловияНастройкаОтклоненийОтБазовыхЦенМеталлы.КатегорияОбъектаЗалога КАК Категория,
		               |	ЛБ_ПриказИндивидуальныеУсловияНастройкаОтклоненийОтБазовыхЦенМеталлы.СхемаКредитования КАК СхемаКредитования,
		               |	ЛБ_ПриказИндивидуальныеУсловияНастройкаОтклоненийОтБазовыхЦенМеталлы.ОтклонениеОтБазовойЦены КАК ОтклонениеОтБазовойЦены,
		               |	ЛБ_ПриказИндивидуальныеУсловияНастройкаОтклоненийОтБазовыхЦенМеталлы.ЗначениеОтклонения КАК ЗначениеОтклонения
		               |ИЗ
		               |	Документ.ЛБ_ПриказИндивидуальныеУсловия.НастройкаОтклоненийОтБазовыхЦенМеталлы КАК ЛБ_ПриказИндивидуальныеУсловияНастройкаОтклоненийОтБазовыхЦенМеталлы
		               |ГДЕ
		               |	ЛБ_ПриказИндивидуальныеУсловияНастройкаОтклоненийОтБазовыхЦенМеталлы.Ссылка = &Ссылка
		               |	И ЛБ_ПриказИндивидуальныеУсловияНастройкаОтклоненийОтБазовыхЦенМеталлы.Проба В(&Пробы)
		               |	И ЛБ_ПриказИндивидуальныеУсловияНастройкаОтклоненийОтБазовыхЦенМеталлы.КатегорияОбъектаЗалога В(&Категории)
		               |	И ЛБ_ПриказИндивидуальныеУсловияНастройкаОтклоненийОтБазовыхЦенМеталлы.СхемаКредитования В(&СхемыКредитования)";
	КонецЕсли;
	//-Мельников
	МассивСхем = Новый Массив;
	МассивСхем.Добавить(Справочники.ЛБ_СхемыКредитования.ПустаяСсылка());
	Если ЗначениеЗаполнено(СхемаКредитования) Тогда
		МассивСхем.Добавить(СхемаКредитования);
	КонецЕсли;	
	Запрос.УстановитьПараметр("СхемыКредитования", МассивСхем);
	
	МассивКатегорий = Новый Массив;
	МассивКатегорий.Добавить(Справочники.ЛБ_КатегорииОбъектовЗалога.ПустаяСсылка());
	Если ЗначениеЗаполнено(Категория) Тогда
		МассивКатегорий.Добавить(Категория);
	КонецЕсли;	
	Запрос.УстановитьПараметр("Категории", МассивКатегорий);
		
	МассивПроб = Новый Массив;
	МассивПроб.Добавить(Справочники.ЛБ_Пробы.ПустаяСсылка());

	Если ЗначениеЗаполнено(Проба) Тогда
		МассивПроб.Добавить(Проба);
	КонецЕсли;	
	Запрос.УстановитьПараметр("Пробы", МассивПроб);	
	Запрос.УстановитьПараметр("Ссылка", Приказ.Ссылка);
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	ТаблицаЗапроса.Сортировать("СхемаКредитования Убыв, Категория Убыв, Проба Убыв");
	
	СтруктураВозврата = Новый Структура;   
	СтруктураВозврата.Вставить("Цена", Цена);
	СтруктураВозврата.Вставить("Отклонение", 0); 
	СтруктураВозврата.Вставить("ВидОтклонения", Перечисления.ЛБ_ОтклонениеОтБазовойЦены.ПустаяСсылка());
	
	ЦенаДоп = Цена;
	Отклонение = 0; 
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
		СтрокаЗапроса = ТаблицаЗапроса.Получить(0);
		Если СтрокаЗапроса.ОтклонениеОтБазовойЦены = Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Относительное Тогда
			ЦенаДоп = Цена * (1+СтрокаЗапроса.ЗначениеОтклонения/100);  
			Отклонение = СтрокаЗапроса.ЗначениеОтклонения;
		ИначеЕсли СтрокаЗапроса.ОтклонениеОтБазовойЦены = Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Абсолютное Тогда
			ЦенаДоп = Цена + СтрокаЗапроса.ЗначениеОтклонения; 
			Отклонение = СтрокаЗапроса.ЗначениеОтклонения;
	    КонецЕсли;
	
		СтруктураВозврата.Отклонение = Отклонение; 
		СтруктураВозврата.Цена = ЦенаДоп; 
		СтруктураВозврата.ВидОтклонения = СтрокаЗапроса.ОтклонениеОтБазовойЦены;
	КонецЕсли;	

	Возврат СтруктураВозврата;

КонецФункции

&НаСервере
Процедура ЗаполнитьДопКолонкуМеталлы(СК) 
	ИмяКолонкиЦена = "Цена_" + СокрЛП(СК.НаименованиеКраткое);
	Если НЕ Просмотр Тогда
		ИмяКолонкиОтклонение = "Отклонение_" + СокрЛП(СК.НаименованиеКраткое);
		ИмяКолонкиВидОтклонения = "ВидОтклонения_" + СокрЛП(СК.НаименованиеКраткое); 
	КонецЕсли;	
	
	Для каждого Стр Из ЦеныМеталлы Цикл
	    Результат = ПолучитьЦенуСКМеталлы(СК, Стр.КатегорияОбъектаЗалога, Стр.Проба, Стр.Цена);  
		Стр[ИмяКолонкиЦена] = Результат.Цена; 
		Если НЕ Просмотр Тогда
			Стр[ИмяКолонкиОтклонение] = Результат.Отклонение;
			Стр[ИмяКолонкиВидОтклонения] = Результат.ВидОтклонения;
		КонецЕсли;	
	Конеццикла;
КонецПроцедуры	

&НаСервере
Функция ПреобразоватьСКВМассив()
	Возврат ЛБ_УправлениеЛомбардом.ПреобразованиеТаблицыЗначенийВМассив(СхемыКредитования.Выгрузить());
КонецФункции	

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	Закрыть(ПреобразоватьСКВМассив());
КонецПроцедуры

&НаСервере
Процедура ИзменитьСтрокуНаСервере(Идентификатор)
	СтрокаТаблицы = ЦеныМеталлы.НайтиПоИдентификатору(Идентификатор);  
	Для Каждого СтрК Из СхемыКредитования Цикл  
		ИмяКолонкиВидОтклонения = "ВидОтклонения_" + СокрЛП(СтрК.СхемаКредитования.НаименованиеКраткое);
		ИмяКолонкиОтклонение = "Отклонение_" + СокрЛП(СтрК.СхемаКредитования.НаименованиеКраткое);
		ИмяКолонкиЦена = "Цена_" + СокрЛП(СтрК.СхемаКредитования.НаименованиеКраткое); 
		Отклонение = СтрокаТаблицы[ИмяКолонкиОтклонение];  
		ВидОтклонения = СтрокаТаблицы[ИмяКолонкиВидОтклонения]; 
		Если ВидОтклонения = ПредопределенноеЗначение("Перечисление.ЛБ_ОтклонениеОтБазовойЦены.Относительное") Тогда
			СтрокаТаблицы[ИмяКолонкиЦена]= СтрокаТаблицы.Цена*(1+Отклонение/100); 
		Иначе  
			СтрокаТаблицы[ИмяКолонкиЦена] = СтрокаТаблицы.Цена + Отклонение; 
		КонецЕсли;  
	Конеццикла;	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныМеталлыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ТекСтрока = Элементы.ЦеныМеталлы.ТекущиеДанные;
	ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
	ИзменитьСтрокуНаСервере(ИдентификаторСтроки);
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтклонения(Команда)
	ЕстьВкл = ложь;  	
	Ном = 0;
	Для каждого Стр из НастройкаОтклонения Цикл 
		Ном = Ном + 1;
		Если Стр.Вкл Тогда 
			ЕстьВкл = Истина; 
			Если НЕ ЗначениеЗаполнено(Стр.СхемаКредитования) Тогда
				Сообщить("В строке " + строка(Ном) + " не выбрана схема кредитования!");
			Иначе	
			    УстановитьОтклонения(Стр.ПолучитьИдентификатор()); 				
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	            
	Если НЕ ЕстьВкл Тогда
		Сообщить("Не выбраны настройки отклонения!");
	КонецЕсли;	
КонецПроцедуры 

&НаСервере
Процедура УстановитьОтклонения(ИдентификаторСтроки)  
	СтрокаНастроек = НастройкаОтклонения.НайтиПоИдентификатору(ИдентификаторСтроки);
	СтрокаНастроек.Вкл = ложь;
	ОтборК = Новый Структура;
	ОтборК.Вставить("СхемаКредитования", СтрокаНастроек.СхемаКредитования);
	СтрокиК = СхемыКредитования.НайтиСтроки(ОтборК);
	Если СтрокиК.Количество() = 0 Тогда 
		Номер = СхемыКредитования.Количество()+1;
		НоваяСтр = СхемыКредитования.Добавить(); 
		НоваяСтр.НомерЦвета = Номер;
		НоваяСтр.СхемаКредитования = СтрокаНастроек.СхемаКредитования; 
		ДобавитьКолонкуЦен(НоваяСтр.СхемаКредитования, НоваяСтр.НомерЦвета);
	КонецЕсли;
	
	ИмяКолонкиВидОтклонения = "ВидОтклонения_" + СокрЛП(СтрокаНастроек.СхемаКредитования.НаименованиеКраткое);
	ИмяКолонкиОтклонение = "Отклонение_" + СокрЛП(СтрокаНастроек.СхемаКредитования.НаименованиеКраткое);
	ИмяКолонкиЦена = "Цена_" + СокрЛП(СтрокаНастроек.СхемаКредитования.НаименованиеКраткое);
	
	Металл = СтрокаНастроек.Металл;
		
	Для каждого СтрокаТаблицы Из ЦеныМеталлы Цикл 
		Если ЗначениеЗаполнено(Металл) И НЕ (СтрокаТаблицы.Металл = Металл) Тогда
			Продолжить;
		КонецЕсли;			
		СтрокаТаблицы[ИмяКолонкиВидОтклонения] = СтрокаНастроек.УстановитьОтклонение;  
		СтрокаТаблицы[ИмяКолонкиОтклонение]= СтрокаНастроек.ПроцентОтклонения;
		Если СтрокаНастроек.УстановитьОтклонение = ПредопределенноеЗначение("Перечисление.ЛБ_ОтклонениеОтБазовойЦены.Относительное") Тогда			 
			СтрокаТаблицы[ИмяКолонкиЦена] = СтрокаТаблицы.Цена*(1+СтрокаНастроек.ПроцентОтклонения/100);  
		Иначе  
			СтрокаТаблицы[ИмяКолонкиЦена] = СтрокаТаблицы.Цена+СтрокаНастроек.ПроцентОтклонения; 
		КонецЕсли;  
	КонецЦикла;	
КонецПроцедуры	

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	Для каждого Стр из НастройкаОтклонения Цикл 
		Стр.Вкл = Истина;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)
	Для каждого Стр из НастройкаОтклонения Цикл 
		Стр.Вкл = Ложь;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	Результат = ПроверитьЗаполнениеТЧ();
	
	Если Результат <> "" Тогда
		Предупреждение(Результат);
		Возврат;
	КонецЕсли;
	
	СохранитьИзменения();
	ЭтаФорма.Закрыть(Истина);
КонецПроцедуры 

&НаСервере
Процедура СохранитьИзменения()
	ДокументОбъект = Приказ.ПолучитьОбъект();
	ТаблицаМеталлов = ДокументОбъект.ЦеныМеталлы.Выгрузить();
	ТаблицаНастроек = ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенМеталлы.Выгрузить(); 
	ТаблицаНастроек.Очистить(); 
	
	Для каждого стр Из ЦеныМеталлы Цикл 
		Отбор = Новый Структура;
		Отбор.Вставить("Металл", Стр.Металл);
		Отбор.Вставить("Проба", Стр.Проба); 
		Отбор.Вставить("КатегорияОбъектаЗалога", Стр.КатегорияОбъектаЗалога);
					
		СтрокиМ = ТаблицаМеталлов.НайтиСтроки(Отбор);
		Если НЕ СтрокиМ.Количество() = 0 Тогда
			СтрМ = строкиМ.Получить(0);
			СтрМ.Цена = Стр.Цена;
		КонецЕсли;	
		
		ТаблицаСК = СхемыКредитования.Выгрузить();
		ТаблицаСК.Свернуть("СхемаКредитования");
		Для каждого СтрК Из ТаблицаСК Цикл
			ИмяКолонкиВидОтклонения = "ВидОтклонения_" + СокрЛП(СтрК.СхемаКредитования.НаименованиеКраткое);
		    ИмяКолонкиОтклонение = "Отклонение_" + СокрЛП(СтрК.СхемаКредитования.НаименованиеКраткое);
		    
			НоваяСтрН = ТаблицаНастроек.Добавить(); 
			НоваяСтрН.СхемаКредитования = СтрК.СхемаКредитования;
			НоваяСтрН.Металл = Стр.Металл;
			НоваяСтрН.Проба = Стр.Проба;  
			НоваяСтрН.КатегорияОбъектаЗалога = Стр.КатегорияОбъектаЗалога; 
			НоваяСтрН.ОтклонениеОтБазовойЦены = Стр[ИмяКолонкиВидОтклонения];  
			НоваяСтрН.ЗначениеОтклонения = Стр[ИмяКолонкиОтклонение];
        КонецЦикла;
	Конеццикла;	
	
	ДокументОбъект.ЦеныМеталлы.Загрузить(ТаблицаМеталлов);
	ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенМеталлы.Загрузить(ТаблицаНастроек);
	ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенМеталлы.Сортировать("СхемаКредитования, Металл, Проба, КатегорияОбъектаЗалога");
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
КонецПроцедуры


&НаКлиенте
Процедура Отменить(Команда)
     Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура НастройкаОтклоненияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекСтрокаН = Элементы.НастройкаОтклонения.ТекущиеДанные;
	Если НоваяСтрока Тогда 
		ТекСтрокаН.Вкл = Истина;
		ТекСтрокаН.УстановитьОтклонение = ПредопределенноеЗначение("Перечисление.ЛБ_ОтклонениеОтБазовойЦены.Относительное");
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПередУдалениемНастройкиНаСервере(ИдентификаторСтроки) 
	СтрокаН = НастройкаОтклонения.НайтиПоИдентификатору(ИдентификаторСтроки);
	СК = СтрокаН.СхемаКредитования;
	Металл = СтрокаН.Металл;
	ИмяКолонкиЦена = "Цена_" + СокрЛП(СК.НаименованиеКраткое);
	ИмяКолонкиВидОтклонения = "ВидОтклонения_" + СокрЛП(СК.НаименованиеКраткое);
    ИмяКолонкиОтклонение = "Отклонение_" + СокрЛП(СК.НаименованиеКраткое);

	Для каждого Стр Из ЦеныМеталлы Цикл 
		Если ЗначениеЗаполнено(Металл) И НЕ (Стр.Металл = Металл) Тогда 
			Продолжить;
		КонецЕсли;	   
		Попытка
			Стр[ИмяКолонкиВидОтклонения] = ПредопределенноеЗначение("Перечисление.ЛБ_ОтклонениеОтБазовойЦены.ПустаяСсылка");
			Стр[ИмяКолонкиОтклонение] = 0;
			Стр[ИмяКолонкиЦена] = Стр.Цена; 
		Исключение
		КонецПопытки;	
	КонецЦикла;	
КонецПроцедуры	 

&НаКлиенте
Процедура НастройкаОтклоненияПередУдалением(Элемент, Отказ)
	ТекСтрокаН = Элементы.НастройкаОтклонения.ТекущиеДанные;
	ПередУдалениемНастройкиНаСервере(ТекСтрокаН.ПолучитьИдентификатор());
КонецПроцедуры

&НаКлиенте
Процедура НастройкаОтклоненияПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	ТекСтрокаН = Элементы.НастройкаОтклонения.ТекущиеДанные;
	
	Отбор = Новый Структура("СхемаКредитования, Металл");
	ЗаполнитьЗначенияСвойств(Отбор, ТекСтрокаН);
	
	МассивСтрок = НастройкаОтклонения.НайтиСтроки(Отбор);
	
	Если МассивСтрок.Количество() > 1 Тогда
		Предупреждение("Строка с выбранной схемой кредитования и металлом уже есть в списке.");
		Если НоваяСтрока Тогда
			НастройкаОтклонения.Удалить(НастройкаОтклонения.Количество() - 1);
		Иначе
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверитьЗаполнениеТЧ()
	Текст = "";
	
	Для каждого Стр Из НастройкаОтклонения Цикл
		Если Стр.Вкл Тогда
			
			СКУстановлена = Ложь;
			
			Отбор = Новый Структура;
			Отбор.Вставить("Металл", Стр.Металл);
			
			ТЗМеталлы = ЦеныМеталлы.Выгрузить(Отбор);
			
			Если ТЗМеталлы.Количество() = 0 Тогда
				Текст = "По схеме кредитования " + """" + Стр.СхемаКредитования.Наименование + """" + " и металлу "
				+ """" + Стр.Металл + """" + " не установлены отклонения!";
				Прервать;
			Иначе
				Пн = 0;
				
				Для каждого Колонка Из ТЗМеталлы.Колонки Цикл
				
					НайденныйТекст = СтрНайти(Колонка.Имя, Стр.СхемаКредитования.НаименованиеКраткое);
					
					Если НайденныйТекст > 0 И ЗначениеЗаполнено(ТЗМеталлы.Получить(0)["ВидОтклонения_" + Стр.СхемаКредитования.НаименованиеКраткое]) Тогда
						СКУстановлена = Истина;
						Прервать;
					КонецЕсли;
					
					Пн = Пн + 1;				
				
				КонецЦикла;
				
				Если Не СКУстановлена И Пн = ТЗМеталлы.Колонки.Количество() Тогда
					Текст = "По схеме кредитования " + """" + Стр.СхемаКредитования.Наименование + """" + " и металлу "
					+ """" + Стр.Металл + """" + " не установлены отклонения!";
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Текст;
	
КонецФункции
