
&НаКлиенте
Процедура ВидСкладаПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаСервере
Функция ПолучитьНаименованиеРезерв()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", Объект.Владелец);
	Запрос.УстановитьПараметр("ВидСклада", Объект.ВидСклада);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_Склады.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЛБ_Склады КАК ЛБ_Склады
	               |ГДЕ
	               |	ЛБ_Склады.Владелец = &Владелец
	               |	И ЛБ_Склады.ВидСклада = &ВидСклада";
    Выборка = Запрос.Выполнить().Выбрать();
	Кол = Выборка.Количество();
	Кол = Кол + 1;
	Возврат "Резерв " + Строка(Кол);
КонецФункции

&НаКлиенте
Процедура СформироватьНаименование() 
	Если ЗначениеЗаполнено(Объект.ВидСклада) Тогда 
		Если Объект.ВидСклада = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыСкладов.Резерв") Тогда
			Объект.Наименование = ПолучитьНаименованиеРезерв();
		Иначе	
			Объект.Наименование = Строка(Объект.ВидСклада);   
			Если НЕ Объект.Владелец = ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис") Тогда
			    Объект.Наименование = Объект.Наименование + "_" + сокрЛП(НомерЛомбарда);
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если Параметры.ЗначенияЗаполнения.Свойство("Владелец") Тогда 
			Объект.Владелец = Параметры.ЗначенияЗаполнения.Владелец; 
			НомерЛомбарда = Объект.Владелец.НомерЛомбарда;   
		Иначе
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) 
	Если НЕ Объект.ВидСклада = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыСкладов.Резерв") Тогда
		// проверим есть склад 
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Владелец", ТекущийОбъект.Владелец);
		Запрос.УстановитьПараметр("ВидСклада", ТекущийОбъект.ВидСклада);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_Склады.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.ЛБ_Склады КАК ЛБ_Склады
		               |ГДЕ
		               |	ЛБ_Склады.Владелец = &Владелец
		               |	И ЛБ_Склады.ВидСклада = &ВидСклада";
		Выборка = Запрос.Выполнить().Выбрать(); 
		ЕстьСклад = Ложь;
		Если Выборка.Следующий() Тогда   
			Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда   
				ЕстьСклад = Истина;
			ИначеЕсли НЕ ТекущийОбъект.Ссылка = Выборка.Ссылка Тогда 
				ЕстьСклад = Истина;
			КонецЕсли;	
		КонецЕсли;
		Если ЕстьСклад Тогда 
			ОбщегоНазначения.СообщитьПользователю("В ломбарде уже есть склад с видом """ + Строка(Объект.ВидСклада) + """!");
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокВыбораЦО() 
	СписокВыбора = Новый СписокЗначений;
	Для каждого ЗначениеПеречисления Из Перечисления.ЛБ_ВидыСкладов Цикл 
		Если ЗначениеПеречисления = Перечисления.ЛБ_ВидыСкладов.Залоги Тогда
			Продолжить;  
		ИначеЕсли ЗначениеПеречисления = Перечисления.ЛБ_ВидыСкладов.Витрина Тогда
			Продолжить;	   
		ИначеЕсли ЗначениеПеречисления = Перечисления.ЛБ_ВидыСкладов.ОтходыДМ Тогда
			Продолжить;		
		Иначе	
		    СписокВыбора.Добавить(ЗначениеПеречисления);
		КонецЕсли;	
	КонецЦикла;	
	Возврат СписокВыбора;
КонецФункции	

&НаКлиенте
Процедура ВидСкладаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)  
	СтандартнаяОбработка = Ложь; 
	Если НЕ Объект.Владелец = ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис") Тогда 
		СписокВыбора = Новый СписокЗначений; 

		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ЛБ_ВидыСкладов.Залоги")); 
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ЛБ_ВидыСкладов.Витрина"));
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ЛБ_ВидыСкладов.ОтходыДМ"));
    Иначе   
	    СписокВыбора = ПолучитьСписокВыбораЦО();
	КонецЕсли;	

	ВыбранноеЗначение = ВыбратьИзСписка(СписокВыбора, Элементы.ВидСклада); 

	Если ВыбранноеЗначение <> Неопределено Тогда 
	   Объект.ВидСклада = ВыбранноеЗначение.Значение; 
	   СформироватьНаименование();
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Если НЕ Объект.Владелец = ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис") Тогда
	//	Элементы.Наименование.ТолькоПросмотр = Истина;
	//Иначе
	//	Элементы.Наименование.ТолькоПросмотр = Ложь;
	//КонецЕсли;	
КонецПроцедуры
