
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Приказ = Параметры.Приказ.Ссылка;
	НастройкаОтклонения.Загрузить(Приказ.Ссылка.НастройкаОтклоненийОтБазовыхЦенВставки.Выгрузить()); 
	Если Параметры.ТолькоПросмотр Тогда
		Просмотр = Истина;   
		Элементы.ФормаСохранить.Доступность =Ложь;
		Элементы.НастройкаОтклонения.ТолькоПросмотр = Истина;
		Элементы.НастройкаОтклоненияДобавить.Доступность = Ложь;
		Элементы.НастройкаОтклоненияЗаполнитьЦеныВставокПоШаблону.Доступность = Ложь;
	КонецЕсли;	
	
	//МассивСК = Параметры.МассивСК;
	//СхемыКредитования.Загрузить(ЛБ_УправлениеЛомбардом.ПреобразованиеМассивВТаблицуЗначений(МассивСК));
	//
	//Если НЕ СхемыКредитования.Количество() = 0 Тогда 
	//	Номер = 0;
	//	Для Каждого Стр Из СхемыКредитования Цикл  
	//		Номер = Номер + 1;
	//		Стр.НомерЦвета = Номер;
	//		ДобавитьКолонкуЦен(Стр.СхемаКредитования, Стр.НомерЦвета);
	//		ЗаполнитьДопКолонкуМеталлы(Стр.СхемаКредитования);
	//	КонецЦикла;  
	//КонецЕсли;	 
	//
	Элементы.НастройкаОтклоненияСхемаКредитования.СписокВыбора.Очистить();
	
	Для каждого СтрСК Из Приказ.СхемыКредитования Цикл
		Элементы.НастройкаОтклоненияСхемаКредитования.СписокВыбора.Добавить(СтрСК.СхемаКредитования);
	КонецЦикла;
	//
	//Если Просмотр Тогда 
	//	Элементы.НастройкаОтклонений.Видимость =ложь;
	//Иначе                                            
	//	ЗаполнитьНастройкуОтклонений();
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СтруктураПроверки = ПроверитьЗаполнениеТЧ();
	
	Если НЕ СтруктураПроверки.Заполнено Тогда
		Сообщить(СтруктураПроверки.Текст);
		Возврат;
	КонецЕсли;
	
	СохранитьИзменения();
	ЭтаФорма.Закрыть(Истина);
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	Закрыть();
КонецПроцедуры
 
 &НаСервере
Процедура СохранитьИзменения()
	ДокументОбъект = Приказ.ПолучитьОбъект();
	//ТаблицаМеталлов = ДокументОбъект.ЦеныМеталлы.Выгрузить();
	ТаблицаНастроек = ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенВставки.Выгрузить(); 
	ТаблицаНастроек.Очистить(); 

	ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенВставки.Загрузить(НастройкаОтклонения.Выгрузить());
	
	//НастройкаОтклонения.Загрузить(Приказ.Ссылка.НастройкаОтклоненийОтБазовыхЦенВставки.Выгрузить()); 

	//Для каждого стр Из ЦеныМеталлы Цикл 
	//	Отбор = Новый Структура;
	//	Отбор.Вставить("Металл", Стр.Металл);
	//	Отбор.Вставить("Проба", Стр.Проба); 
	//	Отбор.Вставить("КатегорияОбъектаЗалога", Стр.КатегорияОбъектаЗалога);
	//				
	//	СтрокиМ = ТаблицаМеталлов.НайтиСтроки(Отбор);
	//	Если НЕ СтрокиМ.Количество() = 0 Тогда
	//		СтрМ = строкиМ.Получить(0);
	//		СтрМ.Цена = Стр.Цена;
	//	КонецЕсли;	
	//	
	//	ТаблицаСК = СхемыКредитования.Выгрузить();
	//	ТаблицаСК.Свернуть("СхемаКредитования");
	//	Для каждого СтрК Из ТаблицаСК Цикл
	//		ИмяКолонкиВидОтклонения = "ВидОтклонения_" + СокрЛП(СтрК.СхемаКредитования.НаименованиеКраткое);
	//	    ИмяКолонкиОтклонение = "Отклонение_" + СокрЛП(СтрК.СхемаКредитования.НаименованиеКраткое);
	//	    
	//		НоваяСтрН = ТаблицаНастроек.Добавить(); 
	//		НоваяСтрН.СхемаКредитования = СтрК.СхемаКредитования;
	//		НоваяСтрН.Металл = Стр.Металл;
	//		НоваяСтрН.Проба = Стр.Проба;  
	//		НоваяСтрН.КатегорияОбъектаЗалога = Стр.КатегорияОбъектаЗалога; 
	//		НоваяСтрН.ОтклонениеОтБазовойЦены = Стр[ИмяКолонкиВидОтклонения];  
	//		НоваяСтрН.ЗначениеОтклонения = Стр[ИмяКолонкиОтклонение];
	//    КонецЦикла;
	//Конеццикла;	
	
	//ДокументОбъект.ЦеныМеталлы.Загрузить(ТаблицаМеталлов);
	//ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенМеталлы.Загрузить(ТаблицаНастроек);
	//ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенМеталлы.Сортировать("СхемаКредитования, Металл, Проба, КатегорияОбъектаЗалога");
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦеныВставокПоШаблону(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);

	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораШаблонаВставок", ЭтаФорма);

	ОткрытьФорму("Справочник.ЛБ_ШаблоныПриказовВставки.ФормаВыбора",ПараметрыФормы,
	        ЭтаФорма, , , , ОбработкаВыбора);
КонецПроцедуры  
		
&НаКлиенте
Процедура ПриЗакрытииФормыВыбораШаблонаВставок(Значение, ДопПараметры) Экспорт

	Если Значение = Неопределено Тогда  
		Возврат;
    КонецЕсли;
     
    ШаблонПриказа  = Значение;  
	//ЗаполнитьЦеныВставокПоНастройкамНаСервере(ШаблонПриказа); 
	ЗаполнитьОтклоненияВставокПоНастройкамНаСервере(ШаблонПриказа);
	//ТекСтрока = Элементы.ТаблицаПриказов.ТекущиеДанные;  
	//ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
	//ПолучитьОбъектПриказа(ИдентификаторСтроки);
КонецПроцедуры		

&НаСервере
Процедура ЗаполнитьОтклоненияВставокПоНастройкамНаСервере(ШаблонВставки)
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("Дата", ДатаДок);
	//Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	//               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.Ломбард КАК Ломбард,
	//               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.ВидВставки КАК ВидВставки,
	//               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.ВесоваяГруппа КАК ВесоваяГруппа,
	//               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.ФормаОгранки КАК ФормаОгранки,
	//               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.ВидОгранки КАК ВидОгранки,
	//               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.КачествоОгранки КАК КачествоОгранки,
	//               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.Цена КАК Цена,
	//               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	//               |ИЗ
	//               |	РегистрСведений.ЛБ_ПрейскурантЦенНаДрагоценныеКамни.СрезПоследних(&Дата, Ломбард В (&Ломбарды)) КАК ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних
	//               |
	//               |УПОРЯДОЧИТЬ ПО
	//               |	ВидВставки,
	//               |	ФормаОгранки,
	//               |	ВидОгранки,
	//               |	КачествоОгранки,
	//               |	ВесоваяГруппа";
	//СписокЛ = Новый СписокЗначений;
	//Для каждого СтрЛ из ТекущийПриказ.Ломбарды Цикл
	//	СписокЛ.Добавить(СтрЛ.Ломбард);
	//КонецЦикла;	
	//Запрос.УстановитьПараметр("Ломбарды", СписокЛ);
	//ТаблицаЦен = Запрос.Выполнить().Выгрузить();
	//ПолучитьОбъектПриказа(ТекущийПриказИдентификатор);
	//ДокументОбъект = РеквизитФормыВЗначение("ТекущийПриказ");
	//ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенВставки.Очистить();
	
	НастройкаОтклонения.Очистить();
	
	Отбор = Новый Структура();
		
	Для каждого СтрСхем Из Приказ.СхемыКредитования Цикл
		Для каждого Стр Из ШаблонВставки.Вставки Цикл
			//НоваяСтр = ДокументОбъект.НастройкаОтклоненийОтБазовыхЦенВставки.Добавить();
			
			Если НастройкаОтклонения.Количество() > 0 Тогда
				Отбор.Вставить("ВидВставки", Стр.Вставка);
				Отбор.Вставить("ВидОгранки", Стр.ВидОгранки);
				Отбор.Вставить("КачествоОгранки", Стр.КачествоОгранки);
				Отбор.Вставить("КачествоОгранки", Стр.КачествоОгранки);
				Отбор.Вставить("СхемаКредитования", СтрСхем.СхемаКредитования);

				Строки = НастройкаОтклонения.НайтиСтроки(Отбор);
				Если Строки.Количество() > 0 Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			//+МАН 20.03.25
			РезультатВидОгранки = ПроверитьВидОгранки(Стр.Вставка, Стр.ВидОгранки);
			РезультатКачествоОгранки = ПроверитьКачествоОгранки(Стр.Вставка, Стр.ВидОгранки);
			
			Если ЗначениеЗаполнено(Стр.ВидОгранки) Тогда
				Если РезультатВидОгранки Тогда
					Если ЗначениеЗаполнено(Стр.КачествоОгранки) Тогда
						Если НЕ РезультатКачествоОгранки Тогда
							Сообщить("У вида огранки " + """" +  Стр.ВидОгранки + """" + " не может быть качества огранки " + """" + Стр.КачествоОгранки + """");
							НастройкаОтклонения.Очистить();
							Возврат;
						КонецЕсли;
					КонецЕсли;
				Иначе
					Сообщить("У вставки " + """" +  Стр.Вставка + """" + " не может быть вида огранки " + """" + Стр.ВидОгранки + """");
					НастройкаОтклонения.Очистить();
					Возврат;
				КонецЕсли;
			КонецЕсли;
			//-МАН
			
			НоваяСтр = НастройкаОтклонения.Добавить();
			НоваяСтр.СхемаКредитования = СтрСхем.СхемаКредитования;
			НоваяСтр.ВидВставки = Стр.Вставка;
			//НоваяСтр.ВесоваяГруппа = Стр.ВесоваяГруппа;
			НоваяСтр.КачествоОгранки = Стр.КачествоОгранки;
			//НоваяСтр.ФормаОгранки = Стр.ФормаОгранки; 
			НоваяСтр.ВидОгранки = Стр.ВидОгранки;
			НоваяСтр.ОтклонениеОтБазовойЦены = Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Относительное;
			
			//Отбор = новый Структура;
			//Отбор.Вставить("ВидВставки", Стр.Вставка);
			//Отбор.Вставить("ВесоваяГруппа", Стр.ВесоваяГруппа);
			//Отбор.Вставить("КачествоОгранки", Стр.КачествоОгранки);
			//Отбор.Вставить("ФормаОгранки", Стр.ФормаОгранки); 
			//Отбор.Вставить("ВидОгранки", Стр.ВидОгранки);
			//
			//СтрокиЦен = ТаблицаЦен.НайтиСтроки(Отбор);
			//Если СтрокиЦен.Количество() = 0 Тогда
			//    НоваяСтр.ЕдиницаИзмерения = ОсновнаяЕдиницаИзмеренияВставки;
			//Иначе
			//    СтрЦ = СтрокиЦен.Получить(0);
			//    НоваяСтр.Цена = СтрЦ.Цена;
			//    НоваяСтр.ЕдиницаИзмерения = СтрЦ.ЕдиницаИзмерения;
			//КонецЕсли;	 
		КонецЦикла;
	КонецЦикла;
	//ДокументОбъект.ШаблонВставки = ШаблонВставки;
	//ДокументОбъект.Записать();
	//СтрокаПриказа = ТаблицаПриказов.НайтиПоИдентификатору(ТекущийПриказИдентификатор);
	//ПолучитьДополнительныеРеквизиты(СтрокаПриказа);
	

КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеТЧ()
	
	Результат = Новый Структура;
	Результат.Вставить("Заполнено", Истина);
	
	//+МАН 20.03.25
	Текст = "";
	//-МАН
	
	Ном = 1;
	Для каждого Стр Из НастройкаОтклонения Цикл
		Если НЕ ЗначениеЗаполнено(Стр.ВидВставки) Тогда
			//+МАН 20.03.25
			//Было: Текст = "В строке № " + Ном + " не выбрана вставка.";
			Текст = Текст + "В строке № " + Ном + " не выбрана вставка." + Символы.ПС;
			//-МАН
			Результат.Вставить("Заполнено", Ложь);
			Результат.Вставить("Текст", Текст);
			//Было: Возврат Результат;
		КонецЕсли;
			
		//+МАН 19.02.25 Заявка 2792
		Если НЕ ЗначениеЗаполнено(Стр.ОтклонениеОтБазовойЦены) Тогда
			//+МАН 20.03.25
			//Было: Текст = "В строке № " + Ном + " не заполнен вид отклонения.";
			Текст = Текст + "В строке № " + Ном + " не заполнен вид отклонения." + Символы.ПС;
			//-МАН
			Результат.Вставить("Заполнено", Ложь);
			Результат.Вставить("Текст", Текст);
			//Было: Возврат Результат;
		КонецЕсли;
		//-МАН
		
		Если НЕ ЗначениеЗаполнено(Стр.ЗначениеОтклонения) Тогда
			//+МАН 20.03.25
			//Было: Текст = "В строке № " + Ном + " не заполнено значние отклонения.";
			Текст = Текст +  "В строке № " + Ном + " не заполнено значние отклонения." + Символы.ПС;
			//-МАН
			Результат.Вставить("Заполнено", Ложь);
			Результат.Вставить("Текст", Текст);
			//Было: Возврат Результат;
		КонецЕсли;
		
		Ном = Ном + 1;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура НастройкаОтклоненияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекСтрокаН = Элементы.НастройкаОтклонения.ТекущиеДанные;
	Если НоваяСтрока Тогда 
		ТекСтрокаН.ОтклонениеОтБазовойЦены = ПредопределенноеЗначение("Перечисление.ЛБ_ОтклонениеОтБазовойЦены.Относительное");
	КонецЕсли;	
КонецПроцедуры

//+МАН 04.03.25
&НаКлиенте
Процедура НастройкаОтклоненияПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	ТекСтрокаН = Элементы.НастройкаОтклонения.ТекущиеДанные;
	
	//+МАН 20.03.25
	//Было: Отбор = Новый Структура("СхемаКредитования, ВидВставки, ВидОгранки, КачествоОгранки, ОтклонениеОтБазовойЦены");
	Отбор = Новый Структура("СхемаКредитования, ВидВставки, ВидОгранки, КачествоОгранки");
	//-МАН
	ЗаполнитьЗначенияСвойств(Отбор, ТекСтрокаН);
	
	МассивСтрок = НастройкаОтклонения.НайтиСтроки(Отбор);
	
	Если МассивСтрок.Количество() > 1 Тогда
		Предупреждение("Строка с выбранными условиями уже есть в списке.");
		Если НоваяСтрока Тогда
			НастройкаОтклонения.Удалить(НастройкаОтклонения.Количество() - 1);
		Иначе
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

//+МАН 19.03.25
&НаКлиенте
Процедура НастройкаОтклоненияВидВставкиОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	ТекСтрока = Элементы.НастройкаОтклонения.ТекущиеДанные;
	
	Если Элемент.ТекстРедактирования <> Строка(ВыбранноеЗначение) Тогда
		ТекСтрока.ВидОгранки = ПредопределенноеЗначение("Справочник.ЛБ_ВидыОгранки.ПустаяСсылка");
		ТекСтрока.КачествоОгранки = ПредопределенноеЗначение("Справочник.ЛБ_КачествоОгранки.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастройкаОтклоненияВидОгранкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекСтрока = Элементы.НастройкаОтклонения.ТекущиеДанные;
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбора", ЭтаФорма);
	
	ПараметрыФормы = Новый Структура("ВидВставки", ТекСтрока.ВидВставки);
	
	ОткрытьФорму("Документ.ЛБ_ПриказИндивидуальныеУсловия.Форма.ФормаВыбораВидаОгранки",ПараметрыФормы,,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаОтклоненияВидОгранкиОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	ТекСтрока = Элементы.НастройкаОтклонения.ТекущиеДанные;
	
	Если Элемент.ТекстРедактирования <> Строка(ВыбранноеЗначение) Тогда
		ТекСтрока.КачествоОгранки = ПредопределенноеЗначение("Справочник.ЛБ_КачествоОгранки.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастройкаОтклоненияКачествоОгранкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекСтрока = Элементы.НастройкаОтклонения.ТекущиеДанные;
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбора", ЭтаФорма);
	
	ПараметрыФормы = Новый Структура("ВидВставки, ВидОгранки", ТекСтрока.ВидВставки, ТекСтрока.ВидОгранки);
		
	ОткрытьФорму("Документ.ЛБ_ПриказИндивидуальныеУсловия.Форма.ФормаВыбораКачестваОгранки",ПараметрыФормы,,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбора(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекСтрока = Элементы.НастройкаОтклонения.ТекущиеДанные;
	
	Если Результат.Свойство("ВидОгранки") Тогда
		Если ТипЗнч(Результат.ВидОгранки) = Тип("СправочникСсылка.ЛБ_ВидыОгранки") Тогда
			Если Результат.ВидОгранки <> ТекСтрока.ВидОгранки Тогда
				ТекСтрока.КачествоОгранки = ПредопределенноеЗначение("Справочник.ЛБ_КачествоОгранки.ПустаяСсылка");
			КонецЕсли;
			ТекСтрока.ВидОгранки = Результат.ВидОгранки;
		КонецЕсли;
	КонецЕсли;

	Если Результат.Свойство("КачествоОгранки") Тогда
		Если ТипЗнч(Результат.КачествоОгранки) = Тип("СправочникСсылка.ЛБ_КачествоОгранки") Тогда
			ТекСтрока.КачествоОгранки = Результат.КачествоОгранки;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьВидОгранки(ВидКамня, ВидОгранки)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛБ_НастройкаДопустимыхВидовОгранки.ВидОгранки КАК ВидОгранки
		|ИЗ
		|	РегистрСведений.ЛБ_НастройкаДопустимыхВидовОгранки КАК ЛБ_НастройкаДопустимыхВидовОгранки
		|ГДЕ
		|	НЕ ЛБ_НастройкаДопустимыхВидовОгранки.ВидОгранки.ПометкаУдаления
		|	И НЕ ЛБ_НастройкаДопустимыхВидовОгранки.ВидКамня.ПометкаУдаления
		|	И НЕ ЛБ_НастройкаДопустимыхВидовОгранки.ФормаОгранки.ПометкаУдаления
		|	И ЛБ_НастройкаДопустимыхВидовОгранки.ВидОгранки = &ВидОгранки
		|	И ЛБ_НастройкаДопустимыхВидовОгранки.ВидКамня = &ВидКамня";
	
	Запрос.УстановитьПараметр("ВидКамня", ВидКамня);
	Запрос.УстановитьПараметр("ВидОгранки", ВидОгранки);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ПроверитьКачествоОгранки(ВидКамня, ВидОгранки)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛБ_НастройкаДопустимыхКачествОгранки.КачествоОгранки КАК КачествоОгранки
		|ИЗ
		|	РегистрСведений.ЛБ_НастройкаДопустимыхКачествОгранки КАК ЛБ_НастройкаДопустимыхКачествОгранки
		|ГДЕ
		|	НЕ ЛБ_НастройкаДопустимыхКачествОгранки.ВидКамня.ПометкаУдаления
		|	И НЕ ЛБ_НастройкаДопустимыхКачествОгранки.КатегорияОбъектаЗалога.ПометкаУдаления
		|	И НЕ ЛБ_НастройкаДопустимыхКачествОгранки.ФормаОгранки.ПометкаУдаления
		|	И НЕ ЛБ_НастройкаДопустимыхКачествОгранки.ВидОгранки.ПометкаУдаления
		|	И НЕ ЛБ_НастройкаДопустимыхКачествОгранки.КачествоОгранки.ПометкаУдаления
		|	И ЛБ_НастройкаДопустимыхКачествОгранки.ВидКамня = &ВидКамня
		|	И ЛБ_НастройкаДопустимыхКачествОгранки.ВидОгранки = &ВидОгранки";
	
	Запрос.УстановитьПараметр("ВидКамня", ВидКамня);
	Запрос.УстановитьПараметр("ВидОгранки", ВидОгранки);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции
//-МАН
