
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Залогодатель") Тогда
		Залогодатель = Параметры.Залогодатель;  
	Иначе
		Сообщить("Не выбран клиент!");
		возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.Текст ="ВЫБРАТЬ РАЗЛИЧНЫЕ
	              |	ЛБ_ДатыОбновленияАнкеты.Период КАК Период,
	              |	ЛБ_ДатыОбновленияАнкеты.Регистратор КАК Регистратор,
	              |	ЛБ_ДатыОбновленияАнкеты.Регистратор.ОтветственныйСотрудник КАК Ответственный
	              |ИЗ
	              |	РегистрСведений.ЛБ_ДатыОбновленияАнкеты КАК ЛБ_ДатыОбновленияАнкеты
	              |ГДЕ
	              |	ЛБ_ДатыОбновленияАнкеты.Залогодатель = &Залогодатель
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	Период";  
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	Для каждого Стр Из ТаблицаЗапроса Цикл 
		НоваяСтр = ТаблицаОбнвлений.Добавить();
		НоваяСтр.Дата = Стр.Период;  
		НоваяСтр.Ответственный = стр.Ответственный;
		Если ТипЗнч(Стр.Регистратор) = Тип("ДокументСсылка.ЛБ_ОперацияПоЗалогу") Тогда  
			НоваяСтр.Информация = "Операция по займу (" + Строка(Стр.Регистратор.ВидОперации) + "), № залогового билета " + СокрЛП(Стр.Регистратор.НомерЗалоговогоБилета);
		Иначе			
		    НоваяСтр.Информация = "Изменение карточки клиента";  
		КонецЕсли;
	Конеццикла;	
КонецПроцедуры
