
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ВидКамня") тогда 
		Запись.ВидКамня = Параметры.ВидКамня;  
		Запись.СпособРасчетаВеса = Перечисления.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле;
	КонецЕсли;	
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	Если Запись.СпособРасчетаВеса = Перечисления.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле Тогда 
		Элементы.Формула.Видимость = Истина;
	Иначе 
		Элементы.Формула.Видимость = ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СпособРасчетаВесаПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НЕ Запись.СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда 
		Если НЕ ПустаяСтрока(Запись.Формула) Тогда
		    Запись.Формула = ""; 
		КонецЕсли;	
	ИначеЕсли ПустаяСтрока(Запись.Формула) тогда
		Сообщить("Не  определена формула расчета веса!");
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры
