&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Документ") Тогда
        ДокументЗайма = Параметры.Документ; 
		Если ДокументЗайма.Проведен тогда
			НеРедактировать = Истина;    
			Элементы.ДекорацияСтатусДокумента.Заголовок = "Факт"; 
			Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноБордовый;  
			Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.ТусклоРозовый;
		Иначе
			Элементы.ДекорацияСтатусДокумента.Заголовок = "Проект"; 
			Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноЗеленый;
			Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.СветлоЗеленый;
		КонецЕсли;	
		ДатаДок = ДокументЗайма.Дата; 
		Ломбард = ДокументЗайма.Ломбард;  
		Организация = ДокументЗайма.Организация;
		ОтветственныйСотрудник = ДокументЗайма.ОтветственныйСотрудник;
		ОтветственныйПользователь = ДокументЗайма.ОтветственныйПользователь;
		Комментарий = ДокументЗайма.Комментарий;  
		ПредыдущаяОперация = ДокументЗайма.ПредыдущаяОперация;
		Залогодатель = ДокументЗайма.Залогодатель; 
		ДокументЗалогодателя = ДокументЗайма.ДокументЗалогодателя;  
		Представитель = ДокументЗайма.Представитель; 
		ДокументПредставителя = ДокументЗайма.ДокументПредставителя; 
		НомерЗБ = ДокументЗайма.НомерЗалоговогоБилета;
		СхемаКредитования = ДокументЗайма.СхемаКредитования;
		СрокЗалога = ДокументЗайма.СрокЗалога; 
		СуммаЗайма = ДокументЗайма.СуммаСсуды;
		Акция = ДокументЗайма.Акция;  
		ПСК_LX = ДокументЗайма.ПСК_LX;
		СуммаСсуды = ДокументЗайма.СуммаСсуды;
		Промокод = ДокументЗайма.Промокод; 
		Предъявитель = ДокументЗайма.Предъявитель;
		ОтказОтВыкупа = ДокументЗайма.ОтказОтВыкупа;  
		ПроцентнаяСхема = ДокументЗайма.ПроцентнаяСхема; 
		ПредельныйСрокЗайма = ДокументЗайма.ПредельныйСрокЗайма; 
		ПредельныйСрокЗаймаДни = ДокументЗайма.ПредельныйСрокЗаймаДни;                                        
		ДатаВыкупа = ДокументЗайма.ДатаВыкупа;
		ДатаВыкупаЛьготная = ДокументЗайма.ДатаВыкупаЛьготная; 
		СогласиеНаСМСРассылку = ДокументЗайма.СогласиеНаСМСРассылку; 
		ТекущаяУстановкаУсловийПоСхемеКредитования = ДокументЗайма.ТекущаяУстановкаУсловийПоСхемеКредитования; 
		ПриказСтавки = ДокументЗайма.ПриказСтавки; 
		ПриказАкцияСтавки = ДокументЗайма.ПриказАкцияСтавки; 
		ОтклонениеПоАкции = ДокументЗайма.ОтклонениеПоАкции;

		ЗаполнитьКонтакнуюИнформациюЗалогодателя();
	    КонтактнаяИнформацияВСтроку();
		ЗаполнитьИнформациюОДокументеЗалогодателя();
		ИнформацияОДокументеВСтроку();   
		ЗаполнитьКонтакнуюИнформациюПредставителя();
	    КонтактнаяИнформацияПредставителяВСтроку();
		ЗаполнитьИнформациюОДокументеПредставителя();
		ИнформацияОДокументеПредставителяВСтроку();
		СтатусЗалогодателя = ДокументЗайма.СтатусЗалогодателя; 
		Если ЗначениеЗаполнено(Представитель) Тогда
			Плательщик = Представитель;
		Иначе	
		    Плательщик = Залогодатель;
		КонецЕсли;	
		Если НЕ Плательщик = ПредыдущаяОперация.Залогодатель Тогда			
			Элементы.ГруппаДоверенность.Видимость = Истина; 
			ЗаполнитьСписокВыбораДоверенностейПлательщика();
			ДоверенностьПереоформление = ДокументЗайма.ДоверенностьПредставителя;
			ЗаполнитьТекстДоверенности();
		КонецЕсли;	  
		//ЗаполнитьТовары(); 		
		//ЗаполнитьТабличныеЧасти();
		//Мельников 25.04.24 Отмена операции
		//+МАН 17.06.25 Изменил на запрос
		//Мельников 25.04.24 Отмена операции
		ДокументОтмены = ПолучитьДокументОтмены(ДокументЗайма); //Было: ДокументЗайма.ДокументОтмены;
		//-МАН
		//+МАН 10.12.25
		ПриказВИПСтавки = ДокументЗайма.ПриказВИПСтавки;
		//-МАН
		Если Параметры.ТолькоПросмотр = Истина Тогда	
			Этаформа.ТолькоПросмотр = Истина;
		КонецЕсли;
	Иначе              		
		Ломбард = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();   
		Если Параметры.Свойство("Дата") Тогда 
			ДатаДок = Параметры.Дата;
		Иначе	
		    ДатаДок = ТекущаяДата(); 
		КонецЕсли;	
		Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить();
		ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
		//Если НЕ ТекПользователь.ЭтоЛомбард Тогда
		//  	ОтветственныйПользователь = ТекПользователь;
		//Иначе
		//	ОтветственныйПользователь = ПараметрыСеанса.ТекущийСотрудник;
		//КонецЕсли;
		ОтветственныйСотрудник = ПараметрыСеанса.ТекущийСотрудник;
		ОтветственныйПользователь = ПараметрыСеанса.ТекущийПользователь;

		ПредыдущаяОперация = Параметры.ПредыдущаяОперация;
		Если Параметры.Свойство("Залогодатель") Тогда 
			Залогодатель = Параметры.Залогодатель;
			ЗаполнитьИнфорациюОЗалогодателе(Параметры, Ложь); 
			ЗаполнитьДопДокументы();
			СтатусЗалогодателя = ЛБ_УправлениеЛомбардом.ПолучитьТекущийСтатусКлиента(ДатаДок, Залогодатель); 
			СогласиеНаСМСРассылку = ЛБ_УправлениеЛомбардом.ПолучитьСогласиеНаСМСРассылки(ДатаДок, Залогодатель); 
			
			СотрудникПользователь = ПроверитьКлиентСотрудник(Залогодатель);
			Если НЕ СотрудникПользователь = неопределено Тогда  
				//Если СотрудникПользователь = ОтветственныйПользователь Тогда
				Если СотрудникПользователь = ОтветственныйСотрудник Тогда
					ОбщегоНазначения.СообщитьПользователю("Выбранный заемщик является сотрудником оформляющим займ. Это запрещено!"); 
					Отказ = Истина;
					Возврат;  				
				КонецЕсли;	
			КонецЕсли;	     			
		КонецЕсли;  
		Если Параметры.Свойство("ОтказОтВыкупа") Тогда
			ОтказОтВыкупа = Параметры.ОтказОтВыкупа;
		КонецЕсли;   
		Если Параметры.Свойство("Представитель") Тогда   
			Представитель = Параметры.Представитель;
			ЗаполнитьИнфорациюОПредставителе(Параметры, ложь); 
			ЗаполнитьДопДокументыПредставителя();
		КонецЕсли;	   
	
		Если ЗначениеЗаполнено(Представитель) Тогда
			Плательщик = Представитель;
		Иначе	
		    Плательщик = Залогодатель;
		КонецЕсли;	
		Если НЕ Плательщик = ПредыдущаяОперация.Залогодатель Тогда			
			Элементы.ГруппаДоверенность.Видимость = Истина; 
			ЗаполнитьСписокВыбораДоверенностейПлательщика();
			Если Параметры.Свойство("ДоверенностьПредставителя") Тогда
				Для Сч = 0 По Элементы.Доверенность.СписокВыбора.Количество()-1 Цикл 
					Если Элементы.Доверенность.СписокВыбора.Получить(сч).Значение = Параметры.ДоверенностьПредставителя Тогда
					    ДоверенностьПереоформление = Элементы.Доверенность.СписокВыбора.Получить(сч).Значение;
					    ЗаполнитьТекстДоверенности();
						Прервать;
					КонецЕсли;	
				КонецЦикла;  
			КонецЕсли;
		КонецЕсли;	 
	КонецЕсли;        
	
	Если НЕ ЗначениеЗаполнено(ПредыдущаяОперация) Тогда 
		ОбщегоНазначения.СообщитьПользователю("Не выбран переоформляемый залоговый билет!"); 
		Отказ = Истина;
		Возврат;  				
	КонецЕсли;	  
	
	СообщениеПроверкиПоЛомбарду = ЛБ_УправлениеЛомбардом.ПроверитьИзделияЗБВЛомбарде(ДатаДок, ПредыдущаяОперация, Ломбард); 
	Если НЕ ПустаяСтрока(СообщениеПроверкиПоЛомбарду) Тогда
		ОбщегоНазначения.СообщитьПользователю(СообщениеПроверкиПоЛомбарду + ". Переоформление запрещено."); 
    КонецЕсли;
	
	Элементы.ДекорацияЗБПереоформление.Заголовок = "Залоговый билет № " + сокрЛП(ЭтаФорма.ПредыдущаяОперация.НомерЗалоговогоБилета) +
	           " от " + Формат(ЭтаФорма.ПредыдущаяОперация.Дата, "ДЛФ=") +
	           ", заемщик " + СокрЛП(ЭтаФорма.ПредыдущаяОперация.Фамилия) + " " + СокрЛП(ЭтаФорма.ПредыдущаяОперация.Имя) + 
	           ?(ЗначениеЗаполнено(ЭтаФорма.ПредыдущаяОперация.Отчество), " " + СокрЛП(ЭтаФорма.ПредыдущаяОперация.Отчество), "") + 
	           ", " + СокрЛП(ЭтаФорма.ПредыдущаяОперация.СхемаКредитования) + " на " + СокрЛП(ЭтаФорма.ПредыдущаяОперация.СрокЗалога) + " дней, " + 
			   ?(ЗначениеЗаполнено(ЭтаФорма.ПредыдущаяОперация.Ломбард.НомерЛомбарда), "ломбард № " + СокрЛП(ЭтаФорма.ПредыдущаяОперация.Ломбард.НомерЛомбарда), СокрЛП(ЭтаФорма.ПредыдущаяОперация.Ломбард)); 
	ЗаполнитьСостояниеЗалоговогоБилета();		   
	ПричинаПримененияПроцентнойСхемы = Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма;	
	ОсновнаяЕдиницаИзмеренияКамни = Константы.ЛБ_ОсновнаяЕдиницаКамни.Получить();
	ОсновнаяЕдиницаИзмеренияМеталлы = Константы.ЛБ_ОсновнаяЕдиницаМеталлы.Получить();
	ЗаполнитьТаблицуДопСтатусовКлиента();	
	ПолучитьДопСтатусыКлиента();         
	ЗаполнитьСписокЛьготныхСтатусов(); 
	ПолучитьНастройкиЗайма(); 
				
	ПолучитьДоступныеПроцентныеСхемыАкции();  
	Если ЭтоСотрудник Тогда
	    ЕстьЛьготыСотрудника = ПроверитьЕстьЛьготыСотрудника(); 
		ЗаполнитьЛьготныеСтатусыСотрудника();
		СуммаЗаймаПоЛьготамСотрудника = ЛБ_УправлениеЛомбардом.ПолучитьЛьготнуюСуммуЗаймаСотрудника(ДатаДок, Залогодатель);  
		УстановитьТекстСуммаЗаймаСотрудник();  
		Элементы.ДекорацияСотрудник.Видимость = ?(НЕ НеРедактировать, Истина, ложь);
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(ДокументЗайма) Тогда
		Если НЕ ТаблицаВыбораСхемыКредитованияАкции.Количество() = 0 Тогда
			СтрокаСК = ТаблицаВыбораСхемыКредитованияАкции.Получить(0);
			СхемаКредитования = СтрокаСК.СхемаКредитования;  
			ТекущаяУстановкаУсловийПоСхемеКредитования = ПолучитьУсловияСК();
			Если НЕ ЗначениеЗаполнено(ТекущаяУстановкаУсловийПоСхемеКредитования) тогда
				 Сообщить("На дату документа не определены условия по кредитной схеме " + СокрЛП(СхемаКредитования) + "!"); 
			КонецЕсли; 
			Акция = СтрокаСК.Акция;   			
			ЗаполнитьТаблицуСтавок();
		КонецЕсли; 
		РассчитатьПредельныСрокЗайма();	        
	КонецЕсли;	
	
	ОбработатьСхемуКредитованияНаСервере();
	СтруктураП = ЛБ_УправлениеЛомбардом.ПолучитьПредельныеЗначенияПроцентов(ДатаДок, Организация);
	Если НЕ СтруктураП = неопределено Тогда
        ПСК = СтруктураП.ПСКГод;  
	Иначе
		ПСК = 0;
	КонецЕсли; 

	Если НЕ ЗначениеЗаполнено(ДокументЗайма) Тогда
		ЗаполнитьТабличныеЧасти(Истина); 
		СуммаЗайма = Товары.Итог("СуммаСсуды");
		ОбработатьПСКНасервере();
	Иначе    
		ЗаполнитьТабличныеЧасти(); 
		Отбор = Новый Структура;
		Отбор.Вставить("ДеньНач", 1);
		Строки = ГрафикПлатежей.НайтиСтроки(Отбор);
		Если НЕ Строки.Количество() = 0 Тогда 
			СуммаПроцентовДень = Строки.Получить(0).СуммаПроцентовДень;
		КонецЕсли;	

		СуммаПроцентов = ДокументЗайма.ГрафикПлатежей.Итог("СуммаПроцентов");
		СуммаПроцентовЗБ = СуммаПроцентов;		
	    ПСКГод = РасчетПСКГод(СуммаЗайма, СуммаПроцентовЗБ);
	КонецЕсли; 		
	СуммаЗаймаДень = ПроверитьЕстьЗалогиДень();	

	ПроверитьДоступностьДопКнопок();
	Если НЕ ЗначениеЗаполнено(ПроцентнаяСхема) Тогда
        Сообщить("Не определена процентная схема! Расчет процентов по договору займа не возможен.");
	КонецЕсли;	
    СтатусыКлиентаВСтроку();	                              
	ТоварыИтоги();
	ВставкиИтоги(); 
	ЗаполнитьКВыдачеВнесению();
	УстановитьВидимость(); 
	ДополнительныеМеталлыИтоги(); 	
	Если ЗначениеЗаполнено(ДокументЗайма) тогда
	    Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаОбъектыЗалога;  
	КонецЕсли;	
	Элементы.ДекорацияСуммаЗаймаДень.Видимость = ?(Этаформа.СуммаЗаймаДень = 0, Ложь, Истина);  	
	ДатаДокТекущая = ДатаДок;   
	МинСуммаЗайма = ЛБ_ОбщийМодуль.ПолучитьМинимальнуюСуммуЗайма(ДатаДок);
	//+Мельников 25.04.24 Отмена операции
	УстановитьВидимость();
	//+Мельников 13.08.24 Формирование списка проб по прейскуранту. Заявка 2677.
	ЗаполнитьСписокПроб();
	//-Мельников
	
	//++ИВВ 02.2026, вычеты для часов
	ПроверкаВставокПриОткрытииНика();
	ПроверкаВставокПриОткрытииМеханизм();
	//--ИВВ
	
КонецПроцедуры   

&НаСервере
Процедура ЗаполнитьСписокВыбораДоверенностейПлательщика() 
	Элементы.Доверенность.СписокВыбора.Очистить();
	Если Плательщик = ПредыдущаяОперация.Залогодатель Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ПредыдущаяОперация);
	Запрос.УстановитьПараметр("Клиент", ПредыдущаяОперация.Залогодатель);
	Запрос.УстановитьПараметр("Представитель", Плательщик);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДоверенностиСрезПоследних.Доверенность КАК Доверенность
	               |ИЗ
	               |	РегистрСведений.ЛБ_Доверенности.СрезПоследних(
	               |			&Дата,
	               |			ЗалоговыйБилет = &ЗалоговыйБилет
	               |				И Клиент = &Клиент
	               |				И Доверенность.ПредставительКлиента = &Представитель
	               |				И СтатусДоверенности = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыДоверенностей.ДоверенностьОформлена)) КАК ЛБ_ДоверенностиСрезПоследних";  
	Выборка = Запрос.Выполнить().Выбрать(); 	
	Пока Выборка.Следующий() Цикл  
		Если Выборка.Доверенность.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Наследство Тогда   
			ОписаниеДоверенности = "Свидетельство о праве на наследство № " + СокрЛП(Выборка.Доверенность.НомерДоверенности) + " от " + Формат(Выборка.Доверенность.ДатаДоверенности, "ДФ=dd.MM.yyyy");
		Иначе	
			Если Выборка.Доверенность.СрокДействияДоверенности  < НачалоДня(ДатаДок) Тогда
				Продолжить;
			КонецЕсли;	      
			ОписаниеДоверенности = "Доверенность " + НРег(строка(Выборка.Доверенность.ВидДоверенности)) + " № " +
					   ?(НЕ ПустаяСтрока(Выборка.Доверенность.НомерДоверенности), СокрЛП(Выборка.Доверенность.НомерДоверенности), "б/н") + " от " + Формат(Выборка.Доверенность.ДатаДоверенности, "ДФ=dd.MM.yyyy") +
					   " действует до " + Формат(Выборка.Доверенность.СрокДействияДоверенности, "ДФ=dd.MM.yyyy");   
		КонецЕсли;			   
		Элементы.Доверенность.СписокВыбора.Добавить(Выборка.Доверенность, ОписаниеДоверенности);
	Конеццикла;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекстДоверенности()   
	Если ЗначениеЗаполнено(ДоверенностьПереоформление) Тогда  
		Если ДоверенностьПереоформление.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Наследство Тогда   
			Доверенность = "Свидетельство о праве на наследство № " + СокрЛП(ДоверенностьПереоформление.НомерДоверенности) + " от " + Формат(ДоверенностьПереоформление.ДатаДоверенности, "ДФ=dd.MM.yyyy"); 
		Иначе	
		    Доверенность = "Доверенность " + НРег(строка(ДоверенностьПереоформление.ВидДоверенности)) + " № " +                                                                                               		
				   ?(НЕ ПустаяСтрока(ДоверенностьПереоформление.НомерДоверенности), СокрЛП(ДоверенностьПереоформление.НомерДоверенности), "б/н") + " от " + Формат(ДоверенностьПереоформление.ДатаДоверенности, "ДФ=dd.MM.yyyy") +
				   " действует до " + Формат(ДоверенностьПереоформление.СрокДействияДоверенности, "ДФ=dd.MM.yyyy"); 
		КонецЕсли;		   
	Иначе
		Доверенность = "";
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Функция СоздатьНовуюОплатуПроцентов()
	ДокументОбъект = Документы.ЛБ_ОперацияПоЗалогу.СоздатьДокумент(); 
	ДокументОбъект.ПредыдущаяОперация = ПредыдущаяОперация; 
	ДокументОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов;
	ДокументОбъект.Дата = ?(ЗначениеЗаполнено(ЭтаФорма.ДокументЗайма), ДатаДок-1, ДатаДок); 
	ДокументОбъект.Организация = Организация;
	ДокументОбъект.ПроцентнаяСхема = ПредыдущаяОперация.ПроцентнаяСхема;  
	ДокументОбъект.Выкуп = Истина;
	Возврат ДокументОбъект; 
КонецФункции

&НаСервере
Функция РасчитатьДолгПоПроцентам(ЗалоговыйБилет, СтатусЗБ, СуммаЗайма, ПроцентнаяСтавка, ДатаНачалаРасчета) 
	Если  СуммаЗайма = 0 Тогда  
		НачисленоПроцентов = 0;
	    Возврат 0;
	КонецЕсли;
	
	ТаблицаОплатДетально.Очистить();
	ДокументОбъект = СоздатьНовуюОплатуПроцентов(); 	    
	СтруктураП = ЛБ_УправлениеЛомбардом.ПолучитьПредельныеЗначенияПроцентов(ЗалоговыйБилет.Дата, ЗалоговыйБилет.Организация);
	Если НЕ СтруктураП = неопределено Тогда
	    ПланкаПроцентов = СтруктураП.ПланкаПроцентов;
		ПредельноеЗначениеПроцентов = ЗалоговыйБилет.СуммаСсуды*СтруктураП.ПланкаПроцентов; 
	Иначе
		ПредельноеЗначениеПроцентов = 0;
	КонецЕсли;   
	СтруктураОкр = ЛБ_УправлениеЛомбардом.ПолучитьУсловияОкругленияПроцентов(ЗалоговыйБилет);
	Установки = ЛБ_УправлениеЛомбардом.ПолучитьУсловияПоДоговору(ЗалоговыйБилет); 	
	ПричинаПримененияПроцентнойСхемыОплата = ЛБ_УправлениеЛомбардом.ПолучитьПричинуПримененияПроцентнойСхемы(ДокументОбъект, ЗалоговыйБилет);
	//ПричинаПримененияПроцентнойСхемыОплата = Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ОплатаПроцентов;
	Результат = ЛБ_ОбщийМодуль.РассчитатьСуммуПроцентовОплата(ДокументОбъект, ДатаНачалаРасчета, ПредельноеЗначениеПроцентов, ПричинаПримененияПроцентнойСхемыОплата, Установки, СтруктураОкр); 
			
	Для каждого стр из ДокументОбъект.НачислениеПроцентовДетально Цикл 
	    НоваяСтр = ТаблицаОплатДетально.Добавить(); 
		ЗаполнитьЗначенияСвойств(НоваяСтр, стр);
	КонецЦиклА;
	
	НачисленоПроцентов = Результат.СуммаПроцентовНачислено;
	
	Возврат Результат.СуммаПроцентов;
КонецФункции
	
&НаСервере
Процедура ЗаполнитьСостояниеЗалоговогоБилета() 
	ЗалоговыйБилет = ПредыдущаяОперация; 
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
	Если ЗначениеЗаполнено(ЭтаФорма.ДокументЗайма) Тогда
		Запрос.УстановитьПараметр("Период", ДатаДок-1); 
	Иначе	
	    Запрос.УстановитьПараметр("Период", ДатаДок);  		
	КонецЕсли;	                                       
		
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилета.Регистратор КАК Регистратор,
	               |	ЛБ_СостояниеЗалоговогоБилета.СуммаЗайма КАК СуммаЗайма,
	               |	ЛБ_СостояниеЗалоговогоБилета.ДатаВыкупа КАК ДатаВыкупа,
	               |	ЛБ_СостояниеЗалоговогоБилета.ДатаВыкупаЛьготныйСрок КАК ДатаВыкупаЛьготныйСрок,
	               |	ЛБ_СостояниеЗалоговогоБилета.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета,
	               |	ЛБ_СостояниеЗалоговогоБилета.ДатаНачалаРасчетаПроцентов КАК ДатаНачалаРасчетаПроцентов,
	               |	ЛБ_СостояниеЗалоговогоБилета.СуммаПроцентовДень КАК СуммаПроцентовДень,
	               |	ЛБ_СостояниеЗалоговогоБилета.СуммаПроцентовСрок КАК СуммаПроцентовСрок,
	               |	ЛБ_СостояниеЗалоговогоБилета.ПредельныйСрокЗайма КАК ПредельныйСрокЗайма,
	               |	ЛБ_СостояниеЗалоговогоБилета.ПредельныйСрокЗаймаДни КАК ПредельныйСрокЗаймаДни,
	               |	ЛБ_СостояниеЗалоговогоБилета.НомерДопСоглашения КАК НомерДопСоглашения
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета КАК ЛБ_СостояниеЗалоговогоБилета
	               |ГДЕ
	               |	ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет = &ЗалоговыйБилет
	               |	И ЛБ_СостояниеЗалоговогоБилета.Период <= &Период
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_СостояниеЗалоговогоБилета.Период";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	ТаблицаСостояний.Очистить();
	Если ТаблицаЗапроса.Количество() > 0 Тогда
		СтрСостояние = ТаблицаЗапроса.Получить(0);
		НоваяСтр = ТаблицаСостояний.Добавить();
		НоваяСтр.Состояние = "Начальные условия займа";
		НоваяСтр.КлючСтроки = 1;
		НоваяСтр.Статус = СтрСостояние.СтатусЗалоговогоБилета;
		НоваяСтр.СуммаЗайма = СтрСостояние.СуммаЗайма;
		НоваяСтр.ДатаВозврата = СтрСостояние.ДатаВыкупа;
		НоваяСтр.ДатаВозвратаЛьготная = СтрСостояние.ДатаВыкупаЛьготныйСрок; 
		НоваяСтр.ДатаНачалаРасчета = СтрСостояние.ДатаНачалаРасчетаПроцентов;
		НоваяСтр.ПроцентнаяСтавка = ЗалоговыйБилет.ПроцентнаяСхема;
		НоваяСтр.СуммаПроцентовДень = СтрСостояние.СуммаПроцентовДень;
		НоваяСтр.СуммаПроцентовСрок = СтрСостояние.СуммаПроцентовСрок;
		НоваяСтр.ПредельныйСрокЗайма = СтрСостояние.ПредельныйСрокЗайма;
		НоваяСтр.ПредельныйСрокЗаймаДни = СтрСостояние.ПредельныйСрокЗаймаДни;  
		//НоваяСтр.СуммаИтог = СтрСостояние.СуммаЗайма; 
				
		КолСтр = ТаблицаЗапроса.Количество()-1;  		
		СтрСостояние = ТаблицаЗапроса.Получить(КолСтр);   
		Если ТипЗнч(СтрСостояние.Регистратор) = Тип("ДокументСсылка.ЛБ_КарточкаЗалогодателя") Тогда
			ТекущийСтатусЗБ = СтрСостояние.СтатусЗалоговогоБилета; 
			СтрСостояние = ТаблицаЗапроса.Получить(КолСтр-1); 
		Иначе
			ТекущийСтатусЗБ = неопределено;
		КонецЕсли;	
		НоваяСтр = ТаблицаСостояний.Добавить();
		НоваяСтр.Состояние = "Состояние залогового билета до переоформления";
		НоваяСтр.КлючСтроки = 2;
		НоваяСтр.Статус = ?(ТекущийСтатусЗБ = неопределено, СтрСостояние.СтатусЗалоговогоБилета, ТекущийСтатусЗБ); 
		НоваяСтр.СуммаЗайма = СтрСостояние.СуммаЗайма;
		НоваяСтр.ДатаВозврата = СтрСостояние.ДатаВыкупа;
		НоваяСтр.ДатаВозвратаЛьготная = СтрСостояние.ДатаВыкупаЛьготныйСрок; 
		НоваяСтр.ДатаНачалаРасчета = СтрСостояние.ДатаНачалаРасчетаПроцентов;  
		НоваяСтр.ПроцентнаяСтавка = ЗалоговыйБилет.ПроцентнаяСхема;
		НоваяСтр.СуммаПроцентовДень = СтрСостояние.СуммаПроцентовДень;  
	    НоваяСтр.СуммаПроцентовДолг = РасчитатьДолгПоПроцентам(ЗалоговыйБилет, НоваяСтр.Статус, НоваяСтр.СуммаЗайма, НоваяСтр.ПроцентнаяСтавка, НоваяСтр.ДатаНачалаРасчета);		 
		НоваяСтр.НомерДС = СтрСостояние.НомерДопСоглашения; 
		НоваяСтр.СуммаИтог = СтрСостояние.СуммаЗайма + НоваяСтр.СуммаПроцентовДолг;
			  
		НоваяСтр = ТаблицаСостояний.Добавить();
		НоваяСтр.Состояние = "Состояние залогового билета после переоформления";
		НоваяСтр.КлючСтроки = 3;
		НоваяСтр.Статус = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт; 
   	Иначе
		НоваяСтр = ТаблицаСостояний.Добавить();
		НоваяСтр.Состояние = "Начальные условия займа";
		НоваяСтр.КлючСтроки = 1;
		
		НоваяСтр = ТаблицаСостояний.Добавить();
		НоваяСтр.Состояние = "Состояние залогового билета до переоформления";
		НоваяСтр.КлючСтроки = 2;     
		
		БезПродленияДоговора = ложь;
	КонецЕсли;	  
	
	СтрСостояние = ТаблицаСостояний.Получить(1);
	ИнформацияВыкуп = "Сумма выкупа: ";  
	ИнформацияВыкуп = ИнформацияВыкуп + Формат(СтрСостояние.СуммаЗайма+СтрСостояние.СуммаПроцентовДолг, "ЧЦ=15; ЧДЦ=2; ЧРД=,; ЧРГ=; ЧН=0,00") + " руб."; 
	Элементы.ДекорацияВыкуп.Заголовок = ИнформацияВыкуп;   
	ИнформацияВыкупРасшифровка = "";
	ИнформацияВыкупРасшифровка = ИнформацияВыкупРасшифровка + "(в том числе, долг по займу " + Формат(СтрСостояние.СуммаЗайма, "ЧЦ=15; ЧДЦ=2; ЧРД=,; ЧРГ=; ЧН=0,00") + " руб.";
	ИнформацияВыкупРасшифровка = ИнформацияВыкупРасшифровка + ", долг по процентам " + Формат(СтрСостояние.СуммаПроцентовДолг, "ЧЦ=15; ЧДЦ=2; ЧРД=,; ЧРГ=; ЧН=0,00") + " руб.)";
	Элементы.ДекорацияВыкупРасшифровка.Заголовок = ИнформацияВыкупРасшифровка;
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьКВыдачеВнесению()  
	СтрСостояние = ТаблицаСостояний.Получить(1);  
	СуммаВыкупа = СтрСостояние.СуммаЗайма + СтрСостояние.СуммаПроцентовДолг;
	Если СуммаЗайма >= СуммаВыкупа Тогда
		СуммаКВнесению = 0;
		СуммаКВыдаче = СуммаЗайма - СуммаВыкупа;
	Иначе 
		СуммаКВнесению = СуммаВыкупа - СуммаЗайма;
		СуммаКВыдаче = 0;
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Функция ПроверитьКлиентСотрудник(Клиент)
    Возврат ЛБ_УправлениеЛомбардом.ПроверитьКлиентСотрудник(Клиент);
КонецФункции

&НаСервере
Процедура ЗаполнитьЛьготныеСтатусыСотрудника()  
	ДопСтатусСотрудник = Константы.ЛБ_ДопСтатусСотрудника.Получить();
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьПромокодПредъявитель() 
	Если НЕ ПустаяСтрока(Промокод) Тогда
		Элементы.Предъявитель.Доступность = Ложь; 
	Иначе
		Элементы.Предъявитель.Доступность = Истина;
	КонецЕсли;   
	Если Предъявитель Тогда
		Элементы.Промокод.Доступность = Ложь; 
	Иначе
		Элементы.Промокод.Доступность = Истина;
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДопДокументы()  	
	УдСтроки = Новый СписокЗначений;
	Отбор = Новый Структура;
	Отбор.Вставить("Клиент", Залогодатель);    
	СтрокиДоп = ДопДокументы.НайтиСтроки(Отбор);
	Для каждого СтрДоп из СтрокиДоп Цикл
		УдСтроки.Добавить(СтрДоп);
	КонецЦикла;	                
	Для каждого Эл Из УдСтроки Цикл 
		ДопДокументы.Удалить(Эл.Значение);
	КонецЦикла;	
	Если  ЗначениеЗаполнено(Гражданство) И НЕ Гражданство = Справочники.СтраныМира.Россия тогда 
			ТаблицаДоп = ЛБ_УправлениеЛомбардом.ПолучитьДокументыПравоПребыванияРФ(ДатаДок, Залогодатель, Гражданство);   
		Для каждого СтрДоп из ТаблицаДоп Цикл
			НоваяСтрДоп = ДопДокументы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрДоп, СтрДоп);
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДопДокументыПредставителя()  
	УдСтроки = Новый СписокЗначений;
	Отбор = Новый Структура;
	Отбор.Вставить("Клиент", Представитель);    
	СтрокиДоп = ДопДокументы.НайтиСтроки(Отбор);
	Для каждого СтрДоп из СтрокиДоп Цикл
		УдСтроки.Добавить(СтрДоп);
	КонецЦикла;	                
	Для каждого Эл Из УдСтроки Цикл 
		ДопДокументы.Удалить(Эл.Значение);
	КонецЦикла;	
	
	Если ЗначениеЗаполнено(ГражданствоПредставителя) И НЕ ГражданствоПредставителя = Справочники.СтраныМира.Россия тогда
		ТаблицаДоп = ЛБ_УправлениеЛомбардом.ПолучитьДокументыПравоПребыванияРФ(ДатаДок, Представитель, ГражданствоПредставителя);  
		Для каждого СтрДоп из ТаблицаДоп Цикл
			НоваяСтрДоп = ДопДокументы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрДоп, СтрДоп);
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура РассчитатьПредельныСрокЗайма()
	ПредельныйСрокЗаймаДни = ЛБ_УправлениеЛомбардом.ПолучитьПредельныйСрокЗайма(ДатаДок, СхемаКредитования);
	Если НЕ ПредельныйСрокЗаймаДни = 0 Тогда  
		ПредельныйСрокЗайма = НачалоДня(ДатаДок) + ПредельныйСрокЗаймаДни*24*60*60;
	Иначе  
		ПредельныйСрокЗайма = Дата(1,1,1);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПолучитьНастройкиЗайма()
	ЗапросН = Новый Запрос;
	ЗапросН.УстановитьПараметр("Дата", Этаформа.ДатаДок);
	ЗапросН.Текст = "ВЫБРАТЬ
	                |	ЛБ_НастройкаЗаймаСрезПоследних.Настройка КАК Настройка,
	                |	ЛБ_НастройкаЗаймаСрезПоследних.Значение КАК Значение
	                |ИЗ
	                |	РегистрСведений.ЛБ_НастройкаЗайма.СрезПоследних(&Дата, ) КАК ЛБ_НастройкаЗаймаСрезПоследних
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	ЛБ_НастройкаЗаймаСрезПоследних.Период УБЫВ";
	ТаблицаЗапроса = ЗапросН.Выполнить().Выгрузить();
	НастройкиЗайма.Загрузить(ТаблицаЗапроса);
КонецПроцедуры 

&НаСервере
Функция ИнформацияПродукт()
	Если НЕ ЗначениеЗаполнено(СхемаКредитования) тогда
		Возврат "";
	КонецЕсли;
	Возврат  СокрЛП(СхемаКредитования) + ?(ЗначениеЗаполнено(Акция), ", " + СокрЛП(Акция), "");
КонецФункции	

&НаКлиенте
Процедура ПриОткрытии(Отказ)   
	СписокСС = ПолучитьСлужебныеСтатусыКлиента(Плательщик);
	Если НЕ СписокСС.Количество() = 0 Тогда 
		ПредупреждениеП = "";
		Для каждого Элемент из СписокСС Цикл 
			СтруктураВозврата = ПроверитьСлужебныйСтатус(Элемент.Значение, 1);
			Если СтруктураВозврата.Запрет Тогда 
				ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов");
				//+МАН 03.04.26 Изменено сообщение. Заявка 3759
				//Предупреждение("Для клиента " + СокрЛП(Плательщик) + " определен запрет на операцию " + Строка(ВидОперации), 60, "Проверка служебных статусов клиента");
				Предупреждение("Клиенту " + СокрЛП(Плательщик) + " присвоен служебный статус """ + Строка(Элемент.Значение) + """, в связи с чем запрещена операция: """ + Строка(ВидОперации) + """", 60, "Проверка служебных статусов клиента");
				//-МАН
				Отказ = Истина;
				Возврат;  
			Иначе
				ПредупреждениеП = СтруктураВозврата.Предупредить;
			КонецЕсли;	
		КонецЦикла;   
		Если НЕ ПустаяСтрока(ПредупреждениеП) Тогда
			Ответ = Вопрос(ПредупреждениеП + " Продолжить?", РежимДиалогаВопрос.ОКОтмена); 
			Если Ответ = КодВозвратаДиалога.Отмена Тогда  
				Отказ = Истина;
			    Возврат;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;      

	СписокСС = ПолучитьСлужебныеСтатусыКлиента(Залогодатель);
	Если НЕ СписокСС.Количество() = 0 Тогда 
		ПредупреждениеП = "";
		Для каждого Элемент из СписокСС Цикл 
			СтруктураВозврата = ПроверитьСлужебныйСтатус(Элемент.Значение, 2);
			Если СтруктураВозврата.Запрет Тогда 
				ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление");
				//+МАН 03.04.26 Изменено сообщение. Заявка 3759
				//Предупреждение("Для клиента " + СокрЛП(Залогодатель) + " определен запрет на операцию " + Строка(ВидОперации), 60, "Проверка служебных статусов клиента");
				Предупреждение("Клиенту " + СокрЛП(Залогодатель) + " присвоен служебный статус """ + Строка(Элемент.Значение) + """, в связи с чем запрещена операция: """ + Строка(ВидОперации) + """", 60, "Проверка служебных статусов клиента");
				//-МАН
				Отказ = Истина;
				Возврат;  
			Иначе
				ПредупреждениеП = СтруктураВозврата.Предупредить;
			КонецЕсли;	
		КонецЦикла;   
		Если НЕ ПустаяСтрока(ПредупреждениеП) Тогда
			Ответ = Вопрос(ПредупреждениеП + " Продолжить?", РежимДиалогаВопрос.ОКОтмена); 
			Если Ответ = КодВозвратаДиалога.Отмена Тогда  
				Отказ = Истина;
			    Возврат;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;      
		
	Если НЕ ДопДокументы.Количество() = 0 Тогда
		Элементы.ГруппаДопДокумент.Показать(); 
	КонецЕсли;	
	
	Если НеРедактировать Тогда  
		Элементы.Редактировать.Видимость = ?(Этаформа.ТолькоПросмотр, Ложь, Истина);
		Элементы.КнопкаИстория.Видимость = Истина;
		Элементы.ВыдатьЗайм.Доступность = ложь;
		Элементы.ТоварыГруппаЭ.Доступность = ложь; 
		Элементы.ПовышеннаяОценка.Доступность = ложь; 
		Элементы.Округление.Доступность = ложь;
		Элементы.Отмена.Заголовок = "Закрыть";  
	Иначе
		Если ПроцентУвеличенияОценкиЗалога = 0 Тогда  
			Элементы.ПовышеннаяОценка.Доступность = ложь; 
			ПовышеннаяОценка = Ложь;
		КонецЕсли;
	КонецЕсли;		
	ОбновитьДанныеТовары(); 
	ОбновитьДанныеВставки();			
	Элементы.ОсновнаяПанель.ТолькоПросмотр = НеРедактировать;
	ПриСменеСтраницы(Элементы.ОсновнаяПанель.ТекущаяСтраница); 
	
	Если ЗначениеЗаполнено(Залогодатель) И НЕ ЗначениеЗаполнено(ДокументЗайма) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Залогодатель", ?(ЗначениеЗаполнено(Представитель), Представитель, Залогодатель));	
			
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеПроверкиАктуальности",ЭтаФорма);
		ОткрытьФорму("ОбщаяФорма.ЛБ_ПроверкаАктуальностиДанныхКлиента", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
	КонецЕсли;  
КонецПроцедуры  

&НаКлиенте
Процедура ПослеПроверкиАктуальности(Результат, ДопПараметры) Экспорт
	Если Результат = Ложь тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Залогодатель", Залогодатель);
		ПараметрыФормы.Вставить("Дата", ДатаДок);	
		//ПараметрыФормы.Вставить("ТолькоПросмотр", истина);
		//ПараметрыФормы.Вставить("НеРедактировать", истина); 
		
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеИзмененияКарточки",ЭтаФорма);
		ОткрытьФорму("ОбщаяФорма.ЛБ_КарточкаЗалогодателя", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ОбновитьДанныеТовары();
	ОбновитьДанныеВставки();
КонецПроцедуры  

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьДанныеТовары();
	ОбновитьДанныеВставки();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ЭтаФорма.Закрыть(?(ЗначениеЗаполнено(ДокументЗайма), Истина, неопределено));
КонецПроцедуры

&НаСервере
Процедура ТоварыИтоги()  
	ТоварыИтогКоличество = 0;
	ТоварыИтогВес = 0; 
	ТоварыИтогВесМеталл = 0;
	ТоварыИтогОценкаМеталл = 0;
	ТоварыИтогОценкаВставки = 0; 
	ТоварыИтогОценка = 0;
    ТоварыИтогМаксОценка = 0;
	ТоварыИтогСсуда = 0;

	Для каждого Стр из Товары Цикл
		Если НЕ Стр.Переоформить Тогда  
			Продолжить;
		КонецЕсли;	
		ТоварыИтогКоличество = ТоварыИтогКоличество + Стр.Количество;
		ТоварыИтогВес = ТоварыИтогВес  + Стр.Вес; 
		ТоварыИтогВесМеталл = ТоварыИтогВесМеталл + Стр.ВесЧистый;
		ТоварыИтогОценкаМеталл = ТоварыИтогОценкаМеталл + Стр.СуммаОценкиМеталлы;
		ТоварыИтогОценкаВставки = ТоварыИтогОценкаВставки + Стр.СуммаОценкиКамни; 
		ТоварыИтогОценка = ТоварыИтогОценка + Стр.СуммаОценки;
	    ТоварыИтогМаксОценка = ТоварыИтогМаксОценка + Стр.СуммаОценкиМаксимальная;
		ТоварыИтогСсуда = ТоварыИтогСсуда + Стр.СуммаСсуды;
	КонецЦикла;
КонецПроцедуры 

&НаСервере
Процедура ВставкиИтоги() 
	ВставкиИтогКоличество = Вставки.Итог("Количество"); 
	ВставкиИтогВесК = Вставки.Итог("Вес"); 
	ВставкиИтогВесГ = Вставки.Итог("ВесГраммы"); 
	ВставкиИтогОценка = Вставки.Итог("Сумма");
КонецПроцедуры

&НаСервере
Процедура ДополнительныеМеталлыИтоги() 
	ДополнительныеМеталлыИтогВес = ДополнительныеМеталлы.Итог("ВесЧистый");
	ДополнительныеМеталлыИтогОценка = ДополнительныеМеталлы.Итог("СуммаОценкиМеталлы");
КонецПроцедуры

&НаСервере
Функция ПроверитьЕстьЗалогиДень() 
	Отбор = Новый структура;
	Отбор.Вставить("Настройка", Перечисления.ЛБ_ТипыНастроекЗайма.СуммироватьЗаймыЗаДень);
	СтрокиН = НастройкиЗайма.НайтиСтроки(Отбор);
	Если СтрокиН.Количество() = 0 Тогда
		Возврат 0;
	ИначеЕсли НЕ СтрокиН.Получить(0).Значение Тогда 
	    Возврат 0;	
	КонецЕсли;	
	Если ЗначениеЗаполнено(Залогодатель) тогда
		Запрос = новый Запрос; 
		Запрос.УстановитьПараметр("Залогодатель", Залогодатель); 
		Запрос.УстановитьПараметр("Дата1", НачалоДня(ДатаДок)); 
		Запрос.УстановитьПараметр("Дата2", ДатаДок);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_ОборотыПоОперациямЗаймаОбороты.Регистратор КАК Регистратор,
		               |	СУММА(ЛБ_ОборотыПоОперациямЗаймаОбороты.СуммаСсудыОборот) КАК СуммаСсуды
		               |ИЗ
		               |	РегистрНакопления.ЛБ_ОборотыПоОперациямЗайма.Обороты(
		               |			&Дата1,
		               |			&Дата2,
		               |			Регистратор,
		               |			ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог)
		               |				И Залогодатель = &Залогодатель) КАК ЛБ_ОборотыПоОперациямЗаймаОбороты
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЛБ_ОборотыПоОперациямЗаймаОбороты.Регистратор";  
		Выборка = Запрос.Выполнить().Выбрать();
		СуммаСсуды = 0;
		Пока Выборка.Следующий() Цикл 
			Если ЗначениеЗаполнено(ДокументЗайма) тогда
				Если Выборка.Регистратор = ДокументЗайма Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;	 
			СуммаСсуды = СуммаСсуды + Выборка.СуммаСсуды;
		КонецЦикла;
		Возврат СуммаСсуды;
	КонецЕсли;
	Возврат 0;
КонецФункции

&НаСервере
Процедура ЗаполнитьТабличныеЧасти(НачальноеЗаполнение = Ложь)    
	Если НЕ НачальноеЗаполнение Тогда
		Документ = ДокументЗайма;
	Иначе 
		Документ = ПредыдущаяОперация;
	КонецЕсли;	  
	Если НЕ НачальноеЗаполнение Тогда 
		Для каждого стр Из ДокументЗайма.ДополнительныеДокументыПравоПребыванияРФ Цикл
			НоваяСтр = ДопДокументы.Добавить(); 
			ЗаполнитьЗначенияСвойств(НоваяСтр, стр);
		Конеццикла;	    
		Для каждого стр Из ДокументЗайма.ПроцентныеСтавкиПоПериодам Цикл
			НоваяСтр = ПроцентныеСтавкиПоПериодам.Добавить(); 
			ЗаполнитьЗначенияСвойств(НоваяСтр, стр);
		Конеццикла; 
		Для каждого стр Из ДокументЗайма.ГрафикПлатежей Цикл
			НоваяСтр = ГрафикПлатежей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтр, стр);
		Конеццикла;
	КонецЕсли;
	
	Ном = 0;
	Для каждого стр Из Документ.Товары Цикл 
		Если НачальноеЗаполнение И ПредыдущаяОперация.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда
			Если НЕ Стр.Переоформить Тогда
			    Продолжить;
			КонецЕсли;	 
		КонецЕсли;	
		НоваяСтр = Товары.Добавить(); 
		ЗаполнитьЗначенияСвойств(НоваяСтр, стр); 
		НоваяСтр.Переоформить = ?(НачальноеЗаполнение, Истина, Стр.Переоформить); 
		НоваяСтр.Новый = ?(НачальноеЗаполнение, Ложь, Стр.Новый);
		Если НоваяСтр.Переоформить Тогда
		    НоваяСтр.Статус = ?(НеРедактировать, "Принят", "Проект"); 
			НоваяСтр.СтатусДоп = ?(НачальноеЗаполнение, "", ?(НоваяСтр.Новый, " Добавлен", "")); 
			Ном = Ном + 1;
		Иначе   
			НоваяСтр.Статус = "Выкуп";
		КонецЕсли;	 		
		НоваяСтр.Артикул = ?(НеРедактировать, ?(НЕ Стр.Переоформить, "", ЛБ_УправлениеЛомбардом.АртикулОбъектаЗалога(Документ, Ном)), "");
	Конеццикла;	 
	Для каждого стр Из Документ.Вставки Цикл
		НоваяСтр = Вставки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтр, стр);
	Конеццикла;	
    Для каждого стр Из Документ.ДополнительныеМеталлы Цикл
		НоваяСтр = ДополнительныеМеталлы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтр, стр);
	Конеццикла;
	Для каждого стр Из Документ.Дефекты Цикл
		НоваяСтр = Дефекты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтр, стр);
	Конеццикла;	 
	
	Если НачальноеЗаполнение Тогда 
		ОбработатьИзменениеСуммыЗайма(НачальноеЗаполнение);
	КонецЕсли;	

КонецПроцедуры	

&НаСервере
Процедура ЦенаДрагоценногоКамня(Идентификатор, ИдентификаторТовары) 
	СтрокаТабличнойЧасти 				  = Вставки.НайтиПоИдентификатору(Идентификатор);
	СтрокаТабличнойЧастиТовары 			  = Товары.НайтиПоИдентификатору(ИдентификаторТовары);
	
	Если СтрокаТабличнойЧасти.НеОценивать Тогда
        СтрокаТабличнойЧасти.Цена = 0;
		СтрокаТабличнойЧасти.Сумма = 0;
	Иначе           
		СтруктураВставки = новый Структура; 
		СтруктураВставки.Вставить("Дата", ДатаДок); 
		СтруктураВставки.Вставить("Ломбард", Ломбард);
		СтруктураВставки.Вставить("ВидВставки", СтрокаТабличнойЧасти.ВидВставки);
		СтруктураВставки.Вставить("ФормаОгранки", СтрокаТабличнойЧасти.ФормаОгранки);
        СтруктураВставки.Вставить("ВидОгранки", СтрокаТабличнойЧасти.ВидОгранки);
        СтруктураВставки.Вставить("КачествоОгранки", СтрокаТабличнойЧасти.КачествоОгранки);
        СтруктураВставки.Вставить("ЕдиницаИзмерения", СтрокаТабличнойЧасти.ЕдиницаИзмерения);
 		//+Мельников 24.09.24 Добавлен параметр "Залогодатель". ВИП. Заявка 2792
        СтруктураВставки.Вставить("Залогодатель", Залогодатель);
        СтруктураВставки.Вставить("СхемаКредитования", СхемаКредитования);

		//+Мельников 24.07.24 Для расчета суммы от единицы, а не общего веса
		//СтруктураВставки.Вставить("Вес", ?(СтрокаТабличнойЧасти.ЕдиницаИзмерения.Код = "162", СтрокаТабличнойЧасти.вес, СтрокаТабличнойЧасти.ВесГраммы));
        СтруктураВставки.Вставить("Вес", ?(СтрокаТабличнойЧасти.ЕдиницаИзмерения.Код = "162", СтрокаТабличнойЧасти.ВесШтКар, СтрокаТабличнойЧасти.ВесГраммыШт));
		//-Мельников
        Результат = ЛБ_ОбщийМодуль.ПолучитьЦенуДрагоценногоКамняИзПрейскуранта(СтруктураВставки);
	    СтрокаТабличнойЧасти.Цена = Результат.Цена; 
		СтрокаТабличнойЧасти.Приказ = Результат.Приказ;
		//+МАН 10.12.25
		СтрокаТабличнойЧасти.ПриказВИПВставки = Результат.ПриказВИПВставки;
		//-МАН
	    СтрокаТабличнойЧасти.Сумма = окр(СтрокаТабличнойЧасти.Цена * ?(НЕ СтрокаТабличнойЧасти.ЭтоВесовой, СтрокаТабличнойЧасти.Количество, СтрокаТабличнойЧасти.Вес), 2);
	КонецЕсли;	
КонецПроцедуры   

&НаСервере 
Функция ОкруглитьСуммуСсуды(Сумма)
	Если ЭтаФорма.Округление Тогда
	    Возврат ЛБ_УправлениеЛомбардом.ОкруглитьСуммуСсудыПоНастройкам(ДатаДок, Организация, Сумма);
	Иначе
		Возврат Сумма;
	КонецЕсли;	
КонецФункции	

&НаСервере
Процедура РасчетСуммыОценкиИтоговой(НачальноеЗаполнение = Ложь)
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Дата", ДатаДок);
	СтруктураПараметров.Вставить("Ломбард", Ломбард);
	СтруктураПараметров.Вставить("СхемаКредитования", СхемаКредитования);  
	//+Мельников 24.09.24 ВИП. Заявка 2792
	СтруктураПараметров.Вставить("Залогодатель", Залогодатель);
	//-Мельников
	СуммаЗайма = 0;
	Для каждого Стр Из Товары Цикл
		Если НЕ стр.Переоформить Тогда 
			Продолжить;
		КонецЕсли;	
		СтруктураПараметров.Вставить("Проба", Стр.Проба);
		СтруктураПараметров.Вставить("Категория", Стр.Категория);
		СтруктураПараметров.Вставить("ЕдиницаИзмерения", Стр.ЕдиницаИзмерения);
    	Результат = ЛБ_ОбщийМодуль.ПолучитьЦенуМеталлаИзПрейскуранта(СтруктураПараметров);
		Стр.Цена = Результат.Цена;  
		Стр.Приказ = Результат.Приказ;
		//+МАН 10.12.25
		Стр.ПриказВИПМеталлы = Результат.ПриказВИПМеталлы;
		//-МАН
	    Стр.СуммаОценкиМеталлы = Стр.ВесЧистый*Стр.Цена; 
		ОтборВ = Новый Структура;
		ОтборВ.Вставить("КлючСтроки", Стр.КлючСтроки);
		Строки = Вставки.НайтиСтроки(ОтборВ);
	    СуммаОценкиКамни = 0;		
		Для каждого СтрВ Из Строки Цикл	
	        ЦенаДрагоценногоКамня(СтрВ.ПолучитьИдентификатор(), Стр.ПолучитьИдентификатор());
		    СуммаОценкиКамни = СуммаОценкиКамни + СтрВ.Сумма; 
		КонецЦикла;		
	    Стр.СуммаОценкиКамни = СуммаОценкиКамни;
	    
		ОтборДоп = Новый Структура;
		ОтборДоп.Вставить("КлючСтроки", Стр.КлючСтроки);
		СтрокиДоп = ДополнительныеМеталлы.НайтиСтроки(ОтборДоп);
		Для каждого СтрДоп Из СтрокиДоп Цикл  
			СтруктураПараметров.Вставить("Проба", СтрДоп.Проба);
		    СтруктураПараметров.Вставить("Категория", СтрДоп.Категория);
		    СтруктураПараметров.Вставить("ЕдиницаИзмерения", СтрДоп.ЕдиницаИзмерения);
			Результат = ЛБ_ОбщийМодуль.ПолучитьЦенуМеталлаИзПрейскуранта(СтруктураПараметров);
			СтрДоп.Цена = Результат.Цена;  
			СтрДоп.Приказ = Результат.Приказ;
			//+МАН 10.12.25
			СтрДоп.ПриказВИПМеталлы = Результат.ПриказВИПМеталлы;
			//-МАН
        	СтрДоп.СуммаОценкиМеталлы = СтрДоп.Цена*СтрДоп.ВесЧистый;
			Стр.СуммаОценкиМеталлы = Стр.СуммаОценкиМеталлы + СтрДоп.СуммаОценкиМеталлы;
		Конеццикла;	
		Стр.СуммаОценки = Стр.СуммаОценкиМеталлы + Стр.СуммаОценкиКамни;
		
		РасчетМаксимальнойСуммыОценки(Стр.ПолучитьИдентификатор());  
		//Если НачальноеЗаполнение ИЛИ Стр.Новый Тогда  
			Стр.СуммаСсуды = Стр.СуммаОценкиМаксимальная;
		//Иначе	
		//	Если Стр.СуммаСсуды > Стр.СуммаОценкиМаксимальная Тогда
		//		Стр.СуммаСсуды = Стр.СуммаОценкиМаксимальная;
		//	КонецЕсли;
		//КонецЕсли;	
		СуммаЗайма = СуммаЗайма + Стр.СуммаСсуды;
	КонецЦикла;	
	СуммаЗайма = ОкруглитьСуммуСсуды(СуммаЗайма); 
	РаспределитьСуммуЗайма();                                                 
	ТоварыИтоги();
	УстановитьТекстСуммаЗаймаДень();
КонецПроцедуры  

&НаСервере
Процедура РаспределитьСуммуЗайма()
    СуммаДляРаспределения = СуммаЗайма;
	Если СуммаДляРаспределения = 0 Тогда
		Возврат;
	КонецЕсли;	 
	//МаксимальнаяОценкаИтог = Товары.Итог("СуммаОценкиМаксимальная");  
	//Если МаксимальнаяОценкаИтог = 0 Тогда  
	ОценкаИтог = 0; 
	Для каждого Стр Из Товары Цикл 
		Если Стр.Переоформить Тогда
			ОценкаИтог = ОценкаИтог + Стр.СуммаОценки;   
		КонецЕсли;	
	КонецЦикла;	
	Если ОценкаИтог = 0 Тогда 
        Возврат;  
	КонецЕсли;	  
	НомСтрМакс = 0; 
	МаксОценка = 0;  
	Коэфф = СуммаЗайма/ОценкаИтог;
	
	НомСтр = 0;
	Для каждого Стр Из Товары Цикл 
		Если НЕ Стр.Переоформить Тогда  
			Продолжить;
		КонецЕсли;	
		НомСтр = НомСтр + 1;
		//Коэфф = Стр.СуммаОценкиМаксимальная/МаксимальнаяОценкаИтог;
		//Стр.СуммаСсуды = СуммаЗайма*Коэфф; 
		Стр.СуммаСсуды = Стр.СуммаОценки*Коэфф;
		Стр.СуммаОценкиМаксимальная = Стр.СуммаСсуды;
		Если Стр.СуммаОценкиМаксимальная < Стр.СуммаОценки Тогда
			Стр.СуммаОценкиМаксимальная = Стр.СуммаОценки;
		КонецЕсли;	  
		СуммаДляРаспределения = СуммаДляРаспределения - Стр.СуммаСсуды; 
		Если Стр.СуммаОценкиМаксимальная > МаксОценка Тогда
			МаксОценка = Стр.СуммаОценкиМаксимальная;  
			НомСтрМакс = НомСтр-1;
		КонецЕсли;	
	КонецЦикла;    
	
	Если НЕ СуммаДляРаспределения = 0 Тогда
		Стр = Товары.Получить(НомСтрМакс);
		Стр.СуммаСсуды = Стр.СуммаСсуды + СуммаДляРаспределения;   
		Стр.СуммаОценкиМаксимальная = Стр.СуммаСсуды;
		Если Стр.СуммаОценкиМаксимальная < Стр.СуммаОценки Тогда
			Стр.СуммаОценкиМаксимальная = Стр.СуммаОценки;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры
             
&НаСервере
Процедура ЗаполнитьТаблицуСтавок() 
	ПроцентныеСтавкиПоПериодам.Очистить();
	ТаблицаСтавок.Очистить();       
	СуммаЗаймаРасчеты = СуммаЗайма + СуммаЗаймаДень;    
	Если ЭтоСотрудник И РасчетСотрудникаДоп Тогда
		//+Мельников 24.09.24 Добавлен параметр "Залогодатель". ВИП. Заявка 2792
		ТаблицаС = ЛБ_ОбщийМодуль.ЗаполнитьТаблицуПроцентныхСтавок(ДатаДок, Ломбард, СхемаКредитования, Акция, ДопСтатусСотрудник, СписокДопСтатусов, СуммаЗаймаРасчеты, Залогодатель);
	Иначе	
		//+Мельников 24.09.24 Добавлен параметр "Залогодатель". ВИП. Заявка 2792
	    ТаблицаС = ЛБ_ОбщийМодуль.ЗаполнитьТаблицуПроцентныхСтавок(ДатаДок, Ломбард, СхемаКредитования, Акция, СтатусЗалогодателя, СписокДопСтатусов, СуммаЗаймаРасчеты, Залогодатель);
	КонецЕсли;
	Если НЕ ТаблицаС.Количество() = 0 Тогда  
		СтрС = ТаблицаС.Получить(0);
		ПриказСтавки = СтрС.Приказ;
		ПриказАкцияСтавки = СтрС.ПриказАкция;
		//+МАН 10.12.25
		ПриказВИПСтавки = СтрС.ПриказВИП;
		//-МАН

		ПроцентныеСтавкиПоПериодам.Загрузить(ТаблицаС);
		
		Отбор = Новый структура;
		Отбор.Вставить("ПричинаПрименения", ПричинаПримененияПроцентнойСхемы); 
		СтрокиП = ПроцентныеСтавкиПоПериодам.НайтиСтроки(Отбор); 
		Для каждого СтрП из строкиП цикл 
			НоваяСтр = ТаблицаСтавок.Добавить(); 
			ЗаполнитьЗначенияСвойств(НоваяСтр, СтрП);
		КонецЦикла;	
		
		ОтборС = Новый Структура;
		ОтборС.Вставить("ДеньНачалаПрименения", 1);
		СтрокиС = ТаблицаСтавок.НайтиСтроки(ОтборС); 
		Если НЕ СтрокиС.Количество() = 0 Тогда 
			СтрС = СтрокиС.Получить(0);	 
			Если СтрС.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Базовая Тогда 
				ПроцентнаяСхема = СтрС.ПроцентнаяСтавка;
			ИначеЕсли СтрС.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Акционная Тогда	
				Если НЕ СтрС.ПроцентнаяСтавкаАкция = 0 Тогда 
					ПроцентнаяСхема = СтрС.ПроцентнаяСтавкаАкция; 
					ОтклонениеПоАкции = Ложь;
				ИначеЕсли НЕ СтрС.ОтклонениеАкцияАбсолютное = 0 Тогда
					ПроцентнаяСхема = СтрС.ПроцентнаяСтавка + СтрС.ОтклонениеАкцияАбсолютное;
					ОтклонениеПоАкции = Истина;
				ИначеЕсли НЕ СтрС.ОтклонениеАкцияОтносительное = 0 Тогда
					ПроцентнаяСхема = СтрС.ПроцентнаяСтавка + СтрС.ПроцентнаяСтавка*СтрС.ОтклонениеАкцияОтносительное/100;
					ОтклонениеПоАкции = Истина;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры	  

&НаСервере
Функция РассчитатьСуммуПроцентов()   
	ГрафикПлатежей.Очистить();
	Если НЕ ПроцентнаяСхема = 0 Тогда   		
		СтруктураОкругления = новый Структура;
		СтруктураОкругления.Вставить("ОкруглятьЦены", ОкруглятьПроценты);  
		СтруктураОкругления.Вставить("ВидОкругленияСуммыПроцентов", ВидОкругленияСуммыПроцентов);
		СтруктураОкругления.Вставить("ПорядокОкругления", ПорядокОкругления);  
		СтруктураОкругления.Вставить("ОкруглятьВБольшуюСторону", ОкруглятьВБольшуюСторону);  
		
		//ДатаНачала = НачалоДня(ДатаДок);  
		//Если НачислятьПроцентыЗаДеньЗалога Тогда  
		//	ДатаНачала = НачалоДня(ДатаНачала);
		//Иначе	
		//	ДатаНачала = НачалоДня(ДатаНачала + (60 * 60 * 24));
		//КонецЕсли;              
		ДатаНачала = ЛБ_УправлениеЛомбардом.ПолучитьДатуНачалаРасчетаПроцентов(ДатаДок, Константы.ЛБ_ОсновнаяОрганизация.Получить());
		
		Для сч = 0 По ТаблицаСтавок.Количество()-1 Цикл 
			СтрС = ТаблицаСтавок.Получить(сч); 
			Если СтрС.ДеньНачалаПрименения = 1 Тогда
				ДатаНач = ДатаНачала;
			Иначе 
				ДатаНач = НачалоДня(ДатаНачала-1) + СтрС.ДеньНачалаПрименения*(60 * 60 * 24);
			КонецЕсли;	
			Если ДатаНач > ДатаВыкупа Тогда 
		 		Прервать;
			КонецЕсли;	
			
			сч1 = сч + 1;
			Если сч1 >= ТаблицаСтавок.Количество() Тогда
				ДатаКон = ДатаВыкупа; 
				ДеньКон = СрокЗалога;
			Иначе   
				СтрС1 = ТаблицаСтавок.Получить(сч1);
				ДатаКонца = НачалоДня(ДатаНачала-1) + (СтрС1.ДеньНачалаПрименения-1)*(60 * 60 * 24); 
				Если ДатаКонца > ДатаВыкупа Тогда
					ДатаКон = ДатаВыкупа;
					ДеньКон = СрокЗалога;
				Иначе
					ДатаКон = ДатаКонца; 
					ДеньКон = СтрС1.ДеньНачалаПрименения-1;
				КонецЕсли;	
			КонецЕсли;	
			
			Если НЕ (НачалоДня(ДатаКон) < НачалоДня(ДатаНач)) тогда
				СтавкаП = СтрС.ПроцентнаяСтавка; 
				Если СтрС.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Акционная Тогда
					Если НЕ СтрС.ПроцентнаяСтавкаАкция = 0 Тогда
						СтавкаП = СтрС.ПроцентнаяСтавкаАкция;
					ИначеЕсли НЕ СтрС.ОтклонениеАкцияОтносительное = 0 Тогда	 
						СтавкаП = СтрС.ПроцентнаяСтавка + СтрС.ПроцентнаяСтавка*СтрС.ОтклонениеАкцияОтносительное/100;
					ИначеЕсли НЕ СтрС.ОтклонениеАкцияАбсолютное = 0 Тогда
						СтавкаП = СтрС.ПроцентнаяСтавка + СтрС.ОтклонениеАкцияАбсолютное;
				    КонецЕсли; 
				КонецЕсли;	              
			    Результат = ЛБ_ОбщийМодуль.РассчитатьСуммуПроцентов(ДатаНач, ДатаКон, СтавкаП, СуммаЗайма, СтруктураОкругления);
				СуммаПроцентов = Результат.СуммаПроцентов; 
				Если СтрС.ДеньНачалаПрименения = 1 Тогда
		            СуммаПроцентовДень = Результат.СуммаПроцентовДень;				
				КонецЕсли;	
				СтрП = ГрафикПлатежей.Добавить();  
				СтрП.ВидПроцентнойСтавки = СтрС.ВидПроцентнойСтавки; 
				СтрП.ДатаНач = ДатаНач;
				СтрП.ДатаКон = ДатаКон;
				СтрП.ДеньНач = СтрС.ДеньНачалаПрименения;  
				СтрП.ДеньКон = ДеньКон; 
				СтрП.ПроцентнаяСтавкаБазовая = СтрС.ПроцентнаяСтавка;
				СтрП.ПроцентнаяСтавкаАкция = СтрС.ПроцентнаяСтавкаАкция;
				СтрП.ОтклонениеАкцияОтносительное = СтрС.ОтклонениеАкцияОтносительное; 
				СтрП.ОтклонениеАкцияАбсолютное = СтрС.ОтклонениеАкцияАбсолютное;
                СтрП.СуммаПроцентов = Результат.СуммаПроцентов;
				СтрП.СуммаПроцентовДень = СуммаПроцентовДень;  					
			КонецЕсли;	
		Конеццикла;	 
	Иначе
		СуммаПроцентов = 0;
		СуммаПроцентовДень = 0;
	КонецЕсли;
	Возврат СуммаПроцентов;
КонецФункции	

&НаСервере
Процедура ЗаполнитьИнфорациюОЗалогодателе(Параметры, ПроверитьДоверенность = Истина)
	Если Параметры.Свойство("ДокументЗалогодателя") Тогда
		ДокументЗалогодателя = Параметры.ДокументЗалогодателя; 
		ЗаполнитьИнформациюОДокументеЗалогодателя();
		ИнформацияОДокументеВСтроку();
	КонецЕсли;	
	ЗаполнитьКонтакнуюИнформациюЗалогодателя();
	КонтактнаяИнформацияВСтроку();     
	Если ПроверитьДоверенность Тогда
		Если ЗначениеЗаполнено(Представитель) Тогда
			Плательщик = Представитель;
		Иначе	
		    Плательщик = Залогодатель;
		КонецЕсли;	
		Если НЕ Плательщик = ПредыдущаяОперация.Залогодатель Тогда 
			ЗаполнитьСписокВыбораДоверенностейПлательщика();  
			Если НЕ Элементы.Доверенность.СписокВыбора.Количество() = 0 Тогда
				Если НЕ ДоверенностьПереоформление = Элементы.Доверенность.СписокВыбора.Получить(0).Значение Тогда
				    ДоверенностьПереоформление = Элементы.Доверенность.СписокВыбора.Получить(0).Значение;
					ЗаполнитьТекстДоверенности();
				КонецЕсли; 
			Иначе    
				ДоверенностьПереоформление = ПредопределенноеЗначение("Документ.ЛБ_Доверенности.ПустаяСсылка");
				Доверенность = "";
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры    

&НаСервере
Процедура ЗаполнитьИнфорациюОПредставителе(Параметры, ПроверитьДоверенность = Истина)
	Если Параметры.Свойство("ДокументЗалогодателя") Тогда
		ДокументПредставителя = Параметры.ДокументЗалогодателя; 
		ЗаполнитьИнформациюОДокументеПредставителя();
		ИнформацияОДокументеПредставителяВСтроку();
	КонецЕсли;
	ЗаполнитьКонтакнуюИнформациюПредставителя();
	КонтактнаяИнформацияПредставителяВСтроку(); 
	Если ПроверитьДоверенность Тогда
		Если ЗначениеЗаполнено(Представитель) Тогда
			Плательщик = Представитель;
		Иначе	
		    Плательщик = Залогодатель;
		КонецЕсли;	
		Если НЕ Плательщик = ПредыдущаяОперация.Залогодатель Тогда 
			ЗаполнитьСписокВыбораДоверенностейПлательщика();  
			Если НЕ Элементы.Доверенность.СписокВыбора.Количество() = 0 Тогда
				Если НЕ ДоверенностьПереоформление = Элементы.Доверенность.СписокВыбора.Получить(0).Значение Тогда
				    ДоверенностьПереоформление = Элементы.Доверенность.СписокВыбора.Получить(0).Значение;
					ЗаполнитьТекстДоверенности();
				КонецЕсли; 
			Иначе    
				ДоверенностьПереоформление = ПредопределенноеЗначение("Документ.ЛБ_Доверенности.ПустаяСсылка");
				Доверенность = "";
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	

КонецПроцедуры 


&НаСервере
Процедура ИнформацияОДокументеВСтроку()
	Информация = "";
	Информация = СокрЛП(ДокументВид);
	Информация = Информация + ?(ЗначениеЗаполнено(ДокументСерия), " " + СокрЛП(ДокументСерия), "");
	Информация = Информация + ?(ЗначениеЗаполнено(ДокументНомер), " " + СокрЛП(ДокументНомер), "");
	Информация = Информация + ?(ЗначениеЗаполнено(ДокументКемВыдан), " выдан " + СокрЛП(ДокументКемВыдан), "");
	Информация = Информация + ?(ЗначениеЗаполнено(ДокументДатаВыдачи), " " + Формат(ДокументДатаВыдачи,"ДФ=dd.MM.yyyy"), "");
	Информация = Информация + ?(ЗначениеЗаполнено(ДокументКодПодразделения), " код подр. " + СокрЛП(ДокументКодПодразделения), "");
	Информация = Информация + ?(ЗначениеЗаполнено(ДокументНачалоДействия), " действует с " + Формат(ДокументНачалоДействия,"ДФ=dd.MM.yyyy"), "");
	Информация = Информация + ?(ЗначениеЗаполнено(ДокументСрокДействия), " по " + Формат(ДокументСрокДействия,"ДФ=dd.MM.yyyy"), "");
	Паспорт = Информация;
КонецПроцедуры

&НаСервере
Процедура ИнформацияОДокументеПредставителяВСтроку()
	Информация = "";
	Информация = СокрЛП(ДокументВидПредставителя);
	Информация = Информация + ?(ЗначениеЗаполнено(ДокументСерияПредставителя), " " + СокрЛП(ДокументСерияПредставителя), "");
	Информация = Информация + ?(ЗначениеЗаполнено(ДокументНомерПредставителя), " " + СокрЛП(ДокументНомерПредставителя), "");
	Информация = Информация + ?(ЗначениеЗаполнено(ДокументКемВыданПредставителя), " выдан " + СокрЛП(ДокументКемВыданПредставителя), "");
	Информация = Информация + ?(ЗначениеЗаполнено(ДокументДатаВыдачиПредставителя), " " + Формат(ДокументДатаВыдачиПредставителя,"ДФ=dd.MM.yyyy"), "");
	Информация = Информация + ?(ЗначениеЗаполнено(ДокументКодПодразделенияПредставителя), " код подр. " + СокрЛП(ДокументКодПодразделенияПредставителя), "");
	Информация = Информация + ?(ЗначениеЗаполнено(ДокументНачалоДействияПредставителя), " действует с " + Формат(ДокументНачалоДействияПредставителя,"ДФ=dd.MM.yyyy"), "");
	Информация = Информация + ?(ЗначениеЗаполнено(ДокументСрокДействияПредставителя), " по " + Формат(ДокументСрокДействияПредставителя,"ДФ=dd.MM.yyyy"), "");
	ПаспортПредставителя = Информация;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнформациюОДокументеЗалогодателя()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);  
	Запрос.УстановитьПараметр("ДокументЗалогодателя", ДокументЗалогодателя);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
		               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
		               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
		               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
		               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
		               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
		               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
		               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНачалоДействия КАК ДокументНачалоДействия,
		               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
		               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство
		               |ИЗ
		               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(
		               |			&Дата,
		               |			ДокументЗалогодателя = &ДокументЗалогодателя
		               |				И ОсновнойДУЛ = ИСТИНА) КАК ЛБ_ДокументыЗалогодателейСрезПоследних
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Период УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументВидДокументаЗалогодателя = Выборка.ВидДокументаЗалогодателя;
		ДокументВид = Выборка.ВидДокумента;
		ДокументГражданство = Выборка.Гражданство;
		ДокументСерия = Выборка.ДокументСерия;
		ДокументНомер = Выборка.ДокументНомер;
		ДокументДатаВыдачи = Выборка.ДокументДатаВыдачи;
		ДокументКемВыдан = Выборка.ДокументКемВыдан;
		ДокументКодПодразделения = Выборка.ДокументКодПодразделения;
		ДокументНачалоДействия = Выборка.ДокументНачалоДействия;
		ДокументСрокДействия = Выборка.ДокументСрокДействия;  
	Иначе
		ДокументВидДокументаЗалогодателя = справочники.ЛБ_ДокументыЗалогодателя.ПустаяСсылка();
		ДокументВид = Справочники.ВидыДокументовФизическихЛиц.ПустаяСсылка();
		ДокументГражданство = Справочники.СтраныМира.ПустаяСсылка();
		ДокументСерия = "";
		ДокументНомер = "";
		ДокументДатаВыдачи = Дата(1,1,1);
		ДокументКемВыдан = "";
		ДокументКодПодразделения = "";
		ДокументНачалоДействия = Дата(1,1,1);
		ДокументСрокДействия = Дата(1,1,1); 
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьИнформациюОДокументеПредставителя()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);  
	Запрос.УстановитьПараметр("ДокументЗалогодателя", ДокументПредставителя);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
		               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
		               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
		               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
		               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
		               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
		               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
		               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНачалоДействия КАК ДокументНачалоДействия,
		               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
		               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство
		               |ИЗ
		               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(
		               |			&Дата,
		               |			ДокументЗалогодателя = &ДокументЗалогодателя
		               |				И ОсновнойДУЛ = ИСТИНА) КАК ЛБ_ДокументыЗалогодателейСрезПоследних
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Период УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументВидДокументаПредставителя = Выборка.ВидДокументаЗалогодателя;
		ДокументВидПредставителя = Выборка.ВидДокумента;
		//ДокументГражданство = Выборка.Гражданство;
		ДокументСерияПредставителя = Выборка.ДокументСерия;
		ДокументНомерПредставителя = Выборка.ДокументНомер;
		ДокументДатаВыдачиПредставителя = Выборка.ДокументДатаВыдачи;
		ДокументКемВыданПредставителя = Выборка.ДокументКемВыдан;
		ДокументКодПодразделенияПредставителя = Выборка.ДокументКодПодразделения;
		ДокументНачалоДействияПредставителя = Выборка.ДокументНачалоДействия;
		ДокументСрокДействияПредставителя = Выборка.ДокументСрокДействия;  
	Иначе
		ДокументВидДокументаПредставителя = справочники.ЛБ_ДокументыЗалогодателя.ПустаяСсылка();
		ДокументВидПредставителя = Справочники.ВидыДокументовФизическихЛиц.ПустаяСсылка();
		//ДокументГражданство = Справочники.СтраныМира.ПустаяСсылка();
		ДокументСерияПредставителя = "";
		ДокументНомерПредставителя = "";
		ДокументДатаВыдачиПредставителя = Дата(1,1,1);
		ДокументКемВыданПредставителя = "";
		ДокументКодПодразделенияПредставителя = "";
		ДокументНачалоДействияПредставителя = Дата(1,1,1);
		ДокументСрокДействияПредставителя = Дата(1,1,1); 
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура КонтактнаяИнформацияВСтроку()
	Информация = "";
	Информация = Информация + ?(ЗначениеЗаполнено(Гражданство), СокрЛП(Гражданство), "");
	Информация = Информация + ?(ЗначениеЗаполнено(Пол), ?(ПустаяСтрока(Информация), "", "; ") + "пол.: " + Строка(Пол), "");
	Информация = Информация + ?(ЗначениеЗаполнено(ДатаРождения), ?(ПустаяСтрока(Информация), "", "; ") + "дата рожд.: " +  Формат(ДатаРождения, "ДФ=dd.MM.yyyy"), "");
	Информация = Информация + ?(ЗначениеЗаполнено(МестоРождения), ?(ПустаяСтрока(Информация), "", "; ") + "место рожд.: " +  СокрЛП(МестоРождения), "");
	Информация = Информация + ?(ЗначениеЗаполнено(Телефон), ?(ПустаяСтрока(Информация), "", "; ") + "тел.: " + СокрЛП(Телефон), "");
	Информация = Информация + ?(ЗначениеЗаполнено(Email), ?(ПустаяСтрока(Информация), "", "; ") + "email: " + СокрЛП(Email), "");  
	Если ЗначениеЗаполнено(АдресПоПрописке) Тогда
		АдресК = "адрес по прописке: " + СокрЛП(АдресПоПрописке);
	Иначе  
		АдресК = "фактический адрес: " + СокрЛП(ФактическийАдрес);
	КонецЕсли;	
	Информация = Информация + ?(ПустаяСтрока(Информация), "", "; ") + АдресК;

	КонтактнаяИнформация = Информация;
КонецПроцедуры

&НаСервере
Процедура КонтактнаяИнформацияПредставителяВСтроку()
	Информация = "";
	Информация = Информация + ?(ЗначениеЗаполнено(ГражданствоПредставителя), СокрЛП(ГражданствоПредставителя), "");
	Информация = Информация + ?(ЗначениеЗаполнено(ПолПредставителя), ?(ПустаяСтрока(Информация), "", "; ") + "пол.: " + Строка(ПолПредставителя), "");
	Информация = Информация + ?(ЗначениеЗаполнено(ДатаРожденияПредставителя), ?(ПустаяСтрока(Информация), "", "; ") + "дата рожд.: " +  Формат(ДатаРожденияПредставителя, "ДФ=dd.MM.yyyy"), "");
	Информация = Информация + ?(ЗначениеЗаполнено(МестоРожденияПредставителя), ?(ПустаяСтрока(Информация), "", "; ") + "место рожд.: " +  СокрЛП(МестоРожденияПредставителя), "");
	Информация = Информация + ?(ЗначениеЗаполнено(ТелефонПредставителя), ?(ПустаяСтрока(Информация), "", "; ") + "тел.: " + СокрЛП(ТелефонПредставителя), "");
	Информация = Информация + ?(ЗначениеЗаполнено(EmailПредставителя), ?(ПустаяСтрока(Информация), "", "; ") + "email: " + СокрЛП(EmailПредставителя), "");
	АдресК = "";
	Если ЗначениеЗаполнено(АдресПоПропискеПредставителя) Тогда
		АдресК = "адрес по прописке: " + СокрЛП(АдресПоПропискеПредставителя);
	ИначеЕсли ЗначениеЗаполнено(ФактическийАдресПредставителя) Тогда  
		АдресК = "фактический адрес: " + СокрЛП(ФактическийАдресПредставителя);
	КонецЕсли;	
	Информация = Информация + ?(ПустаяСтрока(Информация), "", "; ") + АдресК;

	КонтактПредставителя = Информация;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтакнуюИнформациюЗалогодателя()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
    Запрос.Текст = "ВЫБРАТЬ
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРождения КАК МестоРождения,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Email КАК Email,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПрописке КАК АдресПоПрописке,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ФактическийАдрес КАК ФактическийАдрес,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Пол КАК Пол,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК Телефон,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество
                   |ИЗ
                   |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Фамилия = Выборка.Фамилия;
        Имя = Выборка.Имя;
        Отчество = Выборка.Отчество;		
		ДатаРождения = Выборка.ДатаРождения;		
		Гражданство = Выборка.Гражданство;
		Пол = Выборка.Пол;
		МестоРождения = МестоРождения;
		Email = Выборка.Email;
		Телефон = Выборка.Телефон;		
		АдресПоПрописке = Выборка.АдресПоПрописке;
		ФактическийАдрес = Выборка.ФактическийАдрес;
		ФИО = Фамилия + " " + Имя + ?(ПустаяСтрока(Отчество), "", " " + Отчество);  
	Иначе
		Фамилия = "";
        Имя = "";
        Отчество = "";		
		ДатаРождения = "";		
		Гражданство = Справочники.СтраныМира.ПустаяСсылка();
		Пол = перечисления.ПолФизическогоЛица.ПустаяСсылка();
		МестоРождения = "";
		Email = "";
		Телефон = "";		
		АдресПоПрописке = "";
		ФактическийАдрес = "";
		ФИО = "";  
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьКонтакнуюИнформациюПредставителя()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("Залогодатель", Представитель);
    Запрос.Текст = "ВЫБРАТЬ
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРождения КАК МестоРождения,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Email КАК Email,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПрописке КАК АдресПоПрописке,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ФактическийАдрес КАК ФактическийАдрес,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Пол КАК Пол,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК Телефон,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество
                   |ИЗ
                   |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ФамилияПредставителя = Выборка.Фамилия;
        ИмяПредставителя = Выборка.Имя;
        ОтчествоПредставителя = Выборка.Отчество;		
		ДатаРожденияПредставителя = Выборка.ДатаРождения;		
		ГражданствоПредставителя = Выборка.Гражданство;
		ПолПредставителя = Выборка.Пол;
		МестоРожденияПредставителя = Выборка.МестоРождения;
		EmailПредставителя = Выборка.Email;
		ТелефонПредставителя = Выборка.Телефон;		
		АдресПоПропискеПредставителя = Выборка.АдресПоПрописке;  
		ФактическийАдресПредставителя = Выборка.ФактическийАдрес;
		ФИОПредставителя = ФамилияПредставителя + " " + ИмяПредставителя + ?(ПустаяСтрока(ОтчествоПредставителя), "", " " + ОтчествоПредставителя);  
	Иначе
		ФамилияПредставителя = "";
        ИмяПредставителя = "";
        ОтчествоПредставителя = "";		
		ДатаРожденияПредставителя = Дата(1,1,1);		
		ГражданствоПредставителя = Справочники.СтраныМира.ПустаяСсылка();
		ПолПредставителя = перечисления.ПолФизическогоЛица.ПустаяСсылка();
		МестоРожденияПредставителя = "";
		EmailПредставителя = "";
		ТелефонПредставителя = "";		
		АдресПоПропискеПредставителя = ""; 
		ФактическийАдресПредставителя = "";
		ФИОПредставителя = "";  
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьТаблицуДопСтатусовКлиента() 		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СтатусыЗалогодателей.Ссылка КАК Статус
	               |ИЗ
	               |	Справочник.ЛБ_СтатусыЗалогодателей КАК ЛБ_СтатусыЗалогодателей
	               |ГДЕ
	               |	ЛБ_СтатусыЗалогодателей.ПометкаУдаления = ЛОЖЬ
	               |	И ЛБ_СтатусыЗалогодателей.ЭтоГруппа = ЛОЖЬ
	               |	И ЛБ_СтатусыЗалогодателей.ДоступенДляВыбораВручную = ИСТИНА
	               |АВТОУПОРЯДОЧИВАНИЕ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	ТаблицаДопСтатусов.Загрузить(ТаблицаЗапроса); 
	Новаястр = ТаблицаДопСтатусов.Добавить();
	НоваяСтр.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Почетный;
КонецПроцедуры	

&НаСервере
Процедура ПолучитьДопСтатусыКлиента()  
	//очистим таблицу доп. статусов
	Для каждого Стр Из ТаблицаДопСтатусов Цикл 
		Стр.Используется = ложь;	
	КонецЦикла;	  
	
	Клиент = Залогодатель;
	ДатаРождения = ДатаРождения;
	Пол = Пол;	
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Залогодатель", Клиент);  
	Запрос.УстановитьПараметр("Дата", ДатаДок); 
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1)); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус,
	               |	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Используется КАК Используется
	               |ИЗ
	               |	РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(
	               |			&Дата,
	               |			Залогодатель = &Залогодатель
	               |				И Статус = &Статус
	               |				И ВЫБОР
	               |					КОГДА СрокДействия = &ПустаяДата
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ ВЫБОР
				   //+МАН 15.08.25 Исправил, чтобы срок действия учитывался как крнец дня
	               //|							КОГДА СрокДействия < &Дата
	               |							КОГДА КОНЕЦПЕРИОДА(СрокДействия, ДЕНЬ) < &Дата
	               |								ТОГДА ЛОЖЬ
	               |							ИНАЧЕ ИСТИНА
	               |						КОНЕЦ
	               |				КОНЕЦ) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних";
	Для каждого Стр Из ТаблицаДопСтатусов Цикл  
		Запрос.УстановитьПараметр("Статус", Стр.Статус);  
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Стр.Используется = Выборка.Используется; 
			Если Выборка.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Сотрудник Тогда  
				Если стр.Используется Тогда 
					ЭтоСотрудник = Истина;
				Иначе
					ЭтоСотрудник = Ложь;
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	   
	
	Если ЛБ_УправлениеЛомбардом.ПроверитьСтатусПочетный(ДатаРождения, Пол) Тогда 
		Отбор = Новый Структура;
		Отбор.Вставить("Статус", Справочники.ЛБ_СтатусыЗалогодателей.Почетный);
		СтрокиС = ТаблицаДопСтатусов.НайтиСтроки(Отбор);
		Если НЕ СтрокиС.Количество() = 0 Тогда
			СтрокиС.Получить(0).Используется = Истина;
		КонецЕсли;	
	КонецЕсли;   
	
	Если ЭтоСотрудник Тогда 
		Отбор = Новый Структура;
		Отбор.Вставить("Статус", Справочники.ЛБ_СтатусыЗалогодателей.Сотрудник);
		СтрокиС = ТаблицаДопСтатусов.НайтиСтроки(Отбор);
		Если НЕ СтрокиС.Количество() = 0 Тогда
			СтрокиС.Получить(0).Используется = Истина;
		КонецЕсли;	
	КонецЕсли;	
	
	Для каждого СтрС Из ТаблицаДопСтатусов Цикл
		Если СтрС.Используется Тогда
		    СписокДопСтатусов.Добавить(СтрС.Статус);
		КонецЕсли;	
	Конеццикла;	 
	
КонецПроцедуры

&НаСервере
Процедура СтатусыКлиентаВСтроку()
	СтатусыЗалогодателя = сокрЛП(СтатусЗалогодателя);
	Для каждого СтрС Из ТаблицаДопСтатусов Цикл 
		Если СтрС.Используется Тогда 
		    СтатусыЗалогодателя = СтатусыЗалогодателя + ?(ПустаяСтрока(СтатусыЗалогодателя), "", "; " + СокрЛП(СтрС.Статус));
		конецЕсли;	
	КонецЦикла;	
КонецПроцедуры	

&НаСервере
Процедура ОбработатьСхемуКредитованияНаСервере()	
	БезПродленияДоговора = СхемаКредитования.БезПродленияДоговора;
    ПризнакПримененияГибкогоПроцента = СхемаКредитования.ПризнакПримененияГибкогоПроцента;
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("СхемаКредитования", СхемаКредитования);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_УсловияПредоставленияКредитаСрезПоследних.СрокЗалога КАК СрокЗалога
	               |ИЗ
	               |	РегистрСведений.ЛБ_УсловияПредоставленияКредита.СрезПоследних(&Дата, СхемаКредитования = &СхемаКредитования) КАК ЛБ_УсловияПредоставленияКредитаСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		СрокЗалога = Выборка.СрокЗалога;
		ЗаполнитьДатуВыкупа();
		ДатаВыкупаЛьготная = ПолучитьЛьготнуюДатуВыкупа();
	КонецЕсли;	  
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст = "ВЫБРАТЬ
	               |	УсловияПредоставленияКредита.НачислятьПроцентыЗаДеньЗалога КАК НачислятьПроцентыЗаДеньЗалога,
	               |	УсловияПредоставленияКредита.НеНачислятьПроцентыЗаПоследнийДень КАК НеНачислятьПроцентыЗаПоследнийДень,
	               |	УсловияПредоставленияКредита.ОкруглятьСуммуПроценты КАК ОкруглятьПроценты,
	               |	УсловияПредоставленияКредита.ПорядокОкругленияПроценты КАК ПорядокОкругления,
	               |	УсловияПредоставленияКредита.ОкруглятьВБольшуюСторонуПроценты КАК ОкруглятьВБольшуюСторону,
	               |	УсловияПредоставленияКредита.ВидОкругленияСуммыПроцентов КАК ВидОкругленияСуммыПроцентов,
	               |	УсловияПредоставленияКредита.СчитатьПроцентыДеньВыдачиРавенДеньВыкупа КАК СчитатьПроцентыДеньВыдачиРавенДеньВыкупа,
	               |	УсловияПредоставленияКредита.ОкруглятьСуммуОценка КАК ОкруглятьОценка
	               |ИЗ
	               |	РегистрСведений.ЛБ_НастройкиЗаймаВерхнегоУровня.СрезПоследних(&Дата, Организация = &Организация) КАК УсловияПредоставленияКредита";
	Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда  
		НачислятьПроцентыЗаДеньЗалога = Выборка.НачислятьПроцентыЗаДеньЗалога;
		НеНачислятьПроцентыЗаПоследнийДень = Выборка.НеНачислятьПроцентыЗаПоследнийДень;
		СчитатьПроцентыДеньВыдачиРавенДеньВыкупа = Выборка.СчитатьПроцентыДеньВыдачиРавенДеньВыкупа;
		ОкруглятьПроценты = Выборка.ОкруглятьПроценты;
		ПорядокОкругления = Выборка.ПорядокОкругления;
        ОкруглятьВБольшуюСторону = Выборка.ОкруглятьВБольшуюСторону;
        ВидОкругленияСуммыПроцентов = Выборка.ВидОкругленияСуммыПроцентов;
		ОкруглятьЦены = Выборка.ОкруглятьОценка;
    КонецЕсли;
	
	ПроцентУвеличенияОценкиЗалога = 0;

	МассивС = Новый Массив;
	МассивС.Добавить(СтатусЗалогодателя); 
	МассивС.Добавить(Справочники.ЛБ_СтатусыЗалогодателей.ПустаяСсылка()); 
	Для каждого Эл Из СписокДопСтатусов Цикл  
		МассивС.Добавить(Эл.Значение);
	Конеццикла;
	Запрос.УстановитьПараметр("СтатусыЗалогодателя", МассивС); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_НастройкаУвеличенияЗалогаПоСтатусамЗалогодателейСрезПоследних.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрСведений.ЛБ_НастройкаУвеличенияЗалогаПоСтатусамЗалогодателей.СрезПоследних(&Дата, СхемаКредитования = &СхемаКредитования) КАК ЛБ_НастройкаУвеличенияЗалогаПоСтатусамЗалогодателейСрезПоследних";
	ВыборкаДок = Запрос.Выполнить().Выбрать();
	Если ВыборкаДок.Следующий() Тогда   
		Запрос.УстановитьПараметр("Регистратор", ВыборкаДок.Регистратор);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_НастройкаУвеличенияЗалогаПоСтатусамЗалогодателейСрезПоследних.УвеличениеСтоимостиЗалога КАК УвеличениеСтоимостиЗалога
		               |ИЗ
		               |	РегистрСведений.ЛБ_НастройкаУвеличенияЗалогаПоСтатусамЗалогодателей.СрезПоследних(, СтатусЗалогодателя В (&СтатусыЗалогодателя)) КАК ЛБ_НастройкаУвеличенияЗалогаПоСтатусамЗалогодателейСрезПоследних
		               |ГДЕ
		               |	ЛБ_НастройкаУвеличенияЗалогаПоСтатусамЗалогодателейСрезПоследних.Регистратор = &Регистратор";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ПроцентУвеличенияОценкиЗалога = Выборка.УвеличениеСтоимостиЗалога;  
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры   

&НаСервере
Процедура ЗаполнитьДатуВыкупа() 
	ДатаВыкупа = НачалоДня(ДатаДок) + 86401*СрокЗалога;  
	ДатаВыкупа = ЛБ_УправлениеЛомбардом.ИсключитьДатаВыкупаПразничныйДень(ДатаВыкупа);
КонецПроцедуры  

&НаСервере
Функция ПолучитьЛьготнуюДатуВыкупа()
    Возврат ЛБ_УправлениеЛомбардом.ПолучитьЛьготныйСрокЗалоговогоБилета(ДатаВыкупа); 
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокЛьготныхСтатусов() 
	СписокЛьготныхСтатусов.Очистить();
	
	//Проверим нового клиента
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(ДокументЗайма), Новый Граница(Новый МоментВремени(ДокументЗайма.Дата, ДокументЗайма), ВидГраницы.Исключая), ДатаДок));
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОперацииПоСистемеЛояльностиОбороты.КоличествоЗалоговОборот КАК КоличествоЗалогов
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОперацииПоСистемеЛояльности.Обороты(, &Дата, , Залогодатель = &Залогодатель) КАК ЛБ_ОперацииПоСистемеЛояльностиОбороты";  
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда   
		Если НЕ Выборка.КоличествоЗалогов = 0 Тогда
			СписокЛьготныхСтатусов.Добавить(Перечисления.ЛБ_ЛьготныеСтатусыЗаемщика.НовыйКлиент);
		КонецЕсли;	
	Иначе	
		СписокЛьготныхСтатусов.Добавить(Перечисления.ЛБ_ЛьготныеСтатусыЗаемщика.НовыйКлиент);
	КонецЕсли;
	
	//проверим пенсионер по возрасту 
	ВозрастЗалогодателя = ЛБ_ОбщийМодуль.ВычислитьВозраст(ДатаРождения);
	Если ЗначениеЗаполнено(ВозрастЗалогодателя) И ЗначениеЗаполнено(Пол) Тогда
		Если Пол = Перечисления.ПолФизическогоЛица.Женский Тогда 
			Если  ВозрастЗалогодателя  >= 55 Тогда  
				СписокЛьготныхСтатусов.Добавить(Перечисления.ЛБ_ЛьготныеСтатусыЗаемщика.Пенсионер);
			КонецЕсли;	
		ИначеЕсли  Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
			Если  ВозрастЗалогодателя  >= 60 Тогда  
				СписокЛьготныхСтатусов.Добавить(Перечисления.ЛБ_ЛьготныеСтатусыЗаемщика.Пенсионер);
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	
	//проверим льготные документы   
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СоответствиеДокументовИЛьготныхСтатусовСрезПоследних.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_СоответствиеДокументовИЛьготныхСтатусовСрезПоследних.Статус КАК Статус
	               |ИЗ
	               |	РегистрСведений.ЛБ_СоответствиеДокументовИЛьготныхСтатусов.СрезПоследних(&Дата, НеАктуально = ЛОЖЬ) КАК ЛБ_СоответствиеДокументовИЛьготныхСтатусовСрезПоследних";
	ТаблицаСоответствия = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст ="ВЫБРАТЬ
	              |	ЛБ_ДокументыЗалогодателя.ВидДокумента КАК ВидДокумента,
	              |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК СрокДействия
	              |ИЗ
	              |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних КАК ЛБ_ДокументыЗалогодателейСрезПоследних
	              |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЛБ_ДокументыЗалогодателя КАК ЛБ_ДокументыЗалогодателя
	              |		ПО ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя = ЛБ_ДокументыЗалогодателя.Ссылка
	              |ГДЕ
	              |	ЛБ_ДокументыЗалогодателя.ПометкаУдаления = ЛОЖЬ
	              |	И ЛБ_ДокументыЗалогодателя.ВидДокументаЗалогодателя = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДокументовЗалогодателя.ДополнительныйДокумент)
	              |	И ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНеДействителен = ЛОЖЬ
	              |	И ЛБ_ДокументыЗалогодателя.Владелец = &Залогодатель";
	Выборка = Запрос.Выполнить().Выбрать();   
	ДатаПроверки = ДатаДок;
	Пока Выборка.Следующий() цикл
		Если НЕ (Выборка.СрокДействия = Дата(1,1,1)) Тогда
			Если Выборка.СрокДействия < ДатаПроверки Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		Отбор = Новый структура;
		Отбор.Вставить("ВидДокумента", Выборка.ВидДокумента);
		Строки = ТаблицаСоответствия.НайтиСтроки(Отбор);
		Если Строки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;     
		Стр = Строки.Получить(0);
		Если СписокЛьготныхСтатусов.НайтиПоЗначению(Стр.Статус) = неопределено  Тогда
			СписокЛьготныхСтатусов.Добавить(Стр.Статус);
		КонецЕсли;	
	КонецЦикла;	  
	Если ЭтоСотрудник Тогда
	    СписокЛьготныхСтатусов.Добавить(Перечисления.ЛБ_ЛьготныеСтатусыЗаемщика.Сотрудник);
	КонецЕсли;	
КонецПроцедуры    

&НаСервере
Процедура ПолучитьДоступныеПроцентныеСхемыАкции() 
	СуммаЗаймаРасчет = СуммаЗаймаДень + СуммаЗайма; 
	Если ЭтоСотрудник тогда 
		РасчетСотрудникаДоп = Ложь;
		Если ЕстьЛьготыСотрудника Тогда
			Если (СуммаЗаймаПоЛьготамСотрудника >= СуммаЗайма) тогда
				ИзменитьСписокЛьготныхСтатусовСотрудника();
				ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьДоступныеПроцентныеСхемыАкции(ДатаДок, Ломбард, СтатусЗалогодателя, СуммаЗаймаРасчет, ОтказОтВыкупа, ПричинаПримененияПроцентнойСхемы, СписокДопСтатусов, СписокЛьготныхСтатусов, Промокод, Предъявитель); 
			Иначе        
				ИзменитьСписокЛьготныхСтатусовСотрудника(Ложь);
				Если ЗначениеЗаполнено(ДопСтатусСотрудник) Тогда
					РасчетСотрудникаДоп = Истина;
					ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьДоступныеПроцентныеСхемыАкции(ДатаДок, Ломбард, ДопСтатусСотрудник, СуммаЗаймаРасчет, ОтказОтВыкупа, ПричинаПримененияПроцентнойСхемы, СписокДопСтатусов, СписокЛьготныхСтатусов, Промокод, Предъявитель); 
				Иначе      
			        ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьДоступныеПроцентныеСхемыАкции(ДатаДок, Ломбард, СтатусЗалогодателя, СуммаЗаймаРасчет, ОтказОтВыкупа, ПричинаПримененияПроцентнойСхемы, СписокДопСтатусов, СписокЛьготныхСтатусов, Промокод, Предъявитель); 
				КонецЕсли;	 
			КонецЕсли;	
		Иначе 
			Если ЗначениеЗаполнено(ДопСтатусСотрудник) Тогда
				РасчетСотрудникаДоп = Истина;
				ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьДоступныеПроцентныеСхемыАкции(ДатаДок, Ломбард, ДопСтатусСотрудник, СуммаЗаймаРасчет, ОтказОтВыкупа, ПричинаПримененияПроцентнойСхемы, СписокДопСтатусов, СписокЛьготныхСтатусов, Промокод, Предъявитель); 
			Иначе      
		        ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьДоступныеПроцентныеСхемыАкции(ДатаДок, Ломбард, СтатусЗалогодателя, СуммаЗаймаРасчет, ОтказОтВыкупа, ПричинаПримененияПроцентнойСхемы, СписокДопСтатусов, СписокЛьготныхСтатусов, Промокод, Предъявитель); 
			КонецЕсли;	
		КонецЕсли;	
	Иначе		
	    ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьДоступныеПроцентныеСхемыАкции(ДатаДок, Ломбард, СтатусЗалогодателя, СуммаЗаймаРасчет, ОтказОтВыкупа, ПричинаПримененияПроцентнойСхемы, СписокДопСтатусов, СписокЛьготныхСтатусов, Промокод, Предъявитель); 
	КонецЕсли;	
	НомерСтроки = 0;                                                                                                                                                   
	ТаблицаВыбораСхемыКредитованияАкции.Очистить();
	Если НЕ ТаблицаЗапроса = неопределено Тогда
		Для каждого стрЗ Из ТаблицаЗапроса Цикл
		    НоваяСтрСК = ТаблицаВыбораСхемыКредитованияАкции.Добавить();
			НоваяСтрСК.НомерСтроки = НомерСтроки; 
			НоваяСтрСК.СхемаКредитования = стрЗ.СхемаКредитования;
			НоваяСтрСК.Акция = стрЗ.Акция;  			
			НоваяСтрСК.Приоритет = стрЗ.Приоритет; 
			НомерСтроки = НомерСтроки + 1;
		КонецЦикла;	  
		ТаблицаВыбораСхемыКредитованияАкции.Сортировать("Приоритет Убыв"); 
	конецЕсли;	
КонецПроцедуры   

&НаСервере
Функция ПроверитьСлужебныйСтатус(Статус, Вид)  
	Если Вид = 1 Тогда 
	    Возврат ЛБ_ОбщийМодуль.ПроверитьСлужебныйСтатус(Статус, Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов); 
	Иначе
		Возврат ЛБ_ОбщийМодуль.ПроверитьСлужебныйСтатус(Статус, Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление);
	КонецЕсли;	
КонецФункции


&НаСервере
Процедура УстановитьВидимость()
	Если ЗначениеЗаполнено(Представитель) Тогда 
		ГражданствоДоп = ГражданствоПредставителя;
	Иначе	
		ГражданствоДоп = Справочники.СтраныМира.Россия
	КонецЕсли;	
	Если Гражданство = Справочники.СтраныМира.Россия И ГражданствоДоп = Справочники.СтраныМира.Россия Тогда
	    Элементы.ГруппаДопДокумент.Видимость = Ложь; 	
	Иначе 
		Элементы.ГруппаДопДокумент.Видимость = Истина;
	КонецЕсли;
	Если СуммаЗаймаДень = 0 тогда
		Элементы.ДекорацияСуммаЗаймаДень.Видимость = Ложь;
	Иначе
		Элементы.ДекорацияСуммаЗаймаДень.Видимость = Истина;
		УстановитьТекстСуммаЗаймаДень();
	КонецЕсли;  
	Если НЕ ЭтоСотрудник тогда
		Элементы.ДекорацияСотрудник.Видимость = Ложь;
	Иначе
		Если НЕ НеРедактировать Тогда 
			Элементы.ДекорацияСотрудник.Видимость = Истина;
			УстановитьТекстСуммаЗаймаСотрудник();  
		Иначе
			Элементы.ДекорацияСотрудник.Видимость = Ложь;
		КонецЕсли;	
	КонецЕсли;       
	//+Мельников 25.04.24 Отмена операции
	Если ЗначениеЗаполнено(ДокументЗайма) Тогда

		ПроверкаПоследующихОпереаций = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(ДокументЗайма.НомерЗалоговогоБилета, ТекущаяДата(),,Истина);
		ЛомбардПользователя = ЛБ_ОбщийМодуль.ПолучитьЛомбардПользователя(ПараметрыСеанса.ТекущийПользователь);

		Если ДокументЗайма.Проведен И НЕ ТекущаяДата() - ДатаДок >= 3600 И ЛомбардПользователя = ДокументЗайма.Ломбард И
			?(ЗначениеЗаполнено(ДокументЗайма), ?(ПроверкаПоследующихОпереаций = Неопределено, Истина, ?(ПроверкаПоследующихОпереаций.Регистратор = ДокументЗайма, Истина, Ложь)), Ложь) И
			НЕ ЗначениеЗаполнено(ДокументОтмены) Тогда //+Мельников 31.07.24

			Элементы.ОтменитьОперацию.Доступность = Истина;
		Иначе
			Элементы.ОтменитьОперацию.Доступность = Ложь;
		КонецЕсли;

		//+МАН 17.06.25 Изменил
		//Если ЗначениеЗаполнено(ДокументЗайма.ДокументОтмены) Тогда
		Если ЗначениеЗаполнено(ДокументОтмены) Тогда
		//-МАН
			Элементы.ГруппаОтмена.Видимость = Истина;
			//+Мельников 28.05.24
			Элементы.Расчеты.Доступность = Ложь;
			Элементы.Редактировать.Доступность = Ложь;
			//-Мельников
		КонецЕсли;
	КонецЕсли;

	РаскраситьСтрокуТовары();
	//-Мельников
КонецПроцедуры

&НаСервере
Процедура РаскраситьСтрокуТовары()
        
    МассивИменКолонокДляПодсветки = Новый Массив;
	Для каждого Стр из Элементы.Товары.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(Стр.Вид) = Тип("ВидГруппыФормы") Тогда
			Для каждого СтрЭлем Из Стр.ПодчиненныеЭлементы Цикл
	        	МассивИменКолонокДляПодсветки.Добавить(СтрЭлем.Имя);
			КонецЦикла;
		Иначе
        	МассивИменКолонокДляПодсветки.Добавить(Стр.Имя);
		КонецЕсли;
    КонецЦикла;
        
    ЭлементОформления = УсловноеОформление.Элементы.Добавить();
    ЭлементОформления.Использование = Истина;
    ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Васильковый);
    
    ЭлементУсловия                = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Товары.Переоформить");
    ЭлементУсловия.ПравоеЗначение = Ложь;
    ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;   
    ЭлементУсловия.Использование  = Истина;
    
    Для каждого ТекЭлемент из МассивИменКолонокДляПодсветки Цикл
        ОформляемоеПоле      = ЭлементОформления.Поля.Элементы.Добавить();
        ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТекЭлемент);
    КонецЦикла;
        
КонецПроцедуры

&НаСервере
Процедура УстановитьТекстСуммаЗаймаДень() 
	Элементы.ДекорацияСуммаЗаймаДень.Заголовок = "Клиенту уже выдан займ " + СокрЛП(Формат(СуммаЗаймаДень, "ЧЦ=15; ЧДЦ=2")) + 
	    " руб. Итого сумма займа для расчета процентов " + СокрЛП(Формат(СуммаЗаймаДень + СуммаЗайма, "ЧЦ=15; ЧДЦ=2")) + " руб.";
КонецПроцедуры	

&НаСервере
Процедура УстановитьТекстСуммаЗаймаСотрудник()   
	Если ЕстьЛьготыСотрудника Тогда
		Если НЕ СуммаЗаймаПоЛьготамСотрудника = 0 Тогда
			Элементы.ДекорацияСотрудник.Заголовок = "Для сотрудника расчет процентов по льготной ставке при сумме займа не более " + СокрЛП(Формат(СуммаЗаймаПоЛьготамСотрудника, "ЧЦ=15; ЧДЦ=2")) + 
			         " руб." + ?(ЗначениеЗаполнено(ДопСтатусСотрудник), " В противном случае расчет как для клиента со статусом """ + сокрЛП(ДопСтатусСотрудник) + """.", ""); 
		Иначе 
			Элементы.ДекорацияСотрудник.Заголовок = ?(ЗначениеЗаполнено(ДопСтатусСотрудник), "Для сотрудника расчет процентов как для клиента со статусом """ + сокрЛП(ДопСтатусСотрудник) + """.", "Льготы по процентным ставкам для сотрудников не установлены");
		КонецЕсли;
	Иначе
		Элементы.ДекорацияСотрудник.Заголовок = "Льготы по процентным ставкам для сотрудников не установлены";
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура КарточкаПлательщика(Команда)
	СтандартнаяОбработка = ложь;
	Если ЗначениеЗаполнено(Залогодатель) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Залогодатель", Залогодатель);
		ПараметрыФормы.Вставить("Дата", ДатаДок);	
		ПараметрыФормы.Вставить("ТолькоПросмотр", истина);
		//ПараметрыФормы.Вставить("НеРедактировать", истина); 
		
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеИзмененияКарточки",ЭтаФорма);
		ОткрытьФорму("ОбщаяФорма.ЛБ_КарточкаЗалогодателя", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Сообщить("Не выбран заемщик!");
	КонецЕсли;	
КонецПроцедуры    

&НаКлиенте
Процедура КарточкаПредставителя(Команда)
	СтандартнаяОбработка = ложь;
	Если ЗначениеЗаполнено(Представитель) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Залогодатель", Представитель);
		ПараметрыФормы.Вставить("Дата", ДатаДок);	
		ПараметрыФормы.Вставить("ТолькоПросмотр", истина);
		//ПараметрыФормы.Вставить("НеРедактировать", истина); 
		
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеИзмененияКарточкиПредставителя",ЭтаФорма);
		ОткрытьФорму("ОбщаяФорма.ЛБ_КарточкаЗалогодателя", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Сообщить("Не выбран представитель заемщика!");
	КонецЕсли;	
КонецПроцедуры   


&НаСервере
Функция ПолучитьДокументЗалогодателя(Клиент) 
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("Залогодатель", Клиент);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя КАК ДокументЗалогодателя
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(
	               |			&Дата,
	               |			ДокументЗалогодателя.Владелец = &Залогодатель
	               |				И ОсновнойДУЛ = ИСТИНА) КАК ЛБ_ДокументыЗалогодателейСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Период УБЫВ"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДокументЗалогодателя;
	КонецЕсли; 
	Возврат ДокументЗалогодателя;
КонецФункции

&НаКлиенте
Процедура ПослеИзмененияКарточки(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;   
	
	Если ЭтаФорма.НеРедактировать тогда
		Возврат;
	КонецЕсли;	
	
	//Если НЕ ЗначениеЗаполнено(ДокументЗайма) И НачалоДня(ДатаДок) = НачалоДня(ТекущаяДата()) Тогда  
	ДатаСеанса = ОбщегоНазначенияКлиент.ДатаСеанса();
	Если НачалоДня(ДатаДок) = НачалоДня(ДатаСеанса) Тогда
		ДатаДок = ДатаСеанса;
	КонецЕсли;	
    ЗаполнитьКонтакнуюИнформациюЗалогодателя();
    КонтактнаяИнформацияВСтроку();       
	
	НовыйДокументЗалогодателя = ПолучитьДокументЗалогодателя(Залогодатель);
	Если НЕ ДокументЗалогодателя = НовыйДокументЗалогодателя Тогда
		ДокументЗалогодателя = НовыйДокументЗалогодателя;
		ЗаполнитьИнформациюОДокументеЗалогодателя();
		ИнформацияОДокументеВСтроку();  	
	КонецЕсли;	
	ЗаполнитьДопДокументы();
КонецПроцедуры       

&НаКлиенте
Процедура ПослеИзмененияКарточкиПредставителя(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;   
	
	Если ЭтаФорма.НеРедактировать тогда
		Возврат;
	КонецЕсли;	
	 
	ДатаСеанса = ОбщегоНазначенияКлиент.ДатаСеанса();
	Если НачалоДня(ДатаДок) = НачалоДня(ДатаСеанса) Тогда
		ДатаДок = ДатаСеанса;
	КонецЕсли;	
    ЗаполнитьКонтакнуюИнформациюПредставителя();
    КонтактнаяИнформацияПредставителяВСтроку();       
	
	НовыйДокументПредставителя = ПолучитьДокументЗалогодателя(Представитель);
	Если НЕ ДокументПредставителя = НовыйДокументПредставителя Тогда
		ДокументПредставителя = НовыйДокументПредставителя;
		ЗаполнитьИнформациюОДокументеПредставителя();
		ИнформацияОДокументеПредставителяВСтроку();  	
	КонецЕсли;	
	ЗаполнитьДопДокументыПредставителя();
КонецПроцедуры 


&НаСервере
Функция ПолучитьТекущийСтатусКлиента()
	Возврат ЛБ_УправлениеЛомбардом.ПолучитьТекущийСтатусКлиента(ДатаДок, Залогодатель);
КонецФункции

&НаСервере
Функция ПолучитьМинСуммуЗайма()
    Возврат ЛБ_ОбщийМодуль.ПолучитьМинимальнуюСуммуЗайма(ДатаДок);
КонецФункции

&НаСервере
Функция ПолучитьСогласиеНаСМСРассылку()
    Возврат ЛБ_УправлениеЛомбардом.ПолучитьСогласиеНаСМСРассылки(ДатаДок, Залогодатель);
КонецФункции

&НаКлиенте
Процедура ДатаДокПриИзменении(Элемент) 	
	ДатаДокТекущая = ДатаДок;  
	СогласиеНаСМСРассылку = ПолучитьСогласиеНаСМСРассылку();
	ЗаполнитьКонтакнуюИнформациюЗалогодателя();
    КонтактнаяИнформацияВСтроку();
	ЗаполнитьИнформациюОДокументеЗалогодателя();
	ИнформацияОДокументеВСтроку(); 
	ЗаполнитьДопДокументы(); 
	ЗаполнитьДопДокументыПредставителя();
	ЗаполнитьСостояниеЗалоговогоБилета();
	
	СтатусЗалогодателя = ПолучитьТекущийСтатусКлиента();
	Если ЭтоСотрудник Тогда
		ЗаполнитьЛьготныеСтатусыСотрудника();
	КонецЕсли;	
	ПолучитьДопСтатусыКлиента();  
	ЗаполнитьСписокЛьготныхСтатусов();
	СтатусыКлиентаВСтроку(); 
	СуммаЗаймаДень = ПроверитьЕстьЗалогиДень();  	
	//Элементы.ДекорацияСуммаЗаймаДень.Видимость = ?(Этаформа.СуммаЗаймаДень = 0, Ложь, Истина);  
	РасчетСуммыОценкиИтоговой(); 

	ПолучитьДоступныеПроцентныеСхемыАкции();
	Если НЕ ТаблицаВыбораСхемыКредитованияАкции.Количество() = 0 Тогда 
		ОтборК = Новый Структура;
		ОтборК.Вставить("СхемаКредитования", СхемаКредитования); 
		ОтборК.Вставить("Акция", Акция);
		СтрокиСК = ТаблицаВыбораСхемыКредитованияАкции.НайтиСтроки(ОтборК);
		Если СтрокиСК.Количество() = 0 Тогда 
		    СтрокаСК = ТаблицаВыбораСхемыКредитованияАкции.Получить(0); 
		Иначе  
			СтрокаСК = СтрокиСК.Получить(0);
		КонецЕсли;   
		Если СхемаКредитования = СтрокаСК.СхемаКредитования И Акция = СтрокаСК.Акция Тогда
			ЗаполнитьТаблицуСтавок();
		Иначе 
			СхемаКредитования = СтрокаСК.СхемаКредитования;   
			ТекущаяУстановкаУсловийПоСхемеКредитования = ПолучитьУсловияСК();
			Если НЕ ЗначениеЗаполнено(ТекущаяУстановкаУсловийПоСхемеКредитования) тогда
				 Сообщить("На дату документа не определены условия по кредитной схеме " + СокрЛП(СхемаКредитования) + "!"); 
			КонецЕсли; 
			Акция = СтрокаСК.Акция;     
			ОбработатьСхемуКредитованияНаСервере();
			//Элементы.ДекорацияПродукт.Заголовок = ИнформацияПродукт(); 
			ПроверитьДоступностьДопКнопок();	
			ЗаполнитьТаблицуСтавок();   			
			ОбработатьДополнительныеКнопки();
		КонецЕсли;	
   	    ЗаполнитьДатуВыкупа();
	    ДатаВыкупаЛьготная = ПолучитьЛьготнуюДатуВыкупа();
		ЗаполнитьТаблицуСтавок();
	Иначе
		СхемаКредитования = ПредопределенноеЗначение("Справочник.ЛБ_СхемыКредитования.ПустаяСсылка");
		Акция = ПредопределенноеЗначение("Справочник.ЛБ_Акции.ПустаяСсылка"); 
		//Элементы.ДекорацияПродукт.Заголовок = ИнформацияПродукт();
		ПроцентныеСтавкиПоПериодам.Очистить();
		ТаблицаСтавок.Очистить();
		ДатаВыкупа = Дата(1,1,1); 
		ДатаВыкупаЛьготная = Дата(1,1,1); 
		СрокЗалога = 0;
		ПроцентнаяСхема = 0;   
		Элементы.ПовышеннаяОценка.Доступность = ложь;
		ПовышеннаяОценка = Ложь;
		Сообщить("Не определена процентная схема! Расчет процентов по договору займа не возможен.");
	КонецЕсли;	  	
	УстановитьВидимость();  
	РассчитатьПредельныСрокЗайма();
	ОбработатьПСКНасервере();
	ЗаполнитьКВыдачеВнесению();
	МинСуммаЗайма = ПолучитьМинСуммуЗайма();
	//+Мельников 13.08.24 Формирование списка проб по прейскуранту. Заявка 2677.
	ЗаполнитьСписокПроб();
	//-Мельников
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть(?(ЗначениеЗаполнено(ДокументЗайма), Истина, неопределено));
КонецПроцедуры 


&НаСервере
Функция ПроверитьКлиентаПоПеречням()
	РезультатПроверки = Истина; 
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);  
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КлиентыВПеречняхСрезПоследних.ВидПеречня КАК ВидПеречня,
	               |	ЛБ_КлиентыВПеречняхСрезПоследних.СтатусКлиентаВПеречне КАК СтатусКлиентаВПеречне,
	               |	ЛБ_КлиентыВПеречняхСрезПоследних.Период КАК Период
	               |ИЗ
	               |	РегистрСведений.ЛБ_КлиентыВПеречнях.СрезПоследних(
	               |			&Дата,
	               |			Залогодатель = &Залогодатель
	               |				И ВидПеречня = &ВидПеречня) КАК ЛБ_КлиентыВПеречняхСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ"; 

	СписокПеречней = Новый СписокЗначений;
	СписокПеречней.Добавить(Перечисления.ЛБ_ВидыПеречней.Террористы);  
	СписокПеречней.Добавить(Перечисления.ЛБ_ВидыПеречней.ФРОМУ);
	СписокПеречней.Добавить(Перечисления.ЛБ_ВидыПеречней.МВК);
	СписокПеречней.Добавить(Перечисления.ЛБ_ВидыПеречней.ООН);
	
	Для каждого Эл из СписокПеречней Цикл 
		Запрос.УстановитьПараметр("ВидПеречня", Эл.Значение);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда     
			Если Выборка.СтатусКлиентаВПеречне = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен Тогда
				Если Выборка.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.Террористы Тогда
					Сообщить("Клиент найден в перечне террористов. Операции с клиентом запрещены!", СтатусСообщения.Важное);  
					РезультатПроверки = Ложь;
				ИначеЕсли Выборка.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ФРОМУ Тогда
					Сообщить("Клиент найден в перечне ФРОМУ. Операции с клиентом запрещены!", СтатусСообщения.Важное);  
					РезультатПроверки = Ложь;
		        ИначеЕсли Выборка.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.МВК Тогда
					Сообщить("Клиент найден в списке МВК. Операции с клиентом запрещены!", СтатусСообщения.Важное);  
					РезультатПроверки = Ложь;
				ИначеЕсли Выборка.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ООН Тогда
					Сообщить("Клиент найден в перечне ООН. Операции с клиентом запрещены!", СтатусСообщения.Важное);  
					РезультатПроверки = Ложь;	
				КонецЕсли;	  
			КонецЕсли;	
		КонецЕсли;     
	Конеццикла;	
	Возврат РезультатПроверки;
КонецФункции	

&НаСервере
Функция ПроверкаКлиента() 
	ВсеОК = Истина;
	
	ВозрастКлиента = ЛБ_ОбщийМодуль.ВычислитьВозраст(ДатаРождения);
	Если ВозрастКлиента  < 18 Тогда
	    Сообщить("Клиенту " + Строка(ВозрастКлиента) + " лет, работа с несовершеннолетними клиентами не осуществляется!", СтатусСообщения.Важное);
		ВсеОК = ложь;
	КонецЕсли;	
	
	Если НЕ ПроверитьКлиентаПоПеречням() Тогда
		ВсеОК = ложь;
	КонецЕсли; 
			
	Возврат ВсеОК;
КонецФункции    

&НаКлиенте
Процедура ФИОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура;
	Если ЗначениеЗаполнено(Залогодатель) Тогда
		ПараметрыФормы.Вставить("Залогодатель", Залогодатель);
	КонецЕсли;	  
	ПараметрыФормы.Вставить("Дата", ДатаДок); 
	Если НЕ ЗначениеЗаполнено(ДокументЗайма) И НачалоДня(ДатаДок) = НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса()) Тогда
		ПараметрыФормы.Вставить("НаТекущуюДату", Истина);
	КонецЕсли;	
	ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог"));
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЗалогодателя",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателя", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры  

&НаСервере
Функция ПолучитьНачальногоЗаемщика()
	Возврат ПредыдущаяОперация.Залогодатель
КонецФункции	

&НаКлиенте
Процедура ПредставительФИОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка) 
	Если НЕ Залогодатель = ПолучитьНачальногоЗаемщика() Тогда
		Сообщить("Выбор представителя заемщика не требуется!");
		Возврат;
	КонецЕсли;	
	ПараметрыФормы = Новый Структура;
	Если ЗначениеЗаполнено(Представитель) Тогда
		ПараметрыФормы.Вставить("Залогодатель", Представитель);
	КонецЕсли;	  
	ПараметрыФормы.Вставить("Дата", ДатаДок); 
	Если НЕ ЗначениеЗаполнено(ДокументЗайма) И НачалоДня(ДатаДок) = НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса()) Тогда
		ПараметрыФормы.Вставить("НаТекущуюДату", Истина);
	КонецЕсли;	
	ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог"));
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораПредставителя",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателя", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


&НаКлиенте
Процедура ПаспортНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если НЕ Залогодатель = ПолучитьНачальногоЗаемщика() Тогда
		Сообщить("Выбор представителя заемщика не требуется!");
		Возврат;
	КонецЕсли;
	ПараметрыФормы = Новый Структура;
	Если ЗначениеЗаполнено(Залогодатель) Тогда
		ПараметрыФормы.Вставить("Залогодатель", Залогодатель);
	КонецЕсли;	
	ПараметрыФормы.Вставить("Дата", ДатаДок); 
	Если НЕ ЗначениеЗаполнено(ДокументЗайма) И НачалоДня(ДатаДок) = НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса()) Тогда
		ПараметрыФормы.Вставить("НаТекущуюДату", Истина);
	КонецЕсли;	
	ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог"));
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЗалогодателя",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателя", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры     

&НаКлиенте
Процедура ПослеВыбораЗалогодателя(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;    
	
	Сотрудник = ПроверитьКлиентСотрудник(Результат.Залогодатель);
	Если НЕ Сотрудник = неопределено Тогда  
		//Если Сотрудник = ОтветственныйПользователь Тогда 
		Если Сотрудник = ОтветственныйСотрудник Тогда
			Сообщить("Выбранный заемщик является сотрудником оформляющим займ. Это запрещено!"); 
			Возврат; 
		Иначе
			ЭтоСотрудник = Истина;
		КонецЕсли;	              
	Иначе
		ЭтоСотрудник = Ложь;
	КонецЕсли;	
	
	СписокСС = ПолучитьСлужебныеСтатусыКлиента(Результат.Залогодатель);  
	Если НЕ СписокСС.Количество() = 0 Тогда 
		ПредупреждениеП = "";
		Для каждого Элемент из СписокСС Цикл 
			СтруктураВозврата = ПроверитьСлужебныйСтатус(Элемент.Значение, 2);
			Если СтруктураВозврата.Запрет Тогда    
				ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог");
				//+МАН 03.04.26 Изменено сообщение. Заявка 3759
				//Предупреждение("Для клиента " + СокрЛП(Залогодатель) + " определен запрет на операцию " + Строка(ВидОперации), 60, "Проверка служебных статусов клиента");
				Предупреждение("Клиенту " + СокрЛП(Залогодатель) + " присвоен служебный статус """ + Строка(Элемент.Значение) + """, в связи с чем запрещена операция: """ + Строка(ВидОперации) + """", 60, "Проверка служебных статусов клиента");
				//-МАН
				Возврат;  
			Иначе
				ПредупреждениеП = СтруктураВозврата.Предупредить;
			КонецЕсли;	
		КонецЦикла;   
		Если НЕ ПустаяСтрока(ПредупреждениеП) Тогда
			Ответ = Вопрос(ПредупреждениеП + " Продолжить?", РежимДиалогаВопрос.ОКОтмена, , "Проверка служебных статусов клиента"); 
			Если Ответ = КодВозвратаДиалога.Отмена Тогда  
			    Возврат;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;  
	
	ВыборЗалогодателяНаСервере(Результат);
	УстановитьВидимость();
КонецПроцедуры   

&НаКлиенте
Процедура ПослеВыбораПредставителя(Результат, ДопПараметры) Экспорт	
	СписокСС = ПолучитьСлужебныеСтатусыКлиента(Результат.Залогодатель);  
	Если НЕ СписокСС.Количество() = 0 Тогда 
		ПредупреждениеП = "";
		Для каждого Элемент из СписокСС Цикл 
			СтруктураВозврата = ПроверитьСлужебныйСтатус(Элемент.Значение, 1);
			Если СтруктураВозврата.Запрет Тогда    
				ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов");
				//+МАН 03.04.26 Изменено сообщение. Заявка 3759
				//Предупреждение("Для клиента " + СокрЛП(Залогодатель) + " определен запрет на операцию " + Строка(ВидОперации), 60, "Проверка служебных статусов клиента");
				Предупреждение("Клиенту " + СокрЛП(Залогодатель) + " присвоен служебный статус """ + Строка(Элемент.Значение) + """, в связи с чем запрещена операция: """ + Строка(ВидОперации) + """", 60, "Проверка служебных статусов клиента");
				//-МАН
				Возврат;  
			Иначе
				ПредупреждениеП = СтруктураВозврата.Предупредить;
			КонецЕсли;	
		КонецЦикла;   
		Если НЕ ПустаяСтрока(ПредупреждениеП) Тогда
			Ответ = Вопрос(ПредупреждениеП + " Продолжить?", РежимДиалогаВопрос.ОКОтмена, , "Проверка служебных статусов клиента"); 
			Если Ответ = КодВозвратаДиалога.Отмена Тогда  
			    Возврат;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;  

	ВыборПредставителяНаСервере(Результат);	
	УстановитьВидимость();
КонецПроцедуры 

&НаСервере
Процедура ОчиститьДокументыЗалогодателя()
	Отбор = Новый структура;
	Отбор.Вставить("Клиент", Залогодатель);
	СтрокиДоп = ДопДокументы.НайтиСтроки(Отбор);
	Для каждого СтрДоп Из строкиДоп Цикл
		ДопДокументы.Удалить(СтрДоп);
	Конеццикла;	
	
	ДокументЗалогодателя = Справочники.ЛБ_ДокументыЗалогодателя.ПустаяСсылка();
	ДокументВид = Справочники.ВидыДокументовФизическихЛиц.ПустаяСсылка();
	ДокументВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ПустаяСсылка();
	ДокументГражданство = Справочники.СтраныМира.ПустаяСсылка();
	ДокументДатаВыдачи = Дата(1,1,1);
	ДокументКемВыдан = "";
	ДокументНомер = "";
	ДокументСерия = "";
	ДокументКодПодразделения = "";
	ДокументНачалоДействия = Дата(1,1,1);
	ДокументСрокДействия = Дата(1,1,1);
	ЭтаФорма.Паспорт = "";
КонецПроцедуры

&НаСервере
Процедура ОчиститьДокументыПредставителя()
	Отбор = Новый структура;
	Отбор.Вставить("Клиент", Представитель);
	СтрокиДоп = ДопДокументы.НайтиСтроки(Отбор);
	Для каждого СтрДоп Из строкиДоп Цикл
		ДопДокументы.Удалить(СтрДоп);
	Конеццикла;	
	
	ДокументПредставителя = Справочники.ЛБ_ДокументыЗалогодателя.ПустаяСсылка();
	ДокументПредставителяВид = Справочники.ВидыДокументовФизическихЛиц.ПустаяСсылка();
	ДокументВидДокументаПредставителя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ПустаяСсылка();
	ДокументГражданствоПредставителя = Справочники.СтраныМира.ПустаяСсылка();
	ДокументДатаВыдачиПредставителя = Дата(1,1,1);
	ДокументКемВыданПредставителя = ""; 
	ДокументНомерПредставителя = "";
	ДокументСерияПредставителя = "";
	ДокументКодПодразделенияПредставителя = "";
	ДокументНачалоДействияПредставителя = Дата(1,1,1);
	ДокументСрокДействияПредставителя = Дата(1,1,1);
	ЭтаФорма.ПаспортПредставителя = "";
КонецПроцедуры

&НаСервере
Процедура ОчиститьПредставителя()   
	ОчиститьДокументыПредставителя();
	Представитель = Справочники.ЛБ_Залогодатели.ПустаяСсылка();
	ФамилияПредставителя = "";
    ИмяПредставителя = "";
    ОтчествоПредставителя = "";		
	ДатаРожденияПредставителя = Дата(1,1,1);		
	ГражданствоПредставителя = Справочники.СтраныМира.ПустаяСсылка();
	ПолПредставителя = перечисления.ПолФизическогоЛица.ПустаяСсылка();
	МестоРожденияПредставителя = "";
	EmailПредставителя = "";
	ТелефонПредставителя = "";		
	АдресПоПропискеПредставителя = "";
	ФактическийАдресПредставителя = "";
	ФИОПредставителя = "";  
   	КонтактПредставителя = "";
	ДоверенностьПереоформление = Документы.ЛБ_Доверенности.ПустаяСсылка();
	Доверенность = ""; 	
КонецПроцедуры

&НаКлиенте
Процедура ФИОПредставителяОчистка(Элемент, СтандартнаяОбработка)
	ОчиститьПредставителя();
КонецПроцедуры

&НаСервере
Процедура ВыборЗалогодателяНаСервере(Результат) 
	Если Результат = неопределено Тогда
		Возврат;
	КонецЕсли;
	Залогодатель = Результат.Залогодатель;
	ОчиститьДокументыЗалогодателя();
	ЗаполнитьИнфорациюОЗалогодателе(Результат);  	 
	Если НЕ Залогодатель = ПредыдущаяОперация.Залогодатель И ЗначениеЗаполнено(Представитель) Тогда
		ОчиститьПредставителя();
		ДопДокументы.Очистить();
	КонецЕсли;	  
	ЗаполнитьДопДокументы(); 
	Если ЗначениеЗаполнено(Представитель) Тогда
		Плательщик = Представитель;
	Иначе
		Плательщик = Залогодатель;  
	КонецЕсли;	
	Если НЕ Плательщик = ПредыдущаяОперация.Залогодатель Тогда
		Элементы.ГруппаДоверенность.Видимость = Истина;
		ЗаполнитьСписокВыбораДоверенностейПлательщика();
		Если НЕ Элементы.Доверенность.СписокВыбора.Количество() = 0 Тогда 
			ДоверенностьПереоформление = Элементы.Доверенность.СписокВыбора.Получить(0).Значение;
			ЗаполнитьТекстДоверенности();
		КонецЕсли;      
	иначе
		Элементы.ГруппаДоверенность.Видимость = ложь; 
		ДоверенностьПлательщика = ПредопределенноеЗначение("Документ.ЛБ_Доверенности.ПустаяСсылка");
	КонецЕсли;    
	Если ЭтоСотрудник Тогда
		ЗаполнитьЛьготныеСтатусыСотрудника();
	КонецЕсли;
	
	НеРезидент = ?(Гражданство = ПредопределенноеЗначение("Справочник.СтраныМира.Россия"), ложь, истина);
	СтатусЗалогодателя = ЛБ_УправлениеЛомбардом.ПолучитьТекущийСтатусКлиента(ДатаДок, Залогодатель);
	СогласиеНаСМСРассылку = ЛБ_УправлениеЛомбардом.ПолучитьСогласиеНаСМСРассылки(ДатаДок, Залогодатель);
	ПолучитьДопСтатусыКлиента();   
	СтатусыКлиентаВСтроку();    		
	СуммаЗаймаДень = ПроверитьЕстьЗалогиДень();
	ЗаполнитьСписокЛьготныхСтатусов();  
	//Элементы.ДекорацияСуммаЗаймаДень.Видимость = ?(Этаформа.СуммаЗаймаДень = 0, Ложь, Истина);   
	РасчетСуммыОценкиИтоговой();
	
	ПолучитьДоступныеПроцентныеСхемыАкции();
    Если НЕ ТаблицаВыбораСхемыКредитованияАкции.Количество() = 0 Тогда 
		ОтборК = Новый Структура;
		ОтборК.Вставить("СхемаКредитования", СхемаКредитования); 
		ОтборК.Вставить("Акция", Акция);
		СтрокиСК = ТаблицаВыбораСхемыКредитованияАкции.НайтиСтроки(ОтборК);
		Если СтрокиСК.Количество() = 0 Тогда 
		    СтрокаСК = ТаблицаВыбораСхемыКредитованияАкции.Получить(0); 
		Иначе  
			СтрокаСК = СтрокиСК.Получить(0);
		КонецЕсли;   
		Если СхемаКредитования = СтрокаСК.СхемаКредитования И Акция = СтрокаСК.Акция Тогда
			ЗаполнитьТаблицуСтавок();
        Иначе
			СхемаКредитования = СтрокаСК.СхемаКредитования;  
			ТекущаяУстановкаУсловийПоСхемеКредитования = ПолучитьУсловияСК();
			Если НЕ ЗначениеЗаполнено(ТекущаяУстановкаУсловийПоСхемеКредитования) тогда
				 Сообщить("На дату документа не определены условия по кредитной схеме " + СокрЛП(СхемаКредитования) + "!"); 
			КонецЕсли; 
			Акция = СтрокаСК.Акция; 
			ОбработатьСхемуКредитованияНаСервере(); 
			//Элементы.ДекорацияПродукт.Заголовок = ИнформацияПродукт(); 
			ПроверитьДоступностьДопКнопок();
			ЗаполнитьТаблицуСтавок();			
			ОбработатьДополнительныеКнопки();
			ЗаполнитьДатуВыкупа();
		    ДатаВыкупаЛьготная = ПолучитьЛьготнуюДатуВыкупа(); 
		КонецЕсли;	
	Иначе
		СхемаКредитования = ПредопределенноеЗначение("Справочник.ЛБ_СхемыКредитования.ПустаяСсылка"); 
		//Элементы.ДекорацияПродукт.Заголовок = ИнформацияПродукт();
		Акция = ПредопределенноеЗначение("Справочник.ЛБ_Акции.ПустаяСсылка");
		ПроцентныеСтавкиПоПериодам.Очистить();
		ТаблицаСтавок.Очистить();
		ДатаВыкупа = Дата(1,1,1); 
		ДатаВыкупаЛьготная = Дата(1,1,1); 
		СрокЗалога = 0;
		ПроцентнаяСхема = 0;      
		Элементы.ПовышеннаяОценка.Доступность = ложь;
		Сообщить("Не определена процентная схема! Расчет процентов по договору займа не возможен.");
	КонецЕсли;	  
 	УстановитьВидимость();
	ОбработатьПСКНасервере(); 
	ЗаполнитьКВыдачеВнесению();
КонецПроцедуры

&НаСервере
Процедура ВыборПредставителяНаСервере(Результат)  
	Если Результат = неопределено Тогда
		Возврат;
	КонецЕсли;	
	Представитель = Результат.Залогодатель;
	ОчиститьДокументыПредставителя();
	ЗаполнитьИнфорациюОПредставителе(Результат);  
	ЗаполнитьДопДокументыПредставителя();
	
	Если ЗначениеЗаполнено(Представитель) Тогда
		Плательщик = Представитель;
	Иначе
		Плательщик = Залогодатель;  
	КонецЕсли;	
	Если НЕ Плательщик = ПредыдущаяОперация.Залогодатель Тогда
		Элементы.ГруппаДоверенность.Видимость = Истина;
		ЗаполнитьСписокВыбораДоверенностейПлательщика();
		Если НЕ Элементы.Доверенность.СписокВыбора.Количество() = 0 Тогда 
			ДоверенностьПлательщика = Элементы.Доверенность.СписокВыбора.Получить(0).Значение;
			ЗаполнитьТекстДоверенности();
		КонецЕсли;      
	иначе
		Элементы.ГруппаДоверенность.Видимость = ложь; 
		ДоверенностьПлательщика = ПредопределенноеЗначение("Документ.ЛБ_Доверенности.ПустаяСсылка");
	КонецЕсли;    
 	УстановитьВидимость(); 
КонецПроцедуры

&НаКлиенте
Процедура ДоверенностьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВыбЭлемент = ЭтаФорма.ВыбратьИзСписка(Элемент.СписокВыбора, Элемент, 0);
	Если НЕ ВыбЭлемент = Неопределено Тогда 
		ДоверенностьПереоформление = ВыбЭлемент.Значение;    
		ЗаполнитьТекстДоверенности();  
	КонецЕсли;
КонецПроцедуры   

&НаКлиенте
Процедура ДоверенностьОчистка(Элемент, СтандартнаяОбработка)  
	ДоверенностьПереоформление = ПредопределенноеЗначение("Документ.ЛБ_Доверенности.ПустаяСсылка");
	ЗаполнитьТекстДоверенности();
КонецПроцедуры

&НаСервере
Функция РасчетПСКГод(СуммаЗаймаЗБ, СуммаПроцентовЗБ)                                                                                                       
	//СуммарнаяПроцентнаяСтавка = 0;
	//
	//Отбор = Новый структура;
	//Отбор.Вставить("ПричинаПрименения", Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма);
	//СтрокиС = ПроцентныеСтавкиПоПериодам.НайтиСтроки(Отбор);
	//Для сч = 0 По СтрокиС.Количество() - 1 Цикл 
	//	СтрС = строкиС.Получить(сч);
	//	ДеньНач = СтрС.ДеньНачалаПрименения;
	//	
	//	сч1 = сч + 1;
	//	Если сч1 >= СтрокиС.Количество() Тогда
	//		ДеньКон = СрокЗалога; 
	//	Иначе      
	//		СтрС1 = СтрокиС.Получить(сч1);
	//		ДеньКон = СтрС1.ДеньНачалаПрименения;  
	//		Если ДеньКон > СрокЗалога Тогда
	//			ДеньКон = СрокЗалога;
	//		КонецЕсли;	
	//	КонецЕсли;	

	//	КолДней = ДеньКон-ДеньНач+1;
	//	Если СтрС.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Базовая Тогда 
	//		Ставка = СтрС.ПроцентнаяСтавка;
	//	ИначеЕсли СтрС.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Акционная Тогда	
	//		Если НЕ СтрС.ПроцентнаяСтавкаАкция = 0 Тогда 
	//			Ставка = СтрС.ПроцентнаяСтавкаАкция;
	//		ИначеЕсли НЕ СтрС.ОтклонениеАкцияАбсолютное = 0 Тогда
	//			Ставка = СтрС.ПроцентнаяСтавка + СтрС.ОтклонениеАкцияАбсолютное;
	//		ИначеЕсли НЕ СтрС.ОтклонениеАкцияОтносительное = 0 Тогда
	//			Ставка = СтрС.ПроцентнаяСтавка + СтрС.ПроцентнаяСтавка*СтрС.ОтклонениеАкцияОтносительное/100;
	//		КонецЕсли;
	//	КонецЕсли;	  
	//	СуммарнаяПроцентнаяСтавка = СуммарнаяПроцентнаяСтавка + Ставка*КолДней;
	//	Если ДеньКон = СрокЗалога Тогда  
	//		Прервать;
	//	КонецЕсли;	
	//КонецЦикла;
	//Возврат ЛБ_УправлениеЛомбардом.РасчетПСКГод(?(НачислятьПроцентыЗаДеньЗалога, СрокЗалога+1, СрокЗалога), СуммарнаяПроцентнаяСтавка);  
	СрокРасчета = (ДатаВыкупа - НачалоДня(ДатаДок))/(24*60*60);
	Возврат ЛБ_УправлениеЛомбардом.РасчетПСКГод(ДатаДок, СрокРасчета, СуммаЗаймаЗБ, СуммаПроцентовЗБ);
КонецФункции

&НаСервере
Функция ПолучитьСлужебныеСтатусыКлиента(Клиент)
	Возврат ЛБ_ОбщийМодуль.ПолучитьСлужебныеСтатусыКлиента(ДатаДок, Клиент);
КонецФункции	

&НаКлиенте
Процедура ДобавитьДокументПравоПребывания(Команда)
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораДокументаПравоПребывания",ЭтаФорма);
    ЗначениеОтбора = Новый Структура;
    ЗначениеОтбора.Вставить("Залогодатель", Залогодатель);
    ЗначениеОтбора.Вставить("ВидДокументаЗалогодателя", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийПравоПребыванияРФ"));
    ЗначениеОтбора.Вставить("Дата", ДатаДок);

    ОткрытьФорму("ОбщаяФорма.ЛБ_ПодборДокументовКлиента", ЗначениеОтбора, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры  

&НаСервере
Процедура ПослеВыбораДокументаПравоПребывания(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	НоваяСтр = ДопДокументы.Добавить();
	НоваяСтр.ДокументЗалогодателя = Результат.ДокументЗалогодателя;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("ДокументЗалогодателя", НоваяСтр.ДокументЗалогодателя);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя.Владелец КАК Клиент,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНачалоДействия КАК ДокументНачалоДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&Дата, ДокументЗалогодателя = &ДокументЗалогодателя) КАК ЛБ_ДокументыЗалогодателейСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Период УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		НоваяСтр.Клиент = Залогодатель;
		НоваяСтр.ВидДокументаЗалогодателя = Выборка.ВидДокументаЗалогодателя;
		НоваяСтр.ВидДокумента = Выборка.ВидДокумента;
		НоваяСтр.ДокументГражданство = Выборка.Гражданство;
		НоваяСтр.ДокументСерия = Выборка.ДокументСерия;
		НоваяСтр.ДокументНомер = Выборка.ДокументНомер;
		НоваяСтр.ДокументДатаВыдачи = Выборка.ДокументДатаВыдачи;
		НоваяСтр.ДокументКемВыдан = Выборка.ДокументКемВыдан;
		НоваяСтр.ДокументКодПодразделения = Выборка.ДокументКодПодразделения;
		НоваяСтр.ДокументНачалоДействия = Выборка.ДокументНачалоДействия;
		НоваяСтр.ДокументСрокДействия = Выборка.ДокументСрокДействия;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура История(Команда) 
	Если ЗначениеЗаполнено(ДокументЗайма) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Клиент", Залогодатель);
		ПараметрыФормы.Вставить("ЗалоговыйБилет", ДокументЗайма);	 
								
		ОткрытьФорму("Отчет.ЛБ_ИсторияЗалоговогоБилета.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	 
КонецПроцедуры

&НаКлиенте
Процедура Расчеты(Команда)    
	Если ЗначениеЗаполнено(ДокументЗайма) Тогда
		ПараметрыФормы = Новый Структура;  
		ПараметрыФормы.Вставить("Клиент", ЭтаФорма.Залогодатель);
		ПараметрыФормы.Вставить("ЗалоговыйБилет", ДокументЗайма);
		ПараметрыФормы.Вставить("Дата", ЭтаФорма.ДатаДок);
								
		ОткрытьФорму("Отчет.ЛБ_НачисленныеПроцентыПоДоговоруЗайма.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры  

&НаСервере
Функция ПолучитьУсловияСК() 
	Возврат ЛБ_УправлениеЛомбардом.ПолучитьДокументУстановкиУсловийСхемыКредитования(ДатаДок, СхемаКредитования); 
КонецФункции

&НаКлиенте
Процедура СхемаКредитованияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СписокВыбораСК = ЗаполнитьСписокВыбораСК(); 
	Если СписокВыбораСК.Количество() > 1 Тогда
		ВыбранноеЗначение = ВыбратьИзМеню(СписокВыбораСК, Элементы.СхемаКредитования); 
		Если НЕ ВыбранноеЗначение = неопределено Тогда
			НомерСтроки = ВыбранноеЗначение.Значение; 
			ОтборСК = Новый Структура("НомерСтроки", НомерСтроки);
			СтрокиСК = ТаблицаВыбораСхемыКредитованияАкции.НайтиСтроки(ОтборСК);
			Если НЕ СтрокиСК.Количество() = 0 Тогда 
				СтрСК = СтрокиСК.Получить(0);
				СхемаКредитования = СтрСК.СхемаКредитования; 
				ТекущаяУстановкаУсловийПоСхемеКредитования = ПолучитьУсловияСК();
				Если НЕ ЗначениеЗаполнено(ТекущаяУстановкаУсловийПоСхемеКредитования) тогда
					 Сообщить("На дату документа не определены условия по кредитной схеме " + СокрЛП(СхемаКредитования) + "!"); 
				КонецЕсли; 
				Акция = СтрСК.Акция;
				ОбработатьСхемуКредитованияНаСервере();
				//Элементы.ДекорацияПродукт.Заголовок = ИнформацияПродукт(); 
				ПроверитьДоступностьДопКнопок();
				ЗаполнитьТаблицуСтавок(); 
				РасчетСуммыОценкиИтоговой(); 			 
				РассчитатьПредельныСрокЗайма(); 
				ОбработатьПСКНасервере();  
				ЗаполнитьКВыдачеВнесению();
				УстановитьВидимость();
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры 

&НаСервере
Функция ЗаполнитьСписокВыбораСК()   
	СхемаКредитованияСписокВыбора = Новый СписокЗначений; 
	Если НЕ ТаблицаВыбораСхемыКредитованияАкции.Количество() = 0 Тогда 
		Приоритет = ТаблицаВыбораСхемыКредитованияАкции.Получить(0).Приоритет;
		Для каждого Стр Из ТаблицаВыбораСхемыКредитованияАкции Цикл 
			Если Стр.Приоритет < Приоритет тогда
				Прервать;
			КонецЕсли;	
			СтрокаСК = сокрЛП(Стр.СхемаКредитования); 
			Если ЗначениеЗаполнено(Стр.Акция) Тогда
			    СтрокаСК = СтрокаСК + ", акция " + сокрЛП(Стр.Акция);
			КонецЕсли;
			СхемаКредитованияСписокВыбора.Добавить(Стр.НомерСтроки, СтрокаСК); 
		Конеццикла;
	КонецЕсли;	
	Возврат СхемаКредитованияСписокВыбора;
КонецФункции    

&НаКлиенте
Процедура ОтказОтВыкупаПриИзменении(Элемент)
	РасчетСуммыОценкиИтоговой(); 
	ПолучитьДоступныеПроцентныеСхемыАкции(); 
	Если НЕ ТаблицаВыбораСхемыКредитованияАкции.Количество() = 0 Тогда
	    СтрСК = ТаблицаВыбораСхемыКредитованияАкции.Получить(0);
		СхемаКредитования = СтрСК.СхемаКредитования; 
		ТекущаяУстановкаУсловийПоСхемеКредитования = ПолучитьУсловияСК();
		Если НЕ ЗначениеЗаполнено(ТекущаяУстановкаУсловийПоСхемеКредитования) тогда
			 Сообщить("На дату документа не определены условия по кредитной схеме " + СокрЛП(СхемаКредитования) + "!"); 
		КонецЕсли; 
		Акция = СтрСК.Акция;   
		ОбработатьСхемуКредитованияНаСервере();
		//Элементы.ДекорацияПродукт.Заголовок = ИнформацияПродукт(); 
		ПроверитьДоступностьДопКнопок();
		ЗаполнитьТаблицуСтавок();
	    ОбработатьДополнительныеКнопки();
		Если НЕ ЗначениеЗаполнено(ПроцентнаяСхема) Тогда
            Сообщить("Не определена процентная схема! Расчет процентов по договору займа не возможен.");
		КонецЕсли;	
	Иначе     
		СхемаКредитования = ПредопределенноеЗначение("Справочник.ЛБ_СхемыКредитования.ПустаяСсылка");
		Акция = ПредопределенноеЗначение("Справочник.ЛБ_Акции.ПустаяСсылка");
		//Элементы.ДекорацияПродукт.Заголовок = ИнформацияПродукт();
		ПроцентныеСтавкиПоПериодам.Очистить();
		ТаблицаСтавок.Очистить();
		ДатаВыкупа = Дата(1,1,1); 
		ДатаВыкупаЛьготная = Дата(1,1,1); 
		СрокЗалога = 0;
		ПроцентнаяСхема = 0; 
		Элементы.ПовышеннаяОценка.Доступность = ложь;
		Сообщить("Не определена процентная схема! Расчет процентов по договору займа не возможен.");
	КонецЕсли;	
	ОбработатьПСКНасервере(); 
	ЗаполнитьКВыдачеВнесению();
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПромокодПриИзменении(Элемент)
	Если НЕ ПустаяСтрока(Промокод) Тогда 
		Предъявитель = Ложь;
	КонецЕсли;	
    УстановитьДоступностьПромокодПредъявитель();
	ОбработатьПромокодНаСервере();  
КонецПроцедуры

&НаСервере
Процедура ОбработатьПромокодНаСервере()
	РасчетСуммыОценкиИтоговой(); 
	ПолучитьДоступныеПроцентныеСхемыАкции(); 
	Если НЕ ТаблицаВыбораСхемыКредитованияАкции.Количество() = 0 Тогда
		Если НЕ ПустаяСтрока(Промокод) Тогда
			Отбор = Новый Структура;
			Отбор.Вставить("СхемаКредитования", СхемаКредитования); 
			Отбор.Вставить("Акция", Акция); 
			СтрокиСК = ТаблицаВыбораСхемыКредитованияАкции.НайтиСтроки(Отбор);
			Если НЕ СтрокиСК.Количество() = 0 Тогда 
				ЕстьАкцияПромокод = ложь;
				Для Сч = 0 По СтрокиСК.Количество()-1 Цикл
					Акция = ТаблицаВыбораСхемыКредитованияАкции.Получить(сч).Акция;
					Если НЕ ЗначениеЗаполнено(Акция) Тогда
						Продолжить;
					ИначеЕсли НЕ СокрЛП(Акция.Промокод) = СокрЛП(Промокод) Тогда	
						Продолжить;
					КонецЕсли;	 
					Акция = Акция;
				    ЗаполнитьТаблицуСтавок(); 
					ЕстьАкцияПромокод = Истина; 
					Прервать;
				КонецЦикла;  
				Если НЕ ЕстьАкцияПромокод Тогда
					Сообщить("Для кредитной схемы " + СокрЛП(СхемаКредитования) + " акция с промокодом " + СокрЛП(Промокод) + " не действует.");
					Промокод = ""; 
					Возврат;
				КонецЕсли;	
			Иначе  
				Сообщить("Для кредитной схемы " + СокрЛП(СхемаКредитования) + " акция с промокодом " + СокрЛП(Промокод) + " не действует.");
				Промокод = ""; 
				Возврат;
			КонецЕсли;	 
		Иначе  
			СтрСК = ТаблицаВыбораСхемыКредитованияАкции.Получить(0);
			СхемаКредитования = СтрСК.СхемаКредитования;  
			ТекущаяУстановкаУсловийПоСхемеКредитования = ПолучитьУсловияСК();
			Если НЕ ЗначениеЗаполнено(ТекущаяУстановкаУсловийПоСхемеКредитования) тогда
				 Сообщить("На дату документа не определены условия по кредитной схеме " + СокрЛП(СхемаКредитования) + "!"); 
			КонецЕсли; 

			Акция = СтрСК.Акция;
			//Элементы.ДекорацияПродукт.Заголовок = ИнформацияПродукт();
			ЗаполнитьТаблицуСтавок();
			ОбработатьСхемуКредитованияНаСервере(); 
			Если НЕ ЗначениеЗаполнено(ПроцентнаяСхема) Тогда
                Сообщить("Не определена процентная схема! Расчет процентов по договору займа не возможен.");
            КонецЕсли;
		КонецЕсли; 
	Иначе     
		СхемаКредитования = ПредопределенноеЗначение("Справочник.ЛБ_СхемыКредитования.ПустаяСсылка");
		Акция = ПредопределенноеЗначение("Справочник.ЛБ_Акции.ПустаяСсылка");  
		//Элементы.ДекорацияПродукт.Заголовок = ИнформацияПродукт();
		ГрафикПлатежей.Очистить();
		ПроцентныеСтавкиПоПериодам.Очистить();
		ТаблицаСтавок.Очистить();
		ДатаВыкупа = Дата(1,1,1); 
		ДатаВыкупаЛьготная = Дата(1,1,1);
		СрокЗалога = 0;
		ПроцентнаяСхема = 0;
		Сообщить("Не определена процентная схема! Расчет процентов по договору займа не возможен.");
	КонецЕсли;
	ОбработатьПСКНасервере(); 
	ЗаполнитьКВыдачеВнесению();
КонецПроцедуры

&НаКлиенте
Процедура ПредъявительПриИзменении(Элемент)  
	Если Предъявитель Тогда 
		Промокод = "";   		
	КонецЕсли;
	УстановитьДоступностьПромокодПредъявитель();
	ОбработатьПредъявительНаСервере(); 
КонецПроцедуры

&НаСервере
Процедура ОбработатьПредъявительНаСервере() 
	РасчетСуммыОценкиИтоговой(); 
	ПолучитьДоступныеПроцентныеСхемыАкции(); 
	Если НЕ ТаблицаВыбораСхемыКредитованияАкции.Количество() = 0 Тогда
		Если Предъявитель Тогда
			Отбор = Новый Структура;
			Отбор.Вставить("СхемаКредитования", СхемаКредитования); 
			Отбор.Вставить("Акция", Акция);  
			СтрокиСК = ТаблицаВыбораСхемыКредитованияАкции.НайтиСтроки(Отбор);
			Если НЕ СтрокиСК.Количество() = 0 Тогда 
				ЕстьАкцияПредъявитель = ложь;
				Для Сч = 0 По СтрокиСК.Количество()-1 Цикл
					Акция = ТаблицаВыбораСхемыКредитованияАкции.Получить(сч).Акция;
					Если НЕ ЗначениеЗаполнено(Акция) Тогда
						Продолжить;
					ИначеЕсли НЕ Акция.ВидАкции = Перечисления.ЛБ_ВидыАкций.НаПредъявителя Тогда	
						Продолжить;
					КонецЕсли;	 
					Акция = Акция;
				    ЗаполнитьТаблицуСтавок(); 
					ЕстьАкцияПредъявитель = Истина; 
					Прервать;
				КонецЦикла;  
				Если НЕ ЕстьАкцияПредъявитель Тогда
					Сообщить("Для кредитной схемы " + СокрЛП(СхемаКредитования) + " акция на предъявителя не действует.");
					Промокод = ""; 
					Возврат;
				КонецЕсли;	
			Иначе  
				Сообщить("Для кредитной схемы " + СокрЛП(СхемаКредитования) + " акция на предъявителя не действует.");
				Промокод = ""; 
				Возврат;
			КонецЕсли;	 
		Иначе  
			СтрСК = ТаблицаВыбораСхемыКредитованияАкции.Получить(0);
			СхемаКредитования = СтрСК.СхемаКредитования;  
			ТекущаяУстановкаУсловийПоСхемеКредитования = ПолучитьУсловияСК();
			Если НЕ ЗначениеЗаполнено(ТекущаяУстановкаУсловийПоСхемеКредитования) тогда
				 Сообщить("На дату документа не определены условия по кредитной схеме " + СокрЛП(СхемаКредитования) + "!"); 
			КонецЕсли; 
			Акция = СтрСК.Акция;
			//Элементы.ДекорацияПродукт.Заголовок = ИнформацияПродукт();
			ЗаполнитьТаблицуСтавок();
			ОбработатьСхемуКредитованияНаСервере(); 
			Если НЕ ЗначениеЗаполнено(ПроцентнаяСхема) Тогда
                Сообщить("Не определена процентная схема! Расчет процентов по договору займа не возможен.");
            КонецЕсли;
		КонецЕсли; 
	Иначе     
		СхемаКредитования = ПредопределенноеЗначение("Справочник.ЛБ_СхемыКредитования.ПустаяСсылка");
		Акция = ПредопределенноеЗначение("Справочник.ЛБ_Акции.ПустаяСсылка");  
		//Элементы.ДекорацияПродукт.Заголовок = ИнформацияПродукт();
		ГрафикПлатежей.Очистить();
		ПроцентныеСтавкиПоПериодам.Очистить();
		ТаблицаСтавок.Очистить();
		ДатаВыкупа = Дата(1,1,1); 
		ДатаВыкупаЛьготная = Дата(1,1,1);
		СрокЗалога = 0;
		ПроцентнаяСхема = 0;
		Сообщить("Не определена процентная схема! Расчет процентов по договору займа не возможен.");
	КонецЕсли;	
	ОбработатьПСКНасервере(); 
	ЗаполнитьКВыдачеВнесению();
КонецПроцедуры

&НаКлиенте
Процедура ЛомбардПриИзменении(Элемент) 
	РасчетСуммыОценкиИтоговой();
	ПолучитьДоступныеПроцентныеСхемыАкции();				
	Если НЕ ТаблицаВыбораСхемыКредитованияАкции.Количество() = 0 Тогда 
		ОтборК = Новый Структура;
		ОтборК.Вставить("СхемаКредитования", СхемаКредитования); 
		ОтборК.Вставить("Акция", Акция);
		СтрокиСК = ТаблицаВыбораСхемыКредитованияАкции.НайтиСтроки(ОтборК);
		Если СтрокиСК.Количество() = 0 Тогда 
		    СтрокаСК = ТаблицаВыбораСхемыКредитованияАкции.Получить(0); 
		Иначе  
			СтрокаСК = СтрокиСК.Получить(0);
		КонецЕсли;   
		Если СхемаКредитования = СтрокаСК.СхемаКредитования И Акция = СтрокаСК.Акция Тогда
			ЗаполнитьТаблицуСтавок();
        Иначе
			СхемаКредитования = СтрокаСК.СхемаКредитования;
			ТекущаяУстановкаУсловийПоСхемеКредитования = ПолучитьУсловияСК();
			Если НЕ ЗначениеЗаполнено(ТекущаяУстановкаУсловийПоСхемеКредитования) тогда
				 Сообщить("На дату документа не определены условия по кредитной схеме " + СокрЛП(СхемаКредитования) + "!"); 
			КонецЕсли; 
			Акция = СтрокаСК.Акция;   
			ОбработатьСхемуКредитованияНаСервере();
			ПроверитьДоступностьДопКнопок();
			//Элементы.ДекорацияПродукт.Заголовок = ИнформацияПродукт();
			ЗаполнитьТаблицуСтавок();
			ОбработатьДополнительныеКнопки();
			ЗаполнитьДатуВыкупа();
		    ДатаВыкупаЛьготная = ПолучитьЛьготнуюДатуВыкупа(); 
		КонецЕсли;	
	Иначе
		СхемаКредитования = ПредопределенноеЗначение("Справочник.ЛБ_СхемыКредитования.ПустаяСсылка");
		Акция = ПредопределенноеЗначение("Справочник.ЛБ_Акции.ПустаяСсылка");
		//Элементы.ДекорацияПродукт.Заголовок = ИнформацияПродукт();
		ПроцентныеСтавкиПоПериодам.Очистить();
		ТаблицаСтавок.Очистить();
		ДатаВыкупа = Дата(1,1,1); 
		ДатаВыкупаЛьготная = Дата(1,1,1); 
		СрокЗалога = 0;
		ПроцентнаяСхема = 0;     
		Элементы.ПовышеннаяОценка.Доступность = ложь; 
		Сообщить("Не определена процентная схема! Расчет процентов по договору займа не возможен.");
	КонецЕсли;	    
	ОбработатьПСКНасервере(); 
	ЗаполнитьКВыдачеВнесению();
	УстановитьВидимость();
 КонецПроцедуры

&НаКлиенте
Процедура СуммаЗаймаПриИзменении(Элемент)    
	Если СуммаЗайма < МинСуммаЗайма Тогда  
		Предупреждение("Внимание! Минимальная сумма займа " + СокрЛП(Формат(МинСуммаЗайма, "ЧЦ=15; ЧДЦ=2")) + " руб.!", 60);
		Возврат;
	КонецЕсли;	
	
	СуммаМаксРасчет = 0;  
	СуммаОценкиРасчет = 0;
	Для каждого СтрокаТабличнойЧасти из Товары Цикл 
		Если СтрокаТабличнойЧасти.Переоформить Тогда
		    РасчетМаксимальнойСуммыОценки(СтрокаТабличнойЧасти.ПолучитьИдентификатор());
		    СуммаМаксРасчет = СуммаМаксРасчет + СтрокаТабличнойЧасти.СуммаОценкиМаксимальная; 
			СуммаОценкиРасчет = СуммаОценкиРасчет + СтрокаТабличнойЧасти.СуммаОценки;
		КонецЕсли;	
	Конеццикла;	     
	МаксОценка = ОкруглитьСуммуСсуды(СуммаМаксРасчет);
	Если СуммаЗайма > МаксОценка Тогда
		СуммаЗайма = МаксОценка;  
 	ИначеЕсли СуммаЗайма <= СуммаОценкиРасчет Тогда //И НЕ (ПроцентУвеличенияОценкиЗалога = 0) Тогда   
		Округление = Ложь;
		ПовышеннаяОценка = ложь;                                            	
	КонецЕсли;       
	РаспределитьСуммуЗайма();
	ПолучитьДоступныеПроцентныеСхемыАкции();
	Если НЕ ТаблицаВыбораСхемыКредитованияАкции.Количество() = 0 Тогда 
		ОтборК = Новый Структура;
		ОтборК.Вставить("СхемаКредитования", СхемаКредитования); 
		ОтборК.Вставить("Акция", Акция);
		СтрокиСК = ТаблицаВыбораСхемыКредитованияАкции.НайтиСтроки(ОтборК);
		Если СтрокиСК.Количество() = 0 Тогда 
		    СтрокаСК = ТаблицаВыбораСхемыКредитованияАкции.Получить(0); 
		Иначе  
			СтрокаСК = СтрокиСК.Получить(0);
		КонецЕсли;   
		Если СхемаКредитования = СтрокаСК.СхемаКредитования И Акция = СтрокаСК.Акция Тогда
			ЗаполнитьТаблицуСтавок();
        Иначе			
			СхемаКредитования = СтрокаСК.СхемаКредитования; 
			ТекущаяУстановкаУсловийПоСхемеКредитования = ПолучитьУсловияСК();
			Если НЕ ЗначениеЗаполнено(ТекущаяУстановкаУсловийПоСхемеКредитования) тогда
				 Сообщить("На дату документа не определены условия по кредитной схеме " + СокрЛП(СхемаКредитования) + "!"); 
			КонецЕсли; 
			Акция = СтрокаСК.Акция;    
			ОбработатьСхемуКредитованияНаСервере();
			//Элементы.ДекорацияПродукт.Заголовок = ИнформацияПродукт(); 
			ПроверитьДоступностьДопКнопок();			
			ЗаполнитьТаблицуСтавок(); 
			ОбработатьДополнительныеКнопки();
			ЗаполнитьДатуВыкупа();
		    ДатаВыкупаЛьготная = ПолучитьЛьготнуюДатуВыкупа(); 
		КонецЕсли;	
	Иначе
		СхемаКредитования = ПредопределенноеЗначение("Справочник.ЛБ_СхемыКредитования.ПустаяСсылка");
		Акция = ПредопределенноеЗначение("Справочник.ЛБ_Акции.ПустаяСсылка");
		//Элементы.ДекорацияПродукт.Заголовок = ИнформацияПродукт();
		ПроцентныеСтавкиПоПериодам.Очистить();
		ТаблицаСтавок.Очистить();
		ДатаВыкупа = Дата(1,1,1); 
		ДатаВыкупаЛьготная = Дата(1,1,1); 
		СрокЗалога = 0;
		ПроцентнаяСхема = 0;   
		Элементы.ПовышеннаяОценка.Доступность = ложь;
		Сообщить("Не определена процентная схема! Расчет процентов по договору займа не возможен.");
	КонецЕсли;     
	ТоварыИтоги();  
	УстановитьВидимость();   	
	УстановитьТекстСуммаЗаймаДень(); 
	ОбработатьПСКНасервере();  
	ЗаполнитьКВыдачеВнесению();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	Если Поле.Имя = "ТоварыЕстьФайл" тогда
		ТекСтрока = Элементы.Товары.ТекущиеДанные;  
		Если ЗначениеЗаполнено(ТекСтрока.Этикетка) тогда
			СсылкаНаЭтикетку = ТекСтрока.Этикетка;
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Ключ", СсылкаНаЭтикетку); 
			ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
			ОткрытьФорму("Справочник.ЛБ_ХранилищеЭтикеток.ФормаОбъекта", Параметрыформы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
		КонецЕсли;	 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Этикетка(Команда)  
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные; 
	Если НЕ СтрокаТабличнойЧастиТовары = неопределено Тогда 
		ПрисоединитьЭтикетку(СтрокаТабличнойЧастиТовары);
	КонецЕсли;	
КонецПроцедуры  

&НаКлиенте
Процедура ПрисоединитьЭтикетку(СтрокаТабличнойЧастиТовары)
	
	Если НЕ СтрокаТабличнойЧастиТовары.ЕстьЭтикетка Тогда 
		СсылкаНаЭтикетку = СтрокаТабличнойЧастиТовары.Этикетка; 
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЭтикетки",ЭтаФорма);
		Если ЗначениеЗаполнено(СсылкаНаЭтикетку) Тогда
			ПараметрыФормы = Новый Структура("Ключ", СсылкаНаЭтикетку);
		Иначе					
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Дата", ДатаДок);
			ПараметрыФормы.Вставить("Залогодатель", Залогодатель);
		КонецЕсли;	
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЭтикетки",ЭтаФорма);  
		ОткрытьФорму("Справочник.ЛБ_ХранилищеЭтикеток.ФормаОбъекта", Параметрыформы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
	Иначе
		Сообщить("У изделия есть этикетка. Скриншот сайта не нужен.");
	КонецЕсли;	
КонецПроцедуры	

&НаСервере  
Процедура СохранитьЭтикетку(ИдентификаторСтроки, Картинка)
	Стр = Товары.НайтиПоИдентификатору(ИдентификаторСтроки); 
	ОБ = РеквизитФормыВЗначение("Объект");
    СтрокаТ = ОБ.Товары.Найти(стр.КлючСтроки, "КлючСтроки");  		
	
	СтрокаТ.Этикетка = Новый ХранилищеЗначения(Картинка);
КонецПроцедуры	

&НаКлиенте 
Процедура ПослеВыбораЭтикетки(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли; 
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ТекСтрока.Этикетка = Результат;
	ТекСтрока.ЕстьФайл = истина;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕстьФайлНажатие(Элемент, СтандартнаяОбработка)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;  
	Если ЗначениеЗаполнено(ТекСтрока.Этикетка) тогда
		СсылкаНаЭтикетку = ТекСтрока.Этикетка;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", СсылкаНаЭтикетку); 
		ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
		ОткрытьФорму("Справочник.ЛБ_ХранилищеЭтикеток.ФормаОбъекта", Параметрыформы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
	КонецЕсли;	
КонецПроцедуры

&НаСервере  
Процедура УдалитьСканЭтикетки(Этикетка)
	ОбъектЭ = Этикетка.получитьОбъект();
	ОбъектЭ.УстановитьПометкуУдаления(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЭтикеткаУдалить(Команда)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;  
	Если ЗначениеЗаполнено(ТекСтрока.Этикетка) тогда 
		УдалитьСканЭтикетки(ТекСтрока.Этикетка);
		ТекСтрока.Этикетка = ПредопределенноеЗначение("Справочник.ЛБ_ХранилищеЭтикеток.ПустаяСсылка");  
		ТекСтрока.ЕстьФайл = ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕстьЭтикеткаПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;  
	Если ЗначениеЗаполнено(ТекСтрока.Этикетка) тогда 
		УдалитьСканЭтикетки(ТекСтрока.Этикетка);
		ТекСтрока.Этикетка = ПредопределенноеЗначение("Справочник.ЛБ_ХранилищеЭтикеток.ПустаяСсылка");  
		ТекСтрока.ЕстьФайл = ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьРазвернутьПанелиВставкиДопМеталлы(СтрокаТабличнойЧастиТовары)
	Если СтрокаТабличнойЧастиТовары <> неопределено Тогда
		Если СтрокаТабличнойЧастиТовары.ЕстьВставки Тогда
			Элементы.ГруппаВставок.Показать();
			Элементы.ГруппаВставок.Доступность = Истина;
		Иначе
			Элементы.ГруппаВставок.Скрыть();
			Элементы.ГруппаВставок.Доступность = ложь;
		КонецЕсли;	
		
		Если СтрокаТабличнойЧастиТовары.ЕстьДопМеталлы Тогда
			Элементы.ГруппаДопМеталлы.Показать(); 
			Элементы.ГруппаДопМеталлы.Доступность = Истина;
			Элементы.ТоварыГруппаЭтикетка.Видимость = Истина;
			Элементы.ТоварыГруппаЭ.Доступность = ?(НеРедактировать, Элементы.ТоварыГруппаЭ.Доступность, Истина);
		Иначе
			Элементы.ГруппаДопМеталлы.Скрыть();
			Элементы.ГруппаДопМеталлы.Доступность = ложь;
			Если СтрокаТабличнойЧастиТовары.ЕстьЭтикетка тогда
				СтрокаТабличнойЧастиТовары.ЕстьЭтикетка = ложь;
			КонецЕсли;	   
			Если ЗначениеЗаполнено(СтрокаТабличнойЧастиТовары.Этикетка) тогда 
				УдалитьСканЭтикетки(СтрокаТабличнойЧастиТовары.Этикетка);
				СтрокаТабличнойЧастиТовары.Этикетка = ПредопределенноеЗначение("Справочник.ЛБ_ХранилищеЭтикеток.ПустаяСсылка"); 
			КонецЕсли;	
			Элементы.ТоварыГруппаЭтикетка.Видимость = ложь;  
			Элементы.ТоварыГруппаЭ.Доступность = ложь;
		КонецЕсли;	
	Иначе
		Элементы.ГруппаВставок.Скрыть();
		Элементы.ГруппаДопМеталлы.Скрыть(); 
		Элементы.ТоварыГруппаЭ.Доступность = ложь;
	КонецЕсли;	
КонецПроцедуры
	
&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
		
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	
	СвернутьРазвернутьПанелиВставкиДопМеталлы(СтрокаТабличнойЧастиТовары);
		
	Если СтрокаТабличнойЧастиТовары <> неопределено Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",СтрокаТабличнойЧастиТовары.КлючСтроки);
		Элементы.Вставки.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);		
		Элементы.ДополнительныеМеталлы.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
		//+МАН 22.10.24 Исправление подвала вставок. Заявка 2735
		СтрокиДопМеталлы = ДополнительныеМеталлы.НайтиСтроки(Отбор);
		
		ВставкиИтогиНаКлиенте();
		Если СтрокиДопМеталлы <> 0 Тогда
			ДопМеталлыИтогиНаКлиенте();
		КонецЕсли;
		//-МАН
	Иначе
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",0);
		Элементы.Вставки.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
		Элементы.ДополнительныеМеталлы.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
		
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Копирование;   
КонецПроцедуры  

&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда  
		Элемент.ТекущиеДанные.Статус = "Проект";  
		Элемент.ТекущиеДанные.СтатусДоп = " Добавлен";
		Элемент.ТекущиеДанные.Количество = 1;
		Элемент.ТекущиеДанные.ЕдиницаИзмерения = ОсновнаяЕдиницаИзмеренияМеталлы;
		Элемент.ТекущиеДанные.КлючСтроки = ЗаполнитьКлючСтрокиТоваров(); 
		Элемент.ТекущиеДанные.Именник = ПредопределенноеЗначение("Перечисление.ЛБ_Именник.Нет"); 
		Элемент.ТекущиеДанные.СостояниеИзделия = ПредопределенноеЗначение("Перечисление.ЛБ_СостояниеИзделия.БУ"); 
		Элемент.ТекущиеДанные.Новый = Истина; 
		Элемент.ТекущиеДанные.Переоформить = Истина;
		Элементы.Товары.ТекущийЭлемент = Элементы.ТоварыВидИзделия;
		ПовышеннаяОценка = ложь;
		Округление = ложь;
	КонецЕсли;
		
	Если НоваяСтрока И Копирование Тогда
		
		Элемент.ТекущиеДанные.ОбъектЗалога = ПредопределенноеЗначение("Справочник.ЛБ_ОбъектыЗалога.ПустаяСсылка");		
	КонецЕсли;
КонецПроцедуры

&НаСервере 
Процедура УдалитьОбъектЗалога(ОбъектЗалогаСсылка)
	СпрОбъект = ОбъектЗалогаСсылка.ПолучитьОбъект();
	СпрОбъект.УстановитьПометкуУдаления(Истина);
КонецПроцедуры	

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	Если НЕ СтрокаТабличнойЧастиТовары.Новый Тогда
		Отказ = Истина;
		возврат;
	КонецЕсли;	
	
	Если СтрокаТабличнойЧастиТовары <> Неопределено Тогда
		//Удалим объект залога
		Если ЗначениеЗаполнено(СтрокаТабличнойЧастиТовары.ОбъектЗалога) Тогда
			УдалитьОбъектЗалога(СтрокаТабличнойЧастиТовары.ОбъектЗалога);
		КонецЕсли;	

		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки", СтрокаТабличнойЧастиТовары.КлючСтроки);
		
		НайденныеСтроки = Вставки.НайтиСтроки(Отбор);
		
		Для каждого Строка Из НайденныеСтроки Цикл
			Вставки.Удалить(Строка);	
		КонецЦикла; 
		
		НайденныеСтроки = ДополнительныеМеталлы.НайтиСтроки(Отбор);
		
		Для каждого Строка Из НайденныеСтроки Цикл
			ДополнительныеМеталлы.Удалить(Строка);	
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьКлючСтрокиТоваров()	
	ТаблицаКлючей = Товары.Выгрузить(, "КлючСтроки");
	Если  ТаблицаКлючей.Количество() = 1 Тогда
		Возврат 1;
	Иначе	
		ТаблицаКлючей.Сортировать("КлючСтроки Убыв");
		
		Возврат ТаблицаКлючей[0].КлючСтроки + 1;
	КонецЕсли;	  			 
КонецФункции

&НаСервере
Функция ПроверитьВесДопМеталлов(Идентификатор)
	СтрТовары = Товары.НайтиПоИдентификатору(Идентификатор);
	
	ВесОснМеталла = СтрТовары.Вес;
	
	Отбор = Новый Структура;
	Отбор.Вставить("КлючСтроки", СтрТовары.КлючСтроки);
	Строки = ДополнительныеМеталлы.НайтиСтроки(Отбор);
	Для каждого Стр из Строки Цикл
		ВесОснМеталла = ВесОснМеталла - Стр.ВесЧистый;
	Конеццикла;	 
	
	ВсеОК = Истина;
	Для каждого Стр из Строки Цикл 
		Если Стр.ВесЧистый > ВесОснМеталла Тогда
			ВсеОК = Ложь;
		КонецЕсли;	
	Конеццикла;	                
	
	Возврат ВсеОК;
КонецФункции

&НаСервере
Процедура РасчетМаксимальнойСуммыОценки(Идентификатор) 
	СтрокаТабличнойЧасти = Товары.НайтиПоИдентификатору(Идентификатор); 
	Если ПовышеннаяОценка Тогда		
		МассивС = Новый Массив; 
		МассивС.Добавить(Справочники.ЛБ_СтатусыЗалогодателей.ПустаяСсылка());
		МассивС.Добавить(СтатусЗалогодателя);
		Для каждого Эл Из СписокДопСтатусов Цикл  
			МассивС.Добавить(Эл.Значение);
		Конеццикла;	
		СтрокаТабличнойЧасти.СуммаОценкиМаксимальная = ЛБ_УправлениеЛомбардом.РасчитатьМаксимальнуюСуммуЗалога(ДатаДок, СхемаКредитования, МассивС, СтрокаТабличнойЧасти);  
	Иначе   
		СтрокаТабличнойЧасти.СуммаОценкиМаксимальная = СтрокаТабличнойЧасти.СуммаОценки;
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ПересчитатьСуммТовары(СтрокаТабличнойЧастиТовары = неопределено)
	Если СтрокаТабличнойЧастиТовары = неопределено Тогда
	    СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	КонецЕсли;	
    
	ОтборДоп = Новый Структура;
	ОтборДоп.Вставить("КлючСтроки", СтрокаТабличнойЧастиТовары.КлючСтроки);
	СтрокиДоп = ДополнительныеМеталлы.НайтиСтроки(ОтборДоп);
	//ОснМеталлВесЧистый = СтрокаТабличнойЧастиТовары.ВесЧистый;
	//Для каждого СтрДоп Из СтрокиДоп Цикл
	//	ОснМеталлВесЧистый = ОснМеталлВесЧистый - СтрДоп.ВесЧистый;
	//Конеццикла;	   
	//СтрокаТабличнойЧастиТовары.ВесВПробеЧистоты = ПолучитьВесВЧистоте(ОснМеталлВесЧистый, СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор()); 
	//СтрокаТабличнойЧастиТовары.СуммаОценкиМеталлы = ОснМеталлВесЧистый*СтрокаТабличнойЧастиТовары.Цена;
	СтрокаТабличнойЧастиТовары.СуммаОценкиМеталлы = СтрокаТабличнойЧастиТовары.ВесЧистый*СтрокаТабличнойЧастиТовары.Цена;
	Для каждого СтрДоп Из СтрокиДоп Цикл
		СтрокаТабличнойЧастиТовары.СуммаОценкиМеталлы = СтрокаТабличнойЧастиТовары.СуммаОценкиМеталлы + СтрДоп.СуммаОценкиМеталлы;
		//СтрокаТабличнойЧастиТовары.ВесВПробеЧистоты = СтрокаТабличнойЧастиТовары.ВесВПробеЧистоты + СтрДоп.ВесВПробеЧистоты;
	Конеццикла;	
	СтрокаТабличнойЧастиТовары.СуммаОценки = СтрокаТабличнойЧастиТовары.СуммаОценкиМеталлы + СтрокаТабличнойЧастиТовары.СуммаОценкиКамни;
	
	РасчетМаксимальнойСуммыОценки(СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор());
	СтрокаТабличнойЧастиТовары.СуммаСсуды = СтрокаТабличнойЧастиТовары.СуммаОценкиМаксимальная;                                            	
	СуммаЗайма = ОкруглитьСуммуСсуды(ТоварыИтогМаксОценка);
	РаспределитьСуммуЗайма();   
	ТоварыИтоги();
	ПолучитьДоступныеПроцентныеСхемыАкции();				
	Если НЕ ТаблицаВыбораСхемыКредитованияАкции.Количество() = 0 Тогда
		ОтборК = Новый Структура;
		ОтборК.Вставить("СхемаКредитования", СхемаКредитования); 
		ОтборК.Вставить("Акция", Акция);
		СтрокиСК = ТаблицаВыбораСхемыКредитованияАкции.НайтиСтроки(ОтборК);
		Если СтрокиСК.Количество() = 0 Тогда 
		    СтрокаСК = ТаблицаВыбораСхемыКредитованияАкции.Получить(0); 
		Иначе  
			СтрокаСК = СтрокиСК.Получить(0);
		КонецЕсли;   
		Если СхемаКредитования = СтрокаСК.СхемаКредитования И Акция = СтрокаСК.Акция Тогда
			ЗаполнитьТаблицуСтавок();
		Иначе 
			СхемаКредитования = СтрокаСК.СхемаКредитования;
			ТекущаяУстановкаУсловийПоСхемеКредитования = ПолучитьУсловияСК();
			Если НЕ ЗначениеЗаполнено(ТекущаяУстановкаУсловийПоСхемеКредитования) тогда
				 Сообщить("На дату документа не определены условия по кредитной схеме " + СокрЛП(СхемаКредитования) + "!"); 
			КонецЕсли; 
			Акция = СтрокаСК.Акция;    
			ОбработатьСхемуКредитованияНаСервере();
			ПроверитьДоступностьДопКнопок();
			//Элементы.ДекорацияПродукт.Заголовок = ИнформацияПродукт();
			ЗаполнитьТаблицуСтавок();
			ОбработатьДополнительныеКнопки();
			ЗаполнитьДатуВыкупа();
			ДатаВыкупаЛьготная = ПолучитьЛьготнуюДатуВыкупа();
		КонецЕсли;	
	Иначе
		СхемаКредитования = ПредопределенноеЗначение("Справочник.ЛБ_СхемыКредитования.ПустаяСсылка");
		Акция = ПредопределенноеЗначение("Справочник.ЛБ_Акции.ПустаяСсылка");
		//Элементы.ДекорацияПродукт.Заголовок = ИнформацияПродукт();
		ПроцентныеСтавкиПоПериодам.Очистить();
		ТаблицаСтавок.Очистить();
		ДатаВыкупа = Дата(1,1,1); 
		ДатаВыкупаЛьготная = Дата(1,1,1);  
		СрокЗалога = 0;
		ПроцентнаяСхема = 0;  
		Элементы.ПовышеннаяОценка.Доступность = ложь;
		ПовышеннаяОценка = Ложь;
		Сообщить("Не определена процентная схема! Расчет процентов по договору займа не возможен.");
	КонецЕсли;	  
	УстановитьВидимость();
	УстановитьТекстСуммаЗаймаДень();
	ОбработатьПСКНасервере(); 
	ЗаполнитьКВыдачеВнесению();
 КонецПроцедуры	

&НаКлиенте
Процедура ТоварыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ) 
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	Если НЕ ПроверитьВесДопМеталлов(СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор()) Тогда
		Сообщить("В разделе ""Дополнительные металлы"" масса металла в общей массе изделия не является наименьшей.");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)  
	ОбработатьИзменениеСуммыЗайма(); 
КонецПроцедуры

&НаСервере 
Процедура ОбработатьИзменениеСуммыЗайма(НачальноеЗаполнение = Ложь)  
	РасчетСуммыОценкиИтоговой(НачальноеЗаполнение);
	ПолучитьДоступныеПроцентныеСхемыАкции(); 
	Если НЕ ТаблицаВыбораСхемыКредитованияАкции.Количество() = 0 Тогда
		ОтборК = Новый Структура;
		ОтборК.Вставить("СхемаКредитования", СхемаКредитования); 
		ОтборК.Вставить("Акция", Акция);
		СтрокиСК = ТаблицаВыбораСхемыКредитованияАкции.НайтиСтроки(ОтборК);
		Если СтрокиСК.Количество() = 0 Тогда 
		    СтрокаСК = ТаблицаВыбораСхемыКредитованияАкции.Получить(0); 
		Иначе  
			СтрокаСК = СтрокиСК.Получить(0);
		КонецЕсли;   
		Если СхемаКредитования = СтрокаСК.СхемаКредитования И Акция = СтрокаСК.Акция Тогда
			ЗаполнитьТаблицуСтавок();
		Иначе 
			СхемаКредитования = СтрокаСК.СхемаКредитования;  
			ТекущаяУстановкаУсловийПоСхемеКредитования = ПолучитьУсловияСК();
			Если НЕ ЗначениеЗаполнено(ТекущаяУстановкаУсловийПоСхемеКредитования) тогда
				 Сообщить("На дату документа не определены условия по кредитной схеме " + СокрЛП(СхемаКредитования) + "!"); 
			КонецЕсли; 
			Акция = СтрокаСК.Акция; 
			ОбработатьСхемуКредитованияНаСервере();
			ПроверитьДоступностьДопКнопок();
			//Элементы.ДекорацияПродукт.Заголовок = ИнформацияПродукт();
			ОбработатьДополнительныеКнопки();
			ЗаполнитьТаблицуСтавок();
		КонецЕсли;	
	Иначе
		СхемаКредитования = ПредопределенноеЗначение("Справочник.ЛБ_СхемыКредитования.ПустаяСсылка");
		Акция = ПредопределенноеЗначение("Справочник.ЛБ_Акции.ПустаяСсылка");
		//Элементы.ДекорацияПродукт.Заголовок = ИнформацияПродукт();
		ПроцентныеСтавкиПоПериодам.Очистить();
		ТаблицаСтавок.Очистить();
		ДатаВыкупа = Дата(1,1,1); 
		ДатаВыкупаЛьготная = Дата(1,1,1);  
		СрокЗалога = 0;
		ПроцентнаяСхема = 0;  
		Элементы.ПовышеннаяОценка.Доступность = ложь;
		Сообщить("Не определена процентная схема! Расчет процентов по договору займа не возможен.");
	КонецЕсли;	 
	ОбработатьПСКНасервере(); 
	ЗаполнитьКВыдачеВнесению();
	Установитьвидимость();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	//++ИВВ 02.2026, вычеты для часов
	ПроверкаПослеУдаленияМеханизм();
	ПроверкаПослеУдаленияНика();
	//--ИВВ
	ОбработатьИзменениеСуммыЗайма();
КонецПроцедуры

&НаСервере
Процедура ЦенаДрагоценногоМеталла(Идентификатор, ИмяТабличнойЧасти = "Товары") 
	Если  ИмяТабличнойЧасти = "Товары" Тогда
	    СтрокаТабличнойЧасти 			  = Товары.НайтиПоИдентификатору(Идентификатор);
	Иначе   
		СтрокаТабличнойЧасти 			  = ДополнительныеМеталлы.НайтиПоИдентификатору(Идентификатор);
	КонецЕсли;	

	//+Мельников 29.07.24 Для Серебра как доп. металла не должны высчитываться цена и сумма. Добавлено условие. Заявка 2739.
	Если ИмяТабличнойЧасти = "ДополнительныеМеталлы" И СтрокаТабличнойЧасти.Проба.Владелец = Справочники.ЛБ_ДрагоценныеМеталлы.Серебро Тогда
		СтрокаТабличнойЧасти.Цена = 0;
		СтрокаТабличнойЧасти.СуммаОценкиМеталлы = 0;
	Иначе
	//-Мельников
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Дата", ДатаДок);
		СтруктураПараметров.Вставить("Ломбард", Ломбард);
		СтруктураПараметров.Вставить("СхемаКредитования", СхемаКредитования);
		СтруктураПараметров.Вставить("Проба", СтрокаТабличнойЧасти.Проба);
		СтруктураПараметров.Вставить("Категория", СтрокаТабличнойЧасти.Категория);
		СтруктураПараметров.Вставить("ЕдиницаИзмерения", СтрокаТабличнойЧасти.ЕдиницаИзмерения);
		//+Мельников 24.09.24 ВИП. Заявка 2792
		СтруктураПараметров.Вставить("Залогодатель", Залогодатель);
		//-Мельников
		
		Результат = ЛБ_ОбщийМодуль.ПолучитьЦенуМеталлаИзПрейскуранта(СтруктураПараметров);
		СтрокаТабличнойЧасти.Цена = Результат.Цена;  
		СтрокаТабличнойЧасти.Приказ = Результат.Приказ;
		//+МАН 10.12.25
		СтрокаТабличнойЧасти.ПриказВИПМеталлы = Результат.ПриказВИПМеталлы;
		//-МАН
   		СтрокаТабличнойЧасти.СуммаОценкиМеталлы = СтрокаТабличнойЧасти.ВесЧистый*СтрокаТабличнойЧасти.Цена; 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПробаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	ЦенаДрагоценногоМеталла(СтрокаТабличнойЧасти.ПолучитьИдентификатор());
КонецПроцедуры  

&НаСервере
Процедура ОбновитьДанныеТовары() 
	Для Каждого Стр Из Товары Цикл  
		Отбор = новый структура;
		Отбор.Вставить("КлючСтроки", Стр.КлючСтроки); 
		СтрокиВ = Вставки.НайтиСтроки(Отбор);
		Стр.КоличествоВ = СтрокиВ.Количество();
		Стр.ЕстьФайл = ?(ЗначениеЗаполнено(Стр.Этикетка), истина, ложь);
	Конеццикла;	
	УстановитьТекстСуммаЗаймаДень();
КонецПроцедуры 

&НаКлиенте
Процедура ТоварыЕстьВставкиПриИзменении(Элемент)
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные; 
	Если НЕ СтрокаТабличнойЧастиТовары.ЕстьВставки Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",СтрокаТабличнойЧастиТовары.КлючСтроки);
		Строки = Вставки.НайтиСтроки(Отбор);
		Если НЕ Строки.Количество() = 0 Тогда
			Режим = РежимДиалогаВопрос.ДаНет;
			Ответ = Вопрос("У изделия есть вставки. Удалить вставки?", Режим, 0);
			Если Ответ = КодВозвратаДиалога.Да Тогда
				
				//++ИВВ, 02.2026, вычеты для часов
				СтрокаТабличнойЧастиТовары.СкидкаМеханизм = Ложь;
				СтрокаТабличнойЧастиТовары.РазмерСкидкиМеханизм = 0;					
				СтрокаТабличнойЧастиТовары.СкидкаНика = Ложь;
				СтрокаТабличнойЧастиТовары.РазмерСкидкиНика = 0;
				//--ИВВ
				
				Для каждого стр из Строки Цикл 
					Вставки.Удалить(Стр);
				Конеццикла;
				
				//++ИВВ 02.2026, вычеты для часов
				ПроверкаПослеУдаленияМеханизм();
				ПроверкаПослеУдаленияНика();
				//--ИВВ

				ВесМ = СтрокаТабличнойЧастиТовары.Вес;
				Отбор = Новый структура;
				Отбор.Вставить("КлючСтроки", СтрокаТабличнойЧастиТовары.КлючСтроки);
				СтрокиДоп = ДополнительныеМеталлы.НайтиСтроки(Отбор); 
				Для каждого Стр Из СтрокиДоп Цикл
				    ВесМ = ВесМ - Стр.ВесЧистый;
				Конеццикла;

				СтруктураР = ПолучитьВесИСуммуВставокИзделия(СтрокаТабличнойЧастиТовары.КлючСтроки);
				//+Мельников 09.10.24 Скидка 30%. Заявка 2732.
				//Было: СтрокаТабличнойЧастиТовары.ВесЧистый = Цел((ВесМ - СтруктураР.Вес)*100)/100;
				
				//++ИВВ 02.2026, вычеты для часов
				//было:
				//СтрокаТабличнойЧастиТовары.ВесЧистый = ?(СтрокаТабличнойЧастиТовары.Вес30, Цел(((ВесМ - СтруктураР.Вес)*0.7)*100)/100, Цел((ВесМ - СтруктураР.Вес)*100)/100);
				//стало:
				Если СтрокаТабличнойЧастиТовары.Вес30 Тогда
					СтрокаТабличнойЧастиТовары.ВесЧистый = Цел(((ВесМ - СтруктураР.Вес)*0.7)*100)/100;
				ИначеЕсли СтрокаТабличнойЧастиТовары.СкидкаМеханизм И Не СтрокаТабличнойЧастиТовары.СкидкаНика Тогда
					СтрокаТабличнойЧастиТовары.ВесЧистый = (ВесМ - СтруктураР.Вес)*(СтрокаТабличнойЧастиТовары.РазмерСкидкиМеханизм/100);
				ИначеЕсли СтрокаТабличнойЧастиТовары.СкидкаМеханизм И СтрокаТабличнойЧастиТовары.СкидкаНика Тогда
					СтрокаТабличнойЧастиТовары.ВесЧистый = (((ВесМ - СтруктураР.Вес)*(СтрокаТабличнойЧастиТовары.РазмерСкидкиМеханизм/100))
						* (100 - СтрокаТабличнойЧастиТовары.РазмерСкидкиНика)) / 100;
				Иначе
					СтрокаТабличнойЧастиТовары.ВесЧистый = Цел((ВесМ - СтруктураР.Вес)*100)/100;
				КонецЕсли;
			    //--ИВВ
				СтрокаТабличнойЧастиТовары.СуммаОценкиКамни = СтруктураР.Сумма;

				ПересчитатьСуммТовары(СтрокаТабличнойЧастиТовары);
				ОбновитьДанныеТовары();
			Иначе
			    СтрокаТабличнойЧастиТовары.ЕстьВставки = Истина; 	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	//+МАН 22.10.24 Исправление подвала вставок. Заявка 2735
	ВставкиИтогиНаКлиенте();
	//-МАН
	СвернутьРазвернутьПанелиВставкиДопМеталлы(СтрокаТабличнойЧастиТовары);
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокДопМеталлов(Идентификатор)
	Стр = Товары.НайтиПоИдентификатору(Идентификатор);
	СписокПроб = Новый СписокЗначений;
    ОсновнойМеталл = Стр.Проба.Владелец; 
	
	ЗапросП = Новый Запрос;
	ЗапросП.Текст = "ВЫБРАТЬ
	                |	ЛБ_Пробы.Ссылка КАК Проба
	                |ИЗ
	                |	Справочник.ЛБ_Пробы КАК ЛБ_Пробы
	                |ГДЕ
	                |	ЛБ_Пробы.Владелец = &Владелец
	                |	И ЛБ_Пробы.ПометкаУдаления = ЛОЖЬ
	                |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("ОсновнойМеталл", ОсновнойМеталл);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДополнительныеМеталлыВИзделиях.ДополнительныйМеталл КАК ДополнительныйМеталл
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДополнительныеМеталлыВИзделиях КАК ЛБ_ДополнительныеМеталлыВИзделиях
	               |ГДЕ
	               |	ЛБ_ДополнительныеМеталлыВИзделиях.ОсновнойМеталл = &ОсновнойМеталл
	               |АВТОУПОРЯДОЧИВАНИЕ";  
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗапросП.УстановитьПараметр("Владелец", Выборка.ДополнительныйМеталл); 
		ВыборкаП = ЗапросП.Выполнить().Выбрать();
		Пока ВыборкаП.Следующий() Цикл 
			СписокПроб.Добавить(ВыборкаП.Проба);
		Конеццикла;	
	Конеццикла;	 
	
	Возврат СписокПроб;
КонецФункции

&НаКлиенте
Процедура ТоварыЕстьДопМеталлыПриИзменении(Элемент)
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные; 
	Если НЕ СтрокаТабличнойЧастиТовары.ЕстьДопМеталлы Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",СтрокаТабличнойЧастиТовары.КлючСтроки);
		Строки = ДополнительныеМеталлы.НайтиСтроки(Отбор);
		Если НЕ Строки.Количество() = 0 Тогда
			Режим = РежимДиалогаВопрос.ДаНет;
			Ответ = Вопрос("У изделия есть дополнительные металлы. Удалить доп. металлы?", Режим, 0);
			Если Ответ = КодВозвратаДиалога.Да Тогда
				Для каждого стр из Строки Цикл  
				//+Мельников 09.10.24 Скидка 30%. Изменил формулу. Заявка 2732.
					//Было: СтрокаТабличнойЧастиТовары.ВесЧистый = СтрокаТабличнойЧастиТовары.ВесЧистый + Стр.ВесЧистый; 
					ДополнительныеМеталлы.Удалить(Стр);
				Конеццикла;	    
				ВесМ = СтрокаТабличнойЧастиТовары.Вес;
				СтруктураР = ПолучитьВесИСуммуВставокИзделия(СтрокаТабличнойЧастиТовары.КлючСтроки);
				
				//++ИВВ 02.2026, вычеты для часов
				//было:
				//СтрокаТабличнойЧастиТовары.ВесЧистый = ?(СтрокаТабличнойЧастиТовары.Вес30, 
				//Цел(((ВесМ - СтруктураР.Вес)*0.7)*100)/100, Цел((ВесМ - СтруктураР.Вес)*100)/100);
				//стало:
				Если СтрокаТабличнойЧастиТовары.Вес30 Тогда
					СтрокаТабличнойЧастиТовары.ВесЧистый = Цел(((ВесМ - СтруктураР.Вес)*0.7)*100)/100;
				ИначеЕсли СтрокаТабличнойЧастиТовары.СкидкаМеханизм И Не СтрокаТабличнойЧастиТовары.СкидкаНика Тогда
					СтрокаТабличнойЧастиТовары.ВесЧистый = (ВесМ - СтруктураР.Вес)*(СтрокаТабличнойЧастиТовары.РазмерСкидкиМеханизм/100);
				ИначеЕсли СтрокаТабличнойЧастиТовары.СкидкаМеханизм И СтрокаТабличнойЧастиТовары.СкидкаНика Тогда
					СтрокаТабличнойЧастиТовары.ВесЧистый = (((ВесМ - СтруктураР.Вес)*(СтрокаТабличнойЧастиТовары.РазмерСкидкиМеханизм/100))
					* (100 - СтрокаТабличнойЧастиТовары.РазмерСкидкиНика)) / 100;
				Иначе
					СтрокаТабличнойЧастиТовары.ВесЧистый = Цел((ВесМ - СтруктураР.Вес)*100)/100;
				КонецЕсли;
			    //--ИВВ
				
				ПересчитатьСуммТовары(СтрокаТабличнойЧастиТовары);
			Иначе
			    СтрокаТабличнойЧастиТовары.ЕстьДопМеталлы = Истина;  
			КонецЕсли;
		КонецЕсли;          
	КонецЕсли;
	СвернутьРазвернутьПанелиВставкиДопМеталлы(СтрокаТабличнойЧастиТовары);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЭтикеткаПриИзменении(Элемент)  	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;   
	Если ТекСтрока.ЕстьЭтикетка Тогда
		Если ЗначениеЗаполнено(ТекСтрока.Этикетка) тогда 
			УдалитьСканЭтикетки(ТекСтрока.Этикетка);
			ТекСтрока.Этикетка = ПредопределенноеЗначение("Справочник.ЛБ_ХранилищеЭтикеток.ПустаяСсылка");  
			ТекСтрока.ЕстьФайл = ложь;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКатегорияПриИзменении(Элемент)
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	ЦенаДрагоценногоМеталла(СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор());

	ОтборВ = Новый Структура;
	ОтборВ.Вставить("КлючСтроки", СтрокаТабличнойЧастиТовары.КлючСтроки);
	Строки = ДополнительныеМеталлы.НайтиСтроки(ОтборВ);
	Для каждого СтрокаТабличнойЧасти Из Строки Цикл		
	    ЦенаДрагоценногоМеталла(СтрокаТабличнойЧасти.ПолучитьИдентификатор());
		СтрокаТабличнойЧастиТовары.СуммаОценкиМеталлы = СтрокаТабличнойЧастиТовары.СуммаОценкиМеталлы + СтрокаТабличнойЧасти.СуммаОценкиМеталлы;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИменникПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	Если НЕ ТекСтрока.Именник = ПредопределенноеЗначение("Перечисление.ЛБ_Именник.Да") Тогда 
		ТекСтрока.ДанныеИменника = "";
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыДанныеИменникаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущееЗначение = ТекСтрока.ДанныеИменника;
	Если ВвестиЗначение(ТекущееЗначение, "Введите данные именника") Тогда
		ТекСтрока.ДанныеИменника = ТекущееЗначение;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕстьДеффектыПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	Если НЕ ТекСтрока.ЕстьДеффекты Тогда 
		ТекСтрока.Дефекты = ""; 
		Дефекты.Очистить(); 
	Иначе
		ОткрытьВыборДефектов();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВыборДефектов()
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура;   
	ОтборД = Новый Структура;
	ОтборД.Вставить("КлючСтроки", ТекСтрока.КлючСтроки);
	СтрокиД = Дефекты.НайтиСтроки(ОтборД);
	Если НЕ СтрокиД.Количество() = 0 Тогда
		СписокДефектов = новый списокЗначений;
		ДругиеДефекты = "";
		Для каждого СтрД из СтрокиД Цикл 
			Если ТипЗнч(СтрД.Дефект) = Тип("СправочникСсылка.ЛБ_Дефекты") Тогда 
				СписокДефектов.Добавить(СтрД.Дефект);
			ИначеЕсли ТипЗнч(СтрД.Дефект) = Тип("Строка") Тогда
				ПараметрыФормы.Вставить("ДругиеДефекты", СтрД.Дефект);
	        КонецЕсли;
		Конеццикла;	 
		Если НЕ СписокДефектов.Количество() = 0 Тогда
		    ПараметрыФормы.Вставить("Дефекты", СписокДефектов);
		КонецЕсли;	 
	КонецЕсли;	
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораДефектов",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ВыборДефектов", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
	
&НаКлиенте
Процедура ТоварыДефектыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьВыборДефектов();
КонецПроцедуры
  
 &НаКлиенте 
Процедура ПослеВыбораДефектов(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли; 
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные; 
	ТекСтрока.Дефекты = "";
	ОтборД = Новый Структура;
	ОтборД.Вставить("КлючСтроки", ТекСтрока.КлючСтроки);
	СтрокиД = Дефекты.НайтиСтроки(ОтборД);
	
	Для каждого стрД из СтрокиД Цикл 
		Дефекты.Удалить(СтрД);
	Конеццикла;	                   
	
	Для каждого Эл Из Результат.списокДефектов цикл 
		Если Эл.Пометка тогда 
			НоваяСтрД = Дефекты.Добавить();
			НоваяСтрД.Ключстроки = ТекСтрока.КлючСтроки; 
			НоваяСтрД.Дефект = Эл.Значение;
			
			ТекСтрока.Дефекты = ТекСтрока.Дефекты + ?(Пустаястрока(ТекСтрока.Дефекты), "", "; ") + сокрЛП(НоваяСтрД.Дефект);
		КонецЕсли;	
	Конеццикла;	 
	Если НЕ Пустаястрока(Результат.ДругиеДефекты) тогда 
		НоваяСтрД = Дефекты.Добавить();
		НоваяСтрД.Ключстроки = ТекСтрока.КлючСтроки; 
		НоваяСтрД.Дефект = Результат.ДругиеДефекты;
		
		ТекСтрока.Дефекты = ТекСтрока.Дефекты + ?(Пустаястрока(ТекСтрока.Дефекты), "", "; ") + сокрЛП(НоваяСтрД.Дефект);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьВесИСуммуВставокИзделия(КлючСтроки)
	Отбор = Новый Структура;
	Отбор.Вставить("КлючСтроки", КлючСтроки);
	СтрокиВставки = Вставки.НайтиСтроки(Отбор);
	ВесВставок = 0;
	СуммаВставок = 0;
	//+МАН 22.10.24 Исправление подвала вставок. Заявка 2735
	КоличествоВставок = 0;
	ВесКаратВставок = 0;
	ВесДопМеталлов = 0;
	СуммаДопМеталлов = 0;
	//-МАН
	
	Для каждого Стр Из СтрокиВставки Цикл
		Если Стр.Вид = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыКомплектующихИзделия.Вставка") Тогда
	        ВесВставок = ВесВставок + Стр.ВесГраммы;
		    СуммаВставок = СуммаВставок + Стр.Сумма;
			//+МАН 22.10.24 Исправление подвала вставок. Заявка 2735
			КоличествоВставок = КоличествоВставок + Стр.Количество;
			ВесКаратВставок = ВесКаратВставок + Стр.Вес;
			//-МАН
		Иначе
			ВесВставок = ВесВставок + Стр.ВесГраммы;
			//+МАН 22.10.24 Исправление подвала вставок. Заявка 2735
			КоличествоВставок = КоличествоВставок + Стр.Количество;
			//-МАН
		КонецЕсли;	
	КонецЦикла;	

	//+МАН 22.10.24 Исправление подвала вставок. Заявка 2735
	СтрокиДопМеталлы = ДополнительныеМеталлы.НайтиСтроки(Отбор);

	Для каждого Стр Из СтрокиДопМеталлы Цикл
		ВесДопМеталлов = ВесДопМеталлов + Стр.ВесЧистый;
		СуммаДопМеталлов = СуммаДопМеталлов + Стр.СуммаОценкиМеталлы;
	КонецЦикла;	
	//-МАН
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Вес", ВесВставок);
	СтруктураРезультат.Вставить("Сумма", СуммаВставок);
	//+МАН 22.10.24 Исправление подвала вставок. Заявка 2735
	СтруктураРезультат.Вставить("Количество", КоличествоВставок);
	СтруктураРезультат.Вставить("ВесКарат", ВесКаратВставок);
	СтруктураРезультат.Вставить("ВесДопМеталлов", ВесДопМеталлов);
	СтруктураРезультат.Вставить("СуммаДопМеталлов", СуммаДопМеталлов);
	//-МАН	
	
	Возврат СтруктураРезультат;
КонецФункции

&НаСервере
Функция ПолучитьВесВЧистоте(ВесЧистый, Идентификатор, ИмяТаблицы = "Товары")  
	Если ИмяТаблицы = "Товары" Тогда
	    СтрокаТабличнойЧасти = Товары.НайтиПоИдентификатору(Идентификатор);
	Иначе 
		СтрокаТабличнойЧасти = ДополнительныеМеталлы.НайтиПоИдентификатору(Идентификатор);
	КонецЕсли;
	
	Возврат ЛБ_ОбщийМодуль.ПеревестиВЧистоту(ВесЧистый, СтрокаТабличнойЧасти.Проба);
Конецфункции	

&НаКлиенте
Процедура ТоварыВесПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	
	ВесМ = СтрокаТабличнойЧасти.Вес;    	
	СтруктураР = ПолучитьВесИСуммуВставокИзделия(СтрокаТабличнойЧасти.КлючСтроки);
	ВесМ = Цел((ВесМ - СтруктураР.Вес)*100)/100;
	
	ОтборДоп = Новый Структура;
	ОтборДоп.Вставить("КлючСтроки", СтрокаТабличнойЧасти.КлючСтроки); 
	
	ВесДоп = 0;
	СтрокиДоп = ДополнительныеМеталлы.НайтиСтроки(ОтборДоп);    
	Для каждого СтрДоп Из СтрокиДоп Цикл
		ВесДоп = ВесДоп + СтрДоп.ВесЧистый;
	Конеццикла;   
	//+Мельников 09.10.24 Скидка 30%. Заявка 2732.
	//Было: ВесМ = ВесМ - ВесДоп;
	
	//++ИВВ 02.2026, вычеты для часов
	//было:
	//ВесМ = ?(СтрокаТабличнойЧасти.Вес30, Цел(((ВесМ - ВесДоп) * 0.7)*100)/100, ВесМ - ВесДоп);
	//-Мельников
	//стало:
	Если СтрокаТабличнойЧасти.Вес30 Тогда
		ВесМ = Цел(((ВесМ - ВесДоп) * 0.7)*100)/100;
	ИначеЕсли СтрокаТабличнойЧасти.СкидкаМеханизм И Не СтрокаТабличнойЧасти.СкидкаНика Тогда
		ВесМ = (ВесМ - ВесДоп) * (СтрокаТабличнойЧасти.РазмерСкидкиМеханизм / 100);
	ИначеЕсли СтрокаТабличнойЧасти.СкидкаМеханизм И СтрокаТабличнойЧасти.СкидкаНика Тогда
		ВесМ = (((ВесМ - ВесДоп) * (СтрокаТабличнойЧасти.РазмерСкидкиМеханизм / 100))*(100-СтрокаТабличнойЧасти.РазмерСкидкиНика)) / 100;
	Иначе
		ВесМ = ВесМ - ВесДоп;
	КонецЕсли;
	//--ИВВ

	СтрокаТабличнойЧасти.ВесЧистый = ВесМ;
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеМеталлыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	
	Отказ = (СтрокаТабличнойЧастиТовары = Неопределено) ИЛИ Копирование; 
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧастиТовары.Проба) Тогда  
		Сообщить("Не выбран основной металл в изделии!"); 
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	СписокПроб = ПолучитьСписокДопМеталлов(СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор()); 
	Если СписокПроб.Количество() = 0 Тогда  
		Сообщить("Не определены дополнительные металлы для металла " + сокрЛП(СтрокаТабличнойЧастиТовары.Проба) + "!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;	 
	Элементы.ДополнительныеМеталлыПроба.СписокВыбора.Очистить();
	Для каждого Эл Из СписокПроб цикл
	    Элементы.ДополнительныеМеталлыПроба.СписокВыбора.Добавить(Эл.Значение);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеМеталлыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока и НЕ Копирование Тогда
		СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	    СтрокаТабличнойЧасти       = Элементы.ДополнительныеМеталлы.ТекущиеДанные;
		СтрокаТабличнойЧасти.ЕдиницаИзмерения = ОсновнаяЕдиницаИзмеренияМеталлы;
        СтрокаТабличнойЧасти.Категория = СтрокаТабличнойЧастиТовары.Категория;			
	    СтрокаТабличнойЧасти.КлючСтроки = СтрокаТабличнойЧастиТовары.КлючСтроки;  		
	Иначе
		Если Элементы.ДополнительныеМеталлыПроба.СписокВыбора.Количество() = 0 тогда
			СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
			СписокПроб = ПолучитьСписокДопМеталлов(СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор());
			Для каждого Эл Из СписокПроб цикл
			    Элементы.ДополнительныеМеталлыПроба.СписокВыбора.Добавить(Эл.Значение);
			КонецЦикла;	
		КонецЕсли;	
   	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеМеталлыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;  
	СтрокаТабличнойЧасти = Элементы.ДополнительныеМеталлы.ТекущиеДанные;
	
	Если СтрокаТабличнойЧастиТовары <> неопределено Тогда

		Если НЕ ПроверитьВесДопМеталлов(СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор()) Тогда
			Сообщить("В раздел ""Дополнительные металлы"" заносится информация о металле, масса которого, в общей массе изделия, является наименьшей.");
			Отказ = Истина;
		КонецЕсли;	       
		
		Если Отказ тогда
			Возврат;
		конецЕсли;	
		
		ВесМ = СтрокаТабличнойЧастиТовары.Вес;
		СтруктураР = ПолучитьВесИСуммуВставокИзделия(СтрокаТабличнойЧастиТовары.КлючСтроки);
		ВесМ = Цел((ВесМ - СтруктураР.Вес)*100)/100;
		
		Отбор = новый Структура;
		Отбор.Вставить("КлючСтроки", СтрокаТабличнойЧастиТовары.КлючСтроки);
		СтрокиДоп = ДополнительныеМеталлы.НайтиСтроки(Отбор);
		Для каждого Стр Из СтрокиДоп Цикл  
			ВесМ = ВесМ - Стр.ВесЧистый;		   
		Конеццикла;
		//+Мельников 09.10.24 Скидка 30%. Заявка 2732.
		//Было: СтрокаТабличнойЧастиТовары.ВесЧистый = ВесМ;
		
		//++ИВВ 02.2026, вычеты для часов
		//было:
		//СтрокаТабличнойЧастиТовары.ВесЧистый = ?(СтрокаТабличнойЧастиТовары.Вес30, Цел((ВесМ * 0.7)*100)/100, ВесМ);
		//-Мельников
		//стало:
		Если СтрокаТабличнойЧастиТовары.Вес30 Тогда
			СтрокаТабличнойЧастиТовары.ВесЧистый = Цел((ВесМ * 0.7)*100)/100;
		ИначеЕсли СтрокаТабличнойЧастиТовары.СкидкаМеханизм И Не СтрокаТабличнойЧастиТовары.СкидкаНика Тогда
			СтрокаТабличнойЧастиТовары.ВесЧистый = ВесМ*(СтрокаТабличнойЧастиТовары.РазмерСкидкиМеханизм / 100);
		ИначеЕсли СтрокаТабличнойЧастиТовары.СкидкаМеханизм И СтрокаТабличнойЧастиТовары.СкидкаНика Тогда
			СтрокаТабличнойЧастиТовары.ВесЧистый = ((ВесМ*(СтрокаТабличнойЧастиТовары.РазмерСкидкиМеханизм / 100))
				*(100-СтрокаТабличнойЧастиТовары.РазмерСкидкиНика)) / 100;	
		Иначе
			СтрокаТабличнойЧастиТовары.ВесЧистый = ВесМ;
		КонецЕсли;
		//--ИВВ
				 
		//+МАН 22.10.24 Исправление подвала вставок. Старое расчитывало по всем вставкам, без учета ОЗ. Заявка 2735
		//Было: ДополнительныеМеталлыИтоги();
		ДопМеталлыИтогиНаКлиенте();
		//-МАН
		ПересчитатьСуммТовары(СтрокаТабличнойЧастиТовары);	
	КонецЕсли;	
	
	Если СтрокаТабличнойЧастиТовары <> неопределено Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",СтрокаТабличнойЧастиТовары.КлючСтроки);
		Элементы.ДополнительныеМеталлы.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
		
	Иначе
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",0);
		Элементы.ДополнительныеМеталлы.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеМеталлыПослеУдаления(Элемент)
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	
	Если НЕ СтрокаТабличнойЧастиТовары = неопределено Тогда
		ВесМ = СтрокаТабличнойЧастиТовары.Вес;
		СтруктураР = ПолучитьВесИСуммуВставокИзделия(СтрокаТабличнойЧастиТовары.КлючСтроки);
		ВесМ = Цел((ВесМ - СтруктураР.Вес)*100)/100;
		Отбор = новый Структура;
		Отбор.Вставить("КлючСтроки", СтрокаТабличнойЧастиТовары.КлючСтроки);
		СтрокиДоп = ДополнительныеМеталлы.НайтиСтроки(Отбор);
		Для каждого Стр Из СтрокиДоп Цикл  
			ВесМ = ВесМ - Стр.ВесЧистый;		   
		Конеццикла;
		//+Мельников 09.10.24 Скидка 30%. Заявка 2732.
		//Было: СтрокаТабличнойЧастиТовары.ВесЧистый = ВесМ;
		//++ИВВ 02.2026, вычеты для часов
		//было:
		//СтрокаТабличнойЧастиТовары.ВесЧистый = ?(СтрокаТабличнойЧастиТовары.Вес30, Цел((ВесМ * 0.7)*100)/100, ВесМ);
		//-Мельников
		//стало:
		Если СтрокаТабличнойЧастиТовары.Вес30 Тогда
			СтрокаТабличнойЧастиТовары.ВесЧистый = Цел((ВесМ * 0.7)*100)/100;
		ИначеЕсли СтрокаТабличнойЧастиТовары.СкидкаМеханизм И Не СтрокаТабличнойЧастиТовары.СкидкаНика Тогда
			СтрокаТабличнойЧастиТовары.ВесЧистый = ВесМ*(СтрокаТабличнойЧастиТовары.РазмерСкидкиМеханизм / 100);
		ИначеЕсли СтрокаТабличнойЧастиТовары.СкидкаМеханизм И СтрокаТабличнойЧастиТовары.СкидкаНика Тогда
			СтрокаТабличнойЧастиТовары.ВесЧистый = ((ВесМ*(СтрокаТабличнойЧастиТовары.РазмерСкидкиМеханизм / 100))
				*(100-СтрокаТабличнойЧастиТовары.РазмерСкидкиНика)) / 100;
		Иначе
			СтрокаТабличнойЧастиТовары.ВесЧистый = ВесМ;
		КонецЕсли;
		//--ИВВ
		ПересчитатьСуммТовары(); 		
	КонецЕсли;	
	
	Если СтрокаТабличнойЧастиТовары <> неопределено Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",СтрокаТабличнойЧастиТовары.КлючСтроки);
		Элементы.ДополнительныеМеталлы.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
		
	Иначе
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",0);
		Элементы.ДополнительныеМеталлы.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
		
	КонецЕсли; 
	//+МАН 22.10.24 Исправление подвала вставок. Старое расчитывало по всем вставкам, без учета ОЗ. Заявка 2735
	//Было: ДополнительныеМеталлыИтоги();
	ДопМеталлыИтогиНаКлиенте();
	//-МАН
КонецПроцедуры     

&НаКлиенте
Процедура ДополнительныеМеталлыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ДополнительныеМеталлыПробаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ДополнительныеМеталлы.ТекущиеДанные;
	ЦенаДрагоценногоМеталла(СтрокаТабличнойЧасти.ПолучитьИдентификатор(), "ДополнительныеМеталлы");
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеМеталлыВесЧистыйПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ДополнительныеМеталлы.ТекущиеДанные;
	СтрокаТабличнойЧасти.СуммаОценкиМеталлы = СтрокаТабличнойЧасти.ВесЧистый * СтрокаТабличнойЧасти.Цена;
	//СтрокаТабличнойЧасти.ВесВПробеЧистоты = ПолучитьВесВЧистоте(СтрокаТабличнойЧасти.ВесЧистый, СтрокаТабличнойЧасти.ПолучитьИдентификатор(), "ДополнительныеМеталлы");
КонецПроцедуры

&НаСервере
Функция ПроверитьЕстьВыкуп(Идентификатор) 
	Стр = Товары.НайтиПоИдентификатору(Идентификатор); 
	Если НЕ Стр.Переоформить Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции	

&НаКлиенте
Процедура ВставкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	
	Отказ = (СтрокаТабличнойЧастиТовары = Неопределено) ИЛИ Копирование; 
	
	Если НЕ Отказ тогда
		Отказ = ПроверитьЕстьВыкуп(СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор());
	КонецЕсли;
	
	Если НЕ Отказ тогда   
		ВидВст = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыКомплектующихИзделия.Вставка");
		Если НЕ ВвестиЗначение(ВидВст, "Выберите вид вставки", Тип("ПеречислениеСсылка.ЛБ_ВидыКомплектующихИзделия")) Тогда
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВставкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	    СтрокаТабличнойЧасти       = Элементы.Вставки.ТекущиеДанные;
	
	    СтрокаТабличнойЧасти.КлючСтроки = СтрокаТабличнойЧастиТовары.КлючСтроки;
        СтрокаТабличнойЧасти.Количество = 1;
		СтрокаТабличнойЧасти.Вид = ВидВст; 
		
		Если ВидВст = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыКомплектующихИзделия.Вставка") Тогда  
			ПараметрыФормы = новый структура;
			ПараметрыФормы.Вставить("КатегорияОбъектаЗалога", СтрокаТабличнойЧастиТовары.Категория); 
			ПараметрыФормы.Вставить("Именник", СтрокаТабличнойЧастиТовары.Именник);
			ПараметрыФормы.Вставить("Количество", СтрокаТабличнойЧасти.Количество); 
			ПараметрыФормы.Вставить("НоваяСтрока", Истина);
			ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораВставки",ЭтаФорма);
	        ОткрытьФорму("ОбщаяФорма.ЛБ_КорректировкаВставки", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		//+Мельников 23.08.24 Настройка работы с комплектующим. Заявка 2735.
		ИначеЕсли ВидВст = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыКомплектующихИзделия.Комплектующее") Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Количество", СтрокаТабличнойЧасти.Количество);
			ПараметрыФормы.Вставить("НоваяСтрока", Истина);
			ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораКомплектующего",ЭтаФорма);
			ОткрытьФорму("ОбщаяФорма.ЛБ_КорректировкаКомплектующего", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		//-Мельников
	     КонецЕсли;	
	КонецЕсли;	 
КонецПроцедуры     
 
 &НаКлиенте
Процедура ВставкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	Если НеРедактировать Тогда
		Возврат;
	КонецЕсли;	
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти       = Элементы.Вставки.ТекущиеДанные; 
	Если СтрокаТабличнойЧасти.Вид = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыКомплектующихИзделия.Вставка") Тогда  
		ПараметрыФормы = новый структура;
		ПараметрыФормы.Вставить("КатегорияОбъектаЗалога", СтрокаТабличнойЧастиТовары.Категория); 
		ПараметрыФормы.Вставить("Именник", СтрокаТабличнойЧастиТовары.Именник);
		ПараметрыФормы.Вставить("Количество", СтрокаТабличнойЧасти.Количество); 
		ПараметрыФормы.Вставить("ВидВставки", СтрокаТабличнойЧасти.ВидВставки); 
		ПараметрыФормы.Вставить("ФормаОгранки", СтрокаТабличнойЧасти.ФормаОгранки);
		ПараметрыФормы.Вставить("ВидОгранки", СтрокаТабличнойЧасти.ВидОгранки);
		ПараметрыФормы.Вставить("КачествоОгранки", СтрокаТабличнойЧасти.КачествоОгранки); 
		ПараметрыФормы.Вставить("Диаметр", СтрокаТабличнойЧасти.Диаметр);
		ПараметрыФормы.Вставить("Диаметр1", СтрокаТабличнойЧасти.Диаметр1);
		ПараметрыФормы.Вставить("Диаметр2", СтрокаТабличнойЧасти.Диаметр2); 
		ПараметрыФормы.Вставить("Длина", СтрокаТабличнойЧасти.Длина);  
		ПараметрыФормы.Вставить("Ширина", СтрокаТабличнойЧасти.Ширина);
		ПараметрыФормы.Вставить("Высота", СтрокаТабличнойЧасти.Высота);  
		ПараметрыФормы.Вставить("Сторона", СтрокаТабличнойЧасти.Сторона);
		ПараметрыФормы.Вставить("ВесКар", СтрокаТабличнойЧасти.Вес);
		ПараметрыФормы.Вставить("Весграммы", СтрокаТабличнойЧасти.ВесГраммы);
		ПараметрыФормы.Вставить("ВесВручную", СтрокаТабличнойЧасти.ВесВручную); 
		Если ПроверитьЕстьВыкуп(СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор()) Тогда
			ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
		КонецЕсли;	
			     
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораВставки",ЭтаФорма);
        ОткрытьФорму("ОбщаяФорма.ЛБ_КорректировкаВставки", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//+Мельников 23.08.24 Настройка работы с комплектующим. Заявка 2735.
	ИначеЕсли СтрокаТабличнойЧасти.Вид = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыКомплектующихИзделия.Комплектующее") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Количество", СтрокаТабличнойЧасти.Количество);
		ПараметрыФормы.Вставить("ВидВставки", СтрокаТабличнойЧасти.ВидВставки);
		ПараметрыФормы.Вставить("ВесГраммы", СтрокаТабличнойЧасти.ВесГраммы);
		ПараметрыФормы.Вставить("ЕдиницаИзмерения", СтрокаТабличнойЧасти.ЕдиницаИзмерения);
		//++ИВВ, 03.2026, вычеты для часов
		Если ПроверкаВидаКомплектующегоМеханизм(СтрокаТабличнойЧасти.ВидВставки) Тогда
			ПараметрыФормы.Вставить("РазмерСкидки", СтрокаТабличнойЧасти.РазмерСкидкиМеханизм);
		ИначеЕсли ПроверкаВидаКомплектующегоНика(СтрокаТабличнойЧасти.ВидВставки) Тогда
			ПараметрыФормы.Вставить("РазмерСкидки", СтрокаТабличнойЧасти.РазмерСкидкиНика);
		КонецЕсли;
		//--ИВВ
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораКомплектующего",ЭтаФорма);
		ОткрытьФорму("ОбщаяФорма.ЛБ_КорректировкаКомплектующего", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//-Мельников
     КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПроверкаНеОценивать(ВидВставки, КатегорияЗалога)
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ВидКамня", ВидВставки); 
	Запрос.УстановитьПараметр("Категория", КатегорияЗалога);
	Запрос.Текст ="ВЫБРАТЬ
	              |	ЛБ_ПараметрыОценкиВставокВОбъектахЗалога.Оценивается КАК Оценивается
	              |ИЗ
	              |	РегистрСведений.ЛБ_ПараметрыОценкиВставокВОбъектахЗалога КАК ЛБ_ПараметрыОценкиВставокВОбъектахЗалога
	              |ГДЕ
	              |	ЛБ_ПараметрыОценкиВставокВОбъектахЗалога.ВидКамня = &ВидКамня
	              |	И ЛБ_ПараметрыОценкиВставокВОбъектахЗалога.КатегорияОбъектаЗалога = &Категория"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат НЕ Выборка.Оценивается;
	КонецЕсли;	
	Возврат Ложь;
КонецФункции	

&НаСервере
Процедура ОбновитьДанныеВставки() 
	Для Каждого СтрТовары Из Товары Цикл 
		Отбор = новый Структура;
		Отбор.Вставить("КлючСтроки", СтрТовары.КлючСтроки);
		Строки = Вставки.НайтиСтроки(Отбор);
		Для Каждого Стр Из Строки Цикл  
			Если Стр.Вид = Перечисления.ЛБ_ВидыКомплектующихИзделия.Вставка Тогда
				Если ЗначениеЗаполнено(Стр.ВидВставки) И Стр.ВидВставки.НеОценивается Тогда
					Стр.ПроверкаНеОценивать = Истина;
				ИначеЕсли ЗначениеЗаполнено(Стр.ВидОгранки) И Стр.ВидОгранки.НеОценивается Тогда
					Стр.ПроверкаНеОценивать = Истина;
				Иначе 
				    Стр.ПроверкаНеОценивать = ПроверкаНеОценивать(Стр.ВидВставки, СтрТовары.Категория);
				КонецЕсли;	
			КонецЕсли;	
		Конеццикла;	
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ПроверкаОценкиВставки(Идентификатор, ИдентификаторТовары) 
	Стр = Вставки.НайтиПоИдентификатору(Идентификатор); 
	СтрТовары = Товары.НайтиПоИдентификатору(ИдентификаторТовары);

	Если ЗначениеЗаполнено(Стр.ВидВставки) И Стр.ВидВставки.НеОценивается Тогда
		Стр.НеОценивать = Истина;
		Стр.ПроверкаНеОценивать = Истина;
	ИначеЕсли ЗначениеЗаполнено(Стр.ВидОгранки) И Стр.ВидОгранки.НеОценивается Тогда
		Стр.НеОценивать = Истина;
		Стр.ПроверкаНеОценивать = Истина;
	Иначе 
	    Стр.НеОценивать = ПроверкаНеОценивать(Стр.ВидВставки, СтрТовары.Категория);
		Стр.ПроверкаНеОценивать = Стр.НеОценивать;
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура УдалитьСтрокуВставки(Идентификатор) 
	Стр = Вставки.НайтиПоИдентификатору(Идентификатор);
	Вставки.Удалить(Стр);
КонецПроцедуры	

&НаСервере
Функция ПроверитьВесовой(ЕдиницаИзмерения) 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЕдиницаИзмерения", ЕдиницаИзмерения); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ЕдиницыРасчетаДрагоценныхКамней.ЭтоВес КАК ЭтоВес
	               |ИЗ
	               |	РегистрСведений.ЛБ_ЕдиницыРасчетаДрагоценныхКамней КАК ЛБ_ЕдиницыРасчетаДрагоценныхКамней
	               |ГДЕ
	               |	ЛБ_ЕдиницыРасчетаДрагоценныхКамней.ЕдиницаИзмерения = &ЕдиницаИзмерения";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЭтоВес;
	КонецЕсли;
	Возврат ложь;
КонецФункции	

&НаКлиенте
Процедура ПослеВыбораВставки(Результат, ДопПараметры) Экспорт  
	Если Результат = неопределено Тогда
		Возврат; 
	ИначеЕсли Результат = ложь Тогда  
		УдалитьСтрокуВставки(Элементы.Вставки.ТекущиеДанные.ПолучитьИдентификатор());
		Возврат; 
	КонецЕсли;
	
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти       = Элементы.Вставки.ТекущиеДанные; 
	
	СтрокаТабличнойЧасти.ВесВручную = Результат.ВесВручную;
	СтрокаТабличнойЧасти.Количество = Результат.Количество; 
	СтрокаТабличнойЧасти.ВидВставки = Результат.ВидВставки;
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = Результат.ЕдиницаИзмерения;
	СтрокаТабличнойЧасти.ФормаОгранки = Результат.ФормаОгранки;
	СтрокаТабличнойЧасти.ВидОгранки = Результат.ВидОгранки;
	СтрокаТабличнойЧасти.КачествоОгранки = Результат.КачествоОгранки; 
	СтрокаТабличнойЧасти.Диаметр = Результат.Диаметр;
	СтрокаТабличнойЧасти.Диаметр1 = Результат.Диаметр1;
	СтрокаТабличнойЧасти.Диаметр2 = Результат.Диаметр2; 
	СтрокаТабличнойЧасти.Длина = Результат.Длина;  
	СтрокаТабличнойЧасти.Ширина = Результат.Ширина;
	СтрокаТабличнойЧасти.Высота = Результат.Высота;
	СтрокаТабличнойЧасти.Вес = Результат.Вес;      
    СтрокаТабличнойЧасти.ВесШтКар = Результат.ВесШтКар; //+Мельников 24.07.24 Для расчета суммы если количество больше 1. Заяка 2738
    СтрокаТабличнойЧасти.ВесГраммыШт = Результат.ВесГраммыШт; //+Мельников 24.07.24 Для расчета суммы если количество больше 1. Заяка 2738
	СтрокаТабличнойЧасти.Сторона = Результат.Сторона; 
	СтрокаТабличнойЧасти.ВесГраммы = Результат.ВесГраммы;
	СтрокаТабличнойЧасти.ОписаниеРазмера = Результат.ОписаниеРазмера;  
	СтрокаТабличнойЧасти.ЭтоВесовой = ПроверитьВесовой(СтрокаТабличнойЧасти.ЕдиницаИзмерения);

	ПроверкаОценкиВставки(СтрокаТабличнойЧасти.ПолучитьИдентификатор(), СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор()); 

	Если СтрокаТабличнойЧасти.НеОценивать Тогда
		СтрокаТабличнойЧасти.Цена = 0;
		СтрокаТабличнойЧасти.Сумма = 0; 
		//+МАН 25.03.25 Не указывать вес в каратах если это не бриллиант. Заявка 2464
		Если СтрокаТабличнойЧасти.ВидВставки <> ПредопределенноеЗначение("Справочник.ЛБ_ДрагоценныеКамни.Бриллиант") Тогда
			СтрокаТабличнойЧасти.Вес = 0;
			СтрокаТабличнойЧасти.ВесШтКар = 0;
		КонецЕсли;
		//-МАН
	Иначе	
		ЦенаДрагоценногоКамня(СтрокаТабличнойЧасти.ПолучитьИдентификатор(), СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор());
			
		Если СтрокаТабличнойЧасти.ЭтоВесовой Тогда
		    СтрокаТабличнойЧасти.Сумма = окр(СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Вес, 2);
		Иначе
			СтрокаТабличнойЧасти.Сумма = окр(СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество, 2);
		КонецЕсли;
	КонецЕсли;  
	
	Если НЕ СтрокаТабличнойЧастиТовары = неопределено Тогда	
		ВесМ = СтрокаТабличнойЧастиТовары.Вес;
		Отбор = Новый структура;
		Отбор.Вставить("КлючСтроки", СтрокаТабличнойЧастиТовары.КлючСтроки);
		СтрокиДоп = ДополнительныеМеталлы.НайтиСтроки(Отбор); 
		Для каждого Стр Из СтрокиДоп Цикл
		    ВесМ = ВесМ - Стр.ВесЧистый;
		Конеццикла;
		СтруктураР = ПолучитьВесИСуммуВставокИзделия(СтрокаТабличнойЧастиТовары.КлючСтроки);
		//+Мельников 09.10.24 Скидка 30%. Заявка 2732.
		//++ИВВ 02.2026, вычеты для часов
		//было:
		//СтрокаТабличнойЧастиТовары.ВесЧистый = ?(СтрокаТабличнойЧастиТовары.Вес30, Цел(((ВесМ - СтруктураР.Вес)*0.7)*100)/100, Цел((ВесМ - СтруктураР.Вес)*100)/100);
		//-Мельников
		Если СтрокаТабличнойЧастиТовары.Вес30 Тогда
			СтрокаТабличнойЧастиТовары.ВесЧистый = Цел(((ВесМ - СтруктураР.Вес)*0.7)*100)/100;
		ИначеЕсли СтрокаТабличнойЧастиТовары.СкидкаМеханизм И Не СтрокаТабличнойЧастиТовары.СкидкаНика Тогда
			СтрокаТабличнойЧастиТовары.ВесЧистый = (ВесМ - СтруктураР.Вес)*(СтрокаТабличнойЧастиТовары.РазмерСкидкиМеханизм/100);
		ИначеЕсли СтрокаТабличнойЧастиТовары.СкидкаМеханизм И СтрокаТабличнойЧастиТовары.СкидкаНика Тогда
			СтрокаТабличнойЧастиТовары.ВесЧистый = (((ВесМ - СтруктураР.Вес)*(СтрокаТабличнойЧастиТовары.РазмерСкидкиМеханизм/100))
				* (100 - СтрокаТабличнойЧастиТовары.РазмерСкидкиНика)) / 100;
		Иначе
			СтрокаТабличнойЧастиТовары.ВесЧистый = Цел((ВесМ - СтруктураР.Вес)*100)/100;
		КонецЕсли;
		//--ИВВ
		СтрокаТабличнойЧастиТовары.СуммаОценкиКамни = СтруктураР.Сумма;
		ПересчитатьСуммТовары();
	КонецЕсли;	                        
	ОбновитьДанныеВставки(); 
	//+МАН 22.10.24 Исправление подвала вставок. Заявка 2735
	//Было: ВставкиИтоги();
	ВставкиИтогиНаКлиенте();
	//-МАН
	ОбновитьДанныеТовары();
	ЭтаФорма.ТекущийЭлемент =  Элементы["ВставкиВидВставки"];
КонецПроцедуры 

&НаКлиенте
Процедура ВставкиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти = Элементы.Вставки.ТекущиеДанные;
	
	//Если НЕ СтрокаТабличнойЧастиТовары = неопределено Тогда		
	//	СтруктураР = ПолучитьВесИСуммуВставокИзделия(СтрокаТабличнойЧастиТовары.КлючСтроки);
	//	СтрокаТабличнойЧастиТовары.ВесЧистый = Цел((СтрокаТабличнойЧастиТовары.Вес - СтруктураР.Вес)*100)/100;
	//	СтрокаТабличнойЧастиТовары.СуммаОценкиКамни = СтруктураР.Сумма;
	//	ПересчитатьСуммТовары();
	//КонецЕсли;	
	
	Если СтрокаТабличнойЧастиТовары <> неопределено Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",СтрокаТабличнойЧастиТовары.КлючСтроки);
		Элементы.Вставки.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);

	Иначе
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",0);
		Элементы.Вставки.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
		
	КонецЕсли;   	
КонецПроцедуры

&НаКлиенте
Процедура ВставкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ОбновитьДанныеВставки(); 
	//+МАН 22.10.24 Исправление подвала вставок. Заявка 2735
	//Было: ВставкиИтоги();
	ВставкиИтогиНаКлиенте();
	//-МАН
	ОбновитьДанныеТовары(); 
КонецПроцедуры

&НаКлиенте
Процедура ВставкиПослеУдаления(Элемент)
	
	//++ИВВ 02.2026, вычеты для часов
	ПроверкаПослеУдаленияМеханизм();
	ПроверкаПослеУдаленияНика();
	//--ИВВ
	
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	
	Если НЕ СтрокаТабличнойЧастиТовары = неопределено Тогда  
		ВесМ = СтрокаТабличнойЧастиТовары.Вес;
		Отбор = Новый структура;
		Отбор.Вставить("КлючСтроки", СтрокаТабличнойЧастиТовары.КлючСтроки);
		СтрокиДоп = ДополнительныеМеталлы.НайтиСтроки(Отбор); 
		Для каждого Стр Из СтрокиДоп Цикл
		    ВесМ = ВесМ - Стр.ВесЧистый;
		Конеццикла;
		СтруктураР = ПолучитьВесИСуммуВставокИзделия(СтрокаТабличнойЧастиТовары.КлючСтроки);
		//+Мельников 09.10.24 Скидка 30%. Заявка 2732.
		//Было: СтрокаТабличнойЧастиТовары.ВесЧистый = Цел((ВесМ - СтруктураР.Вес)*100)/100;
		//++ИВВ 02.2026, вычеты для часов
		//было:
		//СтрокаТабличнойЧастиТовары.ВесЧистый = ?(СтрокаТабличнойЧастиТовары.Вес30, Цел(((ВесМ - СтруктураР.Вес)*0.7)*100)/100, Цел((ВесМ - СтруктураР.Вес)*100)/100);
		//-Мельников
		//стало:
		Если СтрокаТабличнойЧастиТовары.Вес30 Тогда
			СтрокаТабличнойЧастиТовары.ВесЧистый = Цел(((ВесМ - СтруктураР.Вес)*0.7)*100)/100;
		ИначеЕсли СтрокаТабличнойЧастиТовары.СкидкаМеханизм И Не СтрокаТабличнойЧастиТовары.СкидкаНика Тогда
			СтрокаТабличнойЧастиТовары.ВесЧистый = ВесМ*(СтрокаТабличнойЧастиТовары.РазмерСкидкиМеханизм / 100);
		ИначеЕсли СтрокаТабличнойЧастиТовары.СкидкаМеханизм И СтрокаТабличнойЧастиТовары.СкидкаНика Тогда
			СтрокаТабличнойЧастиТовары.ВесЧистый = ((ВесМ*(СтрокаТабличнойЧастиТовары.РазмерСкидкиМеханизм / 100))
				*(100-СтрокаТабличнойЧастиТовары.РазмерСкидкиНика)) / 100;
		Иначе
			СтрокаТабличнойЧастиТовары.ВесЧистый = Цел((ВесМ - СтруктураР.Вес)*100)/100;
		КонецЕсли;
		//--ИВВ
		СтрокаТабличнойЧастиТовары.СуммаОценкиКамни = СтруктураР.Сумма;
		ПересчитатьСуммТовары();
	КонецЕсли;	
	
	Если СтрокаТабличнойЧастиТовары <> неопределено Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",СтрокаТабличнойЧастиТовары.КлючСтроки);
		Элементы.Вставки.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
	Иначе
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",0);
		Элементы.Вставки.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
		
	КонецЕсли;	           
	ОбновитьДанныеВставки();
	//+МАН 22.10.24 Исправление подвала вставок. Заявка 2735
	//Было: ВставкиИтоги();
	ВставкиИтогиНаКлиенте();
	//-МАН
	ОбновитьДанныеТовары();
КонецПроцедуры

&НаКлиенте
Процедура ВставкиНеОцениватьПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Вставки.ТекущиеДанные;
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	Если СтрокаТабличнойЧасти.НеОценивать Тогда
		СтрокаТабличнойЧасти.Цена = 0;
		СтрокаТабличнойЧасти.Сумма = 0;		
	Иначе
		Если СтрокаТабличнойЧасти.Вид = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыКомплектующихИзделия.Вставка") Тогда
			
			СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
			ЦенаДрагоценногоКамня(СтрокаТабличнойЧасти.ПолучитьИдентификатор(), СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор());
			
			Если СтрокаТабличнойЧасти.ЭтоВесовой Тогда
			    СтрокаТабличнойЧасти.Сумма = окр(СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Вес, 2);
			Иначе
				СтрокаТабличнойЧасти.Сумма = окр(СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество, 2);
			КонецЕсли;
        КонецЕсли;
	КонецЕсли;	   
	Если НЕ СтрокаТабличнойЧастиТовары = неопределено Тогда	
		Если СтрокаТабличнойЧасти.Вид = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыКомплектующихИзделия.Вставка") Тогда 
			СтруктураР = ПолучитьВесИСуммуВставокИзделия(СтрокаТабличнойЧастиТовары.КлючСтроки);
			СтрокаТабличнойЧастиТовары.СуммаОценкиКамни = СтруктураР.Сумма;
			ПересчитатьСуммТовары(); 
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПроверитьОписаниеИзделия(Стр)  
	МассивСлов = СтрРазделить(СокрЛП(Стр.Описание), " ", ложь);
    Рез = истина;
	ВыборкаСпр = Справочники.ЛБ_НеДопустимыеЗначенияВОписанииИзделия.Выбрать();
	Пока ВыборкаСпр.Следующий() цикл
		Если ВыборкаСпр.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;	
		Для каждого Слово из МассивСлов Цикл  
			Если СокрЛП(нрег(Слово)) = СокрЛП(нрег(ВыборкаСпр.Наименование)) Тогда
				Сообщить("В описании изделия найдены недопустимые символы """ + СокрЛП(ВыборкаСпр.Наименование) + """"); 
				Рез = Ложь;
			КонецЕсли;	
		КонецЦикла;	
	Конеццикла;	 
	Возврат Рез;
КонецФункции 

&НаСервере
// Проверяет заполнение полей залогового билета
//
// Параметры
//  Нет
//
// Возвращаемое значение
//  Булево - результат проверки
//
Функция ПроверкаЗаполненияДокумента()
	
	Результат = Истина;       
	Если НЕ ЗначениеЗаполнено(Ломбард) тогда
		Результат = Ложь;
		Сообщить("Не выбран ломбард!",СтатусСообщения.Внимание);
	КонецЕсли;  
	
	Если НЕ ЗначениеЗаполнено(Залогодатель) тогда
		Результат = Ложь;
		Сообщить("Не выбран заемщик!",СтатусСообщения.Внимание);
	КонецЕсли;  
	
	Если НЕ ЗначениеЗаполнено(ДокументЗалогодателя) тогда
		Результат = Ложь;
		Сообщить("Не выбран документ заемщика!",СтатусСообщения.Внимание);
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Фамилия) тогда
		Результат = Ложь;
		Сообщить("Не заполнена фамилия заемщика!",СтатусСообщения.Внимание);
	КонецЕсли;  
	
	Если НЕ ЗначениеЗаполнено(Имя) тогда
		Результат = Ложь;
		Сообщить("Не заполнено имя заемщика!",СтатусСообщения.Внимание);
	КонецЕсли;  
	
	Если НЕ ЗначениеЗаполнено(ДатаРождения) тогда
		Результат = Ложь;
		Сообщить("Не заполнена дата рождения заемщика!",СтатусСообщения.Внимание);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Гражданство) тогда
		Результат = Ложь;
		Сообщить("Не выбрано гражданство заемщика!",СтатусСообщения.Внимание);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СхемаКредитования) тогда
		Результат = Ложь;
		Сообщить("Не выбрана схема кредитования!",СтатусСообщения.Внимание);
	КонецЕсли;    
	
	Если ПроцентныеСтавкиПоПериодам.Количество() = 0 Тогда
		Результат = Ложь;
		Сообщить("Не определены процентные ставки!",СтатусСообщения.Внимание);
	КонецЕсли;  

	Если НЕ Товары.Количество() Тогда		
		Результат = Ложь;
		Сообщить("Состав залога нового билета не указан!",СтатусСообщения.Внимание);
	Иначе    
		ЕстьПереоформляемыеОЗ = Ложь;
		Для каждого стр Из Товары Цикл 
			Если Стр.Переоформить Тогда
				ЕстьПереоформляемыеОЗ = Истина;
				Прервать;
			КонецЕсли;	
		КонецЦикла;	     
		Если НЕ ЕстьПереоформляемыеОЗ Тогда 
			Результат = Ложь;
		    Сообщить("Состав залога нового билета не указан!",СтатусСообщения.Внимание);
		КонецЕсли;	
	КонецЕсли;    
	
	СообщениеПроверкиПоЛомбарду = ЛБ_УправлениеЛомбардом.ПроверитьИзделияЗБВЛомбарде(ДатаДок, ПредыдущаяОперация, Ломбард); 
	Если НЕ ПустаяСтрока(СообщениеПроверкиПоЛомбарду) Тогда 
		Результат = Ложь;
		ОбщегоНазначения.СообщитьПользователю(СообщениеПроверкиПоЛомбарду + ". Переоформление запрещено.");
	КонецЕсли;   
		
	Если Не Результат Тогда
		возврат Результат;
	КонецЕсли;	
	
	Если Результат Тогда
		Если ДокументВид = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ Тогда
			Если ПустаяСтрока(ДокументКодПодразделения) Тогда
				Сообщить("Для документ удостоверяющего личность залогодателя необходимо заполнить код подразделения!");
				Результат = ложь;
			КонецЕсли;	
			Если ПустаяСтрока(ДокументКемВыдан) Тогда
				Сообщить("Для документ удостоверяющего личность залогодателя необходимо заполнить кем выдан!");
				Результат = ложь;
			КонецЕсли;	
		КонецЕсли;
		Если ((ДокументВид = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ) ИЛИ 
		(ДокументВид = Справочники.ВидыДокументовФизическихЛиц.ВидНаЖительство И ДокументВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность)) Тогда
		    Если ДокументВид = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ Тогда 			    
				Парам = Новый Структура("Серия, Номер", СокрЛП(ДокументСерия), СокрЛП(ДокументНомер));
				Если ЛБ_ОбменLX.ПаспортНедействителен(Парам) Тогда 
					Если ЗначениеЗаполнено(ДокументЗайма) Тогда
						Сообщить("Документ найден в списке недействительных паспортов!");
					    Результат = ложь; 
					КонецЕсли;	
				ИначеЕсли НЕ ЛБ_ОбщийМодуль.ПроверитьПаспортРФДействует(ДатаРождения, ДокументДатаВыдачи) Тогда
					Сообщить("Документ удостоверяющий личность залогодателя просрочен!");
				    Результат = ложь;	
				КонецЕсли;	
			ИначеЕсли НЕ ЛБ_ОбщийМодуль.ПроверитьПаспортРФДействует(ДатаРождения, ДокументДатаВыдачи) Тогда
				Сообщить("Документ удостоверяющий личность залогодателя просрочен!");
			    Результат = ложь;   
			КонецЕсли;	
		ИначеЕсли (ДокументВид = Справочники.ВидыДокументовФизическихЛиц.СвидетельствоОРождении) И НЕ ЛБ_ОбщийМодуль.ПроверитьСвидетельствоОРожденииДействует(ДатаРождения, ДатаДок) Тогда
			Сообщить("Документ удостоверяющий личность залогодателя просрочен!");
		    Результат = ложь;
		КонецЕсли;	
		Если ЛБ_ОбщийМодуль.ДокументСоСрокомДействия(Гражданство, ДокументВидДокументаЗалогодателя, ДокументВид) тогда
			Если НЕ ЗначениеЗаполнено(ДокументСрокДействия) Тогда
				Сообщить("Для документ удостоверяющего личность залогодателя необходимо заполнить срок действия!");
		        Результат = ложь;
			ИначеЕсли ДокументСрокДействия < НачалоДня(ДатаДок) Тогда
				Сообщить("Документ удостоверяющий личность залогодателя просрочен!");
		        Результат = ложь;
			КонецЕсли;	  
		ИначеЕсли ЗначениеЗаполнено(ДокументСрокДействия) И (ДокументСрокДействия < НачалоДня(ДатаДок)) Тогда
			Сообщить("Документ удостоверяющий личность залогодателя просрочен!");
		    Результат = ложь;
		КонецЕсли;	      
		Если НЕ Гражданство = Справочники.СтраныМира.Россия Тогда
			Отбор = Новый Структура; 
			Отбор.Вставить("Клиент", Залогодатель);
			Строки = ДопДокументы.НайтиСтроки(Отбор);
			Если Строки.Количество() = 0 Тогда 
				Сообщить("Не выбран документ удостоверяющий право пребывания клиента на территории РФ!");
		        Результат = ложь;
			Иначе                  
				ЕстьДокументГражданствоНЕРФ = ложь;
				Для каждого Стр Из Строки Цикл
					//Если ЛБ_ОбщийМодуль.ДокументСоСрокомДействия(Гражданство, Стр.ДокументЗалогодателя, Стр.ВидДокумента) тогда 
					//	Если НЕ ЗначениеЗаполнено(Стр.ДокументСрокДействия) Тогда
					//		Продолжить;
					//	ИначеЕсли Стр.ДокументСрокДействия < НачалоДня(ДатаДок) Тогда
					//		Продолжить;
					//	КонецЕсли;	
					//    ЕстьДокументГражданствоНЕРФ = Истина;
					//	Прервать; 
					//ИначеЕсли ЗначениеЗаполнено(Стр.ДокументСрокДействия) Тогда
					//    Если Стр.ДокументСрокДействия < НачалоДня(ДатаДок) Тогда
					//		Продолжить;
					//	КонецЕсли;	
					//    ЕстьДокументГражданствоНЕРФ = Истина;
					//	Прервать; 
					//Иначе
					//	ЕстьДокументГражданствоНЕРФ = Истина;
					//	Прервать; 
					//КонецЕсли;      	
					Если Стр.ДокументГражданство = Гражданство Тогда
						ЕстьДокументГражданствоНЕРФ = Истина;     
						Если Стр.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ВидНаЖительство Тогда 
						    Если НЕ ЛБ_ОбщийМодуль.ДокументСоСрокомДействия(Стр.ДокументГражданство, Стр.ВидДокументаЗалогодателя, Стр.ВидДокумента) тогда
						        ТекстСообщения1 = ЛБ_ОбщийМодуль.ПроверитьСменаВидНаЖительствоВозраст(ДатаРождения, Стр.ДокументДатаВыдачи); 
								Если НЕ Пустаястрока(ТекстСообщения1) тогда 
								    Сообщить(ТекстСообщения1); 
									Результат = ложь;
								КонецЕсли;	  
							КонецЕсли; 
							ТекстСообщения2 = ЛБ_ОбщийМодуль.ПроверитьСменаВидНаЖительствоКонтактнаяИнформация(Залогодатель, Стр.ДокументДатаВыдачи, ДатаДок); 
							Если НЕ Пустаястрока(ТекстСообщения2) тогда 
								Сообщить(ТекстСообщения2); 
								Результат = ложь;
							КонецЕсли;	 
						КонецЕсли;	 
					КонецЕсли;		
				КонецЦикла;	
				Если НЕ ЕстьДокументГражданствоНЕРФ Тогда
					Сообщить("У клиента нет действующего документа, удостоверяющего право пребывания на территории РФ!");
					Результат = ложь;
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	  
	КонецЕсли;    
	
	Если ЗначениеЗаполнено(Представитель) Тогда  
		Если НЕ ЗначениеЗаполнено(ДокументПредставителя) тогда
			Результат = Ложь;
			Сообщить("Не выбран документ представителя заемщика!",СтатусСообщения.Внимание);
		Иначе
			РезультатПроверки = ЛБ_УправлениеЛомбардом.ПроверитьОсновныеДокументыЗалогодателя(Представитель, ДатаДок);
			Если НЕ ПустаяСтрока(РезультатПроверки.ОшибкаДУЛ) Тогда
				Сообщить("Проверка основного ДУЛ представителя заемщика: " + РезультатПроверки.ОшибкаДУЛ);
			    Результат = Ложь;
			КонецЕсли; 
			Если НЕ ПустаяСтрока(РезультатПроверки.ОшибкаДоп) Тогда
				Сообщить("Проверка основного документа на право пребывания РФ представителя заемщика: " + РезультатПроверки.ОшибкаДоп);
			    Результат = Ложь;
			КонецЕсли;   

		КонецЕсли;     
		Если НЕ ЗначениеЗаполнено(ДоверенностьПереоформление) тогда
			Результат = Ложь;
			Сообщить("Не заполнена доверенность представителя заемщика!",СтатусСообщения.Внимание);
		КонецЕсли; 
	Иначе
		Если НЕ Залогодатель = ПредыдущаяОперация.Залогодатель Тогда
			Если НЕ ЗначениеЗаполнено(ДоверенностьПереоформление) тогда
				Результат = Ложь;
				Сообщить("Не заполнена доверенность!",СтатусСообщения.Внимание);
			КонецЕсли; 
		КонецЕсли;	
    КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПроцентнаяСхема) Тогда
		Сообщить("Не выбрана схема расчета процентов!");
		Результат = ложь;
	ИначеЕсли НЕ ПСК = 0 Тогда  
		Если ПСКГод > ПСК Тогда 
			Сообщить("ВНИМАНИЕ! Значение ПСК (полной стоимости потребительского займа) превышает максимально допустимое. Займ не может быть выдан.");
			Результат = ложь;
		КонецЕсли;	
	КонецЕсли;   

	Если Результат Тогда  
						
		Если ПредельныйСрокЗайма = Дата(1,1,1) Тогда
			Сообщить("На дату операции не определен предельный срок займа для схемы кредитования " + СокрЛП(СхемаКредитования) + "!", СтатусСообщения.Внимание);
        КонецЕсли;
		
		Ном = 0;
		Для каждого СтрокаТабличнойЧасти Из Товары Цикл 
			Ном = Ном + 1;                              
			Если НЕ СтрокаТабличнойЧасти.Переоформить Тогда
				Продолжить;
			КонецЕсли;	
			
			Результат = Результат 
			И ЗначениеЗаполнено(СтрокаТабличнойЧасти.ВидИзделия)
			И ЗначениеЗаполнено(СтрокаТабличнойЧасти.Проба)
			И ЗначениеЗаполнено(СтрокаТабличнойЧасти.Описание)
			И ЗначениеЗаполнено(СтрокаТабличнойЧасти.Клеймо)  
			И ЗначениеЗаполнено(СтрокаТабличнойЧасти.Категория)
			И ЗначениеЗаполнено(СтрокаТабличнойЧасти.Количество)
			И ЗначениеЗаполнено(СтрокаТабличнойЧасти.Цена)
			И ЗначениеЗаполнено(СтрокаТабличнойЧасти.СуммаОценки)
			И ЗначениеЗаполнено(СтрокаТабличнойЧасти.СуммаСсуды); 
			
			Если НЕ Результат Тогда
			    Сообщить("В строке № " + Строка(Ном) +  " не заполнены обязательные поля", СтатусСообщения.Внимание);
                Результат = ложь;
				Прервать;
			КонецЕсли;	   
			
				
			Если СтрокаТабличнойЧасти.ЕстьДопМеталлы И НЕ (СтрокаТабличнойЧасти.ЕстьЭтикетка ИЛИ СтрокаТабличнойЧасти.ЕстьФайл) Тогда   
				Сообщить("В строке № " + Строка(Ном) + " у изделия нет этикетки или скриншота этикетки с сайта!");
		        Результат = ложь;		
			КонецЕсли;
						
			Если СтрокаТабличнойЧасти.Именник = Перечисления.ЛБ_Именник.Да тогда
				Если ПустаяСтрока(СтрокаТабличнойЧасти.ДанныеИменника) Тогда
					Сообщить("Строка № " + Строка(Ном) + ": Если именник РФ, то необходимо заполнить данные именника.");
					Результат = ложь;
				КонецЕсли;	
			КонецЕсли;  
			
			Если СтрокаТабличнойЧасти.ЕстьДеффекты тогда
				Если ПустаяСтрока(СтрокаТабличнойЧасти.Дефекты) Тогда
					Сообщить("Строка № " + Строка(Ном) + ": Если в изделии есть дефекты, то необходимо их описать.");
					Результат = ложь;
				КонецЕсли;	
			КонецЕсли;  
			
			Если НЕ ПроверитьОписаниеИзделия(СтрокаТабличнойЧасти) Тогда
				Результат = ложь;
			КонецЕсли;	
			
			//++ИВВ 03.2026, вычеты для часов ч.2
			//было:
			//ВесЧистыйРасчет = ПолучитьВесМеталлаРасчет(СтрокаТабличнойЧасти);
			//Если СтрокаТабличнойЧасти.ВесЧистый < ВесЧистыйРасчет Тогда 
			//	Сообщить("Строка № " + Строка(Ном) + ": Вес металла в изделии " + СокрЛП(Формат(СтрокаТабличнойЧасти.ВесЧистый, "ЧЦ=10; ЧДЦ=2")) + " г. не совпадает с расчетным весом металла " + СокрЛП(Формат(ВесЧистыйРасчет, "ЧЦ=10; ЧДЦ=2")) + " г.");
			//ИначеЕсли СтрокаТабличнойЧасти.ВесЧистый > ВесЧистыйРасчет Тогда
			//	Сообщить("Строка № " + Строка(Ном) + ": Вес металла в изделии " + СокрЛП(Формат(СтрокаТабличнойЧасти.ВесЧистый, "ЧЦ=10; ЧДЦ=2")) + " г. превышает расчетный вес металла " + СокрЛП(Формат(ВесЧистыйРасчет, "ЧЦ=10; ЧДЦ=2")) + " г.");
			//	Результат = ложь;
			//КонецЕсли;    
			//--ИВВ
			
			Если СтрокаТабличнойЧасти.ЕстьВставки Тогда
				Отбор = Новый Структура;
				Отбор.Вставить("КлючСтроки", СтрокаТабличнойЧасти.КлючСтроки);   
				СтрокиВ = Вставки.НайтиСтроки(Отбор);
				Если СтрокиВ.Количество() = 0 Тогда  
					Сообщить("Строка № " + Строка(Ном) + ": По изделию не заполнена табличная часть ""Вставки"""); 
					Результат = ложь;
				КонецЕсли;
			КонецЕсли;	 
			
			Если СтрокаТабличнойЧасти.ЕстьДопМеталлы Тогда
				Отбор = Новый Структура;
				Отбор.Вставить("КлючСтроки", СтрокаТабличнойЧасти.КлючСтроки);   
				СтрокиМ = ДополнительныеМеталлы.НайтиСтроки(Отбор);
				Если СтрокиМ.Количество() = 0 Тогда  
					Сообщить("Строка № " + Строка(Ном) + ": По изделию не заполнена табличная часть ""Дополнительные металлы"""); 
					Результат = ложь;
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла; 
		
	КонецЕсли;
				
	Возврат Результат;
	
КонецФункции // ПроверкаЗаполненияДокумента()   

&НаСервере
Функция ПолучитьВесМеталлаРасчет(СтрокаТабличнойЧасти)
	ВесМ = СтрокаТабличнойЧасти.Вес;    	
	СтруктураР = ПолучитьВесИСуммуВставокИзделия(СтрокаТабличнойЧасти.КлючСтроки);
	ВесМ = Цел((ВесМ - СтруктураР.Вес)*100)/100;
	
	ОтборДоп = Новый Структура;
	ОтборДоп.Вставить("КлючСтроки", СтрокаТабличнойЧасти.КлючСтроки); 
	
	ВесДоп = 0;
	СтрокиДоп = ДополнительныеМеталлы.НайтиСтроки(ОтборДоп);    
	Для каждого СтрДоп Из СтрокиДоп Цикл
		ВесДоп = ВесДоп + СтрДоп.ВесЧистый;
	Конеццикла;   
	//+Мельников 09.10.24 Скидка 30%. Заявка 2732.
	//Было: ВесМ = ВесМ - ВесДоп;
	//++ИВВ 02.2026, вычеты для часов
	//было:
	//ВесМ = ?(СтрокаТабличнойЧасти.Вес30, Цел(((ВесМ - ВесДоп) * 0.7)*100)/100, ВесМ - ВесДоп);
	//-Мельников
	//стало:
	Если СтрокаТабличнойЧасти.Вес30 Тогда
		ВесМ = Цел(((ВесМ - ВесДоп) * 0.7)*100)/100;
	ИначеЕсли СтрокаТабличнойЧасти.СкидкаМеханизм И Не СтрокаТабличнойЧасти.СкидкаНика Тогда
		ВесМ = (ВесМ - ВесДоп) * (СтрокаТабличнойЧасти.РазмерСкидкиМеханизм / 100);
	ИначеЕсли СтрокаТабличнойЧасти.СкидкаМеханизм И СтрокаТабличнойЧасти.СкидкаНика Тогда
		ВесМ = (((ВесМ - ВесДоп) * (СтрокаТабличнойЧасти.РазмерСкидкиМеханизм / 100))*(100-СтрокаТабличнойЧасти.РазмерСкидкиНика)) / 100;
	Иначе
		ВесМ = ВесМ - ВесДоп;
	КонецЕсли;
	//--ИВВ

	Возврат ВесМ;	
КонецФункции

&НаСервере
Функция ПроверкаОценкиИзделий() 
	Если  Константы.ЛБ_ОграничениеОценкиВерхняяГраница.Получить() Тогда 		
		ОценкаВерхняя = Константы.ЛБ_ОценкаВерхняяГраница.Получить();
		Для каждого Стр Из Товары цикл 
			Если НЕ Стр.Переоформить Тогда
				Продолжить;
			КонецЕсли;	
			Если стр.СуммаОценки >= ОценкаВерхняя тогда  
				СообщениеОценкаЗБ = Константы.ЛБ_СообщениеОграничениеЗаймаЗБ.Получить(); 
				Если Пустаястрока(СообщениеОценкаЗБ) Тогда 
				    СообщениеОценкаЗБ = "Проведение договора займа с оценкой предмета залога от " + СокрЛП(Формат(ОценкаВерхняя, "ЧЦ=15; ЧДЦ=2")) + " руб. и выше, временно приостановлено.";
				КонецЕсли;
				ОбщегоНазначения.СообщитьПользователю(СокрЛП(СообщениеОценкаЗБ)); 
				Возврат Ложь;  
			КонецЕсли;	
		Конеццикла;	
		
		ЕстьОграничениеОценки = Ложь;
		ЗапросО = Новый Запрос; 
		ЗапросО.УстановитьПараметр("Дата", ДатаДок); 
		ЗапросО.УстановитьПараметр("Организация", Константы.ЛБ_ОсновнаяОрганизация.Получить());
		ЗапросО.Текст = "ВЫБРАТЬ
		                |	ЛБ_НастройкиСозданияНакладныхНаОтгрузкуСрезПоследних.ЕстьОграничениеОценки КАК ЕстьОграничениеОценки,
		                |	ЛБ_НастройкиСозданияНакладныхНаОтгрузкуСрезПоследних.СуммаОценки КАК СуммаОценки,
		                |	ЛБ_НастройкиСозданияНакладныхНаОтгрузкуСрезПоследних.СообщениеВключениеЗБ КАК СообщениеВключениеЗБ
		                |ИЗ
		                |	РегистрСведений.ЛБ_НастройкиСозданияНакладныхНаОтгрузку.СрезПоследних(&Дата, Организация = &Организация) КАК ЛБ_НастройкиСозданияНакладныхНаОтгрузкуСрезПоследних";
		ВыборкаО = ЗапросО.Выполнить().Выбрать();
		Если ВыборкаО.Следующий() Тогда 
			ЕстьОграничениеОценки = ВыборкаО.ЕстьОграничениеОценки;
			ОценкаВерхняя = ВыборкаО.СуммаОценки; 
			СообщениеВключениеЗБ = ВыборкаО.СообщениеВключениеЗБ;
		КонецЕсли;	     

		//СообщениеВключениеЗБ = Константы.ЛБ_СообщениеВключениеЗБ.Получить();   
		Если ЕстьОграничениеОценки Тогда
			ЕстьОценкаВыше = Ложь;
			ЕстьОценкаНиже = Ложь; 
			Для каждого Стр Из Товары Цикл   
				Если НЕ Стр.Переоформить Тогда
					Продолжить;
				КонецЕсли;	
				Если стр.СуммаОценкиМаксимальная > ОценкаВерхняя тогда
					ЕстьОценкаВыше = Истина;
				Иначе  
					ЕстьОценкаНиже = Истина;
				КонецЕсли;	
			Конеццикла;
			Если ЕстьОценкаВыше И ЕстьОценкаНиже Тогда                       
				Если Пустаястрока(СообщениеВключениеЗБ) Тогда 
					СообщениеВключениеЗБ = "Не заполнено сообщение об ограничении на оформление в один договор займа изделий с разной величиной суммы оценки в настройках управления ломбардом!";
				КонецЕсли;	
				ОбщегоНазначения.СообщитьПользователю(СокрЛП(СообщениеВключениеЗБ));
				Возврат Ложь;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;

	Возврат Истина;
КонецФункции	  

&НаСервере
Функция  ПолучитьНовыйНомерЗБ(ДокументОбъект)
	НомерЗБ = ЛБ_УправлениеЛомбардом.ПолучитьНовыйНомерЗалоговогоБилета(Ломбард);
	Если НЕ Пустаястрока(НомерЗБ) Тогда 
		КолДублей = ЛБ_УправлениеЛомбардом.ПроверитьЕстьНомерЗалоговогоБилета(НомерЗБ);
		Если НЕ КолДублей = 0 Тогда 
			ОбщегоНазначения.СообщитьПользователю("В базе уже есть " + ?(КолДублей = 1, "залоговый билет ", "залоговые билеты ") + "с номером " + НомерЗБ);
		КонецЕсли;	
	КонецЕсли;   
    Возврат НомерЗБ; 
КонецФункции	     

&НаСервере
Функция СоздатьДокументНаСервере()  
	Если ЗначениеЗаполнено(ДокументЗайма) Тогда
		ДокументОбъект = ДокументЗайма.ПолучитьОбъект(); 
		Если ДокументОбъект.ПометкаУдаления Тогда
		    ДокументОбъект.УстановитьПометкуУдаления(Ложь); 
		КонецЕсли;	
	Иначе	
	    ДокументОбъект = Документы.ЛБ_ОперацияПоЗалогу.СоздатьДокумент(); 
		ДокументОбъект.Дата = ДатаДок;  
		ДокументОбъект.Ломбард = Ломбард;
		ДокументОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление;  
	    ДокументОбъект.Организация = Организация;  
    КонецЕсли;	
	ДокументОбъект.Дата = ДатаДок;
	ДокументОбъект.ПредыдущаяОперация = ПредыдущаяОперация;
	ДокументОбъект.Ломбард = Ломбард;
	ДокументОбъект.ОтветственныйПользователь = ОтветственныйПользователь; 
	ДокументОбъект.ОтветственныйСотрудник = ОтветственныйСотрудник;

    ДокументОбъект.Комментарий = Комментарий;
	ДокументОбъект.Залогодатель = Залогодатель;  
	ДокументОбъект.ДокументЗалогодателя = ДокументЗалогодателя; 
	ДокументОбъект.Представитель = Представитель; 
	ДокументОбъект.ДокументПредставителя = ДокументПредставителя;  
	ДокументОбъект.ДоверенностьПредставителя = ДоверенностьПереоформление;
    ДокументОбъект.СхемаКредитования = СхемаКредитования;  
	ДокументОбъект.СрокЗалога = СрокЗалога;                                                                  
	ДокументОбъект.Акция = Акция;
	ДокументОбъект.ОтказОтВыкупа = ОтказОтВыкупа;
	ДокументОбъект.ДатаВыкупа = ДатаВыкупа;
	ДокументОбъект.ДатаВыкупаЛьготная = ДатаВыкупаЛьготная; 
	ДокументОбъект.СтатусЗалогодателя = СтатусЗалогодателя;
	ДокументОбъект.ПроцентнаяСхема = ПроцентнаяСхема; 
	ДокументОбъект.ПредельныйСрокЗайма = ПредельныйСрокЗайма;
	ДокументОбъект.ПредельныйСрокЗаймаДни = ПредельныйСрокЗаймаДни;
	ДокументОбъект.Промокод = Промокод;
	ДокументОбъект.Предъявитель = Предъявитель; 
	ДокументОбъект.СогласиеНаСМСРассылку = СогласиеНаСМСРассылку;  
	ДокументОбъект.ТекущаяУстановкаУсловийПоСхемеКредитования = ТекущаяУстановкаУсловийПоСхемеКредитования;  
	ДокументОбъект.ПриказСтавки = ПриказСтавки;
	ДокументОбъект.ПриказАкцияСтавки = ПриказАкцияСтавки;   
	ДокументОбъект.ОтклонениеПоАкции = ОтклонениеПоАкции;

	//+МАН 08.08.25 Для отчетов нужен ПСК на момент выдачи займа и чтобы его не считать записываем
	//в документ. Как и нужно было сделать сразу. Заявка 3348.
	ДокументОбъект.ПСКГод = ПСКГод;
	//
	//+МАН 10.12.25
	ДокументОбъект.ПриказВИПСтавки = ПриказВИПСтавки;
	//-МАН
	
	Если ПустаяСтрока(ДокументОбъект.НомерЗалоговогоБилета) тогда  
	    ДокументОбъект.НомерЗалоговогоБилета = ПолучитьновыйНомерЗБ(ДокументОбъект);
		Если ПустаяСтрока(ДокументОбъект.НомерЗалоговогоБилета) тогда 
		   ВызватьИсключение("Не определен номер залогового билета");
		КонецЕсли;   
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("Залогодатель", ДокументОбъект.Залогодатель);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРождения КАК МестоРождения,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Email КАК Email,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПрописке КАК АдресПоПрописке,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Пол КАК Пол,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК Телефон,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество
	               |ИЗ
	               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументОбъект.Фамилия = Выборка.Фамилия;
	    ДокументОбъект.Имя = Выборка.Имя;
	    ДокументОбъект.Отчество = Выборка.Отчество;		
		ДокументОбъект.ДатаРождения = Выборка.ДатаРождения;		
		ДокументОбъект.Гражданство = Выборка.Гражданство;
		ДокументОбъект.Пол = Выборка.Пол;  
		ДокументОбъект.ВозрастЗалогодателя = ЛБ_ОбщийМодуль.ВычислитьВозраст(ДокументОбъект.ДатаРождения);
	КонецЕсли;

	Запрос.УстановитьПараметр("ДокументЗалогодателя", ДокументОбъект.ДокументЗалогодателя);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНачалоДействия КАК ДокументНачалоДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(
	               |			&Дата,
	               |			ДокументЗалогодателя = &ДокументЗалогодателя
	               |				И ОсновнойДул = ИСТИНА) КАК ЛБ_ДокументыЗалогодателейСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Период УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументОбъект.ДокументВидДокументаЗалогодателя = Выборка.ВидДокументаЗалогодателя;
		ДокументОбъект.ДокументВид = Выборка.ВидДокумента;
		ДокументОбъект.ДокументГражданство = Выборка.Гражданство;
		ДокументОбъект.ДокументСерия = Выборка.ДокументСерия;
		ДокументОбъект.ДокументНомер = Выборка.ДокументНомер;
		ДокументОбъект.ДокументДатаВыдачи = Выборка.ДокументДатаВыдачи;
		ДокументОбъект.ДокументКемВыдан = Выборка.ДокументКемВыдан;
		ДокументОбъект.ДокументКодПодразделения = Выборка.ДокументКодПодразделения;
		ДокументОбъект.ДокументНачалоДействия = Выборка.ДокументНачалоДействия;
		ДокументОбъект.ДокументСрокДействия = Выборка.ДокументСрокДействия;
	КонецЕсли;
	
	ДокументОбъект.ДополнительныеДокументыПравоПребыванияРФ.Загрузить(ДопДокументы.Выгрузить());
	ПроцентныеСтавкиПоПериодам.Сортировать("ПричинаПрименения, ДеньНачалаПрименения");
	ДокументОбъект.ПроцентныеСтавкиПоПериодам.Загрузить(ПроцентныеСтавкиПоПериодам.Выгрузить()); 
	ДокументОбъект.ГрафикПлатежей.Загрузить(ГрафикПлатежей.Выгрузить());
	
	СтрСостояние = ТаблицаСостояний.Получить(1);
	ДокументОбъект.СуммаОплаты = СтрСостояние.СуммаЗайма+СтрСостояние.СуммаПроцентовДолг;
	ДокументОбъект.СуммаОплатыПроценты = СтрСостояние.СуммаПроцентовДолг;
	ДокументОбъект.СуммаОплатыСсуда = СтрСостояние.СуммаЗайма;
		
	ДокументОбъект.НачислениеПроцентовДетально.Очистить();
	Для каждого стр из ТаблицаОплатДетально Цикл 
	    НоваяСтр = ДокументОбъект.НачислениеПроцентовДетально.Добавить(); 
		ЗаполнитьЗначенияСвойств(НоваяСтр, стр);  
	КонецЦиклА;    

	ДокументОбъект.Товары.Очистить();
	ДокументОбъект.Дефекты.Очистить(); 
	ДокументОбъект.Вставки.Очистить();
	ДокументОбъект.ДополнительныеМеталлы.Очистить();
	
	СуммаЗаймаДок = 0;
	Для каждого стр из Товары Цикл  
		//Если НЕ Стр.Переоформить Тогда
		//	Продолжить;
		//КонецЕсли;	
		НоваяСтр = ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтр, стр);  
		Если НЕ ЗначениеЗаполнено(Стр.ОбъектЗалога) Тогда
		    ЛБ_УправлениеЛомбардом.СоздатьОбъектЗалога(ДокументОбъект, НоваяСтр); 
			стр.ОбъектЗалога = НоваяСтр.ОбъектЗалога;
		Иначе
			ОбъектЗалогаНаименование = СокрЛП(Стр.ВидИзделия.Наименование) + ?(Стр.ЕстьВставки, " с/в", " б/в"); 
			Если НЕ СокрЛП(Стр.ОбъектЗалога.Наименование) = ОбъектЗалогаНаименование Тогда 
				ОбъектОЗ = Стр.ОбъектЗалога.ПолучитьОбъект();  
				ОбъектОЗ.Наименование = ОбъектЗалогаНаименование; 
	            ОбъектОЗ.Записать();
            КонецЕсли;
		КонецЕсли;
		СуммаЗаймаДок = СуммаЗаймаДок + ?(Стр.Переоформить, Стр.СуммаСсуды, 0);
		
		Отбор = новый структура;
		Отбор.Вставить("КлючСтроки", стр.КлючСтроки);
		
		СтрокиД = Дефекты.НайтиСтроки(Отбор);
		Для каждого стрД из строкиД Цикл
			НоваяСтрД = ДокументОбъект.Дефекты.Добавить();
		    ЗаполнитьЗначенияСвойств(НоваяСтрД, стрД);
		Конеццикла;	
		
		СтрокиВ = Вставки.НайтиСтроки(Отбор);
		Для каждого стрВ из строкиВ Цикл
			НоваяСтрВ = ДокументОбъект.Вставки.Добавить();
		    ЗаполнитьЗначенияСвойств(НоваяСтрВ, стрВ);
		Конеццикла;	
		
		СтрокиМ = ДополнительныеМеталлы.НайтиСтроки(Отбор);
		Для каждого стрМ из строкиМ Цикл
			НоваяСтрМ = ДокументОбъект.ДополнительныеМеталлы.Добавить();
		    ЗаполнитьЗначенияСвойств(НоваяСтрМ, стрМ);
		Конеццикла;	
	Конеццикла;	
	ДокументОбъект.СуммаСсуды = СуммаЗаймаДок;
	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	Попытка           			 
	    ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение   
		ОбщегоНазначения.СообщитьПользователю("Не удалось провести документ " + строка(ДокументОбъект.Ссылка));
	КонецПопытки; 
	Возврат ДокументОбъект.Ссылка;	
КонецФункции	

&НаСервере
Функция ВыдатьЗаймНаСервере()  
	Если НЕ ЗначениеЗаполнено(ДокументЗайма) И НачалоДня(ДатаДок) = НачалоДня(ТекущаяДата()) Тогда
	    ДатаДок = ТекущаяДата();
	КонецЕсли;	  
	
	ЕстьНеПроведенные = Ложь;   
	СсылкаНаДокумент = СоздатьДокументНаСервере(); 
	ДокументЗайма = СсылкаНаДокумент; 
	НомерЗБ = ДокументЗайма.НомерЗалоговогоБилета;
   	Если НЕ СсылкаНаДокумент.проведен Тогда 
		ЕстьНеПроведенные = истина;
	КонецЕсли;		
	Возврат ЕстьНеПроведенные;
КонецФункции

&НаСервере
Функция ПолучитьСписокВыкуп()
	СписокВыкуп = Новый СписокЗначений;
	
	Для каждого Стр Из Товары Цикл
		Если Стр.Переоформить Тогда
			Продолжить;
		КонецЕсли;           
		
		ИнформацияВыкуп = ЛБ_УправлениеЛомбардом.АртикулОбъектаЗалога(ПредыдущаяОперация, Стр.НомерСтроки) + " " + СокрЛП(Стр.ОбъектЗалога) + ", " + СокрЛП(Стр.Проба) + 
		    ", вес " + СокрЛП(Формат(Стр.Вес, "ЧЦ=10; ЧДЦ=2")) + " г. (вес металла " + СокрЛП(Формат(Стр.ВесЧистый, "ЧЦ=10; ЧДЦ=2")) + " г.)";  
		СписокВыкуп.Добавить(ИнформацияВыкуп);
	КонецЦикла;
	
	Возврат СписокВыкуп;
КонецФункции

&НаСервере
Процедура ОбновитьРеквизитыТовары() 
	Ном = 0;
	Для каждого стр из Товары Цикл 
		Если Стр.Переоформить Тогда
			Ном = Ном + 1;
		КонецЕсли;	
		Стр.Статус = ?(НеРедактировать, ?(Стр.Переоформить, "Принят", "Выкуп"), "Проект");   
		Стр.СтатусДоп = ?(Стр.Новый, " Добавлен", "");
		Стр.Артикул = ?(НеРедактировать, ?(НЕ Стр.Переоформить, "", ЛБ_УправлениеЛомбардом.АртикулОбъектаЗалога(ДокументЗайма, Ном)), "");
	КонецЦикла;		
КонецПроцедуры

&НаСервере
Функция ПроверитьКассовуюСмену(ДатаПроверки = неопределено) 	            
	Возврат ЛБ_ОбщийМодуль.ПолучитьОткрытуюКассовуюСмену(?(ДатаПроверки = неопределено, ТекущаяДатаСеанса(), ДатаПроверки), Организация, Ломбард);
КонецФункции   

&НаСервере
Функция ПроверитьКассовыйДеньЗакрыт(ДатаПроверки = неопределено) 	             
	Результат = ЛБ_ОбщийМодуль.ПолучитьЗакрытыйКассовыйДень(?(ДатаПроверки = неопределено, ТекущаяДатаСеанса(), ДатаПроверки), Организация, Ломбард);
	Если НЕ Результат = неопределено Тогда 
		Если (НачалоДня(Результат.Дата) = НачалоДня(ДатаПроверки)) Тогда    
			Возврат Истина;
		КонецЕсли;	
	КонецЕсли;	
	Возврат Ложь;
КонецФункции


&НаСервере
Функция ПроверитьДС(ДатаПроверки)
    Возврат ЛБ_ОбщийМодуль.ПроверитьНаличиеСуммыВКассеЛомбарда(ДатаПроверки, Организация, Ломбард);
КонецФункции

&НаСервере
Функция ПроверитьЕстьВНакладной()
	Возврат  ЛБ_УправлениеЛомбардом.ПолучитьСтатусНакладнойПоЗБ(ДатаДок, ПредыдущаяОперация); 
КонецФункции 

&НаСервере
Функция ПолучитьНомерЗБ() 
	Возврат ПредыдущаяОперация.НомерЗалоговогоБилета;
КонецФункции

&НаСервере
Функция ПолучитьРеквизитыНакладной(НакладнаяНаОтгрузку)  
	СтруктураВ = Новый Структура;
	СтруктураВ.Вставить("Номер", НакладнаяНаОтгрузку.ПредставлениеНомераНакладной); 
	СтруктураВ.Вставить("Дата", НакладнаяНаОтгрузку.Дата);
	Возврат СтруктураВ; 
КонецФункции

&НаКлиенте
Процедура ВыдатьЗайм(Команда)
	Если НеРедактировать Тогда
		Возврат;
	КонецЕсли;    
	
	Если НЕ ЗначениеЗаполнено(ДокументЗайма) И НачалоДня(ДатаДок) = НачалоДня(ТекущаяДата()) Тогда
	    ДатаПроверки = ТекущаяДата();
	Иначе
		ДатаПроверки = ДатаДок;
	КонецЕсли;	 
	
	Если НЕ ЗначениеЗаполнено(ТекущаяУстановкаУсловийПоСхемеКредитования) Тогда
		Предупреждение("Не определены условия по выбранной схеме кредитования!", 60);
		Возврат;
	КонецЕсли;
	
	ОстатокДС = ПроверитьДС(ДатаПроверки); 
	СтрСостояние = ТаблицаСостояний.Получить(1);
	СуммаВыкупаЗБ = СтрСостояние.СуммаЗайма+СтрСостояние.СуммаПроцентовДолг;  
	ОстатокДС = ОстатокДС + СуммаВыкупаЗБ; 
	
	Если ОстатокДС < СуммаЗайма Тогда
		Предупреждение("Остаток денежных средств в кассе ломбарда с учетом выкупа переоформляемого билета " + СокрЛП(Формат(ОстатокДС, "ЧЦ=15; ЧДЦ=2; ЧН=0,00")) + " руб." +
		   Символы.ПС + "Этого недостаточно для переоформления займа.", 60);
		Возврат;
	КонецЕсли;	

	СтруктураКС = ПроверитьКассовуюСмену(ДатаПроверки);
	Если СтруктураКС = неопределено Тогда   
		Предупреждение("Не открыта кассовая смена в ломбарде. Выдача займа запрещена.", 60); 
		Возврат;
	КонецЕсли;	

	Если СуммаЗайма < МинСуммаЗайма Тогда
		Сообщить("Сумма займа не может быть меньше минимальной суммы займа " + СокрЛП(Формат(МинСуммаЗайма, "ЧЦ=15; ЧДЦ=2")) + " руб.!");  
		Возврат;
	КонецЕсли;
	
	ЕстьОшибки = ложь;
	Если НЕ ПроверкаКлиента() Тогда  
		ЕстьОшибки = Истина;
	КонецЕсли;  
	
	Если НЕ ПроверкаЗаполненияДокумента() Тогда  
		ЕстьОшибки = Истина;
	КонецЕсли;  
	
	Если НЕ ПроверкаОценкиИзделий() Тогда  
		ЕстьОшибки = Истина;
	КонецЕсли;           
	
	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;  
	
	СтруктураВ = ПроверитьЕстьВНакладной();
	Если СтруктураВ = неопределено Тогда
		ЕстьВНакладной = Ложь;
	Иначе
		ЕстьВНакладной = Истина;
		НакладнаяНаОтгрузку = СтруктураВ.НакладнаяНаОтгрузку; 
		СтатусНакладной = СтруктураВ.СтатусНакладной;
	КонецЕсли;  
	
	Если ЕстьВНакладной Тогда   
		СтруктураН = ПолучитьРеквизитыНакладной(НакладнаяНаОтгрузку); 
	    ТекстПредупреждения = "Предметы залога ЗБ № " + СокрЛП(ПолучитьНомерЗБ()) + " в накладной № " + СокрЛП(СтруктураН.Номер)+ " от " + Формат(СтруктураН.Дата, "ДЛФ=DT");
		Если СтатусНакладной = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыНакладнойНаОтгрузку.Отгружена") Тогда 
			ТекстПредупреждения = ТекстПредупреждения + " уже отгружены.";
		    ТекстПредупреждения = ТекстПредупреждения + " Проведение операции невозможно!";   			
			Предупреждение(ТекстПредупреждения, 60);
			Возврат;
	    ИначеЕсли СтатусНакладной = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыНакладнойНаОтгрузку.СумкаОткрыта") ИЛИ  
			      СтатусНакладной = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыНакладнойНаОтгрузку.СумкаЗакрыта") Тогда  
		   ТекстПредупреждения = ТекстПредупреждения + " в сумке.";	
		   ТекстПредупреждения = ТекстПредупреждения + Символы.ПС + "Для переоформления ЗБ измените статус накладной и вскройте сумку."; 
		   
	   	   Предупреждение(ТекстПредупреждения, 60);  
		   Возврат;
	    КонецЕсли;	   
	КонецЕсли;		  

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Залогодатель", Залогодатель);
	ПараметрыФормы.Вставить("Представитель", Представитель);
	ПараметрыФормы.Вставить("ПредыдущаяОперация", ПредыдущаяОперация);
	ПараметрыФормы.Вставить("СхемаКредитования", СхемаКредитования);
	ПараметрыФормы.Вставить("СрокЗалога", СрокЗалога);
	ПараметрыФормы.Вставить("СуммаЗайма", СуммаЗайма);
	ПараметрыФормы.Вставить("СуммаКВыдаче", СуммаКВыдаче);
	ПараметрыФормы.Вставить("СуммаКВнесению", СуммаКВнесению); 
	ПараметрыФормы.Вставить("СписокОбъектовВыкуп", ПолучитьСписокВыкуп()); 
	ПараметрыФормы.Вставить("ЕстьВНакладной", ЕстьВНакладной);
	
	СтрСостояние = ТаблицаСостояний.Получить(1);
	ИнфВыкуп = "Сумма выкупа ";  
	ИнфВыкуп = ИнфВыкуп + Формат(СтрСостояние.СуммаЗайма+СтрСостояние.СуммаПроцентовДолг, "ЧЦ=15; ЧДЦ=2; ЧРД=,; ЧРГ=; ЧН=0,00") + " руб."; 
	ИнфВыкуп = ИнфВыкуп + Символы.ПС + " (в том числе займ " + Формат(СтрСостояние.СуммаЗайма, "ЧЦ=15; ЧДЦ=2; ЧРД=,; ЧРГ=; ЧН=0,00") + " руб.";
	ИнфВыкуп = ИнфВыкуп + ", проценты " + Формат(СтрСостояние.СуммаПроцентовДолг, "ЧЦ=15; ЧДЦ=2; ЧРД=,; ЧРГ=; ЧН=0,00") + " руб.)";
	//Элементы.ДекорацияВыкупРасшифровка.Заголовок = ИнфВыкуп;    
	
	ПараметрыФормы.Вставить("ИнформацияВыкуп", ИнфВыкуп); 

			
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораПереоформить",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ИнформацияПереоформленияЗайма", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры

&НаСервере
Функция ПолучитьПредыдущегоЗалогодателя()
	Возврат ПредыдущаяОперация.Залогодатель;
КонецФункции

&НаКлиенте
Процедура ПослеВыбораПереоформить(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;  
	
	ЕстьНеПроведенные = ВыдатьЗаймНаСервере();
		
	Если НЕ ЕстьНеПроведенные Тогда
		НеРедактировать = Истина;
		Элементы.ДекорацияСтатусДокумента.Заголовок = "Факт"; 
		Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноБордовый;  
		Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.ТусклоРозовый;
        Элементы.Редактировать.Видимость = Истина; 
		Элементы.КнопкаИстория.Видимость = Истина; 
		Элементы.ВыдатьЗайм.Доступность = Ложь;
	    Элементы.ТоварыГруппаЭ.Доступность = Ложь;  
		Элементы.ПовышеннаяОценка.Доступность = ложь; 
		Элементы.Округление.Доступность = ложь;
	    Элементы.Отмена.Заголовок = "Закрыть"; 
		Элементы.ОсновнаяПанель.ТолькоПросмотр = НеРедактировать;   
		ОбновитьРеквизитыТовары();
		
		Если ВладелецФормы.ИмяФормы = "ОбщаяФорма.ЛБ_РабочееМестоПриемщикаЛомбарда" Тогда
   	        ФормаРМП = ВладелецФормы;   
			Если ФормаРМП.Залогодатель = ПолучитьПредыдущегоЗалогодателя() Тогда
                ФормаРМП.ПослеВыбораТекущееСостояниеЗБ(Истина, неопределено); 
			ИначеЕсли ФормаРМП.Залогодатель = Залогодатель Тогда
                ФормаРМП.ПослеВыбораТекущееСостояниеЗБ(Истина, неопределено);	
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;	
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Функция СнятьСПроведения(Документ)  
	ДокОбъект = Документ.ПолучитьОбъект(); 
	Если ДокОбъект.Проведен Тогда 
		ЗапросП = Новый Запрос; 
		ЗапросП.УстановитьПараметр("ЗБ", Документ);
		ЗапросП.Текст = "ВЫБРАТЬ
		                |	ЛБ_ОперацияПоЗалогу.Ссылка КАК Ссылка
		                |ИЗ
		                |	Документ.ЛБ_ОперацияПоЗалогу КАК ЛБ_ОперацияПоЗалогу
		                |ГДЕ
		                |	ЛБ_ОперацияПоЗалогу.ПредыдущаяОперация = &ЗБ
		                |	И ЛБ_ОперацияПоЗалогу.Проведен = ИСТИНА";
		ВыборкаП = ЗапросП.Выполнить().Выбрать();
		Если ВыборкаП.Следующий() тогда 
			Сообщить("У залогового билета " + СокрЛП(Документ.НомерЗалоговогоБилета) + " есть более поздние операции. Редактирование запрещено.");
			Возврат Ложь;
		КонецЕсли;                                               
		Попытка
		    ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);  
			Возврат Истина;
		Исключение   
			Сообщить("Не удалось снять с проведения залоговый билет " + СокрЛП(Документ.НомерЗалоговогоБилета) + ". Редактирование запрещено.");
			Возврат Ложь;
		КонецПопытки;	
	Иначе
		возврат Истина;
	КонецЕсли;
КонецФункции	

&НаКлиенте
Процедура Редактировать(Команда)   
	ПроверкаМожноРедактировать = Истина;
	Если ЭтаФорма.НеРедактировать Тогда 
		Если ЗначениеЗаполнено(ДокументЗайма) тогда 
			Результат = СнятьСПроведения(ДокументЗайма);
			Если НЕ Результат тогда  
				ПроверкаМожноРедактировать = Ложь;
			КонецЕсли;	
		КонецЕсли;	
		Если ПроверкаМожноРедактировать Тогда  
			НеРедактировать = Ложь;
			Этаформа.ТолькоПросмотр = Ложь;
			Этаформа.Открыть();
		КонецЕсли;
	//Иначе
	//	Для каждого стр из Товары Цикл
	//		Стр.статус = "Проект"; 
	//		Стр.СтатусДоп = ?(Стр.Новый, " Добавлен", "");
	//	КонецЦикла;
    КонецЕсли;	
    ОбновитьРеквизитыТовары();
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	Элементы.ОсновнаяПанель.ТолькоПросмотр = НеРедактировать;  
	Элементы.ДекорацияСтатусДокумента.Заголовок = "Проект"; 
	Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноЗеленый;
	Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.СветлоЗеленый;
	Элементы.Редактировать.Видимость = Ложь; 
	Элементы.КнопкаИстория.Видимость = Ложь; 
	Элементы.ВыдатьЗайм.Доступность = Истина;
	Элементы.ТоварыГруппаЭ.Доступность = ?(НеРедактировать, Элементы.ТоварыГруппаЭ.Доступность, Истина); 
	Если НеРедактировать Тогда
		Элементы.ПовышеннаяОценка.Доступность = ложь;
		Элементы.Округление.Доступность = Ложь;
	Иначе	
	    ПроверитьДоступностьДопКнопок();
	КонецЕсли;
	Элементы.Отмена.Заголовок = "Отмена"; 
	РассчитатьПредельныСрокЗайма();  
	ОбновитьРеквизитыТовары();                       
	ЗаполнитьСостояниеЗалоговогоБилета(); 
	ЗаполнитьКВыдачеВнесению();
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Функция МакетПечатнойФормы(ШаблонДокумента)
	
	Если НЕ ТипЗнч(ШаблонДокумента.ХранилищеШаблона.Получить()) = Тип("ДвоичныеДанные") Тогда
		Сообщить("Шаблон печати анкеты не загружен!");
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ШаблонДокумента.ХранилищеШаблона.Получить();
	 
КонецФункции 

&НаСервере
Функция ДокументЗаймаПроведен()  
	Возврат ДокументЗайма.Проведен;
КонецФункции

&НаКлиенте
Процедура ПечатьЗалоговыйБилет(Команда)    
	Если ЗначениеЗаполнено(ДокументЗайма) Тогда	
		Если ДокументЗаймаПроведен() Тогда 
			ПараметрыФормы = Новый Структура;    
			ПараметрыФормы.Вставить("ИменаМакетов", "Переоформление");  	
			ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_ОперацияПоЗалогу");
			МассивОбъектов = Новый Массив;
			МассивОбъектов.Добавить(ДокументЗайма);
			ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
			//++ИвановВВ 01.2026, печать согласия на обработку ПД
			//было:
			//ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,);
			//стало:
			ОповещениеПечатьСогласиеПД = Новый ОписаниеОповещения("ПечатьСогласиеНаОбработкуПДПродолжить", ЭтотОбъект, МассивОбъектов);
			ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,, ОповещениеПечатьСогласиеПД,);
			//--ИвановВВ
		Иначе  
			Предупреждение("Печать проекта документа выдачи займа не разрешена!", 60);
		КонецЕсли;	
	Иначе     
		Предупреждение("Документ выдачи займа не записан!", 60);
	КонецЕсли;	
  
	
	//ШаблонДокумента = ПредопределенноеЗначение("Справочник.ЛБ_ШаблоныПечатиДокументов.ЗалоговыйБилет");
	//ДвоичныеДанные = МакетПечатнойФормы(ШаблонДокумента);	
	//ИмяВременногоФайла = ПолучитьИмяВременногоФайла("doc"); 
	//
	//Если ДвоичныеДанные = Неопределено Тогда
	//	Возврат;
	//КонецЕсли; 
	//
	//Попытка
	//	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	//	Word = Новый COMОбъект("Word.Application");
	//	//Word.Documents.Open(ИмяВременногоФайла);   
	//	Word.Documents.add(ИмяВременногоФайла);
	//    ActiveDocument = Word.Application.Documents(1);
	//    ActiveDocument.Activate();
	//Исключение
	//	ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось создать документ Word. " + ОписаниеОшибки());							
	//	Word = Неопределено;
	//	Возврат;
	//КонецПопытки;
	//
	////ПаспортныеДанныеСтруктура = ПаспортныеДанныеКлиента();
	////
	////ActiveDocument = Word.ActiveDocument;
	////ВывестиПараметрНаПечать(ActiveDocument, "ТекДата",              Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy"));
	////ВывестиПараметрНаПечать(ActiveDocument, "ФИО",                  СокрЛП(Фамилия) + " " + СокрЛП(Имя) + ?(НЕ ПустаяСтрока(Отчество), " " + СокрЛП(Отчество), ""));
	////ВывестиПараметрНаПечать(ActiveDocument, "ДатаРождения",         Формат(ДатаРождения, "ДФ=dd.MM.yyyy"));
	////ВывестиПараметрНаПечать(ActiveDocument, "ПаспортныеДанные",     ПаспортныеДанныеСтруктура.ПаспортныеДанные);
	////ВывестиПараметрНаПечать(ActiveDocument, "АдресМестаЖительства", ?(Не ПустаяСтрока(АдресПоПрописке), АдресПоПрописке, ФактическийАдрес)); 
	////ВывестиПараметрНаПечать(ActiveDocument, "Согласен",             ?(Пол = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Женский"), "согласна", "согласен"));
	//
	//Word.Visible = Истина;
	//Word.WindowState = 2;
	//Word.WindowState = 1;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСогласиеНаОбработкуПДПродолжить(Результат, ДополнительныеПараметры) Экспорт
	
	ОтветПечатьСогласияНаОбработкуПД = Вопрос("Печатаем Согласие на обработку персональных данных.",
	РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК);
	ЛБ_СогласияНаОбработкуПД_Сервер.ЗаключитьСогласиеНаОбработкуПД_ЗБ(ДополнительныеПараметры[0]);
	ТабличныйДокументПД = ЛБ_СогласияНаОбработкуПД_Сервер.ПечатьСогласиеНаОбработкуПД_ЗБ(ДополнительныеПараметры[0]);
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЛБ_СогласиеПД");    
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокументПД; 
	КоллекцияПечатныхФорм[0].СинонимМакета = "Согласие на обработку ПД";
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено);
	
КонецПроцедуры

#Область СогласияПД

&НаКлиенте
Процедура ПечатьСогласиеНаОбработкуПД(Команда)
	
	Если ЗначениеЗаполнено(ДокументЗайма) Тогда
		ЛБ_СогласияНаОбработкуПД_Сервер.ЗаключитьСогласиеНаОбработкуПД_ЗБ(ДокументЗайма);
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ИмяКоманды",    Команда.Имя);
		СтруктураПараметров.Вставить("ОперацияЗайма", ДокументЗайма);
		ЛБ_СогласияНаОбработкуПД_Клиент.ОбработкаКоманд(СтруктураПараметров);	
	Иначе     
		Предупреждение("Документ выдачи займа не записан!", 60);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСогласияНаОпробование(Команда)
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ИмяКоманды",   Команда.Имя);
	СтруктураПараметров.Вставить("Залогодатель", Залогодатель);
	ЛБ_СогласияНаОбработкуПД_Клиент.ОбработкаКоманд(СтруктураПараметров);
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПечатьПКО(Команда)
	Если ЗначениеЗаполнено(ДокументЗайма) Тогда	
		Если ДокументЗаймаПроведен() Тогда 
			ПараметрыФормы = Новый Структура;    
			ПараметрыФормы.Вставить("ИменаМакетов", "ПКО");  	
			ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_ОперацияПоЗалогу");
			МассивОбъектов = Новый Массив;
			МассивОбъектов.Добавить(ДокументЗайма);
			ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
			ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,);   
		Иначе  
			Предупреждение("Печать проекта документа не разрешена!", 60);
		КонецЕсли;	
	Иначе     
		Предупреждение("Документ не записан!", 60);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьРКО(Команда)
	Если ЗначениеЗаполнено(ДокументЗайма) Тогда	
		Если ДокументЗаймаПроведен() Тогда 
			ПараметрыФормы = Новый Структура;    
			ПараметрыФормы.Вставить("ИменаМакетов", "РКО");  	
			ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_ОперацияПоЗалогу");
			МассивОбъектов = Новый Массив;
			МассивОбъектов.Добавить(ДокументЗайма);
			ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
			ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,);   
		Иначе  
			Предупреждение("Печать проекта документа не разрешена!", 60);
		КонецЕсли;	
	Иначе     
		Предупреждение("Документ не записан!", 60);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Вперед(Команда)
	Если Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаЗаемщик тогда 
		Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаОбъектыЗалога; 
	ИначеЕсли Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаОбъектыЗалога тогда 
		Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаДополнительно;
	конецЕсли;	  
	ПриСменеСтраницы(Элементы.ОсновнаяПанель.ТекущаяСтраница);
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	Если Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаОбъектыЗалога тогда 
		Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаЗаемщик; 
	ИначеЕсли Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаДополнительно тогда 
		Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаОбъектыЗалога;
	конецЕсли;	  
	ПриСменеСтраницы(Элементы.ОсновнаяПанель.ТекущаяСтраница);
КонецПроцедуры

&НаКлиенте
Процедура ПриСменеСтраницы(ТекущаяСтраница)
    Если ТекущаяСтраница = Элементы.СтраницаЗаемщик Тогда 
		Элементы.Вперед.Доступность = Истина; 
		Элементы.Назад.Доступность = Ложь;
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаОбъектыЗалога Тогда 
		Элементы.Вперед.Доступность = Истина; 
		Элементы.Назад.Доступность = Истина;
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаДополнительно Тогда 
		Элементы.Вперед.Доступность = Ложь; 
		Элементы.Назад.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ОсновнаяПанельПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ПриСменеСтраницы(ТекущаяСтраница);
КонецПроцедуры

&НаКлиенте
Процедура СтатистикаПоКлиенту(Команда)
	Если ЗначениеЗаполнено(Залогодатель) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Клиент", Залогодатель);
		ПараметрыФормы.Вставить("Дата", ДатаДок);	 
								
		ОткрытьФорму("Отчет.ЛБ_СтатистикаОбращенийКлиента.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Сообщить("Не выбран заемщик!");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СрокЗалогаПриИзменении(Элемент)
	ЗаполнитьДатуВыкупа();
	ДатаВыкупаЛьготная = ПолучитьЛьготнуюДатуВыкупа();
	
	ОбработатьПСКНасервере();
КонецПроцедуры

&НаСервере
Процедура ИзменитьСписокЛьготныхСтатусовСотрудника(ЕстьЛьготы = Истина) 
	СтатусС = СписокЛьготныхСтатусов.НайтиПоЗначению(Перечисления.ЛБ_ЛьготныеСтатусыЗаемщика.Сотрудник);
	Если ЕстьЛьготы Тогда
		Если СтатусС = неопределено Тогда
		   СписокЛьготныхСтатусов.Добавить(Перечисления.ЛБ_ЛьготныеСтатусыЗаемщика.Сотрудник); 
		КонецЕсли;   
	Иначе
		Если НЕ СтатусС = неопределено Тогда
			СписокЛьготныхСтатусов.Удалить(СтатусС);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Функция ПроверитьЕстьЛьготыСотрудника() 
	Для каждого стр из ТаблицаВыбораСхемыКредитованияАкции Цикл  
		Если ЗначениеЗаполнено(Стр.Акция) И Стр.Акция.ВидАкции = Перечисления.ЛБ_ВидыАкций.ПоСтатусамЗаемщика Тогда
			Для каждого СтрА Из Стр.Акция.СтатусыЗаемщика Цикл  
				Если стрА.Статус = Перечисления.ЛБ_ЛьготныеСтатусыЗаемщика.Сотрудник Тогда   
					Возврат Истина;
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;	
	Конеццикла;   
	Возврат ложь;
КонецФункции	
	
&НаСервере
Процедура ОбработатьДополнительныеКнопки()
	СуммаЗайма = 0;
	Для каждого СтрокаТабличнойЧасти из Товары Цикл  
		Если СтрокаТабличнойЧасти.Переоформить тогда
			РасчетМаксимальнойСуммыОценки(СтрокаТабличнойЧасти.ПолучитьИдентификатор());  
			СтрокаТабличнойЧасти.СуммаСсуды = СтрокаТабличнойЧасти.СуммаОценкиМаксимальная;
			СуммаЗайма = СуммаЗайма + СтрокаТабличнойЧасти.СуммаСсуды;
		КонецЕсли;	
	Конеццикла;	                                               	
	СуммаЗайма = ОкруглитьСуммуСсуды(СуммаЗайма);
	РаспределитьСуммуЗайма();   
	ТоварыИтоги(); 
	ПолучитьДоступныеПроцентныеСхемыАкции();				
	Если НЕ ТаблицаВыбораСхемыКредитованияАкции.Количество() = 0 Тогда
		ОтборК = Новый Структура;
		ОтборК.Вставить("СхемаКредитования", СхемаКредитования); 
		ОтборК.Вставить("Акция", Акция);
		СтрокиСК = ТаблицаВыбораСхемыКредитованияАкции.НайтиСтроки(ОтборК);
		Если СтрокиСК.Количество() = 0 Тогда 
		    СтрокаСК = ТаблицаВыбораСхемыКредитованияАкции.Получить(0); 
		Иначе  
			СтрокаСК = СтрокиСК.Получить(0);
		КонецЕсли;   
		Если СхемаКредитования = СтрокаСК.СхемаКредитования И Акция = СтрокаСК.Акция Тогда
			ЗаполнитьТаблицуСтавок();
		Иначе 
			СхемаКредитования = СтрокаСК.СхемаКредитования;
			ТекущаяУстановкаУсловийПоСхемеКредитования = ПолучитьУсловияСК();
			Если НЕ ЗначениеЗаполнено(ТекущаяУстановкаУсловийПоСхемеКредитования) тогда
				 Сообщить("На дату документа не определены условия по кредитной схеме " + СокрЛП(СхемаКредитования) + "!"); 
			КонецЕсли; 
			Акция = СтрокаСК.Акция;    
			ОбработатьСхемуКредитованияНаСервере();
			ПроверитьДоступностьДопКнопок();
			//Элементы.ДекорацияПродукт.Заголовок = ИнформацияПродукт();
			ЗаполнитьТаблицуСтавок();
			ОбработатьДополнительныеКнопки();
			ЗаполнитьДатуВыкупа();
			ДатаВыкупаЛьготная = ПолучитьЛьготнуюДатуВыкупа();
		КонецЕсли;	
	Иначе
		СхемаКредитования = ПредопределенноеЗначение("Справочник.ЛБ_СхемыКредитования.ПустаяСсылка");
		Акция = ПредопределенноеЗначение("Справочник.ЛБ_Акции.ПустаяСсылка");
		//Элементы.ДекорацияПродукт.Заголовок = ИнформацияПродукт();
		ПроцентныеСтавкиПоПериодам.Очистить();
		ТаблицаСтавок.Очистить();
		ДатаВыкупа = Дата(1,1,1); 
		ДатаВыкупаЛьготная = Дата(1,1,1);  
		СрокЗалога = 0;
		ПроцентнаяСхема = 0;  
		Элементы.ПовышеннаяОценка.Доступность = ложь;
		ПовышеннаяОценка = Ложь;
		Сообщить("Не определена процентная схема! Расчет процентов по договору займа не возможен.");
	КонецЕсли;	  
	УстановитьВидимость();
	УстановитьТекстСуммаЗаймаДень();
	ОбработатьПСКНасервере(); 
	ЗаполнитьКВыдачеВнесению();
КонецПроцедуры	

&НаКлиенте
Процедура ПовышеннаяОценкаПриИзменении(Элемент)
	ОбработатьДополнительныеКнопки();
КонецПроцедуры

&НаКлиенте
Процедура ОкруглениеПриИзменении(Элемент)
	ОбработатьДополнительныеКнопки();
КонецПроцедуры

&НаСервере
Процедура ПроверитьДоступностьДопКнопок()
	Если ПроцентУвеличенияОценкиЗалога = 0 Тогда  
		Элементы.ПовышеннаяОценка.Доступность = Ложь;
		ПовышеннаяОценка = Ложь;
	Иначе
		Элементы.ПовышеннаяОценка.Доступность = Истина;
	КонецЕсли;
    Если НЕ ОкруглятьЦены Тогда  
		Элементы.Округление.Доступность = Ложь;
		Округление = Ложь;
	Иначе
		Элементы.Округление.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработатьПСКНасервере() 
	Если СуммаЗайма = 0 Тогда
		ПСКГод = 0;
		СуммаПроцентов = 0;
		СуммаПроцентовДень = 0;
	Иначе	
		ПроцентыРасчет = РассчитатьСуммуПроцентов();
		ПСКГодРасчет = РасчетПСКГод(СуммаЗайма, ПроцентыРасчет);          
		Если НЕ ПСК = 0 Тогда      
			Если ПСКГодРасчет > ПСК Тогда  
				ОбщегоНазначения.СообщитьПользователю("Сумма процентов в год превышает предельную ставку кредитования!");
			КонецЕсли;	
		КонецЕсли; 
		ПСКГод = ПСКГодРасчет;
	КонецЕсли;	
КонецПроцедуры	 

&НаКлиенте
Процедура ТоварыПереоформитьПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	Если ТекСтрока.Переоформить Тогда  
		ТекСтрока.Статус = "Проект"; 
	Иначе                 
		ТекСтрока.Статус = "Выкуп";
	КонецЕсли;    
	ТекСтрока.СтатусДоп = ?(ТекСтрока.Новый, " Добавлен", "");
	СуммаЗайма = 0;
	Для каждого стр Из Товары Цикл 
		Если Стр.Переоформить Тогда
		    СуммаЗайма = СуммаЗайма + Стр.СуммаОценкиМаксимальная;
		Иначе
			Стр.СуммаСсуды = 0;
		КонецЕсли;	
	Конеццикла;	
	СуммаЗайма = ОкруглитьСуммуСсуды(СуммаЗайма);
	РаспределитьСуммуЗайма();   
	ТоварыИтоги(); 
	ПолучитьДоступныеПроцентныеСхемыАкции();				
	Если НЕ ТаблицаВыбораСхемыКредитованияАкции.Количество() = 0 Тогда
		ОтборК = Новый Структура;
		ОтборК.Вставить("СхемаКредитования", СхемаКредитования); 
		ОтборК.Вставить("Акция", Акция);
		СтрокиСК = ТаблицаВыбораСхемыКредитованияАкции.НайтиСтроки(ОтборК);
		Если СтрокиСК.Количество() = 0 Тогда 
		    СтрокаСК = ТаблицаВыбораСхемыКредитованияАкции.Получить(0); 
		Иначе  
			СтрокаСК = СтрокиСК.Получить(0);
		КонецЕсли;   
		Если СхемаКредитования = СтрокаСК.СхемаКредитования И Акция = СтрокаСК.Акция Тогда
			ЗаполнитьТаблицуСтавок();
		Иначе 
			СхемаКредитования = СтрокаСК.СхемаКредитования; 
			ТекущаяУстановкаУсловийПоСхемеКредитования = ПолучитьУсловияСК();
			Если НЕ ЗначениеЗаполнено(ТекущаяУстановкаУсловийПоСхемеКредитования) тогда
				 Сообщить("На дату документа не определены условия по кредитной схеме " + СокрЛП(СхемаКредитования) + "!"); 
			КонецЕсли; 
			Акция = СтрокаСК.Акция;    
			ОбработатьСхемуКредитованияНаСервере();
			ПроверитьДоступностьДопКнопок();
			//Элементы.ДекорацияПродукт.Заголовок = ИнформацияПродукт();
			ЗаполнитьТаблицуСтавок();
			ОбработатьДополнительныеКнопки();
			ЗаполнитьДатуВыкупа();
			ДатаВыкупаЛьготная = ПолучитьЛьготнуюДатуВыкупа();
		КонецЕсли;	
	Иначе
		СхемаКредитования = ПредопределенноеЗначение("Справочник.ЛБ_СхемыКредитования.ПустаяСсылка");
		Акция = ПредопределенноеЗначение("Справочник.ЛБ_Акции.ПустаяСсылка");
		//Элементы.ДекорацияПродукт.Заголовок = ИнформацияПродукт();
		ПроцентныеСтавкиПоПериодам.Очистить();
		ТаблицаСтавок.Очистить();
		ДатаВыкупа = Дата(1,1,1); 
		ДатаВыкупаЛьготная = Дата(1,1,1);  
		СрокЗалога = 0;
		ПроцентнаяСхема = 0;  
		Элементы.ПовышеннаяОценка.Доступность = ложь;
		ПовышеннаяОценка = Ложь;
		Сообщить("Не определена процентная схема! Расчет процентов по договору займа не возможен.");
	КонецЕсли;	  
	УстановитьВидимость();
	УстановитьТекстСуммаЗаймаДень();
	ОбработатьПСКНасервере();
	ЗаполнитьКВыдачеВнесению();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗБПереоформлениеНажатие(Элемент)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Клиент", ПолучитьНачальногоЗаемщика());
	ПараметрыФормы.Вставить("ЗалоговыйБилет", ПредыдущаяОперация);	 
							
	ОткрытьФорму("Отчет.ЛБ_ИсторияЗалоговогоБилета.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКатегории(Результат, Параметр) Экспорт
    Если Результат = КодВозвратаДиалога.Да Тогда
        ТекСтрока = Элементы.Товары.ТекущиеДанные; 
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки", ТекСтрока.КлючСтроки);   
		СтрокиВ = Вставки.НайтиСтроки(Отбор);
		Для сч = 0 По СтрокиВ.Количество()-1 Цикл 
			СтрВ = СтрокиВ.Получить(сч);
			Вставки.Удалить(СтрВ);
		КонецЦикла;	
        ТекСтрока.Категория = Параметр;
	КонецЕсли;   
КонецПроцедуры 

&НаКлиенте
Процедура ТоварыКатегорияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	Отбор = Новый Структура;
	Отбор.Вставить("КлючСтроки", ТекСтрока.КлючСтроки);   
	СтрокиВ = Вставки.НайтиСтроки(Отбор);
	Если НЕ (СтрокиВ.Количество() = 0) И НЕ (ВыбранноеЗначение = ТекСтрока.Категория) Тогда	    	
	    СтандартнаяОбработка = Ложь;  
	    Оповещение = Новый ОписаниеОповещения("ПослеВыбораКатегории", ЭтотОбъект, ВыбранноеЗначение);
	    ПоказатьВопрос(Оповещение, "После изменения категории вставки изделия будут очищены. Продолжть?", РежимДиалогаВопрос.ДаНет);  
	Иначе
		СтандартнаяОбработка = Истина;
	КонецЕсли;	
КонецПроцедуры

//+Мельников 25.04.24 Отмена операции
&НаКлиенте
Процедура ОтменитьОперацию(Команда)
	
	ПоследняяОперация = ПолучитьИнформациюОЗБ(ДокументЗайма, ТекущаяДата());
	ЛомбардПользователя = ПолучитьЛомбардПольвателя();
	ЛомбардВДокументе = ПолучитьЛомбардВдокументе(ПоследняяОперация.ДокументОперации);

	Если ЛомбардПользователя <> ЛомбардВДокументе Тогда
		Предупреждение("Операция оформлена в другом ломбарде.
		|Действия с документом запрещены!");
		Возврат
	ИначеЕсли Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy") <> Формат(ПоследняяОперация.Дата, "ДФ=dd.MM.yyyy") Тогда
		Предупреждение("Отмена операции возможна только в текущем дне.");
		Возврат
	ИначеЕсли ТекущаяДата() - ДатаДок >= 3600 Тогда
		Предупреждение("Прошло больше часа от времени оформления текущей операции.");
		Возврат 
	ИначеЕсли ПроверитьКассовуюСмену() = неопределено Тогда 
		Предупреждение("Не открыта кассовая смена в ломбарде.");
	    Возврат;	
	Иначе
		
		Ответ = Вопрос("Выполнить отмену текущей операции?", РежимДиалогаВопрос.ДаНет);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ЗалоговыйБилет", ДокументЗайма); 

			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеСозданияДокумента", ЭтаФорма); //+Мельников 31.07.24	
			
			Если ВладелецФормы.ИмяФормы = "ОбщаяФорма.ЛБ_РабочееМестоПриемщикаЛомбарда" Тогда  
				ОткрытьФорму("ОбщаяФорма.ЛБ_ОтменаПереоформленияЗайма", ПараметрыФормы, ЭтаФорма.ВладелецФормы, Истина,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			Иначе	
			    ОткрытьФорму("ОбщаяФорма.ЛБ_ОтменаПереоформленияЗайма", ПараметрыФормы, ЭтаФорма, Истина,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			КонецЕсли;
			
			УстановитьВидимость();
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИнформациюОЗБ(ЗалоговыйБилет, Дата)
	
	Результат = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(ЗалоговыйБилет.НомерЗалоговогоБилета, Дата,, Истина);
	
	//+Мельников 06.05.24 Сделано на время тестирования. Убрать при запуске ломбардов.
	Если Результат = Неопределено Тогда
		ДатаПроверки = ТекущаяДата() + 94608000; // + три года к дате проверки документа
		Результат = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(ЗалоговыйБилет.НомерЗалоговогоБилета, ДатаПроверки,, Истина);
	КонецЕсли;
	//-Мельников

	ПоследняяОперация = Новый Структура;
	ПоследняяОперация.Вставить("Дата", Результат.Регистратор.Дата);
	ПоследняяОперация.Вставить("ВидОперации", Результат.Регистратор.ВидОперации);
	ПоследняяОперация.Вставить("ДокументОперации", Результат.Регистратор);
	
	Возврат ПоследняяОперация;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЛомбардПольвателя()
	Возврат ЛБ_ОбщийМодуль.ПолучитьЛомбардПользователя(ПараметрыСеанса.ТекущийПользователь);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЛомбардВдокументе(Ссылка)
	Возврат Ссылка.Ломбард;
КонецФункции

//+Мельников 31.07.24
&НаКлиенте
Процедура ПослеСозданияДокумента(Результат, Параметры) Экспорт
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ДокументОтмены = Результат.ДокументОтмены;
		Элементы.ОтменитьОперацию.Доступность = Ложь;
		Элементы.ГруппаОтмена.Видимость = Истина;
		Элементы.Расчеты.Доступность = Ложь;
		Элементы.Редактировать.Доступность = Ложь;
		Элементы.ДокументОтмены.Видимость = ?(ЗначениеЗаполнено(ДокументОтмены), Истина, Ложь);
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры

//+Мельников 13.08.24 Формирование списка проб по прейскуранту. Заявка 2677.
&НаСервере
Процедура ЗаполнитьСписокПроб()

	ЗапросДокумента = Новый Запрос;
	ЗапросДокумента.Текст = 
		//+Мельников 19.08.24 По каким то причинам показывал не срез последних, а все что были до указанной даты. Изменил запрос.
		//"ВЫБРАТЬ
		//|	ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних.Проба КАК Проба
		//|ИЗ
		//|	РегистрСведений.ЛБ_ПрейскурантЦенНаМеталлы.СрезПоследних(&Дата, Ломбард = &Ломбард) КАК ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних.Проба
		//|АВТОУПОРЯДОЧИВАНИЕ";
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ЛБ_ПрейскурантЦенНаМеталлы.СрезПоследних(&Дата, Ломбард = &Ломбард) КАК ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних.Период УБЫВ";
	
	ЗапросДокумента.УстановитьПараметр("Дата", ЭтотОбъект.ДатаДок);
	ЗапросДокумента.УстановитьПараметр("Ломбард", ЭтотОбъект.Ломбард);
	
	РезультатДокумент = ЗапросДокумента.Выполнить().Выбрать();

	Если РезультатДокумент.Следующий() Тогда
		
		ЗапросПроб = Новый Запрос;
		ЗапросПроб.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ПриказУсловияПредоставленияЗаймовЦеныМеталлы.Проба КАК Проба
		|ИЗ
		|	Документ.ЛБ_ПриказУсловияПредоставленияЗаймов.ЦеныМеталлы КАК ЛБ_ПриказУсловияПредоставленияЗаймовЦеныМеталлы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛБ_ПриказУсловияПредоставленияЗаймов КАК ЛБ_ПриказУсловияПредоставленияЗаймов
		|		ПО ЛБ_ПриказУсловияПредоставленияЗаймовЦеныМеталлы.Ссылка = ЛБ_ПриказУсловияПредоставленияЗаймов.Ссылка
		|ГДЕ
		|	ЛБ_ПриказУсловияПредоставленияЗаймов.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛБ_ПриказУсловияПредоставленияЗаймовЦеныМеталлы.Проба
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		ЗапросПроб.УстановитьПараметр("Ссылка", РезультатДокумент.Регистратор);
		
		Элементы.ТоварыПроба.СписокВыбора.Очистить();
		Элементы.ТоварыПроба.РежимВыбораИзСписка = Истина;
		Элементы.ТоварыПроба.СписокВыбора.ЗагрузитьЗначения(ЗапросПроб.Выполнить().Выгрузить().ВыгрузитьКолонку("Проба"));

		//+Мельников 19.08.24 По каким то причинам показывал не срез последних, а все что были до указанной даты. Изменил запрос.
		//Элементы.ТоварыПроба.СписокВыбора.Очистить();
		//Элементы.ТоварыПроба.РежимВыбораИзСписка = Истина;
		//Элементы.ТоварыПроба.СписокВыбора.ЗагрузитьЗначения(ЗапросДокумента.Выполнить().Выгрузить().ВыгрузитьКолонку("Проба"));
		
	КонецЕсли;
	
КонецПроцедуры

//+Мельников 23.08.24 Настройка работы с комплектующим. Заявка 2735.
&НаКлиенте
Процедура ПослеВыбораКомплектующего(Результат, ДопПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Если Не ЗначениеЗаполнено(Элементы.Вставки.ТекущиеДанные.ВидВставки) Тогда
			УдалитьСтрокуВставки(Элементы.Вставки.ТекущиеДанные.ПолучитьИдентификатор());
		КонецЕсли;
		Возврат;
	ИначеЕсли Результат = Ложь Тогда
		УдалитьСтрокуВставки(Элементы.Вставки.ТекущиеДанные.ПолучитьИдентификатор());
		Возврат;
	КонецЕсли;
	
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти       = Элементы.Вставки.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.ВидВставки = Результат.ВидВставки;
	//++ИВВ, 02.2026, вычеты для часов ч.2
	Если ПроверкаВидаКомплектующегоНика(Результат.ВидВставки) И Не ПроверкаНаличияЧМ(СтрокаТабличнойЧасти, 0) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 
			|'Для применения вычета на капсулу (для часов «Ника») необходимо вначале выбрать комплектующее «Часовой механизм».'"));
		
		СтрокаТабличнойЧастиТовары.СкидкаМеханизм = Ложь;
		СтрокаТабличнойЧастиТовары.РазмерСкидкиМеханизм = 0;
		СтрокаТабличнойЧасти.РазмерСкидкиМеханизм = 0;
		ПроверкаПослеУдаленияМеханизм();
		
		УдалитьСтрокуВставки(СтрокаТабличнойЧасти.ПолучитьИдентификатор());
		Возврат;
	КонецЕсли;
	
	Если ПроверкаВидаКомплектующегоМеханизм(Результат.ВидВставки) И ПроверкаНаличияЧМ(СтрокаТабличнойЧасти, 1) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 
			|'Комплектующее «Часовой механизм» уже добавлено на форму выдачи займа. Повторное добавление невозможно!'"));
		Если ПроверкаНаличияНика(СтрокаТабличнойЧасти, 0) Тогда
			СтрокаТабличнойЧастиТовары.СкидкаНика = Ложь;
			СтрокаТабличнойЧастиТовары.РазмерСкидкиНика = 0;
			СтрокаТабличнойЧасти.РазмерСкидкиНика = 0;
			ПроверкаПослеУдаленияНика();
		КонецЕсли;
		УдалитьСтрокуВставки(СтрокаТабличнойЧасти.ПолучитьИдентификатор());
		Возврат;
	КонецЕсли;
	
	Если ПроверкаВидаКомплектующегоНика(Результат.ВидВставки) И ПроверкаНаличияНика(СтрокаТабличнойЧасти, 1) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 
			|'Комплектующее «Ника, капсула» уже добавлено на форму выдачи займа. Повторное добавление невозможно!'"));
		УдалитьСтрокуВставки(СтрокаТабличнойЧасти.ПолучитьИдентификатор());
		Возврат;
	КонецЕсли;
	//--ИВВ
	
	//++ИВВ, 02.2026, вычеты для часов
	Если ПроверкаВидаКомплектующегоМеханизм(Результат.ВидВставки) Тогда
		Элементы.ТоварыСкидкаМеханизм.Видимость = Истина;
		Элементы.ТоварыСкидкаМеханизм.Доступность = Ложь;
		СтрокаТабличнойЧастиТовары.СкидкаМеханизм = Истина;
		СтрокаТабличнойЧастиТовары.РазмерСкидкиМеханизм = Результат.РазмерСкидки;
		СтрокаТабличнойЧасти.РазмерСкидкиМеханизм = Результат.РазмерСкидки;
		Элементы.ТоварыВес30.Доступность = Ложь;
		СтрокаТабличнойЧастиТовары.Вес30 = Ложь;
	ИначеЕсли ПроверкаВидаКомплектующегоНика(Результат.ВидВставки) Тогда
		Элементы.ТоварыСкидкаНика.Видимость = Истина;
		Элементы.ТоварыСкидкаНика.Доступность = Ложь;
		СтрокаТабличнойЧастиТовары.СкидкаНика = Истина;
		СтрокаТабличнойЧастиТовары.РазмерСкидкиНика = Результат.РазмерСкидки;
		СтрокаТабличнойЧасти.РазмерСкидкиНика = Результат.РазмерСкидки;
		Элементы.ТоварыВес30.Доступность = Ложь;
		СтрокаТабличнойЧастиТовары.Вес30 = Ложь;
	КонецЕсли;
	
	Если Не ПроверкаВидаКомплектующегоМеханизм(Результат.ВидВставки)
		И Не ПроверкаНаличияЧМ(СтрокаТабличнойЧасти, 0) Тогда	
		СтрокаТабличнойЧастиТовары.СкидкаМеханизм = Ложь;
		СтрокаТабличнойЧастиТовары.РазмерСкидкиМеханизм = 0;
		СтрокаТабличнойЧасти.РазмерСкидкиМеханизм = 0;
		ПроверкаПослеУдаленияМеханизм();
	КонецЕсли;
	
	Если Не ПроверкаВидаКомплектующегоНика(Результат.ВидВставки)
		И Не ПроверкаНаличияНика(СтрокаТабличнойЧасти, 0) Тогда
		СтрокаТабличнойЧастиТовары.СкидкаНика = Ложь;
		СтрокаТабличнойЧастиТовары.РазмерСкидкиНика = 0;
		СтрокаТабличнойЧасти.РазмерСкидкиНика = 0;
		ПроверкаПослеУдаленияНика();
	КонецЕсли;
	//--ИВВ

	Если СтрокаТабличнойЧасти.НеОценивать Тогда
		СтрокаТабличнойЧасти.Цена = 0;
		СтрокаТабличнойЧасти.Сумма = 0;
	КонецЕсли;
	
	Если СтрокаТабличнойЧастиТовары <> Неопределено Тогда
		ВесМ = СтрокаТабличнойЧастиТовары.Вес;
		Отбор = Новый структура;
		Отбор.Вставить("КлючСтроки", СтрокаТабличнойЧастиТовары.КлючСтроки);
		СтрокиДоп = ДополнительныеМеталлы.НайтиСтроки(Отбор); 
		Для каждого Стр Из СтрокиДоп Цикл
		    ВесМ = ВесМ - Стр.ВесЧистый;
		Конеццикла;
		СтруктураР = ПолучитьВесИСуммуВставокИзделия(СтрокаТабличнойЧастиТовары.КлючСтроки);

		//+Мельников 09.10.24 Скидка 30%. Заявка 2732.
		//Было: СтрокаТабличнойЧастиТовары.ВесЧистый = Цел((ВесМ - СтруктураР.Вес)*100)/100; 
		//++ИВВ 02.2026, вычеты для часов
		//было:
		//СтрокаТабличнойЧастиТовары.ВесЧистый = ?(СтрокаТабличнойЧастиТовары.Вес30, Цел(((ВесМ - СтруктураР.Вес)*0.7)*100)/100, Цел((ВесМ - СтруктураР.Вес)*100)/100);
		//-Мельников
		//стало:
		Если СтрокаТабличнойЧастиТовары.Вес30 Тогда
			СтрокаТабличнойЧастиТовары.ВесЧистый = Цел(((ВесМ - СтруктураР.Вес)*0.7)*100)/100;
		ИначеЕсли СтрокаТабличнойЧастиТовары.СкидкаМеханизм И Не СтрокаТабличнойЧастиТовары.СкидкаНика Тогда
			СтрокаТабличнойЧастиТовары.ВесЧистый = (ВесМ - СтруктураР.Вес)*(СтрокаТабличнойЧастиТовары.РазмерСкидкиМеханизм/100);
		ИначеЕсли СтрокаТабличнойЧастиТовары.СкидкаМеханизм И СтрокаТабличнойЧастиТовары.СкидкаНика Тогда
			СтрокаТабличнойЧастиТовары.ВесЧистый = (((ВесМ - СтруктураР.Вес)*(СтрокаТабличнойЧастиТовары.РазмерСкидкиМеханизм/100))
				* (100 - СтрокаТабличнойЧастиТовары.РазмерСкидкиНика)) / 100;
		Иначе
			СтрокаТабличнойЧастиТовары.ВесЧистый = ВесМ - СтруктураР.Вес;
		КонецЕсли;
		//--ИВВ

		СтрокаТабличнойЧастиТовары.СуммаОценкиКамни = СтруктураР.Сумма;
		ПересчитатьСуммТовары();
	КонецЕсли;	                        
	ОбновитьДанныеВставки(); 
	//+МАН 22.10.24 Исправление подвала вставок. Заявка 2735
	//Было: ВставкиИтоги();
	ВставкиИтогиНаКлиенте();
	//-МАН
	ОбновитьДанныеТовары();
	ЭтаФорма.ТекущийЭлемент = Элементы["ВставкиВидВставки"];
КонецПроцедуры 

//+МАН 22.10.24 Исправление подвала вставок. Старое расчитывало по всем вставкам, без учета ОЗ. Заявка 2735
&НаКлиенте
Процедура ВставкиИтогиНаКлиенте()
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	
	Если СтрокаТабличнойЧастиТовары <> Неопределено Тогда
		СтруктураР = ПолучитьВесИСуммуВставокИзделия(СтрокаТабличнойЧастиТовары.КлючСтроки);

		ВставкиИтогКоличество = СтруктураР.Количество;
		ВставкиИтогВесК = СтруктураР.ВесКарат;
		ВставкиИтогВесГ = СтруктураР.Вес;
		ВставкиИтогОценка = СтруктураР.Сумма;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДопМеталлыИтогиНаКлиенте()
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	
	Если СтрокаТабличнойЧастиТовары <> Неопределено Тогда
		СтруктураР = ПолучитьВесИСуммуВставокИзделия(СтрокаТабличнойЧастиТовары.КлючСтроки);

		ДополнительныеМеталлыИтогВес = СтруктураР.ВесДопМеталлов;
		ДополнительныеМеталлыИтогОценка = СтруктураР.СуммаДопМеталлов;
	КонецЕсли;
КонецПроцедуры

//+Мельников 09.10.24 Скидка 30%. Заявка 2732.
&НаКлиенте
Процедура ТоварыВес30ПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти.Вес <> 0 Тогда
		ВесМ = СтрокаТабличнойЧасти.Вес;    	
		СтруктураР = ПолучитьВесИСуммуВставокИзделия(СтрокаТабличнойЧасти.КлючСтроки);
		ВесМ = Цел((ВесМ - СтруктураР.Вес)*100)/100;
		
		ОтборДоп = Новый Структура;
		ОтборДоп.Вставить("КлючСтроки", СтрокаТабличнойЧасти.КлючСтроки); 
		
		ВесДоп = 0;
		СтрокиДоп = ДополнительныеМеталлы.НайтиСтроки(ОтборДоп);    
		Для каждого СтрДоп Из СтрокиДоп Цикл
			ВесДоп = ВесДоп + СтрДоп.ВесЧистый;
		Конеццикла;   
		ВесМ = ?(СтрокаТабличнойЧасти.Вес30, Цел(((ВесМ - ВесДоп) * 0.7)*100)/100, ВесМ - ВесДоп);
		
		СтрокаТабличнойЧасти.ВесЧистый = ВесМ;
	КонецЕсли;
КонецПроцедуры

//+МАН 25.04.25 Выделение цветом. Заявка 2956
&НаКлиенте
Процедура ТоварыКлеймоПриИзменении(Элемент)
	Если Элементы.Товары.ТекущиеДанные.Клеймо = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыКлейм.ЕстьФальшь")
		ИЛИ Элементы.Товары.ТекущиеДанные.Клеймо = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыКлейм.Нет") Тогда
		
		Элементы.ТоварыКлеймо.ЦветТекста = Новый Цвет(255,0,0); //Красный
	Иначе
		Элементы.ТоварыКлеймо.ЦветТекста = Новый Цвет(51,51,51); //Черный
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьДокументОтмены(Ссылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&Период, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
		|ГДЕ
		|	ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент В(&ЗБ)";
	
	Запрос.УстановитьПараметр("ЗБ", Ссылка);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Регистратор;
	КонецЕсли;
	
	Возврат Документы.ЛБ_ОперацияПоЗалогу.ПустаяСсылка();
	
КонецФункции
//-Мельников

&НаКлиенте
Процедура ВставкиПередУдалением(Элемент, Отказ)
	//++ИВВ, 02.2026, вычеты для часов
	Если ПроверкаВидаКомплектующегоМеханизм(Элемент.ТекущиеДанные.ВидВставки) Тогда
		СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
		СтрокаТабличнойЧастиТовары.СкидкаМеханизм = Ложь;
		СтрокаТабличнойЧастиТовары.РазмерСкидкиМеханизм = 0;
		Элемент.ТекущиеДанные.РазмерСкидкиМеханизм = 0;
		ПослеУдаленияЧМ(Элемент.ТекущиеДанные)
	КонецЕсли;
	  
	Если ПроверкаВидаКомплектующегоНика(Элемент.ТекущиеДанные.ВидВставки) Тогда
		СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
		СтрокаТабличнойЧастиТовары.СкидкаНика = Ложь;
		СтрокаТабличнойЧастиТовары.РазмерСкидкиНика = 0;
		Элемент.ТекущиеДанные.РазмерСкидкиНика = 0;
	КонецЕсли;
	//--ИВВ
КонецПроцедуры

Функция ПроверкаВидаКомплектующегоМеханизм(ВидКомплектующего)
	
	Если ВидКомплектующего = Справочники.ЛБ_Настройки.ПолучитьЗначениеСправочника("ВидыКомплектующихДляВычета").ЧасовойМеханизм Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПроверкаВидаКомплектующегоНика(ВидКомплектующего)
	
	Если ВидКомплектующего = Справочники.ЛБ_Настройки.ПолучитьЗначениеСправочника("ВидыКомплектующихДляВычета").НикаКапсула Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции 

&НаКлиенте
Процедура ПроверкаПослеУдаленияНика()

	Для Каждого ТекущаяСтрока Из Вставки Цикл
		Если ПроверкаВидаКомплектующегоНика(ТекущаяСтрока.ВидВставки) Тогда
			Возврат;
		КонецЕсли;	
	КонецЦикла;
	
	Элементы.ТоварыСкидкаНика.Видимость = Ложь;
	Элементы.ТоварыСкидкаНика.Доступность = Истина;
	Элементы.ТоварыВес30.Доступность = Истина;	

КонецПроцедуры

&НаКлиенте
Процедура ПроверкаПослеУдаленияМеханизм()

	Для Каждого ТекущаяСтрока Из Вставки Цикл
		Если ПроверкаВидаКомплектующегоМеханизм(ТекущаяСтрока.ВидВставки) Тогда
			Возврат;
		КонецЕсли;	
	КонецЦикла;
	
	Элементы.ТоварыСкидкаМеханизм.Видимость = Ложь;
	Элементы.ТоварыСкидкаМеханизм.Доступность = Истина;
	Элементы.ТоварыВес30.Доступность = Истина;	

КонецПроцедуры

&НаСервере
Процедура ПроверкаВставокПриОткрытииМеханизм()

	Для Каждого ТекущаяСтрока Из Вставки Цикл
		Если ПроверкаВидаКомплектующегоМеханизм(ТекущаяСтрока.ВидВставки) Тогда
			Элементы.ТоварыСкидкаМеханизм.Видимость = Истина;
			Элементы.ТоварыСкидкаМеханизм.Доступность = Ложь;
			Элементы.ТоварыВес30.Доступность = Ложь;
			Прервать;
		КонецЕсли;	
	КонецЦикла;			

КонецПроцедуры

&НаСервере
Процедура ПроверкаВставокПриОткрытииНика()

	Для Каждого ТекущаяСтрока Из Вставки Цикл
		Если ПроверкаВидаКомплектующегоНика(ТекущаяСтрока.ВидВставки) Тогда
			Элементы.ТоварыСкидкаНика.Видимость = Истина;
			Элементы.ТоварыСкидкаНика.Доступность = Ложь;
			Элементы.ТоварыВес30.Доступность = Ложь;
			Прервать;
		КонецЕсли;	
	КонецЦикла;			

КонецПроцедуры

&НаКлиенте
Функция ПроверкаНаличияЧМ(СтрокаТабличнойЧасти, Количество)
	
	СтруктураОтбора = Новый Структура("КлючСтроки, ВидВставки", СтрокаТабличнойЧасти.КлючСтроки, ПолучитьВидКомплектующегоМеханизм());
	РезультатОтбораВставки = Вставки.НайтиСтроки(СтруктураОтбора);
	
	Если РезультатОтбораВставки.Количество() > Количество Тогда
		Возврат Истина;	
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция ПроверкаНаличияНика(СтрокаТабличнойЧасти, Количество)
	
	СтруктураОтбора = Новый Структура("КлючСтроки, ВидВставки", СтрокаТабличнойЧасти.КлючСтроки, ПолучитьВидКомплектующегоНика());
	РезультатОтбораВставки = Вставки.НайтиСтроки(СтруктураОтбора);
	
	Если РезультатОтбораВставки.Количество() > Количество Тогда
		Возврат Истина;	
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

&НаСервере
Функция ПолучитьВидКомплектующегоМеханизм()
	
	Возврат Справочники.ЛБ_Настройки.ПолучитьЗначениеСправочника("ВидыКомплектующихДляВычета").ЧасовойМеханизм;
	
КонецФункции

&НаСервере
Функция ПолучитьВидКомплектующегоНика()
	
	Возврат Справочники.ЛБ_Настройки.ПолучитьЗначениеСправочника("ВидыКомплектующихДляВычета").НикаКапсула;
	
КонецФункции

&НаКлиенте
Процедура ПослеУдаленияЧМ(СтрокаТабличнойЧасти)
	
	СтруктураОтбора = Новый Структура("КлючСтроки", СтрокаТабличнойЧасти.КлючСтроки);
	РезультатОтбораВставки = Вставки.НайтиСтроки(СтруктураОтбора);
	МассивКУдалению = Новый Массив;
	Для Каждого ТекущаяСтрока Из РезультатОтбораВставки Цикл
		Если ПроверкаВидаКомплектующегоНика(ТекущаяСтрока.ВидВставки) Тогда
			МассивКУдалению.Добавить(ТекущаяСтрока);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекущаяСтрока Из МассивКУдалению Цикл
		Вставки.Удалить(Вставки.Индекс(ТекущаяСтрока));
	КонецЦикла;
	
КонецПроцедуры




