
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ЗалоговыйБилет") Тогда
		ЗалоговыйБилет = Параметры.ЗалоговыйБилет; 
		ЭтаФорма.Заголовок = "Дополнительные соглашения к ЗБ № " + СокрЛП(ЗалоговыйБилет.НомерЗалоговогоБилета) + " клиент " + ЛБ_ОбщийМодуль.ПолучитьФИО(ЗалоговыйБилет.Залогодатель);		
		ЗаполнитьТаблицуДопСоглашений();
	Иначе     
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьДокументОтмены(Ссылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&Период, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
		|ГДЕ
		|	ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент В(&ЗБ)";
	
	Запрос.УстановитьПараметр("ЗБ", Ссылка);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция  ПолучитьНачислениеОплатуЗБ(Дата)
	Запрос = новый Запрос; 
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст ="ВЫБРАТЬ
	              |	ЛБ_РасчетыСКлиентамиОбороты.ВидРасчета КАК ВидРасчета,
	              |	СУММА(ЛБ_РасчетыСКлиентамиОбороты.СуммаПриход) КАК Начислено,
	              |	СУММА(ЛБ_РасчетыСКлиентамиОбороты.СуммаРасход) КАК Оплачено
	              |ИЗ
	              |	РегистрНакопления.ЛБ_РасчетыСКлиентами.Обороты(, &Дата, , ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_РасчетыСКлиентамиОбороты
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	ЛБ_РасчетыСКлиентамиОбороты.ВидРасчета"; 
	Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции 

&НаСервере
Процедура ЗаполнитьТаблицуДопСоглашений()
    Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилета.Регистратор КАК ДокументОплаты,
	               |	ЛБ_СостояниеЗалоговогоБилета.НомерДопСоглашения КАК НомерДС
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета КАК ЛБ_СостояниеЗалоговогоБилета
	               |ГДЕ
	               |	ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет = &ЗалоговыйБилет
	               |	И ЛБ_СостояниеЗалоговогоБилета.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
	               |	И ЛБ_СостояниеЗалоговогоБилета.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов)";  
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	НомерДС = 0; 
	Для каждого стр Из ТаблицаЗапроса цикл 
		Если ПолучитьДокументОтмены(стр.ДокументОплаты) Тогда
			Продолжить;
		КонецЕсли;	
		Если НЕ НомерДС = Стр.НомерДС Тогда
			НомерДС = Стр.НомерДС; 
			НоваяСтр = ТаблицаДопСоглашений.Добавить(); 
			НоваяСтр.ДокументОплаты = Стр.ДокументОплаты; 
			НоваяСтр.НомерДС = Стр.НомерДС; 
			НоваяСтр.ДатаОплаты = Стр.ДокументОплаты.Дата; 
			НоваяСтр.СуммаОплаты = Стр.ДокументОплаты.СуммаОплаты;  
			НоваяСтр.СуммаОплатыСсуда = Стр.ДокументОплаты.СуммаОплатыСсуда;
            НоваяСтр.СуммаОплатыПроценты = Стр.ДокументОплаты.СуммаОплатыПроценты;
			
			ТаблицаОплат = ПолучитьНачислениеОплатуЗБ(НоваяСтр.ДатаОплаты);
			НачисленоПроценты = 0; 
			ОплаченоПроценты = 0;

			Отбор = Новый Структура;
			Отбор.Вставить("ВидРасчета", Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам);
			Строки = ТаблицаОплат.Найтистроки(Отбор);
			Если НЕ Строки.Количество() = 0 Тогда 
				Стр = строки.получить(0);
				НачисленоПроценты = Стр.Начислено; 
				ОплаченоПроценты = Стр.Оплачено;
			КонецЕсли;	
						
			ОплаченоЗайм = 0;

			Отбор = Новый Структура;
			Отбор.Вставить("ВидРасчета", Перечисления.ЛБ_ВидыРасчетов.ПоОсновномуДолгу);
			Строки = ТаблицаОплат.Найтистроки(Отбор);
			Если НЕ Строки.Количество() = 0 Тогда 
				Стр = строки.получить(0);
				ОплаченоЗайм = Стр.Оплачено;
			КонецЕсли;	

            НоваяСтр.ДолгЗайм  = ЗалоговыйБилет.СуммаСсуды - ОплаченоЗайм; 
			НоваяСтр.ДолгПроценты = НачисленоПроценты - ОплаченоПроценты;
		КонецЕсли;	
	КонецЦикла; 
	ТаблицаДопСоглашений.Сортировать("ДатаОплаты Убыв");
КонецПроцедуры

&НаКлиенте
Процедура ПечатьДС(Команда)    
	ТекСтрока = Элементы.ТаблицаДопСоглашений.ТекущиеДанные;
	Если НЕ ТекСтрока  = неопределено Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ИменаМакетов", "ДополнительноеСоглашение"); 
		ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_ОперацияПоЗалогу");
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(ТекСтрока.ДокументОплаты);
		ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
		ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,); 
	КонецЕсли;	
КонецПроцедуры
