
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьОграничениеТипа();
	УстановитьВидимостьДоступность(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЗначенияПриИзменении(Элемент)
	УстановитьОграничениеТипа();
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеВСпискеПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры  

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ЗначениеВСписке Тогда
	    Объект.Значение = Неопределено;
	Иначе	
	    Объект.СписокЗначений.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	Элементы.СписокЗначений.Видимость 	= Объект.ЗначениеВСписке;
	Элементы.Значение.Видимость 		= Не Объект.ЗначениеВСписке;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОграничениеТипа()
	
	Элементы.СписокЗначенийЗначение.ОграничениеТипа		 = Объект.ТипЗначения;
	Элементы.СписокЗначенийЗначение.ВыборГруппИЭлементов = ГруппыИЭлементы.ГруппыИЭлементы;
	
	Элементы.Значение.ОграничениеТипа	   = Объект.ТипЗначения;
	Элементы.Значение.ВыборГруппИЭлементов = ГруппыИЭлементы.ГруппыИЭлементы;
	
КонецПроцедуры


