&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Пользователь = Пользователи.ТекущийПользователь();
	//Савранин - перенес функционал в обработку "ЛБ_АвторизацияВЛомбарде"
	Если Объект.Пользователь.ЭтоЛомбард Тогда
		Отказ = Истина;
	КонецЕсли;		
	
    Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Пользователь", Объект.Пользователь);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ТекущийЛомбардПользователя.Ломбард КАК Ломбард
	               |ИЗ
	               |	РегистрСведений.ЛБ_ТекущийЛомбардПользователя КАК ЛБ_ТекущийЛомбардПользователя
	               |ГДЕ
	               |	ЛБ_ТекущийЛомбардПользователя.Пользователь = &Пользователь"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Объект.Ломбард = Выборка.Ломбард;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	МенеджерЗаписи = РегистрыСведений.ЛБ_ТекущийЛомбардПользователя.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Пользователь = Объект.Пользователь;
	МенеджерЗаписи.Ломбард = Объект.Ломбард;

	МенеджерЗаписи.Записать();  
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЛомбард(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ломбард) Тогда
		Сообщить("Не выбран ломбард!");
	Иначе	
	    ЗаписатьНаСервере();
		Этаформа.Закрыть();
	КонецЕсли;
КонецПроцедуры

