///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОписаниеПеременных

//{{MRG[ <-> ]
// СтандартныеПодсистемы
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//// ПодключаемоеОборудование
//}}MRG[ <-> ]

// Хранилище глобальных переменных.
//
// ПараметрыПриложения - Соответствие Из КлючЗначение:
//   * Ключ - Строка - имя переменной в формате "ИмяБиблиотеки.ИмяПеременной";
//   * Значение - Произвольный - значение переменной.
//
// Пример инициализации:
//   ИмяПараметра = "СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации";
//   Если ПараметрыПриложения[ИмяПараметра] = Неопределено Тогда
//     ПараметрыПриложения.Вставить(ИмяПараметра, Новый СписокЗначений);
//   КонецЕсли;
//  
// Пример использования:
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"].Добавить(...);
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"] = ...;
Перем ПараметрыПриложения Экспорт;
//{{MRG[ <-> ]
//// Конец ПодключаемоеОборудование
//}}MRG[ <-> ]
// Конец СтандартныеПодсистемы

#КонецОбласти

//{{MRG[ <-> ]
//#Область ОбработчикиСобытий
//}}MRG[ <-> ]

#Область ОбработчикиСобытий

//{{MRG[ <-> ]
Процедура ПередНачаломРаботыСистемы()
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//Процедура ПередНачаломРаботыСистемы(Отказ)
//}}MRG[ <-> ]
	
//{{MRG[ <-> ]
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПередНачаломРаботыСистемы();
	// Конец СтандартныеПодсистемы
//}}MRG[ <-> ]
//{{MRG[ <-> ]
	// ПодключаемоеОборудование
	//ИнтеграцияПодсистемБПОКлиент.ПередНачаломРаботыСистемы();
	// Конец ПодключаемоеОборудование
//}}MRG[ <-> ]
	
	// ИнтернетПоддержкаПользователей
	ИнтернетПоддержкаПользователейКлиент.ПередНачаломРаботыСистемы();
	// Конец ИнтернетПоддержкаПользователей
	
	//+МАН 18.03.26 Заявка 3750
	Если ЛБ_УправлениеДоступом.ЕстьРоль("ЛБ_ЭтоЛомбард") Тогда
		КлиентскоеПриложение.УстановитьРежимОсновногоОкна(РежимОсновногоОкнаКлиентскогоПриложения.РабочееМесто);
	КонецЕсли;
	//-МАН
	
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
	
//{{MRG[ <-> ]
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПриНачалеРаботыСистемы();
	// Конец СтандартныеПодсистемы
//}}MRG[ <-> ]
//{{MRG[ <-> ]
	// ПодключаемоеОборудование
	//ИнтеграцияПодсистемБПОКлиент.ПриНачалеРаботыСистемы();
	// Конец ПодключаемоеОборудование
//}}MRG[ <-> ]
	
	//лб - н
	//ОткрытьФорму("Обработка.ЛБ_ВыбратьЛомбард.Форма"); 
		
	ОткрытьФорму("Обработка.ЛБ_АвторизацияВЛомбарде.Форма");

	//лб - к
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
	
//{{MRG[ <-> ]
	// СтандартныеПодсистемы
//}}MRG[ <-> ]
//{{MRG[ <-> ]
	ИнтеграцияПодсистемБПОКлиент.ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения);
//}}MRG[ <-> ]
	СтандартныеПодсистемыКлиент.ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения);
	// Конец СтандартныеПодсистемы
	
КонецПроцедуры

Процедура ОбработкаПолученияФормыВыбораПользователейСистемыВзаимодействия(НазначениеВыбора, Форма, ИдентификаторОбсуждения, Параметры, ВыбраннаяФорма, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Обсуждения
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Обсуждения") Тогда
	
		МодульОбсужденияСлужебныйКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОбсужденияСлужебныйКлиент");
		МодульОбсужденияСлужебныйКлиент.ПриПолученииФормыВыбораПользователейСистемыВзаимодействия(НазначениеВыбора, Форма, ИдентификаторОбсуждения, Параметры, ВыбраннаяФорма, СтандартнаяОбработка);
	
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Обсуждения
		
КонецПроцедуры

Процедура ОбработкаВнешнегоСобытия(Источник, Событие, Данные)

	// ПодключаемоеОборудование
	ИнтеграцияПодсистемБПОКлиент.ОбработкаВнешнегоСобытия(Источник, Событие, Данные);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

#КонецОбласти
