
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РасходнаяНакладная") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "РасходнаяНакладная",  "Накладная на внутреннее перемещение", 
		ПечатьРасходнойНакладной(МассивОбъектов, ОбъектыПечати), , "Документ.ЛБ_РасходОтходовДМ.НакладнаяПеремещенияОтходов");
	КонецЕсли;

КонецПроцедуры  

Функция ПечатьРасходнойНакладной(МассивОбъектов, ОбъектыПечати)
	УстановитьПривилегированныйРежим(Истина);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб			= Истина;
	ТабДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
    ТабДокумент.ТолькоПросмотр = Истина;
	
	Док = МассивОбъектов[0];

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЛБ_РасходОтходовДМ.НакладнаяПеремещенияОтходов");

	НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;

	ОбластьМакета = Макет.ПолучитьОбласть("Документ");
	ОбластьМакета.Параметры.Номер = Док.НомерДокумента;
	ОбластьМакета.Параметры.Дата = Формат(Док.Дата, "ДФ=dd.MM.yyyy");
	ОбластьМакета.Параметры.Вес = Формат(Док.ВесБезТары, "ЧДЦ=2");
	ОбластьМакета.Параметры.Сотрудник = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Док.Инкассатор.ФизическоеЛицо.Наименование); //Док.Инкассатор;
	ОбластьМакета.Параметры.Должность = Док.Инкассатор.Должность;
	ОбластьМакета.Параметры.Отправитель = Док.Ломбард;
	ОбластьМакета.Параметры.Получатель = Док.Получатель;
	ОбластьМакета.Параметры.ОтпустилДолжность = Док.Ответственный.Должность;
	ОбластьМакета.Параметры.ОтпустилСотрудник = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Док.Ответственный.ФизическоеЛицо.Наименование);
	ТабДокумент.Вывести(ОбластьМакета);

	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, Док);
			
	Возврат ТабДокумент;

КонецФункции