
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Разделитель = "/";
	Длина = СтрДлина(ЭтотОбъект.Номер);
	РазделительВСтроке = СтрНайти(ЭтотОбъект.Номер, Разделитель);
	
	Если РазделительВСтроке > 0 Тогда
		НомерЛ = Лев(ЭтотОбъект.Номер, РазделительВСтроке - 1);
		НомерД = Прав(ЭтотОбъект.Номер, Длина - РазделительВСтроке);
		
		НомерЛБезНулей = СтроковыеФункцииКлиентСервер.УдалитьПовторяющиесяСимволы(НомерЛ, "0");
		НомерДБезНулей = СтроковыеФункцииКлиентСервер.УдалитьПовторяющиесяСимволы(НомерД, "0");
		
		Если ЭтотОбъект.Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис Тогда
			ЭтотОбъект.НомерДокумента = НомерДБезНулей;
		Иначе
			ЭтотОбъект.НомерДокумента = НомерЛБезНулей + Разделитель + НомерДБезНулей;
		КонецЕсли;
		
		ЭтотОбъект.Записать();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.НомерНакладной) Тогда
		ЭтотОбъект.НомерНакладной = ЭтотОбъект.НомерДокумента;
		ЭтотОбъект.Записать();
	КонецЕсли;
	
	Движения.ЛБ_ДвижениеОтходов.Записывать = Истина;

	Движение = Движения.ЛБ_ДвижениеОтходов.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Ломбард = ЭтотОбъект.Ломбард;
	Движение.ВесНетто = ЭтотОбъект.ВесБезТары;
	Движение.Организация = ЭтотОбъект.Организация;
	Движение.Период = ЭтотОбъект.Дата;
	//+МАН 17.12.25
	Движение.Склад = ЭтотОбъект.Склад;
	Движение.ЛомбардПолучатель = ЭтотОбъект.Получатель;
	Движение.СкладПолучатель = ЭтотОбъект.СкладПолучатель;
	
	Движения.ЛБ_ОтходыДМВПути.Записывать = Истина;
	
	Движение = Движения.ЛБ_ОтходыДМВПути.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Организация = ЭтотОбъект.Организация;
	Движение.ЛомбардОтправитель = ЭтотОбъект.Ломбард;
	Движение.СкладОтправитель = ЭтотОбъект.Склад;
	Движение.ЛомбардПолучатель = ЭтотОбъект.Получатель;
	Движение.СкладПолучатель = ЭтотОбъект.СкладПолучатель;
	Движение.ВесНетто = ЭтотОбъект.ВесБезТары;
	Движение.Период = ЭтотОбъект.Дата;
	Движение.ДокументПеремещения = ЭтотОбъект.Ссылка;
	//-МАН
	
КонецПроцедуры
