
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ РольДоступна("Администрирование") И НЕ РольДоступна("АдминистраторСистемы") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;	

	РольДоступнаПолныеПрава  		= РольДоступна("ПолныеПрава");
	//РольДоступнаПриемщикЛомбарда 	= РольДоступна("ПриемщикЛомбарда");
	//РольДоступнаяРучнойВыборКатЗал  = РольДоступна("ЮС_РучнойВыборКатегорииЗалогодателя"); 
		
	ДатаДок = ?(НЕ ЗначениеЗаполнено(Объект.Ссылка), ТекущаяДата(), Объект.Дата);  
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог ИЛИ Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда
			Объект.НомерЗалоговогоБилета = "";
		КонецЕсли;  
		ФИО = Объект.Залогодатель.Наименование;
		ИнформацияОДокументеВСтроку();	
		КонтактнаяИнформацияВСтроку();
		ЗаполнитьКонтакнуюИнформациюПредставителя();
		КонтактнаяИнформацияПредставителяВСтроку();
		Объект.Дата = ДатаДок;
		Объект.ОтветственныйПользователь = ПараметрыСеанса.ТекущийПользователь; //Пользователи.ТекущийПользователь(); 
		Объект.ОтветственныйСотрудник    = ПараметрыСеанса.ТекущийСотрудник;
		Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог ИЛИ Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда
			ПричинаПримененияПроцентнойСхемы = Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма;
		ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов Тогда	
			ПричинаПримененияПроцентнойСхемы = ЛБ_УправлениеЛомбардом.ПолучитьПричинуПримененияПроцентнойСхемы(Объект, Объект.ПредыдущаяОперация); 
		КонецЕсли;                          
		Если ЗначениеЗаполнено(Объект.ПредыдущаяОперация) Тогда 
			Объект.СтатусЗалогодателя = ПолучитьТекущийСтатусКлиента(ДатаДок, Объект.ПредыдущаяОперация.Залогодатель);
		Иначе	
		    Объект.СтатусЗалогодателя = ПолучитьТекущийСтатусКлиента(ДатаДок, Объект.Залогодатель);
		КонецЕсли;	
  	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если Параметры.Свойство("ВидОперации") Тогда
			Объект.ВидОперации = Параметры.ВидОперации;
		КонецЕсли;  
		
		Объект.Дата = ДатаДок;
		Объект.ОтветственныйПользователь = ПараметрыСеанса.ТекущийПользователь; //Пользователи.ТекущийПользователь(); 
		Объект.ОтветственныйСотрудник    = ПараметрыСеанса.ТекущийСотрудник; 
		Объект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить();
	    //Объект.СхемаКредитования = Константы.ЛБ_ОсновнаяСхемаКредитования.Получить();  
		Объект.Ломбард = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя(); 														       
		//Объект.СтатусЗалогодателя = ПолучитьТекущийСтатусКлиента(ДатаДок, Объект.ПредыдущаяОперация.Залогодатель); 
		//ОбработатьСхемуКредитованияНаСервере(ДатаДок); 
		//РасчетСуммыОценкиИтоговой(); 			
		
		Если Параметры.Свойство("ПредыдущаяОперация") Тогда  
			Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление ИЛИ Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаЗалога Тогда
				ПричинаПримененияПроцентнойСхемы = Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма;
			ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов Тогда	
				ПричинаПримененияПроцентнойСхемы = ЛБ_УправлениеЛомбардом.ПолучитьПричинуПримененияПроцентнойСхемы(Объект, Объект.ПредыдущаяОперация); 
			КонецЕсли; 	

			Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов Тогда
				ЗаполнитьЗначенияСвойств(Объект, Параметры.ПредыдущаяОперация, , "Ссылка, Номер, Дата, ВидОперации, Ломбард, ОтветственныйСотрудник, ОтветственныйПользователь, Товары, Вставки, ДополнительныеМеталлы, ДополнительныеДокументыПравоПребыванияРФ, Дефекты, ПроцентныеСтавкиПоПериодам, ГрафикПлатежей, НачислениеПроцентовДетально, ТоварыИзъятыеВозвращенные");
				Объект.Товары.Загрузить(Параметры.ПредыдущаяОперация.Товары.Выгрузить());
				Объект.Вставки.Загрузить(Параметры.ПредыдущаяОперация.Вставки.Выгрузить());
	            Объект.ДополнительныеМеталлы.Загрузить(Параметры.ПредыдущаяОперация.ДополнительныеМеталлы.Выгрузить());
	            Объект.ДополнительныеДокументыПравоПребыванияРФ.Загрузить(Параметры.ПредыдущаяОперация.ДополнительныеДокументыПравоПребыванияРФ.Выгрузить()); 
				Объект.Дефекты.Загрузить(Параметры.ПредыдущаяОперация.Дефекты.Выгрузить());
				Объект.ПредыдущаяОперация = Параметры.ПредыдущаяОперация; 
				Объект.Ломбард = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();
				Если  Параметры.Свойство("Плательщик") Тогда 
					Если НЕ Параметры.Плательщик = Объект.Залогодатель Тогда
						Объект.Залогодатель = Параметры.Плательщик; 						   					
						ЗаполнитьСписокВыбораДоверенностейПлательщика();
						Если Элементы.ДоверенностьПлательщикаПолучателя.СписокВыбора.Количество() = 1 Тогда 
							Объект.ДоверенностьПредставителя = Элементы.ДоверенностьПлательщикаПолучателя.СписокВыбора.Получить(0).Значение;
							ЗаполнитьТекстДоверенности(ДоверенностьПлательщикаПолучателя);
						КонецЕсли;	
					КонецЕсли; 
					ЗаполнитьКонтакнуюИнформациюЗалогодателя(); 
				КонецЕсли;	 
				Если  Параметры.Свойство("Доверенность") Тогда 
					Объект.ДоверенностьПредставителя = Параметры.Доверенность; 
				КонецЕсли;
				Если Параметры.Свойство("ДокументЗалогодателя") Тогда
		             Объект.ДокументЗалогодателя = Параметры.ДокументЗалогодателя; 
					 ЗаполнитьИнформациюОДокументеЗалогодателя();
			    КонецЕсли;	
				ФИО = Объект.Залогодатель.Наименование;			
				КонтактнаяИнформацияВСтроку();
	            ИнформацияОДокументеВСтроку(); 
				Объект.СтатусЗалогодателя = ПолучитьТекущийСтатусКлиента(ДатаДок, Объект.ПредыдущаяОперация.Залогодатель); 
			ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда 
				ПлательщикПереоформление = Параметры.Плательщик;
				ДоверенностьПлательщикаПереоформление = Параметры.ДоверенностьПлательщика;
				Объект.Товары.Загрузить(Параметры.ПредыдущаяОперация.Товары.Выгрузить());
				Объект.Вставки.Загрузить(Параметры.ПредыдущаяОперация.Вставки.Выгрузить());
	            Объект.ДополнительныеМеталлы.Загрузить(Параметры.ПредыдущаяОперация.ДополнительныеМеталлы.Выгрузить()); 				
				Объект.ПредыдущаяОперация = Параметры.ПредыдущаяОперация; 				
				
				// ++ Сербаев 22.06.2023
				Объект.СтатусЗалогодателя = ПолучитьТекущийСтатусКлиента(ДатаДок, Объект.ПредыдущаяОперация.Залогодатель);
                // -- Сербаев 22.06.2023
				
				Если Параметры.Свойство("Залогодатель") Тогда
					Объект.Залогодатель = Параметры.Залогодатель;
					Объект.Фамилия = Объект.Залогодатель.Фамилия;
					Объект.Имя = Объект.Залогодатель.Имя;
					Объект.Отчество = Объект.Залогодатель.Отчество;
					ФИО = Объект.Залогодатель.Наименование;
					ЗаполнитьИнфорациюОЗалогодателе(Параметры);
					Если НЕ ЗначениеЗаполнено(Объект.ДокументЗалогодателя) Тогда 
						ОсновнойДУЛ = ЛБ_ОбщийМодуль.ПроверитьЕстьОсновнойДУЛ(Объект.Залогодатель);
						Если НЕ ОсновнойДУЛ = неопределено Тогда
							Объект.ДокументЗалогодателя = ОсновнойДУЛ;
							ЗаполнитьИнформациюОДокументеЗалогодателя();
							ИнформацияОДокументеВСтроку();
						КонецЕсли;	
					КонецЕсли;																		
				КонецЕсли;								
				Если Параметры.Свойство("Представитель") Тогда
					Объект.Представитель = Параметры.Представитель;
					Объект.ФамилияПредставителя = Объект.Представитель.Фамилия;
					Объект.ИмяПредставителя = Объект.Представитель.Имя;
					Объект.ОтчествоПредставителя = Объект.Представитель.Отчество;
					ФИОПредставителя = Объект.Представитель.Наименование;
					ОчиститьДокументыПредставителя();   
					ОсновнойДУЛПредставителя = ЛБ_ОбщийМодуль.ПроверитьЕстьОсновнойДУЛ(Объект.Представитель);
					Если НЕ ОсновнойДУЛПредставителя = неопределено Тогда
						Объект.ДокументПредставителя = ОсновнойДУЛПредставителя;
						ЗаполнитьИнформациюОДокументеПредставителя();
						ИнформацияОДокументеПредставителяВСтроку();
					КонецЕсли;	
					ЗаполнитьКонтакнуюИнформациюПредставителя();
					КонтактнаяИнформацияПредставителяВСтроку(); 
					ЗаполнитьСписокВыбораДоверенностейПредставителя(); 
					Если Параметры.Свойство("ДоверенностьПредставителя") Тогда
						Если НЕ Элементы.ДоверенностьПредставителя.СписокВыбора.НайтиПоЗначению(Параметры.ДоверенностьПредставителя) = неопределено Тогда 
							Объект.ДоверенностьПредставителя = Параметры.ДоверенностьПредставителя;
							ЗаполнитьТекстДоверенности(Доверенность);
						КонецЕсли;	
                    КонецЕсли;
				КонецЕсли;	
			ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога Тогда
				ЗаполнитьЗначенияСвойств(Объект, Параметры.ПредыдущаяОперация, , "Ссылка, Номер, Дата, ВидОперации, ОтветственныйСотрудник, ОтветственныйПользователь, Ломбард, ДатаВыкупа, ДатаВыкупаЛьготная, Товары, Вставки, ДополнительныеМеталлы, ДополнительныеДокументыПравоПребыванияРФ, Дефекты, НачислениеПроцентовДетально, ТоварыИзъятыеВозвращенные");
				Объект.Товары.Загрузить(Параметры.ПредыдущаяОперация.Товары.Выгрузить());
				Объект.Вставки.Загрузить(Параметры.ПредыдущаяОперация.Вставки.Выгрузить());
	            Объект.ДополнительныеМеталлы.Загрузить(Параметры.ПредыдущаяОперация.ДополнительныеМеталлы.Выгрузить());
	            Объект.ДополнительныеДокументыПравоПребыванияРФ.Загрузить(Параметры.ПредыдущаяОперация.ДополнительныеДокументыПравоПребыванияРФ.Выгрузить()); 
				Объект.Дефекты.Загрузить(Параметры.ПредыдущаяОперация.Дефекты.Выгрузить());
				Объект.ПредыдущаяОперация = Параметры.ПредыдущаяОперация; 
				Объект.Ломбард = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();
				Если  Параметры.Свойство("Получатель") Тогда 
					Если НЕ Параметры.Получатель = Объект.Залогодатель Тогда
						Объект.Залогодатель = Параметры.Получатель; 						   					
						ЗаполнитьСписокВыбораДоверенностейПлательщика();
						Если Элементы.ДоверенностьПлательщикаПолучателя.СписокВыбора.Количество() = 1 Тогда 
							Объект.ДоверенностьПредставителя = Элементы.ДоверенностьПлательщикаПолучателя.СписокВыбора.Получить(0).Значение;
							ЗаполнитьТекстДоверенности(ДоверенностьПлательщикаПолучателя);
						КонецЕсли;	
					КонецЕсли; 
					ЗаполнитьКонтакнуюИнформациюЗалогодателя(); 
				КонецЕсли;	      
				Если  Параметры.Свойство("Доверенность") Тогда 
					Объект.ДоверенностьПредставителя = Параметры.Свойство("Доверенность"); 
				КонецЕсли;	
				Если Параметры.Свойство("ДокументЗалогодателя") Тогда
		             Объект.ДокументЗалогодателя = Параметры.ДокументЗалогодателя; 
					 ЗаполнитьИнформациюОДокументеЗалогодателя();
			    КонецЕсли;	
				ФИО = Объект.Залогодатель.Наименование;			
				КонтактнаяИнформацияВСтроку();
	            ИнформацияОДокументеВСтроку();
				Объект.СтатусЗалогодателя = ПолучитьТекущийСтатусКлиента(ДатаДок, Объект.ПредыдущаяОперация.Залогодатель); 
				ПроверитьВозможностьВыдачиЗалога();
			ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ИзъятиеОбъектовЗалога Тогда
				ЗаполнитьЗначенияСвойств(Объект, Параметры.ПредыдущаяОперация, , "Ссылка, Номер, Дата, ВидОперации, ОтветственныйСотрудник, ОтветственныйПользователь, Ломбард, ДатаВыкупа, ДатаВыкупаЛьготная, Товары, Вставки, ДополнительныеМеталлы, ДополнительныеДокументыПравоПребыванияРФ, Дефекты, НачислениеПроцентовДетально, ТоварыИзъятыеВозвращенные");
				Объект.ДополнительныеДокументыПравоПребыванияРФ.Загрузить(Параметры.ПредыдущаяОперация.ДополнительныеДокументыПравоПребыванияРФ.Выгрузить()); 
				Объект.ПредыдущаяОперация = Параметры.ПредыдущаяОперация; 
				Объект.Ломбард = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();
				ФИО = Объект.Залогодатель.Наименование;			
				КонтактнаяИнформацияВСтроку();
	            ИнформацияОДокументеВСтроку();
				Объект.СтатусЗалогодателя = ПолучитьТекущийСтатусКлиента(ДатаДок, Объект.ПредыдущаяОперация.Залогодатель); 
				Объект.ДатаИзъятия = НачалоДня(ДатаДок);   
				Объект.ДатаПротоколИзъятия = НачалоДня(ДатаДок);
			ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога Тогда
				ЗаполнитьЗначенияСвойств(Объект, Параметры.ПредыдущаяОперация, , "Ссылка, Номер, Дата, ВидОперации, ОтветственныйСотрудник, ОтветственныйПользователь, Ломбард, ДатаВыкупа, ДатаВыкупаЛьготная, Товары, Вставки, ДополнительныеМеталлы, ДополнительныеДокументыПравоПребыванияРФ, Дефекты, НачислениеПроцентовДетально, ТоварыИзъятыеВозвращенные");
				Объект.ДополнительныеДокументыПравоПребыванияРФ.Загрузить(Параметры.ПредыдущаяОперация.ДополнительныеДокументыПравоПребыванияРФ.Выгрузить()); 
				Объект.ПредыдущаяОперация = Параметры.ПредыдущаяОперация; 
				Объект.Ломбард = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();
				ФИО = Объект.Залогодатель.Наименование;			
				КонтактнаяИнформацияВСтроку();
	            ИнформацияОДокументеВСтроку();
				Объект.СтатусЗалогодателя = ПолучитьТекущийСтатусКлиента(ДатаДок, Объект.ПредыдущаяОперация.Залогодатель); 
			ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаЗалога Тогда
				ЗаполнитьЗначенияСвойств(Объект, Параметры.ПредыдущаяОперация, , "Ссылка, Номер, Дата, ВидОперации, ОтветственныйСотрудник, ОтветственныйПользователь, Товары, Вставки, ДополнительныеМеталлы, ДополнительныеДокументыПравоПребыванияРФ, Дефекты, НачислениеПроцентовДетально, ТоварыИзъятыеВозвращенные");
				Объект.ДополнительныеДокументыПравоПребыванияРФ.Загрузить(Параметры.ПредыдущаяОперация.ДополнительныеДокументыПравоПребыванияРФ.Выгрузить()); 
				Объект.ПредыдущаяОперация = Параметры.ПредыдущаяОперация;
				Объект.Товары.Загрузить(Параметры.ПредыдущаяОперация.Товары.Выгрузить());
				Объект.Вставки.Загрузить(Параметры.ПредыдущаяОперация.Вставки.Выгрузить());
	            Объект.ДополнительныеМеталлы.Загрузить(Параметры.ПредыдущаяОперация.ДополнительныеМеталлы.Выгрузить());
	            Объект.ДополнительныеДокументыПравоПребыванияРФ.Загрузить(Параметры.ПредыдущаяОперация.ДополнительныеДокументыПравоПребыванияРФ.Выгрузить()); 
				Объект.Дефекты.Загрузить(Параметры.ПредыдущаяОперация.Дефекты.Выгрузить());
				ФИО = Объект.Залогодатель.Наименование;			
				КонтактнаяИнформацияВСтроку();
	            ИнформацияОДокументеВСтроку();
				Объект.СтатусЗалогодателя = ПолучитьТекущийСтатусКлиента(ДатаДок, Объект.ПредыдущаяОперация.Залогодатель); 		
			КонецЕсли;	
		ИначеЕсли Параметры.Свойство("Залогодатель") Тогда  
			Если Параметры.Свойство("ОтказОтВыкупа") Тогда
				Объект.ОтказОтВыкупа = Параметры.ОтказОтВыкупа;
			КонецЕсли;	
			Объект.Залогодатель = Параметры.Залогодатель;
			Объект.Фамилия = Объект.Залогодатель.Фамилия;
			Объект.Имя = Объект.Залогодатель.Имя;
			Объект.Отчество = Объект.Залогодатель.Отчество;
			ФИО = Объект.Залогодатель.Наименование;
			ЗаполнитьИнфорациюОЗалогодателе(Параметры); 
			ПричинаПримененияПроцентнойСхемы = Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма;
			
			Объект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить();
		    //бъект.СхемаКредитования = Константы.ЛБ_ОсновнаяСхемаКредитования.Получить();  
			Объект.Ломбард = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();    
			Объект.СтатусЗалогодателя = ПолучитьТекущийСтатусКлиента(ДатаДок, Объект.Залогодатель); 
			
			//ОбработатьСхемуКредитованияНаСервере(ДатаДок);								
		КонецЕсли;   
	Иначе	        
		ЗаполнитьКонтакнуюИнформациюЗалогодателя();
		ЗаполнитьИнформациюОКлиенте();  
		//Объект.СтатусЗалогодателя = ПолучитьТекущийСтатусКлиента(ДатаДок, ?(ЗначениеЗаполнено(Объект.ПредыдущаяОперация), Объект.ПредыдущаяОперация.Залогодатель, Объект.Залогодатель)); 					

		Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог ИЛИ Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда
			ПричинаПримененияПроцентнойСхемы = Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма; 
			Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда
				Если ЗначениеЗаполнено(Объект.Представитель) Тогда
					ФИОПредставителя = Объект.Представитель.Наименование;
					ЗаполнитьКонтакнуюИнформациюПредставителя();
					КонтактнаяИнформацияПредставителяВСтроку();
				КонецЕсли;	
                Если ЗначениеЗаполнено(Объект.ДокументПредставителя) Тогда
					ЗаполнитьИнформациюОДокументеПредставителя();
				    ИнформацияОДокументеПредставителяВСтроку();
				КонецЕсли;   
				Если ЗначениеЗаполнено(Объект.ДоверенностьПредставителя) Тогда
				    ЗаполнитьТекстДоверенности(Доверенность); 
				КонецЕсли;	
			КонецЕсли;	
		ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов Тогда	
			ПричинаПримененияПроцентнойСхемы = ЛБ_УправлениеЛомбардом.ПолучитьПричинуПримененияПроцентнойСхемы(Объект, Объект.ПредыдущаяОперация); 
			ДоверенностьПлательщикаПолучателя = Объект.ДоверенностьПредставителя;
			Если ПроверитьПодчиненный() Тогда
				ЭтаФорма.ТолькоПросмотр = Истина;
			КонецЕсли;	
		КонецЕсли;      
		ЗаполнитьИсториюЗБ();
	КонецЕсли;                             		

	ОсновнаяЕдиницаИзмеренияКамни = Константы.ЛБ_ОсновнаяЕдиницаКамни.Получить();
	ОсновнаяЕдиницаИзмеренияМеталлы = Константы.ЛБ_ОсновнаяЕдиницаМеталлы.Получить();
	ЗаполнитьВыборЕдиницИзмеренияМеталлы();
	ЗаполнитьВыборЕдиницИзмеренияВставки();  
	ЗаполнитьТаблицуДопСтатусовКлиента(); 
	ПолучитьДопСтатусыКлиента(); 
	ОбработатьСхемуКредитованияНаСервере(ДатаДок);	
			 
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог ИЛИ Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда
		СуммаЗайма = Объект.Товары.Итог("СуммаСсуды"); 	     			
		ЗаполнитьСписокЛьготныхСтатусов();  
		СтруктураП = ЛБ_УправлениеЛомбардом.ПолучитьПредельныеЗначенияПроцентов(ДатаДок, Объект.Организация);
		Если НЕ СтруктураП = неопределено Тогда
            ПСК = СтруктураП.ПСКГод;  
		Иначе
			ПСК = 0;
		КонецЕсли;	
				
		ПолучитьДоступныеПроцентныеСхемыАкции();				
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Если НЕ ТаблицаВыбораСхемыКредитованияАкции.Количество() = 0 Тогда
				СтрокаСК = ТаблицаВыбораСхемыКредитованияАкции.Получить(0);
				Объект.СхемаКредитования = СтрокаСК.СхемаКредитования;
				Объект.Акция = СтрокаСК.Акция;
				ЗаполнитьТаблицуСтавок();
				ОбработатьСхемуКредитованияНаСервере(ДатаДок);
				РасчетСуммыОценкиИтоговой();
				Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог Тогда	
				    РассчитатьСуммуПроцентов();
				ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда	        
				    РассчитатьСуммуПроцентовПереоформление();
				КонецЕсли;   
			КонецЕсли;   
		Иначе
			Отбор = Новый Структура;
			Отбор.Вставить("ДеньНач", 1);
			Строки = Объект.ГрафикПлатежей.НайтиСтроки(Отбор);
			Если НЕ Строки.Количество() = 0 Тогда 
				СуммаПроцентов = Строки.Получить(0).СуммаПроцентов;
				СуммаПроцентовДень = Строки.Получить(0).СуммаПроцентовДень;
			КонецЕсли;	
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(Объект.ПроцентнаяСхема) Тогда
            Сообщить("Не определена процентная схема! Расчет процентов по договору займа не возможен.");
		ИначеЕсли НЕ СуммаЗайма = 0 Тогда	     			
			Если НЕ ПСК = 0 Тогда
	            СуммаПСКГод = СуммаЗайма*ПСК/100;  
			Иначе
				СуммаПСКГод = 0;
			КонецЕсли;	
			Если НЕ (СуммаПСКГод = 0) Тогда
				Если РасчетПроцентовПоДоговоруГод() > СуммаПСКГод Тогда
				    Сообщить("Сумма процентов в год превышает предельную ставку кредитования!", СтатусСообщения.Важное);
				КонецЕсли;	
			КонецЕсли;	  
		КонецЕсли;	
    ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаЗалога Тогда
		СуммаЗайма = Объект.ПредыдущаяОперация.Товары.Итог("СуммаСсуды"); 
		
		Отбор = Новый Структура;
		Отбор.Вставить("ДеньНач", 1);
		Строки = Объект.ПредыдущаяОперация.ГрафикПлатежей.НайтиСтроки(Отбор);
		Если НЕ Строки.Количество() = 0 Тогда 
			СуммаПроцентов = Строки.Получить(0).СуммаПроцентов;
			СуммаПроцентовДень = Строки.Получить(0).СуммаПроцентовДень;
		КонецЕсли;	
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов Тогда 
		СтатусЗБ = ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(ДатаДок, Объект.ПредыдущаяОперация);
		СтруктураРез = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗалоговогоБилета(Объект, Объект.ПредыдущаяОперация);
		ДатаНачалаРасчета = СтруктураРез.ДатаНачалаРасчета; 
		СуммаЗайма = СтруктураРез.СуммаЗайма;
		//НачисленоПроценты = ЛБ_УправлениеЛомбардом.ПолучитьНачисленныеПроцентыПоДоговору(Объект, Объект.ПредыдущаяОперация); 
		ЛБ_УправлениеЛомбардом.ПолучитьУсловияОкругленияПроцентов(Объект);	
		
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		   	Объект.ДатаВыкупа = СтруктураРез.ДатаВыкупа;
			Объект.ДатаВыкупаЛьготная = СтруктураРез.ДатаВыкупаЛьготныйСрок;
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(Объект.ПроцентнаяСхема) И НЕ (СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят ИЛИ СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен) Тогда
			Сообщить("Не определена процентная схема! Расчет процентов по договору займа не возможен.");
		Иначе	  
			СтруктураП = ЛБ_УправлениеЛомбардом.ПолучитьПредельныеЗначенияПроцентов(ДатаДок, Объект.Организация);
			Если НЕ СтруктураП = неопределено Тогда
			    ПланкаПроцентов = СтруктураП.ПланкаПроцентов;
				ПредельноеЗначениеПроцентов = СуммаЗайма*ПланкаПроцентов;
			КонецЕсли;	
		    РассчитатьСуммуПроцентовОплата();  
		КонецЕсли;	
		ИнформацияОЗаемщике = Объект.ПредыдущаяОперация.Залогодатель;  
		Если НЕ Объект.Залогодатель = Объект.ПредыдущаяОперация.Залогодатель Тогда
			Элементы.ГруппаДоверенностьПлательщикаПолучателя.Видимость = Истина;
		КонецЕсли;	 
		Элементы.СуммаЗайма.ТолькоПросмотр = Истина;
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога Тогда  
		СтатусЗБ = ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(ДатаДок, Объект.ПредыдущаяОперация);
		СтруктураРез = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗалоговогоБилета(Объект, Объект.ПредыдущаяОперация);
		ДатаНачалаРасчета = СтруктураРез.ДатаНачалаРасчета; 
		СуммаЗайма = СтруктураРез.СуммаЗайма;
		
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Объект.ДатаВыкупа = СтруктураРез.ДатаВыкупа;
			Объект.ДатаВыкупаЛьготная = СтруктураРез.ДатаВыкупаЛьготныйСрок;

			Объект.ПроцентнаяСхема = Объект.ПредыдущаяОперация.ПроцентнаяСхема; 
		КонецЕсли;	
		ИнформацияОЗаемщике = Объект.ПредыдущаяОперация.Залогодатель;                                 
		Если НЕ Объект.Залогодатель = Объект.ПредыдущаяОперация.Залогодатель Тогда
			Элементы.ГруппаДоверенностьПлательщикаПолучателя.Видимость = Истина;
		КонецЕсли;	
		Элементы.СуммаЗайма.ТолькоПросмотр = Истина;   
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ИзъятиеОбъектовЗалога Тогда 
		СтатусЗБ = ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(ДатаДок, Объект.ПредыдущаяОперация);
		СтруктураРез = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗалоговогоБилета(Объект, Объект.ПредыдущаяОперация);
		ДатаНачалаРасчета = СтруктураРез.ДатаНачалаРасчета; 
		СуммаЗайма = СтруктураРез.СуммаЗайма;  
		ПричинаПримененияПроцентнойСхемы = СтруктураРез.ПричинаПрименения; 
				
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Объект.ДатаВыкупа = СтруктураРез.ДатаВыкупа;
			Объект.ДатаВыкупаЛьготная = СтруктураРез.ДатаВыкупаЛьготныйСрок;

			Объект.ПроцентнаяСхема = Объект.ПредыдущаяОперация.ПроцентнаяСхема; 
		КонецЕсли;	   
	    Если НЕ ЗначениеЗаполнено(Объект.ПроцентнаяСхема) Тогда
			Сообщить("Не определена процентная схема! Расчет процентов по договору займа не возможен.");
		Иначе	  
			СтруктураП = ЛБ_УправлениеЛомбардом.ПолучитьПредельныеЗначенияПроцентов(ДатаДок, Объект.Организация);
			Если НЕ СтруктураП = неопределено Тогда
			    ПланкаПроцентов = СтруктураП.ПланкаПроцентов;
				ПредельноеЗначениеПроцентов = СуммаЗайма*ПланкаПроцентов;
			КонецЕсли;	                       
			Если НачалоДня(ДатаДок) < Объект.ДатаВыкупаЛьготная тогда 
				ДатаОкончанияРасчета = НачалоДня(ДатаДок); 
			Иначе 
				ДатаОкончанияРасчета = КонецДня(Объект.ДатаВыкупаЛьготная) + 1;
			КонецЕсли;	
		    СтруктураОкр = ЛБ_УправлениеЛомбардом.ПолучитьУсловияОкругленияПроцентов(Объект);
			Установки = ЛБ_УправлениеЛомбардом.ПолучитьУсловияПоДоговору(Объект);
			Результат = ЛБ_ОбщийМодуль.РассчитатьСуммуПроцентовИзъятие(Объект, ДатаНачалаРасчета, ДатаОкончанияРасчета, ПредельноеЗначениеПроцентов, ПричинаПримененияПроцентнойСхемы, Установки, СтруктураОкр);
			Если Результат.ПредельноеЗначениеПоДоговору Тогда
			    Сообщить("Достигнуто предельное значение суммы процентов по договору.", Статуссообщения.Информация);
			КонецЕсли; 
		КонецЕсли;	
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога Тогда   
		СтатусЗБ = ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(ДатаДок, Объект.ПредыдущаяОперация);
		СтруктураРез = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗалоговогоБилета(Объект, Объект.ПредыдущаяОперация);
		ДатаНачалаРасчета = СтруктураРез.ДатаНачалаРасчета; 
		СуммаЗайма = СтруктураРез.СуммаЗайма;  
		
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Объект.ДатаВыкупа = СтруктураРез.ДатаВыкупа;
			Объект.ДатаВыкупаЛьготная = СтруктураРез.ДатаВыкупаЛьготныйСрок;
        КонецЕсли;	   
	КонецЕсли;		
		
	//Если Объект.Проведен ИЛИ РольДоступнаПолныеПрава Тогда
	//	
	//	// СтандартныеПодсистемы.Печать
	//	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ГруппаВажныеКоманды);
	//	// Конец СтандартныеПодсистемы.Печать
	//	
	//	// ДополнительныеОтчетыИОбработки
	//	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	//	// Конец ДополнительныеОтчетыИОбработки
	//		
	//КонецЕсли;
	
	СтатусыКлиентаВСтроку();
	УстановитьСостояниеДокумента();
	ЛБ_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект.ВидОперации, Объект, ЭтаФорма);
	ТекДата = ДатаДок; 
	НеРезидент = ?(Объект.Гражданство = Справочники.СтраныМира.Россия, ложь, истина);  
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьТаблицуСтавок() 
	Объект.ПроцентныеСтавкиПоПериодам.Очистить();
	ТаблицаСтавок.Очистить(); 
	ТаблицаС = ЛБ_ОбщийМодуль.ЗаполнитьТаблицуПроцентныхСтавок(Объект.Дата, Объект.Ломбард, Объект.СхемаКредитования, Объект.Акция, Объект.СтатусЗалогодателя, СписокДопСтатусов, Объект.СуммаСсуды);					
	Если НЕ ТаблицаС.Количество() = 0 Тогда  						
		Объект.ПроцентныеСтавкиПоПериодам.Загрузить(ТаблицаС);
		
		Отбор = Новый структура;
		Отбор.Вставить("ПричинаПрименения", ПричинаПримененияПроцентнойСхемы); 
		СтрокиП = Объект.ПроцентныеСтавкиПоПериодам.НайтиСтроки(Отбор); 
		Для каждого СтрП из строкиП цикл 
			НоваяСтр = ТаблицаСтавок.Добавить(); 
			ЗаполнитьЗначенияСвойств(НоваяСтр, СтрП);
		КонецЦикла;	
		
		ОтборС = Новый Структура;
		ОтборС.Вставить("ДеньНачалаПрименения", 1);
		СтрокиС = ТаблицаСтавок.НайтиСтроки(ОтборС); 
		Если НЕ СтрокиС.Количество() = 0 Тогда 
			СтрС = СтрокиС.Получить(0);	
			Если СтрС.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Базовая Тогда 
				Объект.ПроцентнаяСхема = СтрС.ПроцентнаяСтавка;
			ИначеЕсли СтрС.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Акционная Тогда	
				Если НЕ СтрС.ПроцентнаяСтавкаАкция = 0 Тогда 
					Объект.ПроцентнаяСхема = СтрС.ПроцентнаяСтавкаАкция;
				ИначеЕсли НЕ СтрС.ОтклонениеАкцияАбсолютное = 0 Тогда
					Объект.ПроцентнаяСхема = СтрС.ПроцентнаяСтавка + СтрС.ОтклонениеАкцияАбсолютное;
				ИначеЕсли НЕ СтрС.ОтклонениеАкцияОтносительное = 0 Тогда
					Объект.ПроцентнаяСхема = СтрС.ПроцентнаяСтавка + СтрС.ПроцентнаяСтавка*СтрС.ОтклонениеАкцияОтносительное/100;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры	  

&НаСервере
Функция РасчетПроцентовПоДоговоруГод()
	СтруктураОкругления = новый Структура;
	СтруктураОкругления.Вставить("ОкруглятьЦены", ОкруглятьЦены);  
	СтруктураОкругления.Вставить("ВидОкругленияСуммыПроцентов", ВидОкругленияСуммыПроцентов);
	СтруктураОкругления.Вставить("ПорядокОкругления", ПорядокОкругления);  
	СтруктураОкругления.Вставить("ОкруглятьВБольшуюСторону", ОкруглятьВБольшуюСторону);  
		
	ДатаНачала = ЛБ_УправлениеЛомбардом.ПолучитьДатуНачалаРасчетаПроцентов(Объект.Дата, Объект.СхемаКредитования);
		
	СуммаПроцентовГод = 0;
	ДеньКон = 1; 
	ДатаКон = ДатаНачала;
	СтавкаП = 0; 
	
	ОтборП = Новый Структура;
	ОтборП.Вставить("ПричинаПрименения", ПричинаПримененияПроцентнойСхемы);
	СтрокиП = Объект.ПроцентныеСтавкиПоПериодам.НайтиСтроки(ОтборП); 
	Если НЕ СтрокиП.Количество() = 0 Тогда
		Для сч = 0 По СтрокиП.Количество()-1 Цикл 
			СтрС = СтрокиП.Получить(сч);  
			СтавкаП = СтрС.ПроцентнаяСтавка;
			Если СтрС.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Акционная Тогда
				Если НЕ СтрС.ПроцентнаяСтавкаАкция = 0 Тогда
					СтавкаП = СтрС.ПроцентнаяСтавкаАкция;
				ИначеЕсли НЕ СтрС.ОтклонениеАкцияОтносительное = 0 Тогда	 
					СтавкаП = СтрС.ПроцентнаяСтавка + СтрС.ПроцентнаяСтавка*СтрС.ОтклонениеАкцияОтносительное/100;
				ИначеЕсли НЕ СтрС.ОтклонениеАкцияАбсолютное = 0 Тогда
					СтавкаП = СтрС.ПроцентнаяСтавка + СтрС.ОтклонениеАкцияАбсолютное;
			    КонецЕсли; 
			КонецЕсли;	

			Если СтрС.ДеньНачалаПрименения = 1 Тогда
				ДатаНач = ДатаНачала;
			Иначе 
				ДатаНач = НачалоДня(ДатаНачала + СтрС.ДеньНачалаПрименения*(60 * 60 * 24));
			КонецЕсли;		
			
			сч1 = сч + 1;
			Если сч1 >= СтрокиП.Количество() Тогда
				Прервать;
			КонецЕсли;  
			СтрС1 = СтрокиП.Получить(сч1);
			ДатаКонца = НачалоДня(ДатаНачала + (СтрС1.ДеньНачалаПрименения-1)*(60 * 60 * 24)); 
			ДатаКон = ДатаКонца; 
			ДеньКон = СтрС1.ДеньНачалаПрименения-1;
					
			Результат = ЛБ_ОбщийМодуль.РассчитатьСуммуПроцентов(ДатаНач, ДатаКон, СтавкаП, СуммаЗайма, СтруктураОкругления);
			СуммаПроцентовГод = СуммаПроцентовГод + Результат.СуммаПроцентов; 			
		Конеццикла;	
		Если ДеньКон  < 365 Тогда  
			ДатаНач = ДатаКон;
			ДатаКон = НачалоДня(ДатаНачала + 365*(60 * 60 * 24));
			СтрС = СтрокиП.Получить(СтрокиП.Количество()-1);  
			СтавкаП = СтрС.ПроцентнаяСтавка;
			Если СтрС.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Акционная Тогда
				Если НЕ СтрС.ПроцентнаяСтавкаАкция = 0 Тогда
					СтавкаП = СтрС.ПроцентнаяСтавкаАкция;
				ИначеЕсли НЕ СтрС.ОтклонениеАкцияОтносительное = 0 Тогда	 
					СтавкаП = СтрС.ПроцентнаяСтавка + СтрС.ПроцентнаяСтавка*СтрС.ОтклонениеАкцияОтносительное/100;
				ИначеЕсли НЕ СтрС.ОтклонениеАкцияАбсолютное = 0 Тогда
					СтавкаП = СтрС.ПроцентнаяСтавка + СтрС.ОтклонениеАкцияАбсолютное;
			    КонецЕсли; 
			КонецЕсли;	
			Результат = ЛБ_ОбщийМодуль.РассчитатьСуммуПроцентов(ДатаНач, ДатаКон, СтавкаП, СуммаЗайма, СтруктураОкругления);
			СуммаПроцентовГод = СуммаПроцентовГод + Результат.СуммаПроцентов; 
		КонецЕсли;	 
	КонецЕсли;	
	
	Возврат СуммаПроцентовГод;
КонецФункции

// СтандартныеПодсистемы.Печать 
&НаКлиенте 
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда) 
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект); 
КонецПроцедуры 
// Конец СтандартныеПодсистемы.Печать 
// СтандартныеПодсистемы.ПодключаемыеКоманды 
&НаКлиенте 
Процедура Подключаемый_ВыполнитьКоманду(Команда) 
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект); 
КонецПроцедуры 
&НаСервере 
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) 
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат); 
КонецПроцедуры 
&НаКлиенте 
Процедура Подключаемый_ОбновитьКоманды() 
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект); 
КонецПроцедуры 
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды&НаСервере

&НаСервере
Функция ПолучитьТекущийСтатусКлиента(Дата, Залогодатель);
	Возврат ЛБ_УправлениеЛомбардом.ПолучитьТекущийСтатусКлиента(Дата, Залогодатель);
КонецФункции

&НаСервере
Функция ПолучитьСлужебныеСтатусыКлиента(Клиент)
	СписокСлужебныхСтатусов = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Клиент", Клиент); 
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СтатусыЗалогодателейСлужебныеСрезПоследних.Статус КАК Статус,
	               |	ЛБ_СтатусыЗалогодателейСлужебныеСрезПоследних.Используется КАК Используется
	               |ИЗ
	               |	РегистрСведений.ЛБ_СтатусыЗалогодателейСлужебные.СрезПоследних(&Дата, Залогодатель = &Клиент) КАК ЛБ_СтатусыЗалогодателейСлужебныеСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Если Выборка.Используется Тогда 
			СписокСлужебныхСтатусов.Добавить(Выборка.Статус);
		КонецЕсли;	
	КонецЦикла;	
	Возврат СписокСлужебныхСтатусов;
КонецФункции	

&НаСервере
Процедура ПроверитьВозможностьВыдачиЗалога() 
	Запрос = новый Запрос;   
	Запрос.УстановитьПараметр("ЗалоговыйБилет", Объект.ПредыдущаяОперация);
	Запрос.УстановитьПараметр("Дата", ДатаДок);	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.ОбъектЗалога КАК ОбъектЗалога,
	               |	СУММА(ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.СуммаРасход) КАК СуммаОплаты
	               |ИЗ
	               |	РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Обороты(, &Дата, , ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.ОбъектЗалога";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_ОбъектыЗалогаОстатки.Ломбард КАК Ломбард,
	               |	СУММА(ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток) КАК Количество
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(&Дата, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_ОбъектыЗалогаОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога,
	               |	ЛБ_ОбъектыЗалогаОстатки.Ломбард";
	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
	
	Объект.ТоварыВыкупленные.Очистить();  
	Для каждого стр Из ТаблицаЗапроса цикл 
		Отбор = Новый структура;
		Отбор.Вставить("ОбъектЗалога", Стр.ОбъектЗалога);
		Отбор.Вставить("Ломбард", Объект.Ломбард);
		Строки = ТаблицаОстатков.НайтиСтроки(Отбор);
		Если НЕ Строки.Количество() = 0 тогда 
			СтатусОбъектаЗалога = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектаЗалога(ДатаДок, Стр.ОбъектЗалога, Объект.ПредыдущаяОперация); 
			Если НЕ (СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.Выкуплен) И НЕ (СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.Изъят) Тогда
				НоваяСтр = Объект.ТоварыВыкупленные.Добавить(); 
				НоваяСтр.ОбъектЗалога = Стр.ОбъектЗалога;
				НоваяСтр.СуммаОплаты = Стр.СуммаОплаты; 
			КонецЕсли;	
		Иначе
			Отбор.Удалить("Ломбард");
			Строки = ТаблицаОстатков.НайтиСтроки(Отбор);
			Если НЕ Строки.Количество() = 0 тогда 
				Сообщить("Объект залога " + сокрЛП(стр.ОбъектЗалога) + " находится в " + СокрЛП(Строки.Получить(0).Ломбард) + ", выдача не возможна.");
			Иначе
				Сообщить("Местонахождение объекта залога " + сокрЛП(стр.ОбъектЗалога) + " не определено, выдача не возможна.", СтатусСообщения.Важное);
            КонецЕсли;
		КонецЕсли;
	Конеццикла;	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьИсториюЗБ()
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог ИЛИ Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда
		ЗБ =  Объект.Ссылка;
	Иначе  
		ЗБ =  Объект.ПредыдущаяОперация.Ссылка;
	КонецЕсли;	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗБ);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОборотыПоОперациямЗайма.Период КАК Дата,
	               |	ЛБ_ОборотыПоОперациямЗайма.Регистратор КАК ДокументДвижения,
	               |	ЛБ_ОборотыПоОперациямЗайма.ВидОперации КАК ВидОперации,
	               |	ЛБ_ОборотыПоОперациямЗайма.Ломбард КАК Ломбард,
	               |	ЛБ_СостояниеЗалоговогоБилета.СтатусЗалоговогоБилета КАК СтатусЗБ,
	               |	ЛБ_СостояниеЗалоговогоБилета.ДатаВыкупа КАК ДатаВыкупа,
	               |	ЛБ_СостояниеЗалоговогоБилета.ДатаВыкупаЛьготныйСрок КАК ДатаВыкупаЛьготная,
	               |	ЛБ_ОборотыПоОперациямЗайма.Регистратор.ОтветственныйСотрудник КАК Ответственный,
	               |	ЛБ_ОборотыПоОперациямЗайма.СуммаСсуды КАК СуммаЗайма,
	               |	ЛБ_ОборотыПоОперациямЗайма.СуммаОплатыПроценты + ЛБ_ОборотыПоОперациямЗайма.СуммаОплатыЗайм КАК СуммаОплаты,
	               |	ЛБ_ОборотыПоОперациямЗайма.СуммаОплатыПроценты КАК СуммаОплатыПроценты,
	               |	ЛБ_ОборотыПоОперациямЗайма.СуммаОплатыЗайм КАК СуммаОплатыЗайм
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОборотыПоОперациямЗайма КАК ЛБ_ОборотыПоОперациямЗайма
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_СостояниеЗалоговогоБилета КАК ЛБ_СостояниеЗалоговогоБилета
	               |		ПО ЛБ_ОборотыПоОперациямЗайма.Регистратор = ЛБ_СостояниеЗалоговогоБилета.Регистратор
	               |ГДЕ
	               |	ЛБ_ОборотыПоОперациямЗайма.ЗалоговыйБилет = &ЗалоговыйБилет
	               |АВТОУПОРЯДОЧИВАНИЕ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	_СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ПустаяСсылка();
	_ДатаВыкупа = Дата(1,1,1);
	_ДатаВыкупаЛьготная = Дата(1,1,1);
	Для каждого стр Из ТаблицаЗапроса Цикл  
		Если НЕ ЗначениеЗаполнено(Стр.СтатусЗБ) Тогда
			Стр.СтатусЗБ = _СтатусЗБ;
			Стр.ДатаВыкупа = _ДатаВыкупа;
			Стр.ДатаВыкупаЛьготная = _ДатаВыкупаЛьготная;
		Иначе  
			_СтатусЗБ = Стр.СтатусЗБ;
			_ДатаВыкупа = Стр.ДатаВыкупа;
			_ДатаВыкупаЛьготная = Стр.ДатаВыкупаЛьготная;
		КонецЕсли;	
	Конеццикла;	
	ТаблицаИсторииЗБ.Загрузить(ТаблицаЗапроса);
КонецПроцедуры	

&НаСервере
Функция ЗаполнитьСписокВыбораСК()   
	СхемаКредитованияСписокВыбора = Новый СписокЗначений; 
	Если НЕ ТаблицаВыбораСхемыКредитованияАкции.Количество() = 0 Тогда 
		Приоритет = ТаблицаВыбораСхемыКредитованияАкции.Получить(0).Приоритет;
		Для каждого Стр Из ТаблицаВыбораСхемыКредитованияАкции Цикл 
			Если Стр.Приоритет < Приоритет тогда
				Прервать;
			КонецЕсли;	
			СтрокаСК = сокрЛП(Стр.СхемаКредитования); 
			Если ЗначениеЗаполнено(Стр.Акция) Тогда
			    СтрокаСК = СтрокаСК + ", акция " + сокрЛП(Стр.Акция);
			КонецЕсли;
			СхемаКредитованияСписокВыбора.Добавить(Стр.НомерСтроки, СтрокаСК); 
		Конеццикла;
	КонецЕсли;	
	Возврат СхемаКредитованияСписокВыбора;
КонецФункции    

&НаКлиенте
Процедура ОтказОтВыкупаПриИзменении(Элемент)
	ПолучитьДоступныеПроцентныеСхемыАкции(); 
	Если НЕ ТаблицаВыбораСхемыКредитованияАкции.Количество() = 0 Тогда
	    СтрСК = ТаблицаВыбораСхемыКредитованияАкции.Получить(0);
		Объект.СхемаКредитования = СтрСК.СхемаКредитования;
		Объект.Акция = СтрСК.Акция;			
		ЗаполнитьТаблицуСтавок();
		ОбработатьСхемуКредитованияНаСервере(ДатаДок); 
		РасчетСуммыОценкиИтоговой();   
		Если НЕ ЗначениеЗаполнено(Объект.ПроцентнаяСхема) Тогда
            Сообщить("Не определена процентная схема! Расчет процентов по договору займа не возможен."); 
		КонецЕсли;	
	Иначе     
		Объект.СхемаКредитования = ПредопределенноеЗначение("Справочник.ЛБ_СхемыКредитования.ПустаяСсылка");
		Объект.Акция = ПредопределенноеЗначение("Справочник.ЛБ_Акции.ПустаяСсылка"); 
		Объект.ДатаВыкупа = Дата(1,1,1); 
		Объект.ДатаВыкупаЛьготная = Дата(1,1,1); 
		Объект.СрокЗалога = 0;
		Объект.ПроцентныеСтавкиПоПериодам.Очистить();
		ТаблицаСтавок.Очистить();
		Объект.ПроцентнаяСхема = 0; 
		Сообщить("Не определена процентная схема! Расчет процентов по договору займа не возможен.");
	КонецЕсли;	
	Если НЕ СуммаЗайма = 0 Тогда	           
		Если НЕ ПСК = 0 Тогда
            СуммаПСКГод = СуммаЗайма*ПСК/100;  
		Иначе
			СуммаПСКГод = 0;
		КонецЕсли;				
		Если НЕ (СуммаПСКГод = 0) Тогда 
			Если РасчетПроцентовПоДоговоруГод() > СуммаПСКГод Тогда
		        Сообщить("Сумма процентов в год превышает предельную ставку кредитования!", СтатусСообщения.Важное);
			КонецЕсли;	
	    КонецЕсли;	 	    
	КонецЕсли;	
    РассчитатьСуммуПроцентов();
КонецПроцедуры

&НаКлиенте
Процедура СхемаКредитованияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СписокВыбораСК = ЗаполнитьСписокВыбораСК(); 
	Если СписокВыбораСК.Количество() > 1 Тогда
		ВыбранноеЗначение = ВыбратьИзМеню(СписокВыбораСК, Элементы.СхемаКредитования); 
		Если НЕ ВыбранноеЗначение = неопределено Тогда
			НомерСтроки = ВыбранноеЗначение.Значение; 
			ОтборСК = Новый Структура("НомерСтроки", НомерСтроки);
			СтрокиСК = ТаблицаВыбораСхемыКредитованияАкции.НайтиСтроки(ОтборСК);
			Если НЕ СтрокиСК.Количество() = 0 Тогда 
				СтрСК = СтрокиСК.Получить(0);
				Объект.СхемаКредитования = СтрСК.СхемаКредитования;
				Объект.Акция = СтрСК.Акция;			
				ЗаполнитьТаблицуСтавок();
				ОбработатьСхемуКредитованияНаСервере(ДатаДок); 
				РасчетСуммыОценкиИтоговой(); 
				Если НЕ СуммаЗайма = 0 Тогда	           
					Если НЕ ПСК = 0 Тогда
			            СуммаПСКГод = СуммаЗайма*ПСК/100;  
					Иначе
						СуммаПСКГод = 0;
					КонецЕсли;				
					Если НЕ (СуммаПСКГод = 0) Тогда 
						Если РасчетПроцентовПоДоговоруГод() > СуммаПСКГод Тогда
					        Сообщить("Сумма процентов в год превышает предельную ставку кредитования!", СтатусСообщения.Важное);
						КонецЕсли;	
				    КонецЕсли;	 	
			    КонецЕсли;	 
				РассчитатьСуммуПроцентов();
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДоступныеПроцентныеСхемыАкции() 
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьДоступныеПроцентныеСхемыАкции(Объект.Дата, Объект.Ломбард, объект.СтатусЗалогодателя, СуммаЗайма, Объект.ОтказОтВыкупа, ПричинаПримененияПроцентнойСхемы, СписокДопСтатусов, СписокЛьготныхСтатусов, Объект.Промокод, Объект.Предъявитель); 
	НомерСтроки = 0;                                                                                                                                                   
	ТаблицаВыбораСхемыКредитованияАкции.Очистить();  
	Если НЕ ТаблицаЗапроса = неопределено Тогда
		Для каждого стрЗ Из ТаблицаЗапроса Цикл
		    НоваяСтрСК = ТаблицаВыбораСхемыКредитованияАкции.Добавить();
			НоваяСтрСК.НомерСтроки = НомерСтроки; 
			НоваяСтрСК.СхемаКредитования = стрЗ.СхемаКредитования;
			НоваяСтрСК.Акция = стрЗ.Акция; 
			НоваяСтрСК.Приоритет = стрЗ.Приоритет; 
			НомерСтроки = НомерСтроки + 1;
		КонецЦикла;	  
		ТаблицаВыбораСхемыКредитованияАкции.Сортировать("Приоритет Убыв");  
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуДопСтатусовКлиента() 		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СтатусыЗалогодателей.Ссылка КАК Статус
	               |ИЗ
	               |	Справочник.ЛБ_СтатусыЗалогодателей КАК ЛБ_СтатусыЗалогодателей
	               |ГДЕ
	               |	ЛБ_СтатусыЗалогодателей.ПометкаУдаления = ЛОЖЬ
	               |	И ЛБ_СтатусыЗалогодателей.ЭтоГруппа = ЛОЖЬ
	               |	И ЛБ_СтатусыЗалогодателей.ДоступенДляВыбораВручную = ИСТИНА
	               |АВТОУПОРЯДОЧИВАНИЕ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	ТаблицаДопСтатусов.Загрузить(ТаблицаЗапроса); 
	Новаястр = ТаблицаДопСтатусов.Добавить();
	НоваяСтр.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Почетный;  
КонецПроцедуры	

&НаСервере
Процедура ПолучитьДопСтатусыКлиента()  
	//очистим таблицу доп. статусов
	Для каждого Стр Из ТаблицаДопСтатусов Цикл 
		Стр.Используется = ложь;	
	КонецЦикла;	  
	
	Если ЗначениеЗаполнено(Объект.ПредыдущаяОперация) Тогда 
		Клиент = Объект.ПредыдущаяОперация.Залогодатель;
		ДатаРождения = Объект.ПредыдущаяОперация.ДатаРождения;
		Пол = Объект.ПредыдущаяОперация.Пол;
	Иначе  
		Клиент = Объект.Залогодатель;
		ДатаРождения = Объект.ДатаРождения;
		Пол = Объект.Пол;
	конецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
                   |	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус,
                   |	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Используется КАК Используется
                   |ИЗ
                   |	РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(
                   |			&Дата,
                   |			Залогодатель = &Залогодатель
                   |				И Статус = &Статус) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних";
	Для каждого Стр Из ТаблицаДопСтатусов Цикл 
		Запрос.УстановитьПараметр("Залогодатель", Клиент);  
	    Запрос.УстановитьПараметр("Дата", Объект.Дата); 
		Запрос.УстановитьПараметр("Статус", Стр.Статус);  
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Стр.Используется = Выборка.Используется;
		КонецЕсли;	
	КонецЦикла;	   
	
	Если ЛБ_УправлениеЛомбардом.ПроверитьСтатусПочетный(ДатаРождения, Пол) Тогда 
		Отбор = Новый Структура;
		Отбор.Вставить("Статус", Справочники.ЛБ_СтатусыЗалогодателей.Почетный);
		СтрокиС = ТаблицаДопСтатусов.НайтиСтроки(Отбор);
		Если НЕ СтрокиС.Количество() = 0 Тогда
			СтрокиС.Получить(0).Используется = Истина;
		КонецЕсли;	
	КонецЕсли;   
	
	Для каждого СтрС Из ТаблицаДопСтатусов Цикл
		Если СтрС.Используется Тогда
		    СписокДопСтатусов.Добавить(СтрС.Статус);
		КонецЕсли;	
	Конеццикла;	
КонецПроцедуры

&НаСервере
Процедура СтатусыКлиентаВСтроку()
	СтатусыКлиента = сокрЛП(Объект.СтатусЗалогодателя);
	Для каждого СтрС Из ТаблицаДопСтатусов Цикл 
		Если СтрС.Используется Тогда 
		    СтатусыКлиента = СтатусыКлиента + "; " + СокрЛП(СтрС.Статус);
		конецЕсли;	
	КонецЦикла;	
КонецПроцедуры	

&НаСервере
Функция ПроверитьПодчиненный()
	ЗапросП = Новый Запрос; 
	ЗапросП.УстановитьПараметр("Ссылка", Объект.Ссылка);
	ЗапросП.Текст = "ВЫБРАТЬ
	                |	ЛБ_ОперацияПоЗалогу.Ссылка КАК Ссылка
	                |ИЗ
	                |	Документ.ЛБ_ОперацияПоЗалогу КАК ЛБ_ОперацияПоЗалогу
	                |ГДЕ
	                |	ЛБ_ОперацияПоЗалогу.ОперацияВыкупаПереоформление = &Ссылка";
	ВыборкаП = ЗапросП.Выполнить().Выбрать();
	Если ВыборкаП.Следующий() Тогда 
		Возврат Истина;
	КонецЕсли;         
	Возврат Ложь;
КонецФункции

&НаСервере
Процедура ЗаполнитьДатуВыкупа() 
	Объект.ДатаВыкупа = НачалоДня(ДатаДок) + 86401*Объект.СрокЗалога;  
	Объект.ДатаВыкупа = ЛБ_УправлениеЛомбардом.ИсключитьДатаВыкупаПразничныйДень(Объект.ДатаВыкупа);
КонецПроцедуры

&НаСервере
Процедура ОбработатьСхемуКредитованияНаСервере(ДатаДок)	
	БезПродленияДоговора = Объект.СхемаКредитования.БезПродленияДоговора;
    ПризнакПримененияГибкогоПроцента = Объект.СхемаКредитования.ПризнакПримененияГибкогоПроцента;
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ?(Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог ИЛИ Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление, ДатаДок, Объект.ПредыдущаяОперация.Дата));
	Запрос.УстановитьПараметр("СхемаКредитования", Объект.СхемаКредитования);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_УсловияПредоставленияКредитаСрезПоследних.СрокЗалога КАК СрокЗалога
	               |ИЗ
	               |	РегистрСведений.ЛБ_УсловияПредоставленияКредита.СрезПоследних(&Дата, СхемаКредитования = &СхемаКредитования) КАК ЛБ_УсловияПредоставленияКредитаСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		СрокЗалога = Выборка.СрокЗалога;
		ЗаполнитьДатуВыкупа();
		ДатаВыкупаЛьготная = ПолучитьЛьготнуюДатуВыкупа();
	КонецЕсли;	  
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.Текст = "ВЫБРАТЬ
	               |	УсловияПредоставленияКредита.НачислятьПроцентыЗаДеньЗалога КАК НачислятьПроцентыЗаДеньЗалога,
	               |	УсловияПредоставленияКредита.НеНачислятьПроцентыЗаПоследнийДень КАК НеНачислятьПроцентыЗаПоследнийДень,
	               |	УсловияПредоставленияКредита.ОкруглятьСуммуПроценты КАК ОкруглятьПроценты,
	               |	УсловияПредоставленияКредита.ПорядокОкругленияПроценты КАК ПорядокОкругления,
	               |	УсловияПредоставленияКредита.ОкруглятьВБольшуюСторонуПроценты КАК ОкруглятьВБольшуюСторону,
	               |	УсловияПредоставленияКредита.ВидОкругленияСуммыПроцентов КАК ВидОкругленияСуммыПроцентов,
	               |	УсловияПредоставленияКредита.СчитатьПроцентыДеньВыдачиРавенДеньВыкупа КАК СчитатьПроцентыДеньВыдачиРавенДеньВыкупа,
	               |	УсловияПредоставленияКредита.ОкруглятьСуммуОценка КАК ОкруглятьОценка
	               |ИЗ
	               |	РегистрСведений.ЛБ_НастройкиЗаймаВерхнегоУровня.СрезПоследних(&Дата, Организация = &Организация) КАК УсловияПредоставленияКредита";
	Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда  
		НачислятьПроцентыЗаДеньЗалога = Выборка.НачислятьПроцентыЗаДеньЗалога;
		НеНачислятьПроцентыЗаПоследнийДень = Выборка.НеНачислятьПроцентыЗаПоследнийДень;
		СчитатьПроцентыДеньВыдачиРавенДеньВыкупа = Выборка.СчитатьПроцентыДеньВыдачиРавенДеньВыкупа;
		ОкруглятьПроценты = Выборка.ОкруглятьПроценты;
		ПорядокОкругления = Выборка.ПорядокОкругления;
        ОкруглятьВБольшуюСторону = Выборка.ОкруглятьВБольшуюСторону;
        ВидОкругленияСуммыПроцентов = Выборка.ВидОкругленияСуммыПроцентов;
		ОкруглятьЦены = Выборка.ОкруглятьОценка;
    КонецЕсли;

	Запрос.УстановитьПараметр("СтатусЗалогодателя", Объект.СтатусЗалогодателя);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_НастройкаУвеличенияЗалогаПоСтатусамЗалогодателейСрезПоследних.УвеличениеСтоимостиЗалога КАК УвеличениеСтоимостиЗалога
	               |ИЗ
	               |	РегистрСведений.ЛБ_НастройкаУвеличенияЗалогаПоСтатусамЗалогодателей.СрезПоследних(
	               |			&Дата,
	               |			СтатусЗалогодателя = &СтатусЗалогодателя
	               |				И СхемаКредитования = &СхемаКредитования) КАК ЛБ_НастройкаУвеличенияЗалогаПоСтатусамЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПроцентУвеличенияОценкиЗалога = Выборка.УвеличениеСтоимостиЗалога;
	Иначе
		ПроцентУвеличенияОценкиЗалога = 0;
	КонецЕсли;	
КонецПроцедуры    

&НаСервере
Процедура ЗаполнитьСписокЛьготныхСтатусов() 
	СписокЛьготныхСтатусов.Очистить();
	
	//Проверим нового клиента
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Объект.Ссылка), Новый Граница(Новый МоментВремени(Объект.Дата, Объект.Ссылка), ВидГраницы.Исключая), ДатаДок));
	Запрос.УстановитьПараметр("Залогодатель", Объект.Залогодатель);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОперацииПоСистемеЛояльностиОбороты.КоличествоЗалоговОборот КАК КоличествоЗалогов
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОперацииПоСистемеЛояльности.Обороты(, &Дата, , Залогодатель = &Залогодатель) КАК ЛБ_ОперацииПоСистемеЛояльностиОбороты";   
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда   
		Если НЕ Выборка.КоличествоЗалогов = 0 Тогда
			СписокЛьготныхСтатусов.Добавить(Перечисления.ЛБ_ЛьготныеСтатусыЗаемщика.НовыйКлиент);
		КонецЕсли;	
	Иначе	
		СписокЛьготныхСтатусов.Добавить(Перечисления.ЛБ_ЛьготныеСтатусыЗаемщика.НовыйКлиент);
	КонецЕсли;

	
	//проверим пенсионер по возрасту 
	Объект.ВозрастЗалогодателя = ЛБ_ОбщийМодуль.ВычислитьВозраст(Объект.ДатаРождения);
	Если ЗначениеЗаполнено(Объект.ВозрастЗалогодателя) И ЗначениеЗаполнено(Объект.Пол) Тогда
		Если Объект.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда 
			Если Объект.ВозрастЗалогодателя  >= 55 Тогда  
				СписокЛьготныхСтатусов.Добавить(Перечисления.ЛБ_ЛьготныеСтатусыЗаемщика.Пенсионер);
			КонецЕсли;	
		ИначеЕсли Объект.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
			Если Объект.ВозрастЗалогодателя  >= 60 Тогда  
				СписокЛьготныхСтатусов.Добавить(Перечисления.ЛБ_ЛьготныеСтатусыЗаемщика.Пенсионер);
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	
	//проверим льготные документы   
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СоответствиеДокументовИЛьготныхСтатусовСрезПоследних.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_СоответствиеДокументовИЛьготныхСтатусовСрезПоследних.Статус КАК Статус
	               |ИЗ
	               |	РегистрСведений.ЛБ_СоответствиеДокументовИЛьготныхСтатусов.СрезПоследних(&Дата, НеАктуально = ЛОЖЬ) КАК ЛБ_СоответствиеДокументовИЛьготныхСтатусовСрезПоследних";
	ТаблицаСоответствия = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст ="ВЫБРАТЬ
	              |	ЛБ_ДокументыЗалогодателя.ВидДокумента КАК ВидДокумента,
	              |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК СрокДействия
	              |ИЗ
	              |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних КАК ЛБ_ДокументыЗалогодателейСрезПоследних
	              |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЛБ_ДокументыЗалогодателя КАК ЛБ_ДокументыЗалогодателя
	              |		ПО ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя = ЛБ_ДокументыЗалогодателя.Ссылка
	              |ГДЕ
	              |	ЛБ_ДокументыЗалогодателя.ПометкаУдаления = ЛОЖЬ
	              |	И ЛБ_ДокументыЗалогодателя.ВидДокументаЗалогодателя = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДокументовЗалогодателя.ДополнительныйДокумент)
	              |	И ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНеДействителен = ЛОЖЬ
	              |	И ЛБ_ДокументыЗалогодателя.Владелец = &Залогодатель";
	Выборка = Запрос.Выполнить().Выбрать();   
	ДатаПроверки = ДатаДок;
	Пока Выборка.Следующий() цикл
		Если НЕ (Выборка.СрокДействия = Дата(1,1,1)) Тогда
			Если Выборка.СрокДействия < ДатаПроверки Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		Отбор = Новый структура;
		Отбор.Вставить("ВидДокумента", Выборка.ВидДокумента);
		Строки = ТаблицаСоответствия.НайтиСтроки(Отбор);
		Если Строки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;     
		Стр = Строки.Получить(0);
		Если СписокЛьготныхСтатусов.НайтиПоЗначению(Стр.Статус) = неопределено  Тогда
			СписокЛьготныхСтатусов.Добавить(Стр.Статус);
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры    

&НаСервере
Процедура ЗаполнитьСписокВыбораИзъятия()
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда	  
		МоментДоДокумента = Новый Граница(Новый МоментВремени(Объект.Дата, Объект.Ссылка), ВидГраницы.Исключая);
		ДатаП = МоментДоДокумента; 
	Иначе	
	    ДатаП = Объект.Дата;		
	КонецЕсли;	

	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", ДатаП);
	Запрос.УстановитьПараметр("ЗалоговыйБилет", Объект.ПредыдущаяОперация); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(
	               |			&Дата,
	               |			ЗалоговыйБилет = &ЗалоговыйБилет
	               |				И НЕ СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Изъят)) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать(); 
	Элементы.ТоварыИзъятыеОбъектЗалога.СписокВыбора.Очистить();
	Пока Выборка.Следующий() цикл       
		Отбор = новый Структура;
		Отбор.Вставить("ОбъектЗалога", Выборка.ОбъектЗалога);
		СтрокиТ = Объект.ТоварыИзъятыеВозвращенные.НайтиСтроки(Отбор);
		Если НЕ СтрокиТ.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;	
	    Элементы.ТоварыИзъятыеОбъектЗалога.СписокВыбора.Добавить(Выборка.ОбъектЗалога); 
	Конеццикла;	
КонецПроцедуры	    

&НаСервере
Процедура ЗаполнитьСписокВыбораВозврат()  
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда	  
		МоментДоДокумента = Новый Граница(Новый МоментВремени(Объект.Дата, Объект.Ссылка), ВидГраницы.Исключая);
		ДатаП = МоментДоДокумента; 
	Иначе	
	    ДатаП = Объект.Дата;		
	КонецЕсли;	

	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", ДатаП);
	Запрос.УстановитьПараметр("ЗалоговыйБилет", Объект.ПредыдущаяОперация); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(
	               |			&Дата,
	               |			ЗалоговыйБилет = &ЗалоговыйБилет
	               |				И СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Изъят)) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать(); 
	Элементы.ТоварыВозвращенныеОбъектЗалога.СписокВыбора.Очистить();
	Пока Выборка.Следующий() цикл       
		Отбор = новый Структура;
		Отбор.Вставить("ОбъектЗалога", Выборка.ОбъектЗалога);
		СтрокиТ = Объект.ТоварыИзъятыеВозвращенные.НайтиСтроки(Отбор);
		Если НЕ СтрокиТ.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;	
	    Элементы.ТоварыВозвращенныеОбъектЗалога.СписокВыбора.Добавить(Выборка.ОбъектЗалога); 
	Конеццикла;	
КонецПроцедуры	


&НаСервере 
Процедура ЗаполнитьВыборЕдиницИзмеренияМеталлы()
	ТаблицаЕдиницИзмерения = ЛБ_ОбщийМодуль.ВыборЕдиницИзмеренияРасчетаЦенМеталлов();
	Элементы.ТоварыЕдиницаИзмерения.СписокВыбора.Очистить();
	Элементы.ДополнительныеМеталлыЕдиницаИзмерения.СписокВыбора.Очистить();
	Для каждого Стр Из ТаблицаЕдиницИзмерения Цикл
		Элементы.ТоварыЕдиницаИзмерения.СписокВыбора.Добавить(Стр.ЕдиницаИзмерения);
		Элементы.ДополнительныеМеталлыЕдиницаИзмерения.СписокВыбора.Добавить(Стр.ЕдиницаИзмерения);
	КонецЦикла;
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьВыборЕдиницИзмеренияВставки()
	ТаблицаЕдиницИзмерения = ЛБ_ОбщийМодуль.ВыборЕдиницИзмеренияРасчетаЦенКамней();
	Элементы.ВставкиЕдиницаИзмерения.СписокВыбора.Очистить();		
	Для каждого Стр Из ТаблицаЕдиницИзмерения Цикл
		Элементы.ВставкиЕдиницаИзмерения.СписокВыбора.Добавить(Стр.ЕдиницаИзмерения);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнформациюОДокументеЗалогодателя()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("ДокументЗалогодателя", Объект.ДокументЗалогодателя);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНачалоДействия КАК ДокументНачалоДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&Дата, ДокументЗалогодателя = &ДокументЗалогодателя) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Объект.ДокументВидДокументаЗалогодателя = Выборка.ВидДокументаЗалогодателя;
		Объект.ДокументВид = Выборка.ВидДокумента;
		Объект.ДокументГражданство = Выборка.Гражданство;
		Объект.ДокументСерия = Выборка.ДокументСерия;
		Объект.ДокументНомер = Выборка.ДокументНомер;
		Объект.ДокументДатаВыдачи = Выборка.ДокументДатаВыдачи;
		Объект.ДокументКемВыдан = Выборка.ДокументКемВыдан;
		Объект.ДокументКодПодразделения = Выборка.ДокументКодПодразделения;
		Объект.ДокументНачалоДействия = Выборка.ДокументНачалоДействия;
		Объект.ДокументСрокДействия = Выборка.ДокументСрокДействия;
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьИнформациюОДокументеПредставителя()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("ДокументЗалогодателя", Объект.ДокументПредставителя);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНачалоДействия КАК ДокументНачалоДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&Дата, ДокументЗалогодателя = &ДокументЗалогодателя) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Объект.ДокументВидДокументаПредставителя = Выборка.ВидДокументаЗалогодателя;
		Объект.ДокументВидПредставителя = Выборка.ВидДокумента;
		Объект.ДокументГражданствоПредставителя = Выборка.Гражданство;
		Объект.ДокументСерияПредставителя = Выборка.ДокументСерия;
		Объект.ДокументНомерПредставителя = Выборка.ДокументНомер;
		Объект.ДокументДатаВыдачиПредставителя = Выборка.ДокументДатаВыдачи;
		Объект.ДокументКемВыданПредставителя = Выборка.ДокументКемВыдан;
		Объект.ДокументКодПодразделенияПредставителя = Выборка.ДокументКодПодразделения;
		Объект.ДокументНачалоДействияПредставителя = Выборка.ДокументНачалоДействия;
		Объект.ДокументСрокДействияПредставителя = Выборка.ДокументСрокДействия;
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьКонтакнуюИнформациюЗалогодателя()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("Залогодатель", Объект.Залогодатель);
    Запрос.Текст = "ВЫБРАТЬ
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРождения КАК МестоРождения,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Email КАК Email,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПрописке КАК АдресПоПрописке,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Пол КАК Пол,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК Телефон,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество
                   |ИЗ
                   |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Объект.Фамилия = Выборка.Фамилия;
        Объект.Имя = Выборка.Имя;
        Объект.Отчество = Выборка.Отчество;		
		Объект.ДатаРождения = Выборка.ДатаРождения;		
		Объект.Гражданство = Выборка.Гражданство;
		Объект.Пол = Выборка.Пол;
		МестоРождения = МестоРождения;
		Email = Выборка.Email;
		Телефон = Выборка.Телефон;		
		АдресПоПрописке = Выборка.АдресПоПрописке;
		ФИО = Объект.Залогодатель.Наименование;
    КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьКонтакнуюИнформациюПредставителя()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("Залогодатель", Объект.Представитель);
    Запрос.Текст = "ВЫБРАТЬ
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРождения КАК МестоРождения,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК Телефон,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Email КАК Email,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПрописке КАК АдресПоПрописке,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Пол КАК Пол
                   |ИЗ
                   |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Объект.ДатаРожденияПредставителя = Выборка.ДатаРождения;		
		Объект.ГражданствоПредставителя = Выборка.Гражданство;
		Объект.ПолПредставителя = Выборка.Пол;
		МестоРожденияПредставителя = Выборка.МестоРождения;
		EmailПредставителя = Выборка.Email;
		ТелефонПредставителя = Выборка.Телефон;
		АдресПоПропискеПредставителя = Выборка.АдресПоПрописке;		
    КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура ИнформацияОДокументеВСтроку()
	Информация = "";
	Информация = СокрЛП(Объект.ДокументВид);
	Информация = Информация + ?(ЗначениеЗаполнено(Объект.ДокументСерия), " " + СокрЛП(Объект.ДокументСерия), "");
	Информация = Информация + ?(ЗначениеЗаполнено(Объект.ДокументНомер), " " + СокрЛП(Объект.ДокументНомер), "");
	Информация = Информация + ?(ЗначениеЗаполнено(Объект.ДокументКемВыдан), " выдан " + СокрЛП(Объект.ДокументКемВыдан), "");
	Информация = Информация + ?(ЗначениеЗаполнено(Объект.ДокументДатаВыдачи), " " + Формат(Объект.ДокументДатаВыдачи,"ДФ=dd.MM.yyyy"), "");
	Информация = Информация + ?(ЗначениеЗаполнено(Объект.ДокументКодПодразделения), " код подр. " + СокрЛП(Объект.ДокументКодПодразделения), "");
	Информация = Информация + ?(ЗначениеЗаполнено(Объект.ДокументНачалоДействия), " действует с " + Формат(Объект.ДокументНачалоДействия,"ДФ=dd.MM.yyyy"), "");
	Информация = Информация + ?(ЗначениеЗаполнено(Объект.ДокументСрокДействия), " по " + Формат(Объект.ДокументСрокДействия,"ДФ=dd.MM.yyyy"), "");
	Паспорт = Информация;
КонецПроцедуры

&НаСервере
Процедура ИнформацияОДокументеПредставителяВСтроку()
	Информация = "";
	Информация = СокрЛП(Объект.ДокументВидПредставителя);
	Информация = Информация + ?(ЗначениеЗаполнено(Объект.ДокументСерияПредставителя), " " + СокрЛП(Объект.ДокументСерияПредставителя), "");
	Информация = Информация + ?(ЗначениеЗаполнено(Объект.ДокументНомерПредставителя), " " + СокрЛП(Объект.ДокументНомерПредставителя), "");
	Информация = Информация + ?(ЗначениеЗаполнено(Объект.ДокументКемВыданПредставителя), " выдан " + СокрЛП(Объект.ДокументКемВыданПредставителя), "");
	Информация = Информация + ?(ЗначениеЗаполнено(Объект.ДокументДатаВыдачиПредставителя), " " + Формат(Объект.ДокументДатаВыдачиПредставителя,"ДФ=dd.MM.yyyy"), "");
	Информация = Информация + ?(ЗначениеЗаполнено(Объект.ДокументКодПодразделенияПредставителя), " код подр. " + СокрЛП(Объект.ДокументКодПодразделенияПредставителя), "");
	Информация = Информация + ?(ЗначениеЗаполнено(Объект.ДокументНачалоДействияПредставителя), " действует с " + Формат(Объект.ДокументНачалоДействияПредставителя,"ДФ=dd.MM.yyyy"), "");
	Информация = Информация + ?(ЗначениеЗаполнено(Объект.ДокументСрокДействияПредставителя), " по " + Формат(Объект.ДокументСрокДействияПредставителя,"ДФ=dd.MM.yyyy"), "");
	ПаспортПредставителя = Информация;
КонецПроцедуры


&НаСервере
Процедура ИнформацияОДокументеДопВСтроку()
	Информация = "";
	Информация = СокрЛП(Объект.ДокументПравоНаПребываниеВид);
	Информация = Информация + ?(ЗначениеЗаполнено(Объект.СерияДокументаНаПравоПребывания), " " + СокрЛП(Объект.СерияДокументаНаПравоПребывания), "");
	Информация = Информация + ?(ЗначениеЗаполнено(Объект.НомерДокументаНаПравоПребывания), " " + СокрЛП(Объект.НомерДокументаНаПравоПребывания), "");
	Информация = Информация + ?(ЗначениеЗаполнено(Объект.ДатаНачалаСрокаДействияДокументаНаПравоПребывания), " действует с " + Формат(Объект.ДатаНачалаСрокаДействияДокументаНаПравоПребывания,"ДФ=dd.MM.yyyy"), "");
	Информация = Информация + ?(ЗначениеЗаполнено(Объект.ДатаОкончанияСрокаДействияДокументаНаПравоПребывания), " по " + Формат(Объект.ДатаОкончанияСрокаДействияДокументаНаПравоПребывания,"ДФ=dd.MM.yyyy"), "");
	ПравоПребывания = Информация;
КонецПроцедуры


&НаСервере
Процедура КонтактнаяИнформацияВСтроку()
	Информация = "";
	Информация = Информация + ?(ЗначениеЗаполнено(Объект.Гражданство), СокрЛП(Объект.Гражданство), "");
	Информация = Информация + ?(ЗначениеЗаполнено(Объект.Пол), ?(ПустаяСтрока(Информация), "", "; ") + "пол.: " + Строка(Объект.Пол), "");
	Информация = Информация + ?(ЗначениеЗаполнено(Объект.ДатаРождения), ?(ПустаяСтрока(Информация), "", "; ") + "дата рожд.: " +  Формат(Объект.ДатаРождения, "ДФ=dd.MM.yyyy"), "");
	Информация = Информация + ?(ЗначениеЗаполнено(МестоРождения), ?(ПустаяСтрока(Информация), "", "; ") + "место рожд.: " +  СокрЛП(МестоРождения), "");
	Информация = Информация + ?(ЗначениеЗаполнено(Телефон), ?(ПустаяСтрока(Информация), "", "; ") + "тел.: " + СокрЛП(Телефон), "");
	Информация = Информация + ?(ЗначениеЗаполнено(Email), ?(ПустаяСтрока(Информация), "", "; ") + "email: " + СокрЛП(Email), "");
	Информация = Информация + ?(ЗначениеЗаполнено(АдресПоПрописке), ?(ПустаяСтрока(Информация), "", "; ") + "адрес: " + СокрЛП(АдресПоПрописке), "");

	Контакт = Информация;
КонецПроцедуры

&НаСервере
Процедура КонтактнаяИнформацияПредставителяВСтроку()
	Информация = "";
	Информация = Информация + ?(ЗначениеЗаполнено(Объект.ГражданствоПредставителя), СокрЛП(Объект.ГражданствоПредставителя), "");
	Информация = Информация + ?(ЗначениеЗаполнено(Объект.ПолПредставителя), ?(ПустаяСтрока(Информация), "", "; ") + "пол.: " + Строка(Объект.ПолПредставителя), "");
	Информация = Информация + ?(ЗначениеЗаполнено(Объект.ДатаРожденияПредставителя), ?(ПустаяСтрока(Информация), "", "; ") + "дата рожд.: " +  Формат(Объект.ДатаРожденияПредставителя, "ДФ=dd.MM.yyyy"), "");
	Информация = Информация + ?(ЗначениеЗаполнено(МестоРожденияПредставителя), ?(ПустаяСтрока(Информация), "", "; ") + "место рожд.: " +  СокрЛП(МестоРожденияПредставителя), "");
	Информация = Информация + ?(ЗначениеЗаполнено(ТелефонПредставителя), ?(ПустаяСтрока(Информация), "", "; ") + "тел.: " + СокрЛП(ТелефонПредставителя), "");
	Информация = Информация + ?(ЗначениеЗаполнено(EmailПредставителя), ?(ПустаяСтрока(Информация), "", "; ") + "email: " + СокрЛП(EmailПредставителя), "");
	Информация = Информация + ?(ЗначениеЗаполнено(АдресПоПропискеПредставителя), ?(ПустаяСтрока(Информация), "", "; ") + "адрес: " + СокрЛП(АдресПоПропискеПредставителя), "");

	КонтактПредставителя = Информация;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнформациюОКлиенте()
	Если ЗначениеЗаполнено(Объект.Залогодатель) Тогда
		ФИО = Объект.Залогодатель.Наименование;	    
		КонтактнаяИнформацияВСтроку();
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ДокументЗалогодателя) Тогда
		ЗаполнитьИнформациюОДокументеЗалогодателя();
		ИнформацияОДокументеВСтроку();
	КонецЕсли;	
КонецПроцедуры	
	
&НаСервере
Процедура ЗаполнитьИнфорациюОЗалогодателе(Параметры)
	Если Параметры.Свойство("ДокументЗалогодателя") Тогда
		Объект.ДокументЗалогодателя = Параметры.ДокументЗалогодателя; 
		ЗаполнитьИнформациюОДокументеЗалогодателя();
		ИнформацияОДокументеВСтроку();
	КонецЕсли;	
	ЗаполнитьКонтакнуюИнформациюЗалогодателя();
	КонтактнаяИнформацияВСтроку();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнфорациюОПредставителе(Параметры)
	Если Параметры.Свойство("ДокументЗалогодателя") Тогда
		Объект.ДокументПредставителя = Параметры.ДокументЗалогодателя;
		ЗаполнитьИнформациюОДокументеПредставителя();
		ИнформацияОДокументеПредставителяВСтроку();
	КонецЕсли;	
	ЗаполнитьКонтакнуюИнформациюПредставителя();
	КонтактнаяИнформацияПредставителяВСтроку();
КонецПроцедуры

&НаСервере
Функция ПроверитьСлужебныйСтатус(Статус)  
	СтруктураРез = Новый Структура;
	СтруктураРез.Вставить("Запрет", ложь); 
	СтруктураРез.Вставить("Предупредить", "");
	ОтборС = Новый Структура("ВидОперации", Объект.ВидОперации);
	СтрокиС = Статус.ЗапретНаОперации.НайтиСтроки(ОтборС);
	Если НЕ СтрокиС.Количество() = 0 Тогда 
		СтруктураРез.Запрет = Истина; 
	КонецЕсли;	
	Если Статус.Предупредить Тогда
		Информация = Статус.ДопИнформация.Получить(); 
		СтруктураРез.Предупредить = Информация.ПолучитьТекст();
	КонецЕсли;	
	Возврат СтруктураРез;
КонецФункции

&НаСервере
Процедура ОбновитьДанныеТовары() 
	Для Каждого Стр Из Объект.Товары Цикл  
		Отбор = новый структура;
		Отбор.Вставить("КлючСтроки", Стр.КлючСтроки); 
		СтрокиВ = Объект.Вставки.НайтиСтроки(Отбор);
		Стр.КоличествоВ = СтрокиВ.Количество();
		Стр.ЕстьФайл = ?(ЗначениеЗаполнено(Стр.Этикетка), истина, ложь);
	Конеццикла;	
КонецПроцедуры 

&НаСервере
Функция ПроверкаНеОценивать(ВидВставки, КатегорияЗалога)
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ВидКамня", ВидВставки); 
	Запрос.УстановитьПараметр("Категория", КатегорияЗалога);
	Запрос.Текст ="ВЫБРАТЬ
	              |	ЛБ_ПараметрыОценкиВставокВОбъектахЗалога.Оценивается КАК Оценивается
	              |ИЗ
	              |	РегистрСведений.ЛБ_ПараметрыОценкиВставокВОбъектахЗалога КАК ЛБ_ПараметрыОценкиВставокВОбъектахЗалога
	              |ГДЕ
	              |	ЛБ_ПараметрыОценкиВставокВОбъектахЗалога.ВидКамня = &ВидКамня
	              |	И ЛБ_ПараметрыОценкиВставокВОбъектахЗалога.КатегорияОбъектаЗалога = &Категория"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат НЕ Выборка.Оценивается;
	КонецЕсли;	
	Возврат Истина;
КонецФункции	

&НаСервере
Процедура ОбновитьДанныеВставки() 
	Для Каждого СтрТовары Из Объект.Товары Цикл 
		Отбор = новый Структура;
		Отбор.Вставить("КлючСтроки", СтрТовары.КлючСтроки);
		Строки = Объект.Вставки.НайтиСтроки(Отбор);
		Для Каждого Стр Из Строки Цикл  
			Если Стр.Вид = Перечисления.ЛБ_ВидыКомплектующихИзделия.Вставка Тогда
				Если ЗначениеЗаполнено(Стр.ВидВставки) И Стр.ВидВставки.НеОценивается Тогда
					Стр.ПроверкаНеОценивать = Истина;
				ИначеЕсли ЗначениеЗаполнено(Стр.ВидОгранки) И Стр.ВидОгранки.НеОценивается Тогда
					Стр.ПроверкаНеОценивать = Истина;
				Иначе 
				    Стр.ПроверкаНеОценивать = ПроверкаНеОценивать(Стр.ВидВставки, СтрТовары.Категория);
				КонецЕсли;	
			КонецЕсли;	
		Конеццикла;	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	// СтандартныеПодсистемы.ПодключаемыеКоманды 
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
	СписокСС = ПолучитьСлужебныеСтатусыКлиента(Объект.Залогодатель);
	Если НЕ СписокСС.Количество() = 0 Тогда 
		ПредупреждениеП = "";
		Для каждого Элемент из СписокСС Цикл 
			СтруктураВозврата = ПроверитьСлужебныйСтатус(Элемент.Значение);
			Если СтруктураВозврата.Запрет Тогда 
				Если НЕ Пустаястрока(СтруктураВозврата.Предупредить) Тогда
				    Предупреждение(СтруктураВозврата.Предупредить, 60, "Проверка служебных статусов клиента");
				КонецЕсли;	
				Отказ = Истина;
				Возврат;  
			Иначе
				ПредупреждениеП = СтруктураВозврата.Предупредить;
			КонецЕсли;	
		КонецЦикла;   
		Если НЕ ПустаяСтрока(ПредупреждениеП) Тогда
			Ответ = Вопрос(ПредупреждениеП + " Продолжить?", РежимДиалогаВопрос.ОКОтмена); 
			Если Ответ = КодВозвратаДиалога.Отмена Тогда  
				Отказ = Истина;
			    Возврат;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;   
	
	Если НЕ Объект.ДополнительныеДокументыПравоПребыванияРФ.Количество() = 0 Тогда
		Элементы.ГруппаПравоПребываниеРФ.Показать(); 
	КонецЕсли;
	ОбновитьДанныеТовары(); 
	ОбновитьДанныеВставки();		
	УстановитьОформление();
	Активизировать();
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог") ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление") тогда
		    ЗалоговыйБилет = Объект.Ссылка;
		Иначе 
			ЗалоговыйБилет = Объект.ПредыдущаяОперация;
		КонецЕсли;   
		Если ЕстьОперацииСБолееПозднейДатой(ЗалоговыйБилет) тогда
			Элементы.ОсновнаяПанель.ТолькоПросмотр = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов") ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога") Тогда
	    Элементы.ГруппаТабличныеЧасти.ТолькоПросмотр = Истина; 
		Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаЗакладываемоеИмущество; 		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление") Тогда
		Элементы.ГруппаДанныеПредставителя.Видимость = Истина;
	    Если ЗначениеЗаполнено(Объект.Представитель) Тогда
			Элементы.ГруппаДанныеПредставителя.Показать();
		КонецЕсли;   
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ИзъятиеОбъектовЗалога") Тогда	
		Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаИзъятие;   
		ЗаполнитьСписокВыбораИзъятия();   
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога") Тогда	
		Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаВозврат;   
		ЗаполнитьСписокВыбораВозврат();	
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаЗалога") Тогда	
	    Элементы.СтраницаЗалогодатель.ТолькоПросмотр = Истина; 
		Элементы.СтраницаЗакладываемоеИмущество.ТолькоПросмотр = Истина;
		Элементы.Организация.ТолькоПросмотр = Истина;
		Элементы.Ломбард.ТолькоПросмотр = Истина;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.ГруппаВставок.Доступность = ложь; 
		Элементы.ГруппаДопМеталлы.Доступность = ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОформление()
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог") ИЛИ 
	Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление") Тогда 
		Элементы.ОтказОтВыкупа.Видимость = Истина;
	Иначе
		Элементы.ОтказОтВыкупа.Видимость = Ложь;
    КонецЕсли;
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов") Тогда
		Элементы.ДекорацияИиформацияЗалогодатель.Заголовок = "Информация о плательщике";
		Элементы.СтраницаЗалогодатель.Заголовок = "Плательщик";
		Элементы.СуммаЗайма.Заголовок = "Долг по займу";
		Элементы.СуммаПроцентов.Заголовок = "Долг по процентам";
		Элементы.ИнформацияОЗалогодателе.Видимость = Истина;		
		Элементы.СтатусЗалогодателя.ТолькоПросмотр = Истина;
		Элементы.СхемаКредитования.ТолькоПросмотр = Истина;
		Элементы.ГруппаПараметрыВыкупаОплаты.Видимость = Истина;		
		Элементы.КнопкаРасчеты.Видимость = Истина; 
		Элементы.Промокод.Видимость = ложь;  
		Элементы.ТоварыСуммаОплаты.Видимость = Истина;
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога") Тогда
		Элементы.ДекорацияИиформацияЗалогодатель.Заголовок = "Информация о получателе";
		Элементы.СтраницаЗалогодатель.Заголовок = "Получатель";
		Элементы.СуммаЗайма.Заголовок = "Долг по займу";
		Элементы.СуммаПроцентов.Заголовок = "Долг по процентам";
		Элементы.ИнформацияОЗалогодателе.Видимость = Истина;		
		Элементы.СтатусЗалогодателя.ТолькоПросмотр = Истина;
		Элементы.СхемаКредитования.ТолькоПросмотр = Истина;
		Элементы.ГруппаПараметрыВыкупаОплаты.Видимость = ложь;		
		Элементы.КнопкаРасчеты.Видимость = ложь;  
		Элементы.ДатаВыкупаЛьготная.Видимость = Ложь;
		Элементы.Промокод.Видимость = ложь;
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление") Тогда
		Элементы.ГруппаПереоформление.Видимость = Истина;  
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ИзъятиеОбъектовЗалога") Тогда
	    Элементы.СтраницаИзъятие.Видимость = Истина;
		Элементы.СтраницаЗакладываемоеИмущество.Видимость = Ложь;
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога") Тогда
	    Элементы.СтраницаВозврат.Видимость = Истина;
		Элементы.СтраницаЗакладываемоеИмущество.Видимость = Ложь;	
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды 
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	ОбновитьДанныеТовары();
	ОбновитьДанныеВставки();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи) 
	Возврат;
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаПереоформления") Тогда
		Возврат;
	КонецЕсли;
	
	Объект.СуммаСсуды = Объект.Товары.Итог("СуммаСсуды");
		
	Если Параметры.Ключ.Пустая() тогда
		
		врДата = ТекущаяДата();
		
	Иначе
		
		врДата = Объект.Дата;
		
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		//Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог") ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление") Тогда
			Отказ = НЕ ПроверкаЗаполнения();
		//КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.ПроцентнаяСхема) Тогда 
			Если НЕ (СтатусЗБ = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыЗалоговыхБилетов.Изъят") ИЛИ СтатусЗБ = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыЗалоговыхБилетов.Возвращен")) Тогда
				Сообщить("Не выбрана схема расчета процентов!");
				Отказ = Истина;  
			КонецЕсли;	
		ИначеЕсли НЕ СуммаЗайма = 0 Тогда	           
			Если НЕ ПСК = 0 Тогда
	            СуммаПСКГод = СуммаЗайма*ПСК/100;  
			Иначе
				СуммаПСКГод = 0;
			КонецЕсли;				
			Если НЕ (СуммаПСКГод = 0) Тогда 
				Если РасчетПроцентовПоДоговоруГод() > СуммаПСКГод Тогда
			        Сообщить("Сумма процентов в год превышает предельную ставку кредитования!", СтатусСообщения.Важное);
				КонецЕсли;	
		    КонецЕсли;	 
		КонецЕсли;
		
		Если НЕ Объект.ДополнительныеМеталлы.Количество() = 0  Тогда 
			Для каждого Стр из объект.Товары Цикл 
				Если Стр.ЕстьДопМеталлы И НЕ Стр.ЕстьЭтикетка Тогда   
					Сообщить("В строке № " + Строка(Стр.НомерСтроки) + " есть дополнительные металлы, но нет этикетки!");
			        Отказ = Истина;
				КонецЕсли;	
			Конеццикла;
        КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
				
	КонецЕсли;	
		
	// Присвоение серий при проведении.
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог") И 
		ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Для каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл						
			Результат = СоздатьОбъектЗалога(СтрокаТабличнойЧасти.ПолучитьИдентификатор());				
			Если НЕ Результат Тогда
				Сообщить("Не создан объект залога по строке № " + Строка(СтрокаТабличнойЧасти.НомерСтроки), Статуссообщения.Важное);
				Отказ = Истина;
				Прервать
			КонецЕсли;	
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьОбъектЗалога(Идентификатор)
	СтрокаТабличнойЧастиТовары = Объект.Товары.НайтиПоИдентификатору(Идентификатор);
	Возврат ЛБ_УправлениеЛомбардом.СоздатьОбъектЗалога(Объект, СтрокаТабличнойЧастиТовары);
КонецФункции	

&НаСервере
Процедура ПроверитьКлиентаПоПеречням(Отказ)
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Залогодатель", Объект.Залогодатель);  
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КлиентыВПеречняхСрезПоследних.ВидПеречня КАК ВидПеречня
	               |ИЗ
	               |	РегистрСведений.ЛБ_КлиентыВПеречнях.СрезПоследних(
	               |			&Дата,
	               |			Залогодатель = &Залогодатель
	               |				И СтатусКлиентаВПеречне = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыКлиентаВПеречнях.Включен)) КАК ЛБ_КлиентыВПеречняхСрезПоследних"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Если Выборка.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.Террористы Тогда
			Сообщить("Клиент найден в перечне террористов. Операции с клиентом запрещены!", СтатусСообщения.Важное);  
			Отказ = Истина;
		ИначеЕсли Выборка.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ФРОМУ Тогда
			Сообщить("Клиент найден в перечне ФРОМУ. Операции с клиентом запрещены!", СтатусСообщения.Важное);  
			Отказ = Истина;
        ИначеЕсли Выборка.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.МВК Тогда
			Сообщить("Клиент найден в списке МВК. Операции с клиентом запрещены!", СтатусСообщения.Важное);  
			Отказ = Истина;	
		КонецЕсли;	
	Конеццикла;	
КонецПроцедуры	

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) 
	Возврат;
	Если ТекущийОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаПереоформления Тогда
		Если НЕ ЗначениеЗаполнено(ТекущийОбъект.ПредыдущаяОперация) Тогда
			Сообщить("Не выбран документ переоформления займа!");
			Отказ = Истина;
		КонецЕсли;                                            
		Возврат;
	ИначеЕсли ТекущийОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов Тогда
		Если ТекущийОбъект.СуммаОплаты = 0 Тогда
			Сообщить("Не определена сумма оплаты! Документ не может быть записан.");
			Отказ = Истина;
		КонецЕсли;  
	ИначеЕсли ТекущийОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда
		Если НЕ ЗначениеЗаполнено(ПлательщикПереоформление) Тогда
			Если ЗначениеЗаполнено(Объект.ОперацияВыкупаПереоформление) Тогда 
				ПлательщикПереоформление = Объект.ОперацияВыкупаПереоформление.Залогодатель;
				ДоверенностьПлательщикаПереоформление = Объект.ОперацияВыкупаПереоформление.ДоверенностьПредставителя;
			КонецЕсли;
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(Объект.ПредыдущаяОперация) Тогда
			Сообщить("Не определен предыдущий залоговый билет для создания операции выкупа! Документ не может быть записан.");
			Отказ = Истина;
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(ПлательщикПереоформление) Тогда
			Сообщить("Не определен плательщик для создания операции выкупа! Документ не может быть записан.");
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;
	
	Объект.ВозрастЗалогодателя = ЛБ_ОбщийМодуль.ВычислитьВозраст(Объект.ДатаРождения);
	Если Объект.ВозрастЗалогодателя  < 18 Тогда
	    Сообщить("Клиенту " + Строка(Объект.ВозрастЗалогодателя) + " лет, выдача займов несовершеннолетним не осуществляется!", СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;	
	
	ПроверитьКлиентаПоПеречням(Отказ);
	
	Если ТекущийОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда  
		Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			Если ЗначениеЗаполнено(Объект.ОперацияВыкупаПереоформление) Тогда 
		         ДокОбъектВыкупа = Объект.ОперацияВыкупаПереоформление.ПолучитьОбъект();
				 ТекущийОбъект.ОперацияВыкупаПереоформление = Документы.ЛБ_ОперацияПоЗалогу.ПустаяСсылка();
				 ОперацияВыкупа = СоздатьОперациюВыкупаЗалога(ДокОбъектВыкупа);
			Иначе	
			     ОперацияВыкупа = СоздатьОперациюВыкупаЗалога(); 
			КонецЕсли;	 
			Если ОперацияВыкупа = неопределено Тогда 
				Сообщить("Не создана операция выкупа залога", СтатусСообщения.Важное);
				Отказ = Истина;   
			Иначе
				ТекущийОбъект.ОперацияВыкупаПереоформление = ОперацияВыкупа;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	

	Если Отказ Тогда
		Возврат;
	КонецЕсли;      
	
	Если ТекущийОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог Или ТекущийОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда
		Если  НЕ ЗначениеЗаполнено(ТекущийОбъект.НомерЗалоговогоБилета) Тогда
			НомерЗБ = ЛБ_УправлениеЛомбардом.ПолучитьНовыйНомерЗалоговогоБилета(ТекущийОбъект.Ломбард);
			//Если НомерЗБ = неопределено Тогда
			//	Сообщить("Не определен номер залогового билета! Документ не может быть записан.");
			//	Отказ = Истина;
			//Иначе	
			//    ТекущийОбъект.НомерЗалоговогоБилета = НомерЗБ;
			//	//запишем залоговый билет в используемые
			//	НоваяЗапись = РегистрыСведений.ЛБ_ИспользованныеЗалоговыеБилеты.СоздатьМенеджерЗаписи();
			//    НоваяЗапись.Организация = Объект.Организация;
			//    НоваяЗапись.Ломбард = Объект.Ломбард;
			//	НоваяЗапись.Номер = НомерЗБ; 
			//	НоваяЗапись.Количество = 1;
			//    НоваяЗапись.Записать();
			//КонецЕсли;    
			Если ПустаяСтрока(НомерЗБ) Тогда
				Сообщить("Не определен номер залогового билета! Документ не может быть записан.");
				Отказ = Истина;
			Иначе	
			    ТекущийОбъект.НомерЗалоговогоБилета = НомерЗБ;
            КонецЕсли;
		КонецЕсли;
	КонецЕсли;       
	
	Если ТекущийОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов И Объект.СхемаКредитования.ПризнакПримененияГибкогоПроцента Тогда
		//заполним новый график платежей если нужно
		Если НЕ Объект.СхемаКредитования.БезПродленияДоговора Тогда
			Если Объект.Выкуп Тогда
	            ПродлитьДоговорДни = 0;				
			Иначе	
				ПроцентДляПродленияДоговора = ?(СуммаПроцентов = 0, 0, Объект.СуммаОплатыПроценты/СуммаПроцентов);
				Если ПроцентДляПродленияДоговора >= 0.9 Тогда 
					//КолДней = (НачалоДня(Объект.Дата)-НачалоДня(ДатаНачалаРасчета)) / (60 * 60 * 24);
					//СуммаПроцентовДень = СуммаПроцентов/?(КолДней = 0, 1, КолДней); 
					//Коэфф = Объект.СуммаОплатыПроценты/СуммаПроцентовДень;
					//ПродлитьДоговорДни = Цел(Коэфф)+ ?(Коэфф = Цел(Коэфф), 0, 1); 
					КолДней = Окр(Объект.СрокЗалога*ПроцентДляПродленияДоговора, 3);
					Если Цел(КолДней) = КолДней тогда
						ПродлитьДоговорДни = КолДней;
					Иначе 
						ПродлитьДоговорДни = Цел(КолДней) + 1; 
					КонецЕсли;	
				Иначе      
					ПродлитьДоговорДни = 0;
				КонецЕсли;   
			КонецЕсли;	
		Иначе
			ПродлитьДоговорДни = 0;
		КонецЕсли;
		
		Если  НЕ (ПродлитьДоговорДни = 0) Тогда
			ПричинаПримененияНовая = ЛБ_УправлениеЛомбардом.ПолучитьПричинуПримененияГибкийПроцент(Объект.СхемаКредитования, Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Продлен);
			ОтборС = Новый структура;
			ОтборС.Вставить("Причина", ПричинаПримененияНовая);
			СтрокиС = Объект.ПредыдущаяОперация.ПроцентныеСтавкиПоПериодам.НайтиСтроки(ОтборС);
			ДатаНачала = НачалоДня(Объект.Дата) + (60 * 60 * 24);
			НоваяДатаВыкупа = Объект.ДатаВыкупа + ПродлитьДоговорДни*(60 * 60 * 24);
			Для сч = 0 По СтрокиС.Количество()-1 Цикл 
				СтрС = СтрокиС.Получить(сч); 
				Если СтрС.ДеньНачалаПрименения = 1 Тогда
					ДатаНач = ДатаНачала;
				Иначе 
					ДатаНач = НачалоДня(ДатаНачала + СтрС.ДеньНачалаПрименения*(60 * 60 * 24));
				КонецЕсли;	
				Если ДатаНач > НоваяДатаВыкупа Тогда 
			 		Прервать;
				КонецЕсли;	
				
				сч1 = сч + 1;
				Если сч1 >= СтрокиС.Количество() Тогда
					ДатаКон = НоваяДатаВыкупа; 
					ДеньКон = (НоваяДатаВыкупа - ДатаНач) / (60 * 60 * 24);
				Иначе   
					СтрС1 = СтрокиС.Получить(сч1);
					ДатаКонца = НачалоДня(ДатаНачала + (СтрС1.ДеньНачалаПрименения-1)*(60 * 60 * 24)); 
					Если ДатаКонца > Объект.ДатаВыкупа Тогда
						ДатаКон = НоваяДатаВыкупа; 
					    ДеньКон = (НоваяДатаВыкупа - ДатаНач) / (60 * 60 * 24);
					Иначе
						ДатаКон = ДатаКонца; 
						ДеньКон = СтрС1.ДеньНачалаПрименения-1;
					КонецЕсли;	
				КонецЕсли;	
				
				Если НЕ (НачалоДня(ДатаКон) < НачалоДня(ДатаНач)) тогда		
					СтрП = Объект.ГрафикПлатежей.Добавить();   
					СтрП.ВидПроцентнойСтавки = СтрС.ВидПроцентнойСтавки; 
					СтрП.ДатаНач = ДатаНач;
					СтрП.ДатаКон = ДатаКон;
					СтрП.ДеньНач = СтрС.ДеньНачалаПрименения;  
					СтрП.ДеньКон = ДеньКон; 
					СтрП.ПроцентнаяСтавкаБазовая = СтрС.ПроцентнаяСтавка;
					СтрП.ПроцентнаяСтавкаАкция = СтрС.ПроцентнаяСтавкаАкция;
					СтрП.ОтклонениеАкцияОтносительное = СтрС.ОтклонениеАкцияОтносительное; 
					СтрП.ОтклонениеАкцияАбсолютное = СтрС.ОтклонениеАкцияАбсолютное;  
					ОтборП = Новый Структура;
					ОтборП.Вставить("ДеньНач", СтрС.ДеньНачалаПрименения);
					СтрокиП = Объект.НачислениеПроцентовДетально.НайтиСтроки(ОтборП);
					Если НЕ СтрокиП.Количество() = 0 Тогда
		                СтрП.СуммаПроцентов = СтрокиП.Получить(0).СуммаПроцентов;
						СтрП.СуммаПроцентовДень = СтрокиП.Получить(0).СуммаПроцентовДень; 
					КонецЕсли;	
				КонецЕсли;	
			Конеццикла;	
		КонецЕсли;	
	КонецЕсли;

	
	Если ТекущийОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов Или ТекущийОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда
	    Константы.ЛБ_УсловиеПроверкиОперацииПоЗалогу.Установить(Истина);
	КонецЕсли;   
КонецПроцедуры

&НаСервере
Функция СоздатьОперациюВыкупаЗалога(ДокОбъектВыкупа = неопределено) 
	Если НЕ ДокОбъектВыкупа = неопределено Тогда 
		НовыйОбъект = ДокОбъектВыкупа;
	Иначе	
	    НовыйОбъект = Документы.ЛБ_ОперацияПоЗалогу.СоздатьДокумент(); 
	КонецЕсли;	
	НовыйОбъект.Дата = Объект.Дата-1;
	НовыйОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов;
	НовыйОбъект.ПредыдущаяОперация = Объект.ПредыдущаяОперация;
	НовыйОбъект.Залогодатель = ПлательщикПереоформление; 
	ЗаполнитьКонтакнуюИнформациюПлательщика(НовыйОбъект); 
	НовыйОбъект.ВозрастЗалогодателя = ЛБ_ОбщийМодуль.ВычислитьВозраст(НовыйОбъект.ДатаРождения);
	НовыйОбъект.ДоверенностьПредставителя = ДоверенностьПлательщикаПереоформление;
	Если ПлательщикПереоформление = Объект.Залогодатель Тогда 
		НовыйОбъект.ДокументЗалогодателя = Объект.ДокументЗалогодателя; 
		НовыйОбъект.ДополнительныеДокументыПравоПребыванияРФ.Очистить();
		Отбор = Новый Структура;
		Отбор.Вставить("Клиент", Объект.Залогодатель);  
		Строки = Объект.ДополнительныеДокументыПравоПребыванияРФ.НайтиСтроки(Отбор);
		Для каждого стр Из Строки цикл  
			Новаястр = НовыйОбъект.ДополнительныеДокументыПравоПребыванияРФ.Добавить();
			Новаястр.Клиент = НовыйОбъект.Залогодатель;
			Новаястр.ВидДокумента = стр.ВидДокумента;
			Новаястр.ВидДокументаЗалогодателя = стр.ВидДокументаЗалогодателя; 
			Новаястр.ДокументГражданство = стр.ДокументГражданство;
			Новаястр.ДокументДатаВыдачи = стр.ДокументДатаВыдачи;
			Новаястр.ДокументЗалогодателя = стр.ДокументЗалогодателя; 
			Новаястр.ДокументКемВыдан = стр.ДокументКемВыдан;
			Новаястр.ДокументКодПодразделения = стр.ДокументКодПодразделения;
			Новаястр.ДокументНачалоДействия = стр.ДокументНачалоДействия;
			Новаястр.ДокументНомер = стр.ДокументНомер; 
			Новаястр.ДокументСерия = стр.ДокументСерия;
			Новаястр.ДокументСрокДействия = стр.ДокументСрокДействия;				
		КонецЦикла;		
	ИначеЕсли ПлательщикПереоформление = Объект.Представитель Тогда  
		НовыйОбъект.ДокументЗалогодателя = Объект.ДокументПредставителя;
		Отбор = Новый Структура;
		Отбор.Вставить("Клиент", Объект.Представитель);  
		Строки = Объект.ДополнительныеДокументыПравоПребыванияРФ.НайтиСтроки(Отбор);
		Для каждого стр Из Строки цикл  
			Новаястр = НовыйОбъект.ДополнительныеДокументыПравоПребыванияРФ.Добавить();
			Новаястр.Клиент = НовыйОбъект.Залогодатель;
			Новаястр.ВидДокумента = стр.ВидДокумента;
			Новаястр.ВидДокументаЗалогодателя = стр.ВидДокументаЗалогодателя; 
			Новаястр.ДокументГражданство = стр.ДокументГражданство;
			Новаястр.ДокументДатаВыдачи = стр.ДокументДатаВыдачи;
			Новаястр.ДокументЗалогодателя = стр.ДокументЗалогодателя; 
			Новаястр.ДокументКемВыдан = стр.ДокументКемВыдан;
			Новаястр.ДокументКодПодразделения = стр.ДокументКодПодразделения;
			Новаястр.ДокументНачалоДействия = стр.ДокументНачалоДействия;
			Новаястр.ДокументНомер = стр.ДокументНомер; 
			Новаястр.ДокументСерия = стр.ДокументСерия;
			Новаястр.ДокументСрокДействия = стр.ДокументСрокДействия;				
		КонецЦикла;		
	КонецЕсли;
	ЗаполнитьИнформациюОДокументеПлательщика(НовыйОбъект);
	
	НовыйОбъект.Товары.Загрузить(Объект.ПредыдущаяОперация.Товары.Выгрузить());
	НовыйОбъект.Вставки.Загрузить(Объект.ПредыдущаяОперация.Вставки.Выгрузить());
    НовыйОбъект.ДополнительныеМеталлы.Загрузить(Объект.ПредыдущаяОперация.ДополнительныеМеталлы.Выгрузить());
		   
	СтруктураРез = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗалоговогоБилета(НовыйОбъект, НовыйОбъект.ПредыдущаяОперация);
	НовыйОбъект.ДатаВыкупа = СтруктураРез.ДатаВыкупа;
	НовыйОбъект.ДатаВыкупаЛьготная = СтруктураРез.ДатаВыкупаЛьготныйСрок;
	НовыйОбъект.СуммаСсуды = СтруктураРез.СуммаЗайма;
	НовыйОбъект.СтатусЗалогодателя = ПолучитьТекущийСтатусКлиента(ТекущаяДата(), НовыйОбъект.Залогодатель);
	НовыйОбъект.Акция = НовыйОбъект.ПредыдущаяОперация.Акция;	
	НовыйОбъект.НомерЗалоговогоБилета = НовыйОбъект.ПредыдущаяОперация.НомерЗалоговогоБилета;
	НовыйОбъект.Организация = НовыйОбъект.ПредыдущаяОперация.Организация;
	НовыйОбъект.Ломбард = Объект.Ломбард;
	НовыйОбъект.СхемаКредитования = НовыйОбъект.ПредыдущаяОперация.СхемаКредитования;  
	НовыйОбъект.ПроцентнаяСхема = НовыйОбъект.ПредыдущаяОперация.ПроцентнаяСхема; 
	НовыйОбъект.ОтветственныйПользователь = ПараметрыСеанса.ТекущийПользователь;
	НовыйОбъект.ОтветственныйСотрудник    = ПараметрыСеанса.ТекущийСотрудник;
	НовыйОбъект.СуммаОплаты = СуммаОплатыПереоформление;
	НовыйОбъект.СуммаОплатыПроценты = СуммаОплатыПроцентыПереоформление;
	НовыйОбъект.СуммаОплатыСсуда = СуммаОплатыСсудаПереоформление;
	НовыйОбъект.Выкуп = Истина; 
	НовыйОбъект.ВыдачаЗалога = Истина; 	
		
	Попытка 
		НовыйОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Возврат НовыйОбъект.Ссылка; 
	Исключение     
		Возврат неопределено;
	КонецПопытки;
КонецФункции    

&НаСервере
Процедура ЗаполнитьКонтакнуюИнформациюПлательщика(ДокументВыкупа)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("Залогодатель", ДокументВыкупа.Залогодатель);
    Запрос.Текст = "ВЫБРАТЬ
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Пол КАК Пол,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество
                   |ИЗ
                   |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументВыкупа.Фамилия = Выборка.Фамилия;
        ДокументВыкупа.Имя = Выборка.Имя;
        ДокументВыкупа.Отчество = Выборка.Отчество;		
		ДокументВыкупа.ДатаРождения = Выборка.ДатаРождения;		
		ДокументВыкупа.Гражданство = Выборка.Гражданство;
		ДокументВыкупа.Пол = Выборка.Пол;
    КонецЕсли;
КонецПроцедуры	   

&НаСервере
Процедура ЗаполнитьИнформациюОДокументеПлательщика(ДокументВыкупа)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("ДокументЗалогодателя", ДокументВыкупа.ДокументЗалогодателя);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНачалоДействия КАК ДокументНачалоДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&Дата, ДокументЗалогодателя = &ДокументЗалогодателя) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументВыкупа.ДокументВидДокументаЗалогодателя = Выборка.ВидДокументаЗалогодателя;
		ДокументВыкупа.ДокументВид = Выборка.ВидДокумента;
		ДокументВыкупа.ДокументГражданство = Выборка.Гражданство;
		ДокументВыкупа.ДокументСерия = Выборка.ДокументСерия;
		ДокументВыкупа.ДокументНомер = Выборка.ДокументНомер;
		ДокументВыкупа.ДокументДатаВыдачи = Выборка.ДокументДатаВыдачи;
		ДокументВыкупа.ДокументКемВыдан = Выборка.ДокументКемВыдан;
		ДокументВыкупа.ДокументКодПодразделения = Выборка.ДокументКодПодразделения;
		ДокументВыкупа.ДокументНачалоДействия = Выборка.ДокументНачалоДействия;
		ДокументВыкупа.ДокументСрокДействия = Выборка.ДокументСрокДействия;
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЛБ_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект.ВидОперации, Объект, ЭтаФорма);
	
	УстановитьСостояниеДокумента(); 
	ОбновитьДанныеТовары();
	ОбновитьДанныеВставки();
		
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	//УправлениеКонтактнойИнформацией.ОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекстДоверенности(Доверенность)
	Доверенность = "Доверенность " + НРег(строка(Объект.ДоверенностьПредставителя.ВидДоверенности)) + " № " +
			   СокрЛП(Объект.ДоверенностьПредставителя.НомерДоверенности) + " от " + Формат(Объект.ДоверенностьПредставителя.ДатаДоверенности, "ДФ=dd.MM.yyyy") +
			   " действует до " + Формат(Объект.ДоверенностьПредставителя.СрокДействияДоверенности, "ДФ=dd.MM.yyyy");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораДоверенностейПлательщика() 
	Элементы.ДоверенностьПлательщикаПолучателя.СписокВыбора.Очистить();
	Если Объект.Залогодатель = Объект.ПредыдущаяОперация.Залогодатель Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("ЗалоговыйБилет", объект.ПредыдущаяОперация);
	Запрос.УстановитьПараметр("Клиент", Объект.ПредыдущаяОперация.Залогодатель);
	Запрос.УстановитьПараметр("Представитель", Объект.Залогодатель);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДоверенностиСрезПоследних.Доверенность КАК Доверенность
	               |ИЗ
	               |	РегистрСведений.ЛБ_Доверенности.СрезПоследних(
	               |			&Дата,
	               |			ЗалоговыйБилет = &ЗалоговыйБилет
	               |				И Клиент = &Клиент
	               |				И Доверенность.ПредставительКлиента = &Представитель
	               |				И СтатусДоверенности = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыДоверенностей.ДоверенностьОформлена)) КАК ЛБ_ДоверенностиСрезПоследних";  
	Выборка = Запрос.Выполнить().Выбрать(); 	
	Пока Выборка.Следующий() Цикл   
		Если Выборка.Доверенность.СрокДействияДоверенности  < НачалоДня(ДатаДок) Тогда
			Продолжить;
		КонецЕсли;	      
		ОписаниДоверенности = "Доверенность " + НРег(строка(Выборка.Доверенность.ВидДоверенности)) + " № " +
				   СокрЛП(Выборка.Доверенность.НомерДоверенности) + " от " + Формат(Выборка.Доверенность.ДатаДоверенности, "ДФ=dd.MM.yyyy") +
				   " действует до " + Формат(Выборка.Доверенность.СрокДействияДоверенности, "ДФ=dd.MM.yyyy"); 
		Элементы.ДоверенностьПлательщикаПолучателя.СписокВыбора.Добавить(Выборка.Доверенность, ОписаниДоверенности);
	Конеццикла;	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьСписокВыбораДоверенностейПредставителя() 
	Элементы.ДоверенностьПредставителя.СписокВыбора.Очистить();
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("ЗалоговыйБилет", Объект.ПредыдущаяОперация);
	Запрос.УстановитьПараметр("Клиент", Объект.Залогодатель);
	Запрос.УстановитьПараметр("Представитель", Объект.Представитель);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДоверенностиСрезПоследних.Доверенность КАК Доверенность
	               |ИЗ
	               |	РегистрСведений.ЛБ_Доверенности.СрезПоследних(
	               |			&Дата,
	               |			ЗалоговыйБилет = &ЗалоговыйБилет
	               |				И Клиент = &Клиент
	               |				И Доверенность.ПредставительКлиента = &Представитель
	               |				И СтатусДоверенности = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыДоверенностей.ДоверенностьОформлена)) КАК ЛБ_ДоверенностиСрезПоследних";  
	Выборка = Запрос.Выполнить().Выбрать(); 	
	Пока Выборка.Следующий() Цикл   
		Если Выборка.Доверенность.СрокДействияДоверенности  < НачалоДня(ДатаДок) Тогда
			Продолжить;
		КонецЕсли;	      
		ОписаниДоверенности = "Доверенность " + НРег(строка(Выборка.Доверенность.ВидДоверенности)) + " № " +
				   СокрЛП(Выборка.Доверенность.НомерДоверенности) + " от " + Формат(Выборка.Доверенность.ДатаДоверенности, "ДФ=dd.MM.yyyy") +
				   " действует до " + Формат(Выборка.Доверенность.СрокДействияДоверенности, "ДФ=dd.MM.yyyy"); 
		Элементы.ДоверенностьПредставителя.СписокВыбора.Добавить(Выборка.Доверенность, ОписаниДоверенности);
	Конеццикла;	
КонецПроцедуры	
	
&НаСервере
Процедура ВыбораЗалогодателяНаСервере(Результат) 
	Объект.Залогодатель = Результат.Залогодатель;
	Объект.Фамилия = Объект.Залогодатель.Фамилия;
	Объект.Имя = Объект.Залогодатель.Имя;
	Объект.Отчество = Объект.Залогодатель.Отчество;
	ФИО = Объект.Залогодатель.Наименование;
	ОчиститьДокументыЗалогодателя();
	ЗаполнитьИнфорациюОЗалогодателе(Результат); 
	 	
	НеРезидент = ?(Объект.Гражданство = ПредопределенноеЗначение("Справочник.СтраныМира.Россия"), ложь, истина);
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов") ИЛИ
		    Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога") Тогда
		Если НЕ Объект.Залогодатель = Объект.ПредыдущаяОперация.Залогодатель Тогда
			Элементы.ГруппаДоверенностьПлательщикаПолучателя.Видимость = Истина;
			ЗаполнитьСписокВыбораДоверенностейПлательщика();
			Если Элементы.ДоверенностьПлательщикаПолучателя.СписокВыбора.Количество() = 1 Тогда 
				Объект.ДоверенностьПредставителя = Элементы.ДоверенностьПлательщикаПолучателя.СписокВыбора.Получить(0).Значение;
				ЗаполнитьТекстДоверенности(ДоверенностьПлательщикаПолучателя);
			КонецЕсли;	
		КонецЕсли; 
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог") ИЛИ
		Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление") Тогда
		Объект.СтатусЗалогодателя = ПолучитьТекущийСтатусКлиента(Объект.Дата, Объект.Залогодатель); 
		ПолучитьДопСтатусыКлиента();   
		СтатусыКлиентаВСтроку();    		 
		ЗаполнитьСписокЛьготныхСтатусов();
		ПолучитьДоступныеПроцентныеСхемыАкции();
		Если НЕ ТаблицаВыбораСхемыКредитованияАкции.Количество() = 0 Тогда 
			Отбор = Новый Структура;
			Отбор.Вставить("СхемаКредитования", Объект.СхемаКредитования); 
			Отбор.Вставить("Акция", Объект.Акция);   
			СтрокиСК = ТаблицаВыбораСхемыКредитованияАкции.НайтиСтроки(Отбор);
			Если НЕ СтрокиСК.Количество() = 0 Тогда
				ЗаполнитьТаблицуСтавок();
			Иначе
				СтрокаСК = СтрокиСК.Получить(0);
				Объект.СхемаКредитования = СтрокаСК.СхемаКредитования;
				Объект.Акция = СтрокаСК.Акция;
				ЗаполнитьТаблицуСтавок();
				ОбработатьСхемуКредитованияНаСервере(ДатаДок);
			КонецЕсли;	
		Иначе
			Объект.ПроцентнаяСхема = 0;
		КонецЕсли;	
     	РасчетСуммыОценкиИтоговой();
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление") Тогда	        
		    РассчитатьСуммуПроцентовПереоформление();
		Иначе			
		    РассчитатьСуммуПроцентов();
		КонецЕсли;	
		Если НЕ СуммаЗайма = 0 Тогда	           
			Если НЕ ПСК = 0 Тогда
	            СуммаПСКГод = СуммаЗайма*ПСК/100;  
			Иначе
				СуммаПСКГод = 0;
			КонецЕсли;				
			Если НЕ (СуммаПСКГод = 0) Тогда 
				Если РасчетПроцентовПоДоговоруГод() > СуммаПСКГод Тогда
			        Сообщить("Сумма процентов в год превышает предельную ставку кредитования!", СтатусСообщения.Важное);
				КонецЕсли;	
		    КонецЕсли;	 
       КонецЕсли;
	КонецЕсли;	
КонецПроцедуры	
	
&НаКлиенте
Процедура ПослеВыбораЗалогодателя(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;   
	
	СписокСС = ПолучитьСлужебныеСтатусыКлиента(Результат.Залогодатель);  
	Если НЕ СписокСС.Количество() = 0 Тогда 
		ПредупреждениеП = "";
		Для каждого Элемент из СписокСС Цикл 
			СтрокаВозврата = ПроверитьСлужебныйСтатус(Элемент.Значение);
			Если СтрокаВозврата = "Запрет" Тогда 
				Предупреждение("Для клиента " + СокрЛП(Объект.Залогодатель) + " определен запрет на операцию " + Строка(Объект.ВидОперации), 60, "Проверка служебных статусов клиента");
				Возврат;  
			Иначе
				ПредупреждениеП = СтрокаВозврата;
			КонецЕсли;	
		КонецЦикла;   
		Если НЕ ПустаяСтрока(ПредупреждениеП) Тогда
			Ответ = Вопрос(ПредупреждениеП + " Продолжить?", РежимДиалогаВопрос.ОКОтмена, , "Проверка служебных статусов клиента"); 
			Если Ответ = КодВозвратаДиалога.Отмена Тогда  
			    Возврат;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;  
	
	ВыбораЗалогодателяНаСервере(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораПредставителя(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	Объект.Представитель = Результат.Залогодатель;
	Объект.ФамилияПредставителя = Объект.Залогодатель.Фамилия;
	Объект.ИмяПредставителя = Объект.Залогодатель.Имя;
	Объект.ОтчествоПредставителя = Объект.Залогодатель.Отчество;
	ФИОПредставителя = Объект.Представитель.Наименование;
	ОчиститьДокументыПредставителя();
	ЗаполнитьИнфорациюОПредставителе(Результат);
	ЗаполнитьСписокВыбораДоверенностейПредставителя();
	Если Элементы.ДоверенностьПредставителя.СписокВыбора.Количество() = 1 Тогда 
		Объект.ДоверенностьПредставителя = Элементы.ДоверенностьПредставителя.СписокВыбора.Получить(0).Значение;
		ЗаполнитьТекстДоверенности(Доверенность);
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура ПослеВыбораДоверенности(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	Объект.ДоверенностьПредставителя = Результат;
КонецПроцедуры

&НаКлиенте
Процедура ДоверенностьПлательщикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВыбЭлемент = ЭтаФорма.ВыбратьИзСписка(Элемент.СписокВыбора, Элемент, 0);
	Если НЕ ВыбЭлемент = Неопределено Тогда 
		Объект.ДоверенностьПредставителя = ВыбЭлемент.Значение;    
		ЗаполнитьТекстДоверенности(ДоверенностьПлательщикаПолучателя);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НайтиПоФИО(Команда)
		
	ПараметрыФормы = Новый Структура;
	Если ЗначениеЗаполнено(Объект.Залогодатель) Тогда
		ПараметрыФормы.Вставить("Залогодатель", Объект.Залогодатель);
	КонецЕсли;	
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЗалогодателя",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателя", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
		
КонецПроцедуры

&НаСервере
Функция ПолучитьДатупредыдущейОперации()
	Возврат Объект.ПредыдущаяОперация.Дата;
КонецФункции

&НаСервере
Функция ПолучитьЛьготнуюДатуВыкупа()
    Возврат ЛБ_УправлениеЛомбардом.ПолучитьЛьготныйСрокЗалоговогоБилета(Объект.ДатаВыкупа); 
КонецФункции

&НаСервере
Функция ЕстьОперацииСБолееПозднейДатой(ЗалоговыйБилет) 
	Возврат ЛБ_УправлениеЛомбардом.ПроверкаДатыОперацииПоЗалогу(Объект.Дата, ЗалоговыйБилет);
КонецФункции

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если Объект.Проведен Тогда
		Сообщить("Для изменения даты документа необходимо отменить проведение!"); 
		Объект.Дата = ТекДата;
		Возврат;
	КонецЕсли;

	// Если выбрали дату до даты последней операции - отказ в изменении.
	Если ЗначениеЗаполнено(Объект.ПредыдущаяОперация) Тогда
		Если Объект.Дата < ПолучитьДатупредыдущейОперации() Тогда		
			Предупреждение("Дата текущей операции не может быть меньше даты залогового билета.", 60);
			Объект.Дата = ТекДата;
			Возврат;
		КонецЕсли;
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаЗалога") тогда  
	        Часы = (Объект.Дата - Объект.ПредыдущаяОперация.Дата)/3600;   
			Если Часы > 1 Тогда 
			   Предупреждение("Отмена залогового билета со времени выдачи которого прошло больше 1 часа невозможна.", 60); 
			   Объект.Дата = ТекДата;
			   Возврат;
			КонецЕсли;   
 		ИначеЕсли ЕстьОперацииСБолееПозднейДатой(Объект.ПредыдущаяОперация) Тогда 
				Предупреждение("У залогового билета есть операции с более поздней датой.", 60);
				Объект.Дата = ТекДата;
				Возврат;  
		КонецЕсли;	
	ИначеЕсли ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ЕстьОперацииСБолееПозднейДатой(Объект.Ссылка) Тогда 
			Предупреждение("У залогового билета есть операции с более поздней датой.", 60);
			Объект.Дата = ТекДата;
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	
	//// Проверка на 365 дней. Нельзя продлевать один билет через оплату процентов дольше года
	//Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов") Тогда
	//	
	//	ДатаДокумента = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата());
	//	
	//	Если ЗалоговыйБилетОбъект.ДатаЗалога + 365*86400 <= ДатаДокумента Тогда
	//		
	//		Объект.Дата = ТекущаяДата();
	//		Сообщить("По данному залоговому билету невозможно продление - прошли 365 от даты залога (" + Формат(ЗалоговыйБилетОбъект.ДатаЗалога,"ДЛФ=ДД") + ")");
	//		
	//		Возврат;
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	ТекДата = Объект.Дата; 
	ДатаДок = Объект.Дата;
	ЗаполнитьИнформациюОКлиенте();  
		
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог") ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление") Тогда		

		// пересчитаем цену металлов и камней
		//Для каждого СтрокаТабличнойЧастиТовары Из Объект.Товары Цикл
		//	ЦенаДрагоценногоМеталла(СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор());
		//	
		//	ОтборВ = Новый Структура;
		//	ОтборВ.Вставить("КлючСтроки", СтрокаТабличнойЧастиТовары.КлючСтроки);
		//	Строки = Объект.Вставки.НайтиСтроки(ОтборВ);
		//	Для каждого СтрокаТабличнойЧасти Из Строки Цикл		
		//	    ЦенаДрагоценногоКамня(СтрокаТабличнойЧасти.ПолучитьИдентификатор(), СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор());
		//	КонецЦикла;	
		//	СтрокаТабличнойЧастиТовары.СуммаОценкиКамни = Объект.Вставки.Итог("Сумма");
		//	ПересчитатьСуммТовары(СтрокаТабличнойЧастиТовары); 
		//КонецЦикла;	   
		Объект.СтатусЗалогодателя = ПолучитьТекущийСтатусКлиента(ДатаДок, Объект.Залогодатель);
		ПолучитьДопСтатусыКлиента();  
		ЗаполнитьСписокЛьготныхСтатусов();
		СтатусыКлиентаВСтроку();

		ПолучитьДоступныеПроцентныеСхемыАкции();				
		Если НЕ ТаблицаВыбораСхемыКредитованияАкции.Количество() = 0 Тогда  
			Отбор = Новый Структура;
			Отбор.Вставить("СхемаКредитования", Объект.СхемаКредитования); 
			Отбор.Вставить("Акция", Объект.Акция);   
			СтрокиСК = ТаблицаВыбораСхемыКредитованияАкции.НайтиСтроки(Отбор);
			Если НЕ СтрокиСК.Количество() = 0 Тогда
				ЗаполнитьТаблицуСтавок();
			Иначе
				СтрокаСК = ТаблицаВыбораСхемыКредитованияАкции.Получить(0);
				Объект.СхемаКредитования = СтрокаСК.СхемаКредитования;
				Объект.Акция = СтрокаСК.Акция;
				ЗаполнитьТаблицуСтавок();
				ОбработатьСхемуКредитованияНаСервере(ДатаДок); 
				ЗаполнитьДатуВыкупа();
			    Объект.ДатаВыкупаЛьготная = ПолучитьЛьготнуюДатуВыкупа(); 
			КонецЕсли;	
   		Иначе
			Объект.СхемаКредитования = ПредопределенноеЗначение("Справочник.ЛБ_СхемыКредитования.ПустаяСсылка");
			Объект.Акция = ПредопределенноеЗначение("Справочник.ЛБ_Акции.ПустаяСсылка");
			Объект.ПроцентныеСтавкиПоПериодам.Очистить();
			ТаблицаСтавок.Очистить();
			Объект.ДатаВыкупа = Дата(1,1,1); 
			Объект.ДатаВыкупаЛьготная = Дата(1,1,1);   
			Объект.СрокЗалога = 0;
			Объект.ПроцентнаяСхема = 0;
			Сообщить("Не определена процентная схема! Расчет процентов по договору займа не возможен.");
		КонецЕсли;
		РасчетСуммыОценкиИтоговой(); 	
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог") Тогда
			РассчитатьСуммуПроцентов();	   
		Иначе     
			РассчитатьСуммуПроцентовПереоформление();
		КонецЕсли;
		Если НЕ СуммаЗайма = 0 Тогда	           
			Если НЕ ПСК = 0 Тогда
	            СуммаПСКГод = СуммаЗайма*ПСК/100;  
			Иначе
				СуммаПСКГод = 0;
			КонецЕсли;				
			Если НЕ (СуммаПСКГод = 0) Тогда 
				Если РасчетПроцентовПоДоговоруГод() > СуммаПСКГод Тогда
			        Сообщить("Сумма процентов в год превышает предельную ставку кредитования!", СтатусСообщения.Важное);
				КонецЕсли;	
		    КонецЕсли;	 
		КонецЕсли;  	

	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов") Тогда 
		ОбработатьИзменениеДатыОплата(ДатаДок);
		РассчитатьСуммуПроцентовОплата(); 
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ИзъятиеОбъектовЗалога") Тогда
		Объект.ДатаИзъятия = НачалоДня(ДатаДок);   
		Объект.ДатаПротоколИзъятия = НачалоДня(ДатаДок);
	КонецЕсли;   
КонецПроцедуры     

&НаСервере
Процедура ОбработатьИзменениеДатыОплата(ДатаДок)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("ЗалоговыйБилет", Объект.ПредыдущаяОперация);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаНачалаРасчетаПроцентов КАК ДатаНачалаРасчета,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаВыкупа КАК ДатаВыкупа,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаВыкупаЛьготныйСрок КАК ДатаВыкупаЛьготныйСрок
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&Дата, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();  
	Если Выборка.Следующий() Тогда
		ДатаНачалаРасчета = Выборка.ДатаНачалаРасчета; 
		Объект.ДатаВыкупа = Выборка.ДатаВыкупа;
		Объект.ДатаВыкупаЛьготная = Выборка.ДатаВыкупаЛьготныйСрок;   
		
		//НачисленоПроценты = ЛБ_УправлениеЛомбардом.ПолучитьНачисленныеПроцентыПоДоговору(Объект, Объект.ПредыдущаяОперация);
		СтруктураП = ЛБ_УправлениеЛомбардом.ПолучитьПредельныеЗначенияПроцентов(ДатаДок, Объект.Организация);
		Если НЕ СтруктураП = неопределено Тогда
		    ПланкаПроцентов = СтруктураП.ПланкаПроцентов;
			ПредельноеЗначениеПроцентов = СуммаЗайма*ПланкаПроцентов;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура РассчитатьСуммуПроцентов()
	Объект.ГрафикПлатежей.Очистить();
	Если НЕ Объект.ПроцентнаяСхема = 0 Тогда                                                                                                                
		СтруктураОкругления = новый Структура;
		СтруктураОкругления.Вставить("ОкруглятьЦены", ОкруглятьЦены);  
		СтруктураОкругления.Вставить("ВидОкругленияСуммыПроцентов", ВидОкругленияСуммыПроцентов);
		СтруктураОкругления.Вставить("ПорядокОкругления", ПорядокОкругления);  
		СтруктураОкругления.Вставить("ОкруглятьВБольшуюСторону", ОкруглятьВБольшуюСторону);  
		
		//ДатаНачала = НачалоДня(ДатаДок);  
		//Если НачислятьПроцентыЗаДеньЗалога Тогда  
		//	ДатаНачала = НачалоДня(ДатаНачала);
		//Иначе	
		//	ДатаНачала = НачалоДня(ДатаНачала + (60 * 60 * 24));
		//КонецЕсли;  
		ДатаНачала = ЛБ_УправлениеЛомбардом.ПолучитьДатуНачалаРасчетаПроцентов(Объект.Дата, Объект.СхемаКредитования);
		
		СуммаПроцентов = 0;
		Для сч = 0 По ТаблицаСтавок.Количество()-1 Цикл 
			СтрС = ТаблицаСтавок.Получить(сч); 
			Если СтрС.ДеньНачалаПрименения = 1 Тогда
				ДатаНач = ДатаНачала;
			Иначе 
				ДатаНач = НачалоДня(ДатаНачала + СтрС.ДеньНачалаПрименения*(60 * 60 * 24));
			КонецЕсли;	
			Если ДатаНач > Объект.ДатаВыкупа Тогда 
		 		Прервать;
			КонецЕсли;	
			
			сч1 = сч + 1;
			Если сч1 >= ТаблицаСтавок.Количество() Тогда
				ДатаКон = Объект.ДатаВыкупа; 
				ДеньКон = Объект.СрокЗалога;
			Иначе   
				СтрС1 = ТаблицаСтавок.Получить(сч1);
				ДатаКонца = НачалоДня(ДатаНачала + (СтрС1.ДеньНачалаПрименения-1)*(60 * 60 * 24)); 
				Если ДатаКонца > Объект.ДатаВыкупа Тогда
					ДатаКон = Объект.ДатаВыкупа;
					ДеньКон = Объект.СрокЗалога;
				Иначе
					ДатаКон = ДатаКонца; 
					ДеньКон = СтрС1.ДеньНачалаПрименения-1;
				КонецЕсли;	
			КонецЕсли;	
			
			Если НЕ (НачалоДня(ДатаКон) < НачалоДня(ДатаНач)) тогда
				СтавкаП = СтрС.ПроцентнаяСтавка; 
				Если СтрС.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Акционная Тогда
					Если НЕ СтрС.ПроцентнаяСтавкаАкция = 0 Тогда
						СтавкаП = СтрС.ПроцентнаяСтавкаАкция;
					ИначеЕсли НЕ СтрС.ОтклонениеАкцияОтносительное = 0 Тогда	 
						СтавкаП = СтрС.ПроцентнаяСтавка + СтрС.ПроцентнаяСтавка*СтрС.ОтклонениеАкцияОтносительное/100;
					ИначеЕсли НЕ СтрС.ОтклонениеАкцияАбсолютное = 0 Тогда
						СтавкаП = СтрС.ПроцентнаяСтавка + СтрС.ОтклонениеАкцияАбсолютное;
				    КонецЕсли; 
				КонецЕсли;	
			    Результат = ЛБ_ОбщийМодуль.РассчитатьСуммуПроцентов(ДатаНач, ДатаКон, СтавкаП, СуммаЗайма, СтруктураОкругления);
				СуммаПроцентов = СуммаПроцентов + Результат.СуммаПроцентов; 
				Если СтрС.ДеньНачалаПрименения = 1 Тогда
		            СуммаПроцентовДень = Результат.СуммаПроцентовДень;				
				КонецЕсли;	
				СтрП = Объект.ГрафикПлатежей.Добавить();   
				СтрП.ВидПроцентнойСтавки = СтрС.ВидПроцентнойСтавки; 
				СтрП.ДатаНач = ДатаНач;
				СтрП.ДатаКон = ДатаКон;
				СтрП.ДеньНач = СтрС.ДеньНачалаПрименения;  
				СтрП.ДеньКон = ДеньКон; 
				СтрП.ПроцентнаяСтавкаБазовая = СтрС.ПроцентнаяСтавка;
				СтрП.ПроцентнаяСтавкаАкция = СтрС.ПроцентнаяСтавкаАкция;
				СтрП.ОтклонениеАкцияОтносительное = СтрС.ОтклонениеАкцияОтносительное; 
				СтрП.ОтклонениеАкцияАбсолютное = СтрС.ОтклонениеАкцияАбсолютное;
                СтрП.СуммаПроцентов = Результат.СуммаПроцентов;
				СтрП.СуммаПроцентовДень = СуммаПроцентовДень;
			КонецЕсли;	
		Конеццикла;	
	Иначе
		СуммаПроцентов = 0;
		СуммаПроцентовДень = 0;
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура РассчитатьСуммуПроцентовПереоформление()  
	СтруктураРез = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗалоговогоБилета(Объект, Объект.ПредыдущаяОперация); 
	ДатаНачалаРасчетаНач = СтруктураРез.ДатаНачалаРасчета; 
	СуммаОплатыСсудаПереоформление = СтруктураРез.СуммаЗайма;
		
	СуммаОплатыПроцентыПереоформление = ЛБ_ОбщийМодуль.ПолучитьОстатокПроцентов(Объект, Объект.ПредыдущаяОперация); 

	Если ЗначениеЗаполнено(Объект.ПредыдущаяОперация.ПроцентнаяСхема) Тогда 
		ПроцентнаяСхемаРезультат = Объект.ПредыдущаяОперация.ПроцентнаяСхема; 		
		ДатаНач = ДатаНачалаРасчетаНач;  
		ДатаКон = Объект.Дата;
		Если ОкруглятьЦены Тогда
	        СуммаПроцентовП = ЛБ_ОбщийМодуль.РасчетПроцентов(ДатаНач, ДатаКон, ПроцентнаяСхемаРезультат, СуммаОплатыСсудаПереоформление, ОкруглятьЦены, ВидОкругленияСуммыПроцентов, ПорядокОкругления, ОкруглятьВБольшуюСторону); 
		Иначе
			СуммаПроцентовП = ЛБ_ОбщийМодуль.РасчетПроцентов(ДатаНач, ДатаКон, ПроцентнаяСхемаРезультат, СуммаОплатыСсудаПереоформление, ОкруглятьЦены);
		КонецЕсли;	
	Иначе
		СуммаПроцентовП = 0;
	КонецЕсли;	
	СуммаОплатыПроцентыПереоформление = СуммаОплатыПроцентыПереоформление + СуммаПроцентовП;   
	СуммаОплатыПереоформление = СуммаОплатыСсудаПереоформление + СуммаОплатыПроцентыПереоформление;
	КВыдачеОплате = СуммаЗайма - СуммаОплатыПереоформление;
	Если КВыдачеОплате > 0 Тогда
	    Элементы.ДекорацияКВыдачеОплате.Заголовок = "К выдаче " + СокрЛП(Формат(КВыдачеОплате, "ЧЦ=15; ЧДЦ=2; ЧРД=,")) + " руб."; 
	Иначе     
		КВыдачеОплате = ?(КВыдачеОплате < 0, -КВыдачеОплате, КВыдачеОплате);
		Элементы.ДекорацияКВыдачеОплате.Заголовок = "К доплате " + СокрЛП(Формат(КВыдачеОплате, "ЧЦ=15; ЧДЦ=2; ЧРД=,")) + " руб.";
	КонецЕсли;	
КонецПроцедуры	 


&НаСервере
Процедура РассчитатьСуммуПроцентовОплата()  
	Если СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят ИЛИ СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен Тогда
		СуммаПроцентов = ЛБ_ОбщийМодуль.ПолучитьОстатокПроцентов(Объект, Объект.ПредыдущаяОперация);
		
		Если НЕ СуммаПроцентов = 0 Тогда
			СтрП = Объект.НачислениеПроцентовДетально.Добавить();   
			СтрП.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Базовая; 
			СтрП.ДатаНач = ДатаНачалаРасчета;
			СтрП.ДатаКон = Объект.Дата;
			СтрП.ДеньНач = 1;  
			СтрП.ДеньКон = (НачалоДня(СтрП.ДатаКон) - НачалоДня(СтрП.ДатаНач)) / (60 * 60 * 24) + 1; 
			СтрП.СуммаПроцентов = СуммаПроцентов;
			//СтрП.СуммаПроцентовДень = СуммаПроцентов/СтрП.ДеньКон; 
			//СтрП.ПроцентнаяСтавкаБазовая = СтрП.СуммаПроцентовДень/СтрП.СуммаПроцентов*100;
		КонецЕсли;
		Возврат;
	КонецЕсли;		
	
	Элементы.ДекорацияСообщениеПроценты.Заголовок = ""; 
			
	СтруктураОкругления = новый Структура;
	СтруктураОкругления.Вставить("ОкруглятьЦены", ОкруглятьЦены);  
	СтруктураОкругления.Вставить("ВидОкругленияСуммыПроцентов", ВидОкругленияСуммыПроцентов);
	СтруктураОкругления.Вставить("ПорядокОкругления", ПорядокОкругления);  
	СтруктураОкругления.Вставить("ОкруглятьВБольшуюСторону", ОкруглятьВБольшуюСторону);
	
	Установки = новый Структура; 
	Установки.Вставить("НеНачислятьПроцентыЗаПоследнийДень", НеНачислятьПроцентыЗаПоследнийДень);
	Установки.Вставить("СчитатьПроцентыДеньВыдачиРавенДеньВыкупа", СчитатьПроцентыДеньВыдачиРавенДеньВыкупа);  
		
	Результат = ЛБ_ОбщийМодуль.РассчитатьСуммуПроцентовОплата(Объект, ДатаНачалаРасчета, ПредельноеЗначениеПроцентов, ПричинаПримененияПроцентнойСхемы, Установки, СтруктураОкругления);
	СуммаПроцентов = Результат.СуммаПроцентов;
	СуммаПроцентовДень = Результат.СуммаПроцентовДень;
	Если Результат.ПредельноеЗначениеПоДоговору Тогда
	    Элементы.ДекорацияСообщениеПроценты.Заголовок = "Достигнуто предельное значение суммы процентов по договору.";
    КонецЕсли;	
КонецПроцедуры    
	

&НаКлиенте
Процедура ДатаВыкупаПриИзменении(Элемент)
	
	//ДатаВыкупаПРиИзмененииНаСервере();
	// Перенесено в ДатаВыкупаПРиИзмененииНаСервере
	//ИзменитьСхемуКредитованияНаСервере();
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыКатегорияПриИзменении(Элемент)	
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	ЦенаДрагоценногоМеталла(СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор());

	ОтборВ = Новый Структура;
	ОтборВ.Вставить("КлючСтроки", СтрокаТабличнойЧастиТовары.КлючСтроки);
	Строки = Объект.ДополнительныеМеталлы.НайтиСтроки(ОтборВ);
	Для каждого СтрокаТабличнойЧасти Из Строки Цикл		
	    ЦенаДрагоценногоМеталла(СтрокаТабличнойЧасти.ПолучитьИдентификатор());
		СтрокаТабличнойЧастиТовары.СуммаОценкиМеталлы = СтрокаТабличнойЧастиТовары.СуммаОценкиМеталлы + СтрокаТабличнойЧасти.СуммаОценкиМеталлы;
	КонецЦикла;	
	//ПересчитатьСуммТовары(СтрокаТабличнойЧастиТовары); 
КонецПроцедуры

&НаКлиенте
Процедура СвернутьРазвернутьПанелиВставкиДопМеталлы(СтрокаТабличнойЧастиТовары)
	Если СтрокаТабличнойЧастиТовары <> неопределено Тогда
		Если СтрокаТабличнойЧастиТовары.ЕстьВставки Тогда
			Элементы.ГруппаВставок.Показать();
			Элементы.ГруппаВставок.Доступность = Истина;
		Иначе
			Элементы.ГруппаВставок.Скрыть();
			Элементы.ГруппаВставок.Доступность = ложь;
		КонецЕсли;	
		
		Если СтрокаТабличнойЧастиТовары.ЕстьДопМеталлы Тогда
			Элементы.ГруппаДопМеталлы.Показать(); 
			Элементы.ГруппаДопМеталлы.Доступность = Истина;
			Элементы.ТоварыГруппаЭтикетка.Видимость = Истина;
			Элементы.ТоварыГруппаЭ.Доступность = Истина;
		Иначе
			Элементы.ГруппаДопМеталлы.Скрыть();
			Элементы.ГруппаДопМеталлы.Доступность = ложь;
			Если СтрокаТабличнойЧастиТовары.ЕстьЭтикетка тогда
				СтрокаТабличнойЧастиТовары.ЕстьЭтикетка = ложь;
			КонецЕсли;	   
			Если ЗначениеЗаполнено(СтрокаТабличнойЧастиТовары.Этикетка) тогда 
				УдалитьСканЭтикетки(СтрокаТабличнойЧастиТовары.Этикетка);
				СтрокаТабличнойЧастиТовары.Этикетка = ПредопределенноеЗначение("Справочник.ЛБ_ХранилищеЭтикеток.ПустаяСсылка"); 
			КонецЕсли;	
			Элементы.ТоварыГруппаЭтикетка.Видимость = ложь;  
			Элементы.ТоварыГруппаЭ.Доступность = ложь;
		КонецЕсли;	
	Иначе
		Элементы.ГруппаВставок.Скрыть();
		Элементы.ГруппаДопМеталлы.Скрыть(); 
		Элементы.ТоварыГруппаЭ.Доступность = ложь;
	КонецЕсли;	
КонецПроцедуры
	
&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
		
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	
	СвернутьРазвернутьПанелиВставкиДопМеталлы(СтрокаТабличнойЧастиТовары);
		
	Если СтрокаТабличнойЧастиТовары <> неопределено Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",СтрокаТабличнойЧастиТовары.КлючСтроки);
		Элементы.Вставки.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);		
		Элементы.ДополнительныеМеталлы.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
		
	Иначе
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",0);
		Элементы.Вставки.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
		Элементы.ДополнительныеМеталлы.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		Элемент.ТекущиеДанные.Количество = 1;
		Элемент.ТекущиеДанные.ЕдиницаИзмерения = ОсновнаяЕдиницаИзмеренияМеталлы;
		Элемент.ТекущиеДанные.КлючСтроки = ЗаполнитьКлючСтрокиТоваров(); 
		Элемент.ТекущиеДанные.Именник = ПредопределенноеЗначение("Перечисление.ЛБ_Именник.Нет"); 
		Элемент.ТекущиеДанные.СостояниеИзделия = ПредопределенноеЗначение("Перечисление.ЛБ_СостояниеИзделия.БУ");
	КонецЕсли;
	
	Если НоваяСтрока И НЕ Копирование Тогда
		
		Элемент.ТекущиеДанные.Авторасчет = Истина;
		
	КонецЕсли;
	
	Если НоваяСтрока И Копирование Тогда
		
		Элемент.ТекущиеДанные.ОбъектЗалога = ПредопределенноеЗначение("Справочник.ЛБ_ОбъектыЗалога.ПустаяСсылка");		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере 
Процедура УдалитьОбъектЗалога(ОбъектЗалогаСсылка)
	СпрОбъект = ОбъектЗалогаСсылка.ПолучитьОбъект();
	СпрОбъект.УстановитьПометкуУдаления(Истина);
КонецПроцедуры	
	
&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	
	Если СтрокаТабличнойЧастиТовары <> Неопределено Тогда
		//Удалим объект залога
		Если ЗначениеЗаполнено(СтрокаТабличнойЧастиТовары.ОбъектЗалога) Тогда
			УдалитьОбъектЗалога(СтрокаТабличнойЧастиТовары.ОбъектЗалога);
		КонецЕсли;	

		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки", СтрокаТабличнойЧастиТовары.КлючСтроки);
		
		НайденныеСтроки = Объект.Вставки.НайтиСтроки(Отбор);
		
		Для каждого Строка Из НайденныеСтроки Цикл
			Объект.Вставки.Удалить(Строка);	
		КонецЦикла; 
		
		НайденныеСтроки = Объект.ДополнительныеМеталлы.НайтиСтроки(Отбор);
		
		Для каждого Строка Из НайденныеСтроки Цикл
			Объект.ДополнительныеМеталлы.Удалить(Строка);	
		КонецЦикла; 

	КонецЕсли; 
	
КонецПроцедуры

&НаСервере 
Процедура ОбработатьИзменениеСуммыЗайма() 
	РасчетСуммыОценкиИтоговой();  
	Если НЕ СуммаЗайма = 0 Тогда	           
		Если НЕ ПСК = 0 Тогда
            СуммаПСКГод = СуммаЗайма*ПСК/100;  
		Иначе
			СуммаПСКГод = 0;
		КонецЕсли;				
		Если НЕ (СуммаПСКГод = 0) Тогда 
			Если РасчетПроцентовПоДоговоруГод() > СуммаПСКГод Тогда
		        Сообщить("Сумма процентов в год превышает предельную ставку кредитования!", СтатусСообщения.Важное);
			КонецЕсли;	
	    КонецЕсли;	 
    КонецЕсли;
		
	ПолучитьДоступныеПроцентныеСхемыАкции(); 
	Если НЕ ТаблицаВыбораСхемыКредитованияАкции.Количество() = 0 Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("СхемаКредитования", Объект.СхемаКредитования); 
		Отбор.Вставить("Акция", Объект.Акция);   
		СтрокиСК = ТаблицаВыбораСхемыКредитованияАкции.НайтиСтроки(Отбор);
		Если НЕ СтрокиСК.Количество() = 0 Тогда
			ЗаполнитьТаблицуСтавок();
		Иначе 
			СтрокаСК = ТаблицаВыбораСхемыКредитованияАкции.Получить(0);
			Объект.СхемаКредитования = СтрокаСК.СхемаКредитования;
			Объект.Акция = СтрокаСК.Акция; 
			ОбработатьСхемуКредитованияНаСервере(ДатаДок);
			ЗаполнитьТаблицуСтавок();
		КонецЕсли;	
	Иначе
		Объект.СхемаКредитования = ПредопределенноеЗначение("Справочник.ЛБ_СхемыКредитования.ПустаяСсылка");
		Объект.Акция = ПредопределенноеЗначение("Справочник.ЛБ_Акции.ПустаяСсылка");
		Объект.ПроцентныеСтавкиПоПериодам.Очистить();
		ТаблицаСтавок.Очистить();
		Объект.ДатаВыкупа = Дата(1,1,1); 
		Объект.ДатаВыкупаЛьготная = Дата(1,1,1);  
		Объект.СрокЗалога = 0;
		Объект.ПроцентнаяСхема = 0;
		Сообщить("Не определена процентная схема! Расчет процентов по договору займа не возможен.");
	КонецЕсли;	
	   
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление") Тогда	        
	    РассчитатьСуммуПроцентовПереоформление();
	Иначе
		РассчитатьСуммуПроцентов(); 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	ОбработатьИзменениеСуммыЗайма();
КонецПроцедуры


&НаСервере
Процедура ЦенаДрагоценногоМеталла(Идентификатор, ИмяТабличнойЧасти = "Товары") 
	СтрокаТабличнойЧасти 			  = Объект[ИмяТабличнойЧасти].НайтиПоИдентификатору(Идентификатор);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Дата", Объект.Дата);
	СтруктураПараметров.Вставить("Ломбард", Объект.Ломбард);
	СтруктураПараметров.Вставить("СхемаКредитования", Объект.СхемаКредитования);
	СтруктураПараметров.Вставить("Проба", СтрокаТабличнойЧасти.Проба);
	СтруктураПараметров.Вставить("Категория", СтрокаТабличнойЧасти.Категория);
	СтруктураПараметров.Вставить("ЕдиницаИзмерения", СтрокаТабличнойЧасти.ЕдиницаИзмерения);

	СтрокаТабличнойЧасти.Цена = ЛБ_ОбщийМодуль.ПолучитьЦенуМеталлаИзПрейскуранта(СтруктураПараметров);
	СтрокаТабличнойЧасти.СуммаОценкиМеталлы = СтрокаТабличнойЧасти.ВесЧистый*СтрокаТабличнойЧасти.Цена; 

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПробаПриИзменении(Элемент)

	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	ЦенаДрагоценногоМеталла(СтрокаТабличнойЧасти.ПолучитьИдентификатор());
	//ПересчитатьСуммТовары();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	//РассчитатьСумму(СтрокаТабличнойЧасти.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВесВЧистоте(ВесЧистый, Идентификатор, ИмяТаблицы = "Товары")
	СтрокаТабличнойЧасти = Объект[ИмяТаблицы].НайтиПоИдентификатору(Идентификатор);
	
	Возврат ЛБ_ОбщийМодуль.ПеревестиВЧистоту(ВесЧистый, СтрокаТабличнойЧасти.Проба);
Конецфункции	

&НаКлиенте
Процедура ТоварыВесПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.ВесЧистый = СтрокаТабличнойЧасти.Вес;
	
	СтруктураР = ПолучитьВесИСуммуВставокИзделия(СтрокаТабличнойЧасти.КлючСтроки);
	СтрокаТабличнойЧасти.ВесЧистый = окр(СтрокаТабличнойЧасти.ВесЧистый - СтруктураР.Вес, 2, РежимОкругления.Окр15как10);
	
	ОтборДоп = Новый Структура;
	ОтборДоп.Вставить("КлючСтроки", СтрокаТабличнойЧасти.КлючСтроки);
	СтрокиДоп = Объект.ДополнительныеМеталлы.НайтиСтроки(ОтборДоп);
	ОснМеталлВесЧистый = СтрокаТабличнойЧасти.ВесЧистый;
	Для каждого СтрДоп Из СтрокиДоп Цикл
		ОснМеталлВесЧистый = ОснМеталлВесЧистый - СтрДоп.ВесЧистый;
	Конеццикла;	
	//СтрокаТабличнойЧасти.ВесВПробеЧистоты = ПолучитьВесВЧистоте(ОснМеталлВесЧистый, СтрокаТабличнойЧасти.ПолучитьИдентификатор()); 
	//Для каждого СтрДоп Из СтрокиДоп Цикл
	//	СтрокаТабличнойЧасти.ВесВПробеЧистоты = СтрокаТабличнойЧасти.ВесВПробеЧистоты + СтрДоп.ВесВПробеЧистоты;
	//Конеццикла;	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Копирование;
		
КонецПроцедуры


&НаКлиенте
Процедура ВставкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	
	Отказ = (СтрокаТабличнойЧастиТовары = Неопределено) ИЛИ Копирование; 
	
	Если НЕ Отказ тогда   
		ВидВст = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыКомплектующихИзделия.Вставка");
		Если НЕ ВвестиЗначение(ВидВст, "Выберите вид вставки", Тип("ПеречислениеСсылка.ЛБ_ВидыКомплектующихИзделия")) Тогда
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВставкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	    СтрокаТабличнойЧасти       = Элементы.Вставки.ТекущиеДанные;
	
	    ЗаполнитьКлючСтрокиВставки(СтрокаТабличнойЧасти,СтрокаТабличнойЧастиТовары);
        СтрокаТабличнойЧасти.Количество = 1;
		СтрокаТабличнойЧасти.Вид = ВидВст; 
		
		Если ВидВст = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыКомплектующихИзделия.Вставка") Тогда  
			ПараметрыФормы = новый структура;
			ПараметрыФормы.Вставить("КатегорияОбъектаЗалога", СтрокаТабличнойЧастиТовары.Категория); 
			ПараметрыФормы.Вставить("Клеймо", СтрокаТабличнойЧастиТовары.Именник);
			ПараметрыФормы.Вставить("Количество", СтрокаТабличнойЧасти.Количество); 
			ПараметрыФормы.Вставить("НоваяСтрока", Истина);
			ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораВставки",ЭтаФорма);
	        ОткрытьФорму("ОбщаяФорма.ЛБ_КорректировкаВставки", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	     КонецЕсли;	
	КонецЕсли;	 
 КонецПроцедуры     
 
 &НаКлиенте
Процедура ВставкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)  
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти       = Элементы.Вставки.ТекущиеДанные; 
	Если СтрокаТабличнойЧасти.Вид = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыКомплектующихИзделия.Вставка") Тогда  
		ПараметрыФормы = новый структура;
		ПараметрыФормы.Вставить("КатегорияОбъектаЗалога", СтрокаТабличнойЧастиТовары.Категория); 
		ПараметрыФормы.Вставить("Клеймо", СтрокаТабличнойЧастиТовары.Именник);
		ПараметрыФормы.Вставить("Количество", СтрокаТабличнойЧасти.Количество); 
		ПараметрыФормы.Вставить("ВидВставки", СтрокаТабличнойЧасти.ВидВставки); 
		ПараметрыФормы.Вставить("ФормаОгранки", СтрокаТабличнойЧасти.ФормаОгранки);
		ПараметрыФормы.Вставить("ВидОгранки", СтрокаТабличнойЧасти.ВидОгранки);
		ПараметрыФормы.Вставить("КачествоОгранки", СтрокаТабличнойЧасти.КачествоОгранки); 
		ПараметрыФормы.Вставить("Диаметр", СтрокаТабличнойЧасти.Диаметр);
		ПараметрыФормы.Вставить("Диаметр1", СтрокаТабличнойЧасти.Диаметр1);
		ПараметрыФормы.Вставить("Диаметр2", СтрокаТабличнойЧасти.Диаметр2); 
		ПараметрыФормы.Вставить("Длина", СтрокаТабличнойЧасти.Длина);  
		ПараметрыФормы.Вставить("Ширина", СтрокаТабличнойЧасти.Ширина);
		ПараметрыФормы.Вставить("Высота", СтрокаТабличнойЧасти.Высота);
		ПараметрыФормы.Вставить("ВесКар", СтрокаТабличнойЧасти.Вес);
		ПараметрыФормы.Вставить("Весграммы", СтрокаТабличнойЧасти.ВесГраммы);
     
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораВставки",ЭтаФорма);
        ОткрытьФорму("ОбщаяФорма.ЛБ_КорректировкаВставки", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
     КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПроверкаОценкиВставки(Идентификатор, ИдентификаторТовары) 
	Стр = Объект.Вставки.НайтиПоИдентификатору(Идентификатор); 
	СтрТовары = Объект.Товары.НайтиПоИдентификатору(ИдентификаторТовары);

	Если ЗначениеЗаполнено(Стр.ВидВставки) И Стр.ВидВставки.НеОценивается Тогда
		Стр.НеОценивать = Истина;
		Стр.ПроверкаНеОценивать = Истина;
	ИначеЕсли ЗначениеЗаполнено(Стр.ВидОгранки) И Стр.ВидОгранки.НеОценивается Тогда
		Стр.НеОценивать = Истина;
		Стр.ПроверкаНеОценивать = Истина;
	Иначе 
	    Стр.НеОценивать = ПроверкаНеОценивать(Стр.ВидВставки, СтрТовары.Категория);
		Стр.ПроверкаНеОценивать = Стр.НеОценивать;
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура УдалитьСтрокуВставки(Идентификатор) 
	Стр = Объект.Вставки.НайтиПоИдентификатору(Идентификатор);
	Объект.Вставки.Удалить(Стр);
КонецПроцедуры	
	
&НаКлиенте
Процедура ПослеВыбораВставки(Результат, ДопПараметры) Экспорт  
	Если Результат = неопределено Тогда
		Возврат; 
	ИначеЕсли Результат = ложь Тогда  
		УдалитьСтрокуВставки(Элементы.Вставки.ТекущиеДанные.ПолучитьИдентификатор());
		Возврат; 
	КонецЕсли;
	
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти       = Элементы.Вставки.ТекущиеДанные; 
	
	СтрокаТабличнойЧасти.Количество = Результат.Количество; 
	СтрокаТабличнойЧасти.ВидВставки = Результат.ВидВставки;
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = Результат.ЕдиницаИзмерения;
	СтрокаТабличнойЧасти.ФормаОгранки = Результат.ФормаОгранки;
	СтрокаТабличнойЧасти.ВидОгранки = Результат.ВидОгранки;
	СтрокаТабличнойЧасти.КачествоОгранки = Результат.КачествоОгранки; 
	СтрокаТабличнойЧасти.Диаметр = Результат.Диаметр;
	СтрокаТабличнойЧасти.Диаметр1 = Результат.Диаметр1;
	СтрокаТабличнойЧасти.Диаметр2 = Результат.Диаметр2; 
	СтрокаТабличнойЧасти.Длина = Результат.Длина;  
	СтрокаТабличнойЧасти.Ширина = Результат.Ширина;
	СтрокаТабличнойЧасти.Высота = Результат.Высота;
	СтрокаТабличнойЧасти.Вес = Результат.Вес; 
	СтрокаТабличнойЧасти.ВесГраммы = Результат.ВесГраммы;
	СтрокаТабличнойЧасти.ОписаниеРазмера = Результат.ОписаниеРазмера;  
	СтрокаТабличнойЧасти.ЭтоВесовой = ПроверитьВесовой(СтрокаТабличнойЧасти.ЕдиницаИзмерения);

	ПроверкаОценкиВставки(СтрокаТабличнойЧасти.ПолучитьИдентификатор(), СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор());

	Если СтрокаТабличнойЧасти.НеОценивать Тогда
		СтрокаТабличнойЧасти.Цена = 0;
		СтрокаТабличнойЧасти.Сумма = 0;
	Иначе	
		ЦенаДрагоценногоКамня(СтрокаТабличнойЧасти.ПолучитьИдентификатор(), СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор());
			
		Если СтрокаТабличнойЧасти.ЭтоВесовой Тогда
		    СтрокаТабличнойЧасти.Сумма = окр(СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Вес, 2);
		Иначе
			СтрокаТабличнойЧасти.Сумма = окр(СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество, 2);
		КонецЕсли;
    КонецЕсли;

КонецПроцедуры 

&НаСервере
Процедура ЦенаДрагоценногоКамня(Идентификатор, ИдентификаторТовары) 
	СтрокаТабличнойЧасти 				  = Объект.Вставки.НайтиПоИдентификатору(Идентификатор);
	СтрокаТабличнойЧастиТовары 			  = Объект.Товары.НайтиПоИдентификатору(ИдентификаторТовары);
	
	Если  СтрокаТабличнойЧасти.НеОценивать Тогда
        СтрокаТабличнойЧасти.Цена = 0;
		СтрокаТабличнойЧасти.Сумма = 0;
	Иначе           
		СтруктураВставки = новый Структура; 
		СтруктураВставки.Вставить("Дата", Объект.Дата); 
		СтруктураВставки.Вставить("Ломбард", Объект.Ломбард);
		СтруктураВставки.Вставить("ВидВставки", СтрокаТабличнойЧасти.ВидВставки);
		СтруктураВставки.Вставить("ФормаОгранки", СтрокаТабличнойЧасти.ФормаОгранки);
        СтруктураВставки.Вставить("ВидОгранки", СтрокаТабличнойЧасти.ВидОгранки);
        СтруктураВставки.Вставить("КачествоОгранки", СтрокаТабличнойЧасти.КачествоОгранки);
        СтруктураВставки.Вставить("ЕдиницаИзмерения", СтрокаТабличнойЧасти.ЕдиницаИзмерения);
        СтруктураВставки.Вставить("Вес", ?(СтрокаТабличнойЧасти.ЕдиницаИзмерения.Код = "162", СтрокаТабличнойЧасти.вес, СтрокаТабличнойЧасти.ВесГраммы));

	    СтрокаТабличнойЧасти.Цена = ЛБ_ОбщийМодуль.ПолучитьЦенуДрагоценногоКамняИзПрейскуранта(СтруктураВставки);
	    СтрокаТабличнойЧасти.Сумма = окр(СтрокаТабличнойЧасти.Цена * ?(НЕ СтрокаТабличнойЧасти.ЭтоВесовой, СтрокаТабличнойЧасти.Количество, СтрокаТабличнойЧасти.Вес), 2);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция РассчитатьВесКамня(ВидВставки, ФормаОрганки, КачествоОгранки, Длина, Ширина)
	Возврат ЛБ_ОбщийМодуль.РассчитатьВесДрагоценногоКамня(ВидВставки, ФормаОрганки, КачествоОгранки, Длина, Ширина);
КонецФункции

&НаСервере
Функция ПроверитьВесовой(ЕдиницаИзмерения) 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЕдиницаИзмерения", ЕдиницаИзмерения); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ЕдиницыРасчетаДрагоценныхКамней.ЭтоВес КАК ЭтоВес
	               |ИЗ
	               |	РегистрСведений.ЛБ_ЕдиницыРасчетаДрагоценныхКамней КАК ЛБ_ЕдиницыРасчетаДрагоценныхКамней
	               |ГДЕ
	               |	ЛБ_ЕдиницыРасчетаДрагоценныхКамней.ЕдиницаИзмерения = &ЕдиницаИзмерения";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЭтоВес;
	КонецЕсли;
	Возврат ложь;
КонецФункции	

&НаКлиенте
Процедура ВставкиЕдиницаИзмеренияПриИзменении(Элемент)
	СтрокаТабличнойЧасти       = Элементы.Вставки.ТекущиеДанные;
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.ЭтоВесовой = ПроверитьВесовой(СтрокаТабличнойЧасти.ЕдиницаИзмерения); 
	
	ЦенаДрагоценногоКамня(СтрокаТабличнойЧасти.ПолучитьИдентификатор(), СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор());
	
	Если СтрокаТабличнойЧасти.ЭтоВесовой Тогда
	    СтрокаТабличнойЧасти.Сумма = окр(СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Вес, 2);
	Иначе
		СтрокаТабличнойЧасти.Сумма = окр(СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество, 2);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьВесКомплектующегоПоУмолчанию(Идентификатор)
	СтрокаТабличнойЧастиОбъект = Объект.Вставки.НайтиПоИдентификатору(Идентификатор);
	Если Не ЗначениеЗаполнено(СтрокаТабличнойЧастиОбъект.ВидВставки) Тогда
		Возврат 0;
	Иначе
		Возврат СтрокаТабличнойЧастиОбъект.ВидВставки.ВесПоУмолчанию;
	КонецЕсли;	
КонецФункции	
	
&НаКлиенте
Процедура ВставкиВидВставкиПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти       = Элементы.Вставки.ТекущиеДанные;
	Если СтрокаТабличнойЧасти.Вид = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыКомплектующихИзделия.Вставка") Тогда
		СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
		
		СтрокаТабличнойЧасти.Вес = РассчитатьВесКамня(СтрокаТабличнойЧасти.ВидВставки, СтрокаТабличнойЧасти.ФормаОгранки, СтрокаТабличнойЧасти.КачествоОгранки, СтрокаТабличнойЧасти.Длина, СтрокаТабличнойЧасти.Ширина);
		СтрокаТабличнойЧасти.Вес = СтрокаТабличнойЧасти.Вес * СтрокаТабличнойЧасти.Количество;
		
		ЦенаДрагоценногоКамня(СтрокаТабличнойЧасти.ПолучитьИдентификатор(), СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор());
		
		Если СтрокаТабличнойЧасти.ЭтоВесовой Тогда
		    СтрокаТабличнойЧасти.Сумма = окр(СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Вес, 2);
		Иначе
			СтрокаТабличнойЧасти.Сумма = окр(СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество, 2);
		КонецЕсли;
	Иначе	
        СтрокаТабличнойЧасти.Вес = ПолучитьВесКомплектующегоПоУмолчанию(СтрокаТабличнойЧасти.ПолучитьИдентификатор()) * СтрокаТабличнойЧасти.Количество;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВставкиКачествоОгранкиПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти       = Элементы.Вставки.ТекущиеДанные;
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.Вес = РассчитатьВесКамня(СтрокаТабличнойЧасти.ВидВставки, СтрокаТабличнойЧасти.ФормаОгранки, СтрокаТабличнойЧасти.КачествоОгранки, СтрокаТабличнойЧасти.Длина, СтрокаТабличнойЧасти.Ширина);
	СтрокаТабличнойЧасти.Вес = СтрокаТабличнойЧасти.Вес * СтрокаТабличнойЧасти.Количество;
		
	ЦенаДрагоценногоКамня(СтрокаТабличнойЧасти.ПолучитьИдентификатор(), СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор());
	Если СтрокаТабличнойЧасти.ЭтоВесовой Тогда
	    СтрокаТабличнойЧасти.Сумма = окр(СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Вес, 2);
	Иначе
		СтрокаТабличнойЧасти.Сумма = окр(СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество, 2);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВставкиФормаОгранкиПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти       = Элементы.Вставки.ТекущиеДанные;
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.Вес = РассчитатьВесКамня(СтрокаТабличнойЧасти.ВидВставки, СтрокаТабличнойЧасти.ФормаОгранки, СтрокаТабличнойЧасти.КачествоОгранки, СтрокаТабличнойЧасти.Длина, СтрокаТабличнойЧасти.Ширина);
	СтрокаТабличнойЧасти.Вес = СтрокаТабличнойЧасти.Вес * СтрокаТабличнойЧасти.Количество;
		
	ЦенаДрагоценногоКамня(СтрокаТабличнойЧасти.ПолучитьИдентификатор(), СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор());
	Если СтрокаТабличнойЧасти.ЭтоВесовой Тогда
	    СтрокаТабличнойЧасти.Сумма = окр(СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Вес, 2);
	Иначе
		СтрокаТабличнойЧасти.Сумма = окр(СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество, 2);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВставкиКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти       = Элементы.Вставки.ТекущиеДанные;
	Если СтрокаТабличнойЧасти.Вид = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыКомплектующихИзделия.Вставка") Тогда		
		СтрокаТабличнойЧасти.Вес = РассчитатьВесКамня(СтрокаТабличнойЧасти.ВидВставки, СтрокаТабличнойЧасти.ФормаОгранки, СтрокаТабличнойЧасти.КачествоОгранки, СтрокаТабличнойЧасти.Длина, СтрокаТабличнойЧасти.Ширина);
		СтрокаТабличнойЧасти.Вес = окр(СтрокаТабличнойЧасти.Вес * СтрокаТабличнойЧасти.Количество, 2);
				
		Если СтрокаТабличнойЧасти.ЭтоВесовой Тогда
		    СтрокаТабличнойЧасти.Сумма = окр(СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Вес, 2);
		Иначе
			СтрокаТабличнойЧасти.Сумма = окр(СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество, 2);
		КонецЕсли;
	Иначе
		СтрокаТабличнойЧасти.Вес = ПолучитьВесКомплектующегоПоУмолчанию(СтрокаТабличнойЧасти.ПолучитьИдентификатор()) * СтрокаТабличнойЧасти.Количество;
    КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ВставкиДлинаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти       = Элементы.Вставки.ТекущиеДанные;
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;

	СтрокаТабличнойЧасти.Вес = РассчитатьВесКамня(СтрокаТабличнойЧасти.ВидВставки, СтрокаТабличнойЧасти.ФормаОгранки, СтрокаТабличнойЧасти.КачествоОгранки, СтрокаТабличнойЧасти.Длина, СтрокаТабличнойЧасти.Ширина);
	СтрокаТабличнойЧасти.Вес = СтрокаТабличнойЧасти.Вес * СтрокаТабличнойЧасти.Количество;
	
	ЦенаДрагоценногоКамня(СтрокаТабличнойЧасти.ПолучитьИдентификатор(), СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор());
	Если СтрокаТабличнойЧасти.ЭтоВесовой Тогда
	    СтрокаТабличнойЧасти.Сумма = окр(СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Вес, 2);
	Иначе
		СтрокаТабличнойЧасти.Сумма = окр(СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество, 2);
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ВставкиШиринаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти       = Элементы.Вставки.ТекущиеДанные;
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;

	СтрокаТабличнойЧасти.Вес = РассчитатьВесКамня(СтрокаТабличнойЧасти.ВидВставки, СтрокаТабличнойЧасти.ФормаОгранки, СтрокаТабличнойЧасти.КачествоОгранки, СтрокаТабличнойЧасти.Длина, СтрокаТабличнойЧасти.Ширина);
	СтрокаТабличнойЧасти.Вес = СтрокаТабличнойЧасти.Вес * СтрокаТабличнойЧасти.Количество;
	
	ЦенаДрагоценногоКамня(СтрокаТабличнойЧасти.ПолучитьИдентификатор(), СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор());
	Если СтрокаТабличнойЧасти.ЭтоВесовой Тогда
	    СтрокаТабличнойЧасти.Сумма = окр(СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Вес, 2);
	Иначе
		СтрокаТабличнойЧасти.Сумма = окр(СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество, 2);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВставкиВесПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти       = Элементы.Вставки.ТекущиеДанные;
	Если СтрокаТабличнойЧасти.ЭтоВесовой Тогда
	    СтрокаТабличнойЧасти.Сумма = окр(СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Вес, 2);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВставкиЦенаПриИзменении(Элемент)
	
    СтрокаТабличнойЧасти       = Элементы.Вставки.ТекущиеДанные;
	СтрокаТабличнойЧасти.Сумма = окр(СтрокаТабличнойЧасти.Цена * ?(НЕ СтрокаТабличнойЧасти.ЭтоВесовой, СтрокаТабличнойЧасти.Количество, СтрокаТабличнойЧасти.Вес), 2);
	
КонецПроцедуры

&НаКлиенте
Процедура ВставкиСуммаПриИзменении(Элемент)
	
    СтрокаТабличнойЧасти       = Элементы.Вставки.ТекущиеДанные;
	КоличествоРасчета = ?(НЕ СтрокаТабличнойЧасти.ЭтоВесовой, СтрокаТабличнойЧасти.Количество, СтрокаТабличнойЧасти.Вес);
	СтрокаТабличнойЧасти.Цена = окр(?(КоличествоРасчета = 0, 0, СтрокаТабличнойЧасти.Сумма/КоличествоРасчета), 2);
	
КонецПроцедуры


&НаКлиенте
Процедура ВставкиГруппаЦветаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти       = Элементы.Вставки.ТекущиеДанные;
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
		
	ЦенаДрагоценногоКамня(СтрокаТабличнойЧасти.ПолучитьИдентификатор(), СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ВставкиГруппаКачестваПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти       = Элементы.Вставки.ТекущиеДанные;
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
		
	ЦенаДрагоценногоКамня(СтрокаТабличнойЧасти.ПолучитьИдентификатор(), СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор());

КонецПроцедуры


&НаСервере
// Проверяет заполнение полей залогового билета
//
// Параметры
//  Нет
//
// Возвращаемое значение
//  Булево - результат проверки
//
Функция ПроверкаЗаполнения() Экспорт   
	Результат = Истина;
	
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ИзъятиеОбъектовЗалога Тогда   
		Если НЕ Объект.ТоварыИзъятыеВозвращенные.Количество() Тогда
		
			Результат = Ложь;
			Сообщить("Изъятые объекты залога не указаны!",СтатусСообщения.Внимание);  
						
		КонецЕсли;   
		
		Если НЕ ЗначениеЗаполнено(Объект.ДатаИзъятия) ИЛИ
			 НЕ ЗначениеЗаполнено(Объект.ГосОрганИзъятие) ИЛИ
			 НЕ ЗначениеЗаполнено(Объект.ДатаПротоколИзъятия) ИЛИ
			 НЕ ЗначениеЗаполнено(Объект.ДокументИзъятияНаименование) ИЛИ
			 НЕ ЗначениеЗаполнено(Объект.ДокументИзъятияДатаВыдачи) ИЛИ
			 НЕ ЗначениеЗаполнено(Объект.ДокументИзъятияКемВыдан) ИЛИ
			 НЕ ЗначениеЗаполнено(Объект.ФИОДолжностьИзъятие) ИЛИ
			 НЕ ЗначениеЗаполнено(Объект.ФИОДолжностьСудьи) Тогда 
			
			Результат = Ложь;
		    Сообщить("Не заолнены обязательные реквизиты на форме!",СтатусСообщения.Внимание); 
		КонецЕсли;	

		Возврат Результат;	 
	КонецЕсли;
	
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога Тогда   
		Если НЕ Объект.ТоварыИзъятыеВозвращенные.Количество() Тогда
		
			Результат = Ложь;
			Сообщить("Возвращенные объекты залога не указаны!",СтатусСообщения.Внимание);   
			
		КонецЕсли;          
		
		Если НЕ ЗначениеЗаполнено(Объект.ДокументВозвратаНаименование) ИЛИ
			 НЕ ЗначениеЗаполнено(Объект.ДокументВозвратаНомер) ИЛИ
			 НЕ ЗначениеЗаполнено(Объект.ДокументВозвратаДата) Тогда 
			
			Результат = Ложь;
		    Сообщить("Не заолнены обязательные реквизиты на форме!",СтатусСообщения.Внимание); 
		КонецЕсли;	
		
		Возврат Результат;	
	КонецЕсли;
		
		
	Если НЕ Объект.Товары.Количество() Тогда
		
		Результат = Ложь;
		Сообщить("Состав залога не указан!",СтатусСообщения.Внимание);
		Возврат Результат;
		
	КонецЕсли;
	
	Если Результат Тогда
		Если Объект.ДокументВид = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ Тогда
			Если ПустаяСтрока(Объект.ДокументКодПодразделения) Тогда
				Сообщить("Для документ удостоверяющего личность залогодателя необходимо заполнить код подразделения!");
				Результат = ложь;
			КонецЕсли;	
			Если ПустаяСтрока(Объект.ДокументКемВыдан) Тогда
				Сообщить("Для документ удостоверяющего личность залогодателя необходимо заполнить кем выдан!");
				Результат = ложь;
			КонецЕсли;	
		КонецЕсли;
		Если ((Объект.ДокументВид = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ) ИЛИ 
		(Объект.ДокументВид = Справочники.ВидыДокументовФизическихЛиц.ВидНаЖительство И Объект.ДокументВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность)) Тогда
		    Если Объект.ДокументВид = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ Тогда 			    
				Парам = Новый Структура("Серия, Номер", СокрЛП(Объект.ДокументСерия), СокрЛП(Объект.ДокументНомер));
				Если ЛБ_ОбменLX.ПаспортНедействителен(Парам) Тогда 
					Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
						Сообщить("Документ найден в списке недействительных паспортов!");
					    Результат = ложь; 
					КонецЕсли;	
				ИначеЕсли НЕ ЛБ_ОбщийМодуль.ПроверитьПаспортРФДействует(Объект.ДатаРождения, Объект.ДокументДатаВыдачи) Тогда
					Сообщить("Документ удостоверяющий личность залогодателя просрочен!");
				    Результат = ложь;	
				КонецЕсли;	
			ИначеЕсли НЕ ЛБ_ОбщийМодуль.ПроверитьПаспортРФДействует(Объект.ДатаРождения, Объект.ДокументДатаВыдачи) Тогда
				Сообщить("Документ удостоверяющий личность залогодателя просрочен!");
			    Результат = ложь;   
			КонецЕсли;	
		ИначеЕсли (Объект.ДокументВид = Справочники.ВидыДокументовФизическихЛиц.СвидетельствоОРождении) И НЕ ЛБ_ОбщийМодуль.ПроверитьСвидетельствоОРожденииДействует(Объект.ДатаРождения) Тогда
			Сообщить("Документ удостоверяющий личность залогодателя просрочен!");
		    Результат = ложь;
		КонецЕсли;	
		Если ЛБ_ОбщийМодуль.ДокументСоСрокомДействия(Объект.Гражданство, Объект.ДокументВидДокументаЗалогодателя, Объект.ДокументВид) тогда
			Если НЕ ЗначениеЗаполнено(Объект.ДокументСрокДействия) Тогда
				Сообщить("Для документ удостоверяющего личность залогодателя необходимо заполнить срок действия!");
		        Результат = ложь;
			ИначеЕсли Объект.ДокументСрокДействия <	НачалоДня(Объект.Дата) Тогда
				Сообщить("Документ удостоверяющий личность залогодателя просрочен!");
		        Результат = ложь;
			КонецЕсли;	
		КонецЕсли;	 
		Если НЕ Объект.Гражданство = Справочники.СтраныМира.Россия Тогда
			Отбор = Новый Структура; 
			Отбор.Вставить("Клиент", Объект.Залогодатель);
			Строки = Объект.ДополнительныеДокументыПравоПребыванияРФ.НайтиСтроки(Отбор);
			Если Строки.Количество() = 0 Тогда 
				Сообщить("Не выбран документ удостоверяющий право пребывания клиента на территории РФ!");
		        Результат = ложь;
			Иначе                  
				ЕстьДокументГражданствоНЕРФ = ложь;
				Для каждого Стр Из Строки Цикл
					Если ЛБ_ОбщийМодуль.ДокументСоСрокомДействия(Объект.Гражданство, Стр.ДокументЗалогодателя, Стр.ВидДокумента) тогда 
						Если НЕ ЗначениеЗаполнено(Объект.ДокументСрокДействия) Тогда
							Продолжить;
						ИначеЕсли Объект.ДокументСрокДействия <	НачалоДня(Объект.Дата) Тогда
							Продолжить;
						КонецЕсли;	
                        ГражданствоНЕРФ = Истина;
						Прервать;  
					Иначе
						ГражданствоНЕРФ = Истина;
						Прервать; 
					КонецЕсли;					
				КонецЦикла;	
				Если НЕ ГражданствоНЕРФ Тогда
					Сообщить("У клиента нет действующего документа, удостоверяющего право пребывания на территории РФ!");
					Результат = ложь;
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	  
	КонецЕсли;
	
	Если Результат Тогда
		Если ЗначениеЗаполнено(Объект.Представитель) Тогда
			//проверим кон. инф и документ представителя
			Если НЕ ЗначениеЗаполнено(Объект.ФамилияПредставителя) Тогда
				Сообщить("Не заполнена фамилия представиделя заемщика");
				Результат = ложь;
			КонецЕсли;	
			Если НЕ ЗначениеЗаполнено(Объект.ИмяПредставителя) Тогда
				Сообщить("Не заполнено имя представителя заемщика");
				Результат = ложь;
			КонецЕсли;	
			Если НЕ ЗначениеЗаполнено(Объект.ПолПредставителя) Тогда
				Сообщить("Не заполнен пол представителя заемщика");
				Результат = ложь;
			КонецЕсли;	
	        Если НЕ ЗначениеЗаполнено(Объект.ДокументВидПредставителя) Тогда
				Сообщить("Не выбран документ удостоверяющий личность представителя заемщика");
				Результат = ложь;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Объект.ДатаРожденияПредставителя) Тогда
				Сообщить("Не заполнена дата рождения представителя заемщика");
				Результат = ложь;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Объект.ДоверенностьПредставителя) Тогда
				Сообщить("Не выбрана доверенность представителя заемщика");
				Результат = ложь;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Объект.ГражданствоПредставителя) Тогда
				Сообщить("Не выбрано гражданство представителя заемщика");
				Результат = ложь;
			КонецЕсли;
	        Если НЕ ЗначениеЗаполнено(Объект.ДокументВидДокументаПредставителя) Тогда
				Сообщить("Не выбран вид документа удостоверяющего личность представителя заемщика");
				Результат = ложь;
			КонецЕсли;
	        Если НЕ ЗначениеЗаполнено(Объект.ДокументВидПредставителя) Тогда
				Сообщить("Не выбрано наименование документа удостоверяющего личность представителя заемщика");
				Результат = ложь;
			КонецЕсли;
	        Если НЕ ЗначениеЗаполнено(Объект.ДокументГражданствоПредставителя) Тогда
				Сообщить("Не выбрано гражданство документа удостоверяющего личность представителя заемщика");
				Результат = ложь;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Объект.ДокументДатаВыдачиПредставителя) Тогда
				Сообщить("Не выбрана дата выдачи документа удостоверяющего личность представителя заемщика");
				Результат = ложь;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Объект.ДокументНачалоДействияПредставителя) Тогда
				Сообщить("Не выбрана начало действия документа удостоверяющего личность представителя заемщика");
				Результат = ложь;
			КонецЕсли;
			Если Результат Тогда
				Если Объект.ДокументВидПредставителя = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ Тогда
					Если ПустаяСтрока(Объект.ДокументКодПодразделенияПредставителя) Тогда
						Сообщить("Для документ удостоверяющего личность представителя заемщика необходимо заполнить код подразделения!");
						Результат = ложь;
					КонецЕсли;	
					Если ПустаяСтрока(Объект.ДокументКемВыданПредставителя) Тогда
						Сообщить("Для документ удостоверяющего личность представителя заемщика необходимо заполнить кем выдан!");
						Результат = ложь;
					КонецЕсли;	
                КонецЕсли;
				Если ((Объект.ДокументВидПредставителя = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ) ИЛИ 
		        (Объект.ДокументВидПредставителя = Справочники.ВидыДокументовФизическихЛиц.ВидНаЖительство И Объект.ДокументВидДокументаПредставителя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность)) Тогда
					Если Объект.ВидДокументаПредставителя = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ Тогда
						Парам = Новый Структура("Серия, Номер", СокрЛП(Объект.ДокументСерияПредставителя), СокрЛП(Объект.ДокументНомерПредставителя));
						Если ЛБ_ОбменLX.ПаспортНедействителен(Парам) Тогда 
							Сообщить("Документ представителя заемщика найден в списке недействительных паспортов!");
						    Результат = ложь; 
						ИначеЕсли НЕ ЛБ_ОбщийМодуль.ПроверитьПаспортРФДействует(Объект.ДатаРожденияПредставителя, Объект.ДокументДатаВыдачиПредставителя) Тогда
							Сообщить("Документ удостоверяющий личность представителя заемщика просрочен!");
						    Результат = ложь;	
						КонецЕсли;	
					ИначеЕсли НЕ ЛБ_ОбщийМодуль.ПроверитьПаспортРФДействует(Объект.ДатаРожденияПредставителя, Объект.ДокументДатаВыдачиПредставителя) Тогда
						Сообщить("Документ удостоверяющий личность представителя заемщика просрочен!");
					    Результат = ложь;  
					КонецЕсли;	
				ИначеЕсли (Объект.ДокументВидПредставителя = Справочники.ВидыДокументовФизическихЛиц.СвидетельствоОРождении) И НЕ ЛБ_ОбщийМодуль.ПроверитьСвидетельствоОРожденииДействует(Объект.ДатаРожденияПредставителя) Тогда
					Сообщить("Документ удостоверяющий личность представителя заемщика просрочен!");
				    Результат = ложь;	
				КонецЕсли;	
				Если ЛБ_ОбщийМодуль.ДокументСоСрокомДействия(Объект.Гражданство, Объект.ДокументВидДокументаПредставителя, Объект.ДокументВидПредставителя) тогда
					Если НЕ ЗначениеЗаполнено(Объект.ДокументСрокДействияПредставителя) Тогда
						Сообщить("Для документ удостоверяющего личность представителя заемщика необходимо заполнить срок действия!");
				        Результат = ложь;
					ИначеЕсли Объект.ДокументСрокДействияПредставителя < НачалоДня(Объект.Дата) Тогда
						Сообщить("Документ удостоверяющий личность представителя заемщика просрочен!");
				        Результат = ложь;
					КонецЕсли;	
				КонецЕсли;
				Если НЕ Объект.ГражданствоПредставителя = Справочники.СтраныМира.Россия Тогда
					Отбор = Новый Структура; 
					Отбор.Вставить("Клиент", Объект.Представитель);
					Строки = Объект.ДополнительныеДокументыПравоПребыванияРФ.НайтиСтроки(Отбор);
					Если Строки.Количество() = 0 Тогда 
						Сообщить("Не выбран документ удостоверяющий право пребывания представителя клиента на территории РФ!");
				        Результат = ложь;
					Иначе                  
						ЕстьДокументГражданствоНЕРФ = ложь;
						Для каждого Стр Из Строки Цикл
							Если ЛБ_ОбщийМодуль.ДокументСоСрокомДействия(Объект.Гражданство, Стр.ДокументЗалогодателя, Стр.ВидДокумента) тогда 
								Если НЕ ЗначениеЗаполнено(Объект.ДокументСрокДействия) Тогда
									Продолжить;
								ИначеЕсли Объект.ДокументСрокДействия <	НачалоДня(Объект.Дата) Тогда
									Продолжить;
								КонецЕсли;	
		                        ГражданствоНЕРФ = Истина;
								Прервать;  
							Иначе
								ГражданствоНЕРФ = Истина;
								Прервать; 
							КонецЕсли;					
						КонецЦикла;	
						Если НЕ ГражданствоНЕРФ Тогда
							Сообщить("У представителя клиента нет действующего документа, удостоверяющего право пребывания на территории РФ!");
							Результат = ложь;
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;	 
			КонецЕсли;	
     	КонецЕсли;	
	КонецЕсли;	


	Если Результат Тогда
		
		Для каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл
			
			Результат = Результат 
			И ЗначениеЗаполнено(СтрокаТабличнойЧасти.ВидИзделия)
			И ЗначениеЗаполнено(СтрокаТабличнойЧасти.Проба)
			И ЗначениеЗаполнено(СтрокаТабличнойЧасти.Описание)
			И ЗначениеЗаполнено(СтрокаТабличнойЧасти.Количество)
			И ЗначениеЗаполнено(СтрокаТабличнойЧасти.Цена)
			И ЗначениеЗаполнено(СтрокаТабличнойЧасти.СуммаОценки)
			И ЗначениеЗаполнено(СтрокаТабличнойЧасти.СуммаСсуды);  
			
			Если СтрокаТабличнойЧасти.Именник = Перечисления.ЛБ_Именник.Да тогда
				Если ПустаяСтрока(СтрокаТабличнойЧасти.ДанныеИменника) Тогда
					Сообщить("Если именник РФ, то необходимо заполнить данные именника.");
					Результат = ложь;
				КонецЕсли;	
			КонецЕсли;  
			
			Если СтрокаТабличнойЧасти.ЕстьДеффекты тогда
				Если ПустаяСтрока(СтрокаТабличнойЧасти.Дефекты) Тогда
					Сообщить("Если в изделии есть дефекты, то необходимо их описать.");
					Результат = ложь;
				КонецЕсли;	
			КонецЕсли;  
			
			Если НЕ ПроверитьОписаниеИзделия(СтрокаТабличнойЧасти) Тогда
				Результат = ложь;
			КонецЕсли;	
			
			Если НЕ Результат Тогда
				
				Прервать;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли;
		
	Если НЕ Результат Тогда
		
		Попытка
			Если Объект.ДокументВид = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ Тогда
				ЛБ_РаботаСДиалогами.НезаполненыОбязательныеПоля(Объект, Новый Структура("Организация, Ломбард, Фамилия, Имя, ДатаРождения, ДокументВид, ДокументСерия,
				|ДокументНомер, ДокументДатаВыдачи, Гражданство, ДокументКемВыдан, СхемаКредитования, ДокументКодПодразделения"), Новый Структура("ВидИзделия, Проба, Количество, Описание, Цена, СуммаОценки,СуммаСсуды"));	
			Иначе
				ЛБ_РаботаСДиалогами.НезаполненыОбязательныеПоля(Объект, Новый Структура("Организация, Ломбард, Фамилия, Имя, ДатаРождения, ДокументВид,
				|ДокументНомер, ДокументДатаВыдачи, Гражданство, ДокументКемВыдан, СхемаКредитованияи"), Новый Структура("ВидИзделия, Проба, Количество, Описание, Цена, СуммаОценки,СуммаСсуды"));	
			КонецЕсли;
		Исключение
			Сообщить("Не заполнены обязательные поля",СтатусСообщения.Внимание);
		КонецПопытки;
		
	КонецЕсли;    
		
	Возврат Результат;
	
КонецФункции // ПроверкаЗаполнения() 

&НаСервере
Функция ПроверитьОписаниеИзделия(Стр)  
	МассивСлов = СтрРазделить(СокрЛП(Стр.Описание), " ", ложь);
    Рез = истина;
	ВыборкаСпр = Справочники.ЛБ_НеДопустимыеЗначенияВОписанииИзделия.Выбрать();
	Пока ВыборкаСпр.Следующий() цикл
		Если ВыборкаСпр.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;	
		Для каждого Слово из МассивСлов Цикл  
			Если СокрЛП(нрег(Слово)) = СокрЛП(нрег(ВыборкаСпр.Наименование)) Тогда
				Сообщить("В описании изделия найдены недопустимые символы """ + СокрЛП(ВыборкаСпр.Наименование) + """"); 
				Рез = Ложь;
			КонецЕсли;	
		КонецЦикла;	
	Конеццикла;	 
	Возврат Рез;
КонецФункции 

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект);
	
КонецПроцедуры


&НаСервере
Процедура УстановитьЗаголовокФормы()
	
	ЭтаФорма.Заголовок = Строка(Объект.ВидОперации);
	
КонецПроцедуры


&НаСервере
Процедура ТоварыСуммаСсудыПриИзмененииНаСервере(Идентификатор)
КонецПроцедуры

&НаСервере
Функция ЗаполнитьКлючСтрокиТоваров()
	
	Возврат ЛБ_ОбщийМодуль.ПолучитьКлючСтроки(Объект);   			 

КонецФункции


&НаСервере
Процедура БриллиантыУдалитьСтроку(Строка)
	
	Объект.Бриллианты.Удалить(Строка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКлючСтрокиВставки(СтрокаТабличнойЧасти,СтрокаТабличнойЧастиТовары)
	
	Если СтрокаТабличнойЧастиТовары <> Неопределено И СтрокаТабличнойЧасти <> Неопределено Тогда 				
	    СтрокаТабличнойЧасти.КлючСтроки = СтрокаТабличнойЧастиТовары.КлючСтроки;  		
	КонецЕсли; 	

КонецПроцедуры

&НаСервере
Процедура ПослеВыбораДокумента(Результат, Параметры) Экспорт
	Если НЕ Результат = неопределено Тогда
		Объект.ДокументВид = Результат.ВидДокумента; 
		Объект.ДокументНомер = Результат.Номер;
		Объект.ДокументСерия = Результат.Серия;
		ЗаполнитьИнформациюОДокументеЗалогодателя();
		ИнформацияОДокументеВСтроку();
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Процедура ОчиститьДокументыЗалогодателя()
	Объект.ДополнительныеДокументыПравоПребыванияРФ.Очистить();
	
	Объект.ДокументЗалогодателя = Справочники.ЛБ_ДокументыЗалогодателя.ПустаяСсылка();
	Объект.ДокументВид = Справочники.ВидыДокументовФизическихЛиц.ПустаяСсылка();
	Объект.ДокументВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ПустаяСсылка();
	Объект.ДокументГражданство = Справочники.СтраныМира.ПустаяСсылка();
	Объект.ДокументДатаВыдачи = Дата(1,1,1);
	Объект.ДокументКемВыдан = "";
	Объект.ДокументКодПодразделения = "";
	Объект.ДокументНачалоДействия = Дата(1,1,1);
	Объект.ДокументСрокДействия = Дата(1,1,1);
	ЭтаФорма.Паспорт = "";
КонецПроцедуры

&НаСервере
Процедура ОчиститьДокументыПредставителя()
	Объект.ДокументПредставителя = Справочники.ЛБ_ДокументыЗалогодателя.ПустаяСсылка();
	Объект.ДокументВидПредставителя = Справочники.ВидыДокументовФизическихЛиц.ПустаяСсылка();
	Объект.ДокументВидДокументаПредставителя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ПустаяСсылка();
	Объект.ДокументГражданствоПредставителя = Справочники.СтраныМира.ПустаяСсылка();
	Объект.ДокументДатаВыдачиПредставителя = Дата(1,1,1);
	Объект.ДокументКемВыданПредставителя = "";
	Объект.ДокументКодПодразделенияПредставителя = "";
	Объект.ДокументНачалоДействияПредставителя = Дата(1,1,1);
	Объект.ДокументСрокДействияПредставителя = Дата(1,1,1);
	ЭтаФорма.ПаспортПредставителя = "";
КонецПроцедуры


&НаСервере
Процедура ПослеВыбораКонтакта(Результат, Парамеры) Экспорт
	Если НЕ Результат = неопределено Тогда
		ЗаполнитьКонтакнуюИнформациюЗалогодателя();
	    КонтактнаяИнформацияВСтроку();
		ОчиститьДокументыЗалогодателя();
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ПослеВыбораКонтактаПредставителя(Результат, Парамеры) Экспорт
	Если НЕ Результат = неопределено Тогда
		ЗаполнитьКонтакнуюИнформациюПредставителя();
	    КонтактнаяИнформацияПредставителяВСтроку();
		ОчиститьДокументыПредставителя();
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ЗалогодательФИОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура;
	Если ЗначениеЗаполнено(Объект.Залогодатель) Тогда
		ПараметрыФормы.Вставить("Залогодатель", Объект.Залогодатель); 		
	КонецЕсли;	
	ПараметрыФормы.Вставить("Дата", Объект.Дата);
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЗалогодателя",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателя", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры 

&НаКлиенте
Процедура ПредставительФИОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура;
	Если ЗначениеЗаполнено(Объект.Представитель) Тогда
		ПараметрыФормы.Вставить("Залогодатель", Объект.Представитель);
	КонецЕсли;	
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораПредставителя",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателя", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПаспортНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура;
	Если ЗначениеЗаполнено(Объект.Залогодатель) Тогда
		ПараметрыФормы.Вставить("Залогодатель", Объект.Залогодатель);
	КонецЕсли;
	ПараметрыФормы.Вставить("Дата", Объект.Дата);
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЗалогодателя",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателя", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПаспортПредставителяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура;
	Если ЗначениеЗаполнено(Объект.Представитель) Тогда
		ПараметрыФормы.Вставить("Залогодатель", Объект.Представитель);
	КонецЕсли;	
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораПредставителя",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателя", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПаспортПредставителяОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	Если ЗначениеЗаполнено(Объект.Залогодатель) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Владелец", Объект.Представитель);
		ПараметрыФормы.Вставить("ВидДокумента", Объект.ДокументВидПредставителя);
		ПараметрыФормы.Вставить("Серия", Объект.ДокументСерияПредставителя);
		ПараметрыФормы.Вставить("Номер", Объект.ДокументНомерПредставителя);
			
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораДокументаПредставителя",ЭтаФорма);
		ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаИзмененияДокументаЗалогодателя", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Сообщить("Не выбран представитель заемщика!");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КонтактПредставителяОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	Если ЗначениеЗаполнено(Объект.Представитель) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Владелец", Объект.Представитель);
					
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораКонтактаПредставителя",ЭтаФорма);
		ОткрытьФорму("ОбщаяФорма.ЛБ_ИзменениеКонтактнойИнформацииЗалогодателя", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Сообщить("Не выбран представитель заемщика!");
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Процедура РасчетСуммыОценкиИтоговой()
	
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Стр Из Объект.Товары Цикл
		ЦенаДрагоценногоМеталла(Стр.ПолучитьИдентификатор());
		ОтборВ = Новый Структура;
		ОтборВ.Вставить("КлючСтроки", Стр.КлючСтроки);
		Строки = Объект.Вставки.НайтиСтроки(ОтборВ);
	    СуммаОценкиКамни = 0;		
		Для каждого СтрокаТабличнойЧасти Из Строки Цикл	
	        ЦенаДрагоценногоКамня(СтрокаТабличнойЧасти.ПолучитьИдентификатор(), Стр.ПолучитьИдентификатор());
		    СуммаОценкиКамни = СуммаОценкиКамни + СтрокаТабличнойЧасти.Сумма; 
		КонецЦикла;		
	    Стр.СуммаОценкиКамни = СуммаОценкиКамни;
	    
		ОтборДоп = Новый Структура;
		ОтборДоп.Вставить("КлючСтроки", Стр.КлючСтроки);
		СтрокиДоп = Объект.ДополнительныеМеталлы.НайтиСтроки(ОтборДоп);
		Для каждого СтрДоп Из СтрокиДоп Цикл     
			ЦенаДрагоценногоМеталла(СтрДоп.ПолучитьИдентификатор());
			Стр.СуммаОценкиМеталлы = Стр.СуммаОценкиМеталлы + СтрДоп.СуммаОценкиМеталлы;
		Конеццикла;	
		Стр.СуммаОценки = Стр.СуммаОценкиМеталлы + Стр.СуммаОценкиКамни;
		
		МассивС = Новый Массив;
		МассивС.Добавить(объект.СтатусЗалогодателя);
		Для каждого Эл Из СписокДопСтатусов Цикл  
			МассивС.Добавить(Эл.Значение);
		Конеццикла;	
	    Стр.СуммаОценкиМаксимальная = ЛБ_УправлениеЛомбардом.РасчитатьМаксимальнуюСуммуЗалога(Объект.Дата, Объект.СхемаКредитования, МассивС, Стр);
		Если Стр.СуммаСсуды > Стр.СуммаОценкиМаксимальная Тогда
			Стр.СуммаСсуды = Стр.СуммаОценкиМаксимальная;
		КонецЕсли;	
	КонецЦикла;	
	Объект.СуммаСсуды = ОкруглитьСуммуСсуды(Объект.Товары.Итог("СуммаОценкиМаксимальная"));
	СуммаЗайма = Объект.СуммаСсуды;  
	РаспределитьСуммуЗайма(); 
	//
	//Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление") Тогда 
	//	КВыдачеОплате = СуммаЗайма - СуммаОплатыПереоформление;
	//	Если КВыдачеОплате > 0 Тогда
	//	    Элементы.ДекорацияКВыдачеОплате.Заголовок = "К выдаче " + СокрЛП(Формат(КВыдачеОплате, "ЧЦ=15; ЧДЦ=2; ЧРД=,")) + " руб."; 
	//	Иначе     
	//		КВыдачеОплате = ?(КВыдачеОплате < 0, -КВыдачеОплате, КВыдачеОплате);
	//		Элементы.ДекорацияКВыдачеОплате.Заголовок = "К доплате " + СокрЛП(Формат(КВыдачеОплате, "ЧЦ=15; ЧДЦ=2; ЧРД=,")) + " руб.";
	//	КонецЕсли;	
	//Конецесли;	

КонецПроцедуры


// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтотОбъект, ИмяЭлемента, РезультатВыполнения);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВесИСуммуВставокИзделия(КлючСтроки)
	Отбор = Новый Структура;
	Отбор.Вставить("КлючСтроки", КлючСтроки);
	СтрокиВставки = Объект.Вставки.НайтиСтроки(Отбор);
	ВесВставок = 0;
	СуммаВставок = 0;
	
	Для каждого Стр Из СтрокиВставки Цикл
		Если Стр.Вид = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыКомплектующихИзделия.Вставка") Тогда
	        ВесВставок = ВесВставок + Стр.ВесГраммы;
		    СуммаВставок = СуммаВставок + Стр.Сумма;
		Иначе
			ВесВставок = ВесВставок + Стр.ВесГраммы;
		КонецЕсли;	
	КонецЦикла;	

	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Вес", ВесВставок);
	СтруктураРезультат.Вставить("Сумма", СуммаВставок);
	
	Возврат СтруктураРезультат;
КонецФункции

&НаКлиенте
Процедура ВставкиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти = Элементы.Вставки.ТекущиеДанные;
	
	Если НЕ СтрокаТабличнойЧастиТовары = неопределено Тогда		
		СтруктураР = ПолучитьВесИСуммуВставокИзделия(СтрокаТабличнойЧастиТовары.КлючСтроки);
		СтрокаТабличнойЧастиТовары.ВесЧистый = Цел((СтрокаТабличнойЧастиТовары.Вес - СтруктураР.Вес)*100)/100;
		СтрокаТабличнойЧастиТовары.СуммаОценкиКамни = СтруктураР.Сумма;
		ПересчитатьСуммТовары();
	КонецЕсли;	
	
	Если СтрокаТабличнойЧастиТовары <> неопределено Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",СтрокаТабличнойЧастиТовары.КлючСтроки);
		Элементы.Вставки.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);

	Иначе
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",0);
		Элементы.Вставки.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
		
	КонецЕсли;    
КонецПроцедуры 

&НаКлиенте
Процедура ВставкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ОбновитьДанныеТовары();
КонецПроцедуры

&НаСервере 
Функция ОкруглитьСуммуСсуды(Сумма)
	Возврат ЛБ_УправлениеЛомбардом.ОкруглитьСуммуСсудыПоНастройкам(Объект.Дата, Объект.Организация, Сумма);
КонецФункции	

&НаКлиенте
Процедура ПересчитатьСуммТовары(СтрокаТабличнойЧастиТовары = неопределено)
	Если СтрокаТабличнойЧастиТовары = неопределено Тогда
	    СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	КонецЕсли;	
    СтрокаТабличнойЧастиТовары.СуммаОценкиМеталлы = СтрокаТабличнойЧастиТовары.ВесЧистый*СтрокаТабличнойЧастиТовары.Цена;
	ОтборДоп = Новый Структура;
	ОтборДоп.Вставить("КлючСтроки", СтрокаТабличнойЧастиТовары.КлючСтроки);
	СтрокиДоп = Объект.ДополнительныеМеталлы.НайтиСтроки(ОтборДоп);
	ОснМеталлВесЧистый = СтрокаТабличнойЧастиТовары.ВесЧистый;
	Для каждого СтрДоп Из СтрокиДоп Цикл
		ОснМеталлВесЧистый = ОснМеталлВесЧистый - СтрДоп.ВесЧистый;
	Конеццикла;	
	//СтрокаТабличнойЧастиТовары.ВесВПробеЧистоты = ПолучитьВесВЧистоте(ОснМеталлВесЧистый, СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор()); 
	СтрокаТабличнойЧастиТовары.СуммаОценкиМеталлы = ОснМеталлВесЧистый*СтрокаТабличнойЧастиТовары.Цена;
	Для каждого СтрДоп Из СтрокиДоп Цикл
		СтрокаТабличнойЧастиТовары.СуммаОценкиМеталлы = СтрокаТабличнойЧастиТовары.СуммаОценкиМеталлы + СтрДоп.СуммаОценкиМеталлы;
		//СтрокаТабличнойЧастиТовары.ВесВПробеЧистоты = СтрокаТабличнойЧастиТовары.ВесВПробеЧистоты + СтрДоп.ВесВПробеЧистоты;
	Конеццикла;	
	СтрокаТабличнойЧастиТовары.СуммаОценки = СтрокаТабличнойЧастиТовары.СуммаОценкиМеталлы + СтрокаТабличнойЧастиТовары.СуммаОценкиКамни;
	
	РасчетМаксимальнойСуммыОценки(СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор());
	СтрокаТабличнойЧастиТовары.СуммаСсуды = СтрокаТабличнойЧастиТовары.СуммаОценкиМаксимальная;
	Объект.СуммаСсуды = ОкруглитьСуммуСсуды(Объект.Товары.Итог("СуммаОценкиМаксимальная"));
	СуммаЗайма = Объект.СуммаСсуды;  
	РаспределитьСуммуЗайма();
	ПолучитьДоступныеПроцентныеСхемыАкции();				
	Если НЕ ТаблицаВыбораСхемыКредитованияАкции.Количество() = 0 Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("СхемаКредитования", Объект.СхемаКредитования); 
		Отбор.Вставить("Акция", Объект.Акция);   
		СтрокиСК = ТаблицаВыбораСхемыКредитованияАкции.НайтиСтроки(Отбор);
		Если НЕ СтрокиСК.Количество() = 0 Тогда
			ЗаполнитьТаблицуСтавок();
		Иначе 
			СтрокаСК = ТаблицаВыбораСхемыКредитованияАкции.Получить(0);
			Объект.СхемаКредитования = СтрокаСК.СхемаКредитования;
			Объект.Акция = СтрокаСК.Акция;
			ЗаполнитьТаблицуСтавок();
			ОбработатьСхемуКредитованияНаСервере(ДатаДок);
			ЗаполнитьДатуВыкупа();
			Объект.ДатаВыкупаЛьготная = ПолучитьЛьготнуюДатуВыкупа(); 
		КонецЕсли;	
	Иначе
		Объект.СхемаКредитования = ПредопределенноеЗначение("Справочник.ЛБ_СхемыКредитования.ПустаяСсылка");
		Объект.Акция = ПредопределенноеЗначение("Справочник.ЛБ_Акции.ПустаяСсылка");
		Объект.ПроцентныеСтавкиПоПериодам.Очистить();
		ТаблицаСтавок.Очистить();
		Объект.ДатаВыкупа = Дата(1,1,1); 
		Объект.ДатаВыкупаЛьготная = Дата(1,1,1);  
		Объект.СрокЗалога = 0;
		Объект.ПроцентнаяСхема = 0;
		Сообщить("Не определена процентная схема! Расчет процентов по договору займа не возможен.");
    КонецЕсли;	      
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление") Тогда	        
	    РассчитатьСуммуПроцентовПереоформление();
	Иначе	
	    РассчитатьСуммуПроцентов(); 
	КонецЕсли;       
	Если НЕ СуммаЗайма = 0 Тогда	           
		Если НЕ ПСК = 0 Тогда
            СуммаПСКГод = СуммаЗайма*ПСК/100;  
		Иначе
			СуммаПСКГод = 0;
		КонецЕсли;				
		Если НЕ (СуммаПСКГод = 0) Тогда 
			Если РасчетПроцентовПоДоговоруГод() > СуммаПСКГод Тогда
		        Сообщить("Сумма процентов в год превышает предельную ставку кредитования!", СтатусСообщения.Важное);
			КонецЕсли;	
	    КонецЕсли;	 
    КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ТоварыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ) 
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	Если НЕ ПроверитьВесДопМеталлов(СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор()) Тогда
		Сообщить("В разделе ""Дополнительные металлы"" масса металла в общей массе изделия не является наименьшей.");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура РасчетМаксимальнойСуммыОценки(Идентификатор)
	СтрокаТабличнойЧасти = Объект.Товары.НайтиПоИдентификатору(Идентификатор); 
	МассивС = Новый Массив;
	МассивС.Добавить(объект.СтатусЗалогодателя);
	Для каждого Эл Из СписокДопСтатусов Цикл  
		МассивС.Добавить(Эл.Значение);
	Конеццикла;	
	СтрокаТабличнойЧасти.СуммаОценкиМаксимальная = ЛБ_УправлениеЛомбардом.РасчитатьМаксимальнуюСуммуЗалога(Объект.Дата, Объект.СхемаКредитования, МассивС, СтрокаТабличнойЧасти);
КонецПроцедуры	

&НаКлиенте
Процедура ЛомбардПриИзменении(Элемент)  
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов") Тогда
	 	 РассчитатьСуммуПроцентовОплата(); 
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога") Тогда	 
	     ПроверитьВозможностьВыдачиЗалога();	 
	 ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог") ИЛИ
		 Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление") Тогда
		// пересчитаем цену металлов и камней
		//Для каждого СтрокаТабличнойЧастиТовары Из Объект.Товары Цикл
		//	ЦенаДрагоценногоМеталла(СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор());
		//	
		//	ОтборВ = Новый Структура;
		//	ОтборВ.Вставить("КлючСтроки", СтрокаТабличнойЧастиТовары.КлючСтроки);
		//	Строки = Объект.Вставки.НайтиСтроки(ОтборВ);
		//	Для каждого СтрокаТабличнойЧасти Из Строки Цикл		
		//	    ЦенаДрагоценногоКамня(СтрокаТабличнойЧасти.ПолучитьИдентификатор(), СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор());
		//	КонецЦикла;	
		//	СтрокаТабличнойЧастиТовары.СуммаОценкиКамни = Объект.Вставки.Итог("Сумма");
		//	ПересчитатьСуммТовары(СтрокаТабличнойЧастиТовары); 
		//КонецЦикла;	   
		ПолучитьДоступныеПроцентныеСхемыАкции();				
		Если НЕ ТаблицаВыбораСхемыКредитованияАкции.Количество() = 0 Тогда  
			Отбор = Новый Структура;
			Отбор.Вставить("СхемаКредитования", Объект.СхемаКредитования); 
			Отбор.Вставить("Акция", Объект.Акция);   
			СтрокиСК = ТаблицаВыбораСхемыКредитованияАкции.НайтиСтроки(Отбор);
			Если НЕ СтрокиСК.Количество() = 0 Тогда
				ЗаполнитьТаблицуСтавок();
			Иначе
				СтрокаСК = ТаблицаВыбораСхемыКредитованияАкции.Получить(0);
				Объект.СхемаКредитования = СтрокаСК.СхемаКредитования;
				Объект.Акция = СтрокаСК.Акция;
				ЗаполнитьТаблицуСтавок();
				ОбработатьСхемуКредитованияНаСервере(ДатаДок); 
				ЗаполнитьДатуВыкупа();      
			КонецЕсли;	
		    Объект.ДатаВыкупаЛьготная = ПолучитьЛьготнуюДатуВыкупа();
		Иначе
			Объект.СхемаКредитования = ПредопределенноеЗначение("Справочник.ЛБ_СхемыКредитования.ПустаяСсылка");
			Объект.Акция = ПредопределенноеЗначение("Справочник.ЛБ_Акции.ПустаяСсылка");
			Объект.ПроцентныеСтавкиПоПериодам.Очистить();
			ТаблицаСтавок.Очистить();
			Объект.ДатаВыкупа = Дата(1,1,1); 
			Объект.ДатаВыкупаЛьготная = Дата(1,1,1);  
			Объект.СрокЗалога = 0;
			Объект.ПроцентнаяСхема = 0;
			Сообщить("Не определена процентная схема! Расчет процентов по договору займа не возможен.");
		КонецЕсли;	 
		РасчетСуммыОценкиИтоговой(); 
		Если НЕ СуммаЗайма = 0 Тогда	           
			Если НЕ ПСК = 0 Тогда
	            СуммаПСКГод = СуммаЗайма*ПСК/100;  
			Иначе
				СуммаПСКГод = 0;
			КонецЕсли;				
			Если НЕ (СуммаПСКГод = 0) Тогда 
				Если РасчетПроцентовПоДоговоруГод() > СуммаПСКГод Тогда
			        Сообщить("Сумма процентов в год превышает предельную ставку кредитования!", СтатусСообщения.Важное);
				КонецЕсли;	
		    КонецЕсли;	 
		КонецЕсли;  
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление") Тогда	        
		    РассчитатьСуммуПроцентовПереоформление();
		Иначе
			РассчитатьСуммуПроцентов(); 
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВставкиПослеУдаления(Элемент)
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	
	Если НЕ СтрокаТабличнойЧастиТовары = неопределено Тогда
		СтруктураР = ПолучитьВесИСуммуВставокИзделия(СтрокаТабличнойЧастиТовары.КлючСтроки);
		СтрокаТабличнойЧастиТовары.ВесЧистый = Цел((СтрокаТабличнойЧастиТовары.Вес - СтруктураР.Вес)*100)/100;
		СтрокаТабличнойЧастиТовары.СуммаОценкиКамни = СтруктураР.Сумма;
		ПересчитатьСуммТовары();
	КонецЕсли;	
	
	Если СтрокаТабличнойЧастиТовары <> неопределено Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",СтрокаТабличнойЧастиТовары.КлючСтроки);
		Элементы.Вставки.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
	Иначе
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",0);
		Элементы.Вставки.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
		
	КонецЕсли;	 
	ОбновитьДанныеТовары();
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеМеталлыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	
	Отказ = (СтрокаТабличнойЧастиТовары = Неопределено) ИЛИ Копирование; 
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧастиТовары.Проба) Тогда  
		Сообщить("Не выбран основной металл в изделии!"); 
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	СписокПроб = ПолучитьСписокДопМеталлов(СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор()); 
	Если СписокПроб.Количество() = 0 Тогда  
		Сообщить("Не определены дополнительные металлы для металла " + сокрЛП(СтрокаТабличнойЧастиТовары.Проба) + "!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;	 
	Элементы.ДополнительныеМеталлыПроба.СписокВыбора.Очистить();
	Для каждого Эл Из СписокПроб цикл
	    Элементы.ДополнительныеМеталлыПроба.СписокВыбора.Добавить(Эл.Значение);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеМеталлыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока и НЕ Копирование Тогда
		СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	    СтрокаТабличнойЧасти       = Элементы.ДополнительныеМеталлы.ТекущиеДанные;
		СтрокаТабличнойЧасти.ЕдиницаИзмерения = ОсновнаяЕдиницаИзмеренияМеталлы;
        СтрокаТабличнойЧасти.Категория = СтрокаТабличнойЧастиТовары.Категория;
	
	    ЗаполнитьКлючСтрокиВставки(СтрокаТабличнойЧасти,СтрокаТабличнойЧастиТовары); 
	Иначе
		Если Элементы.ДополнительныеМеталлыПроба.СписокВыбора.Количество() = 0 тогда
			СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
			СписокПроб = ПолучитьСписокДопМеталлов(СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор());
			Для каждого Эл Из СписокПроб цикл
			    Элементы.ДополнительныеМеталлыПроба.СписокВыбора.Добавить(Эл.Значение);
			КонецЦикла;	
		КонецЕсли;	
   	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПроверитьВесДопМеталлов(Идентификатор)
	СтрТовары = Объект.Товары.НайтиПоИдентификатору(Идентификатор);
	
	ВесОснМеталла = СтрТовары.Вес;
	
	Отбор = Новый Структура;
	Отбор.Вставить("КлючСтроки", СтрТовары.КлючСтроки);
	Строки = Объект.ДополнительныеМеталлы.НайтиСтроки(Отбор);
	Для каждого Стр из Строки Цикл
		ВесОснМеталла = ВесОснМеталла - Стр.ВесЧистый;
	Конеццикла;	 
	
	ВсеОК = Истина;
	Для каждого Стр из Строки Цикл 
		Если Стр.ВесЧистый > ВесОснМеталла Тогда
			ВсеОК = Ложь;
		КонецЕсли;	
	Конеццикла;	                
	
	Возврат ВсеОК;
КонецФункции

&НаКлиенте
Процедура ДополнительныеМеталлыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;  
	СтрокаТабличнойЧасти = Элементы.ДополнительныеМеталлы.ТекущиеДанные;
	
	Если НЕ ПроверитьВесДопМеталлов(СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор()) Тогда
		Сообщить("В раздел ""Дополнительные металлы"" заносится информация о металле, масса которого, в общей массе изделия, является наименьшей.");
		Отказ = Истина;
	КонецЕсли;	       
	
	Если Отказ тогда
		Возврат;
	конецЕсли;	
	
	Если НЕ СтрокаТабличнойЧастиТовары = неопределено Тогда
		ПересчитатьСуммТовары();
	КонецЕсли;	
	
	Если СтрокаТабличнойЧастиТовары <> неопределено Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",СтрокаТабличнойЧастиТовары.КлючСтроки);
		Элементы.ДополнительныеМеталлы.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
		
	Иначе
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",0);
		Элементы.ДополнительныеМеталлы.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеМеталлыПослеУдаления(Элемент)
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	
	Если НЕ СтрокаТабличнойЧастиТовары = неопределено Тогда
		ПересчитатьСуммТовары();
	КонецЕсли;	
	
	Если СтрокаТабличнойЧастиТовары <> неопределено Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",СтрокаТабличнойЧастиТовары.КлючСтроки);
		Элементы.ДополнительныеМеталлы.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
		
	Иначе
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",0);
		Элементы.ДополнительныеМеталлы.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеМеталлыПробаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ДополнительныеМеталлы.ТекущиеДанные;
	ЦенаДрагоценногоМеталла(СтрокаТабличнойЧасти.ПолучитьИдентификатор(), "ДополнительныеМеталлы");
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеМеталлыВесПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ДополнительныеМеталлы.ТекущиеДанные;
	СтрокаТабличнойЧасти.СуммаОценкиМеталлы = СтрокаТабличнойЧасти.ВесЧистый * СтрокаТабличнойЧасти.Цена;
	//СтрокаТабличнойЧасти.ВесВПробеЧистоты = ПолучитьВесВЧистоте(СтрокаТабличнойЧасти.ВесЧистый,  СтрокаТабличнойЧасти.ПолучитьИдентификатор(), "ДополнительныеМеталлы");
КонецПроцедуры

&НаСервере
Процедура ВставкиВидПриИзмененииНаСервере(Идентификатор, ИдентификаторТовары)
	СтрокаТабличнойЧасти = Объект.Вставки.НайтиПоИдентификатору(Идентификатор);
	СтрокаТабличнойЧастиТовары = Объект.Товары.НайтиПоИдентификатору(ИдентификаторТовары);
	Если СтрокаТабличнойЧасти.Вид = Перечисления.ЛБ_ВидыКомплектующихИзделия.Вставка Тогда
		СтрокаТабличнойЧасти.ВидВставки = Справочники.ЛБ_ДрагоценныеКамни.ПустаяСсылка();
		СтрокаТабличнойЧасти.ЕдиницаИзмерения = ОсновнаяЕдиницаИзмеренияКамни;
	Иначе
		СтрокаТабличнойЧасти.ВидВставки = Справочники.ЛБ_КомплектующиеИзделия.ПустаяСсылка();
		СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТабличнойЧастиТовары.ЕдиницаИзмерения;
		СтрокаТабличнойЧасти.НеОценивать = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВставкиВидПриИзменении(Элемент)
	Идентификатор = Элементы.Вставки.ТекущиеДанные.ПолучитьИдентификатор();
	ИдентификаторТовары = Элементы.Товары.ТекущиеДанные.ПолучитьИдентификатор();

	ВставкиВидПриИзмененииНаСервере(Идентификатор, ИдентификаторТовары);
КонецПроцедуры

&НаКлиенте
Процедура ВставкиНеОцениватьПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Вставки.ТекущиеДанные;
	Если СтрокаТабличнойЧасти.НеОценивать Тогда
		СтрокаТабличнойЧасти.Цена = 0;
		СтрокаТабличнойЧасти.Сумма = 0;
	Иначе
		Если СтрокаТабличнойЧасти.Вид = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыКомплектующихИзделия.Вставка") Тогда
			
			СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
			ЦенаДрагоценногоКамня(СтрокаТабличнойЧасти.ПолучитьИдентификатор(), СтрокаТабличнойЧастиТовары.ПолучитьИдентификатор());
			
			Если СтрокаТабличнойЧасти.ЭтоВесовой Тогда
			    СтрокаТабличнойЧасти.Сумма = окр(СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Вес, 2);
			Иначе
				СтрокаТабличнойЧасти.Сумма = окр(СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество, 2);
			КонецЕсли;
        КонецЕсли;
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Процедура ПослеВыбораДокументаПравоПребывания(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	НоваяСтр = Объект.ДополнительныеДокументыПравоПребыванияРФ.Добавить();
	НоваяСтр.ДокументЗалогодателя = Результат.ДокументЗалогодателя;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("ДокументЗалогодателя", НоваяСтр.ДокументЗалогодателя);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя.Владелец КАК Клиент,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНачалоДействия КАК ДокументНачалоДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&Дата, ДокументЗалогодателя = &ДокументЗалогодателя) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		НоваяСтр.Клиент = Выборка.Клиент;
		НоваяСтр.ВидДокументаЗалогодателя = Выборка.ВидДокументаЗалогодателя;
		НоваяСтр.ВидДокумента = Выборка.ВидДокумента;
		НоваяСтр.ДокументГражданство = Выборка.Гражданство;
		НоваяСтр.ДокументСерия = Выборка.ДокументСерия;
		НоваяСтр.ДокументНомер = Выборка.ДокументНомер;
		НоваяСтр.ДокументДатаВыдачи = Выборка.ДокументДатаВыдачи;
		НоваяСтр.ДокументКемВыдан = Выборка.ДокументКемВыдан;
		НоваяСтр.ДокументКодПодразделения = Выборка.ДокументКодПодразделения;
		НоваяСтр.ДокументНачалоДействия = Выборка.ДокументНачалоДействия;
		НоваяСтр.ДокументСрокДействия = Выборка.ДокументСрокДействия;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДокументПравоПребывания(Команда)
	Если ЗначениеЗаполнено(Объект.Представитель) Тогда 
		СписокВыбораК = Новый СписокЗначений; 

		СписокВыбораК.Добавить(Объект.Залогодатель); 
		СписокВыбораК.Добавить(Объект.Представитель); 

		ВыбранноеЗначение = ВыбратьИзМеню(СписокВыбораК);  
		Если ВыбранноеЗначение = неопределено Тогда
			Возврат;
		КонецЕсли;
		Клиент = ВыбранноеЗначение.Значение;
	Иначе
		Клиент = Объект.Залогодатель; 
	КонецЕсли;	
    ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораДокументаПравоПребывания",ЭтаФорма);
    ЗначениеОтбора = Новый Структура;
    ЗначениеОтбора.Вставить("Залогодатель", Клиент);
    ЗначениеОтбора.Вставить("ВидДокументаЗалогодателя", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийПравоПребыванияРФ"));
    ЗначениеОтбора.Вставить("Дата", ДатаДок);

    ОткрытьФорму("ОбщаяФорма.ЛБ_ПодборДокументовКлиента", ЗначениеОтбора, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура КарточкаЗалогодателя(Команда)
	СтандартнаяОбработка = ложь;
	Если ЗначениеЗаполнено(Объект.Залогодатель) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Залогодатель", Объект.Залогодатель);
		ПараметрыФормы.Вставить("Дата", ДатаДок);	
		ПараметрыФормы.Вставить("ТолькоПросмотр", истина);
		ПараметрыФормы.Вставить("НеРедактировать", истина); 
								
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораКонтакта", ЭтаФорма);
		ОткрытьФорму("ОбщаяФорма.ЛБ_КарточкаЗалогодателя", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Сообщить("Не выбран залогодатель!");
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура КарточкаПредставителя(Команда)
	СтандартнаяОбработка = ложь;
	Если ЗначениеЗаполнено(Объект.Представитель) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Залогодатель", Объект.Представитель);
		ПараметрыФормы.Вставить("Дата", ДатаДок);
		ПараметрыФормы.Вставить("ТолькоПросмотр", истина);
		ПараметрыФормы.Вставить("НеРедактировать", истина); 
		
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораКонтактаПредставителя",ЭтаФорма);
		ОткрытьФорму("ОбщаяФорма.ЛБ_КарточкаЗалогодателя", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Сообщить("Не выбран представитель заемщика!");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДоверенностьПредставителяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВыбЭлемент = ЭтаФорма.ВыбратьИзСписка(Элемент.СписокВыбора, Элемент, 0);
	Если НЕ ВыбЭлемент = Неопределено Тогда 
		Объект.ДоверенностьПредставителя = ВыбЭлемент.Значение;    
		ЗаполнитьТекстДоверенности(Доверенность);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)	
	ОбработатьИзменениеСуммыЗайма();
КонецПроцедуры
	

&НаКлиенте
Процедура ОплатаПроцентов(Полностью = ложь) 
	Если Полностью Тогда 
		Объект.СуммаОплаты = СуммаПроцентов;
	Иначе	
	    Объект.СуммаОплаты = СуммаПроцентов*90/100; 
	КонецЕсли;	
	Объект.СуммаОплатыПроценты = Объект.СуммаОплаты;
	Объект.СуммаОплатыСсуда = 0;
КонецПроцедуры


&НаКлиенте
Процедура ПолныйВыкуп()  
	РассчитатьСуммуПроцентовОплата();
	Объект.СуммаОплаты = СуммаЗайма + СуммаПроцентов;
	Объект.СуммаОплатыПроценты = СуммаПроцентов;
	Объект.СуммаОплатыСсуда = СуммаЗайма; 
КонецПроцедуры


&НаКлиенте
Процедура СуммаОплатыПриИзменении(Элемент)
	Если Объект.СуммаОплаты <= СуммаПроцентов Тогда
		Объект.СуммаОплатыПроценты = Объект.СуммаОплаты;
		Объект.СуммаОплатыСсуда = 0;
	Иначе	
		Объект.СуммаОплатыПроценты = СуммаПроцентов;
		Объект.СуммаОплатыСсуда = Объект.СуммаОплаты - Объект.СуммаОплатыПроценты;
		Если Объект.СуммаОплаты >= (СуммаЗайма + СуммаПроцентов) Тогда 
			Объект.СуммаОплаты = (СуммаЗайма + СуммаПроцентов);
			Объект.Выкуп = Истина;
			Если НЕ (Объект.Залогодатель = ИнформацияОЗаемщике) И НЕ ЗначениеЗаполнено(Объект.ДоверенностьПредставителя) Тогда
				Объект.ВыдачаЗалога = Ложь;
			Иначе
				Объект.ВыдачаЗалога = Истина;
			КонецЕсли;	
		КонецЕсли;	
		РаспределитьСуммуОплатыСсудыТовары();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьСуммуОплатыСсудыТовары() 
	Если Объект.Выкуп Тогда 
		Для каждого Стр Из Объект.Товары Цикл 
			Стр.СуммаОплаты = Стр.СуммаСсуды;  
		КонецЦикла;	
	Иначе	
		СуммаДляРаспределения = Объект.СуммаОплатыСсуда;
		Если СуммаДляРаспределения = 0 Тогда
			Для каждого Стр Из Объект.Товары Цикл
				Стр.СуммаОплаты = 0;   
			Конеццикла;	
		Иначе	
			НомСтрМакс = 0; 
			МаксЗадолженность = 0;
			ЗадолженностьНачИтог = Объект.Товары.Итог("СуммаСсуды");
			Для каждого Стр Из Объект.Товары Цикл 
				Коэфф = Стр.СуммаСсуды/ЗадолженностьНачИтог;
				Стр.СуммаОплаты = Объект.СуммаОплатыСсуда*Коэфф;
				СуммаДляРаспределения = СуммаДляРаспределения - Стр.СуммаОплаты;
				Если Стр.СуммаСсуды > МаксЗадолженность Тогда
					МаксЗадолженность = Стр.СуммаСсуды;  
					НомСтрМакс = стр.НомерСтроки-1;
				КонецЕсли;	
			КонецЦикла;
			Если НЕ СуммаДляРаспределения = 0 Тогда
				Стр = Объект.Товары.Получить(НомСтрМакс);
				Стр.СуммаОплаты = Стр.СуммаОплаты + СуммаДляРаспределения;
			КонецЕсли;  
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура Оплатить(Команда)
	СписокВыбора = Новый СписокЗначений; 

    СписокВыбора.Добавить(1, "Свободная оплата"); 
    СписокВыбора.Добавить(2, "Оплата процентов для продления договора");
	СписокВыбора.Добавить(3, "Полная оплата процентов");
	СписокВыбора.Добавить(4, "Полный выкуп объектов залога");

    ВыбранноеЗначение = ВыбратьИзСписка(СписокВыбора, Элементы.КнопкаОплатить); 

	Если ВыбранноеЗначение <> Неопределено Тогда 
	    ВыбЗначение = ВыбранноеЗначение.Значение; 
		Если ВыбЗначение = 1 Тогда
			Элементы.СуммаОплаты.ТолькоПросмотр = ложь; 
			Объект.Выкуп = ?(Объект.Выкуп, ложь, Объект.Выкуп);
			Объект.ВыдачаЗалога = ?(Объект.ВыдачаЗалога, ложь, Объект.ВыдачаЗалога);
		ИначеЕсли ВыбЗначение = 2 Тогда
			ОплатаПроцентов();
			Элементы.СуммаОплаты.ТолькоПросмотр = Истина;
			Объект.Выкуп = ?(Объект.Выкуп, ложь, Объект.Выкуп);
			Объект.ВыдачаЗалога = ?(Объект.ВыдачаЗалога, ложь, Объект.ВыдачаЗалога);
		ИначеЕсли ВыбЗначение = 3 Тогда
			ОплатаПроцентов(Истина);
			Элементы.СуммаОплаты.ТолькоПросмотр = Истина;
			Объект.Выкуп = ?(Объект.Выкуп, ложь, Объект.Выкуп);
			Объект.ВыдачаЗалога = ?(Объект.ВыдачаЗалога, ложь, Объект.ВыдачаЗалога);	
		ИначеЕсли ВыбЗначение = 4 Тогда
			ПолныйВыкуп();
			Элементы.СуммаОплаты.ТолькоПросмотр = Истина;
			Объект.Выкуп = Истина; 
			Если НЕ (Объект.Залогодатель = ИнформацияОЗаемщике) И НЕ ЗначениеЗаполнено(Объект.ДоверенностьПредставителя) Тогда
				Объект.ВыдачаЗалога = Ложь;
			Иначе
				Объект.ВыдачаЗалога = Истина;
			КонецЕсли;	
		КонецЕсли;	 
		РаспределитьСуммуОплатыСсудыТовары();
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Расчеты(Команда)
	Сообщить("Здесь будет отчет по расчетам по договору займа", статусСообщения.Информация);
КонецПроцедуры

&НаСервере
Процедура ОбработатьПромокодНаСервере() 
	ПолучитьДоступныеПроцентныеСхемыАкции();
	Если НЕ ТаблицаВыбораСхемыКредитованияАкции.Количество() = 0 Тогда
		Если НЕ ПустаяСтрока(Объект.Промокод) Тогда
			Отбор = Новый Структура;
			Отбор.Вставить("СхемаКредитования", Объект.СхемаКредитования);   
			СтрокиСК = ТаблицаВыбораСхемыКредитованияАкции.НайтиСтроки(Отбор);
			Если НЕ СтрокиСК.Количество() = 0 Тогда 
				ЕстьАкцияПромокод = ложь;
				Для Сч = 0 По СтрокиСК.Количество()-1 Цикл
					Акция = ТаблицаВыбораСхемыКредитованияАкции.Получить(сч).Акция;
					Если НЕ ЗначениеЗаполнено(Акция) Тогда
						Продолжить;
					ИначеЕсли НЕ СокрЛП(Акция.Промокод) = СокрЛП(Объект.Промокод) Тогда	
						Продолжить;
					КонецЕсли;	 
					Объект.Акция = Акция;
				    ЗаполнитьТаблицуСтавок(); 
					ЕстьАкцияПромокод = Истина; 
					Прервать;
				КонецЦикла;  
				Если НЕ ЕстьАкцияПромокод Тогда
					Сообщить("Для кредитной схемы " + СокрЛП(Объект.СхемаКредитования) + " акция с промокодом " + СокрЛП(Объект.Промокод) + " не действует.");
					Объект.Промокод = ""; 
					Возврат;
				КонецЕсли;	
			Иначе  
				Сообщить("Для кредитной схемы " + СокрЛП(Объект.СхемаКредитования) + " акция с промокодом " + СокрЛП(Объект.Промокод) + " не действует.");
				Объект.Промокод = "";
				Возврат;
			КонецЕсли;	 
		Иначе
			СтрСК = ТаблицаВыбораСхемыКредитованияАкции.Получить(0);
			Объект.СхемаКредитования = СтрСК.СхемаКредитования;
			Объект.Акция = СтрСК.Акция;			
			ЗаполнитьТаблицуСтавок();    
			Если НЕ ЗначениеЗаполнено(Объект.ПроцентнаяСхема) Тогда
                Сообщить("Не определена процентная схема! Расчет процентов по договору займа не возможен.");
            КонецЕсли;
			ОбработатьСхемуКредитованияНаСервере(ДатаДок); 
		КонецЕсли;
	Иначе     
		Объект.СхемаКредитования = ПредопределенноеЗначение("Справочник.ЛБ_СхемыКредитования.ПустаяСсылка");
		Объект.Акция = ПредопределенноеЗначение("Справочник.ЛБ_Акции.ПустаяСсылка");
		Объект.ПроцентныеСтавкиПоПериодам.Очистить();
		ТаблицаСтавок.Очистить();
		Объект.ДатаВыкупа = Дата(1,1,1); 
		Объект.ДатаВыкупаЛьготная = Дата(1,1,1);  
		Объект.СрокЗалога = 0;
		Объект.ПроцентнаяСхема = 0;  
		Сообщить("Не определена процентная схема! Расчет процентов по договору займа не возможен.");
	КонецЕсли;
	РасчетСуммыОценкиИтоговой();   
	Если НЕ СуммаЗайма = 0 Тогда	           
		Если НЕ ПСК = 0 Тогда
            СуммаПСКГод = СуммаЗайма*ПСК/100;  
		Иначе
			СуммаПСКГод = 0;
		КонецЕсли;				
		Если НЕ (СуммаПСКГод = 0) Тогда 
			Если РасчетПроцентовПоДоговоруГод() > СуммаПСКГод Тогда
		        Сообщить("Сумма процентов в год превышает предельную ставку кредитования!", СтатусСообщения.Важное);
			КонецЕсли;	
	    КонецЕсли;	 
	КонецЕсли;	
    РассчитатьСуммуПроцентов();
КонецПроцедуры

&НаКлиенте
Процедура ПромокодПриИзменении(Элемент)
	ОбработатьПромокодНаСервере();
КонецПроцедуры

&НаСервере
Процедура РаспределитьСуммуЗайма()
	СуммаДляРаспределения = СуммаЗайма;
	Если СуммаДляРаспределения = 0 Тогда
		Возврат;
	КонецЕсли;	
	НомСтрМакс = 0; 
	МаксОценка = 0;
	МаксимальнаяОценкаИтог = Объект.Товары.Итог("СуммаОценкиМаксимальная");
	Для каждого Стр Из Объект.Товары Цикл 
		Коэфф = Стр.СуммаОценкиМаксимальная/МаксимальнаяОценкаИтог;
		Стр.СуммаСсуды = СуммаЗайма*Коэфф; 
		СуммаДляРаспределения = СуммаДляРаспределения - Стр.СуммаСсуды;
		Если Стр.СуммаОценкиМаксимальная > МаксОценка Тогда
			МаксОценка = Стр.СуммаОценкиМаксимальная;  
			НомСтрМакс = стр.НомерСтроки;
		КонецЕсли;	
	КонецЦикла;
	Если НЕ СуммаДляРаспределения = 0 Тогда
		Стр = Объект.Товары.Получить(НомСтрМакс);
		Стр.СуммаСсуды = Стр.СуммаСсуды + СуммаДляРаспределения;
	КонецЕсли;	
КонецПроцедуры
                                                           
&НаКлиенте
Процедура СуммаЗаймаПриИзменении(Элемент)  	 
	Если СуммаЗайма > Объект.Товары.Итог("СуммаОценкиМаксимальная") Тогда
		СуммаЗайма = ОкруглитьСуммуСсуды(Объект.Товары.Итог("СуммаОценкиМаксимальная"));  
	КонецЕсли;    
	РаспределитьСуммуЗайма();
	Объект.СуммаСсуды = СуммаЗайма;
	Если НЕ ТаблицаВыбораСхемыКредитованияАкции.Количество() = 0 Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("СхемаКредитования", Объект.СхемаКредитования); 
		Отбор.Вставить("Акция", Объект.Акция);   
		СтрокиСК = ТаблицаВыбораСхемыКредитованияАкции.НайтиСтроки(Отбор);
		Если НЕ СтрокиСК.Количество() = 0 Тогда
			ЗаполнитьТаблицуСтавок();
		Иначе 
			СтрокаСК = ТаблицаВыбораСхемыКредитованияАкции.Получить(0);
			Объект.СхемаКредитования = СтрокаСК.СхемаКредитования;
			Объект.Акция = СтрокаСК.Акция; 
			ОбработатьСхемуКредитованияНаСервере(ДатаДок);
			ЗаполнитьТаблицуСтавок();
		КонецЕсли;	
	Иначе
		Объект.СхемаКредитования = ПредопределенноеЗначение("Справочник.ЛБ_СхемыКредитования.ПустаяСсылка");
		Объект.Акция = ПредопределенноеЗначение("Справочник.ЛБ_Акции.ПустаяСсылка");
		Объект.ПроцентныеСтавкиПоПериодам.Очистить();
		ТаблицаСтавок.Очистить();
		Объект.ДатаВыкупа = Дата(1,1,1); 
		Объект.ДатаВыкупаЛьготная = Дата(1,1,1);  
		Объект.СрокЗалога = 0;
		Объект.ПроцентнаяСхема = 0;
		Сообщить("Не определена процентная схема! Расчет процентов по договору займа не возможен.");
	КонецЕсли;	
	Если НЕ СуммаЗайма = 0 Тогда	           
		Если НЕ ПСК = 0 Тогда
            СуммаПСКГод = СуммаЗайма*ПСК/100;  
		Иначе
			СуммаПСКГод = 0;
		КонецЕсли;				
		Если НЕ (СуммаПСКГод = 0) Тогда 
			Если РасчетПроцентовПоДоговоруГод() > СуммаПСКГод Тогда
		        Сообщить("Сумма процентов в год превышает предельную ставку кредитования!", СтатусСообщения.Важное);
			КонецЕсли;	
	    КонецЕсли;	 
	КонецЕсли;    
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление") Тогда	        
	    РассчитатьСуммуПроцентовПереоформление();
	Иначе
		РассчитатьСуммуПроцентов(); 
	КонецЕсли;	  
	//Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление") Тогда 
	//	КВыдачеОплате = СуммаЗайма - СуммаОплатыПереоформление;
	//	Если КВыдачеОплате > 0 Тогда
	//	    Элементы.ДекорацияКВыдачеОплате.Заголовок = "К выдаче " + СокрЛП(Формат(КВыдачеОплате, "ЧЦ=15; ЧДЦ=2; ЧРД=,")) + " руб."; 
	//	Иначе     
	//		КВыдачеОплате = ?(КВыдачеОплате < 0, -КВыдачеОплате, КВыдачеОплате);
	//		Элементы.ДекорацияКВыдачеОплате.Заголовок = "К доплате " + СокрЛП(Формат(КВыдачеОплате, "ЧЦ=15; ЧДЦ=2; ЧРД=,")) + " руб.";
	//	КонецЕсли;	
	//Конецесли;	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаИсторииЗБВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)  
	Текстрока = Элементы.ТаблицаИсторииЗБ.ТекущиеДанные;  
	Если НЕ ТекСтрока = неопределено Тогда
		СсылкаНаДокумент = Текстрока.ДокументДвижения;
	    ПараметрыФормы = Новый Структура("Ключ", СсылкаНаДокумент);
		ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
	    ОткрытьФорму("Документ.ЛБ_ОперацияПоЗалогу.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИменникПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	Если НЕ ТекСтрока.Именник = ПредопределенноеЗначение("Перечисление.ЛБ_Именник.Да") Тогда 
		ТекСтрока.ДанныеИменника = "";
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыДанныеИменникаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущееЗначение = ТекСтрока.ДанныеИменника;
	Если ВвестиЗначение(ТекущееЗначение, "Введите данные именника") Тогда
		ТекСтрока.ДанныеИменника = ТекущееЗначение;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕстьДеффектыПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	Если НЕ ТекСтрока.ЕстьДеффекты Тогда 
		ТекСтрока.Дефекты = ""; 
		Объект.Дефекты.Очистить(); 
	Иначе
		ОткрытьВыборДефектов();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВыборДефектов()
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура;   
	ОтборД = Новый Структура;
	ОтборД.Вставить("КлючСтроки", ТекСтрока.КлючСтроки);
	СтрокиД = Объект.Дефекты.НайтиСтроки(ОтборД);
	Если НЕ СтрокиД.Количество() = 0 Тогда
		СписокДефектов = новый списокЗначений;
		ДругиеДефекты = "";
		Для каждого СтрД из СтрокиД Цикл 
			Если ТипЗнч(СтрД.Дефект) = Тип("СправочникСсылка.ЛБ_Дефекты") Тогда 
				СписокДефектов.Добавить(СтрД.Дефект);
			ИначеЕсли ТипЗнч(СтрД.Дефект) = Тип("Строка") Тогда
				ПараметрыФормы.Вставить("ДругиеДефекты", СтрД.Дефект);
	        КонецЕсли;
		Конеццикла;	 
		Если НЕ СписокДефектов.Количество() = 0 Тогда
		    ПараметрыФормы.Вставить("Дефекты", СписокДефектов);
		КонецЕсли;	 
	КонецЕсли;	
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораДефектов",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ВыборДефектов", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
	
&НаКлиенте
Процедура ТоварыДефектыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьВыборДефектов();
КонецПроцедуры
  
 &НаКлиенте 
Процедура ПослеВыбораДефектов(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли; 
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные; 
	ТекСтрока.Дефекты = "";
	ОтборД = Новый Структура;
	ОтборД.Вставить("КлючСтроки", ТекСтрока.КлючСтроки);
	СтрокиД = Объект.Дефекты.НайтиСтроки(ОтборД);
	
	Для каждого стрД из СтрокиД Цикл 
		Объект.Дефекты.Удалить(СтрД);
	Конеццикла;	                   
	
	Для каждого Эл Из Результат.списокДефектов цикл 
		Если Эл.Пометка тогда 
			НоваяСтрД = Объект.Дефекты.Добавить();
			НоваяСтрД.Ключстроки = ТекСтрока.КлючСтроки; 
			НоваяСтрД.Дефект = Эл.Значение;
			
			ТекСтрока.Дефекты = ТекСтрока.Дефекты + ?(Пустаястрока(ТекСтрока.Дефекты), "", "; ") + сокрЛП(НоваяСтрД.Дефект);
		КонецЕсли;	
	Конеццикла;	 
	Если НЕ Пустаястрока(Результат.ДругиеДефекты) тогда 
		НоваяСтрД = Объект.Дефекты.Добавить();
		НоваяСтрД.Ключстроки = ТекСтрока.КлючСтроки; 
		НоваяСтрД.Дефект = Результат.ДругиеДефекты;
		
		ТекСтрока.Дефекты = ТекСтрока.Дефекты + ?(Пустаястрока(ТекСтрока.Дефекты), "", "; ") + сокрЛП(НоваяСтрД.Дефект);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕстьВставкиПриИзменении(Элемент)
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные; 
	Если НЕ СтрокаТабличнойЧастиТовары.ЕстьВставки Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",СтрокаТабличнойЧастиТовары.КлючСтроки);
		Строки = Объект.Вставки.НайтиСтроки(Отбор);
		Если НЕ Строки.Количество() = 0 Тогда
			Режим = РежимДиалогаВопрос.ДаНет;
			Ответ = Вопрос("У изделия есть вставки. Удалить вставки?", Режим, 0);
			Если Ответ = КодВозвратаДиалога.Да Тогда
				Для каждого стр из Строки Цикл 
					Объект.Вставки.Удалить(Стр);
				Конеццикла;	  
				ОбновитьДанныеТовары();
			Иначе
			    СтрокаТабличнойЧастиТовары.ЕстьВставки = Истина; 	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	СвернутьРазвернутьПанелиВставкиДопМеталлы(СтрокаТабличнойЧастиТовары);
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокДопМеталлов(Идентификатор)
	Стр = Объект.Товары.НайтиПоИдентификатору(Идентификатор);
	СписокПроб = Новый СписокЗначений;
    ОсновнойМеталл = Стр.Проба.Владелец; 
	
	ЗапросП = Новый Запрос;
	ЗапросП.Текст = "ВЫБРАТЬ
	                |	ЛБ_Пробы.Ссылка КАК Проба
	                |ИЗ
	                |	Справочник.ЛБ_Пробы КАК ЛБ_Пробы
	                |ГДЕ
	                |	ЛБ_Пробы.Владелец = &Владелец
	                |	И ЛБ_Пробы.ПометкаУдаления = ЛОЖЬ
	                |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("ОсновнойМеталл", ОсновнойМеталл);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДополнительныеМеталлыВИзделиях.ДополнительныйМеталл КАК ДополнительныйМеталл
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДополнительныеМеталлыВИзделиях КАК ЛБ_ДополнительныеМеталлыВИзделиях
	               |ГДЕ
	               |	ЛБ_ДополнительныеМеталлыВИзделиях.ОсновнойМеталл = &ОсновнойМеталл
	               |АВТОУПОРЯДОЧИВАНИЕ";  
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗапросП.УстановитьПараметр("Владелец", Выборка.ДополнительныйМеталл); 
		ВыборкаП = ЗапросП.Выполнить().Выбрать();
		Пока ВыборкаП.Следующий() Цикл 
			СписокПроб.Добавить(ВыборкаП.Проба);
		Конеццикла;	
	Конеццикла;	 
	
	Возврат СписокПроб;
КонецФункции

&НаКлиенте
Процедура ТоварыЕстьДопМеталлыПриИзменении(Элемент)
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные; 
	Если НЕ СтрокаТабличнойЧастиТовары.ЕстьДопМеталлы Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",СтрокаТабличнойЧастиТовары.КлючСтроки);
		Строки = Объект.ДополнительныеМеталлы.НайтиСтроки(Отбор);
		Если НЕ Строки.Количество() = 0 Тогда
			Режим = РежимДиалогаВопрос.ДаНет;
			Ответ = Вопрос("У изделия есть дополнительные металлы. Удалить доп. металлы?", Режим, 0);
			Если Ответ = КодВозвратаДиалога.Да Тогда
				Для каждого стр из Строки Цикл 
					Объект.ДополнительныеМеталлы.Удалить(Стр);
				Конеццикла;	  
			Иначе
			    СтрокаТабличнойЧастиТовары.ЕстьДопМеталлы = Истина;  
			КонецЕсли;
		КонецЕсли;          
	КонецЕсли;
	СвернутьРазвернутьПанелиВставкиДопМеталлы(СтрокаТабличнойЧастиТовары);
КонецПроцедуры

&НаКлиенте
Процедура Этикетка(Команда)  
	СтрокаТабличнойЧастиТовары = Элементы.Товары.ТекущиеДанные;
	Если НЕ СтрокаТабличнойЧастиТовары = неопределено Тогда 
		Если СтрокаТабличнойЧастиТовары.ЕстьЭтикетка Тогда 
			СсылкаНаЭтикетку = СтрокаТабличнойЧастиТовары.Этикетка; 
			ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЭтикетки",ЭтаФорма);
			Если ЗначениеЗаполнено(СсылкаНаЭтикетку) Тогда
				ПараметрыФормы = Новый Структура("Ключ", СсылкаНаЭтикетку);
			Иначе					
				ПараметрыФормы = Новый Структура;
				ПараметрыФормы.Вставить("Дата", Объект.Дата);
				ПараметрыФормы.Вставить("Залогодатель", Объект.Залогодатель);
			КонецЕсли;	
			ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЭтикетки",ЭтаФорма);  
			ОткрытьФорму("Справочник.ЛБ_ХранилищеЭтикеток.ФормаОбъекта", Параметрыформы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры   


&НаСервере  
Процедура СохранитьЭтикетку(ИдентификаторСтроки, Картинка)
	Стр = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки); 
	ОБ = РеквизитФормыВЗначение("Объект");
    СтрокаТ = ОБ.Товары.Найти(стр.КлючСтроки, "КлючСтроки");  		
	
	СтрокаТ.Этикетка = Новый ХранилищеЗначения(Картинка);
КонецПроцедуры	

&НаКлиенте 
Процедура ПослеВыбораЭтикетки(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли; 
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ТекСтрока.Этикетка = Результат;
	ТекСтрока.ЕстьФайл = истина;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕстьФайлНажатие(Элемент, СтандартнаяОбработка)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;  
	Если ЗначениеЗаполнено(ТекСтрока.Этикетка) тогда
		СсылкаНаЭтикетку = ТекСтрока.Этикетка;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", СсылкаНаЭтикетку); 
		ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
		ОткрытьФорму("Справочник.ЛБ_ХранилищеЭтикеток.ФормаОбъекта", Параметрыформы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	КонецЕсли;	
КонецПроцедуры

&НаСервере  
Процедура УдалитьСканЭтикетки(Этикетка)
	ОбъектЭ = Этикетка.получитьОбъект();
	ОбъектЭ.УстановитьПометкуУдаления(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЭтикеткаУдалить(Команда)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;  
	Если ЗначениеЗаполнено(ТекСтрока.Этикетка) тогда 
		УдалитьСканЭтикетки(ТекСтрока.Этикетка);
		ТекСтрока.Этикетка = ПредопределенноеЗначение("Справочник.ЛБ_ХранилищеЭтикеток.ПустаяСсылка");  
		ТекСтрока.ЕстьФайл = ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	Если Поле.Имя = "ТоварыЕстьФайл" тогда
		ТекСтрока = Элементы.Товары.ТекущиеДанные;  
		Если ЗначениеЗаполнено(ТекСтрока.Этикетка) тогда
			СсылкаНаЭтикетку = ТекСтрока.Этикетка;
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Ключ", СсылкаНаЭтикетку); 
			ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
			ОткрытьФорму("Справочник.ЛБ_ХранилищеЭтикеток.ФормаОбъекта", Параметрыформы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
		КонецЕсли;	 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕстьЭтикеткаПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;  
	Если ЗначениеЗаполнено(ТекСтрока.Этикетка) тогда 
		УдалитьСканЭтикетки(ТекСтрока.Этикетка);
		ТекСтрока.Этикетка = ПредопределенноеЗначение("Справочник.ЛБ_ХранилищеЭтикеток.ПустаяСсылка");  
		ТекСтрока.ЕстьФайл = ложь;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОценкуЗалогаИзъятие(Идентификатор) 
	СтрИ = Объект.ТоварыИзъятыеВозвращенные.НайтиПоИдентификатору(Идентификатор);  
	Отбор = новый Структура;
	Отбор.Вставить("ОбъектЗалога", СтрИ.ОбъектЗалога);
	СтрокиТ = Объект.ПредыдущаяОперация.Товары.НайтиСтроки(Отбор);
	Если СтрокиТ.Количество() = 0 тогда
		СтрИ.СуммаОценки = 0;
	Иначе  
		СтрИ.СуммаОценки = СтрокиТ.Получить(0).СуммаОценки;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИзъятыеОбъектЗалогаПриИзменении(Элемент)
	ТекСтрока = Элементы.ТоварыИзъятые.ТекущиеДанные; 
	ЗаполнитьОценкуЗалогаИзъятие(ТекСтрока.ПолучитьИдентификатор());
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИзъятыеПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ЗаполнитьСписокВыбораИзъятия();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИзъятыеПослеУдаления(Элемент)
	ЗаполнитьСписокВыбораИзъятия();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВозвращенныеПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ЗаполнитьСписокВыбораВозврат();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВозвращенныеПослеУдаления(Элемент)
	ЗаполнитьСписокВыбораВозврат();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВозвращенныеОбъектЗалогаПриИзменении(Элемент)
	ТекСтрока = Элементы.ТоварыВозвращенные.ТекущиеДанные; 
	ЗаполнитьОценкуЗалогаИзъятие(ТекСтрока.ПолучитьИдентификатор());
КонецПроцедуры

&НаКлиенте
Процедура СрокЗалогаПриИзменении(Элемент)
	ЗаполнитьДатуВыкупа();
	Объект.ДатаВыкупаЛьготная = ПолучитьЛьготнуюДатуВыкупа(); 
КонецПроцедуры





 
