&НаКлиенте
Перем Сохранить Экспорт;
  
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТолькоПросмотр") Тогда
		//+МАН 14.11.24 Добавлено условие. Заявка 2464
		Если Параметры.ТолькоПросмотр <> Неопределено Тогда
			Элементы.СохранитьИЗакрыть.Доступность = НЕ Параметры.ТолькоПросмотр;
		КонецЕсли;
		//-МАН
	КонецЕсли;
	
	Если Параметры.Свойство("ВидВставки") Тогда 
		ВидВставки = Параметры.ВидВставки;
	КонецЕсли;
	
	Если Параметры.Свойство("ФормаОгранки") Тогда 
		ФормаОгранки = Параметры.ФормаОгранки;
	КонецЕсли;
	
	Если Параметры.Свойство("ВидОгранки") Тогда 
		ВидОгранки = Параметры.ВидОгранки;
	КонецЕсли;
	
	Если Параметры.Свойство("КачествоОгранки") Тогда 
		КачествоОгранки = Параметры.КачествоОгранки;
	КонецЕсли;
	
	Если Параметры.Свойство("Диаметр") Тогда 
		Диаметр = Параметры.Диаметр;
	КонецЕсли; 
	
	Если Параметры.Свойство("Диаметр1") Тогда 
		Диаметр1 = Параметры.Диаметр1;
	КонецЕсли;
	
    Если Параметры.Свойство("Диаметр2") Тогда 
		Диаметр2 = Параметры.Диаметр2;
	КонецЕсли;
	
	Если Параметры.Свойство("Длина") Тогда 
		Длина = Параметры.Длина;
	КонецЕсли;
	
    Если Параметры.Свойство("Ширина") Тогда 
		Ширина1 = Параметры.Ширина;
	КонецЕсли;
	
    Если Параметры.Свойство("Высота") Тогда 
		Высота1 = Параметры.Высота;
	КонецЕсли;
	
	Если Параметры.Свойство("Сторона") Тогда 
		Сторона = Параметры.Сторона;
	КонецЕсли;
	
    Если Параметры.Свойство("Количество") Тогда 
		Количество = Параметры.Количество;
	КонецЕсли; 
	
	Если Параметры.Свойство("ВесКар") Тогда 
		Вес = Параметры.ВесКар;
		ВесШт = ?(Количество = 0, 0, Вес/Количество);
	КонецЕсли;
	
	Если Параметры.Свойство("ВесГраммы") Тогда 
		ВесГраммы = Параметры.ВесГраммы; 
		ВесГраммыШт = ?(Количество = 0, 0, ВесГраммы/Количество);
	КонецЕсли;
	
	Если Параметры.Свойство("Именник") Тогда 
		Именник = Параметры.Именник;
	КонецЕсли;
	
    Если Параметры.Свойство("КатегорияОбъектаЗалога") Тогда 
		КатегорияОбъектаЗалога = Параметры.КатегорияОбъектаЗалога;
	КонецЕсли;
	
	Если Параметры.Свойство("ВесВручную") Тогда 
		ВесВручную = Параметры.ВесВручную;
	КонецЕсли;
	
	Если Параметры.Свойство("НоваяСтрокаТЧ") Тогда 
		НоваяСтрока = Параметры.НоваяСтрокаТЧ;
	Иначе
		НоваяСтрока = Ложь;
	КонецЕсли;
	
	//+Мельников 20.05.24 Фактические данные
	Если Параметры.Свойство("ВидВставкиФакт") Тогда 
		ВидВставкиФакт = Параметры.ВидВставкиФакт;
	КонецЕсли;
	
	Если Параметры.Свойство("ФормаОгранкиФакт") Тогда 
		ФормаОгранкиФакт = Параметры.ФормаОгранкиФакт;
	КонецЕсли;
	
	Если Параметры.Свойство("ВидОгранкиФакт") Тогда 
		ВидОгранкиФакт = Параметры.ВидОгранкиФакт;
	КонецЕсли;
	
	Если Параметры.Свойство("КачествоОгранкиФакт") Тогда 
		КачествоОгранкиФакт = Параметры.КачествоОгранкиФакт;
	КонецЕсли;
	
	Если Параметры.Свойство("ДиаметрФакт") Тогда 
		ДиаметрФакт = Параметры.ДиаметрФакт;
	КонецЕсли;
	
	Если Параметры.Свойство("Диаметр1Факт") Тогда 
		Диаметр1Факт = Параметры.Диаметр1Факт;
	КонецЕсли;
	
    Если Параметры.Свойство("Диаметр2Факт") Тогда 
		Диаметр2Факт = Параметры.Диаметр2Факт;
	КонецЕсли;
	
	Если Параметры.Свойство("ДлинаФакт") Тогда 
		ДлинаФакт = Параметры.ДлинаФакт;
	КонецЕсли;
	
    Если Параметры.Свойство("ШиринаФакт") Тогда 
		ШиринаФакт = Параметры.ШиринаФакт;
	КонецЕсли;
	
    Если Параметры.Свойство("ВысотаФакт") Тогда 
		ВысотаФакт = Параметры.ВысотаФакт;
	КонецЕсли;
	
	Если Параметры.Свойство("СторонаФакт") Тогда 
		СторонаФакт = Параметры.СторонаФакт;
	КонецЕсли;
	
    Если Параметры.Свойство("КоличествоФакт") Тогда 
		КоличествоФакт = Параметры.КоличествоФакт;
	КонецЕсли;
	
	Если Параметры.Свойство("ВесФакт") Тогда 
		ВесФакт = Параметры.ВесФакт;
		ВесШтФакт = ?(КоличествоФакт = 0, 0, ВесФакт/КоличествоФакт);
	КонецЕсли;
	
	Если Параметры.Свойство("ВесГраммыФакт") Тогда 
		ВесГраммыФакт = Параметры.ВесГраммыФакт; 
		ВесГраммыШтФакт = ?(КоличествоФакт = 0, 0, ВесГраммыФакт/КоличествоФакт);
	КонецЕсли;
	
	Если Параметры.Свойство("ИменникФакт") Тогда 
		ИменникФакт = Параметры.ИменникФакт;
	КонецЕсли;
	
    Если Параметры.Свойство("КатегорияОбъектаЗалогаФакт") Тогда 
		КатегорияОбъектаЗалогаФакт = Параметры.КатегорияОбъектаЗалогаФакт;
	КонецЕсли;   

    Если Параметры.Свойство("ИДНоваяСтрокаТЧ") Тогда 
		ИДНоваяСтрокаТЧ = Параметры.ИДНоваяСтрокаТЧ;
	КонецЕсли;   

    Если Параметры.Свойство("ОбъектЗалога") Тогда 
		ОбъектЗалога = Параметры.ОбъектЗалога;
	КонецЕсли;   

	Если Параметры.Свойство("НеОценивать") Тогда 
		НеОценивать = Параметры.НеОценивать;
	КонецЕсли;   

	Если Параметры.Свойство("НеОцениватьФакт") Тогда 
		НеОцениватьФакт = Параметры.НеОцениватьФакт;
	КонецЕсли;   
	
	//+Мельников 17.10.24 Завяка 2464.
	Если Параметры.Свойство("ТЧ") Тогда
		ТЧВставкаК = Параметры.ТЧ.ВставкаК;
		ТЧВставкаМ = Параметры.ТЧ.ВставкаМ;
		ТЧОсновная = Параметры.ТЧ.Основная;
	КонецЕсли;

	Если Параметры.Свойство("ОбщаяМассаФакт") Тогда
		ОбщаяМассаФакт = Параметры.ОбщаяМассаФакт;
	КонецЕсли;
	//-Мельников
	
	//Если ЗначениеЗаполнено(ВидВставки) Тогда  
	//	ЕдиницаИзмерения = ПолучитьЕдиницуРасчета();
	//	ЗаполнитьСписокВыбораКачестваОгранки();
	//	ПроверитьФормуОгранки(, ФормаОгранки); 	
	//	ЗаполнитьСписокВыбораВидовОгранки();
	//КонецЕсли;
	
	//+Мельников 21.05.24
	Если ЗначениеЗаполнено(ВидВставкиФакт) Тогда
		ЕдиницаИзмеренияФакт = ПолучитьЕдиницуРасчета(Истина);
		ЗаполнитьСписокВыбораКачестваОгранки(Истина);
		ПроверитьФормуОгранки(Истина, ФормаОгранкиФакт);
		ЗаполнитьСписокВыбораВидовОгранки(Истина);
	КонецЕсли;
	УстановитьВидимость(Истина);
	ПолучитьСпособРасчетаВеса(Истина);
	УстановитьДоступность(Истина);
	//-Мельников
	
    УстановитьВидимость();
	ПолучитьСпособРасчетаВеса();
	УстановитьДоступность();   
	//+МАН 24.03.25 Закомментировал
	//Если СпособРасчетаВеса = Перечисления.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице Тогда
	//	РассчитатьВесКамняПоТаблице();  
	//ИначеЕсли СпособРасчетаВеса = Перечисления.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле Тогда
	//	РассчитатьВесКамняПоФормуле();  	
	//КонецЕсли;	

	////+Мельников 21.05.24
	//Если СпособРасчетаВесаФакт = Перечисления.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице Тогда
	//	РассчитатьВесКамняПоТаблице(Истина);  
	//ИначеЕсли СпособРасчетаВесаФакт = Перечисления.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле Тогда
	//	РассчитатьВесКамняПоФормуле(Истина);  	
	//КонецЕсли;	
	//-МАН
	//-Мельников

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Сохранить = Ложь;
КонецПроцедуры


//+Мельников 21.05.24 Добавлен параметр "Факт".
&НаСервере
Процедура УстановитьВидимость(Факт = Ложь)
	//Элементы.ГруппаД0.Видимость = Ложь; 
	//Элементы.ГруппаД1.Видимость = Ложь;
	//Элементы.ГруппаД2.Видимость = Ложь;
	//Элементы.ГруппаД.Видимость = Ложь;
	//Элементы.ГруппаШ.Видимость = Ложь;
	//Элементы.ГруппаВ.Видимость = Ложь; 
	//Элементы.ГруппаС.Видимость = Ложь;
	
	//+Мельников 21.05.24 Во всей процедуре добавлены проверки условия на "Факт" "?(".
	Если НоваяСтрока Тогда
		Элементы.ГруппаУчетныхДанных.Видимость = Ложь;
	КонецЕсли;
	
    Если Факт Тогда
		Элементы.ГруппаД0Факт.Видимость = Ложь; 
		Элементы.ГруппаД1Факт.Видимость = Ложь;
		Элементы.ГруппаД2Факт.Видимость = Ложь;
		Элементы.ГруппаДФакт.Видимость = Ложь;
		Элементы.ГруппаШФакт.Видимость = Ложь;
		Элементы.ГруппаВФакт.Видимость = Ложь; 
		Элементы.ГруппаСФакт.Видимость = Ложь;
		//+МАН 18.10.24
		Элементы.ГруппаДопФакт.Видимость = Ложь;
		Элементы.КачествоОгранкиФакт.Видимость = Ложь;
		//-МАН
	КонецЕсли;
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ВидКамня", ?(Факт, ВидВставкиФакт, ВидВставки)); 
	СписокФО = Новый СписокЗначений;
	СписокФО.Добавить(Справочники.ЛБ_ФормыОгранки.ПустаяСсылка());
	Если ?(Факт, ЗначениеЗаполнено(ФормаОгранкиФакт), ЗначениеЗаполнено(ФормаОгранки)) Тогда     
		СписокФО.Добавить(?(Факт, ФормаОгранкиФакт, ФормаОгранки));
	КонецЕсли;	
	Запрос.УстановитьПараметр("ФормаОгранки", СписокФО);
	Запрос.УстановитьПараметр("ВидОгранки", ?(Факт, ВидОгранкиФакт, ВидОгранки));
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней.Размер КАК Размер
	               |ИЗ
	               |	РегистрСведений.ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней КАК ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней
	               |ГДЕ
	               |	ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней.ВидКамня = &ВидКамня
	               |	И ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней.ФормаОгранки В(&ФормаОгранки)
	               |	И ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней.ВидОгранки = &ВидОгранки";
	ТаблицаРазмеров = Запрос.Выполнить().Выгрузить();
	Для каждого стр из ТаблицаРазмеров Цикл
		Если Факт Тогда
			Если стр.Размер = Перечисления.ЛБ_РазмерыДрагоценныхКамней.Диаметр Тогда
				Элементы.ГруппаД0Факт.Видимость = Истина;  
			КонецЕсли;
			Если стр.Размер = Перечисления.ЛБ_РазмерыДрагоценныхКамней.Диаметр1 Тогда
				Элементы.ГруппаД1Факт.Видимость = Истина;
			КонецЕсли;	
			Если стр.Размер = Перечисления.ЛБ_РазмерыДрагоценныхКамней.Диаметр2 Тогда
				Элементы.ГруппаД2Факт.Видимость = Истина;
			КонецЕсли;	
			Если стр.Размер = Перечисления.ЛБ_РазмерыДрагоценныхКамней.Длина Тогда
				Элементы.ГруппаДФакт.Видимость = Истина;
			КонецЕсли;	
			Если стр.Размер = Перечисления.ЛБ_РазмерыДрагоценныхКамней.Ширина Тогда
				Элементы.ГруппаШФакт.Видимость = Истина;
			КонецЕсли;	
			Если стр.Размер = Перечисления.ЛБ_РазмерыДрагоценныхКамней.Высота Тогда
				Элементы.ГруппаВФакт.Видимость = Истина;
			КонецЕсли;
			Если стр.Размер = Перечисления.ЛБ_РазмерыДрагоценныхКамней.Сторона Тогда
				Элементы.ГруппаСФакт.Видимость = Истина;
			КонецЕсли;
		Иначе
			Если стр.Размер = Перечисления.ЛБ_РазмерыДрагоценныхКамней.Диаметр Тогда
				Элементы.ГруппаД0.Видимость = Истина;  
			КонецЕсли;
			Если стр.Размер = Перечисления.ЛБ_РазмерыДрагоценныхКамней.Диаметр1 Тогда
				Элементы.ГруппаД1.Видимость = Истина;
			КонецЕсли;	
			Если стр.Размер = Перечисления.ЛБ_РазмерыДрагоценныхКамней.Диаметр2 Тогда
				Элементы.ГруппаД2.Видимость = Истина;
			КонецЕсли;	
			Если стр.Размер = Перечисления.ЛБ_РазмерыДрагоценныхКамней.Длина Тогда
				Элементы.ГруппаД.Видимость = Истина;
			КонецЕсли;	
			Если стр.Размер = Перечисления.ЛБ_РазмерыДрагоценныхКамней.Ширина Тогда
				Элементы.ГруппаШ.Видимость = Истина;
			КонецЕсли;	
			Если стр.Размер = Перечисления.ЛБ_РазмерыДрагоценныхКамней.Высота Тогда
				Элементы.ГруппаВ.Видимость = Истина;
			КонецЕсли;
			Если стр.Размер = Перечисления.ЛБ_РазмерыДрагоценныхКамней.Сторона Тогда
				Элементы.ГруппаС.Видимость = Истина;
			КонецЕсли;
		КонецЕсли;
	Конеццикла;	 
	
	Если Факт Тогда
		Если НЕ Элементы.ГруппаД0Факт.Видимость И НЕ (ДиаметрФакт = 0) Тогда 
			ДиаметрФакт = 0;
		КонецЕсли;	
		Если НЕ Элементы.ГруппаД1Факт.Видимость И НЕ (Диаметр1Факт = 0) Тогда
			Диаметр1Факт = 0;
		КонецЕсли;	
		Если НЕ Элементы.ГруппаД2Факт.Видимость И НЕ (Диаметр2Факт = 0) Тогда
			Диаметр2Факт = 0;
		КонецЕсли;	
		Если НЕ Элементы.ГруппаДФакт.Видимость И НЕ (ДлинаФакт = 0) Тогда 
			ДлинаФакт = 0;
		КонецЕсли;	
		Если НЕ Элементы.ГруппаШФакт.Видимость И НЕ (ШиринаФакт = 0) Тогда 
			ШиринаФакт = 0;
		КонецЕсли;	
		Если НЕ Элементы.ГруппаВФакт.Видимость И НЕ (ВысотаФакт = 0) Тогда 
			ВысотаФакт = 0;
		КонецЕсли;	
	    Если НЕ Элементы.ГруппаСФакт.Видимость И НЕ (СторонаФакт = 0) Тогда 
			СторонаФакт = 0;
		КонецЕсли;
	Иначе
		Если НЕ Элементы.ГруппаД0.Видимость И НЕ (Диаметр = 0) Тогда 
			Диаметр = 0;
		КонецЕсли;	
		Если НЕ Элементы.ГруппаД1.Видимость И НЕ (Диаметр1 = 0) Тогда
			Диаметр1 = 0;
		КонецЕсли;	
		Если НЕ Элементы.ГруппаД2.Видимость И НЕ (Диаметр2 = 0) Тогда
			Диаметр2 = 0;
		КонецЕсли;	
		Если НЕ Элементы.ГруппаД.Видимость И НЕ (Длина = 0) Тогда 
			Длина = 0;
		КонецЕсли;	
		Если НЕ Элементы.ГруппаШ.Видимость И НЕ (Ширина1 = 0) Тогда 
			Ширина1 = 0;
		КонецЕсли;	
		Если НЕ Элементы.ГруппаВ.Видимость И НЕ (Высота1 = 0) Тогда 
			Высота1 = 0;
		КонецЕсли;	
	    Если НЕ Элементы.ГруппаС.Видимость И НЕ (Сторона = 0) Тогда 
			Сторона = 0;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

//+Мельников 21.05.24 Добавлен параметр "Факт".
&НаСервере
Процедура УстановитьДоступность(Факт = Ложь) 
	//+Мельников 21.05.24 Добавлена проверка условия
	Если Факт Тогда
		
		Если СпособРасчетаВесаФакт = Перечисления.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.Вручную Тогда
			Элементы.ВесШтФакт.Доступность = Истина; 
			Элементы.ВесГраммыШтФакт.Доступность = Истина;
		Иначе
			Элементы.ВесШтФакт.Доступность = Ложь;
			Элементы.ВесГраммыШтФакт.Доступность = Ложь;
		КонецЕсли;
		
		Если СпособРасчетаВесаФакт = Перечисления.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле Тогда 
			Элементы.ГруппаФормулаФакт.Видимость = Истина;
		Иначе
			Элементы.ГруппаФормулаФакт.Видимость = Ложь;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВидВставкиФакт) И НЕ ЗначениеЗаполнено(ФормаОгранкиФакт) И
			НЕ ЗначениеЗаполнено(ВидОгранкиФакт) И НЕ ЗначениеЗаполнено(КачествоОгранкиФакт) Тогда
			
			Элементы.ФормаОгранкиФакт.Доступность = Истина;
			Элементы.ВидОгранкиФакт.Доступность = Ложь;
			Элементы.КачествоОгранкиФакт.Доступность = Ложь;
			
		ИначеЕсли ЗначениеЗаполнено(ВидВставкиФакт) И ЗначениеЗаполнено(ФормаОгранкиФакт) И
			НЕ ЗначениеЗаполнено(ВидОгранкиФакт) И НЕ ЗначениеЗаполнено(КачествоОгранкиФакт) Тогда
			
			Элементы.ФормаОгранкиФакт.Доступность = Истина;
			Элементы.ВидОгранкиФакт.Доступность = Истина;
			Элементы.КачествоОгранкиФакт.Доступность = Ложь;
		
		ИначеЕсли ЗначениеЗаполнено(ВидВставкиФакт) И ЗначениеЗаполнено(ФормаОгранкиФакт) И
			ЗначениеЗаполнено(ВидОгранкиФакт) И НЕ ЗначениеЗаполнено(КачествоОгранкиФакт) Тогда
			
			Элементы.ФормаОгранкиФакт.Доступность = Истина;
			Элементы.ВидОгранкиФакт.Доступность = Истина;
			Элементы.КачествоОгранкиФакт.Доступность = Истина;
		КонецЕсли;
			
	Иначе
		
		Если СпособРасчетаВеса = Перечисления.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.Вручную Тогда
			Элементы.ВесШт.Доступность = Истина; 
			Элементы.ВесГраммыШт.Доступность = Истина;
		Иначе
			Элементы.ВесШт.Доступность = ложь; 
			Элементы.ВесГраммыШт.Доступность = ложь;
		КонецЕсли;
		
		Если СпособРасчетаВеса = Перечисления.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле Тогда 
			Элементы.ГруппаФормула.Видимость = Истина;
		Иначе
			Элементы.ГруппаФормула.Видимость = ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		
		Элементы.ВесФакт.ТолькоПросмотр = Ложь;
		Элементы.ВесГраммыФакт.ТолькоПросмотр = Ложь;
		
		Если ЗначениеЗаполнено(ВидВставкиФакт) И ЗначениеЗаполнено(ФормаОгранкиФакт) И
			ЗначениеЗаполнено(ВидОгранкиФакт) Тогда //И ЗначениеЗаполнено(КачествоОгранкиФакт) Тогда
			
			Элементы.ГруппаДопФакт.Доступность = Истина;
		Иначе
			Элементы.ГруппаДопФакт.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	//Элементы.ГруппаУчетныхДанных.Доступность = НЕ Элементы.ГруппаФактическихДанных.Доступность;
	
 	//Если вес вручную то размеры не видно
	Если ВесВручную Тогда
		Элементы.ГруппаРазмерыФакт.Доступность = Ложь;
	Иначе
		Элементы.ГруппаРазмерыФакт.Доступность = Истина;
	КонецЕсли;
	
	//Если вес вручную и категория 3 или 4 то доступен ввод общего веса в каратах
	Если ВесВручнуюФакт И КатегорияОбъектаЗалогаФакт.ПониженноеКачество Тогда
		Элементы.ВесФакт.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.ВесФакт.ТолькоПросмотр = Истина;
	КонецЕсли;

	//Доступность "Качество огранки" и других параметров.
	Если ЗначениеЗаполнено(ВидВставкиФакт) И ВидВставкиФакт = Справочники.ЛБ_ДрагоценныеКамни.Бриллиант Тогда
		Если Элементы.КачествоОгранкиФакт.СписокВыбора.Количество() > 0 Тогда
			Элементы.КачествоОгранкиФакт.Видимость = Истина;
			Элементы.ГруппаДопФакт.Видимость = Ложь;
			Элементы.ДекорацияВидОгранкиФакт.Видимость = Ложь; //Видимость надписи если не заполнен "Вид огранки".
		ИначеЕсли ЗначениеЗаполнено(ВидВставкиФакт) И ВидВставкиФакт = Справочники.ЛБ_ДрагоценныеКамни.Бриллиант И 
			ЗначениеЗаполнено(ФормаОгранкиФакт) И ЗначениеЗаполнено(ВидОгранкиФакт) И
			Элементы.КачествоОгранкиФакт.СписокВыбора.Количество() = 0 Тогда
			
			Элементы.КачествоОгранкиФакт.Видимость = Ложь;
			Элементы.ГруппаДопФакт.Видимость = Истина;
			Элементы.ДекорацияВидОгранкиФакт.Видимость = Ложь; //Видимость надписи если не заполнен "Вид огранки".
		Иначе			
			Элементы.КачествоОгранкиФакт.Видимость = Ложь;
			Элементы.ГруппаДопФакт.Видимость = Ложь;
			Элементы.ДекорацияВидОгранкиФакт.Видимость = Истина; //Видимость надписи если не заполнен "Вид огранки".
		КонецЕсли;
		
		Если Элементы.КачествоОгранкиФакт.Видимость = Истина И ЗначениеЗаполнено(КачествоОгранкиФакт) Тогда
			Элементы.ГруппаДопФакт.Видимость = Истина;
		ИначеЕсли Элементы.КачествоОгранкиФакт.Видимость = Истина И НЕ ЗначениеЗаполнено(КачествоОгранкиФакт) Тогда
			Элементы.ГруппаДопФакт.Видимость = Ложь;
		КонецЕсли;
		
		Элементы.ВесФакт.Видимость = Истина;
		Элементы.ВесШтФакт.Видимость = Истина;
		//+МАН 25.03.25
		Элементы.Вес.Видимость = Истина;
		Элементы.ВесШт.Видимость = Истина;
		//-МАН
		
	ИначеЕсли ЗначениеЗаполнено(ВидВставкиФакт) И ВидВставкиФакт <> Справочники.ЛБ_ДрагоценныеКамни.Бриллиант Тогда
		Если ЗначениеЗаполнено(ВидВставкиФакт) И ЗначениеЗаполнено(ФормаОгранкиФакт)
			И (Элементы.ВидОгранкиФакт.СписокВыбора.Количество() > 0 И ЗначениеЗаполнено(ВидОгранкиФакт)) Тогда
			Элементы.ГруппаДопФакт.Видимость = Истина;
		ИначеЕсли ЗначениеЗаполнено(ВидВставкиФакт) И ЗначениеЗаполнено(ФормаОгранкиФакт)
			И Элементы.ВидОгранкиФакт.СписокВыбора.Количество() = 0 Тогда
			Элементы.ГруппаДопФакт.Видимость = Истина;
		Иначе
			Элементы.ГруппаДопФакт.Видимость = Ложь;
			Элементы.ДекорацияВидОгранкиФакт.Видимость = Истина; //Видимость надписи если не заполнен "Вид огранки".
		КонецЕсли;

		//Если ВесВручнуюФакт Тогда
		//	Элементы.Группа1Факт.Доступность = Истина;
		//	Элементы.ГруппаВес1Факт.Доступность = Истина;
		//	Элементы.ГруппаВес2Факт.Доступность = Истина;
		//Иначе
		//	Элементы.Группа1Факт.Доступность = Ложь;
		//	Элементы.ГруппаВес1Факт.Доступность = Ложь;
		//	Элементы.ГруппаВес2Факт.Доступность = Ложь;
		//КонецЕсли;

		Элементы.КачествоОгранкиФакт.Видимость = Ложь;
		Элементы.ВесФакт.Видимость = Ложь;
		Элементы.ВесШтФакт.Видимость = Ложь;
		//+МАН 25.03.25
		Элементы.Вес.Видимость = Ложь;
		Элементы.ВесШт.Видимость = Ложь;
		НеОцениватьФакт = Истина;
		Элементы.НеОцениватьФакт.Доступность = Ложь;
		//-МАН

		//Видимость надписи если не заполнен "Вид огранки".
		Если Элементы.ВидОгранкиФакт.СписокВыбора.Количество() > 0 И ЗначениеЗаполнено(ВидОгранкиФакт) Тогда
			Элементы.ДекорацияВидОгранкиФакт.Видимость = Ложь;
		ИначеЕсли Элементы.ВидОгранкиФакт.СписокВыбора.Количество() > 0 И НЕ ЗначениеЗаполнено(ВидОгранкиФакт) Тогда
			Элементы.ДекорацияВидОгранкиФакт.Видимость = Истина;
		ИначеЕсли Элементы.ВидОгранкиФакт.СписокВыбора.Количество() = 0 Тогда
			Элементы.ДекорацияВидОгранкиФакт.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;

	Если ВесВручнуюФакт Тогда
		//Элементы.Группа1Факт.Доступность = Истина;
		Элементы.ГруппаВес1Факт.Доступность = Истина;
		Элементы.ГруппаВес2Факт.Доступность = Истина;
		Элементы.ГруппаРазмерыФакт.Доступность = Ложь;
	Иначе
		//Элементы.Группа1Факт.Доступность = Ложь;
		Элементы.ГруппаВес1Факт.Доступность = Ложь;
		Элементы.ГруппаВес2Факт.Доступность = Ложь;
		Элементы.ГруппаРазмерыФакт.Доступность = Истина;
	КонецЕсли;

Конецпроцедуры	

//+Мельников 21.05.24 Добавлен параметр "Факт".
&НаСервере
Процедура ПолучитьСпособРасчетаВеса(Факт = Ложь)  
	//+Мельников 21.05.24 Добавлена проверка условия
	Если Факт Тогда
		Если ВесВручнуюФакт Тогда
			ФормулаФакт = "";
			СпособРасчетаВесаФакт = Перечисления.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.Вручную;
		Иначе	
			Если ЗначениеЗаполнено(ВидОгранкиФакт) Тогда 
				Запрос = Новый Запрос;  
				Запрос.УстановитьПараметр("ВидКамня", ВидВставкиФакт); 
				Запрос.УстановитьПараметр("ФормаОгранки", ФормаОгранкиФакт); 
				Запрос.УстановитьПараметр("ВидОгранки", ВидОгранкиФакт);
			    Запрос.Текст = "ВЫБРАТЬ
			                   |	ЛБ_НастройкаДопустимыхВидовОгранки.Формула КАК Формула,
			                   |	ЛБ_НастройкаДопустимыхВидовОгранки.СпособРасчетаВеса КАК СпособРасчетаВеса
			                   |ИЗ
			                   |	РегистрСведений.ЛБ_НастройкаДопустимыхВидовОгранки КАК ЛБ_НастройкаДопустимыхВидовОгранки
			                   |ГДЕ
			                   |	ЛБ_НастройкаДопустимыхВидовОгранки.ВидКамня = &ВидКамня
			                   |	И ЛБ_НастройкаДопустимыхВидовОгранки.ФормаОгранки = &ФормаОгранки
			                   |	И ЛБ_НастройкаДопустимыхВидовОгранки.ВидОгранки = &ВидОгранки
			                   |АВТОУПОРЯДОЧИВАНИЕ";
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					ФормулаФакт = Выборка.Формула;
				    СпособРасчетаВесаФакт = Выборка.СпособРасчетаВеса; 
					Элементы.ДекорацияФормулаФакт.Заголовок = "Формула расчета веса: " + ФормулаФакт;
				Иначе 
					ФормулаФакт = "";
				    СпособРасчетаВесаФакт = Перечисления.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.Вручную;
				КонецЕсли;	
			Иначе        
				ФормулаФакт = "";
				СпособРасчетаВесаФакт = Перечисления.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.Вручную;
			КонецЕсли;   
		КонецЕсли;	
	Иначе
		Если ВесВручную Тогда
			Формула = "";
			СпособРасчетаВеса = Перечисления.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.Вручную;
		Иначе	
			Если ЗначениеЗаполнено(ВидОгранки) Тогда 
				Запрос = Новый Запрос;  
				Запрос.УстановитьПараметр("ВидКамня", ?(Факт, ВидВставкиФакт, ВидВставки)); 
				Запрос.УстановитьПараметр("ФормаОгранки", ФормаОгранки); 
				Запрос.УстановитьПараметр("ВидОгранки", ВидОгранки);
			    Запрос.Текст = "ВЫБРАТЬ
			                   |	ЛБ_НастройкаДопустимыхВидовОгранки.Формула КАК Формула,
			                   |	ЛБ_НастройкаДопустимыхВидовОгранки.СпособРасчетаВеса КАК СпособРасчетаВеса
			                   |ИЗ
			                   |	РегистрСведений.ЛБ_НастройкаДопустимыхВидовОгранки КАК ЛБ_НастройкаДопустимыхВидовОгранки
			                   |ГДЕ
			                   |	ЛБ_НастройкаДопустимыхВидовОгранки.ВидКамня = &ВидКамня
			                   |	И ЛБ_НастройкаДопустимыхВидовОгранки.ФормаОгранки = &ФормаОгранки
			                   |	И ЛБ_НастройкаДопустимыхВидовОгранки.ВидОгранки = &ВидОгранки
			                   |АВТОУПОРЯДОЧИВАНИЕ";
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					Формула = Выборка.Формула;
				    СпособРасчетаВеса = Выборка.СпособРасчетаВеса; 
					Элементы.ДекорацияФормула.Заголовок = "Формула расчета веса: " + Формула;
				Иначе 
					Формула = "";
				    СпособРасчетаВеса = Перечисления.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.Вручную;
				КонецЕсли;	
			Иначе        
				Формула = "";
				СпособРасчетаВеса = Перечисления.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.Вручную;
			КонецЕсли;   
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

//+Мельников 21.05.24 Добавлен параметр "Факт".
&НаСервере
Процедура РассчитатьВесКамняПоТаблице(Факт = Ложь) 

	//+Мельников 07.10.24 Вставки. Заявка 2736. При изменении значения вначале приводим вес к нулю.
	ВесШтФакт = 0;
	ВесГраммыШтФакт = 0;
	ВесФакт = 0;
	ВесГраммыФакт = 0;
	//-Мельников

	//+Мельников 21.05.24 Добавлена проверка условия
	Если Факт Тогда
		Размер1Факт = 0;
		Если Элементы.ГруппаД0Факт.Видимость Тогда
			Размер1Факт = ДиаметрФакт;
		иначеЕсли Элементы.ГруппаДФакт.Видимость Тогда
			Размер1Факт = ДлинаФакт;
		иначеЕсли Элементы.ГруппаСФакт.Видимость Тогда
			Размер1Факт = СторонаФакт;
		КонецЕсли;	
		
		РезультатФакт = ЛБ_ОбщийМодуль.РассчитатьВесДрагоценногоКамня(ВидВставкиФакт, ФормаОгранкиФакт, ВидОгранкиФакт, КачествоОгранкиФакт, Размер1Факт, ШиринаФакт, ВысотаФакт); 
		
		Если НЕ РезультатФакт = неопределено Тогда
			Если РезультатФакт.ЕдиницаИзмерения.Код = "162" тогда
				ВесШтФакт = РезультатФакт.Вес;
				ВесГраммыШтФакт = ЛБ_ОбщегоНазначения.ПересчетИзКаратовВГраммы(ВесШтФакт);
			ИначеЕсли РезультатФакт.ЕдиницаИзмерения.Код = "163" тогда  
				ВесГраммыШтФакт = РезультатФакт.Вес;
				ВесШтФакт = ЛБ_ОбщегоНазначения.ПересчетИзГраммовВКараты(ВесГраммыШтФакт);
			КонецЕсли;
			РассчитатьОбщийВес(Истина);
		КонецЕсли;
	Иначе
		Размер1 = 0;
		Если Элементы.ГруппаД0.Видимость Тогда
			Размер1 = Диаметр;
		иначеЕсли Элементы.ГруппаД.Видимость Тогда
			Размер1 = Длина; 
		иначеЕсли Элементы.ГруппаС.Видимость Тогда
			Размер1 = Сторона;   		
		КонецЕсли;	
		Результат = ЛБ_ОбщийМодуль.РассчитатьВесДрагоценногоКамня(ВидВставки, ФормаОгранки, ВидОгранки, КачествоОгранки, Размер1, Ширина1, Высота1); 
		Если НЕ Результат = неопределено Тогда
			Если Результат.ЕдиницаИзмерения.Код = "162" тогда
				ВесШт = Результат.Вес;
				ВесГраммыШт = ЛБ_ОбщегоНазначения.ПересчетИзКаратовВГраммы(ВесШт);
			ИначеЕсли Результат.ЕдиницаИзмерения.Код = "163" тогда  
				ВесГраммыШт = Результат.Вес;
				ВесШт = ЛБ_ОбщегоНазначения.ПересчетИзГраммовВКараты(ВесГраммыШт);
			КонецЕсли;
			РассчитатьОбщийВес();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

//+Мельников 21.05.24 Добавлен параметр "Факт".
&НаСервере
Процедура РассчитатьВесКамняПоФормуле(Факт = Ложь)    

	//+Мельников 07.10.24 Вставки. Заявка 2736. При изменении значения вначале приводим вес к нулю.
	ВесШтФакт = 0;
	ВесГраммыШтФакт = 0;
	ВесФакт = 0;
	ВесГраммыФакт = 0;
	//-Мельников

	//+Мельников 21.05.24 Добавлена проверка условия
	Если Факт Тогда
		Если НЕ ПустаяСтрока(ФормулаФакт) Тогда
			ФормулаРасчетаФакт = ФормулаФакт;
			ЗначениеВесаФакт = ЛБ_УправлениеЛомбардом.РассчитатьПоФормуле(ФормулаРасчетаФакт, ДиаметрФакт, Диаметр1Факт, Диаметр2Факт, ДлинаФакт, ШиринаФакт, ВысотаФакт, СторонаФакт);
		Иначе
			ЗначениеВесаФакт = 0;
		КонецЕсли;
		
		Если ЕдиницаИзмеренияФакт.Код = "162" Тогда
			ВесШтФакт = ЗначениеВесаФакт;
			ВесГраммыШтФакт = ЛБ_ОбщегоНазначения.ПересчетИзКаратовВГраммы(ВесШтФакт);
		ИначеЕсли ЕдиницаИзмеренияФакт.Код = "163" Тогда
			ВесГраммыШтФакт = ЗначениеВесаФакт;
			ВесШтФакт = ЛБ_ОбщегоНазначения.ПересчетИзГраммовВКараты(ВесГраммыШтФакт);
		КонецЕсли;    
		РассчитатьОбщийВес(Истина);
	Иначе
		Если НЕ ПустаяСтрока(Формула) Тогда  
			ФормулаРасчета = Формула;
			ЗначениеВеса = ЛБ_УправлениеЛомбардом.РассчитатьПоФормуле(ФормулаРасчета, Диаметр, Диаметр1, Диаметр2, Длина, Ширина1, Высота1, Сторона);  
		Иначе  
			ЗначениеВеса = 0;
		КонецЕсли;	
		Если ЕдиницаИзмерения.Код = "162" тогда  
			ВесШт = ЗначениеВеса;   
			ВесГраммыШт = ЛБ_ОбщегоНазначения.ПересчетИзКаратовВГраммы(ВесШт);
		ИначеЕсли ЕдиницаИзмерения.Код = "163" тогда 
			ВесГраммыШт = ЗначениеВеса;
			ВесШт = ЛБ_ОбщегоНазначения.ПересчетИзГраммовВКараты(ВесГраммыШт);
		КонецЕсли;    
		РассчитатьОбщийВес();
	КонецЕсли;
КонецПроцедуры

//+Мельников 21.05.24 Добавлен параметр "Факт".
&НаСервере
Процедура РассчитатьОбщийВес(Факт = Ложь) 
	//+Мельников 21.05.24 Добавлена проверка условия
	Если Факт Тогда
		ВесФакт = окр(ВесШтФакт*КоличествоФакт, 3);
		ВесГраммыФакт = окр(ВесГраммыШтФакт*КоличествоФакт, 3);
	Иначе
		Вес = окр(ВесШт*Количество, 3);
		ВесГраммы = окр(ВесГраммыШт*Количество, 3);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура РасчетВеса()
КонецПроцедуры	

//+Мельников 21.05.24 Добавлен параметр "Факт".
&НаСервере
Процедура ЗаполнитьСписокВыбораВидовОгранки(Факт = Ложь)

	//+Мельников 12.08.24 Проверяем на булево ограничения списка видов огранки. Заявка 2740.
	Если ОграниченныйСписокВидовОгранки(ФормаОгранкиФакт, КатегорияОбъектаЗалогаФакт) Тогда
		//+Мельников 21.05.24 Во всей процедуре добавлены проверки условия на "Факт" "?(".
		СписокВ = ЛБ_УправлениеЛомбардом.ПолучитьСписокВыбораВидовОгранки(?(Факт, ВидВставкиФакт, ВидВставки), ?(Факт, ФормаОгранкиФакт, ФормаОгранки), Истина, Истина);
	Иначе
		СписокВ = ЛБ_УправлениеЛомбардом.ПолучитьСписокВыбораВидовОгранки(?(Факт, ВидВставкиФакт, ВидВставки), ?(Факт, ФормаОгранкиФакт, ФормаОгранки), Истина);
	КонецЕсли;
		
	Если Факт Тогда
		Элементы.ВидОгранкиФакт.СписокВыбора.Очистить();
	КонецЕсли;
	
	Для каждого Эл из СписокВ Цикл  
		Если Факт Тогда
			Элементы.ВидОгранкиФакт.СписокВыбора.Добавить(Эл.Значение);
		Иначе
			Элементы.ВидОгранки.СписокВыбора.Добавить(Эл.Значение);
		КонецЕсли;
	Конеццикла;
	
	//+Мельников 18.06.24 При редактировании не верно отображаются данные редактируемой позиции
	Если Параметры.Свойство("ВидОгранкиФакт") И ЗначениеЗаполнено(Параметры.ВидОгранкиФакт) Тогда
		ВидОгранкиФакт = Параметры.ВидОгранкиФакт;
	КонецЕсли;

КонецПроцедуры

//+Мельников 21.05.24 Добавлен параметр "Факт".
&НаСервере
Процедура ПроверитьФормуОгранки(Факт = Ложь, Огранка) 
	//Элементы.ФормаОгранки.СписокВыбора.Очистить();
		
	//+Мельников 21.05.24 Во всей процедуре добавлены проверки условия на "Факт" "?(".
	Если Факт Тогда
		Элементы.ФормаОгранкиФакт.СписокВыбора.Очистить();
	КонецЕсли;

	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("ВидКамня", ?(Факт, ВидВставкиФакт, ВидВставки));     
	//Элементы.ФормаОгранки.СписокВыбора.Очистить();
	Запрос.УстановитьПараметр("КатегорияОбъектаЗалога", ?(Факт, КатегорияОбъектаЗалогаФакт, КатегорияОбъектаЗалога));
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_НастройкаДопустимыхФормОгранки.ФормаОгранки КАК ФормаОгранки
	               |ИЗ
	               |	РегистрСведений.ЛБ_НастройкаДопустимыхФормОгранки КАК ЛБ_НастройкаДопустимыхФормОгранки
	               |ГДЕ
	               |	ЛБ_НастройкаДопустимыхФормОгранки.ВидКамня = &ВидКамня
	               |	И ЛБ_НастройкаДопустимыхФормОгранки.КатегорияОбъектаЗалога = &КатегорияОбъектаЗалога";
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Количество() = 0 Тогда
		Пока Выборка.Следующий() Цикл
			
			//Если ЗначениеЗаполнено(Огранка) Тогда
			//	ЕстьФормаОгранки = Выборка.НайтиСледующий(Огранка);
			//Иначе
			//	ЕстьФормаОгранки = Ложь;
			//КонецЕсли;
			
			Если Факт Тогда
				Элементы.ФормаОгранкиФакт.СписокВыбора.Добавить(Выборка.ФормаОгранки);
			Иначе
				//Элементы.ФормаОгранки.СписокВыбора.Добавить(Выборка.ФормаОгранки);
			КонецЕсли;
			
		КонецЦикла;
		
		//Если Факт Тогда
		//	Если ЕстьФормаОгранки Тогда
		//		ФормаОгранкиФакт = Огранка;
		//	КонецЕсли;
		//Иначе 
		//	Если ЕстьФормаОгранки Тогда
		//		ФормаОгранки = Огранка;
		//	КонецЕсли;
		//КонецЕсли;
		
	Иначе
		ВыборкаФО = Справочники.ЛБ_ФормыОгранки.Выбрать(,?(Факт, ВидВставкиФакт, ВидВставки));   
		Пока ВыборкаФО.Следующий() Цикл
			Если Факт Тогда
				Элементы.ФормаОгранкиФакт.СписокВыбора.Добавить(ВыборкаФО.Ссылка);
			Иначе
				//Элементы.ФормаОгранки.СписокВыбора.Добавить(ВыборкаФО.Ссылка);
			КонецЕсли;
		КонеЦцикла;
	КонецЕсли;   

	//Если НЕ Элементы.ФормаОгранки.СписокВыбора.Количество() = 0 Тогда 
	//	ФормаОгранки = Элементы.ФормаОгранки.СписокВыбора.Получить(0).Значение;
	//КонецЕсли;	

	Если Элементы.ФормаОгранкиФакт.СписокВыбора.Количество() > 0 Тогда 
		//+Мельников 18.06.24 При редактировании не верно отображаются данные редактируемой позиции
		//Было: ФормаОгранкиФакт = Элементы.ФормаОгранкиФакт.СписокВыбора.Получить(0).Значение;
		Если Параметры.Свойство("ФормаОгранкиФакт") И ЗначениеЗаполнено(Параметры.ФормаОгранкиФакт) Тогда
			ФормаОгранкиФакт = Параметры.ФормаОгранкиФакт;
		Иначе
			ФормаОгранкиФакт = Элементы.ФормаОгранкиФакт.СписокВыбора.Получить(0).Значение;
		КонецЕсли;
		//-Мельников
	КонецЕсли;	
КонецПроцедуры    

//+Мельников 21.05.24 Добавлен параметр "Факт".
&НаСервере
Процедура ЗаполнитьСписокВыбораКачестваОгранки(Факт = Ложь)
	//Элементы.КачествоОгранки.СписокВыбора.Очистить();
	
	//+Мельников 21.05.24 Во всей процедуре добавлены проверки условия на "Факт" "?(".
	Если Факт Тогда
		Элементы.КачествоОгранкиФакт.СписокВыбора.Очистить();
	КонецЕсли;
	
	Если ?(Факт, ВидВставкиФакт = Справочники.ЛБ_ДрагоценныеКамни.Бриллиант, ВидВставки = Справочники.ЛБ_ДрагоценныеКамни.Бриллиант) Тогда 
		Запрос = Новый Запрос;  
		Запрос.УстановитьПараметр("ВидКамня", ?(Факт, ВидВставкиФакт, ВидВставки)); 
		Запрос.УстановитьПараметр("КатегорияОбъектаЗалога", ?(Факт, КатегорияОбъектаЗалогаФакт, КатегорияОбъектаЗалога));
		Запрос.УстановитьПараметр("Именник", ?(Факт, ИменникФакт, Именник)); 
		СписокФО = Новый СписокЗначений;
		СписокФО.Добавить(Справочники.ЛБ_ФормыОгранки.ПустаяСсылка());
		
		Если ?(Факт, ЗначениеЗаполнено(ФормаОгранкиФакт), ЗначениеЗаполнено(ФормаОгранки)) Тогда
			СписокФО.Добавить(?(Факт, ФормаОгранкиФакт, ФормаОгранки));
		КонецЕсли;	
		
		Запрос.УстановитьПараметр("ФормыОгранки", СписокФО); 
		СписокВО = Новый СписокЗначений;
		СписокВО.Добавить(Справочники.ЛБ_ВидыОгранки.ПустаяСсылка());
		
		Если ?(Факт, ЗначениеЗаполнено(ВидОгранкиФакт), ЗначениеЗаполнено(ВидОгранки)) Тогда
			СписокВО.Добавить(?(Факт, ВидОгранкиФакт, ВидОгранки));
		КонецЕсли;	
		
		Запрос.УстановитьПараметр("ВидыОгранки", СписокВО);
		Запрос.Текст = "ВЫБРАТЬ
						|	ЛБ_НастройкаДопустимыхКачествОгранки.КачествоОгранки КАК КачествоОгранки
						|ИЗ
						|	РегистрСведений.ЛБ_НастройкаДопустимыхКачествОгранки КАК ЛБ_НастройкаДопустимыхКачествОгранки
						|ГДЕ
						|	ЛБ_НастройкаДопустимыхКачествОгранки.ВидКамня = &ВидКамня
						|	И ЛБ_НастройкаДопустимыхКачествОгранки.КатегорияОбъектаЗалога = &КатегорияОбъектаЗалога
						|	И ЛБ_НастройкаДопустимыхКачествОгранки.ФормаОгранки В(&ФормыОгранки)
						|	И ЛБ_НастройкаДопустимыхКачествОгранки.ВидОгранки В(&ВидыОгранки)";
						// |	И ЛБ_НастройкаДопустимыхКачествОгранки.Именник = &Именник"; 
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл 
			Если Факт Тогда
				Элементы.КачествоОгранкиФакт.СписокВыбора.Добавить(Выборка.КачествоОгранки);
			Иначе
				Элементы.КачествоОгранки.СписокВыбора.Добавить(Выборка.КачествоОгранки);
			КонецЕсли;
		Конеццикла;
	Иначе    
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Владелец", ?(Факт, ВидВставкиФакт, ВидВставки));
		Запрос.Текст = "ВЫБРАТЬ
						|	ЛБ_КачествоОгранки.Ссылка КАК КачествоОгранки
						|ИЗ
						|	Справочник.ЛБ_КачествоОгранки КАК ЛБ_КачествоОгранки
						|ГДЕ
						|	ЛБ_КачествоОгранки.Владелец = &Владелец
						|	И ЛБ_КачествоОгранки.ПометкаУдаления = ЛОЖЬ";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл 
			Если Факт Тогда
				Элементы.КачествоОгранкиФакт.СписокВыбора.Добавить(Выборка.КачествоОгранки);
			Иначе
				Элементы.КачествоОгранки.СписокВыбора.Добавить(Выборка.КачествоОгранки);
			КонецЕсли;
		Конеццикла;
	КонецЕсли;	 
КонецПроцедуры	                                                          

&НаСервере
Функция УдалитьНули(Текст)
	Текст = СокрЛП(Текст);
	Пока Прав(Текст, 1) = "0" цикл
		Текст = Лев(Текст, стрДлина(Текст) - 1);
	Конеццикла;	
	Возврат Текст;
КонецФункции	

&НаКлиенте
Функция СформироватьСтрокуРазмер() 
    //+Мельников 21.05.24 Изменил на Фактические данные Старое закомментировал.
	//ОписаниеРазмера = "";  
	//ОписаниеРазмера = ОписаниеРазмера + ?(Диаметр = 0, "", ?(ПустаяСтрока(ОписаниеРазмера), "", "х") + УдалитьНули(Строка(Диаметр))); 
	//ОписаниеРазмера = ОписаниеРазмера + ?(Диаметр1 = 0, "", ?(ПустаяСтрока(ОписаниеРазмера), "", "х") + УдалитьНули(Строка(Диаметр1)));
	//ОписаниеРазмера = ОписаниеРазмера + ?(Диаметр2 = 0, "", ?(ПустаяСтрока(ОписаниеРазмера), "", "х") + УдалитьНули(Строка(Диаметр2)));
	//ОписаниеРазмера = ОписаниеРазмера + ?(Длина = 0, "", ?(ПустаяСтрока(ОписаниеРазмера), "", "х") + УдалитьНули(Строка(Длина)));
	//ОписаниеРазмера = ОписаниеРазмера + ?(Ширина1 = 0, "", ?(ПустаяСтрока(ОписаниеРазмера), "", "х") + УдалитьНули(Строка(Ширина1)));
	//ОписаниеРазмера = ОписаниеРазмера + ?(Высота1 = 0, "", ?(ПустаяСтрока(ОписаниеРазмера), "", "хh") + УдалитьНули(Строка(Высота1))); 
	//ОписаниеРазмера = ОписаниеРазмера + ?(Сторона = 0, "", ?(ПустаяСтрока(ОписаниеРазмера), "", "х") + УдалитьНули(Строка(Сторона)));
	//Возврат ОписаниеРазмера;
	
	ОписаниеРазмера = "";
	ОписаниеРазмера = ОписаниеРазмера + ?(ДиаметрФакт = 0, "", ?(ПустаяСтрока(ОписаниеРазмера), "", "х") + УдалитьНули(Строка(ДиаметрФакт)));
	ОписаниеРазмера = ОписаниеРазмера + ?(Диаметр1Факт = 0, "", ?(ПустаяСтрока(ОписаниеРазмера), "", "х") + УдалитьНули(Строка(Диаметр1Факт)));
	ОписаниеРазмера = ОписаниеРазмера + ?(Диаметр2Факт = 0, "", ?(ПустаяСтрока(ОписаниеРазмера), "", "х") + УдалитьНули(Строка(Диаметр2Факт)));
	ОписаниеРазмера = ОписаниеРазмера + ?(ДлинаФакт = 0, "", ?(ПустаяСтрока(ОписаниеРазмера), "", "х") + УдалитьНули(Строка(ДлинаФакт)));
	ОписаниеРазмера = ОписаниеРазмера + ?(ШиринаФакт = 0, "", ?(ПустаяСтрока(ОписаниеРазмера), "", "х") + УдалитьНули(Строка(ШиринаФакт)));
	ОписаниеРазмера = ОписаниеРазмера + ?(ВысотаФакт = 0, "", ?(ПустаяСтрока(ОписаниеРазмера), "", "хh") + УдалитьНули(Строка(ВысотаФакт)));
	ОписаниеРазмера = ОписаниеРазмера + ?(СторонаФакт = 0, "", ?(ПустаяСтрока(ОписаниеРазмера), "", "х") + УдалитьНули(Строка(СторонаФакт)));
	Возврат ОписаниеРазмера;

КонецФункции

&НаКлиенте
Функция Проверить()
    //+Мельников 21.05.24 Изменил на Фактические данные Старое закомментировал.
	//ВсеОК = Истина;   
	//Если НЕ ЗначениеЗаполнено(ВидВставки) тогда   
	//	Сообщить("Не выбран вид вставки");
	//	ВсеОК = ложь;
	//КонецЕсли; 
	//Если Количество = 0 тогда   
	//	Сообщить("Не задано количество");
	//	ВсеОК = ложь;
	//КонецЕсли;  
	//Если ВесГраммы = 0 тогда   
	//	Сообщить("Не задан вес в каратах");
	//	ВсеОК = ложь;
	//КонецЕсли; 
	//Если ВесГраммы = 0 тогда   
	//	Сообщить("Не задан вес в граммах");
	//	ВсеОК = ложь;
	//КонецЕсли; 
	//Возврат ВсеОК;

	ВсеОК = Истина;
	Если НЕ ЗначениеЗаполнено(ВидВставкиФакт) Тогда
		Сообщить("Не выбран вид вставки");
		ВсеОК = Ложь;
	КонецЕсли;
	Если КоличествоФакт = 0 Тогда
		Сообщить("Не задано количество");
		ВсеОК = Ложь;
	КонецЕсли;
	//Если ВесГраммыФакт = 0 Тогда
	//	Сообщить("Не задан вес в каратах");
	//	ВсеОК = Ложь;
	//КонецЕсли;
	//Если ВесГраммыФакт = 0 Тогда
	//	Сообщить("Не задан вес в граммах");
	//	ВсеОК = Ложь;
	//КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ВидОгранкиФакт) И ВидВставкиФакт <> ПредопределенноеЗначение("Справочник.ЛБ_ДрагоценныеКамни.Бриллиант") Тогда
		Сообщить("Для расчета веса необходимо выбрать ""Вид огранки"".");
		ВсеОК = Ложь;
	КонецЕсли;

	//+Мельников 21.08.24 Изменена проверка заполнения элементов и вывод соответствующего сообщения. Заявка 2736
	Если (ВидВставкиФакт = ПредопределенноеЗначение("Справочник.ЛБ_ДрагоценныеКамни.Бриллиант") И ВесШтФакт = 0)
		ИЛИ (ВидВставкиФакт <> ПредопределенноеЗначение("Справочник.ЛБ_ДрагоценныеКамни.Бриллиант") И ВесГраммыШтФакт = 0) Тогда
		
		Сообщить("Необходимо внести размеры вставки или указать вес вручную.");
		ВсеОК = Ложь;
	КонецЕсли;
	//-Мельников

	ДокументОбъект = ЭтотОбъект.ВладелецФормы.Объект;
	
	Если ПроверитьОбщийВес(ДокументОбъект) Тогда
		Сообщить("Общий вес изделия не может быть меньше общего веса вставки/ доп.металла/ комплектующего!");
		ВсеОК = Ложь;
	КонецЕсли;

	Возврат ВсеОК;

КонецФункции

&НаСервере
Функция ПроверитьОбщийВес(ДокументОбъект)
	Отбор = Новый Структура;
	Отбор.Вставить("ОбъектЗалога", ОбъектЗалога);
	
	СтрокиВ = ДокументОбъект[ТЧВставкаК].НайтиСтроки(Отбор);
	
	ВесК = 0;
	ВесМ = 0;
		
	Для каждого СтрВК Из СтрокиВ Цикл
		ВесК = ВесК + СтрВК.ВесГраммыФакт;
	КонецЦикла;

	СтрокиВМ = ДокументОбъект[ТЧВставкаМ].НайтиСтроки(Отбор);
	
	Для каждого СтрВМ Из СтрокиВМ Цикл
		ВесМ = ВесМ + СтрВМ.ВесФакт;
	КонецЦикла;
	
	ВесК = ВесК - ВесГраммы + ВесГраммыФакт;

	Результат = ?(Цел((ОбщаяМассаФакт - (ВесК + ВесМ))*100)/100 <= 0, Истина, Ложь);

	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
    //+Мельников 21.05.24 Изменил на Фактические данные Старое закомментировал.
	//Если НЕ Проверить() Тогда
	//	Возврат;
	//КонецЕсли;
	//СтруктураВозврата = Новый структура;   
	//СтруктураВозврата.Вставить("ВесВручную", ВесВручную);
	//СтруктураВозврата.Вставить("Количество", Количество); 
	//СтруктураВозврата.Вставить("ВидВставки", ВидВставки);
	//СтруктураВозврата.Вставить("ЕдиницаИзмерения", ЕдиницаИзмерения);
	//СтруктураВозврата.Вставить("ФормаОгранки", ФормаОгранки);
	//СтруктураВозврата.Вставить("ВидОгранки", ВидОгранки);
	//СтруктураВозврата.Вставить("КачествоОгранки", КачествоОгранки); 
	//СтруктураВозврата.Вставить("Диаметр", Диаметр);
	//СтруктураВозврата.Вставить("Диаметр1", Диаметр1);
	//СтруктураВозврата.Вставить("Диаметр2", Диаметр2); 
	//СтруктураВозврата.Вставить("Длина", Длина);  
	//СтруктураВозврата.Вставить("Ширина", Ширина1);
	//СтруктураВозврата.Вставить("Высота", Высота1);
	//СтруктураВозврата.Вставить("Сторона", Сторона);
	//СтруктураВозврата.Вставить("Вес", Вес); 
	//СтруктураВозврата.Вставить("ВесГраммы", ВесГраммы);
	//СтруктураВозврата.Вставить("ОписаниеРазмера", СформироватьСтрокуРазмер());
	//Этаформа.Закрыть(СтруктураВозврата);
	
	Если НЕ Проверить() Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьИзменения = ПроверитьНаличиеИзменений();
	
	Если ЕстьИзменения Тогда
		Сохранить = Истина;
		
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("ВесВручнуюФакт", ВесВручнуюФакт);
		СтруктураВозврата.Вставить("КоличествоФакт", КоличествоФакт);
		СтруктураВозврата.Вставить("ВидВставкиФакт", ВидВставкиФакт);
		СтруктураВозврата.Вставить("ЕдиницаИзмеренияФакт", ЕдиницаИзмеренияФакт);
		СтруктураВозврата.Вставить("ФормаОгранкиФакт", ФормаОгранкиФакт);
		СтруктураВозврата.Вставить("ВидОгранкиФакт", ВидОгранкиФакт);
		СтруктураВозврата.Вставить("КачествоОгранкиФакт", КачествоОгранкиФакт);
		СтруктураВозврата.Вставить("ДиаметрФакт", ДиаметрФакт);
		СтруктураВозврата.Вставить("Диаметр1Факт", Диаметр1Факт);
		СтруктураВозврата.Вставить("Диаметр2Факт", Диаметр2Факт);
		СтруктураВозврата.Вставить("ДлинаФакт", ДлинаФакт);
		СтруктураВозврата.Вставить("ШиринаФакт", ШиринаФакт);
		СтруктураВозврата.Вставить("ВысотаФакт", ВысотаФакт);
		СтруктураВозврата.Вставить("СторонаФакт", СторонаФакт);
		СтруктураВозврата.Вставить("ВесФакт", ВесФакт);
		СтруктураВозврата.Вставить("ВесГраммыФакт", ВесГраммыФакт);
		СтруктураВозврата.Вставить("ОписаниеРазмераФакт", СформироватьСтрокуРазмер());
		СтруктураВозврата.Вставить("НоваяСтрокаТЧ", НоваяСтрока);
		СтруктураВозврата.Вставить("Отмена", Ложь);
		СтруктураВозврата.Вставить("ОбъектЗалога", ОбъектЗалога);
		СтруктураВозврата.Вставить("НеОцениватьФакт", НеОцениватьФакт);
		СтруктураВозврата.Вставить("ИДНоваяСтрокаТЧ", ИДНоваяСтрокаТЧ);
		СтруктураВозврата.Вставить("Вставка", Истина);
		
		Этаформа.Закрыть(СтруктураВозврата);
	Иначе
		Этаформа.Закрыть(Неопределено);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)

	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Отмена", Истина);
	СтруктураВозврата.Вставить("НоваяСтрокаТЧ", НоваяСтрока);
	СтруктураВозврата.Вставить("ИДНоваяСтрокаТЧ", ИДНоваяСтрокаТЧ);

	Если Модифицированность Тогда
		
		//+Мельников 16.10.24 Заявка 2464
		Ответ = Вопрос("Данные изменены!
			   |Сохранить изменения?", РежимДиалогаВопрос.ДаНетОтмена,, КодВозвратаДиалога.Да);
		
		Если Ответ = КодВозвратаДиалога.Да = Истина Тогда
			СохранитьИЗакрыть(Истина);
		//+Мельников 15.10.24 Заявка 2464
		ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
			Модифицированность = Ложь;
			Этаформа.Закрыть(?(НоваяСтрока, СтруктураВозврата, Неопределено));
		Иначе
			Возврат;
		//-Мельников
		КонецЕсли;
	Иначе
		Этаформа.Закрыть(?(НоваяСтрока, СтруктураВозврата, Неопределено));
	КонецЕсли;

КонецПроцедуры

//+Мельников 21.05.24 Добавлен параметр "Факт".
&НаСервере
Функция ПолучитьЕдиницуРасчета(Факт = Ложь)
	//+Мельников 21.05.24 Добавлена проверка условия
	Если Факт Тогда
		Возврат ВидВставкиФакт.ЕдиницаИзмерения;
	Иначе
		Возврат ВидВставки.ЕдиницаИзмерения;
	КонецЕсли;
КонецФункции	

&НаКлиенте
Процедура ВидВставкиПриИзменении(Элемент)	
	ЕдиницаИзмерения = ПолучитьЕдиницуРасчета();
	ВидОгранки = ПредопределенноеЗначение("Справочник.ЛБ_ВидыОгранки.ПустаяСсылка"); 
	ФормаОгранки = ПредопределенноеЗначение("Справочник.ЛБ_ФормыОгранки.ПустаяСсылка");
	КачествоОгранки = ПредопределенноеЗначение("Справочник.ЛБ_КачествоОгранки.ПустаяСсылка");
	ЗаполнитьСписокВыбораКачестваОгранки();
	ПроверитьФормуОгранки(, ФормаОгранки); 
	ЗаполнитьСписокВыбораВидовОгранки();
	УстановитьВидимость(); 
	ПолучитьСпособРасчетаВеса();
	УстановитьДоступность(); 
	Если СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
		РассчитатьВесКамняПоТаблице();  
	ИначеЕсли СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
		РассчитатьВесКамняПоФормуле();	
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ФормаОгранкиПриИзменении(Элемент)
	УстановитьВидимость(); 
	ЗаполнитьСписокВыбораВидовОгранки(); 
	ЗаполнитьСписокВыбораКачестваОгранки();
	ПолучитьСпособРасчетаВеса();
	УстановитьДоступность();
	Если СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
		РассчитатьВесКамняПоТаблице(); 
	ИначеЕсли СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
		РассчитатьВесКамняПоФормуле();	
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ВидОгранкиПриИзменении(Элемент)
	УстановитьВидимость();     
	ЗаполнитьСписокВыбораКачестваОгранки();
	ПолучитьСпособРасчетаВеса();
	УстановитьДоступность();
	Если СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
		РассчитатьВесКамняПоТаблице(); 
	ИначеЕсли СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
		РассчитатьВесКамняПоФормуле();	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КачествоОгранкиПриИзменении(Элемент)
	Если СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
		РассчитатьВесКамняПоТаблице();  
	ИначеЕсли СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
		РассчитатьВесКамняПоФормуле();		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент) 
	РассчитатьОбщийВес();
КонецПроцедуры

&НаКлиенте
Процедура ВесШтПриИзменении(Элемент)
	ВесГраммыШт = ЛБ_ОбщегоНазначения.ПересчетИзКаратовВГраммы(ВесШт);
	РассчитатьОбщийВес();
КонецПроцедуры


&НаКлиенте
Процедура ВесГраммыШтПриИзменении(Элемент)
	ВесШт = ЛБ_ОбщегоНазначения.ПересчетИзГраммовВКараты(ВесГраммыШт);
	РассчитатьОбщийВес();
КонецПроцедуры

&НаКлиенте
Процедура ДиаметрПриИзменении(Элемент)
	Если СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
		РассчитатьВесКамняПоТаблице();
	ИначеЕсли СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
		РассчитатьВесКамняПоФормуле();	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Диаметр1ПриИзменении(Элемент)
	Если СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
		РассчитатьВесКамняПоТаблице();
	ИначеЕсли СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
		РассчитатьВесКамняПоФормуле();	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Диаметр2ПриИзменении(Элемент)
	Если СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
		РассчитатьВесКамняПоТаблице();
	ИначеЕсли СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
		РассчитатьВесКамняПоФормуле();	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДлинаПриИзменении(Элемент)
	Если СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
		РассчитатьВесКамняПоТаблице();
	ИначеЕсли СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
		РассчитатьВесКамняПоФормуле();	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Ширина1ПриИзменении(Элемент)
	Если СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
		РассчитатьВесКамняПоТаблице();
	ИначеЕсли СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
		РассчитатьВесКамняПоФормуле();	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Высота1ПриИзменении(Элемент)
	Если СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
		РассчитатьВесКамняПоТаблице();
	ИначеЕсли СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
		РассчитатьВесКамняПоФормуле();	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

    Если Сохранить Тогда
		Этаформа.Закрыть(); // ?(НоваяСтрока, СтруктураВозврата, Неопределено));
	Иначе
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("Отмена", Истина);
		СтруктураВозврата.Вставить("НоваяСтрокаТЧ", НоваяСтрока);
		СтруктураВозврата.Вставить("ИДНоваяСтрокаТЧ", ИДНоваяСтрокаТЧ);
		
		Если Модифицированность Тогда
			
			//+Мельников 16.10.24 Заявка 2464
			Ответ = Вопрос("Данные изменены!
			|Сохранить изменения?", РежимДиалогаВопрос.ДаНетОтмена,, КодВозвратаДиалога.Да);
			
			Если Ответ = КодВозвратаДиалога.Да = Истина Тогда
				СохранитьИЗакрыть(Истина);
			ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
				Модифицированность = Ложь;
				Этаформа.Закрыть(?(НоваяСтрока, СтруктураВозврата, Неопределено));
			Иначе
				Отказ = Истина;
			КонецЕсли;
			//-Мельников
		Иначе
			Этаформа.Закрыть(?(НоваяСтрока, СтруктураВозврата, Неопределено));
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СторонаПриИзменении(Элемент)

	Если СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
		РассчитатьВесКамняПоТаблице();
	ИначеЕсли СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
		РассчитатьВесКамняПоФормуле();	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВесВручнуюПриИзменении(Элемент)
	ПолучитьСпособРасчетаВеса();
	УстановитьДоступность();
	Если НЕ ВесВручную Тогда  
		Если СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
			РассчитатьВесКамняПоТаблице();
		ИначеЕсли СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
			РассчитатьВесКамняПоФормуле();	
		КонецЕсли;	
	КонецЕсли;    	   
КонецПроцедуры

&НаКлиенте
Процедура ВидОгранкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Если (ЭтаФорма.ВидВставки = ПредопределенноеЗначение("Справочник.ЛБ_ДрагоценныеКамни.Бриллиант")) И НЕ ЗначениеЗаполнено(ФормаОгранки) Тогда
		СтандартнаяОбработка = Ложь; 
		Возврат;
	КонецЕсли;	
КонецПроцедуры

//+Мельников 21.05.24
&НаКлиенте
Процедура ВидВставкиФактПриИзменении(Элемент)
	ЕдиницаИзмеренияФакт = ПолучитьЕдиницуРасчета(Истина);
	ВидОгранкиФакт = ПредопределенноеЗначение("Справочник.ЛБ_ВидыОгранки.ПустаяСсылка");
	//ФормаОгранкиФакт = ПредопределенноеЗначение("Справочник.ЛБ_ФормыОгранки.ПустаяСсылка");
	КачествоОгранкиФакт = ПредопределенноеЗначение("Справочник.ЛБ_КачествоОгранки.ПустаяСсылка");
	ПроверитьФормуОгранки(Истина, ФормаОгранкиФакт);
	ЗаполнитьСписокВыбораВидовОгранки(Истина);
	ЗаполнитьСписокВыбораКачестваОгранки(Истина);
	УстановитьВидимость(Истина);
	ПолучитьСпособРасчетаВеса(Истина);
	УстановитьДоступность(Истина);

	Если СпособРасчетаВесаФакт = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
		РассчитатьВесКамняПоТаблице(Истина);  
	ИначеЕсли СпособРасчетаВесаФакт = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
		РассчитатьВесКамняПоФормуле(Истина);	
	КонецЕсли;

	ОчиститьДопПараметры(); //+Мельников 30.07.24 Заявка 2736
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ФормаОгранкиФактПриИзменении(Элемент)
	УстановитьВидимость(Истина);
	ЗаполнитьСписокВыбораВидовОгранки(Истина);
	ЗаполнитьСписокВыбораКачестваОгранки(Истина);
	ПолучитьСпособРасчетаВеса(Истина);
	УстановитьДоступность(Истина);
	
	Если СпособРасчетаВесаФакт = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
		РассчитатьВесКамняПоТаблице(Истина);
	ИначеЕсли СпособРасчетаВесаФакт = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
		РассчитатьВесКамняПоФормуле(Истина);
	КонецЕсли;

	ОчиститьДопПараметры(); //+Мельников 30.07.24 Заявка 2736

	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОгранкиФактПриИзменении(Элемент)
	УстановитьВидимость(Истина);
	ЗаполнитьСписокВыбораКачестваОгранки(Истина);
	ПолучитьСпособРасчетаВеса(Истина);
	УстановитьДоступность(Истина);

	Если СпособРасчетаВесаФакт = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
		РассчитатьВесКамняПоТаблице(Истина);
	ИначеЕсли СпособРасчетаВесаФакт = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
		РассчитатьВесКамняПоФормуле(Истина);
	КонецЕсли;

	ОчиститьДопПараметры(); //+Мельников 30.07.24 Заявка 2736

	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОгранкиФактНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Если (ЭтаФорма.ВидВставкиФакт = ПредопределенноеЗначение("Справочник.ЛБ_ДрагоценныеКамни.Бриллиант")) И НЕ ЗначениеЗаполнено(ФормаОгранкиФакт) Тогда
		СтандартнаяОбработка = Ложь; 
		Возврат;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КачествоОгранкиФактПриИзменении(Элемент)
	Если СпособРасчетаВесаФакт = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
		РассчитатьВесКамняПоТаблице(Истина);
	ИначеЕсли СпособРасчетаВесаФакт = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
		РассчитатьВесКамняПоФормуле(Истина);
	КонецЕсли;	

	ОчиститьДопПараметры(); //+Мельников 30.07.24 Заявка 2736
	
	УстановитьДоступность(Истина);
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ВесВручнуюФактПриИзменении(Элемент)
	ПолучитьСпособРасчетаВеса(Истина);
	УстановитьДоступность(Истина);

	Если НЕ ВесВручнуюФакт Тогда  
		Если СпособРасчетаВесаФакт = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
			РассчитатьВесКамняПоТаблице(Истина);
		ИначеЕсли СпособРасчетаВесаФакт = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
			РассчитатьВесКамняПоФормуле(Истина);
		КонецЕсли;	
	//Если вес вручную то размеры не видно.
	//	Элементы.ГруппаРазмерыФакт.Доступность = Истина;
	//Иначе
	//	Элементы.ГруппаРазмерыФакт.Доступность = Ложь;
	КонецЕсли;    	   

	//Если вес вручную и категория 3 или 4 то доступен ввод общего веса в каратах.
	Если ВесВручнуюФакт И ПолучитьКачество(КатегорияОбъектаЗалогаФакт) Тогда
		Элементы.ВесФакт.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.ВесФакт.ТолькоПросмотр = Истина;
	КонецЕсли;

	ДиаметрФакт = 0;
	Диаметр1Факт = 0;
	Диаметр2Факт = 0;
	ДлинаФакт = 0;
	ШиринаФакт = 0;
	ВысотаФакт = 0;
	СторонаФакт = 0;
	ВесШтФакт = 0;
	ВесГраммыШтФакт = 0;
	ВесФакт = 0;
	ВесГраммыФакт = 0;

	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура КоличествоФактПриИзменении(Элемент)

	УстановитьВидимость(Истина);
	ПолучитьСпособРасчетаВеса(Истина);
	УстановитьДоступность(Истина);
	
	//+Мельников 16.10.24 Заявка 2464
	УстановитьВидимость();
	ПолучитьСпособРасчетаВеса();
	УстановитьДоступность();
	//-Мельников
	
	Если СпособРасчетаВесаФакт = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
		РассчитатьВесКамняПоТаблице(Истина);  
	ИначеЕсли СпособРасчетаВесаФакт = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
		РассчитатьВесКамняПоФормуле(Истина);  	
	КонецЕсли;	

	РассчитатьОбщийВес(Истина);
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ВесШтФактПриИзменении(Элемент)
	ВесГраммыШтФакт = ЛБ_ОбщегоНазначения.ПересчетИзКаратовВГраммы(ВесШтФакт);
	РассчитатьОбщийВес(Истина);
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВесГраммыШтФактПриИзменении(Элемент)
	ВесШтФакт = ЛБ_ОбщегоНазначения.ПересчетИзГраммовВКараты(ВесГраммыШтФакт);
	РассчитатьОбщийВес(Истина);
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Диаметр0ФактПриИзменении(Элемент)
	Если СпособРасчетаВесаФакт = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
		РассчитатьВесКамняПоТаблице(Истина);
	ИначеЕсли СпособРасчетаВесаФакт = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
		РассчитатьВесКамняПоФормуле(Истина);
	КонецЕсли;	

	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура Диаметр1ФактПриИзменении(Элемент)
	Если СпособРасчетаВесаФакт = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
		РассчитатьВесКамняПоТаблице(Истина);
	ИначеЕсли СпособРасчетаВесаФакт = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
		РассчитатьВесКамняПоФормуле(Истина);
	КонецЕсли;

	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура Диаметр2ФактПриИзменении(Элемент)
	Если СпособРасчетаВесаФакт = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
		РассчитатьВесКамняПоТаблице(Истина);
	ИначеЕсли СпособРасчетаВесаФакт = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
		РассчитатьВесКамняПоФормуле(Истина);	
	КонецЕсли;	

	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ДлинаФактПриИзменении(Элемент)
	Если СпособРасчетаВесаФакт = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
		РассчитатьВесКамняПоТаблице(Истина);
	ИначеЕсли СпособРасчетаВесаФакт = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
		РассчитатьВесКамняПоФормуле(Истина);
	КонецЕсли;

	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ШиринаФактПриИзменении(Элемент)
	Если СпособРасчетаВесаФакт = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
		РассчитатьВесКамняПоТаблице(Истина);
	ИначеЕсли СпособРасчетаВесаФакт = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
		РассчитатьВесКамняПоФормуле(Истина);
	КонецЕсли;

	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ВысотаФактПриИзменении(Элемент)
	Если СпособРасчетаВесаФакт = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
		РассчитатьВесКамняПоТаблице(Истина);
	ИначеЕсли СпособРасчетаВесаФакт = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
		РассчитатьВесКамняПоФормуле(Истина);
	КонецЕсли;

	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура СторонаФактПриИзменении(Элемент)
	Если СпособРасчетаВесаФакт = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
		РассчитатьВесКамняПоТаблице(Истина);
	ИначеЕсли СпособРасчетаВесаФакт = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
		РассчитатьВесКамняПоФормуле(Истина);
	КонецЕсли;

	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ВесФактПриИзменении(Элемент)
	
	Если СпособРасчетаВесаФакт = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
		РассчитатьВесКамняПоТаблице(Истина);  
	ИначеЕсли СпособРасчетаВесаФакт = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
		РассчитатьВесКамняПоФормуле(Истина);  	
	КонецЕсли;

	ВесГраммыФакт = ЛБ_ОбщегоНазначения.ПересчетИзКаратовВГраммы(ВесФакт);
	
	ВесШтФакт = ВесФакт/КоличествоФакт;
	ВесГраммыШтФакт = ВесГраммыФакт/КоличествоФакт;

	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ВесГраммыФактПриИзменении(Элемент)

	Если СпособРасчетаВесаФакт = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
		РассчитатьВесКамняПоТаблице(Истина);  
	ИначеЕсли СпособРасчетаВесаФакт = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
		РассчитатьВесКамняПоФормуле(Истина);  	
	КонецЕсли;

	ВесФакт = ЛБ_ОбщегоНазначения.ПересчетИзГраммовВКараты(ВесГраммыФакт);

	ВесГраммыШтФакт = ВесГраммыФакт/КоличествоФакт;
	ВесШтФакт = ВесФакт/КоличествоФакт;

	Модифицированность = Истина;
	
КонецПроцедуры

//Если вес вручную и категория 3 или 4 то доступен ввод общего веса в каратах/
&НаСервере
Функция ПолучитьКачество(КатегорияОбъектаЗалогаФакт)
	Возврат КатегорияОбъектаЗалогаФакт.ПониженноеКачество;
КонецФункции

&НаКлиенте
Процедура ВесПриИзменении(Элемент)
	ВесГраммыФакт = ЛБ_ОбщегоНазначения.ПересчетИзКаратовВГраммы(ВесФакт);
	ВесШтФакт = Окр(ВесФакт/КоличествоФакт, 3);
	ВесГраммыШтФакт = Окр(ВесГраммыФакт/КоличествоФакт, 3);
КонецПроцедуры

//+Мельников 12.08.24 Проверяем на булево ограничения списка видов огранки. Заявка 2740.
&НаСервереБезКонтекста
Функция ОграниченныйСписокВидовОгранки(ФормаОгранкиФакт, КатегорияОбъектаЗалогаФакт)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_НастройкаДопустимыхФормОгранки.ОграниченныйСписокВидовОгранки КАК ОграниченныйСписокВидовОгранки
		|ИЗ
		|	РегистрСведений.ЛБ_НастройкаДопустимыхФормОгранки КАК ЛБ_НастройкаДопустимыхФормОгранки
		|ГДЕ
		|	ЛБ_НастройкаДопустимыхФормОгранки.ФормаОгранки = &ФормаОгранки
		|	И ЛБ_НастройкаДопустимыхФормОгранки.КатегорияОбъектаЗалога = &КатегорияОбъектаЗалога";
	
	Запрос.УстановитьПараметр("КатегорияОбъектаЗалога", КатегорияОбъектаЗалогаФакт);
	Запрос.УстановитьПараметр("ФормаОгранки", ФормаОгранкиФакт);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.ОграниченныйСписокВидовОгранки;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

//+Мельников 30.07.24 Заявка 2736
&НаКлиенте
Процедура ОчиститьДопПараметры()
	ДиаметрФакт = 0;
	Диаметр1Факт = 0;
	Диаметр2Факт = 0;
	ДлинаФакт = 0;
	Ширина1Факт = 0;
	Высота1Факт = 0;
	СторонаФакт = 0;
	ВесШтФакт = 0;
	ВесФакт = 0;
	ВесГраммыШтФакт = 0;
	ВесГраммыФакт = 0;
КонецПроцедуры

&НаКлиенте
Процедура ВидВставкиФактОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	Если Элемент.ТекстРедактирования <> Строка(ВыбранноеЗначение) Тогда
		ФормаОгранкиФакт = ПредопределенноеЗначение("Справочник.ЛБ_ФормыОгранки.ПустаяСсылка");
		ВидОгранкиФакт = ПредопределенноеЗначение("Справочник.ЛБ_ВидыОгранки.ПустаяСсылка");
		КачествоОгранкиФакт = ПредопределенноеЗначение("Справочник.ЛБ_КачествоОгранки.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФормаОгранкиФактОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	Если Элемент.ТекстРедактирования <> Строка(ВыбранноеЗначение) Тогда
		ВидОгранкиФакт = ПредопределенноеЗначение("Справочник.ЛБ_ВидыОгранки.ПустаяСсылка");
		КачествоОгранкиФакт = ПредопределенноеЗначение("Справочник.ЛБ_КачествоОгранки.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидОгранкиФактОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	Если Элемент.ТекстРедактирования <> Строка(ВыбранноеЗначение) Тогда
		КачествоОгранкиФакт = ПредопределенноеЗначение("Справочник.ЛБ_КачествоОгранки.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПроверитьНаличиеИзменений()
	Для каждого Элем Из ЭтаФорма.Элементы Цикл
		Если ТипЗнч(Элем) = Тип("ПолеФормы") Тогда
			
			ЭлементФакт = СтрНайти(Элем.Имя, "Факт");
			
			Если ЭлементФакт = 0 Тогда
				Если ЭтотОбъект[Элем.Имя] <> ЭтотОбъект[Элем.Имя + "Факт"] Тогда
					Возврат Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции
//-Мельников
