// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	Движения.ЛБ_УстановкаОтменаСкидки.Записывать = Истина; 
	
	СписокЛ = Новый СписокЗначений;
	Для каждого СтрЛ Из Этотобъект.Ломбарды Цикл
		СписокЛ.Добавить(СтрЛ.Ломбард);
	КонецЦикла;                        
	Если СписокЛ.Количество() = 0 Тогда 
		СписокЛ.Добавить(Справочники.ЛБ_Ломбарды.ПустаяСсылка());
	КонецЕсли;	
			    
	Для каждого Эл Из СписокЛ Цикл  
		Для каждого СтрС из ЭтотОбъект.СкидкиВДокументах Цикл 
			Если НЕ СтрС.Использовать Тогда
				Продолжить;
			КонецЕсли;	
		    Движение = Движения.ЛБ_УстановкаОтменаСкидки.Добавить();
			Движение.Период = Дата; 
			Движение.Ломбард = Эл.Значение; 
			Движение.СкидкаВДокументах = СтрС.СкидкаВДокументах;
			Движение.ДокументСкидки = СтрС.ДокументУстановкиСкидки;  
			Движение.ДействуетС = СтрС.ДействуетС; 
			Движение.Отменен = Истина;  
		КонецЦикла;	
	КонецЦикла;	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаУдаленияПроведения".
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	Если НЕ НачалоДня(ЭтотОбъект.Дата) = НачалоДня(ТекущаяДатаСеанса()) Тогда  
		Если НЕ УправлениеДоступом.ЕстьРоль("ЛБ_Суперпользователь") Тогда 
            ОбщегоНазначения.СообщитьПользователю("Вам запрещена отмена проведения этого документа!");
			Отказ = Истина; 
		КонецЕсли;	
	КонецЕсли;	                   		
КонецПроцедуры // ОбработкаУдаленияПроведения()
