		
&НаСервере
Процедура ОчиститьНасервере() 
	УдСтроки = новый СписокЗначений;
	Для каждого Стр Из ТаблицаЗалогов Цикл 
		Если Стр.Очистить тогда
			НаборЗаписей = РегистрыСведений.ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.СоздатьНаборЗаписей();
		    НаборЗаписей.Отбор.ЗалоговыйБилет.Установить(Стр.ЗалоговыйБилет); 
			НаборЗаписей.Отбор.ОбъектЗалога.Установить(Стр.ОбъектЗалога);
		    НаборЗаписей.Записать();  
			УдСтроки.Добавить(Стр); 
		КонецЕсли;	
	КонецЦикла;              
	Для каждого Эл Из УдСтроки Цикл 
		ТаблицаЗалогов.Удалить(Эл.Значение);
	Конеццикла;	
КонецПроцедуры	
		
&НаКлиенте
Процедура ОчиститьВыбранные(Команда)  
	ЕстьОтмеченные = Ложь;
	Для каждого Стр Из ТаблицаЗалогов Цикл
		Если Стр.Очистить Тогда 
			ЕстьОтмеченные = Истина;
			Прервать;
		КонецЕсли;	
	Конеццикла;	     
	
	Если НЕ ЕстьОтмеченные Тогда
		Предупреждение("Не выбран ни один объект залога!", 60);
		Возврат;
	КонецЕсли;
	
	Режим = РежимДиалогаВопрос.ДаНетОтмена;
    Ответ = Вопрос("Вы уверены, что хотите очистить выбранные залоги?", Режим, 0);
    Если Ответ = КодВозвратаДиалога.Да Тогда
        ОчиститьНасервере();
    КонецЕсли; 	
КонецПроцедуры  

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВсеНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ДокументРеализации КАК Реализация,
	               |	ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.Ответственный КАК Ответственный,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул
	               |ИЗ
	               |	РегистрСведений.ЛБ_ОбъектыЗалогаДобавленныеВРеализацию КАК ЛБ_ОбъектыЗалогаДобавленныеВРеализацию
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	               |		ПО ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ЗалоговыйБилет = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет
	               |			И ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ОбъектЗалога = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЗалоговыйБилет,
	               |	Артикул";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();   
	ТаблицаЗалогов.Загрузить(ТаблицаЗапроса);
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьВсе(Команда)
	ЗаполнитьВсеНаСервере();
КонецПроцедуры

&НаСервере
Функция ДобавитьПоНомеруЗБ(НомерЗБ)
	Запрос = Новый Запрос;    
	Запрос.УстановитьПараметр("НомерЗБ", НомерЗБ);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ДокументРеализации КАК Реализация,
	               |	ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.Ответственный КАК Ответственный,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул
	               |ИЗ
	               |	РегистрСведений.ЛБ_ОбъектыЗалогаДобавленныеВРеализацию КАК ЛБ_ОбъектыЗалогаДобавленныеВРеализацию
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(, ) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	               |		ПО (ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ЗалоговыйБилет = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет)
	               |			И (ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ОбъектЗалога = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога)
	               |ГДЕ
	               |	ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ЗалоговыйБилет.НомерЗалоговогоБилета = &НомерЗБ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЗалоговыйБилет,
	               |	Артикул";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();   
	Если  ТаблицаЗапроса.Количество() = 0 Тогда
		Возврат "Изделия по номеру ЗБ " + сокрЛП(НомерЗБ) + " не найдены.";  
	Иначе 
		Для каждого Стр из ТаблицаЗапроса цикл  
			Отбор = Новый структура;
			Отбор.Вставить("ЗалоговыйБилет", стр.ЗалоговыйБилет);
			Отбор.Вставить("ОбъектЗалога", стр.ОбъектЗалога);
			Строки = ТаблицаЗалогов.НайтиСтроки(Отбор);
			Если Строки.Количество() = 0 Тогда
				НоваяСтр  = ТаблицаЗалогов.Добавить();
				НоваяСтр.ЗалоговыйБилет = Стр.ЗалоговыйБилет;  
				НоваяСтр.ОбъектЗалога = Стр.ОбъектЗалога;
				НоваяСтр.Артикул = Стр.Артикул;
				НоваяСтр.Реализация = Стр.Реализация; 
				НоваяСтр.Ответственный = Стр.Ответственный; 
				НоваяСтр.Очистить = Истина; 
			КонецЕсли;	
		Конеццикла;	
		Возврат "";
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьПоНомеруЗБ(Команда)
	НомерЗБ = "";
	Если ВвестиЗначение(НомерЗБ, "Введите номер ЗБ") Тогда
	    СтрокаСообщение = ДобавитьПоНомеруЗБ(НомерЗБ);
		Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
			Предупреждение(СтрокаСообщение, 60);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьВсе(Команда)
	Для каждого Стр Из ТаблицаЗалогов Цикл
		Стр.Очистить = Истина;
	Конеццикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПометку(Команда)
	Для каждого Стр Из ТаблицаЗалогов Цикл
		Стр.Очистить = Ложь;
	Конеццикла;	
КонецПроцедуры 

&НаСервере
Функция ДобавитьПоАртикулу(Артикул)
	Запрос = Новый Запрос;    
	Запрос.УстановитьПараметр("Артикул", Артикул);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ДокументРеализации КАК Реализация,
	               |	ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.Ответственный КАК Ответственный,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(, Артикул = &Артикул) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ОбъектыЗалогаДобавленныеВРеализацию КАК ЛБ_ОбъектыЗалогаДобавленныеВРеализацию
	               |		ПО (ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ЗалоговыйБилет = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет)
	               |			И (ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ОбъектЗалога = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЗалоговыйБилет,
	               |	Артикул";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();   
	Если  ТаблицаЗапроса.Количество() = 0 Тогда
		Возврат "Изделие с артикулом " + сокрЛП(Артикул) + " не найдено.";  
	Иначе 
		Для каждого Стр из ТаблицаЗапроса цикл  
			Отбор = Новый структура;
			Отбор.Вставить("ЗалоговыйБилет", стр.ЗалоговыйБилет);
			Отбор.Вставить("ОбъектЗалога", стр.ОбъектЗалога);
			Строки = ТаблицаЗалогов.НайтиСтроки(Отбор);
			Если Строки.Количество() = 0 Тогда
				НоваяСтр  = ТаблицаЗалогов.Добавить();
				НоваяСтр.ЗалоговыйБилет = Стр.ЗалоговыйБилет;  
				НоваяСтр.ОбъектЗалога = Стр.ОбъектЗалога;
				НоваяСтр.Артикул = Стр.Артикул;
				НоваяСтр.Реализация = Стр.Реализация; 
				НоваяСтр.Ответственный = Стр.Ответственный; 
				НоваяСтр.Очистить = Истина; 
			КонецЕсли;	
		Конеццикла;	
		Возврат "";
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьПоАртикулу(Команда)
	Артикул = "";
	Если ВвестиЗначение(Артикул, "Введите артикул") Тогда
	    СтрокаСообщение = ДобавитьПоАртикулу(Артикул);
		Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
			Предупреждение(СтрокаСообщение, 60);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗалоговВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтрока = Элементы.ТаблицаЗалогов.ТекущиеДанные;
	Если ЗначениеЗаполнено(Текстрока.Реализация) Тогда
		ПараметрыФормы = Новый Структура("Ключ", Текстрока.Реализация);
        ОткрытьФорму("Документ.ЛБ_Реализация.Форма.ФормаДокумента", ПараметрыФормы,ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры
