&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Если Параметры.Свойство("АдресСтруктура") Тогда
	//	СтрокаXML = Параметры.АдресСтруктура;
	//	ПрочитатьАдресXML(СтрокаXML);
	//КонецЕсли;	
	//Если Параметры.Свойство("Гражданство") Тогда
	//	Страна = Параметры.Гражданство;
	//КонецЕсли;	
	//Если НЕ ЗначениеЗаполнено(Страна) Тогда
	//	Страна = Справочники.СтраныМира.Россия;
	//КонецЕсли;
	// ++ Сербаев 31.05.2023
	Если Параметры.Свойство("АдресВРучнуюСтрока") Тогда
		АдресОднойСтрокой = Истина;
		АдресСтрока = Параметры.АдресВРучнуюСтрока
	Иначе
		Если Параметры.Свойство("АдресСтруктура") Тогда
			СтрокаXML = Параметры.АдресСтруктура;
			ПрочитатьАдресXML(СтрокаXML);
		КонецЕсли;
		Если Параметры.Свойство("Гражданство") Тогда
			Страна = Параметры.Гражданство;
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(Страна) Тогда
			Страна = Справочники.СтраныМира.Россия;
		КонецЕсли;
	КонецЕсли;
	// -- Сербаев 31.05.2023
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// ++ Сербаев 31.05.2023
	Если Не АдресОднойСтрокой Тогда
	    Элементы.АдресСтрока.ТолькоПросмотр  = Истина;
	    ЗаполнитьАдресСтрокой();
	КонецЕсли;
	УстановитьДоступность();
    // -- Сербаев 31.05.2023
	//Элементы.АдресСтрока.ТолькоПросмотр  = Истина;
	//ЗаполнитьАдресСтрокой();
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	// ++ Сербаев 31.05.2023
	Модифицированность = Ложь;
	ЗакрытьФормуРучногоВвода();
	//Если ОшибкаЗаполненияПолей Тогда
	//	ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОшибкиЗаполненияПолей, , ,РеквизитОшибкиЗааолненияПолей);
	//    Возврат;
	//КонецЕсли;
	//
	//Если Не АдресОднойСтрокой Тогда
	//	
	//	Если ПроверитьЗаполнение() Тогда
	//		Если СтрДлина(сокрЛП(Индекс)) <> 6  Тогда
	//			Сообщить("Индекс должен состоять из 6 символов!");
	//		ИначеЕсли ЛБ_ОбщегоНазначения.ПроверкаВсеСимволыНули(Индекс) Тогда
	//			Сообщить("Индекс не должен содержать только нули!");
	//		Иначе	
	//			ЗаписатьАдресВСтрокуXML();
	//			Результат = Новый Структура;
	//			Результат.Вставить("Представление", АдресСтрока);
	//			Результат.Вставить("Значение", АдресСтруктура);
	//			Закрыть(Результат);
	//		КонецЕсли;	
	//		
	//	КонецЕсли;
	//	
	//	// ++ Сербаев 31.05.2023
	//Иначе
	//	Результат = Новый Структура;
	//	Результат.Вставить("Представление", АдресСтрока);
	//	//Результат.Вставить("Значение", АдресСтруктура);
	//	Результат.Вставить("Значение", "");
	//	Закрыть(Результат);
	//    // -- Сербаев 31.05.2023
	//	
	//КонецЕсли;
	// -- Сербаев 31.05.2023
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАдресСтрокой()
	
	// ++ Сербаев 17.05.2023
	ОшибкаЗаполненияПолей = Ложь;
	СообщениеОшибкиЗаполненияПолей = "";
	РеквизитОшибкиЗааолненияПолей  = "";
		
	ВведеныОдниБуквыДом      = ?(НЕ ПустаяСтрока(Дом),      ЛБ_ОбщегоНазначения.ПроверитьСтрокуНаОдниБуквы(СокрЛП(Дом),      Истина), Ложь);
	ВведеныОдниБуквыКвартира = ?(НЕ ПустаяСтрока(Квартира), ЛБ_ОбщегоНазначения.ПроверитьСтрокуНаОдниБуквы(СокрЛП(Квартира), Истина), Ложь);
	
	Если ВведеныОдниБуквыДом Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Дом не должен состоять из одних букв!'"), , ,"Дом");
		СообщениеОшибкиЗаполненияПолей = "Дом не должен состоять из одних букв!";
		РеквизитОшибкиЗааолненияПолей  = "Дом";
		ОшибкаЗаполненияПолей          = Истина;
	ИначеЕсли ВведеныОдниБуквыКвартира Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Квартира не должна состоять из одних букв!'"), , ,"Квартира");
		СообщениеОшибкиЗаполненияПолей = "Квартира не должна состоять из одних букв!";
		РеквизитОшибкиЗааолненияПолей  = "Квартира";
		ОшибкаЗаполненияПолей          = Истина;
	Иначе
		СтрокаА = ""; 
		
		//СтрокаА = СтрокаА + ?(НЕ ПустаяСтрока(Индекс),          ?(ПустаяСтрока(СтрокаА), "", " ") + СокрЛП(Индекс), "");
		СтрокаА = СтрокаА + ?(НЕ ПустаяСтрока(Индекс),          ?(ПустаяСтрока(СтрокаА), "", ", ") + СокрЛП(Индекс),  "");
		СтрокаА = СтрокаА + ?(ЗначениеЗаполнено(Страна),        ?(ПустаяСтрока(СтрокаА), "", ", ") + СокрЛП(Страна),  "");
		СтрокаА = СтрокаА + ?(НЕ ПустаяСтрока(Область),         ?(ПустаяСтрока(СтрокаА), "", ", ") + СокрЛП(Область), "");
		СтрокаА = СтрокаА + ?(НЕ ПустаяСтрока(Район),           ?(ПустаяСтрока(СтрокаА), "", ", ") + СокрЛП(Район),   "");
		
		СтрокаА = СтрокаА + ?(НЕ ПустаяСтрока(НаселенныйПункт), ?(ПустаяСтрока(СтрокаА), "", ", ") + СокрЛП(НаселенныйПункт),   "");
		СтрокаА = СтрокаА + ?(НЕ ПустаяСтрока(Улица),           ?(ПустаяСтрока(СтрокаА), "", ", ") + СокрЛП(Улица),             "");
		СтрокаА = СтрокаА + ?(НЕ ПустаяСтрока(Дом),             ?(ПустаяСтрока(СтрокаА), "", ", ") + "д. " + СокрЛП(Дом),       "");
		СтрокаА = СтрокаА + ?(НЕ ПустаяСтрока(Корпус),          ?(ПустаяСтрока(СтрокаА), "", ", ") + "корп. " + СокрЛП(Корпус), "");
		СтрокаА = СтрокаА + ?(НЕ ПустаяСтрока(Квартира),        ?(ПустаяСтрока(СтрокаА), "", ", ") + "кв. " + СокрЛП(Квартира), "");
		
		АдресСтрока = СтрокаА;
	КонецЕсли;	
	// -- Сербаев 17.05.2023
	
КонецПроцедуры

// ++ Сербаев 17.05.2023
&НаКлиенте
Процедура ОбластьПриИзменении(Элемент) 
	Область = ЛБ_ОбщегоНазначения.ПрописнаяПерваяБуква(Область);
	Модифицированность = Истина;
	ЗаполнитьАдресСтрокой();
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	Район = ЛБ_ОбщегоНазначения.ПрописнаяПерваяБуква(Район);
	Модифицированность = Истина;
	ЗаполнитьАдресСтрокой();
КонецПроцедуры

&НаКлиенте
Процедура АдресОднойСтрокойПриИзменении(Элемент)  
	
	Модифицированность = Истина;
	
	АдресСтрока    = "";
	АдресСтруктура = "";
	Если АдресОднойСтрокой Тогда
		Страна          = ПредопределенноеЗначение("Справочник.СтраныМира.ПустаяСсылка");
		Индекс          = "";
		Область         = "";
		Район           = "";
		НаселенныйПункт = "";
		Улица           = "";
		Дом             = "";
		Корпус          = "";
		Квартира        = "";
	КонецЕсли;

	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность()
	
	Если АдресОднойСтрокой Тогда
		Элементы.Страна.Доступность          = Ложь;
		Элементы.Индекс.Доступность          = Ложь;
		Элементы.Область.Доступность         = Ложь;
		Элементы.Район.Доступность           = Ложь;
		Элементы.НаселенныйПункт.Доступность = Ложь;
		Элементы.Улица.Доступность           = Ложь;
		Элементы.Дом.Доступность             = Ложь;
		Элементы.Корпус.Доступность          = Ложь;
		Элементы.Квартира.Доступность        = Ложь;
		Элементы.АдресСтрока.ТолькоПросмотр  = Ложь;
	Иначе
        Элементы.Страна.Доступность          = Истина;
		Элементы.Индекс.Доступность          = Истина;
		Элементы.Область.Доступность         = Истина;
		Элементы.Район.Доступность           = Истина;
		Элементы.НаселенныйПункт.Доступность = Истина;
		Элементы.Улица.Доступность           = Истина;
		Элементы.Дом.Доступность             = Истина;
		Элементы.Корпус.Доступность          = Истина;
		Элементы.Квартира.Доступность        = Истина;
		Элементы.АдресСтрока.ТолькоПросмотр  = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)   
	
	Если Модифицированность Тогда
		Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемФормыРучногоВвода", ЭтотОбъект);
		ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
	КонецЕсли; 
	
КонецПроцедуры 

&НаКлиенте
Процедура ПередЗакрытиемФормыРучногоВвода(Результат, ДополнительныеПараметры) Экспорт
	
	Если Модифицированность Тогда
		Модифицированность = Ложь;
		ЗакрытьФормуРучногоВвода();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ПроверитьЗаполнениеиИндекса() 
	Если Страна = Справочники.СтраныМира.Россия Тогда 
		Если НЕ ЗначениеЗаполнено(Индекс) Тогда
			Возврат Ложь;   
		КонецЕсли;	
	КонецЕсли; 
	Возврат Истина;	
КонецФункции	

&НаКлиенте
Процедура ЗакрытьФормуРучногоВвода()
	
	Если ОшибкаЗаполненияПолей Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОшибкиЗаполненияПолей, , ,РеквизитОшибкиЗааолненияПолей);
	    Возврат;
	КонецЕсли;
	
	Если Не АдресОднойСтрокой Тогда
		
		Если ПроверитьЗаполнение() Тогда 
			ВсеОК = Истина;      
			Если ПроверитьЗаполнениеиИндекса() Тогда
				Если ЗначениеЗаполнено(Индекс) Тогда 
					Если СтрДлина(сокрЛП(Индекс)) <> 6  Тогда
						Сообщить("Индекс должен состоять из 6 символов!"); 
						ВсеОК = Ложь;
					ИначеЕсли ЛБ_ОбщегоНазначения.ПроверкаВсеСимволыНули(Индекс) Тогда 
						ВсеОК = Ложь;
						Сообщить("Индекс не должен содержать только нули!");
					КонецЕсли;
				КонецЕсли;	
			Иначе     
				ВсеОК = Ложь;
				Сообщить("Для российского адреса заполнение индекса обязательно!");
			КонецЕсли;	
			Если ВсеОК Тогда	
				ЗаписатьАдресВСтрокуXML();
				Результат = Новый Структура;
				Результат.Вставить("Представление", АдресСтрока);
				Результат.Вставить("Значение", АдресСтруктура);
				Закрыть(Результат);
			КонецЕсли;	
			
		КонецЕсли;
		
		// ++ Сербаев 31.05.2023
	Иначе
		Результат = Новый Структура;
		Результат.Вставить("Представление", АдресСтрока);
		//Результат.Вставить("Значение", АдресСтруктура);
		Результат.Вставить("Значение", "");
		Закрыть(Результат);
	    // -- Сербаев 31.05.2023
		
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура АдресСтрокаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры
// -- Сербаев 17.05.2023

&НаКлиенте
Процедура СтранаПриИзменении(Элемент)
	Модифицированность = Истина;  // Сербаев 01.06.2023
	ЗаполнитьАдресСтрокой();
КонецПроцедуры

&НаКлиенте
Процедура ИндексПриИзменении(Элемент)

	Модифицированность = Истина;  // Сербаев 01.06.2023
	
	Если Индекс = "" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Индекс не заполнен!'"), , ,"Индекс");
	ИначеЕсли Не СтрДлина(СокрЛП(Индекс)) = 6 Или Индекс = "000000" Или (Не ЛБ_ОбщегоНазначения.СтрокаНеСодержитБукв(Индекс)) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Индекс заполнен некорректно!'"), , ,"Индекс");
		Возврат;
	Иначе
		ЗаполнитьАдресСтрокой();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаселенныйПунктПриИзменении(Элемент)
	// ++ Сербаев 17.05.2023
	НаселенныйПункт = ЛБ_ОбщегоНазначения.ПрописнаяПерваяБуква(НаселенныйПункт);
	Модифицированность = Истина;
    // -- Сербаев 17.05.2023 
	ЗаполнитьАдресСтрокой();
КонецПроцедуры

&НаКлиенте
Процедура УлицаПриИзменении(Элемент) 
	// ++ Сербаев 17.05.2023
	Модифицированность = Истина;
	Улица = ЛБ_ОбщегоНазначения.ПрописнаяПерваяБуква(Улица);
    // -- Сербаев 17.05.2023
	ЗаполнитьАдресСтрокой(); 
КонецПроцедуры

&НаКлиенте
Процедура ДомПриИзменении(Элемент)
	Модифицированность = Истина; // Сербаев 01.06.2023
	ЗаполнитьАдресСтрокой();
КонецПроцедуры

&НаКлиенте
Процедура КорпусПриИзменении(Элемент)
    Модифицированность = Истина; // Сербаев 01.06.2023
	ЗаполнитьАдресСтрокой();
КонецПроцедуры

&НаКлиенте
Процедура КвартираПриИзменении(Элемент) 
	Модифицированность = Истина;  // Сербаев 01.06.2023
	ЗаполнитьАдресСтрокой();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьАдресВСтрокуXML()
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Адрес");
	ЗаписьXML.ЗаписатьАтрибут("СтранаКод", ?(Не ЗначениеЗаполнено(Страна), "", Страна.Код));
	ЗаписьXML.ЗаписатьАтрибут("НаселенныйПункт", СокрЛП(НаселенныйПункт));
	ЗаписьXML.ЗаписатьАтрибут("Индекс",          СокрЛП(Индекс));

	// ++ Сербаев 17.05.2023
	ЗаписьXML.ЗаписатьАтрибут("Область",         СокрЛП(Область));
	ЗаписьXML.ЗаписатьАтрибут("Район",           СокрЛП(Район));
	// -- Сербаев 17.05.2023
	
	ЗаписьXML.ЗаписатьАтрибут("Улица",           СокрЛП(Улица));
	ЗаписьXML.ЗаписатьАтрибут("Дом",             СокрЛП(Дом));
	ЗаписьXML.ЗаписатьАтрибут("Корпус",          СокрЛП(Корпус));
	ЗаписьXML.ЗаписатьАтрибут("Квартира",        СокрЛП(Квартира));
	ЗаписьXML.ЗаписатьКонецЭлемента();

	
	АдресСтруктура = ЗаписьXML.Закрыть();	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьАдресXML(СтрXML)
	Если НЕ ПустаяСтрока(СтрXML) Тогда
		ЧтениеXML = Новый ЧтениеXML;
	    ЧтениеXML.УстановитьСтроку(СтрXML);
		
		Пока ЧтениеXML.Прочитать() Цикл
			Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "Адрес" Тогда
				КодСтраны = ЧтениеXML.ЗначениеАтрибута("СтранаКод");
				Если НЕ ПустаяСтрока(КодСтраны) Тогда
					Страна = Справочники.СтраныМира.НайтиПоКоду(КодСтраны);
				Иначе
					Страна = Справочники.СтраныМира.ПустаяСсылка();
				КонецЕсли;	
				НаселенныйПункт = ЧтениеXML.ЗначениеАтрибута("НаселенныйПункт");			
				Индекс          = ЧтениеXML.ЗначениеАтрибута("Индекс");
				
				// ++ Сербаев 17.05.2023
				Область         = ЧтениеXML.ЗначениеАтрибута("Область");
				Район           = ЧтениеXML.ЗначениеАтрибута("Район");
				// -- Сербаев 17.05.2023
				
				Улица           = ЧтениеXML.ЗначениеАтрибута("Улица");
				Дом             = ЧтениеXML.ЗначениеАтрибута("Дом");	     
				Корпус          = ЧтениеXML.ЗначениеАтрибута("Корпус");	        
				Квартира        = ЧтениеXML.ЗначениеАтрибута("Квартира");
			КонецЕсли;	
		КонецЦикла;	
		ЧтениеXML.Закрыть();
	КонецЕсли;	
КонецПроцедуры	













