
Процедура ПриЗаписи(Отказ, Замещение)
	//Для каждого Запись Из ЭтотОбъект Цикл
	//	
	//	Состояние = Запись.Состояние;
	//	Если ЗначениеЗаполнено(Состояние) Тогда
	//		ВидРабВремени = ВернутьВидРабочегоВремени(Состояние);
	//		Если ВидРабВремени <> Неопределено Тогда
	//			
	//			НаборЗаписей = РегистрыСведений.ЛБ_ВременнаяБлокировкаСотрудника.СоздатьНаборЗаписей();		
	//			НаборЗаписей.Отбор.Сотрудник.Установить(Запись.Сотрудник);
	//			НаборЗаписей.Отбор.ДатаНачала.Установить(НачалоДня(Запись.Период));
	//			НаборЗаписей.Отбор.ДатаОкончания.Установить(КонецДня(Запись.ДействуетДо));
	//			НаборЗаписей.Отбор.ПричинаБлокировки.Установить(ВидРабВремени);
	//			
	//			НоваяЗапись 			      = НаборЗаписей.Добавить(); 
	//			НоваяЗапись.Сотрудник         = Запись.Сотрудник; 
	//			НоваяЗапись.ДатаНачала 	      = НачалоДня(Запись.Период);
	//			НоваяЗапись.ДатаОкончания 	  = КонецДня(Запись.ДействуетДо); 
	//			НоваяЗапись.ПричинаБлокировки = ВидРабВремени;  
	//			
	//			НаборЗаписей.Записать(); 			
	//			
	//		КонецЕсли;
	//	КонецЕсли;		
	//КонецЦикла;   
КонецПроцедуры


Функция ВернутьВидРабочегоВремени(Состояние)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ВидыИспользованияРабочегоВремени.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЛБ_ВидыИспользованияРабочегоВремени КАК ЛБ_ВидыИспользованияРабочегоВремени
	               |ГДЕ
	               |	ЛБ_ВидыИспользованияРабочегоВремени.СостояниеСотрудника = &СостояниеСотрудника
	               |	И ЛБ_ВидыИспользованияРабочегоВремени.ЭтоПричинаБлокировки = Истина";
	Запрос.УстановитьПараметр("СостояниеСотрудника", Состояние);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
