
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда 
		Объект.ОтветственныйСотрудник    = ПараметрыСеанса.ТекущийСотрудник;
		Объект.ОтветственныйПользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МесяцРегистрацииСтрокойПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтаФорма, "Объект.ПериодРегистрации", "МесяцРегистрацииСтрокой", Модифицированность);
	
	//ПериодРегистрацииПриИзменении();  
	//ПериодВводаДанныхОВремениПриИзмененииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура МесяцРегистрацииСтрокойНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	//Оповещение = Новый ОписаниеОповещения("ПериодРегистрацииНачалоВыбораЗавершение", ЭтотОбъект);
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтаФорма, ЭтаФорма, "Объект.ПериодРегистрации", "МесяцРегистрацииСтрокой", , );
КонецПроцедуры

Функция ПолучитьПредставлениеМесяца(ДатаНачалаМесяца) Экспорт
	
	Возврат Формат(ДатаНачалаМесяца, "ДФ='ММММ гггг'");
	
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтаФорма, "Объект.ПериодРегистрации", "МесяцРегистрацииСтрокой");
КонецПроцедуры


&НаСервере
Процедура СотрудникиСуммаКВыплатеПриИзмененииНаСервере()
	Объект.СуммаДокумента = Объект.Сотрудники.Итог("СуммаКВыплате");
КонецПроцедуры


&НаКлиенте
Процедура СотрудникиСуммаКВыплатеПриИзменении(Элемент)
	СотрудникиСуммаКВыплатеПриИзмененииНаСервере();
КонецПроцедуры

