
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис;
	Склад = ПолучитьСклад();	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Предупреждение("Для подразделения " + СокрЛП(Ломбард) + " не определен склад с видом " + ?(Ломбард = ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис"), "«Витрина общая»", "«Витрина ломбарда/ЦЛО»"));
		Элементы.ФормаВыбрать.Доступность = Ложь;
	Иначе
		Элементы.ФормаВыбрать.Доступность = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Предупреждение("Не выбран склад!", 60);   
	Иначе
		ЭтаФорма.Закрыть(Склад);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Функция ПолучитьСклад()  
	Если Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис Тогда
	    ВидСклада = Перечисления.ЛБ_ВидыСкладов.ВитринаОбщая;
	Иначе    
		ВидСклада = Перечисления.ЛБ_ВидыСкладов.Витрина;
	КонецЕсли;	
    Возврат ЛБ_Общиймодуль.ПолучитьСклад(Ломбард, ВидСклада);
КонецФункции


&НаКлиенте
Процедура ЛомбардПриИзменении(Элемент)
	Если Значениезаполнено(Ломбард) Тогда  
		Склад = ПолучитьСклад();
		Если НЕ ЗначениеЗаполнено(Склад) Тогда
			Предупреждение("Для подразделения " + СокрЛП(Ломбард) + " не определен склад с видом " + ?(Ломбард = ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис"), "«Витрина общая»", "«Витрина ломбарда/ЦЛО»")); 
			Элементы.ФормаВыбрать.Доступность = Ложь;
		Иначе
			Элементы.ФормаВыбрать.Доступность = Истина;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

