
Функция ПересчетИзКаратовВГраммы(ВесКарат) Экспорт
	Возврат окр(ВесКарат/5, 3);
КонецФункции 

Функция ПересчетИзГраммовВКараты(ВесГрамм) Экспорт
	Возврат окр(ВесГрамм*5, 3);
КонецФункции

// функция возвращает часть строки после последнего встреченного символа в строке
Функция ПолучитьЧастьСтрокиОтделеннойСимволом(Знач ИсходнаяСтрока, Знач СимволПоиска, ЕслиНетСимволаТоВсюСтроку = Ложь)
	
	ПозицияСимвола = СтрДлина(ИсходнаяСтрока);
	Пока ПозицияСимвола >= 1 Цикл
		
		Если Сред(ИсходнаяСтрока, ПозицияСимвола, 1) = СимволПоиска Тогда
						
			Возврат Сред(ИсходнаяСтрока, ПозицияСимвола + 1); 
			
		КонецЕсли;
		
		ПозицияСимвола = ПозицияСимвола - 1;	
	КонецЦикла;

	Возврат ?(ЕслиНетСимволаТоВсюСтроку, ИсходнаяСтрока, "");
  	
КонецФункции


// Выделяет из имени файла его расширение (набор символов после последней точки).
//
// Параметры
//  ИмяФайла     – Строка, содержащая имя файла, неважно с именем каталога или без.
//
// Возвращаемое значение:
//   Строка – расширение файла.
//
Функция ПолучитьРасширениеФайла(Знач ИмяФайла) Экспорт
	
	Расширение = ПолучитьЧастьСтрокиОтделеннойСимволом(ИмяФайла, ".");
	Возврат Расширение;
	
КонецФункции

Функция ЗаполнитьИнфорациюОМестеРождения(Страна, Область, Район, НасленныйПункт) Экспорт
	
    // ++ Сербаев 20.06.2023
	Если Не ПустаяСтрока(СокрЛП(Страна)) Тогда
		ТекстОшибки = ЛБ_ОбщегоНазначения.СообщитьЕслиСтрокаНеправильная(Страна, "Страна");
		Если ТекстОшибки <> "" Тогда 	
			Страна = "";
		КонецЕсли;
	КонецЕсли;
	Если Не ПустаяСтрока(СокрЛП(Область)) Тогда
		ТекстОшибки = ЛБ_ОбщегоНазначения.СообщитьЕслиСтрокаНеправильная(Область, "Область");
		Если ТекстОшибки <> "" Тогда 	
			Область = "";
		КонецЕсли;
	КонецЕсли;
	Если Не ПустаяСтрока(СокрЛП(Район)) Тогда
		ТекстОшибки = ЛБ_ОбщегоНазначения.СообщитьЕслиСтрокаНеправильная(Район, "Район");
		Если ТекстОшибки <> "" Тогда 	
			Район = "";
		КонецЕсли;
	КонецЕсли;
	Если Не ПустаяСтрока(СокрЛП(НасленныйПункт)) Тогда
		ТекстОшибки = ЛБ_ОбщегоНазначения.СообщитьЕслиСтрокаНеправильная(НасленныйПункт, "НасленныйПункт");
		Если ТекстОшибки <> "" Тогда 	
			НасленныйПункт = "";
		КонецЕсли;
	КонецЕсли;
    // -- Сербаев 20.06.2023
	
	Информация = "";
	Информация = Информация + ?(ПустаяСтрока(Страна), "", ?(ПустаяСтрока(Информация), "", ", ") + СокрЛП(Страна));
	Информация = Информация + ?(ПустаяСтрока(Область), "", ?(ПустаяСтрока(Информация), "", ", ") + СокрЛП(Область));
	Информация = Информация + ?(ПустаяСтрока(Район), "", ?(ПустаяСтрока(Информация), "", ", ") + СокрЛП(Район));
	Информация = Информация + ?(ПустаяСтрока(НасленныйПункт), "", ?(ПустаяСтрока(Информация), "", ", ") + СокрЛП(НасленныйПункт));
	Возврат Информация;
КонецФункции	

Функция ПрописнаяПерваяБуква(Строка) Экспорт
	Если НЕ ПустаяСтрока(Строка) Тогда
		НоваяСтрока = СокрЛП(Строка); 
		Симв = Врег(Лев(НоваяСтрока, 1));
		Если СтрДлина(НоваяСтрока) = 1 Тогда
			Возврат Симв;
		Иначе	
	        НоваяСтрока = Сред(НоваяСтрока, 2);
			НоваяСтрока = Симв + НоваяСтрока;
			Возврат НоваяСтрока;
		КонецЕсли;	
    КонецЕсли;
    Возврат Строка;
КонецФункции	
	
Функция ОписаниеВозраста(Возраст) Экспорт
	Если Возраст >= 10 И Возраст <= 20 Тогда
		Возврат "лет";
	КонецЕсли;	
	СимволПравый = Прав(СокрЛП(Возраст), 1);
	Если СимволПравый = "1" Тогда
		Возврат "год";
	ИначеЕсли СимволПравый = "2" ИЛИ СимволПравый = "3" ИЛИ СимволПравый = "4" Тогда
		Возврат "года";
	Иначе
		Возврат "лет";
	КонецЕсли;	
КонецФункции

Функция ПроверкаВсеСимволыНули(Значение, ДопСимволы = неопределено) Экспорт
	ПроверяемыСимволы = "0" + ?(ДопСимволы = неопределено, "", ДопСимволы);
	ЕстьНеНоль = ложь;
	Для Сч = 1 по СтрДлина(Значение) Цикл
        Символ = Сред(Значение, Сч, 1);
		Если Не Найти(ПроверяемыСимволы, Символ) Тогда
			ЕстьНеНоль = Истина;
            Прервать;
        КонецЕсли;
	КонецЦикла;
	Если ЕстьНеНоль Тогда
		Возврат ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;	
КонецФункции

//&НаКлиенте
Функция ПроверитьСтроку(Строка, Фасет) Экспорт
    Чтение = Новый ЧтениеXML;
    Чтение.УстановитьСтроку(
                "<Model xmlns=""http://v8.1c.ru/8.1/xdto"" xmlns:xs=""http://www.w3.org/2001/XMLSchema"" xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance"" xsi:type=""Model"">
                |<package targetNamespace=""sample-my-package"">
                |<valueType name=""testtypes"" base=""xs:string"">
                |<pattern>" + Фасет + "</pattern>
                |</valueType>
                |<objectType name=""TestObj"">
                |<property xmlns:d4p1=""sample-my-package"" name=""TestItem"" type=""d4p1:testtypes""/>
                |</objectType>
                |</package>
                |</Model>");

    Модель = ФабрикаXDTO.ПрочитатьXML(Чтение);
    МояФабрикаXDTO = Новый ФабрикаXDTO(Модель);
    Пакет = МояФабрикаXDTO.Пакеты.Получить("sample-my-package");
    Тест = МояФабрикаXDTO.Создать(Пакет.Получить("TestObj"));

    Попытка
        Тест.TestItem = Строка;
        Возврат Истина
    Исключение
        Возврат Ложь
    КонецПопытки;
    
КонецФункции

Функция ТолькоЦифрыВСтроке(Знач Значение, Знач Устаревший = Истина, Знач ПробелыЗапрещены = Истина)
	
	Если ТипЗнч(Значение) <> Тип("Строка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ПробелыЗапрещены Тогда
		Значение = СтрЗаменить(Значение, " ", "");
	КонецЕсли;
		
	Если СтрДлина(Значение) = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Если содержит только цифры, то в результате замен должна быть получена пустая строка.
	// Проверять при помощи ПустаяСтрока нельзя, так как в исходной строке могут быть пробельные символы.
	Возврат СтрДлина(
		СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить(
		СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( 
			Значение, "0", ""), "1", ""), "2", ""), "3", ""), "4", ""), "5", ""), "6", ""), "7", ""), "8", ""), "9", "")) = 0;
	
		КонецФункции
		
Функция ЕстьЛатиницаИКирилицаВСтроке(строчка) 
	Латиница = "qwertyuiopasdfghjklzxcvbnm";
	Кирилица = "абвгдеёжзиклмнопрстуфхцчшщьъэюя";
	
	РезультатЛатиница = "";
	Для сч = 1 по СтрДлина(строчка) Цикл
		Если Найти(Врег(Латиница), Врег(Сред(строчка,Сч,1))) > 0 Тогда
			РезультатЛатиница = РезультатЛатиница + Сред(строчка,Сч,1);
		КонецЕсли;
	КонецЦикла;
	
	РезультатКирилица = "";
	Для сч = 1 по СтрДлина(строчка) Цикл
		Если Найти(Врег(Кирилица), Врег(Сред(строчка,Сч,1))) > 0 Тогда
			РезультатКирилица = РезультатКирилица + Сред(строчка,Сч,1);
		КонецЕсли;
	КонецЦикла; 
	Если РезультатКирилица <> "" и РезультатЛатиница <> "" Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
КонецФункции

// ++ Сербаев 29.05.2023
Функция СтрокаНеСодержитБукв(ИсходнаяСтрока) Экспорт
	
	ЕстьКирилица = Ложь;
	ЕстьЛатиница = Ложь;
	
	Если СтрДлина(ИсходнаяСтрока)>0 Тогда
		Для Сч=1 по СтрДлина(ИсходнаяСтрока) Цикл
			Символ = НРег(Сред(ИсходнаяСтрока, Сч, 1));
			Если Найти("абвгдеёжзийклмнопрстуфхцчшщъыьэюя", Символ) Тогда
				ЕстьКирилица = Истина;
			КонецЕсли;
			Если Найти("qwertyuiopasdfghjklzxcvbnm", Символ) Тогда
				ЕстьЛатиница = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; 
	
	Если ЕстьКирилица Или ЕстьЛатиница Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции 

&НаКлиенте
Функция ПроверитьСтрокуНаОдниБуквы(Знач ПроверяемаяСтрока, ПроверитьБезПробеловВСередина = Ложь) Экспорт
	
	Результат = Ложь;
	
	Если ПроверитьБезПробеловВСередина Тогда
	    ПроверяемаяСтрока = СтрЗаменить(ПроверяемаяСтрока, " ", "")
	КонецЕсли;
	
	RegExp = Новый COMОбъект("VBScript.RegExp");
	RegExp.Global     = Истина;
	RegExp.IgnoreCase = Истина;
	RegExp.Pattern    = "[A-Za-zА-Яа-я]";
	Matches           = RegExp.Execute(ПроверяемаяСтрока);
	КоличествоБукв     = Matches.Count; 
	КоличествоСимволов = СтрДлина(ПроверяемаяСтрока);
	Если КоличествоБукв = КоличествоСимволов Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
// -- Сербаев 29.05.2023

Функция СообщитьЕслиСтрокаНеправильная(Строка, НаименованиеПоля = "Строка") Экспорт
	
	Сообщение = СтрШаблон("Строка ""%1"" не должна содержать только цифры или некорректные символы", НаименованиеПоля);
	
	ТолькоЦифрыВСтроке = ТолькоЦифрыВСтроке(Строка); 
	Если ТолькоЦифрыВСтроке Тогда
		//Сообщение = НаименованиеПоля + " не может содержать только цифры!";
		Возврат Сообщение;
	КонецЕсли;
	// ++ Сербаев 30.05.2023 Разрешаем вводить латиницу а при записи проверяем на ввод только кирилицы
	//ЕстьЛатиницаИКирилица = ЕстьЛатиницаИКирилицаВСтроке(Строка);
	//Если ЕстьЛатиницаИКирилица Тогда
	//	Сообщение = СтрШаблон("Строка ""%1"" не может одновременно содержать буквы кириллицы и латиницы!", НаименованиеПоля);
	//	Возврат Сообщение;
	//КонецЕсли;
	// -- Сербаев 30.05.2023
	
	// ++ Сербаев 23.05.2023
	СтрокаБезПробела = СтрЗаменить(Строка, " ", "");
	
	//ТолькоРазрешенныеСимволы = ПроверитьСтроку(Строка,"[A-Za-zА-Яа-я0-9-]+");
	ТолькоРазрешенныеСимволы = ПроверитьСтроку(СтрокаБезПробела,"[A-Za-zА-Яа-яёЁ0-9-]+");
	// -- Сербаев 23.05.2023
	
	Если Не ТолькоРазрешенныеСимволы Тогда
		//Сообщение = НаименованиеПоля + " должно содержать только кирилицу (или латиницу), тире, цифры!";
		Возврат Сообщение;
	КонецЕсли;
	
	// ++ Сербаев 29.05.2023
	Если СтрДлина(СтрокаБезПробела) > 0 Тогда
	    СтрокаБезБукв = СтрокаНеСодержитБукв(СтрокаБезПробела);
	КонецЕсли;
	
	Если СтрокаБезБукв Тогда
	    Возврат Сообщение;
	КонецЕсли;
	// -- Сербаев 29.05.2023
	
	Возврат "";
	
КонецФункции

Процедура СообщитьПользователю(
		Знач ТекстСообщенияПользователю,
		Знач КлючДанных = Неопределено,
		Знач Поле = "",
		Знач ПутьКДанным = "",
		Отказ = Ложь) Экспорт
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщенияПользователю;
	Сообщение.Поле = Поле;
	
	ЭтоОбъект = Ложь;
	
#Если НЕ ТонкийКлиент И НЕ ВебКлиент И НЕ МобильныйКлиент Тогда
	Если КлючДанных <> Неопределено
	   И XMLТипЗнч(КлючДанных) <> Неопределено Тогда
		ТипЗначенияСтрокой = XMLТипЗнч(КлючДанных).ИмяТипа;
		ЭтоОбъект = СтрНайти(ТипЗначенияСтрокой, "Object.") > 0;
	КонецЕсли;
#КонецЕсли
	
	Если ЭтоОбъект Тогда
		Сообщение.УстановитьДанные(КлючДанных);
	Иначе
		Сообщение.КлючДанных = КлючДанных;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ПутьКДанным) Тогда
		Сообщение.ПутьКДанным = ПутьКДанным;
	КонецЕсли;
		
	Сообщение.Сообщить();
	
	Отказ = Истина;
	
КонецПроцедуры

Функция СоответствиеСтатусовLXи1С() Экспорт
	Соотв = Новый Соответствие;
	Соотв.Вставить("10", "Принят");
	Соотв.Вставить("25", "Перезалог"); 
	Соотв.Вставить("30", "Вкл.в Накл.");
	Соотв.Вставить("35", "Объявл.Торг");  
	Соотв.Вставить("36", "Выставлен Торг");
	Соотв.Вставить("37", "Реализовано ЦО"); 
	Соотв.Вставить("40", "Отгружен");
	Соотв.Вставить("45", "Реал.Торг"); 
	Соотв.Вставить("50", "Выкуплен"); 
	Соотв.Вставить("55", "Списан"); 
	Соотв.Вставить("60", "Броня");
	Соотв.Вставить("65", "На ОХ");
	Соотв.Вставить("67", "Наследство (ОХ)");
	Соотв.Вставить("70", "Арестован");
	Соотв.Вставить("75", "Изъято");
	Соотв.Вставить("76", "Возвращено");
	Соотв.Вставить("77", "Изъято из ЦО");
	Соотв.Вставить("88", "Недостача");
	
	Возврат Соотв;
КонецФункции

//+Мельников 08.07.24
&НаСервере
Функция ПроверитьПоПеречням(Дата, ЗБ) Экспорт
	
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КлиентыВПеречняхСрезПоследних.ВидПеречня КАК ВидПеречня,
	               |	ЛБ_КлиентыВПеречняхСрезПоследних.СтатусКлиентаВПеречне КАК Статус
	               |ИЗ
	               |	РегистрСведений.ЛБ_КлиентыВПеречнях.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КлиентыВПеречняхСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_КлиентыВПеречняхСрезПоследних.Период УБЫВ"; 
	Запрос.УстановитьПараметр("Залогодатель", ЗБ.Залогодатель);  
	Запрос.УстановитьПараметр("Дата", Дата); 	

	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Отбор = Новый Структура;
	Отбор.Вставить("ВидПеречня", Перечисления.ЛБ_ВидыПеречней.Террористы);
	Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);  
	Если НЕ Строки.Количество() = 0 Тогда
		Выборка = Строки.Получить(0);
		Если Выборка.Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен Тогда 
			Возврат Истина;
		ИначеЕсли Выборка.Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Исключен Тогда
			Возврат Ложь;
 		КонецЕсли;   
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Отбор.Вставить("ВидПеречня", Перечисления.ЛБ_ВидыПеречней.МВК);
	Строки = ТаблицаЗапроса.НайтиСтроки(Отбор); 
	Если НЕ Строки.Количество() = 0 Тогда
		Выборка = Строки.Получить(0);
		Если Выборка.Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен Тогда 
			Возврат Истина;
		ИначеЕсли Выборка.Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Исключен Тогда
			Возврат Ложь;
		КонецЕсли;                        
	Иначе
		Возврат Ложь;
	КонецЕсли;	

	Отбор.Вставить("ВидПеречня", Перечисления.ЛБ_ВидыПеречней.ООН);
	Строки = ТаблицаЗапроса.НайтиСтроки(Отбор); 
	Если НЕ Строки.Количество() = 0 Тогда
		Выборка = Строки.Получить(0);
		Если Выборка.Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен Тогда 
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;  
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
//-Мельников

&НаСервереБезКонтекста
Функция СформироватьПредставлениеВремени(ВидВремени, Часов, Территория) Экспорт
	Рез = "";
	Если ЗначениеЗаполнено(ВидВремени) Тогда
		Если ВидВремени = Справочники.ЛБ_ВидыИспользованияРабочегоВремени.Явка Тогда
			Если Часов > 0 Тогда
				Рез = СокрЛП(Часов);
			КонецЕсли;
		Иначе
			Рез = СокрЛП(ВидВремени.БуквенныйКод);
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Территория) Тогда
			Рез = Рез +" "+"л"+СокрЛП(Территория.НомерЛомбарда);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Рез;	
КонецФункции

&НаСервере
Процедура ЗаписатьПротоколРаботы_Выход() Экспорт
	Если ЗначениеЗаполнено(ПараметрыСеанса.ТекущийСотрудник) и ЗначениеЗаполнено(ПараметрыСеанса.ТекущийЛомбард) Тогда
		МенеджерЗаписи = РегистрыСведений.ЛБ_ПротоколРаботы.СоздатьМенеджерЗаписи(); 
		МенеджерЗаписи.Сотрудник 	= ПараметрыСеанса.ТекущийСотрудник; 
		МенеджерЗаписи.Дата 		= ТекущаяДата(); 
		МенеджерЗаписи.Ломбард 		= ПараметрыСеанса.ТекущийЛомбард; 
		МенеджерЗаписи.Действие 	= Перечисления.ЛБ_ДействияПользователя.Выход;
		МенеджерЗаписи.Записать(); 		
	КонецЕсли;
КонецПроцедуры


Процедура ЛБ_ПеревестиПриказВАрхив(Источник, Отказ, РежимПроведения) Экспорт
	а = 0;
	
	
	
КонецПроцедуры

&НаСервере
Функция СотрудникЯвляетсяНачальникомОтделения(Сотрудник, НаДату) Экспорт
	Если ЗначениеЗаполнено(Сотрудник.Должность) и Сотрудник.Должность.ЯвляетсяНачальникомОтделения Тогда
		Возврат Истина;
	КонецЕсли;
	// Проверим в совмещениях
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ЗаместителиСрезПоследних.СотрудникКогоЗамещают КАК СотрудникКогоЗамещают
	               |ИЗ
	               |	РегистрСведений.ЛБ_Заместители.СрезПоследних(
	               |			&НаДату,
	               |			Заместитель = &Сотрудник
	               |				И ОкончаниеЗамещения >= &НаДату) КАК ЛБ_ЗаместителиСрезПоследних";
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("НаДату", НаДату);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Если ЗначениеЗаполнено(Выборка.СотрудникКогоЗамещают) и Выборка.СотрудникКогоЗамещают.Должность.ЯвляетсяНачальникомОтделения Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция СотрудникЯвляетсяНачальникомОтделенияБезСовмещения(Сотрудник, НаДату) Экспорт
	Если ЗначениеЗаполнено(Сотрудник.Должность) и Сотрудник.Должность.ЯвляетсяНачальникомОтделения Тогда
		Возврат Истина;
	КонецЕсли;
		
	Возврат Ложь;
	
КонецФункции


//+МАН 24.10.25 Проверка по перечням
#Область ПроверкаПоПеречням

&НаСервере                                                        
Функция ПроверитьКлиентаПоПеречням(Залогодатель) Экспорт
	//РезультатПроверки = Ложь; 
	РезультатПроверки = Новый Структура("Совпадение, Текст, ВидСовпадения", Ложь, "", "Полное");
	
	СовпадениеИНН = Ложь;
	
	Дата =ТекущаяДата();
	
	СписокПеречней = Новый СписокЗначений;
	СписокПеречней.Добавить(Перечисления.ЛБ_ВидыПеречней.Террористы);  
	СписокПеречней.Добавить(Перечисления.ЛБ_ВидыПеречней.ФРОМУ);
	СписокПеречней.Добавить(Перечисления.ЛБ_ВидыПеречней.МВК);
	СписокПеречней.Добавить(Перечисления.ЛБ_ВидыПеречней.ООН);
	
	СтруктураЗалогодатель = Новый Структура("Наименование, НаименованиеЛат, ТехническоеНаименование, ДатаРождения, ЮридическоеФизическоеЛицо, ИНН, ТаблицаДокументов");

	ТекстТеррорист = "Клиент найден в перечне террористов. Операции с клиентом запрещены!";
	ТекстФРОМУ = "Клиент найден в перечне ФРОМУ. Операции с клиентом запрещены!";
	ТекстМВК = "Клиент найден в списке МВК. Операции с клиентом запрещены!";
	ТекстООН = "Клиент найден в перечне ООН. Операции с клиентом запрещены!";
	
	ТекстИНН = "Совпал ИНН";
 	ТекстФИО = "Совадение по ФИО, ";
	ТекстФИОЛат = "Совадение по ФИО в латинском написании, ";
	ТекстФИОТех = "Совадение по ФИО в равнозначном написании, ";
	ТекстФИОДр = "Совадение по ФИО другие наименования, ";
	ТекстФИОДрЛат = "Совадение по ФИО другие наименования в латинском написании, ";
	ТекстФИОДрТех = "Совадение по ФИО другие наименования в равнозначном написании, ";
	
	//ТекстДокТеррорист = "Документ клиента найден в перечне террористов. Операции с клиентом запрещены!";
	//ТекстДокФРОМУ = "Документ клиента найден в перечне ФРОМУ. Операции с клиентом запрещены!";
	//ТекстДокМВК = "Документ клиента найден в списке МВК. Операции с клиентом запрещены!";
	//ТекстДокООН = "Документ клиента найден в перечне ООН. Операции с клиентом запрещены!";
	
	ТекстДок = "Документ клиента найден в перечне. Операции с клиентом запрещены!";
	ТекстЧастьФИДР = "Частичное совпадение по Фамилии, Имени и дате рождения";
	ТекстЧастьФОДР = "Частичное совпадение по Фамилии, Отчеству и дате рождения";
	ТекстЧастьИОДР = "Частичное совпадение по Имени, Отчеству и дате рождения";
	ТекстЧастьДрНаимФИДР = "Частичное совпадение по другим наименованиям Фамилии, Имени и дате рождения";
	ТекстЧастьДрНаимФОДР = "Частичное совпадение по другим наименованиям Фамилии, Отчеству и дате рождения";
	ТекстЧастьДрНаимИОДР = "Частичное совпадение по другим наименованиям Имени, Отчеству и дате рождения";
	ТекстТребуетпроверки = "Было частичное совпадение. Проверка еще не выполнена";
	ТекстЗапрещено = "После проверки частичного совпадения залогодателю выставлен запрет";

	ШаблонСтроки = "%1|%2|%3|%4|%5"; //Перечень наименований или других наименований, Кто, ИД, ДатаРождения, Вид перечня
	
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КлиентыВПеречняхСрезПоследних.ВидПеречня КАК ВидПеречня,
	               |	ЛБ_КлиентыВПеречняхСрезПоследних.СтатусКлиентаВПеречне КАК СтатусКлиентаВПеречне,
	               |	ЛБ_КлиентыВПеречняхСрезПоследних.Период КАК Период
	               |ИЗ
	               |	РегистрСведений.ЛБ_КлиентыВПеречнях.СрезПоследних(
	               |			&Дата,
	               |			Залогодатель = &Клиент
	               |				И ВидПеречня В (&ВидПеречня)) КАК ЛБ_КлиентыВПеречняхСрезПоследних
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_КлиентыВПеречняхСрезПоследних.Период,
	               |	ЛБ_КлиентыВПеречняхСрезПоследних.ВидПеречня,
	               |	ЛБ_КлиентыВПеречняхСрезПоследних.СтатусКлиентаВПеречне
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ"; 

	Запрос.УстановитьПараметр("Клиент", Залогодатель);  
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ВидПеречня", СписокПеречней);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда     
		Если Выборка.СтатусКлиентаВПеречне = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен Тогда
			Если Выборка.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.Террористы Тогда
				Сообщить(ТекстТеррорист, СтатусСообщения.Важное);
				
				РезультатПроверки.Текст = ТекстТеррорист;
				РезультатПроверки.Совпадение = Истина;
			ИначеЕсли Выборка.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ФРОМУ Тогда
				Сообщить(ТекстФРОМУ, СтатусСообщения.Важное);
				
				РезультатПроверки.Текст = ТекстФРОМУ;
				РезультатПроверки.Совпадение = Истина;
			ИначеЕсли Выборка.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.МВК Тогда
				Сообщить(ТекстМВК, СтатусСообщения.Важное);

				РезультатПроверки.Текст = ТекстМВК;
				РезультатПроверки.Совпадение = Истина;
			ИначеЕсли Выборка.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ООН Тогда
				Сообщить(ТекстООН, СтатусСообщения.Важное);
				
				РезультатПроверки.Текст = ТекстООН;
				РезультатПроверки.Совпадение = Истина;	
			КонецЕсли;	  
		КонецЕсли;	
	КонецЕсли;     
	
	Если РезультатПроверки.Совпадение Тогда
		Возврат РезультатПроверки;
		//Возврат НЕ РезультатПроверки.Совпадение;
	КонецЕсли;
	
	Если НЕ РезультатПроверки.Совпадение Тогда
		Запрос.Текст = "ВЫБРАТЬ
			|	ЛБ_Залогодатели.Ссылка КАК Клиент,
			|	ЛБ_Залогодатели.Наименование КАК Наименование,
			|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
			|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
			|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество,
			|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
			|	ЛБ_АнкетаЗалогодателяСрезПоследних.ИНН КАК ИНН,
			|	ЛБ_АнкетаЗалогодателяСрезПоследних.ТипФизЛица КАК ЮридическоеФизическоеЛицо,
			|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
			|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия_А КАК Фамилия_А,
			|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя_А КАК Имя_А,
			|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество_А КАК Отчество_А
			|ИЗ
			|	Справочник.ЛБ_Залогодатели КАК ЛБ_Залогодатели
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних
			|		ПО (ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Залогодатель = ЛБ_Залогодатели.Ссылка)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_АнкетаЗалогодателя.СрезПоследних КАК ЛБ_АнкетаЗалогодателяСрезПоследних
			|		ПО (ЛБ_АнкетаЗалогодателяСрезПоследних.Залогодатель = ЛБ_Залогодатели.Ссылка)
			|ГДЕ
			|	ЛБ_Залогодатели.Ссылка = &Клиент";
		
		ВыборкаЗалогодатель = Запрос.Выполнить().Выбрать();
		
		Если ВыборкаЗалогодатель.Следующий() Тогда
			Если ЗначениеЗаполнено(ВыборкаЗалогодатель.ИНН) Тогда
				//СовпадениеИНН = ПроверитьИНН(ВыборкаЗалогодатель.ИНН, СписокПеречней);
				СтруктураПроверкиИНН = ПроверитьИНН(ВыборкаЗалогодатель.ИНН, СписокПеречней);
				
				//Если СовпадениеИНН Тогда
				Если СтруктураПроверкиИНН.Совпадение Тогда
					Сообщить(ТекстИНН);
					
					РезультатПроверки.Текст = ТекстИНН;
					РезультатПроверки.Совпадение = СтруктураПроверкиИНН.Совпадение;
					
					//+МАН 17.11.25
					ЗаписатьСовпадениеВРегистр(Залогодатель, СтруктураПроверкиИНН.Результат, Дата);
					//-МАН
					
					Возврат РезультатПроверки;
					//Возврат НЕ СовпадениеИНН;
				КонецЕсли;
			КонецЕсли;
			
			Запрос.Текст = "ВЫБРАТЬ
				|	ЛБ_ДокументыЗалогодателя.Владелец КАК Клиент,
				|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
				|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
				|	ЛБ_ДокументыЗалогодателя.Наименование КАК Наименование
				|ИЗ
				|	Справочник.ЛБ_ДокументыЗалогодателя КАК ЛБ_ДокументыЗалогодателя
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних КАК ЛБ_ДокументыЗалогодателейСрезПоследних
				|		ПО (ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя = ЛБ_ДокументыЗалогодателя.Ссылка)
				|ГДЕ
				|	ЛБ_ДокументыЗалогодателя.ВидДокументаЗалогодателя = &ВидДокументаЗалогодателя
				|	И ЛБ_ДокументыЗалогодателя.Владелец = &Клиент";
				
			Запрос.УстановитьПараметр("ВидДокументаЗалогодателя", Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность);
			
			ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
			
			СтруктураЗалогодатель.Наименование = ВРег(СокрЛП(Залогодатель.Наименование));
			НаименованиеЛат = СокрЛП(ВыборкаЗалогодатель.Фамилия_А) + ?(ПустаяСтрока(ВыборкаЗалогодатель.Имя_А), "", " " + СокрЛП(ВыборкаЗалогодатель.Имя_А)) + ?(ПустаяСтрока(ВыборкаЗалогодатель.Отчество_А), "", " " + СокрЛП(ВыборкаЗалогодатель.Отчество_А));
			СтруктураЗалогодатель.НаименованиеЛат = ВРег(НаименованиеЛат);
			СтруктураЗалогодатель.ТехническоеНаименование = ВРег(СокрЛП(Залогодатель.ТехническоеНаименование));
			СтруктураЗалогодатель.ДатаРождения = ВыборкаЗалогодатель.ДатаРождения;
			СтруктураЗалогодатель.ЮридическоеФизическоеЛицо = ВыборкаЗалогодатель.ЮридическоеФизическоеЛицо; 
			СтруктураЗалогодатель.ИНН = СокрЛП(ВыборкаЗалогодатель.ИНН);
			СтруктураЗалогодатель.ТаблицаДокументов = ТаблицаДокументов;
			
			ЗапросНежЛиц = Новый Запрос;
			ЗапросНежЛиц.Текст = ПолучитьТекстЗапроса("Наименование");
			
			ЗапросНежЛиц.УстановитьПараметр("Наименование", СтруктураЗалогодатель.Наименование);
			ЗапросНежЛиц.УстановитьПараметр("Дата", Дата);
			ЗапросНежЛиц.УстановитьПараметр("ВидПеречня", СписокПеречней);
			
			ВыборкаНаименование = ЗапросНежЛиц.Выполнить().Выбрать();
			
			Если ВыборкаНаименование.Следующий() Тогда
				Если ВыборкаНаименование.Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен Тогда
					РезультатПроверки = СравнитьДанныеКлиентов(СтруктураЗалогодатель, ВыборкаНаименование, СписокПеречней);
				КонецЕсли;
				
				Если РезультатПроверки.Совпадение Тогда
					Сообщить(ТекстФИО + РезультатПроверки.Текст);
					РезультатПроверки.Текст = ТекстФИО + РезультатПроверки.Текст;
					
					//+МАН 17.11.25
					ЗаписатьСовпадениеВРегистр(Залогодатель, ВыборкаНаименование, Дата);
					//-МАН
					
					Возврат РезультатПроверки;
					//Возврат НЕ РезультатПроверки.Совпадение;
				КонецЕсли;
			КонецЕсли;
			
			Если НЕ Пустаястрока(СтруктураЗалогодатель.НаименованиеЛат) Тогда
				
				ЗапросНежЛиц.Текст = ПолучитьТекстЗапроса("НаименованиеЛат");
				
				ЗапросНежЛиц.УстановитьПараметр("Наименование", СтруктураЗалогодатель.НаименованиеЛат);
				
				ВыборкаНаименованиеЛат = ЗапросНежЛиц.Выполнить().Выбрать();
				
				Если ВыборкаНаименованиеЛат.Следующий() Тогда
					Если ВыборкаНаименованиеЛат.Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен Тогда
						РезультатПроверки = СравнитьДанныеКлиентов(СтруктураЗалогодатель, ВыборкаНаименованиеЛат, СписокПеречней);
					КонецЕсли;
					
					Если РезультатПроверки.Совпадение Тогда
						Сообщить(ТекстФИОЛат + РезультатПроверки.Текст);
						РезультатПроверки.Текст = ТекстФИОЛат + РезультатПроверки.Текст;

						//+МАН 17.11.25
						ЗаписатьСовпадениеВРегистр(Залогодатель, ВыборкаНаименованиеЛат, Дата);
						//-МАН
						
						Возврат РезультатПроверки;
						//Возврат НЕ РезультатПроверки.Совпадение;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если НЕ Пустаястрока(СтруктураЗалогодатель.ТехническоеНаименование) Тогда
				
				ЗапросНежЛиц.Текст = ПолучитьТекстЗапроса("ТехническоеНаименование");
				
				ЗапросНежЛиц.УстановитьПараметр("Наименование", СтруктураЗалогодатель.ТехническоеНаименование);
				
				ВыборкаТехНаименование = ЗапросНежЛиц.Выполнить().Выбрать();
				
				Если ВыборкаТехНаименование.Следующий() Тогда
					Если ВыборкаТехНаименование.Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен Тогда
						РезультатПроверки = СравнитьДанныеКлиентов(СтруктураЗалогодатель, ВыборкаТехНаименование, СписокПеречней);
					КонецЕсли;
					
					Если РезультатПроверки.Совпадение Тогда
						Сообщить(ТекстФИОТех + РезультатПроверки.Текст);
						РезультатПроверки.Текст = ТекстФИОТех + РезультатПроверки.Текст;

						//+МАН 17.11.25
						ЗаписатьСовпадениеВРегистр(Залогодатель, ВыборкаТехНаименование, Дата);
						//-МАН
						
						Возврат РезультатПроверки;
						//Возврат НЕ РезультатПроверки.Совпадение;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;

			Запрос.Текст = ПолучитьТекстЗапросаДрНаименования("Наименование");
			
			Запрос.УстановитьПараметр("Наименование", СтруктураЗалогодатель.Наименование);
			
			ВыборкаДругиеНаименования = Запрос.Выполнить().Выбрать();
			
			Если ВыборкаДругиеНаименования.Следующий() Тогда
				
				ЗапросНежЛиц.Текст = ПолучитьТекстЗапроса("ИД");
				
				ЗапросНежЛиц.УстановитьПараметр("ИД", ВыборкаДругиеНаименования.ИД);
				
				ВыборкаНежЛиц = ЗапросНежЛиц.Выполнить().Выбрать();
				
				Если ВыборкаНежЛиц.Следующий() Тогда
					Если ВыборкаНежЛиц.Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен Тогда
						РезультатПроверки = СравнитьДанныеКлиентов(СтруктураЗалогодатель, ВыборкаНежЛиц, СписокПеречней);
					КонецЕсли;
				КонецЕсли;
				
				Если РезультатПроверки.Совпадение Тогда
					Сообщить(ТекстФИОДр + РезультатПроверки.Текст);
					РезультатПроверки.Текст = ТекстФИОДр + РезультатПроверки.Текст;

					//+МАН 17.11.25
					ЗаписатьСовпадениеВРегистр(Залогодатель, ВыборкаНежЛиц, Дата);
					//-МАН
						
					Возврат РезультатПроверки;
					//Возврат НЕ РезультатПроверки.Совпадение;
				КонецЕсли;
			КонецЕсли;
			
			Если НЕ Пустаястрока(СтруктураЗалогодатель.НаименованиеЛат) Тогда
				
				Запрос.УстановитьПараметр("Наименование", СтруктураЗалогодатель.НаименованиеЛат);
				
				ВыборкаДругиеНаименованияЛат = Запрос.Выполнить().Выбрать();
				
				Если ВыборкаДругиеНаименованияЛат.Следующий() Тогда
					
					ЗапросНежЛиц.Текст = ПолучитьТекстЗапроса("ИД");
					
					ЗапросНежЛиц.УстановитьПараметр("ИД", ВыборкаДругиеНаименованияЛат.ИД);
					
					ВыборкаНежЛиц = ЗапросНежЛиц.Выполнить().Выбрать();
					
					Если ВыборкаНежЛиц.Следующий() Тогда
						Если ВыборкаНежЛиц.Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен Тогда
							РезультатПроверки = СравнитьДанныеКлиентов(СтруктураЗалогодатель, ВыборкаНежЛиц, СписокПеречней);
						КонецЕсли;
					КонецЕсли;
					
					Если РезультатПроверки.Совпадение Тогда
						Сообщить(ТекстФИОДрЛат + РезультатПроверки.Текст);
						РезультатПроверки.Текст = ТекстФИОДрЛат + РезультатПроверки.Текст;

						//+МАН 17.11.25
						ЗаписатьСовпадениеВРегистр(Залогодатель, ВыборкаНежЛиц, Дата);
						//-МАН
						
						Возврат РезультатПроверки;
						//Возврат НЕ РезультатПроверки.Совпадение;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если НЕ Пустаястрока(СтруктураЗалогодатель.ТехническоеНаименование) Тогда
				
				Запрос.Текст = ПолучитьТекстЗапросаДрНаименования("ТехническоеНаименование");

				Запрос.УстановитьПараметр("Наименование", СтруктураЗалогодатель.ТехническоеНаименование);
				
				ВыборкаДругиеНаименованияТехНаименование = Запрос.Выполнить().Выбрать();
				
				Если ВыборкаДругиеНаименованияТехНаименование.Следующий() Тогда
					
					ЗапросНежЛиц.Текст = ПолучитьТекстЗапроса("ИД");
					
					ЗапросНежЛиц.УстановитьПараметр("ИД", ВыборкаДругиеНаименованияТехНаименование.ИД);
					
					ВыборкаНежЛиц = ЗапросНежЛиц.Выполнить().Выбрать();
					
					Если ВыборкаНежЛиц.Следующий() Тогда
						Если ВыборкаНежЛиц.Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен Тогда
							РезультатПроверки = СравнитьДанныеКлиентов(СтруктураЗалогодатель, ВыборкаНежЛиц, СписокПеречней);
						КонецЕсли;
					КонецЕсли;
					
					Если РезультатПроверки.Совпадение Тогда
						Сообщить(ТекстФИОДрТех + РезультатПроверки.Текст);
						РезультатПроверки.Текст = ТекстФИОДрТех + РезультатПроверки.Текст;
						
						//+МАН 17.11.25
						ЗаписатьСовпадениеВРегистр(Залогодатель, ВыборкаНежЛиц, Дата);
						//-МАН
						
						Возврат РезультатПроверки;
						//Возврат НЕ РезультатПроверки.Совпадение;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			//Частичная проверка
			Запрос.Текст = НайтиДокументыВПеречне("Документ");
			
			Для каждого СтрДок Из ТаблицаДокументов Цикл
				Запрос.УстановитьПараметр("ДокументНомер", СтрДок.ДокументНомер);
				Запрос.УстановитьПараметр("ДокументСерия", СтрДок.ДокументСерия);
				
				ДокументыВПеречне = Запрос.Выполнить().Выбрать();
				
				Если ДокументыВПеречне.Следующий() Тогда
					Если ДокументыВПеречне.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.Террористы Тогда
						//Сообщить(ТекстДокТеррорист, СтатусСообщения.Важное);  
						РезультатПроверки.Совпадение = Истина;
					ИначеЕсли ДокументыВПеречне.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ФРОМУ Тогда
						//Сообщить(ТекстДокФРОМУ, СтатусСообщения.Важное);  
						РезультатПроверки.Совпадение = Истина;
					ИначеЕсли ДокументыВПеречне.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.МВК Тогда
						//Сообщить(ТекстДокМВК, СтатусСообщения.Важное);  
						РезультатПроверки.Совпадение = Истина;
					ИначеЕсли ДокументыВПеречне.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ООН Тогда
						//Сообщить(ТекстДокООН, СтатусСообщения.Важное);  
						РезультатПроверки.Совпадение = Истина;	
					КонецЕсли;
				КонецЕсли;
				
				Если РезультатПроверки.Совпадение Тогда
					Сообщить(ТекстДок);
					РезультатПроверки.ВидСовпадения = "Документы";
					Возврат РезультатПроверки;
					//Возврат НЕ РезультатПроверки.Совпадение;
				КонецЕсли;
			КонецЦикла;

			Если ЗначениеЗаполнено(ВыборкаЗалогодатель.Фамилия) И ЗначениеЗаполнено(ВыборкаЗалогодатель.Имя) Тогда
				ЗапросНежЛиц.Текст = ПолучитьТекстЗапроса("ФИ");

				ЗапросНежЛиц.УстановитьПараметр("Фамилия", СокрЛП(ВыборкаЗалогодатель.Фамилия));
				ЗапросНежЛиц.УстановитьПараметр("Имя", СокрЛП(ВыборкаЗалогодатель.Имя));
				
				РезультатФИ = ЗапросНежЛиц.Выполнить().Выбрать();
				
				СовпадениеДатыРождения = Ложь;
				СтрокаСовпадения = "";
				
				Пока РезультатФИ.Следующий() Цикл

					РождениеСовпадает = ПроверкаДатыРождения(ВыборкаЗалогодатель.ДатаРождения, РезультатФИ.ДатаРождения, РезультатФИ.ГодРождения);
					
					Если НЕ СовпадениеДатыРождения И РождениеСовпадает Тогда
						СовпадениеДатыРождения = РождениеСовпадает;
					КонецЕсли;
					
					Если РождениеСовпадает Тогда
						ДатаГодРождения = ?(РезультатФИ.ДатаРождения <> Дата(1,1,1), РезультатФИ.ДатаРождения, ?(РезультатФИ.ГодРождения <> 0, РезультатФИ.ГодРождения, ""));
						
						Если ТипЗнч(ДатаГодРождения) = Тип("Дата") Тогда
							ДатаГодРождения = Формат(ДатаГодРождения, "ДФ=dd.MM.yyyy");
						КонецЕсли;
						
						Если СтрокаСовпадения <> "" Тогда
							СтрокаСовпадения = СтрокаСовпадения + ";";
						КонецЕсли;
						
						СформированаяСтрока = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтроки, "Наим", РезультатФИ.Наименование, РезультатФИ.ИД, ДатаГодРождения, РезультатФИ.ВидПеречня);
						СтрокаСовпадения = СтрокаСовпадения + СформированаяСтрока;
					КонецЕсли;
				КонецЦикла;
				
				Если СовпадениеДатыРождения Тогда

					СтруктураПроверки = НайтиЗаписьВРегистре(Дата, ВыборкаЗалогодатель.Клиент);
					
					РезультатПроверки.Совпадение = СовпадениеДатыРождения;
					РезультатПроверки.ВидСовпадения = "Частичное";
					РезультатПроверки.Текст = ТекстЧастьФИДР;
					
					Если (НЕ СтруктураПроверки.Запрещено ИЛИ НЕ СтруктураПроверки.ТребуетПроверки) И НЕ СтруктураПроверки.Разрешено Тогда
						
						Если СтруктураПроверки.ТребуетПроверки Тогда
							Сообщить(ТекстТребуетпроверки);
							
							Возврат РезультатПроверки;
							//Возврат НЕ РождениеСовпадает;
						КонецЕсли;
						
						Если СтруктураПроверки.Запрещено Тогда
							Сообщить(ТекстЗапрещено);
							
							Возврат РезультатПроверки;
							//Возврат НЕ РождениеСовпадает;
						КонецЕсли;
						
						Если СтруктураПроверки.Количество = 0 ИЛИ (СтруктураПроверки.Количество <> 0 И НЕ СтруктураПроверки.Запрещено И НЕ СтруктураПроверки.ТребуетПроверки И НЕ СтруктураПроверки.Разрешено) Тогда
							//ЗаписатьВРегистр(Дата, ВыборкаЗалогодатель.Клиент, Перечисления.ЛБ_ВидыЧастичныхСовпадений.ДрНаименованиеИОДР, Перечисления.ЛБ_ВидыПеречней.ПустаяСсылка(), СтрокаСовпадения, Истина);
							ЗаписатьВРегистр(Дата, ВыборкаЗалогодатель.Клиент, Перечисления.ЛБ_ВидыЧастичныхСовпадений.ФИДР, СтрокаСовпадения, Истина);
						КонецЕсли;
						
						Сообщить(ТекстЧастьФИДР);
						Возврат РезультатПроверки;
						//Возврат НЕ РождениеСовпадает;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;

			Если ЗначениеЗаполнено(ВыборкаЗалогодатель.Фамилия) И ЗначениеЗаполнено(ВыборкаЗалогодатель.Отчество) Тогда
				ЗапросНежЛиц.Текст = ПолучитьТекстЗапроса("ФО");

				ЗапросНежЛиц.УстановитьПараметр("Фамилия", СокрЛП(ВыборкаЗалогодатель.Фамилия));
				ЗапросНежЛиц.УстановитьПараметр("Отчество", СокрЛП(ВыборкаЗалогодатель.Отчество));
				
				РезультатФИ = ЗапросНежЛиц.Выполнить().Выбрать();
				
				СовпадениеДатыРождения = Ложь;
				СтрокаСовпадения = "";
				
				Пока РезультатФИ.Следующий() Цикл

					РождениеСовпадает = ПроверкаДатыРождения(ВыборкаЗалогодатель.ДатаРождения, РезультатФИ.ДатаРождения, РезультатФИ.ГодРождения);
					
					Если НЕ СовпадениеДатыРождения И РождениеСовпадает Тогда
						СовпадениеДатыРождения = РождениеСовпадает;
					КонецЕсли;
					
					Если РождениеСовпадает Тогда
						ДатаГодРождения = ?(РезультатФИ.ДатаРождения <> Дата(1,1,1), РезультатФИ.ДатаРождения, ?(РезультатФИ.ГодРождения <> 0, РезультатФИ.ГодРождения, ""));
						
						Если ТипЗнч(ДатаГодРождения) = Тип("Дата") Тогда
							ДатаГодРождения = Формат(ДатаГодРождения, "ДФ=dd.MM.yyyy");
						КонецЕсли;
						
						Если СтрокаСовпадения <> "" Тогда
							СтрокаСовпадения = СтрокаСовпадения + ";";
						КонецЕсли;
						
						СформированаяСтрока = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтроки, "Наим", РезультатФИ.Наименование, РезультатФИ.ИД, ДатаГодРождения, РезультатФИ.ВидПеречня);
						СтрокаСовпадения = СтрокаСовпадения + СформированаяСтрока;
					КонецЕсли;
				КонецЦикла;
				
				Если СовпадениеДатыРождения Тогда

					СтруктураПроверки = НайтиЗаписьВРегистре(Дата, ВыборкаЗалогодатель.Клиент);
					
					РезультатПроверки.Совпадение = СовпадениеДатыРождения;
					РезультатПроверки.ВидСовпадения = "Частичное";
					РезультатПроверки.Текст = ТекстЧастьФОДР;
					
					Если (НЕ СтруктураПроверки.Запрещено ИЛИ НЕ СтруктураПроверки.ТребуетПроверки) И НЕ СтруктураПроверки.Разрешено Тогда
						
						Если СтруктураПроверки.ТребуетПроверки Тогда
							Сообщить(ТекстТребуетпроверки);
							
							Возврат РезультатПроверки;
							//Возврат НЕ РождениеСовпадает;
						КонецЕсли;
						
						Если СтруктураПроверки.Запрещено Тогда
							Сообщить(ТекстЗапрещено);
							
							Возврат РезультатПроверки;
							//Возврат НЕ РождениеСовпадает;
						КонецЕсли;
						
						Если СтруктураПроверки.Количество = 0 ИЛИ (СтруктураПроверки.Количество <> 0 И НЕ СтруктураПроверки.Запрещено И НЕ СтруктураПроверки.ТребуетПроверки И НЕ СтруктураПроверки.Разрешено) Тогда
							//ЗаписатьВРегистр(Дата, ВыборкаЗалогодатель.Клиент, Перечисления.ЛБ_ВидыЧастичныхСовпадений.ДрНаименованиеИОДР, Перечисления.ЛБ_ВидыПеречней.ПустаяСсылка(), СтрокаСовпадения, Истина);
							ЗаписатьВРегистр(Дата, ВыборкаЗалогодатель.Клиент, Перечисления.ЛБ_ВидыЧастичныхСовпадений.ФОДР, СтрокаСовпадения, Истина);
						КонецЕсли;
						
						Сообщить(ТекстЧастьФОДР);
						Возврат РезультатПроверки;
						//Возврат НЕ РождениеСовпадает;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;

			Если ЗначениеЗаполнено(ВыборкаЗалогодатель.Имя) И ЗначениеЗаполнено(ВыборкаЗалогодатель.Отчество) Тогда
				ЗапросНежЛиц.Текст = ПолучитьТекстЗапроса("ИО");

				ЗапросНежЛиц.УстановитьПараметр("Имя", СокрЛП(ВыборкаЗалогодатель.Имя));
				ЗапросНежЛиц.УстановитьПараметр("Отчество", СокрЛП(ВыборкаЗалогодатель.Отчество));
				
				РезультатФИ = ЗапросНежЛиц.Выполнить().Выбрать();
				
				СовпадениеДатыРождения = Ложь;
				СтрокаСовпадения = "";
				
				Пока РезультатФИ.Следующий() Цикл

					РождениеСовпадает = ПроверкаДатыРождения(ВыборкаЗалогодатель.ДатаРождения, РезультатФИ.ДатаРождения, РезультатФИ.ГодРождения);
					
					Если НЕ СовпадениеДатыРождения И РождениеСовпадает Тогда
						СовпадениеДатыРождения = РождениеСовпадает;
					КонецЕсли;
					
					Если РождениеСовпадает Тогда
						ДатаГодРождения = ?(РезультатФИ.ДатаРождения <> Дата(1,1,1), РезультатФИ.ДатаРождения, ?(РезультатФИ.ГодРождения <> 0, РезультатФИ.ГодРождения, ""));
						
						Если ТипЗнч(ДатаГодРождения) = Тип("Дата") Тогда
							ДатаГодРождения = Формат(ДатаГодРождения, "ДФ=dd.MM.yyyy");
						КонецЕсли;
						
						Если СтрокаСовпадения <> "" Тогда
							СтрокаСовпадения = СтрокаСовпадения + ";";
						КонецЕсли;
						
						СформированаяСтрока = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтроки, "Наим", РезультатФИ.Наименование, РезультатФИ.ИД, ДатаГодРождения, РезультатФИ.ВидПеречня);
						СтрокаСовпадения = СтрокаСовпадения + СформированаяСтрока;
					КонецЕсли;
				КонецЦикла;
				
				Если СовпадениеДатыРождения Тогда

					СтруктураПроверки = НайтиЗаписьВРегистре(Дата, ВыборкаЗалогодатель.Клиент);
					
					РезультатПроверки.Совпадение = СовпадениеДатыРождения;
					РезультатПроверки.ВидСовпадения = "Частичное";
					РезультатПроверки.Текст = ТекстЧастьИОДР;
					
					Если (НЕ СтруктураПроверки.Запрещено ИЛИ НЕ СтруктураПроверки.ТребуетПроверки) И НЕ СтруктураПроверки.Разрешено Тогда
						
						Если СтруктураПроверки.ТребуетПроверки Тогда
							Сообщить(ТекстТребуетпроверки);
							
							Возврат РезультатПроверки;
							//Возврат НЕ РождениеСовпадает;
						КонецЕсли;
						
						Если СтруктураПроверки.Запрещено Тогда
							Сообщить(ТекстЗапрещено);
							
							Возврат РезультатПроверки;
							//Возврат НЕ РождениеСовпадает;
						КонецЕсли;
						
						Если СтруктураПроверки.Количество = 0 ИЛИ (СтруктураПроверки.Количество <> 0 И НЕ СтруктураПроверки.Запрещено И НЕ СтруктураПроверки.ТребуетПроверки И НЕ СтруктураПроверки.Разрешено) Тогда
							//ЗаписатьВРегистр(Дата, ВыборкаЗалогодатель.Клиент, Перечисления.ЛБ_ВидыЧастичныхСовпадений.ДрНаименованиеИОДР, Перечисления.ЛБ_ВидыПеречней.ПустаяСсылка(), СтрокаСовпадения, Истина);
							ЗаписатьВРегистр(Дата, ВыборкаЗалогодатель.Клиент, Перечисления.ЛБ_ВидыЧастичныхСовпадений.ИОДР, СтрокаСовпадения, Истина);
						КонецЕсли;
						
						Сообщить(ТекстЧастьИОДР);
						Возврат РезультатПроверки;
						//Возврат НЕ РождениеСовпадает;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВыборкаЗалогодатель.Фамилия) И ЗначениеЗаполнено(ВыборкаЗалогодатель.Имя) Тогда
				ЗапросНежЛиц.Текст = ПолучитьТекстЗапросаДрНаименования("ФИ");

				ЗапросНежЛиц.УстановитьПараметр("Фамилия", СокрЛП(ВыборкаЗалогодатель.Фамилия));
				ЗапросНежЛиц.УстановитьПараметр("Имя", СокрЛП(ВыборкаЗалогодатель.Имя));
				
				РезультатФИ = ЗапросНежЛиц.Выполнить().Выбрать();
				
				СовпадениеДатыРождения = Ложь;
				СтрокаСовпадения = "";
				
				Пока РезультатФИ.Следующий() Цикл

					РождениеСовпадает = ПроверкаДатыРождения(ВыборкаЗалогодатель.ДатаРождения, РезультатФИ.ДатаРождения, РезультатФИ.ГодРождения);
					
					Если НЕ СовпадениеДатыРождения И РождениеСовпадает Тогда
						СовпадениеДатыРождения = РождениеСовпадает;
					КонецЕсли;
					
					Если РождениеСовпадает Тогда
						ДатаГодРождения = ?(РезультатФИ.ДатаРождения <> Дата(1,1,1), РезультатФИ.ДатаРождения, ?(РезультатФИ.ГодРождения <> 0, РезультатФИ.ГодРождения, ""));
						
						Если ТипЗнч(ДатаГодРождения) = Тип("Дата") Тогда
							ДатаГодРождения = Формат(ДатаГодРождения, "ДФ=dd.MM.yyyy");
						КонецЕсли;
						
						Если СтрокаСовпадения <> "" Тогда
							СтрокаСовпадения = СтрокаСовпадения + ";";
						КонецЕсли;
						
						СформированаяСтрока = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтроки, "ДрНаим", РезультатФИ.Наименование, РезультатФИ.ИД, ДатаГодРождения, РезультатФИ.ВидПеречня);
						СтрокаСовпадения = СтрокаСовпадения + СформированаяСтрока;
					КонецЕсли;
				КонецЦикла;
				
				Если СовпадениеДатыРождения Тогда

					СтруктураПроверки = НайтиЗаписьВРегистре(Дата, ВыборкаЗалогодатель.Клиент);
					
					РезультатПроверки.Совпадение = СовпадениеДатыРождения;
					РезультатПроверки.ВидСовпадения = "Частичное";
					РезультатПроверки.Текст = ТекстЧастьДрНаимФИДР;
					
					Если (НЕ СтруктураПроверки.Запрещено ИЛИ НЕ СтруктураПроверки.ТребуетПроверки) И НЕ СтруктураПроверки.Разрешено Тогда
						
						Если СтруктураПроверки.ТребуетПроверки Тогда
							Сообщить(ТекстТребуетпроверки);
							
							Возврат РезультатПроверки;
							//Возврат НЕ РождениеСовпадает;
						КонецЕсли;
						
						Если СтруктураПроверки.Запрещено Тогда
							Сообщить(ТекстЗапрещено);
							
							Возврат РезультатПроверки;
							//Возврат НЕ РождениеСовпадает;
						КонецЕсли;
						
						Если СтруктураПроверки.Количество = 0 ИЛИ (СтруктураПроверки.Количество <> 0 И НЕ СтруктураПроверки.Запрещено И НЕ СтруктураПроверки.ТребуетПроверки И НЕ СтруктураПроверки.Разрешено) Тогда
							//ЗаписатьВРегистр(Дата, ВыборкаЗалогодатель.Клиент, Перечисления.ЛБ_ВидыЧастичныхСовпадений.ДрНаименованиеИОДР, Перечисления.ЛБ_ВидыПеречней.ПустаяСсылка(), СтрокаСовпадения, Истина);
							ЗаписатьВРегистр(Дата, ВыборкаЗалогодатель.Клиент, Перечисления.ЛБ_ВидыЧастичныхСовпадений.ДрНаименованиеФИДР, СтрокаСовпадения, Истина);
						КонецЕсли;
						
						Сообщить(ТекстЧастьДрНаимФИДР);
						Возврат РезультатПроверки;
						//Возврат НЕ РождениеСовпадает;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;

			Если ЗначениеЗаполнено(ВыборкаЗалогодатель.Фамилия) И ЗначениеЗаполнено(ВыборкаЗалогодатель.Отчество) Тогда
				ЗапросНежЛиц.Текст = ПолучитьТекстЗапросаДрНаименования("ФО");

				ЗапросНежЛиц.УстановитьПараметр("Фамилия", СокрЛП(ВыборкаЗалогодатель.Фамилия));
				ЗапросНежЛиц.УстановитьПараметр("Отчество", СокрЛП(ВыборкаЗалогодатель.Отчество));
				
				РезультатФИ = ЗапросНежЛиц.Выполнить().Выбрать();
				
				СовпадениеДатыРождения = Ложь;
				СтрокаСовпадения = "";
				
				Пока РезультатФИ.Следующий() Цикл

					РождениеСовпадает = ПроверкаДатыРождения(ВыборкаЗалогодатель.ДатаРождения, РезультатФИ.ДатаРождения, РезультатФИ.ГодРождения);
					
					Если НЕ СовпадениеДатыРождения И РождениеСовпадает Тогда
						СовпадениеДатыРождения = РождениеСовпадает;
					КонецЕсли;
					
					Если РождениеСовпадает Тогда
						ДатаГодРождения = ?(РезультатФИ.ДатаРождения <> Дата(1,1,1), РезультатФИ.ДатаРождения, ?(РезультатФИ.ГодРождения <> 0, РезультатФИ.ГодРождения, ""));
						
						Если ТипЗнч(ДатаГодРождения) = Тип("Дата") Тогда
							ДатаГодРождения = Формат(ДатаГодРождения, "ДФ=dd.MM.yyyy");
						КонецЕсли;
						
						Если СтрокаСовпадения <> "" Тогда
							СтрокаСовпадения = СтрокаСовпадения + ";";
						КонецЕсли;
						
						СформированаяСтрока = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтроки, "ДрНаим", РезультатФИ.Наименование, РезультатФИ.ИД, ДатаГодРождения, РезультатФИ.ВидПеречня);
						СтрокаСовпадения = СтрокаСовпадения + СформированаяСтрока;
					КонецЕсли;
				КонецЦикла;
				
				Если СовпадениеДатыРождения Тогда

					СтруктураПроверки = НайтиЗаписьВРегистре(Дата, ВыборкаЗалогодатель.Клиент);
					
					РезультатПроверки.Совпадение = СовпадениеДатыРождения;
					РезультатПроверки.ВидСовпадения = "Частичное";
					РезультатПроверки.Текст = ТекстЧастьДрНаимФОДР;
					
					Если (НЕ СтруктураПроверки.Запрещено ИЛИ НЕ СтруктураПроверки.ТребуетПроверки) И НЕ СтруктураПроверки.Разрешено Тогда
						
						Если СтруктураПроверки.ТребуетПроверки Тогда
							Сообщить(ТекстТребуетпроверки);
							
							Возврат РезультатПроверки;
							//Возврат НЕ РождениеСовпадает;
						КонецЕсли;
						
						Если СтруктураПроверки.Запрещено Тогда
							Сообщить(ТекстЗапрещено);
							
							Возврат РезультатПроверки;
							//Возврат НЕ РождениеСовпадает;
						КонецЕсли;
						
						Если СтруктураПроверки.Количество = 0 ИЛИ (СтруктураПроверки.Количество <> 0 И НЕ СтруктураПроверки.Запрещено И НЕ СтруктураПроверки.ТребуетПроверки И НЕ СтруктураПроверки.Разрешено) Тогда
							//ЗаписатьВРегистр(Дата, ВыборкаЗалогодатель.Клиент, Перечисления.ЛБ_ВидыЧастичныхСовпадений.ДрНаименованиеИОДР, Перечисления.ЛБ_ВидыПеречней.ПустаяСсылка(), СтрокаСовпадения, Истина);
							ЗаписатьВРегистр(Дата, ВыборкаЗалогодатель.Клиент, Перечисления.ЛБ_ВидыЧастичныхСовпадений.ДрНаименованиеФОДР, СтрокаСовпадения, Истина);
						КонецЕсли;
						
						Сообщить(ТекстЧастьДрНаимФОДР);
						Возврат РезультатПроверки;
						//Возврат НЕ РождениеСовпадает;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;

			Если ЗначениеЗаполнено(ВыборкаЗалогодатель.Имя) И ЗначениеЗаполнено(ВыборкаЗалогодатель.Отчество) Тогда
				ЗапросНежЛиц.Текст = ПолучитьТекстЗапросаДрНаименования("ИО");

				ЗапросНежЛиц.УстановитьПараметр("Имя", СокрЛП(ВыборкаЗалогодатель.Имя));
				ЗапросНежЛиц.УстановитьПараметр("Отчество", СокрЛП(ВыборкаЗалогодатель.Отчество));
				
				РезультатФИ = ЗапросНежЛиц.Выполнить().Выбрать();
				
				СовпадениеДатыРождения = Ложь;
				СтрокаСовпадения = "";
				
				Пока РезультатФИ.Следующий() Цикл

					РождениеСовпадает = ПроверкаДатыРождения(ВыборкаЗалогодатель.ДатаРождения, РезультатФИ.ДатаРождения, РезультатФИ.ГодРождения);
					
					Если НЕ СовпадениеДатыРождения И РождениеСовпадает Тогда
						СовпадениеДатыРождения = РождениеСовпадает;
					КонецЕсли;
					
					Если РождениеСовпадает Тогда
						ДатаГодРождения = ?(РезультатФИ.ДатаРождения <> Дата(1,1,1), РезультатФИ.ДатаРождения, ?(РезультатФИ.ГодРождения <> 0, РезультатФИ.ГодРождения, ""));
						
						Если ТипЗнч(ДатаГодРождения) = Тип("Дата") Тогда
							ДатаГодРождения = Формат(ДатаГодРождения, "ДФ=dd.MM.yyyy");
						КонецЕсли;
						
						Если СтрокаСовпадения <> "" Тогда
							СтрокаСовпадения = СтрокаСовпадения + ";";
						КонецЕсли;
						
						СформированаяСтрока = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтроки, "ДрНаим", РезультатФИ.Наименование, РезультатФИ.ИД, ДатаГодРождения, РезультатФИ.ВидПеречня);
						СтрокаСовпадения = СтрокаСовпадения + СформированаяСтрока;
					КонецЕсли;
				КонецЦикла;
				
				Если СовпадениеДатыРождения Тогда

					СтруктураПроверки = НайтиЗаписьВРегистре(Дата, ВыборкаЗалогодатель.Клиент);
					
					РезультатПроверки.Совпадение = СовпадениеДатыРождения;
					РезультатПроверки.ВидСовпадения = "Частичное";
					РезультатПроверки.Текст = ТекстЧастьДрНаимИОДР;
					
					Если (НЕ СтруктураПроверки.Запрещено ИЛИ НЕ СтруктураПроверки.ТребуетПроверки) И НЕ СтруктураПроверки.Разрешено Тогда
						
						Если СтруктураПроверки.ТребуетПроверки Тогда
							Сообщить(ТекстТребуетпроверки);
							
							Возврат РезультатПроверки;
							//Возврат НЕ РождениеСовпадает;
						КонецЕсли;
						
						Если СтруктураПроверки.Запрещено Тогда
							Сообщить(ТекстЗапрещено);
							
							Возврат РезультатПроверки;
							//Возврат НЕ РождениеСовпадает;
						КонецЕсли;
						
						Если СтруктураПроверки.Количество = 0 ИЛИ (СтруктураПроверки.Количество <> 0 И НЕ СтруктураПроверки.Запрещено И НЕ СтруктураПроверки.ТребуетПроверки И НЕ СтруктураПроверки.Разрешено) Тогда
							//ЗаписатьВРегистр(Дата, ВыборкаЗалогодатель.Клиент, Перечисления.ЛБ_ВидыЧастичныхСовпадений.ДрНаименованиеИОДР, Перечисления.ЛБ_ВидыПеречней.ПустаяСсылка(), СтрокаСовпадения, Истина);
							ЗаписатьВРегистр(Дата, ВыборкаЗалогодатель.Клиент, Перечисления.ЛБ_ВидыЧастичныхСовпадений.ДрНаименованиеИОДР, СтрокаСовпадения, Истина);
						КонецЕсли;
						
						Сообщить(ТекстЧастьДрНаимИОДР);
						Возврат РезультатПроверки;
						//Возврат НЕ РождениеСовпадает;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	РезультатПроверки.Совпадение = Ложь;
	
	Возврат РезультатПроверки;
	//Возврат НЕ РезультатПроверки.Совпадение;
КонецФункции	

&НаСервере
Процедура ЗаписатьВРегистр(Дата, Залогодатель, ВидСовпадения, СтрокаСовпадения, ТребуетПроверки) Экспорт //ВидПеречня, 
	
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	Если ТекПользователь.ЭтоЛомбард Тогда   
		ТекЛомбард = ПараметрыСеанса.ТекущийЛомбард;
	Иначе
		ТекЛомбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис;
	КонецЕсли;	     
	
	НаборЗаписей = РегистрыСведений.ЛБ_ЧастичныеСовпаденияПоПеречням.СоздатьНаборЗаписей();
	НаваяЗапись = НаборЗаписей.Добавить();
	НаваяЗапись.Период = Дата;
	НаваяЗапись.Залогодатель = Залогодатель;
	НаваяЗапись.ВидСовпадения = ВидСовпадения;
	//НаваяЗапись.ВидПеречня = ВидПеречня;
	НаваяЗапись.Ломбард = ТекЛомбард;
	НаваяЗапись.ТребуетПроверки = ТребуетПроверки;
	НаваяЗапись.Разрешено = Ложь;
	НаваяЗапись.Запрещено = Ложь;
	НаваяЗапись.СотрудникОбнаружил = ПараметрыСеанса.ТекущийСотрудник;
	НаваяЗапись.Фамилия = Залогодатель.Фамилия;
	НаваяЗапись.Имя = Залогодатель.Имя;
	НаваяЗапись.Отчество = Залогодатель.Отчество;
	НаваяЗапись.СтрокаСовпадения = СтрокаСовпадения;
	
	НаборЗаписей.Записать(Ложь);
	
КонецПроцедуры

&НаСервере
Функция НайтиЗаписьВРегистре(Дата, Залогодатель) Экспорт
	
	СтруктураВозврата = Новый Структура("Количество, ТребуетПроверки, Запрещено, Разрешено", 0, Ложь, Ложь, Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛБ_ЧастичныеСовпаденияПоПеречнямСрезПоследних.Залогодатель КАК Залогодатель,
		|	ЛБ_ЧастичныеСовпаденияПоПеречнямСрезПоследних.ТребуетПроверки КАК ТребуетПроверки,
		|	ЛБ_ЧастичныеСовпаденияПоПеречнямСрезПоследних.Запрещено КАК Запрещено,
		|	ЛБ_ЧастичныеСовпаденияПоПеречнямСрезПоследних.Разрешено КАК Разрешено
		|ИЗ
		|	РегистрСведений.ЛБ_ЧастичныеСовпаденияПоПеречням.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_ЧастичныеСовпаденияПоПеречнямСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_ЧастичныеСовпаденияПоПеречнямСрезПоследних.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		СтруктураВозврата.Количество = РезультатЗапроса.Количество();
		СтруктураВозврата.ТребуетПроверки = РезультатЗапроса.ТребуетПроверки;
		СтруктураВозврата.Запрещено = РезультатЗапроса.Запрещено;
		СтруктураВозврата.Разрешено = РезультатЗапроса.Разрешено;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаСервере
Функция ПроверитьИНН(ИНН, СписокПеречней)
	Дата = ТекущаяДата();
	
	//+МАН 17.11.25
	СтруктураВозврата = Новый Структура("Совпадение, Результат", Ложь);
	//-МАН
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапроса("ИНН");
	
	Запрос.УстановитьПараметр("ИНН", ИНН);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ВидПеречня", СписокПеречней);
	
	РезультатИНН = Запрос.Выполнить().Выбрать();
	
	Если РезультатИНН.Следующий() Тогда
		//+МАН 17.11.25
		СтруктураВозврата.Совпадение = Истина;
		СтруктураВозврата.Результат = РезультатИНН;
		//-МАН
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
КонецФункции

&НаСервере
Функция СравнитьДанныеКлиентов(СтруктураЗалогодатель, СтрокаВыборки, СписокПеречней)
	
	РождениеСовпадает = Ложь;
	ДокументСовпадает = Ложь;
	ИННСовпадает = Ложь;
	
	Дата = ТекущаяДата();
	
	СтруктураВозврата = Новый Структура("Совпадение, Текст", Ложь, "");
	
	Если ЗначениеЗаполнено(СтруктураЗалогодатель.ДатаРождения) И СтруктураЗалогодатель.ТаблицаДокументов.Количество() > 0 Тогда
		
		РождениеСовпадает = ПроверкаДатыРождения(СтруктураЗалогодатель.ДатаРождения, СтрокаВыборки.ДатаРождения, СтрокаВыборки.ГодРождения);
		
		Запрос = Новый Запрос;
		Запрос.Текст = НайтиДокументыВПеречне("ИД");
		
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("ВидПеречня", СписокПеречней);
		Запрос.УстановитьПараметр("ИД", СтрокаВыборки.ИД);
		
		ТаблицаДокументовСубъекта = Запрос.Выполнить().Выгрузить();
		
		Для каждого СтрДок Из СтруктураЗалогодатель.ТаблицаДокументов Цикл
			Отбор = Новый Структура;
			Отбор.Вставить("ДокументНомер", СокрЛП(СтрДок.ДокументНомер));
			Отбор.Вставить("ДокументСерия", СокрЛП(СтрДок.ДокументСерия));
			СтрокиД = ТаблицаДокументовСубъекта.НайтиСтроки(Отбор);
			
			Если СтрокиД.Количество() <> 0 Тогда
				ДокументСовпадает = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если РождениеСовпадает И ДокументСовпадает Тогда
			СтруктураВозврата.Совпадение = Истина;
			СтруктураВозврата.Текст = "Дата рождения и ДУЛ";
			Возврат СтруктураВозврата;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураЗалогодатель.ДатаРождения) Тогда
		
		РождениеСовпадает = ПроверкаДатыРождения(СтруктураЗалогодатель.ДатаРождения, СтрокаВыборки.ДатаРождения, СтрокаВыборки.ГодРождения);
		
		Если РождениеСовпадает Тогда
			СтруктураВозврата.Совпадение = Истина;
			СтруктураВозврата.Текст = "Дата рождения";
			Возврат СтруктураВозврата;
		КонецЕсли;
	КонецЕсли;
	
	Если СтруктураЗалогодатель.ТаблицаДокументов.Количество() > 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = НайтиДокументыВПеречне("ИД");
		
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("ВидПеречня", СписокПеречней);
		Запрос.УстановитьПараметр("ИД", СтрокаВыборки.ИД);
		
		ТаблицаДокументовСубъекта = Запрос.Выполнить().Выгрузить();
		
		Для каждого СтрДок Из СтруктураЗалогодатель.ТаблицаДокументов Цикл
			Отбор = Новый Структура;
			Отбор.Вставить("ДокументНомер", СокрЛП(СтрДок.ДокументНомер));
			Отбор.Вставить("ДокументСерия", СокрЛП(СтрДок.ДокументСерия));
			СтрокиД = ТаблицаДокументовСубъекта.НайтиСтроки(Отбор);
			
			Если СтрокиД.Количество() <> 0 Тогда
				ДокументСовпадает = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ДокументСовпадает Тогда
			СтруктураВозврата.Совпадение = Истина;
			СтруктураВозврата.Текст = "ДУЛ";
			Возврат СтруктураВозврата;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
КонецФункции

&НаСервере
Функция ПроверкаДатыРождения(ДатаРождения, ДатаРожденияПеречень, ГодРождения)
	
	ДатаРождениеСовпадает = Ложь;
	ГодРождениеСовпадает = Ложь;
	
	Если НЕ ПустаяСтрока(ДатаРожденияПеречень) Тогда
		ДатаРождениеСовпадает = ДатаРождения = ДатаРожденияПеречень;
	ИначеЕсли НЕ ПустаяСтрока(ГодРождения) Тогда
		ГодРождениеСовпадает = Год(ДатаРождения) = ГодРождения;
	КонецЕсли;

	Возврат (ДатаРождениеСовпадает ИЛИ ГодРождениеСовпадает);
	
КонецФункции

&НаСервере
Функция ПолучитьТекстЗапроса(ПараметрЗапроса)

	Текст = "ВЫБРАТЬ
	|	ЛБ_ПереченьНежелательныхЛицСрезПоследних.ДатаПеречня КАК ДатаПеречня,
	|	ЛБ_ПереченьНежелательныхЛицСрезПоследних.ДатаВключенияВПеречень КАК ДатаВключенияВПеречень,
	|	ЛБ_ПереченьНежелательныхЛицСрезПоследних.ИД КАК ИД,
	|	ЛБ_ПереченьНежелательныхЛицСрезПоследних.Наименование КАК Наименование,
	|	ЛБ_ПереченьНежелательныхЛицСрезПоследних.НаименованиеЛат КАК НаименованиеЛат,
	|	ЛБ_ПереченьНежелательныхЛицСрезПоследних.ДатаРождения КАК ДатаРождения,
	|	ЛБ_ПереченьНежелательныхЛицСрезПоследних.ГодРождения КАК ГодРождения,
	|	ЛБ_ПереченьНежелательныхЛицСрезПоследних.ИНН КАК ИНН,
	|	ЛБ_ПереченьНежелательныхЛицСрезПоследних.ЮридическоеФизическоеЛицо КАК ЮридическоеФизическоеЛицо,
	|	ЛБ_ПереченьНежелательныхЛицСрезПоследних.Статус КАК Статус,
	|	ЛБ_ПереченьНежелательныхЛицСрезПоследних.ВидПеречня КАК ВидПеречня,
	|	ЛБ_ПереченьНежелательныхЛицСрезПоследних.КодОтказа КАК КодОтказа
	|ИЗ
	|	РегистрСведений.ЛБ_ПереченьНежелательныхЛиц.СрезПоследних(
	|			&Дата,
	|			ВидПеречня В (&ВидПеречня)";
	
	Если ПараметрЗапроса = "Наименование" Тогда
		Текст = Текст + Символы.ПС + "И Наименование = &Наименование) КАК ЛБ_ПереченьНежелательныхЛицСрезПоследних";
	ИначеЕсли ПараметрЗапроса = "НаименованиеЛат" Тогда
		Текст = Текст + Символы.ПС + "И НаименованиеЛат = &Наименование) КАК ЛБ_ПереченьНежелательныхЛицСрезПоследних";
	ИначеЕсли ПараметрЗапроса = "ТехническоеНаименование" Тогда
		Текст = Текст + Символы.ПС + "И ТехническоеНаименование = &Наименование) КАК ЛБ_ПереченьНежелательныхЛицСрезПоследних";
	ИначеЕсли ПараметрЗапроса = "ИД" Тогда
		Текст = Текст + Символы.ПС + "И ИД = &ИД) КАК ЛБ_ПереченьНежелательныхЛицСрезПоследних";
	ИначеЕсли ПараметрЗапроса = "ИНН" Тогда
		Текст = Текст + Символы.ПС + "И ИНН = &ИНН) КАК ЛБ_ПереченьНежелательныхЛицСрезПоследних";
	ИначеЕсли ПараметрЗапроса = "ФИ" Тогда
		Текст = Текст + Символы.ПС + "И Фамилия = &Фамилия
				|	И Имя = &Имя) КАК ЛБ_ПереченьНежелательныхЛицСрезПоследних";
	ИначеЕсли ПараметрЗапроса = "ФО" Тогда
		Текст = Текст + Символы.ПС + "И Фамилия = &Фамилия
				|	И Отчество = &Отчество) КАК ЛБ_ПереченьНежелательныхЛицСрезПоследних";
	ИначеЕсли ПараметрЗапроса = "ИО" Тогда
		Текст = Текст + Символы.ПС + "И Имя = &Имя
				|	И Отчество = &Отчество) КАК ЛБ_ПереченьНежелательныхЛицСрезПоследних";
	КонецЕсли;

	Текст = Текст + Символы.ПС + Символы.ПС + "СГРУППИРОВАТЬ ПО
				|	ЛБ_ПереченьНежелательныхЛицСрезПоследних.ДатаПеречня,
				|	ЛБ_ПереченьНежелательныхЛицСрезПоследних.ИД,
				|	ЛБ_ПереченьНежелательныхЛицСрезПоследних.ДатаВключенияВПеречень,
				|	ЛБ_ПереченьНежелательныхЛицСрезПоследних.Наименование,
				|	ЛБ_ПереченьНежелательныхЛицСрезПоследних.НаименованиеЛат,
				|	ЛБ_ПереченьНежелательныхЛицСрезПоследних.ДатаРождения,
				|	ЛБ_ПереченьНежелательныхЛицСрезПоследних.ГодРождения,
				|	ЛБ_ПереченьНежелательныхЛицСрезПоследних.ИНН,
				|	ЛБ_ПереченьНежелательныхЛицСрезПоследних.ЮридическоеФизическоеЛицо,
				|	ЛБ_ПереченьНежелательныхЛицСрезПоследних.Статус,
				|	ЛБ_ПереченьНежелательныхЛицСрезПоследних.ВидПеречня,
				|	ЛБ_ПереченьНежелательныхЛицСрезПоследних.КодОтказа
				|
				|УПОРЯДОЧИТЬ ПО
				|	ДатаПеречня УБЫВ";
	
	Возврат Текст;
КонецФункции

&НаСервере
Функция ПолучитьТекстЗапросаДрНаименования(ПараметрЗапроса)

	Текст = "ВЫБРАТЬ
	|	ЛБ_ПереченьНежелательныхЛицДрНаименованияСрезПоследних.ИД КАК ИД,
	|	ЛБ_ПереченьНежелательныхЛицДрНаименованияСрезПоследних.Наименование КАК Наименование,
	|	ЛБ_ПереченьНежелательныхЛицДрНаименованияСрезПоследних.ДатаРождения КАК ДатаРождения,
	|	ЛБ_ПереченьНежелательныхЛицДрНаименованияСрезПоследних.ГодРождения КАК ГодРождения,
	|	ЛБ_ПереченьНежелательныхЛицДрНаименованияСрезПоследних.ВидПеречня КАК ВидПеречня
	|ИЗ
	|	РегистрСведений.ЛБ_ПереченьНежелательныхЛицДрНаименования.СрезПоследних(
	|			&Дата,
	|			ВидПеречня В (&ВидПеречня)";
	
	Если ПараметрЗапроса = "Наименование" Тогда
		Текст = Текст + Символы.ПС + "И Наименование = &Наименование) КАК ЛБ_ПереченьНежелательныхЛицДрНаименованияСрезПоследних";
	ИначеЕсли ПараметрЗапроса = "ТехническоеНаименование" Тогда
		Текст = Текст + Символы.ПС + "И ТехническоеНаименование = &Наименование) КАК ЛБ_ПереченьНежелательныхЛицДрНаименованияСрезПоследних";
	ИначеЕсли ПараметрЗапроса = "ФИ" Тогда
		Текст = Текст + Символы.ПС + "И Фамилия = &Фамилия
				|	И Имя = &Имя) КАК ЛБ_ПереченьНежелательныхЛицДрНаименованияСрезПоследних";
	ИначеЕсли ПараметрЗапроса = "ФО" Тогда
		Текст = Текст + Символы.ПС + "И Фамилия = &Фамилия
				|	И Отчество = &Отчество) КАК ЛБ_ПереченьНежелательныхЛицДрНаименованияСрезПоследних";
	ИначеЕсли ПараметрЗапроса = "ИО" Тогда
		Текст = Текст + Символы.ПС + "И Имя = &Имя
				|	И Отчество = &Отчество) КАК ЛБ_ПереченьНежелательныхЛицДрНаименованияСрезПоследних";
	КонецЕсли;

	Текст = Текст + Символы.ПС + Символы.ПС + "СГРУППИРОВАТЬ ПО
				|	ЛБ_ПереченьНежелательныхЛицДрНаименованияСрезПоследних.ИД,
				|	ЛБ_ПереченьНежелательныхЛицДрНаименованияСрезПоследних.Наименование,
				|	ЛБ_ПереченьНежелательныхЛицДрНаименованияСрезПоследних.ДатаРождения,
				|	ЛБ_ПереченьНежелательныхЛицДрНаименованияСрезПоследних.ГодРождения,
				|	ЛБ_ПереченьНежелательныхЛицДрНаименованияСрезПоследних.ВидПеречня";
	
	Возврат Текст;
КонецФункции

&НаСервере
Функция НайтиДокументыВПеречне(ПараметрПоиска)
	Текст = "ВЫБРАТЬ
			|	ЛБ_ПереченьНежелательныхЛицДокументыСрезПоследних.ИД КАК ИД,
			|	ЛБ_ПереченьНежелательныхЛицДокументыСрезПоследних.ДокументНомер КАК ДокументНомер,
			|	ЛБ_ПереченьНежелательныхЛицДокументыСрезПоследних.ДокументСерия КАК ДокументСерия,
			|	ЛБ_ПереченьНежелательныхЛицДокументыСрезПоследних.ВидПеречня КАК ВидПеречня
			|ИЗ
			|	РегистрСведений.ЛБ_ПереченьНежелательныхЛицДокументы.СрезПоследних(&Дата, ВидПеречня В (&ВидПеречня)) КАК ЛБ_ПереченьНежелательныхЛицДокументыСрезПоследних";

	Если ПараметрПоиска = "Документ" Тогда
		Текст = Текст + Символы.ПС + "ГДЕ
			|	ЛБ_ПереченьНежелательныхЛицДокументыСрезПоследних.ДокументНомер = &ДокументНомер
			|	И ЛБ_ПереченьНежелательныхЛицДокументыСрезПоследних.ДокументСерия = &ДокументСерия";
	ИначеЕсли ПараметрПоиска = "ИД" Тогда
		Текст = Текст + Символы.ПС + "ГДЕ
			|	ЛБ_ПереченьНежелательныхЛицДокументыСрезПоследних.ИД = &ИД";
	КонецЕсли;
	
	Текст = Текст + Символы.ПС + Символы.ПС + "СГРУППИРОВАТЬ ПО
		|	ЛБ_ПереченьНежелательныхЛицДокументыСрезПоследних.ИД,
		|	ЛБ_ПереченьНежелательныхЛицДокументыСрезПоследних.ДокументНомер,
		|	ЛБ_ПереченьНежелательныхЛицДокументыСрезПоследних.ДокументСерия,
		|	ЛБ_ПереченьНежелательныхЛицДокументыСрезПоследних.ВидПеречня";

	Возврат Текст;
	
КонецФункции

&НаСервере
Процедура ЗаписатьСовпадениеВРегистр(Залогодатель, Результат, Дата)
	
	Рег = РегистрыСведений.ЛБ_КлиентыВПеречнях;
	НаборЗаписей = Рег.СоздатьНаборЗаписей();    
	НаборЗаписей.Отбор.ИД.Установить(Результат.ИД);
	НаборЗаписей.Отбор.Залогодатель.Установить(Залогодатель);
	НаборЗаписей.Отбор.ВидПеречня.Установить(Результат.ВидПеречня); 
	НаборЗаписей.Отбор.ДатаПеречня.Установить(Результат.ДатаПеречня);
	НаборЗаписей.Отбор.ВидПроверки.Установить(Перечисления.ЛБ_ВидыПроверкиПеречней.ПроверкаПоПеречню);
	
	НоваяЗапись = НаборЗаписей.Добавить();   
	НоваяЗапись.Период = Дата;         
	НоваяЗапись.ВидПроверки = Перечисления.ЛБ_ВидыПроверкиПеречней.ПроверкаПоПеречню;
	НоваяЗапись.ВидПеречня = Результат.ВидПеречня; 
	НоваяЗапись.ДатаПеречня = Результат.ДатаПеречня;
	НоваяЗапись.Залогодатель = Залогодатель;  
	НоваяЗапись.ИД = Результат.ИД;
	НоваяЗапись.СтатусКлиентаВПеречне = Результат.Статус;
	НоваяЗапись.ДатаВключенияВПеречень = Результат.ДатаВключенияВПеречень;
	
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	Если НЕ ТекПользователь.ЭтоЛомбард Тогда
		Ответственный = ТекПользователь.Сотрудник;
	Иначе
		Ответственный = ПараметрыСеанса.ТекущийСотрудник;
	КонецЕсли;	
	НоваяЗапись.Ответственный = Ответственный;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти
//-МАН

