
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОтборОЗ = 1; 
	//Элементы.ДекорацияПоиск.Заголовок = "Объект залога не определен";
	УстановитьДоступность();  
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступность() 
	//Если ОтборОЗ = 1 Тогда 
	//	Элементы.НомерЗБ.ТолькоПросмотр  = Истина;
	//	Элементы.Артикул.ТолькоПросмотр  = Ложь;
	//Иначе                  
	//	Элементы.Артикул.ТолькоПросмотр  = Истина; 
	//	Элементы.НомерЗБ.ТолькоПросмотр  = Ложь;
	//КонецЕсли;
	Если ОтборОЗ = 1 Тогда 
		Элементы.НомерЗБ.Доступность  = Ложь;
		Элементы.Артикул.Доступность = Истина;
	Иначе                  
		Элементы.НомерЗБ.Доступность  = Истина;
		Элементы.Артикул.Доступность = Ложь;
	КонецЕсли;	
КонецПроцедуры 

&НаСервере
Процедура УстановитьВидимость() 
	Если СписокАртикулов.Количество() = 0 Тогда 
		Элементы.ВыбратьАртикул.Видимость = ложь;
	Иначе                  
		Элементы.ВыбратьАртикул.Видимость = Истина;
	КонецЕсли;	
КонецПроцедуры 

&НаСервере
Функция ПолучитьДатуОтгрузки()  
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
	Запрос.УстановитьПараметр("ОбъектЗалога", ОбъектЗалога);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус КАК Статус,
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Период КАК ДатаНач
	               |ИЗ
	               |	РегистрСведений.ЛБ_СтатусыОбъектовЗалогаВНакладной.СрезПоследних(
	               |			,
	               |			ЗалоговыйБилет = &ЗалоговыйБилет
	               |				И ОбъектЗалога = &ОбъектЗалога) КАК ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаНач УБЫВ";
    Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		Если Выборка.Статус = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.Отгружено Тогда
			Возврат Выборка.ДатаНач;
		КонецЕсли;	
	КонецЕсли;	                    
	Возврат Дата(1,1,1);
КонецФункции   

&НаКлиенте
Процедура Сформировать(Команда)   
	Если ЗначениеЗаполнено(ЗалоговыйБилет) И ЗначениеЗаполнено(ОбъектЗалога) Тогда  
		Если ПолучитьДатуОтгрузки() = Дата(1,1,1) Тогда
			Предупреждение("Залоговый билет № " + СокрЛП(НомерЗБ) + " не был отгружен из ломбарда", 60);
	    Иначе	
			ПараметрыВыбора = Новый Структура;
			ПараметрыВыбора.Вставить("ЗалоговыйБилет", ЗалоговыйБилет);
			ПараметрыВыбора.Вставить("ОбъектЗалога", ОбъектЗалога);	 
	
	        ЭтаФорма.Закрыть(ПараметрыВыбора); 
		КонецЕсли;	
	Иначе 
		Предупреждение("Не определен объект залога для формирования отчета!", 60);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПриИзменении(Элемент)
	Артикул = "";
	НомерЗБ = "";
	ОбъектЗалога = ПредопределенноеЗначение("Справочник.ЛБ_ОбъектыЗалога.ПустаяСсылка"); 
	ЗалоговыйБилет = ПредопределенноеЗначение("Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка"); 
	СписокАртикулов.Очистить();
	УстановитьДоступность(); 
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Функция ЗаполнитьНомерЗБ() 
	Возврат ЗалоговыйБилет.НомерЗалоговогоБилета;
КонецФункции	

&НаКлиенте
Процедура АртикулОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка) 
	Артикул = Текст;
	Результат = ПолучитьИнформациюЗалогаПоАртикулу();
	Если НЕ Результат = неопределено Тогда
		ЗалоговыйБилет = Результат.ЗалоговыйБилет;
	    ОбъектЗалога = Результат.ОбъектЗалога;	
		НомерЗБ = ЗаполнитьНомерЗБ(); 
		//Элементы.ДекорацияПоиск.Заголовок = "Объект залога определен";
	Иначе      
		НомерЗБ = "";
		ОбъектЗалога = ПредопределенноеЗначение("Справочник.ЛБ_ОбъектыЗалога.ПустаяСсылка"); 
	    ЗалоговыйБилет = ПредопределенноеЗначение("Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка"); 
		//Элементы.ДекорацияПоиск.Заголовок = "Объект залога определен";
	КонецЕсли;	
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Функция ПолучитьЗБПоНомеру() 
	Возврат ЛБ_ОбщийМодуль.ПолучитьЗБПоНомеру(НомерЗБ);
КонецФункции 

&НаСервере
Процедура ПолучитьАртикулы() 
	СписокАртикулов.Очистить();
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокАртикулов.Добавить(СокрЛП(Выборка.Артикул));
	Конеццикла; 
	СписокАртикулов.СортироватьПоЗначению();
КонецПроцедуры	

&НаКлиенте
Процедура НомерЗБОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	НомерЗБ = Текст;   
	ЗалоговыйБилет = ПолучитьЗБПоНомеру(); 
	Если ЗначениеЗаполнено(ЗалоговыйБилет) Тогда 
		ПолучитьАртикулы(); 
		
		Если  СписокАртикулов.Количество() >  1 Тогда
			ВыбранноеЗначение = ВыбратьИзСписка(СписокАртикулов, Элементы.Артикул); 

			Если ВыбранноеЗначение <> Неопределено Тогда 
			   Артикул = ВыбранноеЗначение.Значение; 
			   Результат = ПолучитьИнформациюЗалогаПоАртикулу();
			   Если НЕ Результат = неопределено Тогда 
				   ОбъектЗалога = Результат.ОбъектЗалога;
			   КонецЕсли;	   
		   КонецЕсли;   
		   //Элементы.ДекорацияПоиск.Заголовок = "Объект залога определен";
	   ИначеЕсли  СписокАртикулов.Количество() =  1 Тогда  
		   Артикул = СписокАртикулов.Получить(0).Значение; 
		   Результат = ПолучитьИнформациюЗалогаПоАртикулу();
		   Если НЕ Результат = неопределено Тогда 
			   ОбъектЗалога = Результат.ОбъектЗалога;
		   КонецЕсли;	
		  //Элементы.ДекорацияПоиск.Заголовок = "Объект залога определен";
	   Иначе
		   //Элементы.ДекорацияПоиск.Заголовок = "Объект залога не определен";
       КонецЕсли;
    Иначе
	   Артикул = ""; 
	   ОбъектЗалога = ПредопределенноеЗначение("Справочник.ЛБ_ОбъектыЗалога.ПустаяСсылка"); 
	   ЗалоговыйБилет = ПредопределенноеЗначение("Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка");  
	   //Элементы.ДекорацияПоиск.Заголовок = "Объект залога не определен";
	   СписокАртикулов.Очистить();
   КонецЕсли;	  
   УстановитьВидимость();
КонецПроцедуры

&НаСервере
Функция ПолучитьИнформациюЗалогаПоАртикулу()
    Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Артикул", СокрЛП(Артикул));
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(, Артикул = &Артикул) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		СтруктураВ = Новый структура;
		СтруктураВ.Вставить("ЗалоговыйБилет", Выборка.ЗалоговыйБилет);
		СтруктураВ.Вставить("ОбъектЗалога", Выборка.ОбъектЗалога);
		Возврат СтруктураВ;
	КонецЕсли;
	Возврат неопределено;
КонецФункции

&НаКлиенте
Процедура ВыбратьАртикул(Команда)
	Если  СписокАртикулов.Количество() > 0 Тогда
		ВыбранноеЗначение = ВыбратьИзСписка(СписокАртикулов, Элементы.Артикул); 

		Если ВыбранноеЗначение <> Неопределено Тогда 
		   Артикул = ВыбранноеЗначение.Значение; 
		   Результат = ПолучитьИнформациюЗалогаПоАртикулу();
		   Если НЕ Результат = неопределено Тогда 
			   ОбъектЗалога = Результат.ОбъектЗалога;
		   КонецЕсли;	   
	   КонецЕсли;   
	КонецЕсли;   
КонецПроцедуры
