#Область ОписаниеПеременных

&НаКлиенте
Перем ИдентификаторЗамераПроведениеНеНужнаРегистрацияОшибки;

#КонецОбласти

#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура УстановитьСтатусДокумента()  
	Элементы.Номер.Доступность = Ложь;

	Если Объект.Контроль Тогда 
		ЭтаФорма.СтатусДокумента = "КОНТРОЛЬ"; 
		Элементы.СтатусДокумента.ЦветТекста = WebЦвета.Черный;
		Элементы.кнУстановитьСтатусКонтроль.Видимость = Ложь; 
		Элементы.кнУстановитьСтатусФакт.Видимость = Истина;  
		Если Пользователь_ЭтоЛомбард() Тогда 
			Элементы.УстановитьСтатусПроект.Видимость = Ложь; 
			Элементы.ПериодВводаДанныхОВремени.Доступность = Ложь; 
			Элементы.Заполнить.Доступность = Ложь;
            Элементы.МесяцРегистрацииСтрокой.Доступность = Ложь;
            Элементы.Отделение.Доступность = Ложь; 
			Элементы.ДанныеОВремениТФакт.Доступность = Ложь; 

		КонецЕсли;
	Иначе 
		Если Объект.Проведен Тогда
			ЭтаФорма.СтатусДокумента = "ФАКТ"; 
			Элементы.СтатусДокумента.ЦветТекста = WebЦвета.Зеленый;
			Элементы.УстановитьСтатусПроект.Видимость = Истина;
			Элементы.кнУстановитьСтатусФакт.Видимость = Ложь;
			ЭтаФорма.ТолькоПросмотр = Истина;
		Иначе
			ЭтаФорма.СтатусДокумента = "ПРОЕКТ"; 
			Элементы.СтатусДокумента.ЦветТекста = WebЦвета.Черный; 
			Элементы.УстановитьСтатусПроект.Видимость = Ложь;
			Элементы.кнУстановитьСтатусФакт.Видимость = Истина;
			ЭтаФорма.ТолькоПросмотр = Ложь;
		КонецЕсли;
	КонецЕсли;
	Если Пользователь_ЭтоЛомбард() Тогда
		Элементы.кнУстановитьСтатусФакт.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		
  
		Объект.ОтветственныйСотрудник    = ПараметрыСеанса.ТекущийСотрудник;
		Объект.ОтветственныйПользователь = ПараметрыСеанса.ТекущийПользователь;
		Объект.Организация               = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ОсновнаяОрганизация");
		Объект.Дата = ТекущаяДата();    
		Объект.Статус = Перечисления.ЛБ_СтатусыТабеля.Проект;
	Иначе    
		Если ЗначениеЗаполнено(Объект.Отделение) И ЗначениеЗаполнено(Объект.ДатаНачалаПериода) И ЗначениеЗаполнено(Объект.ДатаОкончанияПериода) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ссылка
			|ИЗ
			|	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(
			|			&НаДату,
			|			Отделение = &Отделение
			|				И Ломбард.Закрыт = ЛОЖЬ) КАК ЛБ_ОтделенияЛомбардовСрезПоследних"; 
			Запрос.УстановитьПараметр("НаДату", Объект.Дата);
			Запрос.УстановитьПараметр("Отделение", Объект.Отделение);
			
			тз = Запрос.Выполнить().Выгрузить(); 
			массивЛомб = тз.ВыгрузитьКолонку("Ссылка"); 
			
			ЗапросПротокол = Новый Запрос;
			ЗапросПротокол.Текст = "ВЫБРАТЬ
			                       |	ЛБ_ПротоколРаботы.Сотрудник КАК Сотрудник,
			                       |	ЛБ_ПротоколРаботы.Дата КАК Дата,
			                       |	ЛБ_ПротоколРаботы.Дата КАК Время,
			                       |	ЛБ_ПротоколРаботы.Дата КАК ДеньНедели,
			                       |	НАЧАЛОПЕРИОДА(ЛБ_ПротоколРаботы.Дата, ДЕНЬ) КАК День,
			                       |	ЛБ_ПротоколРаботы.Ломбард КАК Ломбард,
			                       |	ЛБ_ПротоколРаботы.Действие КАК Действие
			                       |ИЗ
			                       |	РегистрСведений.ЛБ_ПротоколРаботы КАК ЛБ_ПротоколРаботы
			                       |ГДЕ
			                       |	ЛБ_ПротоколРаботы.Ломбард В(&массивЛомб)
			                       |	И ЛБ_ПротоколРаботы.Дата МЕЖДУ &НачДата И &КонДата
			                       |
			                       |УПОРЯДОЧИТЬ ПО
			                       |	Дата,
			                       |	Время";
			ЗапросПротокол.УстановитьПараметр("массивЛомб", массивЛомб); 
			ЗапросПротокол.УстановитьПараметр("НачДата", Объект.ДатаНачалаПериода);
			ЗапросПротокол.УстановитьПараметр("КонДата", КонецДня(Объект.ДатаОкончанияПериода));   
			
			тз = ЗапросПротокол.Выполнить().Выгрузить();  
			
			НовТЗ = тз.Скопировать();
			НовТЗ.Очистить();
			
			тзСотр = тз.Скопировать();
			тзСотр.Свернуть("Сотрудник");
			
			тзСотрДни = тз.Скопировать();
			тзСотрДни.Свернуть("Сотрудник, День");
			
			Для каждого СтрокаСотр из тзСотр Цикл 
				отборСотр = Новый Структура;
				отборСотр.Вставить("Сотрудник", СтрокаСотр.Сотрудник);
				
				НайдСтрСотр = тзСотрДни.НайтиСтроки(ОтборСотр);
				Для каждого строкаСотрДни из НайдСтрСотр Цикл
					ОтборДень = Новый Структура;
					ОтборДень.Вставить("Сотрудник", строкаСотрДни.Сотрудник);
					ОтборДень.Вставить("День", строкаСотрДни.День);  
					
					
					НайдСтрочки = тз.НайтиСтроки(ОтборДень);
					
					ПоследнийВыход = ""; 
					первыйВход = Ложь; 
					строкаПоследнегоВыхода = Неопределено;
					
					Для каждого строка из НайдСтрочки Цикл
						Если строка.Действие = Перечисления.ЛБ_ДействияПользователя.Вход И НЕ ПервыйВход Тогда
							НовСтрокаТЗ = НовТЗ.Добавить();
							ЗаполнитьЗначенияСвойств(НовСтрокаТЗ, Строка);
							ПервыйВход = Истина;
						КонецЕсли;
						Если строка.Действие = Перечисления.ЛБ_ДействияПользователя.Выход Тогда
							строкаПоследнегоВыхода = строка;
						КонецЕсли;
					КонецЦикла; 
					
					Если строкаПоследнегоВыхода <> Неопределено Тогда
						НовСтрокаТЗ = НовТЗ.Добавить();
						ЗаполнитьЗначенияСвойств(НовСтрокаТЗ, строкаПоследнегоВыхода);
					КонецЕсли;	
		
				КонецЦикла;				
			КонецЦикла;			
			
			тзПротокол.Загрузить(НовТЗ); 
			
		КонецЕсли;
		
	КонецЕсли;

	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Пользователь_ЭтоЛомбард() Тогда
		Элементы.ДанныеОВремениТТаб.ТолькоПросмотр = Истина;
	КонецЕсли; 
	
	УстановитьСтатусДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	//ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	//УчетРабочегоВремениРасширенныйФормы.ТабельПриЧтенииНаСервере(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	//ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	//УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	//УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ПроцессыОбработкиДокументов
	//Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
	//	МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
	//	МодульПроцессыОбработкиДокументовЗарплата.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	//КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
	
	// БлокировкаИзмененияОбъектов
	//БлокировкаИзмененияОбъектов.ПриЧтенииНаСервереФормыОбъекта(ЭтотОбъект, ТекущийОбъект);
	// Конец БлокировкаИзмененияОбъектов
	
	// КадровыйЭДО
	//КадровыйЭДО.ПриЧтенииНаСервереФормыОбъекта(ЭтотОбъект, ТекущийОбъект, Объект);
	// Конец КадровыйЭДО
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_ТабельУчетаРабочегоВремени", ПараметрыЗаписи, Объект.Ссылка);
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтаФорма, "Объект.ПериодРегистрации", "МесяцРегистрацииСтрокой");
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
//	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	//УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	//УчетРабочегоВремениРасширенныйКлиент.ТабельОрганизацияПриИзменении(ЭтаФорма);
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	//УстановитьОтветственныхЛиц();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	//УчетРабочегоВремениРасширенныйКлиент.ТабельОрганизацияПриИзменении(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ПериодРегистрацииНачалоВыбораЗавершение", ЭтотОбъект);
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтаФорма, ЭтаФорма, "Объект.ПериодРегистрации", "МесяцРегистрацииСтрокой", , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииНачалоВыбораЗавершение(ЗначениеВыбрано, ДополнительныеПараметры) Экспорт
	
	ПериодРегистрацииПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодВводаДанныхОВремениПриИзменении(Элемент)
	ПериодВводаДанныхОВремениПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПериодаПриИзменении(Элемент)
	
	Если НачалоМесяца(Объект.ДатаНачалаПериода) <> НачалоМесяца(Объект.ДатаОкончанияПериода) Тогда
		Объект.ДатаОкончанияПериода = КонецМесяца(Объект.ДатаНачалаПериода);
	КонецЕсли;
	
	ПериодРегистрацииПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПериодаПриИзменении(Элемент)
	
	Если НачалоМесяца(Объект.ДатаНачалаПериода) <> НачалоМесяца(Объект.ДатаОкончанияПериода) Тогда
		Объект.ДатаОкончанияПериода = КонецМесяца(Объект.ДатаНачалаПериода);
	КонецЕсли;
	
	ПериодРегистрацииПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцРегистрацииСтрокойПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтаФорма, "Объект.ПериодРегистрации", "МесяцРегистрацииСтрокой", Модифицированность);
	
	ПериодРегистрацииПриИзменении();  
	ПериодВводаДанныхОВремениПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцРегистрацииСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ВводМесяцаРегулирование(ЭтаФорма, "Объект.ПериодРегистрации", "МесяцРегистрацииСтрокой", Направление, Модифицированность);
	
	ПериодРегистрацииПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцРегистрацииСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МесяцРегистрацииСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	//ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ВысотаСтрокиПриИзменении(Элемент)
	//УчетРабочегоВремениРасширенныйКлиент.ТабельВысотаСтрокиПриИзменении(ЭтаФорма);
КонецПроцедуры

// Обработчик подсистемы "ПодписиДокументов".
&НаКлиенте
Процедура Подключаемый_ПодписиДокументовЭлементПриИзменении(Элемент) 
	//ПодписиДокументовКлиент.ПриИзмененииПодписывающегоЛица(ЭтаФорма, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПодписиДокументовЭлементНажатие(Элемент) 
	//ПодписиДокументовКлиент.РасширеннаяПодсказкаНажатие(ЭтаФорма, Элемент.Имя);
КонецПроцедуры
// Конец Обработчик подсистемы "ПодписиДокументов".

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДанныеОВремени

&НаКлиенте
Процедура ДанныеОВремениПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	УдалитьСтрокиПоСотруднику(Элементы.ДанныеОВремени.ВыделенныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеОВремениВремяПредставлениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	//УчетРабочегоВремениРасширенныйКлиент.ТабельДанныеОВремениВремяПредставлениеОкончаниеВводаТекста(ЭтаФорма, Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ДанныеОВремениВремяПредставлениеАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	//УчетРабочегоВремениРасширенныйКлиент.ТабельДанныеОВремениВремяПредставлениеАвтоПодбор(ЭтаФорма, Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ДанныеОВремениВремяПредставлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УчетРабочегоВремениРасширенныйКлиент.ТабельДанныеОВремениВремяПредставлениеОбработкаВыбора(ЭтаФорма, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ДанныеОВремениВремяПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УчетРабочегоВремениРасширенныйКлиент.ТабельДанныеОВремениПредставлениеНачалоВыбора(ЭтаФорма, СтандартнаяОбработка, Элемент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект)
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

#КонецОбласти

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ОбновитьПодключаемыеКоманды(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ИсправлениеДокументов
&НаКлиенте
Процедура Подключаемый_Исправить(Команда)
	//ИсправлениеДокументовЗарплатаКадрыКлиент.Исправить(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Сторнировать(Команда)
	//ИсправлениеДокументовЗарплатаКадрыКлиент.Сторнировать(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПерейтиКИсправлению(Команда)
	//ИсправлениеДокументовЗарплатаКадрыКлиент.ПерейтиКИсправлению(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПерейтиКИсправленному(Команда)
	//ИсправлениеДокументовЗарплатаКадрыКлиент.ПерейтиКИсправленному(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПерейтиКСторно(Команда)
	//ИсправлениеДокументовЗарплатаКадрыКлиент.ПерейтиКСторно(ЭтотОбъект);
КонецПроцедуры
// Конец ИсправлениеДокументов

&НаКлиенте
Процедура Заполнить(Команда) Экспорт  
	
	Если Объект.ДанныеОВремени.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru = 'Перед заполнением табличная часть будет очищена. Заполнить?'");
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьИзГрафикаЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, Заголовок);
	Иначе
		ЗаполнитьСотрудникамиОрганизацииНаСервере(); 
	КонецЕсли; 
	РасчитатьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзГрафикаЗавершение(Результат, ДополнительныеПараметры) Экспорт	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьСотрудникамиОрганизацииНаСервере();
	КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура Подбор(Команда)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("ПодборСотрудникаВФормеДокументаТабельУчетаРабочегоВремени");
	
	//УчетРабочегоВремениРасширенныйКлиент.ТабельПодбор(ЭтаФорма, АдресСпискаПодобранныхСотрудников());
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВверх(Команда)
	//УчетРабочегоВремениРасширенныйКлиент.ТабельПереместитьСтрокуВверх(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВниз(Команда)
	//УчетРабочегоВремениРасширенныйКлиент.ТабельПереместитьСтрокуВниз(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоВозрастанию(Команда)
	СортироватьПоВозрастаниюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоУбыванию(Команда)
	СортироватьПоУбываниюНаСервере();
КонецПроцедуры

// БлокировкаИзмененияОбъектов
&НаКлиенте
Процедура Подключаемый_РазблокироватьФормуОбъекта(Команда)
	
	//БлокировкаИзмененияОбъектовКлиент.РазблокироватьФормуОбъекта(ЭтотОбъект, Объект.Ссылка);
	
КонецПроцедуры
// Конец БлокировкаИзмененияОбъектов

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	//УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	//УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#Область ИсправлениеДокументов

&НаКлиенте
Процедура УстановитьПоляИсправленияНаКлиенте() Экспорт
	
	//УстановитьПоляИсправления(ЭтаФорма);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПоляИсправления(Форма)

	//ИсправлениеДокументовЗарплатаКадрыКлиентСервер.УстановитьПоляИсправления(Форма, "ПериодическиеСведения");
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ОбновитьОписаниеВидовВремени() Экспорт
	//УчетРабочегоВремениРасширенныйФормы.ТабельПоместитьОписаниеВидовВремениВДанныеФормы(ЭтаФорма);	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПервоначальныеДанныеПоСотруднику(ТекСтр, табПротоколРаботы) 
	КоличествоДнейвМесяце = День(КонецМесяца(Объект.ПериодРегистрации)); 
	
	Если ЗначениеЗаполнено(ТекСтр.Сотрудник) и ЗначениеЗаполнено(ТекСтр.Ломбард) Тогда  
		
		ДатаУвольнения = ВернутьДатуУвольненияСотрудника(ТекСтр.Сотрудник, Объект.ДатаНачалаПериода, КонецДня(Объект.ДатаОкончанияПериода));
  		
		ВидВремени_Выходной = Справочники.ЛБ_ВидыИспользованияРабочегоВремени.ВыходныеДни;  
		ВидВремени_Увольнение = Справочники.ЛБ_ВидыИспользованияРабочегоВремени.Увольнение; 	
		
		минутОкр = 0;
		минутФикс = 0;

		ДанныеРабДни = ВернутьДанныеПоРабочимДнямЛомбарда(ТекСтр.День, ТекСтр.Ломбард);
		Если ДанныеРабДни <> Неопределено Тогда	
			НачДня = ДанныеРабДни.Начало;
			КонДня  = ДанныеРабДни.Окончание;
			ПерерывНачало = ДанныеРабДни.ПерерывНачало; 
			ПерерывОкончание = ДанныеРабДни.ПерерывОкончание;  
			
			 
				
			ПД = СтруктураПраздничныхДней(ТекСтр.День); 
			Если ПД <> Неопределено Тогда 
				Если ПД.Выходной = 0 и ЗначениеЗаполнено(ПД.ВремяНачала) Тогда 
					НачДня  = ПД.ВремяНачала;
					КонДня  = ПД.ВремяОкончания; 
					ПерерывНачало = ""; 
					ПерерывОкончание = "";  
				ИначеЕсли ПД.ЧасовСокращено > 0 Тогда
					КонДня = КонДня - ПД.ЧасовСокращено*3600;				
					
				КонецЕсли;				
			КонецЕсли;
					

			
			ОтбСтрок = Новый Структура("Сотрудник, Ломбард, День", ТекСтр.Сотрудник, ТекСтр.Ломбард, ТекСтр.День);
			НайдСтрокиПротокола = табПротоколРаботы.НайтиСтроки(ОтбСтрок);
			
			
			Для каждого стрТЗ из НайдСтрокиПротокола Цикл
				Если ТекСтр.День = стрТЗ.День Тогда
					Если стрТЗ.Действие = Перечисления.ЛБ_ДействияПользователя.Вход Тогда
						ДатаВремяВхода = НачалоДня(стрТЗ.Дата) + (НачДня - НачалоДня(НачДня));  
						Если стрТЗ.Дата < ДатаВремяВхода Тогда
							ДатаОтсчета = ДатаВремяВхода;
						Иначе
							ДатаОтсчета = стрТЗ.Дата;
						КонецЕсли;	
						ДатаОтсчетаФикс = стрТЗ.Дата;
					КонецЕсли;					
					Если стрТЗ.Действие = Перечисления.ЛБ_ДействияПользователя.Выход Тогда
						Если ДатаОтсчета <> Неопределено Тогда
						
						ДатаВремяОкончанияГрафик = НачалоДня(стрТЗ.Дата) + (КонДня - НачалоДня(КонДня)); 
						Если стрТЗ.Дата > ДатаВремяОкончанияГрафик Тогда
							минутОкр = минутОкр + (ДатаВремяОкончанияГрафик - ДатаОтсчета)/60;
						Иначе
							минутОкр = минутОкр + (стрТЗ.Дата - ДатаОтсчета)/60;
						КонецЕсли;
						
						минутФикс = минутФикс + (стрТЗ.Дата - ДатаОтсчетаФикс)/60; 
						КонецЕсли;
					КонецЕсли;	
				КонецЕсли;
			КонецЦикла;
			
			Если ЗначениеЗаполнено(ПерерывНачало) и ЗначениеЗаполнено(ПерерывОкончание) Тогда  
				Если минутОкр > 0 Тогда
					минутОкр = минутОкр - (ПерерывОкончание - ПерерывНачало)/60;	
				КонецЕсли;
			КонецЕсли;
			
			ЧасовФикс  = минутОкр/60;  
			
			Если ДанныеРабДни.Выходной Тогда 
				ЧасовФикс = -ЧасовФикс;
			КонецЕсли;
						
			ЧасовРежим = ДанныеРабДни.РабочиеМинуты/60; 
			
			Если ПД <> Неопределено Тогда
				Если ПД.Выходной = 1 и ПД.ЧасовСокращено > 0 тогда
					ЧасовРежим = ЧасовРежим - ПД.ЧасовСокращено; 
				ИначеЕсли ПД.Выходной = 0 и ПД.ЧасовСокращено > 0 тогда
					ЧасовРежим = ЧасовРежим - ПД.ЧасовСокращено; 
				ИначеЕсли ПД.Выходной = 1 и ЗначениеЗаполнено(ПД.ВремяНачала) тогда
					ЧасовРежим 		= (ПД.ВремяОкончания - ПД.ВремяНачала)/3600;
				ИначеЕсли ПД.Выходной = 0 и ЗначениеЗаполнено(ПД.ВремяНачала) тогда
					ЧасовРежим 		= (ПД.ВремяОкончания - ПД.ВремяНачала)/3600;				
				КонецЕсли;				
			КонецЕсли;
						
			НомерДня = СокрЛП(День(ТекСтр.День));  
			
			минут15 = 15;
			
			Если ЧасовФикс > ЧасовРежим Тогда
				ЧасовОкр = ЧасовРежим;
			Иначе       
				РазницаМинут = ДанныеРабДни.РабочиеМинуты - минутОкр;
				Если РазницаМинут < 15 Тогда
					ЧасовОкр = ЧасовРежим;  
					
				Иначе 
					Половинки = РазницаМинут/30;
					ОкрПоловинки = Окр(Половинки,0);
					ОкрПоловинки2 = ОкрПоловинки*2; 
					
					ЧасовОкр = (ДанныеРабДни.РабочиеМинуты - минут15*ОкрПоловинки2)/60;
					
				КонецЕсли;
			КонецЕсли;
			
			ВидВремени = Справочники.ЛБ_ВидыИспользованияРабочегоВремени.Явка;
			
			ТекСтр.ТРежим 		= ЧасовРежим;
			ТекСтр.ТОкр 		= ЧасовОкр;
			ТекСтр.ТТаб 		= ЧасовОкр;
			ТекСтр.ТФикс 		= ЧасовФикс;
			ТекСтр.ВидВремени 	= ВидВремени; 
			ТекСтр.ТОткл        = ЧасовОкр - ЧасовРежим;
			ТекСтр.ВремяПредставление 	= СформироватьПредставлениеВремени(ВидВремени, ЧасовОкр, "");  
		КонецЕсли;
			
		
	КонецЕсли;
КонецПроцедуры





&НаСервере
Функция ЗаполнитьСотрудникамиОрганизацииНаСервере()
	Объект.ДанныеОВремени.Очистить(); 
	тзПротокол.Очистить();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ссылка
	               |ИЗ
	               |	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(
	               |			&НаДату,
	               |			Отделение = &Отделение
	               |				И Ломбард.Закрыт = ЛОЖЬ) КАК ЛБ_ОтделенияЛомбардовСрезПоследних"; 
	Запрос.УстановитьПараметр("НаДату", Объект.Дата);
	Запрос.УстановитьПараметр("Отделение", Объект.Отделение);

	тз = Запрос.Выполнить().Выгрузить(); 
	массивЛомб = тз.ВыгрузитьКолонку("Ссылка"); 
	
	
	//Сначала заполним НОЛ  
	Запрос2 = Новый Запрос;
	
	Запрос2.Текст = "ВЫБРАТЬ
	                |	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	                |	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Подразделение КАК Ломбард,
	                |	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия КАК ВидСобытия,
	                |	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник.Наименование КАК СотрудникНаименование,
	                |	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Подразделение.НомерЧисловой КАК НомерЧисловой
	                |ИЗ
	                |	РегистрСведений.ЛБ_КадроваяИсторияСотрудников.СрезПоследних(&НаДату, ) КАК ЛБ_КадроваяИсторияСотрудниковСрезПоследних
	                |ГДЕ
	                |	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Подразделение В(&Подразделение)
	                |	И ЛБ_КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия <> &ВидСобытия";

	Запрос2.УстановитьПараметр("НаДату", 		Объект.Дата);
	Запрос2.УстановитьПараметр("Подразделение", массивЛомб); 
	Запрос2.УстановитьПараметр("ВидСобытия", 	Перечисления.ЛБ_ВидыКадровыхСобытий.Увольнение);
	
	
	КоличествоДнейвМесяце = День(КонецМесяца(Объект.ПериодРегистрации)); 
	
	ВидВремени_Выходной = Справочники.ЛБ_ВидыИспользованияРабочегоВремени.ВыходныеДни;  
	ВидВремени_Увольнение = Справочники.ЛБ_ВидыИспользованияРабочегоВремени.Увольнение; 
	
	
	Если Объект.ПериодВводаДанныхОВремени = Перечисления.ЛБ_ПериодыВводаДанныхОВремениПоловинки.ВтораяПоловинаТекущегоМесяца Тогда
		НачальныйДень = 16;
	Иначе
		НачальныйДень = 1;
	КонецЕсли;

	КоличествоДней = День(Объект.ДатаОкончанияПериода);   
	
	тзПр = Запрос2.Выполнить().Выгрузить();
	тзПр.Сортировать("СотрудникНаименование Возр, НомерЧисловой Возр"); 
	
	Для каждого Выборка из тзПр Цикл		
		Если ЛБ_ОбщегоНазначения.СотрудникЯвляетсяНачальникомОтделенияБезСовмещения(Выборка.Сотрудник, Объект.ДатаНачалаПериода) Тогда
			
			ДатаУвольнения = ВернутьДатуУвольненияСотрудника(Выборка.Сотрудник, Объект.ДатаНачалаПериода, КонецДня(Объект.ДатаОкончанияПериода));
			
			Для номерДня = НачальныйДень по КоличествоДней Цикл  
						
				промДата = Объект.ПериодРегистрации + (номерДня-1)*86400;  
				
				ПД = СтруктураПраздничныхДнейНОЛ(промДата); 
					
				НовСтроч = Объект.ДанныеОВремени.Добавить();
				НовСтроч.Сотрудник = Выборка.Сотрудник;
				НовСтроч.Ломбард   = Выборка.Ломбард; 
				НовСтроч.День      = промДата;
				
				
				Если ПД <> Неопределено Тогда
					Если ПД.Выходной > 0 Тогда 
						НовСтроч.ВидВремени 	= ВидВремени_Выходной; 
						НовСтроч.ВремяПредставление = СформироватьПредставлениеВремени(НовСтроч.ВидВремени, 0, "");
					ИначеЕсли ПД.РабочийДень > 0 Тогда 
						ВидВремени = Справочники.ЛБ_ВидыИспользованияРабочегоВремени.Явка;
						ЧасовРежим =  ПД.РабочийДень;
						НовСтроч.ТРежим 		= ЧасовРежим;
						НовСтроч.ТОкр 			= ЧасовРежим;
						НовСтроч.ТТаб 			= ЧасовРежим;
						НовСтроч.ТФикс 			= 0;
						НовСтроч.ВидВремени 	= ВидВремени; 
						НовСтроч.ТОткл          = 0;
						НовСтроч.ВремяПредставление 	= СформироватьПредставлениеВремени(ВидВремени, ЧасовРежим, "");
						
					КонецЕсли; 						
				Иначе 
					Если ДеньНедели(промДата) < 6 Тогда  
						ВидВремени = Справочники.ЛБ_ВидыИспользованияРабочегоВремени.Явка;
						ЧасовРежим = Выборка.Сотрудник.СтавкаЧас;
						НовСтроч.ТРежим 		= ЧасовРежим;
						НовСтроч.ТОкр 			= ЧасовРежим;
						НовСтроч.ТТаб 			= ЧасовРежим;
						НовСтроч.ТФикс 			= 0;
						НовСтроч.ВидВремени 	= ВидВремени; 
						НовСтроч.ТОткл          = 0;
						НовСтроч.ВремяПредставление 	= СформироватьПредставлениеВремени(ВидВремени, ЧасовРежим, "");
					Иначе  
						НовСтроч.ВидВремени 	= ВидВремени_Выходной; 
						НовСтроч.ВремяПредставление = СформироватьПредставлениеВремени(НовСтроч.ВидВремени, 0, "");
					КонецЕсли;
   
				КонецЕсли; 
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;         
	
	
	
	
	ЗапросПротокол = Новый Запрос;
	ЗапросПротокол.Текст = "ВЫБРАТЬ
	                       |	ЛБ_ПротоколРаботы.Сотрудник КАК Сотрудник,
	                       |	ЛБ_ПротоколРаботы.Дата КАК Дата,
	                       |	ЛБ_ПротоколРаботы.Дата КАК Время,
	                       |	ЛБ_ПротоколРаботы.Дата КАК ДеньНедели,
	                       |	НАЧАЛОПЕРИОДА(ЛБ_ПротоколРаботы.Дата, ДЕНЬ) КАК День,
	                       |	ЛБ_ПротоколРаботы.Ломбард КАК Ломбард,
	                       |	ЛБ_ПротоколРаботы.Действие КАК Действие,
	                       |	ЛБ_ПротоколРаботы.Ломбард.НомерЧисловой КАК НомерЧисловой,
	                       |	ЛБ_ПротоколРаботы.Сотрудник.Наименование КАК СотрудникНаименование
	                       |ИЗ
	                       |	РегистрСведений.ЛБ_ПротоколРаботы КАК ЛБ_ПротоколРаботы
	                       |ГДЕ
	                       |	ЛБ_ПротоколРаботы.Ломбард В(&массивЛомб)
	                       |	И ЛБ_ПротоколРаботы.Дата МЕЖДУ &НачДата И &КонДата";
	ЗапросПротокол.УстановитьПараметр("массивЛомб", массивЛомб); 
	ЗапросПротокол.УстановитьПараметр("НачДата", Объект.ДатаНачалаПериода);
	ЗапросПротокол.УстановитьПараметр("КонДата", КонецДня(Объект.ДатаОкончанияПериода));   
	
	тз = ЗапросПротокол.Выполнить().Выгрузить();  
	
	
	
	НовТЗ = тз.Скопировать();
	НовТЗ.Очистить();
	
	тзСотр = тз.Скопировать();
	тзСотр.Свернуть("Сотрудник");
	
	тзСотрДни = тз.Скопировать();
	тзСотрДни.Свернуть("Сотрудник, День");
	
	Для каждого СтрокаСотр из тзСотр Цикл 
		отборСотр = Новый Структура;
		отборСотр.Вставить("Сотрудник", СтрокаСотр.Сотрудник);
		
		НайдСтрСотр = тзСотрДни.НайтиСтроки(ОтборСотр);
		Для каждого строкаСотрДни из НайдСтрСотр Цикл
			ОтборДень = Новый Структура;
			ОтборДень.Вставить("Сотрудник", строкаСотрДни.Сотрудник);
			ОтборДень.Вставить("День", строкаСотрДни.День);  
			
			
			НайдСтрочки = тз.НайтиСтроки(ОтборДень);
			
			ПоследнийВыход = ""; 
			первыйВход = Ложь; 
			строкаПоследнегоВыхода = Неопределено;
			
			Для каждого строка из НайдСтрочки Цикл
				Если строка.Действие = Перечисления.ЛБ_ДействияПользователя.Вход И НЕ ПервыйВход Тогда
					НовСтрокаТЗ = НовТЗ.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрокаТЗ, Строка);
					ПервыйВход = Истина;
				КонецЕсли;
				Если строка.Действие = Перечисления.ЛБ_ДействияПользователя.Выход Тогда
					строкаПоследнегоВыхода = строка;
				КонецЕсли;
			КонецЦикла; 
			
			Если строкаПоследнегоВыхода <> Неопределено Тогда
				НовСтрокаТЗ = НовТЗ.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрокаТЗ, строкаПоследнегоВыхода);
			КонецЕсли;	
			
		КонецЦикла;				
	КонецЦикла;		
	НовТЗ.Сортировать("СотрудникНаименование, Время");
	тзПротокол.Загрузить(НовТЗ); 
	

	тзСотрДни = НовТЗ.Скопировать(); 
	тзСотр = НовТЗ.Скопировать(); 
	тзСотр.Свернуть("Сотрудник");  

	тзСотрДни.Свернуть("Сотрудник, Ломбард, НомерЧисловой, День"); 	
	тзСотрДни.Сортировать("Сотрудник, НомерЧисловой, День"); 
	Для каждого стр из тзСотрДни Цикл
		НовСтр = Объект.ДанныеОВремени.Добавить();
		НовСтр.Сотрудник = стр.Сотрудник;
		НовСтр.Ломбард = стр.Ломбард;
        НовСтр.День = стр.День;
		ЗаполнитьПервоначальныеДанныеПоСотруднику(НовСтр, НовТЗ);
	КонецЦикла; 
	
	ВидВремени_Выходной = Справочники.ЛБ_ВидыИспользованияРабочегоВремени.ВыходныеДни;    
	
	Если Объект.ПериодВводаДанныхОВремени = Перечисления.ЛБ_ПериодыВводаДанныхОВремениПоловинки.ВтораяПоловинаТекущегоМесяца Тогда
		НачальныйДень = 16;
	Иначе
		НачальныйДень = 1;
	КонецЕсли;

	КоличествоДней = День(Объект.ДатаОкончанияПериода);  
	Для каждого ТекСтр из тзСотр Цикл  	
		Для номерДня = НачальныйДень по КоличествоДней Цикл 
			промДата = Объект.ПериодРегистрации + (номерДня-1)*86400; 
			
			тзНеявка = НеявкаСотрудника(ТекСтр.Сотрудник, промДата); 
			Если тзНеявка.Количество() > 0 Тогда 			
				Для каждого стр из тзНеявка Цикл 
					НовСтр = Объект.ДанныеОВремени.Добавить();
					НовСтр.Сотрудник = стр.Сотрудник;  
					НовСтр.День = промДата; 		
					НовСтр.ВидВремени = стр.ВидВремени; 
					НовСтр.ВремяПредставление = СформироватьПредставлениеВремени(НовСтр.ВидВремени, 0, "");
				КонецЦикла;	
			КонецЕсли;
			
			ПД = СтруктураПраздничныхДней(промДата); 					
			
			нСтрочки = Объект.ДанныеОВремени.НайтиСтроки(Новый Структура("Сотрудник, День", ТекСтр.Сотрудник, промДата)); 
			
			Если нСтрочки.Количество() = 0 Тогда  
				
				СработалПД = Ложь;
				Если ПД <> Неопределено Тогда
					Если ПД.Выходной = 2 Тогда
						НовСтр = Объект.ДанныеОВремени.Добавить();
						НовСтр.Сотрудник 	= ТекСтр.Сотрудник; 
						НовСтр.День 		= промДата; 		
						НовСтр.ВидВремени 	= ВидВремени_Выходной; 
						НовСтр.ВремяПредставление = СформироватьПредставлениеВремени(НовСтр.ВидВремени, 0, "");
						Если ЗначениеЗаполнено(ПД.ВремяНачала) Тогда 
							НовСтр.ТРежим 		= (ПД.ВремяОкончания - ПД.ВремяНачала)/3600;
							НовСтр.ТОткл 		= -НовСтр.ТРежим; 
						КонецЕсли;
						СработалПД = Истина;
					ИначеЕсли ПД.Выходной = 1 и ЛБ_ОбщегоНазначения.СотрудникЯвляетсяНачальникомОтделенияБезСовмещения( ТекСтр.Сотрудник, промДата) Тогда 
						НовСтр = Объект.ДанныеОВремени.Добавить();
						НовСтр.Сотрудник 	= ТекСтр.Сотрудник; 
						НовСтр.День 		= промДата; 		
						НовСтр.ВидВремени 	= ВидВремени_Выходной; 
						НовСтр.ВремяПредставление = СформироватьПредставлениеВремени(НовСтр.ВидВремени, 0, "");  
						Если ЗначениеЗаполнено(ПД.ВремяНачала) Тогда 
							НовСтр.ТРежим 		= (ПД.ВремяОкончания - ПД.ВремяНачала)/3600;
							НовСтр.ТОткл 		= -НовСтр.ТРежим;   
							СработалВремяНачала = Истина;
						КонецЕсли; 
					КонецЕсли;
				КонецЕсли;
				
				
				Если НЕ СработалПД Тогда
					СтруктураГрафик = ВернутьСтруктуруПоГрафику(ТекСтр.Сотрудник, промДата);
					Если СтруктураГрафик.Часов > 0 Тогда
						НовСтр = Объект.ДанныеОВремени.Добавить();
						НовСтр.Сотрудник 	= ТекСтр.Сотрудник; 
						НовСтр.День 		= промДата; 
						НовСтр.Ломбард      = СтруктураГрафик.Ломбард; 
						
						отбН = Новый Структура;
						отбН.Вставить("Сотрудник", ТекСтр.Сотрудник);
						отбН.Вставить("День", промДата);
						отбН.Вставить("Ломбард", СтруктураГрафик.Ломбард);
						НайденСТрокиН = НовТЗ.НайтиСтроки(отбН); 
						Если НайденСТрокиН.Количество() = 0 Тогда
							НовСтр.ВидВремени 	= ВидВремени_Выходной; 
							НовСтр.ВремяПредставление = СформироватьПредставлениеВремени(НовСтр.ВидВремени, 0, "");
						Иначе
							НовСтр.ТРежим 		= СтруктураГрафик.Часов;
							НовСтр.ТОткл 		= -СтруктураГрафик.Часов;
							НовСтр.ВидВремени 	= ВидВремени_Выходной; 
							НовСтр.ВремяПредставление = СформироватьПредставлениеВремени(НовСтр.ВидВремени, 0, ""); 
						КонецЕсли;
					Иначе
						НовСтр = Объект.ДанныеОВремени.Добавить();
						НовСтр.Сотрудник 	= ТекСтр.Сотрудник; 
						НовСтр.День 		= промДата; 		
						НовСтр.ВидВремени 	= ВидВремени_Выходной; 
						НовСтр.ВремяПредставление = СформироватьПредставлениеВремени(НовСтр.ВидВремени, 0, ""); 
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			
				
		КонецЦикла;
	КонецЦикла; 
	
	Объект.ДанныеОВремени.Сортировать("Сотрудник, День, Ломбард");
	
КонецФункции 


Функция СтруктураПраздничныхДней(Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПраздничныеСокращенныеДни.Дата КАК Дата,
	               |	ЛБ_ПраздничныеСокращенныеДни.Выходной КАК Выходной,
	               |	ЛБ_ПраздничныеСокращенныеДни.ВремяНачала КАК ВремяНачала,
	               |	ЛБ_ПраздничныеСокращенныеДни.ВремяОкончания КАК ВремяОкончания,
	               |	ЛБ_ПраздничныеСокращенныеДни.ЧасовСокращено КАК ЧасовСокращено,
	               |	ЛБ_ПраздничныеСокращенныеДни.РабочийДень КАК РабочийДень
	               |ИЗ
	               |	Справочник.ЛБ_ПраздничныеСокращенныеДни КАК ЛБ_ПраздничныеСокращенныеДни
	               |ГДЕ
	               |	ЛБ_ПраздничныеСокращенныеДни.ПометкаУдаления = Ложь
	               |	И ЛБ_ПраздничныеСокращенныеДни.Дата >= &ДатаНач
	               |	И ЛБ_ПраздничныеСокращенныеДни.Дата <= &ДатаКон";
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Дата));
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(Дата)); 
	
	Рез = Неопределено;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Рез = Новый Структура;
		Рез.Вставить("Дата", 			Выборка.Дата);
		Рез.Вставить("Выходной", 		Выборка.Выходной);
		Рез.Вставить("ВремяНачала", 	Выборка.ВремяНачала);
		Рез.Вставить("ВремяОкончания", 	Выборка.ВремяОкончания);
		Рез.Вставить("ЧасовСокращено", 	Выборка.ЧасовСокращено); 
		Рез.Вставить("РабочийДень", 	Выборка.РабочийДень);
	КонецЕсли; 
	
	Возврат Рез;	
	
КонецФункции

Функция СтруктураПраздничныхДнейНОЛ(Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПраздничныеСокращенныеДни.Дата КАК Дата,
	               |	ЛБ_ПраздничныеСокращенныеДни.Выходной КАК Выходной,
	               |	ЛБ_ПраздничныеСокращенныеДни.РабочийДень КАК РабочийДень
	               |ИЗ
	               |	Справочник.ЛБ_ПраздничныеСокращенныеДни КАК ЛБ_ПраздничныеСокращенныеДни
	               |ГДЕ
	               |	ЛБ_ПраздничныеСокращенныеДни.ПометкаУдаления = ЛОЖЬ
	               |	И ЛБ_ПраздничныеСокращенныеДни.Дата >= &ДатаНач
	               |	И ЛБ_ПраздничныеСокращенныеДни.Дата <= &ДатаКон
	               |	И (ЛБ_ПраздничныеСокращенныеДни.Выходной > 0
	               |	ИЛИ ЛБ_ПраздничныеСокращенныеДни.РабочийДень > 0)";
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Дата));
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(Дата)); 
	
	Рез = Неопределено;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Рез = Новый Структура;
		Рез.Вставить("Дата", 			Выборка.Дата);
		Рез.Вставить("Выходной", 		Выборка.Выходной);
		Рез.Вставить("РабочийДень", 	Выборка.РабочийДень);
	КонецЕсли; 
	
	Возврат Рез;	
	
КонецФункции

	



Функция ВернутьСтруктуруПоГрафику(Сотр, промДата)
	Рез = Новый Структура("Часов, Ломбард", 0, Неопределено);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ЭлектронныйГрафикРаботыДанныеОВремени.Ломбард КАК Ломбард,
	               |	ЛБ_ЭлектронныйГрафикРаботыДанныеОВремени.Часов1 КАК КолЧасов
	               |ИЗ
	               |	Документ.ЛБ_ЭлектронныйГрафикРаботы.ДанныеОВремени КАК ЛБ_ЭлектронныйГрафикРаботыДанныеОВремени
	               |ГДЕ
	               |	ЛБ_ЭлектронныйГрафикРаботыДанныеОВремени.Ссылка.Проведен = Истина
	               |	И ЛБ_ЭлектронныйГрафикРаботыДанныеОВремени.Ссылка.ДатаНачалаПериода <= &промДата
	               |	И ЛБ_ЭлектронныйГрафикРаботыДанныеОВремени.Ссылка.ДатаОкончанияПериода >= &промДата
	               |	И ЛБ_ЭлектронныйГрафикРаботыДанныеОВремени.Сотрудник = &Сотрудник";
	Запрос.УстановитьПараметр("Сотрудник", Сотр);
	Запрос.УстановитьПараметр("промДата", промДата);   
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Часов1", "Часов"+СокрЛП(День(промДата)));
	
	Часов = 0;
	Ломбард = Неопределено;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Если Выборка.КолЧасов > 0 тогда
			Рез.Вставить("Часов", Выборка.Колчасов); 
			Рез.Вставить("Ломбард", Выборка.Ломбард);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Рез;
КонецФункции



Функция НеявкаСотрудника(Сотр, Дата)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостоянияСотрудников.Сотрудник КАК Сотрудник,
	               |	ЛБ_СостоянияСотрудников.Период КАК НачалоНеявки,
	               |	ЛБ_СостоянияСотрудников.ДействуетДо КАК КонецНеявки,
	               |	ЛБ_СостоянияСотрудников.ВидВремени КАК ВидВремени
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостоянияСотрудников КАК ЛБ_СостоянияСотрудников
	               |ГДЕ
	               |	ЛБ_СостоянияСотрудников.Сотрудник = &Сотрудник
	               |	И ЛБ_СостоянияСотрудников.Период <= &НачалоНеявки
	               |	И ЛБ_СостоянияСотрудников.ДействуетДо >= &КонецНеявки
	               |	И ЛБ_СостоянияСотрудников.Состояние <> &Работа";  
	
	Запрос.УстановитьПараметр("Сотрудник", Сотр); 
	Запрос.УстановитьПараметр("НачалоНеявки", НачалоДня(Дата)); 
	Запрос.УстановитьПараметр("КонецНеявки", НачалоДня(Дата)); 
	Запрос.УстановитьПараметр("Работа", Перечисления.ЛБ_СостоянияСотрудника.Работа);
	
	тз = Запрос.Выполнить().Выгрузить();
	
	Возврат тз;		
КонецФункции

Функция ВернутьДатуУвольненияСотрудника(Сотр, НачДата, КонДата)
	
	ЗапросУв = Новый Запрос;
	ЗапросУв.Текст = "ВЫБРАТЬ
	|	ЛБ_КадроваяИсторияСотрудников.Период КАК Период
	|ИЗ
	|	РегистрСведений.ЛБ_КадроваяИсторияСотрудников КАК ЛБ_КадроваяИсторияСотрудников
	|ГДЕ
	|	ЛБ_КадроваяИсторияСотрудников.ВидСобытия = &ВидСобытия
	|	И ЛБ_КадроваяИсторияСотрудников.Период МЕЖДУ &НачДата И &КонДата
	|	И ЛБ_КадроваяИсторияСотрудников.Сотрудник = &Сотрудник";
	
	ЗапросУв.УстановитьПараметр("НачДата",    НачДата);
	ЗапросУв.УстановитьПараметр("КонДата",    КонДата); 
	ЗапросУв.УстановитьПараметр("Сотрудник",  Сотр);
	ЗапросУв.УстановитьПараметр("ВидСобытия", Перечисления.ЛБ_ВидыКадровыхСобытий.Увольнение); 
	
	ДатаУвольнения = Неопределено;
	
	ВыборкаУв = ЗапросУв.Выполнить().Выбрать();
	Если ВыборкаУв.Следующий() Тогда
		ДатаУвольнения = ВыборкаУв.Период;
	КонецЕсли;
	
	Возврат ДатаУвольнения;
КонецФункции


Функция ВернутьДанныеПоРабочимДнямЛомбарда(Дата, Ломбард)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РабочиеДниЛомбарда.Период КАК Период,
	               |	ЛБ_РабочиеДниЛомбарда.Ломбард КАК Ломбард,
	               |	ЛБ_РабочиеДниЛомбарда.Начало КАК Начало,
	               |	ЛБ_РабочиеДниЛомбарда.Окончание КАК Окончание,
	               |	ЛБ_РабочиеДниЛомбарда.ПерерывНачало КАК ПерерывНачало,
	               |	ЛБ_РабочиеДниЛомбарда.ПерерывОкончание КАК ПерерывОкончание,
	               |	ЛБ_РабочиеДниЛомбарда.РабочиеМинуты КАК РабочиеМинуты,
	               |	ЛБ_РабочиеДниЛомбарда.Выходной КАК Выходной,
	               |	ЛБ_РабочиеДниЛомбарда.ДеньНедели КАК ДеньНедели,
	               |	ЛБ_РабочиеДниЛомбарда.НомерДня КАК НомерДня,
	               |	ЛБ_РабочиеДниЛомбарда.Приказ КАК Приказ
	               |ИЗ
	               |	РегистрСведений.ЛБ_РабочиеДниЛомбарда КАК ЛБ_РабочиеДниЛомбарда
	               |ГДЕ
	               |	ЛБ_РабочиеДниЛомбарда.Период = &Период
	               |	И ЛБ_РабочиеДниЛомбарда.Ломбард = &Ломбард";
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.УстановитьПараметр("Период", НачалоДня(Дата));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Структ = Новый Структура;
		Структ.Вставить("Начало", Выборка.Начало);
		Структ.Вставить("Окончание", Выборка.Окончание);
		Структ.Вставить("ПерерывНачало", Выборка.ПерерывНачало); 
		Структ.Вставить("ПерерывОкончание", Выборка.ПерерывОкончание);
		Структ.Вставить("РабочиеМинуты", Выборка.РабочиеМинуты);
		Структ.Вставить("Выходной", Выборка.Выходной); 
		
		Возврат Структ;
	КонецЕсли;
	
	Возврат Неопределено;	
КонецФункции 

&НаКлиенте
Процедура ДанныеОВремениСотрудникПриИзменении(Элемент)
	//ЗаполнитьПервоначальныеДанныеПоСотруднику();
КонецПроцедуры

&НаСервере
Процедура ПериодРегистрацииПриИзменении()
	//УчетРабочегоВремениРасширенныйФормы.ТабельПериодРегистрацииПриИзменении(ЭтаФорма); 
	
	//Для инд = 29 по 31 Цикл
	//	Элементы["ВремяПредставление"+СокрЛП(инд)].Видимость = Истина;
	//КонецЦикла;
	//
	//КоличествоДнейвМесяце = День(КонецМесяца(Объект.ПериодРегистрации));
	//Если КоличествоДнейвМесяце = 30 Тогда
	//	Элементы.ВремяПредставление31.Видимость = Ложь;
	//ИначеЕсли КоличествоДнейвМесяце = 29 Тогда
	//	Элементы.ВремяПредставление31.Видимость = Ложь;
	//	Элементы.ВремяПредставление30.Видимость = Ложь; 
	//ИначеЕсли КоличествоДнейвМесяце = 28 Тогда
	//	Элементы.ВремяПредставление31.Видимость = Ложь;
	//	Элементы.ВремяПредставление30.Видимость = Ложь; 
	//	Элементы.ВремяПредставление29.Видимость = Ложь; 
	//КонецЕсли;  
	
	Объект.ДатаНачалаПериода = "";
	Объект.ДатаОкончанияПериода =  "";  
КонецПроцедуры

&НаСервере
Процедура ПериодВводаДанныхОВремениПриИзмененииНаСервере()
	Форма = ЭтаФорма;    
	Если ЗначениеЗаполнено(Форма.Объект.ПериодРегистрации) Тогда
		
		Если Форма.Объект.ПериодВводаДанныхОВремени = ПредопределенноеЗначение("Перечисление.ЛБ_ПериодыВводаДанныхОВремениПоловинки.ПерваяПоловинаТекущегоМесяца") Тогда
			Форма.Объект.ДатаНачалаПериода = НачалоМесяца(Форма.Объект.ПериодРегистрации);
			Форма.Объект.ДатаОкончанияПериода = Дата(Год(Форма.Объект.ПериодРегистрации), Месяц(Форма.Объект.ПериодРегистрации), 15);  
			
		ИначеЕсли Форма.Объект.ПериодВводаДанныхОВремени = ПредопределенноеЗначение("Перечисление.ЛБ_ПериодыВводаДанныхОВремениПоловинки.ВтораяПоловинаТекущегоМесяца") Тогда
			Форма.Объект.ДатаНачалаПериода = Дата(Год(Форма.Объект.ПериодРегистрации), Месяц(Форма.Объект.ПериодРегистрации), 16);
			Форма.Объект.ДатаОкончанияПериода = КонецМесяца(Форма.Объект.ПериодРегистрации); 
			
			
		Иначе
			Форма.Объект.ДатаНачалаПериода = "";
			Форма.Объект.ДатаОкончанияПериода = "";
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВводМесяцаРегулирование(РедактируемыйОбъект, ПутьРеквизита, ПутьРеквизитаПредставления, Направление, Модифицированность = Ложь, ЗначениеМесяцаПоУмолчанию = Неопределено) Экспорт
	
	Значение = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(РедактируемыйОбъект, ПутьРеквизита);
	
	Если Значение <= '19000101' Тогда
		
		Если ЗначениеМесяцаПоУмолчанию = Неопределено Тогда
			Значение = НачалоМесяца(ОбщегоНазначенияКлиент.ДатаСеанса());
		Иначе
			Значение = НачалоМесяца(ЗначениеМесяцаПоУмолчанию);
		КонецЕсли;
		
		НовоеЗначение = Значение;
		
	Иначе
		НовоеЗначение = ДобавитьМесяц(Значение, Направление);
	КонецЕсли; 
	
	Если НовоеЗначение >= '00010101' Тогда
		
		Значение = НовоеЗначение;
		
		ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(РедактируемыйОбъект, ПутьРеквизита, Значение);
		ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(РедактируемыйОбъект, ПутьРеквизитаПредставления, ПолучитьПредставлениеМесяца(Значение));
		
		Модифицированность = Истина;
	 	
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПредставлениеМесяца(ДатаНачалаМесяца) Экспорт
	
	Возврат Формат(ДатаНачалаМесяца, "ДФ='ММММ гггг'");
	
КонецФункции


&НаСервере
Процедура УдалитьСтрокиПоСотруднику(Знач УдаляемыеСтроки)
	Для Каждого ИдентификаторУдаляемойСтроки Из УдаляемыеСтроки Цикл
		//УчетРабочегоВремениРасширенныйФормы.ТабельУдалитьСтрокиПоСотруднику(ЭтаФорма, ИдентификаторУдаляемойСтроки);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УстановитьВысотуСтрокНаСервере() Экспорт
	//УчетРабочегоВремениРасширенныйФормы.ТабельУстановитьВысотуСтрокПоСотрудникам(ЭтаФорма, УстанавливаемаяВысотаСтроки);
КонецПроцедуры

&НаСервере
Функция АдресСпискаПодобранныхСотрудников()
	
	Возврат ПоместитьВоВременноеХранилище(Объект.ДанныеОВремени.Выгрузить(,"Сотрудник").ВыгрузитьКолонку("Сотрудник"), УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ЗаполнитьДанныеФормыПоОрганизации();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтветственныхЛиц()
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Возврат;
	КонецЕсли;
	
	// ЗарплатаКадрыПодсистемы.ПодписиДокументов
	//ПодписиДокументов.ЗаполнитьПодписиПоОрганизации(ЭтотОбъект);
	// Конец ЗарплатаКадрыПодсистемы.ПодписиДокументов
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормыПоОрганизации()
	
	//Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
	//	Возврат;
	//КонецЕсли;
	
	//ЗапрашиваемыеЗначения = Новый Структура("Организация, МесяцРасчета", "Объект.Организация", "Объект.ПериодРегистрации");
	//ЗарплатаКадры.ЗаполнитьОтветственныхРаботниковОрганизацииВФорме(ЭтотОбъект, ЗапрашиваемыеЗначения, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("Организация"));
	//ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтаФорма, "Объект.ПериодРегистрации", "МесяцРегистрацииСтрокой");
	
	//УстановитьОтветственныхЛиц();
	
КонецПроцедуры

&НаСервере
Процедура СортироватьПоВозрастаниюНаСервере()
	//УчетРабочегоВремениРасширенныйФормы.ДанныеОВремениСортироватьПоВозрастанию(Объект.ДанныеОВремени);
КонецПроцедуры

&НаСервере
Процедура СортироватьПоУбываниюНаСервере()
	//УчетРабочегоВремениРасширенныйФормы.ДанныеОВремениСортироватьПоУбыванию(Объект.ДанныеОВремени);
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьИтоги()
ТабЧасть           = Объект.ДанныеОВремени; 

ТТабИтог   = 0;
ТРежимИтог = 0;
тФиксИтог  = 0; 
тОкрИтог   = 0;


Для каждого стр из ТабЧасть  цикл
	Если Элементы.ДанныеОВремени.ПроверитьСтроку(стр.ПолучитьИдентификатор()) тогда
		ТТабИтог = ТТабИтог + стр.ТТаб;
		ТРежимИтог = ТРежимИтог + стр.ТРежим;
		тФиксИтог  = тФиксИтог + стр.ТФикс;
		тОкрИтог   = тОкрИтог + стр.ТОкр;
	КонецЕсли;
КонецЦикла;

Элементы.ДанныеОВремениТТаб.ТекстПодвала    = ТТабИтог;
Элементы.ДанныеОВремениТФикс.ТекстПодвала   = тФиксИтог;
Элементы.ДанныеОВремениТОкр.ТекстПодвала    = тОкрИтог;
Элементы.ДанныеОВремениТРежим.ТекстПодвала  = ТРежимИтог;

КонецПроцедуры


&НаСервере
Процедура ПерезаполнитьСотрудникаНаСервере(Сотрудники)
	
	Если ТипЗнч(Сотрудники) <> Тип("Массив") Тогда
		Сотрудники = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Сотрудники);
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.СвернутьМассив(Сотрудники);
	
	СтрокиПоСотрудникам = Новый Соответствие;
	Для Каждого Сотрудник Из Сотрудники Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("Сотрудник", Сотрудник);
		МассивСтрокПоСотруднику = Объект.ДанныеОВремени.НайтиСтроки(Отбор);
		//УчетРабочегоВремениРасширенныйФормы.ТабельОчиститьСтрокиСотрудника(МассивСтрокПоСотруднику);
		СтрокиПоСотрудникам.Вставить(Сотрудник, МассивСтрокПоСотруднику);
		
	КонецЦикла;
	
	//УчетРабочегоВремениРасширенныйФормы.ТабельЗаполнитьДанныеПоСотрудникам(ЭтотОбъект, Сотрудники, СтрокиПоСотрудникам, ВысотаСтроки); 
	
	Модифицированность = Истина;
	
КонецПроцедуры

// КадровыйЭДО
&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПодключаемыеКоманды(УправляемаяФорма)
	//КадровыйЭДОКлиентСервер.ОбновитьКоманды(УправляемаяФорма, УправляемаяФорма.Объект, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДанныеОВремениВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//Если СтрНайти(Поле.Имя, "ВремяПредставление") > 0 Тогда
	//	НомерДня = СтрЗаменить(Поле.Имя, "ВремяПредставление", "");
	//	
	//	ТекСтрока = Элементы.ДанныеОВремени.ТекущиеДанные;  
	//	ПараметрыФормы = Новый Структура;
	//	ПараметрыФормы.Вставить("Сотрудник", 	ТекСтрока.Сотрудник);
	//	ПараметрыФормы.Вставить("Часов", 		ТекСтрока["Часов"+НомерДня]); 
	//	ПараметрыФормы.Вставить("ВидВремени", 	ТекСтрока["ВидВремени"+НомерДня]); 
	//	ПараметрыФормы.Вставить("Территория", 	ТекСтрока["Территория"+НомерДня]);
	//	ПараметрыФормы.Вставить("НомерДня", 	НомерДня);  
	//	ПараметрыФормы.Вставить("ДатаРаботы",   (Объект.ПериодРегистрации + НомерДня-1)*86400);
	//	ПараметрыФормы.Вставить("Ломбард",      ТекСтрока.Ломбард); 
	//	ПараметрыФормы.Вставить("ПолучитьЧасыИзГрафика",     Ложь); 
	//			               
	//	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеОкончанииРедактированияДанныхОВремени", ЭтотОбъект);
	//	ОткрытьФорму("ОбщаяФорма.ЛБ_РедактированиеДанныхУчетаВремениЗаДень", Параметрыформы, ЭтаФорма,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	//КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПослеОкончанииРедактированияДанныхОВремени(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;  
	
	НомерДня = Результат.НомерДня;
	ТекСтрока = Элементы.ДанныеОВремени.ТекущиеДанные;
	ТекСтрока["Часов"+НомерДня] 				= Результат.Часов; 
	ТекСтрока["ВидВремени"+НомерДня] 			= Результат.ВидВремени;
	ТекСтрока["Территория"+НомерДня] 			= Результат.Территория;
	ТекСтрока["ВремяПредставление"+НомерДня] 	= СформируйПредставлениеВремени(Результат.ВидВремени, Результат.Часов, Результат.Территория);

	
КонецПроцедуры 

&НаСервере
Функция СформируйПредставлениеВремени(ВидВремени, Часов, Территория)
	Возврат ЛБ_ОбщегоНазначения.СформироватьПредставлениеВремени(ВидВремени, Часов, Территория);
КонецФункции 

Функция СформироватьПредставлениеВремени(ВидВремени, Часов, Территория)
	Рез = "";
	Если ЗначениеЗаполнено(ВидВремени) Тогда
		Если ВидВремени = Справочники.ЛБ_ВидыИспользованияРабочегоВремени.Явка Тогда
			Если Часов > 0 Тогда
				Рез = СокрЛП(Часов);
			КонецЕсли;
		Иначе
			Рез = СокрЛП(ВидВремени.БуквенныйКод);
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Территория) Тогда
			Рез = Рез +" "+"л"+СокрЛП(Территория.НомерЛомбарда);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Рез;	
КонецФункции


&НаКлиенте
Процедура ДанныеОВремениСотрудник1ПриИзменении(Элемент)
	//ТекСтр = Элементы.ДанныеОВремени.ТекущиеДанные; 
	//Ошибка = Ложь; 
	//
	//Для каждого стр из Объект.ДанныеОВремени Цикл
	//	Если стр <> ТекСтр и ТекСтр.Ломбард = Стр.Ломбард и ТекСтр.Сотрудник = Стр.Сотрудник Тогда
	//		
	//		Сообщение = Новый СообщениеПользователю;
	//		Сообщение.Текст = "Сотрудник указан дважды в одном ломбарде";   
	//		Сообщение.Поле = "Объект.ДанныеОВремени["+СокрЛП(Стр.НомерСтроки-1)+"].Сотрудник";
	//		Сообщение.Сообщить(); 
	//	
	//		Ошибка = Истина;
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Если Ошибка Тогда
	//	Объект.ДанныеОВремени.Удалить(Элементы.ДанныеОВремени.ТекущиеДанные.НомерСтроки - 1);
	//Иначе
	//	ЗаполнитьПервоначальныеДанныеПоСотруднику();
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтборСотрудникПриИзменении(Элемент)  
	Если ЗначениеЗаполнено(ОтборСотрудник) Тогда
		Элементы.ДанныеОВремени.ОтборСтрок = Новый ФиксированнаяСтруктура("Сотрудник", ОтборСотрудник);  
		Элементы.тзПротокол.ОтборСтрок = Новый ФиксированнаяСтруктура("Сотрудник", ОтборСотрудник); 
	КонецЕсли;  
	РасчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ОтборСотрудникОчистка(Элемент, СтандартнаяОбработка)
	Элементы.ДанныеОВремени.ОтборСтрок = Неопределено;
	Элементы.тзПротокол.ОтборСтрок = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеОВремениТТабПриИзменении(Элемент) 
	ПроставитьЯвкуНаСервере(); 
	
	РасчитатьИтоги();
КонецПроцедуры  

Процедура ПроставитьЯвкуНаСервере()
	ИдентификаторСтроки = ЭтаФорма.Элементы.ДанныеОВремени.ТекущаяСтрока;
	ТекСтр = Объект.ДанныеОВремени.НайтиПоИдентификатору(ИдентификаторСтроки); 
	
	Если ТекСтр.Ттаб = 0 Тогда
		ТекСтр.ВидВремени = Справочники.ЛБ_ВидыИспользованияРабочегоВремени.ВыходныеДни; 
		ТекСтр.ВремяПредставление = СформироватьПредставлениеВремени(ТекСтр.ВидВремени, 0, "");  
	ИначеЕсли ТекСтр.Ттаб > 0 Тогда        
		ТекСтр.ВидВремени = Справочники.ЛБ_ВидыИспользованияРабочегоВремени.Явка; 
		ТекСтр.ВремяПредставление = СформироватьПредставлениеВремени(ТекСтр.ВидВремени, 0, "");
	КонецЕсли; 	
	
	ТекСтр.ТОткл = ТекСтр.ТТаб - ТекСтр.тРежим;

КонецПроцедуры 

Функция СформироватьМассивОтделений() 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
	|ИЗ
	|	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(
	|			,
	|			Ломбард = &Ломбард
	|				И Ломбард.Закрыт = ЛОЖЬ) КАК ЛБ_ОтделенияЛомбардовСрезПоследних"; 
	Запрос.УстановитьПараметр("Ломбард", ПараметрыСеанса.ТекущийЛомбард);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Отделение");
	
КонецФункции

Функция СформироватьМассивСотрудниковОтделения() 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ссылка
	|ИЗ
	|	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(
	|			&НаДату,
	|			Отделение = &Отделение
	|				И Ломбард.Закрыт = ЛОЖЬ) КАК ЛБ_ОтделенияЛомбардовСрезПоследних"; 
	Запрос.УстановитьПараметр("НаДату", Объект.Дата);
	Запрос.УстановитьПараметр("Отделение", Объект.Отделение);
	
	тз = Запрос.Выполнить().Выгрузить(); 
	массивЛомб = тз.ВыгрузитьКолонку("Ссылка");	
	
	
	Запрос2 = Новый Запрос; 
	Запрос2.Текст = "ВЫБРАТЬ
	|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Подразделение КАК Ломбард,
	|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия КАК ВидСобытия
	|ИЗ
	|	РегистрСведений.ЛБ_КадроваяИсторияСотрудников.СрезПоследних(&НаДату, ) КАК ЛБ_КадроваяИсторияСотрудниковСрезПоследних
	|ГДЕ
	|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Подразделение В(&Подразделение)
	|	И ЛБ_КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия <> &ВидСобытия
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Подразделение.НомерЛомбарда";
	Запрос2.УстановитьПараметр("НаДату", Объект.Дата);
	Запрос2.УстановитьПараметр("Подразделение", массивЛомб); 
	Запрос2.УстановитьПараметр("ВидСобытия", Перечисления.ЛБ_ВидыКадровыхСобытий.Увольнение);
	
	
	массив = Новый Массив;
	
	Выборка = Запрос2.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ВидСобытия = Перечисления.ЛБ_ВидыКадровыхСобытий.Увольнение Тогда
			Продолжить;
		КонецЕсли; 
			
		//Если ЛБ_ОбщегоНазначения.СотрудникЯвляетсяНачальникомОтделения(Выборка.Сотрудник, Объект.Дата) Тогда
		//	продолжить;
		//КонецЕсли;

		массив.Добавить(Выборка.Сотрудник);
		
	КонецЦикла; 	
	
	Возврат Массив;
	
КонецФункции

&НаКлиенте
Процедура ОтделениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Если Пользователь_ЭтоЛомбард() Тогда
		
		Элементы.Отделение.РежимВыбораИзСписка = Истина;
		
		Элементы.Отделение.СписокВыбора.Очистить();
		
		массивОтделений = СформироватьМассивОтделений();    
		
		Элементы.Отделение.СписокВыбора.ЗагрузитьЗначения(массивОтделений); 
	Иначе
		Элементы.Отделение.РежимВыбораИзСписка = Ложь;
	КонецЕсли;
КонецПроцедуры

Функция Пользователь_ЭтоЛомбард()
	Возврат ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард;	
КонецФункции

&НаКлиенте
Процедура ОтборСотрудникНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Элемент.РежимВыбораИзСписка = Истина;
	
	//СтандартнаяОбработка = Ложь; 
	
	Элемент.СписокВыбора.Очистить();
	
	массивСотрудников = СформироватьМассивСотрудниковОтделения();    
	
	Элемент.СписокВыбора.ЗагрузитьЗначения(массивСотрудников);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусКонтроль(Команда)
	УстановитьСтатусКонтрольНаСервере();
	Оповестить("Запись_СменаСтатуса", Неопределено, Объект.Ссылка);  
КонецПроцедуры 

&НаСервере
Процедура УстановитьСтатусКонтрольНаСервере()
	Объект.Контроль = Истина;
	ДокОбъект = РеквизитФормыВЗначение("Объект");
    ДокОбъект.Записать(РежимЗаписиДокумента.Запись);  
КонецПроцедуры 

&НаСервере
Процедура УстановитьСтатусПроектНаСервере()
	Объект.Контроль = Ложь;
	ДокОбъект = РеквизитФормыВЗначение("Объект");
    ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);  
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусПроект(Команда)
	УстановитьСтатусПроектНаСервере();
	Оповестить("Запись_СменаСтатуса", Неопределено, Объект.Ссылка);  
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатусФактНаСервере()
	Объект.Контроль = Ложь;
	ДокОбъект = РеквизитФормыВЗначение("Объект");
    ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);   
КонецПроцедуры

&НаКлиенте
Процедура кнУстановитьСтатусФакт(Команда)
	УстановитьСтатусФактНаСервере();
	Оповестить("Запись_СменаСтатуса", Неопределено, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Запись_СменаСтатуса" Тогда
		ОбновитьОтображениеДанных(); 
		ЭтаФорма.Прочитать();  
		УстановитьСтатусДокумента(); 
	КонецЕсли;   
КонецПроцедуры








#КонецОбласти
