
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ОтчетПоездок") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ОтчетПоездок", "Отчет поездок", 
		
		ПечатьОтчета(МассивОбъектов, ПараметрыПечати), , "Документ.ЛБ_МаршрутПоездки.ПФ_MXL_ОтчетПоездки");
	КонецЕсли; 	
	
КонецПроцедуры  

Функция ПечатьОтчета(МассивОбъектов, Период) 
	
	ТабДок = Новый ТабличныйДокумент; 
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЛБ_МаршрутПоездки.ПФ_MXL_ОтчетПоездки");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка"); 
	
	Если Период.Свойство("Период") Тогда
		ОбластьШапка.Параметры.Период = СтрШаблон("за %1", Период.Период);
	Иначе
		ОбластьШапка.Параметры.Период = СтрШаблон("с %1 по %2", Период.НачалоПериода, Период.ОкончаниеПериода); 
	КонецЕсли;	
	
	ОбластьШапка.Параметры.ФИО = МассивОбъектов[0].Руководитель;
	ОбластьШапка.Параметры.Должность = МассивОбъектов[0].Должность;
	областьШапка.Параметры.Отделение = МассивОбъектов[0].Отделение;
	ТабДок.Вывести(ОбластьШапка);
	
	ОбластьШапкаТЧ = Макет.ПолучитьОбласть("ШапкаТЧ");
	ТабДок.Вывести(ОбластьШапкаТЧ);
	
	ОбластьТаблица = Макет.ПолучитьОбласть("СтрокаТЧ"); 
	Для Каждого Строка Из МассивОбъектов Цикл
		ЗаполнитьЗначенияСвойств(ОбластьТаблица.Параметры, Строка);
		Если ЗначениеЗаполнено(Строка.ПунктНазначения) Тогда
			ОбластьТаблица.Параметры.ПунктВизита = Строка.ПунктНазначения;
		ИначеЕсли 
			ЗначениеЗаполнено(Строка.ЛомбардПунктаНазначения) Тогда
			ОбластьТаблица.Параметры.ПунктВизита = Строка.ЛомбардПунктаНазначения;  
		КонецЕсли;
		ТабДок.Вывести(ОбластьТаблица); 
	КонецЦикла; 
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.ФИО = ПараметрыСеанса.ТекущийСотрудник;
	ТабДок.Вывести(ОбластьПодвал);	
	
	Возврат ТабДок;
КонецФункции
