
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Разделитель = "/";
	Длина = СтрДлина(ЭтотОбъект.Номер);
	РазделительВСтроке = СтрНайти(ЭтотОбъект.Номер, Разделитель);
	
	Если РазделительВСтроке > 0 Тогда
		НомерЛ = Лев(ЭтотОбъект.Номер, РазделительВСтроке - 1);
		НомерД = Прав(ЭтотОбъект.Номер, Длина - РазделительВСтроке);
		
		НомерЛБезНулей = СтроковыеФункцииКлиентСервер.УдалитьПовторяющиесяСимволы(НомерЛ, "0");
		НомерДБезНулей = СтроковыеФункцииКлиентСервер.УдалитьПовторяющиесяСимволы(НомерД, "0");
		
		Если ЭтотОбъект.Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис Тогда
			ЭтотОбъект.НомерДокумента = НомерДБезНулей;
		Иначе
			ЭтотОбъект.НомерДокумента = НомерЛБезНулей + Разделитель + НомерДБезНулей;
		КонецЕсли;
		
		ЭтотОбъект.Записать();
	КонецЕсли;
	
	Движения.ЛБ_ДвижениеОтходов.Записывать = Истина;

	Движение = Движения.ЛБ_ДвижениеОтходов.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Ломбард = ЭтотОбъект.Ломбард;
	Движение.ВесНетто = ЭтотОбъект.ВесБезТары;
	Движение.Организация = ЭтотОбъект.Организация;
	Движение.Период = ЭтотОбъект.Дата;
	//+МАН 17.12.25
	Движение.Склад = ЭтотОбъект.Склад;
	
	Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОтходыДМ.ПринятьПеремещение Тогда

		Движение.ЛомбардПолучатель = ЭтотОбъект.ЛомбардОтправитель;
		Движение.СкладПолучатель = ЭтотОбъект.СкладОтправитель;
		
		Движения.ЛБ_ОтходыДМВПути.Записывать = Истина;
		
		Движение = Движения.ЛБ_ОтходыДМВПути.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Организация = ЭтотОбъект.Организация;
		Движение.ЛомбардОтправитель = ЭтотОбъект.ЛомбардОтправитель;
		Движение.СкладОтправитель = ЭтотОбъект.СкладОтправитель;
		Движение.ЛомбардПолучатель = ЭтотОбъект.Ломбард;
		Движение.СкладПолучатель = ЭтотОбъект.Склад;
		Движение.ВесНетто = ЭтотОбъект.ВесБезТары;
		Движение.Период = ЭтотОбъект.Дата;
		Движение.ДокументПеремещения = ЭтотОбъект.ДокументПеремещения;
	КонецЕсли;
	//-МАН
	
КонецПроцедуры
