#Область ОписаниеПеременных

&НаКлиенте
Перем ИдентификаторЗамераПроведениеНеНужнаРегистрацияОшибки;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ЗарплатаКадрыПодсистемы.ПодписиДокументов
	//ПодписиДокументов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ЗарплатаКадрыПодсистемы.ПодписиДокументов
	
			
	Если Параметры.Ключ.Пустая() Тогда
		ЗначенияДляЗаполнения = Новый Структура("Организация, МесяцРасчета", 
								"Объект.Организация", "Объект.ПериодРегистрации");
		
		//Если ПолучитьФункциональнуюОпцию("ВыполнятьРасчетЗарплатыПоПодразделениям") Тогда
		//	ЗначенияДляЗаполнения.Вставить("Подразделение", "Объект.Подразделение");
		//КонецЕсли;

		//ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтотОбъект, ЗначенияДляЗаполнения);
		
		Объект.ОтветственныйСотрудник = ПараметрыСеанса.ТекущийСотрудник;
		Объект.ОтветственныйПользователь = ПараметрыСеанса.ТекущийПользователь;

		
		ЗаполнитьДанныеФормыПоОрганизации();
	КонецЕсли;

	//УчетРабочегоВремениРасширенныйФормы.ТабельПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	// Обработчик подсистемы "ВерсионированиеОбъектов".
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	//Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба") Тогда
	//	Модуль = ОбщегоНазначения.ОбщийМодуль("ГосударственнаяСлужбаФормы");
	//	Модуль.УстановитьПараметрыВыбораСотрудников(ЭтаФорма, "ДанныеОВремениСотрудник");
	//КонецЕсли; 
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
//	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ПроцессыОбработкиДокументов
	//Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
	//	МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
	//	МодульПроцессыОбработкиДокументовЗарплата.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	//КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
	
	// БлокировкаИзмененияОбъектов
	//БлокировкаИзмененияОбъектов.ПриСозданииНаСервереФормыОбъекта(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	// Конец БлокировкаИзмененияОбъектов
	
	// КадровыйЭДО
	//КадровыйЭДО.ПриСозданииНаСервереФормыОбъекта(ЭтотОбъект, Отказ, СтандартнаяОбработка, Объект);
	// Конец КадровыйЭДО
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	//ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	//УчетРабочегоВремениРасширенныйФормы.ТабельПриЧтенииНаСервере(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	//ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	//УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	//УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ПроцессыОбработкиДокументов
	//Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
	//	МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
	//	МодульПроцессыОбработкиДокументовЗарплата.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	//КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
	
	// БлокировкаИзмененияОбъектов
	//БлокировкаИзмененияОбъектов.ПриЧтенииНаСервереФормыОбъекта(ЭтотОбъект, ТекущийОбъект);
	// Конец БлокировкаИзмененияОбъектов
	
	// КадровыйЭДО
	//КадровыйЭДО.ПриЧтенииНаСервереФормыОбъекта(ЭтотОбъект, ТекущийОбъект, Объект);
	// Конец КадровыйЭДО
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ИдентификаторЗамераПроведениеНеНужнаРегистрацияОшибки = ОценкаПроизводительностиКлиент.ЗамерВремени();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//УчетРабочегоВремениРасширенныйФормы.ТабельПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
	// СтандартныеПодсистемы.Свойства
	//УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ПроцессыОбработкиДокументов
	//Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
	//	МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
	//	МодульПроцессыОбработкиДокументовЗарплата.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	//КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	//УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	//УчетРабочегоВремениРасширенныйФормы.ТабельПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи); 
	
	// ЗарплатаКадрыПодсистемы.ПодписиДокументов
	//ПодписиДокументов.ПослеЗаписиНаСервере(ЭтаФорма);
	// Конец ЗарплатаКадрыПодсистемы.ПодписиДокументов
	
	//ПерерасчетЗарплаты.РегистрацияПерерасчетовПоПредварительнымДаннымВФоне(ТекущийОбъект.Ссылка);
	
	// ПроцессыОбработкиДокументов
	//Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
	//	МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
	//	МодульПроцессыОбработкиДокументовЗарплата.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	//КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
	
	// БлокировкаИзмененияОбъектов
	//БлокировкаИзмененияОбъектов.ПослеЗаписиНаСервереФормыОбъекта(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец БлокировкаИзмененияОбъектов
	
	// КадровыйЭДО
	//КадровыйЭДО.ПослеЗаписиНаСервереФормыОбъекта(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Объект);
	// Конец КадровыйЭДО
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	//Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	//	ОценкаПроизводительностиКлиент.УстановитьКлючевуюОперациюЗамера(ИдентификаторЗамераПроведениеНеНужнаРегистрацияОшибки, "ПроведениеДокументаТабельУчетаРабочегоВремени");
	//КонецЕсли;
	
	//ИсправлениеДокументовЗарплатаКадрыКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);
	
	Оповестить("Запись_ТабельУчетаРабочегоВремени", ПараметрыЗаписи, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	//УчетРабочегоВремениРасширенныйКлиент.ТабельОбработкаОповещения(ЭтаФорма, ИмяСобытия, Параметр, Источник);
	
	// СтандартныеПодсистемы.Свойства
	//Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
	//	ОбновитьЭлементыДополнительныхРеквизитов();
	//	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	//КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	// КадровыйЭДО
	//КадровыйЭДОКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	// Конец КадровыйЭДО
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтаФорма, "Объект.ПериодРегистрации", "МесяцРегистрацииСтрокой");
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
//	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	//УчетРабочегоВремениРасширенныйКлиент.ТабельОрганизацияПриИзменении(ЭтаФорма);
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	УстановитьОтветственныхЛиц();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	//УчетРабочегоВремениРасширенныйКлиент.ТабельОрганизацияПриИзменении(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ПериодРегистрацииНачалоВыбораЗавершение", ЭтотОбъект);
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтаФорма, ЭтаФорма, "Объект.ПериодРегистрации", "МесяцРегистрацииСтрокой", , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииНачалоВыбораЗавершение(ЗначениеВыбрано, ДополнительныеПараметры) Экспорт
	
	ПериодРегистрацииПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодВводаДанныхОВремениПриИзменении(Элемент)
	ПериодВводаДанныхОВремениПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПериодаПриИзменении(Элемент)
	
	Если НачалоМесяца(Объект.ДатаНачалаПериода) <> НачалоМесяца(Объект.ДатаОкончанияПериода) Тогда
		Объект.ДатаОкончанияПериода = КонецМесяца(Объект.ДатаНачалаПериода);
	КонецЕсли;
	
	ПериодРегистрацииПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПериодаПриИзменении(Элемент)
	
	Если НачалоМесяца(Объект.ДатаНачалаПериода) <> НачалоМесяца(Объект.ДатаОкончанияПериода) Тогда
		Объект.ДатаОкончанияПериода = КонецМесяца(Объект.ДатаНачалаПериода);
	КонецЕсли;
	
	ПериодРегистрацииПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцРегистрацииСтрокойПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтаФорма, "Объект.ПериодРегистрации", "МесяцРегистрацииСтрокой", Модифицированность);
	
	ПериодРегистрацииПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцРегистрацииСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ВводМесяцаРегулирование(ЭтаФорма, "Объект.ПериодРегистрации", "МесяцРегистрацииСтрокой", Направление, Модифицированность);
	
	ПериодРегистрацииПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцРегистрацииСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МесяцРегистрацииСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	//ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ВысотаСтрокиПриИзменении(Элемент)
	//УчетРабочегоВремениРасширенныйКлиент.ТабельВысотаСтрокиПриИзменении(ЭтаФорма);
КонецПроцедуры

// Обработчик подсистемы "ПодписиДокументов".
&НаКлиенте
Процедура Подключаемый_ПодписиДокументовЭлементПриИзменении(Элемент) 
	//ПодписиДокументовКлиент.ПриИзмененииПодписывающегоЛица(ЭтаФорма, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПодписиДокументовЭлементНажатие(Элемент) 
	//ПодписиДокументовКлиент.РасширеннаяПодсказкаНажатие(ЭтаФорма, Элемент.Имя);
КонецПроцедуры
// Конец Обработчик подсистемы "ПодписиДокументов".

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДанныеОВремени

&НаКлиенте
Процедура ДанныеОВремениПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	УдалитьСтрокиПоСотруднику(Элементы.ДанныеОВремени.ВыделенныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеОВремениВремяПредставлениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	//УчетРабочегоВремениРасширенныйКлиент.ТабельДанныеОВремениВремяПредставлениеОкончаниеВводаТекста(ЭтаФорма, Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ДанныеОВремениВремяПредставлениеАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	//УчетРабочегоВремениРасширенныйКлиент.ТабельДанныеОВремениВремяПредставлениеАвтоПодбор(ЭтаФорма, Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ДанныеОВремениВремяПредставлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УчетРабочегоВремениРасширенныйКлиент.ТабельДанныеОВремениВремяПредставлениеОбработкаВыбора(ЭтаФорма, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ДанныеОВремениВремяПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УчетРабочегоВремениРасширенныйКлиент.ТабельДанныеОВремениПредставлениеНачалоВыбора(ЭтаФорма, СтандартнаяОбработка, Элемент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект)
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

#КонецОбласти

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ОбновитьПодключаемыеКоманды(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ИсправлениеДокументов
&НаКлиенте
Процедура Подключаемый_Исправить(Команда)
	//ИсправлениеДокументовЗарплатаКадрыКлиент.Исправить(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Сторнировать(Команда)
	//ИсправлениеДокументовЗарплатаКадрыКлиент.Сторнировать(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПерейтиКИсправлению(Команда)
	//ИсправлениеДокументовЗарплатаКадрыКлиент.ПерейтиКИсправлению(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПерейтиКИсправленному(Команда)
	//ИсправлениеДокументовЗарплатаКадрыКлиент.ПерейтиКИсправленному(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПерейтиКСторно(Команда)
	//ИсправлениеДокументовЗарплатаКадрыКлиент.ПерейтиКСторно(ЭтотОбъект);
КонецПроцедуры
// Конец ИсправлениеДокументов

&НаКлиенте
Процедура Заполнить(Команда) Экспорт  
	
	Если Объект.ДанныеОВремени.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru = 'Перед заполнением табличная часть будет очищена. Заполнить?'");
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьИзГрафикаЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, Заголовок);
	Иначе
		ЗаполнитьСотрудникамиОрганизацииНаСервере(); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзГрафикаЗавершение(Результат, ДополнительныеПараметры) Экспорт	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьСотрудникамиОрганизацииНаСервере();
	КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура Подбор(Команда)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("ПодборСотрудникаВФормеДокументаТабельУчетаРабочегоВремени");
	
	//УчетРабочегоВремениРасширенныйКлиент.ТабельПодбор(ЭтаФорма, АдресСпискаПодобранныхСотрудников());
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВверх(Команда)
	//УчетРабочегоВремениРасширенныйКлиент.ТабельПереместитьСтрокуВверх(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВниз(Команда)
	//УчетРабочегоВремениРасширенныйКлиент.ТабельПереместитьСтрокуВниз(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоВозрастанию(Команда)
	СортироватьПоВозрастаниюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоУбыванию(Команда)
	СортироватьПоУбываниюНаСервере();
КонецПроцедуры

// БлокировкаИзмененияОбъектов
&НаКлиенте
Процедура Подключаемый_РазблокироватьФормуОбъекта(Команда)
	
	//БлокировкаИзмененияОбъектовКлиент.РазблокироватьФормуОбъекта(ЭтотОбъект, Объект.Ссылка);
	
КонецПроцедуры
// Конец БлокировкаИзмененияОбъектов

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#Область ИсправлениеДокументов

&НаКлиенте
Процедура УстановитьПоляИсправленияНаКлиенте() Экспорт
	
	УстановитьПоляИсправления(ЭтаФорма);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПоляИсправления(Форма)

	//ИсправлениеДокументовЗарплатаКадрыКлиентСервер.УстановитьПоляИсправления(Форма, "ПериодическиеСведения");
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ОбновитьОписаниеВидовВремени() Экспорт
	//УчетРабочегоВремениРасширенныйФормы.ТабельПоместитьОписаниеВидовВремениВДанныеФормы(ЭтаФорма);	
КонецПроцедуры


&НаСервере
Функция ЗаполнитьСотрудникамиОрганизацииНаСервере()
	Объект.ДанныеОВремени.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ссылка
	               |ИЗ
	               |	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(
	               |			&НаДату,
	               |			Отделение = &Отделение
	               |				И Ломбард.Закрыт = ЛОЖЬ) КАК ЛБ_ОтделенияЛомбардовСрезПоследних"; 
	Запрос.УстановитьПараметр("НаДату", Объект.Дата);
	Запрос.УстановитьПараметр("Отделение", Объект.Отделение);

	тз = Запрос.Выполнить().Выгрузить(); 
	массивЛомб = тз.ВыгрузитьКолонку("Ссылка");
	
				   
	
	Запрос2 = Новый Запрос;

	Запрос2.Текст = "ВЫБРАТЬ
	                |	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	                |	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Подразделение КАК Ломбард
	                |ИЗ
	                |	РегистрСведений.ЛБ_КадроваяИсторияСотрудников.СрезПоследних(&НаДату, ) КАК ЛБ_КадроваяИсторияСотрудниковСрезПоследних
	                |ГДЕ
	                |	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Подразделение В(&Подразделение)
	                |	И ЛБ_КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия <> &ВидСобытия
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник,
	                |	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Подразделение
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Подразделение.НомерЛомбарда";
	Запрос2.УстановитьПараметр("НаДату", Объект.Дата);
	Запрос2.УстановитьПараметр("Подразделение", массивЛомб); 
	Запрос2.УстановитьПараметр("ВидСобытия", Перечисления.ЛБ_ВидыКадровыхСобытий.Увольнение);
	

	
	Выборка = Запрос2.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НовСтроч = Объект.ДанныеОВремени.Добавить();
		НовСтроч.Сотрудник = Выборка.Сотрудник;
		НовСтроч.Ломбард   = Выборка.Ломбард;		
	КонецЦикла; 	
КонецФункции

Функция НеявкаСотрудника(Сотр, Дата)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_СостоянияСотрудников.Сотрудник КАК Сотрудник,
	|	ЛБ_СостоянияСотрудников.Период КАК НачалоНеявки,
	|	ЛБ_СостоянияСотрудников.ДействуетДо КАК КонецНеявки,
	|	ЛБ_СостоянияСотрудников.ВидВремени КАК ВидВремени
	|ИЗ
	|	РегистрСведений.ЛБ_СостоянияСотрудников КАК ЛБ_СостоянияСотрудников
	|ГДЕ
	|	ЛБ_СостоянияСотрудников.Сотрудник = &Сотрудник
	|	И ЛБ_СостоянияСотрудников.Период <= &НачалоНеявки
	|	И ЛБ_СостоянияСотрудников.ДействуетДо >= &КонецНеявки";  
	
	Запрос.УстановитьПараметр("Сотрудник", Сотр); 
	Запрос.УстановитьПараметр("НачалоНеявки", НачалоДня(Дата)); 
	Запрос.УстановитьПараметр("КонецНеявки", КонецДня(Дата));
	
	тз = Запрос.Выполнить().Выгрузить();
	
	Возврат тз;		
КонецФункции

Функция ВернутьДатуУвольненияСотрудника(Сотр, НачДата, КонДата)
	
	ЗапросУв = Новый Запрос;
	ЗапросУв.Текст = "ВЫБРАТЬ
	|	ЛБ_КадроваяИсторияСотрудников.Период КАК Период
	|ИЗ
	|	РегистрСведений.ЛБ_КадроваяИсторияСотрудников КАК ЛБ_КадроваяИсторияСотрудников
	|ГДЕ
	|	ЛБ_КадроваяИсторияСотрудников.ВидСобытия = &ВидСобытия
	|	И ЛБ_КадроваяИсторияСотрудников.Период МЕЖДУ &НачДата И &КонДата
	|	И ЛБ_КадроваяИсторияСотрудников.Сотрудник = &Сотрудник";
	
	ЗапросУв.УстановитьПараметр("НачДата",    НачДата);
	ЗапросУв.УстановитьПараметр("КонДата",    КонДата); 
	ЗапросУв.УстановитьПараметр("Сотрудник",  Сотр);
	ЗапросУв.УстановитьПараметр("ВидСобытия", Перечисления.ЛБ_ВидыКадровыхСобытий.Увольнение); 
	
	ДатаУвольнения = Неопределено;
	
	ВыборкаУв = ЗапросУв.Выполнить().Выбрать();
	Если ВыборкаУв.Следующий() Тогда
		ДатаУвольнения = ВыборкаУв.Период;
	КонецЕсли;
	
	Возврат ДатаУвольнения;
КонецФункции


&НаСервере
Процедура ЗаполнитьПервоначальныеДанныеПоСотруднику() 
	ИдентификаторСтроки = ЭтаФорма.Элементы.ДанныеОВремени.ТекущаяСтрока;
	ТекСтр = Объект.ДанныеОВремени.НайтиПоИдентификатору(ИдентификаторСтроки); 
	КоличествоДнейвМесяце = День(КонецМесяца(Объект.ПериодРегистрации)); 
	
	Если ЗначениеЗаполнено(ТекСтр.Сотрудник) и ЗначениеЗаполнено(ТекСтр.Ломбард) Тогда  
		
		ДатаУвольнения = ВернутьДатуУвольненияСотрудника(ТекСтр.Сотрудник, Объект.ДатаНачалаПериода, КонецДня(Объект.ДатаОкончанияПериода));
  		
		ВидВремени_Выходной = Справочники.ЛБ_ВидыИспользованияРабочегоВремени.ВыходныеДни;  
		ВидВремени_Увольнение = Справочники.ЛБ_ВидыИспользованияРабочегоВремени.Увольнение; 	
		
		Для номерДня = 1 по КоличествоДнейвМесяце Цикл 
			промДата = Объект.ПериодРегистрации + (номерДня-1)*86400; 
			
			ТекСтр["ВидВремени"+СокрЛП(номерДня)] = "";
			ТекСтр["ВремяПредставление"+СокрЛП(номерДня)] = ""; 
			ТекСтр["Часов"+СокрЛП(номерДня)] = 0; 	
			
			
			//отбВых = Новый Структура;
			//отбВых.Вставить("Ломбард", ТекСтр.Ломбард);
			//отбВых.Вставить("Период", промДата);
			//
			//найдСтрВых = тзВых.НайтиСтроки(ОтбВых);
			//Если найдСтрВых.Количество() > 0 Тогда  
			//	ТекСтр["ВидВремени"+СокрЛП(номерДня)] = ВидВремени_Выходной;
			//	ТекСтр["ВремяПредставление"+СокрЛП(номерДня)] = СформироватьПредставлениеВремени(ВидВремени_Выходной, 0, "");
			//КонецЕсли;
			
			
			тзНеявка = НеявкаСотрудника(ТекСтр.Сотрудник, промДата); 
			Если тзНеявка.Количество() > 0 Тогда 			
				Для каждого стр из тзНеявка Цикл
					ТекСтр["ВидВремени"+СокрЛП(номерДня)] = стр.ВидВремени; 
					ТекСтр["ВремяПредставление"+СокрЛП(номерДня)] = СформироватьПредставлениеВремени(стр.ВидВремени, 0, "");
				КонецЦикла;	
			КонецЕсли;  
			
			Если ДатаУвольнения <> Неопределено Тогда
				Если промДата >= ДатаУвольнения Тогда 
					ТекСтр["ВидВремени"+СокрЛП(номерДня)] = ВидВремени_Увольнение;
					ТекСтр["ВремяПредставление"+СокрЛП(номерДня)] = СформироватьПредставлениеВремени(ВидВремени_Увольнение, 0, "");
				КонецЕсли;				
			КонецЕсли;
		КонецЦикла; 

		      		
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_ПротоколРаботы.Сотрудник КАК Сотрудник,
		               |	ЛБ_ПротоколРаботы.Дата КАК ДатаВремя,
		               |	ЛБ_ПротоколРаботы.Ломбард КАК Ломбард,
		               |	ЛБ_ПротоколРаботы.Действие КАК Действие,
		               |	НАЧАЛОПЕРИОДА(ЛБ_ПротоколРаботы.Дата, ДЕНЬ) КАК Дата
		               |ИЗ
		               |	РегистрСведений.ЛБ_ПротоколРаботы КАК ЛБ_ПротоколРаботы
		               |ГДЕ
		               |	ЛБ_ПротоколРаботы.Сотрудник = &Сотрудник
		               |	И ЛБ_ПротоколРаботы.Дата МЕЖДУ &НачДата И &КонДата
		               |	И ЛБ_ПротоколРаботы.Ломбард = &Ломбард
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ДатаВремя";
		Запрос.УстановитьПараметр("Сотрудник", ТекСтр.Сотрудник); 
		Запрос.УстановитьПараметр("Ломбард",   ТекСтр.Ломбард); 
		Запрос.УстановитьПараметр("НачДата",   Объект.ДатаНачалаПериода);
		Запрос.УстановитьПараметр("КонДата",   КонецДня(Объект.ДатаОкончанияПериода));
		
		тзПротокол = Запрос.Выполнить().Выгрузить(); 
		
		тзДни = тзПротокол.Скопировать();
		тзДни.Свернуть("Дата");
		тзДни.Сортировать("Дата Возр");
		
		Для каждого стрДни из тзДни Цикл 
			минут = 0;
			ДанныеРабДни = ВернутьДанныеПоРабочимДнямЛомбарда(стрДни.Дата, ТекСтр.Ломбард);
			Если ДанныеРабДни <> Неопределено Тогда	
				НачДня = ДанныеРабДни.Начало;
				КонДня  = ДанныеРабДни.Окончание;
				ПерерывНачало = ДанныеРабДни.ПерерывНачало; 
				ПерерывОкончание = ДанныеРабДни.ПерерывОкончание;
				
				Для каждого стрТЗ из тзПротокол Цикл					
					Если стрТЗ.Действие = Перечисления.ЛБ_ДействияПользователя.Вход Тогда
						ДатаВремяВхода = НачалоДня(стрТЗ.Дата) + (НачДня - НачалоДня(НачДня));  
						Если стрТЗ.ДатаВремя < ДатаВремяВхода Тогда
							ДатаОтсчета = ДатаВремяВхода;
						Иначе
							ДатаОтсчета = стрТЗ.ДатаВремя;
						КонецЕсли;								
					КонецЕсли;					
					Если стрТЗ.Действие = Перечисления.ЛБ_ДействияПользователя.Выход Тогда 
						ДатаВремяОкончанияГрафик = НачалоДня(стрТЗ.Дата) + (КонДня - НачалоДня(КонДня)); 
						Если стрТЗ.ДатаВремя > ДатаВремяОкончанияГрафик Тогда
							минут = минут + (ДатаВремяОкончанияГрафик - ДатаОтсчета)/60;
						Иначе
							минут = минут + (стрТЗ.ДатаВремя - ДатаОтсчета)/60;
						КонецЕсли;
					КонецЕсли;					
				КонецЦикла;
				
				Если ЗначениеЗаполнено(ПерерывНачало) и ЗначениеЗаполнено(ПерерывОкончание) Тогда
					минут = минут - (ПерерывОкончание - ПерерывНачало)/60;					
				КонецЕсли;
						
				
				НомерДня = СокрЛП(День(стрДни.Дата)); 
							
				
				Половинки = минут/30;
				ОкрПоловинки = Окр(Половинки,0);
				Часов = ОкрПоловинки/2;				
								
				ВидВремени = Справочники.ЛБ_ВидыИспользованияРабочегоВремени.Явка;
				Территория = "";
				
				ТекСтр["Часов"+НомерДня] 		= Часов; 
				ТекСтр["ВидВремени"+НомерДня] 	= ВидВремени;
				ТекСтр["Территория"+НомерДня] 	= Территория;
				ТекСтр["ВремяПредставление"+НомерДня] 	= СформироватьПредставлениеВремени(ВидВремени, Часов, Территория);  
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция ВернутьДанныеПоРабочимДнямЛомбарда(Дата, Ломбард)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РабочиеДниЛомбарда.Период КАК Период,
	               |	ЛБ_РабочиеДниЛомбарда.Ломбард КАК Ломбард,
	               |	ЛБ_РабочиеДниЛомбарда.Начало КАК Начало,
	               |	ЛБ_РабочиеДниЛомбарда.Окончание КАК Окончание,
	               |	ЛБ_РабочиеДниЛомбарда.ПерерывНачало КАК ПерерывНачало,
	               |	ЛБ_РабочиеДниЛомбарда.ПерерывОкончание КАК ПерерывОкончание,
	               |	ЛБ_РабочиеДниЛомбарда.РабочиеМинуты КАК РабочиеМинуты,
	               |	ЛБ_РабочиеДниЛомбарда.Выходной КАК Выходной,
	               |	ЛБ_РабочиеДниЛомбарда.ДеньНедели КАК ДеньНедели,
	               |	ЛБ_РабочиеДниЛомбарда.НомерДня КАК НомерДня,
	               |	ЛБ_РабочиеДниЛомбарда.Приказ КАК Приказ
	               |ИЗ
	               |	РегистрСведений.ЛБ_РабочиеДниЛомбарда КАК ЛБ_РабочиеДниЛомбарда
	               |ГДЕ
	               |	ЛБ_РабочиеДниЛомбарда.Период = &Период
	               |	И ЛБ_РабочиеДниЛомбарда.Ломбард = &Ломбард";
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.УстановитьПараметр("Период", НачалоДня(Дата));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Структ = Новый Структура;
		Структ.Вставить("Начало", Выборка.Начало);
		Структ.Вставить("Окончание", Выборка.Окончание);
		Структ.Вставить("ПерерывНачало", Выборка.ПерерывНачало); 
		Структ.Вставить("ПерерывОкончание", Выборка.ПерерывОкончание);
		Структ.Вставить("РабочиеМинуты", Выборка.РабочиеМинуты);
		Структ.Вставить("Выходной", Выборка.Выходной); 
		
		Возврат Структ;
	КонецЕсли;
	
	Возврат Неопределено;	
КонецФункции 

&НаКлиенте
Процедура ДанныеОВремениСотрудникПриИзменении(Элемент)
	ЗаполнитьПервоначальныеДанныеПоСотруднику();
КонецПроцедуры

&НаСервере
Процедура ПериодРегистрацииПриИзменении()
	//УчетРабочегоВремениРасширенныйФормы.ТабельПериодРегистрацииПриИзменении(ЭтаФорма); 
	
	Для инд = 29 по 31 Цикл
		Элементы["ВремяПредставление"+СокрЛП(инд)].Видимость = Истина;
	КонецЦикла;
	
	КоличествоДнейвМесяце = День(КонецМесяца(Объект.ПериодРегистрации));
	Если КоличествоДнейвМесяце = 30 Тогда
		Элементы.ВремяПредставление31.Видимость = Ложь;
	ИначеЕсли КоличествоДнейвМесяце = 29 Тогда
		Элементы.ВремяПредставление31.Видимость = Ложь;
		Элементы.ВремяПредставление30.Видимость = Ложь; 
	ИначеЕсли КоличествоДнейвМесяце = 28 Тогда
		Элементы.ВремяПредставление31.Видимость = Ложь;
		Элементы.ВремяПредставление30.Видимость = Ложь; 
		Элементы.ВремяПредставление29.Видимость = Ложь; 
	КонецЕсли;  
	
	Объект.ДатаНачалаПериода = НачалоМесяца(Объект.ПериодРегистрации);
	Объект.ДатаОкончанияПериода =  КонецМесяца(Объект.ПериодРегистрации);  
КонецПроцедуры

&НаСервере
Процедура ПериодВводаДанныхОВремениПриИзмененииНаСервере()
	//УчетРабочегоВремениРасширенныйФормы.ТабельПериодВводаДанныхОВремениПриИзменении(ЭтаФорма);
	Форма = ЭтаФорма;
	
	Если Форма.Объект.ПериодВводаДанныхОВремени = ПредопределенноеЗначение("Перечисление.ПериодыВводаДанныхОВремени.ПерваяПоловинаТекущегоМесяца") Тогда
		Форма.Объект.ДатаНачалаПериода = НачалоМесяца(Форма.Объект.ПериодРегистрации);
		Форма.Объект.ДатаОкончанияПериода = Дата(Год(Форма.Объект.ПериодРегистрации), Месяц(Форма.Объект.ПериодРегистрации), 15);  
		
		Для инд = 1 по 15 Цикл
			Элементы["ВремяПредставление"+СокрЛП(инд)].Видимость = Истина;
		КонецЦикла; 
		Для инд = 16 по 31 Цикл
			Элементы["ВремяПредставление"+СокрЛП(инд)].Видимость = Ложь;
		КонецЦикла;	
		
	ИначеЕсли Форма.Объект.ПериодВводаДанныхОВремени = ПредопределенноеЗначение("Перечисление.ПериодыВводаДанныхОВремени.ВтораяПоловинаТекущегоМесяца") Тогда
		Форма.Объект.ДатаНачалаПериода = Дата(Год(Форма.Объект.ПериодРегистрации), Месяц(Форма.Объект.ПериодРегистрации), 16);
		Форма.Объект.ДатаОкончанияПериода = КонецМесяца(Форма.Объект.ПериодРегистрации); 
		
		Для инд = 1 по 15 Цикл
			Элементы["ВремяПредставление"+СокрЛП(инд)].Видимость = Ложь;
		КонецЦикла; 
		Для инд = 16 по 31 Цикл
			Элементы["ВремяПредставление"+СокрЛП(инд)].Видимость = Истина;
		КонецЦикла;	

	ИначеЕсли Форма.Объект.ПериодВводаДанныхОВремени = ПредопределенноеЗначение("Перечисление.ПериодыВводаДанныхОВремени.ТекущийМесяц") Тогда
		Форма.Объект.ДатаНачалаПериода = НачалоМесяца(Форма.Объект.ПериодРегистрации);
		Форма.Объект.ДатаОкончанияПериода = КонецМесяца(Форма.Объект.ПериодРегистрации);
		
		Для инд = 1 по 31 Цикл
			Элементы["ВремяПредставление"+СокрЛП(инд)].Видимость = Истина;
		КонецЦикла;
	КонецЕсли; 
	
	КоличествоДнейвМесяце = День(КонецМесяца(Форма.Объект.ПериодРегистрации));
	Если КоличествоДнейвМесяце = 30 Тогда
		Элементы.ВремяПредставление31.Видимость = Ложь;
	ИначеЕсли КоличествоДнейвМесяце = 29 Тогда
		Элементы.ВремяПредставление31.Видимость = Ложь;
		Элементы.ВремяПредставление30.Видимость = Ложь; 
	ИначеЕсли КоличествоДнейвМесяце = 28 Тогда
		Элементы.ВремяПредставление31.Видимость = Ложь;
		Элементы.ВремяПредставление30.Видимость = Ложь; 
		Элементы.ВремяПредставление29.Видимость = Ложь; 
	КонецЕсли;
	
	

КонецПроцедуры

&НаКлиенте
Процедура ВводМесяцаРегулирование(РедактируемыйОбъект, ПутьРеквизита, ПутьРеквизитаПредставления, Направление, Модифицированность = Ложь, ЗначениеМесяцаПоУмолчанию = Неопределено) Экспорт
	
	Значение = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(РедактируемыйОбъект, ПутьРеквизита);
	
	Если Значение <= '19000101' Тогда
		
		Если ЗначениеМесяцаПоУмолчанию = Неопределено Тогда
			Значение = НачалоМесяца(ОбщегоНазначенияКлиент.ДатаСеанса());
		Иначе
			Значение = НачалоМесяца(ЗначениеМесяцаПоУмолчанию);
		КонецЕсли;
		
		НовоеЗначение = Значение;
		
	Иначе
		НовоеЗначение = ДобавитьМесяц(Значение, Направление);
	КонецЕсли; 
	
	Если НовоеЗначение >= '00010101' Тогда
		
		Значение = НовоеЗначение;
		
		ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(РедактируемыйОбъект, ПутьРеквизита, Значение);
		ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(РедактируемыйОбъект, ПутьРеквизитаПредставления, ПолучитьПредставлениеМесяца(Значение));
		
		Модифицированность = Истина;
	 	
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПредставлениеМесяца(ДатаНачалаМесяца) Экспорт
	
	Возврат Формат(ДатаНачалаМесяца, "ДФ='ММММ гггг'");
	
КонецФункции


&НаСервере
Процедура УдалитьСтрокиПоСотруднику(Знач УдаляемыеСтроки)
	Для Каждого ИдентификаторУдаляемойСтроки Из УдаляемыеСтроки Цикл
		//УчетРабочегоВремениРасширенныйФормы.ТабельУдалитьСтрокиПоСотруднику(ЭтаФорма, ИдентификаторУдаляемойСтроки);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УстановитьВысотуСтрокНаСервере() Экспорт
	//УчетРабочегоВремениРасширенныйФормы.ТабельУстановитьВысотуСтрокПоСотрудникам(ЭтаФорма, УстанавливаемаяВысотаСтроки);
КонецПроцедуры

&НаСервере
Функция АдресСпискаПодобранныхСотрудников()
	
	Возврат ПоместитьВоВременноеХранилище(Объект.ДанныеОВремени.Выгрузить(,"Сотрудник").ВыгрузитьКолонку("Сотрудник"), УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ЗаполнитьДанныеФормыПоОрганизации();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтветственныхЛиц()
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Возврат;
	КонецЕсли;
	
	// ЗарплатаКадрыПодсистемы.ПодписиДокументов
	//ПодписиДокументов.ЗаполнитьПодписиПоОрганизации(ЭтотОбъект);
	// Конец ЗарплатаКадрыПодсистемы.ПодписиДокументов
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормыПоОрганизации()
	
	//Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
	//	Возврат;
	//КонецЕсли;
	
	//ЗапрашиваемыеЗначения = Новый Структура("Организация, МесяцРасчета", "Объект.Организация", "Объект.ПериодРегистрации");
	//ЗарплатаКадры.ЗаполнитьОтветственныхРаботниковОрганизацииВФорме(ЭтотОбъект, ЗапрашиваемыеЗначения, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("Организация"));
	//ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтаФорма, "Объект.ПериодРегистрации", "МесяцРегистрацииСтрокой");
	
	//УстановитьОтветственныхЛиц();
	
КонецПроцедуры

&НаСервере
Процедура СортироватьПоВозрастаниюНаСервере()
	//УчетРабочегоВремениРасширенныйФормы.ДанныеОВремениСортироватьПоВозрастанию(Объект.ДанныеОВремени);
КонецПроцедуры

&НаСервере
Процедура СортироватьПоУбываниюНаСервере()
	//УчетРабочегоВремениРасширенныйФормы.ДанныеОВремениСортироватьПоУбыванию(Объект.ДанныеОВремени);
КонецПроцедуры


&НаСервере
Процедура ПерезаполнитьСотрудникаНаСервере(Сотрудники)
	
	Если ТипЗнч(Сотрудники) <> Тип("Массив") Тогда
		Сотрудники = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Сотрудники);
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.СвернутьМассив(Сотрудники);
	
	СтрокиПоСотрудникам = Новый Соответствие;
	Для Каждого Сотрудник Из Сотрудники Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("Сотрудник", Сотрудник);
		МассивСтрокПоСотруднику = Объект.ДанныеОВремени.НайтиСтроки(Отбор);
		//УчетРабочегоВремениРасширенныйФормы.ТабельОчиститьСтрокиСотрудника(МассивСтрокПоСотруднику);
		СтрокиПоСотрудникам.Вставить(Сотрудник, МассивСтрокПоСотруднику);
		
	КонецЦикла;
	
	//УчетРабочегоВремениРасширенныйФормы.ТабельЗаполнитьДанныеПоСотрудникам(ЭтотОбъект, Сотрудники, СтрокиПоСотрудникам, ВысотаСтроки); 
	
	Модифицированность = Истина;
	
КонецПроцедуры

// КадровыйЭДО
&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПодключаемыеКоманды(УправляемаяФорма)
	//КадровыйЭДОКлиентСервер.ОбновитьКоманды(УправляемаяФорма, УправляемаяФорма.Объект, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДанныеОВремениВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если СтрНайти(Поле.Имя, "ВремяПредставление") > 0 Тогда
		НомерДня = СтрЗаменить(Поле.Имя, "ВремяПредставление", "");
		
    	ТекСтрока = Элементы.ДанныеОВремени.ТекущиеДанные;  
    	ПараметрыФормы = Новый Структура;
    	ПараметрыФормы.Вставить("Сотрудник", 	ТекСтрока.Сотрудник);
    	ПараметрыФормы.Вставить("Часов", 		ТекСтрока["Часов"+НомерДня]); 
    	ПараметрыФормы.Вставить("ВидВремени", 	ТекСтрока["ВидВремени"+НомерДня]); 
    	ПараметрыФормы.Вставить("Территория", 	ТекСтрока["Территория"+НомерДня]);
		ПараметрыФормы.Вставить("НомерДня", 	НомерДня);  
		ПараметрыФормы.Вставить("ДатаРаботы",   (Объект.ПериодРегистрации + НомерДня-1)*86400);
		ПараметрыФормы.Вставить("Ломбард",      ТекСтрока.Ломбард); 
		ПараметрыФормы.Вставить("ПолучитьЧасыИзГрафика",     Ложь); 
				               
    	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеОкончанииРедактированияДанныхОВремени", ЭтотОбъект);
    	ОткрытьФорму("ОбщаяФорма.ЛБ_РедактированиеДанныхУчетаВремениЗаДень", Параметрыформы, ЭтаФорма,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
    КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПослеОкончанииРедактированияДанныхОВремени(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;  
	
	НомерДня = Результат.НомерДня;
	ТекСтрока = Элементы.ДанныеОВремени.ТекущиеДанные;
	ТекСтрока["Часов"+НомерДня] 				= Результат.Часов; 
	ТекСтрока["ВидВремени"+НомерДня] 			= Результат.ВидВремени;
	ТекСтрока["Территория"+НомерДня] 			= Результат.Территория;
	ТекСтрока["ВремяПредставление"+НомерДня] 	= СформируйПредставлениеВремени(Результат.ВидВремени, Результат.Часов, Результат.Территория);

	
КонецПроцедуры 

&НаСервере
Функция СформируйПредставлениеВремени(ВидВремени, Часов, Территория)
	Возврат ЛБ_ОбщегоНазначения.СформироватьПредставлениеВремени(ВидВремени, Часов, Территория);
КонецФункции 

Функция СформироватьПредставлениеВремени(ВидВремени, Часов, Территория)
	Рез = "";
	Если ЗначениеЗаполнено(ВидВремени) Тогда
		Если ВидВремени = Справочники.ЛБ_ВидыИспользованияРабочегоВремени.Явка Тогда
			Если Часов > 0 Тогда
				Рез = СокрЛП(Часов);
			КонецЕсли;
		Иначе
			Рез = СокрЛП(ВидВремени.БуквенныйКод);
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Территория) Тогда
			Рез = Рез +" "+"л"+СокрЛП(Территория.НомерЛомбарда);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Рез;	
КонецФункции


&НаКлиенте
Процедура ДанныеОВремениСотрудник1ПриИзменении(Элемент)
	ТекСтр = Элементы.ДанныеОВремени.ТекущиеДанные; 
	Ошибка = Ложь; 
	
	Для каждого стр из Объект.ДанныеОВремени Цикл
		Если стр <> ТекСтр и ТекСтр.Ломбард = Стр.Ломбард и ТекСтр.Сотрудник = Стр.Сотрудник Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Сотрудник указан дважды в одном ломбарде";   
			Сообщение.Поле = "Объект.ДанныеОВремени["+СокрЛП(Стр.НомерСтроки-1)+"].Сотрудник";
			Сообщение.Сообщить(); 
		
			Ошибка = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Ошибка Тогда
		Объект.ДанныеОВремени.Удалить(Элементы.ДанныеОВремени.ТекущиеДанные.НомерСтроки - 1);
	Иначе
		ЗаполнитьПервоначальныеДанныеПоСотруднику();
	КонецЕсли;

КонецПроцедуры




// Конец КадровыйЭДО

#КонецОбласти
