&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.ВидПеречня) тогда 
		Объект.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.Террористы;
	КонецЕсли;	
	ЗаполнитьОсновнуюТаблицу();		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОсновнуюТаблицу()
	Если НЕ ЗначениеЗаполнено(Объект.ВидПеречня) Тогда
		Возврат;
	КонецЕсли;	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ВидПеречня", Объект.ВидПеречня); 
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЛБ_ПереченьНежелательныхЛиц.Период КАК ДатаЗагрузкиПеречня,
	               |	ЛБ_ПереченьНежелательныхЛиц.ДатаПеречня КАК ДатаПеречня,
	               |	ЛБ_ПереченьНежелательныхЛиц.ДатаПредыдущегоПеречня КАК ДатаПредыдущегоПеречня,
	               |	ЛБ_ПереченьНежелательныхЛиц.Ответственный КАК Ответственный,
	               |	ЛБ_ПереченьНежелательныхЛиц.РазмерФайла КАК РазмерФайла
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПереченьНежелательныхЛиц КАК ЛБ_ПереченьНежелательныхЛиц
	               |ГДЕ
	               |	ЛБ_ПереченьНежелательныхЛиц.ВидПеречня = &ВидПеречня
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаЗагрузкиПеречня УБЫВ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	ТаблицаОсновная.Загрузить(ТаблицаЗапроса);
КонецПроцедуры

&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл";
	Диалог.ПолноеИмяФайла = ""; 
	Фильтр = "xml (*.xml)|*.xml"; 
	Диалог.Фильтр = Фильтр; 
	Диалог.МножественныйВыбор = Ложь;	
	Диалог.Показать(Новый ОписаниеОповещения("ЗагрузитьФайлЗавершение", ЭтаФорма, Новый Структура("Диалог", Диалог)));		
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайлЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Диалог = ДополнительныеПараметры.Диалог; 
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда				
		
		Объект.Файл = Диалог.ПолноеИмяФайла;  
		
		ФайлНаДиске = Новый Файл(Объект.Файл); 
		РазмерФайла = ФайлНаДиске.Размер();
		РазмерФайла = окр(РазмерФайла/1024, 0, РежимОкругления.Окр15как10);			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция МассивВСтроку(МассивСтрок)
    Возврат СтрСоединить(МассивСтрок, "/"); 
КонецФункции

&НаСервере
Процедура ПоискДублейСтрокВТабЧасти(ТаблЗнач)	 
	 Удстроки = Новый СписокЗначений;

	 Отбор = Новый Структура();

	 Для каждого Стр Из ТаблЗнач Цикл
		 Если НЕ Удстроки.НайтиПоЗначению(Стр) = неопределено Тогда
			 Продолжить;
		 КонецЕсли;	 
	     Отбор.Очистить();
	     Для каждого Колонки Из ТаблЗнач.Колонки Цикл
	         Если Колонки.Имя <> "НомерСтроки" Тогда
	             Отбор.Вставить(Колонки.Имя, Стр[Колонки.Имя]);
	         КонецЕсли;
	      КонецЦикла;

		  Строки = ТаблЗнач.НайтиСтроки(Отбор);
		  Если Строки.Количество() > 1 Тогда 
			  Для сч = 1 По Строки.Количество()-1 цикл 				  
				  Удстроки.Добавить(Строки[сч]);
			  Конеццикла;	  
		  КонецЕсли; 
	  КонецЦикла;
	  Для каждого Эл Из Удстроки Цикл 
		  ТаблЗнач.Удалить(Эл.Значение); 
	  Конеццикла;	  
КонецПроцедуры

&НаСервере
Процедура ПоискДублейСтрокВТабЧастиОсн(ТаблЗнач)	 
	 Удстроки = Новый СписокЗначений;

	 Отбор = Новый Структура();

	 Для каждого Стр Из ТаблЗнач Цикл
		 Если НЕ Удстроки.НайтиПоЗначению(Стр) = неопределено Тогда
			 Продолжить;
		 КонецЕсли;	 
	     Отбор.Очистить();
	     Отбор.Вставить("ИД", Стр.ИД);
	     Отбор.Вставить("Статус", Стр.Статус);
		 
		  Строки = ТаблЗнач.НайтиСтроки(Отбор);
		  Если Строки.Количество() > 1 Тогда 
			  Для сч = 1 По Строки.Количество()-1 цикл 				  
				  Удстроки.Добавить(Строки[сч]);
			  Конеццикла;	  
		  КонецЕсли; 
	  КонецЦикла;
	  Для каждого Эл Из Удстроки Цикл 
		  ТаблЗнач.Удалить(Эл.Значение); 
	  Конеццикла;	  
КонецПроцедуры

&НаСервере
Функция УстановитьИмяВременногоФайла() 
	
	КаталогВременныхФайлов = Константы.ЛБ_КаталогВременныхФайлов.Получить();
	Если НЕ Прав(СокрЛП(КаталогВременныхФайлов), 1) = "\" Тогда		
	    КаталогВременныхФайлов = СокрЛП(КаталогВременныхФайлов) + "\";
	КонецЕсли;	    
	
	ИмяФайла = СокрЛП(Объект.Файл);
	Пока Истина Цикл 
		Поз = Найти(ИмяФайла, "\");
		Если Поз = 0 Тогда
			Прервать;
		КонецЕсли;
		ИмяФайла = СокрЛП(Сред(ИмяФайла, Поз+1));
	КонецЦикла;	
	
	Возврат КаталогВременныхФайлов +  ИмяФайла;	
КонецФункции

&НаСервере
Процедура ОбработатьФайлНаСервере(АдресХранилища)  
	ИмяВременногоФайла = УстановитьИмяВременногоФайла(); 
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХранилища); 
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	ДатаЗагрузки = ТекущаяДата();
	
	ЧтениеXML = Новый ЧтениеXML; 
	ПутьКФайлу = СокрЛП(ИмяВременногоФайла);
    ЧтениеXML.ОткрытьФайл(ПутьКФайлу);  
	
	Объект.ДатаПеречня = Дата(1,1,1); 
	Объект.ДатаПредыдущегоПеречня = Дата(1,1,1); 
	ВерсияПеречня = 0; //1 -русская, 2- английская для ООН

	Если Объект.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ФРОМУ Тогда
		ЭтоФРОМУ = Ложь;
		Пока ЧтениеXML.Прочитать() Цикл 
			Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "АктуальныйСписок" Тогда
				Прервать;
			КонецЕсли;	 
			
			Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 
				ИмяАтрибута = ЧтениеXML.Имя;
				Если сокрЛП(ЧтениеXML.Имя) = "СписокОМУ" Тогда
					ЭтоФРОМУ = Истина;
				КонецЕсли;	
			ИначеЕсли ЧтениеXML.ТипУзла=ТипУзлаXML.Текст Тогда
				Если ИмяАтрибута = "ДатаСписка" Тогда
					 Объект.ДатаПеречня = XMLЗначение(Тип("Дата"), ЧтениеXML.Значение); 
				ИначеЕсли ИмяАтрибута = "ДатаПредыдущегоСписка" Тогда
					 Объект.ДатаПредыдущегоПеречня = XMLЗначение(Тип("Дата"), ЧтениеXML.Значение); 	 
				КонецЕсли;	
			КонецЕсли;		
		Конеццикла;	  
		
		Если НЕ ЭтоФРОМУ Тогда 
			Сообщить("Выбранный файл не является списком FROMU!"); 
			Возврат;
		КонецЕсли;
		
		СтекУзлов = Новый Массив;
		ТекущийПуть = "";  
		Объект.ТаблицаФрому.Очистить();
		Объект.ТаблицаФромуДокументы.Очистить();  
		Объект.ТаблицаДрНаименованияФРОМУ.Очистить();
		Пока ЧтениеXML.Прочитать() Цикл  
			
			Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
				СтекУзлов.Добавить(ЧтениеXML.Имя);
				ТекущийПуть = МассивВСтроку(СтекУзлов); 
				Если ЧтениеXML.Имя = "Субъект" И  ТекущийПуть = "Субъект" Тогда 
					НоваяСтр = Объект.ТаблицаФрому.Добавить();   
					НоваяСтр.Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен;
					СписокГражданств = "";   
				ИначеЕсли ЧтениеXML.Имя = "Документ" И  ТекущийПуть = "Субъект/ФЛ/СписокДокументов/Документ" Тогда	
					НоваяСтрДок = Объект.ТаблицаФромуДокументы.Добавить(); 
					НоваяСтрДок.ИД = НоваяСтр.ИД;					
				ИначеЕсли ЧтениеXML.Имя = "Адрес" И  ТекущийПуть = "Субъект/СписокАдресов/Адрес" Тогда	
					НоваяСтрА = Объект.ТаблицаФромуАдреса.Добавить(); 
					НоваяСтрА.ИД = НоваяСтр.ИД; 	
				КонецЕсли;	
					
			ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда 
				Если ТекущийПуть = "Субъект/ИдСубъекта" Тогда
					НоваяСтр.ИД = СокрЛП(ЧтениеXML.Значение);
				ИначеЕсли ТекущийПуть = "Субъект/ТипСубъекта/Идентификатор" Тогда
	                НоваяСтр.ЮридическоеФизическоеЛицо = ?(ЧтениеXML.Значение = "1", Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо, Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо);
				ИначеЕсли ТекущийПуть = "Субъект/История/ДатаВключения" Тогда
					НоваяСтр.ДатаВключенияВПеречень = XMLЗначение(Тип("Дата"), ЧтениеXML.Значение); 
				ИначеЕсли ТекущийПуть = "Субъект/ЮЛ/Наименование" Тогда
					НоваяСтр.Наименование = ЧтениеXML.Значение;
				ИначеЕсли ТекущийПуть = "Субъект/ЮЛ/НаименованиеЛат" Тогда
					НоваяСтр.НаименованиеЛат = ЧтениеXML.Значение;
		        ИначеЕсли ТекущийПуть = "Субъект/ФЛ/ФИО" Тогда
					НоваяСтр.Наименование = ЧтениеXML.Значение;
				ИначеЕсли ТекущийПуть = "Субъект/ФЛ/ФИОЛат" Тогда
					НоваяСтр.НаименованиеЛат = ЧтениеXML.Значение;
	            ИначеЕсли ТекущийПуть = "Субъект/ФЛ/Фамилия" Тогда
					НоваяСтр.Фамилия = ЧтениеXML.Значение; 
				ИначеЕсли ТекущийПуть = "Субъект/ФЛ/ДатаРождения" Тогда
					НоваяСтр.ДатаРождения = XMLЗначение(Тип("Дата"), ЧтениеXML.Значение);
				ИначеЕсли ТекущийПуть = "Субъект/ФЛ/ГодРождения" Тогда 
					Попытка
					    НоваяСтр.ГодРождения = Число(ЧтениеXML.Значение);
					Исключение
					КонецПопытки;
				ИначеЕсли ТекущийПуть = "Субъект/ФЛ/СписокГражданств/Гражданство" Тогда
					СписокГражданств = СписокГражданств + ?(ПустаяСтрока(СписокГражданств), "", "; ") + ЧтениеXML.Значение; 	
				ИначеЕсли ТекущийПуть = "Субъект/СписокАдресов/Адрес/ТекстАдреса" Тогда
					НоваяСтрА.Адрес = ЧтениеXML.Значение; 
				ИначеЕсли ТекущийПуть = "Субъект/ФЛ/СписокДрНаименований/ДрНаименование/ФИО" Тогда 
					НоваяСтрДр = Объект.ТаблицаДрНаименованияФРОМУ.Добавить(); 
					НоваяСтрДр.ИД = НоваяСтр.ИД;	
	                НоваяСтрДр.Наименование = ЧтениеXML.Значение; 
					//+МАН 23.10.25 Добавил разделение другого наименования на фамилию, Имя и Иотчество и запись в регистр
					Если НоваяСтр.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо
						И НЕ ПустаяСтрока(ЧтениеXML.Значение) Тогда
						СтруктураФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(СокрЛП(ЧтениеXML.Значение));
						
						НоваяСтрДр.Фамилия = СтруктураФИО.Фамилия;
						НоваяСтрДр.Имя = СтруктураФИО.Имя;
						НоваяСтрДр.Отчество = СтруктураФИО.Отчество;
					КонецЕсли;
					//-МАН
				ИначеЕсли ТекущийПуть = "Субъект/ФЛ/СписокДокументов/Документ/ТипДокумента/Идентификатор" Тогда
					НоваяСтрДок.ДокументИдентификатор = ЧтениеXML.Значение; 
				ИначеЕсли ТекущийПуть = "Субъект/ФЛ/СписокДокументов/Документ/ТипДокумента/Наименование" Тогда
					НоваяСтрДок.ДокументНаименование = ЧтениеXML.Значение;
				ИначеЕсли ТекущийПуть = "Субъект/ФЛ/СписокДокументов/Документ/Номер" Тогда
					НоваяСтрДок.ДокументНомер = ЧтениеXML.Значение;	
				ИначеЕсли ТекущийПуть = "Субъект/ФЛ/СписокДокументов/Документ/ОрганВыдачи" Тогда
					НоваяСтрДок.ДокументКемВыдан = ЧтениеXML.Значение;	
				ИначеЕсли ТекущийПуть = "Субъект/Примечание" Тогда
					НоваяСтр.Примечание = ЧтениеXML.Значение;	
				КонецЕсли;	
			ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда 
				Если  ЧтениеXML.Имя = "АктуальныйСписок" Тогда   
					Прервать;
				КонецЕсли;    
				
				Если ЧтениеXML.Имя = "Субъект" Тогда
					Если НЕ ПустаяСтрока(СписокГражданств) Тогда 
						НоваяСтр.Гражданство = СписокГражданств; 
					КонецЕсли;	
				КонецЕсли;
				
			    СтекУзлов.Удалить(СтекУзлов.Количество()-1); 
				ТекущийПуть = МассивВСтроку(СтекУзлов);
			КонецЕсли ;

		КонецЦикла; 
	    ЧтениеXML.Закрыть();  
			
		Если НЕ Объект.ТаблицаФрому.Количество() = 0 Тогда
			ТаблЗнач = Объект.ТаблицаФрому.Выгрузить();
			ПоискДублейСтрокВТабЧастиОсн(ТаблЗнач);
			Рег = РегистрыСведений.ЛБ_ПереченьНежелательныхЛиц;
		    НаборЗаписей = Рег.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ВидПеречня.Установить(Объект.ВидПеречня); 
			НаборЗаписей.Отбор.ДатаПеречня.Установить(Объект.ДатаПеречня);
			
			Для Каждого СтрокаТаблицы Из ТаблЗнач Цикл 	   
			   НоваяЗапись = НаборЗаписей.Добавить(); 
			   НоваяЗапись.Период = ДатаЗагрузки; 
			   НоваяЗапись.ВидПеречня = Объект.ВидПеречня; 
			   НоваяЗапись.ДатаПеречня = Объект.ДатаПеречня;
			   НоваяЗапись.ДатаПредыдущегоПеречня = Объект.ДатаПредыдущегоПеречня;
			   НоваяЗапись.ДатаВключенияВПеречень = СтрокаТаблицы.ДатаВключенияВПеречень; 
			   НоваяЗапись.ИД = СтрокаТаблицы.ИД;  
			   НоваяЗапись.ЮридическоеФизическоеЛицо = СтрокаТаблицы.ЮридическоеФизическоеЛицо;
			   НоваяЗапись.ДатаРождения = СтрокаТаблицы.ДатаРождения;
			   НоваяЗапись.ГодРождения = СтрокаТаблицы.ГодРождения;
			   НоваяЗапись.Гражданство = СтрокаТаблицы.Гражданство;
			   НоваяЗапись.Фамилия = СтрокаТаблицы.Фамилия;
			   НоваяЗапись.Наименование = СтрокаТаблицы.Наименование; 
			   НоваяЗапись.НаименованиеЛат = СтрокаТаблицы.НаименованиеЛат; 
			   НоваяЗапись.Примечание = СтрокаТаблицы.Примечание;
			   НоваяЗапись.Статус = СтрокаТаблицы.Статус; 
			   НоваяЗапись.Ответственный = Пользователи.ТекущийПользователь();
			   НоваяЗапись.РазмерФайла = РазмерФайла;
			   //+МАН 13.10.25 Запись технического наименования
			   Если ЗначениеЗаполнено(СтрокаТаблицы.Наименование) Тогда
				   Символ = Лев(СтрокаТаблицы.Наименование, 1);
				   
				   Если ЭтоРусскаяБуква(Символ) Тогда
					   НоваяЗапись.ТехническоеНаименование = ЛБ_ОбщийМодуль.СформироватьТехническоеНаименование(СтрокаТаблицы.Наименование);
				   КонецЕсли;
			   КонецЕсли;
			   //-МАН
			КонецЦикла; 

			НаборЗаписей.Записать(Истина); 	     
		КонецЕсли;	
			
		Если НЕ Объект.ТаблицаФромуДокументы.Количество() = 0 Тогда  
			ТаблЗнач = Объект.ТаблицаФромуДокументы.Выгрузить();       
			ПоискДублейСтрокВТабЧасти(ТаблЗнач);
			Рег = РегистрыСведений.ЛБ_ПереченьНежелательныхЛицДокументы;
		    НаборЗаписей = Рег.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ВидПеречня.Установить(Объект.ВидПеречня);
			НаборЗаписей.Отбор.ДатаПеречня.Установить(Объект.ДатаПеречня);
			
			Для Каждого СтрокаТаблицы Из ТаблЗнач Цикл 	
			    НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Период = ДатаЗагрузки;   
				НоваяЗапись.ВидПеречня = Объект.ВидПеречня;
				НоваяЗапись.ДатаПеречня = Объект.ДатаПеречня;
				НоваяЗапись.ИД = СтрокаТаблицы.ИД;
			    НоваяЗапись.ДокументИдентификатор = СтрокаТаблицы.ДокументИдентификатор;
			    НоваяЗапись.ДокументНаименование = СтрокаТаблицы.ДокументНаименование;
			    НоваяЗапись.ДокументНомер = СтрокаТаблицы.ДокументНомер;  
				НоваяЗапись.ДокументКемВыдан = СтрокаТаблицы.ДокументКемВыдан; 
			КонецЦикла; 

			НаборЗаписей.Записать(Истина);    
		КонецЕсли;	
		
		Если НЕ Объект.ТаблицаДрНаименованияФРОМУ.Количество() = 0 Тогда 
			ТаблЗнач = Объект.ТаблицаДрНаименованияФРОМУ.Выгрузить();
			ПоискДублейСтрокВТабЧасти(ТаблЗнач);
			Рег = РегистрыСведений.ЛБ_ПереченьНежелательныхЛицДрНаименования;
		    НаборЗаписей = Рег.СоздатьНаборЗаписей(); 
			НаборЗаписей.Отбор.ВидПеречня.Установить(Объект.ВидПеречня);
			НаборЗаписей.Отбор.ДатаПеречня.Установить(Объект.ДатаПеречня);
			
			Для Каждого СтрокаТаблицы Из ТаблЗнач Цикл 	
			    НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Период = ДатаЗагрузки;
				НоваяЗапись.ВидПеречня = Объект.ВидПеречня;
				НоваяЗапись.ДатаПеречня = Объект.ДатаПеречня;
				НоваяЗапись.ИД = СтрокаТаблицы.ИД;
			    НоваяЗапись.Наименование = СтрокаТаблицы.Наименование;
				//+МАН 13.10.25 Запись технического наименования
				Если ЗначениеЗаполнено(СтрокаТаблицы.Наименование) Тогда
					Символ = Лев(СтрокаТаблицы.Наименование, 1);
					
					Если ЭтоРусскаяБуква(Символ) Тогда
						НоваяЗапись.ТехническоеНаименование = ЛБ_ОбщийМодуль.СформироватьТехническоеНаименование(СтрокаТаблицы.Наименование);
					КонецЕсли;
				КонецЕсли;
				//-МАН
				//+МАН 23.10.25 Запись разделеного ФИО
				НоваяЗапись.Фамилия = СтрокаТаблицы.Фамилия;
				НоваяЗапись.Имя = СтрокаТаблицы.Имя;
				НоваяЗапись.Отчество = СтрокаТаблицы.Отчество;
				//-МАН
			КонецЦикла; 

			НаборЗаписей.Записать(Истина);    
		КонецЕсли;	  
		
		Если НЕ Объект.ТаблицаФРОМУАдреса.Количество() = 0 Тогда 
			ТаблЗнач = Объект.ТаблицаФРОМУАдреса.Выгрузить();
			ПоискДублейСтрокВТабЧасти(ТаблЗнач);
			Рег = РегистрыСведений.ЛБ_ПереченьНежелательныхЛицАдреса;
		    НаборЗаписей = Рег.СоздатьНаборЗаписей(); 
			НаборЗаписей.Отбор.ВидПеречня.Установить(Объект.ВидПеречня);
			НаборЗаписей.Отбор.ДатаПеречня.Установить(Объект.ДатаПеречня);
			
			Для Каждого СтрокаТаблицы Из ТаблЗнач Цикл 	
			    НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Период = ДатаЗагрузки;
				НоваяЗапись.ВидПеречня = Объект.ВидПеречня;
				НоваяЗапись.ДатаПеречня = Объект.ДатаПеречня;
				НоваяЗапись.ИД = СтрокаТаблицы.ИД;
			    НоваяЗапись.Адрес = СтрокаТаблицы.Адрес; 
				НоваяЗапись.ТипАдреса = "Адрес";
			КонецЦикла; 

			НаборЗаписей.Записать(Истина);    
		КонецЕсли;	

	ИначеЕсли Объект.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.МВК Тогда  
		ЭтоМВК = Ложь;
		Пока ЧтениеXML.Прочитать() Цикл 
			Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "СписокАктуальныхРешений" Тогда
				Прервать;
			КонецЕсли;	 
			
			Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 
				ИмяАтрибута = ЧтениеXML.Имя;
				Если сокрЛП(ЧтениеXML.Имя) = "СписокРешений" Тогда
					ЭтоМВК = Истина;
				КонецЕсли;	
			ИначеЕсли ЧтениеXML.ТипУзла=ТипУзлаXML.Текст Тогда
				Если ИмяАтрибута = "ДатаСписка" Тогда
					 Объект.ДатаПеречня = XMLЗначение(Тип("Дата"), ЧтениеXML.Значение); 
				ИначеЕсли ИмяАтрибута = "ДатаПредыдущегоСписка" Тогда
					 Объект.ДатаПредыдущегоПеречня = XMLЗначение(Тип("Дата"), ЧтениеXML.Значение); 	 
				КонецЕсли;	
			КонецЕсли;		
		Конеццикла;	  
		
		Если НЕ ЭтоМВК Тогда 
			Сообщить("Выбранный файл не является списком MBK!"); 
			Возврат;
		КонецЕсли;
		
		СтекУзлов = Новый Массив;
		ТекущийПуть = "";     
		ДатаВключенияВПеречень = Дата(1,1,1); 
		ДатаРешения = Дата(1,1,1); 
		НомерРешения = "";  
		ВидРешения = "";
		ЭтоГражданство = ложь;
		Статус  = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.ПустаяСсылка();
		Объект.ТаблицаМВК.Очистить();
		Объект.ТаблицаМВКДокументы.Очистить();  
		Объект.ТаблицаДрНаименованияМВК.Очистить();
		Пока ЧтениеXML.Прочитать() Цикл  
			
			Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
				СтекУзлов.Добавить(ЧтениеXML.Имя);
				ТекущийПуть = МассивВСтроку(СтекУзлов);   
				Если ЧтениеXML.Имя = "Субъект" И  ТекущийПуть = "Решение/СписокСубъектов/Субъект" Тогда 
					НоваяСтр = Объект.ТаблицаМВК.Добавить(); 
					НоваяСтр.ДатаВключенияВПеречень = ДатаВключенияВПеречень; 
					НоваяСтр.Статус = Статус;  
					НоваяСтр.ВидРешения = ВидРешения; 
					НоваяСтр.ДатаРешения = ДатаРешения;
					НоваяСтр.НомерРешения = НомерРешения;
					СписокГражданств = ""; 				   
				ИначеЕсли ЧтениеXML.Имя = "Документ" И  ТекущийПуть = "Решение/СписокСубъектов/Субъект/ФЛ/СписокДокументов/Документ" Тогда	
					НоваяСтрДок = Объект.ТаблицаМВКДокументы.Добавить(); 					
					НоваяСтрДок.ИД = НоваяСтр.ИД;    	
				КонецЕсли;	
					
			ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда  
				Если ТекущийПуть = "Решение/ДатаРешения" Тогда 
					ДатаВключенияВПеречень = XMLЗначение(Тип("Дата"), ЧтениеXML.Значение);
					ДатаРешения = ДатаВключенияВПеречень;
				ИначеЕсли ТекущийПуть = "Решение/НомерРешения" Тогда 
					НомерРешения = СокрЛП(ЧтениеXML.Значение); 	
				ИначеЕсли ТекущийПуть = "Решение/ВидРешения/Идентификатор" Тогда 
					Статус = ?(ЧтениеXML.Значение = "1", Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен, Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Исключен);  
				ИначеЕсли ТекущийПуть = "Решение/ВидРешения/Наименование" Тогда 
					ВидРешения = СокрЛП(ЧтениеXML.Значение); 	
				ИначеЕсли ТекущийПуть = "Решение/СписокСубъектов/Субъект/ИдСубъекта" Тогда
					НоваяСтр.ИД = СокрЛП(ЧтениеXML.Значение);
				ИначеЕсли ТекущийПуть = "Решение/СписокСубъектов/Субъект/ТипСубъекта/Идентификатор" Тогда
	                НоваяСтр.ЮридическоеФизическоеЛицо = ?(ЧтениеXML.Значение = "1", Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо, Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо);
				ИначеЕсли ТекущийПуть = "Решение/СписокСубъектов/Субъект/ЮЛ/Наименование" Тогда
					НоваяСтр.Наименование = ВРЕГ(ЧтениеXML.Значение);
				ИначеЕсли ТекущийПуть = "Решение/СписокСубъектов/Субъект/ЮЛ/НаименованиеЛат" Тогда
					НоваяСтр.НаименованиеЛат = ВРЕГ(ЧтениеXML.Значение);
		        ИначеЕсли ТекущийПуть = "Решение/СписокСубъектов/Субъект/ФЛ/ФИО" Тогда
					НоваяСтр.Наименование = ВРЕГ(ЧтениеXML.Значение);
				ИначеЕсли ТекущийПуть = "Решение/СписокСубъектов/Субъект/ФЛ/ФИОЛат" Тогда
					НоваяСтр.НаименованиеЛат = ВРЕГ(ЧтениеXML.Значение);
	            ИначеЕсли ТекущийПуть = "Решение/СписокСубъектов/Субъект/ФЛ/Фамилия" Тогда
					НоваяСтр.Фамилия = ВРЕГ(ЧтениеXML.Значение);  
				ИначеЕсли ТекущийПуть = "Решение/СписокСубъектов/Субъект/ФЛ/Имя" Тогда
					НоваяСтр.Имя = ВРЕГ(ЧтениеXML.Значение); 
				ИначеЕсли ТекущийПуть = "Решение/СписокСубъектов/Субъект/ФЛ/Отчество" Тогда
					НоваяСтр.Отчество = ВРЕГ(ЧтениеXML.Значение); 		
				ИначеЕсли ТекущийПуть = "Решение/СписокСубъектов/Субъект/ФЛ/ДатаРождения" Тогда
					НоваяСтр.ДатаРождения = XMLЗначение(Тип("Дата"), ЧтениеXML.Значение);
		        ИначеЕсли ТекущийПуть = "Решение/СписокСубъектов/Субъект/ФЛ/ГодРождения" Тогда
					Попытка
					    НоваяСтр.ГодРождения = Число(ЧтениеXML.Значение);
					Исключение
					КонецПопытки; 
				ИначеЕсли ТекущийПуть = "Решение/СписокСубъектов/Субъект/ФЛ/МестоРождения" Тогда
					НоваяСтр.МестоРождения = ЧтениеXML.Значение; 
				ИначеЕсли ТекущийПуть = "Решение/СписокСубъектов/Субъект/ФЛ/ИНН" Тогда
					НоваяСтр.ИНН = ЧтениеXML.Значение; 	
				ИначеЕсли ТекущийПуть = "Решение/СписокСубъектов/Субъект/СписокАдресов/Адрес/ТипАдреса/Идентификатор" Тогда
					ЭтоГражданство = ?(СокрЛП(ЧтениеXML.Значение) = "6", Истина, Ложь);  
					Если НЕ ЭтоГражданство Тогда
						НоваяСтрА = Объект.ТаблицаМВКАдреса.Добавить(); 
					    НоваяСтрА.ИД = НоваяСтр.ИД; 
					КонецЕсли;	
				ИначеЕсли ТекущийПуть = "Решение/СписокСубъектов/Субъект/СписокАдресов/Адрес/ТипАдреса/Наименование" Тогда	
					Если НЕ ЭтоГражданство Тогда 
						НоваяСтрА.ТипАдреса = ЧтениеXML.Значение;
					КонецЕсли;	
				ИначеЕсли ТекущийПуть = "Решение/СписокСубъектов/Субъект/СписокАдресов/Адрес/ТекстАдреса" Тогда   
					Если ЭтоГражданство Тогда
						СписокГражданств = СписокГражданств + ?(ПустаяСтрока(СписокГражданств), "", "; ") + ЧтениеXML.Значение;
					Иначе	
						НоваяСтрА.Адрес = ЧтениеXML.Значение;
					КонецЕсли;		
				ИначеЕсли ТекущийПуть = "Решение/СписокСубъектов/Субъект/СписокАдресов/Адрес/ОКАТО" Тогда
					НоваяСтрА.ОКАТО = ЧтениеXML.Значение;
				ИначеЕсли ТекущийПуть = "Решение/СписокСубъектов/Субъект/ФЛ/СписокДрНаименований/ДрНаименование/ФИО" Тогда 
					НоваяСтрДр = Объект.ТаблицаДрНаименованияМВК.Добавить(); 
					НоваяСтрДр.ИД = НоваяСтр.ИД;	
	                НоваяСтрДр.Наименование = ЧтениеXML.Значение; 
					//+МАН 23.10.25 Добавил разделение другого наименования на фамилию, Имя и Иотчество и запись в регистр
					Если НоваяСтр.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо
						И НЕ ПустаяСтрока(ЧтениеXML.Значение) Тогда
						СтруктураФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(СокрЛП(ЧтениеXML.Значение));
						
						НоваяСтрДр.Фамилия = СтруктураФИО.Фамилия;
						НоваяСтрДр.Имя = СтруктураФИО.Имя;
						НоваяСтрДр.Отчество = СтруктураФИО.Отчество;
					КонецЕсли;
					//-МАН
				ИначеЕсли ТекущийПуть = "Решение/СписокСубъектов/Субъект/ЮЛ/СписокДрНаименований/ДрНаименование/ФИО" Тогда 
					НоваяСтрДр = Объект.ТаблицаДрНаименованияМВК.Добавить(); 
					НоваяСтрДр.ИД = НоваяСтр.ИД;	
	                НоваяСтрДр.Наименование = ЧтениеXML.Значение;   	
				ИначеЕсли ТекущийПуть = "Решение/СписокСубъектов/Субъект/ФЛ/СписокДрНаименований/ДрНаименование/ДатаРождения" Тогда 	
	                НоваяСтрДр.ДатаРождения = XMLЗначение(Тип("Дата"), ЧтениеXML.Значение); 
	            ИначеЕсли ТекущийПуть = "Решение/СписокСубъектов/Субъект/ФЛ/СписокДрНаименований/ДрНаименование/ГодРождения" Тогда 	
	                Попытка
					    НоваяСтр.ГодРождения = Число(ЧтениеXML.Значение);
					Исключение
					КонецПопытки; 
				ИначеЕсли ТекущийПуть = "Решение/СписокСубъектов/Субъект/ФЛ/СписокДокументов/Документ/ТипДокумента/Идентификатор" Тогда
					НоваяСтрДок.ДокументИдентификатор = ЧтениеXML.Значение; 
				ИначеЕсли ТекущийПуть = "Решение/СписокСубъектов/Субъект/ФЛ/СписокДокументов/Документ/ТипДокумента/Наименование" Тогда
					НоваяСтрДок.ДокументНаименование = ЧтениеXML.Значение;
				ИначеЕсли ТекущийПуть = "Решение/СписокСубъектов/Субъект/ФЛ/СписокДокументов/Документ/Номер" Тогда
					НоваяСтрДок.ДокументНомер = ЧтениеXML.Значение;	
				ИначеЕсли ТекущийПуть = "Решение/СписокСубъектов/Субъект/ФЛ/СписокДокументов/Документ/Серия" Тогда
					НоваяСтрДок.ДокументСерия = ЧтениеXML.Значение;	
	            ИначеЕсли ТекущийПуть = "Решение/СписокСубъектов/Субъект/ФЛ/СписокДокументов/Документ/ОрганВыдачи" Тогда
					НоваяСтрДок.ДокументКемВыдан = ЧтениеXML.Значение;	
				ИначеЕсли ТекущийПуть = "Решение/СписокСубъектов/Субъект/ФЛ/СписокДокументов/Документ/ДатаВыдачи" Тогда
					НоваяСтрДок.ДокументДатаВыдачи = XMLЗначение(Тип("Дата"), ЧтениеXML.Значение);	
				ИначеЕсли ТекущийПуть = "Решение/СписокСубъектов/Субъект/РешениеПоСубъекту" Тогда
					НоваяСтр.Решение = ЧтениеXML.Значение;	
				КонецЕсли;	
			ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда 
				Если  ЧтениеXML.Имя = "СписокАктуальныхРешений" Тогда   
					Прервать;
				КонецЕсли; 
				
				Если ЧтениеXML.Имя = "Решение" Тогда
					ДатаВключенияВПеречень = Дата(1,1,1);
			        Статус  = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.ПустаяСсылка();				
				ИначеЕсли ЧтениеXML.Имя = "Субъект" Тогда
					Если НЕ ПустаяСтрока(СписокГражданств) Тогда 
						НоваяСтр.Гражданство = СписокГражданств; 
					КонецЕсли;	
				КонецЕсли;
				
			    СтекУзлов.Удалить(СтекУзлов.Количество()-1); 
				ТекущийПуть = МассивВСтроку(СтекУзлов);
			КонецЕсли ;

		КонецЦикла; 
	    ЧтениеXML.Закрыть(); 
		
		Если НЕ Объект.ТаблицаМВК.Количество() = 0 Тогда
			ТаблЗнач = Объект.ТаблицаМВК.Выгрузить();
			ПоискДублейСтрокВТабЧастиОсн(ТаблЗнач);
			Рег = РегистрыСведений.ЛБ_ПереченьНежелательныхЛиц;
		    НаборЗаписей = Рег.СоздатьНаборЗаписей(); 
			НаборЗаписей.Отбор.ВидПеречня.Установить(Объект.ВидПеречня);
			НаборЗаписей.Отбор.ДатаПеречня.Установить(Объект.ДатаПеречня);
			
			Для Каждого СтрокаТаблицы Из ТаблЗнач Цикл 	   
			   НоваяЗапись = НаборЗаписей.Добавить(); 
			   НоваяЗапись.Период = ДатаЗагрузки; 
			   НоваяЗапись.ВидПеречня = Объект.ВидПеречня; 
			   НоваяЗапись.ДатаПеречня = Объект.ДатаПеречня;
			   НоваяЗапись.ДатаПредыдущегоПеречня = Объект.ДатаПредыдущегоПеречня;
			   НоваяЗапись.ДатаВключенияВПеречень = СтрокаТаблицы.ДатаВключенияВПеречень; 
			   НоваяЗапись.ИД = СтрокаТаблицы.ИД;   
			   НоваяЗапись.ВидРешения = СтрокаТаблицы.ВидРешения;
			   НоваяЗапись.ДатаРешения = СтрокаТаблицы.ДатаРешения;
			   НоваяЗапись.НомерРешения = СтрокаТаблицы.НомерРешения;
			   НоваяЗапись.ЮридическоеФизическоеЛицо = СтрокаТаблицы.ЮридическоеФизическоеЛицо;
			   НоваяЗапись.ДатаРождения = СтрокаТаблицы.ДатаРождения;
			   НоваяЗапись.ГодРождения = СтрокаТаблицы.ГодРождения;
			   НоваяЗапись.МестоРождения = СтрокаТаблицы.МестоРождения;
			   НоваяЗапись.Гражданство = СтрокаТаблицы.Гражданство;
			   НоваяЗапись.Фамилия = СтрокаТаблицы.Фамилия; 
			   НоваяЗапись.Имя = СтрокаТаблицы.Имя; 
			   НоваяЗапись.Отчество = СтрокаТаблицы.Отчество; 
			   НоваяЗапись.ИНН = СтрокаТаблицы.ИНН;
			   НоваяЗапись.Наименование = СтрокаТаблицы.Наименование; 
			   НоваяЗапись.НаименованиеЛат = СтрокаТаблицы.НаименованиеЛат; 
			   НоваяЗапись.Примечание = СтрокаТаблицы.Решение;
			   НоваяЗапись.Статус = СтрокаТаблицы.Статус; 
			   НоваяЗапись.Ответственный = Пользователи.ТекущийПользователь();
			   НоваяЗапись.РазмерФайла = РазмерФайла;
			   //+МАН 13.10.25 Запись технического наименования
			   Если ЗначениеЗаполнено(СтрокаТаблицы.Наименование) Тогда
				   Символ = Лев(СтрокаТаблицы.Наименование, 1);
				   
				   Если ЭтоРусскаяБуква(Символ) Тогда
					   НоваяЗапись.ТехническоеНаименование = ЛБ_ОбщийМодуль.СформироватьТехническоеНаименование(СтрокаТаблицы.Наименование);
				   КонецЕсли;
			   КонецЕсли;
			   //-МАН
			КонецЦикла; 

			НаборЗаписей.Записать(Истина); 	     
		КонецЕсли;	
			
		Если НЕ Объект.ТаблицаМВКДокументы.Количество() = 0 Тогда  
			ТаблЗнач = Объект.ТаблицаМВКДокументы.Выгрузить();       
			ПоискДублейСтрокВТабЧасти(ТаблЗнач);
			Рег = РегистрыСведений.ЛБ_ПереченьНежелательныхЛицДокументы;
		    НаборЗаписей = Рег.СоздатьНаборЗаписей();  
			НаборЗаписей.Отбор.ВидПеречня.Установить(Объект.ВидПеречня); 
			НаборЗаписей.Отбор.ДатаПеречня.Установить(Объект.ДатаПеречня);
			
			Для Каждого СтрокаТаблицы Из ТаблЗнач Цикл 	
			    НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Период = ДатаЗагрузки;   
				НоваяЗапись.ВидПеречня = Объект.ВидПеречня;
				НоваяЗапись.ДатаПеречня = Объект.ДатаПеречня;
				НоваяЗапись.ИД = СтрокаТаблицы.ИД;
			    НоваяЗапись.ДокументИдентификатор = СтрокаТаблицы.ДокументИдентификатор;
			    НоваяЗапись.ДокументНаименование = СтрокаТаблицы.ДокументНаименование;
			    НоваяЗапись.ДокументСерия = СтрокаТаблицы.ДокументСерия; 
				НоваяЗапись.ДокументНомер = СтрокаТаблицы.ДокументНомер; 
				НоваяЗапись.ДокументКемВыдан = СтрокаТаблицы.ДокументКемВыдан;  
				НоваяЗапись.ДокументДатаВыдачи = СтрокаТаблицы.ДокументДатаВыдачи; 
			КонецЦикла; 

			НаборЗаписей.Записать(Истина);    
		КонецЕсли;	
		
		Если НЕ Объект.ТаблицаДрНаименованияМВК.Количество() = 0 Тогда 
			ТаблЗнач = Объект.ТаблицаДрНаименованияМВК.Выгрузить();
			ПоискДублейСтрокВТабЧасти(ТаблЗнач);
			Рег = РегистрыСведений.ЛБ_ПереченьНежелательныхЛицДрНаименования;
		    НаборЗаписей = Рег.СоздатьНаборЗаписей(); 
			НаборЗаписей.Отбор.ВидПеречня.Установить(Объект.ВидПеречня);
			НаборЗаписей.Отбор.ДатаПеречня.Установить(Объект.ДатаПеречня);
			
			Для Каждого СтрокаТаблицы Из ТаблЗнач Цикл 	
			    НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Период = ДатаЗагрузки;
				НоваяЗапись.ВидПеречня = Объект.ВидПеречня;
				НоваяЗапись.ДатаПеречня = Объект.ДатаПеречня;
				НоваяЗапись.ИД = СтрокаТаблицы.ИД;
			    НоваяЗапись.Наименование = СтрокаТаблицы.Наименование; 
				НоваяЗапись.ДатаРождения = СтрокаТаблицы.ДатаРождения;
			    НоваяЗапись.ГодРождения = СтрокаТаблицы.ГодРождения;
				//+МАН 13.10.25 Запись технического наименования
				Если ЗначениеЗаполнено(СтрокаТаблицы.Наименование) Тогда
					Символ = Лев(СтрокаТаблицы.Наименование, 1);
					
					Если ЭтоРусскаяБуква(Символ) Тогда
						НоваяЗапись.ТехническоеНаименование = ЛБ_ОбщийМодуль.СформироватьТехническоеНаименование(СтрокаТаблицы.Наименование);
					КонецЕсли;
				КонецЕсли;
				//-МАН
				//+МАН 23.10.25 Запись разделеного ФИО
				НоваяЗапись.Фамилия = СтрокаТаблицы.Фамилия;
				НоваяЗапись.Имя = СтрокаТаблицы.Имя;
				НоваяЗапись.Отчество = СтрокаТаблицы.Отчество;
				//-МАН
			КонецЦикла; 

			НаборЗаписей.Записать(Истина);    
		КонецЕсли;	
		
		Если НЕ Объект.ТаблицаМВКАдреса.Количество() = 0 Тогда 
			ТаблЗнач = Объект.ТаблицаМВКАдреса.Выгрузить();
			ПоискДублейСтрокВТабЧасти(ТаблЗнач);
			Рег = РегистрыСведений.ЛБ_ПереченьНежелательныхЛицАдреса;
		    НаборЗаписей = Рег.СоздатьНаборЗаписей(); 
			НаборЗаписей.Отбор.ВидПеречня.Установить(Объект.ВидПеречня);
			НаборЗаписей.Отбор.ДатаПеречня.Установить(Объект.ДатаПеречня);
			
			Для Каждого СтрокаТаблицы Из ТаблЗнач Цикл 
			    НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Период = ДатаЗагрузки;
				НоваяЗапись.ВидПеречня = Объект.ВидПеречня;
				НоваяЗапись.ДатаПеречня = Объект.ДатаПеречня;
				НоваяЗапись.ИД = СтрокаТаблицы.ИД;
			    НоваяЗапись.Адрес = СтрокаТаблицы.Адрес; 
				НоваяЗапись.ТипАдреса = СтрокаТаблицы.ТипАдреса;
				НоваяЗапись.ОКАТО = СтрокаТаблицы.ОКАТО;
			КонецЦикла; 

			НаборЗаписей.Записать(Истина);    
		КонецЕсли;	
		
    ИначеЕсли Объект.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.Террористы Тогда
   		ЭтоТеррористы = Ложь; 
		Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.ПустаяСсылка();
		Пока ЧтениеXML.Прочитать() Цикл 
			Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "АктуальныйПеречень" Тогда
				Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен;
				Прервать;
			КонецЕсли;	 
			
			Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 
				ИмяАтрибута = ЧтениеXML.Имя;
				Если сокрЛП(ЧтениеXML.Имя) = "Перечень" Тогда
					ЭтоТеррористы = Истина;
				КонецЕсли;	
			ИначеЕсли ЧтениеXML.ТипУзла=ТипУзлаXML.Текст Тогда
				Если ИмяАтрибута = "ДатаПеречня" Тогда
					 Объект.ДатаПеречня = XMLЗначение(Тип("Дата"), ЧтениеXML.Значение); 
				ИначеЕсли ИмяАтрибута = "ДатаПредыдущегоПеречня" Тогда
					 Объект.ДатаПредыдущегоПеречня = XMLЗначение(Тип("Дата"), ЧтениеXML.Значение); 	 
				КонецЕсли;	
			КонецЕсли;		
		Конеццикла;	  
		
		Если НЕ ЭтоТеррористы Тогда 
			Сообщить("Выбранный файл не является списком террористов!"); 
			Возврат;
		КонецЕсли;
		
		СтекУзлов = Новый Массив;
		ТекущийПуть = "";  
		Объект.ТаблицаТеррористы.Очистить();
		Объект.ТаблицаТеррористыДокументы.Очистить(); 
		Объект.ТаблицаДрНаименованияТеррористы.Очистить();
		Объект.ТаблицаТеррористыАдреса.Очистить(); 
		Пока ЧтениеXML.Прочитать() Цикл  
			
			Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
				СтекУзлов.Добавить(ЧтениеXML.Имя);
				ТекущийПуть = МассивВСтроку(СтекУзлов);    
				Если ЧтениеXML.Имя = "Субъект" И  ТекущийПуть = "Субъект" Тогда 
					НоваяСтр = Объект.ТаблицаТеррористы.Добавить();
					НоваяСтр.Статус = Статус;
					СписокГражданств = "";   					 
				ИначеЕсли ЧтениеXML.Имя = "Документ" И  ТекущийПуть = "Субъект/ФЛ/СписокДокументов/Документ" Тогда	
					НоваяСтрДок = Объект.ТаблицаТеррористыДокументы.Добавить(); 
					НоваяСтрДок.ИД = НоваяСтр.ИД;    
				ИначеЕсли ЧтениеXML.Имя = "Адрес" И  ТекущийПуть = "Субъект/СписокАдресов/Адрес" Тогда	
					НоваяСтрА = Объект.ТаблицаТеррористыАдреса.Добавить(); 
					НоваяСтрА.ИД = НоваяСтр.ИД; 	
				КонецЕсли;	
					
			ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда 
				Если ТекущийПуть = "Субъект/ИдСубъекта" Тогда
					НоваяСтр.ИД = СокрЛП(ЧтениеXML.Значение);
				ИначеЕсли ТекущийПуть = "Субъект/ТипСубъекта/Идентификатор" Тогда
	                НоваяСтр.ЮридическоеФизическоеЛицо = ?(ЧтениеXML.Значение = "1" или ЧтениеXML.Значение = "3", Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо, Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо);
				ИначеЕсли ТекущийПуть = "Субъект/История/ДатаВключения" Тогда
					НоваяСтр.ДатаВключенияВПеречень = XMLЗначение(Тип("Дата"), ЧтениеXML.Значение); 
				ИначеЕсли ТекущийПуть = "Субъект/Орг/Наименование" Тогда
					НоваяСтр.Наименование = ВРЕГ(ЧтениеXML.Значение);
				ИначеЕсли ТекущийПуть = "Субъект/Орг/НаименованиеЛат" Тогда
					НоваяСтр.НаименованиеЛат = ВРЕГ(ЧтениеXML.Значение);
		        ИначеЕсли ТекущийПуть = "Субъект/ФЛ/ФИО" Тогда
					НоваяСтр.Наименование = ВРЕГ(ЧтениеXML.Значение);
				ИначеЕсли ТекущийПуть = "Субъект/ФЛ/ФИОЛат" Тогда
					НоваяСтр.НаименованиеЛат = ВРЕГ(ЧтениеXML.Значение);
	            ИначеЕсли ТекущийПуть = "Субъект/ФЛ/Фамилия" Тогда
					НоваяСтр.Фамилия = ВРЕГ(ЧтениеXML.Значение); 
				ИначеЕсли ТекущийПуть = "Субъект/ФЛ/Имя" Тогда
					НоваяСтр.Имя = ВРЕГ(ЧтениеXML.Значение); 
				ИначеЕсли ТекущийПуть = "Субъект/ФЛ/Отчество" Тогда
					НоваяСтр.Отчество = ВРЕГ(ЧтениеXML.Значение); 		
				ИначеЕсли ТекущийПуть = "Субъект/ФЛ/ДатаРождения" Тогда
					НоваяСтр.ДатаРождения = XMLЗначение(Тип("Дата"), ЧтениеXML.Значение);
		        ИначеЕсли ТекущийПуть = "Субъект/ФЛ/ГодРождения" Тогда
					Попытка
					    НоваяСтр.ГодРождения = Число(ЧтениеXML.Значение);
					Исключение
					КонецПопытки; 
				ИначеЕсли ТекущийПуть = "Субъект/ФЛ/МестоРождения" Тогда
					НоваяСтр.МестоРождения = ЧтениеXML.Значение; 
				ИначеЕсли ТекущийПуть = "Субъект/ФЛ/ИНН" Тогда
					НоваяСтр.ИНН = ЧтениеXML.Значение;
				ИначеЕсли ТекущийПуть = "Субъект/ФЛ/СНИЛС" Тогда
					НоваяСтр.СНИЛС = ЧтениеXML.Значение; 	
				ИначеЕсли ТекущийПуть = "Субъект/ФЛ/СписокГражданств/Гражданство" Тогда
					СписокГражданств = СписокГражданств + ?(ПустаяСтрока(СписокГражданств), "", "; ") + ЧтениеXML.Значение;
				ИначеЕсли ТекущийПуть = "Субъект/ФЛ/СписокДрНаименований/ДрНаименование/ФИО" Тогда 
					НоваяСтрДр = Объект.ТаблицаДрНаименованияТеррористы.Добавить(); 
					НоваяСтрДр.ИД = НоваяСтр.ИД;	
	                НоваяСтрДр.Наименование = ЧтениеXML.Значение; 
					//+МАН 23.10.25 Добавил разделение другого наименования на фамилию, Имя и Иотчество и запись в регистр
					Если НоваяСтр.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо
						И НЕ ПустаяСтрока(ЧтениеXML.Значение) Тогда
						СтруктураФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(СокрЛП(ЧтениеXML.Значение));
						
						НоваяСтрДр.Фамилия = СтруктураФИО.Фамилия;
						НоваяСтрДр.Имя = СтруктураФИО.Имя;
						НоваяСтрДр.Отчество = СтруктураФИО.Отчество;
					КонецЕсли;
					//-МАН
				ИначеЕсли ТекущийПуть = "Субъект/ФЛ/СписокДрНаименований/ДрНаименование/ДатаРождения" Тогда  	
	                НоваяСтрДр.ДатаРождения = XMLЗначение(Тип("Дата"), ЧтениеXML.Значение); 	
				ИначеЕсли ТекущийПуть = "Субъект/ФЛ/СписокДрНаименований/ДрНаименование/ГодРождения" Тогда  	
	                Попытка
					    НоваяСтр.ГодРождения = Число(ЧтениеXML.Значение);
					Исключение
					КонецПопытки; 		
				ИначеЕсли ТекущийПуть = "Субъект/ФЛ/СписокДокументов/Документ/ТипДокумента/Идентификатор" Тогда
					НоваяСтрДок.ДокументИдентификатор = ЧтениеXML.Значение; 
				ИначеЕсли ТекущийПуть = "Субъект/ФЛ/СписокДокументов/Документ/ТипДокумента/Наименование" Тогда
					НоваяСтрДок.ДокументНаименование = ЧтениеXML.Значение;  
				ИначеЕсли ТекущийПуть = "Субъект/ФЛ/СписокДокументов/Документ/Серия" Тогда
					НоваяСтрДок.ДокументСерия = ЧтениеXML.Значение;		
				ИначеЕсли ТекущийПуть = "Субъект/ФЛ/СписокДокументов/Документ/Номер" Тогда
					НоваяСтрДок.ДокументНомер = ЧтениеXML.Значение;	
				ИначеЕсли ТекущийПуть = "Субъект/ФЛ/СписокДокументов/Документ/ОрганВыдачи" Тогда
					НоваяСтрДок.ДокументКемВыдан = ЧтениеXML.Значение;	
				ИначеЕсли ТекущийПуть = "Субъект/ФЛ/СписокДокументов/Документ/ДатаВыдачи" Тогда
					НоваяСтрДок.ДокументДатаВыдачи = XMLЗначение(Тип("Дата"), ЧтениеXML.Значение);
				ИначеЕсли ТекущийПуть = "Субъект/СписокАдресов/Адрес/ТипАдреса/Наименование" Тогда
					НоваяСтрА.ТипАдреса = ЧтениеXML.Значение;  
				ИначеЕсли ТекущийПуть = "Субъект/СписокАдресов/Адрес/ТекстАдреса" Тогда
					НоваяСтрА.Адрес = ЧтениеXML.Значение; 
				ИначеЕсли ТекущийПуть = "Субъект/СписокАдресов/Адрес/Страна/Наименование" Тогда
					НоваяСтрА.Страна = ЧтениеXML.Значение; 
				ИначеЕсли ТекущийПуть = "Субъект/СписокАдресов/Адрес/ОКАТО" Тогда
					НоваяСтрА.ОКАТО = ЧтениеXML.Значение;
				ИначеЕсли ТекущийПуть = "Субъект/СписокАдресов/Адрес/Регион" Тогда
					НоваяСтрА.Регион = ЧтениеXML.Значение;
				ИначеЕсли ТекущийПуть = "Субъект/СписокАдресов/Адрес/Город" Тогда
					НоваяСтрА.Город = ЧтениеXML.Значение;	
				ИначеЕсли ТекущийПуть = "Субъект/СписокАдресов/Адрес/Улица" Тогда
					НоваяСтрА.Улица = ЧтениеXML.Значение;	
				ИначеЕсли ТекущийПуть = "Субъект/СписокАдресов/Адрес/Дом" Тогда
					НоваяСтрА.Дом = ЧтениеXML.Значение;	
				ИначеЕсли ТекущийПуть = "Субъект/СписокАдресов/Адрес/Помещение" Тогда
					НоваяСтрА.Помещение = ЧтениеXML.Значение;		
				КонецЕсли;	
			ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда 
				Если  ЧтениеXML.Имя = "АктуальныйПеречень" Тогда   
					Прервать;
				КонецЕсли;    
				
				Если ЧтениеXML.Имя = "Субъект" Тогда
					Если НЕ ПустаяСтрока(СписокГражданств) Тогда 
						НоваяСтр.Гражданство = СписокГражданств; 
					КонецЕсли;	
				КонецЕсли;
				
			    СтекУзлов.Удалить(СтекУзлов.Количество()-1); 
				ТекущийПуть = МассивВСтроку(СтекУзлов);
			КонецЕсли ;

		КонецЦикла;   
		
		//чтение последних включений/исключений
		//Пока ЧтениеXML.Прочитать() Цикл  
		//	
		//	Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
		//		СтекУзлов.Добавить(ЧтениеXML.Имя);
		//		ТекущийПуть = МассивВСтроку(СтекУзлов);    
		//		Если ЧтениеXML.Имя = "ПоследниеВключенные" Тогда
		//			Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен;  
		//			Каталог = ЧтениеXML.Имя;
		//		ИначеЕсли ЧтениеXML.Имя = "ПоследниеИсключенные" Тогда
		//			Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Исключен;
		//			Каталог = ЧтениеXML.Имя;
		//		КонецЕсли;	  
		//		
		//		Если ЧтениеXML.Имя = "ВклИсклСубъект" И  ТекущийПуть = Каталог+"/ВклИсклСубъект" Тогда 
		//			НоваяСтр = Объект.ТаблицаТеррористы.Добавить();
		//			НоваяСтр.Статус = Статус;
		//			СписокГражданств = "";   					 
		//		ИначеЕсли ЧтениеXML.Имя = "Документ" И  ТекущийПуть = Каталог+"/ВклИсклСубъект/ВклИсклФЛ/СписокДокументов/Документ" Тогда	
		//			НоваяСтрДок = Объект.ТаблицаТеррористыДокументы.Добавить(); 
		//			НоваяСтрДок.ИД = НоваяСтр.ИД;    
		//		ИначеЕсли ЧтениеXML.Имя = "Адрес" И  ТекущийПуть = Каталог+"/ВклИсклСубъект/СписокАдресов/Адрес" Тогда	
		//			НоваяСтрА = Объект.ТаблицаТеррористыАдреса.Добавить(); 
		//			НоваяСтрА.ИД = НоваяСтр.ИД; 	
		//		КонецЕсли;	
		//			
		//	ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда 
		//		Если ТекущийПуть = Каталог+"/ВклИсклСубъект/ИдСубъекта" Тогда
		//			НоваяСтр.ИД = СокрЛП(ЧтениеXML.Значение);
		//		ИначеЕсли ТекущийПуть = Каталог+"/ВклИсклСубъект/ТипВклИсклСубъекта/Идентификатор" Тогда
		//            НоваяСтр.ЮридическоеФизическоеЛицо = ?(ЧтениеXML.Значение = "1" или ЧтениеXML.Значение = "3", Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо, Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо);
		//		ИначеЕсли ТекущийПуть = Каталог+"/ВклИсклСубъект/История/ДатаВключения" Тогда
		//			НоваяСтр.ДатаВключенияВПеречень = XMLЗначение(Тип("Дата"), ЧтениеXML.Значение); 
		//		ИначеЕсли ТекущийПуть = Каталог+"/ВклИсклСубъект/ВклИсклОрг/Наименование" Тогда
		//			НоваяСтр.Наименование = ЧтениеXML.Значение;
		//		ИначеЕсли ТекущийПуть = Каталог+"/ВклИсклСубъект/ВклИсклОрг/НаименованиеЛат" Тогда
		//			НоваяСтр.НаименованиеЛат = ЧтениеXML.Значение;
		//        ИначеЕсли ТекущийПуть = Каталог+"/ВклИсклСубъект/ВклИсклФЛ/ФИО" Тогда
		//			НоваяСтр.Наименование = ЧтениеXML.Значение;
		//		ИначеЕсли ТекущийПуть = Каталог+"/ВклИсклСубъект/ВклИсклФЛ/ФИОЛат" Тогда
		//			НоваяСтр.НаименованиеЛат = ЧтениеXML.Значение;
		//        ИначеЕсли ТекущийПуть = Каталог+"/ВклИсклСубъект/ВклИсклФЛ/Фамилия" Тогда
		//			НоваяСтр.Фамилия = ЧтениеXML.Значение; 
		//		ИначеЕсли ТекущийПуть = Каталог+"/ВклИсклСубъект/ВклИсклФЛ/Имя" Тогда
		//			НоваяСтр.Имя = ЧтениеXML.Значение; 
		//		ИначеЕсли ТекущийПуть = Каталог+"/ВклИсклСубъект/ВклИсклФЛ/Отчество" Тогда
		//			НоваяСтр.Отчество = ЧтениеXML.Значение; 		
		//		ИначеЕсли ТекущийПуть = Каталог+"/ВклИсклСубъект/ВклИсклФЛ/ДатаРождения" Тогда
		//			НоваяСтр.ДатаРождения = XMLЗначение(Тип("Дата"), ЧтениеXML.Значение);
		//        ИначеЕсли ТекущийПуть = Каталог+"/ВклИсклСубъект/ВклИсклФЛ/ГодРождения" Тогда
		//			НоваяСтр.ГодРождения = Число(ЧтениеXML.Значение);  
		//		ИначеЕсли ТекущийПуть = Каталог+"/ВклИсклСубъект/ВклИсклФЛ/МестоРождения" Тогда
		//			НоваяСтр.МестоРождения = ЧтениеXML.Значение; 
		//		ИначеЕсли ТекущийПуть = Каталог+"/ВклИсклСубъект/ВклИсклФЛ/ИНН" Тогда
		//			НоваяСтр.ИНН = ЧтениеXML.Значение;
		//		ИначеЕсли ТекущийПуть = Каталог+"/ВклИсклСубъект/ВклИсклФЛ/СНИЛС" Тогда
		//			НоваяСтр.СНИЛС = ЧтениеXML.Значение; 	
		//		ИначеЕсли ТекущийПуть = Каталог+"/ВклИсклСубъект/ВклИсклФЛ/СписокГражданств/Гражданство" Тогда
		//			СписокГражданств = СписокГражданств + ?(ПустаяСтрока(СписокГражданств), "", "; ") + ЧтениеXML.Значение; 
		//		ИначеЕсли ТекущийПуть = Каталог+"/ВклИсклСубъект/ВклИсклФЛ/СписокДрНаименований/ДрНаименование/ФИО" Тогда 
		//			НоваяСтрДр = Объект.ТаблицаДрНаименованияТеррористы.Добавить(); 
		//			НоваяСтрДр.ИД = НоваяСтр.ИД;	
		//            НоваяСтрДр.Наименование = ЧтениеXML.Значение; 	
		//		ИначеЕсли ТекущийПуть = Каталог+"/ВклИсклСубъект/ВклИсклФЛ/СписокДокументов/Документ/ТипДокумента/Идентификатор" Тогда
		//			НоваяСтрДок.ДокументИдентификатор = ЧтениеXML.Значение; 
		//		ИначеЕсли ТекущийПуть = Каталог+"/ВклИсклСубъект/ВклИсклФЛ/СписокДокументов/Документ/ТипДокумента/Наименование" Тогда
		//			НоваяСтрДок.ДокументНаименование = ЧтениеXML.Значение;  
		//		ИначеЕсли ТекущийПуть = Каталог+"/ВклИсклСубъект/ВклИсклФЛ/СписокДокументов/Документ/Серия" Тогда
		//			НоваяСтрДок.ДокументСерия = ЧтениеXML.Значение;		
		//		ИначеЕсли ТекущийПуть = Каталог+"/ВклИсклСубъект/ВклИсклФЛ/СписокДокументов/Документ/Номер" Тогда
		//			НоваяСтрДок.ДокументНомер = ЧтениеXML.Значение;	
		//		ИначеЕсли ТекущийПуть = Каталог+"/ВклИсклСубъект/ВклИсклФЛ/СписокДокументов/Документ/ОрганВыдачи" Тогда
		//			НоваяСтрДок.ДокументКемВыдан = ЧтениеXML.Значение;	
		//		ИначеЕсли ТекущийПуть = Каталог+"/ВклИсклСубъект/ВклИсклФЛ/СписокДокументов/Документ/ДатаВыдачи" Тогда
		//			НоваяСтрДок.ДокументДатаВыдачи = XMLЗначение(Тип("Дата"), ЧтениеXML.Значение);
		//		ИначеЕсли ТекущийПуть = Каталог+"/ВклИсклСубъект/СписокАдресов/Адрес/ТипАдреса/Наименование" Тогда
		//			НоваяСтрА.ТипАдреса = ЧтениеXML.Значение;  
		//		ИначеЕсли ТекущийПуть = Каталог+"/ВклИсклСубъект/СписокАдресов/Адрес/ТекстАдреса" Тогда
		//			НоваяСтрА.Адрес = ЧтениеXML.Значение; 
		//		ИначеЕсли ТекущийПуть = Каталог+"/ВклИсклСубъект/СписокАдресов/Адрес/Страна/Наименование" Тогда
		//			НоваяСтрА.Страна = ЧтениеXML.Значение; 
		//		ИначеЕсли ТекущийПуть = Каталог+"/ВклИсклСубъект/СписокАдресов/Адрес/ОКАТО" Тогда
		//			НоваяСтрА.ОКАТО = ЧтениеXML.Значение;
		//		ИначеЕсли ТекущийПуть = Каталог+"/ВклИсклСубъект/СписокАдресов/Адрес/Регион" Тогда
		//			НоваяСтрА.Регион = ЧтениеXML.Значение;
		//		ИначеЕсли ТекущийПуть = Каталог+"/ВклИсклСубъект/СписокАдресов/Адрес/Город" Тогда
		//			НоваяСтрА.Город = ЧтениеXML.Значение;	
		//		ИначеЕсли ТекущийПуть = Каталог+"/ВклИсклСубъект/СписокАдресов/Адрес/Улица" Тогда
		//			НоваяСтрА.Улица = ЧтениеXML.Значение;	
		//		ИначеЕсли ТекущийПуть = "ВклИсклСубъект/СписокАдресов/Адрес/Дом" Тогда
		//			НоваяСтрА.Дом = ЧтениеXML.Значение;	
		//		ИначеЕсли ТекущийПуть = Каталог+"/ВклИсклСубъект/СписокАдресов/Адрес/Помещение" Тогда
		//			НоваяСтрА.Помещение = ЧтениеXML.Значение;		
		//		КонецЕсли;	
		//	ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
		//		Если  ЧтениеXML.Имя = "Перечень" Тогда   
		//			Продолжить;
		//		КонецЕсли;   
		//		Если  ЧтениеXML.Имя = "ПоследниеИсключенные" Тогда   
		//			Прервать;
		//		КонецЕсли;    
		//		
		//		Если ЧтениеXML.Имя = Каталог+"/ВклИсклСубъект" Тогда
		//			Если НЕ ПустаяСтрока(СписокГражданств) Тогда 
		//				НоваяСтр.Гражданство = СписокГражданств; 
		//			КонецЕсли;	
		//		КонецЕсли;
		//		
		//	    СтекУзлов.Удалить(СтекУзлов.Количество()-1); 
		//		ТекущийПуть = МассивВСтроку(СтекУзлов);
		//	КонецЕсли ;

		//КонецЦикла; 

	    ЧтениеXML.Закрыть(); 
									
		Если НЕ Объект.ТаблицаТеррористы.Количество() = 0 Тогда
			ТаблЗнач = Объект.ТаблицаТеррористы.Выгрузить();
			ПоискДублейСтрокВТабЧастиОсн(ТаблЗнач);
			Рег = РегистрыСведений.ЛБ_ПереченьНежелательныхЛиц;
		    НаборЗаписей = Рег.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ВидПеречня.Установить(Объект.ВидПеречня); 
			НаборЗаписей.Отбор.ДатаПеречня.Установить(Объект.ДатаПеречня);
			
			Для Каждого СтрокаТаблицы Из ТаблЗнач Цикл 	   
			   НоваяЗапись = НаборЗаписей.Добавить(); 
			   НоваяЗапись.Период = ДатаЗагрузки; 
			   НоваяЗапись.ВидПеречня = Объект.ВидПеречня; 
			   НоваяЗапись.ДатаПеречня = Объект.ДатаПеречня;
			   НоваяЗапись.ДатаПредыдущегоПеречня = Объект.ДатаПредыдущегоПеречня;
			   НоваяЗапись.ДатаВключенияВПеречень = СтрокаТаблицы.ДатаВключенияВПеречень; 
			   НоваяЗапись.ИД = СтрокаТаблицы.ИД;  
			   НоваяЗапись.ЮридическоеФизическоеЛицо = СтрокаТаблицы.ЮридическоеФизическоеЛицо;
			   НоваяЗапись.ДатаРождения = СтрокаТаблицы.ДатаРождения;
			   НоваяЗапись.ГодРождения = СтрокаТаблицы.ГодРождения;
			   НоваяЗапись.МестоРождения = СтрокаТаблицы.МестоРождения;
			   НоваяЗапись.Гражданство = СтрокаТаблицы.Гражданство;
			   НоваяЗапись.Фамилия = СтрокаТаблицы.Фамилия; 
			   НоваяЗапись.Имя = СтрокаТаблицы.Имя;
			   НоваяЗапись.Отчество = СтрокаТаблицы.Отчество;
			   НоваяЗапись.Наименование = СтрокаТаблицы.Наименование; 
			   НоваяЗапись.НаименованиеЛат = СтрокаТаблицы.НаименованиеЛат;
			   НоваяЗапись.ИНН = СтрокаТаблицы.ИНН;
			   НоваяЗапись.СНИЛС = СтрокаТаблицы.СНИЛС;
			   НоваяЗапись.Статус = СтрокаТаблицы.Статус;  
			   НоваяЗапись.Ответственный = Пользователи.ТекущийПользователь();
			   НоваяЗапись.РазмерФайла = РазмерФайла;
			   //+МАН 13.10.25 Запись технического наименования
			   Если ЗначениеЗаполнено(СтрокаТаблицы.Наименование) Тогда
				   Символ = Лев(СтрокаТаблицы.Наименование, 1);
				   
				   Если ЭтоРусскаяБуква(Символ) Тогда
					   НоваяЗапись.ТехническоеНаименование = ЛБ_ОбщийМодуль.СформироватьТехническоеНаименование(СтрокаТаблицы.Наименование);
				   КонецЕсли;
			   КонецЕсли;
			   //-МАН
			КонецЦикла; 

			НаборЗаписей.Записать(Истина); 	     
		КонецЕсли;	
			
		Если НЕ Объект.ТаблицаТеррористыДокументы.Количество() = 0 Тогда  
			ТаблЗнач = Объект.ТаблицаТеррористыДокументы.Выгрузить();       
			ПоискДублейСтрокВТабЧасти(ТаблЗнач);
			Рег = РегистрыСведений.ЛБ_ПереченьНежелательныхЛицДокументы;
		    НаборЗаписей = Рег.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ВидПеречня.Установить(Объект.ВидПеречня);
			НаборЗаписей.Отбор.ДатаПеречня.Установить(Объект.ДатаПеречня);
			
			Для Каждого СтрокаТаблицы Из ТаблЗнач Цикл 	
			    НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Период = ДатаЗагрузки;   
				НоваяЗапись.ВидПеречня = Объект.ВидПеречня;
				НоваяЗапись.ДатаПеречня = Объект.ДатаПеречня;
				НоваяЗапись.ИД = СтрокаТаблицы.ИД;
			    НоваяЗапись.ДокументИдентификатор = СтрокаТаблицы.ДокументИдентификатор;
			    НоваяЗапись.ДокументНаименование = СтрокаТаблицы.ДокументНаименование;
			    НоваяЗапись.ДокументСерия = СтрокаТаблицы.ДокументСерия; 
				НоваяЗапись.ДокументНомер = СтрокаТаблицы.ДокументНомер;
				НоваяЗапись.ДокументКемВыдан = СтрокаТаблицы.ДокументКемВыдан; 
				НоваяЗапись.ДокументДатаВыдачи = СтрокаТаблицы.ДокументДатаВыдачи;
			КонецЦикла; 

			НаборЗаписей.Записать(Истина);    
		КонецЕсли;
		
		Если НЕ Объект.ТаблицаДрНаименованияТеррористы.Количество() = 0 Тогда 
			ТаблЗнач = Объект.ТаблицаДрНаименованияТеррористы.Выгрузить();
			ПоискДублейСтрокВТабЧасти(ТаблЗнач);
			Рег = РегистрыСведений.ЛБ_ПереченьНежелательныхЛицДрНаименования;
		    НаборЗаписей = Рег.СоздатьНаборЗаписей(); 
			НаборЗаписей.Отбор.ВидПеречня.Установить(Объект.ВидПеречня);
			НаборЗаписей.Отбор.ДатаПеречня.Установить(Объект.ДатаПеречня);
			
			Для Каждого СтрокаТаблицы Из ТаблЗнач Цикл 	
			    НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Период = ДатаЗагрузки;
				НоваяЗапись.ВидПеречня = Объект.ВидПеречня;
				НоваяЗапись.ДатаПеречня = Объект.ДатаПеречня;
				НоваяЗапись.ИД = СтрокаТаблицы.ИД;
			    НоваяЗапись.Наименование = СтрокаТаблицы.Наименование;
				НоваяЗапись.ДатаРождения = СтрокаТаблицы.ДатаРождения; 
				НоваяЗапись.ГодРождения = СтрокаТаблицы.ГодРождения; 
				//+МАН 13.10.25 Запись технического наименования
				Если ЗначениеЗаполнено(СтрокаТаблицы.Наименование) Тогда
					Символ = Лев(СтрокаТаблицы.Наименование, 1);
					
					Если ЭтоРусскаяБуква(Символ) Тогда
						НоваяЗапись.ТехническоеНаименование = ЛБ_ОбщийМодуль.СформироватьТехническоеНаименование(СтрокаТаблицы.Наименование);
					КонецЕсли;
				КонецЕсли;
				//-МАН
				//+МАН 23.10.25 Запись разделеного ФИО
				НоваяЗапись.Фамилия = СтрокаТаблицы.Фамилия;
				НоваяЗапись.Имя = СтрокаТаблицы.Имя;
				НоваяЗапись.Отчество = СтрокаТаблицы.Отчество;
				//-МАН
			КонецЦикла; 

			НаборЗаписей.Записать(Истина);    
		КонецЕсли;	
		
		Если НЕ Объект.ТаблицаТеррористыАдреса.Количество() = 0 Тогда 
			ТаблЗнач = Объект.ТаблицаТеррористыАдреса.Выгрузить();
			ПоискДублейСтрокВТабЧасти(ТаблЗнач);
			Рег = РегистрыСведений.ЛБ_ПереченьНежелательныхЛицАдреса;
		    НаборЗаписей = Рег.СоздатьНаборЗаписей(); 
			НаборЗаписей.Отбор.ВидПеречня.Установить(Объект.ВидПеречня);
			НаборЗаписей.Отбор.ДатаПеречня.Установить(Объект.ДатаПеречня);
			
			Для Каждого СтрокаТаблицы Из ТаблЗнач Цикл 	
			    НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Период = ДатаЗагрузки;
				НоваяЗапись.ВидПеречня = Объект.ВидПеречня;
				НоваяЗапись.ДатаПеречня = Объект.ДатаПеречня;
				НоваяЗапись.ИД = СтрокаТаблицы.ИД;
			    НоваяЗапись.Адрес = СтрокаТаблицы.Адрес; 
				НоваяЗапись.ТипАдреса = СтрокаТаблицы.ТипАдреса;
				НоваяЗапись.ОКАТО = СтрокаТаблицы.ОКАТО;
				НоваяЗапись.Страна = СтрокаТаблицы.Страна;
				НоваяЗапись.Регион = СтрокаТаблицы.Регион;
				НоваяЗапись.Город = СтрокаТаблицы.Город;
				НоваяЗапись.Улица = СтрокаТаблицы.Улица;
				НоваяЗапись.Дом = СтрокаТаблицы.Дом;
				НоваяЗапись.Помещение = СтрокаТаблицы.Помещение;
			КонецЦикла; 

			НаборЗаписей.Записать(Истина);    
		КонецЕсли;	
     ИначеЕсли Объект.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ООН Тогда
   		ЭтоООН = Ложь; 
		ЕстьФизЛица = ложь;
		ИД = 0;     
		Пока ЧтениеXML.Прочитать() Цикл				 
			Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 
				ИмяАтрибута = ЧтениеXML.Имя;
				Если Найти(сокрЛП(ЧтениеXML.Имя), "CONSOLIDATED_LIST") > 0 Тогда
					ЭтоООН = Истина;  
					СтрокаДата = ЧтениеXML.ЗначениеАтрибута("dateGenerated");
					Поз = Найти(СтрокаДата, "T");
					Если НЕ Поз = 0 Тогда 
						СтрокаДата = Лев(СтрокаДата, Поз-1);
						Поз = Найти(СтрокаДата, "-"); 
						Год = Число(Лев(СтрокаДата, Поз-1)); 
						СтрокаДата = Сред(СтрокаДата, Поз + 1); 
						Поз = Найти(СтрокаДата, "-"); 
						Месяц = Число(Лев(СтрокаДата, Поз-1)); 
						СтрокаДата = Сред(СтрокаДата, Поз + 1);
						День = Число(СокрЛП(СтрокаДата));
						Объект.ДатаПеречня = Дата(Год, Месяц, День); 
						ИД = Год + Месяц + День;
					КонецЕсли;
				ИначеЕсли Найти(сокрЛП(ЧтениеXML.Имя), "INDIVIDUALS") > 0 Тогда
                    ЕстьФизЛица = Истина;    
					Прервать;
				Иначе
					Прервать;
				КонецЕсли;	
			КонецЕсли;		
		Конеццикла;
		
		Если НЕ ЭтоООН Тогда 
			Сообщить("Выбранный файл не является списком ООН!"); 
			Возврат;
		КонецЕсли;    
		
		Если НЕ ЕстьФизЛица Тогда 
			Сообщить("Выбранный файл не содержит информации о физических лицах!"); 
			Возврат;
		КонецЕсли;
	
		СтекУзлов = Новый Массив;
		ТекущийПуть = "";  
		Объект.ТаблицаООН.Очистить();
		Объект.ТаблицаООНДокументы.Очистить(); 
		Объект.ТаблицаООНАдреса.Очистить(); 
		Объект.ТаблицаДрНаименованияООН.Очистить();
		ДатаВключенияВПеречень = Дата(1,1,1);
		//ЕстьОшибки = ложь;
		Пока ЧтениеXML.Прочитать() Цикл  
			Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента И ЧтениеXML.Имя = "INDIVIDUALS" Тогда
				Прервать;
			КонецЕсли;
			
			Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
				СтекУзлов.Добавить(ЧтениеXML.Имя);
				ТекущийПуть = МассивВСтроку(СтекУзлов); 
				Если ЧтениеXML.Имя = "INDIVIDUAL" Тогда 
					НоваяСтр = Объект.ТаблицаООН.Добавить();
					НоваяСтр.Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен;
					НоваяСтр.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
					МестоРождения = "";
					СписокГражданств = "";
				ИначеЕсли ЧтениеXML.Имя = "INDIVIDUAL_DOCUMENT" И  ТекущийПуть = "INDIVIDUAL/INDIVIDUAL_DOCUMENT" Тогда	
					НоваяСтрДок = Объект.ТаблицаООНДокументы.Добавить(); 
					НоваяСтрДок.ИД = НоваяСтр.ИД;    
				ИначеЕсли ЧтениеXML.Имя = "INDIVIDUAL_ADDRESS" И  ТекущийПуть = "INDIVIDUAL/INDIVIDUAL_ADDRESS" Тогда	
					НоваяСтрА = Объект.ТаблицаООНАдреса.Добавить(); 
					НоваяСтрА.ИД = НоваяСтр.ИД;   
				ИначеЕсли ЧтениеXML.Имя = "INDIVIDUAL_ALIAS" И  ТекущийПуть = "INDIVIDUAL/INDIVIDUAL_ALIAS" Тогда	
					НоваяСтрД = Объект.ТаблицаДрНаименованияООН.Добавить(); 
					НоваяСтрД.ИД = НоваяСтр.ИД; 	
				КонецЕсли;	
					
			ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
				Если ТекущийПуть = "INDIVIDUAL/DATAID" Тогда 
					НоваяСтр.ИД = ЧтениеXML.Значение;
				ИначеЕсли ТекущийПуть = "INDIVIDUAL/FIRST_NAME" Тогда
					Если ВерсияПеречня = 0 Тогда
						ПервоеИмя = СокрЛП(ЧтениеXML.Значение);
						Если НЕ ПустаяСтрока(ПервоеИмя) Тогда
							Если СтроковыеФункцииКлиентСерверРФ.ТолькоКириллицаВСтроке(ПервоеИмя, , " -") Тогда 
								ВерсияПеречня = 1;
							Иначе                 
								ВерсияПеречня = 2;
								//Если НЕ ПроверитьЕстьРусскаяВерсияПеречняООН() Тогда
								//	ЕстьОшибки = Истина;
								//	Прервать;
								//КонецЕсли;	
							КонецЕсли;	
						КонецЕсли;	
					КонецЕсли;	   
					НоваяСтр.Наименование = СокрЛП(ЧтениеXML.Значение); 
					Если ВерсияПеречня = 2 Тогда
						НоваяСтр.НаименованиеЛат = СокрЛП(ЧтениеXML.Значение);   
					КонецЕсли;	
				ИначеЕсли ТекущийПуть = "INDIVIDUAL/SECOND_NAME" Тогда	 
					НоваяСтр.Наименование = НоваяСтр.Наименование + ?(ПустаяСтрока(НоваяСтр.Наименование), "", " ") + СокрЛП(ЧтениеXML.Значение);
					Если ВерсияПеречня = 2 Тогда
						НоваяСтр.НаименованиеЛат = НоваяСтр.НаименованиеЛат + ?(ПустаяСтрока(НоваяСтр.НаименованиеЛат), "", " ") + СокрЛП(ЧтениеXML.Значение); 
					КонецЕсли;	
	            ИначеЕсли ТекущийПуть = "INDIVIDUAL/THIRD_NAME" Тогда	
					 НоваяСтр.Наименование = НоваяСтр.Наименование + ?(ПустаяСтрока(НоваяСтр.Наименование), "", " ")  + СокрЛП(ЧтениеXML.Значение); 
					Если ВерсияПеречня = 2 Тогда
						НоваяСтр.НаименованиеЛат = НоваяСтр.НаименованиеЛат + ?(ПустаяСтрока(НоваяСтр.НаименованиеЛат), "", " ") + СокрЛП(ЧтениеXML.Значение); 
					КонецЕсли;		
                ИначеЕсли ТекущийПуть = "INDIVIDUAL/FOURTH_NAME" Тогда	
					НоваяСтр.Наименование = НоваяСтр.Наименование + ?(ПустаяСтрока(НоваяСтр.Наименование), "", " ") + СокрЛП(ЧтениеXML.Значение); 
					Если ВерсияПеречня = 2 Тогда
						НоваяСтр.НаименованиеЛат = НоваяСтр.НаименованиеЛат + ?(ПустаяСтрока(НоваяСтр.НаименованиеЛат), "", " ") + СокрЛП(ЧтениеXML.Значение); 
					КонецЕсли;		
				ИначеЕсли ТекущийПуть = "INDIVIDUAL/COMMENTS1" Тогда
					НоваяСтр.Примечание = ЧтениеXML.Значение; 		
				ИначеЕсли ТекущийПуть = "INDIVIDUAL/LISTED_ON" Тогда 
					СтрокаДата = ЧтениеXML.Значение;
					Поз = Найти(СтрокаДата, "-"); 
					Год = Число(Лев(СтрокаДата, Поз-1)); 
					СтрокаДата = Сред(СтрокаДата, Поз + 1); 
					Поз = Найти(СтрокаДата, "-"); 
					Месяц = Число(Лев(СтрокаДата, Поз-1)); 
					СтрокаДата = Сред(СтрокаДата, Поз + 1);
					Поз = Найти(СтрокаДата, "-");
					Если Поз = 0 Тогда
					    День = Число(СокрЛП(СтрокаДата));
					Иначе
						День = Число(Лев(СтрокаДата, Поз-1)); 
					КонецЕсли;	
					НоваяСтр.ДатаВключенияВПеречень = Дата(Год, Месяц, День); 
				ИначеЕсли ТекущийПуть = "INDIVIDUAL/INDIVIDUAL_DATE_OF_BIRTH/DATE" Тогда
					Если НЕ НоваяСтр.ДатаРождения = Дата(1,1,1) Тогда
						СтрокаДата = ЧтениеXML.Значение;
						Поз = Найти(СтрокаДата, "-"); 
						Год = Число(Лев(СтрокаДата, Поз-1)); 
						СтрокаДата = Сред(СтрокаДата, Поз + 1); 
						Поз = Найти(СтрокаДата, "-"); 
						Месяц = Число(Лев(СтрокаДата, Поз-1)); 
						СтрокаДата = Сред(СтрокаДата, Поз + 1);
						Поз = Найти(СтрокаДата, "-");
						Если Поз = 0 Тогда
						    День = Число(СокрЛП(СтрокаДата));
						Иначе
							День = Число(Лев(СтрокаДата, Поз-1)); 
						КонецЕсли;	
						НоваяСтр.ДатаРождения = Дата(Год, Месяц, День);  
					КонецЕсли;	 
				ИначеЕсли ТекущийПуть = "INDIVIDUAL/INDIVIDUAL_DATE_OF_BIRTH/YEAR" Тогда
					Попытка
					    НоваяСтр.ГодРождения = Число(ЧтениеXML.Значение);
					Исключение
					КонецПопытки;	
				ИначеЕсли ТекущийПуть = "INDIVIDUAL/NATIONALITY/VALUE" Тогда	
					СписокГражданств = СписокГражданств + ?(ПустаяСтрока(СписокГражданств), "", "; ") + ЧтениеXML.Значение;
				ИначеЕсли ТекущийПуть = "INDIVIDUAL/INDIVIDUAL_PLACE_OF_BIRTH/CITY" Тогда
					МестоРождения = МестоРождения + ?(ПустаяСтрока(МестоРождения), "", " ") + ЧтениеXML.Значение;  
				ИначеЕсли ТекущийПуть = "INDIVIDUAL/INDIVIDUAL_PLACE_OF_BIRTH/COUNTRY" Тогда
					МестоРождения = МестоРождения + ?(ПустаяСтрока(МестоРождения), "", " ") + ЧтениеXML.Значение; 
				ИначеЕсли ТекущийПуть = "INDIVIDUAL/INDIVIDUAL_ALIAS/ALIAS_NAME" Тогда
					НоваяСтрД.Наименование = СокрЛП(ЧтениеXML.Значение);
					//+МАН 23.10.25 Добавил разделение другого наименования на фамилию, Имя и Иотчество и запись в регистр
					Если НоваяСтр.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо
						И НЕ ПустаяСтрока(ЧтениеXML.Значение) Тогда
						СтруктураФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(СокрЛП(ЧтениеXML.Значение));
						
						НоваяСтрД.Фамилия = СтруктураФИО.Фамилия;
						НоваяСтрД.Имя = СтруктураФИО.Имя;
						НоваяСтрД.Отчество = СтруктураФИО.Отчество;
					КонецЕсли;
					//-МАН
				ИначеЕсли ТекущийПуть = "INDIVIDUAL/INDIVIDUAL_ADDRESS/STREET" Тогда
					НоваяСтрА.Адрес = НоваяСтрА.Адрес + ?(ПустаяСтрока(НоваяСтрА.Адрес), "", " ") + "ул. " + СокрЛП(ЧтениеXML.Значение); 
				ИначеЕсли ТекущийПуть = "INDIVIDUAL/INDIVIDUAL_ADDRESS/CITY" Тогда
					НоваяСтрА.Адрес = НоваяСтрА.Адрес + ?(ПустаяСтрока(НоваяСтрА.Адрес), "", " ") + "г. " + СокрЛП(ЧтениеXML.Значение);
	            ИначеЕсли ТекущийПуть = "INDIVIDUAL/INDIVIDUAL_ADDRESS/COUNTRY" Тогда
					НоваяСтрА.Адрес = НоваяСтрА.Адрес + ?(ПустаяСтрока(НоваяСтрА.Адрес), "", " ") + СокрЛП(ЧтениеXML.Значение);	
				ИначеЕсли ТекущийПуть = "INDIVIDUAL/INDIVIDUAL_DOCUMENT/TYPE_OF_DOCUMENT" Тогда
                    НоваяСтрДок.ДокументНаименование = ЧтениеXML.Значение;
				ИначеЕсли ТекущийПуть = "INDIVIDUAL/INDIVIDUAL_DOCUMENT/NUMBER" Тогда
           			НоваяСтрДок.ДокументНомер = ЧтениеXML.Значение;	                 
				ИначеЕсли ТекущийПуть = "INDIVIDUAL/INDIVIDUAL_DOCUMENT/ISSUING_COUNTRY" Тогда	
					НоваяСтрДок.ДокументКемВыдан = ЧтениеXML.Значение;
				КонецЕсли;	
			ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда 
				Если  ЧтениеXML.Имя = "INDIVIDUALS" Тогда   
					Прервать;
				КонецЕсли;    
				
				Если ЧтениеXML.Имя = "INDIVIDUAL" Тогда
					Если НЕ ПустаяСтрока(СписокГражданств) Тогда 
						НоваяСтр.Гражданство = СписокГражданств; 
					КонецЕсли;	
				ИначеЕсли ЧтениеXML.Имя = "INDIVIDUAL_PLACE_OF_BIRTH" тогда	
					НоваяСтр.МестоРождения = МестоРождения;
					МестоРождения = "";
                Конецесли;
				
			    СтекУзлов.Удалить(СтекУзлов.Количество()-1); 
				ТекущийПуть = МассивВСтроку(СтекУзлов);
			КонецЕсли ;

		КонецЦикла; 
		ЧтениеXML.Закрыть();  
		
		//Если ЕстьОшибки Тогда
		//	ОбщегоНазначения.СообщитьПользователю("Вы выбрали файл с англоязычной версией перечня. Необходимо сначала загрузить русскоязычную версию!");
		//	Возврат;
		//КонецЕсли;	
		
		//Если ВерсияПеречня = 1 Тогда //русская версия
			Если НЕ Объект.ТаблицаООН.Количество() = 0 Тогда
				ТаблЗнач = Объект.ТаблицаООН.Выгрузить();
				ПоискДублейСтрокВТабЧастиОсн(ТаблЗнач);
				Рег = РегистрыСведений.ЛБ_ПереченьНежелательныхЛиц;
			    НаборЗаписей = Рег.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ВидПеречня.Установить(Объект.ВидПеречня); 
				НаборЗаписей.Отбор.ДатаПеречня.Установить(Объект.ДатаПеречня);
				
				Для Каждого СтрокаТаблицы Из ТаблЗнач Цикл 	   
				   НоваяЗапись = НаборЗаписей.Добавить(); 
				   НоваяЗапись.Период = ДатаЗагрузки; 
				   НоваяЗапись.ВидПеречня = Объект.ВидПеречня; 
				   НоваяЗапись.ДатаПеречня = Объект.ДатаПеречня;
				   НоваяЗапись.ДатаВключенияВПеречень = СтрокаТаблицы.ДатаВключенияВПеречень; 
				   НоваяЗапись.ИД = СтрокаТаблицы.ИД;  
				   НоваяЗапись.ЮридическоеФизическоеЛицо = СтрокаТаблицы.ЮридическоеФизическоеЛицо;
				   НоваяЗапись.ДатаРождения = СтрокаТаблицы.ДатаРождения;
				   НоваяЗапись.ГодРождения = СтрокаТаблицы.ГодРождения;
				   НоваяЗапись.Гражданство = СтрокаТаблицы.Гражданство;
				   НоваяЗапись.Наименование = ВРег(СтрокаТаблицы.Наименование); 
				   НоваяЗапись.НаименованиеЛат = ВРег(СтрокаТаблицы.НаименованиеЛат);
				   НоваяЗапись.Статус = СтрокаТаблицы.Статус;
				   НоваяЗапись.Ответственный = Пользователи.ТекущийПользователь();
				   НоваяЗапись.РазмерФайла = РазмерФайла;	
				   //+МАН 13.10.25 Запись технического наименования
				   Если ЗначениеЗаполнено(СтрокаТаблицы.Наименование) Тогда
					   Символ = Лев(СтрокаТаблицы.Наименование, 1);
					   
					   Если ЭтоРусскаяБуква(Символ) Тогда
						   НоваяЗапись.ТехническоеНаименование = ЛБ_ОбщийМодуль.СформироватьТехническоеНаименование(СтрокаТаблицы.Наименование);
					   КонецЕсли;
				   КонецЕсли;
				   //-МАН
				КонецЦикла; 

				НаборЗаписей.Записать(Истина); 	     
			КонецЕсли;	
				
			Если НЕ Объект.ТаблицаООНДокументы.Количество() = 0 Тогда  
				ТаблЗнач = Объект.ТаблицаООНДокументы.Выгрузить();       
				ПоискДублейСтрокВТабЧасти(ТаблЗнач);
				Рег = РегистрыСведений.ЛБ_ПереченьНежелательныхЛицДокументы;
			    НаборЗаписей = Рег.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ВидПеречня.Установить(Объект.ВидПеречня);
				НаборЗаписей.Отбор.ДатаПеречня.Установить(Объект.ДатаПеречня);
				
				Для Каждого СтрокаТаблицы Из ТаблЗнач Цикл 	
					Если ПустаяСтрока(СтрокаТаблицы.ДокументНомер) Тогда
						Продолжить;
					КонецЕсли;	
				    НоваяЗапись = НаборЗаписей.Добавить();
					НоваяЗапись.Период = ДатаЗагрузки;   
					НоваяЗапись.ВидПеречня = Объект.ВидПеречня;
					НоваяЗапись.ДатаПеречня = Объект.ДатаПеречня;
					НоваяЗапись.ИД = СтрокаТаблицы.ИД;
				    НоваяЗапись.ДокументНаименование = СтрокаТаблицы.ДокументНаименование;
					НоваяЗапись.ДокументНомер = СтрокаТаблицы.ДокументНомер;
					НоваяЗапись.ДокументКемВыдан = СтрокаТаблицы.ДокументКемВыдан; 
				КонецЦикла; 

				НаборЗаписей.Записать(Истина);    
			КонецЕсли;	  
			
			Если НЕ Объект.ТаблицаДрНаименованияООН.Количество() = 0 Тогда 
				ТаблЗнач = Объект.ТаблицаДрНаименованияООН.Выгрузить();
				ПоискДублейСтрокВТабЧасти(ТаблЗнач);
				Рег = РегистрыСведений.ЛБ_ПереченьНежелательныхЛицДрНаименования;
			    НаборЗаписей = Рег.СоздатьНаборЗаписей(); 
				НаборЗаписей.Отбор.ВидПеречня.Установить(Объект.ВидПеречня);
				НаборЗаписей.Отбор.ДатаПеречня.Установить(Объект.ДатаПеречня);
				
				Для Каждого СтрокаТаблицы Из ТаблЗнач Цикл 
					Если ПустаяСтрока(СтрокаТаблицы.Наименование) Тогда
						Продолжить;
					КонецЕсли;

				    НоваяЗапись = НаборЗаписей.Добавить();
					НоваяЗапись.Период = ДатаЗагрузки;
					НоваяЗапись.ВидПеречня = Объект.ВидПеречня;
					НоваяЗапись.ДатаПеречня = Объект.ДатаПеречня;
					НоваяЗапись.ИД = СтрокаТаблицы.ИД;
				    НоваяЗапись.Наименование = ВРег(СтрокаТаблицы.Наименование); 
					Отбор = Новый структура;
					Отбор.Вставить("ИД", СтрокаТаблицы.ИД);
					Строки = Объект.ТаблицаООН.НайтиСтроки(Отбор);
					Если НЕ Строки.Количество() = 0 тогда
						НоваяЗапись.ДатаРождения = Строки.Получить(0).ДатаРождения;
						НоваяЗапись.ГодРождения = Строки.Получить(0).ГодРождения;
					КонецЕсли;	
					//+МАН 13.10.25 Запись технического наименования
					Если ЗначениеЗаполнено(СтрокаТаблицы.Наименование) Тогда
						Символ = Лев(СтрокаТаблицы.Наименование, 1);
						
						Если ЭтоРусскаяБуква(Символ) Тогда
							НоваяЗапись.ТехническоеНаименование = ЛБ_ОбщийМодуль.СформироватьТехническоеНаименование(СтрокаТаблицы.Наименование);
						КонецЕсли;
					КонецЕсли;
					//-МАН
					//+МАН 23.10.25 Запись разделеного ФИО
					НоваяЗапись.Фамилия = СтрокаТаблицы.Фамилия;
					НоваяЗапись.Имя = СтрокаТаблицы.Имя;
					НоваяЗапись.Отчество = СтрокаТаблицы.Отчество;
					//-МАН
				КонецЦикла; 

				НаборЗаписей.Записать(Истина);    
			КонецЕсли;	
			
			Если НЕ Объект.ТаблицаООНАдреса.Количество() = 0 Тогда 
				ТаблЗнач = Объект.ТаблицаООНАдреса.Выгрузить();
				ПоискДублейСтрокВТабЧасти(ТаблЗнач);
				Рег = РегистрыСведений.ЛБ_ПереченьНежелательныхЛицАдреса;
			    НаборЗаписей = Рег.СоздатьНаборЗаписей(); 
				НаборЗаписей.Отбор.ВидПеречня.Установить(Объект.ВидПеречня);
				НаборЗаписей.Отбор.ДатаПеречня.Установить(Объект.ДатаПеречня);
				
				Для Каждого СтрокаТаблицы Из ТаблЗнач Цикл 
					Если ПустаяСтрока(СтрокаТаблицы.Адрес) Тогда
						Продолжить;
					КонецЕсли;
				    НоваяЗапись = НаборЗаписей.Добавить();
					НоваяЗапись.Период = ДатаЗагрузки;
					НоваяЗапись.ВидПеречня = Объект.ВидПеречня;
					НоваяЗапись.ДатаПеречня = Объект.ДатаПеречня;
					НоваяЗапись.ИД = СтрокаТаблицы.ИД;
				    НоваяЗапись.Адрес = СтрокаТаблицы.Адрес; 
				КонецЦикла; 

				НаборЗаписей.Записать(Истина);    
			КонецЕсли;	
		//ИначеЕсли ВерсияПеречня = 2 Тогда // англ. верся  
		//	
		//	Рег = РегистрыСведений.ЛБ_ПереченьНежелательныхЛиц;
		//    НаборЗаписей = Рег.СоздатьНаборЗаписей();
		//	НаборЗаписей.Отбор.ВидПеречня.Установить(Объект.ВидПеречня); 
		//	НаборЗаписей.Отбор.ДатаПеречня.Установить(Объект.ДатаПеречня);
		//	НаборЗаписей.Прочитать();
		//	
		//	ТаблицаООНРусская = НаборЗаписей.Выгрузить();  
		//	Для каждого Стр из ТаблицаООНРусская Цикл
		//		Отбор = Новый структура;
		//		Отбор.Вставить("ИД", Стр.ИД);				
		//		Строки = Объект.ТаблицаООН.НайтиСтроки(Отбор); 
		//		Если НЕ Строки.Количество() = 0 Тогда    
		//			Стр.НаименованиеЛат = Строки.Получить(0).НаименованиеЛат;
		//			Строки.Получить(0).Наименование = Стр.Наименование;
		//		КонецЕсли;	
		//	КонецЦикла;
		//	
		//	НаборЗаписей.Загрузить(ТаблицаООНРусская);
		//	НаборЗаписей.Записать(Истина);
		//КонецЕсли;	

	ИначеЕсли Объект.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ЦБ Тогда
   		ЭтоЦБ = Ложь;  
		ИД = 0;
		Пока ЧтениеXML.Прочитать() Цикл 
			Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента И ЧтениеXML.Имя = "СлужЧасть" Тогда
				Прервать;
			КонецЕсли;	 
			
			Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 
				ИмяАтрибута = ЧтениеXML.Имя;
				Если Найти(сокрЛП(ЧтениеXML.Имя), "СообщОтказ") > 0 Тогда
					ЭтоЦБ = Истина;
				КонецЕсли;	
			ИначеЕсли ЧтениеXML.ТипУзла=ТипУзлаXML.Текст Тогда
				Если ИмяАтрибута = "ДатаСообщения" Тогда 
					СтрокаДата = ЧтениеXML.Значение;
					Поз = Найти(СтрокаДата, "/"); 
					День = Число(Лев(СтрокаДата, Поз-1)); 
					СтрокаДата = Сред(СтрокаДата, Поз + 1); 
					Поз = Найти(СтрокаДата, "/"); 
					Месяц = Число(Лев(СтрокаДата, Поз-1)); 
					СтрокаДата = Сред(СтрокаДата, Поз + 1);
					Год = Число(СокрЛП(СтрокаДата));
					Объект.ДатаПеречня = Дата(Год, Месяц, День); 
					ИД = Год + Месяц + День;
				КонецЕсли;	
			КонецЕсли;		
		Конеццикла;	  
		
		Если НЕ ЭтоЦБ Тогда 
			Сообщить("Выбранный файл не является списком ЦБ!"); 
			Возврат;
		КонецЕсли;
		
		СтекУзлов = Новый Массив;
		ТекущийПуть = "";  
		Объект.ТаблицаЦБ.Очистить();
		Объект.ТаблицаЦБДокументы.Очистить();
		ДатаВключенияВПеречень = Дата(1,1,1);   
		КодОтказа = "";
		Пока ЧтениеXML.Прочитать() Цикл  
			
			Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
				СтекУзлов.Добавить(ЧтениеXML.Имя);
				ТекущийПуть = МассивВСтроку(СтекУзлов); 
				Если ЧтениеXML.Имя = "Участник" И  ТекущийПуть = "ИнформЧасть/Раздел2/Участник" Тогда 
					НоваяСтр = Объект.ТаблицаЦБ.Добавить();
					ИД = ИД + 1; 
					СтрокаИД = Строка(ИД);
					НоваяСтр.ИД = СтрЗаменить(СтрокаИД, " ", ""); 
					НоваяСтр.ДатаВключенияВПеречень = ДатаВключенияВПеречень; 
					НоваяСтр.КодОтказа = КодОтказа; 
					НоваяСтр.Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен;
					СписокГражданств = "";
				ИначеЕсли ЧтениеXML.Имя = "СведДокУдЛичн" И  ТекущийПуть = "ИнформЧасть/Раздел2/Участник/СведФЛИП/СведДокУдЛичн" Тогда	
					НоваяСтрДок = Объект.ТаблицаЦБДокументы.Добавить(); 
					НоваяСтрДок.ИД = НоваяСтр.ИД;    	
				КонецЕсли;	
					
			ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
				Если ТекущийПуть = "ИнформЧасть/Раздел2/СведОперация/ДатаОтказа" Тогда   
					СтрокаДата = ЧтениеXML.Значение;
					Поз = Найти(СтрокаДата, "/"); 
					День = Число(Лев(СтрокаДата, Поз-1)); 
					СтрокаДата = Сред(СтрокаДата, Поз + 1); 
					Поз = Найти(СтрокаДата, "/"); 
					Месяц = Число(Лев(СтрокаДата, Поз-1)); 
					СтрокаДата = Сред(СтрокаДата, Поз + 1);
					Год = Число(СокрЛП(СтрокаДата));
					ДатаВключенияВПеречень = Дата(Год, Месяц, День);
				ИначеЕсли ТекущийПуть = "ИнформЧасть/Раздел2/СведОперация/КодОтказа" Тогда 
					КодОтказа = СокрЛП(ЧтениеXML.Значение);	
				ИначеЕсли ТекущийПуть = "ИнформЧасть/Раздел2/Участник/ТипУчастника" Тогда
		            НоваяСтр.ЮридическоеФизическоеЛицо = ?(ЧтениеXML.Значение = "2", Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо, Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо);
		        ИначеЕсли ТекущийПуть = "ИнформЧасть/Раздел2/Участник/СведФЛИП/ФИОФЛИП/Фам" Тогда
					НоваяСтр.Фамилия = ВРЕГ(ЧтениеXML.Значение); 
				ИначеЕсли ТекущийПуть = "ИнформЧасть/Раздел2/Участник/СведФЛИП/ФИОФЛИП/Имя" Тогда
					НоваяСтр.Имя = ВРЕГ(ЧтениеXML.Значение); 
				ИначеЕсли ТекущийПуть = "ИнформЧасть/Раздел2/Участник/СведФЛИП/ФИОФЛИП/Отч" Тогда
					НоваяСтр.Отчество = ВРЕГ(ЧтениеXML.Значение); 	
				ИначеЕсли ТекущийПуть = "ИнформЧасть/Раздел2/Участник/СведФЛИП/ИНН" Тогда
					НоваяСтр.ИНН = ЧтениеXML.Значение; 		
				ИначеЕсли ТекущийПуть = "ИнформЧасть/Раздел2/Участник/СведФЛИП/ДатаРождения" Тогда 
					СтрокаДата = ЧтениеXML.Значение;
					Поз = Найти(СтрокаДата, "/"); 
					День = Число(Лев(СтрокаДата, Поз-1)); 
					СтрокаДата = Сред(СтрокаДата, Поз + 1); 
					Поз = Найти(СтрокаДата, "/"); 
					Месяц = Число(Лев(СтрокаДата, Поз-1)); 
					СтрокаДата = Сред(СтрокаДата, Поз + 1);
					Год = Число(СокрЛП(СтрокаДата));
					НоваяСтр.ДатаРождения = Дата(Год, Месяц, День); 
		        ИначеЕсли ТекущийПуть = "ИнформЧасть/Раздел2/Участник/СведФЛИП/СтранаНаименование" Тогда
					СписокГражданств = СписокГражданств + ?(ПустаяСтрока(СписокГражданств), "", "; ") + ЧтениеXML.Значение; 	
				ИначеЕсли ТекущийПуть = "ИнформЧасть/Раздел2/Участник/СведФЛИП/СведДокУдЛичн/ВидДокКод" Тогда
					НоваяСтрДок.ДокументИдентификатор = ЧтениеXML.Значение; 
				ИначеЕсли ТекущийПуть = "ИнформЧасть/Раздел2/Участник/СведФЛИП/СведДокУдЛичн/ВидДокНаименование" Тогда
					НоваяСтрДок.ДокументНаименование = ЧтениеXML.Значение;  
				ИначеЕсли ТекущийПуть = "ИнформЧасть/Раздел2/Участник/СведФЛИП/СведДокУдЛичн/СерияДок" Тогда
					НоваяСтрДок.ДокументСерия = ЧтениеXML.Значение;		
				ИначеЕсли ТекущийПуть = "ИнформЧасть/Раздел2/Участник/СведФЛИП/СведДокУдЛичн/НомДок" Тогда
					НоваяСтрДок.ДокументНомер = ЧтениеXML.Значение;	
				ИначеЕсли ТекущийПуть = "ИнформЧасть/Раздел2/Участник/СведФЛИП/СведДокУдЛичн/КемВыданДок" Тогда
					НоваяСтрДок.ДокументКемВыдан = ЧтениеXML.Значение;	
				ИначеЕсли ТекущийПуть = "ИнформЧасть/Раздел2/Участник/СведФЛИП/СведДокУдЛичн/ДатВыдачиДок" Тогда
					СтрокаДата = ЧтениеXML.Значение;
					Поз = Найти(СтрокаДата, "/"); 
					День = Число(Лев(СтрокаДата, Поз-1)); 
					СтрокаДата = Сред(СтрокаДата, Поз + 1); 
					Поз = Найти(СтрокаДата, "/"); 
					Месяц = Число(Лев(СтрокаДата, Поз-1)); 
					СтрокаДата = Сред(СтрокаДата, Поз + 1);
					Год = Число(СокрЛП(СтрокаДата));
					НоваяСтрДок.ДокументДатаВыдачи = Дата(Год, Месяц, День); 
				КонецЕсли;	
			ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда 
				Если  ЧтениеXML.Имя = "ИнформЧасть" Тогда   
					Прервать;
				КонецЕсли;    
				
				Если ЧтениеXML.Имя = "Участник" Тогда
					Если НЕ ПустаяСтрока(СписокГражданств) Тогда 
						НоваяСтр.Гражданство = СписокГражданств; 
					КонецЕсли;	
				КонецЕсли;
				
			    СтекУзлов.Удалить(СтекУзлов.Количество()-1); 
				ТекущийПуть = МассивВСтроку(СтекУзлов);
			КонецЕсли ;

		КонецЦикла; 
		ЧтениеXML.Закрыть();  
			
		Если НЕ Объект.ТаблицаЦБ.Количество() = 0 Тогда
			ТаблЗнач = Объект.ТаблицаЦБ.Выгрузить();
			ПоискДублейСтрокВТабЧастиОсн(ТаблЗнач);
			Рег = РегистрыСведений.ЛБ_ПереченьНежелательныхЛиц;
		    НаборЗаписей = Рег.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ВидПеречня.Установить(Объект.ВидПеречня); 
			НаборЗаписей.Отбор.ДатаПеречня.Установить(Объект.ДатаПеречня);
			
			Для Каждого СтрокаТаблицы Из ТаблЗнач Цикл 	   
			   НоваяЗапись = НаборЗаписей.Добавить(); 
			   НоваяЗапись.Период = ДатаЗагрузки; 
			   НоваяЗапись.ВидПеречня = Объект.ВидПеречня; 
			   НоваяЗапись.ДатаПеречня = Объект.ДатаПеречня;
			   НоваяЗапись.ДатаВключенияВПеречень = СтрокаТаблицы.ДатаВключенияВПеречень;  
			   НоваяЗапись.КодОтказа = СтрокаТаблицы.КодОтказа;
			   НоваяЗапись.ИД = СтрокаТаблицы.ИД;  
			   НоваяЗапись.ЮридическоеФизическоеЛицо = СтрокаТаблицы.ЮридическоеФизическоеЛицо;
			   НоваяЗапись.ДатаРождения = СтрокаТаблицы.ДатаРождения;
			   НоваяЗапись.Гражданство = СтрокаТаблицы.Гражданство;
			   НоваяЗапись.ИНН = СтрокаТаблицы.ИНН;
			   НоваяЗапись.Фамилия = СтрокаТаблицы.Фамилия; 
			   НоваяЗапись.Имя = СтрокаТаблицы.Имя;
			   НоваяЗапись.Отчество = СтрокаТаблицы.Отчество; 
			   Наименование = СокрЛП(СтрокаТаблицы.Фамилия) + " " + СокрЛП(СтрокаТаблицы.Имя) + " " + СокрЛП(СтрокаТаблицы.Отчество);
			   НоваяЗапись.Наименование = СокрЛП(Наименование); 
			   НоваяЗапись.Статус = СтрокаТаблицы.Статус;
			   НоваяЗапись.Ответственный = Пользователи.ТекущийПользователь();
			   НоваяЗапись.РазмерФайла = РазмерФайла;	
			   //+МАН 13.10.25 Запись технического наименования
			   Если ЗначениеЗаполнено(СокрЛП(Наименование)) Тогда
				   Символ = Лев(СокрЛП(Наименование), 1);
				   
				   Если ЭтоРусскаяБуква(Символ) Тогда
					   НоваяЗапись.ТехническоеНаименование = ЛБ_ОбщийМодуль.СформироватьТехническоеНаименование(СокрЛП(Наименование));
				   КонецЕсли;
			   КонецЕсли;
			   //-МАН
			КонецЦикла; 

			НаборЗаписей.Записать(Истина); 	     
		КонецЕсли;	
			
		Если НЕ Объект.ТаблицаЦБДокументы.Количество() = 0 Тогда  
			ТаблЗнач = Объект.ТаблицаЦБДокументы.Выгрузить();       
			ПоискДублейСтрокВТабЧасти(ТаблЗнач);
			Рег = РегистрыСведений.ЛБ_ПереченьНежелательныхЛицДокументы;
		    НаборЗаписей = Рег.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ВидПеречня.Установить(Объект.ВидПеречня);
			НаборЗаписей.Отбор.ДатаПеречня.Установить(Объект.ДатаПеречня);
			
			Для Каждого СтрокаТаблицы Из ТаблЗнач Цикл 	
			    НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Период = ДатаЗагрузки;   
				НоваяЗапись.ВидПеречня = Объект.ВидПеречня;
				НоваяЗапись.ДатаПеречня = Объект.ДатаПеречня;
				НоваяЗапись.ИД = СтрокаТаблицы.ИД;
			    НоваяЗапись.ДокументИдентификатор = СтрокаТаблицы.ДокументИдентификатор;
			    НоваяЗапись.ДокументНаименование = СтрокаТаблицы.ДокументНаименование;
			    НоваяЗапись.ДокументСерия = СтрокаТаблицы.ДокументСерия; 
				НоваяЗапись.ДокументНомер = СтрокаТаблицы.ДокументНомер;
				НоваяЗапись.ДокументКемВыдан = СтрокаТаблицы.ДокументКемВыдан; 
				НоваяЗапись.ДокументДатаВыдачи = СтрокаТаблицы.ДокументДатаВыдачи;
			КонецЦикла; 

			НаборЗаписей.Записать(Истина);    
		КонецЕсли;	
	
	КонецЕсли;	
		
	//проверим всех клиентов по перечню
	ПроверкаКлиентов();
	
	Если НЕ Объект.ТаблицаКлиентов.Количество() = 0 Тогда 
		Рег = РегистрыСведений.ЛБ_КлиентыВПеречнях;
		НаборЗаписей = Рег.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВидПеречня.Установить(Объект.ВидПеречня); 
		НаборЗаписей.Отбор.ДатаПеречня.Установить(Объект.ДатаПеречня);
		НаборЗаписей.Отбор.ВидПроверки.Установить(Перечисления.ЛБ_ВидыПроверкиПеречней.ПроверкаПоПеречню); 
		
		Для каждого СтрК Из Объект.ТаблицаКлиентов Цикл 
			НоваяЗапись = НаборЗаписей.Добавить();   
			НоваяЗапись.Период = ДатаЗагрузки;
			НоваяЗапись.ВидПроверки = Перечисления.ЛБ_ВидыПроверкиПеречней.ПроверкаПоПеречню;
			НоваяЗапись.ВидПеречня = Объект.ВидПеречня; 
		    НоваяЗапись.ДатаПеречня = Объект.ДатаПеречня;
			НоваяЗапись.Залогодатель = СтрК.Клиент;
			НоваяЗапись.СтатусКлиентаВПеречне = СтрК.Статус; 
			НоваяЗапись.ИД = СтрК.ИД;  
			НоваяЗапись.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень; 
			НоваяЗапись.КодОтказа = СтрК.КодОтказа;
			ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
			Если НЕ ТекПользователь.ЭтоЛомбард Тогда
		   		Ответственный = ТекПользователь;
			Иначе
				Ответственный = ПараметрыСеанса.ТекущийСотрудник;
			КонецЕсли;	
			НоваяЗапись.Ответственный = Ответственный;
		Конеццикла;	 
						
		НаборЗаписей.Записать(Истина);
	КонецЕсли;	 
	
	//проверим исключенных по списку террористов 
	Если Объект.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.Террористы Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ВидПеречня", Объект.ВидПеречня);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_КлиентыВПеречняхСрезПоследних.ИД КАК ИД,
		               |	ЛБ_КлиентыВПеречняхСрезПоследних.Залогодатель КАК Залогодатель
		               |ИЗ
		               |	РегистрСведений.ЛБ_КлиентыВПеречнях.СрезПоследних(
		               |			,
		               |			ВидПроверки = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыПроверкиПеречней.ПроверкаПоПеречню)
		               |				И СтатусКлиентаВПеречне = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыКлиентаВПеречнях.Включен)
		               |				И ВидПеречня = &ВидПеречня) КАК ЛБ_КлиентыВПеречняхСрезПоследних";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл 
			Отбор = Новый Структура;
			Отбор.Вставить("ИД", СокрЛП(Выборка.ИД)); 
			
			Строки = Объект.ТаблицаТеррористы.НайтиСтроки(Отбор);
			Если Строки.Количество() = 0 Тогда   
				Рег = РегистрыСведений.ЛБ_КлиентыВПеречнях;
				НаборЗаписей = Рег.СоздатьНаборЗаписей();    
				НаборЗаписей.Отбор.ИД.Установить(Выборка.ИД);
				НаборЗаписей.Отбор.Залогодатель.Установить(Выборка.Залогодатель);
				НаборЗаписей.Отбор.ВидПеречня.Установить(Объект.ВидПеречня); 
				НаборЗаписей.Отбор.ДатаПеречня.Установить(Объект.ДатаПеречня);
				НаборЗаписей.Отбор.ВидПроверки.Установить(Перечисления.ЛБ_ВидыПроверкиПеречней.ПроверкаПоПеречню);

				НоваяЗапись = НаборЗаписей.Добавить();   
				НоваяЗапись.Период = ДатаЗагрузки;         
				НоваяЗапись.ВидПроверки = Перечисления.ЛБ_ВидыПроверкиПеречней.ПроверкаПоПеречню;
				НоваяЗапись.ВидПеречня = Объект.ВидПеречня; 
			    НоваяЗапись.ДатаПеречня = Объект.ДатаПеречня;
				НоваяЗапись.Залогодатель = Выборка.Залогодатель;  
				НоваяЗапись.ИД = Выборка.ИД;
				НоваяЗапись.СтатусКлиентаВПеречне = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Исключен;
				ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
				Если НЕ ТекПользователь.ЭтоЛомбард Тогда
			   		Ответственный = ТекПользователь;
				Иначе
					Ответственный = ПараметрыСеанса.ТекущийСотрудник;
				КонецЕсли;	
				НоваяЗапись.Ответственный = Ответственный;
 
				
				НаборЗаписей.Записать(Истина);
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;   
	
	Рег = РегистрыСведений.ЛБ_ДатыЗагрузкиПеречней;
	НаборЗаписей = Рег.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВидПеречня.Установить(Объект.ВидПеречня); 
	НаборЗаписей.Отбор.ДатаПеречня.Установить(Объект.ДатаПеречня); 
	НоваяЗапись = НаборЗаписей.Добавить(); 
	//НоваяЗапись.Период = ДатаЗагрузки;   
	НоваяЗапись.Период = ТекущаяДата();
	НоваяЗапись.ВидПроверки = Перечисления.ЛБ_ВидыПроверкиПеречней.ПроверкаПоПеречню;
	НоваяЗапись.ВидПеречня = Объект.ВидПеречня; 
    НоваяЗапись.ДатаПеречня = Объект.ДатаПеречня; 
	НоваяЗапись.РазмерФайла = РазмерФайла;
	НоваяЗапись.Ответственный = Пользователи.ТекущийПользователь();
    НаборЗаписей.Записать(Истина);

	ЗаполнитьОсновнуюТаблицу();    
	
КонецПроцедуры  

&НаСервере
Функция ПроверитьЕстьРусскаяВерсияПеречняООН() 
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ВидПеречня", объект.ВидПеречня); 
	Запрос.УстановитьПараметр("ДатаПеречня", объект.ДатаПеречня);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПереченьНежелательныхЛиц.Период КАК Период
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПереченьНежелательныхЛиц КАК ЛБ_ПереченьНежелательныхЛиц
	               |ГДЕ
	               |	ЛБ_ПереченьНежелательныхЛиц.ВидПеречня = &ВидПеречня
	               |	И ЛБ_ПереченьНежелательныхЛиц.ДатаПеречня = &ДатаПеречня";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Истина;
	КонецЕсли;	       
	Возврат ложь;
КонецФункции

//+Мельников 09.07.24 Проверка наличия в перечне и в накладных. Удаление из накладных. Заявка 2666.
//+МАН 05.12.24 Изменена процедура. Сделано исключение из накладной через документ корректировки. Заявка 2666
&НаСервере
Процедура УдалитьИзделияИзНакладнойНаОтгузку(Клиент)
	
	СтатусЗалоговогоБилета = Новый СписокЗначений;
	СтатусЗалоговогоБилета.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ВключенВНакладную);
	СтатусЗалоговогоБилета.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОбъявленТорг);
	
	Дата = ТекущаяДата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет
		|ИЗ
		|	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних
		|ГДЕ
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета В(&СтатусЗалоговогоБилета)";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Залогодатель", Клиент);
	Запрос.УстановитьПараметр("СтатусЗалоговогоБилета", СтатусЗалоговогоБилета);
	
	ТаблицаЗБ = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.Организация КАК Организация,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.КоличествоОстаток КАК Количество,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.СуммаОценкиОстаток КАК СуммаОценки,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.ВесОстаток КАК Вес
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Остатки(&Дата, ЗалоговыйБилет В (&ЗалоговыйБилет)) КАК ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_СтатусыОбъектовЗалогаВНакладной.СрезПоследних(&Дата, ) КАК ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних
	               |		ПО ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.ЗалоговыйБилет = ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ЗалоговыйБилет
	               |ГДЕ
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.КоличествоОстаток > 0
	               |	И ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус <> ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.Отгружено)";

	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ТаблицаЗБ);
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
		ДокКорректировки = Документы.ЛБ_КорректировкаНакладной.СоздатьДокумент();
		ДокКорректировки.Дата = ТекущаяДатаСеанса();
		ДокКорректировки.Организация = ТаблицаЗапроса[0].Организация;
		ДокКорректировки.ВидОперации = Перечисления.ЛБ_ВидыКорректировкиНакладной.ИсключениеЗБИзНакладной;
		ДокКорректировки.Ответственный = Пользователи.ТекущийПользователь();
		ДокКорректировки.Комментарий = "Исключен по перечню.";
		
		Для каждого СтрЗапроса Из ТаблицаЗапроса Цикл 
			НоваяСтр = ДокКорректировки.ЗалоговыеБилеты.Добавить(); 
			НоваяСтр.НакладнаяНаОтгрузку = СтрЗапроса.НакладнаяНаОтгрузку;
			НоваяСтр.ЗалоговыйБилет = СтрЗапроса.ЗалоговыйБилет;
			НоваяСтр.Ломбард = СтрЗапроса.ЗалоговыйБилет.Ломбард;
			НоваяСтр.ОбъектЗалога = СтрЗапроса.ОбъектЗалога;
			НоваяСтр.Количество = СтрЗапроса.Количество;
			НоваяСтр.Вес = СтрЗапроса.Вес; 
			НоваяСтр.СуммаОценки = СтрЗапроса.СуммаОценки;     

		КонецЦикла;

		
		ДокКорректировки.Записать(РежимЗаписиДокумента.Запись);  
		Попытка   
			ДокКорректировки.Записать(РежимЗаписиДокумента.Проведение);
		Исключение   
			ОбщегоНазначения.СообщитьПользователю("Не удалось провести документ " + строка(ДокКорректировки.Ссылка) + ". Обратитесь к разработчикам.");
		КонецПопытки;	 
    КонецЕсли;
КонецПроцедуры
//-Мельников

//+МАН 15.10.25 Изменил процедуру, старую оставил нетронутой.
&НаСервере
Процедура ПроверкаКлиентов_Старая() 
	Объект.ТаблицаКлиентов.Очистить(); 		
	ОбщегоНазначения.СообщитьПользователю("Проверка клиентов по перечню начало " + Формат(ТекущаяДата(), "ДЛФ=DT"));
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("ВидДокументаЗалогодателя", Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателя.Владелец КАК Клиент,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателя.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник.ЛБ_ДокументыЗалогодателя КАК ЛБ_ДокументыЗалогодателя
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних КАК ЛБ_ДокументыЗалогодателейСрезПоследних
	               |		ПО (ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя = ЛБ_ДокументыЗалогодателя.Ссылка)
	               |ГДЕ
	               |	ЛБ_ДокументыЗалогодателя.ВидДокументаЗалогодателя = &ВидДокументаЗалогодателя";
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	
	СписокКлиентов = ЛБ_УправлениеЛомбардом.ЗаполнитьСписокКлиентовДляПроверкиПоПеречням(ТекущаяДата());  
	Запрос.УстановитьПараметр("СписокКлиентов", СписокКлиентов);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_Залогодатели.Ссылка КАК Клиент,
	               |	ЛБ_Залогодатели.Наименование КАК Наименование,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
	               |	ЛБ_АнкетаЗалогодателяСрезПоследних.ИНН КАК ИНН,
	               |	ЛБ_АнкетаЗалогодателяСрезПоследних.ТипФизЛица КАК ЮридическоеФизическоеЛицо,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия_А КАК Фамилия_А,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя_А КАК Имя_А,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество_А КАК Отчество_А
	               |ИЗ
	               |	Справочник.ЛБ_Залогодатели КАК ЛБ_Залогодатели
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних
	               |		ПО (ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Залогодатель = ЛБ_Залогодатели.Ссылка)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_АнкетаЗалогодателя.СрезПоследних КАК ЛБ_АнкетаЗалогодателяСрезПоследних
	               |		ПО (ЛБ_АнкетаЗалогодателяСрезПоследних.Залогодатель = ЛБ_Залогодатели.Ссылка)
	               |ГДЕ
	               |	ЛБ_Залогодатели.ПометкаУдаления = ЛОЖЬ
	               |	И ЛБ_Залогодатели.Ссылка В(&СписокКлиентов)
	               |АВТОУПОРЯДОЧИВАНИЕ";
	Выборка = Запрос.Выполнить().Выбрать(); 
	Пока Выборка.Следующий() Цикл   
		Наименование = Врег(СокрЛП(Выборка.Наименование)); 
		НаименованиеЛат = СокрЛП(Выборка.Фамилия_А) + ?(ПустаяСтрока(Выборка.Имя_А), "", " " + СокрЛП(Выборка.Имя_А)) + ?(ПустаяСтрока(Выборка.Отчество_А), "", " " + СокрЛП(Выборка.Отчество_А));
		НаименованиеЛат = Врег(НаименованиеЛат);
		ДатаРождения = Выборка.ДатаРождения;
		ГодРождения = Год(ДатаРождения); 
		ИНН = СокрЛП(Выборка.ИНН);
		ЮридическоеФизическоеЛицо = Выборка.ЮридическоеФизическоеЛицо; 
		Если Объект.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ФРОМУ тогда
			ЕстьСовпадение = ложь; 
			Для сч = 1 По 2 Цикл 
				Если ЕстьСовпадение Тогда
					Прервать;
				ИначеЕсли сч = 2 и Пустаястрока(НаименованиеЛат) Тогда
                    Прервать;
				КонецЕсли;	
				Отбор = Новый Структура;
				Если Сч = 1 Тогда
				    Отбор.Вставить("Наименование", Наименование); 
				Иначе
					Отбор.Вставить("НаименованиеЛат", НаименованиеЛат);
				КонецЕсли;	
				Отбор.Вставить("ЮридическоеФизическоеЛицо", ЮридическоеФизическоеЛицо);
				СтрокиК = Объект.ТаблицаФрому.НайтиСтроки(Отбор);
				Если НЕ СтрокиК.Количество() = 0 Тогда 
					Для каждого СтрК Из СтрокиК Цикл  
						Если НЕ СтрК.ДатаРождения = Дата(1,1,1) Тогда 
							Если СтрК.ДатаРождения = ДатаРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
								НоваяСтр.ИД = СтрК.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрК.Статус; 
								НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень; 
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;	
						ИначеЕсли НЕ ГодРождения = 0 Тогда 
							Если СтрК.ГодРождения = ГодРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
								НоваяСтр.ИД = СтрК.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрК.Статус;
								НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;	
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли; 	
			КонецЦикла;	
			Если ЕстьСовпадение Тогда
				Продолжить;
			КонецЕсли;    
			
			Отбор = Новый Структура;
			Отбор.Вставить("Наименование", Наименование);
			СтрокиК = Объект.ТаблицаДрНаименованияФРОМУ.НайтиСтроки(Отбор);
			Если НЕ СтрокиК.Количество() = 0 Тогда 
				Для каждого СтрК Из СтрокиК Цикл  
					ОтборИД = Новый Структура;
					ОтборИД.Вставить("ИД", СтрК.ИД);
					СтрокиИД = Объект.ТаблицаФрому.НайтиСтроки(ОтборИД);
					Если НЕ СтрокиИД.Количество() = 0 Тогда  
						СтрИД = СтрокиИД.Получить(0);
						Если НЕ СтрИД.ДатаРождения = Дата(1,1,1) Тогда 
							Если СтрИД.ДатаРождения = ДатаРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
								НоваяСтр.ИД = СтрИД.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрИД.Статус; 
								НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина; 								
								Прервать;
							КонецЕсли;	
						ИначеЕсли НЕ ГодРождения = 0 Тогда 
							Если СтрИД.ГодРождения = ГодРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
								НоваяСтр.ИД = СтрИД.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрИД.Статус; 
								НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;	
						КонецЕсли;
					КонецЕсли;	
				КонецЦикла;	
			КонецЕсли;  
			Если ЕстьСовпадение Тогда
				Продолжить;
			КонецЕсли;  
			
			Если НЕ Пустаястрока(НаименованиеЛат) Тогда
	        	Отбор = Новый Структура;
				Отбор.Вставить("НаименованиеЛат", НаименованиеЛат); 
				Отбор.Вставить("ЮридическоеФизическоеЛицо", ЮридическоеФизическоеЛицо);
				СтрокиК = Объект.ТаблицаФрому.НайтиСтроки(Отбор);
				Если НЕ СтрокиК.Количество() = 0 Тогда 
					Для каждого СтрК Из СтрокиК Цикл  
						Если НЕ СтрК.ДатаРождения = Дата(1,1,1) Тогда 
							Если СтрК.ДатаРождения = ДатаРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
								НоваяСтр.ИД = СтрК.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрК.Статус;   
								НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;	
						ИначеЕсли НЕ ГодРождения = 0 Тогда 
							Если СтрК.ГодРождения = ГодРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
								НоваяСтр.ИД = СтрК.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрК.Статус;
								НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;	
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли;  
	            Если ЕстьСовпадение Тогда
					Продолжить;
				КонецЕсли;  
			
				Отбор = Новый Структура;
				Отбор.Вставить("Наименование", НаименованиеЛат); 
				СтрокиК = Объект.ТаблицаДрНаименованияФРОМУ.НайтиСтроки(Отбор);
				Если НЕ СтрокиК.Количество() = 0 Тогда 
					Для каждого СтрК Из СтрокиК Цикл  
						ОтборИД = Новый Структура; 
						ОтборИД.Вставить("ИД", СтрК.ИД);
						СтрокиИД = Объект.ТаблицаФрому.НайтиСтроки(ОтборИД);
						Если НЕ СтрокиИД.Количество() = 0 Тогда  
							СтрИД = СтрокиИД.Получить(0);
							Если НЕ СтрИД.ДатаРождения = Дата(1,1,1) Тогда 
								Если СтрИД.ДатаРождения = ДатаРождения Тогда
								    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
									НоваяСтр.ИД = СтрИД.ИД;
									НоваяСтр.Клиент = Выборка.Клиент;
									НоваяСтр.Статус = СтрИД.Статус;
									НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
									ЕстьСовпадение = Истина;
									Прервать;
								КонецЕсли;	
							ИначеЕсли НЕ ГодРождения = 0 Тогда 
								Если СтрИД.ГодРождения = ГодРождения Тогда
								    НоваяСтр = Объект.ТаблицаКлиентов.Добавить(); 
									НоваяСтр.ИД = СтрИД.ИД;
									НоваяСтр.Клиент = Выборка.Клиент;
									НоваяСтр.Статус = СтрИД.Статус;
									НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
									ЕстьСовпадение = Истина;
									Прервать;
								КонецЕсли;	
							КонецЕсли;
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли;  
	            Если ЕстьСовпадение Тогда
					Продолжить;
				КонецЕсли; 
			КонецЕсли;	
			
			ОтборДок = Новый Структура;
			ОтборДок.Вставить("Клиент", Выборка.Клиент);
			СтрокиДок = ТаблицаДокументов.НайтиСтроки(ОтборДок);
			Для каждого СтрДок Из СтрокиДок Цикл 
				ОтборК = Новый Структура;
				ОтборК.Вставить("ДокументНомер", СокрЛП(СтрДок.ДокументНомер));
				СтрокиК = Объект.ТаблицаФромуДокументы.НайтиСтроки(ОтборК); 
				Если НЕ СтрокиК.Количество() = 0 Тогда 
					Для каждого СтрК Из СтрокиК Цикл  
						ОтборИД = Новый Структура; 
						ОтборИД.Вставить("ИД", СтрК.ИД);
						СтрокиИД = Объект.ТаблицаФрому.НайтиСтроки(ОтборИД);
						Если НЕ СтрокиИД.Количество() = 0 Тогда  
							СтрИД = СтрокиИД.Получить(0);       
						    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
							НоваяСтр.ИД = СтрИД.ИД;
							НоваяСтр.Клиент = Выборка.Клиент;
							НоваяСтр.Статус = СтрИД.Статус; 
							НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
							ЕстьСовпадение = Истина;
							Прервать;
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли;  
                Если ЕстьСовпадение Тогда
					Прервать;
				КонецЕсли; 
  			КонецЦикла;	
		ИначеЕсли Объект.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.МВК тогда
			ЕстьСовпадение = ложь;   
			Для сч = 1 По 2 Цикл 
				Если ЕстьСовпадение Тогда
					Прервать;
				ИначеЕсли сч = 2 и Пустаястрока(НаименованиеЛат) Тогда
                    Прервать;
				КонецЕсли;	
				Отбор = Новый Структура;
				Если Сч = 1 Тогда
				    Отбор.Вставить("Наименование", Наименование); 
				Иначе
					Отбор.Вставить("НаименованиеЛат", НаименованиеЛат);
				КонецЕсли;	
                Отбор.Вставить("ЮридическоеФизическоеЛицо", ЮридическоеФизическоеЛицо);
				//Отбор.Вставить("Статус", Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен);
				СтрокиК = Объект.ТаблицаМВК.НайтиСтроки(Отбор);
				Если НЕ СтрокиК.Количество() = 0 Тогда 
					Для каждого СтрК Из СтрокиК Цикл  
						Если НЕ СтрК.ДатаРождения = Дата(1,1,1) Тогда 
							Если СтрК.ДатаРождения = ДатаРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
								НоваяСтр.ИД = СтрК.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрК.Статус;
								НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;	
						ИначеЕсли НЕ ГодРождения = 0 Тогда 
							Если СтрК.ГодРождения = ГодРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить(); 
								НоваяСтр.ИД = СтрК.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрК.Статус; 
								НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;	
						КонецЕсли;	
						Если НЕ ПустаяСтрока(ИНН) Тогда 
							Если СтрК.ИНН = ИНН Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
								НоваяСтр.ИД = СтрК.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрК.Статус;    
								НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;		
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли; 	
			КонецЦикла;	
			Если ЕстьСовпадение Тогда
				УдалитьИзделияИзНакладнойНаОтгузку(Выборка.Клиент); //+Мельников 10.07.24
				Продолжить;
			КонецЕсли;  
			
			Отбор = Новый Структура;
			Отбор.Вставить("Наименование", Наименование);
			СтрокиК = Объект.ТаблицаДрНаименованияМВК.НайтиСтроки(Отбор);
			Если НЕ СтрокиК.Количество() = 0 Тогда 
				Для каждого СтрК Из СтрокиК Цикл  
					ОтборИД = Новый Структура;
					ОтборИД.Вставить("ИД", СтрК.ИД);
					СтрокиИД = Объект.ТаблицаМВК.НайтиСтроки(ОтборИД);
					Если НЕ СтрокиИД.Количество() = 0 Тогда  
						СтрИД = СтрокиИД.Получить(0);
						Если НЕ СтрИД.ДатаРождения = Дата(1,1,1) Тогда 
							Если СтрИД.ДатаРождения = ДатаРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
								НоваяСтр.ИД = СтрИД.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрИД.Статус;
								НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;	
						ИначеЕсли НЕ ГодРождения = 0 Тогда 
							Если СтрИД.ГодРождения = ГодРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить(); 
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрИД.Статус;
								НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;
						КонецЕсли;	
					    Если НЕ ПустаяСтрока(ИНН) Тогда 
							Если СтрИД.ИНН = ИНН Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
								НоваяСтр.ИД = СтрИД.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрИД.Статус; 
								НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;			
						КонецЕсли;
					КонецЕсли;	
				КонецЦикла;	
			КонецЕсли;  
			Если ЕстьСовпадение Тогда
				УдалитьИзделияИзНакладнойНаОтгузку(Выборка.Клиент); //+Мельников 10.07.24
				Продолжить;
			КонецЕсли;  
			
			Если НЕ Пустаястрока(НаименованиеЛат) Тогда
	        	Отбор = Новый Структура;
				Отбор.Вставить("НаименованиеЛат", НаименованиеЛат); 
				Отбор.Вставить("ЮридическоеФизическоеЛицо", ЮридическоеФизическоеЛицо); 
				//Отбор.Вставить("Статус", Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен);
				СтрокиК = Объект.ТаблицаМВК.НайтиСтроки(Отбор);
				Если НЕ СтрокиК.Количество() = 0 Тогда 
					Для каждого СтрК Из СтрокиК Цикл  
						Если НЕ СтрК.ДатаРождения = Дата(1,1,1) Тогда 
							Если СтрК.ДатаРождения = ДатаРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
								НоваяСтр.ИД = СтрК.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрК.Статус;
								НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;	
						ИначеЕсли НЕ ГодРождения = 0 Тогда 
							Если СтрК.ГодРождения = ГодРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить(); 
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрК.Статус;   
								НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;	 
						КонецЕсли;	
					    Если НЕ ПустаяСтрока(ИНН) Тогда 
							Если СтрК.ИНН = ИНН Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
								НоваяСтр.ИД = СтрК.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрК.Статус; 
								НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;			
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли;  
	            Если ЕстьСовпадение Тогда
					УдалитьИзделияИзНакладнойНаОтгузку(Выборка.Клиент); //+Мельников 10.07.24
					Продолжить;
				КонецЕсли;  
			
				Отбор = Новый Структура;
				Отбор.Вставить("Наименование", НаименованиеЛат); 
				СтрокиК = Объект.ТаблицаДрНаименованияМВК.НайтиСтроки(Отбор);
				Если НЕ СтрокиК.Количество() = 0 Тогда 
					Для каждого СтрК Из СтрокиК Цикл  
						ОтборИД = Новый Структура; 
						ОтборИД.Вставить("ИД", СтрК.ИД);
						СтрокиИД = Объект.ТаблицаМВК.НайтиСтроки(ОтборИД);
						Если НЕ СтрокиИД.Количество() = 0 Тогда  
							СтрИД = СтрокиИД.Получить(0);
							Если НЕ СтрИД.ДатаРождения = Дата(1,1,1) Тогда 
								Если СтрИД.ДатаРождения = ДатаРождения Тогда
								    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
									НоваяСтр.ИД = СтрИД.ИД;
									НоваяСтр.Клиент = Выборка.Клиент;
									НоваяСтр.Статус = СтрИД.Статус; 
									НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
									ЕстьСовпадение = Истина;
									Прервать;
								КонецЕсли;	
							ИначеЕсли НЕ ГодРождения = 0 Тогда 
								Если СтрИД.ГодРождения = ГодРождения Тогда
								    НоваяСтр = Объект.ТаблицаКлиентов.Добавить(); 
									НоваяСтр.Клиент = Выборка.Клиент;
									НоваяСтр.Статус = СтрИД.Статус;
									НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
									ЕстьСовпадение = Истина;
									Прервать;
								КонецЕсли;	 
							КонецЕсли;	
					        Если  НЕ ПустаяСтрока(ИНН) Тогда 
								Если СтрИД.ИНН = ИНН Тогда
								    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
									НоваяСтр.ИД = СтрИД.ИД;
									НоваяСтр.Клиент = Выборка.Клиент;
									НоваяСтр.Статус = СтрИД.Статус;
									НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
									ЕстьСовпадение = Истина;
									Прервать;
								КонецЕсли;			
							КонецЕсли;
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли;  
	            Если ЕстьСовпадение Тогда
					УдалитьИзделияИзНакладнойНаОтгузку(Выборка.Клиент); //+Мельников 10.07.24
					Продолжить;
				КонецЕсли; 
			КонецЕсли;	    
			
			Если НЕ ПустаяСтрока(ИНН) Тогда 
				Отбор = Новый Структура;
				Отбор.Вставить("ИНН", ИНН); 
				//Отбор.Вставить("ДатаРождения", ДатаРождения); 
				//Отбор.Вставить("Статус", Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен);
				СтрокиК = Объект.ТаблицаМВК.НайтиСтроки(Отбор); 
				Если НЕ СтрокиК.Количество() = 0 Тогда
					НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
					НоваяСтр.ИД = СтрокиК.Получить(0).ИД;
					НоваяСтр.Клиент = Выборка.Клиент;
					НоваяСтр.Статус = СтрокиК.Получить(0).Статус;
					НоваяСтр.ДатаВключенияВПеречень = СтрокиК.Получить(0).ДатаВключенияВПеречень;
					ЕстьСовпадение = Истина;
				КонецЕсли;	
			КонецЕсли; 
			Если ЕстьСовпадение Тогда
				УдалитьИзделияИзНакладнойНаОтгузку(Выборка.Клиент); //+Мельников 10.07.24
				Продолжить;
			КонецЕсли; 
			
			ОтборДок = Новый Структура;
			ОтборДок.Вставить("Клиент", Выборка.Клиент);
			//+МАН 11.02.25 Закомментировал и сделал через функцию
			//Было: СтрокиДок = ТаблицаДокументов.НайтиСтроки(ОтборДок);
			СтрокиДок = ПолучитьДокумент(Выборка.Клиент);
			//-МАН
			Для каждого СтрДок Из СтрокиДок Цикл 
				ОтборК = Новый Структура;
				ОтборК.Вставить("ДокументНомер", СокрЛП(СтрДок.ДокументНомер));
				ОтборК.Вставить("ДокументСерия", СокрЛП(СтрДок.ДокументСерия));
				СтрокиК = Объект.ТаблицаМВКДокументы.НайтиСтроки(ОтборК); 
				Если НЕ СтрокиК.Количество() = 0 Тогда 
					Для каждого СтрК Из СтрокиК Цикл  
						ОтборИД = Новый Структура; 
						ОтборИД.Вставить("ИД", СтрК.ИД);  
						ОтборИД.Вставить("Статус", Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен);
						СтрокиИД = Объект.ТаблицаМВК.НайтиСтроки(ОтборИД);
						Если НЕ СтрокиИД.Количество() = 0 Тогда  
							СтрИД = СтрокиИД.Получить(0);
							НоваяСтр = Объект.ТаблицаКлиентов.Добавить(); 
							НоваяСтр.ИД = СтрИД.ИД;
							НоваяСтр.Клиент = Выборка.Клиент;
							НоваяСтр.Статус = СтрИД.Статус;
							НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
							ЕстьСовпадение = Истина;
							Прервать;
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли;  
                Если ЕстьСовпадение Тогда
					УдалитьИзделияИзНакладнойНаОтгузку(Выборка.Клиент); //+Мельников 10.07.24
					Прервать;
				КонецЕсли; 
			КонецЦикла;	    
		ИначеЕсли Объект.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.Террористы тогда
			ЕстьСовпадение = ложь;
			Для сч = 1 По 2 Цикл 
				Если ЕстьСовпадение Тогда
					Прервать;
				ИначеЕсли сч = 2 и Пустаястрока(НаименованиеЛат) Тогда
                    Прервать;
				КонецЕсли;	
				Отбор = Новый Структура;
				Если Сч = 1 Тогда
				    Отбор.Вставить("Наименование", Наименование); 
				Иначе
					Отбор.Вставить("НаименованиеЛат", НаименованиеЛат);
				КонецЕсли;	
           		Отбор.Вставить("ЮридическоеФизическоеЛицо", ЮридическоеФизическоеЛицо);
				СтрокиК = Объект.ТаблицаТеррористы.НайтиСтроки(Отбор);
				Если НЕ СтрокиК.Количество() = 0 Тогда 
					Для каждого СтрК Из СтрокиК Цикл  
						Если НЕ СтрК.ДатаРождения = Дата(1,1,1) Тогда 
							Если СтрК.ДатаРождения = ДатаРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
								НоваяСтр.ИД = СтрК.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрК.Статус; 
								НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;	
						ИначеЕсли НЕ ГодРождения = 0 Тогда 
							Если СтрК.ГодРождения = ГодРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить(); 
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрК.Статус; 
								НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;	 
						КонецЕсли;	
						Если НЕ ПустаяСтрока(ИНН) Тогда 
							Если СтрК.ИНН = ИНН Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
								НоваяСтр.ИД = СтрК.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрК.Статус;
								НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;		
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли; 	
			КонецЦикла;	
			Если ЕстьСовпадение Тогда
				УдалитьИзделияИзНакладнойНаОтгузку(Выборка.Клиент); //+Мельников 10.07.24
				Продолжить;
			КонецЕсли;  
			
			Отбор = Новый Структура;
			Отбор.Вставить("Наименование", Наименование);
			СтрокиК = Объект.ТаблицаДрНаименованияТеррористы.НайтиСтроки(Отбор);
			Если НЕ СтрокиК.Количество() = 0 Тогда 
				Для каждого СтрК Из СтрокиК Цикл  
					ОтборИД = Новый Структура;
					ОтборИД.Вставить("ИД", СтрК.ИД);
					СтрокиИД = Объект.ТаблицаТеррористы.НайтиСтроки(ОтборИД);
					Если НЕ СтрокиИД.Количество() = 0 Тогда  
						СтрИД = СтрокиИД.Получить(0);
						Если НЕ СтрК.ДатаРождения = Дата(1,1,1) Тогда 
							Если СтрК.ДатаРождения = ДатаРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить(); 
								НоваяСтр.ИД = СтрК.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрИД.Статус; 
								НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;	
						ИначеЕсли НЕ СтрК.ГодРождения = 0 Тогда 
							Если СтрК.ГодРождения = ГодРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить(); 
								НоваяСтр.Клиент = Выборка.Клиент; 
								НоваяСтр.ИД = СтрИД.ИД;
								НоваяСтр.Статус = СтрИД.Статус;
								НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;
						КонецЕсли;	
						//Если НЕ ПустаяСтрока(ИНН) Тогда 
						//	Если СтрИД.ИНН = ИНН Тогда
						//	    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
						//		НоваяСтр.ИД = СтрИД.ИД;
						//		НоваяСтр.Клиент = Выборка.Клиент;
						//		НоваяСтр.Статус = СтрИД.Статус;   
						//		НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
						//		ЕстьСовпадение = Истина;
						//		Прервать;
						//	КонецЕсли;			
						//КонецЕсли;
					КонецЕсли;	
				КонецЦикла;	
			КонецЕсли;  
			Если ЕстьСовпадение Тогда
				УдалитьИзделияИзНакладнойНаОтгузку(Выборка.Клиент); //+Мельников 10.07.24
				Продолжить;
			КонецЕсли;  
			
			Если НЕ Пустаястрока(НаименованиеЛат) Тогда
	        	Отбор = Новый Структура;
				Отбор.Вставить("НаименованиеЛат", НаименованиеЛат); 
				Отбор.Вставить("ЮридическоеФизическоеЛицо", ЮридическоеФизическоеЛицо);
				СтрокиК = Объект.ТаблицаТеррористы.НайтиСтроки(Отбор);
				Если НЕ СтрокиК.Количество() = 0 Тогда 
					Для каждого СтрК Из СтрокиК Цикл  
						Если НЕ СтрК.ДатаРождения = Дата(1,1,1) Тогда 
							Если СтрК.ДатаРождения = ДатаРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
								НоваяСтр.ИД = СтрК.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрК.Статус;
								НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;	
						ИначеЕсли НЕ ГодРождения = 0 Тогда 
							Если СтрК.ГодРождения = ГодРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить(); 
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрК.Статус;  
								НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;	 
						КонецЕсли;	
					    Если НЕ ПустаяСтрока(ИНН) Тогда 
							Если СтрК.ИНН = ИНН Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
								НоваяСтр.ИД = СтрК.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрК.Статус; 
								НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;			
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли;  
	            Если ЕстьСовпадение Тогда
					УдалитьИзделияИзНакладнойНаОтгузку(Выборка.Клиент); //+Мельников 10.07.24
					Продолжить;
				КонецЕсли;  
			
				Отбор = Новый Структура;
				Отбор.Вставить("Наименование", НаименованиеЛат); 
				СтрокиК = Объект.ТаблицаДрНаименованияТеррористы.НайтиСтроки(Отбор);
				Если НЕ СтрокиК.Количество() = 0 Тогда 
					Для каждого СтрК Из СтрокиК Цикл  
						ОтборИД = Новый Структура; 
						ОтборИД.Вставить("ИД", СтрК.ИД);
						СтрокиИД = Объект.ТаблицаТеррористы.НайтиСтроки(ОтборИД);
						Если НЕ СтрокиИД.Количество() = 0 Тогда  
							СтрИД = СтрокиИД.Получить(0);
							Если НЕ СтрИД.ДатаРождения = Дата(1,1,1) Тогда 
								Если СтрИД.ДатаРождения = ДатаРождения Тогда
								    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
									НоваяСтр.ИД = СтрИД.ИД;
									НоваяСтр.Клиент = Выборка.Клиент;
									НоваяСтр.Статус = СтрИД.Статус;
									НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
									ЕстьСовпадение = Истина;
									Прервать;
								КонецЕсли;	
							ИначеЕсли НЕ ГодРождения = 0 Тогда 
								Если СтрИД.ГодРождения = ГодРождения Тогда
								    НоваяСтр = Объект.ТаблицаКлиентов.Добавить(); 
									НоваяСтр.Клиент = Выборка.Клиент;
									НоваяСтр.Статус = СтрИД.Статус; 
									НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
									ЕстьСовпадение = Истина;
									Прервать;
								КонецЕсли;	 
							КонецЕсли;	
					        Если НЕ ПустаяСтрока(ИНН) Тогда 
								Если СтрИД.ИНН = ИНН Тогда
								    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
									НоваяСтр.ИД = СтрИД.ИД;
									НоваяСтр.Клиент = Выборка.Клиент;
									НоваяСтр.Статус = СтрИД.Статус;
									НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
									ЕстьСовпадение = Истина;
									Прервать;
								КонецЕсли;			
							КонецЕсли;
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли;  
	            Если ЕстьСовпадение Тогда
					УдалитьИзделияИзНакладнойНаОтгузку(Выборка.Клиент); //+Мельников 10.07.24
					Продолжить;
				КонецЕсли; 
			КонецЕсли;	 
			
			Если НЕ ПустаяСтрока(ИНН) Тогда 
				Отбор = Новый Структура;
				Отбор.Вставить("ИНН", ИНН); 
				Отбор.Вставить("ДатаРождения", ДатаРождения); 
				СтрокиК = Объект.ТаблицаТеррористы.НайтиСтроки(Отбор); 
				Если НЕ СтрокиК.Количество() = 0 Тогда
					НоваяСтр = Объект.ТаблицаКлиентов.Добавить(); 
					НоваяСтр.Клиент = Выборка.Клиент;
					НоваяСтр.ИД = СтрокиК.Получить(0).ИД;
					НоваяСтр.Статус = СтрокиК.Получить(0).Статус;
					НоваяСтр.ДатаВключенияВПеречень = СтрокиК.Получить(0).ДатаВключенияВПеречень;
					ЕстьСовпадение = Истина;
				КонецЕсли;	
			КонецЕсли; 
			Если ЕстьСовпадение Тогда
				УдалитьИзделияИзНакладнойНаОтгузку(Выборка.Клиент); //+Мельников 10.07.24
				Продолжить;
			КонецЕсли; 
			
			ОтборДок = Новый Структура;
			ОтборДок.Вставить("Клиент", Выборка.Клиент);
			//+МАН 11.02.25 Закомментировал и сделал через функцию
			//Было: СтрокиДок = ТаблицаДокументов.НайтиСтроки(ОтборДок); 
			СтрокиДок = ПолучитьДокумент(Выборка.Клиент);
			//-МАН
			Для каждого СтрДок Из СтрокиДок Цикл 
				ОтборК = Новый Структура;
				ОтборК.Вставить("ДокументНомер", СокрЛП(СтрДок.ДокументНомер));
				ОтборК.Вставить("ДокументСерия", СокрЛП(СтрДок.ДокументСерия));
				СтрокиК = Объект.ТаблицаТеррористыДокументы.НайтиСтроки(ОтборК); 
				Если НЕ СтрокиК.Количество() = 0 Тогда 
					Для каждого СтрК Из СтрокиК Цикл  
						ОтборИД = Новый Структура; 
						ОтборИД.Вставить("ИД", СтрК.ИД);
						СтрокиИД = Объект.ТаблицаТеррористы.НайтиСтроки(ОтборИД);
						Если НЕ СтрокиИД.Количество() = 0 Тогда  
							СтрИД = СтрокиИД.Получить(0);
						    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
							НоваяСтр.ИД = СтрИД.ИД;
							НоваяСтр.Клиент = Выборка.Клиент;
							НоваяСтр.Статус = СтрИД.Статус; 
							НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
							ЕстьСовпадение = Истина;
							Прервать;
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли;  
                Если ЕстьСовпадение Тогда
					УдалитьИзделияИзНакладнойНаОтгузку(Выборка.Клиент); //+Мельников 10.07.24
					Прервать;
				КонецЕсли; 
			КонецЦикла;	
		ИначеЕсли Объект.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ЦБ тогда
			ЕстьСовпадение = ложь;
			Отбор = Новый Структура;
			Отбор.Вставить("Наименование", Наименование);
			Отбор.Вставить("ЮридическоеФизическоеЛицо", ЮридическоеФизическоеЛицо);
			СтрокиК = Объект.ТаблицаЦБ.НайтиСтроки(Отбор);
			Если НЕ СтрокиК.Количество() = 0 Тогда 
				Для каждого СтрК Из СтрокиК Цикл  
					Если НЕ СтрК.ДатаРождения = Дата(1,1,1) Тогда 
						Если СтрК.ДатаРождения = ДатаРождения Тогда
						    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
							НоваяСтр.ИД = СтрК.ИД;
							НоваяСтр.Клиент = Выборка.Клиент;
							НоваяСтр.Статус = СтрК.Статус;
							НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень; 
							НоваяСтр.КодОтказа = СтрК.КодОтказа;
							ЕстьСовпадение = Истина;
							Прервать;
						КонецЕсли;	
					КонецЕсли;	
					//Если НЕ ПустаяСтрока(ИНН) Тогда 
					//	Если СтрК.ИНН = ИНН Тогда
					//	    НоваяСтр = ТаблицаКлиентов.Добавить(); 
					//		НоваяСтр.Клиент = Выборка.Клиент;
					//		НоваяСтр.Статус = СтрК.Статус; 
					//		ЕстьСовпадение = Истина;
					//		Прервать;
					//	КонецЕсли;		
					//КонецЕсли;	
				КонецЦикла;	
			КонецЕсли; 			
			Если ЕстьСовпадение Тогда
				Продолжить;
			КонецЕсли;  
			
						
			Если НЕ ПустаяСтрока(ИНН) Тогда 
				Отбор = Новый Структура;
				Отбор.Вставить("ИНН", ИНН); 
				Отбор.Вставить("ДатаРождения", ДатаРождения); 
				СтрокиК = Объект.ТаблицаЦБ.НайтиСтроки(Отбор); 
				Если НЕ СтрокиК.Количество() = 0 Тогда
					НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
					НоваяСтр.ИД = СтрокиК.Получить(0).ИД;
					НоваяСтр.Клиент = Выборка.Клиент;
					НоваяСтр.Статус = СтрокиК.Получить(0).Статус; 
					НоваяСтр.ДатаВключенияВПеречень = СтрокиК.Получить(0).ДатаВключенияВПеречень; 
					НоваяСтр.КодОтказа = СтрокиК.Получить(0).КодОтказа;
					ЕстьСовпадение = Истина;
				КонецЕсли;	
			КонецЕсли; 
			Если ЕстьСовпадение Тогда
				Продолжить;
			КонецЕсли; 
			
			ОтборДок = Новый Структура;
			ОтборДок.Вставить("Клиент", Выборка.Клиент);
			СтрокиДок = ТаблицаДокументов.НайтиСтроки(ОтборДок);
			Для каждого СтрДок Из СтрокиДок Цикл 
				ОтборК = Новый Структура;
				ОтборК.Вставить("ДокументНомер", СокрЛП(СтрДок.ДокументНомер));
				ОтборК.Вставить("ДокументСерия", СокрЛП(СтрДок.ДокументСерия));
				СтрокиК = Объект.ТаблицаЦБДокументы.НайтиСтроки(ОтборК); 
				Если НЕ СтрокиК.Количество() = 0 Тогда 
					Для каждого СтрК Из СтрокиК Цикл  
						ОтборИД = Новый Структура; 
						ОтборИД.Вставить("ИД", СтрК.ИД);
						СтрокиИД = Объект.ТаблицаЦБ.НайтиСтроки(ОтборИД);
						Если НЕ СтрокиИД.Количество() = 0 Тогда  
							СтрИД = СтрокиИД.Получить(0);
							Если НЕ СтрИД.ДатаРождения = Дата(1,1,1) Тогда 
								Если СтрИД.ДатаРождения = ДатаРождения Тогда
								    НоваяСтр = Объект.ТаблицаКлиентов.Добавить(); 
									НоваяСтр.ИД = СтрИД.ИД;
									НоваяСтр.Клиент = Выборка.Клиент;
									НоваяСтр.Статус = СтрИД.Статус; 
									НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
									НоваяСтр.КодОтказа = СтрИД.КодОтказа;
									ЕстьСовпадение = Истина;
									Прервать;
								КонецЕсли;	
							КонецЕсли;	
					        Если НЕ ПустаяСтрока(ИНН) Тогда 
								Если СтрИД.ИНН = ИНН Тогда
								    НоваяСтр = Объект.ТаблицаКлиентов.Добавить(); 
									НоваяСтр.ИД = СтрИД.ИД;
									НоваяСтр.Клиент = Выборка.Клиент;
									НоваяСтр.Статус = СтрИД.Статус;  
									НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;  
									НоваяСтр.КодОтказа = СтрИД.КодОтказа;
									ЕстьСовпадение = Истина;
									Прервать;
								КонецЕсли;				
							КонецЕсли;
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли;  
                Если ЕстьСовпадение Тогда
					Прервать;
				КонецЕсли; 
			КонецЦикла;	
			
		ИначеЕсли Объект.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ООН тогда
			ЕстьСовпадение = ложь;  
			Для сч = 1 По 2 Цикл 
				Если ЕстьСовпадение Тогда
					Прервать;
				ИначеЕсли сч = 2 и Пустаястрока(НаименованиеЛат) Тогда
                    Прервать;
				КонецЕсли;	
				Отбор = Новый Структура;
				Если Сч = 1 Тогда
				    Отбор.Вставить("Наименование", Наименование); 
				Иначе
					Отбор.Вставить("НаименованиеЛат", НаименованиеЛат);
				КонецЕсли;	
           		Отбор.Вставить("ЮридическоеФизическоеЛицо", ЮридическоеФизическоеЛицо);
				СтрокиК = Объект.ТаблицаООН.НайтиСтроки(Отбор);
				Если НЕ СтрокиК.Количество() = 0 Тогда 
					Для каждого СтрК Из СтрокиК Цикл  
						Если НЕ СтрК.ДатаРождения = Дата(1,1,1) Тогда 
							Если СтрК.ДатаРождения = ДатаРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
								НоваяСтр.ИД = СтрК.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрК.Статус;
								НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;  
							ИначеЕсли НЕ ГодРождения = 0 Тогда 
								Если СтрК.ГодРождения = ГодРождения Тогда
								    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
									НоваяСтр.ИД = СтрК.ИД;
									НоваяСтр.Клиент = Выборка.Клиент;
									НоваяСтр.Статус = СтрК.Статус; 
									НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень;
									ЕстьСовпадение = Истина;
									Прервать;
								КонецЕсли;	 	
							КонецЕсли;	
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли; 	
			КонецЦикла;	
			Если ЕстьСовпадение Тогда
				УдалитьИзделияИзНакладнойНаОтгузку(Выборка.Клиент); //+Мельников 10.07.24
				Продолжить;
			КонецЕсли;  
			
			//Если НЕ ПустаяСтрока(НаименованиеЛат) Тогда
			//	Отбор = Новый Структура;
			//	Отбор.Вставить("НаименованиеЛат", НаименованиеЛат);
			//	Отбор.Вставить("ЮридическоеФизическоеЛицо", ЮридическоеФизическоеЛицо);
			//	СтрокиК = Объект.ТаблицаООН.НайтиСтроки(Отбор);
			//	Если НЕ СтрокиК.Количество() = 0 Тогда 
			//		Для каждого СтрК Из СтрокиК Цикл  
			//			Если НЕ СтрК.ДатаРождения = Дата(1,1,1) Тогда 
			//				Если СтрК.ДатаРождения = ДатаРождения Тогда
			//				    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
			//					НоваяСтр.ИД = СтрК.ИД;
			//					НоваяСтр.Клиент = Выборка.Клиент;
			//					НоваяСтр.Статус = СтрК.Статус;
			//					НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень;
			//					ЕстьСовпадение = Истина;
			//					Прервать;
			//				КонецЕсли;	
			//			КонецЕсли;	
			//		КонецЦикла;	
			//	КонецЕсли; 			
			//	Если ЕстьСовпадение Тогда
			//		УдалитьИзделияИзНакладнойНаОтгузку(Выборка.Клиент); //+Мельников 10.07.24
			//		Продолжить;
			//	КонецЕсли;    	
							
				//Отбор = Новый Структура;
				//Отбор.Вставить("Наименование", НаименованиеЛат); 
				//СтрокиК = Объект.ТаблицаДрНаименованияООН.НайтиСтроки(Отбор);
				//Если НЕ СтрокиК.Количество() = 0 Тогда 
				//	Для каждого СтрК Из СтрокиК Цикл  
				//		ОтборИД = Новый Структура; 
				//		ОтборИД.Вставить("ИД", СтрК.ИД);
				//		СтрокиИД = Объект.ТаблицаООН.НайтиСтроки(ОтборИД);
				//		Если НЕ СтрокиИД.Количество() = 0 Тогда  
				//			СтрИД = СтрокиИД.Получить(0);
				//			Если НЕ СтрИД.ДатаРождения = Дата(1,1,1) Тогда 
				//				Если СтрИД.ДатаРождения = ДатаРождения Тогда
				//				    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
				//					НоваяСтр.ИД = СтрИД.ИД;
				//					НоваяСтр.Клиент = Выборка.Клиент;
				//					НоваяСтр.Статус = СтрИД.Статус;
				//					НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
				//					ЕстьСовпадение = Истина;
				//					Прервать;
				//				КонецЕсли;	
				//			КонецЕсли;	
				//		КонецЕсли;	
				//	КонецЦикла;	
				//КонецЕсли;  
				//Если ЕстьСовпадение Тогда
				//	Продолжить;
				//КонецЕсли; 

			//КонецЕсли;	 	
			
			ОтборДок = Новый Структура;
			ОтборДок.Вставить("Клиент", Выборка.Клиент);
			//+МАН 11.02.25 Закомментировал и сделал через функцию
			//Было: СтрокиДок = ТаблицаДокументов.НайтиСтроки(ОтборДок); 
			СтрокиДок = ПолучитьДокумент(Выборка.Клиент);
			//-МАН
			Для каждого СтрДок Из СтрокиДок Цикл 
				ОтборК = Новый Структура;
				ОтборК.Вставить("ДокументНомер", СокрЛП(СтрДок.ДокументНомер));
				СтрокиК = Объект.ТаблицаООНДокументы.НайтиСтроки(ОтборК); 
				Если НЕ СтрокиК.Количество() = 0 Тогда 
					Для каждого СтрК Из СтрокиК Цикл  
						ОтборИД = Новый Структура; 
						ОтборИД.Вставить("ИД", СтрК.ИД);
						СтрокиИД = Объект.ТаблицаООН.НайтиСтроки(ОтборИД);
						Если НЕ СтрокиИД.Количество() = 0 Тогда  
							СтрИД = СтрокиИД.Получить(0);
							Если НЕ СтрИД.ДатаРождения = Дата(1,1,1) Тогда 
								Если СтрИД.ДатаРождения = ДатаРождения Тогда
								    НоваяСтр = Объект.ТаблицаКлиентов.Добавить(); 
									НоваяСтр.ИД = СтрИД.ИД;
									НоваяСтр.Клиент = Выборка.Клиент;
									НоваяСтр.Статус = СтрИД.Статус; 
									НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
									ЕстьСовпадение = Истина;
									Прервать;
								КонецЕсли;	
							КонецЕсли;	
					   КонецЕсли;	
					КонецЦикла;	
				КонецЕсли;  
                Если ЕстьСовпадение Тогда
					УдалитьИзделияИзНакладнойНаОтгузку(Выборка.Клиент); //+Мельников 10.07.24
					Прервать;
				КонецЕсли; 
  			КонецЦикла;			
			
		КонецЕсли;	
	КонецЦикла;
    ОбщегоНазначения.СообщитьПользователю("Проверка клиентов по перечню окончание " + Формат(ТекущаяДата(), "ДЛФ=DT"));
КонецПроцедуры

&НаСервере
Процедура ПроверкаКлиентов() 
	Объект.ТаблицаКлиентов.Очистить(); 		
	ОбщегоНазначения.СообщитьПользователю("Проверка клиентов по перечню начало " + Формат(ТекущаяДата(), "ДЛФ=DT"));
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("ВидДокументаЗалогодателя", Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность);
	//+МАН 15.10.25 Перенес и изменил запрос
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ЛБ_ДокументыЗалогодателя.Владелец КАК Клиент,
	//               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
	//               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
	//               |	ЛБ_ДокументыЗалогодателя.Наименование КАК Наименование
	//               |ИЗ
	//               |	Справочник.ЛБ_ДокументыЗалогодателя КАК ЛБ_ДокументыЗалогодателя
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних КАК ЛБ_ДокументыЗалогодателейСрезПоследних
	//               |		ПО (ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя = ЛБ_ДокументыЗалогодателя.Ссылка)
	//               |ГДЕ
	//               |	ЛБ_ДокументыЗалогодателя.ВидДокументаЗалогодателя = &ВидДокументаЗалогодателя";
	////+МАН 13.10.25 Для тестирования
	////ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	//-МАН
	
	СписокКлиентов = ЛБ_УправлениеЛомбардом.ЗаполнитьСписокКлиентовДляПроверкиПоПеречням(ТекущаяДата());  
	Запрос.УстановитьПараметр("СписокКлиентов", СписокКлиентов);

	//+МАН 15.10.25 Формирование списка документов по списку залогодателей.
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателя.Владелец КАК Клиент,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателя.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник.ЛБ_ДокументыЗалогодателя КАК ЛБ_ДокументыЗалогодателя
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(
	               |				,
	               |				ВидДокументаЗалогодателя = &ВидДокументаЗалогодателя
	               |					И ДокументЗалогодателя.Владелец В (&СписокКлиентов)) КАК ЛБ_ДокументыЗалогодателейСрезПоследних
	               |		ПО (ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя = ЛБ_ДокументыЗалогодателя.Ссылка)";
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	//-МАН
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_Залогодатели.Ссылка КАК Клиент,
	               |	ЛБ_Залогодатели.Наименование КАК Наименование,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
	               |	ЛБ_АнкетаЗалогодателяСрезПоследних.ИНН КАК ИНН,
	               |	ЛБ_АнкетаЗалогодателяСрезПоследних.ТипФизЛица КАК ЮридическоеФизическоеЛицо,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия_А КАК Фамилия_А,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя_А КАК Имя_А,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество_А КАК Отчество_А
	               |ИЗ
	               |	Справочник.ЛБ_Залогодатели КАК ЛБ_Залогодатели
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних
	               |		ПО (ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Залогодатель = ЛБ_Залогодатели.Ссылка)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_АнкетаЗалогодателя.СрезПоследних КАК ЛБ_АнкетаЗалогодателяСрезПоследних
	               |		ПО (ЛБ_АнкетаЗалогодателяСрезПоследних.Залогодатель = ЛБ_Залогодатели.Ссылка)
	               |ГДЕ
	               |	ЛБ_Залогодатели.ПометкаУдаления = ЛОЖЬ
	               |	И ЛБ_Залогодатели.Ссылка В(&СписокКлиентов)
	               |АВТОУПОРЯДОЧИВАНИЕ";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл   
		Наименование = Врег(СокрЛП(Выборка.Наименование)); 
		НаименованиеЛат = СокрЛП(Выборка.Фамилия_А) + ?(ПустаяСтрока(Выборка.Имя_А), "", " " + СокрЛП(Выборка.Имя_А)) + ?(ПустаяСтрока(Выборка.Отчество_А), "", " " + СокрЛП(Выборка.Отчество_А));
		НаименованиеЛат = Врег(НаименованиеЛат);
		ДатаРождения = Выборка.ДатаРождения;
		ГодРождения = Год(ДатаРождения); 
		ИНН = СокрЛП(Выборка.ИНН);
		ЮридическоеФизическоеЛицо = Выборка.ЮридическоеФизическоеЛицо; 
		Если Объект.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ФРОМУ тогда
			ЕстьСовпадение = ложь; 
			Для сч = 1 По 2 Цикл 
				Если ЕстьСовпадение Тогда
					Прервать;
				ИначеЕсли сч = 2 и Пустаястрока(НаименованиеЛат) Тогда
                    Прервать;
				КонецЕсли;	
				Отбор = Новый Структура;
				Если Сч = 1 Тогда
				    Отбор.Вставить("Наименование", Наименование); 
				Иначе
					Отбор.Вставить("НаименованиеЛат", НаименованиеЛат);
				КонецЕсли;	
				Отбор.Вставить("ЮридическоеФизическоеЛицо", ЮридическоеФизическоеЛицо);
				СтрокиК = Объект.ТаблицаФрому.НайтиСтроки(Отбор);
				Если НЕ СтрокиК.Количество() = 0 Тогда 
					Для каждого СтрК Из СтрокиК Цикл  
						Если НЕ СтрК.ДатаРождения = Дата(1,1,1) Тогда 
							Если СтрК.ДатаРождения = ДатаРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
								НоваяСтр.ИД = СтрК.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрК.Статус; 
								НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень; 
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;	
						ИначеЕсли НЕ ГодРождения = 0 Тогда 
							Если СтрК.ГодРождения = ГодРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
								НоваяСтр.ИД = СтрК.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрК.Статус;
								НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;	
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли; 	
			КонецЦикла;	
			Если ЕстьСовпадение Тогда
				Продолжить;
			КонецЕсли;    
			
			Отбор = Новый Структура;
			Отбор.Вставить("Наименование", Наименование);
			СтрокиК = Объект.ТаблицаДрНаименованияФРОМУ.НайтиСтроки(Отбор);
			Если НЕ СтрокиК.Количество() = 0 Тогда 
				Для каждого СтрК Из СтрокиК Цикл  
					ОтборИД = Новый Структура;
					ОтборИД.Вставить("ИД", СтрК.ИД);
					СтрокиИД = Объект.ТаблицаФрому.НайтиСтроки(ОтборИД);
					Если НЕ СтрокиИД.Количество() = 0 Тогда  
						СтрИД = СтрокиИД.Получить(0);
						Если НЕ СтрИД.ДатаРождения = Дата(1,1,1) Тогда 
							Если СтрИД.ДатаРождения = ДатаРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
								НоваяСтр.ИД = СтрИД.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрИД.Статус; 
								НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина; 								
								Прервать;
							КонецЕсли;	
						ИначеЕсли НЕ ГодРождения = 0 Тогда 
							Если СтрИД.ГодРождения = ГодРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
								НоваяСтр.ИД = СтрИД.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрИД.Статус; 
								НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;	
						КонецЕсли;
					КонецЕсли;	
				КонецЦикла;	
			КонецЕсли;  
			Если ЕстьСовпадение Тогда
				Продолжить;
			КонецЕсли;  
			
			Если НЕ Пустаястрока(НаименованиеЛат) Тогда
	        	Отбор = Новый Структура;
				Отбор.Вставить("НаименованиеЛат", НаименованиеЛат); 
				Отбор.Вставить("ЮридическоеФизическоеЛицо", ЮридическоеФизическоеЛицо);
				СтрокиК = Объект.ТаблицаФрому.НайтиСтроки(Отбор);
				Если НЕ СтрокиК.Количество() = 0 Тогда 
					Для каждого СтрК Из СтрокиК Цикл  
						Если НЕ СтрК.ДатаРождения = Дата(1,1,1) Тогда 
							Если СтрК.ДатаРождения = ДатаРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
								НоваяСтр.ИД = СтрК.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрК.Статус;   
								НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;	
						ИначеЕсли НЕ ГодРождения = 0 Тогда 
							Если СтрК.ГодРождения = ГодРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
								НоваяСтр.ИД = СтрК.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрК.Статус;
								НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;	
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли;  
	            Если ЕстьСовпадение Тогда
					Продолжить;
				КонецЕсли;  
			
				Отбор = Новый Структура;
				Отбор.Вставить("Наименование", НаименованиеЛат); 
				СтрокиК = Объект.ТаблицаДрНаименованияФРОМУ.НайтиСтроки(Отбор);
				Если НЕ СтрокиК.Количество() = 0 Тогда 
					Для каждого СтрК Из СтрокиК Цикл  
						ОтборИД = Новый Структура; 
						ОтборИД.Вставить("ИД", СтрК.ИД);
						СтрокиИД = Объект.ТаблицаФрому.НайтиСтроки(ОтборИД);
						Если НЕ СтрокиИД.Количество() = 0 Тогда  
							СтрИД = СтрокиИД.Получить(0);
							Если НЕ СтрИД.ДатаРождения = Дата(1,1,1) Тогда 
								Если СтрИД.ДатаРождения = ДатаРождения Тогда
								    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
									НоваяСтр.ИД = СтрИД.ИД;
									НоваяСтр.Клиент = Выборка.Клиент;
									НоваяСтр.Статус = СтрИД.Статус;
									НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
									ЕстьСовпадение = Истина;
									Прервать;
								КонецЕсли;	
							ИначеЕсли НЕ ГодРождения = 0 Тогда 
								Если СтрИД.ГодРождения = ГодРождения Тогда
								    НоваяСтр = Объект.ТаблицаКлиентов.Добавить(); 
									НоваяСтр.ИД = СтрИД.ИД;
									НоваяСтр.Клиент = Выборка.Клиент;
									НоваяСтр.Статус = СтрИД.Статус;
									НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
									ЕстьСовпадение = Истина;
									Прервать;
								КонецЕсли;	
							КонецЕсли;
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли;  
	            Если ЕстьСовпадение Тогда
					Продолжить;
				КонецЕсли; 
			КонецЕсли;	
			
			//+МАН 15.10.25 Вынес из этого цикла и сделал цикл сразу по списку документов
			//ОтборДок = Новый Структура;
			//ОтборДок.Вставить("Клиент", Выборка.Клиент);
			////+МАН 13.10.25 Закомментировал и сделал через функцию
			////Было: СтрокиДок = ТаблицаДокументов.НайтиСтроки(ОтборДок);
			//СтрокиДок = ПолучитьДокумент(Выборка.Клиент);
			////-МАН
			//Для каждого СтрДок Из СтрокиДок Цикл 
			//	ОтборК = Новый Структура;
			//	ОтборК.Вставить("ДокументНомер", СокрЛП(СтрДок.ДокументНомер));
			//	СтрокиК = Объект.ТаблицаФромуДокументы.НайтиСтроки(ОтборК); 
			//	Если НЕ СтрокиК.Количество() = 0 Тогда 
			//		Для каждого СтрК Из СтрокиК Цикл  
			//			ОтборИД = Новый Структура; 
			//			ОтборИД.Вставить("ИД", СтрК.ИД);
			//			СтрокиИД = Объект.ТаблицаФрому.НайтиСтроки(ОтборИД);
			//			Если НЕ СтрокиИД.Количество() = 0 Тогда  
			//				СтрИД = СтрокиИД.Получить(0);       
			//			    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
			//				НоваяСтр.ИД = СтрИД.ИД;
			//				НоваяСтр.Клиент = Выборка.Клиент;
			//				НоваяСтр.Статус = СтрИД.Статус; 
			//				НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
			//				ЕстьСовпадение = Истина;
			//				Прервать;
			//			КонецЕсли;	
			//		КонецЦикла;	
			//	КонецЕсли;  
			//    Если ЕстьСовпадение Тогда
			//		Прервать;
			//	КонецЕсли; 
			//КонецЦикла;	
			//-МАН
		ИначеЕсли Объект.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.МВК тогда
			ЕстьСовпадение = ложь;   
			Для сч = 1 По 2 Цикл 
				Если ЕстьСовпадение Тогда
					Прервать;
				ИначеЕсли сч = 2 и Пустаястрока(НаименованиеЛат) Тогда
                    Прервать;
				КонецЕсли;	
				Отбор = Новый Структура;
				Если Сч = 1 Тогда
				    Отбор.Вставить("Наименование", Наименование); 
				Иначе
					Отбор.Вставить("НаименованиеЛат", НаименованиеЛат);
				КонецЕсли;	
                Отбор.Вставить("ЮридическоеФизическоеЛицо", ЮридическоеФизическоеЛицо);
				//Отбор.Вставить("Статус", Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен);
				СтрокиК = Объект.ТаблицаМВК.НайтиСтроки(Отбор);
				Если НЕ СтрокиК.Количество() = 0 Тогда 
					Для каждого СтрК Из СтрокиК Цикл  
						Если НЕ СтрК.ДатаРождения = Дата(1,1,1) Тогда 
							Если СтрК.ДатаРождения = ДатаРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
								НоваяСтр.ИД = СтрК.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрК.Статус;
								НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;	
						ИначеЕсли НЕ ГодРождения = 0 Тогда 
							Если СтрК.ГодРождения = ГодРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить(); 
								НоваяСтр.ИД = СтрК.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрК.Статус; 
								НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;	
						КонецЕсли;	
						Если НЕ ПустаяСтрока(ИНН) Тогда 
							Если СтрК.ИНН = ИНН Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
								НоваяСтр.ИД = СтрК.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрК.Статус;    
								НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;		
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли; 	
			КонецЦикла;	
			Если ЕстьСовпадение Тогда
				УдалитьИзделияИзНакладнойНаОтгузку(Выборка.Клиент); //+Мельников 10.07.24
				Продолжить;
			КонецЕсли;  
			
			Отбор = Новый Структура;
			Отбор.Вставить("Наименование", Наименование);
			СтрокиК = Объект.ТаблицаДрНаименованияМВК.НайтиСтроки(Отбор);
			Если НЕ СтрокиК.Количество() = 0 Тогда 
				Для каждого СтрК Из СтрокиК Цикл  
					ОтборИД = Новый Структура;
					ОтборИД.Вставить("ИД", СтрК.ИД);
					СтрокиИД = Объект.ТаблицаМВК.НайтиСтроки(ОтборИД);
					Если НЕ СтрокиИД.Количество() = 0 Тогда  
						СтрИД = СтрокиИД.Получить(0);
						Если НЕ СтрИД.ДатаРождения = Дата(1,1,1) Тогда 
							Если СтрИД.ДатаРождения = ДатаРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
								НоваяСтр.ИД = СтрИД.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрИД.Статус;
								НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;	
						ИначеЕсли НЕ ГодРождения = 0 Тогда 
							Если СтрИД.ГодРождения = ГодРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить(); 
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрИД.Статус;
								НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;
						КонецЕсли;	
					    Если НЕ ПустаяСтрока(ИНН) Тогда 
							Если СтрИД.ИНН = ИНН Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
								НоваяСтр.ИД = СтрИД.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрИД.Статус; 
								НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;			
						КонецЕсли;
					КонецЕсли;	
				КонецЦикла;	
			КонецЕсли;  
			Если ЕстьСовпадение Тогда
				УдалитьИзделияИзНакладнойНаОтгузку(Выборка.Клиент); //+Мельников 10.07.24
				Продолжить;
			КонецЕсли;  
			
			Если НЕ Пустаястрока(НаименованиеЛат) Тогда
	        	Отбор = Новый Структура;
				Отбор.Вставить("НаименованиеЛат", НаименованиеЛат); 
				Отбор.Вставить("ЮридическоеФизическоеЛицо", ЮридическоеФизическоеЛицо); 
				//Отбор.Вставить("Статус", Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен);
				СтрокиК = Объект.ТаблицаМВК.НайтиСтроки(Отбор);
				Если НЕ СтрокиК.Количество() = 0 Тогда 
					Для каждого СтрК Из СтрокиК Цикл  
						Если НЕ СтрК.ДатаРождения = Дата(1,1,1) Тогда 
							Если СтрК.ДатаРождения = ДатаРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
								НоваяСтр.ИД = СтрК.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрК.Статус;
								НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;	
						ИначеЕсли НЕ ГодРождения = 0 Тогда 
							Если СтрК.ГодРождения = ГодРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить(); 
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрК.Статус;   
								НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;	 
						КонецЕсли;	
					    Если НЕ ПустаяСтрока(ИНН) Тогда 
							Если СтрК.ИНН = ИНН Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
								НоваяСтр.ИД = СтрК.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрК.Статус; 
								НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;			
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли;  
	            Если ЕстьСовпадение Тогда
					УдалитьИзделияИзНакладнойНаОтгузку(Выборка.Клиент); //+Мельников 10.07.24
					Продолжить;
				КонецЕсли;  
			
				Отбор = Новый Структура;
				Отбор.Вставить("Наименование", НаименованиеЛат); 
				СтрокиК = Объект.ТаблицаДрНаименованияМВК.НайтиСтроки(Отбор);
				Если НЕ СтрокиК.Количество() = 0 Тогда 
					Для каждого СтрК Из СтрокиК Цикл  
						ОтборИД = Новый Структура; 
						ОтборИД.Вставить("ИД", СтрК.ИД);
						СтрокиИД = Объект.ТаблицаМВК.НайтиСтроки(ОтборИД);
						Если НЕ СтрокиИД.Количество() = 0 Тогда  
							СтрИД = СтрокиИД.Получить(0);
							Если НЕ СтрИД.ДатаРождения = Дата(1,1,1) Тогда 
								Если СтрИД.ДатаРождения = ДатаРождения Тогда
								    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
									НоваяСтр.ИД = СтрИД.ИД;
									НоваяСтр.Клиент = Выборка.Клиент;
									НоваяСтр.Статус = СтрИД.Статус; 
									НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
									ЕстьСовпадение = Истина;
									Прервать;
								КонецЕсли;	
							ИначеЕсли НЕ ГодРождения = 0 Тогда 
								Если СтрИД.ГодРождения = ГодРождения Тогда
								    НоваяСтр = Объект.ТаблицаКлиентов.Добавить(); 
									НоваяСтр.Клиент = Выборка.Клиент;
									НоваяСтр.Статус = СтрИД.Статус;
									НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
									ЕстьСовпадение = Истина;
									Прервать;
								КонецЕсли;	 
							КонецЕсли;	
					        Если  НЕ ПустаяСтрока(ИНН) Тогда 
								Если СтрИД.ИНН = ИНН Тогда
								    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
									НоваяСтр.ИД = СтрИД.ИД;
									НоваяСтр.Клиент = Выборка.Клиент;
									НоваяСтр.Статус = СтрИД.Статус;
									НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
									ЕстьСовпадение = Истина;
									Прервать;
								КонецЕсли;			
							КонецЕсли;
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли;  
	            Если ЕстьСовпадение Тогда
					УдалитьИзделияИзНакладнойНаОтгузку(Выборка.Клиент); //+Мельников 10.07.24
					Продолжить;
				КонецЕсли; 
			КонецЕсли;	    
			
			Если НЕ ПустаяСтрока(ИНН) Тогда 
				Отбор = Новый Структура;
				Отбор.Вставить("ИНН", ИНН); 
				//Отбор.Вставить("ДатаРождения", ДатаРождения); 
				//Отбор.Вставить("Статус", Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен);
				СтрокиК = Объект.ТаблицаМВК.НайтиСтроки(Отбор); 
				Если НЕ СтрокиК.Количество() = 0 Тогда
					НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
					НоваяСтр.ИД = СтрокиК.Получить(0).ИД;
					НоваяСтр.Клиент = Выборка.Клиент;
					НоваяСтр.Статус = СтрокиК.Получить(0).Статус;
					НоваяСтр.ДатаВключенияВПеречень = СтрокиК.Получить(0).ДатаВключенияВПеречень;
					ЕстьСовпадение = Истина;
				КонецЕсли;	
			КонецЕсли; 
			Если ЕстьСовпадение Тогда
				УдалитьИзделияИзНакладнойНаОтгузку(Выборка.Клиент); //+Мельников 10.07.24
				Продолжить;
			КонецЕсли; 
			
			//+МАН 15.10.25 Вынес из этого цикла и сделал цикл сразу по списку документов
			//ОтборДок = Новый Структура;
			//ОтборДок.Вставить("Клиент", Выборка.Клиент);
			////+МАН 11.02.25 Закомментировал и сделал через функцию
			////Было: СтрокиДок = ТаблицаДокументов.НайтиСтроки(ОтборДок);
			//СтрокиДок = ПолучитьДокумент(Выборка.Клиент);
			////-МАН
			//Для каждого СтрДок Из СтрокиДок Цикл 
			//	ОтборК = Новый Структура;
			//	ОтборК.Вставить("ДокументНомер", СокрЛП(СтрДок.ДокументНомер));
			//	ОтборК.Вставить("ДокументСерия", СокрЛП(СтрДок.ДокументСерия));
			//	СтрокиК = Объект.ТаблицаМВКДокументы.НайтиСтроки(ОтборК); 
			//	Если НЕ СтрокиК.Количество() = 0 Тогда 
			//		Для каждого СтрК Из СтрокиК Цикл  
			//			ОтборИД = Новый Структура; 
			//			ОтборИД.Вставить("ИД", СтрК.ИД);  
			//			ОтборИД.Вставить("Статус", Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен);
			//			СтрокиИД = Объект.ТаблицаМВК.НайтиСтроки(ОтборИД);
			//			Если НЕ СтрокиИД.Количество() = 0 Тогда  
			//				СтрИД = СтрокиИД.Получить(0);
			//				НоваяСтр = Объект.ТаблицаКлиентов.Добавить(); 
			//				НоваяСтр.ИД = СтрИД.ИД;
			//				НоваяСтр.Клиент = Выборка.Клиент;
			//				НоваяСтр.Статус = СтрИД.Статус;
			//				НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
			//				ЕстьСовпадение = Истина;
			//				Прервать;
			//			КонецЕсли;	
			//		КонецЦикла;	
			//	КонецЕсли;  
			//    Если ЕстьСовпадение Тогда
			//		УдалитьИзделияИзНакладнойНаОтгузку(Выборка.Клиент); //+Мельников 10.07.24
			//		Прервать;
			//	КонецЕсли; 
			//КонецЦикла;	    
			//-МАН
		ИначеЕсли Объект.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.Террористы тогда
			ЕстьСовпадение = ложь;
			Для сч = 1 По 2 Цикл 
				Если ЕстьСовпадение Тогда
					Прервать;
				ИначеЕсли сч = 2 и Пустаястрока(НаименованиеЛат) Тогда
                    Прервать;
				КонецЕсли;	
				Отбор = Новый Структура;
				Если Сч = 1 Тогда
				    Отбор.Вставить("Наименование", Наименование); 
				Иначе
					Отбор.Вставить("НаименованиеЛат", НаименованиеЛат);
				КонецЕсли;	
           		Отбор.Вставить("ЮридическоеФизическоеЛицо", ЮридическоеФизическоеЛицо);
				СтрокиК = Объект.ТаблицаТеррористы.НайтиСтроки(Отбор);
				Если НЕ СтрокиК.Количество() = 0 Тогда 
					Для каждого СтрК Из СтрокиК Цикл  
						Если НЕ СтрК.ДатаРождения = Дата(1,1,1) Тогда 
							Если СтрК.ДатаРождения = ДатаРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
								НоваяСтр.ИД = СтрК.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрК.Статус; 
								НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;	
						ИначеЕсли НЕ ГодРождения = 0 Тогда 
							Если СтрК.ГодРождения = ГодРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить(); 
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрК.Статус; 
								НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;	 
						КонецЕсли;	
						Если НЕ ПустаяСтрока(ИНН) Тогда 
							Если СтрК.ИНН = ИНН Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
								НоваяСтр.ИД = СтрК.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрК.Статус;
								НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;		
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли; 	
			КонецЦикла;	
			Если ЕстьСовпадение Тогда
				УдалитьИзделияИзНакладнойНаОтгузку(Выборка.Клиент); //+Мельников 10.07.24
				Продолжить;
			КонецЕсли;  
			
			Отбор = Новый Структура;
			Отбор.Вставить("Наименование", Наименование);
			СтрокиК = Объект.ТаблицаДрНаименованияТеррористы.НайтиСтроки(Отбор);
			Если НЕ СтрокиК.Количество() = 0 Тогда 
				Для каждого СтрК Из СтрокиК Цикл  
					ОтборИД = Новый Структура;
					ОтборИД.Вставить("ИД", СтрК.ИД);
					СтрокиИД = Объект.ТаблицаТеррористы.НайтиСтроки(ОтборИД);
					Если НЕ СтрокиИД.Количество() = 0 Тогда  
						СтрИД = СтрокиИД.Получить(0);
						Если НЕ СтрК.ДатаРождения = Дата(1,1,1) Тогда 
							Если СтрК.ДатаРождения = ДатаРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить(); 
								НоваяСтр.ИД = СтрК.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрИД.Статус; 
								НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;	
						ИначеЕсли НЕ СтрК.ГодРождения = 0 Тогда 
							Если СтрК.ГодРождения = ГодРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить(); 
								НоваяСтр.Клиент = Выборка.Клиент; 
								НоваяСтр.ИД = СтрИД.ИД;
								НоваяСтр.Статус = СтрИД.Статус;
								НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;
						КонецЕсли;	
						//Если НЕ ПустаяСтрока(ИНН) Тогда 
						//	Если СтрИД.ИНН = ИНН Тогда
						//	    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
						//		НоваяСтр.ИД = СтрИД.ИД;
						//		НоваяСтр.Клиент = Выборка.Клиент;
						//		НоваяСтр.Статус = СтрИД.Статус;   
						//		НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
						//		ЕстьСовпадение = Истина;
						//		Прервать;
						//	КонецЕсли;			
						//КонецЕсли;
					КонецЕсли;	
				КонецЦикла;	
			КонецЕсли;  
			Если ЕстьСовпадение Тогда
				УдалитьИзделияИзНакладнойНаОтгузку(Выборка.Клиент); //+Мельников 10.07.24
				Продолжить;
			КонецЕсли;  
			
			Если НЕ Пустаястрока(НаименованиеЛат) Тогда
	        	Отбор = Новый Структура;
				Отбор.Вставить("НаименованиеЛат", НаименованиеЛат); 
				Отбор.Вставить("ЮридическоеФизическоеЛицо", ЮридическоеФизическоеЛицо);
				СтрокиК = Объект.ТаблицаТеррористы.НайтиСтроки(Отбор);
				Если НЕ СтрокиК.Количество() = 0 Тогда 
					Для каждого СтрК Из СтрокиК Цикл  
						Если НЕ СтрК.ДатаРождения = Дата(1,1,1) Тогда 
							Если СтрК.ДатаРождения = ДатаРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
								НоваяСтр.ИД = СтрК.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрК.Статус;
								НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;	
						ИначеЕсли НЕ ГодРождения = 0 Тогда 
							Если СтрК.ГодРождения = ГодРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить(); 
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрК.Статус;  
								НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;	 
						КонецЕсли;	
					    Если НЕ ПустаяСтрока(ИНН) Тогда 
							Если СтрК.ИНН = ИНН Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
								НоваяСтр.ИД = СтрК.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрК.Статус; 
								НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;			
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли;  
	            Если ЕстьСовпадение Тогда
					УдалитьИзделияИзНакладнойНаОтгузку(Выборка.Клиент); //+Мельников 10.07.24
					Продолжить;
				КонецЕсли;  
			
				Отбор = Новый Структура;
				Отбор.Вставить("Наименование", НаименованиеЛат); 
				СтрокиК = Объект.ТаблицаДрНаименованияТеррористы.НайтиСтроки(Отбор);
				Если НЕ СтрокиК.Количество() = 0 Тогда 
					Для каждого СтрК Из СтрокиК Цикл  
						ОтборИД = Новый Структура; 
						ОтборИД.Вставить("ИД", СтрК.ИД);
						СтрокиИД = Объект.ТаблицаТеррористы.НайтиСтроки(ОтборИД);
						Если НЕ СтрокиИД.Количество() = 0 Тогда  
							СтрИД = СтрокиИД.Получить(0);
							Если НЕ СтрИД.ДатаРождения = Дата(1,1,1) Тогда 
								Если СтрИД.ДатаРождения = ДатаРождения Тогда
								    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
									НоваяСтр.ИД = СтрИД.ИД;
									НоваяСтр.Клиент = Выборка.Клиент;
									НоваяСтр.Статус = СтрИД.Статус;
									НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
									ЕстьСовпадение = Истина;
									Прервать;
								КонецЕсли;	
							ИначеЕсли НЕ ГодРождения = 0 Тогда 
								Если СтрИД.ГодРождения = ГодРождения Тогда
								    НоваяСтр = Объект.ТаблицаКлиентов.Добавить(); 
									НоваяСтр.Клиент = Выборка.Клиент;
									НоваяСтр.Статус = СтрИД.Статус; 
									НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
									ЕстьСовпадение = Истина;
									Прервать;
								КонецЕсли;	 
							КонецЕсли;	
					        Если НЕ ПустаяСтрока(ИНН) Тогда 
								Если СтрИД.ИНН = ИНН Тогда
								    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
									НоваяСтр.ИД = СтрИД.ИД;
									НоваяСтр.Клиент = Выборка.Клиент;
									НоваяСтр.Статус = СтрИД.Статус;
									НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
									ЕстьСовпадение = Истина;
									Прервать;
								КонецЕсли;			
							КонецЕсли;
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли;  
	            Если ЕстьСовпадение Тогда
					УдалитьИзделияИзНакладнойНаОтгузку(Выборка.Клиент); //+Мельников 10.07.24
					Продолжить;
				КонецЕсли; 
			КонецЕсли;	 
			
			Если НЕ ПустаяСтрока(ИНН) Тогда 
				Отбор = Новый Структура;
				Отбор.Вставить("ИНН", ИНН); 
				Отбор.Вставить("ДатаРождения", ДатаРождения); 
				СтрокиК = Объект.ТаблицаТеррористы.НайтиСтроки(Отбор); 
				Если НЕ СтрокиК.Количество() = 0 Тогда
					НоваяСтр = Объект.ТаблицаКлиентов.Добавить(); 
					НоваяСтр.Клиент = Выборка.Клиент;
					НоваяСтр.ИД = СтрокиК.Получить(0).ИД;
					НоваяСтр.Статус = СтрокиК.Получить(0).Статус;
					НоваяСтр.ДатаВключенияВПеречень = СтрокиК.Получить(0).ДатаВключенияВПеречень;
					ЕстьСовпадение = Истина;
				КонецЕсли;	
			КонецЕсли; 
			Если ЕстьСовпадение Тогда
				УдалитьИзделияИзНакладнойНаОтгузку(Выборка.Клиент); //+Мельников 10.07.24
				Продолжить;
			КонецЕсли; 
			
			//+МАН 15.10.25 Вынес из этого цикла и сделал цикл сразу по списку документов
			//ОтборДок = Новый Структура;
			//ОтборДок.Вставить("Клиент", Выборка.Клиент);
			////+МАН 11.02.25 Закомментировал и сделал через функцию
			////Было: СтрокиДок = ТаблицаДокументов.НайтиСтроки(ОтборДок); 
			//СтрокиДок = ПолучитьДокумент(Выборка.Клиент);
			////-МАН
			//Для каждого СтрДок Из СтрокиДок Цикл 
			//	ОтборК = Новый Структура;
			//	ОтборК.Вставить("ДокументНомер", СокрЛП(СтрДок.ДокументНомер));
			//	ОтборК.Вставить("ДокументСерия", СокрЛП(СтрДок.ДокументСерия));
			//	СтрокиК = Объект.ТаблицаТеррористыДокументы.НайтиСтроки(ОтборК); 
			//	Если НЕ СтрокиК.Количество() = 0 Тогда 
			//		Для каждого СтрК Из СтрокиК Цикл  
			//			ОтборИД = Новый Структура; 
			//			ОтборИД.Вставить("ИД", СтрК.ИД);
			//			СтрокиИД = Объект.ТаблицаТеррористы.НайтиСтроки(ОтборИД);
			//			Если НЕ СтрокиИД.Количество() = 0 Тогда  
			//				СтрИД = СтрокиИД.Получить(0);
			//			    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
			//				НоваяСтр.ИД = СтрИД.ИД;
			//				НоваяСтр.Клиент = Выборка.Клиент;
			//				НоваяСтр.Статус = СтрИД.Статус; 
			//				НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
			//				ЕстьСовпадение = Истина;
			//				Прервать;
			//			КонецЕсли;	
			//		КонецЦикла;	
			//	КонецЕсли;  
			//    Если ЕстьСовпадение Тогда
			//		УдалитьИзделияИзНакладнойНаОтгузку(Выборка.Клиент); //+Мельников 10.07.24
			//		Прервать;
			//	КонецЕсли; 
			//КонецЦикла;	
			//-МАН
		ИначеЕсли Объект.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ЦБ тогда
			ЕстьСовпадение = ложь;
			Отбор = Новый Структура;
			Отбор.Вставить("Наименование", Наименование);
			Отбор.Вставить("ЮридическоеФизическоеЛицо", ЮридическоеФизическоеЛицо);
			СтрокиК = Объект.ТаблицаЦБ.НайтиСтроки(Отбор);
			Если НЕ СтрокиК.Количество() = 0 Тогда 
				Для каждого СтрК Из СтрокиК Цикл  
					Если НЕ СтрК.ДатаРождения = Дата(1,1,1) Тогда 
						Если СтрК.ДатаРождения = ДатаРождения Тогда
						    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
							НоваяСтр.ИД = СтрК.ИД;
							НоваяСтр.Клиент = Выборка.Клиент;
							НоваяСтр.Статус = СтрК.Статус;
							НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень; 
							НоваяСтр.КодОтказа = СтрК.КодОтказа;
							ЕстьСовпадение = Истина;
							Прервать;
						КонецЕсли;	
					КонецЕсли;	
					//Если НЕ ПустаяСтрока(ИНН) Тогда 
					//	Если СтрК.ИНН = ИНН Тогда
					//	    НоваяСтр = ТаблицаКлиентов.Добавить(); 
					//		НоваяСтр.Клиент = Выборка.Клиент;
					//		НоваяСтр.Статус = СтрК.Статус; 
					//		ЕстьСовпадение = Истина;
					//		Прервать;
					//	КонецЕсли;		
					//КонецЕсли;	
				КонецЦикла;	
			КонецЕсли; 			
			Если ЕстьСовпадение Тогда
				Продолжить;
			КонецЕсли;  
			
						
			Если НЕ ПустаяСтрока(ИНН) Тогда 
				Отбор = Новый Структура;
				Отбор.Вставить("ИНН", ИНН); 
				Отбор.Вставить("ДатаРождения", ДатаРождения); 
				СтрокиК = Объект.ТаблицаЦБ.НайтиСтроки(Отбор); 
				Если НЕ СтрокиК.Количество() = 0 Тогда
					НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
					НоваяСтр.ИД = СтрокиК.Получить(0).ИД;
					НоваяСтр.Клиент = Выборка.Клиент;
					НоваяСтр.Статус = СтрокиК.Получить(0).Статус; 
					НоваяСтр.ДатаВключенияВПеречень = СтрокиК.Получить(0).ДатаВключенияВПеречень; 
					НоваяСтр.КодОтказа = СтрокиК.Получить(0).КодОтказа;
					ЕстьСовпадение = Истина;
				КонецЕсли;	
			КонецЕсли; 
			Если ЕстьСовпадение Тогда
				Продолжить;
			КонецЕсли; 
			
			//+МАН 15.10.25 Вынес из этого цикла и сделал цикл сразу по списку документов
			//ОтборДок = Новый Структура;
			//ОтборДок.Вставить("Клиент", Выборка.Клиент);
			////+МАН 13.10.25 Закомментировал и сделал через функцию
			////Было: СтрокиДок = ТаблицаДокументов.НайтиСтроки(ОтборДок);
			//СтрокиДок = ПолучитьДокумент(Выборка.Клиент);
			////-МАН
			//Для каждого СтрДок Из СтрокиДок Цикл 
			//	ОтборК = Новый Структура;
			//	ОтборК.Вставить("ДокументНомер", СокрЛП(СтрДок.ДокументНомер));
			//	ОтборК.Вставить("ДокументСерия", СокрЛП(СтрДок.ДокументСерия));
			//	СтрокиК = Объект.ТаблицаЦБДокументы.НайтиСтроки(ОтборК); 
			//	Если НЕ СтрокиК.Количество() = 0 Тогда 
			//		Для каждого СтрК Из СтрокиК Цикл  
			//			ОтборИД = Новый Структура; 
			//			ОтборИД.Вставить("ИД", СтрК.ИД);
			//			СтрокиИД = Объект.ТаблицаЦБ.НайтиСтроки(ОтборИД);
			//			Если НЕ СтрокиИД.Количество() = 0 Тогда  
			//				СтрИД = СтрокиИД.Получить(0);
			//				Если НЕ СтрИД.ДатаРождения = Дата(1,1,1) Тогда 
			//					Если СтрИД.ДатаРождения = ДатаРождения Тогда
			//					    НоваяСтр = Объект.ТаблицаКлиентов.Добавить(); 
			//						НоваяСтр.ИД = СтрИД.ИД;
			//						НоваяСтр.Клиент = Выборка.Клиент;
			//						НоваяСтр.Статус = СтрИД.Статус; 
			//						НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
			//						НоваяСтр.КодОтказа = СтрИД.КодОтказа;
			//						ЕстьСовпадение = Истина;
			//						Прервать;
			//					КонецЕсли;	
			//				КонецЕсли;	
			//		        Если НЕ ПустаяСтрока(ИНН) Тогда 
			//					Если СтрИД.ИНН = ИНН Тогда
			//					    НоваяСтр = Объект.ТаблицаКлиентов.Добавить(); 
			//						НоваяСтр.ИД = СтрИД.ИД;
			//						НоваяСтр.Клиент = Выборка.Клиент;
			//						НоваяСтр.Статус = СтрИД.Статус;  
			//						НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;  
			//						НоваяСтр.КодОтказа = СтрИД.КодОтказа;
			//						ЕстьСовпадение = Истина;
			//						Прервать;
			//					КонецЕсли;				
			//				КонецЕсли;
			//			КонецЕсли;	
			//		КонецЦикла;	
			//	КонецЕсли;  
			//    Если ЕстьСовпадение Тогда
			//		Прервать;
			//	КонецЕсли; 
			//КонецЦикла;	
			//-МАН
		ИначеЕсли Объект.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ООН тогда
			ЕстьСовпадение = ложь;  
			Для сч = 1 По 2 Цикл 
				Если ЕстьСовпадение Тогда
					Прервать;
				ИначеЕсли сч = 2 и Пустаястрока(НаименованиеЛат) Тогда
                    Прервать;
				КонецЕсли;	
				Отбор = Новый Структура;
				Если Сч = 1 Тогда
				    Отбор.Вставить("Наименование", Наименование); 
				Иначе
					Отбор.Вставить("НаименованиеЛат", НаименованиеЛат);
				КонецЕсли;	
           		Отбор.Вставить("ЮридическоеФизическоеЛицо", ЮридическоеФизическоеЛицо);
				СтрокиК = Объект.ТаблицаООН.НайтиСтроки(Отбор);
				Если НЕ СтрокиК.Количество() = 0 Тогда 
					Для каждого СтрК Из СтрокиК Цикл  
						Если НЕ СтрК.ДатаРождения = Дата(1,1,1) Тогда 
							Если СтрК.ДатаРождения = ДатаРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
								НоваяСтр.ИД = СтрК.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрК.Статус;
								НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;  
							ИначеЕсли НЕ ГодРождения = 0 Тогда 
								Если СтрК.ГодРождения = ГодРождения Тогда
								    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
									НоваяСтр.ИД = СтрК.ИД;
									НоваяСтр.Клиент = Выборка.Клиент;
									НоваяСтр.Статус = СтрК.Статус; 
									НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень;
									ЕстьСовпадение = Истина;
									Прервать;
								КонецЕсли;	 	
							КонецЕсли;	
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли; 	
			КонецЦикла;	
			Если ЕстьСовпадение Тогда
				УдалитьИзделияИзНакладнойНаОтгузку(Выборка.Клиент); //+Мельников 10.07.24
				Продолжить;
			КонецЕсли;  
			
			//Если НЕ ПустаяСтрока(НаименованиеЛат) Тогда
			//	Отбор = Новый Структура;
			//	Отбор.Вставить("НаименованиеЛат", НаименованиеЛат);
			//	Отбор.Вставить("ЮридическоеФизическоеЛицо", ЮридическоеФизическоеЛицо);
			//	СтрокиК = Объект.ТаблицаООН.НайтиСтроки(Отбор);
			//	Если НЕ СтрокиК.Количество() = 0 Тогда 
			//		Для каждого СтрК Из СтрокиК Цикл  
			//			Если НЕ СтрК.ДатаРождения = Дата(1,1,1) Тогда 
			//				Если СтрК.ДатаРождения = ДатаРождения Тогда
			//				    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
			//					НоваяСтр.ИД = СтрК.ИД;
			//					НоваяСтр.Клиент = Выборка.Клиент;
			//					НоваяСтр.Статус = СтрК.Статус;
			//					НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень;
			//					ЕстьСовпадение = Истина;
			//					Прервать;
			//				КонецЕсли;	
			//			КонецЕсли;	
			//		КонецЦикла;	
			//	КонецЕсли; 			
			//	Если ЕстьСовпадение Тогда
			//		УдалитьИзделияИзНакладнойНаОтгузку(Выборка.Клиент); //+Мельников 10.07.24
			//		Продолжить;
			//	КонецЕсли;    	
							
				//Отбор = Новый Структура;
				//Отбор.Вставить("Наименование", НаименованиеЛат); 
				//СтрокиК = Объект.ТаблицаДрНаименованияООН.НайтиСтроки(Отбор);
				//Если НЕ СтрокиК.Количество() = 0 Тогда 
				//	Для каждого СтрК Из СтрокиК Цикл  
				//		ОтборИД = Новый Структура; 
				//		ОтборИД.Вставить("ИД", СтрК.ИД);
				//		СтрокиИД = Объект.ТаблицаООН.НайтиСтроки(ОтборИД);
				//		Если НЕ СтрокиИД.Количество() = 0 Тогда  
				//			СтрИД = СтрокиИД.Получить(0);
				//			Если НЕ СтрИД.ДатаРождения = Дата(1,1,1) Тогда 
				//				Если СтрИД.ДатаРождения = ДатаРождения Тогда
				//				    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
				//					НоваяСтр.ИД = СтрИД.ИД;
				//					НоваяСтр.Клиент = Выборка.Клиент;
				//					НоваяСтр.Статус = СтрИД.Статус;
				//					НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
				//					ЕстьСовпадение = Истина;
				//					Прервать;
				//				КонецЕсли;	
				//			КонецЕсли;	
				//		КонецЕсли;	
				//	КонецЦикла;	
				//КонецЕсли;  
				//Если ЕстьСовпадение Тогда
				//	Продолжить;
				//КонецЕсли; 

			//КонецЕсли;	 	
			
			//+МАН 15.10.25 Вынес из этого цикла и сделал цикл сразу по списку документов
			//ОтборДок = Новый Структура;
			//ОтборДок.Вставить("Клиент", Выборка.Клиент);
			////+МАН 11.02.25 Закомментировал и сделал через функцию
			////Было: СтрокиДок = ТаблицаДокументов.НайтиСтроки(ОтборДок); 
			//СтрокиДок = ПолучитьДокумент(Выборка.Клиент);
			////-МАН
			//Для каждого СтрДок Из СтрокиДок Цикл 
			//	ОтборК = Новый Структура;
			//	ОтборК.Вставить("ДокументНомер", СокрЛП(СтрДок.ДокументНомер));
			//	СтрокиК = Объект.ТаблицаООНДокументы.НайтиСтроки(ОтборК); 
			//	Если НЕ СтрокиК.Количество() = 0 Тогда 
			//		Для каждого СтрК Из СтрокиК Цикл  
			//			ОтборИД = Новый Структура; 
			//			ОтборИД.Вставить("ИД", СтрК.ИД);
			//			СтрокиИД = Объект.ТаблицаООН.НайтиСтроки(ОтборИД);
			//			Если НЕ СтрокиИД.Количество() = 0 Тогда  
			//				СтрИД = СтрокиИД.Получить(0);
			//				Если НЕ СтрИД.ДатаРождения = Дата(1,1,1) Тогда 
			//					Если СтрИД.ДатаРождения = ДатаРождения Тогда
			//					    НоваяСтр = Объект.ТаблицаКлиентов.Добавить(); 
			//						НоваяСтр.ИД = СтрИД.ИД;
			//						НоваяСтр.Клиент = Выборка.Клиент;
			//						НоваяСтр.Статус = СтрИД.Статус; 
			//						НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
			//						ЕстьСовпадение = Истина;
			//						Прервать;
			//					КонецЕсли;	
			//				КонецЕсли;	
			//		   КонецЕсли;	
			//		КонецЦикла;	
			//	КонецЕсли;  
			//    Если ЕстьСовпадение Тогда
			//		УдалитьИзделияИзНакладнойНаОтгузку(Выборка.Клиент); //+Мельников 10.07.24
			//		Прервать;
			//	КонецЕсли; 
			//КонецЦикла;			
			//-МАН
		КонецЕсли;	
	КонецЦикла;
	
	//+МАН 15.10.25 Сделал цикл сразу по списку документов
	Если Объект.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ФРОМУ тогда
		Для каждого СтрДок Из ТаблицаДокументов Цикл 
			ОтборК = Новый Структура;
			ОтборК.Вставить("ДокументНомер", СокрЛП(СтрДок.ДокументНомер));
			СтрокиК = Объект.ТаблицаФромуДокументы.НайтиСтроки(ОтборК); 
			Если НЕ СтрокиК.Количество() = 0 Тогда 
				Для каждого СтрК Из СтрокиК Цикл  
					ОтборИД = Новый Структура; 
					ОтборИД.Вставить("ИД", СтрК.ИД);
					СтрокиИД = Объект.ТаблицаФрому.НайтиСтроки(ОтборИД);
					Если НЕ СтрокиИД.Количество() = 0 Тогда  
						СтрИД = СтрокиИД.Получить(0);       
						НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
						НоваяСтр.ИД = СтрИД.ИД;
						////НоваяСтр.Клиент = Выборка.Клиент;
						НоваяСтр.Клиент = СтрДок.Клиент;
						НоваяСтр.Статус = СтрИД.Статус; 
						НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
						ЕстьСовпадение = Истина;
						Прервать;
					КонецЕсли;	
				КонецЦикла;	
			КонецЕсли;  
			Если ЕстьСовпадение Тогда
				Прервать;
			КонецЕсли; 
		КонецЦикла;	
	ИначеЕсли Объект.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.МВК тогда
		Для каждого СтрДок Из ТаблицаДокументов Цикл 
			ОтборК = Новый Структура;
			ОтборК.Вставить("ДокументНомер", СокрЛП(СтрДок.ДокументНомер));
			ОтборК.Вставить("ДокументСерия", СокрЛП(СтрДок.ДокументСерия));
			СтрокиК = Объект.ТаблицаМВКДокументы.НайтиСтроки(ОтборК); 
			Если НЕ СтрокиК.Количество() = 0 Тогда 
				Для каждого СтрК Из СтрокиК Цикл  
					ОтборИД = Новый Структура; 
					ОтборИД.Вставить("ИД", СтрК.ИД);  
					ОтборИД.Вставить("Статус", Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен);
					СтрокиИД = Объект.ТаблицаМВК.НайтиСтроки(ОтборИД);
					Если НЕ СтрокиИД.Количество() = 0 Тогда  
						СтрИД = СтрокиИД.Получить(0);
						НоваяСтр = Объект.ТаблицаКлиентов.Добавить(); 
						НоваяСтр.ИД = СтрИД.ИД;
						////НоваяСтр.Клиент = Выборка.Клиент;
						НоваяСтр.Клиент = СтрДок.Клиент;
						НоваяСтр.Статус = СтрИД.Статус;
						НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
						ЕстьСовпадение = Истина;
						Прервать;
					КонецЕсли;	
				КонецЦикла;	
			КонецЕсли;  
			Если ЕстьСовпадение Тогда
				////УдалитьИзделияИзНакладнойНаОтгузку(Выборка.Клиент); //+Мельников 10.07.24
				УдалитьИзделияИзНакладнойНаОтгузку(СтрДок.Клиент); //+Мельников 10.07.24
				Прервать;
			КонецЕсли; 
		КонецЦикла;	    
	ИначеЕсли Объект.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.Террористы тогда
		Для каждого СтрДок Из ТаблицаДокументов Цикл 
			ОтборК = Новый Структура;
			ОтборК.Вставить("ДокументНомер", СокрЛП(СтрДок.ДокументНомер));
			ОтборК.Вставить("ДокументСерия", СокрЛП(СтрДок.ДокументСерия));
			СтрокиК = Объект.ТаблицаТеррористыДокументы.НайтиСтроки(ОтборК); 
			Если НЕ СтрокиК.Количество() = 0 Тогда 
				Для каждого СтрК Из СтрокиК Цикл  
					ОтборИД = Новый Структура; 
					ОтборИД.Вставить("ИД", СтрК.ИД);
					СтрокиИД = Объект.ТаблицаТеррористы.НайтиСтроки(ОтборИД);
					Если НЕ СтрокиИД.Количество() = 0 Тогда  
						СтрИД = СтрокиИД.Получить(0);
						НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
						НоваяСтр.ИД = СтрИД.ИД;
						////НоваяСтр.Клиент = Выборка.Клиент;
						НоваяСтр.Клиент = СтрДок.Клиент;
						НоваяСтр.Статус = СтрИД.Статус; 
						НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
						ЕстьСовпадение = Истина;
						Прервать;
					КонецЕсли;	
				КонецЦикла;	
			КонецЕсли;  
			Если ЕстьСовпадение Тогда
				////УдалитьИзделияИзНакладнойНаОтгузку(Выборка.Клиент); //+Мельников 10.07.24
				УдалитьИзделияИзНакладнойНаОтгузку(СтрДок.Клиент); //+Мельников 10.07.24
				Прервать;
			КонецЕсли; 
		КонецЦикла;	
	ИначеЕсли Объект.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ЦБ тогда
		Для каждого СтрДок Из ТаблицаДокументов Цикл 
			ОтборК = Новый Структура;
			ОтборК.Вставить("ДокументНомер", СокрЛП(СтрДок.ДокументНомер));
			ОтборК.Вставить("ДокументСерия", СокрЛП(СтрДок.ДокументСерия));
			СтрокиК = Объект.ТаблицаЦБДокументы.НайтиСтроки(ОтборК); 
			Если НЕ СтрокиК.Количество() = 0 Тогда 
				Для каждого СтрК Из СтрокиК Цикл  
					ОтборИД = Новый Структура; 
					ОтборИД.Вставить("ИД", СтрК.ИД);
					СтрокиИД = Объект.ТаблицаЦБ.НайтиСтроки(ОтборИД);
					Если НЕ СтрокиИД.Количество() = 0 Тогда  
						СтрИД = СтрокиИД.Получить(0);
						Если НЕ СтрИД.ДатаРождения = Дата(1,1,1) Тогда 
							Если СтрИД.ДатаРождения = ДатаРождения Тогда
								НоваяСтр = Объект.ТаблицаКлиентов.Добавить(); 
								НоваяСтр.ИД = СтрИД.ИД;
								////НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Клиент = СтрДок.Клиент;
								НоваяСтр.Статус = СтрИД.Статус; 
								НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
								НоваяСтр.КодОтказа = СтрИД.КодОтказа;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;	
						КонецЕсли;	
						Если НЕ ПустаяСтрока(ИНН) Тогда 
							Если СтрИД.ИНН = ИНН Тогда
								НоваяСтр = Объект.ТаблицаКлиентов.Добавить(); 
								НоваяСтр.ИД = СтрИД.ИД;
								////НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Клиент = СтрДок.Клиент;
								НоваяСтр.Статус = СтрИД.Статус;  
								НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;  
								НоваяСтр.КодОтказа = СтрИД.КодОтказа;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;				
						КонецЕсли;
					КонецЕсли;	
				КонецЦикла;	
			КонецЕсли;  
			Если ЕстьСовпадение Тогда
				Прервать;
			КонецЕсли; 
		КонецЦикла;	
	ИначеЕсли Объект.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ООН тогда
		Для каждого СтрДок Из ТаблицаДокументов Цикл 
			ОтборК = Новый Структура;
			ОтборК.Вставить("ДокументНомер", СокрЛП(СтрДок.ДокументНомер));
			СтрокиК = Объект.ТаблицаООНДокументы.НайтиСтроки(ОтборК); 
			Если НЕ СтрокиК.Количество() = 0 Тогда 
				Для каждого СтрК Из СтрокиК Цикл  
					ОтборИД = Новый Структура; 
					ОтборИД.Вставить("ИД", СтрК.ИД);
					СтрокиИД = Объект.ТаблицаООН.НайтиСтроки(ОтборИД);
					Если НЕ СтрокиИД.Количество() = 0 Тогда  
						СтрИД = СтрокиИД.Получить(0);
						Если НЕ СтрИД.ДатаРождения = Дата(1,1,1) Тогда 
							Если СтрИД.ДатаРождения = ДатаРождения Тогда
								НоваяСтр = Объект.ТаблицаКлиентов.Добавить(); 
								НоваяСтр.ИД = СтрИД.ИД;
								////НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Клиент = СтрДок.Клиент;
								НоваяСтр.Статус = СтрИД.Статус; 
								НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;	
						КонецЕсли;	
					КонецЕсли;	
				КонецЦикла;	
			КонецЕсли;  
			Если ЕстьСовпадение Тогда
				////УдалитьИзделияИзНакладнойНаОтгузку(Выборка.Клиент); //+Мельников 10.07.24
				УдалитьИзделияИзНакладнойНаОтгузку(СтрДок.Клиент); //+Мельников 10.07.24
				Прервать;
			КонецЕсли; 
		КонецЦикла;			
	КонецЕсли;

    ОбщегоНазначения.СообщитьПользователю("Проверка клиентов по перечню окончание " + Формат(ТекущаяДата(), "ДЛФ=DT"));
КонецПроцедуры
//-МАН

&НаСервере
Функция ЗаполнитьПараметрыОтчета(ДатаЗагрузкиПеречня = неопределено, ДатаПеречня) 
	ПараметрыФормы = новый Структура;
	ПараметрыФормы.Вставить("ВидПеречня", Объект.ВидПеречня); 
	ПараметрыФормы.Вставить("ДатаПеречня", ДатаПеречня);
	ПараметрыФормы.Вставить("ДатаСверки", ?(ДатаЗагрузкиПеречня = неопределено, ТекущаяДата(), ДатаЗагрузкиПеречня)); 
	ПараметрыФормы.Вставить("МассивКлиентов", ЛБ_УправлениеЛомбардом.ПреобразованиеТаблицыЗначенийВМассив(Объект.ТаблицаКлиентов.Выгрузить()));  
		
	Возврат ПараметрыФормы;
КонецФункции	

&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
	Если ПустаяСтрока(Объект.Файл) тогда 
		Сообщить("Не выбран файл!");
		Возврат;
	КонецЕсли;	    
	Если НЕ ЗначениеЗаполнено(Объект.ВидПеречня) Тогда 
		Сообщить("Не выбран вид перечня!");
		Возврат;
	КонецЕсли;	 
	
	ДвоичныеДанные = Новый ДвоичныеДанные(Объект.Файл);
	Идентификатор  = Новый УникальныйИдентификатор;
	
	АдресХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Идентификатор); 

	ОбработатьФайлНаСервере(АдресХранилища); 
	
	ОткрытьФорму("Отчет.ЛБ_РезультатСверкиПоПеречням.Форма.ФормаОтчета", ЗаполнитьПараметрыОтчета(, Объект.ДатаПеречня), Этаформа);
КонецПроцедуры     


&НаСервере
Процедура УдалитьНаСервере(Идентификатор)
	Стр = ТаблицаОсновная.НайтиПоИдентификатору(Идентификатор);  
	НаборЗаписей = РегистрыСведений.ЛБ_ПереченьНежелательныхЛиц.СоздатьНаборЗаписей();     
    НаборЗаписей.Отбор.ВидПеречня.Установить(Объект.ВидПеречня);
    НаборЗаписей.Отбор.ДатаПеречня.Установить(Стр.ДатаПеречня);  

    НаборЗаписей.Записать();  
	
	НаборЗаписей = РегистрыСведений.ЛБ_ПереченьНежелательныхЛицДокументы.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.ВидПеречня.Установить(Объект.ВидПеречня);
    НаборЗаписей.Отбор.ДатаПеречня.Установить(Стр.ДатаПеречня);  

    НаборЗаписей.Записать();  
	
	НаборЗаписей = РегистрыСведений.ЛБ_ПереченьНежелательныхЛицДрНаименования.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.ВидПеречня.Установить(Объект.ВидПеречня);
    НаборЗаписей.Отбор.ДатаПеречня.Установить(Стр.ДатаПеречня);  

    НаборЗаписей.Записать(); 
	
	НаборЗаписей = РегистрыСведений.ЛБ_ПереченьНежелательныхЛицАдреса.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.ВидПеречня.Установить(Объект.ВидПеречня);
    НаборЗаписей.Отбор.ДатаПеречня.Установить(Стр.ДатаПеречня);  

    НаборЗаписей.Записать(); 	
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	МассивУдаляемыхСтрок = Элементы.ТаблицаОсновная.ВыделенныеСтроки; 
    КоличествоСтрок = МассивУдаляемыхСтрок.Количество();
	Если НЕ КоличествоСтрок = 0 Тогда   
		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросУдалить", ЭтотОбъект); 
	    ПоказатьВопрос(Оповещение, "Вы уверены что хотите удалить " + ?(КоличествоСтрок = 1, "выбранный перечень?", "выбранные перечени?"), РежимДиалогаВопрос.ДаНетОтмена, 0,,);
   	КонецЕсли;	
КонецПроцедуры   

&НаКлиенте
Процедура ПослеОтветаНаВопросУдалить(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда   
		МассивУдаляемыхСтрок = Элементы.ТаблицаОсновная.ВыделенныеСтроки;
		СЗ = Новый СписокЗначений;
		СЗ.ЗагрузитьЗначения(МассивУдаляемыхСтрок);
		СЗ.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
		Для Каждого Эл Из СЗ Цикл  
			УдалитьНаСервере(Эл.Значение);
		КонецЦикла; 
		ЗаполнитьОсновнуюТаблицу();
     КонецЕсли;
КонецПроцедуры
	
&НаКлиенте
Процедура ВидПеречняПриИзменении(Элемент) 
	ТаблицаОсновная.Очистить();
	ЗаполнитьОсновнуюТаблицу();
КонецПроцедуры

&НаКлиенте
Процедура ГлобальнаяПроверкаПоПеречням(Команда) 
	//Сообщить("Глобальная проверка по перечням занимает много времени. Придется подождать.", Статуссообщения.Информация);
	ДатаСверки = ТекущаяДата();
	
	Сообщить("Проверка клиентов начало " + Формат(ТекущаяДата(), "ДЛФ=DT"));
	ГлобальнаяПроверкаКлиентовНаСервере();  
	Сообщить("Проверка клиентов окончание " + Формат(ТекущаяДата(), "ДЛФ=DT"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДатаСверки", ДатаСверки);
	ПараметрыФормы.Вставить("ДатаНач", Объект.ДатаНач);
	ПараметрыФормы.Вставить("ДатаКон", ?(Объект.ДатаКон = Дата(1,1,1), ТекущаяДата(), Объект.ДатаКон));
	
	ОткрытьФорму("Отчет.ЛБ_РезультатГлобальнойПроверкиПоПеречням.Форма.ФормаОтчета", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры 

&НаСервере
Процедура ГлобальнаяПроверкаКлиентовНаСервере()
	Дата1 = Объект.ДатаНач; 
	Дата2 = ?(Объект.ДатаКон = Дата(1,1,1), ТекущаяДата(), КонецДня(Объект.ДатаКон));
	//+МАН 13.02.25 Перенес из общего модуля. После проеврок можно будет вернуться к общему модулю. 
	//ЛБ_УправлениеЛомбардом.ГлобальнаяПроверкаПоПеречням(Дата1, Дата2);	
	ГлобальнаяПроверкаПоПеречнямНаСервере(Дата1, Дата2);
	//-МАН
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуКлиентов(ДатаПеречня) 
	ЗапросК = Новый Запрос;
	ЗапросК.УстановитьПараметр("ВидПеречня", Объект.ВидПеречня); 
	ЗапросК.УстановитьПараметр("ДатаПеречня", ДатаПеречня);  	
	ЗапросК.Текст = "ВЫБРАТЬ
	                |	ЛБ_КлиентыВПеречнях.Залогодатель КАК Клиент,
	                |	ЛБ_КлиентыВПеречнях.СтатусКлиентаВПеречне КАК Статус,
	                |	ЛБ_КлиентыВПеречнях.ИД КАК ИД,
	                |	ЛБ_КлиентыВПеречнях.ДатаВключенияВПеречень КАК ДатаВключенияВПеречень
	                |ИЗ
	                |	РегистрСведений.ЛБ_КлиентыВПеречнях КАК ЛБ_КлиентыВПеречнях
	                |ГДЕ
	                |	ЛБ_КлиентыВПеречнях.ВидПеречня = &ВидПеречня
	                |	И ЛБ_КлиентыВПеречнях.ДатаПеречня = &ДатаПеречня
	                |	И ЛБ_КлиентыВПеречнях.ВидПроверки = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыПроверкиПеречней.ПроверкаПоПеречню)
	                |	И ЛБ_КлиентыВПеречнях.СтатусКлиентаВПеречне = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыКлиентаВПеречнях.Включен)";
	ТаблицаЗапроса = ЗапросК.Выполнить().Выгрузить();
	Объект.ТаблицаКлиентов.Загрузить(ТаблицаЗапроса);
КонецПроцедуры  

&НаКлиенте
Процедура ОтчетПоПроверкеПеречня(Команда)
	ТекСтрока = Элементы.ТаблицаОсновная.ТекущиеДанные;
	Если ТекСтрока = неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Объект.ВидПеречня) Тогда 
		Сообщить("Не выбран вид перечня!");
		Возврат;
	КонецЕсли;	
	
	ЗаполнитьТаблицуКлиентов(ТекСтрока.ДатаПеречня);
	
	ОткрытьФорму("Отчет.ЛБ_РезультатСверкиПоПеречням.Форма.ФормаОтчета", ЗаполнитьПараметрыОтчета(ТекСтрока.ДатаЗагрузкиПеречня, ТекСтрока.ДатаПеречня), Этаформа);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоГлобальнойПроверке(Команда)
	Если Объект.ДатаНач = Дата(1,1,1) И Объект.ДатаКон = Дата(1,1,1)  Тогда 
		Сообщить("Не выбраны даты проведения глобальных проверок перечней!");
		Возврат;
	КонецЕсли;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДатаНач", Объект.ДатаНач);
	ПараметрыФормы.Вставить("ДатаКон", ?(Объект.ДатаКон = Дата(1,1,1), ТекущаяДата(), Объект.ДатаКон));
	
	ОткрытьФорму("Отчет.ЛБ_РезультатГлобальнойПроверкиПоПеречням.Форма.ФормаОтчета", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

//+МАН 11.02.25 для получения информации по клиенту
&НаСервере
Функция ПолучитьДокумент(Залогодатель)
	Запрос = Новый Запрос;  
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателя.Владелец КАК Клиент,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателя.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник.ЛБ_ДокументыЗалогодателя КАК ЛБ_ДокументыЗалогодателя
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних КАК ЛБ_ДокументыЗалогодателейСрезПоследних
	               |		ПО (ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя = ЛБ_ДокументыЗалогодателя.Ссылка)
	               |ГДЕ
	               |	ЛБ_ДокументыЗалогодателя.ВидДокументаЗалогодателя = &ВидДокументаЗалогодателя
	               |	И ЛБ_ДокументыЗалогодателя.Владелец = &Залогодатель";
	Запрос.УстановитьПараметр("ВидДокументаЗалогодателя", Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	Возврат ТаблицаДокументов;
КонецФункции

//+МАН 13.02.25 Перенес из общего модуля ЛБ_УправлениеЛомбардом
&НаСервере
Процедура ГлобальнаяПроверкаПоПеречнямНаСервере(Дата1, Дата2)
	ДатаПроверки = ТекущаяДата();
	ВидыПеречней = Новый СписокЗначений;
	ВидыПеречней.Добавить(Перечисления.ЛБ_ВидыПеречней.МВК);
	ВидыПеречней.Добавить(Перечисления.ЛБ_ВидыПеречней.Террористы);
	ВидыПеречней.Добавить(Перечисления.ЛБ_ВидыПеречней.ФРОМУ); 
	ВидыПеречней.Добавить(Перечисления.ЛБ_ВидыПеречней.ООН);
	
	ЗапросП = Новый Запрос; 
	ЗапросП.УстановитьПараметр("ВидыПеречней", ВидыПеречней);
	ЗапросП.Текст = "ВЫБРАТЬ
	                |	ЛБ_ВидыПеречней.Ссылка КАК ВидПеречня
	                |ИЗ
	                |	Перечисление.ЛБ_ВидыПеречней КАК ЛБ_ВидыПеречней
	                |ГДЕ
	                |	ЛБ_ВидыПеречней.Ссылка В(&ВидыПеречней)";
	ТаблицаП = ЗапросП.Выполнить().Выгрузить();
	
	ЗапросП1 = Новый Запрос;
	ЗапросП1.УстановитьПараметр("Дата1", НачалоДня(Дата1));  
	ЗапросП1.УстановитьПараметр("Дата2", КонецДня(Дата2));
	ЗапросП1.Текст = "ВЫБРАТЬ
	                 |	ЛБ_ПереченьНежелательныхЛиц.ВидПеречня КАК ВидПеречня,
	                 |	ЛБ_ПереченьНежелательныхЛиц.ДатаПеречня КАК ДатаПеречня,
	                 |	ЛБ_ПереченьНежелательныхЛиц.ДатаВключенияВПеречень КАК ДатаВключенияВПеречень,
	                 |	ЛБ_ПереченьНежелательныхЛиц.ИД КАК ИД,
	                 |	ЛБ_ПереченьНежелательныхЛиц.Наименование КАК Наименование,
	                 |	ЛБ_ПереченьНежелательныхЛиц.НаименованиеЛат КАК НаименованиеЛат,
	                 |	ЛБ_ПереченьНежелательныхЛиц.ДатаРождения КАК ДатаРождения,
	                 |	ЛБ_ПереченьНежелательныхЛиц.ГодРождения КАК ГодРождения,
	                 |	ЛБ_ПереченьНежелательныхЛиц.ИНН КАК ИНН,
	                 |	ЛБ_ПереченьНежелательныхЛиц.ЮридическоеФизическоеЛицо КАК ЮридическоеФизическоеЛицо,
	                 |	ЛБ_ПереченьНежелательныхЛиц.Статус КАК Статус,
	                 |	ЛБ_ПереченьНежелательныхЛиц.РазмерФайла КАК РазмерФайла
	                 |ИЗ
	                 |	РегистрСведений.ЛБ_ПереченьНежелательныхЛиц КАК ЛБ_ПереченьНежелательныхЛиц
	                 |ГДЕ
	                 |	ЛБ_ПереченьНежелательныхЛиц.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыКлиентаВПеречнях.Включен)
	                 |	И ЛБ_ПереченьНежелательныхЛиц.Период МЕЖДУ &Дата1 И &Дата2
	                 |
	                 |УПОРЯДОЧИТЬ ПО
	                 |	ЛБ_ПереченьНежелательныхЛиц.Период";  
	ТаблицаПеречней = ЗапросП1.Выполнить().Выгрузить(); 
	ТаблицаПеречнейДаты = ТаблицаПеречней.Скопировать();
	ТаблицаПеречнейДаты.Свернуть("ВидПеречня, ДатаПеречня, РазмерФайла");
	
	ЗапросП2 = Новый Запрос;
	ЗапросП2.УстановитьПараметр("Дата1", Дата1);  
	ЗапросП2.УстановитьПараметр("Дата2", Дата2);
	ЗапросП2.Текст = "ВЫБРАТЬ
	                 |	ЛБ_ПереченьНежелательныхЛицДокументы.ВидПеречня КАК ВидПеречня,
	                 |	ЛБ_ПереченьНежелательныхЛицДокументы.ДатаПеречня КАК ДатаПеречня,
	                 |	ЛБ_ПереченьНежелательныхЛицДокументы.ИД КАК ИД,
	                 |	ЛБ_ПереченьНежелательныхЛицДокументы.ДокументНомер КАК ДокументНомер,
	                 |	ЛБ_ПереченьНежелательныхЛицДокументы.ДокументСерия КАК ДокументСерия
	                 |ИЗ
	                 |	РегистрСведений.ЛБ_ПереченьНежелательныхЛицДокументы КАК ЛБ_ПереченьНежелательныхЛицДокументы
	                 |ГДЕ
	                 |	ЛБ_ПереченьНежелательныхЛицДокументы.Период МЕЖДУ &Дата1 И &Дата2"; 
	ТаблицаПеречнейДокументы = ЗапросП2.Выполнить().Выгрузить();
	  
	ЗапросП3 = Новый Запрос;  
	ЗапросП3.УстановитьПараметр("Дата1", Дата1);  
	ЗапросП3.УстановитьПараметр("Дата2", Дата2);
	ЗапросП3.Текст = "ВЫБРАТЬ
	                 |	ЛБ_ПереченьНежелательныхЛицДрНаименования.ВидПеречня КАК ВидПеречня,
	                 |	ЛБ_ПереченьНежелательныхЛицДрНаименования.ДатаПеречня КАК ДатаПеречня,
	                 |	ЛБ_ПереченьНежелательныхЛицДрНаименования.ИД КАК ИД,
	                 |	ЛБ_ПереченьНежелательныхЛицДрНаименования.Наименование КАК Наименование,
	                 |	ЛБ_ПереченьНежелательныхЛицДрНаименования.ДатаРождения КАК ДатаРождения,
	                 |	ЛБ_ПереченьНежелательныхЛицДрНаименования.ГодРождения КАК ГодРождения
	                 |ИЗ
	                 |	РегистрСведений.ЛБ_ПереченьНежелательныхЛицДрНаименования КАК ЛБ_ПереченьНежелательныхЛицДрНаименования
	                 |ГДЕ
	                 |	ЛБ_ПереченьНежелательныхЛицДрНаименования.Период МЕЖДУ &Дата1 И &Дата2";  
	ТаблицаПеречнейДрНаименования = ЗапросП3.Выполнить().Выгрузить();	
		
    Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("ВидДокументаЗалогодателя", Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателя.Владелец КАК Клиент,
	               |	ЛБ_ДокументыЗалогодателей.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателей.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателя.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник.ЛБ_ДокументыЗалогодателя КАК ЛБ_ДокументыЗалогодателя
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ДокументыЗалогодателей КАК ЛБ_ДокументыЗалогодателей
	               |		ПО (ЛБ_ДокументыЗалогодателей.ДокументЗалогодателя = ЛБ_ДокументыЗалогодателя.Ссылка)
	               |ГДЕ
	               |	ЛБ_ДокументыЗалогодателя.ВидДокументаЗалогодателя = &ВидДокументаЗалогодателя";
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	
	СписокКлиентов = ЛБ_УправлениеЛомбардом.ЗаполнитьСписокКлиентовДляГлобальнойПроверкиПоПеречням(Дата1, Дата2);
	Запрос.УстановитьПараметр("СписокКлиентов", СписокКлиентов);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_Залогодатели.Ссылка КАК Клиент,
	               |	ЛБ_Залогодатели.Наименование КАК Наименование,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
	               |	ЛБ_АнкетаЗалогодателяСрезПоследних.ИНН КАК ИНН,
	               |	ЛБ_АнкетаЗалогодателяСрезПоследних.ТипФизЛица КАК ЮридическоеФизическоеЛицо,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия_А КАК Фамилия_А,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя_А КАК Имя_А,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество_А КАК Отчество_А
	               |ИЗ
	               |	Справочник.ЛБ_Залогодатели КАК ЛБ_Залогодатели
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних
	               |		ПО (ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Залогодатель = ЛБ_Залогодатели.Ссылка)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_АнкетаЗалогодателя.СрезПоследних КАК ЛБ_АнкетаЗалогодателяСрезПоследних
	               |		ПО (ЛБ_АнкетаЗалогодателяСрезПоследних.Залогодатель = ЛБ_Залогодатели.Ссылка)
	               |ГДЕ
	               |	ЛБ_Залогодатели.ПометкаУдаления = ЛОЖЬ
	               |	И ЛБ_Залогодатели.Ссылка В(&СписокКлиентов)
	               |АВТОУПОРЯДОЧИВАНИЕ";
	ТаблицаК = Запрос.Выполнить().Выгрузить(); 
		
	Для каждого СтрП Из ТаблицаП Цикл 						
		ОтборП = Новый Структура;
		ОтборП.Вставить("ВидПеречня", СтрП.ВидПеречня);  
		СтрокиПеречня = ТаблицаПеречнейДаты.НайтиСтроки(ОтборП);
		
		Для каждого стр Из СтрокиПеречня Цикл 
			Рег = РегистрыСведений.ЛБ_ДатыЗагрузкиПеречней;
			НаборЗаписей = Рег.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ВидПеречня.Установить(Стр.ВидПеречня); 
			НаборЗаписей.Отбор.ДатаПеречня.Установить(Стр.ДатаПеречня);
			НаборЗаписей.Отбор.Период.Установить(ДатаПроверки);
			НоваяЗапись = НаборЗаписей.Добавить(); 
			НоваяЗапись.Период = ДатаПроверки; 
			НоваяЗапись.ВидПроверки = Перечисления.ЛБ_ВидыПроверкиПеречней.ГлобальнаяПроверка;
			НоваяЗапись.ВидПеречня = Стр.ВидПеречня; 
		    НоваяЗапись.ДатаПеречня = Стр.ДатаПеречня; 
			НоваяЗапись.РазмерФайла = Стр.РазмерФайла;
			НоваяЗапись.Ответственный = Пользователи.ТекущийПользователь();
		    НаборЗаписей.Записать(Истина);
			
			Для каждого Выборка из ТаблицаК Цикл   
				Клиент = Выборка.Клиент; 
				Наименование = СокрЛП(Выборка.Фамилия) + ?(ПустаяСтрока(Выборка.Имя), "", " " + СокрЛП(Выборка.Имя)) + ?(ПустаяСтрока(Выборка.Отчество), "", " " + СокрЛП(Выборка.Отчество));
				Наименование = ВРег(Наименование);
				НаименованиеЛат = СокрЛП(Выборка.Фамилия_А) + ?(ПустаяСтрока(Выборка.Имя_А), "", " " + СокрЛП(Выборка.Имя_А)) + ?(ПустаяСтрока(Выборка.Отчество_А), "", " " + СокрЛП(Выборка.Отчество_А));
				НаименованиеЛат = ВРег(НаименованиеЛат);
				// ++ Сербаев 25.07.2023
				//ДатаРождения = ?(ДатаРождения = null, Дата(1,1,1), Выборка.ДатаРождения);
				ДатаРождения = ?(Выборка.ДатаРождения = null, Дата(1,1,1), Выборка.ДатаРождения);
				// -- Сербаев 25.07.2023
				ГодРождения = Год(ДатаРождения);
				ЮридическоеФизическоеЛицо = Выборка.ЮридическоеФизическоеЛицо; 
				ИНН = СокрЛП(Выборка.ИНН);

				ЕстьСовпадение = ложь;
				Отбор = Новый Структура; 
				Отбор.Вставить("ВидПеречня", Стр.ВидПеречня);
				Отбор.Вставить("ДатаПеречня", Стр.ДатаПеречня);
				Отбор.Вставить("Наименование", Наименование);
				Отбор.Вставить("ЮридическоеФизическоеЛицо", ЮридическоеФизическоеЛицо);   
				СтрокиК = ТаблицаПеречней.НайтиСтроки(Отбор);
				Если НЕ СтрокиК.Количество() = 0 Тогда 
					Для каждого СтрК Из СтрокиК Цикл  
						Если НЕ СтрК.ДатаРождения = Дата(1,1,1) Тогда 
							Если СтрК.ДатаРождения = ДатаРождения Тогда
								ЗаписатьВПереченьГлобальнаяПроверка(Клиент, СтрП.ВидПеречня, СтрК.ДатаПеречня, СтрК.Ид, СтрК.ДатаВключенияВПеречень, ДатаПроверки);
								ЕстьСовпадение = Истина;  
								Прервать;
							КонецЕсли;	 
						ИначеЕсли НЕ СтрК.ГодРождения = 0 Тогда 
							Если СтрК.ГодРождения = ГодРождения Тогда
								ЗаписатьВПереченьГлобальнаяПроверка(Клиент, СтрП.ВидПеречня, СтрК.ДатаПеречня, СтрК.Ид, СтрК.ДатаВключенияВПеречень, ДатаПроверки);
								ЕстьСовпадение = Истина;  
								Прервать;
							КонецЕсли;	
						КонецЕсли;
						Если НЕ ПустаяСтрока(ИНН) Тогда 
							Если СтрК.ИНН = ИНН Тогда
							    ЗаписатьВПереченьГлобальнаяПроверка(Клиент, СтрП.ВидПеречня, СтрК.ДатаПеречня, СтрК.Ид, СтрК.ДатаВключенияВПеречень, ДатаПроверки);
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;			
						КонецЕсли;
					КонецЦикла;	
				КонецЕсли; 	
				Если ЕстьСовпадение Тогда
					Продолжить;
				КонецЕсли;  
								
				Отбор = Новый Структура;  
				Отбор.Вставить("ВидПеречня", Стр.ВидПеречня);
				Отбор.Вставить("ДатаПеречня", Стр.ДатаПеречня);
				Отбор.Вставить("Наименование", Наименование);
				СтрокиК = ТаблицаПеречнейДрНаименования.НайтиСтроки(Отбор);
				Если НЕ СтрокиК.Количество() = 0 Тогда 
					Для каждого СтрК Из СтрокиК Цикл  
						ОтборИД = Новый Структура;
						ОтборИД.Вставить("ИД", СтрК.ИД);
						СтрокиИД = ТаблицаПеречней.НайтиСтроки(ОтборИД);
						Если НЕ СтрокиИД.Количество() = 0 Тогда  
							СтрИД = СтрокиИД.Получить(0);
							Если НЕ СтрК.ДатаРождения = Дата(1,1,1) Тогда 
								Если СтрК.ДатаРождения = ДатаРождения Тогда  
									ЗаписатьВПереченьГлобальнаяПроверка(Клиент, СтрП.ВидПеречня, СтрИД.ДатаПеречня, СтрИД.Ид, СтрИД.ДатаВключенияВПеречень, ДатаПроверки);
								    ЕстьСовпадение = Истина; 								
									Прервать;
								КонецЕсли;	 
							ИначеЕсли НЕ ГодРождения = 0 Тогда 
								Если СтрК.ГодРождения = ГодРождения Тогда
									ЗаписатьВПереченьГлобальнаяПроверка(Клиент, СтрП.ВидПеречня, СтрИД.ДатаПеречня, СтрИД.Ид, СтрИД.ДатаВключенияВПеречень, ДатаПроверки);
									ЕстьСовпадение = Истина;  
									Прервать;
								КонецЕсли;		
							КонецЕсли; 
							//Если НЕ ПустаяСтрока(ИНН) Тогда 
							//	Если СтрИД.ИНН = ИНН Тогда
							//	    ЗаписатьВПереченьГлобальнаяПроверка(Клиент, СтрП.ВидПеречня, СтрИД.ДатаПеречня, СтрИД.Ид, СтрИД.ДатаВключенияВПеречень, ДатаПроверки);
							//		ЕстьСовпадение = Истина;
							//		Прервать;
							//	КонецЕсли;			
							//КонецЕсли;
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли;  
				Если ЕстьСовпадение Тогда
					Продолжить;
				КонецЕсли;  
				
				Если НЕ Пустаястрока(НаименованиеЛат) Тогда
		        	Отбор = Новый Структура;
					Отбор.Вставить("ВидПеречня", Стр.ВидПеречня);
				    Отбор.Вставить("ДатаПеречня", Стр.ДатаПеречня);
					Отбор.Вставить("НаименованиеЛат", НаименованиеЛат); 
					Отбор.Вставить("ЮридическоеФизическоеЛицо", ЮридическоеФизическоеЛицо);
					СтрокиК = ТаблицаПеречней.НайтиСтроки(Отбор);
					Если НЕ СтрокиК.Количество() = 0 Тогда 
						Для каждого СтрК Из СтрокиК Цикл  
							Если НЕ СтрК.ДатаРождения = Дата(1,1,1) Тогда 
								Если СтрК.ДатаРождения = ДатаРождения Тогда
								    ЗаписатьВПереченьГлобальнаяПроверка(Клиент, СтрП.ВидПеречня, СтрК.ДатаПеречня, СтрК.Ид, СтрК.ДатаВключенияВПеречень, ДатаПроверки);
									ЕстьСовпадение = Истина;
									Прервать;
								КонецЕсли;	
							ИначеЕсли НЕ СтрК.ГодРождения = 0 Тогда 
								Если СтрК.ГодРождения = ГодРождения Тогда
									ЗаписатьВПереченьГлобальнаяПроверка(Клиент, СтрП.ВидПеречня, СтрК.ДатаПеречня, СтрК.Ид, СтрК.ДатаВключенияВПеречень, ДатаПроверки);
									ЕстьСовпадение = Истина;  
									Прервать;
								КонецЕсли;			
							КонецЕсли;	
							Если НЕ ПустаяСтрока(ИНН) Тогда 
								Если СтрК.ИНН = ИНН Тогда
								    ЗаписатьВПереченьГлобальнаяПроверка(Клиент, СтрП.ВидПеречня, СтрК.ДатаПеречня, СтрК.Ид, СтрК.ДатаВключенияВПеречень, ДатаПроверки);
									ЕстьСовпадение = Истина;
									Прервать;
								КонецЕсли;			
							КонецЕсли;
						КонецЦикла;	
					КонецЕсли;  
		            Если ЕстьСовпадение Тогда
						Продолжить;
					КонецЕсли;  
				
					Отбор = Новый Структура;  
					Отбор.Вставить("ВидПеречня", Стр.ВидПеречня);
				    Отбор.Вставить("ДатаПеречня", Стр.ДатаПеречня);
					Отбор.Вставить("Наименование", НаименованиеЛат); 
					СтрокиК = ТаблицаПеречнейДрНаименования.НайтиСтроки(Отбор);
					Если НЕ СтрокиК.Количество() = 0 Тогда 
						Для каждого СтрК Из СтрокиК Цикл  
							ОтборИД = Новый Структура; 
							ОтборИД.Вставить("ИД", СтрК.ИД);
							СтрокиИД = ТаблицаПеречней.НайтиСтроки(ОтборИД);
							Если НЕ СтрокиИД.Количество() = 0 Тогда  
								СтрИД = СтрокиИД.Получить(0);
								Если НЕ СтрК.ДатаРождения = Дата(1,1,1) Тогда 
									Если СтрК.ДатаРождения = ДатаРождения Тогда
									    ЗаписатьВПереченьГлобальнаяПроверка(Клиент, СтрП.ВидПеречня, СтрИД.ДатаПеречня, СтрИД.Ид, СтрИД.ДатаВключенияВПеречень, ДатаПроверки);
										ЕстьСовпадение = Истина;
										Прервать;
									КонецЕсли;	 
								ИначеЕсли НЕ ГодРождения = 0 Тогда 
									Если СтрК.ГодРождения = ГодРождения Тогда
										ЗаписатьВПереченьГлобальнаяПроверка(Клиент, СтрП.ВидПеречня, СтрИД.ДатаПеречня, СтрИД.Ид, СтрИД.ДатаВключенияВПеречень, ДатаПроверки);
										ЕстьСовпадение = Истина;  
										Прервать;
									КонецЕсли;			
								КонецЕсли; 
								//Если НЕ ПустаяСтрока(ИНН) Тогда 
								//	Если СтрИД.ИНН = ИНН Тогда
								//	    ЗаписатьВПереченьГлобальнаяПроверка(Клиент, СтрП.ВидПеречня, СтрИД.ДатаПеречня, СтрИД.Ид, СтрИД.ДатаВключенияВПеречень, ДатаПроверки);
								//		ЕстьСовпадение = Истина;
								//		Прервать;
								//	КонецЕсли;			
								//КонецЕсли;
							КонецЕсли;	
						КонецЦикла;	
					КонецЕсли;  
		            Если ЕстьСовпадение Тогда
						Продолжить;
					КонецЕсли; 
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(ИНН) Тогда 
					Отбор = Новый Структура; 
					Отбор.Вставить("ВидПеречня", Стр.ВидПеречня);
				    Отбор.Вставить("ДатаПеречня", Стр.ДатаПеречня);
					Отбор.Вставить("ИНН", ИНН); 
					Если СтрП.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ЦБ Тогда
					    Отбор.Вставить("ДатаРождения", ДатаРождения); 
					КонецЕсли;	
					СтрокиК = ТаблицаПеречней.НайтиСтроки(Отбор); 
					Если НЕ СтрокиК.Количество() = 0 Тогда
						СтрИД = СтрокиК.Получить(0);  
						ЗаписатьВПереченьГлобальнаяПроверка(Клиент, СтрП.ВидПеречня, СтрИД.ДатаПеречня, СтрИД.Ид, СтрИД.ДатаВключенияВПеречень, ДатаПроверки);
						ЕстьСовпадение = Истина;
					КонецЕсли;	
				КонецЕсли; 
				Если ЕстьСовпадение Тогда
					Продолжить;
				КонецЕсли; 

				
				ОтборДок = Новый Структура;
				ОтборДок.Вставить("Клиент", Выборка.Клиент); 
				//+МАН 13.02.25 Закомментировал и сделал через функцию
				//СтрокиДок = ТаблицаДокументов.НайтиСтроки(ОтборДок); 
				СтрокиДок = ПолучитьДокумент(Выборка.Клиент);
				//-МАН
				Для каждого СтрДок Из СтрокиДок Цикл 
					ОтборК = Новый Структура;  
					ОтборК.Вставить("ВидПеречня", Стр.ВидПеречня);
				    ОтборК.Вставить("ДатаПеречня", Стр.ДатаПеречня);
					ОтборК.Вставить("ДокументНомер", СокрЛП(СтрДок.ДокументНомер)); 
					ОтборК.Вставить("ДокументСерия", СокрЛП(СтрДок.ДокументСерия));
					СтрокиК = ТаблицаПеречнейДокументы.НайтиСтроки(ОтборК); 
					Если НЕ СтрокиК.Количество() = 0 Тогда 
						Для каждого СтрК Из СтрокиК Цикл  
							ОтборИД = Новый Структура; 
							ОтборИД.Вставить("ИД", СтрК.ИД);
							СтрокиИД = ТаблицаПеречней.НайтиСтроки(ОтборИД);
							Если НЕ СтрокиИД.Количество() = 0 Тогда    
								СтрИД = СтрокиИД.Получить(0); 
								ЗаписатьВПереченьГлобальнаяПроверка(Клиент, СтрП.ВидПеречня, СтрИД.ДатаПеречня, СтрИД.Ид, СтрИД.ДатаВключенияВПеречень, ДатаПроверки);
								ЕстьСовпадение = Истина; 	
							КонецЕсли;	
						КонецЦикла;	
					КонецЕсли;  
	                Если ЕстьСовпадение Тогда
						Прервать;
					КонецЕсли; 
	  			КонецЦикла;		
			КонецЦикла;
		КонецЦикла;	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьВПереченьГлобальнаяПроверка(Клиент, ВидПеречня, ДатаПеречня, Ид, ДатаВключенияВПеречень, ДатаПроверки) 
	
	Рег = РегистрыСведений.ЛБ_КлиентыВПеречнях;
	НаборЗаписей = Рег.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Залогодатель.Установить(Клиент); 
	НаборЗаписей.Отбор.ВидПеречня.Установить(ВидПеречня); 
	НаборЗаписей.Отбор.ДатаПеречня.Установить(ДатаПеречня);
	НаборЗаписей.Отбор.ВидПроверки.Установить(Перечисления.ЛБ_ВидыПроверкиПеречней.ГлобальнаяПроверка);
	
	НоваяЗапись = НаборЗаписей.Добавить();   
	НоваяЗапись.Период = ДатаПроверки;   
	НоваяЗапись.ВидПроверки = Перечисления.ЛБ_ВидыПроверкиПеречней.ГлобальнаяПроверка;
	НоваяЗапись.ВидПеречня = ВидПеречня; 
    НоваяЗапись.ДатаПеречня = ДатаПеречня;
	НоваяЗапись.Залогодатель = Клиент;  
	НоваяЗапись.ИД = ИД;
	НоваяЗапись.ДатаВключенияВПеречень = ДатаВключенияВПеречень;
	НоваяЗапись.СтатусКлиентаВПеречне = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен;
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	Если НЕ ТекПользователь.ЭтоЛомбард Тогда
   		Ответственный = ТекПользователь;
	Иначе
		Ответственный = ПараметрыСеанса.ТекущийСотрудник;
	КонецЕсли;	
	НоваяЗапись.Ответственный = Ответственный;

	
	НаборЗаписей.Записать(Истина);

КонецПроцедуры	 

&НаСервере
Функция ЭтоРусскаяБуква(Символ)
   Возврат Найти("АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЫЬЪЭЮЯ", ВРег(Символ))<>0;
КонецФункции
//-МАН
 





