
//Перем мПериод          Экспорт; // Период движений
//Перем мТаблицаДвижений Экспорт; // Таблица движений

//////////////////////////////////////////////////////////////////////////////////
//// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

//// Выполняет приход по регистру.
////
//// Параметры:
////  Нет.
////
//Процедура ВыполнитьПриход() Экспорт

//	ЮС_ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Приход);

//КонецПроцедуры // ВыполнитьПриход()

//// Выполняет расход по регистру.
////
//// Параметры:
////  Нет.
////
//Процедура ВыполнитьРасход() Экспорт

//	ЮС_ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Расход);

//КонецПроцедуры // ВыполнитьРасход()

//// Выполняет движения по регистру.
////
//// Параметры:
////  Нет.
////
//Процедура ВыполнитьДвижения() Экспорт

//	ЮС_ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект);

//КонецПроцедуры // ВыполнитьДвижения()


//// Выводит сообщение об ошибке и выставляет параметр Отказ в "Истина". 
//// В случае работы на клиенте или на сервере выводит в окно сообщений,
//// в случае внешнего соединения вызывает исключение.
////
//// Параметры:
////  ТекстСообщения - Строка - Текст сообщения
////  Отказ          - Булево - Признак отказа (необязательный)
////  Статус         - Статус сообщения
//// 
//Процедура СообщитьОбОшибке(ТекстСообщения, Отказ = Ложь, Заголовок = "", Статус = Неопределено) Экспорт

//	Если Статус = Неопределено Тогда
//		
//		Статус = СтатусСообщения.Важное;
//		
//	КонецЕсли;
//	
//	НачалоСлужебногоСообщения    = Найти(ТекстСообщения, "{");
//	ОкончаниеСлужебногоСообщения = Найти(ТекстСообщения, "}:");
//	
//	Если ОкончаниеСлужебногоСообщения > 0 И НачалоСлужебногоСообщения > 0 Тогда
//		
//		ТекстСообщения = Лев(ТекстСообщения, (НачалоСлужебногоСообщения - 1)) +
//		                 Сред(ТекстСообщения, (ОкончаниеСлужебногоСообщения + 2));
//		
//	КонецЕсли;
//	
//	Отказ = Истина;
//	
//	#Если ВнешнееСоединение Тогда
//		
//	Если ЗначениеЗаполнено(Заголовок) Тогда
//		
//		ТекстСообщения = Заголовок + Символы.ПС + ТекстСообщения;
//		Заголовок = "";
//		
//	КонецЕсли;
//	
//	ВызватьИсключение (ТекстСообщения);
//		
//	#Иначе
//		
//	Если ЗначениеЗаполнено(Заголовок) Тогда
//		
//		Сообщить(Заголовок);
//		Заголовок = "";
//		
//	КонецЕсли;
//	
//	Сообщить(ТекстСообщения, Статус);
//		
//	#КонецЕсли

//КонецПроцедуры // СообщитьОбОшибке()
