
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДатаКон = ТекущаяДатаСеанса();
	ДатаНач = ПолучитьДатуНачалаРеестров();  
	
	РеестрыПлатежей.Параметры.УстановитьЗначениеПараметра("Дата1", ?(ДатаНач = Дата(1,1,1), ДатаНач, НачалоДня(ДатаНач)));
	РеестрыПлатежей.Параметры.УстановитьЗначениеПараметра("Дата2", ?(ДатаКон = Дата(1,1,1), ТекущаяДатаСеанса(), КонецДня(ДатаКон)));
	
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
    Если НЕ ТекПользователь.ЭтоЛомбард Тогда
		Если УправлениеДоступом.ЕстьРоль("ЛБ_СотрудникЦО") Тогда
			СотрудникЦО = Истина;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры   

&НаСервере
Функция ПолучитьДатуНачалаРеестров() 
	Запрос = Новый Запрос;  
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЛБ_РеестрПлатежей.Дата КАК ДатаНачала
	               |ИЗ
	               |	Документ.ЛБ_РеестрПлатежей КАК ЛБ_РеестрПлатежей";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДатаНачала;
	КонецЕсли;
	Возврат ТекущаяДатаСеанса();
КонецФункции	

&НаСервере
Функция  ПолучитьДатуСеанса() 
	Возврат ТекущаяДатаСеанса();
КонецФункции

&НаКлиенте
Процедура УстановитьИнтервал(Команда)
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
    Диалог.Период = Новый СтандартныйПериод(ДатаНач, ПолучитьДатуСеанса());
	Оповещение = Новый ОписаниеОповещения("ВыборПериодаЗавершение", ЭтаФорма);
	Диалог.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериодаЗавершение(Период, ДополнительныеПараметры) Экспорт 
	Если Период = неопределено Тогда
		Возврат;
	КонецЕсли;	
	ДатаНач = Период.ДатаНачала;
    ДатаКон = Период.ДатаОкончания;
	Если НЕ ДатаКон = Дата(1,1,1) И НЕ ДатаНач = Дата(1,1,1) Тогда
		Если  ДатаКон < ДатаНач Тогда
			Предупреждение("Конечная дата выбранного периода не может быть больше начальной даты периода.", 60);
			Возврат;
		КонецЕсли;
	КонецЕсли;	  
	РеестрыПлатежей.Параметры.УстановитьЗначениеПараметра("Дата1", ?(ДатаНач = Дата(1,1,1), ДатаНач, НачалоДня(ДатаНач))); 
	РеестрыПлатежей.Параметры.УстановитьЗначениеПараметра("Дата2", ?(ДатаКон = Дата(1,1,1), ПолучитьДатуСеанса(), КонецДня(ДатаКон)));
	Элементы.РеестрыПлатежей.Обновить(); 
	ТекСтрока = Элементы.РеестрыПлатежей.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда  
		ЗаполнитьРасшифровку(ТекСтрока.РеестрПлатежей); 
	Иначе
		РасшифровкаРеестра.Очистить();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗБ(НомерЗБ)  
	Если НЕ ПустаяСтрока(НомерЗБ) Тогда
	    Возврат ЛБ_Общиймодуль.ПолучитьЗБПоНомеру(НомерЗБ);  
	КонецЕсли;
	Возврат Документы.ЛБ_ОперацияПоЗалогу.ПустаяСсылка();
КонецФункции

&НаСервере
Функция СоздатьРеестрПлатежей(ВидОперации) 
	ДокОбъект = Документы.ЛБ_РеестрПлатежей.СоздатьДокумент();
	ДокОбъект.ВидОперации = ВидОперации;
	ДокОбъект.Дата = ТекущаяДатаСеанса(); 
	СтруктураФайла = Новый Файл(ФайлЗагрузки);
	ДокОбъект.ИмяФайла = СокрЛП(СтруктураФайла.ИмяБезРасширения);
	Поз = Найти(ДокОбъект.ИмяФайла, " ");
	Если НЕ Поз = 0 Тогда
	    ДокОбъект.НомерРеестра = Лев(ДокОбъект.ИмяФайла, Поз-1);
    Иначе
	    ДокОбъект.НомерРеестра = ДокОбъект.ИмяФайла;
	КонецЕсли;	
    ДокОбъект.Ответственный = Пользователи.ТекущийПользователь();
	
	ПроверкаДатыПлатежа = Истина;
	Если ДокОбъект.ВидОперации = Перечисления.ЛБ_ВидыБезналичныхПлатежей.ЛичныйКабинет Тогда   
		Для каждого Стр Из ПлатежиДляЗагрузки Цикл 
			Если Стр.ДатаПлатежа > ДокОбъект.Дата Тогда
				ПроверкаДатыПлатежа = Ложь; 
				ОбщегоНазначения.СообщитьПользователю("Ошибка данных файла загрузки. В строке (" + СокрЛП(Стр.ИдентификаторПлатежа) + ") дата платежа больше даты загрузки реестра!");
				Прервать;
			КонецЕсли;	
			НоваяСтр = ДокОбъект.ПлатежиЛК.Добавить(); 
			НоваяСтр.ДатаПлатежа = Стр.ДатаПлатежа;
			НоваяСтр.ИдентификаторПлатежа = Стр.ИдентификаторПлатежа;
			НоваяСтр.НомерЗБ = Стр.НомерЗБ;
			НоваяСтр.ЗалоговыйБилет = ПолучитьЗБ(НоваяСтр.НомерЗБ); 
			НоваяСтр.СуммаПлатежа = Стр.СуммаПлатежа;  
			//+МАН 25.04.25 Добавлен новый реквизит. Заявка 3043
			НоваяСтр.СпособПлатежа = Стр.СпособПлатежа;
			//-МАН
		Конеццикла;	
	ИначеЕсли ДокОбъект.ВидОперации = Перечисления.ЛБ_ВидыБезналичныхПлатежей.РасчетыйСчет Тогда   
		Для каждого Стр Из ПлатежиДляЗагрузки Цикл   
			Если Стр.ДатаПлатежа > ДокОбъект.Дата Тогда
				ПроверкаДатыПлатежа = Ложь;
				ОбщегоНазначения.СообщитьПользователю("Ошибка данных файла загрузки. В строке (№ п.п " + СокрЛП(Стр.ИдентификаторПлатежа) + ") дата платежа больше даты загрузки реестра!");
				Прервать;
			КонецЕсли;	
			НоваяСтр = ДокОбъект.ПлатежиБН.Добавить(); 
			НоваяСтр.ДатаПлатежа = Стр.ДатаПлатежа;
			НоваяСтр.НомерПП = Стр.ИдентификаторПлатежа;
			НоваяСтр.НомерЗБ = Стр.НомерЗБ;
			НоваяСтр.ЗалоговыйБилет = ПолучитьЗБ(НоваяСтр.НомерЗБ); 
			НоваяСтр.СуммаПлатежа = Стр.СуммаПлатежа; 
			НоваяСтр.ФИОЗаемщика = Стр.ФИОЗаемщика;
			НоваяСтр.ФИОПлательщика = Стр.ФИОПлательщика;  
		Конеццикла;	
	КонецЕсли;
	
	Если НЕ ПроверкаДатыПлатежа Тогда  		
		Возврат Ложь;
	КонецЕсли;	

	ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	Попытка  
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение); 
		Возврат Истина;
	Исключение       
		Возврат Ложь;
	КонецПопытки;		

КонецФункции	

&НаКлиенте
Функция ЗагрузитьРеестрПлатежей(ВидОперации)
	
	Попытка
		Эксель = Новый COMОбъект("Excel.Application");
		Эксель.Visible = 0;
		Эксель.DisplayAlerts = 0;
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось прочитать файл по причине: " + ОписаниеОшибки();
		Сообщение.Сообщить();
	    Возврат Ложь;
	КонецПопытки;
	
	Книга = Эксель.Workbooks.Open(ФайлЗагрузки);
	КоличествоЛистов = Книга.Sheets.Count;
	
	Лист = Книга.Sheets(1);
	КоличествоСтрок = Лист.Cells(1,1).SpecialCells(11).Row;
	КоличествоКолонок = Лист.Cells(1,1).SpecialCells(11).Column;
		
	ВсеОК = Истина;   
	ПлатежиДляЗагрузки.Очистить();  
	Шаг = Цел(100/КоличествоСтрок);
	Процесс = 0;
	Попытка
		Если ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыБезналичныхПлатежей.ЛичныйКабинет") Тогда
						
			Для НомерСтроки = 1 По КоличествоСтрок Цикл	
				Процесс = Процесс + Шаг;
				Состояние("Внимание!", Процесс, "Загрузка может занять некоторое время", БиблиотекаКартинок.ДлительнаяОперация48);
				Если НомерСтроки = 1 Тогда
					Продолжить;			
				КонецЕсли; 
				Если НЕ ЗначениеЗаполнено(Лист.Cells(НомерСтроки, 3).Value) Тогда
					Продолжить;
				КонецЕсли;
				Если НЕ СокрЛП(Лист.Cells(НомерСтроки, 4).Value) = "Оплачен" тогда
				    Продолжить;			
				КонецЕсли;        
				ДатаПлатежа = Дата(Лист.Cells(НомерСтроки, 2).Value); 
				ИдентификаторПлатежа = Лист.Cells(НомерСтроки, 3).Value;    
				
				СтрокаПлатежи = Лист.Cells(НомерСтроки, 8).Value;
				//+МАН 25.04.25 Добавлен новый реквизит. Заявка 3043
				СпособПлатежа = Лист.Cells(НомерСтроки, 9).Value;
				//-МАН
				МассивРезультат = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаПлатежи,",");   
				
				Для каждого Строка из МассивРезультат Цикл 
					СтрокаП = сокрЛП(Строка);
					Поз = Найти(СтрокаП, "-ЛК:"); 
					НомерЗБ = Сред(СтрокаП, 1, Поз-1);
					СтрокаСумма = Сред(СтрокаП, Поз+4); 
					
					СтрокаТаблицы = ПлатежиДляЗагрузки.Добавить();
					СтрокаТаблицы.ДатаПлатежа = ДатаПлатежа;
					СтрокаТаблицы.ИдентификаторПлатежа = ИдентификаторПлатежа;
					СтрокаТаблицы.НомерЗБ = НомерЗБ; 
					СтрокаТаблицы.СуммаПлатежа = Число(СтрокаСумма);
					//+МАН 25.04.25 Добавлен новый реквизит. Заявка 3043
					СтрокаТаблицы.СпособПлатежа = СпособПлатежа;
					//-МАН
				Конеццикла;	
			КонецЦикла;  
		ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыБезналичныхПлатежей.РасчетыйСчет") Тогда
					
			Для НомерСтроки = 1 По КоличествоСтрок Цикл
				Процесс = Процесс + Шаг;
				Состояние("Внимание!", Процесс, "Загрузка может занять некоторое время", БиблиотекаКартинок.ДлительнаяОперация48);
				Если НомерСтроки = 1 Тогда
					Продолжить;			
				КонецЕсли;    
				Если НЕ ЗначениеЗаполнено(Лист.Cells(НомерСтроки, 1).Value) Тогда
					Продолжить;
				КонецЕсли;	
								
				СтрокаТаблицы = ПлатежиДляЗагрузки.Добавить();
				СтрокаТаблицы.ИдентификаторПлатежа = Формат(Лист.Cells(НомерСтроки, 1).Value, "ЧГ=0"); 
				СтрокаТаблицы.ДатаПлатежа = Дата(Лист.Cells(НомерСтроки, 2).Value);;
				СтрокаТаблицы.СуммаПлатежа = Число(Лист.Cells(НомерСтроки, 3).Value); 
				НомерЗБ = Формат(Лист.Cells(НомерСтроки, 4).Value, "ЧГ=0");
				Поз = Найти(НомерЗБ, "-ЛК"); 
				Если Поз > 0 Тогда
				    НомерЗБ = Сред(НомерЗБ, 1, Поз-1); 
				Иначе
					НомерЗБ = СокрЛП(НомерЗБ);
				КонецЕсли;	
				СтрокаТаблицы.НомерЗБ = НомерЗБ; 
				СтрокаТаблицы.ФИОЗаемщика = Лист.Cells(НомерСтроки, 5).Value;
				СтрокаТаблицы.ФИОПлательщика = Лист.Cells(НомерСтроки, 6).Value;
			КонецЦикла;  
		КонецЕсли;
		
	Исключение
		Сообщить("Проверьте соответствие файла выбранной операции или обратитесь к разработчикам.", СтатусСообщения.Внимание);  
		ВсеОК = Ложь;
	КонецПопытки;
	
	Эксель.Workbooks.Close();
	Эксель.Quit();
	
	Возврат ВсеОК;
КонецФункции

&НаКлиенте
Процедура ЗагрузитьБН(Команда)
	Если ПустаяСтрока(ФайлЗагрузки) Тогда
		Предупреждение("Не выбран файл для загрузки платежей с расчетных счетов.", 60);
		Возврат;
	КонецЕсли;
	
	СписокВыбора = Новый СписокЗначений; 

	СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ЛБ_ВидыБезналичныхПлатежей.ЛичныйКабинет"), "Из личного кабинета"); 
	СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ЛБ_ВидыБезналичныхПлатежей.РасчетыйСчет"), "Из списка б/н платежей");  

	ВыбранноеЗначение = ВыбратьИзМеню(СписокВыбора, Элементы.ЗагрузитьБН); 
	
	Если НЕ ВыбранноеЗначение = неопределено Тогда  
		СтруктураФайла = Новый Файл(ФайлЗагрузки);
	    ИмяФайлаЗагрузки = СокрЛП(СтруктураФайла.ИмяБезРасширения); 
		Если ВыбранноеЗначение.Значение = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыБезналичныхПлатежей.ЛичныйКабинет") Тогда 
			Если Найти(ИмяФайлаЗагрузки, "ЛК") = 0 Тогда    
				//+МАН 22.01.25 Изменен текст сообщения. Заявка 3043.
				//Было: Предупреждение("Выбранный файл не является файлом платежей из личного кабинета!", 60);
				Предупреждение("Загружаемый файл не соответствует выбранному способу оплаты!", 60);
				//-МАН
				Возврат;
			КонецЕсли;	
		ИначеЕсли ВыбранноеЗначение.Значение = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыБезналичныхПлатежей.РасчетыйСчет") Тогда 
			Если Найти(ИмяФайлаЗагрузки, "БН") = 0 Тогда    
				//+МАН 22.01.25 Изменен текст сообщения. Заявка 3043.
				//Было: Предупреждение("Выбранный файл не является файлом платежей с расчетных счетов!", 60);
				Предупреждение("Загружаемый файл не соответствует выбранному способу оплаты!", 60);
				//-МАН
				Возврат;
			КонецЕсли;	
	    КонецЕсли;

		Если ЗагрузитьРеестрПлатежей(ВыбранноеЗначение.Значение) Тогда 
			Если СоздатьРеестрПлатежей(ВыбранноеЗначение.Значение) Тогда
				Состояние("Внимание!", 100, "Загрузка может занять некоторое время", БиблиотекаКартинок.ДлительнаяОперация48); 
			    Элементы.РеестрыПлатежей.Обновить();  
				ТекСтрока = Элементы.РеестрыПлатежей.ТекущиеДанные;
				Если НЕ ТекСтрока = неопределено Тогда  
					ЗаполнитьРасшифровку(ТекСтрока.РеестрПлатежей); 
				Иначе
					РасшифровкаРеестра.Очистить();
				КонецЕсли;	
			Иначе
				Сообщить("Ошибка проведения загруженного реестра платежей. Обратитесь к разработчикам.", статусСообщения.Важное);
            КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр 			= НСтр("ru=’Книга Excel 97 (*.xls)|*.xls|Книга Excel 2007 (*.xlsx)|*.xlsx'");
	Диалог.Заголовок 		= НСтр("ru=’Выберите файл Excel'");
	ОповещениеЗавершения 	= Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект);
	
	Диалог.Показать(ОповещениеЗавершения);
КонецПроцедуры      

&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		
		ФайлЗагрузки = ВыбранныеФайлы[0];
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИтоги() 
	СуммаПлатежаИтог = РасшифровкаРеестра.Итог("СуммаПлатежа"); 
	КоличествоИтог = РасшифровкаРеестра.Количество(); 
	ОплатаПроцентыИтог = РасшифровкаРеестра.Итог("ОплатаПроценты");
	ОплатаЗаймИтог = РасшифровкаРеестра.Итог("ОплатаЗайм"); 
	ВозвратИтог = РасшифровкаРеестра.Итог("Возврат");   
	
	ПереплатаИтог = 0;   
	ЗачетПереплатыИтог = 0;
	Для каждого Стр Из РасшифровкаРеестра Цикл 
		Если Стр.ИтоговыйСтатус = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.Отменен Тогда
			Продолжить;
		КонецЕсли;	
		ПереплатаИтог = ПереплатаИтог + Стр.Переплата;
	    ЗачетПереплатыИтог = ЗачетПереплатыИтог  + Стр.ПереплатаРаспределено; 
    КонецЦикла;
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьРасшифровку(РеестрПлатежей)
	Запрос = Новый Запрос;  
	//Запрос.УстановитьПараметр("Дата", ?(ДатаКон = Дата(1,1,1), ТекущаяДатаСеанса(), КонецДня(ДатаКон))); 
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("РеестрПлатежей", РеестрПлатежей);
    Запрос.Текст = "ВЫБРАТЬ
                   |	ЛБ_РеестрБезначныхПлатежей.Период КАК Период,
                   |	ЛБ_РеестрБезначныхПлатежей.РеестрПлатежей КАК РеестрПлатежей,
                   |	ЛБ_РеестрБезначныхПлатежей.НомерЗБ КАК НомерЗБ,
                   |	ЛБ_РеестрБезначныхПлатежей.ДатаПлатежа КАК ДатаПлатежа,
                   |	ЛБ_РеестрБезначныхПлатежей.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
                   |	ЛБ_РеестрБезначныхПлатежей.СуммаПлатежа КАК СуммаПлатежа,
                   |	ЛБ_РеестрБезначныхПлатежей.СтатусПлатежа КАК НачальныйСтатус,
                   |	ЛБ_РеестрБезначныхПлатежей.ЗалоговыйБилет КАК ЗалоговыйБилет,
                   |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗБ,
                   |	ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение,
                   |	ЛБ_РеестрБезначныхПлатежей.ЗалоговыйБилет.Ломбард.НомерЛомбарда КАК НомерЛомбарда,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия + "" "" + ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя + "" "" + ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК ФИОЗаемщика,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК НомерТелефона,
                   |	ЛБ_РеестрБезначныхПлатежей.ФИОЗаемщика КАК ИнформацияФИОЗаемщика,
                   |	ЛБ_РеестрБезначныхПлатежей.ФИОПлательщика КАК ИнформацияФИОПлательщика,
                   |	ЛБ_РеестрБезначныхПлатежей.Переплата КАК Переплата,
				   //+МАН 25.04.25 Добавлен новый реквизит. Заявка 3043
                   |	ЛБ_РеестрБезначныхПлатежей.СпособПлатежа КАК СпособПлатежа
				   //-МАН
                   |ИЗ
                   |	РегистрСведений.ЛБ_РеестрБезначныхПлатежей КАК ЛБ_РеестрБезначныхПлатежей
                   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&Дата, ) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних
                   |		ПО ЛБ_РеестрБезначныхПлатежей.ЗалоговыйБилет = ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет
                   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, ) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
                   |		ПО ЛБ_РеестрБезначныхПлатежей.ЗалоговыйБилет.Ломбард = ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард
                   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, ) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних
                   |		ПО ЛБ_РеестрБезначныхПлатежей.ЗалоговыйБилет.Залогодатель = ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Залогодатель
                   |ГДЕ
                   |	ЛБ_РеестрБезначныхПлатежей.Регистратор = &РеестрПлатежей
                   |
                   |УПОРЯДОЧИТЬ ПО
                   |	НомерЗБ";  
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	РасшифровкаРеестра.Очистить();
	Если  НЕ ТаблицаЗапроса.Количество() = 0 Тогда
		РасшифровкаРеестра.Загрузить(ТаблицаЗапроса);   
		ДатаЗагрузки = ТаблицаЗапроса.Получить(0).Период;   
		
		Ном = 0;
		Для каждого стр Из РасшифровкаРеестра Цикл
			Если НЕ Стр.Переплата = 0 Тогда
				Стр.ПереплатаРаспределено = Стр.Переплата - ЛБ_ОбщийМодуль.РассчитатьОстатокПереплатыБезналичногоПлатежа(ТекущаяДатаСеанса(), РеестрПлатежей, Стр.ИдентификаторПлатежа, Стр.ДатаПлатежа, Стр.НомерЗБ);
			КонецЕсли;
			Ном = Ном + 1;
			Стр.НомерПП = Ном;
        КонецЦикла;
		
		Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.Период КАК Период,
		               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.НомерЗБ КАК НомерЗБ,
		               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
		               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.ДатаПлатежа КАК ДатаПлатежа,
		               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
		               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.СтатусПлатежа КАК СтатусПлатежа,
		               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.ОплатаПроценты КАК ОплатаПроценты,
		               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.ОплатаЗайм КАК ОплатаЗайм,
		               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.Переплата КАК Переплата,
		               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.Возврат КАК Возврат,
		               |	ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение,
		               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.ЗалоговыйБилет.Ломбард.НомерЛомбарда КАК НомерЛомбарда,
		               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия + "" "" + ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя + "" "" + ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК ФИОЗаемщика,
		               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК НомерТелефона,
		               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.Ответственный КАК Ответственный,
		               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.ДокументОплаты КАК ДокументОплаты
		               |ИЗ
		               |	РегистрСведений.ЛБ_РеестрБезначныхПлатежей.СрезПоследних(&Дата, РеестрПлатежей = &РеестрПлатежей) КАК ЛБ_РеестрБезначныхПлатежейСрезПоследних
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, ) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних
		               |		ПО ЛБ_РеестрБезначныхПлатежейСрезПоследних.ЗалоговыйБилет.Залогодатель = ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Залогодатель
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, ) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
		               |		ПО ЛБ_РеестрБезначныхПлатежейСрезПоследних.ЗалоговыйБилет.Ломбард = ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард
		               |ГДЕ
		               |	НЕ ЛБ_РеестрБезначныхПлатежейСрезПоследних.Регистратор = &РеестрПлатежей"; 
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл	
			Отбор = Новый Структура;
			Отбор.Вставить("НомерЗБ", Выборка.НомерЗБ); 
			Отбор.Вставить("ДатаПлатежа", Выборка.ДатаПлатежа);
			Отбор.Вставить("ИдентификаторПлатежа", Выборка.ИдентификаторПлатежа);
			
			Строки = РасшифровкаРеестра.НайтиСтроки(Отбор);
			Если НЕ Строки.Количество() = 0 Тогда  
				Стр = строки.Получить(0);
				Стр.ИтоговыйСтатус = Выборка.СтатусПлатежа;
				Стр.ОплатаПроценты = Выборка.ОплатаПроценты;
				Стр.ОплатаЗайм = Выборка.ОплатаЗайм;
				Стр.Переплата = Выборка.Переплата;
				Если НЕ Стр.Переплата = 0 Тогда
					Стр.ПереплатаРаспределено = Стр.Переплата - ЛБ_ОбщийМодуль.РассчитатьОстатокПереплатыБезналичногоПлатежа(ТекущаяДатаСеанса(), РеестрПлатежей, Выборка.ИдентификаторПлатежа, Выборка.ДатаПлатежа, Выборка.НомерЗБ);
				Иначе
					Стр.ПереплатаРаспределено = 0;
				КонецЕсли;	
				Стр.Возврат = Выборка.Возврат; 
				Стр.ДатаПеревода = Выборка.Период;  
				Стр.Ответственный = Выборка.Ответственный; 
				Стр.ДокументОплаты = Выборка.ДокументОплаты;
				Если НЕ Выборка.ЗалоговыйБилет = Стр.ЗалоговыйБилет И НЕ Выборка.СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.Отменен Тогда  
					Стр.ЗалоговыйБилет = Выборка.ЗалоговыйБилет;
					Стр.НомерЗБФакт = Выборка.ЗалоговыйБилет.НомерЗалоговогоБилета;
					Стр.СтатусЗБФакт = ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(ПолучитьДатуСеанса(), Выборка.ЗалоговыйБилет);
					Стр.Отделение = Выборка.Отделение;
					Стр.НомерЛомбарда = Выборка.НомерЛомбарда;
					Стр.ФИОЗаемщика = Выборка.ФИОЗаемщика;
					Стр.НомерТелефона = Выборка.НомерТелефона;
				КонецЕсли;	
			КонецЕсли;	
		Конеццикла;
	КонецЕсли;	  
	ОбновитьИтоги();
КонецПроцедуры	

&НаСервере
Функция ПолучитьВидОперацииРеестраПлатежей(РеестрПлатежей)
	Возврат РеестрПлатежей.ВидОперации;
КонецФункции	

&НаКлиенте
Процедура РеестрыПлатежейПриАктивизацииСтроки(Элемент)    
	ПодключитьОбработчикОжидания("АктивироватьСтрокуНаКлиенте", 0.1, Истина);
КонецПроцедуры   

&НаКлиенте
Процедура АктивироватьСтрокуНаКлиенте()
    ТекСтрока = Элементы.РеестрыПлатежей.ТекущиеДанные;  
	Если НЕ ТекСтрока = неопределено Тогда 
		ЗаполнитьРасшифровку(ТекСтрока.РеестрПлатежей); 
		//+МАН 10.01.25 Установка доступности кнопок. Заявка 3043
		УстановитьДоступность(ТекСтрока);
		//-МАН
	КонецЕсли;	 
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭлементыПользовательскихНастроек = РеестрыПлатежей.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы; 
	
	Для Каждого НастройкаСписка Из ЭлементыПользовательскихНастроек Цикл

	    Если ТипЗнч(НастройкаСписка) = ТипЗнч(РеестрыПлатежей.КомпоновщикНастроек.Настройки.Порядок) Тогда

	        НастройкаСписка.Элементы.Очистить();
	        УсловиеСортировкиДС = НастройкаСписка.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	        УсловиеСортировкиДС.Поле = Новый ПолеКомпоновкиДанных("Дата");
	        УсловиеСортировкиДС.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв;
	        УсловиеСортировкиДС.Использование = Истина;   
			
	    КонецЕсли;
	КонецЦикла;
		
	ТекСтрока = Элементы.РеестрыПлатежей.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда  
		ЗаполнитьРасшифровку(ТекСтрока.РеестрПлатежей); 
	Иначе
		РасшифровкаРеестра.Очистить();
	КонецЕсли;	                                    	
КонецПроцедуры


&НаКлиенте
Процедура ДатаНачПриИзменении(Элемент)
	РеестрыПлатежей.Параметры.УстановитьЗначениеПараметра("Дата1", ?(ДатаНач = Дата(1,1,1), ДатаНач, НачалоДня(ДатаНач)));
	Элементы.РеестрыПлатежей.Обновить(); 
	ТекСтрока = Элементы.РеестрыПлатежей.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда  
		ЗаполнитьРасшифровку(ТекСтрока.РеестрПлатежей);   
	Иначе
		РасшифровкаРеестра.Очистить();
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ДатаКонПриИзменении(Элемент)
	РеестрыПлатежей.Параметры.УстановитьЗначениеПараметра("Дата2", ?(ДатаКон = Дата(1,1,1), ПолучитьДатуСеанса(), КонецДня(ДатаКон)));
	Элементы.РеестрыПлатежей.Обновить(); 
	ТекСтрока = Элементы.РеестрыПлатежей.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда  
		ЗаполнитьРасшифровку(ТекСтрока.РеестрПлатежей); 
	Иначе
		РасшифровкаРеестра.Очистить();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗБИстория(Идентификатор) 
	Стр = РасшифровкаРеестра.НайтиПоИдентификатору(Идентификатор); 
	СтруктураВ = Новый Структура;
	СтруктураВ.Вставить("ЗБ", Стр.ЗалоговыйБилет);
	СтруктураВ.Вставить("Залогодатель", Стр.ЗалоговыйБилет.Залогодатель);
	Возврат СтруктураВ;
КонецФункции	 

&НаСервере
Функция ПолучитьЗалогодателя(ЗалоговыйБилет) 
	Возврат ЗалоговыйБилет.Залогодатель;
КонецФункции	

&НаСервере
Функция ПолучитьНачальныйЗБ(СтруктураПлатежа)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", СтруктураПлатежа.РеестрПлатежей); 
	Запрос.УстановитьПараметр("ИдентификаторПлатежа", СтруктураПлатежа.ИдентификаторПлатежа);
	Запрос.УстановитьПараметр("ДатаПлатежа", СтруктураПлатежа.ДатаПлатежа);
	Запрос.УстановитьПараметр("СуммаПлатежа", СтруктураПлатежа.СуммаПлатежа);
	Запрос.УстановитьПараметр("НомерЗБ", СтруктураПлатежа.НомерЗБ);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеестрБезначныхПлатежей.ЗалоговыйБилет КАК ЗалоговыйБилет
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеестрБезначныхПлатежей КАК ЛБ_РеестрБезначныхПлатежей
	               |ГДЕ
	               |	ЛБ_РеестрБезначныхПлатежей.Регистратор = &Регистратор
	               |	И ЛБ_РеестрБезначныхПлатежей.НомерЗБ = &НомерЗБ
	               |	И ЛБ_РеестрБезначныхПлатежей.ДатаПлатежа = &ДатаПлатежа
	               |	И ЛБ_РеестрБезначныхПлатежей.ИдентификаторПлатежа = &ИдентификаторПлатежа
	               |	И ЛБ_РеестрБезначныхПлатежей.СуммаПлатежа = &СуммаПлатежа";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		Возврат Выборка.ЗалоговыйБилет;
	КонецЕсли;
	Возврат Документы.ЛБ_ОперацияПоЗалогу.ПустаяСсылка();
КонецФункции

&НаКлиенте
Процедура ИсторияЗалоговогоБилета(Команда)
	ТекСтрока = Элементы.РасшифровкаРеестра.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда 
		Если НЕ ЗначениеЗаполнено(ТекСтрока.НомерЗБФакт)  Тогда
			Результат = ПолучитьЗБИстория(ТекСтрока.ПолучитьИдентификатор()); 
			Если ЗначениеЗаполнено(Результат.ЗБ) Тогда 
				ПараметрыФормы = Новый Структура;
				ПараметрыФормы.Вставить("Клиент", Результат.Залогодатель);
				ПараметрыФормы.Вставить("ЗалоговыйБилет", Результат.ЗБ);	 
										
				ОткрытьФорму("Отчет.ЛБ_ИсторияЗалоговогоБилета.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);   
			КонецЕсли;	 
		Иначе      
			СтруктураПлатежа = Новый Структура;	
			СтруктураПлатежа.Вставить("РеестрПлатежей", ТекСтрока.РеестрПлатежей); 
			СтруктураПлатежа.Вставить("ИдентификаторПлатежа", ТекСтрока.ИдентификаторПлатежа);
			СтруктураПлатежа.Вставить("ДатаПлатежа", ТекСтрока.ДатаПлатежа);
			СтруктураПлатежа.Вставить("СуммаПлатежа", ТекСтрока.СуммаПлатежа);
			СтруктураПлатежа.Вставить("НомерЗБ", ТекСтрока.НомерЗБ);

			НачальныйЗБ = ПолучитьНачальныйЗБ(СтруктураПлатежа);
			СписокЗБ = Новый СписокЗначений; 
			СписокЗБ.Добавить(НачальныйЗБ, ТекСтрока.НомерЗБ);
			СписокЗБ.Добавить(ТекСтрока.ЗалоговыйБилет, ТекСтрока.НомерЗБФакт);
			ЭлементВыбора = ВыбратьИзМеню(СписокЗБ, Элементы.РасшифровкаРеестра.КоманднаяПанель);
			Если НЕ ЭлементВыбора = неопределено Тогда
				Если ЗначениеЗаполнено(ЭлементВыбора.Значение) Тогда
					ПараметрыФормы = Новый Структура;
					ПараметрыФормы.Вставить("Клиент", ПолучитьЗалогодателя(ЭлементВыбора.Значение));
					ПараметрыФормы.Вставить("ЗалоговыйБилет", ЭлементВыбора.Значение);	 
											
					ОткрытьФорму("Отчет.ЛБ_ИсторияЗалоговогоБилета.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция КоличествоПлатежейПоЗБ(СтруктураПлатежа) 
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ЗалоговыйБилет", СтруктураПлатежа.ЗалоговыйБилет); 
	Запрос.УстановитьПараметр("ДатаПлатежа", НачалоДня(СтруктураПлатежа.ДатаПлатежа)); 
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ЛБ_ОборотыПоОперациямЗайма.ЗалоговыйБилет КАК ЗалоговыйБилет,
	                |	СУММА(ВЫБОР
	                |			КОГДА ЛБ_ОборотыПоОперациямЗайма.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов)
	                |				ТОГДА 1
	                |			ИНАЧЕ -1
	                |		КОНЕЦ) КАК Количество
	                |ИЗ
	                |	РегистрНакопления.ЛБ_ОборотыПоОперациямЗайма КАК ЛБ_ОборотыПоОперациямЗайма
	                |ГДЕ
	                |	НЕ ЛБ_ОборотыПоОперациямЗайма.РеестрПлатежей = ЗНАЧЕНИЕ(Документ.ЛБ_РеестрПлатежей.ПустаяСсылка)
	                |	И ЛБ_ОборотыПоОперациямЗайма.ЗалоговыйБилет = &ЗалоговыйБилет
	                |	И ЛБ_ОборотыПоОперациямЗайма.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
	                |	И ЛБ_ОборотыПоОперациямЗайма.РеестрПлатежей.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыБезналичныхПлатежей.РасчетыйСчет)
	                |	И НАЧАЛОПЕРИОДА(ЛБ_ОборотыПоОперациямЗайма.Период, ДЕНЬ) = &ДатаПлатежа
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ЛБ_ОборотыПоОперациямЗайма.ЗалоговыйБилет";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Количество;
	КонецЕсли;	
	Возврат 0;
КонецФункции	

&НаСервере
Функция ЗачислитьПлатеж(СтруктураПлатежа)
	Если СтруктураПлатежа.РеестрПлатежей.ВидОперации = Перечисления.ЛБ_ВидыБезналичныхПлатежей.РасчетыйСчет Тогда
	    ДатаДок = КонецДня(СтруктураПлатежа.ДатаПлатежа)-9 + КоличествоПлатежейПоЗБ(СтруктураПлатежа);
	Иначе  
		ДатаДок = СтруктураПлатежа.ДатаПлатежа;
	КонецЕсли;	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("ЗалоговыйБилет", СтруктураПлатежа.ЗалоговыйБилет);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПричинаПрименения КАК ПричинаПрименения,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗБ,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаНачалаРасчетаПроцентов КАК ДатаНачалаРасчетаПроцентов
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&Дата, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних";	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда   
		Выкуп = Ложь;  
		Если СтруктураПлатежа.РеестрПлатежей.ВидОперации = Перечисления.ЛБ_ВидыБезналичныхПлатежей.РасчетыйСчет Тогда
			Если НачалоДня(СтруктураПлатежа.ЗалоговыйБилет.Дата) = НачалоДня(СтруктураПлатежа.ДатаПлатежа) Тогда
				РезультатПроверки = ЛБ_ОбщийМодуль.ПроверитьРасчетыПоЗалоговомуБилету(ДатаДок, СтруктураПлатежа.ЗалоговыйБилет, Истина); 
				Если (РезультатПроверки.ОстатокПроценты + РезультатПроверки.ОстатокЗайм) <= СтруктураПлатежа.СуммаПлатежа Тогда
					Выкуп = Истина;   
				ИначеЕсли СтруктураПлатежа.СуммаПлатежа >= РезультатПроверки.ОстатокЗайм Тогда
					Выкуп = Истина; 
				КонецЕсли;	
			КонецЕсли;	    
		КонецЕсли;	   
		
		РезультатПроценты = ЛБ_ОбщийМодуль.РасчитатьДолгПроценты(ДатаДок, СтруктураПлатежа.ЗалоговыйБилет, Выборка.СтатусЗБ, Выборка.ДатаНачалаРасчетаПроцентов, Выборка.ПричинаПрименения, Выкуп); 
        ДокументОбъект = РезультатПроценты.ДокументОбъект; 		
		СуммаПроцентовНачисленно = РезультатПроценты.СуммаПроценты;    
		
		Если СтруктураПлатежа.СуммаПлатежа > СуммаПроцентовНачисленно Тогда 
			СуммаОплатыПроценты = СуммаПроцентовНачисленно; 
			Переплата = СтруктураПлатежа.СуммаПлатежа - СуммаОплатыПроценты; 
		Иначе
			СуммаОплатыПроценты = СтруктураПлатежа.СуммаПлатежа;
			Переплата = 0;
		КонецЕсли;	
			
    	ДокументОбъект.Дата = ДатаДок;
		ДокументОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов;
		ДокументОбъект.БезналичнаяОплата = Истина;
	    ДокументОбъект.ПредыдущаяОперация = СтруктураПлатежа.ЗалоговыйБилет;
		ДокументОбъект.РеестрПлатежей = СтруктураПлатежа.РеестрПлатежей;  
		ДокументОбъект.СуммаПлатежа = СтруктураПлатежа.СуммаПлатежа; 
		ДокументОбъект.ДатаПлатежа = СтруктураПлатежа.ДатаПлатежа; 
		ДокументОбъект.ИдентификаторПлатежа = СтруктураПлатежа.ИдентификаторПлатежа; 
		ДокументОбъект.НомерЗБПлатежа = СтруктураПлатежа.НомерЗБ; 
	    ДокументОбъект.Организация = СтруктураПлатежа.ЗалоговыйБилет.Организация; 
	    ДокументОбъект.Товары.Загрузить(ДокументОбъект.ПредыдущаяОперация.Товары.Выгрузить());
		Если ДокументОбъект.ПредыдущаяОперация.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда
		    СтрокиТоварыУдалить = Новый СписокЗначений;
			Для каждого СтрТ Из ДокументОбъект.Товары Цикл  
				Если НЕ СтрТ.Переоформить Тогда
					СтрокиТоварыУдалить.Добавить(СтрТ);
				КонецЕсли;	
			КонецЦикла;	
			Для каждого Эл Из СтрокиТоварыУдалить Цикл 
				ДокументОбъект.Товары.Удалить(Эл.Значение);
			КонецЦикла;	
		КонецЕсли;	
		
		ДокументОбъект.СтатусЗалогодателя = ЛБ_УправлениеЛомбардом.ПолучитьТекущийСтатусКлиента(ДокументОбъект.Дата, ДокументОбъект.ПредыдущаяОперация.Залогодатель);
		
		ДокументОбъект.Ломбард = СтруктураПлатежа.ЗалоговыйБилет.Ломбард; 
		ДокументОбъект.ОтветственныйСотрудник = ПараметрыСеанса.ТекущийСотрудник; 
		ДокументОбъект.ОтветственныйПользователь = ПараметрыСеанса.ТекущийПользователь;
		//ДокументОбъект.Залогодатель = СтруктураПлатежа.ЗалоговыйБилет.Залогодатель;  
		ДокументОбъект.СхемаКредитования = СтруктураПлатежа.ЗалоговыйБилет.СхемаКредитования;  
		ДокументОбъект.СрокЗалога = СтруктураПлатежа.ЗалоговыйБилет.СрокЗалога; 
		ДокументОбъект.Акция = СтруктураПлатежа.ЗалоговыйБилет.Акция;
		ДокументОбъект.НомерЗалоговогоБилета = СтруктураПлатежа.ЗалоговыйБилет.НомерЗалоговогоБилета; 
		СуммаОплатыСсуда = 0;                                                                                                                       
		
		ТаблицаТоваров = Новый ТаблицаЗначений; 
		ТаблицаТоваров.Колонки.Добавить("ОбъектЗалога"); 
		ТаблицаТоваров.Колонки.Добавить("СтатусОбъекта");
		ТаблицаТоваров.Колонки.Добавить("СуммаОценки");  
		ТаблицаТоваров.Колонки.Добавить("СуммаОплаты");
		ТаблицаТоваров.Колонки.Добавить("Задолженность"); 
		
		ЗапросОст = новый Запрос;   
		ЗапросОст.УстановитьПараметр("ЗалоговыйБилет", СтруктураПлатежа.ЗалоговыйБилет); 
		ЗапросОст.УстановитьПараметр("Дата", ДатаДок); 
		
		ЗапросОст.Текст = "ВЫБРАТЬ
		               |	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.ОбъектЗалога КАК ОбъектЗалога,
		               |	СУММА(ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.СуммаРасход) КАК СуммаОплаты
		               |ИЗ
		               |	РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Обороты(, &Дата, , ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.ОбъектЗалога";
    	ТаблицаЗапроса = ЗапросОст.Выполнить().Выгрузить(); 

		ЗапросОст.Текст = "ВЫБРАТЬ
               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
               |	ЛБ_ОбъектыЗалогаОстатки.Ломбард КАК Ломбард,
               |	СУММА(ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток) КАК Количество
               |ИЗ
               |	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(&Дата, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_ОбъектыЗалогаОстатки
               |
               |СГРУППИРОВАТЬ ПО
               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога,
               |	ЛБ_ОбъектыЗалогаОстатки.Ломбард";
        ТаблицаОстатков = ЗапросОст.Выполнить().Выгрузить(); 
	   
	    Для каждого стр Из СтруктураПлатежа.ЗалоговыйБилет.Товары цикл  
		   Если СтруктураПлатежа.ЗалоговыйБилет.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда 
			   Если НЕ Стр.Переоформить тогда
				   Продолжить;
			   КонецЕсли;	
		   КонецЕсли;	      
		   НоваяСтр = ТаблицаТоваров.Добавить(); 
		   НоваяСтр.ОбъектЗалога = стр.ОбъектЗалога;
		   НоваяСтр.СтатусОбъекта = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектаЗалога(ДатаДок, НоваяСтр.ОбъектЗалога, СтруктураПлатежа.ЗалоговыйБилет);  
		   НоваяСтр.СуммаОценки = стр.СуммаСсуды; 
		   НоваяСтр.СуммаОплаты = 0;   
		   СуммаОплатыНач = 0;
		   Отбор = Новый структура;
		   Отбор.Вставить("ОбъектЗалога", НоваяСтр.ОбъектЗалога);
		   Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
		   Если НЕ строки.Количество() = 0 тогда			
			   СуммаОплатыНач = Строки.Получить(0).СуммаОплаты;                                 
		   КонецЕсли;	 
		   НоваяСтр.Задолженность = НоваяСтр.СуммаОценки - СуммаОплатыНач; 
	    Конеццикла;	

		Если ДокументОбъект.РеестрПлатежей.ВидОперации = Перечисления.ЛБ_ВидыБезналичныхПлатежей.РасчетыйСчет И НЕ Переплата = 0 Тогда   								   
			СуммаОплатыСсуда = ?(ТаблицаТоваров.Итог("Задолженность") < Переплата, ТаблицаТоваров.Итог("Задолженность"),  Переплата); 		   
	        СуммаДляРаспределения = СуммаОплатыСсуда;
			ОбъектЗалогаМакс = Справочники.ЛБ_ОбъектыЗалога.ПустаяСсылка(); 
			МаксЗадолженность = 0;
			ЗадолженностьНачИтог = ТаблицаТоваров.Итог("Задолженность");
			Для каждого СтрТ Из ТаблицаТоваров Цикл 
			   Коэфф = СтрТ.Задолженность/ЗадолженностьНачИтог;
			   СтрТ.СуммаОплаты = СуммаОплатыСсуда*Коэфф;
			   СуммаДляРаспределения = СуммаДляРаспределения - СтрТ.СуммаОплаты;
			   Если СтрТ.Задолженность > МаксЗадолженность Тогда
				   МаксЗадолженность = СтрТ.Задолженность;  
				   ОбъектЗалогаМакс = стрТ.ОбъектЗалога;
			   КонецЕсли;	
		   КонецЦикла;
		   Если НЕ СуммаДляРаспределения = 0 Тогда 
			   Отбор = Новый Структура;
			   Отбор.Вставить("ОбъектЗалога", ОбъектЗалогаМакс);
			   Строки = ТаблицаТоваров.Найтистроки(Отбор);
			   Если НЕ Строки.Количество() = 0 тогда
				   СтрТ = Строки.Получить(0);
				   СтрТ.СуммаОплаты = СтрТ.СуммаОплаты + СуммаДляРаспределения;
			   КонецЕсли;	
		   КонецЕсли; 
		   Переплата = Переплата - ТаблицаТоваров.Итог("СуммаОплаты");
	    КонецЕсли;     	    
		
	    ДокументОбъект.Выкуп = ?(ТаблицаТоваров.Итог("Задолженность") - ТаблицаТоваров.Итог("СуммаОплаты") = 0, Истина,  Ложь);   
		   
	    Для каждого стрТ из ТаблицаТоваров Цикл 		
		   Отбор = новый структура;
		   Отбор.Вставить("ОбъектЗалога", стрТ.ОбъектЗалога);
		
		   СтрокиТ = ДокументОбъект.Товары.НайтиСтроки(Отбор); 
		   Если НЕ СтрокиТ.Количество() = 0 Тогда
			   СтрТТ = строкиТ.получить(0);    
		       СтрТТ.СуммаОценки = СтрТ.Задолженность;
		       СтрТТ.СуммаОплаты = СтрТ.СуммаОплаты; 
		   КонецЕсли;	   
	    Конеццикла;	

		СтруктураЗБ = ЛБ_Общиймодуль.ПолучитьСостояниеЗалоговогоБилета(ДокументОбъект, СтруктураПлатежа.ЗалоговыйБилет);		
		ДокументОбъект.ДатаВыкупа = СтруктураЗБ.ДатаВыкупа;
		ДокументОбъект.ДатаВыкупаЛьготная = СтруктураЗБ.ДатаВыкупаЛьготныйСрок;
	    ДокументОбъект.СуммаСсуды = ТаблицаТоваров.Итог("Задолженность") - ТаблицаТоваров.Итог("СуммаОплаты");
		ДокументОбъект.СуммаОплаты = СуммаОплатыПроценты + СуммаОплатыСсуда;
		ДокументОбъект.СуммаОплатыПроценты = СуммаОплатыПроценты;
		ДокументОбъект.СуммаОплатыСсуда = СуммаОплатыСсуда;     
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		Попытка           
		    ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
			СообщениеЗачет = "";						  
			Если Выборка.СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ВключенВНакладную ИЛИ
				 Выборка.СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОбъявленТорг Тогда 
				ПСЗ = ЛБ_ОбщийМодуль.ПолучитьПредельныйСрокЗаймаДата(Структураплатежа.ЗалоговыйБилет);
                Если ПСЗ < НачалоДня(ДокументОбъект.Дата) Тогда
				    Накладная = ЛБ_УправлениеЛомбардом.ПолучитьНакладнуюНаОтгрузкуЗалогоговогоБилета(ДокументОбъект.Дата, СтруктураПлатежа.ЗалоговыйБилет);
				    СообщениеЗачет = "Внимание! По ЗБ № " + сокрЛП(СтруктураПлатежа.ЗалоговыйБилет.НомерЗалоговогоБилета) + " достигнут предельный срок займа."  + Символы.ПС +
					                 "После зачисления платежа ЗБ НЕ ИСКЛЮЧЕН из накладной № " + СокрЛП(Накладная.НомерНакладной) + " от " + Формат(Накладная.Дата, "ДФ=dd.MM.yyyy"); 
			    КонецЕсли;	 
			КонецЕсли;	
			
			Результат = новый Структура;
		   	Результат.Вставить("ОплатаПроценты", СуммаОплатыПроценты);
			Результат.Вставить("ОплатаЗайм", СуммаОплатыСсуда);
			Результат.Вставить("Переплата", Переплата); 
			Результат.Вставить("ДокументОплаты", ДокументОбъект.Ссылка); 
			Результат.Вставить("СтатусПлатежа", ?(СтруктураПлатежа.СуммаПлатежа > ДокументОбъект.СуммаОплаты, Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ЗачисленоЧастично, Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ЗачисленоПолностью));
			Результат.Вставить("Сообщение", СообщениеЗачет);                                         
			Возврат Результат;   
		Исключение   			
			Возврат неопределено;
		КонецПопытки;  
	КонецЕсли;	
КонецФункции	

&НаСервере
Функция ПроверитьЕстьОплатыБН(СтруктураПлатежа) 
	Если СтруктураПлатежа.РеестрПлатежей.ВидОперации = Перечисления.ЛБ_ВидыБезналичныхПлатежей.РасчетыйСчет Тогда
		Возврат ЛБ_ОбщийМодуль.ПроверитьЕстьОплатыБН(КонецДня(СтруктураПлатежа.ДатаПлатежа)-9+КоличествоПлатежейПоЗБ(СтруктураПлатежа), СтруктураПлатежа.ЗалоговыйБилет);
	КонецЕсли;
	Возврат Ложь;
КонецФункции

&НаСервере
Функция ПроверитьПлатеж(СтруктураПлатежа, Отмена = Ложь)
	Если Отмена Тогда 
		Если ЗначениеЗаполнено(СтруктураПлатежа.ЗалоговыйБилет) Тогда
			Если СтруктураПлатежа.РеестрПлатежей.ВидОперации = Перечисления.ЛБ_ВидыБезналичныхПлатежей.РасчетыйСчет Тогда
			    ДатаПроверки = КонецДня(СтруктураПлатежа.ДатаПлатежа)-9 + КоличествоПлатежейПоЗБ(СтруктураПлатежа);
			Иначе
				ДатаПроверки = СтруктураПлатежа.ДатаПлатежа;
			КонецЕсли;	
			СтруктураВ = ЛБ_ОбщийМодуль.ПроверитьЕстьОплатыРегламентныеНачисленияОтменаБН(ДатаПроверки, СтруктураПлатежа.ЗалоговыйБилет); 
			Если НЕ СтруктураВ = неопределено Тогда   
				Если СтруктураВ.Вид = 0 Тогда //наличная/безнал оплата
					Возврат "По залоговому билету № "  + СокрЛП(СтруктураПлатежа.ЗалоговыйБилет.НомерЗалоговогоБилета) +  " есть платеж от " + Формат(СтруктураВ.Период, "ДЛФ=DT"); 
				ИначеЕсли СтруктураВ.Вид = 1 Тогда //регл. начисление 
					Возврат "По залоговому билету № "  + СокрЛП(СтруктураПлатежа.ЗалоговыйБилет.НомерЗалоговогоБилета) +  " есть регламентное начисление процентов от " + Формат(СтруктураВ.Период, "ДЛФ=DT");
				КонецЕсли;	
			КонецЕсли;   
		КонецЕсли;	  
	Иначе	
		Если НЕ ЗначениеЗаполнено(СтруктураПлатежа.ЗалоговыйБилет) Тогда 				
		    Возврат "Залоговый билет № " + СокрЛП(СтруктураПлатежа.НомерЗБ) + " в базе не найден.";
		Иначе                                                                                              
			СтатусЗБ = ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(ТекущаяДатаСеанса(), СтруктураПлатежа.ЗалоговыйБилет); 
			Если СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт ИЛИ 
				 СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтвественноеХранение ИЛИ   
				 СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтказОтОформления ИЛИ
				 СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Отгружен Тогда   
				Возврат "Залоговый билет № " + СокрЛП(СтруктураПлатежа.НомерЗБ) + " в статусе " + строка(СтатусЗБ) + "."; 
			ИначеЕсли ЛБ_ОбщийМодуль.ПроверитьЕстьОплатыКасса(СтруктураПлатежа.РеестрПлатежей.ВидОперации, СтруктураПлатежа.РеестрПлатежей.Дата, СтруктураПлатежа.ДатаПлатежа, СтруктураПлатежа.ЗалоговыйБилет) Тогда  
				Если СтруктураПлатежа.РеестрПлатежей.ВидОперации = Перечисления.ЛБ_ВидыБезналичныхПлатежей.РасчетыйСчет Тогда
				    Возврат "По залоговому билету № " + СокрЛП(СтруктураПлатежа.НомерЗБ) + " есть наличные оплаты позже " + Формат(КонецДня(СтруктураПлатежа.ДатаПлатежа)-9 + КоличествоПлатежейПоЗБ(СтруктураПлатежа), "ДЛФ=DT"); 
				ИначеЕсли СтруктураПлатежа.РеестрПлатежей.ВидОперации = Перечисления.ЛБ_ВидыБезналичныхПлатежей.РасчетыйСчет Тогда
				    Возврат "По залоговому билету № " + СокрЛП(СтруктураПлатежа.НомерЗБ) + " есть наличные оплаты в промежутке между датой платежа и датой загрузки реестра.";
				КонецЕсли;
			ИначеЕсли ПроверитьЕстьОплатыБН(СтруктураПлатежа) Тогда
	            Возврат "По залоговому билету № " + СокрЛП(СтруктураПлатежа.НомерЗБ) + " есть безналичные оплаты позже " + Формат(КонецДня(СтруктураПлатежа.ДатаПлатежа)-9 + КоличествоПлатежейПоЗБ(СтруктураПлатежа), "ДЛФ=DT");
			Иначе              
				ДатаРасчета = ?(СтруктураПлатежа.РеестрПлатежей.ВидОперации = Перечисления.ЛБ_ВидыБезналичныхПлатежей.ЛичныйКабинет, СтруктураПлатежа.ДатаПлатежа, КонецДня(СтруктураПлатежа.ДатаПлатежа)-9+ КоличествоПлатежейПоЗБ(СтруктураПлатежа));
				РезультатРасчета = ЛБ_Общиймодуль.ПроверитьРасчетыПоЗалоговомуБилету(ДатаРасчета, СтруктураПлатежа.ЗалоговыйБилет);
				Если СтруктураПлатежа.РеестрПлатежей.ВидОперации = Перечисления.ЛБ_ВидыБезналичныхПлатежей.РасчетыйСчет Тогда
					Если (РезультатРасчета.ОстатокПроценты + РезультатРасчета.ОстатокЗайм) <= 0 Тогда
					   Возврат "По залоговый билету № " + СокрЛП(СтруктураПлатежа.НомерЗБ) + " проценты на дату платежа не начислены и не определен остаток задолженности по телу займа.";
					КонецЕсли;  
				ИначеЕсли СтруктураПлатежа.РеестрПлатежей.ВидОперации = Перечисления.ЛБ_ВидыБезналичныхПлатежей.ЛичныйКабинет Тогда  
					Если РезультатРасчета.ОстатокПроценты <= 0 Тогда
					    Возврат "По залоговый билету № " + СокрЛП(СтруктураПлатежа.НомерЗБ) + " проценты на дату платежа не начислены.";
					КонецЕсли; 
		        КонецЕсли;
			КонецЕсли;	
		КонецЕсли;  
	КонецЕсли;	
	Возврат "";
КонецФункции 

&НаСервере
Функция ЗаполнитьОтменуЛК(РеестрПлатежей)  
	ПлатежиЛКОтменить.Очистить();
	Если РеестрПлатежей.ВидОперации = Перечисления.ЛБ_ВидыБезналичныхПлатежей.РасчетыйСчет Тогда 
		Для каждого Стр Из РасшифровкаРеестра Цикл   
			Если НЕ ЗначениеЗаполнено(Стр.ЗалоговыйБилет) тогда
				Продолжить;  
			КонецЕсли;	
			РезультатЛК = ЛБ_ОбщийМодуль.ПроверитьЕстьПлатежиЛКДляОтмены(КонецДня(Стр.ДатаПлатежа)-9, Стр.ЗалоговыйБилет); 
			Если НЕ РезультатЛК.Количество() = 0 Тогда 
				Для каждого стрЛК Из РезультатЛК Цикл
					ОтборЛК = Новый структура;
					ОтборЛК.Вставить("ЗалоговыйБилет", стр.ЗалоговыйБилет); 
					ОтборЛК.Вставить("ДокументОплаты", стрЛК.ДокументОплаты); 
					СтрокиЛК = ПлатежиЛКОтменить.НайтиСтроки(ОтборЛК);
					Если СтрокиЛК.Количество() = 0 Тогда
						НоваяСтр = ПлатежиЛКОтменить.Добавить();
						НоваяСтр.ЗалоговыйБилет = стр.ЗалоговыйБилет;
		                НоваяСтр.РеестрПлатежей = стрЛК.РеестрПлатежей;  
						НоваяСтр.НомерЗБ = стрЛК.НомерЗБ;
						НоваяСтр.ДатаПлатежа = стрЛК.ДатаПлатежа;
						НоваяСтр.ИдентификаторПлатежа = стрЛК.ИдентификаторПлатежа;
						НоваяСтр.СуммаПлатежа = стрЛК.СуммаПлатежа;
						НоваяСтр.СтатусПлатежа = стрЛК.СтатусПлатежа; 
						НоваяСтр.СтатусПереплаты = стрЛК.СтатусПереплаты;
						НоваяСтр.ДокументОплаты = стрЛК.ДокументОплаты;
					КонецЕсли;	  
				Конеццикла;	
			КонецЕсли;	
        КонецЦикла;
	КонецЕсли;
КонецФункции  

&НаСервере
Функция ЗаполнитьОтменуЛКУточнениеПлатежа(ЗалоговыйБилет, ДатаПлатежа)  
	ПлатежиЛКОтменить.Очистить();
	РезультатЛК = ЛБ_ОбщийМодуль.ПроверитьЕстьПлатежиЛКДляОтмены(КонецДня(ДатаПлатежа)-9, ЗалоговыйБилет); 
	Если НЕ РезультатЛК.Количество() = 0 Тогда 
		Для каждого стрЛК Из РезультатЛК Цикл
			ОтборЛК = Новый структура;
			ОтборЛК.Вставить("ЗалоговыйБилет", ЗалоговыйБилет); 
			ОтборЛК.Вставить("ДокументОплаты", стрЛК.ДокументОплаты); 
			СтрокиЛК = ПлатежиЛКОтменить.НайтиСтроки(ОтборЛК);
			Если СтрокиЛК.Количество() = 0 Тогда
				НоваяСтр = ПлатежиЛКОтменить.Добавить();
				НоваяСтр.ЗалоговыйБилет = ЗалоговыйБилет;
	            НоваяСтр.РеестрПлатежей = стрЛК.РеестрПлатежей;  
				НоваяСтр.НомерЗБ = стрЛК.НомерЗБ;
				НоваяСтр.ДатаПлатежа = стрЛК.ДатаПлатежа;
				НоваяСтр.ИдентификаторПлатежа = стрЛК.ИдентификаторПлатежа;
				НоваяСтр.СуммаПлатежа = стрЛК.СуммаПлатежа;
				НоваяСтр.СтатусПлатежа = стрЛК.СтатусПлатежа; 
				НоваяСтр.СтатусПереплаты = стрЛК.СтатусПереплаты;
				НоваяСтр.ДокументОплаты = стрЛК.ДокументОплаты;
			КонецЕсли;	 
		Конеццикла;	
	КонецЕсли;	
КонецФункции   


&НаСервере
Функция ПолучитьНомерРеестра(РеестрПлатежей)  
	Возврат РеестрПлатежей.НомерРеестра;
КонецФункции

&НаСервере
Функция ПолучитьОстатокСуммыПлатежа(СтруктураПлатежа) 
	 Запрос = Новый Запрос;
КонецФункции

&НаСервере
Функция ПолучитьТекущийСтатусЗБ(ЗалоговыйБилет) 
	Возврат ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(ПолучитьДатуСеанса(), ЗалоговыйБилет);
КонецФункции	  

&НаКлиенте
Функция ОтменитьОплатуЛК(СтруктураПлатежа, ДокументОплаты)  
	РезультатЛК = ОтменаОплатыНаСервере(ДокументОплаты);
	Если НЕ РезультатЛК Тогда    
		Возврат Ложь;
	Иначе							
		РезультатОтменыСтатуса = СоздатьИзменениеСтатусаОтмена(СтруктураПлатежа, ДокументОплаты); 
		Если РезультатОтменыСтатуса = неопределено Тогда    
			Возврат Ложь;
		КонецЕсли;
		Возврат Истина;
	КонецЕсли;	  
КонецФункции

&НаСервере
Функция ПолучитьНомерДатуРеестраПлатежей(РеестрПлатежей) 
	Возврат СокрЛП(РеестрПлатежей.НомерРеестра) + " от " + Формат(РеестрПлатежей.Дата, "ДФ=dd.MM.yyyy");
КонецФункции	

&НаКлиенте
Процедура Зачислить(Команда)
	ТекСтрока = Элементы.РасшифровкаРеестра.ТекущиеДанные;  
	Если ТекСтрока = неопределено Тогда
		Возврат;
	КонецЕсли;       
	
	Если ТекСтрока.НачальныйСтатус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.ДляВозврата") ИЛИ
		 ТекСтрока.НачальныйСтатус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.ДляРазбора") Тогда
		Возврат; 
	КонецЕсли;		
	
	Если ТекСтрока.ИтоговыйСтатус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.ЗачисленоПолностью") ИЛИ
		 ТекСтрока.ИтоговыйСтатус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.ЗачисленоЧастично") Тогда
		Предупреждение("Сумма платежа уже зачислена.", 60);
		Возврат;  
	ИначеЕсли ТекСтрока.ИтоговыйСтатус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.Возвращено") Тогда 
		Предупреждение("Сумма платежа возвращена, зачисление не возможно.", 60);
		Возврат; 
	ИначеЕсли ТекСтрока.ИтоговыйСтатус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.ОтнесеноВДоходы") Тогда  
		Предупреждение("Сумма платежа отнесена в доходы, зачисление не возможно.", 60);
		Возврат; 
	ИначеЕсли ТекСтрока.ИтоговыйСтатус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.Отменен") Тогда 
		Предупреждение("Платеж отменен, зачисление не возможно.", 60);
		Возврат;   
	КонецЕсли;	

	СтруктураПлатежа = Новый Структура;	
	СтруктураПлатежа.Вставить("РеестрПлатежей", ТекСтрока.РеестрПлатежей); 
	СтруктураПлатежа.Вставить("ИдентификаторПлатежа", ТекСтрока.ИдентификаторПлатежа);
	СтруктураПлатежа.Вставить("ДатаПлатежа", ТекСтрока.ДатаПлатежа);
	СтруктураПлатежа.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет);
	СтруктураПлатежа.Вставить("СуммаПлатежа", ТекСтрока.СуммаПлатежа);
	СтруктураПлатежа.Вставить("НомерЗБ", ТекСтрока.НомерЗБ); 
	
	Если ПроверитьПлатежРаспределен(СтруктураПлатежа) Тогда
        Предупреждение("Сумма платежа распределена.", 60);
	    Возврат; 
	КонецЕсли;	
	
	СообщениеПроверки = ПроверитьПлатеж(СтруктураПлатежа); 
	Если НЕ ПустаяСтрока(СообщениеПроверки) Тогда
		Предупреждение(СообщениеПроверки, 60);
		Возврат; 
	КонецЕсли;     
	
	ЗаполнитьОтменуЛК(ТекСтрока.РеестрПлатежей);
	Отбор = Новый Структура;
	Отбор.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет);
	СтрокиОтменитьЛК = ПлатежиЛКОтменить.НайтиСтроки(Отбор);   
	Если НЕ СтрокиОтменитьЛК.Количество() = 0 Тогда 
		Для каждого СтрЛК Из СтрокиОтменитьЛК Цикл 
			Если СтрЛК.СтатусПлатежа = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.Возвращено") ИЛИ
				 СтрЛК.СтатусПлатежа = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.ОтнесеноВДоходы") Тогда
				СтрокаПредупреждение = "В реестре ЛК № " + ПолучитьНомерРеестра(СтрЛК.РеестрПлатежей) + " найдены более поздние зачисления по залоговому билету № " + СокрЛП(ТекСтрока.НомерЗБ) + 
				    " со статусом платежа """ + Строка(СтрЛК.СтатусПлатежа) + """. Платеж в реестре ЛК отменить нельзя."; 
				Предупреждение(СтрокаПредупреждение, 60);
			    Возврат;    
			ИначеЕсли СтрЛК.СтатусПереплаты = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.Возвращено") ИЛИ
				 СтрЛК.СтатусПереплаты = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.ОтнесеноВДоходы") Тогда
				СтрокаПредупреждение = "В реестре ЛК № " + ПолучитьНомерРеестра(СтрЛК.РеестрПлатежей) + " найдены более поздние зачисления по залоговому билету № " + СокрЛП(ТекСтрока.НомерЗБ) + 
				    " со статусом переплаты """ + Строка(СтрЛК.СтатусПереплаты) + """. Платеж в реестре ЛК отменить нельзя."; 
				Предупреждение(СтрокаПредупреждение, 60);
			    Возврат; 	
			ИначеЕсли НЕ ЗначениеЗаполнено(СтрЛК.ДокументОплаты) Тогда
				Предупреждение("Не определен документ оплаты для отмены платежа в реестре ЛК." + Символы.ПС + "Обратитесь к разработчикам.", 60); 
				Возврат;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
	
	СтрокаСообщение = "";
	Результат = ЗачислитьПлатеж(СтруктураПлатежа);
	Если Результат = неопределено Тогда    
		Предупреждение("Ошибка при зачислении платежа. Обратитесь к разработчикам.", 60);
	Иначе	     
		СтрокаСообщение = Результат.Сообщение; 
		Если НЕ СтрокиОтменитьЛК.Количество() = 0 Тогда
			Для каждого СтрЛК Из СтрокиОтменитьЛК Цикл  
				СтруктураПлатежаЛК = Новый Структура;	
				СтруктураПлатежаЛК.Вставить("РеестрПлатежей", СтрЛК.РеестрПлатежей); 
				СтруктураПлатежаЛК.Вставить("ИдентификаторПлатежа", СтрЛК.ИдентификаторПлатежа);
				СтруктураПлатежаЛК.Вставить("ДатаПлатежа", СтрЛК.ДатаПлатежа);
				СтруктураПлатежаЛК.Вставить("НомерЗБ", СтрЛК.НомерЗБ);
				СтруктураПлатежаЛК.Вставить("ЗалоговыйБилет", СтрЛК.ЗалоговыйБилет);
				СтруктураПлатежаЛК.Вставить("СуммаПлатежа", СтрЛК.СуммаПлатежа);  
				
				УдалитьЗаписьВРегистреОтменаПлатежейЛК(Текстрока.РеестрПлатежей, СтрЛК.ЗалоговыйБилет);
				
				РезультатЛК = ОтменитьОплатуЛК(СтруктураПлатежаЛК, СтрЛК.ДокументОплаты);
				Если НЕ РезультатЛК Тогда    
		             Предупреждение("Ошибка при отмене платежа по реестру ЛК. Обратитесь к разработчикам.", 60);
		             Возврат;
				 КонецЕсли;	     
				 
				 ЗаписатьИнформациюОбОтмененныхПлатежах(ТекСтрока.РеестрПлатежей, СтруктураПлатежаЛК);			 
				 СтрокаСообщение = СтрокаСообщение + ?(ПустаяСтрока(СтрокаСообщение), "", Символы.ПС) + "В реестре платежей № " + ПолучитьНомерДатуРеестраПлатежей(СтрЛК.РеестрПлатежей) + " отменена оплата по ЗБ № " + СокрЛП(СтрЛК.НомерЗБ); 
			КонецЦикла;	
		КонецЕсли;	 

		ТекСтрока.ИтоговыйСтатус = Результат.СтатусПлатежа;
		ТекСтрока.ОплатаПроценты = Результат.ОплатаПроценты; 
		ТекСтрока.ОплатаЗайм = Результат.ОплатаЗайм; 
		ТекСтрока.Переплата = Результат.Переплата; 
		ТекСтрока.СтатусЗБ = ПолучитьТекущийстатусЗБ(ТекСтрока.ЗалоговыйБилет); 
		ТекСтрока.Ответственный = ТекущийПользователь();   
		ТекСтрока.ДокументОплаты = Результат.ДокументОплаты;
			
		ДатаПеревода = СоздатьИзменениеСтатуса(Результат.СтатусПлатежа, СтруктураПлатежа, Результат.ДокументОплаты); 
		Если ДатаПеревода = неопределено Тогда    
			Предупреждение("Ошибка при изменении статуса платежа. Обратитесь к разработчикам.", 60);
		Иначе	               
			Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
				Предупреждение(СтрокаСообщение, 60);
			КонецЕсли;	
			ТекСтрока.ДатаПеревода = ДатаПеревода;
			Элементы.РеестрыПлатежей.Обновить(); 
			ОбновитьИтоги();
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗачислитьВсе(Команда)
	КоличествоЗачислить = 0;
	Для каждого Стр Из РасшифровкаРеестра Цикл 
		Если Стр.НачальныйСтатус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.КЗачислению") И
			 Стр.ИтоговыйСтатус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.ПустаяСсылка") Тогда 
			КоличествоЗачислить = КоличествоЗачислить + 1;
		КонецЕсли;	                                   
	КонецЦикла;    
	
	Если КоличествоЗачислить = 0 Тогда 
		Предупреждение("Нет платежей с начальным статусом ""К зачислению"".", 60);
		Возврат;
	КонецЕсли;  
	
	ЗаполнитьОтменуЛК(РасшифровкаРеестра.Получить(0).РеестрПлатежей);
	
	СтрокаСообщение = "";
	Шаг = Цел(100/КоличествоЗачислить);
	Процесс = 0;			
	Для каждого Стр Из РасшифровкаРеестра Цикл  
		Если Стр.НачальныйСтатус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.КЗачислению") И
			 Стр.ИтоговыйСтатус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.ПустаяСсылка") Тогда  
			 
			Процесс = Процесс + Шаг; 
			Состояние("Внимание!", Процесс, "Зачисление платежей может занять некоторое время", БиблиотекаКартинок.ДлительнаяОперация48);
			
			СтруктураПлатежа = Новый Структура;	
			СтруктураПлатежа.Вставить("РеестрПлатежей", Стр.РеестрПлатежей); 
			СтруктураПлатежа.Вставить("ИдентификаторПлатежа", Стр.ИдентификаторПлатежа);
			СтруктураПлатежа.Вставить("ДатаПлатежа", Стр.ДатаПлатежа);
			СтруктураПлатежа.Вставить("ЗалоговыйБилет", Стр.ЗалоговыйБилет);
			СтруктураПлатежа.Вставить("СуммаПлатежа", Стр.СуммаПлатежа);
			СтруктураПлатежа.Вставить("НомерЗБ", Стр.НомерЗБ);
			Результат = ЗачислитьПлатеж(СтруктураПлатежа);
			Если Результат = неопределено Тогда    
				Предупреждение("Ошибка при зачислении платежа (№ ЗБ " + сокрЛП(Стр.НомерЗБ) + "). Обратитесь к разработчикам.", 60);  
				Прервать; 
			Иначе      
				Если НЕ ПустаяСтрока(Результат.Сообщение) Тогда
					СтрокаСообщение = СтрокаСообщение + ?(ПустаяСтрока(СтрокаСообщение), "", Символы.ПС) + Результат.Сообщение;
				КонецЕсли;	   
				Отбор = Новый Структура;
				Отбор.Вставить("ЗалоговыйБилет", Стр.ЗалоговыйБилет); 
				СтрокиОтменитьЛК = ПлатежиЛКОтменить.НайтиСтроки(Отбор);   
				Если НЕ СтрокиОтменитьЛК.Количество() = 0 Тогда 
					Для каждого СтрЛК Из СтрокиОтменитьЛК Цикл  
						Если СтрЛК.НеПроверять Тогда
							Продолжить;
						КонецЕсли;	
						СтруктураПлатежаЛК = Новый Структура;	
						СтруктураПлатежаЛК.Вставить("РеестрПлатежей", СтрЛК.РеестрПлатежей); 
						СтруктураПлатежаЛК.Вставить("ИдентификаторПлатежа", СтрЛК.ИдентификаторПлатежа);
						СтруктураПлатежаЛК.Вставить("ДатаПлатежа", СтрЛК.ДатаПлатежа);
						СтруктураПлатежаЛК.Вставить("НомерЗБ", СтрЛК.НомерЗБ);
						СтруктураПлатежаЛК.Вставить("ЗалоговыйБилет", СтрЛК.ЗалоговыйБилет);
						СтруктураПлатежаЛК.Вставить("СуммаПлатежа", СтрЛК.СуммаПлатежа); 
						
						УдалитьЗаписьВРегистреОтменаПлатежейЛК(Стр.РеестрПлатежей, СтрЛК.ЗалоговыйБилет);
				
						РезультатЛК = ОтменитьОплатуЛК(СтруктураПлатежаЛК, СтрЛК.ДокументОплаты);
						Если НЕ РезультатЛК Тогда    
				             Предупреждение("Ошибка при отмене платежа по реестру ЛК (№ ЗБ " + сокрЛП(СтрЛК.НомерЗБ) + "). Обратитесь к разработчикам.", 60);
				             Возврат;
						КонецЕсли;	  
			
				        ЗаписатьИнформациюОбОтмененныхПлатежах(Стр.РеестрПлатежей, СтруктураПлатежаЛК);
						СтрокаСообщение = СтрокаСообщение + ?(ПустаяСтрока(СтрокаСообщение), "", Символы.ПС) + "В реестре платежей № " + ПолучитьНомерДатуРеестраПлатежей(СтрЛК.РеестрПлатежей) + " отменена оплата по ЗБ № " + СокрЛП(СтрЛК.НомерЗБ); 
						СтрЛК.НеПроверять = Истина;
					КонецЦикла;	
				КонецЕсли;	 

				ДатаПеревода = СоздатьИзменениеСтатуса(Результат.СтатусПлатежа, СтруктураПлатежа, Результат.ДокументОплаты); 
				Если ДатаПеревода = неопределено Тогда    
					Предупреждение("Ошибка при изменении статуса платежа (№ ЗБ " + сокрЛП(Стр.НомерЗБ) + "). Обратитесь к разработчикам.", 60);  
					Прервать;
				КонецЕсли;  
			КонецЕсли;	 
		КонецЕсли;	 
	Конеццикла;	       
	Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда 
		Предупреждение(СтрокаСообщение, 60); 
	КонецЕсли;	
	ТекСтрока = Элементы.РеестрыПлатежей.ТекущиеДанные;
	ЗаполнитьРасшифровку(ТекСтрока.РеестрПлатежей);   
	Элементы.РеестрыПлатежей.Обновить();    
	ОбновитьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура УточнитьИЗачислить(Команда) 
	ТекСтрока = Элементы.РасшифровкаРеестра.ТекущиеДанные;  
	Если ТекСтрока = неопределено Тогда
		Возврат;
	КонецЕсли;	     
	
	Если ПолучитьВидОперацииРеестраПлатежей(ТекСтрока.РеестрПлатежей) = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыБезналичныхПлатежей.ЛичныйКабинет") Тогда 
		Возврат;
	КонецЕсли;	
	
	Если ТекСтрока.ИтоговыйСтатус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.ЗачисленоПолностью") ИЛИ
		 ТекСтрока.ИтоговыйСтатус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.ЗачисленоЧастично") Тогда
		Предупреждение("Сумма платежа уже зачислена.", 60);
		Возврат;  
	ИначеЕсли ТекСтрока.ИтоговыйСтатус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.Возвращено") Тогда 
		Предупреждение("Сумма платежа возвращена, зачисление не возможно.", 60);
		Возврат; 
	ИначеЕсли ТекСтрока.ИтоговыйСтатус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.ОтнесеноВДоходы") Тогда  
		Предупреждение("Сумма платежа отнесена в доходы, зачисление не возможно.", 60);
		Возврат; 
	ИначеЕсли ТекСтрока.ИтоговыйСтатус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.Отменен") Тогда 
		Предупреждение("Платеж отменен, зачисление не возможно.", 60);
		Возврат; 
	КонецЕсли;	 
	
	СтруктураПлатежа = Новый Структура;	
	СтруктураПлатежа.Вставить("РеестрПлатежей", ТекСтрока.РеестрПлатежей); 
	СтруктураПлатежа.Вставить("ИдентификаторПлатежа", ТекСтрока.ИдентификаторПлатежа);
	СтруктураПлатежа.Вставить("ДатаПлатежа", ТекСтрока.ДатаПлатежа);
	СтруктураПлатежа.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет);
	СтруктураПлатежа.Вставить("СуммаПлатежа", ТекСтрока.СуммаПлатежа);
	СтруктураПлатежа.Вставить("НомерЗБ", ТекСтрока.НомерЗБ); 
	
	Если ПроверитьПлатежРаспределен(СтруктураПлатежа) Тогда
        Предупреждение("Сумма платежа распределена.", 60);
	    Возврат; 
	КонецЕсли;	
	
	ПараметрыФормы = Новый структура;   
	ПараметрыФормы.Вставить("РеестрПлатежей", ТекСтрока.РеестрПлатежей); 
	ПараметрыФормы.Вставить("ДатаПлатежа", ТекСтрока.ДатаПлатежа);
	ПараметрыФормы.Вставить("ИдентификаторПлатежа", ТекСтрока.ИдентификаторПлатежа);
	ПараметрыФормы.Вставить("СуммаПлатежа", ТекСтрока.СуммаПлатежа);
	ПараметрыФормы.Вставить("НомерЗБ", ТекСтрока.НомерЗБ); 	
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ЗачислитьПослеУточнения",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_УточнениеБезналичногоПлатежа", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаформы.БлокироватьОкноВладельца);  
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьФактическиеДанныеЗаемщика(ЗалоговыйБилет)  
	СтруктураВ = Новый Структура;
	СтруктураВ.Вставить("ФИОЗаемщика", "");
	СтруктураВ.Вставить("НомерТелефона", "");  
	СтруктураВ.Вставить("НомерЛомбарда", ЗалоговыйБилет.Ломбард.НомерЛомбарда);
    СтруктураВ.Вставить("Отделение", ЛБ_ОбщийМодуль.ПолучитьОтделениеЛомбарда(ТекущаяДатаСеанса(), ЗалоговыйБилет.Ломбард));
	
	Запрос = Новый Запрос;   
	Запрос.УстановитьПараметр("Залогодатель", ЗалоговыйБилет.Залогодатель);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия + "" "" + ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя + "" "" + ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК ФИОЗаемщика,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК НомерТелефона
	               |ИЗ
	               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";   
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураВ.Вставить("ФИОЗаемщика", Выборка.ФИОЗаемщика);
		СтруктураВ.Вставить("НомерТелефона", Выборка.НомерТелефона);  
	КонецЕсли;
	Возврат СтруктураВ;
КонецФункции

&НаКлиенте
Процедура ЗачислитьПослеУточнения(Результат, ДополнительныеПараметры) Экспорт 
	Если Результат = неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ТекСтрока = Элементы.РасшифровкаРеестра.ТекущиеДанные; 
		
	СтруктураПлатежа = Новый Структура;	
	СтруктураПлатежа.Вставить("РеестрПлатежей", ТекСтрока.РеестрПлатежей); 
	СтруктураПлатежа.Вставить("ИдентификаторПлатежа", ТекСтрока.ИдентификаторПлатежа);
	СтруктураПлатежа.Вставить("ДатаПлатежа", ТекСтрока.ДатаПлатежа);
	СтруктураПлатежа.Вставить("ЗалоговыйБилет", Результат.ЗалоговыйБилет);
	СтруктураПлатежа.Вставить("СуммаПлатежа", ТекСтрока.СуммаПлатежа);
	СтруктураПлатежа.Вставить("НомерЗБ", ТекСтрока.НомерЗБ);  
	
	//СообщениеПроверки = ПроверитьПлатеж(СтруктураПлатежа); 
	//Если НЕ ПустаяСтрока(СообщениеПроверки) Тогда
	//	Предупреждение(СообщениеПроверки, 60);
	//	Возврат; 
	//КонецЕсли;     
	
	ЗаполнитьОтменуЛКУточнениеПлатежа(Результат.ЗалоговыйБилет, ТекСтрока.ДатаПлатежа);
	Отбор = Новый Структура;
	Отбор.Вставить("ЗалоговыйБилет", Результат.ЗалоговыйБилет);
	СтрокиОтменитьЛК = ПлатежиЛКОтменить.НайтиСтроки(Отбор);   
	Если НЕ СтрокиОтменитьЛК.Количество() = 0 Тогда 
		Для каждого СтрЛК Из СтрокиОтменитьЛК Цикл 
			Если СтрЛК.СтатусПлатежа = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.Возвращено") ИЛИ
				 СтрЛК.СтатусПлатежа = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.ОтнесеноВДоходы") Тогда
				СтрокаПредупреждение = "В реестре ЛК № " + ПолучитьНомерРеестра(СтрЛК.РеестрПлатежей) + " найдены более поздние зачисления по залоговому билету № " + СокрЛП(Результат.НомерЗБ) + 
				    " со статусом платежа """ + Строка(СтрЛК.СтатусПлатежа) + """. Платеж в реестре ЛК отменить нельзя."; 
				Предупреждение(СтрокаПредупреждение, 60);
			    Возврат;    
			ИначеЕсли СтрЛК.СтатусПереплаты = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.Возвращено") ИЛИ
				 СтрЛК.СтатусПереплаты = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.ОтнесеноВДоходы") Тогда
				СтрокаПредупреждение = "В реестре ЛК № " + ПолучитьНомерРеестра(СтрЛК.РеестрПлатежей) + " найдены более поздние зачисления по залоговому билету № " + СокрЛП(Результат.НомерЗБ) + 
				    " со статусом переплаты """ + Строка(СтрЛК.СтатусПереплаты) + """. Платеж в реестре ЛК отменить нельзя."; 
				Предупреждение(СтрокаПредупреждение, 60);
			    Возврат; 	
			ИначеЕсли НЕ ЗначениеЗаполнено(СтрЛК.ДокументОплаты) Тогда
				Предупреждение("Не определен документ оплаты для отмены платежа в реестре ЛК." + Символы.ПС + "Обратитесь к разработчикам.", 60); 
				Возврат;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	

	ТекСтрока.ЗалоговыйБилет = Результат.ЗалоговыйБилет;
	ТекСтрока.НомерЗБФакт = Результат.НомерЗБ;  
   	Результат = ЗачислитьПлатеж(СтруктураПлатежа);
	Если Результат = неопределено Тогда    
		Предупреждение("Ошибка при зачислении платежа. Обратитесь к разработчикам.", 60);
	Иначе	     		
		СтрокаСообщение = Результат.Сообщение;
		Если НЕ СтрокиОтменитьЛК.Количество() = 0 Тогда 			
			Для каждого СтрЛК Из СтрокиОтменитьЛК Цикл  
				СтруктураПлатежаЛК = Новый Структура;	
				СтруктураПлатежаЛК.Вставить("РеестрПлатежей", СтрЛК.РеестрПлатежей); 
				СтруктураПлатежаЛК.Вставить("ИдентификаторПлатежа", СтрЛК.ИдентификаторПлатежа);
				СтруктураПлатежаЛК.Вставить("ДатаПлатежа", СтрЛК.ДатаПлатежа);
				СтруктураПлатежаЛК.Вставить("НомерЗБ", СтрЛК.НомерЗБ);
				СтруктураПлатежаЛК.Вставить("ЗалоговыйБилет", СтрЛК.ЗалоговыйБилет);
				СтруктураПлатежаЛК.Вставить("СуммаПлатежа", СтрЛК.СуммаПлатежа);  
				
				УдалитьЗаписьВРегистреОтменаПлатежейЛК(Текстрока.РеестрПлатежей, СтрЛК.ЗалоговыйБилет);
				
				РезультатЛК = ОтменитьОплатуЛК(СтруктураПлатежаЛК, СтрЛК.ДокументОплаты);
				Если НЕ РезультатЛК Тогда    
		             Предупреждение("Ошибка при отмене платежа по реестру ЛК. Обратитесь к разработчикам.", 60);
		             Возврат;
				 КонецЕсли;	     
				 
				 ЗаписатьИнформациюОбОтмененныхПлатежах(ТекСтрока.РеестрПлатежей, СтруктураПлатежаЛК);			 
				 СтрокаСообщение = СтрокаСообщение + ?(ПустаяСтрока(СтрокаСообщение), "", Символы.ПС) + "В реестре платежей № " + ПолучитьНомерДатуРеестраПлатежей(СтрЛК.РеестрПлатежей) + " отменена оплата по ЗБ № " + СокрЛП(СтрЛК.НомерЗБ); 				 
			 КонецЦикла;	  
		КонецЕсли;	 

		ТекСтрока.ИтоговыйСтатус = Результат.СтатусПлатежа;
		ТекСтрока.ОплатаПроценты = Результат.ОплатаПроценты; 
		ТекСтрока.ОплатаЗайм = Результат.ОплатаЗайм; 
		ТекСтрока.Переплата = Результат.Переплата; 
		ТекСтрока.СтатусЗБ = ПолучитьТекущийстатусЗБ(ТекСтрока.ЗалоговыйБилет); 
		ТекСтрока.Ответственный = ТекущийПользователь();   
		ТекСтрока.ДокументОплаты = Результат.ДокументОплаты;
			
		ДатаПеревода = СоздатьИзменениеСтатуса(Результат.СтатусПлатежа, СтруктураПлатежа, Результат.ДокументОплаты); 
		Если ДатаПеревода = неопределено Тогда    
			Предупреждение("Ошибка при зачислении платежа. Обратитесь к разработчикам.", 60);
		Иначе	    
			Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
				Предупреждение(СтрокаСообщение, 60);
			КонецЕсли;	

			ТекСтрока.ДатаПеревода = ДатаПеревода;
			Элементы.РеестрыПлатежей.Обновить();
			ОбновитьИтоги();
		КонецЕсли;	 
	КонецЕсли;	 
КонецПроцедуры


&НаСервере
Функция ПроверитьПлатежРаспределен(СтруктураПлатежа)
    Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("РеестрПлатежей", СтруктураПлатежа.РеестрПлатежей); 
	Запрос.УстановитьПараметр("НомерЗБ", СтруктураПлатежа.НомерЗБ); 
	Запрос.УстановитьПараметр("ДатаПлатежа", СтруктураПлатежа.ДатаПлатежа); 
	Запрос.УстановитьПараметр("ИдентификаторПлатежа", СтруктураПлатежа.ИдентификаторПлатежа); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.РеестрПлатежей КАК РеестрПлатежей,
	               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.НомерЗБ КАК НомерЗБ,
	               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.ДатаПлатежа КАК ДатаПлатежа,
	               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
	               |	СУММА(ЛБ_БезналичныеПлатежиКРаспределениюОстатки.СуммаОстаток) КАК СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.ЛБ_БезналичныеПлатежиКРаспределению.Остатки(
	               |			,
	               |			РеестрПлатежей = &РеестрПлатежей
	               |				И НомерЗБ = &НомерЗБ
	               |				И ДатаПлатежа = &ДатаПлатежа
	               |				И ИдентификаторПлатежа = &ИдентификаторПлатежа) КАК ЛБ_БезналичныеПлатежиКРаспределениюОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.РеестрПлатежей,
	               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.ИдентификаторПлатежа,
	               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.ДатаПлатежа,
	               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.НомерЗБ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат ?(НЕ Выборка.СуммаОстаток = 0, ложь, Истина);
	КонецЕсли;	                                             
	Возврат Истина;
КонецФункции	

&НаСервере
Функция СоздатьИзменениеСтатуса(НовыйСтатусПлатежа, СтруктураПлатежа, ДокументОплаты = неопределено)
	НовыйДок = Документы.ЛБ_ИзменениеСтатусаБезналичногоПлатежа.СоздатьДокумент();
	НовыйДок.РеестрПлатежей = СтруктураПлатежа.РеестрПлатежей; 
	НовыйДок.ИдентификаторПлатежа =	СтруктураПлатежа.ИдентификаторПлатежа;
	НовыйДок.ДатаПлатежа =	СтруктураПлатежа.ДатаПлатежа;
	НовыйДок.НомерЗБ =	СтруктураПлатежа.НомерЗБ;
	НовыйДок.ЗалоговыйБилет =	СтруктураПлатежа.ЗалоговыйБилет;
	НовыйДок.СуммаПлатежа = СтруктураПлатежа.СуммаПлатежа; 
	НовыйДок.Ответственный = Пользователи.ТекущийПользователь();
    НовыйДок.НовыйСтатусПлатежа = НовыйСтатусПлатежа;
	НовыйДок.Дата = ТекущаяДатаСеанса();  
	НовыйДок.ВидОперации = Перечисления.ЛБ_ВидыИзмененийБезналичныхПлатежей.Изменение;
	Если НЕ ДокументОплаты = неопределено Тогда
		НовыйДок.ДокументОплаты = ДокументОплаты;
	КонецЕсли;	
	НовыйДок.Записать(РежимЗаписиДокумента.Запись);
	
	Попытка   
		НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
		Возврат НовыйДок.Дата;
	Исключение	              
		Возврат Неопределено;
	КонецПопытки	
КонецФункции	  

&НаСервере
Функция СоздатьИзменениеСтатусаОтмена(СтруктураПлатежа, ДокументОплаты = неопределено)
	НовыйДок = Документы.ЛБ_ИзменениеСтатусаБезналичногоПлатежа.СоздатьДокумент();
	НовыйДок.РеестрПлатежей = СтруктураПлатежа.РеестрПлатежей; 
	НовыйДок.ИдентификаторПлатежа =	СтруктураПлатежа.ИдентификаторПлатежа;
	НовыйДок.ДатаПлатежа =	СтруктураПлатежа.ДатаПлатежа;
	НовыйДок.НомерЗБ =	СтруктураПлатежа.НомерЗБ;
	НовыйДок.ЗалоговыйБилет =	СтруктураПлатежа.ЗалоговыйБилет;
	НовыйДок.СуммаПлатежа = СтруктураПлатежа.СуммаПлатежа; 
	НовыйДок.Ответственный = Пользователи.ТекущийПользователь();
	ТекущийСтатусПлатежа = ЛБ_ОбщийМодуль.ПолучитьИтоговыйСтатусБезналичногоПлатежа(ТекущаяДатаСеанса(), СтруктураПлатежа.РеестрПлатежей, СтруктураПлатежа.ИдентификаторПлатежа, СтруктураПлатежа.ДатаПлатежа, СтруктураПлатежа.НомерЗБ); 
	Если ТекущийСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.Возвращено ИЛИ
		 ТекущийСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ОтнесеноВДоходы Тогда  
		НовыйДок.НовыйСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ПустаяСсылка(); 
	Иначе			 
	    НовыйДок.НовыйСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.Отменен;
	КонецЕсли;	
	НовыйДок.Дата = ТекущаяДатаСеанса();  
	НовыйДок.ВидОперации = Перечисления.ЛБ_ВидыИзмененийБезналичныхПлатежей.ОтменаИзменения;
	Если НЕ ДокументОплаты = неопределено Тогда
		НовыйДок.ДокументОплаты = ДокументОплаты;
	КонецЕсли;	
	НовыйДок.Записать(РежимЗаписиДокумента.Запись);
	
	Попытка   
		НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
			
		ЗапросИтог = Новый Запрос; 
		ЗапросИтог.УстановитьПараметр("Регистратор", НовыйДок.Ссылка);
		ЗапросИтог.Текст = "ВЫБРАТЬ
		                   |	ЛБ_РеестрБезначныхПлатежей.СтатусПлатежа КАК СтатусПлатежа,
		                   |	ЛБ_РеестрБезначныхПлатежей.Период КАК ДатаПеревода
		                   |ИЗ
		                   |	РегистрСведений.ЛБ_РеестрБезначныхПлатежей КАК ЛБ_РеестрБезначныхПлатежей
		                   |ГДЕ
		                   |	ЛБ_РеестрБезначныхПлатежей.Регистратор = &Регистратор";  
		Выборка = Запроситог.Выполнить().Выбрать(); 
		Если Выборка.Следующий() тогда    
			Результат = новый Структура;
		    Результат.Вставить("ДатаПеревода", Выборка.ДатаПеревода);
			Результат.Вставить("СтатусПлатежа", Выборка.СтатусПлатежа); 
		КонецЕсли;                                      
		Возврат Результат;
	Исключение	              
		Возврат Неопределено;
	КонецПопытки	
КонецФункции	


&НаСервере
Функция ТекущийПользователь() 
	Возврат Пользователи.ТекущийПользователь();
КонецФункции

&НаКлиенте
Процедура КВозврату(Команда)
	ТекСтрока = Элементы.РасшифровкаРеестра.ТекущиеДанные; 
	Если ТекСтрока = неопределено Тогда
		Возврат;
	КонецЕсли;	    
	
	Если ПолучитьВидОперацииРеестраПлатежей(ТекСтрока.РеестрПлатежей) = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыБезналичныхПлатежей.ЛичныйКабинет") Тогда 
		Возврат;
	КонецЕсли;	

	НовыйСтатусПлатежа = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.КВозврату");
	Если ТекСтрока.ИтоговыйСтатус = НовыйСтатусПлатежа Тогда
		Возврат;
	ИначеЕсли ТекСтрока.ИтоговыйСтатус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.ПустаяСсылка")  ИЛИ
		      ТекСтрока.ИтоговыйСтатус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.ДоВыяснения") Тогда
		СтруктураПлатежа = Новый Структура;	
		СтруктураПлатежа.Вставить("РеестрПлатежей", ТекСтрока.РеестрПлатежей); 
		СтруктураПлатежа.Вставить("ИдентификаторПлатежа", ТекСтрока.ИдентификаторПлатежа);
		СтруктураПлатежа.Вставить("ДатаПлатежа", ТекСтрока.ДатаПлатежа);
		СтруктураПлатежа.Вставить("НомерЗБ", ТекСтрока.НомерЗБ);
		СтруктураПлатежа.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет);
		СтруктураПлатежа.Вставить("СуммаПлатежа", ТекСтрока.СуммаПлатежа);  
		Если НЕ ПроверитьПлатежРаспределен(СтруктураПлатежа) Тогда
			ДатаПеревода = СоздатьИзменениеСтатуса(НовыйСтатусПлатежа, СтруктураПлатежа);
			Если ДатаПеревода = неопределено Тогда    
				Предупреждение("Ошибка при изменении статуса платежа. Обратитесь к разработчикам.", 60);
			Иначе	
				ТекСтрока.ИтоговыйСтатус = НовыйСтатусПлатежа;  
				ТекСтрока.ДатаПеревода = ДатаПеревода;  
				ТекСтрока.Ответственный = ТекущийПользователь();
				Элементы.РеестрыПлатежей.Обновить(); 
			КонецЕсли;
		Иначе     
			Предупреждение("Сумма платежа распределена.", 60);
		КонецЕсли;	
	Иначе  
		Предупреждение("Изменение статуса платежа невозможно.", 60);	  
	КонецЕсли;		  
КонецПроцедуры


&НаКлиенте
Процедура ВозвратПлатежа(Команда)
	ТекСтрока = Элементы.РасшифровкаРеестра.ТекущиеДанные;  
	Если ТекСтрока = неопределено Тогда
		Возврат;
	КонецЕсли;	  
	
	Если ТекСтрока.ИтоговыйСтатус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.Отменен") Тогда 
		Предупреждение("Платеж отменен, возврат не возможен.", 60);
		Возврат; 
	ИначеЕсли ТекСтрока.ИтоговыйСтатус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.Возвращено") Тогда  
		Предупреждение("Платеж уже возвращен.", 60);
		Возврат; 
	ИначеЕсли ТекСтрока.ИтоговыйСтатус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.ОтнесеноВДоходы") Тогда  
		Предупреждение("Сумма платежа отнесена в доходы, возврат не возможен.", 60);
		Возврат; 
	ИначеЕсли НЕ (ТекСтрока.ОплатаПроценты + ТекСтрока.ОплатаЗайм) = 0  Тогда
		Предупреждение("Сумма платежа зачислена, возврат не возможен.", 60);
		Возврат;  
	КонецЕсли;	

	НовыйСтатусПлатежа = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.Возвращено");
	СтруктураПлатежа = Новый Структура;	
	СтруктураПлатежа.Вставить("РеестрПлатежей", ТекСтрока.РеестрПлатежей); 
	СтруктураПлатежа.Вставить("ИдентификаторПлатежа", ТекСтрока.ИдентификаторПлатежа);
	СтруктураПлатежа.Вставить("ДатаПлатежа", ТекСтрока.ДатаПлатежа);
	СтруктураПлатежа.Вставить("НомерЗБ", ТекСтрока.НомерЗБ);
	СтруктураПлатежа.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет);
	СтруктураПлатежа.Вставить("СуммаПлатежа", ТекСтрока.СуммаПлатежа);
	Если НЕ ПроверитьПлатежРаспределен(СтруктураПлатежа) Тогда
		ДатаПеревода = СоздатьИзменениеСтатуса(НовыйСтатусПлатежа, СтруктураПлатежа);
		Если ДатаПеревода = неопределено Тогда    
			Предупреждение("Ошибка при возврате платежа. Обратитесь к разработчикам.", 60);
		Иначе	
			ТекСтрока.ИтоговыйСтатус = НовыйСтатусПлатежа;  
			ТекСтрока.ДатаПеревода = ДатаПеревода;     
			ТекСтрока.Возврат = ТекСтрока.СуммаПлатежа;
			ТекСтрока.Ответственный = ТекущийПользователь();
			Элементы.РеестрыПлатежей.Обновить();
			ОбновитьИтоги();
		КонецЕсли;
	Иначе
		Предупреждение("Сумма платежа распределена.", 60);
	КонецЕсли;	
КонецПроцедуры     

&НаКлиенте
Процедура ПослеОтветаНаВопросОтмена(Результат, Параметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда 
		ТекСтрока = Элементы.РасшифровкаРеестра.ТекущиеДанные;
        СтруктураПлатежа = Новый Структура;	
		СтруктураПлатежа.Вставить("РеестрПлатежей", ТекСтрока.РеестрПлатежей); 
		СтруктураПлатежа.Вставить("ИдентификаторПлатежа", ТекСтрока.ИдентификаторПлатежа);
		СтруктураПлатежа.Вставить("ДатаПлатежа", ТекСтрока.ДатаПлатежа);
		СтруктураПлатежа.Вставить("НомерЗБ", ТекСтрока.НомерЗБ);
		СтруктураПлатежа.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет);
		СтруктураПлатежа.Вставить("СуммаПлатежа", ТекСтрока.СуммаПлатежа);
		РезультатОтмены = СоздатьИзменениеСтатусаОтмена(СтруктураПлатежа);
		Если РезультатОтмены = неопределено Тогда    
			Предупреждение("Ошибка при отмене платежа. Обратитесь к разработчикам.", 60);
		Иначе	        
			ТекСтрока.ИтоговыйСтатус = РезультатОтмены.СтатусПлатежа;  
			ТекСтрока.ДатаПеревода = РезультатОтмены.ДатаПеревода; 
			ТекСтрока.Ответственный = ТекущийПользователь();
			Элементы.РеестрыПлатежей.Обновить(); 
			ОбновитьИтоги();
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры		

&НаКлиенте
Процедура ДоВыяснения(Команда)
	ТекСтрока = Элементы.РасшифровкаРеестра.ТекущиеДанные;  
	Если ТекСтрока = неопределено Тогда
		Возврат;
	КонецЕсли;	        
	
	Если ПолучитьВидОперацииРеестраПлатежей(ТекСтрока.РеестрПлатежей) = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыБезналичныхПлатежей.ЛичныйКабинет") Тогда 
		Возврат;
	КонецЕсли;	

	НовыйСтатусПлатежа = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.ДоВыяснения");
	Если ТекСтрока.ИтоговыйСтатус = НовыйСтатусПлатежа Тогда
		Возврат;
	ИначеЕсли ТекСтрока.ИтоговыйСтатус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.ПустаяСсылка")  ИЛИ
		      ТекСтрока.ИтоговыйСтатус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.КВозврату") Тогда
		СтруктураПлатежа = Новый Структура;	
		СтруктураПлатежа.Вставить("РеестрПлатежей", ТекСтрока.РеестрПлатежей); 
		СтруктураПлатежа.Вставить("ИдентификаторПлатежа", ТекСтрока.ИдентификаторПлатежа);
		СтруктураПлатежа.Вставить("ДатаПлатежа", ТекСтрока.ДатаПлатежа);
		СтруктураПлатежа.Вставить("НомерЗБ", ТекСтрока.НомерЗБ);
		СтруктураПлатежа.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет);
		СтруктураПлатежа.Вставить("СуммаПлатежа", ТекСтрока.СуммаПлатежа); 
		
		Если НЕ ПроверитьПлатежРаспределен(СтруктураПлатежа) Тогда
			ДатаПеревода = СоздатьИзменениеСтатуса(НовыйСтатусПлатежа, СтруктураПлатежа);
			Если ДатаПеревода = неопределено Тогда    
				Предупреждение("Ошибка при изменении статуса платежа. Обратитесь к разработчикам.", 60);
			Иначе	
				ТекСтрока.ИтоговыйСтатус = НовыйСтатусПлатежа;  
				ТекСтрока.ДатаПеревода = ДатаПеревода; 
				ТекСтрока.Ответственный = ТекущийПользователь();
				Элементы.РеестрыПлатежей.Обновить();   
				ОбновитьИтоги();
			КонецЕсли;
		Иначе	
		    Предупреждение("Сумма платежа распределена.", 60); 
        КонецЕсли;
	Иначе  
		Предупреждение("Изменение статуса платежа невозможно.", 60);	  
	КонецЕсли;		  
КонецПроцедуры

&НаКлиенте
Процедура ОтнесеноВДоходы(Команда)
	ТекСтрока = Элементы.РасшифровкаРеестра.ТекущиеДанные;  
	Если ТекСтрока = неопределено Тогда
		Возврат;
	КонецЕсли;    
	
	Если ПолучитьВидОперацииРеестраПлатежей(ТекСтрока.РеестрПлатежей) = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыБезналичныхПлатежей.ЛичныйКабинет") Тогда 
		Возврат;
	КонецЕсли;	

	Если ТекСтрока.ИтоговыйСтатус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.Отменен") Тогда 
		Предупреждение("Платеж отменен.", 60);
		Возврат; 
	ИначеЕсли ТекСтрока.ИтоговыйСтатус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.ОтнесеноВДоходы") Тогда 
		Предупреждение("Платеж уже отнесен в доходы.", 60);
	    Возврат; 
	ИначеЕсли НЕ (ТекСтрока.ОплатаПроценты + ТекСтрока.ОплатаЗайм) = 0  Тогда
		Предупреждение("Сумма платежа уже зачислена.", 60);
		Возврат;  
	ИначеЕсли ТекСтрока.ИтоговыйСтатус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.Возвращено") Тогда 
		Предупреждение("Сумма платежа возвращена.", 60);
		Возврат; 
	КонецЕсли;	

	НовыйСтатусПлатежа = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.ОтнесеноВДоходы");
	СтруктураПлатежа = Новый Структура;	
	СтруктураПлатежа.Вставить("РеестрПлатежей", ТекСтрока.РеестрПлатежей); 
	СтруктураПлатежа.Вставить("ИдентификаторПлатежа", ТекСтрока.ИдентификаторПлатежа);
	СтруктураПлатежа.Вставить("ДатаПлатежа", ТекСтрока.ДатаПлатежа);
	СтруктураПлатежа.Вставить("НомерЗБ", ТекСтрока.НомерЗБ);
	СтруктураПлатежа.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет);
	СтруктураПлатежа.Вставить("СуммаПлатежа", ТекСтрока.СуммаПлатежа);  
	Если НЕ ПроверитьПлатежРаспределен(СтруктураПлатежа) Тогда
		ДатаПеревода = СоздатьИзменениеСтатуса(НовыйСтатусПлатежа, СтруктураПлатежа);
		Если ДатаПеревода = неопределено Тогда    
			Предупреждение("Ошибка при отнесении платежа в доходы. Обратитесь к разработчикам.", 60);
		Иначе	
			ТекСтрока.ИтоговыйСтатус = НовыйСтатусПлатежа;  
			ТекСтрока.ДатаПеревода = ДатаПеревода;  
			ТекСтрока.Ответственный = ТекущийПользователь();
			Элементы.РеестрыПлатежей.Обновить();
			ОбновитьИтоги();
		КонецЕсли;
	Иначе	
	    Предупреждение("Сумма платежа распределена.", 60);
		Возврат; 
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоНомеруЗБ(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораЗБ", 
      ЭтотОбъект);	
 
    ПоказатьВводЗначения(
        Оповещение,
        , 
		"Введите номер ЗБ",
        "Строка"
    );
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВыбораЗБ(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли; 
	
	Элементы.РеестрыПлатежейПоискПоНомеруЗБ.Заголовок = "Поиск по залоговому билету № " + Результат; 
	
	РеестрыПлатежей.Отбор.Элементы.Очистить();   
	
	ГруппаОтбора = РеестрыПлатежей.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИЛИ;
 
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("РеестрПлатежей.ПлатежиБН.НомерЗБ");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.ПравоеЗначение = Результат;
 
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("РеестрПлатежей.ПлатежиЛК.НомерЗБ");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.ПравоеЗначение = Результат;

	Элементы.РеестрыПлатежей.Обновить(); 
	Элементы.РеестрыПлатежей.ТекущаяСтрока = 1;
	ТекСтрока = Элементы.РеестрыПлатежей.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда  
		ЗаполнитьРасшифровку(ТекСтрока.РеестрПлатежей);   
		Отбор = Новый Структура;
		Отбор.Вставить("НомерЗБ", Результат);
		Строки = РасшифровкаРеестра.НайтиСтроки(Отбор); 
		Если НЕ Строки.Количество() = 0 Тогда   
			Строка = Строки.Получить(0);
			ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
			Элементы.РасшифровкаРеестра.ТекущаяСтрока = ИдентификаторСтроки;   
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры  

&НаКлиенте
Процедура ОтменитьПоискПоНомеруЗБ(Команда)
	РеестрыПлатежей.Отбор.Элементы.Очистить();
	//Элементы.ПоискПоНомеруЗБ.Видимость = Ложь; 
	Элементы.РеестрыПлатежейПоискПоНомеруЗБ.Заголовок = "Поиск по номеру залогового билета";
	Элементы.РеестрыПлатежей.Обновить();
КонецПроцедуры

&НаСервере
Функция ПроверитьОтменуРеестра(РеестрПлатежей)
	СообщенияПроверкиОтменыРеестра = "";
	СписокЗБВозврат = Новый СписокЗначений; 
	СписокЗБДоходы = Новый СписокЗначений;  
	СписокЗБЗачисление = Новый СписокЗначений;
	
	ТаблицаСтатусов = ЛБ_ОбщийМодуль.ПолучитьСтатусыБезналичныхПлатежей(, РеестрПлатежей);  
	ТаблицаСтатусовПереплата = ЛБ_ОбщийМодуль.ПолучитьСтатусыБезналичныхПлатежейПереплата(, РеестрПлатежей);
	Для каждого стр Из ТаблицаСтатусов Цикл 
		Если Стр.СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ЗачисленоПолностью ИЛИ 
			 Стр.СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ЗачисленоЧастично Тогда
		    СтруктураПлатежа = Новый Структура;	
			СтруктураПлатежа.Вставить("РеестрПлатежей", РеестрПлатежей); 
			СтруктураПлатежа.Вставить("ИдентификаторПлатежа", Стр.ИдентификаторПлатежа);
			СтруктураПлатежа.Вставить("ДатаПлатежа", Стр.ДатаПлатежа);
			СтруктураПлатежа.Вставить("ЗалоговыйБилет", Стр.ЗалоговыйБилет);
			СтруктураПлатежа.Вставить("СуммаПлатежа", Стр.СуммаПлатежа);
			СтруктураПлатежа.Вставить("НомерЗБ", Стр.НомерЗБ); 
						
			СообщениеПроверки = ПроверитьПлатеж(СтруктураПлатежа, Истина); 
			Если НЕ ПустаяСтрока(СообщениеПроверки) Тогда   
				Если СписокЗБЗачисление.НайтиПоЗначению(Стр.НомерЗБ) = неопределено Тогда 
				    СписокЗБЗачисление.Вставить(Стр.НомерЗБ, СообщениеПроверки); 
				КонецЕсли;	
				//СообщенияПроверкиОтменыРеестра = СообщенияПроверкиОтменыРеестра + ?(ПустаяСтрока(СообщенияПроверкиОтменыРеестра), "", символы.ПС) + СообщениеПроверки; 
			КонецЕсли;     
		ИначеЕсли Стр.СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.Возвращено Тогда 
			Если СписокЗБВозврат.НайтиПоЗначению(Стр.НомерЗБ) = неопределено Тогда 
			    СписокЗБВозврат.Добавить(Стр.НомерЗБ, Стр.НомерЗБ);  
			КонецЕсли;	
		ИначеЕсли Стр.СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ОтнесеноВДоходы Тогда 
			Если СписокЗБДоходы.НайтиПоЗначению(Стр.НомерЗБ) = неопределено Тогда 
			    СписокЗБДоходы.Добавить(Стр.НомерЗБ, Стр.НомерЗБ);
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;	
	Для каждого стрП Из ТаблицаСтатусовПереплата Цикл   
		Если СтрП.СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ЗачисленоПолностью ИЛИ 
			 СтрП.СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ЗачисленоЧастично Тогда
		    СтруктураПлатежа = Новый Структура;	
			СтруктураПлатежа.Вставить("РеестрПлатежей", РеестрПлатежей); 
			СтруктураПлатежа.Вставить("ИдентификаторПлатежа", СтрП.ИдентификаторПлатежа);
			СтруктураПлатежа.Вставить("ДатаПлатежа", СтрП.ДатаПлатежа);
			СтруктураПлатежа.Вставить("ЗалоговыйБилет", СтрП.ЗалоговыйБилет);
			СтруктураПлатежа.Вставить("СуммаПлатежа", СтрП.СуммаПлатежа);
			СтруктураПлатежа.Вставить("НомерЗБ", СтрП.НомерЗБ); 
						
			СообщениеПроверки = ПроверитьПлатеж(СтруктураПлатежа, Истина); 
			Если НЕ ПустаяСтрока(СообщениеПроверки) Тогда  
				Если СписокЗБЗачисление.НайтиПоЗначению(СтрП.НомерЗБ) = неопределено Тогда 
				    СписокЗБЗачисление.Вставить(СтрП.НомерЗБ, СообщениеПроверки + " (обработка переплаты " + СокрЛП(СтрП.НомерЗБ) + ")."); 
				КонецЕсли;	
				//СообщенияПроверкиОтменыРеестра = СообщенияПроверкиОтменыРеестра + ?(ПустаяСтрока(СообщенияПроверкиОтменыРеестра), "", символы.ПС) + СообщениеПроверки + " (обработка переплаты " + СокрЛП(СтрП.НомерЗБ) + ")."; 
			КонецЕсли;     
		ИначеЕсли СтрП.СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.Возвращено Тогда 
			Если СписокЗБВозврат.НайтиПоЗначению(СтрП.НомерЗБ) = неопределено Тогда
			    СписокЗБВозврат.Добавить(СтрП.НомерЗБ, СокрЛП(СтрП.НомерЗБ) + " (обработка переплаты " + СокрЛП(СтрП.НомерЗБ) + ").");
			КонецЕсли;	
		ИначеЕсли СтрП.СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ОтнесеноВДоходы Тогда	
			Если СписокЗБДоходы.НайтиПоЗначению(СтрП.НомерЗБ) = неопределено Тогда
			    СписокЗБДоходы.Добавить(СтрП.НомерЗБ, СокрЛП(СтрП.НомерЗБ) + " (обработка переплаты " + СокрЛП(СтрП.НомерЗБ) + ").");
			КонецЕсли;	
		КонецЕсли;	
	Конеццикла;	      
	Для каждого Эл Из СписокЗБЗачисление Цикл
		СообщенияПроверкиОтменыРеестра = СообщенияПроверкиОтменыРеестра + ?(ПустаяСтрока(СообщенияПроверкиОтменыРеестра), "", символы.ПС) + СокрЛП(Эл.Представление);
	КонецЦикла;	

 	СтрокаЗБВозврат = "";  
	Для каждого Эл Из СписокЗБВозврат Цикл
		СтрокаЗБВозврат = СтрокаЗБВозврат + ?(ПустаяСтрока(СтрокаЗБВозврат), "", ", ") + СокрЛП(Эл.Представление);
	КонецЦикла;	  
	Если НЕ ПустаяСтрока(СтрокаЗБВозврат) Тогда   
		СообщенияПроверкиОтменыРеестра = СообщенияПроверкиОтменыРеестра + ?(ПустаяСтрока(СообщенияПроверкиОтменыРеестра), "", символы.ПС) + "Платежи по ЗБ " + СтрокаЗБВозврат + " возвращены.";
	КонецЕсли;	 

	СтрокаЗБДоходы = "";  
	Для каждого Эл Из СписокЗБДоходы Цикл
		СтрокаЗБДоходы = СтрокаЗБДоходы + ?(ПустаяСтрока(СтрокаЗБДоходы), "", ", ") + СокрЛП(Эл.Представление);
	КонецЦикла;	
	Если НЕ ПустаяСтрока(СтрокаЗБДоходы) Тогда    
		СообщенияПроверкиОтменыРеестра = СообщенияПроверкиОтменыРеестра + ?(ПустаяСтрока(СообщенияПроверкиОтменыРеестра), "", символы.ПС) + "Платежи по ЗБ " + СтрокаЗБВозврат + " отнесены в доходы.";
	КонецЕсли;		
	
	Возврат СообщенияПроверкиОтменыРеестра;    
КонецФункции

&НаСервере
Функция ОтменитьРеестрНаСервере(РеестрПлатежей) 
	НовыйДок = Документы.ЛБ_ОтменаРеестраПлатежей.СоздатьДокумент();
	НовыйДок.Дата = ТекущаяДатаСеанса();
	НовыйДок.РеестрПлатежей = РеестрПлатежей;
	НовыйДок.Ответственный = пользователи.ТекущийПользователь();
	НовыйДок.Записать(РежимЗаписиДокумента.Запись);  
	
	Попытка  
		НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
		Возврат Истина;
	Исключение  
		Возврат Ложь;
	КонецПопытки;	
КонецФункции

&НаКлиенте
Процедура ОтменитьРеестр(Команда) 
	ТекСтрока = Элементы.РеестрыПлатежей.ТекущиеДанные;  
	Если НЕ ТекСтрока = неопределено Тогда  
		СообщениеПроверки = ПроверитьОтменуРеестра(ТекСтрока.РеестрПлатежей);
		Если НЕ ПустаяСтрока(СообщениеПроверки) Тогда   
			СообщениеПроверки = "ВНИМАНИЕ!" + Символы.ПС + СообщениеПроверки + Символы.ПС + "Отмена реестра запрещена.";
			Предупреждение(СообщениеПроверки, 60);
		Иначе	      
			Если ОтменитьПлатежи(ТекСтрока.РеестрПлатежей) Тогда
				Если ОтменитьРеестрНаСервере(ТекСтрока.РеестрПлатежей) Тогда
					Элементы.РеестрыПлатежей.Обновить();
				Иначе
					Предупреждение("Ошибка при отмене реестра платежей. Обратитесь к разработчикам.", 60);
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УдалитьЗаписьВРегистреОтменаПлатежейЛК(РеестрПлатежей, ЗалоговыйБилет) 
	НаборЗаписей = РегистрыСведений.ЛБ_ОтменаПлатежейЛК.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.РеестрПлатежей.Установить(РеестрПлатежей); 
	НаборЗаписей.Отбор.ЗалоговыйБилетЛК.Установить(ЗалоговыйБилет);
    НаборЗаписей.Записать(); 
КонецПроцедуры	  

&НаСервере
Процедура ЗаписатьИнформациюОботмененныхПлатежах(РеестрПлатежей, СтруктураПлатежаЛК)
    МенеджерЗаписи = РегистрыСведений.ЛБ_ОтменаПлатежейЛК.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.РеестрПлатежей = РеестрПлатежей; 
	МенеджерЗаписи.РеестрПлатежейЛК = СтруктураПлатежаЛК.РеестрПлатежей; 
	МенеджерЗаписи.ИдентификаторПлатежаЛК = СтруктураПлатежаЛК.ИдентификаторПлатежа;
    МенеджерЗаписи.ДатаПлатежаЛК = СтруктураПлатежаЛК.ДатаПлатежа;
	МенеджерЗаписи.НомерЗБЛК = СтруктураПлатежаЛК.НомерЗБ;
	МенеджерЗаписи.ЗалоговыйБилетЛК = СтруктураПлатежаЛК.ЗалоговыйБилет;
	МенеджерЗаписи.СуммаПлатежаЛК = СтруктураПлатежаЛК.СуммаПлатежа;
				 
	МенеджерЗаписи.Записать();	  
КонецПроцедуры

&НаСервере
Функция ОтменаОплатыНаСервере(ДокументОплаты)
	ДокументОбъект = Документы.ЛБ_ОперацияПоЗалогу.СоздатьДокумент(); 
	ДокументОбъект.Дата = ДокументОплаты.Дата;
	ДокументОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаОплаты;  
	ЗалоговыйБилет = ДокументОплаты.ПредыдущаяОперация; 
	ДокументОбъект.ПредыдущаяОперация = ЗалоговыйБилет;
	ДокументОбъект.Организация = ЗалоговыйБилет.Организация; 
	ДокументОбъект.Товары.Загрузить(ДокументОплаты.Товары.Выгрузить());
	ДокументОбъект.СтатусЗалогодателя = ЛБ_УправлениеЛомбардом.ПолучитьТекущийСтатусКлиента(ДокументОбъект.Дата, ЗалоговыйБилет.Залогодатель);
	
	ДокументОбъект.Ломбард = ДокументОплаты.Ломбард; 
	ДокументОбъект.Ответственный = Пользователи.ТекущийПользователь();
	ДокументОбъект.СхемаКредитования = ЗалоговыйБилет.СхемаКредитования;  
	ДокументОбъект.СрокЗалога = ЗалоговыйБилет.СрокЗалога; 
	ДокументОбъект.Акция = ЗалоговыйБилет.Акция;
	ДокументОбъект.НомерЗалоговогоБилета = ЗалоговыйБилет.НомерЗалоговогоБилета;  
	ДокументОбъект.ОтмененныйДокумент = ДокументОплаты; 
	
	СостояниеЗБДоОплаты = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗалоговогоБилета(ДокументОплаты, ЗалоговыйБилет);
	ДокументОбъект.НомерДопСоглашения = СостояниеЗБДоОплаты.НомерДопСоглашения; 
	ДокументОбъект.ДатаВыкупа = СостояниеЗБДоОплаты.ДатаВыкупа;
	ДокументОбъект.ДатаВыкупаЛьготная = СостояниеЗБДоОплаты.ДатаВыкупаЛьготныйСрок;
	
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Дата", ДокументОплаты.Дата-1); 
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаДолгаЗайма КАК Задолженность
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(&Дата, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних";
    ТаблицаОЗ = Запрос.Выполнить().Выгрузить();
	
    ДокументОбъект.ТоварыОтмена.Очистить();
	Для каждого стр из ДокументОбъект.Товары Цикл 		
		СтрТОт = ДокументОбъект.ТоварыОтмена.Добавить();
		СтрТОт.ОбъектЗалога = стр.ОбъектЗалога;  
		Отбор = Новый структура;
		Отбор.Вставить("ОбъектЗалога", стр.ОбъектЗалога);
		СтрокиОЗ = ТаблицаОЗ.НайтиСтроки(Отбор);   
		Если НЕ СтрокиОЗ.Количество() = 0 Тогда 
			СтрОЗ = СтрокиОЗ.Получить(0);
			СтрТОт.Статус = СтрОЗ.СтатусОбъектаЗалога;
			СтрТОт.СуммаОценки = СтрОЗ.Задолженность;
		КонецЕсли;	
	Конеццикла;
			
	СостояниеДоОтменяемойОперации = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(ДокументОбъект.НомерЗалоговогоБилета, ДокументОплаты.Дата-1,, Истина);
	
	Если СостояниеДоОтменяемойОперации <> Неопределено Тогда
		ДокументОбъект.СуммаОплаты = -ДокументОплаты.СуммаОплаты;
		ДокументОбъект.СуммаОплатыПроценты = -ДокументОплаты.СуммаОплатыПроценты;
		ДокументОбъект.СуммаОплатыСсуда = -ДокументОплаты.СуммаОплатыСсуда;
		ДокументОбъект.СуммаСсуды = СостояниеДоОтменяемойОперации.Регистратор.СуммаСсуды;
		ДокументОбъект.Выкуп = СостояниеДоОтменяемойОперации.Регистратор.Выкуп;
		ДокументОбъект.ВыдачаЗалога = СостояниеДоОтменяемойОперации.Регистратор.ВыдачаЗалога;
	КонецЕсли;
	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	Попытка         		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		ДокументОтмены = ДокументОбъект.Ссылка;
		
		//Установка отментки об отмене документа в отменяемом документе
		ОтменяемыйДокумент = ДокументОплаты.ПолучитьОбъект();
		ОтменяемыйДокумент.ДокументОтмены = ДокументОтмены;
		
		ОтменяемыйДокумент.Записать(РежимЗаписиДокумента.Запись);	
		Попытка           
			ОтменяемыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			
			Возврат Истина;
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Не удалось установить отметку в отменяемом документе"); 
			Возврат ложь;
		КонецПопытки;
   	Исключение   
		Возврат ложь;
	КонецПопытки;  	
КонецФункции  

&НаСервере 
Функция ПроверитьОтменуПлатежаПереплата(СтруктураПлатежа)  	
	ТаблицаСтатусовПереплата = ЛБ_ОбщийМодуль.ПолучитьСтатусыБезналичныхПлатежейПереплата(, СтруктураПлатежа.РеестрПлатежей);
	Если НЕ ТаблицаСтатусовПереплата.Количество() = 0 Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("ИдентификаторПлатежа", СтруктураПлатежа.ИдентификаторПлатежа); 
		Отбор.Вставить("ДатаПлатежа", СтруктураПлатежа.ДатаПлатежа);
        Отбор.Вставить("НомерЗБ", СтруктураПлатежа.НомерЗБ);
		
		СообщениеПроверкиПереплата = "";
        СтрокиП = ТаблицаСтатусовПереплата.НайтиСтроки(Отбор);
		Для каждого СтрП Из СтрокиП Цикл 
			Если СтрП.СтатусПлатежа = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.ЗачисленоПолностью") ИЛИ 
		         СтрП.СтатусПлатежа = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.ЗачисленоЧастично") Тогда
				СтруктураПлатежаП = Новый Структура;	
				СтруктураПлатежаП.Вставить("РеестрПлатежей", СтруктураПлатежа.РеестрПлатежей); 
				СтруктураПлатежаП.Вставить("ИдентификаторПлатежа", СтрП.ИдентификаторПлатежа);
				СтруктураПлатежаП.Вставить("ДатаПлатежа", СтрП.ДатаПлатежа);
				СтруктураПлатежаП.Вставить("ЗалоговыйБилет", СтрП.ЗалоговыйБилет);
				СтруктураПлатежаП.Вставить("СуммаПлатежа", СтрП.СуммаПлатежа);
				СтруктураПлатежаП.Вставить("НомерЗБ", СтрП.НомерЗБ); 
				СтруктураПлатежаП.Вставить("Переплата", Истина); 
				
				СообщениеПроверки = ПроверитьПлатеж(СтруктураПлатежаП, Истина); 
				Если НЕ ПустаяСтрока(СообщениеПроверки) Тогда 
					СообщениеПроверкиПереплата = СообщениеПроверкиПереплата + ?(ПустаяСтрока(СообщениеПроверкиПереплата), "", Символы.ПС) + СообщениеПроверки + " (обработка переплаты " + СокрЛП(СтрП.НомерЗБ) + ")";
				КонецЕсли;
			ИначеЕсли СтрП.СтатусПлатежа = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.Возвращено") Тогда
				Возврат "Переплата платежа возвращена.";
			ИначеЕсли СтрП.СтатусПлатежа = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.ОтнесеноВДоходы") Тогда	
				Возврат "Переплата платежа отнесена в доходы.";
		    КонецЕсли;
		КонецЦикла;	 
		Если НЕ ПустаяСтрока(СообщениеПроверкиПереплата) Тогда 
			Возврат СообщениеПроверкиПереплата;
		КонецЕсли;
	КонецЕсли;                                 
	Возврат "";
КонецФункции

&НаКлиенте
Процедура ОтменаПлатежа(Команда)
	ТекСтрока = Элементы.РасшифровкаРеестра.ТекущиеДанные;  
	Если ТекСтрока = неопределено Тогда
		Возврат;
	КонецЕсли;	 
	
	СообщениеПроверки = "";   
	СтруктураПлатежа = Новый Структура;	
	СтруктураПлатежа.Вставить("РеестрПлатежей", ТекСтрока.РеестрПлатежей); 
	СтруктураПлатежа.Вставить("ИдентификаторПлатежа", ТекСтрока.ИдентификаторПлатежа);
	СтруктураПлатежа.Вставить("ДатаПлатежа", ТекСтрока.ДатаПлатежа);
	СтруктураПлатежа.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет);
	СтруктураПлатежа.Вставить("СуммаПлатежа", ТекСтрока.СуммаПлатежа);
	СтруктураПлатежа.Вставить("НомерЗБ", ТекСтрока.НомерЗБ); 

	Если ТекСтрока.ИтоговыйСтатус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.Отменен") Тогда 
		Предупреждение("Платеж уже отменен.", 60);
		Возврат; 
	ИначеЕсли ТекСтрока.ИтоговыйСтатус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.Возвращено") Тогда 
		Если НЕ СотрудникЦО Тогда 
			Предупреждение("Платеж возвращен, для отмены операции возврата обратитесь к сотруднику ЦО.", 60);
		    Возврат; 
		Иначе  
			Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОтмена", ЭтаФорма); 
            ПоказатьВопрос(Оповещение, "Отменить операцию возврата платежа?",  РежимДиалогаВопрос.ДаНетОтмена, 0, КодВозвратаДиалога.Да,);
        КонецЕсли;	
    ИначеЕсли ТекСтрока.ИтоговыйСтатус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.ОтнесеноВДоходы") Тогда 
		Если НЕ СотрудникЦО Тогда 
			Предупреждение("Платеж отнесен в доходы, для отмены операции обратитесь к сотруднику ЦО.", 60);
		    Возврат; 
		Иначе  
			Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОтмена", ЭтаФорма); 
            ПоказатьВопрос(Оповещение, "Отменить операцию отнесения платежа в доходы?",  РежимДиалогаВопрос.ДаНетОтмена, 0, КодВозвратаДиалога.Да,);
        КонецЕсли;	
	Иначе
		Если ТекСтрока.ИтоговыйСтатус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.ЗачисленоПолностью") ИЛИ 
			 ТекСтрока.ИтоговыйСтатус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.ЗачисленоЧастично") Тогда				
			СообщениеПроверки = ПроверитьПлатеж(СтруктураПлатежа, Истина); 
			Если НЕ ПустаяСтрока(СообщениеПроверки) Тогда 
				СообщениеПроверки = СообщениеПроверки + Символы.ПС + "Отмена платежа запрещена.";
				Предупреждение(СообщениеПроверки, 60);
				Возврат; 
			КонецЕсли;   
		КонецЕсли;		  
	
		//проверим переплату     
		СообщениеПроверки = ПроверитьОтменуПлатежаПереплата(СтруктураПлатежа);
		Если НЕ ПустаяСтрока(СообщениеПроверки) Тогда 
			Предупреждение(СообщениеПроверки + Символы.ПС + "Отмена платежа запрещена.", 60);
			Возврат; 
		КонецЕсли;
			
		Если ЗначениеЗаполнено(ТекСтрока.ДокументОплаты)  Тогда 
			Результат = ОтменаОплатыНаСервере(ТекСтрока.ДокументОплаты);
			Если НЕ Результат  Тогда    
				Предупреждение("Ошибка при отмене платежа. Обратитесь к разработчикам.", 60);
			Иначе							
				СтруктураПлатежа = Новый Структура;	
				СтруктураПлатежа.Вставить("РеестрПлатежей", ТекСтрока.РеестрПлатежей); 
				СтруктураПлатежа.Вставить("ИдентификаторПлатежа", ТекСтрока.ИдентификаторПлатежа);
				СтруктураПлатежа.Вставить("ДатаПлатежа", ТекСтрока.ДатаПлатежа);
				СтруктураПлатежа.Вставить("НомерЗБ", ТекСтрока.НомерЗБ);
				СтруктураПлатежа.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет);
				СтруктураПлатежа.Вставить("СуммаПлатежа", ТекСтрока.СуммаПлатежа); 
				
			    РезультатОтменыСтатуса = СоздатьИзменениеСтатусаОтмена(СтруктураПлатежа, ТекСтрока.ДокументОплаты); 
				Если РезультатОтменыСтатуса = неопределено Тогда    
					Предупреждение("Ошибка при отмене платежа. Обратитесь к разработчикам.", 60);
				Иначе	        
					ВидРеестра = ПолучитьВидОперацииРеестраПлатежей(ТекСтрока.РеестрПлатежей);
					Если ВидРеестра = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыБезналичныхПлатежей.РасчетыйСчет") Тогда
						РезультатП = ОтменитьПлатежиПоПереплате(СтруктураПлатежа);
						Если НЕ ПустаяСтрока(РезультатП) Тогда    
							Предупреждение(РезультатП, 60);
						КонецЕсли;	
				    КонецЕсли;

					ТекСтрока.ИтоговыйСтатус = РезультатОтменыСтатуса.статусПлатежа;  
					ТекСтрока.ДатаПеревода = РезультатОтменыСтатуса.ДатаПеревода; 
					ТекСтрока.ОплатаПроценты = 0; 
					ТекСтрока.ОплатаЗайм = 0;
					ТекСтрока.Переплата = 0; 
					ТекСтрока.ПереплатаРаспределено = 0;
					ТекСтрока.Ответственный = ТекущийПользователь();
					Элементы.РеестрыПлатежей.Обновить(); 
				КонецЕсли;	
	    	КонецЕсли;	  
		Иначе	            
		    СтруктураПлатежа = Новый Структура;	
			СтруктураПлатежа.Вставить("РеестрПлатежей", ТекСтрока.РеестрПлатежей); 
			СтруктураПлатежа.Вставить("ИдентификаторПлатежа", ТекСтрока.ИдентификаторПлатежа);
			СтруктураПлатежа.Вставить("ДатаПлатежа", ТекСтрока.ДатаПлатежа);
			СтруктураПлатежа.Вставить("НомерЗБ", ТекСтрока.НомерЗБ);
			СтруктураПлатежа.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет);
			СтруктураПлатежа.Вставить("СуммаПлатежа", ТекСтрока.СуммаПлатежа);
			РезультатОтмены = СоздатьИзменениеСтатусаОтмена(СтруктураПлатежа);
			Если РезультатОтмены = неопределено Тогда    
				Предупреждение("Ошибка при отмене платежа. Обратитесь к разработчикам.", 60);
			Иначе	        
				ТекСтрока.ИтоговыйСтатус = РезультатОтмены.СтатусПлатежа; 
				ТекСтрока.Возврат = 0;
				ТекСтрока.ДатаПеревода = РезультатОтмены.ДатаПеревода; 
				ТекСтрока.Ответственный = ТекущийПользователь();
				Элементы.РеестрыПлатежей.Обновить(); 
			КонецЕсли;	
		КонецЕсли;  
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция РаспределениеПереплатыОтмена(СтруктураПлатежа, ДокументОплаты = неопределено)
	НовыйДок = Документы.ЛБ_РаспределениеПереплаты.СоздатьДокумент();
	НовыйДок.РеестрПлатежей = СтруктураПлатежа.РеестрПлатежей; 
	НовыйДок.ИдентификаторПлатежа =	СтруктураПлатежа.ИдентификаторПлатежа;
	НовыйДок.ДатаПлатежа =	СтруктураПлатежа.ДатаПлатежа;
	НовыйДок.НомерЗБ =	СтруктураПлатежа.НомерЗБ;
	НовыйДок.ЗалоговыйБилет =	СтруктураПлатежа.ЗалоговыйБилет;
	НовыйДок.СуммаПлатежа = СтруктураПлатежа.СуммаПлатежа; 
	НовыйДок.Переплата = СтруктураПлатежа.Переплата; 
	НовыйДок.Ответственный = Пользователи.ТекущийПользователь();
	НовыйДок.НовыйСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.Отменен;
	НовыйДок.Дата = ТекущаяДатаСеанса();  
	НовыйДок.ВидОперации = Перечисления.ЛБ_ВидыИзмененийБезналичныхПлатежей.ОтменаИзменения;
	Если НЕ ДокументОплаты = неопределено Тогда
		НовыйДок.ДокументОплаты = ДокументОплаты;
	КонецЕсли;	
	НовыйДок.Записать(РежимЗаписиДокумента.Запись);
	
	Попытка   
		НовыйДок.Записать(РежимЗаписиДокумента.Проведение);   
		Возврат Истина;
	Исключение	              
		Возврат Ложь;
	КонецПопытки	
КонецФункции	

&НаСервере
Функция ОтменитьПлатежиПоПереплате(СтруктураПлатежаРеестра) 
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("РеестрПлатежей", СтруктураПлатежаРеестра.РеестрПлатежей);
	Запрос.УстановитьПараметр("НомерЗБ", СтруктураПлатежаРеестра.НомерЗБ);  
	Запрос.УстановитьПараметр("ИдентификаторПлатежа", СтруктураПлатежаРеестра.ИдентификаторПлатежа);
    Запрос.УстановитьПараметр("ДатаПлатежа", СтруктураПлатежаРеестра.ДатаПлатежа);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.ПереплатаНачальная КАК ПереплатаНачальная,
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.ДокументОплаты КАК ДокументОплаты,
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.НомерЗБ КАК НомерЗБ,
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.ДатаПлатежа КАК ДатаПлатежа,
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.СуммаПлатежа КАК СуммаПлатежа,
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.СтатусПлатежа КАК СтатусПлатежа
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеестрБезначныхПлатежейПереплаты КАК ЛБ_РеестрБезначныхПлатежейПереплаты
	               |ГДЕ
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.РеестрПлатежей = &РеестрПлатежей
	               |	И ЛБ_РеестрБезначныхПлатежейПереплаты.НомерЗБ = &НомерЗБ
	               |	И ЛБ_РеестрБезначныхПлатежейПереплаты.ДатаПлатежа = &ДатаПлатежа
	               |	И ЛБ_РеестрБезначныхПлатежейПереплаты.ИдентификаторПлатежа = &ИдентификаторПлатежа
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.Период УБЫВ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
		ТаблицаПереплатНач = ТаблицаЗапроса.Скопировать();
		ТаблицаПереплатНач.Свернуть("ПереплатаНачальная");
		Для каждого СтрН из ТаблицаПереплатНач Цикл
			Отбор = Новый Структура;
			Отбор.Вставить("ПереплатаНачальная", СтрН.ПереплатаНачальная);
			Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
			Если НЕ Строки.Количество() = 0 Тогда 
				Стр = Строки.Получить(0);
				Если Стр.СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ЗачисленоПолностью ИЛИ
					 Стр.СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ЗачисленоЧастично Тогда 
					Результат = ОтменаОплатыНаСервере(Стр.ДокументОплаты);
					Если НЕ Результат Тогда    
						Возврат "Ошибка при отмене учета переплаты (ЗБ № " + СокрЛП(Стр.НомерЗБ) + "). Обратитесь к разработчикам.";
					КонецЕсли;
					СтруктураПлатежа = Новый Структура;	
					СтруктураПлатежа.Вставить("РеестрПлатежей", СтруктураПлатежаРеестра.РеестрПлатежей); 
					СтруктураПлатежа.Вставить("ИдентификаторПлатежа", Стр.ИдентификаторПлатежа);
					СтруктураПлатежа.Вставить("ДатаПлатежа", Стр.ДатаПлатежа);
					СтруктураПлатежа.Вставить("НомерЗБ", Стр.НомерЗБ);
					СтруктураПлатежа.Вставить("ЗалоговыйБилет", Стр.ЗалоговыйБилет);
					СтруктураПлатежа.Вставить("СуммаПлатежа", Стр.СуммаПлатежа);
				    СтруктураПлатежа.Вставить("Переплата", Стр.ПереплатаНачальная);
					РезультатОтмены = РаспределениеПереплатыОтмена(СтруктураПлатежа, Стр.ДокументОплаты);
					Если НЕ РезультатОтмены Тогда    
						Возврат "Ошибка при отмене изменения статуса переплаты (ЗБ № " + СокрЛП(Стр.НомерЗБ) + "). Обратитесь к разработчикам.";
	                КонецЕсли;
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;		       
	Возврат "";
КонецФункции

&НаКлиенте
Функция ОтменитьПлатежи(РеестрПлатежей)  
		
	КоличествоОтменить = 0;
	Для каждого Стр Из РасшифровкаРеестра Цикл 
		Если НЕ Стр.ИтоговыйСтатус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.Отменен") Тогда 
			КоличествоОтменить = КоличествоОтменить + 1;
		КонецЕсли;	                                   
	КонецЦикла;
	
	Если КоличествоОтменить = 0 Тогда
		Возврат истина;
	КонецЕсли; 
	
	ВидРеестра = ПолучитьВидОперацииРеестраПлатежей(РеестрПлатежей);
	Шаг = Цел(100/КоличествоОтменить);
	Процесс = 0;    
	ВсеОК = Истина;
	Для каждого Стр Из РасшифровкаРеестра Цикл 
		Процесс = Процесс + Шаг; 
		Состояние("Внимание!", Процесс, "Отмена платежей может занять некоторое время", БиблиотекаКартинок.ДлительнаяОперация48); 
		
		Если Стр.ИтоговыйСтатус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.Отменен") Тогда
			Продолжить;
		КонецЕсли;	
		
		СтруктураПлатежа = Новый Структура;	
		СтруктураПлатежа.Вставить("РеестрПлатежей", Стр.РеестрПлатежей); 
		СтруктураПлатежа.Вставить("ИдентификаторПлатежа", Стр.ИдентификаторПлатежа);
		СтруктураПлатежа.Вставить("ДатаПлатежа", Стр.ДатаПлатежа);
		СтруктураПлатежа.Вставить("НомерЗБ", Стр.НомерЗБ);
		СтруктураПлатежа.Вставить("ЗалоговыйБилет", Стр.ЗалоговыйБилет);
		СтруктураПлатежа.Вставить("СуммаПлатежа", Стр.СуммаПлатежа); 

		Если Стр.ИтоговыйСтатус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.ЗачисленоПолностью") ИЛИ 
			 Стр.ИтоговыйСтатус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.ЗачисленоЧастично") Тогда 
		 		
			Результат = ОтменаОплатыНаСервере(Стр.ДокументОплаты);
			Если НЕ Результат  Тогда    
				Предупреждение("Ошибка при отмене платежа (№ ЗБ " + сокрЛП(Стр.НомерЗБ) + "). Обратитесь к разработчикам.", 60); 
				ВсеОК = Ложь;
				Прервать;
			Иначе	     				
				Если ВидРеестра = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыБезналичныхПлатежей.РасчетыйСчет") Тогда
					РезультатП = ОтменитьПлатежиПоПереплате(СтруктураПлатежа);
					Если НЕ ПустаяСтрока(РезультатП) Тогда    
						Предупреждение(РезультатП, 60);
					    ВсеОК = Ложь;
				        Прервать;
					КонецЕсли;	
				КонецЕсли;

				РезультатОтменыСтатуса = СоздатьИзменениеСтатусаОтмена(СтруктураПлатежа, Стр.ДокументОплаты); 
				Если РезультатОтменыСтатуса = неопределено Тогда    
					Предупреждение("Ошибка при изменении статуса платежа (№ ЗБ " + сокрЛП(Стр.НомерЗБ) + "). Обратитесь к разработчикам.", 60);  
					ВсеОК = Ложь;
				    Прервать;
				КонецЕсли;
			КонецЕсли;	 
		Иначе   
			РезультатОтменыСтатуса = СоздатьИзменениеСтатусаОтмена(СтруктураПлатежа);
			Если РезультатОтменыСтатуса = неопределено Тогда    
				Предупреждение("Ошибка при изменении статуса платежа (№ ЗБ " + сокрЛП(Стр.НомерЗБ) + "). Обратитесь к разработчикам.", 60);
			    ВсеОК = Ложь;
				Прервать;
			КонецЕсли;	
		КонецЕсли;	
	Конеццикла;     
		
	ТекСтрока = Элементы.РеестрыПлатежей.ТекущиеДанные; 
	ЗаполнитьРасшифровку(ТекСтрока.РеестрПлатежей);
	Элементы.РеестрыПлатежей.Обновить();   
	Возврат ВсеОК;
КонецФункции

&НаКлиенте
Процедура РасшифровкаРеестраВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)  
	СтандартнаяОбработка = Ложь;
	ТекСтрока = Элементы.РасшифровкаРеестра.ТекущиеДанные;  
	Если ТекСтрока = неопределено Тогда
		Возврат;
	КонецЕсли;	 
	
	ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("РеестрПлатежей", ТекСтрока.РеестрПлатежей); 
	ОбработкаВыбора = Новый ОписаниеОповещения("ПересчитатьОстатокПереплаты",ЭтаФорма);
    ОткрытьФорму("ОбщаяФорма.ЛБ_УправлениеБезналичнымиПлатежамиПереплата", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Функция ПересчитатьОстатокПереплатыНаСервере(РеестрПлатежей, ИдентификаторПлатежа, ДатаПлатежа, НомерЗБ);
	Возврат ЛБ_Общиймодуль.РассчитатьОстатокПереплатыБезналичногоПлатежа(ТекущаяДатаСеанса(), РеестрПлатежей, ИдентификаторПлатежа, ДатаПлатежа, НомерЗБ);
КонецФункции

&НаКлиенте
Процедура ПересчитатьОстатокПереплаты(Результат, ДополнительныеПараметры) Экспорт   
	ТекСтрокаНач = Элементы.РасшифровкаРеестра.ТекущаяСтрока;
	Для каждого стр Из РасшифровкаРеестра цикл  
		Если Стр.Переплата = 0 Тогда
			Продолжить;
		КонецЕсли;	
		ПереплатаОстаток = ПересчитатьОстатокПереплатыНаСервере(Стр.РеестрПлатежей, Стр.ИдентификаторПлатежа, Стр.ДатаПлатежа, Стр.НомерЗБ); 
		ИдентификаторСтроки = Стр.ПолучитьИдентификатор();
        Элементы.РасшифровкаРеестра.ТекущаяСтрока = ИдентификаторСтроки;
        ТекСтрока = Элементы.РасшифровкаРеестра.ТекущиеДанные; 
		ТекСтрока.ПереплатаРаспределено = ТекСтрока.Переплата - ПереплатаОстаток;
	КонецЦикла;	  
	Элементы.РеестрыПлатежей.Обновить();                                                                                        
	ОбновитьИтоги();
	Элементы.РасшифровкаРеестра.ТекущаяСтрока = РасшифровкаРеестра.НайтиПоИдентификатору(ТекСтрокаНач).ПолучитьИдентификатор();
КонецПроцедуры

&НаКлиенте
Процедура ИсторияПлатежа(Команда)
	ТекСтрока = Элементы.РасшифровкаРеестра.ТекущиеДанные;  
	Если ТекСтрока = неопределено Тогда
		Возврат;
	КонецЕсли;	
    ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РеестрПлатежей", ТекСтрока.РеестрПлатежей);
	ПараметрыФормы.Вставить("НомерЗБ", ТекСтрока.НомерЗБ);
	ПараметрыФормы.Вставить("ДатаПлатежа", ТекСтрока.ДатаПлатежа); 
	ПараметрыФормы.Вставить("ИдентификаторПлатежа", ТекСтрока.ИдентификаторПлатежа); 
	ПараметрыФормы.Вставить("СуммаПлатежа", ТекСтрока.СуммаПлатежа); 
   	
	ОткрытьФорму("ОбщаяФорма.ЛБ_ИсторияБезналичногоПлатежа", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура Расчеты(Команда)  
	ТекСтрока = Элементы.РасшифровкаРеестра.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда 
		Результат = ПолучитьЗБИстория(ТекСтрока.ПолучитьИдентификатор()); 
		Если ЗначениеЗаполнено(Результат.ЗБ) Тогда 
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Клиент", Результат.Залогодатель);
			ПараметрыФормы.Вставить("ЗалоговыйБилет", Результат.ЗБ);		
			ПараметрыФормы.Вставить("Дата", ТекСтрока.ДатаПлатежа);	 
			ПараметрыФормы.Вставить("Детально", Истина);
						
	        ОткрытьФорму("Отчет.ЛБ_НачисленныеПроцентыПоДоговоруЗайма.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПлатежиЛККОтмене(Команда)   
	ТекСтрока = Элементы.РеестрыПлатежей.ТекущиеДанные;  
	Если ТекСтрока = неопределено Тогда 
		Возврат;
	КонецЕсли;	
	ВидОперации = ПолучитьВидОперацииРеестраПлатежей(ТекСтрока.РеестрПлатежей);
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыБезналичныхПлатежей.ЛичныйКабинет") Тогда
        Возврат;
	КонецЕсли;	  
	//ЗаполнитьОтменуЛК(ТекСтрока.РеестрПлатежей);
	Отбор = Новый Структура("РеестрПлатежей", ТекСтрока.РеестрПлатежей);  
    ОткрытьФорму("РегистрСведений.ЛБ_ОтменаПлатежейЛК.Форма.ФормаСписка", Новый Структура("Отбор", Отбор), ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	Элементы.РеестрыПлатежей.Обновить();  
	ТекСтрока = Элементы.РеестрыПлатежей.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда  
		ЗаполнитьРасшифровку(ТекСтрока.РеестрПлатежей); 
	Иначе
		РасшифровкаРеестра.Очистить();
	КонецЕсли;	            
КонецПроцедуры

&НаКлиенте
Процедура РеестрыПлатежейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтрока = Элементы.РеестрыПлатежей.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда  
		ПараметрыФормы = Новый Структура;
	    ПараметрыФормы.Вставить("Ключ", ТекСтрока.РеестрПлатежей); 
		ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
		
	    ОткрытьФорму("Документ.ЛБ_РеестрПлатежей.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры

//+МАН 10.01.25 Установка доступности кнопок. Заявка 3043
&НаКлиенте
Процедура УстановитьДоступность(ТекСтрока)
	Если ПолучитьВидОперацииРеестраПлатежей(ТекСтрока.РеестрПлатежей) = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыБезналичныхПлатежей.ЛичныйКабинет") Тогда 
		Элементы.РасшифровкаРеестраУточнитьИЗачислить.Доступность = Ложь;
		Элементы.РасшифровкаРеестраДоВыяснения.Доступность = Ложь;
		Элементы.РасшифровкаРеестраКВозврату.Доступность = Ложь;
		Элементы.РасшифровкаРеестраОтнесеноВДоходы.Доступность = Ложь;
	Иначе
		Элементы.РасшифровкаРеестраУточнитьИЗачислить.Доступность = Истина;
		Элементы.РасшифровкаРеестраДоВыяснения.Доступность = Истина;
		Элементы.РасшифровкаРеестраКВозврату.Доступность = Истина;
		Элементы.РасшифровкаРеестраОтнесеноВДоходы.Доступность = Истина;
	КонецЕсли;	
КонецПроцедуры
//-МАН





