#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	QRКодСслыкаНаПроверкуВозраста = МенеджерОборудования.QRКодСслыкаНаПроверкуВозраста(300, 300);
	АдресQRКодаСсылкиМакс = ПоместитьВоВременноеХранилище(QRКодСслыкаНаПроверкуВозраста);
	
	ТипыОборудования = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
	ТипыОборудования.СканерШтрихкода = Истина;
	МенеджерОборудования.ПриСозданииНаСервере(ЭтотОбъект, ТипыОборудования);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ПодключениеОборудованияПриОткрытии", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	МенеджерОборудованияКлиент.ОтключитьОборудованиеПриЗакрытииФормыАсинх(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ScanData" 
		И Параметр.Количество() > 0 
		И ВводДоступен() Тогда
		ШтрихкодОтБПО = Параметр[0];
		
		Сообщить(ШтрихкодОтБПО);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Асинх Процедура ПодключениеОборудованияПриОткрытии()
	
	РезультатыПодключения = Ждать МенеджерОборудованияКлиент.ПодключитьОборудованиеПриОткрытииФормыАсинх(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВозраст(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеПроверкиВозраста", ЭтотОбъект);
	
	ПараметрыПроверки = МенеджерОборудованияКлиент.ПараметрыОткрытияФормыПроверкиВозрастаВМакс();
	ПараметрыПроверки.РежимКСО = РежимКСО;
	ПараметрыПроверки.ТокенОрганизации = ТокенОрганизации;
	ПараметрыПроверки.ОтображатьQRКодНаДисплееПокупателя = ВыводитьQRКодНаДисплейПокупателя;
	МенеджерОборудованияКлиент.ОткрытьФормуПроверкиВозраста(Оповещение, ЭтотОбъект, ПараметрыПроверки);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПроверкиВозраста(РезультатВызова, ДополнительныеПараметры) Экспорт
	
	ОчиститьСообщения();
	Если ТипЗнч(РезультатВызова) = Тип("Структура") Тогда
		Сообщить(СтрШаблон(НСтр("ru = 'Результат: %1'"), РезультатВызова.Результат));
		
		Если РезультатВызова.Результат = МенеджерОборудованияКлиент.ТипРезультатаПроверкиВозрастаВМакс().Ошибка Тогда
			Сообщить(СтрШаблон(НСтр("ru = 'ОписаниеОшибки: %1'"), РезультатВызова.ОписаниеОшибки));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти