
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;  	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЛБ_ПереченьДокументовЗалогодателя.ВидДокумента КАК ВидДокумента
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПереченьДокументовЗалогодателя КАК ЛБ_ПереченьДокументовЗалогодателя
	               |ГДЕ
	               |	ЛБ_ПереченьДокументовЗалогодателя.ВидДокументаЗалогодателя = Значение(Перечисление.ЛБ_ВидыДокументовЗалогодателя.ДополнительныйДокумент)"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл  
		Элементы.ВидДокумента.СписокВыбора.Добавить(Выборка.ВидДокумента);
	Конеццикла;	
КонецПроцедуры
