
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ТолькоПросмотр") Тогда
		//+МАН 14.11.24 Добавлено условие. Заявка 2464
		Если Параметры.ТолькоПросмотр <> Неопределено Тогда
			Элементы.СохранитьИЗакрыть.Доступность = НЕ Параметры.ТолькоПросмотр;
		КонецЕсли;
		//-МАН
	КонецЕсли;

	Если Параметры.Свойство("ВидВставки") Тогда
		ВидКомплектующего = Параметры.ВидВставки;
	КонецЕсли;

	Если Параметры.Свойство("Количество") Тогда
		Количество = Параметры.Количество;
	КонецЕсли; 

	Если Параметры.Свойство("ВесГраммы") Тогда
		Вес = Параметры.ВесГраммы;
		ВесКомплектующего = ?(Количество = 0, 0, Вес);
		ВесШт = ?(Количество = 0, 0, Вес/Количество);
	КонецЕсли;

	Если Параметры.Свойство("ЕдиницаИзмерения") Тогда
		ЕдиницаИзмерения = Параметры.ЕдиницаИзмерения;
	КонецЕсли;

	Если Параметры.Свойство("ВидВставкиФакт") Тогда
		ВидКомплектующегоФакт = Параметры.ВидВставкиФакт;
	КонецЕсли;

	Если Параметры.Свойство("КоличествоФакт") Тогда
		КоличествоФакт = Параметры.КоличествоФакт;
	КонецЕсли; 

	Если Параметры.Свойство("ВесГраммыФакт") Тогда
		ВесФакт = Параметры.ВесГраммыФакт;
		ВесКомплектующегоФакт = ?(КоличествоФакт = 0, 0, ВесФакт);
		ВесШтФакт = ?(КоличествоФакт = 0, 0, ВесФакт/КоличествоФакт);
	КонецЕсли;

	Если Параметры.Свойство("ЕдиницаИзмеренияФакт") Тогда
		ЕдиницаИзмеренияФакт = Параметры.ЕдиницаИзмеренияФакт;
	КонецЕсли;

	Если Параметры.Свойство("ИДНоваяСтрокаТЧ") Тогда 
		ИДНоваяСтрокаТЧ = Параметры.ИДНоваяСтрокаТЧ;
	КонецЕсли;   

	Если Параметры.Свойство("НоваяСтрокаТЧ") Тогда
		НоваяСтрока = Параметры.НоваяСтрокаТЧ;
	Иначе
		НоваяСтрока = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("ТЧ") Тогда
		ТЧВставкаК = Параметры.ТЧ.ВставкаК;
		ТЧВставкаМ = Параметры.ТЧ.ВставкаМ;
		ТЧОсновная = Параметры.ТЧ.Основная;
	КонецЕсли;

	Если Параметры.Свойство("ОбъектЗалога") Тогда
		ОбъектЗалога = Параметры.ОбъектЗалога;
	КонецЕсли;
	
	Если Параметры.Свойство("ОбщаяМассаФакт") Тогда
		ОбщаяМассаФакт = Параметры.ОбщаяМассаФакт;
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	
	Если НоваяСтрока Тогда
		Элементы.ГруппаУчетныеДанные.Видимость = Ложь;
	Иначе
		Элементы.ГруппаУчетныеДанные.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Отмена", Истина);
	СтруктураВозврата.Вставить("НоваяСтрокаТЧ", НоваяСтрока);
	СтруктураВозврата.Вставить("ИДНоваяСтрокаТЧ", ИДНоваяСтрокаТЧ);
 	СтруктураВозврата.Вставить("Комплектующее", Истина);

	Если Модифицированность Тогда
		
		Ответ = Вопрос("Данные изменены!
			   |Сохранить изменения?", РежимДиалогаВопрос.ДаНетОтмена,, КодВозвратаДиалога.Да);
		
		Если Ответ = КодВозвратаДиалога.Да = Истина Тогда
			СохранитьИЗакрыть(Истина);
		ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
			Модифицированность = Ложь;
			Этаформа.Закрыть(?(НоваяСтрока, СтруктураВозврата, Неопределено));
		Иначе
			Возврат;
		КонецЕсли;
	Иначе
		Этаформа.Закрыть(?(НоваяСтрока, СтруктураВозврата, Неопределено));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	Если НЕ Проверить() Тогда
		Возврат;
	КонецЕсли;

	Сохранить = Истина;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("КоличествоФакт", КоличествоФакт);
	СтруктураВозврата.Вставить("ВидВставкиФакт", ВидКомплектующегоФакт);
	СтруктураВозврата.Вставить("ЕдиницаИзмеренияФакт", ЕдиницаИзмеренияФакт);
	СтруктураВозврата.Вставить("ВесГраммыФакт", ВесКомплектующегоФакт);
	СтруктураВозврата.Вставить("НоваяСтрокаТЧ", НоваяСтрока);
	СтруктураВозврата.Вставить("ИДНоваяСтрокаТЧ", ИДНоваяСтрокаТЧ);
	СтруктураВозврата.Вставить("Комплектующее", Истина);
	СтруктураВозврата.Вставить("Отмена", Ложь);
	СтруктураВозврата.Вставить("ОбъектЗалога", ОбъектЗалога);

	Этаформа.Закрыть(СтруктураВозврата);
КонецПроцедуры

&НаКлиенте
Функция Проверить()
	ВсеОК = Истина;

	Если НЕ ЗначениеЗаполнено(ВидКомплектующегоФакт) Тогда
		Сообщить("Не выбран вид комплектующего.");
		ВсеОК = Ложь;
	КонецЕсли;
	Если КоличествоФакт = 0 Тогда
		Сообщить("Не задано количество.");
		ВсеОК = Ложь;
	КонецЕсли;

	//++ИВВ 03.2026, вычеты для часов ч.2
	//было:
	//Если ВесКомплектующегоФакт = 0 Тогда
	Если ВесКомплектующегоФакт = 0 И Не ПроверкаВидаКомплектующегоВычет() Тогда
	//--ИВВ
		Сообщить("Не задан вес.");
		ВсеОК = Ложь;
	КонецЕсли;
	
	ДокументОбъект = ЭтотОбъект.ВладелецФормы.Объект;
	
	Если ПроверитьОбщийВес(ДокументОбъект) Тогда
		Сообщить("Общий вес изделия не может быть меньше общего веса вставки/ доп.металла/ комплектующего!");
		ВсеОК = Ложь;
	КонецЕсли;
	
	Возврат ВсеОК;
КонецФункции

&НаСервере
Функция ПроверитьОбщийВес(ДокументОбъект)
	Отбор = Новый Структура;
	Отбор.Вставить("ОбъектЗалога", ОбъектЗалога);
	
	СтрокиВ = ДокументОбъект[ТЧВставкаК].НайтиСтроки(Отбор);
	
	ВесК = 0;
	ВесМ = 0;
		
	Для каждого СтрВК Из СтрокиВ Цикл
		ВесК = ВесК + СтрВК.ВесГраммыФакт;
	КонецЦикла;

	СтрокиВМ = ДокументОбъект[ТЧВставкаМ].НайтиСтроки(Отбор);
	
	Для каждого СтрВМ Из СтрокиВМ Цикл
		ВесМ = ВесМ + СтрВМ.ВесФакт;
	КонецЦикла;
	
	ВесК = ВесК - ВесКомплектующего + ВесКомплектующегоФакт;

	Результат = ?(Цел((ОбщаяМассаФакт - (ВесК + ВесМ))*100)/100 <= 0, Истина, Ложь);

	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ВидКомплектующегоПриИзменении(Элемент)
	ЗаполнитьРеквизиты();
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизиты()
	Если КоличествоФакт = 0 Тогда
		КоличествоФакт = 1;
	КонецЕсли;
	
	ВесКомплектующегоФакт = ВидКомплектующегоФакт.ВесПоУмолчанию*КоличествоФакт;
	ВесШтФакт = ВидКомплектующегоФакт.ВесПоУмолчанию;
	ЕдиницаИзмеренияФакт = ВидКомплектующегоФакт.ЕдиницаИзмерения;
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	ЗаполнитьРеквизиты();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
    Если Сохранить Тогда
		Этаформа.Закрыть();
	Иначе
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("Отмена", Истина);
		СтруктураВозврата.Вставить("НоваяСтрокаТЧ", НоваяСтрока);
		СтруктураВозврата.Вставить("ИДНоваяСтрокаТЧ", ИДНоваяСтрокаТЧ);
		СтруктураВозврата.Вставить("Комплектующее", Истина);
		
		Если Модифицированность Тогда
			
			Ответ = Вопрос("Данные изменены!
			|Сохранить изменения?", РежимДиалогаВопрос.ДаНетОтмена,, КодВозвратаДиалога.Да);
			
			Если Ответ = КодВозвратаДиалога.Да = Истина Тогда
				СохранитьИЗакрыть(Истина);
			ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
				Модифицированность = Ложь;
				Этаформа.Закрыть(?(НоваяСтрока, СтруктураВозврата, Неопределено));
			Иначе
				Отказ = Истина;
			КонецЕсли;
		Иначе
			Этаформа.Закрыть(?(НоваяСтрока, СтруктураВозврата, Неопределено));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Сохранить = Ложь;
КонецПроцедуры

&НаСервере
Функция ПроверкаВидаКомплектующегоВычет()
	
	Если ВидКомплектующегоФакт = Справочники.ЛБ_Настройки.ПолучитьЗначениеСправочника("ВидыКомплектующихДляВычета").ЧасовойМеханизм 
		Или ВидКомплектующегоФакт = Справочники.ЛБ_Настройки.ПолучитьЗначениеСправочника("ВидыКомплектующихДляВычета").НикаКапсула Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
