#Область СвойстваСчетов

Функция ПолучитьСвойстваСчета(Знач Счет) Экспорт
	
	Если ТипЗнч(Счет) = Тип("СправочникСсылка.ЕПСЛицевыеСчета") Тогда
		
		Счет = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Счет,"Владелец");
		
	КонецЕсли;
	
	ДанныеСчета = Новый Структура;
	ДанныеСчета.Вставить("Ссылка"                         , ПланыСчетов.ЕПС.ПустаяСсылка());
	ДанныеСчета.Вставить("Наименование"                   , "");
	ДанныеСчета.Вставить("Код"                            , "");
	ДанныеСчета.Вставить("КодБыстрогоВыбора"              , "");
	ДанныеСчета.Вставить("Родитель"                       , ПланыСчетов.ЕПС.ПустаяСсылка());
	ДанныеСчета.Вставить("Вид"                            , Неопределено);
	ДанныеСчета.Вставить("Забалансовый"                   , Ложь);
	ДанныеСчета.Вставить("ЗапретитьИспользоватьВПроводках", Ложь);
	ДанныеСчета.Вставить("Валютный"                       , Ложь);
	ДанныеСчета.Вставить("Количественный"                 , Ложь);
	ДанныеСчета.Вставить("УчетПоПодразделениям"           , Ложь);
	ДанныеСчета.Вставить("НалоговыйУчет"                  , Ложь);
	ДанныеСчета.Вставить("КоличествоСубконто"             , 0);
	ДанныеСчета.Вставить("СПОД"             			  , Ложь);
	ДанныеСчета.Вставить("ГруппаСчета" 				      , Перечисления.ЕПСГруппыСчетов.ПустаяСсылка());
	ДанныеСчета.Вставить("СчетПарный"             		  , ПланыСчетов.ЕПС.ПустаяСсылка());
	ДанныеСчета.Вставить("СчетСвязанныйСПОД"			  , ПланыСчетов.ЕПС.ПустаяСсылка());
	ДанныеСчета.Вставить("ВременныеРазницы"               , Ложь);
	ДанныеСчета.Вставить("ПостоянныеРазницы"              , Ложь);
	ДанныеСчета.Вставить("КоличествоАналитик"             , 0); // СС 26.04.2022
	
	МаксКоличествоСубконто	= БухгалтерскийУчет.МаксимальноеКоличествоСубконто();
	
	Для ИндексСубконто = 1 По МаксКоличествоСубконто Цикл
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто,                   Неопределено);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "Наименование",  Неопределено);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "ТипЗначения",   Неопределено);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "Суммовой",      Ложь);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "ТолькоОбороты", Ложь);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "Контроль",      Ложь);
	КонецЦикла;
	// СС 26.04.2022
	Для ИндексАналитика = 1 По 4 Цикл
		ДанныеСчета.Вставить("Аналитика" + ИндексАналитика,                   Неопределено);
		ДанныеСчета.Вставить("Аналитика" + ИндексАналитика + "Наименование",  Неопределено);
		ДанныеСчета.Вставить("Аналитика" + ИндексАналитика + "ТипЗначения",   Неопределено);
	КонецЦикла;
	//\

	Если НЕ ЗначениеЗаполнено(Счет) Тогда
		Возврат ДанныеСчета;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Счет", Счет);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕПС.Ссылка КАК Ссылка,
	|	ЕПС.Родитель КАК Родитель,
	|	ЕПС.Код КАК Код,
	|	ЕПС.КодБыстрогоВыбора КАК КодБыстрогоВыбора,
	|	ЕПС.Наименование КАК Наименование,
	|	ЕПС.Вид КАК Вид,
	|	ЕПС.Забалансовый КАК Забалансовый,
	|	ЕПС.ЗапретитьИспользоватьВПроводках КАК ЗапретитьИспользоватьВПроводках,
	|	ЕПС.Валютный КАК Валютный,
	|	ЕПС.Количественный КАК Количественный,
	|	ЕПС.УчетПоПодразделениям КАК УчетПоПодразделениям,
	|	ЕПС.НалоговыйУчет КАК НалоговыйУчет,
	|	ЕПС.ГруппаСчета КАК ГруппаСчета,
	|	ЕПС.СобытияПослеОтчетнойДаты КАК СПОД,
	|	ЕПС.ВременныеРазницы КАК ВременныеРазницы,
	|	ЕПС.ПостоянныеРазницы КАК ПостоянныеРазницы
	|ИЗ
	|	ПланСчетов.ЕПС КАК ЕПС
	|ГДЕ
	|	ЕПС.Ссылка = &Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕПСВидыСубконто.НомерСтроки КАК НомерСтроки,
	|	ЕПСВидыСубконто.ВидСубконто КАК ВидСубконто,
	|	ЕПСВидыСубконто.ВидСубконто.Наименование КАК Наименование,
	|	ЕПСВидыСубконто.ВидСубконто.ТипЗначения КАК ТипЗначения,
	|	ЕПСВидыСубконто.ТолькоОбороты КАК ТолькоОбороты,
	|	ЕПСВидыСубконто.Суммовой КАК Суммовой
	|ИЗ
	|	ПланСчетов.ЕПС.ВидыСубконто КАК ЕПСВидыСубконто
	|ГДЕ
	|	ЕПСВидыСубконто.Ссылка = &Счет
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЕПСВидыСубконто.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЕПСПарныеСчетаУчета.СчетПассивный КАК СчетПарный
	|ИЗ
	|	РегистрСведений.ЕПСПарныеСчетаУчета КАК ЕПСПарныеСчетаУчета
	|ГДЕ
	|	ЕПСПарныеСчетаУчета.СчетАктивный = &Счет
	|	И ЕПСПарныеСчетаУчета.СчетПассивный <> ЗНАЧЕНИЕ(ПланСчетов.ЕПС.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЕПСПарныеСчетаУчета.СчетАктивный
	|ИЗ
	|	РегистрСведений.ЕПСПарныеСчетаУчета КАК ЕПСПарныеСчетаУчета
	|ГДЕ
	|	ЕПСПарныеСчетаУчета.СчетПассивный = &Счет
	|	И ЕПСПарныеСчетаУчета.СчетАктивный <> ЗНАЧЕНИЕ(ПланСчетов.ЕПС.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕПСПараметрыОткрытияЛицевыхСчетов.ПравилоОткрытия КАК ПравилоОткрытия
	|ИЗ
	|	РегистрСведений.ЕПСПараметрыОткрытияЛицевыхСчетов КАК ЕПСПараметрыОткрытияЛицевыхСчетов
	|ГДЕ
	|	ЕПСПараметрыОткрытияЛицевыхСчетов.Счет = &Счет";	
	
	МассивРезультатов	= Запрос.ВыполнитьПакет();
	
	Выборка = МассивРезультатов[0].Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеСчета, Выборка);
	КонецЕсли;
	
	ВыборкаВидыСубконто	= МассивРезультатов[1].Выбрать();
	
	ДанныеСчета.КоличествоСубконто	= ВыборкаВидыСубконто.Количество();
	
	ИндексСубконто	= 0;
	
	Пока ВыборкаВидыСубконто.Следующий() Цикл
		
		ИндексСубконто	= ИндексСубконто + 1;
		
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто,                   ВыборкаВидыСубконто.ВидСубконто);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "Наименование",  ВыборкаВидыСубконто.Наименование);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "ТипЗначения",   ВыборкаВидыСубконто.ТипЗначения);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "Суммовой",      ВыборкаВидыСубконто.Суммовой);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "ТолькоОбороты", ВыборкаВидыСубконто.ТолькоОбороты);
		
	КонецЦикла;
	
	ВыборкаПарныйСчет = МассивРезультатов[2].Выбрать();
	
	Если ВыборкаПарныйСчет.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеСчета, ВыборкаПарныйСчет,"СчетПарный");
	КонецЕсли;
	
	// СС 26.04.2022
	ВыборкаПравилоОткрытия	= МассивРезультатов[3].Выбрать();
	
	ИндексАналитика	= 0;
	Если ВыборкаПравилоОткрытия.Следующий() Тогда
		
		Для Каждого СтрокаАналитика Из ВыборкаПравилоОткрытия.ПравилоОткрытия.ВидыАналитикОткрытия Цикл
			
			ИндексАналитика	= ИндексАналитика + 1;

			ДанныеСчета.Вставить("Аналитика" + ИндексАналитика,                   СтрокаАналитика.ВидАналитики);
			ДанныеСчета.Вставить("Аналитика" + ИндексАналитика + "Наименование",  СтрокаАналитика.ВидАналитики.Наименование);
			ДанныеСчета.Вставить("Аналитика" + ИндексАналитика + "ТипЗначения",   СтрокаАналитика.ВидАналитики.ТипЗначения);
						
		КонецЦикла;
		
	КонецЕсли;
	ДанныеСчета.КоличествоАналитик	= ИндексАналитика;	
	//\
	
	Возврат ДанныеСчета;
	
КонецФункции

Функция НаСчетеВедетсяУчетПоНоменклатурнымГруппам(Знач Счет) Экспорт
	
	// СС 
	Счет 		  = БухгалтерскийУчет.ПолучитьВладельцаЛицевыеСчета(Счет);	
	СвойстваСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Счет);

	УчетПоНомГруппам = СвойстваСчета.ВидСубконто1 = ПланыВидовХарактеристик.ЕПСВидыСубконто.НоменклатурныеГруппы
		ИЛИ СвойстваСчета.ВидСубконто2 = ПланыВидовХарактеристик.ЕПСВидыСубконто.НоменклатурныеГруппы
		ИЛИ СвойстваСчета.ВидСубконто3 = ПланыВидовХарактеристик.ЕПСВидыСубконто.НоменклатурныеГруппы;

	Возврат УчетПоНомГруппам;
	//\
	
КонецФункции

Функция НаСчетеВедетсяУчетПоПрочимДоходамИРасходам(Счет) Экспорт
	
	// СС [16.08.2018]
	Счет 		  = БухгалтерскийУчет.ПолучитьВладельцаЛицевыеСчета(Счет);		
	СвойстваСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Счет);
	
	УчетПоПрочимДоходамИРасходам = СвойстваСчета.ВидСубконто1 = ПланыВидовХарактеристик.ЕПСВидыСубконто.ПрочиеДоходыИРасходы
		ИЛИ СвойстваСчета.ВидСубконто2 = ПланыВидовХарактеристик.ЕПСВидыСубконто.ПрочиеДоходыИРасходы
		ИЛИ СвойстваСчета.ВидСубконто3 = ПланыВидовХарактеристик.ЕПСВидыСубконто.ПрочиеДоходыИРасходы;
	
	Возврат УчетПоПрочимДоходамИРасходам;
	//\
	
КонецФункции

Функция НаСчетеВедетсяУчетПоРаботникамОрганизации(Счет) Экспорт
	
	Счет 		  = БухгалтерскийУчет.ПолучитьВладельцаЛицевыеСчета(Счет);			
	СвойстваСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Счет);

	УчетПоРаботникамОрганизации = СвойстваСчета.ВидСубконто3 = ПланыВидовХарактеристик.ЕПСВидыСубконто.РаботникиОрганизаций
		ИЛИ СвойстваСчета.ВидСубконто2 = ПланыВидовХарактеристик.ЕПСВидыСубконто.РаботникиОрганизаций
		ИЛИ СвойстваСчета.ВидСубконто1 = ПланыВидовХарактеристик.ЕПСВидыСубконто.РаботникиОрганизаций;

	Возврат УчетПоРаботникамОрганизации;

КонецФункции

Функция НаСчетеВедетсяУчетПоНазначениямПодотчетныхСредств(Счет) Экспорт
	
	Счет 		  = БухгалтерскийУчет.ПолучитьВладельцаЛицевыеСчета(Счет);			
	СвойстваСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Счет);

	УчетПоНазначениямПодотчетныхСредств = СвойстваСчета.ВидСубконто3 = ПланыВидовХарактеристик.ЕПСВидыСубконто.НазначениеПодотчетныхСредств
		ИЛИ СвойстваСчета.ВидСубконто2 = ПланыВидовХарактеристик.ЕПСВидыСубконто.НазначениеПодотчетныхСредств
		ИЛИ СвойстваСчета.ВидСубконто1 = ПланыВидовХарактеристик.ЕПСВидыСубконто.НазначениеПодотчетныхСредств;

	Возврат УчетПоНазначениямПодотчетныхСредств;

КонецФункции

Функция НаСчетеВедетсяУчетПоНематериальнымАктивам(Счет) Экспорт

	Счет 		  = БухгалтерскийУчет.ПолучитьВладельцаЛицевыеСчета(Счет);			
	СвойстваСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Счет);

	УчетПоНематериальнымАктивам = СвойстваСчета.ВидСубконто3 = ПланыВидовХарактеристик.ЕПСВидыСубконто.НематериальныеАктивы
		ИЛИ СвойстваСчета.ВидСубконто2 = ПланыВидовХарактеристик.ЕПСВидыСубконто.НематериальныеАктивы
		ИЛИ СвойстваСчета.ВидСубконто1 = ПланыВидовХарактеристик.ЕПСВидыСубконто.НематериальныеАктивы;

	Возврат УчетПоНематериальнымАктивам;

КонецФункции

Функция НаСчетеВедетсяУчетПоДокументамРасчетовСПодотчетнымиЛицами(Счет) Экспорт

	Счет 		  = БухгалтерскийУчет.ПолучитьВладельцаЛицевыеСчета(Счет);			
	СвойстваСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Счет);

	УчетПоДокументамРасчетовСПодотчетнымиЛицами = СвойстваСчета.ВидСубконто3 = ПланыВидовХарактеристик.ЕПСВидыСубконто.ДокументыРасчетовСПодотчетнымиЛицами
		ИЛИ СвойстваСчета.ВидСубконто2 = ПланыВидовХарактеристик.ЕПСВидыСубконто.ДокументыРасчетовСПодотчетнымиЛицами
		ИЛИ СвойстваСчета.ВидСубконто1 = ПланыВидовХарактеристик.ЕПСВидыСубконто.ДокументыРасчетовСПодотчетнымиЛицами;

	Возврат УчетПоДокументамРасчетовСПодотчетнымиЛицами;

КонецФункции

Функция ПолучитьПарныйСчетУчета(СчетУчета) Экспорт

	СчетПарный = Неопределено;
	
	СвойстваСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(СчетУчета);
	
	Если СвойстваСчета.Вид = ВидСчета.Активный Тогда
				
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕПСПарныеСчетаУчета.СчетПассивный
		|ИЗ
		|	РегистрСведений.ЕПСПарныеСчетаУчета КАК ЕПСПарныеСчетаУчета
		|ГДЕ
		|	ЕПСПарныеСчетаУчета.СчетАктивный = &СчетАктивный
		|	И ЕПСПарныеСчетаУчета.СчетПассивный <> ЗНАЧЕНИЕ(ПланСчетов.ЕПС.ПустаяСсылка)";
		
		Запрос.УстановитьПараметр("СчетАктивный", СчетУчета);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			СчетПарный = ВыборкаДетальныеЗаписи.СчетПассивный;
		КонецЕсли;
				
	ИначеЕсли СвойстваСчета.Вид = ВидСчета.Пассивный Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕПСПарныеСчетаУчета.СчетАктивный
		|ИЗ
		|	РегистрСведений.ЕПСПарныеСчетаУчета КАК ЕПСПарныеСчетаУчета
		|ГДЕ
		|	ЕПСПарныеСчетаУчета.СчетПассивный = &СчетПассивный
		|	И ЕПСПарныеСчетаУчета.СчетАктивный <> ЗНАЧЕНИЕ(ПланСчетов.ЕПС.ПустаяСсылка)";
		
		Запрос.УстановитьПараметр("СчетПассивный", СчетУчета);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			СчетПарный = ВыборкаДетальныеЗаписи.СчетАктивный;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СчетПарный;

КонецФункции // ()

Функция ИндексСубконтоПоВиду(СчетУчета, ВидСубконто) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СчетУчета) Тогда
	    Возврат 0;
	КонецЕсли;
	
	СвойстваСчета = ПолучитьСвойстваСчета(СчетУчета);
	
	Если СвойстваСчета.ВидСубконто1 = ВидСубконто Тогда
		Возврат 1;	
	ИначеЕсли СвойстваСчета.ВидСубконто2 = ВидСубконто Тогда
		Возврат 2;
	ИначеЕсли СвойстваСчета.ВидСубконто3 = ВидСубконто Тогда  
		Возврат 3;	 
	КонецЕсли;	
	
	Возврат 0;

КонецФункции // ()

//Функция возвращает типы значений субконто, связанных с именами реквизитов.
//
// Возвращаемое значение:
//   Соответствие   - ключ - имя реквизита, значение - описание типов связанных значений субконто.
//
Функция ВсеТипыСвязанныхСубконто() Экспорт
	
	СвязанныеСубконто = Новый Соответствие;
	
	БухгалтерскийУчетПереопределяемый.УстановитьТипыСвязанныхСубконто(СвязанныеСубконто);
	
	СвязанныеСубконто.Вставить("Организация", БухгалтерскийУчетПереопределяемый.ТипыСвязанныеСОрганизацией());
	
	Возврат СвязанныеСубконто;
	
КонецФункции

#КонецОбласти

#Область ИспользованиеОднойНоменклатурнойГруппы

// Функция возвращает признак использования одной номенклатурной группы.
//
Функция ИспользоватьОднуНоменклатурнуюГруппу() Экспорт

	Возврат НЕ ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоНоменклатурныхГрупп") 
		И ЗначениеЗаполнено(БухгалтерскийУчетВызовСервераПовтИсп.ОсновнаяНоменклатурнаяГруппа());

КонецФункции

// Функция получает единственную номенклатурную группу.
//
// Возвращаемое значение:
//		Основная номенклатурная группа - Тип НоменклатурныеГруппы, если ничего не найдено, то возвращается пустая ссылка.
Функция ОсновнаяНоменклатурнаяГруппа() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 2
	|	НоменклатурныеГруппы.Ссылка
	|ИЗ
	|	Справочник.НоменклатурныеГруппы КАК НоменклатурныеГруппы
	|ГДЕ
	|	НЕ НоменклатурныеГруппы.ПометкаУдаления
	|	И НЕ НоменклатурныеГруппы.ЭтоГруппа";
	Выборка = Запрос.Выполнить().Выбрать();
	// Если опция ВестиУчетПоНесколькимНоменклатурнымГруппам выключена, но номенклатурная группа одна,
	// то все равно подставляем эту номенклатурную группу.
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		ОсновнаяНоменклатурнаяГруппа = Выборка.Ссылка;
	Иначе
		ОсновнаяНоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ОсновнаяНоменклатурнаяГруппа;

КонецФункции

#КонецОбласти
