// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Ссылка) тогда
	    ЭтотОбъект.Дата = ТекущаяДатаСеанса();
	КонецЕсли;	
КонецПроцедуры

Функция ПолучитьАртикулОЗ(ЗалоговыйБилет, ОбъектЗалога)
	Запрос = Новый Запрос;     
	Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.УстановитьПараметр("ОбъектЗалога", ОбъектЗалога);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
	               |			&Дата,
	               |			ЗалоговыйБилет = &ЗалоговыйБилет
	               |				И ОбъектЗалога = &ОбъектЗалога) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		Возврат Выборка.Артикул;
	КонецЕсли;	
	Возврат "<не определен>";
КонецФункции

// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	Движения.ЛБ_ОборотыПоОперациямЗайма.Записывать = Истина;
	Движения.ЛБ_ОбъектыЗалога.Записывать = Истина;    
	Движения.ЛБ_ОбъектыЗалогаВПути.Записывать = Истина;
	Движения.ЛБ_ОбъектыЗалогаВСумке.Записывать = Истина;   
	Движения.ЛБ_СостояниеЗалоговогоБилета.Записывать = Истина;
    Движения.ЛБ_СостояниеОбъектаЗалога.Записывать = Истина; 
	Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Записывать = Истина; 
	Движения.ЛБ_ОприходованныеОбъектыЗалога.Записывать = Истина;
	
	ТаблицаЗБ = ЭтотОбъект.Товары.Выгрузить(); 
	ТаблицаЗБ.Свернуть("ЗалоговыйБилет");  
	ТаблицаЗБ.Очистить();
	
	Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыПоступленияОбъектовЗалога.РазборСумки Тогда
		ТаблицаОстатковВСумке = ЛБ_УправлениеЛомбардом.ПолучитьТоварыВСумке(Дата-1, Организация, ЭтотОбъект.ЛомбардКуда, ЭтотОбъект.СкладПолучатель, ЭтотОбъект.НакладнаяНаОтгрузку);     
		
		Для каждого Стр Из ЭтотОбъект.Товары Цикл  
			Отбор = новый структура;
			Отбор.Вставить("ЗалоговыйБилет", Стр.ЗалоговыйБилет); 
			Отбор.Вставить("ОбъектЗалога", Стр.ОбъектЗалога);
			СтрокиОст = ТаблицаОстатковВСумке.НайтиСтроки(Отбор);
			Если СтрокиОст.Количество() = 0 Тогда 
				ОбщегоНазначения.СообщитьПользователю("Изделие с артикулом " + ПолучитьАртикулОЗ(Стр.ЗалоговыйБилет, Стр.ОбъектЗалога) + " не найдено в сумке на складе " + СокрЛП(ЭтотОбъект.СкладПолучатель));
			Иначе   
				СтрЗБ = ТаблицаЗБ.Добавить();  
				СтрЗБ.ЗалоговыйБилет = Стр.ЗалоговыйБилет;

				СтрОст = СтрокиОст.Получить(0);
				Движение = Движения.ЛБ_ОбъектыЗалогаВСумке.ДобавитьРасход();
				Движение.Период = Дата;
				Движение.Организация = Организация;
				Движение.Отправитель = СтрОст.Отправитель; 
				Движение.СкладОтправитель = СтрОст.СкладОтправитель; 
				Движение.Получатель = СтрОст.Получатель; 
				Движение.СкладПолучатель = СтрОст.СкладПолучатель;
				Движение.ЗалоговыйБилет = СтрОст.ЗалоговыйБилет;
				Движение.ОбъектЗалога = СтрОст.ОбъектЗалога;
				Движение.Количество = СтрОст.Количество;
				Движение.СуммаОценки = СтрОст.СуммаОценки; 
				Движение.Инкассатор = СтрОст.Инкассатор;
                Движение.НакладнаяНаОтгрузку = СтрОст.НакладнаяНаОтгрузку;
			КонецЕсли;   
			
			Движение = Движения.ЛБ_ОбъектыЗалога.ДобавитьПриход();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Ломбард = ЛомбардКуда;  
			Движение.Склад = СкладПолучатель;
			Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
			Движение.ОбъектЗалога = Стр.ОбъектЗалога;
			Движение.Количество = Стр.Количество;
			Движение.СуммаОценки = Стр.СуммаОценки;  
			
			Движение = Движения.ЛБ_ОприходованныеОбъектыЗалога.Добавить();
			Движение.Период = Дата;
            Движение.Склад = СкладПолучатель;
			Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
			Движение.ОбъектЗалога = Стр.ОбъектЗалога;
			
			Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить();
			Движение.Период = Дата;
			Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
			Движение.ОбъектЗалога = Стр.ОбъектЗалога;
			Движение.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ПринятНаСклад;
			СтруктураСостояниеОЗ = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектовЗалогаЗалоговогоБилета(Дата-1, Стр.ЗалоговыйБилет, Стр.ОбъектЗалога);
			Если НЕ СтруктураСостояниеОЗ = неопределено Тогда  
				Движение.СуммаЗайма = СтруктураСостояниеОЗ.СуммаЗайма;
				Движение.СуммаОценки = СтруктураСостояниеОЗ.СуммаОценки;
				Движение.СуммаДолгаЗайма = СтруктураСостояниеОЗ.СуммаДолгаЗайма;
				Движение.СуммаОплаты = СтруктураСостояниеОЗ.СуммаОплаты;   
				Движение.СуммаОценкиНачальная = СтруктураСостояниеОЗ.СуммаОценкиНач;
			КонецЕсли;		
			Движение.Комментарий = "Принят " + СокрЛП(ЭтотОбъект.ЛомбардКуда) + ", склад-получатель " + СокрЛП(ЭтотОбъект.СкладПолучатель) + " из: " +
			                  СокрЛП(ЭтотОбъект.ЛомбардОткуда) + ", склад отгрузки " + СокрЛП(ЭтотОбъект.СкладОтправитель); 
		КонецЦикла;	

	Иначе
		ТаблицаВПути = ЛБ_УправлениеЛомбардом.ПолучитьТоварыВПути(Дата-1, Организация, ЛомбардОткуда, СкладОтправитель, ЛомбардКуда, СкладПолучатель, НакладнаяНаОтгрузку, ВидОперации);   
		
		Для каждого Стр Из ЭтотОбъект.Товары Цикл  
			Отбор = новый структура;
			Отбор.Вставить("ЗалоговыйБилет", Стр.ЗалоговыйБилет); 
			Отбор.Вставить("ОбъектЗалога", Стр.ОбъектЗалога);
			СтрокиОст = ТаблицаВПути.НайтиСтроки(Отбор);
			Если СтрокиОст.Количество() = 0 Тогда 
				ОбщегоНазначения.СообщитьПользователю("Изделие с артикулом " + ПолучитьАртикулОЗ(Стр.ЗалоговыйБилет, Стр.ОбъектЗалога) + " не найдено в пути на склад " + СокрЛП(ЭтотОбъект.СкладПолучатель));
			Иначе           
				СтрЗБ = ТаблицаЗБ.Добавить();  
				СтрЗБ.ЗалоговыйБилет = Стр.ЗалоговыйБилет;

				СтрОст = СтрокиОст.Получить(0);
				Движение = Движения.ЛБ_ОбъектыЗалогаВПути.ДобавитьРасход();
				Движение.Период = Дата;
				Движение.Организация = Организация;
				Движение.Отправитель = СтрОст.Отправитель; 
				Движение.СкладОтправитель = СтрОст.СкладОтправитель; 
				Движение.Получатель = СтрОст.Получатель; 
				Движение.СкладПолучатель = СтрОст.СкладПолучатель;
				Движение.ЗалоговыйБилет = СтрОст.ЗалоговыйБилет;
				Движение.ОбъектЗалога = СтрОст.ОбъектЗалога;
				Движение.Количество = Стр.Количество;
				Движение.СуммаОценки = СтрОст.СуммаОценки; 
				Движение.Инкассатор = СтрОст.Инкассатор; 
				Движение.НакладнаяНаОтгрузку = СтрОст.НакладнаяНаОтгрузку;
				
				Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить();
				Движение.Период = Дата;
				Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
				Движение.ОбъектЗалога = Стр.ОбъектЗалога;
				Движение.СтатусОбъектаЗалога = ?(ЭтотОбъект.Категория = Перечисления.ЛБ_КатегорииПоступленияОбъектовЗалога.Сумка, Перечисления.ЛБ_СтатусыОбъектовЗалога.ПринятНаСкладСумка, Перечисления.ЛБ_СтатусыОбъектовЗалога.ПринятНаСклад);
				СтруктураСостояниеОЗ = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектовЗалогаЗалоговогоБилета(Дата-1, Стр.ЗалоговыйБилет, Стр.ОбъектЗалога);
			    Если НЕ СтруктураСостояниеОЗ = неопределено Тогда  
					Движение.СуммаЗайма = СтруктураСостояниеОЗ.СуммаЗайма;
					Движение.СуммаОценки = СтруктураСостояниеОЗ.СуммаОценки;
					Движение.СуммаДолгаЗайма = СтруктураСостояниеОЗ.СуммаДолгаЗайма;
					Движение.СуммаОплаты = СтруктураСостояниеОЗ.СуммаОплаты;   
					Движение.СуммаОценкиНачальная = СтруктураСостояниеОЗ.СуммаОценкиНач;
					Если СтруктураСостояниеОЗ.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ВПутиОХ Тогда
						 Движение.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение; 	
					КонецЕсли;	
				КонецЕсли;					
				Движение.Комментарий = "Принят " + ?(ЭтотОбъект.Категория = Перечисления.ЛБ_КатегорииПоступленияОбъектовЗалога.Сумка, "(сумка) ", "");
				Движение.Комментарий = Движение.Комментарий + СокрЛП(ЭтотОбъект.ЛомбардКуда) + ", склад-получатель " + СокрЛП(ЭтотОбъект.СкладПолучатель) + " из: " +
				                  СокрЛП(ЭтотОбъект.ЛомбардОткуда) + ", склад отгрузки " + СокрЛП(ЭтотОбъект.СкладОтправитель);  
								  
				Если ЭтотОбъект.Категория = Перечисления.ЛБ_КатегорииПоступленияОбъектовЗалога.Сумка Тогда   
					Движение = Движения.ЛБ_ОбъектыЗалогаВСумке.ДобавитьПриход();
					Движение.Период = Дата;
					Движение.Организация = Организация;
					Движение.Отправитель = ЛомбардОткуда; 
					Движение.СкладОтправитель = ЭтотОбъект.СкладОтправитель; 
					Движение.Получатель = ЛомбардКуда; 
					Движение.СкладПолучатель = ЭтотОбъект.СкладПолучатель;
					Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
					Движение.ОбъектЗалога = Стр.ОбъектЗалога;
					Движение.Количество = Стр.Количество;
					Движение.СуммаОценки = СтрОст.СуммаОценки; 
					Движение.Инкассатор = СтрОст.Инкассатор; 
					Движение.НакладнаяНаОтгрузку = СтрОст.НакладнаяНаОтгрузку; 
				Иначе          
					Движение = Движения.ЛБ_ОбъектыЗалога.ДобавитьПриход();
					Движение.Период = Дата;
					Движение.Организация = Организация;
					Движение.Ломбард = ЛомбардКуда;  
					Движение.Склад = СкладПолучатель;
					Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
					Движение.ОбъектЗалога = Стр.ОбъектЗалога;
					Движение.Количество = Стр.Количество;
					Движение.СуммаОценки = СтрОст.СуммаОценки;   
					
					Движение = Движения.ЛБ_ОприходованныеОбъектыЗалога.Добавить();
					Движение.Период = Дата;
		            Движение.Склад = СкладПолучатель;
					Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
					Движение.ОбъектЗалога = Стр.ОбъектЗалога;
			    КонецЕсли;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;        
	
	//ТаблицаЗБ = ЭтотОбъект.Товары.Выгрузить(); 
	ТаблицаЗБ.Свернуть("ЗалоговыйБилет");   
	
	Для каждого Стр Из ТаблицаЗБ Цикл
        Движение = Движения.ЛБ_ОборотыПоОперациямЗайма.Добавить();
		Движение.Период = Дата; 
		Движение.Залогодатель = Стр.ЗалоговыйБилет.Залогодатель;
		Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет; 
		Движение.Организация = ЭтотОбъект.Организация;
		Движение.Ломбард = ЭтотОбъект.ЛомбардКуда; 
		Движение.НакладнаяНаОтгрузку = НакладнаяНаОтгрузку; 
		Движение.ВидОперации = "Оприходование объектов залога" + ?(ЭтотОбъект.Категория = Перечисления.ЛБ_КатегорииПоступленияОбъектовЗалога.Сумка, " (сумка)", ""); 
		
		СтатусЗБ = ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(Дата-1, Стр.ЗалоговыйБилет);
		Если СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ВПутиОХ Тогда
			СостояниеЗБ = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗалоговогоБилета(ЭтотОбъект, Стр.ЗалоговыйБилет);
		    Движение = Движения.ЛБ_СостояниеЗалоговогоБилета.Добавить();
		    Движение.Период = Дата;
	        Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет; 
			Движение.Залогодатель = Стр.ЗалоговыйБилет.Залогодатель;
			Движение.НомерЗалоговогоБилета = Стр.ЗалоговыйБилет.НомерЗалоговогоБилета;
            Движение.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтвественноеХранение; 
			Движение.СхемаКредитования = Стр.ЗалоговыйБилет.СхемаКредитования;    
			Если НЕ СостояниеЗБ = неопределено Тогда
				Движение.СуммаЗайма = СостояниеЗБ.СуммаЗайма; 
				Движение.ДатаНачалаРасчетаПроцентов = СостояниеЗБ.ДатаНачалаРасчета;
				Движение.ДатаВыкупа = СостояниеЗБ.ДатаВыкупа;
				Движение.ДатаВыкупаЛьготныйСрок = СостояниеЗБ.ДатаВыкупаЛьготныйСрок;
				Движение.ПричинаПрименения = СостояниеЗБ.ПричинаПрименения;
				Движение.НомерДопСоглашения = СостояниеЗБ.НомерДопСоглашения; 
			КонецЕсли;	
   		КонецЕсли;  

	КонецЦикла;
	
	Движение = Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Добавить();
	Движение.Период = Дата;
	Движение.Организация = Организация;  
	Движение.ПодразделениеОсновное = ЭтотОбъект.ЛомбардКуда;
	Движение.СкладОсновной = ЭтотОбъект.СкладПолучатель;
	Движение.ПодразделениеОтправитель = ЭтотОбъект.ЛомбардОткуда;
	Движение.СкладОтправитель = ЭтотОбъект.СкладОтправитель;   
	Движение.ПодразделениеПолучатель = ЭтотОбъект.ЛомбардКуда;
	Движение.СкладПолучатель = ЭтотОбъект.СкладПолучатель;
	Движение.Количество = Товары.Итог("Количество");
	Движение.Ответственный = ЭтотОбъект.Ответственный; 
	Движение.НакладнаяНаОтгрузку = НакладнаяНаОтгрузку;
    Движение.ВидОперации = ?(ЭтотОбъект.Категория = Перечисления.ЛБ_КатегорииПоступленияОбъектовЗалога.Сумка, "Оприходование (сумка)", "Оприходование на склад");
КонецПроцедуры

// Процедура - обработчик события "ОбработкаУдаленияПроведения".
//
Процедура ОбработкаУдаленияПроведения(Отказ)
				
	ЗапросП = Новый Запрос;
	ЗапросП.УстановитьПараметр("Дата", ЭтотОбъект.Дата); 
	ЗапросП.УстановитьПараметр("ОбъектыЗалога", ЭтотОбъект.Товары.ВыгрузитьКолонку("ОбъектЗалога"));
	ЗапросП.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                |	ЛБ_ОбъектыЗалога.Регистратор КАК Регистратор
	                |ИЗ
	                |	РегистрНакопления.ЛБ_ОбъектыЗалога КАК ЛБ_ОбъектыЗалога
	                |ГДЕ
	                |	ЛБ_ОбъектыЗалога.ОбъектЗалога В(&ОбъектыЗалога)
	                |	И ЛБ_ОбъектыЗалога.Период > &Дата
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                |	ЛБ_ОбъектыЗалогаВПути.Регистратор
	                |ИЗ
	                |	РегистрНакопления.ЛБ_ОбъектыЗалогаВПути КАК ЛБ_ОбъектыЗалогаВПути
	                |ГДЕ
	                |	ЛБ_ОбъектыЗалогаВПути.Период > &Дата
	                |	И ЛБ_ОбъектыЗалогаВПути.ОбъектЗалога В(&ОбъектыЗалога)";
	ВыборкаП = ЗапросП.Выполнить().Выбрать();
	Если ВыборкаП.Следующий() тогда 
		Сообщить("Есть более поздние операции по движению объектов залога из документа. Снятие документа с проведения запрещено.");  
		Отказ = Истина;
		Возврат;
	КонецЕсли;                                        
		
КонецПроцедуры // ОбработкаУдаленияПроведения()
