#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

/// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор  = "Приказ";
	КомандаПечати.Представление  = НСтр("ru = 'Приказ'");
	//КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати"; 
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор  = "Акция";
	КомандаПечати.Представление  = НСтр("ru = 'Акция'");
КонецПроцедуры	

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// Устанавливаем признак доступности печати покомплектно.
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	// Проверяем, нужно ли для макета ЗаключениеОбОценке формировать табличный документ.
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приказ") Тогда
		
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Приказ", "Приказ", 
		ПечатьПриказа(МассивОбъектов, ОбъектыПечати));  
    ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Акция") Тогда
		
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Акция", "Акция", 
		ПечатьАкции(МассивОбъектов, ОбъектыПечати)); 
	КонецЕсли;
	
	//ОбщегоНазначенияБП.ЗаполнитьДополнительныеПараметрыПечати(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);	
	
КонецПроцедуры

Функция ПечатьПриказа(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_Приложение_К_Приказу"; 
		
	ВыборкаДанныеДокументов = ПолучитьВыборкуДанныхДокумента(МассивОбъектов);
	
	НаименованияОрганизации = НаименованиеОрганизации();
	НаименованиеОрганизацииСокращенное = НаименованияОрганизации.НаименованиеСокращенное;
	НаименованиеОрганизацииПолное      = НаименованияОрганизации.НаименованиеПолное;
	ДиректорФИО = ФИОДиректора();
		
	Если ВыборкаДанныеДокументов.Следующий() Тогда  
		
		ТаблицаРегистраторов = ПолучитьТаблицуРегистраторов(ВыборкаДанныеДокументов.СсылкаНаДокумент);   
		РегистраторыПоГруппам = ТаблицаРегистраторов.Скопировать();
		РегистраторыПоГруппам.Свернуть("Группа, РегистраторМеталлы, РегистраторВставки, РегистраторСтавки"); 
		Регистраторы = РегистраторыПоГруппам.Скопировать();
		Регистраторы.Свернуть("РегистраторМеталлы, РегистраторВставки, РегистраторСтавки"); 
		НомерПриложения = 0;      
		РегистраторыМеталлы = Новый СписокЗначений;  
		РегистраторыВставки = Новый СписокЗначений;
        РегистраторыСтавки = Новый СписокЗначений;
		
		Для каждого СтрР Из Регистраторы Цикл
			Если РегистраторыМеталлы.НайтиПоЗначению(СтрР.РегистраторМеталлы) = неопределено Тогда 
				РегистраторыМеталлы.Добавить(СтрР.РегистраторМеталлы);
			КонецЕсли;
			
			Если РегистраторыВставки.НайтиПоЗначению(СтрР.РегистраторВставки) = неопределено Тогда 
				РегистраторыВставки.Добавить(СтрР.РегистраторВставки);
			КонецЕсли;
			
			Если РегистраторыСтавки.НайтиПоЗначению(СтрР.РегистраторСтавки) = неопределено Тогда 
				РегистраторыСтавки.Добавить(СтрР.РегистраторСтавки);
			КонецЕсли;	
		КонецЦикла;	
		
		ТаблицаМеталловОбщая = ПолучитьВыборкуПрейскурантаЦен(РегистраторыМеталлы);
		ТаблицаМеталлов = ТаблицаМеталловОбщая.СкопироватьКолонки();
		ТаблицаВставкиОбщая = ПолучитьВыборкуПрейскурантаЦенВставки(РегистраторыВставки); 
		ТаблицаВставки = ТаблицаВставкиОбщая.СкопироватьКолонки();
		ТаблицаСтавокОбщая = ПолучитьВыборкуПрейскурантаСтавок(РегистраторыСтавки, ВыборкаДанныеДокументов.СсылкаНаДокумент.Дата);
		ТаблицаСтавок = ТаблицаСтавокОбщая.СкопироватьКолонки();
		
		СтруктураБазоваяЦенаМ = ПолучитьБазовыеЦеныМеталлы(ВыборкаДанныеДокументов.СсылкаНаДокумент.Дата);
		БазоваяКатегория = СтруктураБазоваяЦенаМ.Категория; 
		БазоваяПроба = СтруктураБазоваяЦенаМ.Проба;  

		Для каждого СтрРег Из Регистраторы Цикл  
			Если НЕ НомерПриложения = 0 Тогда
			    ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			НомерПриложения = НомерПриложения + 1;  
			ПриказНомер = ВыборкаДанныеДокументов.НомерПриказа + ?(Регистраторы.Количество() = 1, "", "-" + Строка(НомерПриложения));
			ПриказДата  = СтрШаблон("%1г.", Формат(ВыборкаДанныеДокументов.ДатаНачалаДействияПриказа, "ДЛФ = Д"));
			
			ОтборГ = новый Структура;  
			ОтборГ.Вставить("РегистраторМеталлы", СтрРег.РегистраторМеталлы);
			ОтборГ.Вставить("РегистраторВставки", СтрРег.РегистраторВставки); 
			ОтборГ.Вставить("РегистраторСтавки", СтрРег.РегистраторСтавки); 
			СтрокиГ = РегистраторыПоГруппам.НайтиСтроки(ОтборГ); 
			
			СтрокаЛомбардов = "";
			Для каждого СтрГ Из СтрокиГ Цикл
				ОтборР = новый Структура;  
				ОтборР.Вставить("Группа", СтрГ.Группа);
				ОтборР.Вставить("РегистраторМеталлы", СтрРег.РегистраторМеталлы);
				ОтборР.Вставить("РегистраторВставки", СтрРег.РегистраторВставки); 
				ОтборР.Вставить("РегистраторСтавки", СтрРег.РегистраторСтавки); 
				СтрокиР = ТаблицаРегистраторов.НайтиСтроки(ОтборР);   
				
				ГородЛомбардов = ?(ЗначениеЗаполнено(СтрГ.Группа), СокрЛП(СтрГ.Группа), "Вне групп"); 
				СтрокаЛомбардов = СтрокаЛомбардов + ?(ПустаяСтрока(СтрокаЛомбардов), "", "; ") + ГородЛомбардов;
				Ном = 0;   
				СтрокаЛомбарды = "";
				Для каждого СтрР из СтрокиР Цикл  
					СтрокаЛомбарды = СтрокаЛомбарды + ?(Ном = 0, "", ", ") + ?(ЗначениеЗаполнено(СтрР.Ломбард.НомерЛомбарда), "№ " +  СокрЛП(СтрР.Ломбард.НомерЛомбарда), СокрЛП(СтрР.Ломбард)); 
					Ном = Ном + 1;
				конеццикла;   
				СтрокаЛомбардов = СтрокаЛомбардов + " (" + СтрокаЛомбарды + ")"; 
			КонецЦикла;
			
			//СписокЛомбардов = новый СписокЗначений;
			//Для каждого СтрР из СтрокиР Цикл  
			//	СписокЛомбардов.Добавить(СтрР.Ломбард);
			//конеццикла;      
			//СтрокаЛомбарды = ПолучитьСтрокуЛомбардов(ВыборкаДанныеДокументов.СсылкаНаДокумент.Дата, СписокЛомбардов);
						
			//приказ
			Макет = ПолучитьМакет("ПФ_MXL_ШапкаПриказа");
			ПриказНомер = ВыборкаДанныеДокументов.НомерПриказа;
			ПриказДата  = СтрШаблон("%1г.", Формат(ВыборкаДанныеДокументов.ДатаНачалаДействияПриказа, "ДЛФ = Д"));
			Ломбарды    = ВыборкаДанныеДокументов.СтрокаЛомбарды;
			ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
			ОбластьТекст  = Макет.ПолучитьОбласть("Текст");         
			ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
			
			ОбластьШапка.Параметры.СокращенноеНаименованиеОрганизации = НаименованиеОрганизацииСокращенное;
			ОбластьШапка.Параметры.ПолноеНаименованиеОрганизации      = НаименованиеОрганизацииПолное; 
			ОбластьШапка.Параметры.НомерПриказа = ПриказНомер; 
			ОбластьШапка.Параметры.ДатаПриказа = ПриказДата;
					
			ТабличныйДокумент.Вывести(ОбластьШапка);
			
			ОбластьТекст.Параметры.НачальникОДО = ВыборкаДанныеДокументов.СсылкаНаДокумент.НачальникОДО;
			ОбластьТекст.Параметры.СокращенноеНаименованиеОрганизации          = НаименованиеОрганизацииСокращенное;
			ОбластьТекст.Параметры.НачальникОРБ              = ВыборкаДанныеДокументов.СсылкаНаДокумент.НачальникОРБ;  
			//ОбластьТекст.Параметры.ГородЛомбардов                              = ГородЛомбардов;
			ОбластьТекст.Параметры.СписокЛомбардовСАдресами                    = СтрокаЛомбардов;
			ОбластьТекст.Параметры.ДатаПриказа   = ПриказДата;
			ОбластьТекст.Параметры.Программа     = "Будет название программы";
			ОбластьТекст.Параметры.Ответственный = ВыборкаДанныеДокументов.Ответственный;
			
			ТабличныйДокумент.Вывести(ОбластьТекст);
			
			ОбластьПодвал.Параметры.Директор = ДиректорФИО;
			
			ТабличныйДокумент.Вывести(ОбластьПодвал);
			
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			//приложение к приказу
			Макет = ПолучитьМакет("ПФ_MXL_Приказ");
			
			ОтборМ = Новый Структура;
			ОтборМ.Вставить("Регистратор", СтрРег.РегистраторМеталлы); 
			СтрокиМ = ТаблицаМеталловОбщая.НайтиСтроки(ОтборМ); 
			ТаблицаМеталлов.Очистить();
			Для каждого стрМ из СтрокиМ Цикл
				НоваяСтрМ = ТаблицаМеталлов.Добавить();
			    ЗаполнитьЗначенияСвойств(НоваяСтрМ, стрМ);
			Конеццикла;	
       		//ТаблицаМеталлов = ПолучитьВыборкуПрейскурантаЦен(СтрРег.РегистраторМеталлы);  
			ТаблицаМеталлов.Сортировать("Категория, Металл, ГруппаМеталл Убыв");
			ТаблицаМ = ТаблицаМеталлов.Скопировать();
			ТаблицаМ.Свернуть("Металл");    
			ТаблицаГрупп = ТаблицаМеталлов.Скопировать();
			ТаблицаГрупп.Свернуть("Металл, ГруппаМеталл");
			КолГруппМ = ТаблицаГрупп.Количество();  
			
			
			ОтборВ = Новый Структура;
			ОтборВ.Вставить("Регистратор", СтрРег.РегистраторВставки); 
			СтрокиВ = ТаблицаВставкиОбщая.НайтиСтроки(ОтборВ); 
			ТаблицаВставки.Очистить();
			Для каждого стрВ из СтрокиВ Цикл
				НоваяСтрВ = ТаблицаВставки.Добавить();
			    ЗаполнитьЗначенияСвойств(НоваяСтрВ, стрВ);
			Конеццикла;	
			//ТаблицаВставки = ПолучитьВыборкуПрейскурантаЦенВставки(СтрРег.РегистраторВставки);  
			ТаблицаВ = ТаблицаВставки.Скопировать();  
			Отбор0 = Новый Структура;
			Отбор0.Вставить("ОбособленныйВыводПечать", Истина);    
			Строки0 = ТаблицаВ.НайтиСтроки(Отбор0);
			Для каждого Стр0 Из Строки0 Цикл 
				ТаблицаВ.Удалить(Стр0);
			Конеццикла;	
			ТаблицаВ.Свернуть("ВидОгранки, ФормаОгранки, КачествоОгранки");
			ТаблицаВ.Сортировать("ВидОгранки Убыв, КачествоОгранки");
            КолГруппВ = ТаблицаВ.Количество()*2;
			
			ОтборС = Новый Структура;
			ОтборС.Вставить("Регистратор", СтрРег.РегистраторСтавки); 
			СтрокиС = ТаблицаСтавокОбщая.НайтиСтроки(ОтборС); 
			ТаблицаСтавок.Очистить();
			Для каждого стрС из СтрокиС Цикл
				НоваяСтрС = ТаблицаСтавок.Добавить();
			    ЗаполнитьЗначенияСвойств(НоваяСтрС, стрС);
			Конеццикла;	
			//ТаблицаСтавок = ПолучитьВыборкуПрейскурантаСтавок(СтрРег.РегистраторСтавки);
			ТаблицаСК = ТаблицаСтавок.Скопировать();
			ТаблицаСК.Свернуть("СхемаКредитования, Срок");
			ТаблицаСК.Сортировать("СхемаКредитования, Срок");
			ТаблицаПоказатели = ТаблицаСтавок.Скопировать();   
			ТаблицаПоказатели.Сортировать("Категория, ПричинаПрименения, ДеньНачалаПрименения");
			Если СтрРег.РегистраторСтавки.НеВыводитьНаПечатьПричиныПрименения Тогда 
				ТаблицаПоказатели.Свернуть("СхемаКредитования, Срок, Категория, ДеньНачалаПрименения");
			Иначе	
			    ТаблицаПоказатели.Свернуть("СхемаКредитования, Срок, Категория, ПричинаПрименения, ДеньНачалаПрименения");
			КонецЕсли;	
			ТаблицаД = ТаблицаСтавок.Скопировать();
			ТаблицаД.Свернуть("ДиапазонСумм"); 
            КолГруппС = ТаблицаД.Количество() + 3; 
			
			
			КолГрупп = Макс(КолГруппМ, КолГруппВ, КолГруппС);
			Если КолГрупп = 0 Тогда
			    КолГрупп = 10;
			КонецЕсли;			
				
			// Формируем основную часть. 
			ОбластьШапка = Макет.ПолучитьОбласть("Шапка|КолонкаОсновная"); 
			ОбластьШапкаПусто = Макет.ПолучитьОбласть("Шапка|КолонкаШапкаПусто"); 
			ОбластьШапкаУтверждаю = Макет.ПолучитьОбласть("Шапка|КолонкаШапкаУтверждаю");  
			НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
			
			ОбластьШапка.Параметры.ДатаПриказа                        = ПриказДата;
			ОбластьШапка.Параметры.НомерПриказа                       = ПриказНомер; 
			ОбластьШапка.Параметры.СокращенноеНаименованиеОрганизации = НаименованиеОрганизацииСокращенное; 
			//ОбластьШапка.Параметры.ГородЛомбардов                     = ГородЛомбардов;
			ОбластьШапка.Параметры.НомераАдресовЛомбардов             = СтрокаЛомбардов;
			ТабличныйДокумент.Вывести(ОбластьШапка); 
			
			Для Сч = 1 По КолГрупп-1 Цикл  
				ТабличныйДокумент.Присоединить(ОбластьШапкаПусто);
			Конеццикла;        
			ОбластьШапкаУтверждаю.Параметры.Организация = НаименованиеОрганизацииСокращенное;
			ОбластьШапкаУтверждаю.Параметры.Директор     = ДиректорФИО;
			ТабличныйДокумент.Присоединить(ОбластьШапкаУтверждаю); 
						
			ТабличныйДокумент.Область(НомерСтр + 5, 1, НомерСтр + 5, КолГрупп).Объединить();
			ТабличныйДокумент.Область(НомерСтр + 6, 1, НомерСтр + 6, КолГрупп).Объединить();
			ТабличныйДокумент.Область(НомерСтр + 7, 1, НомерСтр + 7, КолГрупп).Объединить();
			ТабличныйДокумент.Область(НомерСтр + 8, 1, НомерСтр + 8, КолГрупп).Объединить();  
					
			//металлы    
			Если НЕ ТаблицаМеталлов.Количество() = 0  Тогда
				ОбластьШапкаОсн = Макет.ПолучитьОбласть("ШапкаОценкиМеталлов|КолонкаОсновная");
				ОбластьШапкаДоп = Макет.ПолучитьОбласть("ШапкаОценкиМеталлов|КолонкаДоп"); 
						
				НомерСтр = ТабличныйДокумент.ВысотаТаблицы + 1;
				НомерКолонкиНач = 3;
				ТабличныйДокумент.Вывести(ОбластьШапкаОсн);
				
				Ном = 0;
				Для каждого СтрМ Из ТаблицаМ Цикл          
					НомерКолонкиКон = НомерКолонкиНач;
					ОбластьШапкаДоп.Параметры.Металл = СтрМ.Металл;
					
					ОтборМ = Новый структура;
					ОтборМ.Вставить("Металл", СтрМ.Металл); 
					Строки = ТаблицаГрупп.НайтиСтроки(ОтборМ);
					Для каждого стр Из Строки Цикл  
						Ном = Ном + 1;
						ОбластьШапкаДоп.Параметры.Проба = Стр.ГруппаМеталл; 
						ТабличныйДокумент.Присоединить(ОбластьШапкаДоп);
						НомерКолонкиКон = НомерКолонкиКон + 1; 
						
						ОтборМ.Вставить("ГруппаМеталл", Стр.ГруппаМеталл);
						ТаблицаМеталлов.Найтистроки(ОтборМ);             
		 			КонецЦикла;
					
					ТабличныйДокумент.Область(НомерСтр, НомерКолонкиНач, НомерСтр, НомерКолонкиКон-1).Объединить(); 
					ТабличныйДокумент.Область(НомерСтр + 1, НомерКолонкиНач, НомерСтр + 1, НомерКолонкиКон-1).Объединить(); 
					НомерКолонкиНач = НомерКолонкиКон; 
				КонецЦикла;
				
				ОбластьСтрокаОсн = Макет.ПолучитьОбласть("СтрокаОценки|КолонкаОсновная");
				ОбластьСтрокаДоп = Макет.ПолучитьОбласть("СтрокаОценки|КолонкаДоп"); 
				ОбластьСтрокаБаза = Макет.ПолучитьОбласть("СтрокаОценки|КолонкаБаза");
				
				ТаблицаК = ТаблицаМеталлов.Скопировать();
				ТаблицаК.Свернуть("Категория");
						  
				Для каждого СтрК из ТаблицаК Цикл 
					ОтборК = Новый структура;  
					ОтборК.Вставить("Категория", СтрК.Категория); 
					ОбластьСтрокаОсн.Параметры.Категория = СтрК.Категория;
					ТабличныйДокумент.Вывести(ОбластьСтрокаОсн);

					Для каждого СтрМ Из ТаблицаМ Цикл  
						ОтборМ = Новый структура; 
						ОтборМ.Вставить("Металл", СтрМ.Металл);
						Строки = ТаблицаГрупп.НайтиСтроки(ОтборМ);
					    Для каждого стр Из Строки Цикл  
							ОтборК.Вставить("ГруппаМеталл", Стр.ГруппаМеталл);					
							СтрокиОсн = ТаблицаМеталлов.НайтиСтроки(ОтборК); 
							Если СтрокиОсн.Количество() = 0 Тогда
							    Цена = 0; 
								ЭтоБазоваяЦена = Ложь;
							Иначе
								Цена = СтрокиОсн.Получить(0).Цена; 
								Если БазоваяКатегория = СтрК.Категория И БазоваяПроба = СтрокиОсн.Получить(0).Проба Тогда
									ЭтоБазоваяЦена = Истина;
								Иначе
									ЭтоБазоваяЦена = Ложь;
								КонецЕсли;	
							КонецЕсли; 	
							Если ЭтоБазоваяЦена Тогда 
								ОбластьСтрокаБаза.Параметры.Цена = Цена; 
								ТабличныйДокумент.Присоединить(ОбластьСтрокаБаза);  
							Иначе	
								ОбластьСтрокаДоп.Параметры.Цена = Цена; 
								ТабличныйДокумент.Присоединить(ОбластьСтрокаДоп);  
							КонецЕсли;	
						КонецЦикла;	
					КонецЦикла;	
				Конеццикла;	 
				
				ОбластьПодвалМеталлы = Макет.ПолучитьОбласть("ПодвалМеталлы|КолонкаОсновная");
				
				ТекстМеталлы = "";   
				//Если ЗначениеЗаполнено(ВыборкаДанныеДокументов.СсылкаНаДокумент.ШаблонМеталлы) Тогда
				//	ШаблонМеталлы = ВыборкаДанныеДокументов.СсылкаНаДокумент.ШаблонМеталлы;
				//Иначе	                 
				//	СписокЛ = Новый СписокЗначений; 
				//	СписокЛ.Добавить(Справочники.ЛБ_Ломбарды.ПустаяСсылка());
				//	Для каждого Стр Из ВыборкаДанныеДокументов.СсылкаНаДокумент.Ломбарды цикл 
				//		СписокЛ.Добавить(Стр.Ломбард);
				//	Конеццикла;	
				//    ШаблонМеталлы = ЛБ_ОбщийМодуль.ПолучитьТекущийШаблон(ВыборкаДанныеДокументов.СсылкаНаДокумент.Дата, Перечисления.ЛБ_ВидыПрейскурантов.Металлы, СписокЛ); 
				//КонецЕсли;	
				//Если ЗначениеЗаполнено(ШаблонМеталлы) Тогда
				//	ИнформацияМеталлы = ШаблонМеталлы.ДопИнформацияМеталлы.Получить(); 
				//	
				//	ТекстHTML = "";
				//	Вложения = Новый Структура;
				//	ИнформацияМеталлы.ПолучитьHTML(ТекстHTML, Вложения);
				//	
				//	ТекстМеталлы = СтроковыеФункцииКлиентСервер.ИзвлечьТекстИзHTML(ТекстHTML); 			
				//КонецЕсли;    	
				//Если ПустаяСтрока(ТекстМеталлы) Тогда 
				//	ТабличныйДокумент.Вывести(ОбластьПодвалМеталлы);
				//Иначе            
				//	Для Счетчик = 1 По СтрЧислоСтрок(ТекстМеталлы) Цикл
				//	   ТекСтрока = СтрПолучитьСтроку(ТекстМеталлы, Счетчик);
				//	   ОбластьПодвалМеталлы.Параметры.ИнформацияМеталлы = ТекСтрока;
				//       ТабличныйДокумент.Вывести(ОбластьПодвалМеталлы);	
				//	КонецЦикла;
				//КонецЕсли;
			КонецЕсли;	
			
			//вставки   			
			ОбластьШапка = Макет.ПолучитьОбласть("ШапкаВставки");
			ТабличныйДокумент.Вывести(ОбластьШапка);
			
			Если НЕ ТаблицаВставки.Количество() = 0 Тогда
				ОбластьШапкаОсн = Макет.ПолучитьОбласть("ШапкаОценкиВставки|КолонкаОсновная");
				ОбластьШапкаДоп = Макет.ПолучитьОбласть("ШапкаОценкиВставки|КолонкаДопВ"); 
						
				ОбластьШапкаОсн.Параметры.ТекстВставки = "Качественные природные бриллианты круглой огранки (КР-57, КР-17) в изделиях 1 и 2 категории, а также некоторые виды бриллиантов фантазийной огранки:" + Символы.ПС +
				       "овал, груша, сердце, маркиз, принцесса, радиант, триллиант в юверирных изделиях 1, 2 и 3 категории оцениваются по следующим расценкам:";
				НомерСтр = ТабличныйДокумент.ВысотаТаблицы + 2;
				НомерКолонкиНач = 3;  
				НомерКолонкиКон = НомерКолонкиНач;
				
				Ном = 0;  
				ТабличныйДокумент.Вывести(ОбластьШапкаОсн);
				Для каждого СтрВ Из ТаблицаВ Цикл   
					Если ЗначениеЗаполнено(СтрВ.ВидОгранки) Тогда
					    ОбластьШапкаДоп.Параметры.ВидОгранки = СокрЛП(СтрВ.ВидОгранки) + символы.ПС + "(руб/карат)";
					Иначе
						ОбластьШапкаДоп.Параметры.ВидОгранки = СокрЛП(СтрВ.ФормаОгранки) + символы.ПС + "(руб/карат)";
					КонецЕсли;	
					ОбластьШапкаДоп.Параметры.КачествоОгранки = СтрВ.КачествоОгранки;
					ТабличныйДокумент.Присоединить(ОбластьШапкаДоп);
					НомерКолонкиКон = НомерКолонкиКон + 2; 
		      	КонецЦикла;   
				ТабличныйДокумент.Область(НомерСтр, НомерКолонкиНач, НомерСтр, НомерКолонкиКон-1).Объединить();
				
				ОбластьСтрокаОсн = Макет.ПолучитьОбласть("СтрокаВставки|КолонкаОсновная");
				ОбластьСтрокаДоп = Макет.ПолучитьОбласть("СтрокаВставки|КолонкаДопВ"); 
				
				ТаблицаК = ТаблицаВставки.Скопировать();
				ТаблицаК.Свернуть("ВесоваяГруппа");
						  
				Для каждого СтрК из ТаблицаК Цикл 
					ОбластьСтрокаОсн.Параметры.ВесоваяГруппа = СтрК.ВесоваяГруппа;
					ТабличныйДокумент.Вывести(ОбластьСтрокаОсн);
					
					Для каждого СтрВ Из ТаблицаВ Цикл  
						ОтборК = Новый структура;  
					    ОтборК.Вставить("ВесоваяГруппа", СтрК.ВесоваяГруппа); 
						//Если ЗначениеЗаполнено(СтрВ.ВидОгранки) Тогда
						//    ОтборК.Вставить("ВидОгранки", СтрВ.ВидОгранки);  
						//Иначе  
						//	ОтборК.Вставить("ФормаОгранки", СтрВ.ФормаОгранки); 
						//КонецЕсли;	
						ОтборК.Вставить("ВидОгранки", СтрВ.ВидОгранки);  
						ОтборК.Вставить("ФормаОгранки", СтрВ.ФормаОгранки); 
						ОтборК.Вставить("КачествоОгранки", СтрВ.КачествоОгранки);
						Строки = ТаблицаВставки.НайтиСтроки(ОтборК);
				  		Если Строки.Количество() = 0 Тогда
						    Цена = 0; 
						Иначе
							Цена = Строки.Получить(0).Цена; 
						КонецЕсли; 	
						ОбластьСтрокаДоп.Параметры.Цена = Цена; 
						ТабличныйДокумент.Присоединить(ОбластьСтрокаДоп);  
					КонецЦикла;	
				Конеццикла;	 
				
				ОбластьПодвалВставки = Макет.ПолучитьОбласть("ПодвалВставки|КолонкаОсновная");
				
				//ТекстВставки = ""; 
				ЦенаОбособленныйУчет = 0;
				Отбор0 = Новый Структура;
				Отбор0.Вставить("ОбособленныйВыводПечать", Истина);    
				Строки0 = ТаблицаВставки.НайтиСтроки(Отбор0);
				Для каждого Стр0 Из Строки0 Цикл 
					Если НЕ стр0.Цена = 0 Тогда
						ЦенаОбособленныйУчет = стр0.Цена;
						Прервать;
					КонецЕсли;	
				Конеццикла;	
             	ТекстЦенаВ = Формат(ЦенаОбособленныйУчет, "ЧЦ=10; ЧДЦ=2; ЧРД=-; ЧН=00");
				ТекстВставки = "Природные бриллианты круглой формы огранки в виде вставок в ювелирные изделия 3 категории РФ, а также в изделиях 1,2,3 категории иностранного " + Символы.ПС + 
				   " производства (""импорт"") оцениваются, как ""граненые"", в размере " + ТекстЦенаВ +  " рублей за карат.";
				ОбластьПодвалВставки.Параметры.ИнформацияВставки = ТекстВставки;
				ТабличныйДокумент.Вывести(ОбластьПодвалВставки);
				//ШаблонВставки = ЛБ_ОбщийМодуль.ПолучитьТекущийШаблон(ВыборкаДанныеДокументов.СсылкаНаДокумент.Дата, Перечисления.ЛБ_ВидыПрейскурантов.Вставки);  
				//Если НЕ ШаблонВставки = неопределено Тогда
				//	ИнформацияВставки = ШаблонВставки.ДопИнформацияВставки.Получить(); 
				//	
				//	ТекстHTML = "";
				//	Вложения = Новый Структура;
				//	ИнформацияВставки.ПолучитьHTML(ТекстHTML, Вложения);
				//	
				//	ТекстВставки = СтроковыеФункцииКлиентСервер.ИзвлечьТекстИзHTML(ТекстHTML); 			
				//КонецЕсли;    	
				//Если ПустаяСтрока(ТекстВставки) Тогда 
				//	ТабличныйДокумент.Вывести(ОбластьПодвалВставки);
				//Иначе            
				//	Для Счетчик = 1 По СтрЧислоСтрок(ТекстВставки) Цикл
				//	   ТекСтрока = СтрПолучитьСтроку(ТекстВставки, Счетчик);
				//	   ОбластьПодвалВставки.Параметры.ИнформацияВставки = ТекСтрока;
				//       ТабличныйДокумент.Вывести(ОбластьПодвалВставки);	
				//	КонецЦикла;
				//КонецЕсли;	
			КонецЕсли;	
			
			//процентные ставки  
			ОбластьШапка = Макет.ПолучитьОбласть("ШапкаСтавки");
			ТабличныйДокумент.Вывести(ОбластьШапка);
			
			Если НЕ ТаблицаСтавок.Количество() = 0 Тогда
				НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
				
				ОбластьШапкаОсн = Макет.ПолучитьОбласть("ШапкаОценкиСтавки|КолонкаОсновная");
				ОбластьШапкаДоп = Макет.ПолучитьОбласть("ШапкаОценкиСтавки|КолонкаДоп");	
				ОбластьШапкаСтавка = Макет.ПолучитьОбласть("ШапкаОценкиСтавки|КолонкаСтавка"); 
				
				ТабличныйДокумент.Вывести(ОбластьШапкаОсн); 
				
				ОбластьШапкаДоп.Параметры.Показатель = "Срок";
				ТабличныйДокумент.Присоединить(ОбластьШапкаДоп);
				
				Если НЕ СтрРег.РегистраторСтавки.НеВыводитьНаПечатьПричиныПрименения Тогда 
					ОбластьШапкаДоп.Параметры.Показатель = "Причина применения";
					ТабличныйДокумент.Присоединить(ОбластьШапкаДоп);    
				КонецЕсли;	
				
				ОбластьШапкаДоп.Параметры.Показатель = "День начала применения";
				ТабличныйДокумент.Присоединить(ОбластьШапкаДоп);
				
				Для каждого СтрД из ТаблицаД Цикл
					ОбластьШапкаСтавка.Параметры.Диапазон = СтрД.ДиапазонСумм;
				    ТабличныйДокумент.Присоединить(ОбластьШапкаСтавка);
				Конеццикла;  
				
				НомерСтр = НомерСтр + 1;  
				НомерКолонкиНач = 3;
				НомерКолонкиКон = НомерКолонкиНач + ТаблицаД.Количество() + ?(СтрРег.РегистраторСтавки.НеВыводитьНаПечатьПричиныПрименения, 1, 2);
				ТабличныйДокумент.Область(НомерСтр, НомерКолонкиНач, НомерСтр, НомерКолонкиКон).Объединить();   
				
				ОбластьЗайм = Макет.ПолучитьОбласть("Займ|КолонкаОсновная");
				ОбластьСтрокаОсн = Макет.ПолучитьОбласть("СтрокаСтавка|КолонкаОсновная");
				ОбластьСтрокаДоп = Макет.ПолучитьОбласть("СтрокаСтавка|КолонкаДоп");	
				ОбластьСтрокаСтавка = Макет.ПолучитьОбласть("СтрокаСтавка|КолонкаСтавка"); 
				
				Ном = 0;
				Для каждого СтрК из ТаблицаСК Цикл
					Ном = Ном + 1;
					ОбластьЗайм.Параметры.Ном = Строка(Ном);
					ОбластьЗайм.Параметры.Займ = СокрЛП(СтрК.СхемаКредитования);
					ТабличныйДокумент.Вывести(ОбластьЗайм);   
					
					НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
					НомерКолонкиКон = ТаблицаД.Количество() + ?(СтрРег.РегистраторСтавки.НеВыводитьНаПечатьПричиныПрименения, 4, 5); 
					ТабличныйДокумент.Область(НомерСтр, 1, НомерСтр, НомерКолонкиКон).Объединить();
					ТабличныйДокумент.Область(НомерСтр, 1, НомерСтр, НомерКолонкиКон).ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
					
					Отбор = Новый Структура;
					Отбор.Вставить("СхемаКредитования", СтрК.СхемаКредитования);
					СтрокиП = ТаблицаПоказатели.НайтиСтроки(Отбор);
					Для каждого СтрП Из СтрокиП Цикл 
						ОбластьСтрокаОсн.Параметры.Категория = СтрП.Категория; 
						ТабличныйДокумент.Вывести(ОбластьСтрокаОсн);
						
						ОбластьСтрокаДоп.Параметры.ЗначениеП = СтрП.Срок; 
						ТабличныйДокумент.Присоединить(ОбластьСтрокаДоп);
						
						Если НЕ СтрРег.РегистраторСтавки.НеВыводитьНаПечатьПричиныПрименения Тогда 
							ОбластьСтрокаДоп.Параметры.ЗначениеП = СтрП.ПричинаПрименения; 
							ТабличныйДокумент.Присоединить(ОбластьСтрокаДоп);   
						КонецЕсли;	
						
						ОбластьСтрокаДоп.Параметры.ЗначениеП = СтрП.ДеньНачалаПрименения; 
						ТабличныйДокумент.Присоединить(ОбластьСтрокаДоп);
						
						Отбор.Вставить("Категория", СтрП.Категория);  
						Если СтрРег.РегистраторСтавки.НеВыводитьНаПечатьПричиныПрименения Тогда 
							Отбор.Вставить("ПричинаПрименения", Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма);
						Иначе	
						    Отбор.Вставить("ПричинаПрименения", СтрП.ПричинаПрименения);  
						КонецЕсли;	
						Отбор.Вставить("ДеньНачалаПрименения", СтрП.ДеньНачалаПрименения);
						
						Для каждого СтрД из ТаблицаД Цикл 
							Отбор.Вставить("ДиапазонСумм", СтрД.ДиапазонСумм); 
							Строки  = ТаблицаСтавок.НайтиСтроки(Отбор);
							Если Строки.Количество() = 0 Тогда
								Ставка = 0;
							Иначе     
								Ставка = Строки.Получить(0).Ставка;
							КонецЕсли;	
							ОбластьСтрокаСтавка.Параметры.Ставка = Ставка;
						    ТабличныйДокумент.Присоединить(ОбластьСтрокаСтавка);
						Конеццикла;  

					Конеццикла;	
				КонецЦикла;	
			КонецЕсли;	
		Конеццикла;	
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции     

Функция ПечатьАкции(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_Акция"; 
		
	ВыборкаДанныеДокументов = ПолучитьВыборкуДанныхДокумента(МассивОбъектов);
	
	НаименованияОрганизации = НаименованиеОрганизации();
	НаименованиеОрганизацииСокращенное = НаименованияОрганизации.НаименованиеСокращенное;
	НаименованиеОрганизацииПолное      = НаименованияОрганизации.НаименованиеПолное;
			
	Если ВыборкаДанныеДокументов.Следующий() Тогда  
		
		ТаблицаСтавок = ПолучитьВыборкуПрейскурантаСтавокАкция(ВыборкаДанныеДокументов.СсылкаНаДокумент);
		ТаблицаСК = ТаблицаСтавок.Скопировать();
		ТаблицаСК.Свернуть("СхемаКредитования");
		ТаблицаСК.Сортировать("СхемаКредитования");
		ТаблицаПоказатели = ТаблицаСтавок.Скопировать();
		ТаблицаПоказатели.Свернуть("СхемаКредитования, Категория, ПричинаПрименения");
		ТаблицаПоказатели.Сортировать("Категория, ПричинаПрименения");
		ТаблицаД = ТаблицаСтавок.Скопировать();
		ТаблицаД.Свернуть("ДиапазонСумм"); 
		
		СписокЛомбардов = Новый СписокЗначений;  
		Для каждого Стр Из ВыборкаДанныеДокументов.СсылкаНаДокумент.Ломбарды Цикл 
			СписокЛомбардов.Добавить(Стр.Ломбард);
		Конеццикла;	           
		Если ВыборкаДанныеДокументов.СсылкаНаДокумент.ВыводитьЛомбарды = 0 Тогда 
			ЛомбардыОтделения = "ломбардах";
		    СтрокаЛомбарды = ПолучитьСтрокуЛомбардов(ВыборкаДанныеДокументов.СсылкаНаДокумент.Дата, СписокЛомбардов); 
		Иначе    
			ЛомбардыОтделения = "отделениях ломбардов";
			СтрокаЛомбарды = ПолучитьСтрокуОтделенийЛомбардов(ВыборкаДанныеДокументов.СсылкаНаДокумент.Дата, СписокЛомбардов);
		КонецЕсли;	
		
		Макет = ПолучитьМакет("ПФ_MXL_Акция");
		ПриказНомер = ВыборкаДанныеДокументов.НомерПриказа;
		ПриказДата  = СтрШаблон("%1 г.", Формат(ВыборкаДанныеДокументов.ДатаНачалаДействияПриказа, "ДЛФ=Д"));
		Ломбарды    = ВыборкаДанныеДокументов.СтрокаЛомбарды; 
		Акция = ВыборкаДанныеДокументов.Акция;
		ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
		ОбластьТекст  = Макет.ПолучитьОбласть("ТекстПриказаЧасть1"); 
		ОбластьТекст2  = Макет.ПолучитьОбласть("ТекстПриказаЧасть2"); 
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		
		ОбластьШапка.Параметры.СокращенноеНаименованиеОрганизации = НаименованиеОрганизацииСокращенное;
		ОбластьШапка.Параметры.ПолноеНаименованиеОрганизации      = НаименованиеОрганизацииПолное; 
		ОбластьШапка.Параметры.НомерПриказа = ПриказНомер; 
		ОбластьШапка.Параметры.ДатаПриказа = ПриказДата;  
		ОбластьШапка.Параметры.Акция = Акция;
				
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		ОбластьТекст.Параметры.Акция = Акция;
		ОбластьТекст.Параметры.ЛомбардыОтделения = ЛомбардыОтделения;
	    ОбластьТекст.Параметры.СписокЛомбардовСАдресами                    = СтрокаЛомбарды;
		ОбластьТекст.Параметры.ДатаПриказа   = ПриказДата; 
		ОбластьТекст.Параметры.НачальникОРБ = ВыборкаДанныеДокументов.СсылкаНаДокумент.НачальникОРБ; 
					
		ТабличныйДокумент.Вывести(ОбластьТекст);
		
		//процентные ставки  
		Если НЕ ТаблицаСтавок.Количество() = 0 Тогда
			НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
			
			ОбластьШапкаОсн = Макет.ПолучитьОбласть("ШапкаОценкиСтавки|КолонкаОсновная");
			ОбластьШапкаДоп = Макет.ПолучитьОбласть("ШапкаОценкиСтавки|КолонкаДоп");	
			ОбластьШапкаСтавка = Макет.ПолучитьОбласть("ШапкаОценкиСтавки|КолонкаСтавка"); 
			
			ТабличныйДокумент.Вывести(ОбластьШапкаОсн);
			ОбластьШапкаДоп.Параметры.Показатель = "Причина применения";
			ТабличныйДокумент.Присоединить(ОбластьШапкаДоп);
							
			Для каждого СтрД из ТаблицаД Цикл
				ОбластьШапкаСтавка.Параметры.Диапазон = СтрД.ДиапазонСумм;
			    ТабличныйДокумент.Присоединить(ОбластьШапкаСтавка);
			Конеццикла;  
			
			НомерСтр = НомерСтр + 1;  
			НомерКолонкиНач = 4;
			НомерКолонкиКон = НомерКолонкиНач + ТаблицаД.Количество();
			ТабличныйДокумент.Область(НомерСтр, НомерКолонкиНач, НомерСтр, НомерКолонкиКон).Объединить(); 
						
			ОбластьЗайм = Макет.ПолучитьОбласть("Займ|КолонкаОсновная");
			ОбластьСтрокаОсн = Макет.ПолучитьОбласть("СтрокаСтавка|КолонкаОсновная");
			ОбластьСтрокаДоп = Макет.ПолучитьОбласть("СтрокаСтавка|КолонкаДоп");	
			ОбластьСтрокаСтавка = Макет.ПолучитьОбласть("СтрокаСтавка|КолонкаСтавка"); 
			
			Ном = 0;
			Для каждого СтрК из ТаблицаСК Цикл
				Ном = Ном + 1;
				ОбластьЗайм.Параметры.Ном = Строка(Ном);
				ОбластьЗайм.Параметры.Займ = СокрЛП(СтрК.СхемаКредитования);
				ТабличныйДокумент.Вывести(ОбластьЗайм);   
				
				НомерСтр = ТабличныйДокумент.ВысотаТаблицы;
				НомерКолонкиКон = ТаблицаД.Количество() + 4; 
				ТабличныйДокумент.Область(НомерСтр, 2, НомерСтр, НомерКолонкиКон).Объединить();  
				
				Отбор = Новый Структура;
				Отбор.Вставить("СхемаКредитования", СтрК.СхемаКредитования);
				СтрокиП = ТаблицаПоказатели.НайтиСтроки(Отбор);
				Для каждого СтрП Из СтрокиП Цикл 
					ОбластьСтрокаОсн.Параметры.Категория = СтрП.Категория; 
					ТабличныйДокумент.Вывести(ОбластьСтрокаОсн);  
					
					ОбластьСтрокаДоп.Параметры.ЗначениеП = СтрП.ПричинаПрименения; 
					ТабличныйДокумент.Присоединить(ОбластьСтрокаДоп);
											
					Отбор.Вставить("Категория", СтрП.Категория);
					Отбор.Вставить("ПричинаПрименения", СтрП.ПричинаПрименения);
					Для каждого СтрД из ТаблицаД Цикл 
						Отбор.Вставить("ДиапазонСумм", СтрД.ДиапазонСумм); 
						Строки  = ТаблицаСтавок.НайтиСтроки(Отбор);
						Если Строки.Количество() = 0 Тогда
							Ставка = 0;
						Иначе     
							Ставка = Строки.Получить(0).Ставка;
						КонецЕсли;	
						ОбластьСтрокаСтавка.Параметры.Ставка = Ставка;
					    ТабличныйДокумент.Присоединить(ОбластьСтрокаСтавка);
					Конеццикла;  

				Конеццикла;	
			КонецЦикла;	
		КонецЕсли;	 
				
		ОбластьТекст2.Параметры.ДатаПриказа = ПриказДата;
		ОбластьТекст2.Параметры.ДатаНачалаДействияПриказа = СтрШаблон("%1 г.", Формат(ВыборкаДанныеДокументов.ДатаНачалаДействияПриказа, "ДФ=dd.MM.yyyy"));
		ОбластьТекст2.Параметры.ДатаОкончанияДействияПриказа = СтрШаблон("%1 г.", Формат(ВыборкаДанныеДокументов.ДатаОкончанияДействияПриказа, "ДФ=dd.MM.yyyy"));  
		ОбластьТекст2.Параметры.ОтветственноеЛицоОРБ = ВыборкаДанныеДокументов.СсылкаНаДокумент.ОтветственноеЛицоОРБ;
		ОбластьТекст2.Параметры.ОтветственноеЛицоРеклама = ВыборкаДанныеДокументов.СсылкаНаДокумент.ОтветственноеЛицоРеклама; 
		ТабличныйДокумент.Вывести(ОбластьТекст2); 
		
		ОбластьПодвал.Параметры.ПодписантДолжность = ВыборкаДанныеДокументов.СсылкаНаДокумент.ПодписантДолжность;
		ОбластьПодвал.Параметры.ПодписантФИО = ВыборкаДанныеДокументов.СсылкаНаДокумент.ПодписантФИО;
		ТабличныйДокумент.Вывести(ОбластьПодвал);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции     

Функция ПолучитьБазовыеЦеныМеталлы(Дата)
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Проба");
	СтруктураВозврата.Вставить("Категория");

    Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_БазовыеЦеныНаДрагоценныеМеталлыСрезПоследних.Проба КАК Проба,
	               |	ЛБ_БазовыеЦеныНаДрагоценныеМеталлыСрезПоследних.КатегорияОбъектаЗалога КАК Категория
	               |ИЗ
	               |	РегистрСведений.ЛБ_БазовыеЦеныНаДрагоценныеМеталлы.СрезПоследних(&Дата, ) КАК ЛБ_БазовыеЦеныНаДрагоценныеМеталлыСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать(); 
	Если Выборка.Следующий() Тогда 
		СтруктураВозврата.Вставить("Проба", Выборка.Проба);
	    СтруктураВозврата.Вставить("Категория", Выборка.Категория);
	КонецЕсли;
	
	Возврат СтруктураВозврата;
КонецФункции

Функция ПолучитьТаблицуРегистраторов(Регистратор)
	ТаблицаРегистраторов = Новый ТаблицаЗначений;
	ТаблицаРегистраторов.Колонки.Добавить("Ломбард"); 
	ТаблицаРегистраторов.Колонки.Добавить("Группа");
	ТаблицаРегистраторов.Колонки.Добавить("РегистраторМеталлы");
	ТаблицаРегистраторов.Колонки.Добавить("РегистраторВставки"); 
	ТаблицаРегистраторов.Колонки.Добавить("РегистраторСтавки");
		
	Ломбарды = Регистратор.Ломбарды.ВыгрузитьКолонку("Ломбард"); 
	Если Ломбарды.Количество() = 0 Тогда 
		ЗапросЛ = Новый Запрос;
		ЗапросЛ.Текст = "ВЫБРАТЬ
		                |	ЛБ_Ломбарды.Ссылка КАК Ссылка
		                |ИЗ
		                |	Справочник.ЛБ_Ломбарды КАК ЛБ_Ломбарды
		                |ГДЕ
		                |	ЛБ_Ломбарды.ЭтоГруппа = ЛОЖЬ
		                |	И ЛБ_Ломбарды.Закрыт = ЛОЖЬ";
		ВыборкаЛ = ЗапросЛ.Выполнить().Выбрать();
		Пока ВыборкаЛ.Следующий() Цикл 
			Ломбарды.Добавить(ВыборкаЛ.Ссылка);
		КонецЦикла;	
	КонецЕсли;	
		
	ЗапросЛ = Новый Запрос; 
	ЗапросЛ.УстановитьПараметр("Дата", Регистратор.Дата);
	ЗапросЛ.УстановитьПараметр("Ломбарды", Ломбарды);
	ЗапросЛ.Текст = "ВЫБРАТЬ
	               |	ЛБ_ГруппыЛомбардовСрезПоследних.Ломбард КАК Ломбард,
	               |	ЛБ_ГруппыЛомбардовСрезПоследних.Группа КАК Группа
	               |ИЗ
	               |	РегистрСведений.ЛБ_ГруппыЛомбардов.СрезПоследних(&Дата, Ломбард В (&Ломбарды)) КАК ЛБ_ГруппыЛомбардовСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ГруппыЛомбардовСрезПоследних.Период УБЫВ";
	ТаблицаЛомбардов = ЗапросЛ.Выполнить().Выгрузить();   
		
	Для каждого СтрЛ Из ТаблицаЛомбардов Цикл
	    НоваяСтр = ТаблицаРегистраторов.Добавить();
		НоваяСтр.Ломбард = СтрЛ.Ломбард; 
		НоваяСтр.Группа = СтрЛ.Группа;
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Регистратор.Дата);
	Запрос.УстановитьПараметр("ДатаНачалаДействия", Регистратор.ДатаНачалаДействияПриказа);
	Запрос.УстановитьПараметр("Ломбарды", Ломбарды);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних.Ломбард КАК Ломбард,
	               |	ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПрейскурантЦенНаМеталлы.СрезПоследних(
	               |			&Дата,
	               |			Ломбард В (&Ломбарды)
	               |				И ДатаНачалаДействия <= &ДатаНачалаДействия) КАК ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних.Период УБЫВ"; 
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	Для каждого ЭлементМассива Из Ломбарды Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Ломбард", ЭлементМассива);
		
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор); 
		Если НЕ строки.Количество() = 0 Тогда
		    Стр = Строки.Получить(0);
		    РегистраторМеталлы = Стр.Регистратор;
			
			СтрокиР = ТаблицаРегистраторов.НайтиСтроки(Отбор); 
			Если СтрокиР.Количество() = 0 Тогда
				СтрР = ТаблицаРегистраторов.Добавить();
				СтрР.Ломбард = ЭлементМассива; 
				СтрР.Группа = Справочники.ЛБ_ГруппыЛомбардов.ПустаяСсылка();
			Иначе	
			    СтрР = СтрокиР.Получить(0);
			КонецЕсли;	
		    СтрР.РегистраторМеталлы = РегистраторМеталлы;
		КонецЕсли;	
	Конеццикла;	     
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.Ломбард КАК Ломбард,
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПрейскурантЦенНаДрагоценныеКамни.СрезПоследних(
	               |			&Дата,
	               |			Ломбард В (&Ломбарды)
	               |				И ДатаНачалаДействия <= &ДатаНачалаДействия) КАК ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.Период УБЫВ"; 
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	Для каждого ЭлементМассива Из Ломбарды Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Ломбард", ЭлементМассива);
		
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор); 
		Если НЕ строки.Количество() = 0 Тогда
		    Стр = Строки.Получить(0);
		    РегистраторВставки = Стр.Регистратор;
			
			СтрокиР = ТаблицаРегистраторов.НайтиСтроки(Отбор);  
			Если СтрокиР.Количество() = 0 Тогда
				СтрР = ТаблицаРегистраторов.Добавить();
				СтрР.Ломбард = ЭлементМассива; 
				СтрР.Группа = Справочники.ЛБ_ГруппыЛомбардов.ПустаяСсылка();
			Иначе	
			    СтрР = СтрокиР.Получить(0); 
			КонецЕсли;	
		    СтрР.РегистраторВставки = РегистраторВставки;
		КонецЕсли;	
	Конеццикла;	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.Ломбард КАК Ломбард,
	               |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПрейскурантПроцентныхСтавок.СрезПоследних(
	               |			&Дата,
	               |			Ломбард В (&Ломбарды)
	               |				И ДатаНачалаДействия <= &ДатаНачалаДействия) КАК ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.Период УБЫВ"; 
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	Для каждого ЭлементМассива Из Ломбарды Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Ломбард", ЭлементМассива);
		
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор); 
		Если НЕ строки.Количество() = 0 Тогда
		    Стр = Строки.Получить(0);
		    РегистраторСтавки = Стр.Регистратор;
			
			СтрокиР = ТаблицаРегистраторов.НайтиСтроки(Отбор); 
			Если СтрокиР.Количество() = 0 Тогда
				СтрР = ТаблицаРегистраторов.Добавить();
				СтрР.Ломбард = ЭлементМассива; 
				СтрР.Группа = Справочники.ЛБ_ГруппыЛомбардов.ПустаяСсылка();
			Иначе	
			    СтрР = СтрокиР.Получить(0);  
			КонецЕсли;	
		    СтрР.РегистраторСтавки = РегистраторСтавки;
		КонецЕсли;	
	Конеццикла;	

	Возврат ТаблицаРегистраторов;
КонецФункции

// ++ Сербаев 27.07.2023
Функция ПолучитьВыборкуДанныхДокумента(МассивОбъектов)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ПриказУсловияПредоставленияЗаймов.СтрокаЛомбарды КАК СтрокаЛомбарды,
		|	ЛБ_ПриказУсловияПредоставленияЗаймов.НомерПриказа КАК НомерПриказа,
		|	ЛБ_ПриказУсловияПредоставленияЗаймов.ДатаНачалаДействияПриказа КАК ДатаНачалаДействияПриказа,
		|	ЛБ_ПриказУсловияПредоставленияЗаймов.ДатаОкончанияДействияПриказа КАК ДатаОкончанияДействияПриказа,
		|	ЛБ_ПриказУсловияПредоставленияЗаймов.Ответственный.Представление КАК Ответственный,
		|	ЛБ_ПриказУсловияПредоставленияЗаймов.Ссылка КАК СсылкаНаДокумент,
		|	ЛБ_ПриказУсловияПредоставленияЗаймов.Акция КАК Акция
		|ИЗ
		|	Документ.ЛБ_ПриказУсловияПредоставленияЗаймов КАК ЛБ_ПриказУсловияПредоставленияЗаймов
		|ГДЕ
		|	ЛБ_ПриказУсловияПредоставленияЗаймов.Ссылка В(&МассивОбъектов)";
	
	Возврат Запрос.Выполнить().Выбрать();	

КонецФункции

Функция ПолучитьВыборкуПрейскурантаЦен(Регистраторы)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ПрейскурантЦенНаМеталлы.Регистратор КАК Регистратор,
		|	ЛБ_ПрейскурантЦенНаМеталлы.Проба.Владелец КАК Металл,
		|	ЛБ_ПрейскурантЦенНаМеталлы.Проба КАК Проба,
		|	ЛБ_ПрейскурантЦенНаМеталлы.Категория КАК Категория,
		|	ЕСТЬNULL(ЛБ_ПрейскурантЦенНаМеталлы.Цена, 0) КАК Цена
		|ИЗ
		|	РегистрСведений.ЛБ_ПрейскурантЦенНаМеталлы КАК ЛБ_ПрейскурантЦенНаМеталлы
		|ГДЕ
		|	ЛБ_ПрейскурантЦенНаМеталлы.Регистратор В(&Регистраторы)";
	
	Запрос.УстановитьПараметр("Регистраторы", Регистраторы);
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();  
	ТаблицаЗапроса.Колонки.Добавить("ГруппаМеталл"); 
	
	Для каждого стр Из ТаблицаЗапроса Цикл  
		ГруппаМ = ЛБ_ОбщийМодуль.ПолучитьГруппуПроб(стр.Проба);
		Стр.ГруппаМеталл = ?(ГруппаМ = неопределено, стр.Металл, ГруппаМ);
	Конеццикла;
	Возврат ТаблицаЗапроса;
	
КонецФункции

Функция ПолучитьВыборкуПрейскурантаЦенВставки(Регистраторы) 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛБ_ПрейскурантЦенНаДрагоценныеКамни.Регистратор КАК Регистратор,
		|	ЛБ_ПрейскурантЦенНаДрагоценныеКамни.ВидВставки КАК ВидВставки,
		|	ЛБ_ПрейскурантЦенНаДрагоценныеКамни.ФормаОгранки КАК ФормаОгранки,
		|	ЛБ_ПрейскурантЦенНаДрагоценныеКамни.ВидОгранки КАК ВидОгранки,
		|	ЛБ_ПрейскурантЦенНаДрагоценныеКамни.КачествоОгранки КАК КачествоОгранки,
		|	ЛБ_ПрейскурантЦенНаДрагоценныеКамни.ВесоваяГруппа КАК ВесоваяГруппа,
		|	ЕСТЬNULL(ЛБ_ПрейскурантЦенНаДрагоценныеКамни.Цена, 0) КАК Цена,
		|	ВЫБОР
		|		КОГДА ЛБ_ПрейскурантЦенНаДрагоценныеКамни.ФормаОгранки = &ПустаяФормаОгранки
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ЛБ_ПрейскурантЦенНаДрагоценныеКамни.ФормаОгранки.ОбособленныйВыводПечать
		|	КОНЕЦ КАК ОбособленныйВыводПечать
		|ИЗ
		|	РегистрСведений.ЛБ_ПрейскурантЦенНаДрагоценныеКамни КАК ЛБ_ПрейскурантЦенНаДрагоценныеКамни
		|ГДЕ
		|	ЛБ_ПрейскурантЦенНаДрагоценныеКамни.Регистратор В(&Регистраторы)
		|	И ЛБ_ПрейскурантЦенНаДрагоценныеКамни.ВидВставки = &ВидВставки";
	
	Запрос.УстановитьПараметр("Регистраторы", Регистраторы); 
	Запрос.УстановитьПараметр("ВидВставки", Справочники.ЛБ_ДрагоценныеКамни.Бриллиант);  
	Запрос.УстановитьПараметр("ПустаяФормаОгранки", Справочники.ЛБ_ФормыОгранки.ПустаяСсылка());
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	
	//ТаблицаЗапроса.Сортировать("ВидОгранки Убыв");
	//Для каждого стр Из ТаблицаЗапроса Цикл  
	//	Если НЕ ЗначениеЗаполнено(Стр.ВидОгранки) тогда
	//		Стр.ВидОгранки = Стр.ФормаОгранки;
	//	КонецЕсли;	
	//Конеццикла;
	ТаблицаЗапроса.Сортировать("ВидОгранки Убыв, ВесоваяГруппа");
	
	Возврат ТаблицаЗапроса;
КонецФункции   

Функция ПолучитьВыборкуПрейскурантаСтавок(Регистраторы, Дата)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ПрейскурантПроцентныхСтавок.Регистратор КАК Регистратор,
		|	ЛБ_ПрейскурантПроцентныхСтавок.СхемаКредитования КАК СхемаКредитования,
		|	ЛБ_ПрейскурантПроцентныхСтавок.СтатусЗалогодателя КАК Категория,
		|	ЛБ_ПрейскурантПроцентныхСтавок.ДиапазонСуммЗайма КАК ДиапазонСумм,
		|	ЛБ_ПрейскурантПроцентныхСтавок.ПричинаПрименения КАК ПричинаПрименения,
		|	ЛБ_ПрейскурантПроцентныхСтавок.ДеньНачалаПрименения КАК ДеньНачалаПрименения,
		|	ЛБ_УсловияПредоставленияКредитаСрезПоследних.СрокЗалога КАК Срок,
		|	ЛБ_ПрейскурантПроцентныхСтавок.ПроцентнаяСтавка КАК Ставка
		|ИЗ
		|	РегистрСведений.ЛБ_ПрейскурантПроцентныхСтавок КАК ЛБ_ПрейскурантПроцентныхСтавок
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_УсловияПредоставленияКредита.СрезПоследних(&Дата, ) КАК ЛБ_УсловияПредоставленияКредитаСрезПоследних
		|		ПО ЛБ_ПрейскурантПроцентныхСтавок.СхемаКредитования = ЛБ_УсловияПредоставленияКредитаСрезПоследних.СхемаКредитования
		|ГДЕ
		|	ЛБ_ПрейскурантПроцентныхСтавок.Регистратор В(&Регистраторы)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СхемаКредитования,
		|	Категория,
		|	ПричинаПрименения,
		|	ДеньНачалаПрименения,
		|	ЛБ_ПрейскурантПроцентныхСтавок.ДиапазонСуммЗайма.ПорядокСортировки";
	
	Запрос.УстановитьПараметр("Регистраторы", Регистраторы);
	Запрос.УстановитьПараметр("Дата", Дата);  
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();      
	
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ЛБ_ТехническиеСтавкиСрезПоследних.СхемаКредитования КАК СхемаКредитования,
	//               |	ЛБ_ТехническиеСтавкиСрезПоследних.ДеньНачалаПрименения КАК ДеньНачалаПрименения,
	//               |	ЛБ_ТехническиеСтавкиСрезПоследних.ПроцентнаяСтавка КАК Ставка
	//               |ИЗ
	//               |	РегистрСведений.ЛБ_ТехническиеСтавки.СрезПоследних(&Дата, ) КАК ЛБ_ТехническиеСтавкиСрезПоследних";
	//ТехническиеСтавки = Запрос.Выполнить().Выгрузить();
	//
	//ТаблицаСК = ТаблицаЗапроса.Скопировать();
	//ТаблицаСК.Свернуть("СхемаКредитования");
	//Для каждого СтрК Из ТаблицаСК Цикл  
	//	Отбор = Новый Структура;
	//	Отбор.Вставить("СхемаКредитования", СтрК.СхемаКредитования);
	//	
	//	СтрокиТех = ТехническиеСтавки.НайтиСтроки(Отбор);
	//	Если НЕ СтрокиТех.Количество() = 0 Тогда 
	//		ДеньНачалаПримененияТех = СтрокиТех.Получить(0).ДеньНачалаПрименения; 
	//		СтавкаТех = СтрокиТех.Получить(0).Ставка; 
	//		 
	//		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор); 
	//		Для каждого Стр Из Строки Цикл
	//			НоваяСтр = ТаблицаЗапроса.Добавить(); 
	//			НоваяСтр.СхемаКредитования = Стр.СхемаКредитования;
	//			НоваяСтр.Категория = Стр.Категория;
	//			НоваяСтр.ДиапазонСумм = Стр.ДиапазонСумм;
	//			НоваяСтр.ПричинаПрименения = Стр.ПричинаПрименения;
	//			НоваяСтр.Срок = Стр.Срок; 
	//			НоваяСтр.ДеньНачалаПрименения = ДеньНачалаПримененияТех; 
	//			НоваяСтр.Ставка = СтавкаТех;
	//		Конеццикла;	 
	//	КонецЕсли;	
	//Конеццикла;	

	Возврат ТаблицаЗапроса;	
КонецФункции	

Функция ПолучитьВыборкуПрейскурантаСтавокАкция(Регистратор)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_АкцииПроцентныеСтавки.СхемаКредитования КАК СхемаКредитования,
		|	ЛБ_АкцииПроцентныеСтавки.СтатусЗалогодателя КАК Категория,
		|	ЛБ_АкцииПроцентныеСтавки.ДиапазонСуммЗайма КАК ДиапазонСумм,
		|	ЛБ_АкцииПроцентныеСтавки.ПричинаПрименения КАК ПричинаПрименения,
		|	ЛБ_АкцииПроцентныеСтавки.ПроцентнаяСтавка КАК Ставка
		|ИЗ
		|	РегистрСведений.ЛБ_АкцииПроцентныеСтавки КАК ЛБ_АкцииПроцентныеСтавки
		|ГДЕ
		|	ЛБ_АкцииПроцентныеСтавки.Регистратор = &Регистратор
		|
		|УПОРЯДОЧИТЬ ПО
		|	СхемаКредитования,
		|	Категория,
		|	ПричинаПрименения,
		|	ЛБ_АкцииПроцентныеСтавки.ДиапазонСуммЗайма.ПорядокСортировки";
	
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	Запрос.УстановитьПараметр("Дата", Регистратор.Дата);  
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();      
	
	Возврат ТаблицаЗапроса;	
КонецФункции	

Функция ФИОДиректора()
	
	Результат = "";
	
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Организации.Директор.Представление КАК Директор
		|ИЗ
		|	Константа.ЛБ_ОсновнаяОрганизация КАК ЛБ_ОсновнаяОрганизация
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО ЛБ_ОсновнаяОрганизация.Значение = Организации.Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.Директор;	
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НаименованиеОрганизации()
	
	Результат = Новый Структура("НаименованиеПолное, НаименованиеСокращенное", "", "");
	
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОсновнаяОрганизация.Значение.НаименованиеПолное КАК НаименованиеПолное,
		|	ЛБ_ОсновнаяОрганизация.Значение.НаименованиеСокращенное КАК НаименованиеСокращенное
		|ИЗ
		|	Константа.ЛБ_ОсновнаяОрганизация КАК ЛБ_ОсновнаяОрганизация
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО ЛБ_ОсновнаяОрганизация.Значение = Организации.Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат.НаименованиеПолное      = Выборка.НаименованиеПолное;
		Результат.НаименованиеСокращенное = Выборка.НаименованиеСокращенное;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
 // -- Сербаев 27.07.2023 
 
Функция ПолучитьСтрокуЛомбардов(Дата, СписокЛ) 
    Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ломбарды", СписокЛ);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ГруппыЛомбардовСрезПоследних.Ломбард КАК Ломбард,
	               |	ЛБ_ГруппыЛомбардовСрезПоследних.Группа КАК Группа
	               |ИЗ
	               |	РегистрСведений.ЛБ_ГруппыЛомбардов.СрезПоследних(&Дата, Ломбард В (&Ломбарды)) КАК ЛБ_ГруппыЛомбардовСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ГруппыЛомбардовСрезПоследних.Период УБЫВ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();   
	
	ТаблицаЛомбардов = Новый ТаблицаЗначений;
	ТаблицаЛомбардов.Колонки.Добавить("Группа");
	ТаблицаЛомбардов.Колонки.Добавить("Ломбард");
	
	Для каждого Эл из СписокЛ Цикл 
		Отбор = новый структура;
		Отбор.Вставить("Ломбард", Эл.Значение);
		
		СтрокиЗапроса = ТаблицаЗапроса.НайтиСтроки(Отбор); 
		Если СтрокиЗапроса.Количество() = 0 Тогда 
			СтрЛ = ТаблицаЛомбардов.Добавить(); 
			СтрЛ.Группа = "<...> (";
			СтрЛ.Ломбард = Эл.Значение;
		Иначе   
			СтрЗапроса = СтрокиЗапроса.Получить(0); 
			СтрЛ = ТаблицаЛомбардов.Добавить(); 
			СтрЛ.Группа = сокрЛП(СтрЗапроса.Группа) + " (";
			СтрЛ.Ломбард = СтрЗапроса.Ломбард;
		КонецЕсли;	
	Конеццикла;	                             
	ТаблицаЛомбардов.Сортировать("Группа, Ломбард");
	ТаблицаГрупп = ТаблицаЛомбардов.Скопировать(); 
	ТаблицаГрупп.Свернуть("Группа");
	
	СтрокаВозврата = ""; 
	Для каждого СтрГ из ТаблицаГрупп Цикл
		СтрокаВозврата = СтрокаВозврата + ?(ПустаяСтрока(СтрокаВозврата), "", "; ") + СтрГ.Группа;
		ОтборГ = новый структура;
		ОтборГ.Вставить("Группа", стрГ.Группа);   
		
		Строки = ТаблицаЛомбардов.НайтиСтроки(ОтборГ);
		Ном = 0;
		Для каждого Стр Из Строки Цикл
			СтрокаВозврата = СтрокаВозврата + ?(Ном = 0, "", ", ") + ?(ЗначениеЗаполнено(Стр.Ломбард.НомерЛомбарда), "№ "+ СокрЛП(Стр.Ломбард.НомерЛомбарда), СокрЛП(Стр.Ломбард)); 
			Ном = Ном + 1;
		Конеццикла;	    
		СтрокаВозврата = СтрокаВозврата + ")";
	Конеццикла;	
	
	Возврат СтрокаВозврата;
КонецФункции

Функция ПолучитьСтрокуОтделенийЛомбардов(Дата, СписокЛ) 
    Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ломбарды", СписокЛ);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард,
	               |	ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
	               |ИЗ
	               |	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, Ломбард В (&Ломбарды)) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ОтделенияЛомбардовСрезПоследних.Период УБЫВ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();   
	
	ТаблицаЛомбардов = Новый ТаблицаЗначений;
	ТаблицаЛомбардов.Колонки.Добавить("Отделение");
	ТаблицаЛомбардов.Колонки.Добавить("Ломбард");
	
	Для каждого Эл из СписокЛ Цикл 
		Отбор = новый структура;
		Отбор.Вставить("Ломбард", Эл.Значение);
		
		СтрокиЗапроса = ТаблицаЗапроса.НайтиСтроки(Отбор); 
		Если СтрокиЗапроса.Количество() = 0 Тогда 
			СтрЛ = ТаблицаЛомбардов.Добавить(); 
			СтрЛ.Отделение = "<...>";
			СтрЛ.Ломбард = Эл.Значение;
		Иначе   
			СтрЗапроса = СтрокиЗапроса.Получить(0); 
			СтрЛ = ТаблицаЛомбардов.Добавить(); 
			СтрЛ.Отделение = сокрЛП(СтрЗапроса.Отделение);
			СтрЛ.Ломбард = СтрЗапроса.Ломбард;
		КонецЕсли;	
	Конеццикла;	                             
	ТаблицаЛомбардов.Сортировать("Отделение, Ломбард");
	ТаблицаОтд = ТаблицаЛомбардов.Скопировать(); 
	ТаблицаОтд.Свернуть("Отделение");
	
	СтрокаВозврата = ""; 
	Для каждого СтрГ из ТаблицаОтд Цикл
		СтрокаВозврата = СтрокаВозврата + ?(ПустаяСтрока(СтрокаВозврата), "", "; ") + СтрГ.Отделение;
	Конеццикла;	
	
	Возврат СтрокаВозврата;
КонецФункции	 

#КонецЕсли 

  














