#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ПодготовитьТаблицыДокументаМеталлы(ТаблицаЦен, ТаблицаНастроек) Экспорт
    Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовЦеныМеталлы.Проба КАК Проба,
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовЦеныМеталлы.КатегорияОбъектаЗалога КАК Категория,
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовЦеныМеталлы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовЦеныМеталлы.Цена КАК Цена
	               |ИЗ
	               |	Документ.ЛБ_ПриказУсловияПредоставленияЗаймов.ЦеныМеталлы КАК ЛБ_ПриказУсловияПредоставленияЗаймовЦеныМеталлы
	               |ГДЕ
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовЦеныМеталлы.Ссылка = &Ссылка";
		
	РезультатЗапросаПоЦенам = Запрос.Выполнить();

	// Подготовим таблицу товаров для проведения.
	ТаблицаЦен = ПодготовитьТаблицуЦенМеталлы(РезультатЗапросаПоЦенам);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовНастройкаОтклоненийОтБазовыхЦенМеталлы.КатегорияОбъектаЗалога КАК КатегорияОбъектаЗалога,
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовНастройкаОтклоненийОтБазовыхЦенМеталлы.СхемаКредитования КАК СхемаКредитования,
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовНастройкаОтклоненийОтБазовыхЦенМеталлы.Металл КАК Металл,
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовНастройкаОтклоненийОтБазовыхЦенМеталлы.Проба КАК Проба,
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовНастройкаОтклоненийОтБазовыхЦенМеталлы.ОтклонениеОтБазовойЦены КАК ОтклонениеОтБазовойЦены,
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовНастройкаОтклоненийОтБазовыхЦенМеталлы.ЗначениеОтклонения КАК ЗначениеОтклонения
	               |ИЗ
	               |	Документ.ЛБ_ПриказУсловияПредоставленияЗаймов.НастройкаОтклоненийОтБазовыхЦенМеталлы КАК ЛБ_ПриказУсловияПредоставленияЗаймовНастройкаОтклоненийОтБазовыхЦенМеталлы
	               |ГДЕ
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовНастройкаОтклоненийОтБазовыхЦенМеталлы.Ссылка = &Ссылка";
		
	РезультатЗапросаПоНастройкам = Запрос.Выполнить();

	// Подготовим таблицу товаров для проведения.
	ТаблицаНастроек = ПодготовитьТаблицуНастроекМеталлы(РезультатЗапросаПоНастройкам);

КонецПроцедуры // ПодготовитьТаблицыДокумента()

Процедура ПодготовитьТаблицыДокументаВставки(ТаблицаЦенВставки, ТаблицаНастроекВставки) Экспорт
    Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовЦеныВставки.ВидВставки КАК ВидВставки,
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовЦеныВставки.ФормаОгранки КАК ФормаОгранки,
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовЦеныВставки.ВидОгранки КАК ВидОгранки,
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовЦеныВставки.КачествоОгранки КАК КачествоОгранки,
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовЦеныВставки.ВесоваяГруппа КАК ВесоваяГруппа,
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовЦеныВставки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовЦеныВставки.Цена КАК Цена
	               |ИЗ
	               |	Документ.ЛБ_ПриказУсловияПредоставленияЗаймов.ЦеныВставки КАК ЛБ_ПриказУсловияПредоставленияЗаймовЦеныВставки
	               |ГДЕ
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовЦеныВставки.Ссылка = &Ссылка";
		
	РезультатЗапросаПоЦенам = Запрос.Выполнить();

	// Подготовим таблицу товаров для проведения.
	ТаблицаЦенВставки = ПодготовитьТаблицуЦенВставки(РезультатЗапросаПоЦенам);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовНастройкаОтклоненийОтБазовыхЦенВставки.КатегорияОбъектаЗалога КАК КатегорияОбъектаЗалога,
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовНастройкаОтклоненийОтБазовыхЦенВставки.ВидВставки КАК ВидВставки,
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовНастройкаОтклоненийОтБазовыхЦенВставки.ОтклонениеОтБазовойЦены КАК ОтклонениеОтБазовойЦены,
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовНастройкаОтклоненийОтБазовыхЦенВставки.ЗначениеОтклонения КАК ЗначениеОтклонения
	               |ИЗ
	               |	Документ.ЛБ_ПриказУсловияПредоставленияЗаймов.НастройкаОтклоненийОтБазовыхЦенВставки КАК ЛБ_ПриказУсловияПредоставленияЗаймовНастройкаОтклоненийОтБазовыхЦенВставки
	               |ГДЕ
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовНастройкаОтклоненийОтБазовыхЦенВставки.Ссылка = &Ссылка";
		
	РезультатЗапросаПоНастройкам = Запрос.Выполнить();

	// Подготовим таблицу товаров для проведения.
	ТаблицаНастроекВставки = ПодготовитьТаблицуНастроекВставки(РезультатЗапросаПоНастройкам);

КонецПроцедуры // ПодготовитьТаблицыДокумента()


// Процедура формирует таблицы по табличным частям документа.
//
Процедура ПодготовитьТаблицыДокументаПроцентныеСтавки(ТаблицаСтавок) Экспорт
    Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПриказУсловияПредоставленияЗаймов.ПричинаПрименения КАК ПричинаПрименения,
	               |	ЛБ_ПриказУсловияПредоставленияЗаймов.СхемаКредитования КАК СхемаКредитования,
	               |	ЛБ_ПриказУсловияПредоставленияЗаймов.СтатусЗалогодателя КАК СтатусЗалогодателя,
	               |	ЛБ_ПриказУсловияПредоставленияЗаймов.ДиапазонСумм КАК ДиапазонСумм,
	               |	ЛБ_ПриказУсловияПредоставленияЗаймов.ДеньНачалаПрименения КАК ДеньНачалаПрименения,
	               |	ЛБ_ПриказУсловияПредоставленияЗаймов.Ставка КАК Ставка
	               |ИЗ
	               |	Документ.ЛБ_ПриказУсловияПредоставленияЗаймов.СтавкиПроцентов КАК ЛБ_ПриказУсловияПредоставленияЗаймов
	               |ГДЕ
	               |	ЛБ_ПриказУсловияПредоставленияЗаймов.Ссылка = &Ссылка";
		
	РезультатЗапроса = Запрос.Выполнить();

	// Подготовим таблицу товаров для проведения.
	ТаблицаСтавок = ПодготовитьТаблицуСтавок(РезультатЗапроса);

КонецПроцедуры // ПодготовитьТаблицыДокументаПроцентныеСтавки()  

Функция ПодготовитьТаблицуЦенМеталлы(РезультатЗапросаПоЦенам) Экспорт

	ТаблицаЗапроса = РезультатЗапросаПоЦенам.Выгрузить();

	ТаблицаЦен = ТаблицаЗапроса.Скопировать();
	ТаблицаЦен.Очистить();
	ТаблицаЦен.Колонки.Добавить("Ломбард");

	Если Ломбарды.Количество() = 0 Тогда
		ВыборкаЛ = Справочники.ЛБ_Ломбарды.Выбрать();
		Пока ВыборкаЛ.Следующий() Цикл
			Если ВыборкаЛ.ЭтоГруппа тогда
				Продолжить;
			ИначеЕсли ВыборкаЛ.ПометкаУдаления Тогда
				Продолжить;  
			ИначеЕсли ВыборкаЛ.Закрыт Тогда
				Продолжить;	
			КонецЕсли;	
			Для каждого Стр Из  ТаблицаЗапроса Цикл
				Если Стр.Цена = 0 Тогда
					Продолжить;
				КонецЕсли;	
				НоваяСтр = ТаблицаЦен.Добавить();
				НоваяСтр.Ломбард = ВыборкаЛ.Ссылка;
				НоваяСтр.Проба = Стр.Проба;
				НоваяСтр.Категория = Стр.Категория;
				НоваяСтр.ЕдиницаИзмерения = Стр.ЕдиницаИзмерения;
	            НоваяСтр.Цена = Стр.Цена;
			КонецЦикла;	
		КонецЦикла;	
    Иначе
		Для каждого СтрЛ Из Ломбарды Цикл		
			Для каждого Стр Из  ТаблицаЗапроса Цикл
				Если Стр.Цена = 0 Тогда
					Продолжить;
				КонецЕсли;	
				НоваяСтр = ТаблицаЦен.Добавить();
				НоваяСтр.Ломбард = СтрЛ.Ломбард;
				НоваяСтр.Проба = Стр.Проба;
				НоваяСтр.Категория = Стр.Категория;
				НоваяСтр.ЕдиницаИзмерения = Стр.ЕдиницаИзмерения;
	            НоваяСтр.Цена = Стр.Цена;
			КонецЦикла;	
		КонецЦикла;	
	КонецЕсли;	
	
	Возврат ТаблицаЦен;

КонецФункции // ПодготовитьТаблицуЦен() 

Функция ПодготовитьТаблицуНастроекМеталлы(РезультатЗапросаПоНастройкам) Экспорт

	ТаблицаЗапроса = РезультатЗапросаПоНастройкам.Выгрузить();

	ТаблицаНастроек = ТаблицаЗапроса.Скопировать();
	ТаблицаНастроек.Очистить();
	ТаблицаНастроек.Колонки.Добавить("Ломбард");

	Если Ломбарды.Количество() = 0 Тогда
		ВыборкаЛ = Справочники.ЛБ_Ломбарды.Выбрать();
		Пока ВыборкаЛ.Следующий() Цикл
			Если ВыборкаЛ.ЭтоГруппа тогда
				Продолжить;
			ИначеЕсли ВыборкаЛ.ПометкаУдаления Тогда
				Продолжить;  
			ИначеЕсли ВыборкаЛ.Закрыт Тогда
				Продолжить;		
			КонецЕсли;	

			Для каждого Стр Из  ТаблицаЗапроса Цикл  
				//+МАН 27.01.24 Закомментировал т.к. нельзя было убрать отклонение. Заявка 2792.
				//Если Стр.ЗначениеОтклонения = 0 Тогда
				//	Продолжить;
				//КонецЕсли;	
				//-МАН
				НоваяСтр = ТаблицаНастроек.Добавить();
				НоваяСтр.Ломбард = ВыборкаЛ.Ссылка;
				НоваяСтр.Металл = Стр.Металл;
				НоваяСтр.Проба = Стр.Проба;
				НоваяСтр.СхемаКредитования = Стр.СхемаКредитования;
				НоваяСтр.КатегорияОбъектаЗалога = Стр.КатегорияОбъектаЗалога;
	            НоваяСтр.ОтклонениеОтБазовойЦены = Стр.ОтклонениеОтБазовойЦены; 
				НоваяСтр.ЗначениеОтклонения = Стр.ЗначениеОтклонения;
			КонецЦикла;	
		КонецЦикла;	
    Иначе
		Для каждого СтрЛ Из Ломбарды Цикл		
			Для каждого Стр Из  ТаблицаЗапроса Цикл 
				//+МАН 27.01.24 Закомментировал т.к. нельзя было убрать отклонение. Заявка 2792.
				//Если Стр.ЗначениеОтклонения = 0 Тогда
				//	Продолжить;
				//КонецЕсли;	
				//-МАН
				НоваяСтр = ТаблицаНастроек.Добавить();
				НоваяСтр.Ломбард = СтрЛ.Ломбард;
				НоваяСтр.Металл = Стр.Металл;
				НоваяСтр.Проба = Стр.Проба;
				НоваяСтр.СхемаКредитования = Стр.СхемаКредитования;
				НоваяСтр.КатегорияОбъектаЗалога = Стр.КатегорияОбъектаЗалога;
	            НоваяСтр.ОтклонениеОтБазовойЦены = Стр.ОтклонениеОтБазовойЦены; 
				НоваяСтр.ЗначениеОтклонения = Стр.ЗначениеОтклонения;
			КонецЦикла;	
		КонецЦикла;	
	КонецЕсли;	
	
	Возврат ТаблицаНастроек;

КонецФункции // ПодготовитьТаблицуНастроек()

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  СтруктураШапкиДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблиица значений.
//
Функция ПодготовитьТаблицуЦенВставки(РезультатЗапросаПоЦенам) Экспорт

	ТаблицаЗапроса = РезультатЗапросаПоЦенам.Выгрузить();

	ТаблицаЦен = ТаблицаЗапроса.Скопировать();
	ТаблицаЦен.Очистить();
	ТаблицаЦен.Колонки.Добавить("Ломбард");

	Если Ломбарды.Количество() = 0 Тогда
		ВыборкаЛ = Справочники.ЛБ_Ломбарды.Выбрать();
		Пока ВыборкаЛ.Следующий() Цикл
			Если ВыборкаЛ.ЭтоГруппа тогда
				Продолжить;
			ИначеЕсли ВыборкаЛ.ПометкаУдаления Тогда
				Продолжить;    
			ИначеЕсли ВыборкаЛ.Закрыт Тогда
				Продолжить;		
			КонецЕсли;
		   	Для каждого Стр Из  ТаблицаЗапроса Цикл
				Если Стр.Цена = 0 Тогда
					Продолжить;
				КонецЕсли;	
				НоваяСтр = ТаблицаЦен.Добавить();
				НоваяСтр.Ломбард = ВыборкаЛ.Ссылка;
				НоваяСтр.ВидВставки = Стр.ВидВставки;
				НоваяСтр.ФормаОгранки = Стр.ФормаОгранки;
				НоваяСтр.ВидОгранки = Стр.ВидОгранки;
				НоваяСтр.КачествоОгранки = Стр.КачествоОгранки;
				НоваяСтр.ВесоваяГруппа = Стр.ВесоваяГруппа;
				НоваяСтр.ЕдиницаИзмерения = Стр.ЕдиницаИзмерения;
	            НоваяСтр.Цена = Стр.Цена;
			КонецЦикла;	
		Конеццикла;	
	Иначе	
		Для каждого СтрЛ Из Ломбарды Цикл		
			Для каждого Стр Из  ТаблицаЗапроса Цикл
				Если Стр.Цена = 0 Тогда
					Продолжить;
				КонецЕсли;	
				НоваяСтр = ТаблицаЦен.Добавить();
				НоваяСтр.Ломбард = СтрЛ.Ломбард;
				НоваяСтр.ВидВставки = Стр.ВидВставки;
				НоваяСтр.ФормаОгранки = Стр.ФормаОгранки;
				НоваяСтр.ВидОгранки = Стр.ВидОгранки;
				НоваяСтр.КачествоОгранки = Стр.КачествоОгранки;
				НоваяСтр.ВесоваяГруппа = Стр.ВесоваяГруппа;
				НоваяСтр.ЕдиницаИзмерения = Стр.ЕдиницаИзмерения;
	            НоваяСтр.Цена = Стр.Цена;
			КонецЦикла;	
		КонецЦикла;	
	КонецЕсли;	

	Возврат ТаблицаЦен;

КонецФункции // ПодготовитьТаблицуТоваров()

Функция ПодготовитьТаблицуНастроекВставки(РезультатЗапросаПоНастройкам) Экспорт

	ТаблицаЗапроса = РезультатЗапросаПоНастройкам.Выгрузить();

	ТаблицаНастроек = ТаблицаЗапроса.Скопировать();
	ТаблицаНастроек.Очистить();
	ТаблицаНастроек.Колонки.Добавить("Ломбард");

	Если Ломбарды.Количество() = 0 Тогда
		ВыборкаЛ = Справочники.ЛБ_Ломбарды.Выбрать();
		Пока ВыборкаЛ.Следующий() Цикл
			Если ВыборкаЛ.ЭтоГруппа тогда
				Продолжить;
			ИначеЕсли ВыборкаЛ.ПометкаУдаления Тогда
				Продолжить; 
			ИначеЕсли ВыборкаЛ.Закрыт Тогда
				Продолжить;		
			КонецЕсли;	

			Для каждого Стр Из  ТаблицаЗапроса Цикл  
				Если Стр.ЗначениеОтклонения = 0 Тогда
					Продолжить;
				КонецЕсли;	
				НоваяСтр = ТаблицаНастроек.Добавить();
				НоваяСтр.Ломбард = ВыборкаЛ.Ссылка;
				НоваяСтр.ВидВставки = Стр.ВидВставки;
				НоваяСтр.КатегорияОбъектаЗалога = Стр.КатегорияОбъектаЗалога;
	            НоваяСтр.ОтклонениеОтБазовойЦены = Стр.ОтклонениеОтБазовойЦены; 
				НоваяСтр.ЗначениеОтклонения = Стр.ЗначениеОтклонения;
			КонецЦикла;	
		КонецЦикла;	
    Иначе
		Для каждого СтрЛ Из Ломбарды Цикл		
			Для каждого Стр Из  ТаблицаЗапроса Цикл 
				Если Стр.ЗначениеОтклонения = 0 Тогда
					Продолжить;
				КонецЕсли;	
				НоваяСтр = ТаблицаНастроек.Добавить();
				НоваяСтр.Ломбард = СтрЛ.Ломбард;
				НоваяСтр.ВидВставки = Стр.ВидВставки;
				НоваяСтр.КатегорияОбъектаЗалога = Стр.КатегорияОбъектаЗалога;
	            НоваяСтр.ОтклонениеОтБазовойЦены = Стр.ОтклонениеОтБазовойЦены; 
				НоваяСтр.ЗначениеОтклонения = Стр.ЗначениеОтклонения;
			КонецЦикла;	
		КонецЦикла;	
	КонецЕсли;	
	
	Возврат ТаблицаНастроек;

КонецФункции // ПодготовитьТаблицуНастроек()

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  СтруктураШапкиДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблиица значений.
//
Функция ПодготовитьТаблицуСтавок(РезультатЗапроса) Экспорт

	ТаблицаЗапроса = РезультатЗапроса.Выгрузить();

	ТаблицаСтавок = ТаблицаЗапроса.Скопировать();
	ТаблицаСтавок.Очистить();
	ТаблицаСтавок.Колонки.Добавить("Ломбард");

	Если Ломбарды.Количество() = 0 Тогда
		ВыборкаЛ = Справочники.ЛБ_Ломбарды.Выбрать();
		Пока ВыборкаЛ.Следующий() Цикл
			Если ВыборкаЛ.ЭтоГруппа тогда
				Продолжить;
			ИначеЕсли ВыборкаЛ.ПометкаУдаления Тогда
				Продолжить;  
			ИначеЕсли ВыборкаЛ.Закрыт Тогда
				Продолжить;		
			КонецЕсли;	
         	Для каждого Стр Из  ТаблицаЗапроса Цикл
				Если НЕ ЗначениеЗаполнено(Стр.Ставка) Тогда
					Продолжить;
				КонецЕсли;	        
				НоваяСтр = ТаблицаСтавок.Добавить();
				НоваяСтр.Ломбард = ВыборкаЛ.Ссылка;
				НоваяСтр.ПричинаПрименения = Стр.ПричинаПрименения;
				НоваяСтр.СхемаКредитования = Стр.СхемаКредитования;
				НоваяСтр.СтатусЗалогодателя = Стр.СтатусЗалогодателя;
	            НоваяСтр.ДиапазонСумм = Стр.ДиапазонСумм; 
				НоваяСтр.ДеньНачалаПрименения = Стр.ДеньНачалаПрименения;
				НоваяСтр.Ставка = Стр.Ставка;
			КонецЦикла;	
		КонецЦикла;	
    Иначе
		Для каждого СтрЛ Из Ломбарды Цикл		
			Для каждого Стр Из  ТаблицаЗапроса Цикл
				Если НЕ ЗначениеЗаполнено(Стр.Ставка) Тогда
					Продолжить;
				КонецЕсли;	 
				НоваяСтр = ТаблицаСтавок.Добавить();
				НоваяСтр.Ломбард = СтрЛ.Ломбард.Ссылка;
				НоваяСтр.ПричинаПрименения = Стр.ПричинаПрименения;
				НоваяСтр.СхемаКредитования = Стр.СхемаКредитования;
				НоваяСтр.СтатусЗалогодателя = Стр.СтатусЗалогодателя;
	            НоваяСтр.ДиапазонСумм = Стр.ДиапазонСумм;  
				НоваяСтр.ДеньНачалаПрименения = Стр.ДеньНачалаПрименения;
				НоваяСтр.Ставка = Стр.Ставка; 
			КонецЦикла;	
		КонецЦикла;	
	КонецЕсли;	
	
	Возврат ТаблицаСтавок;

КонецФункции // ПодготовитьТаблицуТоваров()

// Процедура формирует таблицы по табличным частям документа.
//
Процедура ПодготовитьТаблицыДокументаАкцияМеталлы(ТаблицаЦенАкцияМеталлы) Экспорт
    Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовУсловияАкцииМеталлы.Ссылка.Акция КАК Акция,
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовУсловияАкцииМеталлы.Проба КАК Проба,
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовУсловияАкцииМеталлы.Категория КАК Категория,
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовУсловияАкцииМеталлы.СхемаКредитования КАК СхемаКредитования,
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовУсловияАкцииМеталлы.УстановитьЗначениеИлиОтклонение КАК УстановитьЗначениеИлиОтклонение,
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовУсловияАкцииМеталлы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовУсловияАкцииМеталлы.Цена КАК Цена,
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовУсловияАкцииМеталлы.ОтклонениеОтЦены КАК ОтклонениеОтЦены,
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовУсловияАкцииМеталлы.ЗначениеОтклонения КАК ЗначениеОтклонения
	               |ИЗ
	               |	Документ.ЛБ_ПриказУсловияПредоставленияЗаймов.УсловияАкцииМеталлы КАК ЛБ_ПриказУсловияПредоставленияЗаймовУсловияАкцииМеталлы
	               |ГДЕ
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовУсловияАкцииМеталлы.Ссылка = &Ссылка";
		
	РезультатЗапросаПоТоварам = Запрос.Выполнить();

	// Подготовим таблицу товаров для проведения.
	ТаблицаЦенАкцияМеталлы = ПодготовитьТаблицуЦенАкцияМеталлы(РезультатЗапросаПоТоварам);

КонецПроцедуры // ПодготовитьТаблицыДокумента()

Функция ПодготовитьТаблицуЦенАкцияМеталлы(РезультатЗапросаПоТоварам) Экспорт

	ТаблицаЗапроса = РезультатЗапросаПоТоварам.Выгрузить();

	ТаблицаЦен = ТаблицаЗапроса.Скопировать();
	ТаблицаЦен.Очистить();
	ТаблицаЦен.Колонки.Добавить("Ломбард");

	Если Ломбарды.Количество() = 0 Тогда
		ВыборкаЛ = Справочники.ЛБ_Ломбарды.Выбрать();
		Пока ВыборкаЛ.Следующий() Цикл
			Если ВыборкаЛ.ЭтоГруппа тогда
				Продолжить;
			ИначеЕсли ВыборкаЛ.ПометкаУдаления Тогда
				Продолжить;   
			ИначеЕсли ВыборкаЛ.Закрыт Тогда
				Продолжить;		
			КонецЕсли;	

			Для каждого Стр Из  ТаблицаЗапроса Цикл
				//Если ЭтотОбъект.НеПроводитьНулевыеЗначения И (Стр.Цена = 0) Тогда
				//	Продолжить;
				//КонецЕсли;	
				НоваяСтр = ТаблицаЦен.Добавить();
				НоваяСтр.Ломбард = ВыборкаЛ.Ссылка; 
				НоваяСтр.Акция = Стр.Акция;
				НоваяСтр.Проба = Стр.Проба;
				НоваяСтр.Категория = Стр.Категория;   
				НоваяСтр.СхемаКредитования = Стр.СхемаКредитования;
				НоваяСтр.ЕдиницаИзмерения = Стр.ЕдиницаИзмерения;
	            НоваяСтр.Цена = Стр.Цена;
				НоваяСтр.ОтклонениеОтЦены = Стр.ОтклонениеОтЦены;
				НоваяСтр.ЗначениеОтклонения = Стр.ЗначениеОтклонения;
			КонецЦикла;	
		КонецЦикла;	
    Иначе
		Для каждого СтрЛ Из Ломбарды Цикл		
			Для каждого Стр Из  ТаблицаЗапроса Цикл
				//Если ЭтотОбъект.НеПроводитьНулевыеЗначения И (Стр.Цена = 0) Тогда
				//	Продолжить;
				//КонецЕсли;	
				НоваяСтр = ТаблицаЦен.Добавить();
				НоваяСтр.Ломбард = СтрЛ.Ломбард; 
				НоваяСтр.Акция = Стр.Акция;
				НоваяСтр.Проба = Стр.Проба;
				НоваяСтр.Категория = Стр.Категория;   
				НоваяСтр.СхемаКредитования = Стр.СхемаКредитования;
				НоваяСтр.ЕдиницаИзмерения = Стр.ЕдиницаИзмерения;
	            НоваяСтр.Цена = Стр.Цена; 
				НоваяСтр.ОтклонениеОтЦены = Стр.ОтклонениеОтЦены;
				НоваяСтр.ЗначениеОтклонения = Стр.ЗначениеОтклонения;
			КонецЦикла;	
		КонецЦикла;	
	КонецЕсли;	
	
	Возврат ТаблицаЦен;

КонецФункции // ПодготовитьТаблицуТоваров()  

Процедура ПодготовитьТаблицыДокументаСтавкиАкция(ТаблицаСтавокАкция) Экспорт
    Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовУсловияАкцииСтавки.Ссылка.Акция КАК Акция,
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовУсловияАкцииСтавки.ПричинаПрименения КАК ПричинаПрименения,
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовУсловияАкцииСтавки.СхемаКредитования КАК СхемаКредитования,
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовУсловияАкцииСтавки.СтатусЗалогодателя КАК СтатусЗалогодателя,
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовУсловияАкцииСтавки.ДиапазонСумм КАК ДиапазонСумм,	           
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовУсловияАкцииСтавки.УстановитьЗначениеИлиОтклонение КАК УстановитьЗначениеИлиОтклонение,
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовУсловияАкцииСтавки.Ставка КАК Ставка,
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовУсловияАкцииСтавки.Отклонение КАК Отклонение,
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовУсловияАкцииСтавки.ЗначениеОтклонения КАК ЗначениеОтклонения
	               |ИЗ
	               |	Документ.ЛБ_ПриказУсловияПредоставленияЗаймов.УсловияАкцииСтавки КАК ЛБ_ПриказУсловияПредоставленияЗаймовУсловияАкцииСтавки
	               |ГДЕ
	               |	ЛБ_ПриказУсловияПредоставленияЗаймовУсловияАкцииСтавки.Ссылка = &Ссылка";
		
	РезультатЗапроса = Запрос.Выполнить();

	// Подготовим таблицу товаров для проведения.
	ТаблицаСтавокАкция = ПодготовитьТаблицуСтавокАкция(РезультатЗапроса);

КонецПроцедуры // ПодготовитьТаблицыДокумента()

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  СтруктураШапкиДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблиица значений.
//
Функция ПодготовитьТаблицуСтавокАкция(РезультатЗапроса) Экспорт

	ТаблицаЗапроса = РезультатЗапроса.Выгрузить();

	ТаблицаСтавок = ТаблицаЗапроса.Скопировать();
	ТаблицаСтавок.Очистить();
	ТаблицаСтавок.Колонки.Добавить("Ломбард");

	Если Ломбарды.Количество() = 0 Тогда
		ВыборкаЛ = Справочники.ЛБ_Ломбарды.Выбрать();
		Пока ВыборкаЛ.Следующий() Цикл
			Если ВыборкаЛ.ЭтоГруппа тогда
				Продолжить;
			ИначеЕсли ВыборкаЛ.ПометкаУдаления Тогда
				Продолжить;
			ИначеЕсли ВыборкаЛ.Закрыт Тогда
				Продолжить;		
			КонецЕсли;	

			Для каждого Стр Из  ТаблицаЗапроса Цикл
				Если НЕ ЗначениеЗаполнено(Стр.Ставка) И НЕ ЗначениеЗаполнено(Стр.ЗначениеОтклонения) Тогда
					Продолжить;
				КонецЕсли;	     
				НоваяСтр = ТаблицаСтавок.Добавить();
				НоваяСтр.Ломбард = ВыборкаЛ.Ссылка;  
				НоваяСтр.Акция = Стр.Акция;
				НоваяСтр.ПричинаПрименения = Стр.ПричинаПрименения;
				НоваяСтр.СхемаКредитования = Стр.СхемаКредитования;
				НоваяСтр.СтатусЗалогодателя = Стр.СтатусЗалогодателя;
	            НоваяСтр.ДиапазонСумм = Стр.ДиапазонСумм; 
				НоваяСтр.Ставка = Стр.Ставка;
				НоваяСтр.Отклонение = Стр.Отклонение;
				НоваяСтр.ЗначениеОтклонения = Стр.ЗначениеОтклонения;  
			КонецЦикла;	
		КонецЦикла;	
    Иначе
		Для каждого СтрЛ Из Ломбарды Цикл		
			Для каждого Стр Из  ТаблицаЗапроса Цикл
				Если НЕ ЗначениеЗаполнено(Стр.Ставка) И НЕ ЗначениеЗаполнено(Стр.ЗначениеОтклонения) Тогда
					Продолжить;
				КонецЕсли;	  
				НоваяСтр = ТаблицаСтавок.Добавить();
				НоваяСтр.Ломбард = СтрЛ.Ломбард.Ссылка;  
				НоваяСтр.Акция = Стр.Акция;
				НоваяСтр.ПричинаПрименения = Стр.ПричинаПрименения;
				НоваяСтр.СхемаКредитования = Стр.СхемаКредитования;
				НоваяСтр.СтатусЗалогодателя = Стр.СтатусЗалогодателя;
	            НоваяСтр.ДиапазонСумм = Стр.ДиапазонСумм;  
				НоваяСтр.Ставка = Стр.Ставка;   
				НоваяСтр.Отклонение = Стр.Отклонение;
				НоваяСтр.ЗначениеОтклонения = Стр.ЗначениеОтклонения; 
			КонецЦикла;	
		КонецЦикла;	
	КонецЕсли;	
	
	Возврат ТаблицаСтавок;

КонецФункции // ПодготовитьТаблицуТоваров()

// По результату запроса по шапке документа формируем движения по регистрам.
//
// Параметры: 
//  РежимПроведения           - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента   - выборка из результата запроса по шапке документа,
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары,
//  ТаблицаПоСкидкам          - таблица значений, содержащая данные для проведения и проверки ТЧ Скидки,
//  ТаблицаПоУслугам          - таблица значений, содержащая данные для проведения и проверки ТЧ "Услуги",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(РежимПроведения, ТаблицаЦенМеталлы, ТаблицаНастроекМеталлы, ТаблицаЦенВставки, ТаблицаНастроекВставки, ТаблицаСтавок, Отказ)
	ДатаНачалаДействия = ?(ЭтотОбъект.ДатаНачалаДействияПриказа = Дата(1,1,1), Дата, ?(ДатаНачалаДействияПриказа < Дата, Дата, ДатаНачалаДействияПриказа));
	
	Движения.ЛБ_ПрейскурантЦенНаМеталлы.Записывать = Истина;
    Для Каждого ТекСтрокаЦены Из ТаблицаЦенМеталлы Цикл
		Движение = Движения.ЛБ_ПрейскурантЦенНаМеталлы.Добавить();
		Движение.Период = Дата;
		Движение.ДатаНачалаДействия = ДатаНачалаДействия;
		Движение.Ломбард = ТекСтрокаЦены.Ломбард;
		Движение.Проба = ТекСтрокаЦены.Проба;
		Движение.Категория = ТекСтрокаЦены.Категория;
		Движение.ЕдиницаИзмерения = ТекСтрокаЦены.ЕдиницаИзмерения;
		Движение.Цена = ТекСтрокаЦены.Цена;
	КонецЦикла;   
	
	Движения.ЛБ_НастройкаРасчетаОценкиЗалога.Записывать = Истина;
	Для Каждого ТекСтрокаН Из ТаблицаНастроекМеталлы Цикл
		Движение = Движения.ЛБ_НастройкаРасчетаОценкиЗалога.Добавить();
		Движение.Период = Дата;
		Движение.ДатаНачалаДействия = ДатаНачалаДействия;
		Движение.Ломбард = ТекСтрокаН.Ломбард; 
		Движение.Металл = ТекСтрокаН.Металл;
		Движение.Проба = ТекСтрокаН.Проба;
		Движение.СхемаКредитования = ТекСтрокаН.СхемаКредитования;
		Движение.КатегорияОбъектаЗалога = ТекСтрокаН.КатегорияОбъектаЗалога;
		Движение.ОтклонениеОтБазовойЦены = ТекСтрокаН.ОтклонениеОтБазовойЦены;
		Движение.ЗначениеОтклонения = ТекСтрокаН.ЗначениеОтклонения;
	КонецЦикла;   		

	Движения.ЛБ_ПрейскурантЦенНаДрагоценныеКамни.Записывать = Истина;
    Для Каждого ТекСтрокаЦены Из ТаблицаЦенВставки Цикл
		Движение = Движения.ЛБ_ПрейскурантЦенНаДрагоценныеКамни.Добавить();
		Движение.Период = Дата;
		Движение.ДатаНачалаДействия = ДатаНачалаДействия;
		Движение.Ломбард = ТекСтрокаЦены.Ломбард;
		Движение.ВидВставки = ТекСтрокаЦены.ВидВставки;
		Движение.ФормаОгранки = ТекСтрокаЦены.ФормаОгранки;
		Движение.ВидОгранки = ТекСтрокаЦены.ВидОгранки;
		Движение.КачествоОгранки = ТекСтрокаЦены.КачествоОгранки;
		Движение.ВесоваяГруппа = ТекСтрокаЦены.ВесоваяГруппа;
		Движение.ЕдиницаИзмерения = ТекСтрокаЦены.ЕдиницаИзмерения;
		Движение.Цена = ТекСтрокаЦены.Цена;
	КонецЦикла;
	
	Движения.ЛБ_НастройкаОценкиДрагоценныхВставок.Записывать = Истина;
	Для Каждого ТекСтрокаН Из ТаблицаНастроекВставки Цикл
		Движение = Движения.ЛБ_НастройкаОценкиДрагоценныхВставок.Добавить();
		Движение.Период = Дата;
		Движение.ДатаНачалаДействия = ДатаНачалаДействия;
		Движение.Ломбард = ТекСтрокаН.Ломбард; 
		Движение.ВидВставки = ТекСтрокаН.ВидВставки;
		Движение.КатегорияОбъектаЗалога = ТекСтрокаН.КатегорияОбъектаЗалога;
		Движение.ОтклонениеОтБазовойЦены = ТекСтрокаН.ОтклонениеОтБазовойЦены;
		Движение.ЗначениеОтклонения = ТекСтрокаН.ЗначениеОтклонения;
	КонецЦикла;   		
	
	Движения.ЛБ_ПрейскурантПроцентныхСтавок.Записывать = Истина;
    Для Каждого ТекСтрокаС Из ТаблицаСтавок Цикл
		Движение = Движения.ЛБ_ПрейскурантПроцентныхСтавок.Добавить();
		Движение.Период = Дата;
		Движение.ДатаНачалаДействия = ДатаНачалаДействия;
		Движение.Ломбард = ТекСтрокаС.Ломбард;
		Движение.ПричинаПрименения = ТекСтрокаС.ПричинаПрименения;
		Движение.СхемаКредитования = ТекСтрокаС.СхемаКредитования;
		Движение.СтатусЗалогодателя = ТекСтрокаС.СтатусЗалогодателя;
        Движение.ДиапазонСуммЗайма = ТекСтрокаС.ДиапазонСумм;
		Движение.ДеньНачалаПрименения = ТекСтрокаС.ДеньНачалаПрименения;
		Движение.ПроцентнаяСтавка = ТекСтрокаС.Ставка;
	КонецЦикла;
		
КонецПроцедуры // ДвиженияПоРегистрам()

Процедура ДвиженияПоРегистрамАкция(РежимПроведения, ТаблицаЦенАкцияМеталлы, ТаблицаСтавокАкция, Отказ)  
	ДатаНачалаДействия = ?(ЭтотОбъект.ДатаНачалаДействияПриказа = Дата(1,1,1), Дата, ?(ДатаНачалаДействияПриказа < Дата, Дата, ДатаНачалаДействияПриказа));
	
    Движения.ЛБ_АкцииМеталлы.Записывать = Истина;
    Для Каждого ТекСтрокаЦены Из ТаблицаЦенАкцияМеталлы Цикл
		Движение = Движения.ЛБ_АкцииМеталлы.Добавить();
		Движение.Период = Дата;
		Движение.ДатаНачалаДействия = ДатаНачалаДействия;  
		Движение.ДатаОкончанияДействия = ЭтотОбъект.ДатаОкончанияДействияПриказа; 
		Движение.Акция = ТекСтрокаЦены.Акция;
		Движение.Ломбард = ТекСтрокаЦены.Ломбард;
		Движение.Проба = ТекСтрокаЦены.Проба;
		Движение.Категория = ТекСтрокаЦены.Категория;  
		Движение.СхемаКредитования = ТекСтрокаЦены.СхемаКредитования;
		Движение.ЕдиницаИзмерения = ТекСтрокаЦены.ЕдиницаИзмерения;
		Движение.Цена = ТекСтрокаЦены.Цена; 
		Движение.Отклонение = ТекСтрокаЦены.ОтклонениеОтЦены; 
		Движение.ЗначениеОтклонения = ТекСтрокаЦены.ЗначениеОтклонения;
	КонецЦикла;      
	
	Движения.ЛБ_АкцииПроцентныеСтавки.Записывать = Истина;
    Для Каждого ТекСтрокаС Из ТаблицаСтавокАкция Цикл
		Движение = Движения.ЛБ_АкцииПроцентныеСтавки.Добавить();
		Движение.Период = Дата;
		Движение.ДатаНачалаДействия = ДатаНачалаДействия;
		Движение.ДатаОкончанияДействия = ЭтотОбъект.ДатаОкончанияДействияПриказа; 
		Движение.Акция = ТекСтрокаС.Акция;
		Движение.Ломбард = ТекСтрокаС.Ломбард;
		Движение.ПричинаПрименения = ТекСтрокаС.ПричинаПрименения;
		Движение.СхемаКредитования = ТекСтрокаС.СхемаКредитования;
		Движение.СтатусЗалогодателя = ТекСтрокаС.СтатусЗалогодателя;
        Движение.ДиапазонСуммЗайма = ТекСтрокаС.ДиапазонСумм;
		Движение.ПроцентнаяСтавка = ТекСтрокаС.Ставка;   
		Движение.Отклонение = ТекСтрокаС.Отклонение; 
		Движение.ЗначениеОтклонения = ТекСтрокаС.ЗначениеОтклонения;
	КонецЦикла;

 КонецПроцедуры

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Перем ТаблицаСтавок; 
	Перем ТаблицаЦенМеталлы, ТаблицаНастроекМеталлы;
	Перем ТаблицаЦенВставки, ТаблицаНастроекВставки;
	Перем ТаблицаЦенАкцияМеталлы;
	Перем ТаблицаСтавокАкция;
	
	Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.Базовый Тогда
		ПодготовитьТаблицыДокументаПроцентныеСтавки(ТаблицаСтавок); 
		ПодготовитьТаблицыДокументаМеталлы(ТаблицаЦенМеталлы, ТаблицаНастроекМеталлы); 
		ПодготовитьТаблицыДокументаВставки(ТаблицаЦенВставки, ТаблицаНастроекВставки);
				
		ДвиженияПоРегистрам(РежимПроведения, ТаблицаЦенМеталлы, ТаблицаНастроекМеталлы, ТаблицаЦенВставки, ТаблицаНастроекВставки, ТаблицаСтавок, Отказ);
	ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.Акция Тогда
        ПодготовитьТаблицыДокументаАкцияМеталлы(ТаблицаЦенАкцияМеталлы);
		ПодготовитьТаблицыДокументаСтавкиАкция(ТаблицаСтавокАкция); 
		
		ДвиженияПоРегистрамАкция(РежимПроведения, ТаблицаЦенАкцияМеталлы, ТаблицаСтавокАкция, Отказ)
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Ответственный = Пользователи.ТекущийПользователь();
	ЭтотОбъект.ВидПриказа = Перечисления.ЛБ_ВидыПриказа.Проект;
	ЭтотОбъект.ДатаНачалаДействияПриказа = Дата(1,1,1);
	ЭтотОбъект.ДатаОкончанияДействияПриказа = Дата(1,1,1);  
	
	//Проверим кредитные схемы и процентные ставки 
	Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.Базовый Тогда 
		Если НЕ ЭтотОбъект.СтавкиПроцентов.Количество() = 0 Тогда 
			ТаблицаСтавок = ЭтотОбъект.СтавкиПроцентов.Выгрузить();
			ЭтотОбъект.СтавкиПроцентов.Очистить();
			УдСтрокиСК = Новый СписокЗначений;
			Для каждого стр Из ЭтотОбъект.СхемыКредитования цикл
				СписокЛ = Новый СписокЗначений; 
				СписокЛ.Добавить(Справочники.ЛБ_Ломбарды.ПустаяСсылка());
				Для каждого СтрЛ Из ЭтотОбъект.Ломбарды цикл 
					СписокЛ.Добавить(СтрЛ.Ломбард);
				Конеццикла;	
				ШаблонПриказа = ЛБ_ОбщийМодуль.ПолучитьТекущийШаблон(Дата, Перечисления.ЛБ_ВидыПрейскурантов.ПроцентныеСтавки, СписокЛ, Стр.СхемаКредитования);
				Отбор = Новый Структура;
				Отбор.Вставить("СхемаКредитования", Стр.СхемаКредитования);
				Если ШаблонПриказа = неопределено Тогда 
					УдСтрокиСК.Добавить(Стр);				 
				    Сообщение = Новый СообщениеПользователю;
                    Сообщение.Текст = "Для кредитной схемы " + СокрЛП(Стр.СхемаКредитования) + " не установлен шаблон процентных ставок.";
                    Сообщение.Сообщить();				
				Иначе
					Если НЕ ШаблонПриказа = Стр.ШаблонПроцентныеСтавки Тогда
					    Сообщение = Новый СообщениеПользователю;
	                    Сообщение.Текст = "Для кредитной схемы " + СокрЛП(Стр.СхемаКредитования) + " установлен новый шаблон процентных ставок, данные таблицы будут перезаполнены";
	                    Сообщение.Сообщить();
						
						Стр.ШаблонПроцентныеСтавки = ШаблонПриказа;
						Для каждого СтрШ Из Стр.ШаблонПроцентныеСтавки.СтавкиПроцентов Цикл
			                НоваяСтрП = ЭтотОбъект.СтавкиПроцентов.Добавить();
							НоваяСтрП.СхемаКредитования = Стр.СхемаКредитования;
							НоваяСтрП.ПричинаПрименения = СтрШ.ПричинаПрименения;
							НоваяСтрП.СтатусЗалогодателя = СтрШ.СтатусЗалогодателя;
							НоваяСтрП.ДиапазонСумм = СтрШ.ДиапазонСумм;
							
							ОтборП = Новый Структура;
				            ОтборП.Вставить("СхемаКредитования", НоваяСтрП.СхемаКредитования);
							ОтборП.Вставить("ПричинаПрименения", НоваяСтрП.ПричинаПрименения);
							ОтборП.Вставить("СтатусЗалогодателя", НоваяСтрП.СтатусЗалогодателя);
							ОтборП.Вставить("ДиапазонСумм", НоваяСтрП.ДиапазонСумм); 
							
							СтрокиП = ТаблицаСтавок.НайтиСтроки(ОтборП); 
							Если НЕ СтрокиП.Количество() = 0 Тогда
								СтрП = строкиП.Получить(0);
								НоваяСтрП.ДеньНачалаПрименения = СтрП.ДеньНачалаПрименения;
							    НоваяСтрП.Ставка = СтрП.ставка;
							Иначе  
								НоваяСтрП.ДеньНачалаПрименения = 1;
							    НоваяСтрП.Ставка = 0;
							КонецЕсли;	
						Конеццикла;    
					Иначе 
						СтрокиП = ТаблицаСтавок.НайтиСтроки(Отбор);
						Для каждого СтрП из СтрокиП Цикл 
							НоваяСтрП = ЭтотОбъект.СтавкиПроцентов.Добавить();
							НоваяСтрП.СхемаКредитования = СтрП.СхемаКредитования;
							НоваяСтрП.ПричинаПрименения = СтрП.ПричинаПрименения;
							НоваяСтрП.СтатусЗалогодателя = СтрП.СтатусЗалогодателя;
							НоваяСтрП.ДиапазонСумм = СтрП.ДиапазонСумм;
                            НоваяСтрП.ДеньНачалаПрименения = СтрП.ДеньНачалаПрименения;
							НоваяСтрП.Ставка = СтрП.ставка;
						Конеццикла;	
					КонецЕсли;	
				КонецЕсли;	
			Конеццикла;	 
			Для каждого Эл Из УдСтрокиСК Цикл
				ЭтотОбъект.СхемыКредитования.Удалить(Эл.Значение);
			КонецЦикла;	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если ЭтотОбъект.ДатаНачалаДействияПриказа < ЭтотОбъект.Дата Тогда
		    ОбщегоНазначения.СообщитьПользователю("Дата начала действия приказа не может быть меньше даты прказа!"); 
			Отказ = Истина;
		КонецЕсли;			
		
		ВсеОК = Истина;
		//проверим минусовые значения в таблицах
		Для каждого Стр Из ЭтотОбъект.ЦеныМеталлы Цикл  
			Если стр.Цена < 0 Тогда  
				ОбщегоНазначения.СообщитьПользователю("Ошибка заполнения цен металлов. Цена металла не может быть отрицательной!"); 
				ВсеОК = Ложь; 
				Прервать;
			КонецЕсли;	
		Конеццикла;	
		
		Для каждого Стр Из ЭтотОбъект.ЦеныВставки Цикл  
			Если стр.Цена < 0 Тогда  
				ОбщегоНазначения.СообщитьПользователю("Ошибка заполнения цен вставок. Цена вставки не может быть отрицательной!"); 
				ВсеОК = Ложь; 
				Прервать;
			КонецЕсли;	
		Конеццикла;	  
		
		Для каждого Стр Из ЭтотОбъект.СтавкиПроцентов Цикл  
			Если стр.Ставка < 0 Тогда  
				ОбщегоНазначения.СообщитьПользователю("Ошибка заполнения процентых ставок. Процентая ставка не может быть отрицательной!"); 
				ВсеОК = Ложь; 
				Прервать;
			КонецЕсли;	
		Конеццикла;	
		
		Если Не ВсеОК тогда
			Отказ = Истина;  
			Возврат;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры // ПередЗаписью()

#КонецОбласти


#КонецЕсли
