&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Отчет.ДатаКон = ТекущаяДата();   
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)	
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()	
	ДокументРезультат.Очистить();  
	Дата1 = Отчет.ДатаНач;
	Дата2 = ?(Отчет.ДатаКон = Дата(1,1,1), КонецДня(ТекущаяДата()), КонецДня(Отчет.ДатаКон)); 
	
	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("Дата", Дата2);   
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЛБ_ОборотыПоОперациямЗайма.Период КАК Период,
	               |	ЛБ_ОборотыПоОперациямЗайма.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_ОборотыПоОперациямЗайма.ВидОперации КАК ВидОперации,
	               |	ЛБ_СостояниеОбъектаЗалога.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОборотыПоОперациямЗайма КАК ЛБ_ОборотыПоОперациямЗайма
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_СостояниеОбъектаЗалога КАК ЛБ_СостояниеОбъектаЗалога
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(&Дата, ) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	               |			ПО ЛБ_СостояниеОбъектаЗалога.ОбъектЗалога = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога
	               |				И (ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Период <= ЛБ_СостояниеОбъектаЗалога.Период)
	               |				И ЛБ_СостояниеОбъектаЗалога.ЗалоговыйБилет = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет
	               |		ПО ЛБ_ОборотыПоОперациямЗайма.Регистратор = ЛБ_СостояниеОбъектаЗалога.Регистратор
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, ) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
	               |		ПО ЛБ_ОборотыПоОперациямЗайма.ЗалоговыйБилет.Ломбард = ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард
	               |			И ЛБ_ОборотыПоОперациямЗайма.ЗалоговыйБилет.Ломбард = ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард
	               |			И (ЛБ_ОтделенияЛомбардовСрезПоследних.Период <= ЛБ_ОборотыПоОперациямЗайма.Период)
	               |ГДЕ
	               |	(ЛБ_ОборотыПоОперациямЗайма.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ИзъятиеОбъектовЗалога)
	               |			ИЛИ ЛБ_ОборотыПоОперациямЗайма.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога))
	               |	И ЛБ_ОборотыПоОперациямЗайма.Период <= &Дата
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период"; 
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();
	ТаблицаДвижений.Колонки.Добавить("ДатаИзъят"); 
	ТаблицаДвижений.Колонки.Добавить("ДатаВозвращен");
	ТаблицаДвижений.ЗаполнитьЗначения(Дата(1,1,1), "ДатаИзъят, ДатаВозвращен"); 
	
	ТаблицаОбъектов = ТаблицаДвижений.Скопировать(); 
	ТаблицаОбъектов.Свернуть("ОбъектЗалога");   
	
	СписокОбъектов = Новый СписокЗначений; 
	УдСтроки = Новый СписокЗначений;
	Для каждого стрО из ТаблицаОбъектов Цикл 
		Отбор = новый структура;
		Отбор.Вставить("ОбъектЗалога", СтрО.ОбъектЗалога);   
		
		Строки = ТаблицаДвижений.НайтиСтроки(Отбор); 
		Для сч = 0 по Строки.Количество()-1 Цикл 
			Стр = Строки.Получить(сч);           
			Если Стр.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ИзъятиеОбъектовЗалога Тогда
				Если стр.Период < Дата1 Тогда
					УдСтроки.Добавить(Стр);
				Иначе	
					Если НЕ СтатусОбъектаЗалога = 1 Тогда 
						Стр.ДатаИзъят = Стр.Период;
						Если СписокОбъектов.НайтиПоЗначению(СтрО.ОбъектЗалога) = неопределено Тогда 
					        СписокОбъектов.Добавить(СтрО.ОбъектЗалога);
						КонецЕсли;
					Иначе
						УдСтроки.Добавить(Стр);
					КонецЕсли;	
				КонецЕсли;	
			Иначе     
				Если стр.Период < Дата1 Тогда
					УдСтроки.Добавить(Стр);
				Иначе	 
					Если НЕ СтатусОбъектаЗалога = 0 Тогда
						Стр.ДатаВозвращен = Стр.Период;
						Если НЕ сч = 0 Тогда
						    Стр.ДатаИзъят = Строки.Получить(сч-1).Период;
						КонецЕсли; 
						Если СписокОбъектов.НайтиПоЗначению(СтрО.ОбъектЗалога) = неопределено Тогда 
					        СписокОбъектов.Добавить(СтрО.ОбъектЗалога);
						КонецЕсли;
					Иначе  
						УдСтроки.Добавить(Стр);
					КонецЕсли;	
				КонецЕсли;   
			КонецЕсли;	
		КонецЦикла;	
	Конеццикла;	 
	
	Для каждого Эл из УдСтроки Цикл
		ТаблицаДвижений.Удалить(Эл.Значение);
	Конеццикла;	

	Запрос.УстановитьПараметр("ОбъектыЗалога", СписокОбъектов); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(&Дата, ОбъектЗалога В (&ОбъектыЗалога)) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&Дата, ) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних
	               |		ПО ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ЗалоговыйБилет = ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.Период УБЫВ";
	ТаблицаОбъектовЗалога = Запрос.Выполнить().Выгрузить();   
	
	ДокументРезультат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Изъятые_Возвращенные_Объекты_Залога";
	
	Макет 			 = Отчет.РеквизитМакет;
	ОбластьШапка  = Макет.ПолучитьОбласть("ШапкаТаблицы"); 
	ОбластьСтрока  = Макет.ПолучитьОбласть("СтрокаТаблицы");  
			
	ОбластьШапка.Параметры.Статус = Элементы.СтатусОбъектаЗалога.СписокВыбора.НайтиПоЗначению(СтатусОбъектаЗалога).Представление; 
	Если Дата1 = Дата(1,1,1) Тогда 
	    ПериодОтчета = "по " + Формат(Дата2, "ДФ=dd.MM.yyyy");
	Иначе
		ПериодОтчета = "с " + Формат(Дата1, "ДФ=dd.MM.yyyy") + " по " + Формат(Дата2, "ДФ=dd.MM.yyyy");
	КонецЕсли;	
	ОбластьШапка.Параметры.Период = ПериодОтчета; 
	ДокументРезультат.Вывести(ОбластьШапка); 
	
	Ном = 0;
	Для каждого стрД Из ТаблицаДвижений Цикл 
							
		Ном = Ном + 1;
		ОбластьСтрока.Параметры.Ном = Ном;  
		ОбластьСтрока.Параметры.Отделение = СтрД.Отделение; 
		НомерЛомбарда = ?(ПустаяСтрока(СтрД.ЗалоговыйБилет.Ломбард.НомерЛомбарда), СтрД.ЗалоговыйБилет.Ломбард, СтрД.ЗалоговыйБилет.Ломбард.НомерЛомбарда);
		ОбластьСтрока.Параметры.Ломбард = НомерЛомбарда;
		ОбластьСтрока.Параметры.ДатаЗБ = Формат(СтрД.ЗалоговыйБилет.Дата, "ДФ=dd.MM.yyyy");   
		ОбластьСтрока.Параметры.НомерЗБ = СтрД.ЗалоговыйБилет.НомерЗалоговогоБилета;
		ОбластьСтрока.Параметры.Заемщик = СокрЛП(СтрД.ЗалоговыйБилет.Фамилия) + " " + СокрЛП(стрД.ЗалоговыйБилет.Имя) + ?(НЕ ПустаяСтрока(СтрД.ЗалоговыйБилет.Отчество), " " + СокрЛП(стрД.ЗалоговыйБилет.Отчество), ""); 
		ОбластьСтрока.Параметры.Изделие = СокрЛП(СтрД.ВидИзделия) + " " + СокрЛП(СтрД.Проба) + " " + СокрЛП(СтрД.Категория); 
		ОбластьСтрока.Параметры.ДатаИзъят = СтрД.ДатаИзъят; 
		ОбластьСтрока.Параметры.ДатаВозвращен = СтрД.ДатаВозвращен;
		
		Отбор = Новый Структура;
		Отбор.Вставить("ЗалоговыйБилет", СтрД.ЗалоговыйБилет); 
		Отбор.Вставить("ОбъектЗалога", СтрД.ОбъектЗалога);
		Строки = ТаблицаОбъектовЗалога.НайтиСтроки(Отбор); 
		Если НЕ Строки.Количество() = 0 Тогда   
			Стр = Строки.Получить(0);

			ОбластьСтрока.Параметры.СтатусИзделия = Строка(Стр.СтатусОбъектаЗалога);
		    ОбластьСтрока.Параметры.СтатусЗБ = Строка(Стр.СтатусЗалоговогоБилета); 
		КонецЕсли;
			
		СтруктураР = Новый Структура;
		СтруктураР.Вставить("ЗалоговыйБилет", СтрД.ЗалоговыйБилет);   
		СтруктураР.Вставить("Клиент", СтрД.ЗалоговыйБилет.Залогодатель);
		ОбластьСтрока.Параметры.СтруктураР = СтруктураР;
		ДокументРезультат.Вывести(ОбластьСтрока);
	Конеццикла;	
КонецПроцедуры

&НаКлиенте
Процедура Отбор(Команда)
	Если Элементы.ГруппаБыстрыеОтборы.Видимость Тогда 
		Элементы.ГруппаБыстрыеОтборы.Видимость = Ложь;
		Элементы.Отбор.ЦветФона = WebЦвета.Белый;
	Иначе 
		Элементы.ГруппаБыстрыеОтборы.Видимость = Истина;
		Элементы.Отбор.ЦветФона = WebЦвета.БледноЗеленый;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДокументРезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
	    СтандартнаяОбработка = ложь;  
		ПараметрыФормы = Новый структура;
		ПараметрыФормы.Вставить("ЗалоговыйБилет", Расшифровка.ЗалоговыйБилет); 
		ПараметрыФормы.Вставить("Клиент", Расшифровка.Клиент);
		ОткрытьФорму("Отчет.ЛБ_ИсторияЗалоговогоБилета.Форма.ФормаОтчета", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастроитьИнтервал(Команда)
	ДиалогРедактирования = Новый ДиалогРедактированияСтандартногоПериода;
	
	Если ДиалогРедактирования.Редактировать() Тогда
		Отчет.ДатаНач	= ДиалогРедактирования.Период.ДатаНачала;
		Отчет.ДатаКон 	= ДиалогРедактирования.Период.ДатаОкончания;
	КонецЕсли;
КонецПроцедуры



