
// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Т-13
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	//КомандаПечати.Идентификатор = "ПФ_MXL_УнифицированнаяФормаТ13";
	//КомандаПечати.Представление = НСтр("ru = 'Т-13'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//КомандаПечати.ДополнительныеПараметры.Вставить("ПутьКПодписантам", "ФизическиеЛица.ФизическоеЛицо");
	//	
	//// 0504421
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	//КомандаПечати.Идентификатор = "УнифицированнаяФорма0504421";
	//КомандаПечати.Представление = НСтр("ru = 'Табель учета рабочего времени (0504421) до 2015 года'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//КомандаПечати.ФункциональныеОпции = "РаботаВБюджетномУчреждении";
	//КомандаПечати.Порядок = 40;
	//
	//// 0504421 с 2015 года
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	//КомандаПечати.Идентификатор = "УнифицированнаяФорма0504421с2015";
	//КомандаПечати.Представление = НСтр("ru = 'Табель учета рабочего времени (0504421)'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//КомандаПечати.ФункциональныеОпции = "РаботаВБюджетномУчреждении";
	//КомандаПечати.Порядок = 30;
	//КомандаПечати.ДополнительныеПараметры.Вставить("ПутьКПодписантам", "ФизическиеЛица.ФизическоеЛицо");
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	//Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,
	//	"ПФ_MXL_УнифицированнаяФормаТ13") Тогда
	//	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
	//		"ПФ_MXL_УнифицированнаяФормаТ13",
	//		"Табель учета рабочего времени (Т-13)",
	//		СформироватьПечатнуюФормуТ13(МассивОбъектов,
	//			ОбъектыПечати));
	//КонецЕсли;
	//
	//Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,
	//	"УнифицированнаяФорма0504421") Тогда
	//	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
	//		"УнифицированнаяФорма0504421",
	//		"Табель учета рабочего времени (0504421)",
	//		ПечатнаяФорма0504421(МассивОбъектов,
	//			ОбъектыПечати,
	//			"УнифицированнаяФорма0504421"));
	//КонецЕсли;
	//
	//Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,
	//	"УнифицированнаяФорма0504421с2015") Тогда
	//	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
	//		"УнифицированнаяФорма0504421с2015",
	//		"Табель учета рабочего времени (0504421) с 2015",
	//		ПечатнаяФорма0504421(МассивОбъектов,
	//			ОбъектыПечати,
	//			"УнифицированнаяФорма0504421с2015"));
	//КонецЕсли;
	
КонецПроцедуры

Функция СформироватьЗапросДляПечати(МассивОбъектов)
	
	
КонецФункции

Функция СформироватьПечатнуюФормуТ13(МассивОбъектов, ОбъектыПечати)
	
		
КонецФункции

