
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	стрОшибка = "";
	
 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Табель.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЛБ_ТабельУчетаРабочегоВремениНов КАК Табель
	               |ГДЕ
	               |	Табель.Ссылка <> &Ссылка
	               |	И Табель.Проведен = ИСТИНА
	               |	И Табель.Отделение = &Отделение
	               |	И Табель.ДатаНачалаПериода = &ДатаНачалаПериода
	               |	И Табель.ДатаОкончанияПериода = &ДатаОкончанияПериода";
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации); 
	Запрос.УстановитьПараметр("Ссылка", Ссылка); 
	Запрос.УстановитьПараметр("Отделение", Отделение); 
	Запрос.УстановитьПараметр("ДатаНачалаПериода", ДатаНачалаПериода); 
	Запрос.УстановитьПараметр("ДатаОкончанияПериода", ДатаОкончанияПериода); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда   

		стрОшибка = "Уже есть проведенный табель за выбранный период"; 
		Сообщить(стрОшибка);  
	КонецЕсли;
	   
	
	Если стрОшибка <> "" Тогда
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры
