
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард Тогда
		
		Список.ТекстЗапроса = "ВЫБРАТЬ
		|	СправочникЛБ_Тара.Ссылка КАК Ссылка,
		|	СправочникЛБ_Тара.ПометкаУдаления КАК ПометкаУдаления,
		|	СправочникЛБ_Тара.Код КАК Код,
		|	СправочникЛБ_Тара.Наименование КАК Наименование,
		|	СправочникЛБ_Тара.Отделение КАК Отделение,
		|	СправочникЛБ_Тара.Ломбард КАК Ломбард,
		|	СправочникЛБ_Тара.ВесТары КАК ВесТары,
		|	СправочникЛБ_Тара.ДейстующаяТара КАК ДейстующаяТара,
		|	СправочникЛБ_Тара.ДатаЗаписи КАК ДатаЗаписи,
		|	СправочникЛБ_Тара.Ответственный КАК Ответственный,
		|	СправочникЛБ_Тара.ТолькоПросмотр КАК ТолькоПросмотр,
		|	СправочникЛБ_Тара.Предопределенный КАК Предопределенный,
		|	СправочникЛБ_Тара.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
		|ИЗ
		|	Справочник.ЛБ_Тара КАК СправочникЛБ_Тара
		|ГДЕ
		|	СправочникЛБ_Тара.Ломбард = &Ломбард";
		
		Список.Параметры.УстановитьЗначениеПараметра("Ломбард", ПараметрыСеанса.ТекущийЛомбард);
	Иначе
		Список.ТекстЗапроса = "ВЫБРАТЬ
		|	СправочникЛБ_Тара.Ссылка КАК Ссылка,
		|	СправочникЛБ_Тара.ПометкаУдаления КАК ПометкаУдаления,
		|	СправочникЛБ_Тара.Код КАК Код,
		|	СправочникЛБ_Тара.Наименование КАК Наименование,
		|	СправочникЛБ_Тара.Отделение КАК Отделение,
		|	СправочникЛБ_Тара.Ломбард КАК Ломбард,
		|	СправочникЛБ_Тара.ВесТары КАК ВесТары,
		|	СправочникЛБ_Тара.ДейстующаяТара КАК ДейстующаяТара,
		|	СправочникЛБ_Тара.ДатаЗаписи КАК ДатаЗаписи,
		|	СправочникЛБ_Тара.Ответственный КАК Ответственный,
		|	СправочникЛБ_Тара.ТолькоПросмотр КАК ТолькоПросмотр,
		|	СправочникЛБ_Тара.Предопределенный КАК Предопределенный,
		|	СправочникЛБ_Тара.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
		|ИЗ
		|	Справочник.ЛБ_Тара КАК СправочникЛБ_Тара";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Копирование Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры
