
&НаКлиенте
Процедура Ок(Команда)
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ВидВремени",   	ВидВремени);
	СтруктураВозврата.Вставить("Часов", 		Часов);  
	СтруктураВозврата.Вставить("Территория", 	Территория); 
	СтруктураВозврата.Вставить("НомерДня", 		НомерДня);
	СтруктураВозврата.Вставить("пересчитыватьИтог", 		Истина);



	ЭтаФорма.Закрыть(СтруктураВозврата);

КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть(Неопределено);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВидВремени 		= Параметры.ВидВремени; 
	Часов 			= Параметры.Часов;
	НомерДня 		= Параметры.НомерДня;  
	Территория 		= Параметры.Территория; 
	Сотрудник 		= Параметры.Сотрудник; 
	ДатаРаботы     	= Параметры.ДатаРаботы;
	Ломбард     	= Параметры.Ломбард;
	
	Если НЕ ЗначениеЗаполнено(ВидВремени) Тогда
		ВидВремени = Справочники.ЛБ_ВидыИспользованияРабочегоВремени.Явка;
	КонецЕсли;
	
	Если Параметры.ПолучитьЧасыИзГрафика Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_ГрафикРаботыЛомбардаПостоянныйСрезПоследних.РабочиеМинуты КАК РабочиеМинуты
		               |ИЗ
		               |	РегистрСведений.ЛБ_ГрафикРаботыЛомбардаПостоянный.СрезПоследних КАК ЛБ_ГрафикРаботыЛомбардаПостоянныйСрезПоследних
		               |ГДЕ
		               |	ЛБ_ГрафикРаботыЛомбардаПостоянныйСрезПоследних.Ломбард = &Ломбард
		               |	И ЛБ_ГрафикРаботыЛомбардаПостоянныйСрезПоследних.НомерДня = &НомерДня";
		Запрос.УстановитьПараметр("Ломбард", Ломбард);
		Запрос.УстановитьПараметр("НомерДня", ДеньНедели(ДатаРаботы));
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Часов = Выборка.РабочиеМинуты/60;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидВремениПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры
	
	
Процедура УстановитьВидимость()
	Если ЗначениеЗаполнено(ВидВремени) Тогда		
		Если ВидВремени.Целосменное Тогда
			Часов = 0;
			Элементы.Часов.Доступность = Ложь;
			Элементы.Территория.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры
