
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПечатьАнкеты(); 
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Функция ПолучитьМакетНаСервере()
    ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    Макет = ОбработкаОбъект.ЭтотОбъект.ПолучитьМакет("Анкета"); 
    Возврат Макет;
КонецФункции 

&НаКлиенте
Процедура ПечатьАнкеты() 
	//Если ЗначениеЗаполнено(Залогодатель) Тогда 		
	   //ИмяВременногоФайла = СохранитьФайлНаСервере();
	   //Если ИмяВременногоФайла = неопределено Тогда 
	   //    Возврат;
	   //КонецЕсли;	   
	   
	   ПараметрыПечати = Новый Структура;
	    
	   //ПараметрыПечати.Вставить("ФИО", СокрЛП(Залогодатель));
	   //ПараметрыПечати.Вставить("ДатаМестоРождения", Формат(ДатаРождения,"ДЛФ=DD") + ", " + СокрЛП(МестоРождения));
	   //ПараметрыПечати.Вставить("Гражданство", СокрЛП(Гражданство)); 
	   //ПараметрыПечати.Вставить("ДУЛ", ПолучитьДУЛ());
		//ПараметрыПечати.Вставить("ПодписантОрганизации",СокрЛП(ПодписантОрганизации));
		//ПараметрыПечати.Вставить("ПодписантОрганизацииРП",СокрЛП(ПодписантОрганизацииРП));
		//ПараметрыПечати.Вставить("ОснованиеДействияПодписантаОрганизации", СокрЛП(ОснованиеДействияПодписантаОрганизации));
		//ПараметрыПечати.Вставить("ЮридическийАдресОрганизации", СокрЛП(ЮридическийАдресОрганизации));
		//ПараметрыПечати.Вставить("ПочтовыйАдресОрганизации", СокрЛП(ПочтовыйАдресОрганизации));
		//ПараметрыПечати.Вставить("ИННОрганизации", СокрЛП(ИННОрганизации));
		//ПараметрыПечати.Вставить("КППОрганизации", СокрЛП(КППОрганизации));
		//ПараметрыПечати.Вставить("ОсновнойРасчетныйСчетОрганизации",СокрЛП(ОсновнойРасчетныйСчетОрганизации));
		//ПараметрыПечати.Вставить("ТелефоныОрганизации", СокрЛП(ТелефоныОрганизации));
		//ПараметрыПечати.Вставить("ОГРНОрганизации", СокрЛП(ОГРНОрганизации));
		//ПараметрыПечати.Вставить("ОсновнойОКВЭДОрганизации", СокрЛП(ОсновнойОКВЭДОрганизации));
		//ПараметрыПечати.Вставить("ЭлПочтаОрганизации", СокрЛП(ЭлПочтаОрганизации));
		//ПараметрыПечати.Вставить("СайтОрганизации", СокрЛП(СайтОрганизации));
		//	
		//ПараметрыПечати.Вставить("НаименованиеКонтрагента",СокрЛП(НаименованиеКонтрагента));
		//ПараметрыПечати.Вставить("ПодписантКонтрагента",СокрЛП(ПодписантКонтрагента));
		//ПараметрыПечати.Вставить("ПодписантКонтрагентаРП",СокрЛП(ПодписантКонтрагентаРП));
		//ПараметрыПечати.Вставить("ОснованиеДействияПодписантаКонтрагента", СокрЛП(ОснованиеДействияПодписантаКонтрагента));
		//ПараметрыПечати.Вставить("ЮридическийАдресКонтрагента", СокрЛП(ЮридическийАдресКонтрагента));
		//ПараметрыПечати.Вставить("ПочтовыйАдресКонтрагента", СокрЛП(ПочтовыйАдресКонтрагента));
		//ПараметрыПечати.Вставить("ИННКонтрагента", СокрЛП(ИННКонтрагента));
		//ПараметрыПечати.Вставить("КППКонтрагента", СокрЛП(КППКонтрагента));
		//ПараметрыПечати.Вставить("ОсновнойРасчетныйСчетКонтрагента",СокрЛП(ОсновнойРасчетныйСчетКонтрагента));
		//ПараметрыПечати.Вставить("ТелефоныКонтрагента", СокрЛП(ТелефоныКонтрагента));
		//ПараметрыПечати.Вставить("ОГРНКонтрагента", СокрЛП(ОГРНКонтрагента));
		//ПараметрыПечати.Вставить("ОсновнойОКВЭДКонтрагента", СокрЛП(ОсновнойОКВЭДКонтрагента));
		//ПараметрыПечати.Вставить("ЭлПочтаКонтрагента", СокрЛП(ЭлПочтаКонтрагента));
		//ПараметрыПечати.Вставить("СайтКонтрагента", СокрЛП(СайтКонтрагента));
		//ПараметрыПечати.Вставить("КонецГода", Формат(КонецГода(ДоговорКонтрагента.Дата), "ДЛФ=DD"));
		//ПараметрыПечати.Вставить("ПаспортныеДанныеФЛ", СокрЛП(ДокументУдостоверяющийЛичность));
		//                            
		
     	Анкета = ПолучитьМакетНаСервере();
    	// Получить объект из макета.
        MSWord = Анкета.Получить(); 
	
		 
		Документ = MSWord.Application.Documents(1);
		Документ.Activate();
		 
		//Для Каждого КлючИЗначение Из ПараметрыПечати Цикл                               
		// 
		//	//Получить объект, который будем использовать для поиска и замены.
		//	Замена = Документ.Content.Find;
		//	Замена.Execute("[" + КлючИЗначение.Ключ + "]", Ложь, Истина, Ложь,,,Истина,,Ложь, СокрЛП(КлючИЗначение.Значение),2);
		//КонецЦикла;
		 		 
		MSWord.Application.Visible = Истина;
		MSWord.Activate();
 
		//Ворд = Новый COMОбъект("Word.Application");
		//ДокументВорд = Ворд.Documents.Open(ИмяВременногоФайла); 
		//
		////ДокументВорд = Word.Documents.ADD(ПолныйПутьКФайлу);
		//ДокументВорд.Activate();

		//Для Каждого КлючИЗначение Из ПараметрыПечати Цикл
		//	ИмяПерем = "[" + КлючИЗначение.Ключ + "]";
		//	ДокументВорд.Variables(ИмяПерем).Value = СокрЛП(СокрЛП(КлючИЗначение.Значение));

		//	//Замена = ДокументВорд.Content.Find;
		//	//Замена.Execute("[" + КлючИЗначение.Ключ + "]", Ложь, Истина, Ложь,,,Истина,,Ложь, СокрЛП(КлючИЗначение.Значение),2);
		//	//ЗаменаК = ДокументВорд.Sections(1).Footers(1).Range().Find;
		//	//ЗаменаК.Execute("[" + КлючИЗначение.Ключ + "]", Ложь, Истина, Ложь,,,Истина,,Ложь, СокрЛП(КлючИЗначение.Значение),2);
		//КонецЦикла;    
		//ДокументВорд.SaveAs(ИмяВременногоФайла);
		//ДокументВорд.Close(Истина);  
		//
		//// открываем файл
		//ЗапуститьПриложение(ИмяВременногоФайла);
	//Иначе
	//	Сообщить("Сохраните карточку клиента!");
	//КонецЕсли;	
КонецПроцедуры	
