&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТаблицаЕдМеталлы = ЛБ_ОбщийМодуль.ВыборЕдиницИзмеренияРасчетаЦенМеталлов();
	Элементы.ЛБ_ОсновнаяЕдиницаМеталлы.СписокВыбора.Очистить();
	Для каждого Стр Из ТаблицаЕдМеталлы Цикл
		Элементы.ЛБ_ОсновнаяЕдиницаМеталлы.СписокВыбора.Добавить(Стр.ЕдиницаИзмерения);
	КонецЦикла;

	ТаблицаЕдКамни = ЛБ_ОбщийМодуль.ВыборЕдиницИзмеренияРасчетаЦенКамней();
	Элементы.ЛБ_ОсновнаяЕдиницаКамни.СписокВыбора.Очистить();
	Для каждого Стр Из ТаблицаЕдКамни Цикл
		Элементы.ЛБ_ОсновнаяЕдиницаКамни.СписокВыбора.Добавить(Стр.ЕдиницаИзмерения);
	КонецЦикла;	
	//+МАН 29.07.25 Заполняем списки выбора для последующего подтягивания в приказы. Заявка 2792
	ЗаполнитьСпискиВыбораСотрудниковПараметрыПечати();
	//-МАН
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НаборКонстант.ЛБ_ОграничениеОценкиВерхняяГраница Тогда
		Если НаборКонстант.ЛБ_ОценкаВерхняяГраница = 0 Тогда
			Сообщить("Не выбрана верхняя граница оценки залога!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;	   
	//Если НаборКонстант.ЛБ_ОграничениеОценкиВключениеЗБ Тогда
	//	Если НаборКонстант.ЛБ_ОценкаВключениеЗБ = 0 Тогда
	//		Сообщить("Не выбрана оценки залога для ограничения включения в ЗБ!");  
	//		Отказ = Истина;
	//	КонецЕсли; 
	//	Если НЕ ЗначениеЗаполнено(НаборКонстант.ЛБ_СообщениеВключениеЗБ) Тогда
	//		Сообщить("Не заполнено сообщение пользователю для ограничения включения в ЗБ!");
	//		Отказ = Истина;
	//	КонецЕсли;
	//КонецЕсли;	 
	Если НаборКонстант.ЛБ_ЕстьЛьготыСотрудникам Тогда  
		Если НаборКонстант.ЛБ_ОграничениеСуммыЗаймаСотрудники = 0 Тогда
            Сообщить("Не запонено ограничение по использованию льготной ставки для сотрудников!");  
			Отказ = Истина;
		КонецЕсли; 
     КонецЕсли;
КонецПроцедуры

//+МАН 29.07.25 Заполняем списки выбора для последующего подтягивания в приказы. Заявка 2792
&НаСервере
Процедура ЗаполнитьСпискиВыбораСотрудниковПараметрыПечати();
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Элемент",, "Элемент");
	ТЗ.Колонки.Добавить("Должность",, "Должность");
	
	НоваяСтр = ТЗ.Добавить();
	НоваяСтр.Элемент = "ЛБ_НачальникОРБ";
	НоваяСтр.Должность = "Начальник отдела развития бизнеса";

	НоваяСтр = ТЗ.Добавить();
	НоваяСтр.Элемент = "ЛБ_ОтветственноеЛицоОРБ";
	НоваяСтр.Должность = "Маркетолог-аналитик";
	
	НоваяСтр = ТЗ.Добавить();
	НоваяСтр.Элемент = "ЛБ_НачальникОДО";
	НоваяСтр.Должность = "Начальник отдела документационного обеспечения";

	НоваяСтр = ТЗ.Добавить();
	НоваяСтр.Элемент = "ЛБ_ОтветственноеЛицоРеклама";
	НоваяСтр.Должность = "Менеджер по рекламе";

	НоваяСтр = ТЗ.Добавить();
	НоваяСтр.Элемент = "ЛБ_Подписант";
	НоваяСтр.Должность = "Директор";

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.ЛБ_КадроваяИсторияСотрудников.СрезПоследних КАК ЛБ_КадроваяИсторияСотрудниковСрезПоследних
		|ГДЕ
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность = &Должность
		|	И НЕ ЛБ_КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыКадровыхСобытий.Увольнение)";
	
	Для каждого Стр Из ТЗ Цикл
		
		Если Стр.Элемент = "ЛБ_Подписант" Тогда
			Элементы[Стр.Элемент].СписокВыбора.Очистить();
			Элементы[Стр.Элемент].СписокВыбора.Добавить(Справочники.ЛБ_Сотрудники.НайтиПоКоду("ЛКЗК-02501"));
			Элементы[Стр.Элемент].СписокВыбора.Добавить(Справочники.ЛБ_Сотрудники.НайтиПоКоду("000001599"));
		Иначе
			Элементы[Стр.Элемент].СписокВыбора.Очистить();
			
			Должность = Справочники.Должности.НайтиПоНаименованию(Стр.Должность, Истина);
			
			Запрос.УстановитьПараметр("Должность", Должность);
			
			Результат = Запрос.Выполнить().Выбрать();
			
			Пока Результат.Следующий() Цикл
				Элементы[Стр.Элемент].СписокВыбора.Добавить(Результат.Сотрудник);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
//-МАН
