// Процедура - обработчик события "ОбработкаУдаленияПроведения".
//
Процедура ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	ЛБ_ОбщийМодуль.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ЛБ_Доверенности.Записывать = Истина; 
	Движение = Движения.ЛБ_Доверенности.Добавить();
	Движение.Период = Дата;    
	Движение.ВидОперации = ЭтотОбъект.ВидОперации;  
	Движение.Ломбард = ЭтотОбъект.Ломбард;
	Движение.Ответственный = ЭтотОбъект.Ответственный;
	Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Оформление Тогда
		Движение.Доверенность = ЭтотОбъект.Ссылка;
		Движение.Клиент = ЭтотОбъект.Клиент;
		Движение.ЗалоговыйБилет = ЭтотОбъект.ЗалоговыйБилет;
		Движение.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.ДоверенностьОформлена;
	ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Наследство Тогда
		Движение.Доверенность = ЭтотОбъект.Ссылка;
		Движение.Клиент = ЭтотОбъект.Клиент;
		Движение.ЗалоговыйБилет = ЭтотОбъект.ЗалоговыйБилет;
		Движение.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.ДоверенностьОформлена;
	ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Отзыв Тогда
		Движение.Доверенность = ЭтотОбъект.ОтзываемаяДоверенность;
		Движение.Клиент = ЭтотОбъект.ОтзываемаяДоверенность.Клиент;
		Движение.ЗалоговыйБилет = ЭтотОбъект.ОтзываемаяДоверенность.ЗалоговыйБилет;			
	    Движение.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.ДоверенностьОтозвана;
	Иначе
		Движение.Доверенность = ЭтотОбъект.ОтзываемаяДоверенность;
		Движение.Клиент = ЭтотОбъект.ОтзываемаяДоверенность.Клиент;
		Движение.ЗалоговыйБилет = ЭтотОбъект.ОтзываемаяДоверенность.ЗалоговыйБилет;			
	    Движение.СтатусДоверенности = Перечисления.ЛБ_СтатусыДоверенностей.ДоверенностьОшибка;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если НЕ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЛБ_ОперацияПоЗалогу") Тогда 
		Возврат; 		
	КонецЕсли;     	
	ЗалоговыйБилет = ?(ДанныеЗаполнения.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов, ДанныеЗаполнения.ПредыдущаяОперация.Ссылка, ДанныеЗаполнения.Ссылка); 
	СтатусЗБ = ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(ТекущаяДата(), ЗалоговыйБилет);
	Если СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт тогда
		Возврат;
	КонецЕсли;	
	ЭтотОбъект.ЗалоговыйБилет = ЗалоговыйБилет;
	ЭтотОбъект.Ломбард = ЭтотОбъект.ЗалоговыйБилет.Ломбард;
	ЭтотОбъект.Клиент = ?(ДанныеЗаполнения.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов, ДанныеЗаполнения.ПредыдущаяОперация.Залогодатель, ДанныеЗаполнения.Залогодатель);  
	ЭтотОбъект.ДокументКлиента = ?(ДанныеЗаполнения.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов, ДанныеЗаполнения.ПредыдущаяОперация.ДокументЗалогодателя, ДанныеЗаполнения.ДокументЗалогодателя); 
КонецПроцедуры


