#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	//ЗарплатаКадры.ЗаполнитьНаборыПоОрганизацииИСотрудникам(ЭтотОбъект, Таблица, "Организация", "ДанныеОВремени.Сотрудник");
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Если ПериодВводаДанныхОВремени = Перечисления.ПериодыВводаДанныхОВремени.ПрошлыйПериод Тогда
	//	ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ДатаНачалаПериода, "Объект.ДатаНачалаПериода", Отказ, НСтр("ru='Начало периода'"), , , Ложь);
	//КонецЕсли;
	//
	//ДопустимоеКоличествоНесоответствийПланФакт = 5;
	//
	//СтрокиПоСотрудникам = СтрокиПоСотрудникам();
	//
	//МенеджерВТ = Новый МенеджерВременныхТаблиц;
	//	
	//ТаблицаДанныхОВремени = ТаблицаДанныхОВремени();
	//
	//УчетРабочегоВремениРасширенный.СоздатьВТДанныеОВремени(МенеджерВТ, ТаблицаДанныхОВремени);
	//
	//ОписанияОшибокВводаВремени = Новый Массив;

	//УчетРабочегоВремениРасширенный.ПроверитьСоответствиеФактическогоВремениПлановому(МенеджерВТ, ОписанияОшибокВводаВремени, ПериодРегистрации, Отказ);
	//
	//Ошибки = Новый Соответствие;
	//
	//Для Каждого ОписаниеОшибки Из ОписанияОшибокВводаВремени Цикл
	//	СтрокиСотрудника = СтрокиПоСотрудникам.Получить(ОписаниеОшибки.Сотрудник);
	//	
	//	Если ЗначениеЗаполнено(ОписаниеОшибки.ВидВремени) Тогда
	//		НомерСтроки = 0;
	//		Для Каждого СтрокаДанныхОВремени Из СтрокиСотрудника Цикл
	//			Если СтрокаДанныхОВремени["ВидВремени" + День(ОписаниеОшибки.Дата)] = ОписаниеОшибки.ВидВремени Тогда
	//				НомерСтроки = СтрокаДанныхОВремени.НомерСтроки;
	//			КонецЕсли;	
	//		КонецЦикла;	
	//		
	//		Если НомерСтроки = 0 Тогда
	//			Поле = "";
	//		Иначе
	//			Поле = "Объект.ДанныеОВремени[" + Формат(НомерСтроки - 1, "ЧГ=") + "].Время" + День(ОписаниеОшибки.Дата) + "Представление";
	//		КонецЕсли;
	//		
	//		УчетРабочегоВремениРасширенный.ДобавитьОшибкуПоСотруднику(Ошибки, ОписаниеОшибки.Сотрудник, ОписаниеОшибки.ТекстОшибки, Поле, ОписаниеОшибки.Документ);	
	//	КонецЕсли;	
	//	
	//КонецЦикла;	
	//
	//Для Каждого ОшибкиПоСотруднику Из Ошибки Цикл
	//	Если ОшибкиПоСотруднику.Значение.Количество() > ДопустимоеКоличествоНесоответствийПланФакт Тогда
	//		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'По сотруднику %1 больше 5-ти несоответствий плановых видов времени фактическим.
	//                                                                                    |Рекомендуется ввести индивидуальный график.'"),
	//																			  ОшибкиПоСотруднику.Ключ);																			  													
	//																					
	//		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
	//	КонецЕсли;	
	//	
	//	ВывестиОшибкиНесоответствияПланФакт = Истина;
	//КонецЦикла;	
	//
	//ОписанияОшибокВводаВремени = Новый Массив;

	//УчетРабочегоВремениРасширенный.ПроверитьРегистрациюЦелосменногоВремени(МенеджерВТ, ОписанияОшибокВводаВремени, Отказ);
	//
	//УчетРабочегоВремениРасширенный.ПроверитьЗаполненияЧасов(МенеджерВТ, ОписанияОшибокВводаВремени, Отказ);
	//		
	//Для Каждого ОписаниеОшибки Из ОписанияОшибокВводаВремени Цикл
	//	СтрокиСотрудника = СтрокиПоСотрудникам.Получить(ОписаниеОшибки.Сотрудник);
	//	
	//	Если ЗначениеЗаполнено(ОписаниеОшибки.ВидВремени) Тогда
	//		НомерСтроки = 0;
	//		Для Каждого СтрокаДанныхОВремени Из СтрокиСотрудника Цикл
	//			Если СтрокаДанныхОВремени["ВидВремени" + День(ОписаниеОшибки.Дата)] = ОписаниеОшибки.ВидВремени Тогда
	//				НомерСтроки = СтрокаДанныхОВремени.НомерСтроки;
	//			КонецЕсли;	
	//		КонецЦикла;	
	//		
	//		Если НомерСтроки = 0 Тогда
	//			Поле = "";
	//		Иначе
	//			Поле = "Объект.ДанныеОВремени[" + Формат(НомерСтроки - 1, "ЧГ=") + "].Время" + День(ОписаниеОшибки.Дата) + "Представление";
	//		КонецЕсли;
	//		
	//		УчетРабочегоВремениРасширенный.ДобавитьОшибкуПоСотруднику(Ошибки, ОписаниеОшибки.Сотрудник, ОписаниеОшибки.ТекстОшибки, Поле, ОписаниеОшибки.Документ);	
	//	КонецЕсли;	
	//	
	//КонецЦикла;	
	//
	//ОписанияОшибокВводаВремени = Новый Массив;
	//
	//УчетРабочегоВремениРасширенный.ПроверитьСоответствиеРегистрируемыхЧасовДлинеСуток(МенеджерВТ, ОписанияОшибокВводаВремени, Отказ);
	//
	//Для Каждого ОписаниеОшибки Из ОписанияОшибокВводаВремени Цикл				
	//	СтрокиСотрудника = СтрокиПоСотрудникам.Получить(ОписаниеОшибки.Сотрудник);
	//	
	//	НомерСтроки = СтрокиСотрудника[0].НомерСтроки;
	//	
	//	Поле = "Объект.ДанныеОВремени[" + Формат(НомерСтроки - 1, "ЧГ=") + "].Время" + День(ОписаниеОшибки.Дата) + "Представление";

	//	УчетРабочегоВремениРасширенный.ДобавитьОшибкуПоСотруднику(Ошибки, ОписаниеОшибки.Сотрудник, ОписаниеОшибки.ТекстОшибки, Поле, ОписаниеОшибки.Документ);		
	//	
	//КонецЦикла;	
	//
	//ОписанияОшибокВводаВремени = Новый Массив;
	//
	//СоздатьВТСотрудникиПериоды(МенеджерВТ);
	//
	//ИсключаемыеРегистраторы = Новый Массив;
	//ИсключаемыеРегистраторы.Добавить(Ссылка);
	//ИсключаемыеРегистраторы.Добавить(ИсправленныйДокумент);
	//
	//УчетРабочегоВремениРасширенный.СоздатьВТПериодыЗарегистрированныхДанныхУчетаВремени(МенеджерВТ, "ВТСотрудникиПериоды", ПериодРегистрации, Перечисления.ВидыДанныхУчетаВремениСотрудников.ДанныеТабельногоУчета, ИсключаемыеРегистраторы);
	//УчетРабочегоВремениРасширенный.ТабельПроверитьЦелостностьЗаполненияПериода(МенеджерВТ, Организация, Подразделение, ДатаНачалаПериода, ДатаОкончанияПериода, "ВТПериодыЗарегистрированныхДанныхУчетаВремени", ОписанияОшибокВводаВремени, Отказ);
	//
	//Для Каждого ОписаниеОшибки Из ОписанияОшибокВводаВремени Цикл				
	//	СтрокиСотрудника = СтрокиПоСотрудникам.Получить(ОписаниеОшибки.Сотрудник);
	//	
	//	НомерСтроки = СтрокиСотрудника[0].НомерСтроки;
	//	
	//	Поле = "Объект.ДанныеОВремени[" + Формат(НомерСтроки - 1, "ЧГ=") + "].Время" + День(ОписаниеОшибки.Дата) + "Представление";

	//	УчетРабочегоВремениРасширенный.ДобавитьОшибкуПоСотруднику(Ошибки, ОписаниеОшибки.Сотрудник, ОписаниеОшибки.ТекстОшибки, Поле, ОписаниеОшибки.Документ);		
	//	
	//КонецЦикла;	
	//
	//ОписанияОшибокВводаВремени = Новый Массив;
	//	
	//УчетРабочегоВремениРасширенный.ПроверитьУникальностьВводаИтоговыхДанных(МенеджерВТ, Ссылка, ПериодРегистрации, ОписанияОшибокВводаВремени, Ложь);
	//
	//Для Каждого ОписаниеОшибки Из ОписанияОшибокВводаВремени Цикл				
	//	
	//	УчетРабочегоВремениРасширенный.ДобавитьОшибкуПоСотруднику(Ошибки, ОписаниеОшибки.Сотрудник, ОписаниеОшибки.ТекстОшибки, , ОписаниеОшибки.Документ);		
	//	
	//КонецЦикла;	
	//
	//УчетРабочегоВремениРасширенный.ВывестиОшибкиПоСотрудникам(Ошибки, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТаблицаДанныхОВремени(ИспользуютсяТерритории = Ложь, ИспользуютсяУсловияТруда = Ложь, ПолучатьДанныеТолькоПоСотрудникамСИсправлениями = Ложь, СотрудникиСИсправленнымиДанными = Неопределено)		
	КонецФункции	

Функция СтрокиПоСотрудникам()
	СтрокиПоСотрудникам = Новый Соответствие;
	Для Каждого СтрокаДанных Из ДанныеОВремени Цикл
		МассивСтрок = СтрокиПоСотрудникам.Получить(СтрокаДанных.Сотрудник);
		Если МассивСтрок = Неопределено Тогда
			МассивСтрок = Новый Массив;
			СтрокиПоСотрудникам.Вставить(СтрокаДанных.Сотрудник, МассивСтрок);
		КонецЕсли;	
		МассивСтрок.Добавить(СтрокаДанных);
	КонецЦикла;	
	
	Возврат СтрокиПоСотрудникам;
КонецФункции	

Процедура СоздатьВТСотрудникиПериоды(МенеджерВременныхТаблиц)	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ДанныеОВремени", ДанныеОВремени);
	Запрос.УстановитьПараметр("Месяц", НачалоМесяца(ДатаНачалаПериода));
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачалаПериода);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончанияПериода);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаДокумента.Сотрудник КАК Сотрудник,
		|	&Месяц КАК Месяц,
		|	&ДатаНачала КАК ДатаНачала,
		|	&ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТСотрудникиПериоды
		|ИЗ
		|	&ДанныеОВремени КАК ТаблицаДокумента";
		
	Запрос.Выполнить();
КонецПроцедуры

Функция СотрудникиСИсправленнымиДанными()
	КонецФункции	

Функция СтрокиТаблицыСменПоСотрудникам()
	
	
КонецФункции	

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли