&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Клиент") Тогда
		Отчет.Клиент = Параметры.Клиент;		
	КонецЕсли;    
	Если Параметры.Свойство("ЗалоговыйБилет") Тогда
		Отчет.ЗалоговыйБилет = Параметры.ЗалоговыйБилет;		
	КонецЕсли; 
	Если Параметры.Свойство("Дата") Тогда
		Отчет.Дата = Параметры.Дата;    
	Иначе
		Отчет.Дата = ТекущаяДата();
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(Отчет.Клиент) Тогда
		ЗаполнитьСписокЗБ();
	КонецЕсли;	 
	
	Если ЗначениеЗаполнено(Отчет.ЗалоговыйБилет) Тогда
		Элементы.ГруппаБыстрыеОтборы.Видимость = ложь;  
		Элементы.Отбор.ЦветФона = WebЦвета.Белый;
		СформироватьНаСервере();
	Иначе
		Элементы.Отбор.ЦветФона = WebЦвета.БледноЗеленый;
	КонецЕсли;	     
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если НЕ ЗначениеЗаполнено(Отчет.ЗалоговыйБилет) Тогда
		Сообщить("Не выбран залоговый билет!");
		Возврат;
	КонецЕсли;
	
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьКомментарииПеремещения(Регистратор) 
	Запрос = новый Запрос; 
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеОбъектаЗалога.Комментарий КАК Комментарий,
	               |	ЛБ_СостояниеОбъектаЗалога.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_СостояниеОбъектаЗалога.ОбъектЗалога КАК ОбъектЗалога
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеОбъектаЗалога КАК ЛБ_СостояниеОбъектаЗалога
	               |ГДЕ
	               |	ЛБ_СостояниеОбъектаЗалога.Регистратор = &Регистратор"; 
	Возврат Запрос.Выполнить().Выгрузить();
Конецфункции

&НаСервере
Процедура СформироватьНаСервере()    
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь; 
	Если НЕ ТекПользователь.ЭтоЛомбард Тогда
		Если УправлениеДоступом.ЕстьРоль("ЛБ_СотрудникЦО") Тогда
			СотрудникЦО = Истина;
		КонецЕсли;	  
	КонецЕсли;	

	ДокументРезультат.Очистить(); 
	Дата1 = НачалоДня(Отчет.ЗалоговыйБилет.Дата);
	//Дата2 = ?(Отчет.Дата = Дата(1,1,1), КонецДня(ТекущаяДата()), КонецДня(Отчет.Дата));
	Дата2 = КонецДня(Дата(2199, 12, 31)); 
	
	Запрос = Новый Запрос;				
	Запрос.УстановитьПараметр("Дата1", Дата1); 
	Запрос.УстановитьПараметр("Дата2", Дата2);  
	Запрос.УстановитьПараметр("Залогодатель", Отчет.Клиент);
	
	//Проверим есть дата смерти клиента 
	ДатаСмерти = Дата(1,1,1);    
	ПериодС = Дата(1,1,1);
	РегистраторС = неопределено; 
	ОтветственныйС = неопределено;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателей.Период КАК Период,
	               |	ЛБ_ДокументыЗалогодателей.Регистратор КАК Регистратор,
	               |	ЛБ_ДокументыЗалогодателей.ДатаСмерти КАК ДатаСмерти,
	               |	ЛБ_ДокументыЗалогодателей.Ответственный КАК Ответственный
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей КАК ЛБ_ДокументыЗалогодателей
	               |ГДЕ
	               |	ЛБ_ДокументыЗалогодателей.ДокументЗалогодателя.Владелец = &Залогодатель
	               |	И ЛБ_ДокументыЗалогодателей.ДокументЗалогодателя.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.СвидетельствоОСмерти)
	               |	И ЛБ_ДокументыЗалогодателей.ДокументНеДействителен = ЛОЖЬ"; 
	Выборка = Запрос.Выполнить().Выбрать();   
	Если Выборка.Следующий() тогда  
		ДатаСмерти = Выборка.ДатаСмерти; 
		СтатусНаследство = ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(Выборка.Период, Отчет.ЗалоговыйБилет);  
		ПериодС = Выборка.Период; 
		РегистраторС = Выборка.Регистратор;  
		ОтветственныйС = Выборка.Ответственный;
	КонецЕсли;	
		
	Запрос.УстановитьПараметр("ЗБ", Отчет.ЗалоговыйБилет); 	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЛБ_ОборотыПоОперациямЗайма.Период КАК Период,
	               |	ЛБ_ОборотыПоОперациямЗайма.Регистратор КАК Регистратор,
	               |	ЛБ_ОборотыПоОперациямЗайма.ВидОперации КАК ВидОперации,
	               |	ЛБ_ОборотыПоОперациямЗайма.Ломбард КАК Ломбард,
	               |	ЛБ_СостояниеЗалоговогоБилета.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета,
	               |	ЛБ_СостояниеЗалоговогоБилета.ДатаВыкупа КАК ДатаВыкупа,
	               |	ЛБ_СостояниеЗалоговогоБилета.ДатаВыкупаЛьготныйСрок КАК ДатаВыкупаЛьготная,
	               |	СУММА(ЛБ_ОборотыПоОперациямЗайма.СуммаСсуды) КАК СуммаСсуды,
	               |	СУММА(ЛБ_ОборотыПоОперациямЗайма.СуммаОплатыПроценты) КАК ОплатаПроценты,
	               |	СУММА(ЛБ_ОборотыПоОперациямЗайма.СуммаОплатыЗайм) КАК ОплатаЗайм,
	               |	ЛБ_СостояниеЗалоговогоБилета.НомерДопСоглашения КАК НомерДопСоглашения,
	               |	ЛБ_ОборотыПоОперациямЗайма.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
	               |	ЛБ_ОборотыПоОперациямЗайма.Комментарий КАК Комментарий,
	               |	ЛБ_ОборотыПоОперациямЗайма.ОтменаБлокировки КАК ОтменаБлокировки,
	               |	ЛБ_ОборотыПоОперациямЗайма.РеестрПлатежей КАК РеестрПлатежей
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОборотыПоОперациямЗайма КАК ЛБ_ОборотыПоОперациямЗайма
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_СостояниеЗалоговогоБилета КАК ЛБ_СостояниеЗалоговогоБилета
	               |		ПО ЛБ_ОборотыПоОперациямЗайма.ЗалоговыйБилет = ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет
	               |			И ЛБ_ОборотыПоОперациямЗайма.Регистратор = ЛБ_СостояниеЗалоговогоБилета.Регистратор
	               |ГДЕ
	               |	ЛБ_ОборотыПоОперациямЗайма.Период >= &Дата1
	               |	И ЛБ_ОборотыПоОперациямЗайма.ЗалоговыйБилет = &ЗБ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ОборотыПоОперациямЗайма.Период,
	               |	ЛБ_ОборотыПоОперациямЗайма.Регистратор,
	               |	ЛБ_ОборотыПоОперациямЗайма.ВидОперации,
	               |	ЛБ_ОборотыПоОперациямЗайма.Ломбард,
	               |	ЛБ_СостояниеЗалоговогоБилета.СтатусЗалоговогоБилета,
	               |	ЛБ_СостояниеЗалоговогоБилета.ДатаВыкупа,
	               |	ЛБ_СостояниеЗалоговогоБилета.ДатаВыкупаЛьготныйСрок,
	               |	ЛБ_СостояниеЗалоговогоБилета.НомерДопСоглашения,
	               |	ЛБ_ОборотыПоОперациямЗайма.НакладнаяНаОтгрузку,
	               |	ЛБ_ОборотыПоОперациямЗайма.Комментарий,
	               |	ЛБ_ОборотыПоОперациямЗайма.ОтменаБлокировки,
	               |	ЛБ_ОборотыПоОперациямЗайма.РеестрПлатежей
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период";    
	ТаблицаЗБ = Запрос.Выполнить().Выгрузить();  
	
	Если ЗначениеЗаполнено(ДатаСмерти) Тогда  
		ДатаНач = ТаблицаЗБ.Получить(0).Период;
		НомерКон = ТаблицаЗБ.Количество()-1;
		ДатаКон = ТаблицаЗБ.Получить(НомерКон).Период;      
		Если ПериодС >= ДатаНач И ПериодС <= ДатаКон Тогда
			НоваяСтр = ТаблицаЗБ.Добавить();   
			НоваяСтр.Период = ПериодС;    
			ТаблицаЗБ.Колонки.Регистратор.Имя = "Регистратор1"; 
			ТаблицаЗБ.Колонки.Добавить("Регистратор"); 
			Для каждого Стр Из ТаблицаЗБ Цикл 
				Стр.Регистратор = Стр.Регистратор1;				
			Конеццикла;
			ТаблицаЗБ.Колонки.Удалить("Регистратор1");
			НоваяСтр.Регистратор = РегистраторС;  
			ТаблицаЗБ.Сортировать("Период");
		КонецЕсли;	
	КонецЕсли;	       
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РасчетыСКлиентамиОстаткиИОбороты.Регистратор КАК Регистратор,
	               |	ЛБ_РасчетыСКлиентамиОстаткиИОбороты.ВидРасчета КАК ВидРасчета,
	               |	СУММА(ЛБ_РасчетыСКлиентамиОстаткиИОбороты.СуммаРасход) КАК Сумма,
	               |	СУММА(ЛБ_РасчетыСКлиентамиОстаткиИОбороты.СуммаКонечныйОстаток) КАК Остаток
	               |ИЗ
	               |	РегистрНакопления.ЛБ_РасчетыСКлиентами.ОстаткиИОбороты(&Дата1, , Регистратор, , ЗалоговыйБилет = &ЗБ) КАК ЛБ_РасчетыСКлиентамиОстаткиИОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_РасчетыСКлиентамиОстаткиИОбороты.ВидРасчета,
	               |	ЛБ_РасчетыСКлиентамиОстаткиИОбороты.Регистратор"; 
	ТаблицаРасчетов = Запрос.Выполнить().Выгрузить();

	
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ЛБ_НачислениеПроцентовДетально.Регистратор КАК Регистратор,
	                |	ЛБ_НачислениеПроцентовДетально.ДеньНач КАК ДеньНач,
	                |	ЛБ_НачислениеПроцентовДетально.ДеньКон КАК ДеньКон,
	                |	ЛБ_НачислениеПроцентовДетально.ДатаНач КАК ДатаНач,
	                |	ЛБ_НачислениеПроцентовДетально.ДатаКон КАК ДатаКон,
	                |	ЛБ_НачислениеПроцентовДетально.ВидПроцентнойСтавки КАК ВидПроцентнойСтавки,
	                |	ЛБ_НачислениеПроцентовДетально.ПроцентнаяСтавкаБазовая КАК ПроцентнаяСтавкаБазовая,
	                |	ЛБ_НачислениеПроцентовДетально.ПроцентнаяСтавкаАкция КАК ПроцентнаяСтавкаАкция,
	                |	ЛБ_НачислениеПроцентовДетально.ОтклонениеАкцияОтностельное КАК ОтклонениеАкцияОтностельное,
	                |	ЛБ_НачислениеПроцентовДетально.ОтклонениеАкцияАбсолютное КАК ОтклонениеАкцияАбсолютное,
	                |	ЛБ_НачислениеПроцентовДетально.СуммаПроцентов КАК СуммаПроцентов,
	                |	ЛБ_НачислениеПроцентовДетально.СуммаПроцентовДень КАК СуммаПроцентовДень
	                |ИЗ
	                |	РегистрНакопления.ЛБ_НачислениеПроцентовДетально КАК ЛБ_НачислениеПроцентовДетально
	                |ГДЕ
	                |	ЛБ_НачислениеПроцентовДетально.ЗалоговыйБилет = &ЗБ";
	ТаблицаРасчетовДетально = Запрос.Выполнить().Выгрузить(); 
	
	ЗапросРасчетыОЗ = Новый Запрос; 
	ЗапросРасчетыОЗ.УстановитьПараметр("ЗБ", Отчет.ЗалоговыйБилет); 
	ЗапросРасчетыОЗ.Текст = "ВЫБРАТЬ
	                        |	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты.Период КАК Период,
	                        |	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты.ОбъектЗалога КАК ОбъектЗалога,
	                        |	СУММА(ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты.СуммаПриход) КАК Займ,
	                        |	СУММА(ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты.СуммаРасход) КАК Оплата,
	                        |	СУММА(ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты.СуммаКонечныйОстаток) КАК Остаток
	                        |ИЗ
	                        |	РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.ОстаткиИОбороты(, &Дата, Регистратор, , ЗалоговыйБилет = &ЗБ) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты.ОбъектЗалога,
	                        |	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстаткиИОбороты.Период
	                        |
	                        |УПОРЯДОЧИТЬ ПО
	                        |	Период УБЫВ";
		
	ЗапросОЗ = Новый Запрос;   
	ЗапросОЗ.УстановитьПараметр("ЗБ", Отчет.ЗалоговыйБилет);
	ЗапросОЗ.Текст = "ВЫБРАТЬ
	                 |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	                 |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОписаниеИзделия КАК Описание,
	                 |	0 КАК Оценка,
	                 |	0 КАК Займ,
	                 |	0 КАК Оплата,
	                 |	0 КАК Остаток,
	                 |	НЕОПРЕДЕЛЕНО КАК Статус,
	                 |	НЕОПРЕДЕЛЕНО КАК Комментарий,
	                 |	НЕОПРЕДЕЛЕНО КАК Склад
	                 |ИЗ
	                 |	РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
	                 |			&Дата,
	                 |			ЗалоговыйБилет = &ЗБ
	                 |				И ОбъектЗалога В (&ОбъектыЗалога)) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних";
	
	ЗапросСклад = Новый Запрос;   
	ЗапросСклад.УстановитьПараметр("ЗБ", Отчет.ЗалоговыйБилет);
	ЗапросСклад.Текст = "ВЫБРАТЬ
	                    |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
	                    |	ЛБ_ОбъектыЗалогаОстатки.Склад КАК Склад,
	                    |	СУММА(ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток) КАК Количество
	                    |ИЗ
	                    |	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(
	                    |			&Дата,
	                    |			ЗалоговыйБилет = &ЗБ
	                    |				И ОбъектЗалога В (&ОбъектыЗалога)) КАК ЛБ_ОбъектыЗалогаОстатки
	                    |ГДЕ
						//+МАН 12.03.26 Изменил т.к. в список попадали строки дез склада. Заявка 3654.
						//|	НЕ ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток = 0
	                    |	НЕ ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток <= 0
						//-МАН
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	ЛБ_ОбъектыЗалогаОстатки.Склад,
	                    |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога
	                    |
	                    |ОБЪЕДИНИТЬ ВСЕ
	                    |
	                    |ВЫБРАТЬ
	                    |	ЛБ_ОбъектыЗалогаВСумкеОстатки.ОбъектЗалога,
	                    |	ЛБ_ОбъектыЗалогаВСумкеОстатки.СкладПолучатель,
	                    |	СУММА(ЛБ_ОбъектыЗалогаВСумкеОстатки.КоличествоОстаток)
	                    |ИЗ
	                    |	РегистрНакопления.ЛБ_ОбъектыЗалогаВСумке.Остатки(
	                    |			&Дата,
	                    |			ЗалоговыйБилет = &ЗБ
	                    |				И ОбъектЗалога В (&ОбъектыЗалога)) КАК ЛБ_ОбъектыЗалогаВСумкеОстатки
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	ЛБ_ОбъектыЗалогаВСумкеОстатки.СкладПолучатель,
	                    |	ЛБ_ОбъектыЗалогаВСумкеОстатки.ОбъектЗалога";
		
	ДокументРезультат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_История_Залогового_Билета";
	
	Макет 			 = Отчет.РеквизитМакет;
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка"); 
	ОбластьЗаголовок  = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаТовары  = Макет.ПолучитьОбласть("ШапкаТовары");
	ОбластьСтрока  = Макет.ПолучитьОбласть("Строка");  
	ОбластьСтрокаС  = Макет.ПолучитьОбласть("СтрокаС");
	ОбластьСтрокаН  = Макет.ПолучитьОбласть("СтрокаН");  
	ОбластьСтрокаР  = Макет.ПолучитьОбласть("СтрокаР");
	ОбластьСтрокаТовары  = Макет.ПолучитьОбласть("СтрокаТовары"); 
	ОбластьСтрокаВставки  = Макет.ПолучитьОбласть("СтрокаВставки");
	ОбластьПусто  = Макет.ПолучитьОбласть("ПустаяСтрока"); 
	ОбластьЗБНач  = Макет.ПолучитьОбласть("НачальныйЗБ");
		
	ОбластьШапка.Параметры.НомерЗБ = СокрЛП(Отчет.ЗалоговыйБилет.НомерЗалоговогоБилета); 
	//ОбластьШапка.Параметры.Дата1 = Формат(Отчет.ЗалоговыйБилет.Дата, "ДФ=dd.MM.yyyy");
	//ОбластьШапка.Параметры.Дата2 = Формат(Отчет.Дата, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.Заемщик = Отчет.Клиент;
	ДокументРезультат.Вывести(ОбластьШапка); 
	
	ПредыдущаяОперация = Отчет.ЗалоговыйБилет.ПредыдущаяОперация;
	Если ЗначениеЗаполнено(ПредыдущаяОперация) Тогда 
		ОбластьЗБНач.Параметры.НомерЗБНач = ПредыдущаяОперация.НомерЗалоговогоБилета; 
		ОбластьЗБНач.Параметры.ЗалоговыйБилетНач = ПредыдущаяОперация; 
		ДокументРезультат.Вывести(ОбластьЗБНач);
	КонецЕсли;	
	ДокументРезультат.Вывести(ОбластьЗаголовок);
		
	НачисленоИтог = 0; 
	ОплатаПроцентыИтог = 0;  
	ОплатаЗаймИтог = 0;  
	ОстатокПредыдущий = 0; 
	ОстатокЗайм = 0;
	ОстатокПроценты = 0;
	ТекНомерДС = 0;   
	СтрС = ТаблицаЗБ.Получить(0);
	ДокументРезультат.НачатьАвтогруппировкуСтрок();
	Для каждого стр Из ТаблицаЗБ Цикл 
		Если ТипЗнч(Стр.Регистратор) = Тип("ДокументСсылка.ЛБ_ПеремещениеОбъектовЗалога") ИЛИ 
			 ТипЗнч(Стр.Регистратор) = Тип("ДокументСсылка.ЛБ_ОприходованиеОбъектовЗалога") Тогда  
		    Если НЕ СотрудникЦО Тогда			 
				Продолжить;
			КонецЕсли;	             
			ЭтоПеремещение = Истина;
		Иначе
			ЭтоПеремещение = Ложь;
		КонецЕсли;	
		Если ТипЗнч(Стр.Регистратор) = Тип("ДокументСсылка.ЛБ_КарточкаЗалогодателя") Тогда  
			ОбластьСтрокаС.Параметры.Дата = Стр.Период;  
			ОбластьСтрокаС.Параметры.Вид = "Смерть клиента " + Формат(ДатаСмерти, "ДФ=dd.MM.yyyy");
			ОбластьСтрокаС.Параметры.Клиент = СтрС.Регистратор.Залогодатель; 	      
			ОбластьСтрокаС.Параметры.Статус = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Наследство;  
			ОбластьСтрокаС.Параметры.ДатаВыкупа = СтрС.ДатаВыкупа;
			ОбластьСтрокаС.Параметры.ДатаВыкупаЛьготная = СтрС.ДатаВыкупаЛьготная;
			Если СтрС.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог Или  СтрС.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда  
				ОбластьСтрокаС.Параметры.ОстатокЗайм = СтрС.СуммаСсуды;  
			Иначе        			 
				ОбластьСтрокаС.Параметры.ОстатокПроценты = Формат(ОстатокПроценты, "ЧЦ=15; ЧДЦ=2; ЧН=0,00");
				ОбластьСтрокаС.Параметры.ОстатокЗайм = ОстатокЗайм;
			КонецЕсли;
			ОбластьСтрокаС.Параметры.Ответственный = ОтветственныйС; 
			ОбластьСтрокаС.Параметры.Регистратор = РегистраторС;
			ДокументРезультат.Вывести(ОбластьСтрокаС, 1);   
			
			ЗапросОЗ.УстановитьПараметр("Дата", Стр.Период);
			МассивОЗ = Новый Массив;
			Для каждого СтрДок Из Отчет.ЗалоговыйБилет.Товары Цикл
				Если Стр.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление И НЕ СтрДок.Переоформить Тогда  
					Продолжить;
				КонецЕсли;	   
				МассивОЗ.Добавить(СтрДок.ОбъектЗалога);
			КонецЦикла;	
			ЗапросОЗ.УстановитьПараметр("ОбъектыЗалога", МассивОЗ);
	
			ТаблицаТовары = ЗапросОЗ.Выполнить().Выгрузить();  
			
			ЗапросСклад.УстановитьПараметр("Дата", Стр.Период+1); 
			ЗапросСклад.УстановитьПараметр("ОбъектыЗалога", МассивОЗ);
			ТаблицаТоваровНаСкладах = ЗапросСклад.Выполнить().Выгрузить();
			
			ОтборТ = новый структура;
			Для каждого СтрТ Из ТаблицаТовары Цикл      
				СтруктураСостояниеОЗ = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектовЗалогаЗалоговогоБилета(Стр.Период+1, Отчет.ЗалоговыйБилет, СтрТ.ОбъектЗалога);
				Если НЕ СтруктураСостояниеОЗ = неопределено Тогда
					СтрТ.Статус = СтруктураСостояниеОЗ.СтатусОбъектаЗалога;
					СтрТ.Займ = ?(СтруктураСостояниеОЗ.СуммаДолгаЗайма = 0, 0, СтруктураСостояниеОЗ.СуммаЗайма);
					СтрТ.Остаток = СтруктураСостояниеОЗ.СуммаДолгаЗайма;
					СтрТ.Комментарий = СтруктураСостояниеОЗ.Комментарий;
					ОтборСклад = Новый Структура;
					ОтборСклад.Вставить("ОбъектЗалога", СтрТ.ОбъектЗалога);
					СтрокиСклад = ТаблицаТоваровНаСкладах.НайтиСтроки(ОтборСклад);
					Если СтрокиСклад.Количество() = 0 тогда 
						СтрТ.Склад = "";
					Иначе              
						Склад = СтрокиСклад.Получить(0).Склад;
						СтрТ.Склад = СокрЛП(Склад.Владелец) + Символы.ПС + СокрЛП(Склад);
					КонецЕсли;	
				КонецЕсли;	
   			Конеццикла;
			
			ДокументРезультат.Вывести(ОбластьШапкаТовары, 2); 
			Для каждого СтрТ Из ТаблицаТовары Цикл    
				СтруктураОписанияОЗ = ЛБ_УправлениеЛомбардом.ОписаниеОбъектаЗалогаДляПечати(Отчет.ЗалоговыйБилет, СтрТ.ОбъектЗалога);
				ОбластьСтрокаТовары.Параметры.ОбъектЗалога = СтруктураОписанияОЗ.Описание + ?(НЕ ПустаяСтрока(СтруктураОписанияОЗ.ОписаниеВ), Символы.ПС + "Вставки:" + Символы.ПС + СтруктураОписанияОЗ.ОписаниеВ, "");   
				ОбластьСтрокаТовары.Параметры.Склад = СтрТ.Склад;  
				ОбластьСтрокаТовары.Параметры.Статус = СтрТ.Статус;
				ОбластьСтрокаТовары.Параметры.Оценка = СтрТ.Оценка;
				ОбластьСтрокаТовары.Параметры.Займ = СтрТ.Займ;
				ОбластьСтрокаТовары.Параметры.Оплата = СтрТ.Оплата;
				ОбластьСтрокаТовары.Параметры.Остаток = СтрТ.Остаток;  
				ОбластьСтрокаТовары.Параметры.Комментарий = СтрТ.Комментарий;
				ДокументРезультат.Вывести(ОбластьСтрокаТовары, 2); 
				
				//Если НЕ ПустаяСтрока(СтруктураОписанияОЗ.ОписаниеВ) Тогда
				//	ОбластьСтрокаВставки.Параметры.Вставки = СтруктураОписанияОЗ.ОписаниеВ; 
				//	ДокументРезультат.Вывести(ОбластьСтрокаВставки, 2);
				//КонецЕсли;
			КонецЦикла;	
			ДокументРезультат.Вывести(ОбластьПусто, 2);

			Продолжить;     
		ИначеЕсли ТипЗнч(Стр.Регистратор) = Тип("ДокументСсылка.ЛБ_КорректировкаНакладной") И 
			      (Стр.Регистратор.ВидОперации = Перечисления.ЛБ_ВидыКорректировкиНакладной.БлокировкаВключенияЗБВНакладные ИЛИ
				   Стр.Регистратор.ВидОперации = Перечисления.ЛБ_ВидыКорректировкиНакладной.ОплатаОтгруженногоЗБ) Тогда  
			Архив = Ложь;	   
			ОбластьСтрокаН.Параметры.Дата = Стр.Период; 
			Если Стр.ОтменаБлокировки Тогда
				ОбластьСтрокаН.Параметры.Вид = "Отмена блокировки включения ЗБ в накладные";
			Иначе	
			    ОбластьСтрокаН.Параметры.Вид = СокрЛП(Стр.ВидОперации); 
				Если Стр.Регистратор.ВидОперации = Перечисления.ЛБ_ВидыКорректировкиНакладной.ОплатаОтгруженногоЗБ Тогда  
					Если НЕ Стр.Регистратор.ЗалоговыеБилеты.Количество() = 0 Тогда
						Если НачалоДня(Стр.Регистратор.ЗалоговыеБилеты.Получить(0).ДатаОплаты) < НачалоДня(ТекущаяДатаСеанса()) Тогда 
							ОбластьСтрокаН.Параметры.Вид = ОбластьСтрокаН.Параметры.Вид + " (Архив)";
							Архив = Истина;
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;	
			СостояниеЗБ = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗалоговогоБилета(Стр.Регистратор, Отчет.ЗалоговыйБилет);
			СтатусЗалоговогоБилета = СостояниеЗБ.СтатусЗалоговогоБилета;  
			
			ОбластьСтрокаН.Параметры.Ломбард = Стр.Ломбард; 
			ОбластьСтрокаН.Параметры.Ответственный = Стр.Регистратор.Ответственный;
			ОбластьСтрокаН.Параметры.Статус = Строка(СтатусЗалоговогоБилета);  
		   	ОбластьСтрокаН.Параметры.Регистратор = Стр.Регистратор;   
			ОбластьСтрокаН.Параметры.ДатаВыкупа = СостояниеЗБ.ДатаВыкупа;
		    ОбластьСтрокаН.Параметры.ДатаВыкупаЛьготная = СостояниеЗБ.ДатаВыкупаЛьготныйСрок; 
			ОбластьСтрокаН.Параметры.НомерНакладной = Стр.НакладнаяНаОтгрузку.ПредставлениеНомераНакладной;  		 
			Если СтрС.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог Или  СтрС.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда  
				ОбластьСтрокаН.Параметры.ОстатокЗайм = СтрС.СуммаСсуды;  
			Иначе        			 
				ОбластьСтрокаН.Параметры.ОстатокПроценты = Формат(ОстатокПроценты, "ЧЦ=15; ЧДЦ=2; ЧН=0,00");
				ОбластьСтрокаН.Параметры.ОстатокЗайм = ОстатокЗайм;
			КонецЕсли;		

			ОбластьСтрокаН.Параметры.Комментарий = стр.Комментарий;
			
			ДокументРезультат.Вывести(ОбластьСтрокаН, 1);
			Если Архив Тогда
				ДокументРезультат.Области.СтрокаН.ЦветФона = WebЦвета.ТусклоРозовый;
            КонецЕсли;
			
			ЗапросОЗ.УстановитьПараметр("Дата", Стр.Период); 
			МассивОЗ = Новый Массив;
			Для каждого СтрДок Из Отчет.ЗалоговыйБилет.Товары Цикл	   
				МассивОЗ.Добавить(СтрДок.ОбъектЗалога);
			КонецЦикла;	
			ЗапросОЗ.УстановитьПараметр("ОбъектыЗалога", МассивОЗ);
			ТаблицаТовары = ЗапросОЗ.Выполнить().Выгрузить();  
			
			ЗапросСклад.УстановитьПараметр("Дата", Стр.Период+1); 
			ЗапросСклад.УстановитьПараметр("ОбъектыЗалога", МассивОЗ);
			ТаблицаТоваровНаСкладах = ЗапросСклад.Выполнить().Выгрузить();
			
			ОтборТ = новый структура;
			Для каждого СтрТ Из ТаблицаТовары Цикл 
				СтруктураСостояниеОЗ = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектовЗалогаЗалоговогоБилета(Стр.Период+1, Отчет.ЗалоговыйБилет, СтрТ.ОбъектЗалога);
				Если НЕ СтруктураСостояниеОЗ = неопределено Тогда
					СтрТ.Статус = СтруктураСостояниеОЗ.СтатусОбъектаЗалога;  
					СтрТ.Оценка = СтруктураСостояниеОЗ.СуммаОценки; 
					Если НЕ СтруктураСостояниеОЗ.СуммаДолгаЗайма = 0 Тогда
						СтрТ.Займ = СтруктураСостояниеОЗ.СуммаЗайма; 					
						СтрТ.Оплата = СтруктураСостояниеОЗ.СуммаОплаты; 
					Иначе
						СтрТ.Займ = 0; 					
						СтрТ.Оплата = 0; 
					КонецЕсли;	
					СтрТ.Остаток = СтруктураСостояниеОЗ.СуммаДолгаЗайма;   	   
					СтрТ.Комментарий = СтруктураСостояниеОЗ.Комментарий;
					ОтборСклад = Новый Структура;
					ОтборСклад.Вставить("ОбъектЗалога", СтрТ.ОбъектЗалога);
					СтрокиСклад = ТаблицаТоваровНаСкладах.НайтиСтроки(ОтборСклад);
					Если СтрокиСклад.Количество() = 0 тогда 
						СтрТ.Склад = "";
					Иначе              
						Склад = СтрокиСклад.Получить(0).Склад;
						СтрТ.Склад = СокрЛП(Склад.Владелец) + Символы.ПС + СокрЛП(Склад);
					КонецЕсли;	
				КонецЕсли;		
			Конеццикла;
			
			ДокументРезультат.Вывести(ОбластьШапкаТовары, 2); 
			Для каждого СтрТ Из ТаблицаТовары Цикл
				СтруктураОписанияОЗ = ЛБ_УправлениеЛомбардом.ОписаниеОбъектаЗалогаДляПечати(Отчет.ЗалоговыйБилет, СтрТ.ОбъектЗалога);
				ОбластьСтрокаТовары.Параметры.ОбъектЗалога = СтруктураОписанияОЗ.Описание + ?(НЕ ПустаяСтрока(СтруктураОписанияОЗ.ОписаниеВ), Символы.ПС + "Вставки:" + Символы.ПС + СтруктураОписанияОЗ.ОписаниеВ, "");   
				ОбластьСтрокаТовары.Параметры.Статус = Строка(СтрТ.Статус);  
				ОбластьСтрокаТовары.Параметры.Склад = СтрТ.Склад; 
				ОбластьСтрокаТовары.Параметры.Оценка = СтрТ.Оценка;
				ОбластьСтрокаТовары.Параметры.Займ = СтрТ.Займ;
				ОбластьСтрокаТовары.Параметры.Оплата = СтрТ.Оплата;
				ОбластьСтрокаТовары.Параметры.Остаток = СтрТ.Остаток; 
				ОбластьСтрокаТовары.Параметры.Комментарий = "";
				ДокументРезультат.Вывести(ОбластьСтрокаТовары, 2); 
				
				//Если НЕ ПустаяСтрока(СтруктураОписанияОЗ.ОписаниеВ) Тогда
				//	ОбластьСтрокаВставки.Параметры.Вставки = СтруктураОписанияОЗ.ОписаниеВ; 
				//	ДокументРезультат.Вывести(ОбластьСтрокаВставки, 2);
				//КонецЕсли;

			КонецЦикла;	
			ДокументРезультат.Вывести(ОбластьПусто, 2); 

			Продолжить;		
		ИначеЕсли НЕ (ТипЗнч(Стр.Регистратор) = Тип("ДокументСсылка.ЛБ_ОперацияПоЗалогу")) И ЗначениеЗаполнено(Стр.НакладнаяНаОтгрузку) Тогда 
			ОбластьСтрокаН.Параметры.Дата = Стр.Период;  
			Комментарий = "";
			СтатусЗБВНакладной = ЛБ_УправлениеЛомбардом.ПолучитьСтатусНакладнойНаОтгрузку(Стр.Регистратор.Дата, Стр.НакладнаяНаОтгрузку);
			СостояниеЗБ = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗалоговогоБилета(Стр.Регистратор, Отчет.ЗалоговыйБилет);
			Если НЕ ЗначениеЗаполнено(Стр.ВидОперации) Тогда
			    ОбластьСтрокаН.Параметры.Вид = "Накладная на отгрузку (" + Строка(СтатусЗБВНакладной) + ")";  
				СтатусЗалоговогоБилета = Стр.СтатусЗалоговогоБилета;  
				Если ТипЗнч(Стр.Регистратор) = Тип("ДокументСсылка.ЛБ_НакладнаяНаОтгрузку") Тогда
				    Комментарий = ?(Стр.НакладнаяНаОтгрузку.ВидОперации = Перечисления.ЛБ_ВидыНакладнойНаОтгрузку.Автоматически, "", "Включен в накладную сотрудником ЦО");
				КонецЕсли;	
			Иначе 
				ОбластьСтрокаН.Параметры.Вид = СокрЛП(Стр.ВидОперации) + ?(ЭтоПеремещение, "", " (" + СтатусЗБВНакладной+ ")");   
				Если Стр.СтатусЗалоговогоБилета = null Тогда					 
					СтатусЗалоговогоБилета = СостояниеЗБ.СтатусЗалоговогоБилета;
                Иначе
				    СтатусЗалоговогоБилета = Стр.СтатусЗалоговогоБилета; 
				КонецЕсли;	
				ОбластьСтрокаН.Параметры.Комментарий = "";
				Попытка
				    Если Стр.Регистратор.ВидОперации = Перечисления.ЛБ_ВидыКорректировкиНакладной.ИсключениеЗБИзНакладной Тогда
					   Комментарий = "Исключен из накладной сотрудником ЦО";  
					КонецЕсли;   
				Исключение  
				КонецПопытки	
			КонецЕсли;	 
			ОбластьСтрокаН.Параметры.Ломбард = Стр.Ломбард; 
			ОбластьСтрокаН.Параметры.Ответственный = Стр.Регистратор.Ответственный;
			ОбластьСтрокаН.Параметры.Статус = Строка(СтатусЗалоговогоБилета); 
			Если ТипЗнч(Стр.Регистратор) = Тип("ДокументСсылка.ЛБ_НакладнаяНаОтгрузку") ИЛИ
				 ТипЗнч(Стр.Регистратор) = Тип("ДокументСсылка.ЛБ_КорректировкаНакладной") ИЛИ 
				 ТипЗнч(Стр.Регистратор) = Тип("ДокументСсылка.ЛБ_ПеремещениеОбъектовЗалога") ИЛИ
				 ТипЗнч(Стр.Регистратор) = Тип("ДокументСсылка.ЛБ_ОприходованиеОбъектовЗалога") Тогда
		   	    ОбластьСтрокаН.Параметры.Регистратор = Стр.Регистратор;   
			Иначе
				ОбластьСтрокаН.Параметры.Регистратор = Стр.НакладнаяНаОтгрузку;
			КонецЕсли;	   
			ОбластьСтрокаН.Параметры.ДатаВыкупа = СостояниеЗБ.ДатаВыкупа;
		    ОбластьСтрокаН.Параметры.ДатаВыкупаЛьготная = СостояниеЗБ.ДатаВыкупаЛьготныйСрок; 
			ОбластьСтрокаН.Параметры.НомерНакладной = Стр.НакладнаяНаОтгрузку.ПредставлениеНомераНакладной;  
			Если СтрС.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог Или  СтрС.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда  
				ОбластьСтрокаН.Параметры.ОстатокЗайм = СтрС.СуммаСсуды;  
			Иначе        			 
				ОбластьСтрокаН.Параметры.ОстатокПроценты = Формат(ОстатокПроценты, "ЧЦ=15; ЧДЦ=2; ЧН=0,00");
				ОбластьСтрокаН.Параметры.ОстатокЗайм = ОстатокЗайм;
			КонецЕсли;		
			Если Не ПустаяСтрока(Стр.Комментарий) Тогда
			    Комментарий = Комментарий + ?(ПустаяСтрока(Комментарий), "", Символы.ПС) + Стр.Комментарий; 
			КонецЕсли;
			ОбластьСтрокаН.Параметры.Комментарий = Комментарий;
			
			ДокументРезультат.Вывести(ОбластьСтрокаН, 1);
			
			ЗапросОЗ.УстановитьПараметр("Дата", Стр.Период); 
			МассивОЗ = Новый Массив;
			Для каждого СтрДок Из Отчет.ЗалоговыйБилет.Товары Цикл	   
				МассивОЗ.Добавить(СтрДок.ОбъектЗалога);
			КонецЦикла;	
			ЗапросОЗ.УстановитьПараметр("ОбъектыЗалога", МассивОЗ); 
			ТаблицаТовары = ЗапросОЗ.Выполнить().Выгрузить(); 
			
			ЗапросСклад.УстановитьПараметр("Дата", Стр.Период+1); 
			ЗапросСклад.УстановитьПараметр("ОбъектыЗалога", МассивОЗ);
			ТаблицаТоваровНаСкладах = ЗапросСклад.Выполнить().Выгрузить();
			
			ОтборТ = новый структура;
			Для каждого СтрТ Из ТаблицаТовары Цикл 
				СтруктураСостояниеОЗ = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектовЗалогаЗалоговогоБилета(Стр.Период+1, Отчет.ЗалоговыйБилет, СтрТ.ОбъектЗалога);  
				Если НЕ СтруктураСостояниеОЗ = неопределено Тогда
					СтрТ.Статус = СтруктураСостояниеОЗ.СтатусОбъектаЗалога;					
					СтрТ.Оценка = СтруктураСостояниеОЗ.СуммаОценки; 
					Если НЕ СтруктураСостояниеОЗ.СуммаДолгаЗайма = 0 Тогда  
						СтрТ.Займ = СтруктураСостояниеОЗ.СуммаЗайма;
					    СтрТ.Оплата = СтруктураСостояниеОЗ.СуммаОплаты; 
					Иначе
						СтрТ.Займ = 0; 					
						СтрТ.Оплата = 0; 	
					КонецЕсли;	
					СтрТ.Остаток = СтруктураСостояниеОЗ.СуммаДолгаЗайма;
				    СтрТ.Комментарий = СтруктураСостояниеОЗ.Комментарий;
					ОтборСклад = Новый Структура;
					ОтборСклад.Вставить("ОбъектЗалога", СтрТ.ОбъектЗалога);
					СтрокиСклад = ТаблицаТоваровНаСкладах.НайтиСтроки(ОтборСклад);
					Если СтрокиСклад.Количество() = 0 тогда 
						СтрТ.Склад = "";
					Иначе              
						Склад = СтрокиСклад.Получить(0).Склад;
						СтрТ.Склад = СокрЛП(Склад.Владелец) + Символы.ПС + СокрЛП(Склад);
					КонецЕсли;	
				КонецЕсли;		
			Конеццикла;
			
			ДокументРезультат.Вывести(ОбластьШапкаТовары, 2); 
			Для каждого СтрТ Из ТаблицаТовары Цикл
				СтруктураОписанияОЗ = ЛБ_УправлениеЛомбардом.ОписаниеОбъектаЗалогаДляПечати(Отчет.ЗалоговыйБилет, СтрТ.ОбъектЗалога);
				ОбластьСтрокаТовары.Параметры.ОбъектЗалога = СтруктураОписанияОЗ.Описание + ?(НЕ ПустаяСтрока(СтруктураОписанияОЗ.ОписаниеВ), Символы.ПС + "Вставки:" + Символы.ПС + СтруктураОписанияОЗ.ОписаниеВ, "");   
				СтатусВНакладной = ЛБ_УправлениеЛомбардом.ПолучитьСтатусОбъектаЗалогаВНакладнойНаОтгрузку(Стр.Регистратор.Дата, Стр.НакладнаяНаОтгрузку, Отчет.ЗалоговыйБилет, СтрТ.ОбъектЗалога);
				ОбластьСтрокаТовары.Параметры.Статус = Строка(СтрТ.Статус) + ?(ЭтоПеремещение, "", ?(ЗначениеЗаполнено(СтатусВНакладной), Символы.ПС + "(" + Строка(СтатусВНакладной) + ")", ""));
				ОбластьСтрокаТовары.Параметры.Склад = СтрТ.Склад;
				ОбластьСтрокаТовары.Параметры.Оценка = СтрТ.Оценка;
				ОбластьСтрокаТовары.Параметры.Займ = СтрТ.Займ;
				ОбластьСтрокаТовары.Параметры.Оплата = СтрТ.Оплата;
				ОбластьСтрокаТовары.Параметры.Остаток = СтрТ.Остаток; 
				ОбластьСтрокаТовары.Параметры.Комментарий = СтрТ.Комментарий;
				ДокументРезультат.Вывести(ОбластьСтрокаТовары, 2); 
				
				//Если НЕ ПустаяСтрока(СтруктураОписанияОЗ.ОписаниеВ) Тогда
				//	ОбластьСтрокаВставки.Параметры.Вставки = СтруктураОписанияОЗ.ОписаниеВ; 
				//	ДокументРезультат.Вывести(ОбластьСтрокаВставки, 2);
				//КонецЕсли;

			КонецЦикла;	
			ДокументРезультат.Вывести(ОбластьПусто, 2);  

			Продолжить;    
			
		ИначеЕсли НЕ (ТипЗнч(Стр.Регистратор) = Тип("ДокументСсылка.ЛБ_ОперацияПоЗалогу") ИЛИ ТипЗнч(Стр.Регистратор) = Тип("ДокументСсылка.ЛБ_Реализация")) И НЕ ЗначениеЗаполнено(Стр.НакладнаяНаОтгрузку) Тогда   
			ОбластьСтрокаН.Параметры.Дата = Стр.Период;  
			Комментарий = "";
			СостояниеЗБ = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗалоговогоБилета(Стр.Регистратор, Отчет.ЗалоговыйБилет);
			ОбластьСтрокаН.Параметры.Вид = Стр.Регистратор.Метаданные().Синоним;   
			Если Стр.СтатусЗалоговогоБилета = null Тогда					 
				СтатусЗалоговогоБилета = СостояниеЗБ.СтатусЗалоговогоБилета;
            Иначе
			    СтатусЗалоговогоБилета = Стр.СтатусЗалоговогоБилета; 
			КонецЕсли;	
						
			ОбластьСтрокаН.Параметры.Ломбард = Стр.Ломбард; 
			ОбластьСтрокаН.Параметры.Ответственный = Стр.Регистратор.Ответственный;
			ОбластьСтрокаН.Параметры.Статус = Строка(СтатусЗалоговогоБилета); 
			ОбластьСтрокаН.Параметры.Регистратор = Стр.Регистратор;		
			ОбластьСтрокаН.Параметры.ДатаВыкупа = СостояниеЗБ.ДатаВыкупа;
		    ОбластьСтрокаН.Параметры.ДатаВыкупаЛьготная = СостояниеЗБ.ДатаВыкупаЛьготныйСрок; 
			ОбластьСтрокаН.Параметры.НомерНакладной = "";
			ОбластьСтрокаН.Параметры.ОстатокПроценты = Формат(ОстатокПроценты, "ЧЦ=15; ЧДЦ=2; ЧН=0,00");
			ОбластьСтрокаН.Параметры.ОстатокЗайм = ОстатокЗайм;   
			
			Если Не ПустаяСтрока(Стр.Комментарий) Тогда
			    Комментарий = Комментарий + ?(ПустаяСтрока(Комментарий), "", Символы.ПС) + Стр.Комментарий; 
			КонецЕсли;	
			ОбластьСтрокаН.Параметры.Комментарий = Комментарий;
			
			ДокументРезультат.Вывести(ОбластьСтрокаН, 1);
			
			ЗапросОЗ.УстановитьПараметр("Дата", Стр.Период); 
			МассивОЗ = Новый Массив;
			Для каждого СтрДок Из Отчет.ЗалоговыйБилет.Товары Цикл	   
				МассивОЗ.Добавить(СтрДок.ОбъектЗалога);
			КонецЦикла;	
			ЗапросОЗ.УстановитьПараметр("ОбъектыЗалога", МассивОЗ);
			ТаблицаТовары = ЗапросОЗ.Выполнить().Выгрузить();      
			
			ЗапросСклад.УстановитьПараметр("Дата", Стр.Период+1); 
			ЗапросСклад.УстановитьПараметр("ОбъектыЗалога", МассивОЗ);
			ТаблицаТоваровНаСкладах = ЗапросСклад.Выполнить().Выгрузить();
			
			Если ЭтоПеремещение Тогда
			    ТаблицаК = ПолучитьКомментарииПеремещения(Стр.Регистратор);
			КонецЕсли;	 
			ОтборТ = новый структура;
			Для каждого СтрТ Из ТаблицаТовары Цикл 
				СтруктураСостояниеОЗ = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектовЗалогаЗалоговогоБилета(Стр.Период+1, Отчет.ЗалоговыйБилет, СтрТ.ОбъектЗалога);  
				Если НЕ СтруктураСостояниеОЗ = неопределено Тогда
					СтрТ.Статус = СтруктураСостояниеОЗ.СтатусОбъектаЗалога;
					СтрТ.Оценка = СтруктураСостояниеОЗ.СуммаОценки;
					Если НЕ СтруктураСостояниеОЗ.СуммаДолгаЗайма = 0 Тогда 
						СтрТ.Займ = СтруктураСостояниеОЗ.СуммаЗайма;					 
					    СтрТ.Оплата = СтруктураСостояниеОЗ.СуммаОплаты;  
					Иначе
						СтрТ.Займ = 0; 					
						СтрТ.Оплата = 0; 	
					КонецЕсли;	
					СтрТ.Остаток = СтруктураСостояниеОЗ.СуммаДолгаЗайма;
					Если ЭтоПеремещение Тогда
						ОтборК = новый структура;
						ОтборК.Вставить("ЗалоговыйБилет", Отчет.ЗалоговыйБилет);
						ОтборК.Вставить("ОбъектЗалога", СтрТ.ОбъектЗалога);
						СтрокиК = ТаблицаК.Найтистроки(ОтборК); 
						Если СтрокиК.Количество() = 0 Тогда
							СтрТ.Комментарий = "";
						Иначе  
							СтрТ.Комментарий = строкиК.получить(0).Комментарий;
						КонецЕсли;	   
					Иначе	
					    СтрТ.Комментарий = СтруктураСостояниеОЗ.Комментарий;
					КонецЕсли;
					ОтборСклад = Новый Структура;
					ОтборСклад.Вставить("ОбъектЗалога", СтрТ.ОбъектЗалога);
					СтрокиСклад = ТаблицаТоваровНаСкладах.НайтиСтроки(ОтборСклад);
					Если СтрокиСклад.Количество() = 0 тогда 
						СтрТ.Склад = "";
					Иначе              
						Склад = СтрокиСклад.Получить(0).Склад;
						СтрТ.Склад = СокрЛП(Склад.Владелец) + Символы.ПС + СокрЛП(Склад);
					КонецЕсли;	
				КонецЕсли;		
			Конеццикла;
			
			ДокументРезультат.Вывести(ОбластьШапкаТовары, 2); 
			Для каждого СтрТ Из ТаблицаТовары Цикл
				СтруктураОписанияОЗ = ЛБ_УправлениеЛомбардом.ОписаниеОбъектаЗалогаДляПечати(Отчет.ЗалоговыйБилет, СтрТ.ОбъектЗалога);
				ОбластьСтрокаТовары.Параметры.ОбъектЗалога = СтруктураОписанияОЗ.Описание + ?(НЕ ПустаяСтрока(СтруктураОписанияОЗ.ОписаниеВ), Символы.ПС + "Вставки:" + Символы.ПС + СтруктураОписанияОЗ.ОписаниеВ, "");   
				СтатусВНакладной = ЛБ_УправлениеЛомбардом.ПолучитьСтатусОбъектаЗалогаВНакладнойНаОтгрузку(Стр.Регистратор.Дата, Стр.НакладнаяНаОтгрузку, Отчет.ЗалоговыйБилет, СтрТ.ОбъектЗалога);
				ОбластьСтрокаТовары.Параметры.Статус = Строка(СтрТ.Статус) + ?(ЗначениеЗаполнено(СтатусВНакладной), Символы.ПС + "(" + Строка(СтатусВНакладной) + ")", "");
				ОбластьСтрокаТовары.Параметры.Склад = СтрТ.Склад;
				ОбластьСтрокаТовары.Параметры.Оценка = СтрТ.Оценка;
				ОбластьСтрокаТовары.Параметры.Займ = СтрТ.Займ;
				ОбластьСтрокаТовары.Параметры.Оплата = СтрТ.Оплата;
				ОбластьСтрокаТовары.Параметры.Остаток = СтрТ.Остаток; 
				ОбластьСтрокаТовары.Параметры.Комментарий = СтрТ.Комментарий;
				ДокументРезультат.Вывести(ОбластьСтрокаТовары, 2); 
				
				//Если НЕ ПустаяСтрока(СтруктураОписанияОЗ.ОписаниеВ) Тогда
				//	ОбластьСтрокаВставки.Параметры.Вставки = СтруктураОписанияОЗ.ОписаниеВ; 
				//	ДокументРезультат.Вывести(ОбластьСтрокаВставки, 2);
				//КонецЕсли;

			КонецЦикла;	
			ДокументРезультат.Вывести(ОбластьПусто, 2);  

			Продолжить;       
	
		КонецЕсли;	                           
		
		Если ТипЗнч(Стр.Регистратор) = Тип("ДокументСсылка.ЛБ_Реализация") Тогда
			ЭтоРеализация = Истина;
		Иначе
			ЭтоРеализация = Ложь;
		КонецЕсли;	
		ОбластьСтрока.Параметры.Дата = Стр.Период; 
		Если ЭтоРеализация Тогда 
			ОбластьСтрока.Параметры.Вид = "Реализация невостребованных залогов";  
		    ОбластьСтрока.Параметры.Ломбард = Стр.Ломбард;
			ОбластьСтрока.Параметры.Клиент = "";  
			ОбластьСтрока.Параметры.ДатаВыкупа = Стр.ДатаВыкупа;
		    ОбластьСтрока.Параметры.ДатаВыкупаЛьготная = Стр.ДатаВыкупаЛьготная; 
		Иначе	
			ВидОперации = Строка(Стр.ВидОперации);
			Если Стр.Регистратор.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда 
				Если НЕ Отчет.ЗалоговыйБилет = Стр.Регистратор Тогда
					ВидОперации = ВидОперации + " (выкуп займа)"; 
				Иначе  
					ВидОперации = ВидОперации + " (выдача займа)";
				КонецЕсли;   
			КонецЕсли;	            
			Если Стр.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление ИЛИ Стр.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаПереоформления Тогда  
				Если НЕ(СокрЛП(Отчет.ЗалоговыйБилет.НомерЗалоговогоБилета) = СокрЛП(Стр.Регистратор.НомерЗалоговогоБилета)) Тогда
					ВидОперации = ВидОперации + Символы.ПС + "ЗБ № " + СокрЛП(Стр.Регистратор.НомерЗалоговогоБилета);
				КонецЕсли;	
			КонецЕсли;	   
			Если ЗначениеЗаполнено(Стр.РеестрПлатежей) Тогда
				ВидОперации = "Безналичная оплата " + ?(Стр.РеестрПлатежей.ВидОперации = Перечисления.ЛБ_ВидыБезналичныхПлатежей.ЛичныйКабинет, "(ЛК)", "(р/сч)");
				Если Стр.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаОплаты Тогда 
					ВидОперации = ВидОперации + " отмена";
				КонецЕсли;	
			КонецЕсли;
			
			ОбластьСтрока.Параметры.Вид = ВидОперации;  
			ОбластьСтрока.Параметры.Ломбард = Стр.Ломбард;  
			Если Стр.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда
				ОбластьСтрока.Параметры.Клиент = ?(ЗначениеЗаполнено(Стр.Регистратор.Представитель), Стр.Регистратор.Представитель, Стр.Регистратор.Залогодатель);
			ИначеЕсли Стр.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ИзъятиеОбъектовЗалога ИЛИ
				      Стр.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога ИЛИ
                      Стр.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОстановкаПроцентов ИЛИ
                      Стр.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаВозвратаИзъятого ИЛИ
                      Стр.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаИзъятия ИЛИ
                      Стр.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаОстановкиНачисленияПроцентов Тогда
               ОбластьСтрока.Параметры.Клиент = "";
			Иначе
				Если Найти(ВидОперации, "Безналичная оплата") = 0  Тогда
			        ОбластьСтрока.Параметры.Клиент = ?(Стр.Регистратор.Метаданные().Реквизиты.Найти("Залогодатель")  = Неопределено, "", Стр.Регистратор.Залогодатель);
				Иначе  
					ОбластьСтрока.Параметры.Клиент = "";
				КонецЕсли;	
			КонецЕсли;	         
		КонецЕсли;	
		ОбластьСтрока.Параметры.Статус = Стр.СтатусЗалоговогоБилета;  
		ОбластьСтрока.Параметры.ДатаВыкупа = Стр.ДатаВыкупа;
		ОбластьСтрока.Параметры.ДатаВыкупаЛьготная = Стр.ДатаВыкупаЛьготная; 
		СтруктураДоп = неопределено; 
		Если ТекНомерДС = Стр.НомерДопСоглашения Тогда
		    ОбластьСтрока.Параметры.НомерДС = "";
		Иначе  
			ОбластьСтрока.Параметры.НомерДС = Стр.НомерДопСоглашения; 
			ТекНомерДС = Стр.НомерДопСоглашения;
			СтруктураДоп = Новый Структура;
			СтруктураДоп.Вставить("Вид", 2);
			СтруктураДоп.Вставить("НомерДС", Стр.НомерДопСоглашения);
			СтруктураДоп.Вставить("Документ", Стр.Регистратор);			
		КонецЕсли;	
		ОбластьСтрока.Параметры.СтруктураДоп = СтруктураДоп;
		ОбластьСтрока.Параметры.Ответственный = Стр.Регистратор.ОтветственныйСотрудник; 
		Если ЗначениеЗаполнено(Стр.НакладнаяНаОтгрузку) Тогда
		    ОбластьСтрока.Параметры.НомерНакладной = Стр.НакладнаяНаОтгрузку.ПредставлениеНомераНакладной;  
		Иначе
			ОбластьСтрока.Параметры.НомерНакладной = "";
		КонецЕсли; 
		ОбластьСтрока.Параметры.Комментарий = Стр.Комментарий;
		
		СтруктураР = Новый Структура;   
		СтруктураР.Вставить("Вид", 1);
		СтруктураР.Вставить("ВидОперации", Стр.ВидОперации);
		СтруктураР.Вставить("Документ", Стр.Регистратор);
		
		//+Мельников 16.05.24 Изменения для документов отмены
		ДокументОтмены = Ложь;
		ОтмененныйДокумент = Ложь; 
		//Если НЕ Стр.Регистратор.Метаданные().Реквизиты.Найти("ДокументОтмены")  = Неопределено Тогда
		//    ДокументОтмены = ЗначениеЗаполнено(стр.Регистратор.ДокументОтмены);                      
		//КонецЕсли;    
	    Если НЕ Стр.Регистратор.Метаданные().Реквизиты.Найти("ОтмененныйДокумент")  = Неопределено Тогда
		    ДокументОтмены = ЗначениеЗаполнено(ПолучитьДокументОтмены(Стр.Регистратор));                      
		    ОтмененныйДокумент = ЗначениеЗаполнено(стр.Регистратор.ОтмененныйДокумент);   
		КонецЕсли;	
		//-Мельников
		
		Если Стр.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог Или 
			(Стр.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление И Стр.Регистратор = Отчет.ЗалоговыйБилет) Тогда 
			ОбластьСтрока.Параметры.СуммаЗайма = Стр.СуммаСсуды; 
			ОбластьСтрока.Параметры.ОстатокЗайм = Стр.СуммаСсуды;  
			//+Мельников 28.05.24 Добавил проверку, документ отмены или нет.
			ОбластьСтрока.Параметры.СтавкаДень = ?(СтрНайти(Стр.ВидОперации, "Отмена") > 0, "-", Стр.Регистратор.ПроцентнаяСхема); //Было: Стр.Регистратор.ПроцентнаяСхема
			//-Мельников
			ОстатокЗайм = Стр.СуммаСсуды;  
			ОстатокПроценты = 0;
			ОбластьСтрока.Параметры.СтруктураР = СтруктураР;
			ДокументРезультат.Вывести(ОбластьСтрока, 1);  			
		Иначе           
			СтруктураРез = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗалоговогоБилета(Стр.Регистратор, Отчет.ЗалоговыйБилет); 	
			Отбор = Новый Структура;  
			Отбор.Вставить("Регистратор", Стр.Регистратор);	
			СтрокиР = ТаблицаРасчетов.НайтиСтроки(Отбор);  
			ОплатаПроценты = 0;
			ОплатаЗайм = 0;			
			Для каждого СтрР из СтрокиР Цикл
				Если СтрР.видРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам Тогда
					ОплатаПроценты = СтрР.Сумма;
					ОстатокПроценты = стрР.Остаток;
				ИначеЕсли СтрР.видРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоОсновномуДолгу Тогда
					ОплатаЗайм = СтрР.Сумма;
					ОстатокЗайм = стрР.Остаток;
	            КонецЕсли;
			Конеццикла;      
			
            //+МАН 02.02.26 Добавил условие. Убрал вывод для реализации. Заявка 3649
			Если ЭтоРеализация И ТекПользователь.ЭтоЛомбард Тогда
				ОбластьСтрока.Параметры.ОплатаПроценты = "";
				ОбластьСтрока.Параметры.ОплатаЗайм = "";
				ОбластьСтрока.Параметры.ОплатаВсего = "";
				ОбластьСтрока.Параметры.ОстатокПроценты = "";
				ОбластьСтрока.Параметры.ОстатокЗайм = "";
			Иначе
			//-МАН
				ОбластьСтрока.Параметры.СуммаЗайма = 0;
				ОбластьСтрока.Параметры.ОплатаПроценты = ОплатаПроценты;
				ОбластьСтрока.Параметры.ОплатаЗайм = ОплатаЗайм;
				ОбластьСтрока.Параметры.ОплатаВсего = ОплатаПроценты + ОплатаЗайм; 
				ОбластьСтрока.Параметры.ОстатокПроценты = Формат(ОстатокПроценты, "ЧЦ=15; ЧДЦ=2; ЧН=0,00");
				ОбластьСтрока.Параметры.ОстатокЗайм = ОстатокЗайм;
			КонецЕсли;
			
			Если ЭтоРеализация И СотрудникЦО Тогда 
			    ОбластьСтрока.Параметры.СтруктураР = стр.Регистратор; 	
			Иначе	
			    ОбластьСтрока.Параметры.СтруктураР = СтруктураР; 
			КонецЕсли;	
						
			ОплатаПроцентыИтог = ОплатаПроцентыИтог + ОплатаПроценты;  
	        ОплатаЗаймИтог = ОплатаЗаймИтог + ОплатаЗайм;
			
			Отбор = Новый Структура;  
			Отбор.Вставить("Регистратор", Стр.Регистратор);	
			СтрокиДоп = ТаблицаРасчетовДетально.НайтиСтроки(Отбор);
			СтавкаП = 0;
			СписокП = Новый СписокЗначений;
			Начислено = 0;
			Для каждого СтрДоп из СтрокиДоп Цикл 
				//Если СтрДоп.ДеньНач = 1 Тогда     
					СтавкаП = СтрДоп.ПроцентнаяСтавкаБазовая; 
					Если СтрДоп.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Акционная Тогда
						Если НЕ СтрДоп.ПроцентнаяСтавкаАкция = 0 Тогда
							СтавкаП = СтрДоп.ПроцентнаяСтавкаАкция;
						ИначеЕсли НЕ СтрДоп.ОтклонениеАкцияОтносительное = 0 Тогда	 
							СтавкаП = СтрДоп.ПроцентнаяСтавкаБазовая + СтрДоп.ПроцентнаяСтавкаБазовая*СтрДоп.ОтклонениеАкцияОтносительное/100;
						ИначеЕсли НЕ СтрДоп.ОтклонениеАкцияАбсолютное = 0 Тогда
							СтавкаП = СтрДоп.ПроцентнаяСтавкаБазовая + СтрДоп.ОтклонениеАкцияАбсолютное;
					    КонецЕсли; 
					КонецЕсли;	                                  
					СписокП.Добавить(СтавкаП);
					Начислено = Начислено + СтрДоп.СуммаПроцентов;
				//Иначе	
				//    Начислено = Начислено + СтрДоп.СуммаПроцентов;
				//КонецЕсли;
			КонецЦикла;     
			
            //+МАН 02.02.26 Добавил условие. Убрал вывод для реализации. Заявка 3649
			Если ЭтоРеализация И ТекПользователь.ЭтоЛомбард Тогда
				ОбластьСтрока.Параметры.СтавкаДень = "";
			Иначе
			//-МАН
				Если СписокП.Количество() <= 1 Тогда 
					//+Мельников 28.05.24 Добавил проверку, документ отмены или нет.
					ОбластьСтрока.Параметры.СтавкаДень = ?(СтрНайти(Стр.ВидОперации, "Отмена") > 0, "-", СтавкаП); //Было: СтавкаП
					//-Мельников
				Иначе     
					СтрокаПроцентныеСтавки = "";
					Ном = 0;
					Для каждого Эл из СписокП Цикл 
						СтрокаПроцентныеСтавки = СтрокаПроцентныеСтавки + ?(Ном = 0, "", "," + Символы.ПС) + Формат(Эл.Значение, "ЧН=-");
						Ном = Ном + 1;
					КонецЦикла;	
					//+Мельников 28.05.24 Добавил проверку, документ отмены или нет.
					ОбластьСтрока.Параметры.СтавкаДень = ?(СтрНайти(Стр.ВидОперации, "Отмена") > 0, "-", СтрокаПроцентныеСтавки); //Было: СтрокаПроцентныеСтавки
					//-Мельников
				КонецЕсли;	 
			КонецЕсли;
			
			НачисленоИтог = НачисленоИтог + Начислено; 
			Если Стр.Регистратор.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ИзъятиеОбъектовЗалога Тогда  
				НачисленоИтог = НачисленоИтог - ОплатаЗайм;
			КонецЕсли;	
			
            //+МАН 02.02.26 Добавил условие. Убрал вывод для реализации. Заявка 3649
			Если ЭтоРеализация И ТекПользователь.ЭтоЛомбард Тогда
				ОбластьСтрока.Параметры.НачисленоПроценты = "";
				ОбластьСтрока.Параметры.НачисленоПроцентыИтог = "";
			Иначе
			//-МАН
				ОбластьСтрока.Параметры.НачисленоПроценты = ?(ОтмененныйДокумент, 0, Начислено + ОстатокПредыдущий); //+Мельников 16.05.24 Добавил проверку на документ отмены. Было: Начислено + ОстатокПредыдущий
				ОбластьСтрока.Параметры.НачисленоПроцентыИтог = НачисленоИтог;  
			КонецЕсли;
			
			ОстатокПредыдущий = ОстатокПроценты;
			ДокументРезультат.Вывести(ОбластьСтрока, 1);   			
		КонецЕсли;	 
		
		//+Мельников 16.05.24 Изменения раскраски фона документов отмены. Изменен цвет фона (на серый) у обрасти "Строка" в Макете.
		Если ?(ДокументОтмены, Ложь, ?(ОтмененныйДокумент, Ложь, Истина)) ИЛИ
			?(ОтмененныйДокумент, Ложь, ?(ДокументОтмены, Ложь, Истина)) Тогда
			ДокументРезультат.Области.Строка.ЦветФона = WebЦвета.Белый;
		КонецЕсли;
		//-Мельников

		//ЗапросОЗ.УстановитьПараметр("Дата", ?(Стр.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление, Стр.Период-1, Стр.Период));
		ЗапросОЗ.УстановитьПараметр("Дата", Стр.Период); 
		МассивОЗ = Новый Массив;
		Для каждого СтрДок Из Отчет.ЗалоговыйБилет.Товары Цикл
			Если Отчет.ЗалоговыйБилет.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление И НЕ СтрДок.Переоформить Тогда  
				Продолжить;
			КонецЕсли;	   
			МассивОЗ.Добавить(СтрДок.ОбъектЗалога);
		КонецЦикла;	
		ЗапросОЗ.УстановитьПараметр("ОбъектыЗалога", МассивОЗ); 
		ТаблицаТовары = ЗапросОЗ.Выполнить().Выгрузить();
		
		ЗапросСклад.УстановитьПараметр("Дата", Стр.Период+1); 
		ЗапросСклад.УстановитьПараметр("ОбъектыЗалога", МассивОЗ);
		ТаблицаТоваровНаСкладах = ЗапросСклад.Выполнить().Выгрузить();
		
		//ЗапросРасчетыОЗ.УстановитьПараметр("Дата", Стр.Период); 
		//ТаблицаРасчетовТовары = ЗапросРасчетыОЗ.Выполнить().Выгрузить();
		
		Если ЭтоРеализация Тогда
		    ТаблицаК = ПолучитьКомментарииПеремещения(Стр.Регистратор);
		КонецЕсли;	 

		ОтборТ = новый структура;
		Для каждого СтрТ Из ТаблицаТовары Цикл 
			СтруктураСостояниеОЗ = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектовЗалогаЗалоговогоБилета(Стр.Период+1, Отчет.ЗалоговыйБилет, СтрТ.ОбъектЗалога);
			Если НЕ СтруктураСостояниеОЗ = неопределено Тогда
				СтрТ.Статус = СтруктураСостояниеОЗ.СтатусОбъектаЗалога;
				СтрТ.Оценка = СтруктураСостояниеОЗ.СуммаОценки; 
				Если НЕ (СтрТ.Статус = Перечисления.ЛБ_СтатусыОбъектовЗалога.Реализован ИЛИ СтрТ.Статус = Перечисления.ЛБ_СтатусыОбъектовЗалога.Выкуплен) ИЛИ ЭтоРеализация Тогда 
					СтрТ.Займ = СтруктураСостояниеОЗ.СуммаЗайма;
				    СтрТ.Оплата = СтруктураСостояниеОЗ.СуммаОплаты; 
				Иначе
					СтрТ.Займ = 0; 					
					СтрТ.Оплата = 0; 	
				КонецЕсли;	
				
				//+МАН 08.08.25 Если отмена выдачи займа, то остаток 0. Заявка 3336
				Если Стр.Регистратор.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаЗалога Тогда
					СтрТ.Остаток = 0;
				Иначе
					СтрТ.Остаток = СтруктураСостояниеОЗ.СуммаДолгаЗайма;
				КонецЕсли;
				//Было:
				//СтрТ.Остаток = СтруктураСостояниеОЗ.СуммаДолгаЗайма;  				
				//

				Если ЭтоРеализация Тогда
					ОтборК = новый структура;
					ОтборК.Вставить("ЗалоговыйБилет", Отчет.ЗалоговыйБилет);
					ОтборК.Вставить("ОбъектЗалога", СтрТ.ОбъектЗалога);
					СтрокиК = ТаблицаК.Найтистроки(ОтборК); 
					Если СтрокиК.Количество() = 0 Тогда
						СтрТ.Комментарий = "";
					Иначе  
						СтрТ.Комментарий = строкиК.получить(0).Комментарий;
					КонецЕсли;	   
					Если Не ПустаяСтрока(СтрТ.Комментарий) Тогда  
						КомментарийК = СтрТ.Комментарий;   
						Поз = Найти(КомментарийК, "%");
						Если СотрудникЦО Тогда        
							Если НЕ Поз = 0 Тогда  
								КомментарийК = Лев(КомментарийК, Поз-1) + Сред(КомментарийК, Поз + 1);
							КонецЕсли;	
						Иначе   
							Если НЕ Поз = 0 Тогда  
								КомментарийК = Лев(КомментарийК, Поз-1);
							КонецЕсли;	
						КонецЕсли;
						СтрТ.Комментарий = КомментарийК;
					КонецЕсли; 
				Иначе          
					Если НЕ СтрТ.Статус = Перечисления.ЛБ_СтатусыОбъектовЗалога.Реализован Тогда
					    СтрТ.Комментарий = СтруктураСостояниеОЗ.Комментарий;
					КонецЕсли;	
				КонецЕсли;				  
				ОтборСклад = Новый Структура;
				ОтборСклад.Вставить("ОбъектЗалога", СтрТ.ОбъектЗалога);
				СтрокиСклад = ТаблицаТоваровНаСкладах.НайтиСтроки(ОтборСклад);
				Если СтрокиСклад.Количество() = 0 тогда 
						СтрТ.Склад = "";
					Иначе              
						Склад = СтрокиСклад.Получить(0).Склад;
						СтрТ.Склад = СокрЛП(Склад.Владелец) + Символы.ПС + СокрЛП(Склад);
				КонецЕсли;	
			КонецЕсли;			
		Конеццикла;
		
		ДокументРезультат.Вывести(ОбластьШапкаТовары, 2); 
		Для каждого СтрТ Из ТаблицаТовары Цикл
			СтруктураОписанияОЗ = ЛБ_УправлениеЛомбардом.ОписаниеОбъектаЗалогаДляПечати(Отчет.ЗалоговыйБилет, СтрТ.ОбъектЗалога);
			ОбластьСтрокаТовары.Параметры.ОбъектЗалога = СтруктураОписанияОЗ.Описание + ?(НЕ ПустаяСтрока(СтруктураОписанияОЗ.ОписаниеВ), Символы.ПС + "Вставки:" + Символы.ПС + СтруктураОписанияОЗ.ОписаниеВ, ""); 
			НакладнаяНаОтгрузку = ЛБ_УправлениеЛомбардом.ПолучитьНакладнуюНаОтгрузкуЗалогоговогоБилета(стр.Период-1, отчет.ЗалоговыйБилет);
			Если ЗначениеЗаполнено(НакладнаяНаОтгрузку) Тогда
				СтатусВНакладной = ЛБ_УправлениеЛомбардом.ПолучитьСтатусОбъектаЗалогаВНакладнойНаОтгрузку(Стр.Регистратор.Дата, НакладнаяНаОтгрузку, Отчет.ЗалоговыйБилет, СтрТ.ОбъектЗалога);
				ОбластьСтрокаТовары.Параметры.Статус = Строка(СтрТ.Статус) + ?(ЗначениеЗаполнено(СтатусВНакладной), Символы.ПС + "(" + Строка(СтатусВНакладной) + ")", ""); 
			Иначе
			    ОбластьСтрокаТовары.Параметры.Статус = СтрТ.Статус;  
			КонецЕсли;	   
			ОбластьСтрокаТовары.Параметры.Склад = СтрТ.Склад;
			ОбластьСтрокаТовары.Параметры.Оценка = СтрТ.Оценка;
			ОбластьСтрокаТовары.Параметры.Займ = СтрТ.Займ;
			
			//+МАН 02.02.26 Добавил условие. Убрал вывод для реализации. Заявка 3649
			Если ЭтоРеализация И ТекПользователь.ЭтоЛомбард Тогда
				ОбластьСтрокаТовары.Параметры.Оплата = "";
			Иначе
			//-МАН
				ОбластьСтрокаТовары.Параметры.Оплата = СтрТ.Оплата;
			КонецЕсли;
			
			ОбластьСтрокаТовары.Параметры.Остаток = СтрТ.Остаток;
			ОбластьСтрокаТовары.Параметры.Комментарий = СтрТ.Комментарий;
			ДокументРезультат.Вывести(ОбластьСтрокаТовары, 2); 
			
			//Если НЕ ПустаяСтрока(СтруктураОписанияОЗ.ОписаниеВ) Тогда
			//	ОбластьСтрокаВставки.Параметры.Вставки = СтруктураОписанияОЗ.ОписаниеВ; 
			//	ДокументРезультат.Вывести(ОбластьСтрокаВставки, 2);
			//КонецЕсли;

		КонецЦикла;	
		ДокументРезультат.Вывести(ОбластьПусто, 2);  
		СтрС = Стр;
	Конеццикла;	    
	
	ДокументРезультат.ЗакончитьАвтогруппировкуСтрок(); 
	//ОбластьИтог.Параметры.ОплатаПроценты = ОплатаПроцентыИтог;
	//ОбластьИтог.Параметры.ОплатаЗайм = ОплатаЗаймИтог;
	//ОбластьИтог.Параметры.ОплатаВсего = ОплатаПроцентыИтог + ОплатаЗаймИтог; 
	//ДокументРезультат.Вывести(ОбластьИтог);   
	
	ДокументРезультат.ФиксацияСверху = 5;
	ДокументРезультат.ПоказатьУровеньГруппировокСтрок(0);
КонецПроцедуры

&НаКлиенте
Процедура КлиентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь; 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Дата", Отчет.Дата);	
    ПараметрыФормы.Вставить("БезДокументов", истина);
	Если ЗначениеЗаполнено(Отчет.Клиент) Тогда
		ПараметрыФормы.Вставить("Залогодатель", Отчет.Клиент);
	КонецЕсли;		
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораКлиента",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателя", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКлиента(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;   
	
	Отчет.Клиент = Результат.Залогодатель;  
	
	ЗаполнитьСписокЗБ();
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьСписокЗБ(НомерЗБ = неопределено) 
	СписокВыбораЗБ.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", КонецДня(Отчет.Дата));
	Запрос.УстановитьПараметр("Клиент", Отчет.Клиент);
	СписокВО = Новый списокЗначений;
	СписокВО.Добавить(Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог);
	СписокВО.Добавить(Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление); 
	Запрос.УстановитьПараметр("ВидыОперации", СписокВО); 
	Запрос.Текст ="ВЫБРАТЬ
	              |	ЛБ_ОборотыПоОперациямЗаймаОбороты.ЗалоговыйБилет КАК ЗалоговыйБилет,
	              |	ЛБ_ОборотыПоОперациямЗаймаОбороты.ЗалоговыйБилет.НомерЗалоговогоБилета КАК НомерЗалоговогоБилета
	              |ИЗ
	              |	РегистрНакопления.ЛБ_ОборотыПоОперациямЗайма.Обороты(
	              |			,
				  |			&Дата,
	              |			Регистратор,
	              |			Залогодатель = &Клиент
	              |				И ВидОперации В (&ВидыОперации)) КАК ЛБ_ОборотыПоОперациямЗаймаОбороты
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	НомерЗалоговогоБилета";
	Выборка = Запрос.Выполнить().Выбрать();  
	Пока Выборка.Следующий() Цикл 
		Если НЕ НомерЗБ = неопределено Тогда
			Если Найти(Выборка.НомерЗалоговогоБилета, СокрЛП(НомерЗБ)) = 0 Тогда
				Продолжить;
			КонецЕсли;	
		КонецЕсли;	
		СписокВыбораЗБ.Добавить(Выборка.ЗалоговыйБилет, Выборка.НомерЗалоговогоБилета + "            ");
	КонецЦикла;	
КонецПроцедуры	

&НаСервере
Функция ПолучитьНомерЗБ()
	Возврат Отчет.ЗалоговыйБилет.НомерЗалоговогоБилета;
КонецФункции

&НаКлиенте
Процедура Отбор(Команда)
	Если Элементы.ГруппаБыстрыеОтборы.Видимость Тогда 
		Элементы.ГруппаБыстрыеОтборы.Видимость = Ложь;
		Элементы.Отбор.ЦветФона = WebЦвета.Белый;
	Иначе 
		Элементы.ГруппаБыстрыеОтборы.Видимость = Истина;
		Элементы.Отбор.ЦветФона = WebЦвета.БледноЗеленый;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗалоговыйБилетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;  
	НомерЗБ = Элемент.ТекстРедактирования;
	ЗаполнитьСписокЗБ(?(ПустаяСтрока(НомерЗБ), неопределено, НомерЗБ));
	ВыбранноеЗначение = ВыбратьИзСписка(СписокВыбораЗБ, Элементы.ЗалоговыйБилет); 

	Если ВыбранноеЗначение <> Неопределено Тогда 
	    Отчет.ЗалоговыйБилет = ВыбранноеЗначение.Значение;
	    НомерЗБ  = СокрЛП(ВыбранноеЗначение.Представление);
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ПолучитьВидОперации(Документ)
	Если Документ.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог Тогда 
		Возврат 1;
	ИначеЕсли Документ.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда 
		Возврат 2;
	КонецЕсли;
	Возврат 0;
КонецФункции      

&НаСервере
Функция ПолучитьНачальногоЗаемщика(Документ)
	Возврат Документ.Залогодатель;
КонецФункции	

&НаСервере
Функция ПолучитьИмяФормыКорректировки(Ссылка)  
	Возврат ЛБ_ОбщийМодуль.ПолучитьИмяФормыКорректировкиНакладных(Ссылка);
КонецФункции	

&НаКлиенте
Процедура ДокументРезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
	    СтандартнаяОбработка = ложь;  
		ПараметрыФормы = Новый структура;        
		Если Расшифровка.вид = 1 Тогда
			ПараметрыФормы.Вставить("Документ", Расшифровка.Документ);
			Если Расшифровка.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог") Тогда
				ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаВыдачиЗайма", ПараметрыФормы, ЭтаФорма); 
			ИначеЕсли Расшифровка.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление") Тогда 
				ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаПереоформленияЗайма", ПараметрыФормы, ЭтаФорма);	
			ИначеЕсли Расшифровка.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов") Тогда 
				ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаОплатыПроцентов", ПараметрыФормы, ЭтаФорма);
			ИначеЕсли Расшифровка.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога") Тогда 
				ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаВыдачиЗалога", ПараметрыФормы, ЭтаФорма);
		    ИначеЕсли Расшифровка.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ИзъятиеОбъектовЗалога") Тогда 
				ОткрытьФорму("ОбщаяФорма.ЛБ_ИзъятиеОбъектовЗалога", ПараметрыФормы, ЭтаФорма);
	        ИначеЕсли Расшифровка.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога") Тогда 
				ОткрытьФорму("ОбщаяФорма.ЛБ_ВозвратОбъектовЗалога", ПараметрыФормы, ЭтаФорма);
	        ИначеЕсли Расшифровка.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаЗалога") Тогда 
				ОткрытьФорму("ОбщаяФорма.ЛБ_ОтменаВыдачиЗайма", ПараметрыФормы, ЭтаФорма);   
			ИначеЕсли Расшифровка.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаПереоформления") Тогда 
				ОткрытьФорму("ОбщаяФорма.ЛБ_ОтменаПереоформленияЗайма", ПараметрыФормы, ЭтаФорма);	
			КонецЕсли;  
		ИначеЕсли Расшифровка.вид = 2 Тогда    
			Если НЕ Расшифровка.НомерДС = 0 Тогда
				ПараметрыФормы.Вставить("ИменаМакетов", "ДополнительноеСоглашение"); 
				ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_ОперацияПоЗалогу");
				МассивОбъектов = Новый Массив;
				МассивОбъектов.Добавить(Расшифровка.Документ);
				ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
				ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,); 
            КонецЕсли;
		КонецЕсли;	    
	ИначеЕсли ТипЗнч(Расшифровка) = Тип("ДокументСсылка.ЛБ_ОперацияПоЗалогу") Тогда	
		СтандартнаяОбработка = ложь; 
		//Если ПолучитьВидОперации(Расшифровка) = 1 Тогда
		//	ПараметрыФормы = Новый Структура;
		//	ПараметрыФормы.Вставить("Документ", Расшифровка);
		//	ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаВыдачиЗайма", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
		//ИначеЕсли ПолучитьВидОперации(Расшифровка) = 2 Тогда  
		//	СтандартнаяОбработка = ложь; 
		//	ПараметрыФормы = Новый Структура;
		//	ПараметрыФормы.Вставить("Документ", Расшифровка);
		//	ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаПереоформленияЗайма", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
		//КонецЕсли;	 
		Если НЕ ПолучитьВидОперации(Расшифровка) = 0 Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Клиент", ПолучитьНачальногоЗаемщика(Расшифровка));
			ПараметрыФормы.Вставить("ЗалоговыйБилет", Расшифровка);	 
		    ОткрытьФорму("Отчет.ЛБ_ИсторияЗалоговогоБилета.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
        КонецЕсли;
	ИначеЕсли ТипЗнч(Расшифровка) = Тип("ДокументСсылка.ЛБ_КарточкаЗалогодателя") Тогда	
		СтандартнаяОбработка = ложь; 
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Залогодатель", Отчет.Клиент);
		ПараметрыФормы.Вставить("Дата", ТекущаяДата());	
		ПараметрыФормы.Вставить("ТолькоПросмотр", истина);
		ОткрытьФорму("ОбщаяФорма.ЛБ_КарточкаЗалогодателя", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
	ИначеЕсли ТипЗнч(Расшифровка) = Тип("ДокументСсылка.ЛБ_НакладнаяНаОтгрузку") Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура("Ключ", Расшифровка);
		ОткрытьФорму("Документ.ЛБ_НакладнаяНаОтгрузку.ФормаОбъекта", ПараметрыФормы);
	ИначеЕсли ТипЗнч(Расшифровка) = Тип("ДокументСсылка.ЛБ_КорректировкаНакладной") Тогда 
		СтандартнаяОбработка = ложь; 
		ИмяФормыК = ПолучитьИмяФормыКорректировки(Расшифровка); 
		Если ИмяФормыК = неопределено Тогда     
			ПараметрыФормы = Новый Структура("Ключ", Расшифровка);
            ОткрытьФорму("Документ.ЛБ_КорректировкаНакладной.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
		Иначе
			ПараметрыФормыДоп = Новый Структура; 
			ПараметрыФормыДоп.Вставить("Документ", Расшифровка);  
			ОткрытьФорму("ОбщаяФорма." + ИмяФормыК, ПараметрыФормыДоп, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;	   
	ИначеЕсли ТипЗнч(Расшифровка) = Тип("ДокументСсылка.ЛБ_ПеремещениеОбъектовЗалога") Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура("Ключ", Расшифровка);
		ОткрытьФорму("Документ.ЛБ_ПеремещениеОбъектовЗалога.ФормаОбъекта", ПараметрыФормы);	
	ИначеЕсли ТипЗнч(Расшифровка) = Тип("ДокументСсылка.ЛБ_ОприходованиеОбъектовЗалога") Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура("Ключ", Расшифровка);
		ОткрытьФорму("Документ.ЛБ_ОприходованиеОбъектовЗалога.ФормаОбъекта", ПараметрыФормы);
	ИначеЕсли ТипЗнч(Расшифровка) = Тип("ДокументСсылка.ЛБ_Реализация") Тогда 
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", Расшифровка); 
		ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
		ОткрытьФорму("Документ.ЛБ_Реализация.ФормаОбъекта", ПараметрыФормы);	
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ЗалоговыйБилетПриИзменении(Элемент)
	НомерЗБ = Элемент.ТекстРедактирования;
	ЗаполнитьСписокЗБ(?(ПустаяСтрока(НомерЗБ), неопределено, НомерЗБ));
	ВыбранноеЗначение = ВыбратьИзСписка(СписокВыбораЗБ, Элементы.ЗалоговыйБилет); 

	Если ВыбранноеЗначение <> Неопределено Тогда 
	    Отчет.ЗалоговыйБилет = ВыбранноеЗначение.Значение;
	    НомерЗБ  = СокрЛП(ВыбранноеЗначение.Представление);
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ПолучитьДокументОтмены(Ссылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&Период, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
		|ГДЕ
		|	ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент В(&ЗБ)";
	
	Запрос.УстановитьПараметр("ЗБ", Ссылка);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Регистратор;
	КонецЕсли;
	
	Возврат Документы.ЛБ_ОперацияПоЗалогу.ПустаяСсылка();
	
КонецФункции



