// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт 
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "График";
	КомандаПечати.Представление = НСтр("ru = 'График'"); 
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
КонецПроцедуры

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "График") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "График", "График", 
			ПечатьГрафика(МассивОбъектов, ОбъектыПечати), , "Документ.ЛБ_ЭлектронныйГрафикРаботы.График");
	КонецЕсли;  
	
КонецПроцедуры 


Функция ПолучитьВыборкуГрафика(МассивОбъектов)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	График.Ссылка КАК Ссылка,
	|	График.Ломбард КАК Ломбард,
	|	График.Сотрудник.Наименование КАК СотрудникНаим,
	|	График.Сотрудник КАК Сотрудник,
	|	График.ВремяПредставление1 КАК Время1,
	|	График.ВремяПредставление2 КАК Время2,
	|	График.ВремяПредставление3 КАК Время3,
	|	График.ВремяПредставление4 КАК Время4,
	|	График.ВремяПредставление5 КАК Время5,
	|	График.ВремяПредставление6 КАК Время6,
	|	График.ВремяПредставление7 КАК Время7,
	|	График.ВремяПредставление8 КАК Время8,
	|	График.ВремяПредставление9 КАК Время9,
	|	График.ВремяПредставление10 КАК Время10,
	|	График.ВремяПредставление11 КАК Время11,
	|	График.ВремяПредставление12 КАК Время12,
	|	График.ВремяПредставление13 КАК Время13,
	|	График.ВремяПредставление14 КАК Время14,
	|	График.ВремяПредставление15 КАК Время15,
	|	График.ВремяПредставление16 КАК Время16,
	|	График.ВремяПредставление17 КАК Время17,
	|	График.ВремяПредставление18 КАК Время18,
	|	График.ВремяПредставление19 КАК Время19,
	|	График.ВремяПредставление20 КАК Время20,
	|	График.ВремяПредставление21 КАК Время21,
	|	График.ВремяПредставление22 КАК Время22,
	|	График.ВремяПредставление23 КАК Время23,
	|	График.ВремяПредставление24 КАК Время24,
	|	График.ВремяПредставление25 КАК Время25,
	|	График.ВремяПредставление26 КАК Время26,
	|	График.ВремяПредставление27 КАК Время27,
	|	График.ВремяПредставление28 КАК Время28,
	|	График.ВремяПредставление29 КАК Время29,
	|	График.ВремяПредставление30 КАК Время30,
	|	График.ВремяПредставление31 КАК Время31,
	|	График.Часов1 КАК Часов1,
	|	График.Часов2 КАК Часов2,
	|	График.Часов3 КАК Часов3,
	|	График.Часов4 КАК Часов4,
	|	График.Часов5 КАК Часов5,
	|	График.Часов6 КАК Часов6,
	|	График.Часов7 КАК Часов7,
	|	График.Часов8 КАК Часов8,
	|	График.Часов9 КАК Часов9,
	|	График.Часов10 КАК Часов10,
	|	График.Часов11 КАК Часов11,
	|	График.Часов12 КАК Часов12,
	|	График.Часов13 КАК Часов13,
	|	График.Часов14 КАК Часов14,
	|	График.Часов15 КАК Часов15,
	|	График.Часов16 КАК Часов16,
	|	График.Часов17 КАК Часов17,
	|	График.Часов18 КАК Часов18,
	|	График.Часов19 КАК Часов19,
	|	График.Часов20 КАК Часов20,
	|	График.Часов21 КАК Часов21,
	|	График.Часов22 КАК Часов22,
	|	График.Часов23 КАК Часов23,
	|	График.Часов24 КАК Часов24,
	|	График.Часов25 КАК Часов25,
	|	График.Часов26 КАК Часов26,
	|	График.Часов27 КАК Часов27,
	|	График.Часов28 КАК Часов28,
	|	График.Часов29 КАК Часов29,
	|	График.Часов30 КАК Часов30,
	|	График.Часов31 КАК Часов31,
	|	График.ИтогоЧасов КАК ИтогоЧасов,
	|	График.Ссылка.ПериодРегистрации КАК ПериодРегистрации
	|ИЗ
	|	Документ.ЛБ_ЭлектронныйГрафикРаботы.ДанныеОВремени КАК График
	|ГДЕ
	|	График.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	График.Ломбард.НомерЧисловой,
	|	График.Сотрудник.Наименование";

	Возврат Запрос.Выполнить();

КонецФункции


Функция СтрокиГрафикаРаботы(фЛомбард)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПриказРежимРаботыРежимРаботы.Ломбард КАК Ломбард,
	               |	ЛБ_ПриказРежимРаботыРежимРаботы.День КАК День,
	               |	ЛБ_ПриказРежимРаботыРежимРаботы.Начало КАК Начало,
	               |	ЛБ_ПриказРежимРаботыРежимРаботы.Окончание КАК Окончание,
	               |	ЛБ_ПриказРежимРаботыРежимРаботы.НомерДня КАК НомерДня,
	               |	ЛБ_ПриказРежимРаботыРежимРаботы.Выходной КАК Выходной,
	               |	ЛБ_ПриказРежимРаботыРежимРаботы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЛБ_ПриказРежимРаботы.РежимРаботы КАК ЛБ_ПриказРежимРаботыРежимРаботы
	               |ГДЕ
	               |	ЛБ_ПриказРежимРаботыРежимРаботы.Ссылка.Проведен = ИСТИНА
	               |	И ЛБ_ПриказРежимРаботыРежимРаботы.Ссылка.ВидПриказа = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыПриказаРежимаРаботы.Постоянный)
	               |	И ЛБ_ПриказРежимРаботыРежимРаботы.Ссылка.Архив <> ИСТИНА
	               |	И ЛБ_ПриказРежимРаботыРежимРаботы.Ломбард = &Ломбард";   
	Запрос.УстановитьПараметр("Ломбард", фЛомбард);
	
	тз = Запрос.Выполнить().Выгрузить();   
	тз.Колонки.Добавить("печДень"); 
	
	Для каждого стр из тз Цикл  
		Если стр.НомерДня < 6 Тогда
			стр.печДень = "пн.-пт. "+Формат(стр.Начало, "ДФ=ЧЧ:мм")+"-"+ Формат(стр.Окончание, "ДФ=ЧЧ:мм"); 
		Иначе   
			Если стр.Выходной = Истина Тогда
				стр.печДень = "сб.-вс. - выходной";	
			Иначе
				стр.печДень = "сб.-вс. "+Формат(стр.Начало, "ДФ=ЧЧ:мм")+"-"+ Формат(стр.Окончание, "ДФ=ЧЧ:мм"); 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;  
	тз.Свернуть("печДень");
	
	Возврат тз;
КонецФункции


Функция ПечатьГрафика(МассивОбъектов, ОбъектыПечати)

	УстановитьПривилегированныйРежим(Истина);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб			= Истина;
	ТабДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ЛБ_ЭлектронныйГрафикРаботы_График";
	
	тзЛомбардов = Новый ТаблицаЗначений;
	тзЛомбардов.Колонки.Добавить("Ломбард");
	тзЛомбардов.Колонки.Добавить("ПерваяСтрока"); 
	тзЛомбардов.Колонки.Добавить("ПоследняяСтрока");
	
	
	ПервыйДокумент = Истина;

	Для каждого Док из МассивОбъектов Цикл
		
		РезГрафик = ПолучитьВыборкуГрафика(Док); 
		График = РезГрафик.Выбрать(); 
		ГрафикТЗ = РезГрафик.Выгрузить(); 
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЛБ_ЭлектронныйГрафикРаботы.График");
		
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка|Лево"); 
		
		Отдел = СокрЛП(Док.Отделение.Наименование);
		РезультатСкл = ПолучитьСклоненияСтроки(Отдел, , "ПД=Родительный");
		Если РезультатСкл.Количество() > 0 Тогда
			Отдел = РезультатСкл[0];
		КонецЕсли; 			
		
		Заголовок = "График работы "+Отдел+" отделения ломбардов на "+Формат(Док.ПериодРегистрации, "ДФ='ММММ гггг'") + " года";
		
		ОбластьМакета.Параметры.Заголовок = Заголовок;
		ТабДокумент.Вывести(ОбластьМакета);
		
		КоличествоДнейвМесяце = День(КонецМесяца(Док.ПериодРегистрации));
		Для инд = 1 по КоличествоДнейвМесяце Цикл
			ДеньНед = ДеньНедели(Док.ПериодРегистрации+(инд-1)*86400); 
			Если ДеньНед = 6 или ДеньНед = 7 Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Шапка|КолонкаЧасыВыходной");
			Иначе
				ОбластьМакета = Макет.ПолучитьОбласть("Шапка|КолонкаЧасы");
			КонецЕсли;
			ОбластьМакета.Параметры.День = Инд;
			ОбластьМакета.Параметры.ДеньНедели = ДеньПрописью(Док.ПериодРегистрации+(инд-1)*86400);
			
			ТабДокумент.Присоединить(ОбластьМакета);
		КонецЦикла;  
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка|Право"); 
		ТабДокумент.Присоединить(ОбластьМакета);
		
		
		Подвал_ИтогоЧасовВломбарде = 0;
		ПодвалЧасовЛомбарда = 0;
		
		промЛомб = ""; 
		номСтрочки = 3; 
		ЧасовЛомбарда = 0;
		Пока График.Следующий() Цикл                              
			номСтрочки = номСтрочки + 1;
			ОбластьМакета = Макет.ПолучитьОбласть("Строка|Лево");
			Если промЛомб <> График.Ломбард Тогда
				Если промЛомб <> "" Тогда 
					НовСтрТЗЛ = тзЛомбардов.Добавить();
					НовСтрТЗЛ.Ломбард = промЛомб;
					НовСтрТЗЛ.ПоследняяСтрока = номСтрочки-1; 				
				КонецЕсли;
				промЛомб = График.Ломбард;
				НовСтрТЗЛ = тзЛомбардов.Добавить();
				НовСтрТЗЛ.Ломбард = График.Ломбард;
				НовСтрТЗЛ.ПерваяСтрока = номСтрочки;
			КонецЕсли;
			
			ЛомбардФактАдрес = "";
			ОтборК = Новый Структура;
			ОтборК.Вставить("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес); 
			ОтборК.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.ФактАдресЛомбарда);
			СтрокиК = График.Ломбард.КонтактнаяИнформация.НайтиСтроки(ОтборК);
			Если НЕ СтрокиК.Количество() = 0 Тогда 
	    		ЛомбардФактАдрес = СтрокиК.Получить(0).Представление;
			КонецЕсли;
                 				
			СтрокаЛомбарда = "№ "+СокрЛП(График.Ломбард.НомерЛомбарда) + " ("+СокрЛП(ЛомбардФактАдрес)+")"+Символы.ПС;  
			тзГрафикРаботы = СтрокиГрафикаРаботы(График.Ломбард);
			Для каждого строчГр из тзГрафикРаботы Цикл 
				СтрокаЛомбарда = СтрокаЛомбарда + строчГр.печДень+ Символы.ПС;				
			КонецЦикла;
			
			ОбластьМакета.Параметры.Ломбард   = СтрокаЛомбарда;
			ОбластьМакета.Параметры.Сотрудник = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(График.СотрудникНаим);  
			
			
			ТабДокумент.Вывести(ОбластьМакета);  
			Сотрудник_ИтогоЧасовВломбарде = 0;
			Для инд = 1 по КоличествоДнейвМесяце Цикл
				ДеньНед = ДеньНедели(Док.ПериодРегистрации+(инд-1)*86400); 
				Если ДеньНед = 6 или ДеньНед = 7 Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("Строка|КолонкаЧасыВыходной");
				Иначе 
					ОбластьМакета = Макет.ПолучитьОбласть("Строка|КолонкаЧасы");
				КонецЕсли;	
				ОбластьМакета.Параметры.Время = График["Время"+СокрЛП(инд)];  
				Сотрудник_ИтогоЧасовВломбарде = Сотрудник_ИтогоЧасовВломбарде + График["Часов"+СокрЛП(инд)]; 
			
				ТабДокумент.Присоединить(ОбластьМакета);
			КонецЦикла; 
			
			ОбластьМакета = Макет.ПолучитьОбласть("Строка|Право"); 
			Подвал_ИтогоЧасовВломбарде = Подвал_ИтогоЧасовВломбарде + Сотрудник_ИтогоЧасовВломбарде;
			ОбластьМакета.Параметры.Сотрудник_ИтогоЧасовВломбарде = Сотрудник_ИтогоЧасовВломбарде;  
			
			ИтогоЧасовСотр = ВернутьИтогоЧасовСотрудника(График.Сотрудник, ГрафикТЗ);
			//ПодвалЧасовЛомбарда = ПодвалЧасовЛомбарда + ИтогоЧасовСотр;
			ОбластьМакета.Параметры.Сотрудник_ИтогоЧасов = ИтогоЧасовСотр;	
			ОбластьМакета.Параметры.ЧасовЛомбарда = ВернутьИтогоЧасовЛомбарда(График.Ломбард, ГрафикТЗ);	
			ТабДокумент.Присоединить(ОбластьМакета);
		КонецЦикла; 
		
		НовСтрТЗЛ = тзЛомбардов.Добавить();
		НовСтрТЗЛ.Ломбард = График.Ломбард;
		НовСтрТЗЛ.ПоследняяСтрока = номСтрочки;  
		
		тзЛомбардов.Свернуть("Ломбард", "ПерваяСтрока, ПоследняяСтрока"); 
		
		КоличествоДнейвМесяце = День(КонецМесяца(График.ПериодРегистрации));
		
		ПодвалЧасовЛомбарда = 0; 
		запомниПоследнююСтроку = 0;
		Для каждого стр из тзЛомбардов Цикл
			//Объединить колонку ломбарда
			ОбластьОбъединения = ТабДокумент.Область(стр.ПерваяСтрока,1,стр.ПоследняяСтрока,1);
			ОбластьОбъединения.Объединить(); 
			
			ОбластьОбъединения = ТабДокумент.Область(стр.ПерваяСтрока,5+КоличествоДнейвМесяце,стр.ПоследняяСтрока,5+КоличествоДнейвМесяце);
			ОбластьОбъединения.Объединить(); 
			
			ЧасовЛомбарда = ВернутьИтогоЧасовЛомбарда(стр.Ломбард, ГрафикТЗ);
			ПодвалЧасовЛомбарда = ПодвалЧасовЛомбарда + ЧасовЛомбарда;
			запомниПоследнююСтроку = стр.ПоследняяСтрока; 
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Итого|Лево"); 
		ТабДокумент.Вывести(ОбластьМакета);
		
		Для инд = 1 по КоличествоДнейвМесяце Цикл 
			ОбластьМакета = Макет.ПолучитьОбласть("Итого|КолонкаЧасы"); 
			ТабДокумент.Присоединить(ОбластьМакета);
		КонецЦикла;   
		
		ОбластьМакета = Макет.ПолучитьОбласть("Итого|Право");   
		ОбластьМакета.Параметры.Подвал_ИтогоЧасовВломбарде = Подвал_ИтогоЧасовВломбарде;
		ОбластьМакета.Параметры.ПодвалЧасовЛомбарда = ПодвалЧасовЛомбарда;
		ТабДокумент.Присоединить(ОбластьМакета);
		
		
		тзСотрудники = ГрафикТЗ.Скопировать();
		тзСотрудники.Свернуть("Сотрудник");
		
		Для каждого стр из тзСотрудники Цикл 
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаОзнакомления");  
			ОбластьМакета.Параметры.Сотрудник =  ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СокрЛП(стр.Сотрудник));
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЦикла;	
		
		ОбластьОбъединения = ТабДокумент.Область(запомниПоследнююСтроку+2,1,запомниПоследнююСтроку+1+тзСотрудники.Количество(),6);
		ОбластьОбъединения.Объединить(); 
		
		
		Отделение = Док.Отделение;
		ОбластьМакета = Макет.ПолучитьОбласть("Начальник");   
		ОбластьМакета.Параметры.Отделение = ПолучитьСклоненияСтроки(Отделение.Наименование, , "ПД=Родительный")[0];
		ОбластьМакета.Параметры.Начальник = Отделение.Начальник;
		ТабДокумент.Присоединить(ОбластьМакета);
		
		
				   
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, График.Ссылка);
	КонецЦикла;
	
	Возврат ТабДокумент;

КонецФункции 

	
Функция ВернутьИтогоЧасовСотрудника(Сотрудник, ГрафикТЗ)
	отб = Новый Структура("Сотрудник", Сотрудник);
	НайдСтроки = ГрафикТЗ.НайтиСТроки(отб); 
	Итого = 0;
	Для каждого стр из НайдСтроки Цикл
		Для инд = 1 по 31 Цикл
			Итого = Итого + стр["Часов"+инд];
		КонецЦикла;
	КонецЦикла;
	Возврат Итого;
КонецФункции

Функция ВернутьИтогоЧасовЛомбарда(Ломбард, ГрафикТЗ)
	отб = Новый Структура("Ломбард", Ломбард);
	НайдСтроки = ГрафикТЗ.НайтиСТроки(отб); 
	Итого = 0;
	Для каждого стр из НайдСтроки Цикл
		Для инд = 1 по 31 Цикл
			Итого = Итого + стр["Часов"+инд];
		КонецЦикла;
	КонецЦикла;
	Возврат Итого;
КонецФункции

Функция ДеньПрописью(День)
	мнстр = "пн
	|вт
	|ср
	|чт
	|пт
	|сб
	|вс";
	Возврат СтрПолучитьСтроку(мнстр, ДеньНедели(День));
КонецФункции



