		 
&НаСервере
Функция СформируйПредставлениеВремени(ВидВремени, Часов, Территория)
	Возврат СформироватьПредставлениеВремени(ВидВремени, Часов, Территория);
КонецФункции 

&НаСервере
Функция СформироватьПредставлениеВремени(ВидВремени, Часов, Территория) Экспорт
	Рез = "";
	Если ЗначениеЗаполнено(ВидВремени) Тогда
		Если ВидВремени = Справочники.ЛБ_ВидыИспользованияРабочегоВремени.Явка Тогда
			Если Часов > 0 Тогда
				Рез = СокрЛП(Часов);
			КонецЕсли;
		Иначе
			Рез = СокрЛП(ВидВремени.БуквенныйКод);
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Территория) Тогда
			Рез = Рез +" "+"л"+СокрЛП(Территория.НомерЛомбарда);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Рез;	
КонецФункции


		 
Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	стрОшибка = "";
	
	КоличествоДнейвМесяце = День(КонецМесяца(ПериодРегистрации)); 

	Для каждого стр из ДанныеОВремени Цикл
		Если Не ЗначениеЗаполнено(Стр.Сотрудник) Тогда
			стрОшибка = "Не выбран сотрудник в строке: "+СокрЛП(стр.номерСтроки); 
			Сообщить(стрОшибка);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Стр.Ломбард) Тогда
			стрОшибка = "Не выбран ломбард в строке: "+СокрЛП(стр.номерСтроки); 
			Сообщить(стрОшибка);   
		КонецЕсли;
				
		Для номерДня = 1 по КоличествоДнейвМесяце Цикл 
			Если НЕ ЗначениеЗаполнено(стр["Территория"+НомерДня]) Тогда
	 
			
				Представл = СформируйПредставлениеВремени(стр["ВидВремени"+НомерДня], стр["Часов"+НомерДня], ""); 
				Если Представл <> стр["ВремяПредставление"+НомерДня] Тогда 
					стрОшибка = "Неверно заполнен день № "+СокрЛП(номерДня)+" в строке: "+СокрЛП(стр.номерСтроки); 
					Сообщить(стрОшибка); 
				КонецЕсли;
			КонецЕсли;
			
			///ВрПредст = стр["ВремяПредставление"+СокрЛП(номерДня)];
			//Если Не ЗначениеЗаполнено(ВрПредст) Тогда
			//	стрОшибка = "Не заполнен день № "+СокрЛП(номерДня)+" в строке: "+СокрЛП(стр.номерСтроки); 
			//	Сообщить(стрОшибка);  
			//КонецЕсли;			
		КонецЦикла;		
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ЭлектронныйГрафикРаботы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЛБ_ЭлектронныйГрафикРаботы КАК ЛБ_ЭлектронныйГрафикРаботы
	               |ГДЕ
	               |	ЛБ_ЭлектронныйГрафикРаботы.Ссылка <> &Ссылка
	               |	И ЛБ_ЭлектронныйГрафикРаботы.ПериодРегистрации = &ПериодРегистрации
	               |	И ЛБ_ЭлектронныйГрафикРаботы.Проведен = ИСТИНА
	               |	И ЛБ_ЭлектронныйГрафикРаботы.Отделение = &Отделение";
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации); 
	Запрос.УстановитьПараметр("Ссылка", Ссылка); 
	Запрос.УстановитьПараметр("Отделение", Отделение);  
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		стрОшибка = "Ошибка. Уже есть проведенный график в этом месяце"; 
		Сообщить(стрОшибка);  
	КонецЕсли;
	   
	
	Если стрОшибка <> "" Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
