
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("РеестрПлатежей") Тогда
		РеестрПлатежей = Параметры.РеестрПлатежей;
	КонецЕсли;	
	Если Параметры.Свойство("НомерЗБ") Тогда
		НомерЗБ = Параметры.НомерЗБ;
	КонецЕсли;	 
	Если Параметры.Свойство("ДатаПлатежа") Тогда
		ДатаПлатежа = Параметры.ДатаПлатежа;
	КонецЕсли;	 
	Если Параметры.Свойство("ИдентификаторПлатежа") Тогда
		ИдентификаторПлатежа = Параметры.ИдентификаторПлатежа;
	КонецЕсли;	 
	Если Параметры.Свойство("СуммаПлатежа") Тогда
		СуммаПлатежа = Параметры.СуммаПлатежа;
	КонецЕсли;	 
	Если Параметры.Свойство("Переплата") Тогда
		Переплата = Параметры.Переплата;
	КонецЕсли;	 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	Если НЕ ЗначениеЗаполнено(РеестрПлатежей) Тогда
		Предупреждение("Не выбран реестр платежей!", 60);
		Отказ = Истина;
	КонецЕсли;  
	ВывестиИсторию();
КонецПроцедуры

&НаСервере
Процедура ВывестиИсторию()  
	Элементы.ДекорацияПлатеж.Заголовок = "Реестр № " + СокрЛП(РеестрПлатежей.НомерРеестра) + " от " + Формат(РеестрПлатежей.Дата, "ДФ=dd.MM.yyyy") + 
	    Символы.ПС + "Платеж № " + СокрЛП(ИдентификаторПлатежа) + " от " + формат(ДатаПлатежа, "ДЛФ=DT") + " на сумму " + СокрЛП(Формат(СуммаПлатежа, "ЧЦ=15; ЧДЦ=2")) + " руб." +
		Символы.ПС + "Залоговый билет № " + СокрЛП(НомерЗБ) + 
		Символы.ПС + "Переплата " + СокрЛП(Формат(Переплата, "ЧЦ=15; ЧДЦ=2")) + " руб.";
	Запрос = новый Запрос;    
	Запрос.УстановитьПараметр("РеестрПлатежей", РеестрПлатежей);  
	Запрос.УстановитьПараметр("ДатаПлатежа", ДатаПлатежа);
	Запрос.УстановитьПараметр("ИдентификаторПлатежа", ИдентификаторПлатежа);
	Запрос.УстановитьПараметр("НомерЗБ", НомерЗБ);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РаспределениеПереплаты.Период КАК Дата,
	               |	ЛБ_РаспределениеПереплаты.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_РаспределениеПереплаты.Переплата КАК Переплата,
	               |	ЛБ_РаспределениеПереплаты.ОтменаСотрудникомЦО КАК ОтменаСотрудникомЦО,
	               |	ЛБ_РаспределениеПереплаты.Ответственный КАК Ответственный,
	               |	ЛБ_РаспределениеПереплаты.СтатусПлатежа КАК СтатусПлатежа
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеестрБезначныхПлатежейПереплаты КАК ЛБ_РаспределениеПереплаты
	               |ГДЕ
	               |	ЛБ_РаспределениеПереплаты.РеестрПлатежей = &РеестрПлатежей
	               |	И ЛБ_РаспределениеПереплаты.НомерЗБ = &НомерЗБ
	               |	И ЛБ_РаспределениеПереплаты.ДатаПлатежа = &ДатаПлатежа
	               |	И ЛБ_РаспределениеПереплаты.ИдентификаторПлатежа = &ИдентификаторПлатежа
	               |	И НЕ ЛБ_РаспределениеПереплаты.Регистратор = &РеестрПлатежей
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
   	ИсторияИзменений.Очистить();
	Для каждого Стр Из ТаблицаЗапроса Цикл 
		НоваяСтр = ИсторияИзменений.Добавить();  
		НоваяСтр.Дата = Стр.Дата;
		НоваяСтр.СтатусПлатежа = Стр.СтатусПлатежа; 
		НоваяСтр.Ответственный = Стр.Ответственный;
		НоваяСтр.Переплата = Стр.Переплата; 
		Если ЗначениеЗаполнено(Стр.ЗалоговыйБилет) И НЕ (СокрЛП(Стр.ЗалоговыйБилет.НомерЗалоговогоБилета) = СокрЛП(НомерЗБ)) Тогда 
			НоваяСтр.НомерЗБНовый = Стр.ЗалоговыйБилет.НомерЗалоговогоБилета; 
		КонецЕсли;	
	Конеццикла;	
КонецПроцедуры	