
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Документ") Тогда 
		Дата = Параметры.Документ.Дата;  
		Организация = Параметры.Документ.Организация;
		Категория = Параметры.Документ.Категория;
		Получатель = Параметры.Документ.ЛомбардКуда; 
		ЗаполнитьТаблицуНакладных();
	Иначе     
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНакладных()
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", Документ.Дата); 
	Запрос.УстановитьПараметр("Организация", Организация);   
	Запрос.УстановитьПараметр("Получатель", Получатель);  
	Запрос.УстановитьПараметр("ПустаяНакладная", Документы.ЛБ_НакладнаяНаОтгрузку.ПустаяСсылка());  
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОбъектыЗалогаВСумкеОстатки.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
	               |	ЛБ_ОбъектыЗалогаВСумкеОстатки.Отправитель КАК Отправитель,
	               |	ЛБ_ОбъектыЗалогаВСумкеОстатки.СкладОтправитель КАК СкладОтправитель,
	               |	ЛБ_ОбъектыЗалогаВСумкеОстатки.Получатель КАК Получатель,
	               |	ЛБ_ОбъектыЗалогаВСумкеОстатки.СкладПолучатель КАК СкладПолучатель,
	               |	СУММА(ЛБ_ОбъектыЗалогаВСумкеОстатки.КоличествоОстаток) КАК Количество
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОбъектыЗалогаВСумке.Остатки(
	               |			&Дата,
	               |			Организация = &Организация
	               |				И Получатель = &Получатель
	               |				И НЕ НакладнаяНаОтгрузку = &ПустаяНакладная) КАК ЛБ_ОбъектыЗалогаВСумкеОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ОбъектыЗалогаВСумкеОстатки.СкладОтправитель,
	               |	ЛБ_ОбъектыЗалогаВСумкеОстатки.Получатель,
	               |	ЛБ_ОбъектыЗалогаВСумкеОстатки.Отправитель,
	               |	ЛБ_ОбъектыЗалогаВСумкеОстатки.СкладПолучатель,
	               |	ЛБ_ОбъектыЗалогаВСумкеОстатки.НакладнаяНаОтгрузку
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ОбъектыЗалогаВСумкеОстатки.НакладнаяНаОтгрузку.Дата";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	ТаблицаНакладныхВСумке.Загрузить(ТаблицаЗапроса);     
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Этаформа.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСВыбором() 
	ТекСтрока = Элементы.ТаблицаНакладныхВСумке.ТекущиеДанные;
	СтруктураВозврата = Новый структура;
	СтруктураВозврата.Вставить("НакладнаяНаОтгрузку", ТекСтрока.НакладнаяНаОтгрузку); 
	СтруктураВозврата.Вставить("СкладПолучатель", ТекСтрока.СкладПолучатель);  
	
	Этаформа.Закрыть(СтруктураВозврата); 
КонецПроцедуры	
	
&НаКлиенте
Процедура Выбор(Команда) 
	ТекСтрока = Элементы.ТаблицаНакладныхВСумке.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда
	    ЗакрытьСВыбором();  
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНакладныхВСумкеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтрока = Элементы.ТаблицаНакладныхВСумке.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда
	    ЗакрытьСВыбором();  
	КонецЕсли;	
КонецПроцедуры
