#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПроверкаСтатуса(КоличествоЗалогов, КоличествоВыкупов)
	Если КоличествоЗалогов >= 3	Тогда
		Коэфф = КоличествоВыкупов/КоличествоЗалогов*100;					
		Если Коэфф <= 30 Тогда
			Возврат Справочники.ЛБ_СтатусыЗалогодателей.Невыкупающий;
		ИначеЕсли Коэфф >= 70 Тогда     
			СтатусЗ =  Справочники.ЛБ_СтатусыЗалогодателей.Добросовестный;   
			Если КоличествоЗалогов >= 5 И Коэфф >= 90 Тогда	
			    СтатусЗ = Справочники.ЛБ_СтатусыЗалогодателей.Постоянный;
			КонецЕсли;
			Возврат СтатусЗ;
		Иначе    
			Возврат Справочники.ЛБ_СтатусыЗалогодателей.Неопределенный;
		КонецЕсли;
	Иначе
		Возврат Справочники.ЛБ_СтатусыЗалогодателей.Новый;
	КонецЕсли;		
КонецФункции	
	
Функция РассчитатьСтатусы() 
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_АрхивныеДанныеКлиента.Клиент КАК Клиент,
	               |	ЛБ_АрхивныеДанныеКлиента.СхемаКредитования КАК СхемаКредитования,
	               |	ЛБ_АрхивныеДанныеКлиента.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета
	               |ИЗ
	               |	РегистрСведений.ЛБ_АрхивныеДанныеКлиента КАК ЛБ_АрхивныеДанныеКлиента
	               |ГДЕ
	               |	ЛБ_АрхивныеДанныеКлиента.Период <= &Дата
	               |АВТОУПОРЯДОЧИВАНИЕ";  
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат ТаблицаЗапроса;
КонецФункции
	
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)     
	Движения.ЛБ_СтатусыЗалогодателей.Записывать = Истина;

	ТаблицаСтатусов = РассчитатьСтатусы();  
	ТаблицаКлиентов = ТаблицаСтатусов.Скопировать();
	ТаблицаКлиентов.Свернуть("Клиент");	
	Для каждого СтрК Из ТаблицаКлиентов Цикл 
		КоличествоЗалогов = 0;   
		КоличествоВыкупов = 0;     
		
		Отбор = новый Структура;
		Отбор.Вставить("Клиент", СтрК.Клиент); 
		Строки = ТаблицаСтатусов.НайтиСтроки(Отбор); 
		Для каждого Выборка из строки Цикл
			Если НЕ (Выборка.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт) И 
				 НЕ (Выборка.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтвественноеХранение) И
				 НЕ (Выборка.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят) И 
				 НЕ (Выборка.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Отгружен) Тогда  
				Продолжить;
			КонецЕсли;	
			КоличествоЗалогов = КоличествоЗалогов + 1;   
			Если (Выборка.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт) ИЛИ (Выборка.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтвественноеХранение) Тогда 
			    КоличествоВыкупов = КоличествоВыкупов + 1; 
			КонецЕсли;	
		КонецЦикла;
		
		НовыйСтатус = ПроверкаСтатуса(КоличествоЗалогов, КоличествоВыкупов);  
		Если НЕ НовыйСтатус = неопределено Тогда 
			Движение = Движения.ЛБ_СтатусыЗалогодателей.Добавить();
			Движение.Период = Дата;
			Движение.Залогодатель = СтрК.Клиент;  
			Движение.Статус = НовыйСтатус;
		КонецЕсли;	
	Конеццикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
