
&НаКлиенте
Процедура Заполнить(Команда) 
	ВсеОК = Истина;
	Для каждого стр из ТаблицаСК Цикл  
		Если НЕ ЗначениеЗаполнено(Стр.СхемаКредитования) ИЛИ НЕ ЗначениеЗаполнено(Стр.Отклонение) тогда
			ВсеОК = Ложь;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	  
	Если Не ВсеОК Тогда
		Сообщить("Необходимо заполнить все обязательные реквизиты!", статуссообщения.Важное);
		Возврат;
	КонецЕсли;	
	СтруктураВозврата = Новый Структура; 
	СтруктураВозврата.Вставить("ТаблицаСК", ТаблицаСК);
	Закрыть(СтруктураВозврата);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСКПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И НЕ Копирование Тогда 
		Текстрока = Элементы.ТаблицаСК.ТекущиеДанные;
		Текстрока.Отклонение = ПредопределенноеЗначение("Перечисление.ЛБ_ОтклонениеОтБазовойЦены.Относительное");
	КонецЕсли;	
КонецПроцедуры
