
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("НакладнаяНаОтгрузку") Тогда
		НакладнаяНаОтгрузку = Параметры.НакладнаяНаОтгрузку;
	КонецЕсли;	 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	Если НЕ ЗначениеЗаполнено(НакладнаяНаОтгрузку) Тогда
		Предупреждение("Не выбрана накладная на отгрузку!", 60);
		Отказ = Истина;
	КонецЕсли;  
	ВывестиИсторию();
КонецПроцедуры

&НаСервере
Процедура ВывестиИсторию()  
	Элементы.ДекорацияНакладная.Заголовок = "История смены статусов накладной № " + СокрЛП(НакладнаяНаОтгрузку.ПредставлениеНомераНакладной) + " от " + Формат(НакладнаяНаОтгрузку.Дата, "ДФ=dd.MM.yyyy" ); 
	Запрос = новый Запрос;    
	Запрос.УстановитьПараметр("НакладнаяНаОтгрузку", НакладнаяНаОтгрузку);  
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СтатусыНакладнойНаОтгрузку.Период КАК Дата,
	               |	ЛБ_СтатусыНакладнойНаОтгрузку.СтатусНакладной КАК СтатусНакладной,
	               |	ЛБ_СтатусыНакладнойНаОтгрузку.ОтветственныйСотрудник КАК Ответственный,
	               |	ЛБ_СтатусыНакладнойНаОтгрузку.Комментарий КАК Комментарий
	               |ИЗ
	               |	РегистрСведений.ЛБ_СтатусыНакладнойНаОтгрузку КАК ЛБ_СтатусыНакладнойНаОтгрузку
	               |ГДЕ
	               |	ЛБ_СтатусыНакладнойНаОтгрузку.НакладнаяНаОтгрузку = &НакладнаяНаОтгрузку
	               |	И ЛБ_СтатусыНакладнойНаОтгрузку.Пустой = ЛОЖЬ
	               |АВТОУПОРЯДОЧИВАНИЕ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	ИсторияИзменений.Загрузить(ТаблицаЗапроса);
	Для каждого Стр Из ИсторияИзменений Цикл   
		Если Не ЗначениеЗаполнено(Стр.Ответственный) Тогда  
			Стр.Ответственный = "-";
		КонецЕсли;	
	КонецЦикла
КонецПроцедуры	