

&НаКлиенте
Процедура ВывестиПробы(Команда)
	ЗначениеОтбора = Новый Структура("Владелец", Объект.Ссылка);

    ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);

    ОткрытьФорму("Справочник.ЛБ_Пробы.ФормаСписка", ПараметрыФормы);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отбор = ДополнительныеМеталлы.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОсновнойМеталл");
    Отбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
    Отбор.Использование  = Истина;
    Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный; 
    Отбор.ПравоеЗначение = Объект.Ссылка;
КонецПроцедуры


&НаКлиенте
Процедура СоздатьДопМеталл(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Необходимо сначала записать элемент справочника");
		Возврат;
	КонецЕсли;
	Параметрыформы = новый структура;
	Параметрыформы.Вставить("ОсновнойМеталл", Объект.Ссылка);
	ОткрытьФорму("РегистрСведений.ЛБ_ДополнительныеМеталлыВИзделиях.ФормаЗаписи", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

