// Формирует и устанавливает текст заголовка формы документа
//
// Параметры:
//  СтрокаВидаОперации - строка вида операции документа, 
//  ДокументОбъект     - объект документа, 
//  ФормаДокумента     - форма документа.
//
Процедура УстановитьЗаголовокФормыДокумента(СтрокаВидаОперации = "", ДокументОбъект, ФормаДокумента) Экспорт

	ФормаДокумента.АвтоЗаголовок = Ложь; // заголовок будем писать сами
	
	Если ПустаяСтрока(СтрокаВидаОперации) Тогда
		Заголовок = ДокументОбъект.Ссылка.Метаданные().Синоним + ": ";
	Иначе
		Заголовок = ДокументОбъект.Ссылка.Метаданные().Синоним + ": " + СтрокаВидаОперации + ". ";
	КонецЕсли;
		
	Если ДокументОбъект.Ссылка.Пустая() Тогда  
		Заголовок = Заголовок + Нстр("ru='Новый';en='New'");
	Иначе
		Если ДокументОбъект.Проведен Тогда
			Заголовок = Заголовок + Нстр("ru='Проведен';en='Registered'");
		ИначеЕсли ДокументОбъект.Ссылка.Метаданные().Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить Тогда
			Заголовок = Заголовок + Нстр("ru='Не проведен';en='Not registered'");
		Иначе
			Заголовок = Заголовок + Нстр("ru='Записан';en='Saved'");
		КонецЕсли;
	КонецЕсли;
	
	ФормаДокумента.Заголовок = Заголовок;


КонецПроцедуры // УстановитьЗаголовокФормыДокумента()

// Проверяет заполнение обязательных полей
//
// Параметры:
//  ОбъектДляПроверки - Ссылка - объект, который необходимо проврить 
//  СтруктураОбязательныхПолейШапка     - обязательные поля шапки документа, 
//  СтруктураОбязательныхПолейТовары     - обязательные поля табличной части.
//
Функция НезаполненыОбязательныеПоля(ОбъектДляПроверки, СтруктураОбязательныхПолейШапка, СтруктураОбязательныхПолейТовары) Экспорт
	
	Для Каждого КлючЗначение Из СтруктураОбязательныхПолейШапка Цикл

		Значение = ОбъектДляПроверки[КлючЗначение.Ключ];

		Если Не ЗначениеЗаполнено(Значение) Тогда 

			Если Не ЗначениеЗаполнено(КлючЗначение.Значение) Тогда 
				СтрокаСообщения = "Не заполнено значение реквизита """ + СокрЛП(КлючЗначение.Ключ) + """!";
			Иначе
				СтрокаСообщения = КлючЗначение.Значение;
			КонецЕсли;

			ОбщегоНазначения.СообщитьПользователю(СтрокаСообщения);

		КонецЕсли;

	КонецЦикла;
	
	Если ЗначениеЗаполнено(СтруктураОбязательныхПолейТовары) Тогда
		
		Если ОбъектДляПроверки.Товары.Количество() <> 0 Тогда
			
			Для каждого КлючЗначение Из СтруктураОбязательныхПолейТовары Цикл
				
				Для Каждого Товар Из ОбъектДляПроверки.Товары Цикл
					
					Значение = Товар[КлючЗначение.Ключ];
					
					Если Не ЗначениеЗаполнено(Значение) Тогда 
						
						Если Не ЗначениеЗаполнено(КлючЗначение.Значение) Тогда 
							СтрокаСообщения = "В строке " + СокрЛП(Товар.НомерСтроки) + " не заполнено значение реквизита """ + СокрЛП(КлючЗначение.Ключ) + """!";
						Иначе
							СтрокаСообщения = КлючЗначение.Значение;
						КонецЕсли;
						
						ОбщегоНазначения.СообщитьПользователю(СтрокаСообщения);
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;

КонецФункции // НезаполненыОбязательныеПоля()
