
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Если Параметры.Свойство("Залогодатель") Тогда
		Залогодатель = Параметры.Залогодатель;  
	Иначе
		Сообщить("Не выбран клиент!");
		возврат;
	КонецЕсли;     
	
	ЗапросГ = Новый Запрос; 
	ЗапросГ.УстановитьПараметр("Залогодатель", Залогодатель);
	ЗапросГ.Текст = "ВЫБРАТЬ
	          |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство
	          |ИЗ
	          |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Владелец", Залогодатель);  	
	ПредыдущееРезидентство = Неопределено;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ДокументыЗалогодателей.ДокументЗалогодателя.Владелец КАК Залогодатель,
		|	ЛБ_ДокументыЗалогодателей.Гражданство КАК Гражданство,
		|	ЛБ_ДокументыЗалогодателей.Период КАК ПериодИзменения
		|ПОМЕСТИТЬ ВТ_ПериодыДокументов
		|ИЗ
		|	РегистрСведений.ЛБ_ДокументыЗалогодателей КАК ЛБ_ДокументыЗалогодателей
		|ГДЕ
		|	ЛБ_ДокументыЗалогодателей.ДокументЗалогодателя.Владелец = &Владелец
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛБ_ДокументыЗалогодателей.ДокументЗалогодателя.Владелец,
		|	ЛБ_ДокументыЗалогодателей.Гражданство,
		|	ЛБ_ДокументыЗалогодателей.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ПериодыДокументов.Залогодатель КАК Залогодатель,
		|	ВТ_ПериодыДокументов.Гражданство КАК Гражданство,
		|	ВТ_ПериодыДокументов.ПериодИзменения КАК ПериодИзменения
		|ИЗ
		|	ВТ_ПериодыДокументов КАК ВТ_ПериодыДокументов
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПериодИзменения";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ПредыдущееРезидентство = Неопределено Тогда
			
			НоваяСтрока = ТаблицаИзмененийРезиденства.Добавить();
			Если Выборка.Гражданство = Справочники.СтраныМира.Россия Тогда
				ДатаИзменения = Выборка.ПериодИзменения;
				Резидентство  = Перечисления.ЛБ_ВидыРезидентства.Резидент;
			Иначе
				ДатаИзменения = Выборка.ПериодИзменения;
				Резидентство  = ?(ЛБ_ОбщийМодуль.ПроверитьНаРезиденство(Выборка.Залогодатель, Выборка.ПериодИзменения), 
				Перечисления.ЛБ_ВидыРезидентства.Резидент, 
				Перечисления.ЛБ_ВидыРезидентства.Нерезидент);
			КонецЕсли;
			
			НоваяСтрока.Дата         = ДатаИзменения;
			НоваяСтрока.Резидентство = Резидентство; 
			НоваяСтрока.Гражданство  = Выборка.Гражданство;
		Иначе	   
			ЗапросГ.УстановитьПараметр("Дата", Выборка.ПериодИзменения);
			ВыборкаГ = ЗапросГ.Выполнить().Выбрать();
			Если ВыборкаГ.Следующий() Тогда
				Если НЕ Выборка.Гражданство = ВыборкаГ.Гражданство Тогда
					Продолжить;
				КонецЕсли;	
			КонецЕсли;	
			Если Выборка.Гражданство = Справочники.СтраныМира.Россия Тогда
				ДатаИзменения = Выборка.ПериодИзменения;
				Резидентство  = Перечисления.ЛБ_ВидыРезидентства.Резидент;
			Иначе
				ДатаИзменения = Выборка.ПериодИзменения;
				Резидентство  = ?(ЛБ_ОбщийМодуль.ПроверитьНаРезиденство(Выборка.Залогодатель, Выборка.ПериодИзменения), 
				Перечисления.ЛБ_ВидыРезидентства.Резидент, 
				Перечисления.ЛБ_ВидыРезидентства.Нерезидент);
			КонецЕсли;
			
			Если ПредыдущееРезидентство <> Резидентство Тогда
				НоваяСтрока = ТаблицаИзмененийРезиденства.Добавить();
				
				НоваяСтрока.Дата         = ДатаИзменения;
				НоваяСтрока.Резидентство = Резидентство; 
				НоваяСтрока.Гражданство  = Выборка.Гражданство;
			ИначеЕсли НЕ НоваяСтрока.Гражданство  = Выборка.Гражданство Тогда
				//НоваяСтрока.Дата         = ДатаИзменения;
				НоваяСтрока.Гражданство  = Выборка.Гражданство;
			КонецЕсли;
		КонецЕсли;
		
		ПредыдущееРезидентство = Резидентство;
    КонецЦикла;  
	
	ТаблицаИзмененийРезиденства.Сортировать("Дата Убыв");
КонецПроцедуры     


























