#Область ПрограммныйИнтерфейс

Процедура ОбработкаКоманд(ИмяКоманды, ПараметрыОтчета) Экспорт
	Если ИмяКоманды = "ПечатьСводнаяНакладная" Тогда
		ТабличныйДокумент = ЛБ_ЖурналНакладныхНаОтгрузкуСервер.ПечатьСводнаяНакладная(ПараметрыОтчета);
		КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЛБ_СводнаяНакладная");    
		КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
		КоллекцияПечатныхФорм[0].СинонимМакета = "Сводная накладная";
		УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено, Новый Структура("ЗаголовокФормы", "Сводная накладная"));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти