
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЭтоГруппа Тогда
		ИД = СтрЗаменить(ИД, " ", 			"");
		ИД = СтрЗаменить(ИД, Символы.НПП, 	"");
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		
		ПроверитьКорректностьИД(Отказ);
		
		Если НЕ Отказ Тогда
			ПроверитьУникальностьИД(Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьУникальностьИД(Отказ)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Наименование 
	|ИЗ 
	|	Справочник.ЛБ_ДополнительныеНастройки КАК ДополнительныеНастройки
	|ГДЕ 
	|	ИД = &ИД 
	|	И Ссылка <> &Ссылка");
	
	Запрос.УстановитьПараметр("ИД",       СокрЛП(ИД));
	Запрос.УстановитьПараметр("Ссылка",   Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ОбщегоНазначения.СообщитьОбОшибке("ИД """ + СокрЛП(ИД) + """ уже используется в настройке """ + Выборка.Наименование + """!", Отказ);	
	КонецЕсли;
			
КонецПроцедуры

Процедура ПроверитьКорректностьИД(Отказ)
	
	Если ПустаяСтрока(ИД) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не заполнен ИД!", Отказ);
		Возврат;
	КонецЕсли;
	
	Попытка
		СтруктураДляПроверки = Новый Структура(СокрЛП(ИД));
	Исключение
		ОбщегоНазначения.СообщитьОбОшибке("Ошибка в ИД!
		   			     				  |ИД должен состоять из одного слова, начинаться с буквы и не содержать никаких специальных символов, кроме ""_"".", Отказ);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
