
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Клиент") Тогда
         Клиент = Параметры.Клиент;
    КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗаполнитьИнформациюОСогласии(Клиент)	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СогласияНаИнформированиеСрезПоследних.Клиент.ДатаРождения КАК КлиентДатаРождения,
		|	ЛБ_СогласияНаИнформированиеСрезПоследних.Период КАК ДатаЗаключения,
		|	ЛБ_СогласияНаИнформированиеСрезПоследних.Ломбард КАК Ломбард,
		|	ЛБ_СогласияНаИнформированиеСрезПоследних.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	РегистрСведений.ЛБ_СогласияНаИнформирование.СрезПоследних(&ТекущаяДата, Клиент = &Клиент) КАК ЛБ_СогласияНаИнформированиеСрезПоследних";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтруктураДанных = Новый Структура;
		ДанныеКлиента = ЛБ_СоглашенияЭДОСервер.ДанныеКлиента(Клиент, Выборка.ДатаЗаключения);
		СтруктураДанных.Вставить("ДатаРождения",   Формат(ДанныеКлиента.ДатаРождения, "ДФ=dd.MM.yyyy"));
		СтруктураДанных.Вставить("ДатаЗаключения", Выборка.ДатаЗаключения);
		СтруктураДанных.Вставить("Ломбард",        Выборка.Ломбард);
		СтруктураДанных.Вставить("ДатаОкончания",  Выборка.ДатаОкончания);
		Возврат СтруктураДанных;
	КонецЕсли;
	
КонецФункции // ЗаполнитьИнформациюОбЭДО()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СтруктураДанных = ЗаполнитьИнформациюОСогласии(Клиент);
	Элементы.НадписьФИОКлиента.Заголовок = Строка(Клиент) + ", дата рождения " + Формат(СтруктураДанных.ДатаРождения, "ДЛФ=DD");
	Заключено                            = Строка(СтруктураДанных.ДатаЗаключения);
	ВЛомбарде                            = Строка(СтруктураДанных.Ломбард);
	ДействуетПо                          = Строка(Формат(СтруктураДанных.ДатаОкончания, "ДФ=dd.MM.yyyy"));
КонецПроцедуры

&НаКлиенте
Процедура Да(Команда)
	//ЛБ_СоглашенияЭДОКлиент.РасторгнутьЭДОКлиент(Клиент, ЭтаФорма);
	ЭтаФорма.Закрыть(Истина);
КонецПроцедуры

&НаКлиенте
Процедура Нет(Команда)
	ЭтаФорма.Закрыть(Ложь);
КонецПроцедуры

