
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ РольДоступна("Администрирование") Тогда
		Элементы.Код.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		СформироватьНаименование();
	КонецЕсли;	
	
	Для каждого Стр Из Объект.ПроцентныеСтавки Цикл
		Если Стр.СуммаОт = 0 И Стр.СуммаДо = 0 Тогда
			Сообщить("В строке таб. части № " + Строка(стр.НомерСтроки) + " необходимо задать или минимальную или максимальную сумму кредита!");
			Отказ = Истина;
			Прервать;
		КонецЕсли;	
	Конеццикла;	
КонецПроцедуры

&НаКлиенте
Процедура СхемаКредитованияПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура СтатусЗалогодателяПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименование()
	Наименование = "";
	Если ЗначениеЗаполнено(Объект.СхемаКредитования) Тогда
		Наименование = Наименование + "Заем """ + СокрЛП(Объект.СхемаКредитования) + """";
	КонецЕсли;	
	Если ЗначениеЗаполнено(Объект.СтатусЗалогодателя) Тогда
		Наименование = Наименование + ?(ПустаяСтрока(Наименование), "", ", ") + "статус заемщика """ + СокрЛП(Объект.СтатусЗалогодателя) + """";
	КонецЕсли;	 
	Объект.Наименование = Наименование;
КонецПроцедуры	

