
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь; 
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда  
		Объект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить(); 
		Объект.ЛомбардПользователя = ПараметрыСеанса.ТекущийЛомбард;
		Объект.Отделение = ПолучитьОтделение(Объект.ЛомбардПользователя);
		Объект.Ответственный = ПараметрыСеанса.ТекущийСотрудник;  
		
		Если ТекПользователь.ЭтоЛомбард Тогда
			Должность = ДолжностьРуководителя(ПараметрыСеанса.ТекущийСотрудник);   
			Если Должность = Неопределено Тогда
				Объект.ЛомбардПунктаНазначения = Объект.ЛомбардПользователя;
				Объект.Адрес = ЗаполнитьАдрес(Объект.ЛомбардПунктаНазначения);
				ДанныеРуководителя = РуководительОтделения(Объект.Отделение, Объект.Дата); 
				
				МассивФИО = Новый Массив; 
				МассивДолжностей = Новый Массив;
				
				Для Каждого Стр Из ДанныеРуководителя Цикл
					МассивФИО.Добавить(Стр.ФИО);
					МассивДолжностей.Добавить(Стр.Должность);  
				КонецЦикла;
				
				Элементы.Руководитель.РежимВыбораИзСписка = Истина;
				Элементы.Руководитель.СписокВыбора.ЗагрузитьЗначения(МассивФИО);
				Элементы.Должность.РежимВыбораИзСписка = Истина;
				Элементы.Должность.СписокВыбора.ЗагрузитьЗначения(МассивДолжностей);    
			Иначе    
				Объект.Руководитель = ПараметрыСеанса.ТекущийСотрудник; 
				Объект.Должность = Должность;
				Элементы.ЛомбардПунктаНазначения.ТолькоПросмотр = Истина;
			КонецЕсли;     
		КонецЕсли;   
		
		Объект.ВремяПрибытия = НачалоДня(ТекущаяДата());
		Объект.ВремяУбытия = НачалоДня(ТекущаяДата()); 
	Иначе
		Если ТекПользователь.ЭтоЛомбард Тогда
			Должность = ДолжностьРуководителя(ПараметрыСеанса.ТекущийСотрудник);
			Если ЗначениеЗаполнено(Объект.ПунктНазначения) Тогда
				Элементы.ЛомбардПунктаНазначения.ТолькоПросмотр = Истина;    
			КонецЕсли; 
		КонецЕсли;  
	КонецЕсли;
	
	Если ТекПользователь.ЭтоЛомбард Тогда   
		Если Должность = Неопределено Тогда
			ЧекБокс = Истина;    
			Элементы.ЧекБокс.ТолькоПросмотр = Истина;  
			Элементы.ЛомбардПунктаНазначения.ТолькоПросмотр = Истина;
			Элементы.ПунктНазначения.ТолькоПросмотр = Истина; 
			Элементы.Адрес.ТолькоПросмотр = Истина; 
		Иначе
			Если ЗначениеЗаполнено(Объект.ЛомбардПунктаНазначения) Тогда
				ЧекБокс = Истина; 
				Элементы.Адрес.ТолькоПросмотр = Истина;
				Элементы.ПунктНазначения.ТолькоПросмотр = Истина;    
			КонецЕсли;
			Элементы.Руководитель.ТолькоПросмотр = Истина;
			Элементы.Должность.ТолькоПросмотр = Истина; 
		КонецЕсли;  
	КонецЕсли; 
	
	Элементы.ЛомбардПунктаНазначения.РежимВыбораИзСписка = Истина;
	Элементы.ЛомбардПунктаНазначения.СписокВыбора.ЗагрузитьЗначения(СписокВыбораЛомбардов(Объект.Отделение)); 
	
	Если Объект.Проведен ИЛИ УправлениеДоступом.ЕстьРоль("ЛБ_СотрудникЦО")Тогда
		ЭтотОбъект.ТолькоПросмотр = Истина;
		Элементы.ЧекБокс.ТолькоПросмотр = Истина;
	КонецЕсли; 
	УстановитьСтатус(); 
КонецПроцедуры 

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		Если НЕ ЗначениеЗаполнено(Объект.Руководитель) Тогда
			ПоказатьПредупреждение(, СтрШаблон("Не заполнено поле %1!
			|Проведение документа невозможно.", "Руководитель"));  
			Отказ = Истина;
		ИначеЕсли 
			НЕ ЗначениеЗаполнено(Объект.Должность) Тогда
			ПоказатьПредупреждение(, СтрШаблон("Не заполнено поле %1!
			|Проведение документа невозможно.", "Должность"));  
			Отказ = Истина;
		ИначеЕсли 	
			НЕ ЗначениеЗаполнено(Объект.ВремяПрибытия) Тогда
			ПоказатьПредупреждение(, СтрШаблон("Не заполнено поле %1!
			|Проведение документа невозможно.", "Время прибытия"));  
			Отказ = Истина;
		ИначеЕсли 
			НЕ ЗначениеЗаполнено(Объект.ВремяУбытия) Тогда
			ПоказатьПредупреждение(, СтрШаблон("Не заполнено поле %1!
			|Проведение документа невозможно.", "Время убытия"));
			Отказ = Истина;
		ИначеЕсли 
			Объект.ВремяУбытия = Объект.ВремяПрибытия Тогда
			ПоказатьПредупреждение(, "Время убытия не может быть равно времени прибытия. Уточните время маршрута.");
			Отказ = Истина;
		ИначеЕсли 
			Объект.ВремяУбытия < Объект.ВремяПрибытия Тогда
			ПоказатьПредупреждение(, "Время убытия не может быть меньше времени прибытия. Уточните время маршрута.");
			Отказ = Истина;
		ИначеЕсли 
			НЕ ЗначениеЗаполнено(Объект.ПунктНазначения) И Элементы.ПунктНазначения.ТолькоПросмотр = Ложь Тогда
			ПоказатьПредупреждение(, СтрШаблон("Не заполнено поле %1!
			|Проведение документа невозможно.", "Пункт назначения"));
			Отказ = Истина;
		ИначеЕсли 
			НЕ ЗначениеЗаполнено(Объект.Адрес) Тогда
			ПоказатьПредупреждение(, СтрШаблон("Не заполнено поле %1!
			|Проведение документа невозможно.", "Адрес"));
			Отказ = Истина;		
		ИначеЕсли 
			НЕ ЗначениеЗаполнено(Объект.ЦельПоездки) Тогда
			ПоказатьПредупреждение(, СтрШаблон("Не заполнено поле %1!
			|Проведение документа невозможно.", "Цель поездки"));
			Отказ = Истина;
		ИначеЕсли 
			НЕ ЗначениеЗаполнено(Объект.ВидТранспорта) Тогда
			ПоказатьПредупреждение(, СтрШаблон("Не заполнено поле %1!
			|Проведение документа невозможно.", "Вид транспорта"));
			Отказ = Истина;
		Иначе
			Если Объект.Дата <= ТекущаяДата() Тогда
				Элементы.ДекорацияСтатусДокумента.Заголовок = "Факт"; 
				Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноБордовый;  
				Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.ТусклоРозовый; 
				ЭтотОбъект.ТолькоПросмотр = Истина;
				Элементы.ЧекБокс.ТолькоПросмотр = Истина; 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда		
		Если 
			НЕ ЗначениеЗаполнено(Объект.ВремяПрибытия) Тогда
			ПоказатьПредупреждение(, СтрШаблон("Не заполнено поле %1!
			|Запись документа невозможна.", "Время прибытия"));  
			Отказ = Истина; 
		ИначеЕсли 
			НЕ ЗначениеЗаполнено(Объект.ВремяУбытия) Тогда
			ПоказатьПредупреждение(, СтрШаблон("Не заполнено поле %1!
			|Запись документа невозможна.", "Время убытия"));
			Отказ = Истина;	
		ИначеЕсли
			Объект.ВремяУбытия = Объект.ВремяПрибытия Тогда
			ПоказатьПредупреждение(, "Время убытия не может быть равно времени прибытия. Уточните время маршрута.");
			Отказ = Истина;
		ИначеЕсли 
			Объект.ВремяУбытия < Объект.ВремяПрибытия Тогда
			ПоказатьПредупреждение(, "Время убытия не может быть меньше времени прибытия. Уточните время маршрута.");
			Отказ = Истина;			
		КонецЕсли;
	КонецЕсли;  	
КонецПроцедуры

&НаКлиенте
Процедура ЛомбардПунктаНазначенияПриИзменении(Элемент) 
	Если ЗначениеЗаполнено(Объект.ЛомбардПунктаНазначения) Тогда
		Объект.Адрес = ЗаполнитьАдрес(Объект.ЛомбардПунктаНазначения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЛомбардЧекБоксПриИзменении(Элемент)
	
	Если ЧекБокс = Истина Тогда
		Объект.ПунктНазначения = "";
		Объект.Адрес = "";
		Элементы.ЛомбардПунктаНазначения.ТолькоПросмотр = Ложь;
		Элементы.ПунктНазначения.ТолькоПросмотр = Истина;
		Элементы.Адрес.ТолькоПросмотр = Истина;   
		Если ЗначениеЗаполнено(Объект.ЛомбардПунктаНазначения) Тогда
			Объект.Адрес = ЗаполнитьАдрес(Объект.ЛомбардПунктаНазначения);
		КонецЕсли;
	Иначе
		Объект.ЛомбардПунктаНазначения = ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ПустаяСсылка");
		Объект.Адрес = "";
		Элементы.Адрес.ТолькоПросмотр = Ложь;  
		Элементы.ПунктНазначения.ТолькоПросмотр = Ложь;
		Элементы.ЛомбардПунктаНазначения.ТолькоПросмотр = Истина;      
	КонецЕсли;   
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатус()
	
	Если Объект.Проведен Тогда
		Элементы.ДекорацияСтатусДокумента.Заголовок = "Факт"; 
		Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноБордовый;  
		Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.ТусклоРозовый;
	Иначе
		Элементы.ДекорацияСтатусДокумента.Заголовок = "Проект"; 
		Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноЗеленый;
		Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.СветлоЗеленый;
	КонецЕсли;
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ДолжностьРуководителя(Сотрудник)  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_Сотрудник
	|ИЗ
	|	РегистрСведений.ЛБ_КадроваяИсторияСотрудников.СрезПоследних(, Сотрудник = &Сотрудник) КАК ЛБ_КадроваяИсторияСотрудниковСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Сотрудник.Сотрудник КАК Сотрудник,
	|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность
	|ИЗ
	|	ВТ_Сотрудник КАК ВТ_Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КадроваяИсторияСотрудников.СрезПоследних КАК ЛБ_КадроваяИсторияСотрудниковСрезПоследних
	|		ПО ВТ_Сотрудник.Сотрудник = ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник
	|ГДЕ
	|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыКадровыхСобытий.Увольнение)
	|	И (ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяНачальникомОтделения
	|			ИЛИ ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяЗаместителемНачальникаОтделения
	|			ИЛИ ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяУправляющимЛомбарда)";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Должность;
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста  
Функция ПолучитьОтделение(Ломбард) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	| ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
	|ИЗ
	| РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних КАК ЛБ_ОтделенияЛомбардовСрезПоследних
	|ГДЕ
	| ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард = &Ломбард";
	
	Запрос.УстановитьПараметр("Ломбард", Ломбард); 
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Отделение; 
	Иначе
		Возврат Справочники.ЛБ_ОтделенияЛомбардов.ПустаяСсылка();
	КонецЕсли; 
КонецФункции

&НаСервереБезКонтекста
Функция СписокВыбораЛомбардов(Отделение)
	
	СписокЛомбардов = Новый Массив; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	| ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард
	|ИЗ
	| РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних КАК ЛБ_ОтделенияЛомбардовСрезПоследних
	|ГДЕ
	| ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение = &Отделение";
	
	Запрос.УстановитьПараметр("Отделение", Отделение); 
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокЛомбардов.Добавить(Выборка.Ломбард);
	КонецЦикла;  
	
	Возврат СписокЛомбардов; 
КонецФункции 

&НаСервереБезКонтекста
Функция РуководительПользователь(Пользователь)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	| Пользователи.Сотрудник КАК Сотрудник,
	| ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность
	|ИЗ
	| Справочник.Пользователи КАК Пользователи
	|  ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КадроваяИсторияСотрудников.СрезПоследних КАК ЛБ_КадроваяИсторияСотрудниковСрезПоследних
	|  ПО Пользователи.Сотрудник = ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник
	|ГДЕ
	| Пользователи.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Пользователь); 
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДанныеРуководителя = Новый Структура("ФИО, Должность");
	
	Пока Выборка.Следующий() Цикл
		ДанныеРуководителя.Вставить("ФИО", Выборка.Сотрудник);
		ДанныеРуководителя.Вставить("Должность", Выборка.Должность);
	КонецЦикла; 
	
	Возврат ДанныеРуководителя; 
КонецФункции  

&НаСервереБезКонтекста
Функция РуководительОтделения(Отделение, Дата) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	| ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_Сотрудник
	|ИЗ
	| РегистрСведений.ЛБ_КадроваяИсторияСотрудников.СрезПоследних(
	|   &Дата,
	|   Подразделение В
	|    (ВЫБРАТЬ
	|     ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард
	|    ИЗ
	|     РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, Отделение = &Отделение) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
	|    ГДЕ
	|     НЕ ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.Закрыт)) КАК ЛБ_КадроваяИсторияСотрудниковСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	| ВТ_Сотрудник.Сотрудник КАК Сотрудник,
	| ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность
	|ИЗ
	| ВТ_Сотрудник КАК ВТ_Сотрудник
	|  ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КадроваяИсторияСотрудников.СрезПоследних КАК ЛБ_КадроваяИсторияСотрудниковСрезПоследних
	|  ПО ВТ_Сотрудник.Сотрудник = ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник
	|ГДЕ
	| ЛБ_КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыКадровыхСобытий.Увольнение)
	| И (ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяНачальникомОтделения
	|   ИЛИ ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяЗаместителемНачальникаОтделения
	|   ИЛИ ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяУправляющимЛомбарда)";
	
	Запрос.УстановитьПараметр("Отделение", Отделение); 
	Запрос.УстановитьПараметр("Дата", Дата); 
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДанныеРуководителя = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Руководитель = Новый Структура("ФИО, Должность", Выборка.Сотрудник, Выборка.Должность);
		ДанныеРуководителя.Добавить(Руководитель);
	КонецЦикла;
	
	Возврат ДанныеРуководителя; 
КонецФункции

&НаСервереБезКонтекста
Функция ЗаполнитьАдрес(ЛомбардПунктаНазначения)  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	| ЛБ_ЛомбардыКонтактнаяИнформация.Представление КАК Адрес
	|ИЗ
	| Справочник.ЛБ_Ломбарды.КонтактнаяИнформация КАК ЛБ_ЛомбардыКонтактнаяИнформация
	|ГДЕ
	| ЛБ_ЛомбардыКонтактнаяИнформация.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ЛомбардПунктаНазначения); 
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Адрес; 
	КонецЕсли; 
КонецФункции

