
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", Дата);  
	Запрос.УстановитьПараметр("Группа", Группа);  
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ГруппыЛомбардовСрезПоследних.Ломбард КАК Ломбард
	               |ИЗ
	               |	РегистрСведений.ЛБ_ГруппыЛомбардов.СрезПоследних(&Дата, Группа = &Группа) КАК ЛБ_ГруппыЛомбардовСрезПоследних
	               |ГДЕ
	               |	НЕ ЛБ_ГруппыЛомбардовСрезПоследних.Регистратор = &Регистратор";
	ТаблицаЛомбардов = Запрос.Выполнить().Выгрузить();
	
	Движения.ЛБ_ГруппыЛомбардов.Записывать = Истина;   
	Для каждого стр Из ЭтотОбъект.Ломбарды Цикл 
		Отбор = Новый Структура;
		Отбор.Вставить("Ломбард", стр.Ломбард);
		СтрокиЛ = ТаблицаЛомбардов.НайтиСтроки(Отбор);  
		Если СтрокиЛ.Количество() = 0 Тогда
			Движение = Движения.ЛБ_ГруппыЛомбардов.Добавить();
		    Движение.Период = Дата; 
			Движение.Ломбард = Стр.Ломбард;
			Движение.Группа = ЭтотОбъект.Группа;
		КонецЕсли;  
	КонецЦикла;	
	
	//Для каждого стр Из ТаблицаЛомбардов Цикл 
	//	Отбор = Новый Структура;
	//	Отбор.Вставить("Ломбард", стр.Ломбард);
	//	СтрокиЛ = ЭтотОбъект.Ломбарды.НайтиСтроки(Отбор);  
	//	Если СтрокиЛ.Количество() = 0 Тогда
	//		Движение = Движения.ЛБ_ГруппыЛомбардов.Добавить();
	//	    Движение.Период = Дата; 
	//		Движение.Ломбард = Стр.Ломбард;
	//		Движение.Группа = Справочники.ЛБ_ГруппыЛомбардов.ЛомбардыВнеГрупп;
	//	КонецЕсли;  
	//КонецЦикла;	
КонецПроцедуры
