
Процедура ОбработкаКоманд(СтруктураПараметров) Экспорт 
	
	ИмяКоманды = СтруктураПараметров.ИмяКоманды;
	
	Если СтруктураПараметров.Свойство("Залогодатель") Тогда
		Клиент = СтруктураПараметров.Залогодатель;
	КонецЕсли;

	Если СтруктураПараметров.Свойство("Форма") Тогда
		Форма = СтруктураПараметров.Форма;
	КонецЕсли;	
	
	Если ИмяКоманды = "ПечатьСогласиеНаОбработкуПД" Тогда
		ПечатьСогласияИзФормы(Клиент, Форма);
	ИначеЕсли ИмяКоманды = "ПечатьОтзывСогласияНаОбработкуПД" Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Клиент", Клиент);
		ДополнительныеПараметры.Вставить("Форма", Форма);
		ОписаниеОповещенияПечатьОтзываПД = Новый ОписаниеОповещения("ПечатьОтзываПДЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ОтозватьСогласие(Клиент, ОписаниеОповещенияПечатьОтзываПД);	
	ИначеЕсли ИмяКоманды = "ПечатьСогласиеНаОбработкуПД_ЗБ" Тогда
		ПечатьСогласияЗБИзФормы(СтруктураПараметров.ОперацияЗайма);
	ИначеЕсли ИмяКоманды = "ПечатьСогласияНаОпробование" Тогда
		ПечатьСогласияНаОпробование(Клиент);
	ИначеЕсли ИмяКоманды = "ОтзывСогласияНаОбработкуПД_ЦО" Тогда
		Если Не НужноФиксироватьОтзыв(Клиент) Тогда
			Возврат;
		КонецЕсли;
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Клиент", Клиент);
		ДополнительныеПараметры.Вставить("Комментарий", СтруктураПараметров.Комментарий);
		ДополнительныеПараметры.Вставить("Форма", Форма);
		ОбработатьОтзыв(ДополнительныеПараметры);
	КонецЕсли;
		
КонецПроцедуры

Процедура ОтозватьСогласие(Клиент, ОписаниеОповещенияПечатьОтзываПД = Неопределено) Экспорт
	ПечатьОтзыва(Клиент, ОписаниеОповещенияПечатьОтзываПД);
КонецПроцедуры

Процедура ПечатьОтзываПДЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не НужноФиксироватьОтзыв(ДополнительныеПараметры.Клиент) Тогда
		Возврат;
	КонецЕсли;
	
	Ответ = СпроситьФиксациюОтзыва();
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		СообщитьНеЗафиксирован();
		Возврат;
	КонецЕсли;
	
	ОбработатьОтзыв(ДополнительныеПараметры);
	
КонецПроцедуры

Функция НужноФиксироватьОтзыв(Клиент) Экспорт
	
	ДатаПоследнегоОтзыва = ЛБ_СогласияНаОбработкуПД_Сервер.ПериодОтзываСогласия(Клиент);
	
	Возврат Не (НачалоДня(ДатаПоследнегоОтзыва) = НачалоДня(ДатаПоследнегоОтзыва)
		И ДатаПоследнегоОтзыва <> Дата(1,1,1));
	
КонецФункции

Функция СпроситьФиксациюОтзыва() Экспорт
	
	Возврат Вопрос(
		"Фиксируется факт отзыва согласия на обработку персональных данных?",
		РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да
	);
	
КонецФункции

Процедура ОбработатьОтзыв(ДополнительныеПараметры) Экспорт
	
	Клиент = ДополнительныеПараметры.Клиент;
	
	Если ЕстьДействующееСогласиеНаИнформирование(Клиент) Тогда
		ОбработатьСОтзывомИнформирования(ДополнительныеПараметры);
	Иначе
		ПростоОтозватьПД(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

Функция ЕстьДействующееСогласиеНаИнформирование(Клиент) Экспорт
	
	Возврат ЛБ_СогласияНаИнформированиеСервер.НаличиеДействующегоСогласия(Клиент);
	
КонецФункции

Процедура ОбработатьСОтзывомИнформирования(ДополнительныеПараметры) Экспорт
	
	Клиент = ДополнительныеПараметры.Клиент;
	
	Ответ = Вопрос(
		"При отзыве согласия на обработку персональных данных действие Согласия на информирование по клиенту будет прекращено",
		РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК
	);
	
	Если Ответ <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	Если ОтозватьПД(ДополнительныеПараметры) Тогда
		ЛБ_СогласияНаИнформированиеСервер.ОтозватьСогласиеНаИнформированиеПослеОтзываПД(ДополнительныеПараметры.Клиент,
			ДополнительныеПараметры.Комментарий);
		СообщитьЗафиксирован();
		ОбновитьСтатус(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПростоОтозватьПД(ДополнительныеПараметры) Экспорт
	
	Если ОтозватьПД(ДополнительныеПараметры) Тогда
		СообщитьЗафиксирован();
	КонецЕсли;
	
КонецПроцедуры

Функция ОтозватьПД(ДополнительныеПараметры) Экспорт
	
	Возврат ЛБ_СогласияНаОбработкуПД_Сервер.ОтозватьСогласиеПД(ДополнительныеПараметры.Клиент,
		ДополнительныеПараметры.Комментарий);
	
КонецФункции

Процедура СообщитьЗафиксирован() Экспорт
	
	Вопрос(
		"Факт отзыва Согласия на обработку персональных данных зафиксирован.",
		РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК
	);
	
КонецПроцедуры

Процедура СообщитьНеЗафиксирован() Экспорт
	
	Вопрос(
		"Факт отзыва Согласия на обработку персональных данных не зафиксирован.",
		РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК
	);
	
КонецПроцедуры

Процедура ОбновитьСтатус(ДополнительныеПараметры) Экспорт
	
	ДополнительныеПараметры.Форма.Элементы.СтатусСогласия.Заголовок = "нет";
	
КонецПроцедуры

Процедура ПечатьСогласияНаОпробование(Клиент) 
	ТабличныйДокумент = ЛБ_СогласияНаОбработкуПД_Сервер.ПечатьСогласияНаОпробование(Клиент);
    КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЛБ_СогласияНаОпробование");    
    КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
    КоллекцияПечатныхФорм[0].СинонимМакета = "Согласия на опробование";
    УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено);
КонецПроцедуры

Процедура ПечатьОтзыва(Клиент, ОписаниеОповещенияПечатьОтзываПД = Неопределено)
	ТабличныйДокумент = ЛБ_СогласияНаОбработкуПД_Сервер.ПечатьОтзываСогласияНаОбработкуПД(Клиент);
    КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЛБ_ОтзывСогласияПД");    
    КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
    КоллекцияПечатныхФорм[0].СинонимМакета = "Заявление об отзыве согласия на обработку ПД";
    УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено,, ОписаниеОповещенияПечатьОтзываПД);
КонецПроцедуры // ПечатьСоглашения()

Процедура ПечатьСогласияИзФормы(Клиент, Форма)
	Согласие = ЛБ_СоглашенияЭДОСервер.НаличиеСоглашения(Клиент);
	Если Согласие = Истина Тогда
		СтруктураСогласияПД = ЛБ_СогласияНаОбработкуПД_Сервер.НаличиеДействующегоСогласия(Клиент);
		Если СтруктураСогласияПД.Результат = Истина Тогда
			ТабличныйДокумент = ЛБ_СогласияНаОбработкуПД_Сервер.ПечатьСогласиеНаОбработкуПД(Клиент);
			КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЛБ_СогласиеНаОбработкуПД");    
			КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
			КоллекцияПечатныхФорм[0].СинонимМакета = "Согласие на обработку ПД";
			КоллекцияПечатныхФорм[0].Экземпляров = 1;
			УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено,Форма);
		Иначе
			Вопрос("У клиента нет действующего Согласия на обработку персональных данных.",
			РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК);
		КонецЕсли;
	Иначе
		Вопрос("У клиента нет действующего соглашения об электронном взаимодействии (ЭДО). Печать согласия на обработку персональных данных, оформляемого при заключении ЭДО, невозможна.",
		РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК);
	КонецЕсли;
КонецПроцедуры

Процедура ПечатьСогласияЗБИзФормы(ОперацияЗайма)
	//Согласие = ЛБ_СоглашенияЭДОСервер.НаличиеСоглашения(Клиент);
	//Если Согласие = Истина Тогда	
    ТабличныйДокумент = ЛБ_СогласияНаОбработкуПД_Сервер.ПечатьСогласиеНаОбработкуПД_ЗБ(ОперацияЗайма);
    КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЛБ_СогласиеНаОбработкуПД_ЗБ");    
    КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
    КоллекцияПечатныхФорм[0].СинонимМакета = "Согласие на обработку ПД ЗБ";
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
    УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено);
	//Иначе
	//	Вопрос("У клиента нет действующего соглашения об электронном взаимодействии (ЭДО). Печать согласия на обработку персональных данных, оформляемого при заключении ЭДО, невозможна.",
	//	РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК);
	//КонецЕсли;
КонецПроцедуры
