Процедура СоздатьПользователя(ПараметрыПольз) Экспорт
	ВходВПрограммуРазрешен = истина;
	АутентификацияСтандартная = истина;
	АутентификацияWindows = ложь;
	ЗапрещеноИзменятьПароль = ложь;
	ПоказыватьВСпискеВыбора = истина;
	
	Если ПараметрыПольз.guid_Физлица <> "" Тогда
		GUID = Новый УникальныйИдентификатор(ПараметрыПольз.guid_Физлица);  				
		ФизическоеЛицо = Справочники.ФизическиеЛица.ПолучитьСсылку(GUID); 
	КонецЕсли;
	
	ОбновляемыеСвойства = Новый Структура();
	ОбновляемыеСвойства.Вставить("Действие", "Записать"); 
	ОбновляемыеСвойства.Вставить("ВходВПрограммуРазрешен", ВходВПрограммуРазрешен); 
	ОбновляемыеСвойства.Вставить("Имя", ПараметрыПольз.ИмяВходаПользователя); 
	ОбновляемыеСвойства.Вставить("ПолноеИмя", ПараметрыПольз.ИмяПользователя); 
	ОбновляемыеСвойства.Вставить("АутентификацияOpenID", ложь); 
	ОбновляемыеСвойства.Вставить("АутентификацияСтандартная", АутентификацияСтандартная); 
	ОбновляемыеСвойства.Вставить("АутентификацияWindows", АутентификацияWindows); 
	ОбновляемыеСвойства.Вставить("Пароль", ПараметрыПольз.Пароль); 
	ОбновляемыеСвойства.Вставить("ПарольУстановлен", истина); 
	ОбновляемыеСвойства.Вставить("ЗапрещеноИзменятьПароль", ЗапрещеноИзменятьПароль); 
	ОбновляемыеСвойства.Вставить("ПоказыватьВСпискеВыбора", ПоказыватьВСпискеВыбора);
	ОбновляемыеСвойства.Вставить("ФизическоеЛицо", 			ФизическоеЛицо);
	
	
	ПользовательИБСуществует = Пользователи.НайтиПоИмени(ПараметрыПольз.ИмяВходаПользователя) <> Неопределено;
	
	
	
	Пользователи.УстановитьСвойстваПользователяИБ(ПараметрыПольз.ИмяВходаПользователя, ОбновляемыеСвойства, НЕ ПользовательИБСуществует); //Создавать нового ставим всегда в Истина
	
	ТекПользователь = Справочники.Пользователи.НайтиПоНаименованию(ОбновляемыеСвойства.ПолноеИмя, истина);
	ПользовательСуществует = ЗначениеЗаполнено(ТекПользователь);
	
	Если НЕ ПользовательСуществует Тогда
		Пользователь = Справочники.Пользователи.СоздатьЭлемент();	
		Пользователь.Наименование = ОбновляемыеСвойства.ПолноеИмя; 
		Если ПараметрыПольз.guid_Физлица <> "" Тогда		
			Пользователь.ФизическоеЛицо = ФизическоеЛицо;
		КонецЕсли;
		Пользователь.ДополнительныеСвойства.Вставить(
		"ОписаниеПользователяИБ", ОбновляемыеСвойства);
		Пользователь.Записать();	
		ТекПользователь = Пользователь.Ссылка;
	КонецЕсли;
	
	ТекПрофиль = Справочники.ПрофилиГруппДоступа.НайтиПоНаименованию(ПараметрыПольз.ИмяПрофиля);
	УправлениеДоступом.ВключитьПрофильПользователю(ТекПользователь, ТекПрофиль);
	
КонецПроцедуры

Функция АдоНовоеСоединение(БазаДанныхSQL) Экспорт
	СоединениеSQL = Новый COMObject("ADODB.Connection");
	СоединениеSQL.ConnectionString =
	"driver={SQL Server};" +
	"server=192.168.0.244;"+
	"uid=elix;"+
	"pwd=123456;"+
	"database="+БазаДанныхSQL+";";
	СоединениеSQL.ConnectionTimeout = 30;
	СоединениеSQL.commandTimeout=600;
	СоединениеSQL.Open();
	Возврат СоединениеSQL ;
КонецФункции 

Функция АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса) Экспорт
	ЗаписиSQL = Новый COMObject("ADODB.Recordset");
	ЗаписиSQL.CursorLocation = 3;
	ЗаписиSQL.Open (ТекстЗапроса, АдоСоединение) ;
	возврат  ЗаписиSQL; 
КонецФункции 

Функция АдоВыполнитьКоманду(АдоСоединение, ТекстЗапроса)
	Возврат АдоСоединение.execute(ТекстЗапроса);
КонецФункции   

Процедура ИнициализироватьРегистрСоответствияВидовДокументовФизлиц() Экспорт
	СпрВид = Справочники.ВидыДокументовФизическихЛиц;
	
	
	Наим = "док.уд.лич.на.пер.рассм.заяв.";
	Если СпрВид.НайтиПоНаименованию(Наим) = СпрВид.ПустаяСсылка() Тогда
		СоздатьВидДокументаФизЛица(Наим, "32"); 
	КонецЕсли;
	
	Наим = "свид.рассм.ходат.призн.бежен.";
	Если СпрВид.НайтиПоНаименованию(Наим) = СпрВид.ПустаяСсылка() Тогда
		СоздатьВидДокументаФизЛица(Наим, "33"); 
	КонецЕсли; 
	
	Наим = "иной док.удост.личн.ин.гражд.";
	Если СпрВид.НайтиПоНаименованию(Наим) = СпрВид.ПустаяСсылка() Тогда
		СоздатьВидДокументаФизЛица(Наим, "34"); 
	КонецЕсли; 
	
	Наим = "Уд.личн.лица без гражд.";
	Если СпрВид.НайтиПоНаименованию(Наим) = СпрВид.ПустаяСсылка() Тогда
		СоздатьВидДокументаФизЛица(Наим, "36"); 
	КонецЕсли; 
	
	Наим = "пенс. удост.";
	Если СпрВид.НайтиПоНаименованию(Наим) = СпрВид.ПустаяСсылка() Тогда
		СоздатьВидДокументаФизЛица(Наим, "37"); 
	КонецЕсли;
	
	Наим = "миграционная карта";
	Если СпрВид.НайтиПоНаименованию(Наим) = СпрВид.ПустаяСсылка() Тогда
		СоздатьВидДокументаФизЛица(Наим, "88"); 
	КонецЕсли;
	
	Наим = "уведомление о прибытии";
	Если СпрВид.НайтиПоНаименованию(Наим) = СпрВид.ПустаяСсылка() Тогда
		СоздатьВидДокументаФизЛица(Наим, "41"); 
	КонецЕсли;
	
	Наим = "справка об инвалидности";
	Если СпрВид.НайтиПоНаименованию(Наим) = СпрВид.ПустаяСсылка() Тогда
		СоздатьВидДокументаФизЛица(Наим, "42"); 
	КонецЕсли;  
	
	Наим = "уд. ветерана боевых действий";
	Если СпрВид.НайтиПоНаименованию(Наим) = СпрВид.ПустаяСсылка() Тогда
		СоздатьВидДокументаФизЛица(Наим, "43"); 
	КонецЕсли;  
	
	Если ВернутьВидДокументаФизлицаПоКодуLX("03") = Неопределено Тогда
		СоздатьЗаписьСоответствияВидовДокументовФизЛиц("03", СпрВид.НайтиПоНаименованию("миграционная карта"));	
	КонецЕсли;
	Если ВернутьВидДокументаФизлицаПоКодуLX("07") = Неопределено Тогда 	
		СоздатьЗаписьСоответствияВидовДокументовФизЛиц("07", Справочники.ВидыДокументовФизическихЛиц.ВоенныйБилет);
	КонецЕсли;
	Если ВернутьВидДокументаФизлицаПоКодуLX("09") = Неопределено Тогда 	
		СоздатьЗаписьСоответствияВидовДокументовФизЛиц("09", Справочники.ВидыДокументовФизическихЛиц.ДипломатическийПаспорт); 
	КонецЕсли;
	Если ВернутьВидДокументаФизлицаПоКодуLX("10") = Неопределено Тогда 	
		СоздатьЗаписьСоответствияВидовДокументовФизЛиц("10", СпрВид.НайтиПоНаименованию("Иностранный паспорт"));
	КонецЕсли;
	Если ВернутьВидДокументаФизлицаПоКодуLX("12") = Неопределено Тогда 	
		СоздатьЗаписьСоответствияВидовДокументовФизЛиц("12", Справочники.ВидыДокументовФизическихЛиц.ВидНаЖительство); 
	КонецЕсли;
	Если ВернутьВидДокументаФизлицаПоКодуLX("13") = Неопределено Тогда 	
		СоздатьЗаписьСоответствияВидовДокументовФизЛиц("13", СпрВид.НайтиПоНаименованию("Удостоверение беженца"));
	КонецЕсли;
	Если ВернутьВидДокументаФизлицаПоКодуLX("14") = Неопределено Тогда 	
		СоздатьЗаписьСоответствияВидовДокументовФизЛиц("14", СпрВид.НайтиПоНаименованию("Временное удостоверение личности гражданина РФ"));
	КонецЕсли;
	Если ВернутьВидДокументаФизлицаПоКодуLX("15") = Неопределено Тогда 	
		СоздатьЗаписьСоответствияВидовДокументовФизЛиц("15", СпрВид.НайтиПоНаименованию("Разрешение на временное проживание в Российской Федерации"));
	КонецЕсли;
	Если ВернутьВидДокументаФизлицаПоКодуLX("18") = Неопределено Тогда 	
		СоздатьЗаписьСоответствияВидовДокументовФизЛиц("18", СпрВид.НайтиПоНаименованию("Свидетельство о предоставлении временного убежища на территории Российской Федерации"));
	КонецЕсли;
	Если ВернутьВидДокументаФизлицаПоКодуLX("21") = Неопределено Тогда 	
		СоздатьЗаписьСоответствияВидовДокументовФизЛиц("21", Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ); 
	КонецЕсли;
	Если ВернутьВидДокументаФизлицаПоКодуLX("22") = Неопределено Тогда 	
		СоздатьЗаписьСоответствияВидовДокументовФизЛиц("22", Справочники.ВидыДокументовФизическихЛиц.ЗагранпаспортРФ);
	КонецЕсли;
	Если ВернутьВидДокументаФизлицаПоКодуLX("24") = Неопределено Тогда 	
		СоздатьЗаписьСоответствияВидовДокументовФизЛиц("24", СпрВид.НайтиПоНаименованию("Удостоверение личности военнослужащего Российской Федерации"));
	КонецЕсли;
	Если ВернутьВидДокументаФизлицаПоКодуLX("32") = Неопределено Тогда 	
		СоздатьЗаписьСоответствияВидовДокументовФизЛиц("32", СпрВид.НайтиПоНаименованию("док.уд.лич.на.пер.рассм.заяв."));
	КонецЕсли;
	Если ВернутьВидДокументаФизлицаПоКодуLX("33") = Неопределено Тогда 	
		СоздатьЗаписьСоответствияВидовДокументовФизЛиц("33", СпрВид.НайтиПоНаименованию("свид.рассм.ходат.призн.бежен."));
	КонецЕсли;
	Если ВернутьВидДокументаФизлицаПоКодуLX("34") = Неопределено Тогда 	
		СоздатьЗаписьСоответствияВидовДокументовФизЛиц("34", СпрВид.НайтиПоНаименованию("иной док.удост.личн.ин.гражд.")); 
	КонецЕсли;
	Если ВернутьВидДокументаФизлицаПоКодуLX("36") = Неопределено Тогда 	
		СоздатьЗаписьСоответствияВидовДокументовФизЛиц("36", СпрВид.НайтиПоНаименованию("Уд.личн.лица без гражд.")); 
	КонецЕсли;
	Если ВернутьВидДокументаФизлицаПоКодуLX("37") = Неопределено Тогда 	
		СоздатьЗаписьСоответствияВидовДокументовФизЛиц("37", СпрВид.НайтиПоНаименованию("пенс. удост.")); 
	КонецЕсли;
	Если ВернутьВидДокументаФизлицаПоКодуLX("38") = Неопределено Тогда 	
		СоздатьЗаписьСоответствияВидовДокументовФизЛиц("38", Справочники.ВидыДокументовФизическихЛиц.СвидетельствоОРождении); 
	КонецЕсли;
	Если ВернутьВидДокументаФизлицаПоКодуLX("40") = Неопределено Тогда 	
		СоздатьЗаписьСоответствияВидовДокументовФизЛиц("40", СпрВид.НайтиПоНаименованию("Виза")); 
	КонецЕсли;
	Если ВернутьВидДокументаФизлицаПоКодуLX("41") = Неопределено Тогда 	
		СоздатьЗаписьСоответствияВидовДокументовФизЛиц("41", СпрВид.НайтиПоНаименованию("уведомление о прибытии"));  
	КонецЕсли;
	Если ВернутьВидДокументаФизлицаПоКодуLX("42") = Неопределено Тогда 	
		СоздатьЗаписьСоответствияВидовДокументовФизЛиц("42", СпрВид.НайтиПоНаименованию("справка об инвалидности"));
	КонецЕсли;
	Если ВернутьВидДокументаФизлицаПоКодуLX("43") = Неопределено Тогда 	
		СоздатьЗаписьСоответствияВидовДокументовФизЛиц("43", СпрВид.НайтиПоНаименованию("уд. ветерана боевых действий"));
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ИнициализироватьСправочникВидыИзделий() Экспорт
	
	АдоСоединение = АдоНовоеСоединение("ddmt_dan") ;
	
	ТекстЗапроса = "
	|	SELECT
	|		NameTov	    
	|   FROM [ddmt_dan].[dbo].[spKlassE]
	|   where [TpGr] = 'T' and xKod = 1 ";
	
	Выборка = АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса) ;
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
	
	ном = 0;
	Пока не Выборка.eof() Цикл 
		ном = ном + 1;
		
		СтрокаТЗ = ТЗ.Добавить();			
		СтрокаТЗ.Наименование = Выборка.fields("NameTov").value;  	
		
		Выборка.movenext();
	КонецЦикла; 
	
	АдоСоединение.Close() ;
	
	тз.Свернуть("Наименование"); 
	
	спрВидыИзделий = Справочники.ЛБ_ВидыИзделий;
	Для каждого стр из тз Цикл
		Если спрВидыИзделий.НайтиПоНаименованию(стр.Наименование,Истина) = спрВидыИзделий.ПустаяСсылка() Тогда
			НовЭлемент = спрВидыИзделий.СоздатьЭлемент();
			НовЭлемент.Наименование = стр.Наименование;
			НовЭлемент.Записать();
		КонецЕсли;		
	КонецЦикла; 	
КонецПроцедуры


Процедура СоздатьВидДокументаФизЛица(наименование, КодМВД)
	СпрВид = Справочники.ВидыДокументовФизическихЛиц;
	
	Если СпрВид.НайтиПоНаименованию(наименование) = СпрВид.ПустаяСсылка() Тогда
		Об = Справочники.ВидыДокументовФизическихЛиц.СоздатьЭлемент();
		Об.Наименование = наименование;
		Об.КодМВД       = КодМВД;
		Об.Записать();
	КонецЕсли;
КонецПроцедуры

Функция ВернутьВидДокументаФизлицаПоКодуLX(КодLX)
	КодLX = СокрЛП(КодLX);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_СоответствиеВидовДокументовФизлиц.ВидДокумента КАК ВидДокумента
	|ИЗ
	|	РегистрСведений.ЛБ_СоответствиеВидовДокументовФизлиц КАК ЛБ_СоответствиеВидовДокументовФизлиц
	|ГДЕ
	|	ЛБ_СоответствиеВидовДокументовФизлиц.КодLX = &КодLX";
	Запрос.УстановитьПараметр("КодLX", КодLX);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ВидДокумента;
	КонецЕсли;
	
	Возврат Неопределено;	
КонецФункции

Функция СоздатьЗаписьСоответствияВидовДокументовФизЛиц(КодLX, ВидДокумента)
	
	НовыйНаборЗаписей = РегистрыСведений.ЛБ_СоответствиеВидовДокументовФизлиц.СоздатьНаборЗаписей();
	НовыйНаборЗаписей.Отбор.КодLX.Установить(КодLX);
	НоваяЗаписьНабора = НовыйНаборЗаписей.Добавить();
	НоваяЗаписьНабора.КодLX = КодLX;
	НоваяЗаписьНабора.ВидДокумента = ВидДокумента; 
	НовыйНаборЗаписей.Записать();
	
КонецФункции

Функция ПаспортНедействителен(Параметры) Экспорт
	Серия = Параметры.Серия;
	Номер = Параметры.Номер;
	
	//+МАН 24.10.24 Закомментирована проверка паспартов т.к. база не актуальна. Заявка 2926
	//АдоСоединение = АдоНовоеСоединение("dPasp") ;
	//
	//ТекстЗапроса = "
	//|	SELECT PASSP_SERIES, PASSP_NUMBER	    
	//|   FROM [dPasp].[dbo].[pasp0]
	//|   where passp_series = '" + Серия + "' and Passp_number = '" + Номер + "'"; 
	//
	//
	//Выборка = АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса) ;
	
	
	Рез = Ложь;
	//Пока не Выборка.eof() Цикл 
	//	Рез = Истина;	
	//	
	//	Выборка.movenext();
	//КонецЦикла; 
	//
	//АдоСоединение.Close();
	//-МАН
	
	Возврат Рез;
КонецФункции

Функция ВернутьСтрокуСписокЛомбардов(Док)
	Результат = "";
	Для каждого Стр Из Док.Ломбарды Цикл
		Результат = Результат + ?(ПустаяСтрока(Результат), "", "; ") + ?(НЕ ПустаяСтрока(Стр.Ломбард.НаименованиеПолное), СокрЛП(Стр.Ломбард.НаименованиеПолное), СокрЛП(Стр.Ломбард.Наименование));
	КонецЦикла;	
	
	Возврат Результат; 
	
КонецФункции

&НаСервере
Функция ВводПриказаВДействие(Приказ)
	ДокОбъект = Приказ.ПолучитьОбъект(); 
	
	ДокОбъект.ВидПриказа = Перечисления.ЛБ_ВидыПриказа.Факт;
	
	ВсеОК = Истина;
	Попытка
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение); 
		Сообщить("Приказ введен в действие!");
	Исключение              
		ОшибкаПроведения = Истина; 
		Сообщить("Приказ не введен в действие!");
		Сообщить(ОписаниеОшибки(), Статуссообщения.Важное);
		ВсеОК = ложь;
	КонецПопытки;	
	Возврат ВсеОК;
КонецФункции

Процедура ВводПрейскурантовНаОсновании(Приказ)
	
	ДокОбъект = Приказ.ПолучитьОбъект(); 
	
	//металлы
	Если НЕ ДокОбъект.ЦеныМеталлы.Количество() = 0 Тогда 
		ЗапросДок = Новый Запрос;
		ЗапросДок.УстановитьПараметр("Приказ", ДокОбъект.Ссылка);
		ЗапросДок.Текст = "ВЫБРАТЬ
		|	ЛБ_ПрейскурантЦенНаМеталлы.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЛБ_ПрейскурантЦенНаМеталлы КАК ЛБ_ПрейскурантЦенНаМеталлы
		|ГДЕ
		|	ЛБ_ПрейскурантЦенНаМеталлы.Приказ = &Приказ
		|	И ЛБ_ПрейскурантЦенНаМеталлы.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_ПрейскурантЦенНаМеталлы.Дата УБЫВ";
		ВыборкаДок = ЗапросДок.Выполнить().Выбрать();
		Если  ВыборкаДок.Следующий() Тогда  
			ДокОбъектМ = ВыборкаДок.Ссылка.ПолучитьОбъект(); 
		Иначе	
			ДокОбъектМ = Документы.ЛБ_ПрейскурантЦенНаМеталлы.СоздатьДокумент();
		КонецЕсли;	 
		ДокОбъектМ.Дата = ДокОбъект.Дата;
		ДокОбъектМ.ЗаполнитьНаОсновании(ДокОбъект.Ссылка);
		
		Попытка
			ДокОбъектМ.Записать(РежимЗаписиДокумента.Проведение);
			Сообщить("Создан прейскурант цен на металлы № " + СокрЛП(ДокОбъектМ.Номер) + " от " + Строка(ДокОбъектМ.Дата) + ".");
		Исключение              
			ОшибкаПроведения = Истина; 
			Сообщить("Прейскурант цен на металлы не создан!");
			Сообщить(ОписаниеОшибки(), СтатусСообщения.Важное);
		КонецПопытки;	  
	КонецЕсли;	  
	
	//вставки
	Если НЕ ДокОбъект.ЦеныВставки.Количество() = 0 Тогда 
		ЗапросДок = Новый Запрос;
		ЗапросДок.УстановитьПараметр("Приказ", ДокОбъект.Ссылка);
		ЗапросДок.Текст = "ВЫБРАТЬ
		|	ЛБ_ПрейскурантЦенНаДрагоценныеКамни.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЛБ_ПрейскурантЦенНаДрагоценныеКамни КАК ЛБ_ПрейскурантЦенНаДрагоценныеКамни
		|ГДЕ
		|	ЛБ_ПрейскурантЦенНаДрагоценныеКамни.Приказ = &Приказ
		|	И ЛБ_ПрейскурантЦенНаДрагоценныеКамни.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_ПрейскурантЦенНаДрагоценныеКамни.Дата УБЫВ";
		ВыборкаДок = ЗапросДок.Выполнить().Выбрать();
		Если  ВыборкаДок.Следующий() Тогда  
			ДокОбъектВ = ВыборкаДок.Ссылка.ПолучитьОбъект(); 
		Иначе	
			ДокОбъектВ = Документы.ЛБ_ПрейскурантЦенНаДрагоценныеКамни.СоздатьДокумент();
		КонецЕсли;	 
		ДокОбъектВ.Дата = ДокОбъект.Дата;
		ДокОбъектВ.ЗаполнитьНаОсновании(ДокОбъект.Ссылка);
		
		Попытка
			ДокОбъектВ.Записать(РежимЗаписиДокумента.Проведение);
			Сообщить("Создан прейскурант цен на драгоценные камни № " + СокрЛП(ДокОбъектВ.Номер) + " от " + Строка(ДокОбъектВ.Дата) + ".");
		Исключение              
			ОшибкаПроведения = Истина; 
			Сообщить("Прейскурант цен на драгоценные камни не создан!");
			Сообщить(ОписаниеОшибки(), СтатусСообщения.Важное);
		КонецПопытки;	  
	КонецЕсли;	
	
	//процентные ставки
	Если НЕ ДокОбъект.СтавкиПроцентов.Количество() = 0 Тогда 
		ЗапросДок = Новый Запрос;
		ЗапросДок.УстановитьПараметр("Приказ", ДокОбъект.Ссылка);
		ЗапросДок.Текст = "ВЫБРАТЬ
		|	ЛБ_ПрейскурантПроцентныхСтавок.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЛБ_ПрейскурантПроцентныхСтавок КАК ЛБ_ПрейскурантПроцентныхСтавок
		|ГДЕ
		|	ЛБ_ПрейскурантПроцентныхСтавок.Приказ = &Приказ
		|	И ЛБ_ПрейскурантПроцентныхСтавок.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_ПрейскурантПроцентныхСтавок.Дата УБЫВ";
		ВыборкаДок = ЗапросДок.Выполнить().Выбрать();
		Если  ВыборкаДок.Следующий() Тогда  
			ДокОбъектС = ВыборкаДок.Ссылка.ПолучитьОбъект(); 
		Иначе	
			ДокОбъектС= Документы.ЛБ_ПрейскурантПроцентныхСтавок.СоздатьДокумент();
		КонецЕсли;	 
		ДокОбъектС.Дата = ДокОбъект.Дата;
		ДокОбъектС.ЗаполнитьНаОсновании(ДокОбъект.Ссылка);
		
		Попытка
			ДокОбъектС.Записать(РежимЗаписиДокумента.Проведение);
			Сообщить("Создан прейскурант процентных ставок № " + СокрЛП(ДокОбъектС.Номер) + " от " + Строка(ДокОбъектС.Дата) + ".");
		Исключение              
			ОшибкаПроведения = Истина; 
			Сообщить("Прейскурант процентных ставок не создан!");
			Сообщить(ОписаниеОшибки(), СтатусСообщения.Важное);
		КонецПопытки;	  
	КонецЕсли;	
	
КонецПроцедуры  

&НаСервере
Процедура ВводПрейскурантовНаОснованииАкция(Приказ)
	
	ДокОбъект = Приказ.ПолучитьОбъект(); 
	
	//металлы
	Если НЕ ДокОбъект.УсловияАкцииМеталлы.Количество() = 0 Тогда 
		ЗапросДок = Новый Запрос;
		ЗапросДок.УстановитьПараметр("Приказ", ДокОбъект.Ссылка);
		ЗапросДок.Текст = "ВЫБРАТЬ
		|	ЛБ_АкцииМеталлы.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЛБ_АкцииМеталлы КАК ЛБ_АкцииМеталлы
		|ГДЕ
		|	ЛБ_АкцииМеталлы.Приказ = &Приказ
		|	И ЛБ_АкцииМеталлы.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_АкцииМеталлы.Дата УБЫВ";
		ВыборкаДок = ЗапросДок.Выполнить().Выбрать();
		Если  ВыборкаДок.Следующий() Тогда  
			ДокОбъектМ = ВыборкаДок.Ссылка.ПолучитьОбъект(); 
		Иначе	
			ДокОбъектМ = Документы.ЛБ_АкцииМеталлы.СоздатьДокумент();
		КонецЕсли;	 
		ДокОбъектМ.Дата = ДокОбъект.Дата;
		ДокОбъектМ.ЗаполнитьНаОсновании(ДокОбъект.Ссылка);
		
		Попытка
			ДокОбъектМ.Записать(РежимЗаписиДокумента.Проведение);
			Сообщить("Создан документ акций на металлы № " + СокрЛП(ДокОбъектМ.Номер) + " от " + Строка(ДокОбъектМ.Дата) + ".");
		Исключение              
			ОшибкаПроведения = Истина; 
			Сообщить("Документ акций на металлы не создан!");
			Сообщить(ОписаниеОшибки(), СтатусСообщения.Важное);
		КонецПопытки;	  
	КонецЕсли;	
	
	//процентные ставки
	Если НЕ ДокОбъект.УсловияАкцииСтавки.Количество() = 0 Тогда 
		ЗапросДок = Новый Запрос;
		ЗапросДок.УстановитьПараметр("Приказ", ДокОбъект.Ссылка);
		ЗапросДок.Текст = "ВЫБРАТЬ
		|	ЛБ_АкцииПроцентныеСтавки.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЛБ_АкцииПроцентныеСтавки КАК ЛБ_АкцииПроцентныеСтавки
		|ГДЕ
		|	ЛБ_АкцииПроцентныеСтавки.Приказ = &Приказ
		|	И ЛБ_АкцииПроцентныеСтавки.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_АкцииПроцентныеСтавки.Дата УБЫВ";
		ВыборкаДок = ЗапросДок.Выполнить().Выбрать();
		Если  ВыборкаДок.Следующий() Тогда  
			ДокОбъектС = ВыборкаДок.Ссылка.ПолучитьОбъект(); 
		Иначе	
			ДокОбъектС= Документы.ЛБ_АкцииПроцентныеСтавки.СоздатьДокумент();
		КонецЕсли;	 
		ДокОбъектС.Дата = ДокОбъект.Дата;
		ДокОбъектС.ЗаполнитьНаОсновании(ДокОбъект.Ссылка);
		
		Попытка
			ДокОбъектС.Записать(РежимЗаписиДокумента.Проведение);
			Сообщить("Создан документ акций на процентные ставки № " + СокрЛП(ДокОбъектС.Номер) + " от " + Строка(ДокОбъектС.Дата) + ".");
		Исключение              
			ОшибкаПроведения = Истина; 
			Сообщить("Документ акций на процентные ставки не создан!");
			Сообщить(ОписаниеОшибки(), СтатусСообщения.Важное);
		КонецПопытки;	  
	КонецЕсли;	
	
КонецПроцедуры

Функция ВернутьГруппуПробы(Проба1С)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_ГруппыПробПробы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЛБ_ГруппыПроб.Пробы КАК ЛБ_ГруппыПробПробы
	|ГДЕ
	|	ЛБ_ГруппыПробПробы.Проба = &Проба";
	Запрос.УстановитьПараметр("Проба", Проба1С);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ВернутьСценарий(id_LX)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_СценарииОценки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЛБ_СценарииОценки КАК ЛБ_СценарииОценки
	|ГДЕ
	|	ЛБ_СценарииОценки.id_LX = &id_LX";
	Запрос.УстановитьПараметр("id_LX", id_LX);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции 



Функция ЗагрузитьСценарийПрейскуранта(ПараметрыЗагр) Экспорт
	
	Перезаписывать = Истина;
	Если ПараметрыЗагр.Свойство("Перезаписывать") Тогда
		Перезаписывать = ПараметрыЗагр.Перезаписывать;
	КонецЕсли;
	Если ПараметрыЗагр.Свойство("НачДата") Тогда
		НачДата = ПараметрыЗагр.НачДата;
	Иначе
		Сообщить("Заполните начальную дату загрузки");
		Возврат Ложь;
	КонецЕсли;
	
	Если ПараметрыЗагр.Свойство("КонДата") Тогда
		КонДата = ПараметрыЗагр.КонДата;
	Иначе
		КонДата = ТекущаяДата();
	КонецЕсли;
	
	
	АдоСоединение = АдоНовоеСоединение("dCBDL");
	
	//ssPRS  
	
	ТекстЗапроса = "SELECT [NRecPRS]
	|,[NPrs]
	|,[DPrs]
	|,[Stat]
	|,[Proc]
	|,[DLast]
	|,[WLast]
	|,[xDel]
	|,[pdSync0]
	|,[NDoc]
	|,[Osn]
	|,[ProcPens]
	|,[ProcGold]     
	|FROM [dCBDL].[dbo].[ssPRS] WHERE stat = 0 and [DPrs] >= '" + НачДата + "' and [DPrs] <= '" + КонДата + "' order by DPrs desc";		
	
	Выборка = АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса);
	
	тз = Новый ТаблицаЗначений;
	тз.Колонки.Добавить("id_LX", 			Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("СтрокаЛомбардов", 	Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("ДатаДок", 			Новый ОписаниеТипов("Дата"));
	тз.Колонки.Добавить("НомерПриказа", 	Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("Комментарий", 		Новый ОписаниеТипов("Строка"));
	
	Пока не Выборка.eof() Цикл
		НовСтр = тз.Добавить();
		НовСтр.СтрокаЛомбардов = Выборка.fields("pdSync0").value;
		НовСтр.ДатаДок         = Выборка.fields("DPrs").value; 
		НовСтр.id_LX           = СтрЗаменить(Выборка.fields("NRecPRS").value, Символы.НПП, "");
		НовСтр.НомерПриказа    = СтрЗаменить(Выборка.fields("NPrs").value, Символы.НПП, "");
		НовСтр.Комментарий     = Выборка.fields("Osn").value;
		
		Выборка.movenext();
	КонецЦикла;
	АдоСоединение.Close();
	
	ЕдИзмГрамм             		= Константы.ЛБ_ОсновнаяЕдиницаМеталлы.Получить();
	ВременноеПодразделение 		= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ОсновноеПодразделение");
	СхемаКлассика          		= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СхемаКредитования_Классика");
	СхемаЭкспресс          		= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СхемаКредитования_Экспресс");
	СтатусПочетный         		= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СтатусКлиента_Почетный");
	ПричинаПрименения      		= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ПричинаПрименения_Выдача"); 
	Акция_Промокод_Мыценим 		= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("Акция_Промокод_Мыценим");
	Акция_ЭтоАкция 				= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("Акция_ЭтоАкция"); 
	Акция_Сверхновый            = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("Акция_Сверхновый");
	Акция_ПочетныйВозвраст      = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("Акция_ПочетныйВозвраст");
	ДиапазонСумм_До3000    		= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ДиапазонСумм_До3000");
	ДиапазонСумм_До10000    	= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ДиапазонСумм_До10000");
	ДиапазонСумм_До25000    	= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ДиапазонСумм_До25000");
	ДиапазонСумм_До50000    	= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ДиапазонСумм_До50000");
	ДиапазонСумм_До100000    	= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ДиапазонСумм_До100000");
	ДиапазонСумм_Больше100000   = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ДиапазонСумм_Больше100000");
	
	Категория3                  = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("Категория3");
	ГруппаПроб_585              = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ГруппаПроб_585");
	ГруппаПроб_Платина          = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ГруппаПроб_Платина");
	ГруппаПроб_Серебро          = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ГруппаПроб_Серебро");
	
	тзСтавок = Новый ТаблицаЗначений;  
	тзСтавок.Колонки.Добавить("ДатаДок");  
	тзСтавок.Колонки.Добавить("НомерПриказа");
	тзСтавок.Колонки.Добавить("id_Приказа"); 
	тзСтавок.Колонки.Добавить("id_СтрокиПриказа");	
	тзСтавок.Колонки.Добавить("СтрокаЛомбардов"); 
	тзСтавок.Колонки.Добавить("Акция");
	тзСтавок.Колонки.Добавить("ВидЗайма");
	тзСтавок.Колонки.Добавить("Почетный");
	тзСтавок.Колонки.Добавить("Статус");
	тзСтавок.Колонки.Добавить("Промокод");
	тзСтавок.Колонки.Добавить("ДатаНачала");
	тзСтавок.Колонки.Добавить("ДатаКонца");
	тзСтавок.Колонки.Добавить("Ставка0");
	тзСтавок.Колонки.Добавить("Ставка1");
	тзСтавок.Колонки.Добавить("Ставка2");
	тзСтавок.Колонки.Добавить("Ставка3");
	тзСтавок.Колонки.Добавить("Ставка4");
	тзСтавок.Колонки.Добавить("Ставка5"); 
	
	тзПроб = ВернутьТЗПроб();
	
	
	Если тз.Количество() > 0 Тогда 
		Для каждого стр из тз Цикл			
			Док = ВернутьСценарий(стр.id_LX);
			Если Док = Неопределено Тогда
				Об       = Справочники.ЛБ_СценарииОценки.Создатьэлемент();
				Об.Дата  = стр.ДатаДок; 
				Об.id_LX = стр.id_LX;
			Иначе
				Если Не Перезаписывать Тогда
					Продолжить;
				КонецЕсли;
				Об = Док.ПолучитьОбъект();
				Об.БазовыеНастройки.Очистить();
				Об.ОценкаПоБазовойКатегории.Очистить();  
			КонецЕсли; 
			Об.Наименование = стр.Комментарий;  
			
			массив_id_Ломбардов = Новый Массив;
			Для инд = 0 по 400 Цикл     
				НольОдин = Сред(стр.СтрокаЛомбардов, инд, 1);
				Если СокрЛП(НольОдин) = "1" Тогда
					//id_ломбарда = инд + 1; 
					id_ломбарда = инд; 
					массив_id_Ломбардов.Добавить(СтрЗаменить(id_ломбарда, символы.НПП, "")); 
				КонецЕсли;
			КонецЦикла;
			
			//Для каждого элем из массив_id_Ломбардов Цикл
			//	СсылкаНаЛомбард   = ВернутьЛомбардПоID(элем);
			//	Если СсылкаНаЛомбард = Неопределено Тогда
			//		РеквизитыЛомбардаИзLX = ВернутьРеквизитыЛомбардаИзLX(элем);
			//		Ломб = Справочники.ЛБ_Ломбарды.СоздатьЭлемент();
			//		Ломб.Наименование = РеквизитыЛомбардаИзLX.Наименование;
			//		Ломб.НаименованиеПолное = Ломб.Наименование;
			//		Ломб.id_LX = элем; 
			//		Ломб.Подразделение = ВременноеПодразделение;
			//		Ломб.Записать();
			//		СсылкаНаЛомбард = Ломб.Ссылка;
			//	КонецЕсли;
			//	НовСтрЛом = Об.Ломбарды.Добавить();
			//	НовСтрЛом.Ломбард = СсылкаНаЛомбард;
			//КонецЦикла;		
			//
			//Об.СтрокаЛомбарды = ВернутьСтрокуСписокЛомбардов(Об);
			
			
			// получаем прейскурант на металлы
			АдоСоединение2 = АдоНовоеСоединение("dCBDL");
			
			ТекстЗапроса = "exec [zPrsProcPoz] '" + стр.id_LX +"', 0"; 	
			
			тзМеталлы = Новый ТаблицаЗначений;
			тзМеталлы.Колонки.Добавить("Металл");
			тзМеталлы.Колонки.Добавить("Проба", Новый ОписаниеТипов("Строка")); 
			тзМеталлы.Колонки.Добавить("ГруппаПроб"); 
			тзМеталлы.Колонки.Добавить("Категория");
			тзМеталлы.Колонки.Добавить("Оценка0", Новый ОписаниеТипов("Строка"));
			тзМеталлы.Колонки.Добавить("Оценка1", Новый ОписаниеТипов("Строка"));
			тзМеталлы.Колонки.Добавить("Сортировка", Новый ОписаниеТипов("Число"));
			
			Выборка = АдоВыполнитьЗапрос(АдоСоединение2, ТекстЗапроса);
			Пока не Выборка.eof() Цикл
				nrecprs = СтрЗаменить(Выборка.fields("nrecprs").value, символы.НПП, "");
				Если стр.id_LX = nrecprs Тогда
					
					НовСтрТЗМеталл = тзМеталлы.Добавить();
					
					Металл 						= Выборка.fields("NmMat").value; 
					НовСтрТЗМеталл.Проба  		= Выборка.fields("Proba").value;
					НовСтрТЗМеталл.Категория 	= Справочники.ЛБ_КатегорииОбъектовЗалога.НайтиПоНаименованию(Выборка.fields("NmKatG").value);
					НовСтрТЗМеталл.Оценка0      = Выборка.fields("Ocen0").value; 
					НовСтрТЗМеталл.Оценка1      = Выборка.fields("Ocen1").value;
					
					ТекМеталл = Справочники.ЛБ_ДрагоценныеМеталлы.НайтиПоНаименованию(Металл);
					
					Проба1С     = ВернутьПробу1С(ТекМеталл, НовСтрТЗМеталл.Проба, тзПроб); 
					НовСтрТЗМеталл.ГруппаПроб   = ВернутьГруппуПробы(Проба1С);   
					НовСтрТЗМеталл.Металл 		= ТекМеталл;
					
					
				КонецЕсли;
				Выборка.movenext();
			КонецЦикла;
			
			АдоСоединение2.Close();	
			
			тзМеталлы.Свернуть("Металл,ГруппаПроб,Категория,Оценка0");
			
			КлючСтр = 0;
			// Золото  		
			Строки3Категории = тзМеталлы.НайтиСтроки(Новый Структура("Категория, ГруппаПроб", Категория3, ГруппаПроб_585));
			ЗаполнитьОценкаПоБазовойКатегории(Об, тзМеталлы, Строки3Категории, КлючСтр); 
			
			// Серебро  		
			Строки3Категории = тзМеталлы.НайтиСтроки(Новый Структура("Категория, ГруппаПроб", Категория3, ГруппаПроб_Серебро));
			ЗаполнитьОценкаПоБазовойКатегории(Об, тзМеталлы, Строки3Категории, КлючСтр);
			
			// Платина  		
			Строки3Категории = тзМеталлы.НайтиСтроки(Новый Структура("Категория, ГруппаПроб", Категория3, ГруппаПроб_Платина));
			ЗаполнитьОценкаПоБазовойКатегории(Об, тзМеталлы, Строки3Категории, КлючСтр);
			
			//
			//Ном = 0;
			//Для каждого БигСтроч из Строки3Категории Цикл
			//	Ном = Ном + 1;
			//	НовСтр = Об.БазовыеНастройки.Добавить();	 	
			//	НовСтр.Металл 			= БигСтроч.Металл;
			//	НовСтр.БазоваяПроба 	= БигСтроч.ГруппаПроб;   				
			//	НовСтр.БазоваяКатегория = БигСТроч.Категория;
			//	НовСтр.БазоваяЦена 		= БигСтроч.Оценка0;
			//	НовСтр.ОтклонениеОтБазовойПоУмолчанию = Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Абсолютное;
			//	НовСтр.ПорядокОкругления = Перечисления.ПорядкиОкругления.Окр50; 
			//	НовСтр.ОкруглятьВБольшуюСторону = Истина;
			//	НовСтр.КлючСтроки        = Ном;
			//	
			//	Отбор = Новый Структура;
			//	Отбор.Вставить("Металл",    БигСтроч.Металл); 
			//	Отбор.Вставить("ГруппаПроб",БигСтроч.ГруппаПроб); 
			//	НайдСтрокиОстальные = тзМеталлы.НайтиСтроки(Отбор); 
			//	
			//	Для каждого МалСтр из НайдСтрокиОстальные Цикл
			//		НовОценка = Об.ОценкаПоБазовойКатегории.Добавить();	
			//	    НовОценка.КатегорияОбъектаЗалога 	= МалСтр.Категория;
			//		НовОценка.Проба 					= МалСтр.ГруппаПроб; 
			//		НовОценка.ОклонениеОтБазовой 		= Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Абсолютное;
			//		НовОценка.ЗначениеОтклонения        = МалСтр.Оценка0 - БигСтроч.Оценка0; 	
			//		НовОценка.ПорядокОкругления 		= Перечисления.ПорядкиОкругления.Окр50; 
			//		НовОценка.ОкруглятьВБольшуюСторону 	= Истина;
			//		НовОценка.КлючСтроки        			= Ном;
			//	КонецЦикла;							
			//КонецЦикла;
			
			
			Об.Записать();
		КонецЦикла; 	
	КонецЕсли; 
	
	
	
	Возврат Истина;
КонецФункции


Процедура ЗаполнитьОценкаПоБазовойКатегории(Об, тзМеталлы, Строки3Категории, КлючСтр) 
	
	Для каждого БигСтроч из Строки3Категории Цикл
		КлючСтр = КлючСтр + 1;
		НовСтр = Об.БазовыеНастройки.Добавить();	 	
		НовСтр.Металл 			= БигСтроч.Металл;
		НовСтр.БазоваяПроба 	= БигСтроч.ГруппаПроб;   				
		НовСтр.БазоваяКатегория = БигСТроч.Категория;
		НовСтр.БазоваяЦена 		= БигСтроч.Оценка0;
		НовСтр.ОтклонениеОтБазовойПоУмолчанию = Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Абсолютное;
		НовСтр.ПорядокОкругления = Перечисления.ПорядкиОкругления.Окр50; 
		НовСтр.ОкруглятьВБольшуюСторону = Истина;
		НовСтр.КлючСтроки        = КлючСтр;
		
		Отбор = Новый Структура;
		Отбор.Вставить("Металл",    БигСтроч.Металл); 
		//Отбор.Вставить("ГруппаПроб",БигСтроч.ГруппаПроб); 
		НайдСтрокиОстальные = тзМеталлы.НайтиСтроки(Отбор); 
		
		Для каждого МалСтр из НайдСтрокиОстальные Цикл
			НовОценка = Об.ОценкаПоБазовойКатегории.Добавить();	
			НовОценка.КатегорияОбъектаЗалога 	= МалСтр.Категория;  
			НовОценка.Металл 					= БигСтроч.Металл; 
			НовОценка.Проба 					= МалСтр.ГруппаПроб; 
			НовОценка.ОклонениеОтБазовой 		= Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Абсолютное;
			НовОценка.ЗначениеОтклонения        = МалСтр.Оценка0 - БигСтроч.Оценка0; 	
			НовОценка.ПорядокОкругления 		= Перечисления.ПорядкиОкругления.Окр50; 
			НовОценка.ОкруглятьВБольшуюСторону 	= Истина;
			НовОценка.КлючСтроки        			= КлючСтр;
		КонецЦикла;							
	КонецЦикла;
	
	
	
КонецПроцедуры


Функция ВернутьТЗПроб() 
	ЗапросПроб = Новый Запрос;
	ЗапросПроб.Текст ="ВЫБРАТЬ
	|	ЛБ_Пробы.Ссылка КАК Ссылка,
	|	ЛБ_Пробы.Владелец КАК Владелец,
	|	ЛБ_Пробы.Проба КАК Проба
	|ИЗ
	|	Справочник.ЛБ_Пробы КАК ЛБ_Пробы"; 
	Возврат ЗапросПроб.Выполнить().Выгрузить();
КонецФункции




Функция ЗагрузитьПрейскурантМеталлов(ПараметрыЗагр) Экспорт
	
	Перезаписывать = Истина;
	Если ПараметрыЗагр.Свойство("Перезаписывать") Тогда
		Перезаписывать = ПараметрыЗагр.Перезаписывать;
	КонецЕсли;
	Если ПараметрыЗагр.Свойство("НачДата") Тогда
		НачДата = ПараметрыЗагр.НачДата;
	Иначе
		Сообщить("Заполните начальную дату загрузки");
		Возврат Ложь;
	КонецЕсли;
	
	Если ПараметрыЗагр.Свойство("КонДата") Тогда
		КонДата = ПараметрыЗагр.КонДата;
	Иначе
		КонДата = ТекущаяДата();
	КонецЕсли;
	
	
	АдоСоединение = АдоНовоеСоединение("dCBDL");
	
	//ssPRS  
	
	ТекстЗапроса = "SELECT [NRecPRS]
	|,[NPrs]
	|,[DPrs]
	|,[Stat]
	|,[Proc]
	|,[DLast]
	|,[WLast]
	|,[xDel]
	|,[pdSync0]
	|,[NDoc]
	|,[Osn]
	|,[ProcPens]
	|,[ProcGold]  
	|,[KodUser]  
	//|FROM [dCBDL].[dbo].[ssPRS] WHERE [NRecPrs] = '41374'";
	|FROM [dCBDL].[dbo].[ssPRS] WHERE stat = 1 and [DPrs] >= '" + НачДата + "' and [DPrs] <= '" + КонДата + "' order by DPrs desc";		
	
	Выборка = АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса);
	
	тз = Новый ТаблицаЗначений;
	тз.Колонки.Добавить("id_LX", 			Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("СтрокаЛомбардов", 	Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("ДатаДок", 			Новый ОписаниеТипов("Дата"));
	тз.Колонки.Добавить("НомерПриказа", 	Новый ОписаниеТипов("Строка")); 
	тз.Колонки.Добавить("Osn", 				Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("Ответственный", 	Новый ОписаниеТипов("Строка"));
	
	
	Пока не Выборка.eof() Цикл
		НовСтр = тз.Добавить();
		НовСтр.СтрокаЛомбардов = Выборка.fields("pdSync0").value;
		НовСтр.ДатаДок         = Выборка.fields("DPrs").value; 
		НовСтр.id_LX           = СтрЗаменить(Выборка.fields("NRecPRS").value, Символы.НПП, "");
		НовСтр.НомерПриказа    = Лев(Выборка.fields("Osn").value,4); //СтрЗаменить(Выборка.fields("NPrs").value, Символы.НПП, "");
		НовСтр.Osn    		   = Выборка.fields("Osn").value;  
		НовСтр.Ответственный   = Выборка.fields("KodUser").value;
		
		Выборка.movenext();
	КонецЦикла;
	АдоСоединение.Close();
	
	Дата16102023                = Дата(2023,10,16);
	ЕдИзмГрамм             		= Константы.ЛБ_ОсновнаяЕдиницаМеталлы.Получить(); 
	ЕдИзмКарат            		= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ЕдиницаИзмерения_кар");
	ВременноеПодразделение 		= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ОсновноеПодразделение");
	СхемаКлассика          		= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СхемаКредитования_Классика");
	СхемаКлассика1День    		= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СхемаКредитования_1День_Классика");
	СхемаКлассикаГибкий         = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СхемаКредитования_Классика_Гибкий");
	СхемаКлассика1ДеньГибкий    = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СхемаКредитования_1День_Классика_Гибкий"); 
	СхемаКлассикаГибкий_5       = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СхемаКредитования_Классика_Гибкий_5");
	СхемаЭкспресс          		= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СхемаКредитования_Экспресс");
	СхемаЭкспрессГибкий         = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СхемаКредитования_Экспресс_Гибкий"); 
	СхемаЭкспрессГибкий_5       = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СхемаКредитования_Экспресс_Гибкий_5"); 
	СтатусПочетный         		= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СтатусКлиента_Почетный");
	СтатусЛьготный        		= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СтатусКлиента_Льготный");
	СтатусСверхновый        	= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СтатусКлиента_Сверхновый");
	ПричинаПрименения      		= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ПричинаПрименения_Выдача"); 
	Акция_Промокод_Мыценим 		= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("Акция_Промокод_Мыценим");
	Акция_ЭтоАкция 				= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("Акция_ЭтоАкция"); 
	Акция_Сверхновый            = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("Акция_Сверхновый");
	Акция_ПочетныйВозвраст      = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("Акция_ПочетныйВозвраст");
	ДиапазонСумм_До3000    		= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ДиапазонСумм_До3000");
	ДиапазонСумм_До10000    	= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ДиапазонСумм_До10000");
	ДиапазонСумм_До25000    	= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ДиапазонСумм_До25000");
	ДиапазонСумм_До50000    	= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ДиапазонСумм_До50000");
	ДиапазонСумм_До100000    	= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ДиапазонСумм_До100000");
	ДиапазонСумм_Больше100000   = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ДиапазонСумм_Больше100000"); 
	ШаблонПриказа_Классика      = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ШаблонПриказа_Классика");
	ШаблонПриказа_Классика_33   = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ШаблонПриказа_Классика_33");
	ШаблонПриказа_1День_Классика= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ШаблонПриказа_1День_Классика");
	ШаблонПриказа_Экспресс      = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ШаблонПриказа_Экспресс");
	
	
	
	Огранка_57 			= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("Огранка_57");
	КачествоОгранки_А   = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("КачествоОгранки_А");
	Огранка_17			= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("Огранка_17");
	КачествоОгранки_Б   = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("КачествоОгранки_Б");  
	Огранка_Фантаз      = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("Огранка_Фантаз");
	Огранка_Граненый    = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("Огранка_Граненый"); 
	
	тзПроб = ВернутьТЗПроб();
	
	тзСтавок = Новый ТаблицаЗначений;  
	тзСтавок.Колонки.Добавить("ДатаДок");  
	тзСтавок.Колонки.Добавить("НомерПриказа");
	тзСтавок.Колонки.Добавить("id_Приказа"); 
	тзСтавок.Колонки.Добавить("id_СтрокиПриказа");	
	тзСтавок.Колонки.Добавить("СтрокаЛомбардов"); 
	тзСтавок.Колонки.Добавить("Ответственный"); 
	тзСтавок.Колонки.Добавить("Акция");
	тзСтавок.Колонки.Добавить("ВидЗайма");
	тзСтавок.Колонки.Добавить("Почетный");
	тзСтавок.Колонки.Добавить("Статус");
	тзСтавок.Колонки.Добавить("Промокод");
	тзСтавок.Колонки.Добавить("ДатаНачала");
	тзСтавок.Колонки.Добавить("ДатаКонца");
	тзСтавок.Колонки.Добавить("Ставка0");
	тзСтавок.Колонки.Добавить("Ставка1");
	тзСтавок.Колонки.Добавить("Ставка2");
	тзСтавок.Колонки.Добавить("Ставка3");
	тзСтавок.Колонки.Добавить("Ставка4");
	тзСтавок.Колонки.Добавить("Ставка5"); 
	
	
	тзКамни = Новый ТаблицаЗначений; 
	тзКамни.Колонки.Добавить("ДатаДок");  
	тзКамни.Колонки.Добавить("НомерПриказа");
	тзКамни.Колонки.Добавить("id_Приказа"); 
	тзКамни.Колонки.Добавить("id_СтрокиПриказа");	
	тзКамни.Колонки.Добавить("СтрокаЛомбардов"); 
	тзКамни.Колонки.Добавить("КодВставки");  
	тзКамни.Колонки.Добавить("КодВставкиФорм");
	тзКамни.Колонки.Добавить("ВесОт"); 
	тзКамни.Колонки.Добавить("ВесДо");	
	тзКамни.Колонки.Добавить("Оценка"); 
	
	Если тз.Количество() > 0 Тогда 
		Для каждого стр из тз Цикл			
			Док = ВернутьПриказПоIDМеталлы(стр.id_LX);
			Если Док = Неопределено Тогда
				Об       = Документы.ЛБ_ПриказУсловияПредоставленияЗаймов.СоздатьДокумент();
				Об.Дата  = стр.ДатаДок; 
				Об.ЭтоПриказМеталлы = Истина;
				Об.id_LX = стр.id_LX;
			Иначе
				Если Не Перезаписывать Тогда
					Продолжить;
				КонецЕсли;
				Об = Док.ПолучитьОбъект();
				Об.Ломбарды.Очистить();
				Об.ЦеныМеталлы.Очистить();  
				Об.СтавкиПроцентов.Очистить(); 
				Об.НастройкаОтклоненийОтБазовыхЦенМеталлы.Очистить();
			КонецЕсли; 
			Об.ДатаНачалаДействияПриказа    = Об.Дата;
			Об.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.Базовый;
			//Об.Комментарий = стр.id_LX; 
			Об.Комментарий = стр.Osn; 
			Об.ВидПриказа = Перечисления.ЛБ_ВидыПриказа.Проект;  
			Об.НомерПриказа = стр.НомерПриказа;
			//Об.НомерПриказа = Лев(стр.Osn, 4); 
			Об.Ответственный  = Справочники.Пользователи.НайтиПоНаименованию(стр.Ответственный, Истина);
			Об.СхемыКредитования.Очистить();
			
			НовСтрСхКр = Об.СхемыКредитования.Добавить();
			//Если Об.Дата >= Дата(2023, 10, 01) Тогда
			//	НовСтрСхКр.ШаблонПроцентныеСтавки = ШаблонПриказа_Классика_33;	
			//Иначе    
			НовСтрСхКр.ШаблонПроцентныеСтавки = ШаблонПриказа_Классика;
			//КонецЕсли;				
			Если Об.Дата >= Дата(2023, 02, 01) Тогда
				НовСтрСхКр.СхемаКредитования = СхемаКлассикаГибкий; 
			Иначе 			
				НовСтрСхКр.СхемаКредитования = СхемаКлассика;
			КонецЕсли;
			
			НовСтрСхКр = Об.СхемыКредитования.Добавить();
			Если Об.Дата >= Дата(2023, 02, 01) Тогда
				Если Об.Дата >= Дата16102023 Тогда
					НовСтрСхКр.СхемаКредитования = СхемаКлассикаГибкий_5;
				Иначе 			
					НовСтрСхКр.СхемаКредитования = СхемаКлассика1ДеньГибкий; 
				КонецЕсли;
			Иначе 			
				НовСтрСхКр.СхемаКредитования = СхемаКлассика1День;
			КонецЕсли;
			НовСтрСхКр.ШаблонПроцентныеСтавки = ШаблонПриказа_1День_Классика;
			
			НовСтрСхКр = Об.СхемыКредитования.Добавить();
			Если Об.Дата >= Дата(2023, 02, 01) Тогда 
				Если Об.Дата >= Дата16102023 Тогда
					НовСтрСхКр.СхемаКредитования = СхемаЭкспрессГибкий_5;	
				Иначе  
					НовСтрСхКр.СхемаКредитования = СхемаЭкспрессГибкий;
				КонецЕсли;
			Иначе 			
				НовСтрСхКр.СхемаКредитования = СхемаЭкспресс;
			КонецЕсли;
			НовСтрСхКр.ШаблонПроцентныеСтавки = ШаблонПриказа_Экспресс;
			
			массив_id_Ломбардов = Новый Массив;
			Для инд = 0 по 400 Цикл     
				НольОдин = Сред(стр.СтрокаЛомбардов, инд, 1);
				Если СокрЛП(НольОдин) = "1" Тогда
					//id_ломбарда = инд + 1; 
					id_ломбарда = инд; 
					массив_id_Ломбардов.Добавить(СтрЗаменить(id_ломбарда, символы.НПП, "")); 
				КонецЕсли;
			КонецЦикла;
			
			КоличествоЛомбардов = 0;
			Для каждого элем из массив_id_Ломбардов Цикл
				СсылкаНаЛомбард   = ВернутьЛомбардПоID(элем);
				Если СсылкаНаЛомбард = Неопределено Тогда
					РеквизитыЛомбардаИзLX = ВернутьРеквизитыЛомбардаИзLX(элем);
					Ломб = Справочники.ЛБ_Ломбарды.СоздатьЭлемент();
					Ломб.Наименование = РеквизитыЛомбардаИзLX.Наименование;
					Ломб.НаименованиеПолное = Ломб.Наименование;   
					Ломб.НомерЛомбарда 		= РеквизитыЛомбардаИзLX.Номер;  
					Ломб.id_LX = элем; 
					Ломб.Подразделение = ВременноеПодразделение;
					Ломб.Записать();
					СсылкаНаЛомбард = Ломб.Ссылка;
				КонецЕсли;
				НовСтрЛом = Об.Ломбарды.Добавить();
				НовСтрЛом.Ломбард = СсылкаНаЛомбард;
				КоличествоЛомбардов = КоличествоЛомбардов + 1;
			КонецЦикла;		
			
			Об.СтрокаЛомбарды = ВернутьСтрокуСписокЛомбардов(Об);
			Об.КоличествоЛомбардов = КоличествоЛомбардов;
			
			
			// получаем прейскурант на металлы
			АдоСоединение2 = АдоНовоеСоединение("dCBDL");
			
			ТекстЗапроса = "exec [zPrsProcPoz] '" + стр.id_LX +"', 0"; 	
			
			тзМеталлы = Новый ТаблицаЗначений;
			тзМеталлы.Колонки.Добавить("Металл", Новый ОписаниеТипов("Строка"));
			тзМеталлы.Колонки.Добавить("Проба", Новый ОписаниеТипов("Строка")); 
			тзМеталлы.Колонки.Добавить("Категория", Новый ОписаниеТипов("Строка"));
			тзМеталлы.Колонки.Добавить("Оценка0", Новый ОписаниеТипов("Строка"));
			тзМеталлы.Колонки.Добавить("Оценка1", Новый ОписаниеТипов("Строка"));
			
			Выборка = АдоВыполнитьЗапрос(АдоСоединение2, ТекстЗапроса);
			Пока не Выборка.eof() Цикл
				nrecprs = СтрЗаменить(Выборка.fields("nrecprs").value, символы.НПП, "");
				Если стр.id_LX = nrecprs Тогда
					
					НовСтрТЗМеталл = тзМеталлы.Добавить();
					
					НовСтрТЗМеталл.Металл 		= Выборка.fields("NmMat").value; 
					НовСтрТЗМеталл.Проба  		= Выборка.fields("Proba").value;
					НовСтрТЗМеталл.Категория 	= Выборка.fields("NmKatG").value; 
					
					НовСтрТЗМеталл.Оценка0     = Выборка.fields("Ocen0").value; 
					НовСтрТЗМеталл.Оценка1     = Выборка.fields("Ocen1").value;  
				КонецЕсли;
				Выборка.movenext();
			КонецЦикла;
			
			АдоСоединение2.Close();	
			
			тзМеталлы.Свернуть("Металл,Проба,Категория,Оценка0,Оценка1");
			
			Для каждого строч из тзМеталлы Цикл	
				ТекМеталл = Справочники.ЛБ_ДрагоценныеМеталлы.НайтиПоНаименованию(строч.Металл);
				
				Проба1С     = ВернутьПробу1С(ТекМеталл, строч.Проба, тзПроб);
				
				НовСтр = Об.ЦеныМеталлы.Добавить();	 	
				НовСтр.Металл 			= ТекМеталл;
				НовСтр.Проба 			= Проба1С; 
				КатегорияОбъектаЗалога = ЛБ_ОбменLX.ВернутьКатегориюИзСоответствия(строч.Категория);
				//КатегорияОбъектаЗалога = Справочники.ЛБ_КатегорииОбъектовЗалога.НайтиПоНаименованию(строч.Категория); 	
				НовСтр.КатегорияОбъектаЗалога = КатегорияОбъектаЗалога;
				НовСтр.ЕдиницаИзмерения = ЕдИзмГрамм;
				НовСтр.Цена 			= строч.Оценка0; 
				
				Если строч.Оценка1 <> "" Тогда
					Отклонение = строч.Оценка1 - строч.Оценка0; 
					
					Если Отклонение <> 0 Тогда
						НовСтр = Об.НастройкаОтклоненийОтБазовыхЦенМеталлы.Добавить();	 	
						НовСтр.Металл 			= ТекМеталл;
						НовСтр.Проба 			= Проба1С;
						НовСтр.КатегорияОбъектаЗалога = КатегорияОбъектаЗалога;
						//					НовСтр.ЕдиницаИзмерения = ЕдИзмГрамм;
						//					НовСтр.Цена 			= Оценка1;
						Если Об.Дата >= Дата(2023, 02, 01) Тогда  
							Если Об.Дата >= Дата16102023 Тогда
								НовСтр.СхемаКредитования= СхемаЭкспрессГибкий_5;	
							Иначе
								НовСтр.СхемаКредитования= СхемаЭкспрессГибкий;
							КонецЕсли;
						Иначе
							НовСтр.СхемаКредитования= СхемаЭкспресс;
						КонецЕсли;
						НовСтр.ОтклонениеОтБазовойЦены = Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Абсолютное;
						НовСтр.Значениеотклонения = Отклонение; 
					КонецЕсли;
				КонецЕсли;				
			КонецЦикла;
			
			
			// получаем прейскурант по сумммам
			
			АдоСоединение3 = АдоНовоеСоединение("dCBDL");
			
			ТекстЗапроса = "SELECT [NRecPrsStav]
			|,[NRecPrs]
			|,[Srt]
			|,[Stav]
			|,[xPn]
			|,[St]
			|,[Ak]
			|,[DB]
			|,[DE]
			|,[xPr]
			|,[Stav2]
			|,[Stav3]
			|,[Stav4]
			|,[Stav5]
			|,[Stav1]
			|,[PromoKod]
			|FROM [dCBDL].[dbo].[ssPrsStav]  where NRecPRS = '" + СокрЛП(стр.id_LX) + "'"; 
			
			
			Выборка = АдоВыполнитьЗапрос(АдоСоединение3, ТекстЗапроса);
			Пока не Выборка.eof() Цикл  
				НовСтроч = тзСтавок.Добавить();
				НовСтроч.ДатаДок 	    = стр.ДатаДок; 
				НовСтроч.НомерПриказа 	= стр.НомерПриказа;
				НовСтроч.СтрокаЛомбардов = стр.СтрокаЛомбардов; 
				НовСтроч.Ответственный   = стр.Ответственный;
				НовСтроч.id_Приказа 	= СтрЗаменить(Выборка.fields("NRecPrs").value, Символы.НПП, "");
				НовСтроч.id_СтрокиПриказа = СтрЗаменить(Выборка.fields("NRecPrsStav").value, Символы.НПП, "");
				НовСтроч.ВидЗайма 	  	= Выборка.fields("Ak").value;
				НовСтроч.Акция   	  	= СокрЛП(Выборка.fields("xPr").value);
				НовСтроч.Почетный 	  	= Выборка.fields("xPn").value; 
				Статус			        = СокрЛП(Выборка.fields("St").value); 
				Если СокрЛП(Статус) = "-2" Тогда
					НовСтроч.Акция   	= "-2";
					Статус              = "";
				КонецЕсли;
				НовСтроч.Статус 	    = Статус;
				
				НовСтроч.ДатаНачала    	= Выборка.fields("DB").value; 
				НовСтроч.ДатаКонца     	= Выборка.fields("DE").value;
				НовСтроч.Ставка0  		= Выборка.fields("Stav").value; 
				НовСтроч.Ставка1  		= Выборка.fields("Stav1").value;
				НовСтроч.Ставка2  		= Выборка.fields("Stav2").value; 
				НовСтроч.Ставка3  		= Выборка.fields("Stav3").value;
				НовСтроч.Ставка4  		= Выборка.fields("Stav4").value;
				НовСтроч.Ставка5  		= Выборка.fields("Stav5").value;
				НовСтроч.Промокод 		= Выборка.fields("promoKod").value;				 
				
				Выборка.movenext();
			КонецЦикла;
			АдоСоединение3.Close(); 
			ЛБ_УправлениеЛомбардом.ЗаполнитьДополнительныеРеквизитыПриказа(Об);
			Об.Записать();
			
			
			
			АдоСоединение4 = АдоНовоеСоединение("dCBDL"); 		
			
			ТекстЗапроса = "SELECT [NRecPrsVst]
			|,[NRecPrs]
			|,[KodVst]
			|,[KodVstForm]
			|,[VesOt]
			|,[VesDo]
			|,[OcenPrs]
			|,[KredPrs]
			|,[nObj] 
			|FROM [dCBDL].[dbo].[ssPRSVst]  where NRecPrs = '" + СокрЛП(стр.id_LX) + "'";			
			
			Выборка = АдоВыполнитьЗапрос(АдоСоединение4, ТекстЗапроса);
			Пока не Выборка.eof() Цикл
				НовСтроч = тзКамни.Добавить();
				НовСтроч.ДатаДок 	    = стр.ДатаДок; 
				НовСтроч.НомерПриказа 	= стр.НомерПриказа;
				НовСтроч.СтрокаЛомбардов = стр.СтрокаЛомбардов;
				НовСтроч.id_Приказа 	= СтрЗаменить(Выборка.fields("NRecPrs").value, Символы.НПП, ""); 
				
				НовСтроч.КодВставки     = Выборка.fields("KodVst").value;
				НовСтроч.КодВставкиФорм = Выборка.fields("KodVstForm").value;
				НовСтроч.ВесОт     		= Выборка.fields("VesOt").value;
				НовСтроч.ВесДо     		= Выборка.fields("VesDo").value;
				НовСтроч.Оценка     	= Выборка.fields("OcenPrs").value; 					 
				
				Выборка.movenext();
			КонецЦикла;
			АдоСоединение4.Close(); 	
			
			
		КонецЦикла; 	
	КонецЕсли; 
	
	тзПриказов = тзСтавок.Скопировать();
	тзПриказов.Свернуть("id_Приказа, НомерПриказа, СтрокаЛомбардов, Ответственный, ДатаДок, ДатаНачала, ДатаКонца, Почетный, Промокод, Акция");
	
	Для каждого СтрокаПриказа из тзПриказов Цикл
		отб = Новый Структура("id_Приказа, НомерПриказа, СтрокаЛомбардов, Ответственный, ДатаНачала, ДатаКонца, Почетный, Промокод, Акция");
		ЗаполнитьЗначенияСвойств(отб, СтрокаПриказа);
		
		LX_СтрокиПриказа = "";
		НайденныеСтроки = тзСтавок.НайтиСтроки(Отб);
		Для каждого стр из НайденныеСТроки Цикл
			LX_СтрокиПриказа = LX_СтрокиПриказа + стрЗаменить(стр.id_СтрокиПриказа, Символы.НПП, "") + ",";			
		КонецЦикла; 
		Если  (Не ЗначениеЗаполнено(СтрокаПриказа.ДатаНачала)) 
			И (Не ЗначениеЗаполнено(СтрокаПриказа.ДатаКонца)) 
			И СокрЛП(СтрокаПриказа.Акция) = ""
			И (НЕ СтрокаПриказа.Почетный)
			И (НЕ ЗначениеЗаполнено(СтрокаПриказа.Промокод)) ТОГДА
			ЭтоБудетАкция = Ложь; 
			
			
			Док = ВернутьПриказПоIDМеталлы(стр.id_Приказа);
			Если Док = Неопределено Тогда
				Об       = Документы.ЛБ_ПриказУсловияПредоставленияЗаймов.СоздатьДокумент();
				Об.Дата  = стр.ДатаДок; 
				Об.ЭтоПриказМеталлы = Истина;
				Об.id_LX = стр.id_Приказа;   
				Об.LX_СтрокиПриказа = LX_СтрокиПриказа;
			Иначе
				Если Не Перезаписывать Тогда
					Продолжить;
				КонецЕсли;
				Об = Док.ПолучитьОбъект(); 
				Об.СтавкиПроцентов.Очистить(); 
			КонецЕсли;		
		Иначе		
			
			Док = ВернутьПриказПоIDСтавки(СтрокаПриказа.id_Приказа, LX_СтрокиПриказа);
			Если Док = Неопределено Тогда
				Об       			= Документы.ЛБ_ПриказУсловияПредоставленияЗаймов.СоздатьДокумент();
				Об.Дата  			= СтрокаПриказа.ДатаДок;
				Об.ВидОперации 		= Перечисления.ЛБ_ВидыОперацийПриказы.Базовый; 
				Об.ЭтоПриказСтавки 	= Истина;
				Об.id_LX 			= СтрокаПриказа.id_Приказа;
				Об.LX_СтрокиПриказа = LX_СтрокиПриказа;    
			Иначе 
				Если Не Перезаписывать Тогда
					Продолжить;
				КонецЕсли;
				Об = Док.ПолучитьОбъект(); 
				Об.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.Базовый;  
				Об.Ломбарды.Очистить();
				Об.ЦеныМеталлы.Очистить();  
				Об.СтавкиПроцентов.Очистить(); 
				Об.УсловияАкцииСтавки.Очистить();
			КонецЕсли;  
			Об.Комментарий = СтрокаПриказа.id_Приказа;  
			Если ЗначениеЗаполнено(СтрокаПриказа.ДатаНачала) Тогда
				Об.ДатаНачалаДействияПриказа    = СтроковыеФункцииКлиентСервер.СтрокаВДату(СтрокаПриказа.ДатаНачала);
			Иначе
				Об.ДатаНачалаДействияПриказа    = Об.Дата;
			КонецЕсли;
			Об.ДатаОкончанияДействияПриказа = СтроковыеФункцииКлиентСервер.СтрокаВДату(СтрокаПриказа.ДатаКонца);  
			Об.ВидПриказа = Перечисления.ЛБ_ВидыПриказа.Проект;    
			Об.НомерПриказа = СтрокаПриказа.НомерПриказа; 
			Об.Ответственный = СтрокаПриказа.Ответственный;
			
			Об.СхемыКредитования.Очистить();
			
			НовСтрСхКр = Об.СхемыКредитования.Добавить();
			Если Об.Дата >= Дата(2023, 02, 01) Тогда
				НовСтрСхКр.СхемаКредитования = СхемаКлассикаГибкий; 
			Иначе 			
				НовСтрСхКр.СхемаКредитования = СхемаКлассика;
			КонецЕсли; 
			НовСтрСхКр.ШаблонПроцентныеСтавки = ШаблонПриказа_Классика;		
			
			НовСтрСхКр = Об.СхемыКредитования.Добавить();
			Если Об.Дата >= Дата(2023, 02, 01) Тогда
				Если Об.Дата >= Дата16102023 Тогда
					НовСтрСхКр.СхемаКредитования = СхемаКлассикаГибкий_5;
				Иначе 			
					НовСтрСхКр.СхемаКредитования = СхемаКлассика1ДеньГибкий; 
				КонецЕсли;
			Иначе 			
				НовСтрСхКр.СхемаКредитования = СхемаКлассика1День;
			КонецЕсли;   
			НовСтрСхКр.ШаблонПроцентныеСтавки = ШаблонПриказа_1День_Классика;
			
			НовСтрСхКр = Об.СхемыКредитования.Добавить();
			Если Об.Дата >= Дата(2023, 02, 01) Тогда
				Если Об.Дата >= Дата16102023 Тогда
					НовСтрСхКр.СхемаКредитования = СхемаЭкспрессГибкий_5;	
				Иначе
					НовСтрСхКр.СхемаКредитования = СхемаЭкспрессГибкий;
				КонецЕсли;
			Иначе 			
				НовСтрСхКр.СхемаКредитования = СхемаЭкспресс;
			КонецЕсли;  
			НовСтрСхКр.ШаблонПроцентныеСтавки = ШаблонПриказа_Экспресс; 
			
			
			ЭтоБудетАкция = Ложь;
			Если ЗначениеЗаполнено(СтрокаПриказа.Промокод) Тогда
				Об.Акция 		= Акция_Промокод_Мыценим;
				Об.ВидОперации 	= Перечисления.ЛБ_ВидыОперацийПриказы.Акция;
				ЭтоБудетАкция  	= Истина;
			КонецЕсли; 
			Если СокрЛП(СтрокаПриказа.Акция) = "1" Тогда
				Об.Акция 		= Акция_ЭтоАкция;  
				Об.ВидОперации 	= Перечисления.ЛБ_ВидыОперацийПриказы.Акция;
				ЭтоБудетАкция  	= Истина;
			КонецЕсли;
			Если СокрЛП(СтрокаПриказа.Акция) = "-2" Тогда
				Об.Акция 		= Акция_Сверхновый;  
				Об.ВидОперации 	= Перечисления.ЛБ_ВидыОперацийПриказы.Акция;
				ЭтоБудетАкция  	= Истина;
			КонецЕсли;  
			Если СтрокаПриказа.Почетный Тогда
				Об.Акция        = Акция_ПочетныйВозвраст;
				Об.ВидОперации  = Перечисления.ЛБ_ВидыОперацийПриказы.Акция;
				ЭтоБудетАкция   = Истина;			
			КонецЕсли;
			
			массив_id_Ломбардов = Новый Массив;
			Для инд = 0 по 400 Цикл     
				НольОдин = Сред(СтрокаПриказа.СтрокаЛомбардов, инд, 1);
				Если СокрЛП(НольОдин) = "1" Тогда
					//id_ломбарда = инд + 1; 
					id_ломбарда = инд;
					массив_id_Ломбардов.Добавить(СтрЗаменить(id_ломбарда, символы.НПП, "")); 
				КонецЕсли;
			КонецЦикла;
			
			
			Для каждого элем из массив_id_Ломбардов Цикл
				СсылкаНаЛомбард   = ВернутьЛомбардПоID(элем);
				Если СсылкаНаЛомбард = Неопределено Тогда
					РеквизитыЛомбардаИзLX = ВернутьРеквизитыЛомбардаИзLX(элем);
					Ломб = Справочники.ЛБ_Ломбарды.СоздатьЭлемент();
					Ломб.Наименование 		= РеквизитыЛомбардаИзLX.Наименование;
					Ломб.НаименованиеПолное = Ломб.Наименование;
					Ломб.НомерЛомбарда 		= РеквизитыЛомбардаИзLX.Номер; 
					Ломб.id_LX 				= элем; 
					Ломб.Подразделение 		= ВременноеПодразделение;
					Ломб.Записать();
					СсылкаНаЛомбард = Ломб.Ссылка;
				КонецЕсли;
				НовСтрЛом = Об.Ломбарды.Добавить();
				НовСтрЛом.Ломбард = СсылкаНаЛомбард;
			КонецЦикла;	
			
			Об.СтрокаЛомбарды = ВернутьСтрокуСписокЛомбардов(Об);
			
		КонецЕсли;
		
		Для каждого стр из НайденныеСТроки Цикл
			
			//Если стр.Почетный Тогда
			//	СтатусКлиента = СтатусПочетный;
			//Иначе
			СтатусКлиента = ВернутьСтатусЗалогодателя(стр.Статус, СтатусЛьготный, СтатусСверхновый);				
			//КонецЕсли;   
			
			Если ЭтоБудетАкция Тогда
				ТабЧасть = Об.УсловияАкцииСтавки;
			Иначе 
				ТабЧасть = Об.СтавкиПроцентов;
			КонецЕсли;
			
			Если Об.Дата >= Дата(2023, 02, 01) Тогда 
				СхемаКредитования = ВернутьГибкуюСхему(стр.ВидЗайма, стр.Статус, СхемаЭкспрессГибкий, СхемаКлассикаГибкий, СхемаКлассика1ДеньГибкий, СхемаЭкспрессГибкий_5, СхемаКлассикаГибкий_5, Об.Дата); 
			Иначе			
				СхемаКредитования = ВернутьСхему(стр.ВидЗайма, стр.Статус, СхемаЭкспресс, СхемаКлассика, СхемаКлассика1День);
			КонецЕсли;
			
			Для каждого СтрокаПричиныПрименения из СхемаКредитования.ПричиныПримененияПроцентнойСхемы Цикл 		
				
				Парамс = Новый Структура;
				Парамс.Вставить("ПричинаПрименения", СтрокаПричиныПрименения.ПричинаПрименения);
				Парамс.Вставить("СхемаКредитования", СхемаКредитования);
				
				Парамс.Вставить("СтатусКлиента",  	 	СтатусКлиента);
				Парамс.Вставить("ДиапазонСумм",       	ДиапазонСумм_До3000); 
				Парамс.Вставить("Ставка",       		стр.Ставка0);
				Парамс.Вставить("ЭтоБудетАкция",       	ЭтоБудетАкция); 
				Парамс.Вставить("ДеньНачалаПрименения", 1);
				
				НоваяСтр = ТабЧасть.Добавить(); 
				ЗаполнитьСтрокуСтавокПроцентов(НоваяСтр, Парамс);
				
				Парамс.Вставить("ДиапазонСумм",       	ДиапазонСумм_До10000); 
				Парамс.Вставить("Ставка",       		стр.Ставка1);			
				НоваяСтр = ТабЧасть.Добавить(); 
				ЗаполнитьСтрокуСтавокПроцентов(НоваяСтр, Парамс);
				
				Парамс.Вставить("ДиапазонСумм",       	ДиапазонСумм_До25000); 
				Парамс.Вставить("Ставка",       		стр.Ставка2); 			
				НоваяСтр = ТабЧасть.Добавить();
				ЗаполнитьСтрокуСтавокПроцентов(НоваяСтр, Парамс); 
				
				Парамс.Вставить("ДиапазонСумм",       	ДиапазонСумм_До50000); 
				Парамс.Вставить("Ставка",      		 	стр.Ставка3); 			
				НоваяСтр = ТабЧасть.Добавить(); 
				ЗаполнитьСтрокуСтавокПроцентов(НоваяСтр, Парамс); 
				
				Парамс.Вставить("ДиапазонСумм",       	ДиапазонСумм_До100000); 
				Парамс.Вставить("Ставка",       		стр.Ставка4); 			
				НоваяСтр = ТабЧасть.Добавить(); 
				ЗаполнитьСтрокуСтавокПроцентов(НоваяСтр, Парамс); 
				
				Парамс.Вставить("ДиапазонСумм",       	ДиапазонСумм_Больше100000); 
				Парамс.Вставить("Ставка",       		стр.Ставка5); 			
				НоваяСтр = ТабЧасть.Добавить(); 
				ЗаполнитьСтрокуСтавокПроцентов(НоваяСтр, Парамс);
			КонецЦикла; 				
		КонецЦикла; 
		
		
		
		
		Об.ЦеныВставки.Очистить();
		//НайдСтрокиКамни = тзКамни.НайтиСТроки(Новый Структура("id_Приказа", СтрокаПриказа.id_Приказа));
		//Для каждого строчКамня из НайдСтрокиКамни Цикл
		//	НовСтрКамень = Об.ЦеныВставки.Добавить();
		//	НовСтрКамень.ЕдиницаИзмерения = ЕдИзмКарат;
		//	Если строчКамня.КодВставки = 1 Тогда
		//		НовСтрКамень.ВидВставки = Справочники.ЛБ_ДрагоценныеКамни.Бриллиант;
		//	КонецЕсли;     
		//	
		//	РезОгранка = ВернутьФормуОгранки(строчКамня.КодВставкиФорм, Огранка_17, Огранка_57, Огранка_Фантаз, Огранка_Граненый, КачествоОгранки_А, КачествоОгранки_Б);
		//	НовСтрКамень.ФормаОгранки      = РезОгранка.ФормаОгранки;
		//	НовСтрКамень.КачествоОгранки   = РезОгранка.КачествоОгранки;
		//	НовСтрКамень.ВесоваяГруппа	= ВернутьВесовуюГруппу(строчКамня.ВесОт, строчКамня.ВесДо);
		//	НовСтрКамень.Цена           = строчКамня.Оценка;
		//КонецЦикла;
		
		ЛБ_УправлениеЛомбардом.ЗаполнитьДополнительныеРеквизитыПриказа(Об);
		Об.Записать();
	КонецЦикла;
	
	
	Если ПараметрыЗагр.Свойство("ВводитьВДействие") Тогда
		ВводитьВДействие = ПараметрыЗагр.ВводитьВДействие;
		Если ВводитьВДействие Тогда
			Запрос = Новый Запрос;
			Запрос.Текст ="ВЫБРАТЬ
			|	ЛБ_ПриказУсловияПредоставленияЗаймов.Ссылка КАК Ссылка,
			|	ЛБ_ПриказУсловияПредоставленияЗаймов.ВидОперации КАК ВидОперации
			|ИЗ
			|	Документ.ЛБ_ПриказУсловияПредоставленияЗаймов КАК ЛБ_ПриказУсловияПредоставленияЗаймов
			|ГДЕ
			|	ЛБ_ПриказУсловияПредоставленияЗаймов.Дата >= &НачДата
			|	И ЛБ_ПриказУсловияПредоставленияЗаймов.Дата <= &КонДата
			|	И ЛБ_ПриказУсловияПредоставленияЗаймов.ВидПриказа <> &Факт";
			Запрос.УстановитьПараметр("НачДата", 	НачДата);   
			Запрос.УстановитьПараметр("КонДата", 	КонДата); 
			Запрос.УстановитьПараметр("Факт", 		Перечисления.ЛБ_ВидыПриказа.Факт);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				ПриказВведен = ВводПриказаВДействие(Выборка.Ссылка);
				
				//Если ПриказВведен Тогда  
				//	
				//	Если Выборка.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.Акция") Тогда 
				//		ВводПрейскурантовНаОснованииАкция(Выборка.ссылка);
				//	Иначе 
				//		ВводПрейскурантовНаОсновании(Выборка.ссылка);
				//	КонецЕсли;	
				//КонецЕсли; 
			КонецЦикла;
		КонецЕсли;	
	КонецЕсли;
	
	
	Возврат Истина;
КонецФункции

Функция ВернутьФормуОгранки(Код, Огранка_17, Огранка_57, Огранка_Фантаз, Огранка_Граненый, КачествоОгранки_А, КачествоОгранки_Б) 
	Рез = Новый Структура;
	Рез.Вставить("ФормаОгранки", "");
	Рез.Вставить("КачествоОгранки","");
	
	Если Код = 1 Тогда
		Рез = Новый Структура;
		Рез.Вставить("ФормаОгранки",    Огранка_57);
		Рез.Вставить("КачествоОгранки", КачествоОгранки_А);
	ИначеЕсли Код = 2 Тогда
		Рез = Новый Структура;
		Рез.Вставить("ФормаОгранки", 	Огранка_17);
		Рез.Вставить("КачествоОгранки",	КачествоОгранки_А); 
	ИначеЕсли Код = 4 Тогда
		Рез = Новый Структура;
		Рез.Вставить("ФормаОгранки", 	Огранка_57);
		Рез.Вставить("КачествоОгранки",	КачествоОгранки_Б); 
	ИначеЕсли Код = 5 Тогда
		Рез = Новый Структура;
		Рез.Вставить("ФормаОгранки", 	Огранка_17);
		Рез.Вставить("КачествоОгранки",	КачествоОгранки_Б); 		
	ИначеЕсли Код = 6 Тогда
		Рез = Новый Структура;
		Рез.Вставить("ФормаОгранки",	Огранка_Фантаз);
		Рез.Вставить("КачествоОгранки",	КачествоОгранки_А);		
	ИначеЕсли Код = 7 Тогда
		Рез = Новый Структура;
		Рез.Вставить("ФормаОгранки", 	Огранка_Граненый);
		Рез.Вставить("КачествоОгранки",	КачествоОгранки_А);
		
	КонецЕсли;
	
	Возврат Рез;
КонецФункции 

Функция ВернутьВесовуюГруппу(ВесОт, ВесДо);
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	ЛБ_ВесовыеГруппыДрагоценныхКамней.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЛБ_ВесовыеГруппыДрагоценныхКамней КАК ЛБ_ВесовыеГруппыДрагоценныхКамней
	|ГДЕ
	|	ЛБ_ВесовыеГруппыДрагоценныхКамней.ВесОт = &ВесОт
	|	И ЛБ_ВесовыеГруппыДрагоценныхКамней.ВесДо = &ВесДо";
	Запрос.УстановитьПараметр("ВесОТ", ВесОт);   
	Запрос.УстановитьПараметр("ВесДо", ВесДо); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат неопределено;
	КонецЕсли;
КонецФункции



Процедура ЗаполнитьСтрокуСтавокПроцентов(НоваяСтр, Парамс)
	Попытка
		НоваяСтр.ПричинаПрименения 		= Парамс.ПричинаПрименения; 
	Исключение
	КонецПопытки;
	НоваяСтр.СхемаКредитования 		= Парамс.СхемаКредитования;  
	//НоваяСтр.СхемаРасчетаПроцентов 	= Перечисления.ЛБ_СхемыРасчетаПроцентов.Фиксированная;			
	НоваяСтр.СтатусЗалогодателя 	= Парамс.СтатусКлиента;
	НоваяСтр.ДиапазонСумм           = Парамс.ДиапазонСумм;
	НоваяСтр.Ставка			        = Парамс.Ставка;
	Если Парамс.ЭтоБудетАкция Тогда
		НоваяСтр.УстановитьЗначениеИлиОтклонение = Перечисления.ЛБ_УстановкаЗначенияИлиОтклонения.Значение;
	Иначе
		НоваяСтр.ДеньНачалаПрименения	= Парамс.ДеньНачалаПрименения;	
	КонецЕсли;	
КонецПроцедуры


Функция ВернутьСтатусЗалогодателя(Статус, СтатусЛьготный, СтатусСверхновый) 
	Если СокрЛП(Статус) = "11" Тогда
		Возврат СтатусЛьготный; 
	ИначеЕсли СокрЛП(Статус) = "-2" Тогда
		Возврат СтатусСверхновый; 
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
КонецФункции

Функция ВернутьСхему(ВидЗайма, Статус, СхемаКредитования_Экспресс, СхемаКредитования_Классика, СхемаКредитования_Классика1День)  	
	Если СокрЛП(ВидЗайма) = "1" Тогда
		Возврат СхемаКредитования_Экспресс;
	Иначе
		Если Статус = "11" Тогда
			Возврат СхемаКредитования_Классика;
		Иначе
			Возврат СхемаКредитования_Классика1День;
		КонецЕсли;
	КонецЕсли;
КонецФункции

Функция ВернутьГибкуюСхему(ВидЗайма, Статус, СхемаКредитования_ЭкспрессГибкий, СхемаКредитования_КлассикаГибкий, СхемаКредитования_Классика1ДеньГибкий, СхемаЭкспрессГибкий_5, СхемаКлассикаГибкий_5, Дата)  	
	Если СокрЛП(ВидЗайма) = "1" Тогда
		Если Дата >= Дата(2023, 10, 16) Тогда
			Возврат СхемаЭкспрессГибкий_5;	
		Иначе
			Возврат СхемаКредитования_ЭкспрессГибкий;
		КонецЕсли;
	Иначе
		Если Статус = "11" Тогда
			Возврат СхемаКредитования_КлассикаГибкий;
		Иначе
			Если Дата >= Дата(2023, 10, 16) Тогда
				Возврат СхемаКлассикаГибкий_5;
			Иначе
				Возврат СхемаКредитования_Классика1ДеньГибкий;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецФункции


Функция ВернутьРеквизитыЛомбардаИзLX(id_LX) Экспорт
	
	АдоСоединение = АдоНовоеСоединение("dCBDL");
	
	ТекстЗапроса = "SELECT [NRecAdr]
	|,[PLAT]
	|,[NObj]
	|,[NameS]
	|,[NamePL] 
	|,[FIAS]
	|,[NMGOROD] 
	|,[ADRES] 
	|,[KodOtd]
	| FROM [dCBDL].[dbo].[spADR] where nObj = " + СокрЛП(id_LX);		
	
	Выборка = АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса);
	
	Рез = Новый Структура("Наименование, Номер", "", "");
	Пока не Выборка.eof() Цикл
		Рез.Вставить("Наименование", Выборка.fields("NamePL").value); 
		Рез.Вставить("Номер",        Выборка.fields("PLAT").value); 
		Рез.Вставить("FIAS",         Выборка.fields("FIAS").value);
		Рез.Вставить("NMGOROD",        Выборка.fields("NMGOROD").value);
		Рез.Вставить("ADRES",        Выборка.fields("ADRES").value);
		Рез.Вставить("КодОтделения", СтрЗаменить(Выборка.fields("KodOtd").value, Символы.НПП, ""));
		Выборка.movenext();
	КонецЦикла;
	АдоСоединение.Close();
	
	Возврат Рез;
КонецФункции

Процедура ЗагрузитьОтделенияЛомбардовИзLX() Экспорт
	
	АдоСоединение = АдоНовоеСоединение("dCBDL");
	
	ТекстЗапроса = "SELECT KodOtd, NMOt FROM [dCBDL].[dbo].[spADR] where KodOtd > 0 Group By KodOtd,NMOt";		
	
	Выборка = АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса);
	
	Пока не Выборка.eof() Цикл
		id_lx        = СтрЗаменить(Выборка.fields("KodOtd").value, Символы.НПП, ""); 
		наименование = Выборка.fields("NMOt").value; 
		
		Спр = Справочники.ЛБ_ОтделенияЛомбардов.НайтиПоРеквизиту("id_LX",id_lx);
		Если спр = Справочники.ЛБ_ОтделенияЛомбардов.ПустаяСсылка() Тогда
			НовЭл = Справочники.ЛБ_ОтделенияЛомбардов.СоздатьЭлемент();
			НовЭл.id_lx = id_lx;
			НовЭл.Наименование = наименование;
			НовЭл.Записать();
		КонецЕсли;
		
		Выборка.movenext();
	КонецЦикла;
	АдоСоединение.Close();	
КонецПроцедуры

Процедура ЗагрузитьГруппыЛомбардовИзLX() Экспорт
	
	АдоСоединение = АдоНовоеСоединение("dCBDL");
	
	ТекстЗапроса = "SELECT Gorod_ FROM [dCBDL].[dbo].[spADR] where KodOtd > 0 Group By Gorod_";		
	
	Выборка = АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса);
	
	Пока не Выборка.eof() Цикл
		наименование = Выборка.fields("Gorod_").value; 
		
		Спр = Справочники.ЛБ_ГруппыЛомбардов.НайтиПоНаименованию(наименование);
		Если спр = Справочники.ЛБ_ГруппыЛомбардов.ПустаяСсылка() Тогда
			НовЭл = Справочники.ЛБ_ГруппыЛомбардов.СоздатьЭлемент();
			НовЭл.Наименование = наименование;
			НовЭл.Записать();
		КонецЕсли;
		
		Выборка.movenext();
	КонецЦикла;
	АдоСоединение.Close();	
КонецПроцедуры


Процедура ПроставитьЛомбардыВОтделения() Экспорт	
	
	ЗагрузитьОтделенияЛомбардовИзLX();
	
	АдоСоединение = АдоНовоеСоединение("dCBDL");
	
	ТекстЗапроса = "SELECT NObj,KodOtd, NMOt FROM [dCBDL].[dbo].[spADR] Group By NObj,KodOtd,NMOt";		
	
	
	тз = Новый ТаблицаЗначений;
	тз.Колонки.Добавить("Отделение");
	тз.КОлонки.Добавить("Ломбард");
	
	Выборка = АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса);
	
	Пока не Выборка.eof() Цикл                 
		id_ломбарда  = СтрЗаменить(Выборка.fields("NObj").value, Символы.НПП, "");
		кодотделения = Выборка.fields("NMOt").value; 
		
		
		Если id_ломбарда = "" или кодотделения = "" Тогда
			
		Иначе
			
			
			Отделение = Справочники.ЛБ_ОтделенияЛомбардов.НайтиПоНаименованию(кодотделения); 
			Ломбард   = Справочники.ЛБ_Ломбарды.НайтиПоРеквизиту("id_LX",id_ломбарда); 
			
			
			Если ЗначениеЗаполнено(Ломбард) и ЗначениеЗаполнено(Отделение) Тогда 
				НовСТр = тз.Добавить();
				НовСтр.Отделение = Отделение;
				НовСтр.Ломбард = Ломбард;			
			КонецЕсли; 
		КонецЕсли;
		
		Выборка.movenext();
	КонецЦикла;
	АдоСоединение.Close();
	
	тзОтделения = тз.Скопировать();
	
	тзОтделения.Свернуть("Отделение"); 
	
	Для каждого стр из тзОтделения Цикл
		НовДок = Документы.ЛБ_УстановитьЛомбардыВОтделение.СоздатьДокумент();
		НовДок.Дата = Дата(2023,01,01); 
		НовДок.Отделение = стр.Отделение;
		
		НайдСтроки = тз.НайтиСтроки(Новый структура("Отделение", стр.Отделение));
		Для каждого малСтр из НайдСтроки Цикл
			НоваяСтр = НовДок.Ломбарды.Добавить(); 
			НоваяСТр.Ломбард = малСтр.Ломбард;
		КонецЦикла;
		
		Если НовДок.Ломбарды.Количество() > 0 Тогда
			НовДок.Записать();
			НовДок.Записать(РежимЗаписиДокумента.Проведение);			
		КонецЕсли; 
	КонецЦикла;
	
	
КонецПроцедуры  


Процедура ПроставитьЛомбардыВГруппы() Экспорт	
	
	ЗагрузитьГруппыЛомбардовИзLX();
	
	АдоСоединение1 = АдоНовоеСоединение("dCBDL");
	
	ТекстЗапроса1 = "SELECT NObj,Gorod_ FROM [dCBDL].[dbo].[spADR] Group By NObj,Gorod_";		
	
	
	тз = Новый ТаблицаЗначений;
	тз.Колонки.Добавить("группа");
	тз.КОлонки.Добавить("Ломбард");
	
	Выборка = АдоВыполнитьЗапрос(АдоСоединение1, ТекстЗапроса1);
	
	Пока не Выборка.eof() Цикл                 
		id_ломбарда  = СтрЗаменить(Выборка.fields("NObj").value, Символы.НПП, "");
		наимГруппы = Выборка.fields("Gorod_").value; 
		
		Если id_ломбарда = "" или наимГруппы = "" Тогда
			
		Иначе
			
			группа = Справочники.ЛБ_ГруппыЛомбардов.НайтиПоНаименованию(наимГруппы); 
			Ломбард   = Справочники.ЛБ_Ломбарды.НайтиПоРеквизиту("id_LX",id_ломбарда); 
			
			
			Если ЗначениеЗаполнено(Ломбард) и ЗначениеЗаполнено(группа) Тогда 
				НовСТр = тз.Добавить();
				НовСтр.группа = группа;
				НовСтр.Ломбард = Ломбард;			
			КонецЕсли; 
		КонецЕсли;
		
		Выборка.movenext();
	КонецЦикла;
	АдоСоединение1.Close();
	
	тзГруппы = тз.Скопировать();
	
	тзГруппы.Свернуть("Группа"); 
	
	Для каждого стр из тзГруппы Цикл
		НовДок = Документы.ЛБ_УстановитьЛомбардыВГруппу.СоздатьДокумент();
		НовДок.Дата = Дата(2023,01,01); 
		НовДок.Группа = стр.Группа;
		
		НайдСтроки = тз.НайтиСтроки(Новый структура("Группа", стр.Группа));
		Для каждого малСтр из НайдСтроки Цикл
			НоваяСтр = НовДок.Ломбарды.Добавить(); 
			НоваяСТр.Ломбард = малСтр.Ломбард;
		КонецЦикла;
		
		Если НовДок.Ломбарды.Количество() > 0 Тогда
			НовДок.Записать();
			НовДок.Записать(РежимЗаписиДокумента.Проведение);			
		КонецЕсли; 
	КонецЦикла;
	
	
КонецПроцедуры



Функция ВернутьПрейскурантПоID(id_LX)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_ПрейскурантЦенНаМеталлы.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЛБ_ПрейскурантЦенНаМеталлы КАК ЛБ_ПрейскурантЦенНаМеталлы
	|ГДЕ
	|	ЛБ_ПрейскурантЦенНаМеталлы.id_LX = &id_LX";
	Запрос.УстановитьПараметр("id_LX", id_LX);
	
	Рез = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Рез = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Рез;	
	
КонецФункции 

Функция ВернутьПриказПоIDМеталлы(id_LX)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_ПриказУсловияПредоставленияЗаймов.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЛБ_ПриказУсловияПредоставленияЗаймов КАК ЛБ_ПриказУсловияПредоставленияЗаймов
	|ГДЕ
	|	ЛБ_ПриказУсловияПредоставленияЗаймов.id_LX = &id_LX
	|	И ЛБ_ПриказУсловияПредоставленияЗаймов.ЭтоПриказМеталлы = ИСТИНА";
	Запрос.УстановитьПараметр("id_LX", id_LX);
	
	Рез = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Рез = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Рез;	
	
КонецФункции

Функция ВернутьПриказПоIDСтавки(id_LX, LX_СтрокиПриказа)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_ПриказУсловияПредоставленияЗаймов.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЛБ_ПриказУсловияПредоставленияЗаймов КАК ЛБ_ПриказУсловияПредоставленияЗаймов
	|ГДЕ
	|	ЛБ_ПриказУсловияПредоставленияЗаймов.id_LX = &id_LX
	|	И ЛБ_ПриказУсловияПредоставленияЗаймов.ЭтоПриказСтавки = ИСТИНА
	|	И ЛБ_ПриказУсловияПредоставленияЗаймов.LX_СтрокиПриказа = &LX_СтрокиПриказа";
	Запрос.УстановитьПараметр("id_LX", id_LX); 
	Запрос.УстановитьПараметр("LX_СтрокиПриказа", LX_СтрокиПриказа);
	
	
	Рез = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Рез = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Рез;	
	
КонецФункции

Функция ВернутьЛомбардПоID(id_LX) Экспорт  
	id = СтрЗаменить(id_LX, символы.НПП, "");
	Если id = "1001" Тогда
		Возврат Справочники.ЛБ_Ломбарды.ЦентральныйОфис;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_Ломбарды.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЛБ_Ломбарды КАК ЛБ_Ломбарды
	|ГДЕ
	|	ЛБ_Ломбарды.id_LX = &id_LX
	|	И ЛБ_Ломбарды.ПометкаУдаления = Ложь";
	Запрос.УстановитьПараметр("id_LX", id);
	
	Рез = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Рез = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Рез;	
	
КонецФункции


Функция ВернутьПробу1С(ТекМеталл, Проба, тзПроб)
	ТекПроба = Число(Проба);
	
	отб = Новый Структура;
	отб.Вставить("Владелец", 	ТекМеталл);  
	отб.Вставить("Проба", 		ТекПроба);
	
	
	Рез = Неопределено;
	НайдСтр = тзПроб.НайтиСтроки(Отб);
	Для каждого строч из НайдСтр Цикл
		Рез = Строч.Ссылка;
		Прервать; 
	КонецЦикла;
	
	//Запрос = Новый Запрос;
	//Запрос.Текст ="ВЫБРАТЬ
	//              |	ЛБ_Пробы.Ссылка КАК Ссылка
	//              |ИЗ
	//              |	Справочник.ЛБ_Пробы КАК ЛБ_Пробы
	//              |ГДЕ
	//              |	ЛБ_Пробы.Проба = &Проба
	//              |	И ЛБ_Пробы.Владелец = &Владелец";
	//Запрос.УстановитьПараметр("Проба",   ТекПроба);
	//Запрос.УстановитьПараметр("Владелец",ТекМеталл);
	//
	//Рез = Неопределено;
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//	Рез = Выборка.Ссылка;
	//КонецЕсли;
	
	Возврат Рез;	
	
КонецФункции

Функция ВернутьОперациюПоЗалогуПо_ЗБ(НомерЗБ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_ОперацияПоЗалогу.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЛБ_ОперацияПоЗалогу КАК ЛБ_ОперацияПоЗалогу
	|ГДЕ
	|	ЛБ_ОперацияПоЗалогу.НомерЗалоговогоБилета = &НомерЗБ
	|	И ЛБ_ОперацияПоЗалогу.ВидОперации = &ВидОперации
	|	И ЛБ_ОперацияПоЗалогу.Проведен = ИСТИНА";
	Запрос.УстановитьПараметр("НомерЗБ", НомерЗБ);
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

Процедура ЗагрузитьИзъятиеЗаймов(НачДата, КонДата, Ломбард) Экспорт 
	
	
	АдоСоединение = АдоНовоеСоединение("dlink");
	
	pndoc = "";
	Если Не ЗначениеЗаполнено(Ломбард) Тогда
		plat = "";
	Иначе
		plat = Ломбард;
	КонецЕсли; 
	
	db="'" + НачДата + "'";
	de="'" + КонДата + "'";
	
	
	ТекстЗапроса = "exec Z1CAxi_iz "+db+","+de+",'"+plat+"'";
	
	Выборка = АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса);
	
	тз = Новый ТаблицаЗначений;
	тз.Колонки.Добавить("id_LX", 			Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("Дата", 			Новый ОписаниеТипов("Дата"));
	тз.Колонки.Добавить("НомерЗБ", 			Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("Ломбард", 			Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("СуммаТело", 		Новый ОписаниеТипов("Число"));
	тз.Колонки.Добавить("СуммаПроценты", 	Новый ОписаниеТипов("Число")); 
	тз.Колонки.Добавить("ДокументИзъятияНаименование", 	Новый ОписаниеТипов("Строка"));  
	тз.Колонки.Добавить("ДокументИзъятияКемВыдан", 	Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("ДокументИзъятияДатаВыдачи", 	Новый ОписаниеТипов("Дата")); 
	тз.Колонки.Добавить("ГосОрганИзъятие", 	Новый ОписаниеТипов("Строка")); 
	тз.Колонки.Добавить("ФИОДолжностьСудьи", 	Новый ОписаниеТипов("Строка")); 
	тз.Колонки.Добавить("ФИОДолжностьИзъятие", 	Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("ИзъятыеПозиции", 	Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("Ответственный", 	Новый ОписаниеТипов("Строка")); 
	тз.Колонки.Добавить("ДатаПротоколИзъятия", 	Новый ОписаниеТипов("Дата"));
	
	
	
	
	Пока не Выборка.eof() Цикл
		НовСтр = тз.Добавить();  
		НовСтр.Дата         	= Выборка.fields("ddoc").value;
		НовСтр.id_LX           	= СтрЗаменить(Выборка.fields("nrec").value, Символы.НПП, "");  
		НовСтр.НомерЗБ         	= Выборка.fields("nom").value; 
		НовСтр.СуммаТело		= ?(Выборка.fields("sm").value=NULL,0,Выборка.fields("sm").value);
		НовСтр.СуммаПроценты    = ?(Выборка.fields("smp").value=NULL,0,Выборка.fields("smp").value); 
		
		НовСтр.ДокументИзъятияНаименование  = Выборка.fields("Документ").value;
		НовСтр.ДокументИзъятияКемВыдан      = Выборка.fields("Кем выдан").value; 
		ДатаВыдачиДок                       = СтроковыеФункцииКлиентСервер.СтрокаВДату(Выборка.fields("Дата выдачи").value);
		НовСтр.ДокументИзъятияДатаВыдачи    = ДатаВыдачиДок;
		НовСтр.ГосОрганИзъятие         		= Выборка.fields("Наим ГосОргана").value;
		НовСтр.ФИОДолжностьСудьи         	= Выборка.fields("ФИО судьи").value;
		НовСтр.ФИОДолжностьИзъятие         	= Выборка.fields("Фио долж лица").value;
		НовСтр.ИзъятыеПозиции         		= Выборка.fields("Изъятые позиции").value; 
		НовСтр.Ответственный         		= Выборка.fields("Ответственный сотрудник").value;
		ДатаПротокола                       = СтроковыеФункцииКлиентСервер.СтрокаВДату(Выборка.fields("дата протокола").value);											
		НовСтр.ДатаПротоколИзъятия         	= ДатаПротокола; 
		
		
		Выборка.movenext();
	КонецЦикла;
	АдоСоединение.Close();
	
	АдоСоединение = АдоНовоеСоединение("dlink");
	
	
	Перечисление_Залог 			= Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог;
	Перечисление_Изъятие        = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ИзъятиеОбъектовЗалога;
	Организация 				= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ОсновнаяОрганизация");
	
	тзДок = тз.Скопировать();
	
	ВидОперации = Перечисление_Изъятие;
	Для каждого строкаДок из тзДок Цикл	
		НайдДок = ВернутьОперациюПоЗалогуПо_id(строкаДок.id_LX, ВидОперации);
		Если НайдДок = Неопределено Тогда
			ОПЗ = Документы.ЛБ_ОперацияПоЗалогу.СоздатьДокумент();
		Иначе
			ОПЗ = НайдДок.ПолучитьОбъект(); 
			ОПЗ.Товары.Очистить();  
			ОПЗ.Вставки.Очистить();
			ОПЗ.ТоварыИзъятыеВозвращенные.Очистить();
		КонецЕсли; 
		
		
		ОперацияВыдачи = ВернутьОперациюПоЗалогуПо_ЗБ(строкаДок.НомерЗБ);
		Если ОперацияВыдачи = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ОПЗ, ОперацияВыдачи,,"Номер,Дата");
		ЗаполнитьЗначенияСвойств(ОПЗ, строкаДок);
		
		ОПЗ.id_LX 		= строкаДок.id_LX; 
		ОПЗ.Дата		= строкаДок.Дата;
		
		ОПЗ.ВыдачаЗалога = Ложь;
		ОПЗ.Выкуп        = Ложь;	
		ОПЗ.ДатаВыкупа	       = ОперацияВыдачи.ДатаВыкупа;
		ОПЗ.ДатаВыкупаЛьготная = ОперацияВыдачи.ДатаВыкупаЛьготная;  
		ОПЗ.Ломбард = ОперацияВыдачи.Ломбард;
		
		//Для каждого строчТовары из ОперацияВыдачи.Товары Цикл
		//	НовСтрТовары = ОПЗ.ТоварыИзъятыеВозвращенные.Добавить();
		//	ЗаполнитьЗначенияСвойств(НовСтрТовары, строчТовары);
		//КонецЦикла;  
		
		Если СтрНайти(строкаДок.ИзъятыеПозиции, ",") > 0 Тогда
			МассивИзд = СтрРазделить(строкаДок.ИзъятыеПозиции, ",");
			Для каждого элМасс из МассивИзд Цикл
				промАрт = СокрЛП(элМасс);
				ПозСлэш = СтрНайти(промАрт,"/");  		
				Артикул = Сред(промАрт, ПозСлэш+1);
				
				НовСтрТовары = ОПЗ.ТоварыИзъятыеВозвращенные.Добавить();
				ОбъектЗалога = Справочники.ЛБ_ОбъектыЗалога.НайтиПоРеквизиту("id_LX", Артикул);
				
				НовСтрТовары.ОбъектЗалога = ОбъектЗалога;
				НовСтрТовары.СуммаОценки = ВернутьСуммуОценкиОбъектаЗалога(ОбъектЗалога, ОПЗ.Дата);
				
			КонецЦикла;		
		Иначе  
			промАрт = СокрЛП(строкаДок.ИзъятыеПозиции);
			ПозСлэш = СтрНайти(промАрт,"/");  		
			Артикул = Сред(промАрт, ПозСлэш+1); 
			
			НовСтрТовары = ОПЗ.ТоварыИзъятыеВозвращенные.Добавить();
			ОбъектЗалога = Справочники.ЛБ_ОбъектыЗалога.НайтиПоРеквизиту("id_LX", Артикул); 
			НовСтрТовары.ОбъектЗалога = ОбъектЗалога;
			НовСтрТовары.СуммаОценки = ВернутьСуммуОценкиОбъектаЗалога(ОбъектЗалога, ОПЗ.Дата);
			
		КонецЕсли;		
		
		
		ОПЗ.ВидОперации = Перечисление_Изъятие;
		ОПЗ.НомерЗалоговогоБилета = строкаДок.НомерЗБ; 
		//Для каждого строчТовары из ОперацияВыдачи.Товары Цикл
		//	НовСтрТовары = ОПЗ.Товары.Добавить();
		//	ЗаполнитьЗначенияСвойств(НовСтрТовары, строчТовары);
		//КонецЦикла;
		//Для каждого строчВставки из ОперацияВыдачи.Вставки Цикл
		//	НовСтрВставки = ОПЗ.Вставки.Добавить();
		//	ЗаполнитьЗначенияСвойств(НовСтрВставки, строчВставки);
		//КонецЦикла;  
		
		ОПЗ.ДатаИзъятия = ОПЗ.Дата;
		//ОПЗ.ДатаПротоколИзъятия = ОПЗ.Дата; 
		
		
		//ОПЗ.Ответственный = ВернутьСоздатьПользователя(СтрокаДок.Ответственный);
		
		ОПЗ.СуммаОплатыПроценты = СтрокаДок.СуммаПроценты;
		ОПЗ.СуммаОплатыСсуда    = СтрокаДок.СуммаТело;
		ОПЗ.СуммаОплаты         = СтрокаДок.СуммаТело + СтрокаДок.СуммаПроценты;
		ОПЗ.ПредыдущаяОперация  = НайтиПредыдущуюОперацию(ОПЗ.НомерЗалоговогоБилета);	
		ОПЗ.Записать(РежимЗаписиДокумента.Запись);
		ОПЗ.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
КонецПроцедуры


Процедура ЗагрузитьВозвратИзъятого(НачДата, КонДата, Ломбард) Экспорт 
	
	
	АдоСоединение = АдоНовоеСоединение("dlink");
	
	pndoc = "";
	Если Не ЗначениеЗаполнено(Ломбард) Тогда
		plat = "";
	Иначе
		plat = Ломбард;
	КонецЕсли; 
	
	db="'" + НачДата + "'";
	de="'" + КонДата + "'";
	
	
	ТекстЗапроса = "exec Z1CAxi_VozIz "+db+","+de+",'"+plat+"'";
	
	Выборка = АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса);
	
	тз = Новый ТаблицаЗначений;
	тз.Колонки.Добавить("id_LX", 			Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("Дата", 			Новый ОписаниеТипов("Дата"));
	тз.Колонки.Добавить("НомерЗБ", 			Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("Ломбард", 			Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("СуммаТело", 		Новый ОписаниеТипов("Число"));
	тз.Колонки.Добавить("СуммаПроценты", 	Новый ОписаниеТипов("Число")); 
	тз.Колонки.Добавить("Ответственный", 	Новый ОписаниеТипов("Строка"));  
	тз.Колонки.Добавить("Позиции", 			Новый ОписаниеТипов("Строка"));
	
	Пока не Выборка.eof() Цикл
		НовСтр = тз.Добавить();  
		НовСтр.Дата         	= Выборка.fields("ddoc").value;
		НовСтр.id_LX           	= СтрЗаменить(Выборка.fields("nrec").value, Символы.НПП, "");  
		НовСтр.НомерЗБ         	= Выборка.fields("nom").value; 
		НовСтр.СуммаТело		= ?(Выборка.fields("sm").value=NULL,0,Выборка.fields("sm").value);
		НовСтр.СуммаПроценты    = ?(Выборка.fields("smp").value=NULL,0,Выборка.fields("smp").value);		
		НовСтр.Ответственный  	= Выборка.fields("Ответственный сотрудник").value;
		НовСтр.Позиции        	= Выборка.fields("Позиции").value;    
		Выборка.movenext();
	КонецЦикла;
	АдоСоединение.Close();
	
	АдоСоединение = АдоНовоеСоединение("dlink");
	
	
	Перечисление_Залог 			= Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог;
	Перечисление_Возврат        = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога;
	Организация 				= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ОсновнаяОрганизация");
	
	тзДок = тз.Скопировать();
	
	ВидОперации = Перечисление_Возврат;
	Для каждого строкаДок из тзДок Цикл	
		НайдДок = ВернутьОперациюПоЗалогуПо_id(строкаДок.id_LX, ВидОперации);
		Если НайдДок = Неопределено Тогда
			ОПЗ = Документы.ЛБ_ОперацияПоЗалогу.СоздатьДокумент();
		Иначе
			ОПЗ = НайдДок.ПолучитьОбъект(); 
			ОПЗ.Товары.Очистить();  
			ОПЗ.Вставки.Очистить(); 
			ОПЗ.ТоварыИзъятыеВозвращенные.Очистить();
		КонецЕсли; 
		
		
		ОперацияВыдачи = ВернутьОперациюПоЗалогуПо_ЗБ(строкаДок.НомерЗБ);
		Если ОперацияВыдачи = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ОПЗ, ОперацияВыдачи,,"Номер,Дата");
		ЗаполнитьЗначенияСвойств(ОПЗ, строкаДок);
		
		ОПЗ.id_LX 		= строкаДок.id_LX; 
		ОПЗ.Дата		= строкаДок.Дата;
		
		ОПЗ.ВыдачаЗалога = Ложь;
		ОПЗ.Выкуп        = Ложь;	
		ОПЗ.ДатаВыкупа	       = ОперацияВыдачи.ДатаВыкупа;
		ОПЗ.ДатаВыкупаЛьготная = ОперацияВыдачи.ДатаВыкупаЛьготная;  
		ОПЗ.Ломбард = ОперацияВыдачи.Ломбард;
		
		//Для каждого строчТовары из ОперацияВыдачи.Товары Цикл
		//	НовСтрТовары = ОПЗ.ТоварыИзъятыеВозвращенные.Добавить();
		//	ЗаполнитьЗначенияСвойств(НовСтрТовары, строчТовары);
		//КонецЦикла;  
		
		Если СтрНайти(строкаДок.Позиции, ",") > 0 Тогда
			МассивИзд = СтрРазделить(строкаДок.Позиции, ",");
			Для каждого элМасс из МассивИзд Цикл
				промАрт = СокрЛП(элМасс);
				ПозСлэш = СтрНайти(промАрт,"/");  		
				Артикул = Сред(промАрт, ПозСлэш+1);
				
				НовСтрТовары = ОПЗ.ТоварыИзъятыеВозвращенные.Добавить();
				ОбъектЗалога = Справочники.ЛБ_ОбъектыЗалога.НайтиПоРеквизиту("id_LX", Артикул);
				
				НовСтрТовары.ОбъектЗалога = ОбъектЗалога;
				НовСтрТовары.СуммаОценки = ВернутьСуммуОценкиОбъектаЗалога(ОбъектЗалога, ОПЗ.Дата);
				
			КонецЦикла;		
		Иначе  
			промАрт = СокрЛП(строкаДок.Позиции);
			ПозСлэш = СтрНайти(промАрт,"/");  		
			Артикул = Сред(промАрт, ПозСлэш+1); 
			
			НовСтрТовары = ОПЗ.ТоварыИзъятыеВозвращенные.Добавить();
			ОбъектЗалога = Справочники.ЛБ_ОбъектыЗалога.НайтиПоРеквизиту("id_LX", Артикул); 
			НовСтрТовары.ОбъектЗалога = ОбъектЗалога;
			НовСтрТовары.СуммаОценки = ВернутьСуммуОценкиОбъектаЗалога(ОбъектЗалога, ОПЗ.Дата);
			
		КонецЕсли;		
		
		
		ОПЗ.ВидОперации = Перечисление_Возврат;
		ОПЗ.НомерЗалоговогоБилета = строкаДок.НомерЗБ; 
		//Для каждого строчТовары из ОперацияВыдачи.Товары Цикл
		//	НовСтрТовары = ОПЗ.Товары.Добавить();
		//	ЗаполнитьЗначенияСвойств(НовСтрТовары, строчТовары);
		//КонецЦикла;
		//Для каждого строчВставки из ОперацияВыдачи.Вставки Цикл
		//	НовСтрВставки = ОПЗ.Вставки.Добавить();
		//	ЗаполнитьЗначенияСвойств(НовСтрВставки, строчВставки);
		//КонецЦикла;  
		
		//ОПЗ.ДатаИзъятия = ОПЗ.Дата;
		//ОПЗ.ДатаПротоколИзъятия = ОПЗ.Дата; 
		
		
		//ОПЗ.Ответственный = ВернутьСоздатьПользователя(СтрокаДок.Ответственный);
		
		ОПЗ.СуммаОплатыПроценты = СтрокаДок.СуммаПроценты;
		ОПЗ.СуммаОплатыСсуда    = СтрокаДок.СуммаТело;
		ОПЗ.СуммаОплаты         = СтрокаДок.СуммаТело + СтрокаДок.СуммаПроценты;
		ОПЗ.ПредыдущаяОперация  = НайтиПредыдущуюОперацию(ОПЗ.НомерЗалоговогоБилета);	
		ОПЗ.Записать(РежимЗаписиДокумента.Запись);
		ОПЗ.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
КонецПроцедуры


Функция ВернутьСуммуОценкиОбъектаЗалога(ОбъектЗалога, НаДату) 
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценки
	|ИЗ
	|	РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(&НаДату, ОбъектЗалога = &ОбъектЗалога) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних";
	Запрос.УстановитьПараметр("ОбъектЗалога", ОбъектЗалога);
	Запрос.УстановитьПараметр("НаДату", НаДату);        
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СуммаОценки;
	КонецЕсли;
	
	Возврат 0;
КонецФункции

Функция РазобратьАртикулНаЧасти(Артикул) 
	Артикул = СокрЛП(Артикул);
	Рез = Новый Структура("Ломбард, ЗБ, НомерВБилете", "", "", "");
	
	
	ПозСлэша 	= СтрНайти(Артикул,"/");
	ПозТире 	= СтрНайти(Артикул,"-");
	
	Рез.Вставить("Ломбард", Лев(Артикул, ПозСлэша));  	
	Рез.Вставить("ЗБ",      Сред(Артикул, ПозСлэша+1, ПозТире-ПозСлэша));  	
	Рез.Вставить("НомерВБилете", Сред(Артикул, ПозТире+1));
	
	Возврат рез;
КонецФункции


Функция ВернутьТЗРасчетыПоОбъектамЗалога(ЗалоговыйБилет)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
	|	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Остатки(&НаДату, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОстатки";
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	
	тз = Запрос.Выполнить().Выгрузить();
	
	Возврат тз;	
	
КонецФункции




Процедура ЗаполнитьТовары(ЗалоговыйБилет, ДатаДок, Товары, СуммаТела) 
	Запрос = новый Запрос;   
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет.Ссылка); 
	//Если ЗначениеЗаполнено(ДокументОплаты) И ДокументОплаты.Проведен Тогда 
	ДатаПроверки = ДатаДок-1; 
	//Иначе	
	//    ДатаПроверки = ДатаДок;
	//КонецЕсли;	   
	Запрос.УстановитьПараметр("Дата", ДатаПроверки);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.ОбъектЗалога КАК ОбъектЗалога,
	|	СУММА(ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.СуммаРасход) КАК СуммаОплаты
	|ИЗ
	|	РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Обороты(, &Дата, , ) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты
	|ГДЕ
	|	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.ЗалоговыйБилет = &ЗалоговыйБилет
	|
	|СГРУППИРОВАТЬ ПО
	|	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.ОбъектЗалога";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
	|	ЛБ_ОбъектыЗалогаОстатки.Ломбард КАК Ломбард,
	|	СУММА(ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток) КАК Количество
	|ИЗ
	|	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(&Дата, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_ОбъектыЗалогаОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога,
	|	ЛБ_ОбъектыЗалогаОстатки.Ломбард";
	ТаблицаОстатков = Запрос.Выполнить().Выгрузить(); 
	
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("ОбъектЗалога");
	ТаблицаТоваров.Колонки.Добавить("НомерСТроки");
	ТаблицаТоваров.Колонки.Добавить("СуммаОценки", Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.Колонки.Добавить("СуммаОплатыНач", Новый ОписаниеТипов("Число"));  
	ТаблицаТоваров.Колонки.Добавить("СуммаОплаты", Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.Колонки.Добавить("ЗадолженностьНач", Новый ОписаниеТипов("Число")); 
	ТаблицаТоваров.Колонки.Добавить("ЗадолженностьКон", Новый ОписаниеТипов("Число"));
	
	Для каждого стр Из ЗалоговыйБилет.Товары цикл 
		НоваяСтр = ТаблицаТоваров.Добавить(); 
		НоваяСтр.Номерстроки = Стр.Номерстроки;
		НоваяСтр.ОбъектЗалога = стр.ОбъектЗалога;
		НоваяСтр.СуммаОценки = стр.СуммаСсуды;  
		Отбор = Новый структура;
		Отбор.Вставить("ОбъектЗалога", НоваяСтр.ОбъектЗалога);
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
		Если НЕ строки.Количество() = 0 тогда			
			НоваяСтр.СуммаОплатыНач = Строки.Получить(0).СуммаОплаты;                                 
		КонецЕсли;	 
		//Если ЗначениеЗаполнено(ДокументОплаты) Тогда
		//	Строки = ДокументОплаты.Товары.НайтиСтроки(Отбор);
		//	Если НЕ строки.Количество() = 0 тогда			
		//		НоваяСтр.СуммаОплаты = Строки.Получить(0).СуммаОплаты;
		//	КонецЕсли;	 
		//КонецЕсли;	   
		//Если Выкуп Тогда
		//	ЗаполнитьТоварыПослеВыкупа(Ложь); 
		//КонецЕсли;
		НоваяСтр.ЗадолженностьНач = НоваяСтр.СуммаОценки - НоваяСтр.СуммаОплатыНач; 
		НоваяСтр.ЗадолженностьКон = НоваяСтр.ЗадолженностьНач - НоваяСтр.СуммаОплаты;
	Конеццикла;	
	
	ТоварыИтогОценка = ТаблицаТоваров.Итог("СуммаОценки");
	ТоварыИтогОплатаНач = ТаблицаТоваров.Итог("СуммаОплатыНач");
	ТоварыИтогДолгНач = ТаблицаТоваров.Итог("ЗадолженностьНач");
	ТоварыИтогОплатаКон = ТаблицаТоваров.Итог("СуммаОплаты");
	ТоварыИтогДолгКон = ТаблицаТоваров.Итог("Задолженностькон");
	
	
	//Если Выкуп Тогда 
	//	Для каждого Стр Из ТаблицаТоваров Цикл 
	//		Стр.СуммаОплаты = Стр.ЗадолженностьНач;  
	//		Стр.ЗадолженностьКон = 0;
	//	КонецЦикла;	
	//Иначе	
	СуммаДляРаспределения = СуммаТела;
	Если СуммаДляРаспределения = 0 Тогда
		Для каждого Стр Из ТаблицаТоваров Цикл
			Стр.СуммаОплаты = 0;   
			Стр.ЗадолженностьКон = Стр.ЗадолженностьНач - Стр.СуммаОплаты;
		Конеццикла;	
	Иначе	
		НомСтрМакс = 0; 
		МаксЗадолженность = 0;
		ЗадолженностьНачИтог = ТаблицаТоваров.Итог("ЗадолженностьНач");
		Для каждого Стр Из ТаблицаТоваров Цикл 
			Коэфф = Стр.ЗадолженностьНач/ЗадолженностьНачИтог;
			Стр.СуммаОплаты = СуммаТела*Коэфф;
			Стр.ЗадолженностьКон = Стр.ЗадолженностьНач - Стр.СуммаОплаты;
			СуммаДляРаспределения = СуммаДляРаспределения - Стр.СуммаОплаты;
			Если Стр.ЗадолженностьНач > МаксЗадолженность Тогда
				МаксЗадолженность = Стр.ЗадолженностьНач;  
				НомСтрМакс = стр.НомерСтроки-1;
			КонецЕсли;	
		КонецЦикла;
		Если НЕ СуммаДляРаспределения = 0 Тогда
			Стр = ТаблицаТоваров.Получить(НомСтрМакс);
			Стр.СуммаОплаты = Стр.СуммаОплаты + СуммаДляРаспределения;
			Стр.ЗадолженностьКон = Стр.ЗадолженностьНач - Стр.СуммаОплаты;
		КонецЕсли;  
	КонецЕсли;	
	//КонецЕсли;	
	
	ТоварыИтогОплатаКон = ТаблицаТоваров.Итог("СуммаОплаты");
	ТоварыИтогДолгКон = ТаблицаТоваров.Итог("ЗадолженностьКон");
	
	Для каждого строч из ТаблицаТоваров Цикл
		НайдСТр = ЗалоговыйБилет.Товары.Найти(строч.ОбъектЗалога,"ОбъектЗалога");
		НайдСТр.СуммаОплаты = строч.СуммаОплаты;
		
	КонецЦикла;	
КонецПроцедуры	


Процедура ЗагрузитьОплатуПоКассеРанееАпреля2020(строкаДок, тзСтран, тзЧерныеСтатусыКлиентов,тзПервыхДатЗБ); 
	
	АдоСоединение = АдоНовоеСоединение("dlink");
	
	Организация 	= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ОсновнаяОрганизация");
	
	ТипДокумента = "ЛБ_ПриходныйКассовыйОрдер";  
	
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПриходныйКассовыйОрдер.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЛБ_ПриходныйКассовыйОрдер КАК ЛБ_ПриходныйКассовыйОрдер
	               |ГДЕ
	               |	ЛБ_ПриходныйКассовыйОрдер.id_LX = &id_LX";
	Запрос.УстановитьПараметр("id_LX", строкаДок.id_LX); 
	
		
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Док = Выборка.Ссылка.ПолучитьОбъект(); 
	Иначе
		Док = Документы[ТипДокумента].СоздатьДокумент();	
	КонецЕсли;
	
	Док.Комментарий		= "Возврат займа №: "+ СокрЛП(СтрокаДок.НомерЗБ); 
	Док.Дата 			= строкаДок.Дата; 
	Док.id_LX 			= строкаДок.id_LX; 
	Док.НомерЗалоговогоБилета  = строкаДок.НомерЗБ;  
	Док.ПредставлениеНомераПКО = строкаДок.НомерЗБ;
	Док.Организация 	= Организация; 
	Док.Сумма   		= строкаДок.СуммаТело + строкаДок.СуммаПроценты;  
	
	//Док.Основание   	= Основание; 
	
	Если ЗначениеЗаполнено(строкаДок.id_Ломбарда2) Тогда
		Док.Ломбард = ВернутьЛомбардПоID(строкаДок.id_Ломбарда2);
	Иначе
		Док.Ломбард = ВернутьЛомбардПоID(строкаДок.id_Ломбарда);
	КонецЕсли; 
	Док.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПрочиеПриходныеОперацииПоСогласованиюСЦО;
	
	ОткрытьКассовуюСмену(НачалоДня(строкаДок.Дата), Док.Ломбард);
	   
	НеГрузитьАдреса = Истина; 
			
	РеквизитыПлательщика = ВернутьРеквизитыКлиентаИзLX(АдоСоединение, тзСтран, "Kodclient = '" + строкаДок.id_Плательщика + "'", НеГрузитьАдреса);
			
	Если ЗначениеЗаполнено(РеквизитыПлательщика[0].ДатаРождения) и (ЗначениеЗаполнено(РеквизитыПлательщика[0].Фамилия) или ЗначениеЗаполнено(РеквизитыПлательщика[0].Имя) или ЗначениеЗаполнено(РеквизитыПлательщика[0].Отчество)) Тогда
				
		Парамс = Новый Структура;
		Парамс.Вставить("Данные", 			РеквизитыПлательщика[0]); 
		Парамс.Вставить("тзСтран", 			тзСтран);
		Парамс.Вставить("АдоСоединение", 	АдоСоединение);
		Парамс.Вставить("СтатусКлиента", 	"");
		Парамс.Вставить("НеГрузитьАдреса", 	НеГрузитьАдреса); 
		Парамс.Вставить("тзЧерныеСтатусыКлиентов", 	тзЧерныеСтатусыКлиентов);
		Парамс.Вставить("тзПервыхДатЗБ", 	тзПервыхДатЗБ);
		
		
		Док.Контрагент = НайтиСоздатьЗалогодателя(Парамс);   
		Док.ПринятоОт  = СокрЛП(Док.Контрагент);			
	КонецЕсли;
	
	Док.Записать(РежимЗаписиДокумента.Запись);
	Док.Записать(РежимЗаписиДокумента.Проведение);
			
			  		
		//	РеквДокПлат = ВернутьidДокументаПлательщика(строкаДок.id_LX, строкаДок.id_Плательщика);		
		//	
		//	СсылкаДокументаПлательщика = НайтиДокументЗалогодателя(РеквДокПлат, "", "", ОПЗ.Представитель);
		//	
		//	ОПЗ.ДокументЗалогодателя = СсылкаДокументаПлательщика; 
		//	
		//	Запрос = Новый Запрос;
		//	Запрос.Текст = "ВЫБРАТЬ
		//	|	ЛБ_ДокументыЗалогодателя.Владелец КАК Клиент,
		//	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
		//	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
		//	|	ЛБ_ДокументыЗалогодателя.Наименование КАК Наименование,
		//	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
		//	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
		//	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
		//	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНачалоДействия КАК ДокументНачалоДействия,
		//	|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия
		//	|ИЗ
		//	|	Справочник.ЛБ_ДокументыЗалогодателя КАК ЛБ_ДокументыЗалогодателя
		//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних КАК ЛБ_ДокументыЗалогодателейСрезПоследних
		//	|		ПО (ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя = ЛБ_ДокументыЗалогодателя.Ссылка)
		//	|ГДЕ
		//	|	ЛБ_ДокументыЗалогодателя.Ссылка = &Док
		//	|	И ЛБ_ДокументыЗалогодателя.Владелец = &Клиент"; 
		//	
		//	Запрос.УстановитьПараметр("Док",    СсылкаДокументаПлательщика);
		//	Запрос.УстановитьПараметр("Клиент", ОПЗ.Залогодатель);
		//	
		//	ВыбДок = Запрос.Выполнить().Выбрать();
		//	Если ВыбДок.Следующий() Тогда    
		//		ОПЗ.ДокументДатаВыдачи = ВыбДок.ДокументДатаВыдачи; 
		//		ОПЗ.ДокументСерия = ВыбДок.ДокументСерия;
		//		ОПЗ.ДокументНомер = ВыбДок.ДокументНомер;
		//		ОПЗ.ДокументКемВыдан = ВыбДок.ДокументКемВыдан;
		//		ОПЗ.ДокументКодПодразделения = ВыбДок.ДокументКодПодразделения;
		//		ОПЗ.ДокументНачалоДействия = ВыбДок.ДокументНачалоДействия;
		//		ОПЗ.ДокументСрокДействия = ВыбДок.ДокументСрокДействия;			
		//	КонецЕсли;			
		//КонецЕсли;
КонецПроцедуры

Функция ВКакомЛомбарде(Номенклатура, датаДок)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОбъектыЗалогаОстатки.Ломбард КАК Ломбард,
	               |	ЛБ_ОбъектыЗалогаОстатки.Склад КАК Склад,
	               |	ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток КАК КоличествоОстаток,
	               //|	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиНачальнаяОстаток КАК СуммаОценкиНачальнаяОстаток,
				   |	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток КАК СуммаОценкиНачальнаяОстаток,
	               |	ЛБ_ОбъектыЗалогаОстатки.СуммаОценкиОстаток КАК СуммаОценкиОстаток
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(&НаДату, ОбъектЗалога = &ОбъектЗалога) КАК ЛБ_ОбъектыЗалогаОстатки";
	Запрос.УстановитьПараметр("НаДату", ДатаДок - 1);
	Запрос.УстановитьПараметр("ОбъектЗалога", Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Новый Структура("Ломбард, Склад, СуммаОценкиНачальная, СуммаОценки", Выборка.Ломбард, Выборка.Склад, Выборка.СуммаОценкиНачальнаяОстаток, Выборка.СуммаОценкиОстаток);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура СоздатьПеремещениеОбъектаЗалога(стр)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПеремещениеОбъектовЗалога.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЛБ_ПеремещениеОбъектовЗалога КАК ЛБ_ПеремещениеОбъектовЗалога
	               |ГДЕ
	               |	ЛБ_ПеремещениеОбъектовЗалога.Комментарий ПОДОБНО &Комментарий";
	Запрос.УстановитьПараметр("Комментарий", СокрЛП(стр.ЗБ_Артикул));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		//
		
	Иначе
		НовДок = Документы.ЛБ_ПеремещениеОбъектовЗалога.СоздатьДокумент();   
		
		
		НовДок.ЗагруженИЗLX = Истина;
		НовДок.Дата = стр.ДатаДок + 3600;
        		
		НовДок.Организация = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ОсновнаяОрганизация"); 
		НовДок.Категория = Перечисления.ЛБ_КатегорииПоступленияОбъектовЗалога.Поштучно;

		
		НовДок.Комментарий = СокрЛП(стр.ЗБ_Артикул);
		СтруктОстаток = ВКакомЛомбарде(Стр.Номенклатура, стр.ДатаДок);
		Если СтруктОстаток <> Неопределено Тогда
			НовДок.ЛомбардОткуда    = СтруктОстаток.Ломбард; 
			НовДок.СкладОтправитель = СтруктОстаток.Склад;
		КонецЕсли; 
		
		ЛомбардКуда  = ВернутьЛомбардПоID(стр.id_Ломбарда); 
		Если ЛомбардКуда = Неопределено Тогда
			Сообщить("НЕ найден ломбард с id "+СокрЛП(стр.id_Ломбарда));
			Возврат;
		КонецЕсли;
		
		НовДок.ЛомбардКуда   = ЛомбардКуда; 
		Если НовДок.ЛомбардКуда <> Справочники.ЛБ_Ломбарды.ЦентральныйОфис Тогда
			НовДок.СкладПолучатель =  НайтиСкладВитринуЛомбарда(НовДок.ЛомбардКуда);
		КонецЕсли;
		
		//Если НовДок.ЛомбардОткуда = НовДок.ЛомбардКуда Тогда
			НовДок.ВидОперации = Перечисления.ЛБ_ВидыПеремещенияОбъектовЗалога.ВнутриПодразделения;
		//Иначе
		//	НовДок.ВидОперации = Перечисления.ЛБ_ВидыПеремещенияОбъектовЗалога.ВДругоеПодразделение;
		//КонецЕсли;	
		
		НовСтрока = НовДок.Товары.Добавить();
		НовСтрока.ЗалоговыйБилет = ВернутьОперациюПоЗалогуПо_ЗБ(стр.НомерЗБ);
		НовСтрока.ОбъектЗалога = стр.Номенклатура;
		НовСтрока.Количество = 1;   
		Если СтруктОстаток <> Неопределено Тогда
		НовСТрока.СуммаОценки = СтруктОстаток.СуммаОценки;
		КонецЕсли;
		
		Попытка
			НовДок.Записать(РежимЗаписиДокумента.Проведение);
		Исключение 
			НовДок.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;	
	КонецЕсли;	
КонецПроцедуры

Функция ВернутьПокупателяЗалогодателя(КодКлиента)  
	АдоСоединение = АдоНовоеСоединение("dCBDL_dan");
	ТекстЗапроса = "SELECT *  FROM [dCBDL_dan].[dbo].[aClientP] where kodclient = '"+КодКлиента+"'";  
	
	Фамилия  = "";
	Имя      = "";
	Отчество = ""; 
	ДатаРождения    = Дата(01,01,01);
	
	
	rt = АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса);  
	Пока не rt.eof() цикл  			
		Если НЕ rt.eof() Тогда
			
			Фамилия      = rt.fields("Fam").value;
			Имя			 = rt.fields("Name").value;
			Отчество     = rt.fields("Patr").value; 
			ДатаРождения = rt.fields("DataR").value;   

			
			rt.movenext();
			
		Если rt.eof() тогда
			Прервать;
		КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	АдоСоединение.Close(); 
	
	Если ЗначениеЗаполнено(Фамилия) Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_Залогодатели.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.ЛБ_Залогодатели КАК ЛБ_Залогодатели
		               |ГДЕ
		               |	ЛБ_Залогодатели.Фамилия = &Фамилия
		               |	И ЛБ_Залогодатели.Имя = &Имя
		               |	И ЛБ_Залогодатели.Отчество = &Отчество
		               |	И ЛБ_Залогодатели.ДатаРождения = &ДатаРождения";
		Запрос.УстановитьПараметр("Фамилия", Фамилия);   
		Запрос.УстановитьПараметр("Имя", Имя);
		Запрос.УстановитьПараметр("Отчество", Отчество); 
		Запрос.УстановитьПараметр("ДатаРождения", ДатаРождения);
		
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
		
		СтрокаОтбора = " fam = '"+Фамилия+"' and name = '"+Имя+"' and Patr = '"+Отчество+"' and DataR = '"+Формат(ДатаРождения, "ДФ=dd.MM.yyyy")+"'";	
		НеГрузитьАдреса = Истина;   
		
		тзСтран = ВернутьТЗСтран(); 
		
		АдоСоединение = АдоНовоеСоединение("dcbdl_uni");

		РеквизитыПлательщика = ВернутьРеквизитыКлиентаИзLX(АдоСоединение, тзСтран, СтрокаОтбора, НеГрузитьАдреса); 
		Если РеквизитыПлательщика = неопределено Тогда  
			
			АдоСоединение2 = АдоНовоеСоединение("dCBDL_dan");

			РеквизитыПлательщика = ВернутьРеквизитыПокупателяРеализацииИзLX(АдоСоединение2, тзСтран, СтрокаОтбора, НеГрузитьАдреса); 
			
			Если ЗначениеЗаполнено(РеквизитыПлательщика[0].ДатаРождения) и (ЗначениеЗаполнено(РеквизитыПлательщика[0].Фамилия) или ЗначениеЗаполнено(РеквизитыПлательщика[0].Имя) или ЗначениеЗаполнено(РеквизитыПлательщика[0].Отчество)) Тогда
				
				тзЧерныеСтатусыКлиентов = ВернутьКлиентовСЧернойМеткой(); 
				тзПервыхДатЗБ = ВернутьТаблицуПервыхДатЗБ();
				
				Парамс = Новый Структура;
				Парамс.Вставить("Данные", 			РеквизитыПлательщика[0]); 
				Парамс.Вставить("тзСтран", 			тзСтран);
				Парамс.Вставить("АдоСоединение", 	АдоСоединение);
				Парамс.Вставить("СтатусКлиента", 	"");
				Парамс.Вставить("НеГрузитьАдреса", 	НеГрузитьАдреса); 
				Парамс.Вставить("тзЧерныеСтатусыКлиентов", 	тзЧерныеСтатусыКлиентов);
				Парамс.Вставить("тзПервыхДатЗБ", 	тзПервыхДатЗБ);
				
				
				
				Залогодатель 	= НайтиСоздатьЗалогодателяПокупателя(Парамс);

				Возврат Залогодатель;
			КонецЕсли; 
	
			
			
		Иначе
			
			Если ЗначениеЗаполнено(РеквизитыПлательщика[0].ДатаРождения) и (ЗначениеЗаполнено(РеквизитыПлательщика[0].Фамилия) или ЗначениеЗаполнено(РеквизитыПлательщика[0].Имя) или ЗначениеЗаполнено(РеквизитыПлательщика[0].Отчество)) Тогда
				
				тзЧерныеСтатусыКлиентов = ВернутьКлиентовСЧернойМеткой(); 
				тзПервыхДатЗБ = ВернутьТаблицуПервыхДатЗБ();
				
				Парамс = Новый Структура;
				Парамс.Вставить("Данные", 			РеквизитыПлательщика[0]); 
				Парамс.Вставить("тзСтран", 			тзСтран);
				Парамс.Вставить("АдоСоединение", 	АдоСоединение);
				Парамс.Вставить("СтатусКлиента", 	"");
				Парамс.Вставить("НеГрузитьАдреса", 	НеГрузитьАдреса); 
				Парамс.Вставить("тзЧерныеСтатусыКлиентов", 	тзЧерныеСтатусыКлиентов);
				Парамс.Вставить("тзПервыхДатЗБ", 	тзПервыхДатЗБ);
				
				
				Залогодатель 	= НайтиСоздатьЗалогодателя(Парамс);
				Возврат Залогодатель;
			КонецЕсли; 
		КонецЕсли;	
		
		
		
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

Процедура ЗагрузитьРеализации(НачДата, КонДата) Экспорт
	
	АдоСоединение = АдоНовоеСоединение("dlink");
	
	db="'" + НачДата + "'";
	de="'" + КонДата + "'";
	
	ТекстЗапроса = "exec Z1CAxi_Real_auto "+ db + "," + de ;
	
	rt = АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса);

	тз = Новый ТаблицаЗначений;
	тз.Колонки.Добавить("Идентификатор");
	тз.Колонки.Добавить("ДатаДок");
	тз.Колонки.Добавить("НомерФактуры");
	тз.Колонки.Добавить("ЗБ_Артикул");
	тз.Колонки.Добавить("НомерЛомбарда");
	тз.Колонки.Добавить("id_Ломбарда");
	тз.Колонки.Добавить("НомерБСО"); 
	тз.Колонки.Добавить("НомерЗБ");
	тз.Колонки.Добавить("Договор");
	тз.Колонки.Добавить("Инн");
	тз.Колонки.Добавить("Номенклатура");   
	тз.Колонки.Добавить("НаименованиеДоговора"); 
	тз.Колонки.Добавить("ПризнакНалБезнал");
	тз.Колонки.Добавить("НаименованиеПокупателяИмущества"); 
	тз.Колонки.Добавить("СтоимостьРеализации", Новый ОписаниеТипов("Число")); 
	тз.Колонки.Добавить("Ответственный");
	тз.Колонки.Добавить("КодРозничногоКлиента");

	
		        	
	НомПП = 0;
	Пока не rt.eof() цикл  			
		Если НЕ rt.eof() Тогда 
			
			ЗБ_Артикул      = rt.fields("Art").value;
			ПозСлэша 		= СтрНайти(ЗБ_Артикул,"/");
			ПозТире 		= СтрНайти(ЗБ_Артикул,"-");
			НомерЛомбарда 	= Лев(ЗБ_Артикул,ПозСлэша-1);				
			НомерБСО 		= Сред(ЗБ_Артикул, ПозСлэша+1,ПозТире-ПозСлэша-1);
			ОбъектЗалога    = Сред(ЗБ_Артикул, ПозСлэша+1);
			
			
			Попытка  
				NFAk = rt.fields("NFak").value;
				НомерФактуры       		= Число(Лев(rt.fields("NFak").value,СтрДлина(NFAk)));
				ОшибкаСФ                = Ложь;                 
			Исключение
				НомерФактуры       		= rt.fields("NFak").value;
				ОшибкаСФ                = Истина;
			КонецПопытки;	
			
			НовСтр = тз.Добавить();
			НовСтр.Идентификатор 			= rt.fields("nRec").value;
			НовСтр.ДатаДок       			= rt.fields("DOtg").value;  
			НовСтр.НомерФактуры       		= НомерФактуры;
			НовСтр.ЗБ_Артикул    			= ЗБ_Артикул;   
			НовСтр.НомерЛомбарда  			= НомерЛомбарда;
			НовСтр.id_Ломбарда  			= rt.fields("nobjv").value; 
			НовСтр.НомерБСО       			= НомерБСО;
			НовСтр.НомерЗБ       			= НомерБСО;
			НовСтр.СтоимостьРеализации  	= rt.fields("SuPoz").value;   			
			НовСтр.Инн  					= rt.fields("inncontr").value;
			НовСтр.НаименованиеДоговора  	= rt.fields("Dog").value; 
			НовСтр.ПризнакНалБезнал  		= rt.fields("NDog").value;         
			НовСтр.Номенклатура             = НайтиНоменклатуруПоАртикулу(ОбъектЗалога); 
			НовСтр.Ответственный            = rt.fields("wpri").value;
			НовСтр.КодРозничногоКлиента     = rt.fields("KodClient").value;
				
			rt.movenext();
			
			Если rt.eof() тогда
				Прервать;
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
		
	АдоСоединение.Close(); 
	
	Для каждого стр из тз Цикл
		СоздатьПеремещениеОбъектаЗалога(стр);		
	КонецЦикла;
	
	тзДокументы = тз.Скопировать();
	тзДокументы.Свернуть("Идентификатор, Инн, НомерФактуры, ДатаДок, Ответственный, КодРозничногоКлиента");
	
	тзЛомбарды = тз.Скопировать();
	//тзЛомбарды.Свернуть("Идентификатор, НомерФактуры, ДатаДок, НомерЛомбарда, id_ломбарда"); 
	тзЛомбарды.Свернуть("Идентификатор, НомерФактуры, ДатаДок, id_ломбарда, Ответственный, КодРозничногоКлиента"); 
	
	Организация 	= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ОсновнаяОрганизация");	
	
	НомВрем = 0;     
	Для каждого СтрокаДокументов из тзДокументы Цикл 		
		ДатаДок = СтрокаДокументов.ДатаДок;
		
		Отбор1 = Новый Структура;
		Отбор1.Вставить("Идентификатор", СтрокаДокументов.Идентификатор);
		
		СтрокиЛомбардов = тзЛомбарды.НайтиСтроки(Отбор1);
		
		//НомВрем = 0;
		НаименованиеПокупателяИмущества = "";
		Для каждого СтрокаЛомбарда из СтрокиЛомбардов Цикл  			
			Ломбард = ВернутьЛомбардПоID(СтрокаЛомбарда.id_ломбарда); 
			
			Если Ломбард = Неопределено Тогда
			Сообщить("НЕ найден ломбард с id "+СокрЛП(стр.id_Ломбарда));
			Возврат;
			КонецЕсли;
		    	
			
			ДокПоиск = ВернутьДокументРеализацииИмущества(Ломбард, ДатаДок, СтрокаЛомбарда.НомерФактуры);
			Если ДокПоиск = неопределено Тогда
				ОбДок = Документы.ЛБ_Реализация.СоздатьДокумент();
			Иначе
				ОбДок = ДокПоиск.ПолучитьОбъект();
			КонецЕсли; 	
			
			Отбор = Новый Структура;
			//Отбор.Вставить("НомерЛомбарда", СтрокаЛомбарда.НомерЛомбарда); 
			Отбор.Вставить("Идентификатор", СтрокаДокументов.Идентификатор);
			
			НайдСтроки 				= тз.НайтиСтроки(Отбор); 	
			ИНН 					= НайдСтроки[0].ИНН;
			НаименованиеДоговора 	= НайдСтроки[0].НаименованиеДоговора;
			ПризнакНалБезнал 		= НайдСтроки[0].ПризнакНалБезнал;
			
			
			НомВрем = НомВрем + 3;
			ОбДок.Дата = ДатаДок + 3600 + НомВрем;
			ОбДок.ПометкаУдаления = Ложь;
			
			ПокупательЗалога                = НайтиПокупателяЗалога(ИНН);
	
			ОбДок.Организация				= Организация; 
			ОбДок.ВидОперации 				= Перечисления.ЛБ_ВидыОперацийРеализация.РеализацияЦООпт;
			ОбДок.Ломбард				    = Ломбард;   
			
			ОбДок.СпособОплаты              = Перечисления.ЛБ_СпособыОплаты.НаличныйРасчет;  
			
			ОбДок.ОтветственныйСотрудник    = ВернутьСотрудника(СтрокаДокументов.Ответственный);
			
			Если СтрокаЛомбарда.id_Ломбарда = 1001 Тогда
				ОбДок.Склад 				= Справочники.ЛБ_Склады.НайтиПоНаименованию("Витрина ЦО"); 
				Если ПокупательЗалога = Справочники._ДемоКонтрагенты.РозничныйПокупатель Тогда
					ОбДок.ВидОперации 				= Перечисления.ЛБ_ВидыОперацийРеализация.РеализацияЦОРозница;	
				КонецЕсли; 
			ИначеЕсли СтрокаЛомбарда.id_Ломбарда = 1000 Тогда
				ОбДок.Склад 				= Справочники.ЛБ_Склады.НайтиПоНаименованию("Общий склад ЦО");  
				ОбДок.ВидОперации 		    = Перечисления.ЛБ_ВидыОперацийРеализация.РеализацияЦООпт;   
				ОбДок.СпособОплаты          = Перечисления.ЛБ_СпособыОплаты.РасчетныйСчет;
			Иначе
				ОбДок.Склад 				= НайтиСкладВитринуЛомбарда(Ломбард); 
				ОбДок.ВидОперации           = Перечисления.ЛБ_ВидыОперацийРеализация.РеализацияЛомбард;
			КонецЕсли; 
						
			//ОбДок.Комментарий    			= СтрокаЛомбарда.НомерФактуры; 
			ОбДок.ПредставлениеНомера       = СтрЗаменить(СтрокаЛомбарда.НомерФактуры, Символы.НПП, ""); 
			
			ОбДок.Контрагент 				= ПокупательЗалога; 
			ОбДок.id_LX                     = СтрокаЛомбарда.Идентификатор;  
			
			
			Если ЗначениеЗаполнено(СтрокаЛомбарда.КодРозничногоКлиента) Тогда
				ОбДок.Контрагент = ВернутьПокупателяЗалогодателя(СтрокаЛомбарда.КодРозничногоКлиента);				
			КонецЕсли;
			
	
			ОбДок.Товары.Очистить();
			
			Для каждого Строч из НайдСтроки Цикл
				НовСтроч = ОбДок.Товары.Добавить(); 
				ОперацияПоЗалогу = ВернутьОперациюПоЗалогуПо_ЗБ(Строч.НомерЗБ);
				НовСтроч.ЗалоговыйБилет = ОперацияПоЗалогу; 
				Если ОперацияПоЗалогу <> Неопределено Тогда
					ОбОперацияПоЗалогу = ОперацияПоЗалогу.ПОлучитьОбъект();  
					ОбОперацияПоЗалогу.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
				
				НовСтроч.ОбъектЗалога   = Строч.Номенклатура;
				НовСтроч.Количество     = 1;  
				НовСтроч.ФактическаяЦена = строч.СтоимостьРеализации;  
				
				тзОст = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоНомеруЗБ(ОбДок.Дата-1, ОбДок.Организация, ОбДок.Ломбард, ОбДок.Склад, Строч.НомерЗБ);  
				Если тзОст.Количество() > 0 Тогда
					НовСТроч.СуммаОценки = тзОст[0].СуммаОценки;
				КонецЕсли;
			КонецЦикла;
			
			ОбДок.СуммаПродажи = ОбДок.Товары.Итог("ФактическаяЦена");
			
			Если ОбДок.Товары.Количество() > 0 Тогда
			Попытка 
				ОбДок.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ОбДок.Записать();
			КонецПопытки; 
			КонецЕсли;
					
		КонецЦикла;
	КонецЦикла;	

КонецПроцедуры  

Функция НайтиСкладВитринуЛомбарда(Ломбард)
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_Склады.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЛБ_Склады КАК ЛБ_Склады
	               |ГДЕ
	               |	ЛБ_Склады.Владелец = &Владелец
	               |	И ЛБ_Склады.ВидСклада = &ВидСклада";
	Запрос.УстановитьПараметр("Владелец", Ломбард); 
	Запрос.УстановитьПараметр("ВидСклада", Перечисления.ЛБ_ВидыСкладов.Витрина);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

Функция НайтиПокупателяЗалога(ИНН)
	Рез  = "";
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	_ДемоКонтрагенты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник._ДемоКонтрагенты КАК _ДемоКонтрагенты
	               |ГДЕ
	               |	_ДемоКонтрагенты.ИНН = &ИНН";
	Запрос.УстановитьПараметр("ИНН", ИНН);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции


Функция ВернутьДокументРеализацииИмущества(Ломбард, Дата, id_LX)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_Реализация.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЛБ_Реализация КАК ЛБ_Реализация
	               |ГДЕ
	               |	ЛБ_Реализация.Дата МЕЖДУ &НачДата И &КонДата
	               |	И ЛБ_Реализация.id_LX = &id_LX
	               |	И ЛБ_Реализация.Ломбард = &Ломбард";
	
	Запрос.УстановитьПараметр("НачДата", НачалоДня(Дата));
	Запрос.УстановитьПараметр("КонДата", КонецДня(Дата));
	Запрос.УстановитьПараметр("Ломбард", Ломбард);   
	
	
	Запрос.УстановитьПараметр("id_LX", СТРЗАМЕНИТЬ(id_LX, символы.НПП, ""));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Рез = Выборка.Ссылка;
	Иначе
		Рез = Неопределено;
	КонецЕсли;
	
	Возврат Рез;	
	
КонецФункции


Функция НайтиНоменклатуруПоАртикулу(АртЗалога)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОбъектыЗалога.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЛБ_ОбъектыЗалога КАК ЛБ_ОбъектыЗалога
	               |ГДЕ
	               |	ЛБ_ОбъектыЗалога.Артикул = &Артикул";
	Запрос.УстановитьПараметр("Артикул", АртЗалога);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции


Процедура ЗагрузитьВозвратЗаймов(НачДата, КонДата, Ломбард) Экспорт
	
	АдоСоединение = АдоНовоеСоединение("dlink");
	
	pndoc = "";
	Если Не ЗначениеЗаполнено(Ломбард) Тогда
		plat = "";
	Иначе
		plat = Ломбард;
	КонецЕсли; 
	
	db="'" + НачДата + "'";
	de="'" + КонДата + "'";
	
	ТекстЗапроса = "exec Z1CAxi_opl_Full "+db+","+de+",'"+plat+"'";
	
	Выборка = АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса);
	
	тз = Новый ТаблицаЗначений;
	тз.Колонки.Добавить("id_LX", 			Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("Дата", 			Новый ОписаниеТипов("Дата"));
	тз.Колонки.Добавить("ДатаВыкупа", 		Новый ОписаниеТипов("Дата"));
	тз.Колонки.Добавить("ДатаРеализации", 	Новый ОписаниеТипов("Дата"));
	тз.Колонки.Добавить("НомерЗБ", 			Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("Вес", 				Новый ОписаниеТипов("Число")); 
	тз.Колонки.Добавить("ВесЧистый", 		Новый ОписаниеТипов("Число"));
	тз.Колонки.Добавить("СуммаОценки", 		Новый ОписаниеТипов("Число"));
	тз.Колонки.Добавить("СуммаСсуды", 		Новый ОписаниеТипов("Число")); 
	тз.Колонки.Добавить("Цена", 			Новый ОписаниеТипов("Число"));
	тз.Колонки.Добавить("ТипИзделия", 		Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("Металл", 			Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("Проба", 			Новый ОписаниеТипов("Строка")); 
	тз.Колонки.Добавить("Ставка", 			Новый ОписаниеТипов("Число")); 
	тз.Колонки.Добавить("Ломбард", 			Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("Категория", 		Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("id_Клиента", 		Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("Артикул", 			Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("id_Ломбарда", 		Новый ОписаниеТипов("Строка")); 
	тз.Колонки.Добавить("id_Ломбарда2", 	Новый ОписаниеТипов("Строка"));  
	тз.Колонки.Добавить("КодСхемыКредитования", Новый ОписаниеТипов("Число"));
	тз.Колонки.Добавить("КодСтатуса", 		Новый ОписаниеТипов("Число")); 
	тз.Колонки.Добавить("id_Документа",     Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("ndoc",     		Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("ddoc",     		Новый ОписаниеТипов("Дата")); 
	тз.Колонки.Добавить("СуммаТело", 		Новый ОписаниеТипов("Число"));
	тз.Колонки.Добавить("СуммаПроценты", 	Новый ОписаниеТипов("Число"));  
	тз.Колонки.Добавить("id_Плательщика", 	Новый ОписаниеТипов("Строка")); 
	тз.Колонки.Добавить("ПСК", 				Новый ОписаниеТипов("Число")); 
	тз.Колонки.Добавить("Статус", 			Новый ОписаниеТипов("Число"));
	тз.Колонки.Добавить("StatTo", 			Новый ОписаниеТипов("Число"));
	тз.Колонки.Добавить("Ответственный",    Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("ТипОплаты",    	Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("ДатаВыдачиЗайма",  Новый ОписаниеТипов("Дата"));

	Пока не Выборка.eof() Цикл
		НовСтр = тз.Добавить();  
		НовСтр.StatTo         	= Выборка.fields("StatTo").value;
		НовСтр.Дата         	= Выборка.fields("Dtpl").value;
		НовСтр.ДатаВыкупа       = Выборка.fields("DVozN").value;
		НовСтр.ДатаРеализации   = Выборка.fields("DlgotN").value; 
		НовСтр.id_LX           	= СтрЗаменить(Выборка.fields("nrec").value, Символы.НПП, ""); 
		//НовСтр.id_Документа    	= СтрЗаменить(Выборка.fields("nrecClientDoc").value, Символы.НПП, "");
		//НовСтр.ndoc         	= Выборка.fields("ndoc").value; 
		//НовСтр.ddoc         	= Выборка.fields("ddoc").value; 
		НовСтр.НомерЗБ         	= Выборка.fields("nomer").value; 
		НовСтр.ПСК         		= Выборка.fields("ProcDay").value; 
		НовСтр.id_Ломбарда      = СтрЗаменить(Выборка.fields("nobj").value, Символы.НПП, "");
		
		НовСтр.id_Клиента       = СтрЗаменить(Выборка.fields("KodClient").value, Символы.НПП, ""); 
		НовСтр.id_Плательщика   = СтрЗаменить(Выборка.fields("cKodClient").value, Символы.НПП, "");
		НовСтр.СуммаТело		= ?(Выборка.fields("sm").value=NULL,0,Выборка.fields("sm").value);
		НовСтр.СуммаПроценты    = ?(Выборка.fields("smp").value=NULL,0,Выборка.fields("smp").value); 
		НовСтр.id_Ломбарда2     = Выборка.fields("nobj_plat2").value;
		НовСтр.Ответственный    = Выборка.fields("FioPr").value;    
		НовСтр.ТипОплаты        = Выборка.fields("tdoc").value;  
		НовСтр.ДатаВыдачиЗайма  = Выборка.fields("dpri").value;
		Выборка.movenext();
	КонецЦикла;
	АдоСоединение.Close();
	
	АдоСоединение = АдоНовоеСоединение("dlink");
	
	
	Перечисление_Залог 			= Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог;
	Перечисление_ОплатаПроцентов= Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов;
	Организация 				= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ОсновнаяОрганизация");
	ЕдиницаИзмерения_гр 		= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ЕдиницаИзмерения_гр");
	ЕдиницаИзмерения_кар 		= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ЕдиницаИзмерения_кар");
	ВременноеПодразделение 		= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ОсновноеПодразделение");
	СхемаКлассика          		= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СхемаКредитования_Классика");
	СхемаЭкспресс          		= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СхемаКредитования_Экспресс");
	
	тзСтран = ВернутьТЗСтран();
	
	тзЧерныеСтатусыКлиентов = ВернутьКлиентовСЧернойМеткой(); 
	
	тзПервыхДатЗБ = ВернутьТаблицуПервыхДатЗБ();
	
	тзДок = тз.Скопировать();
	
	ВидОперации = Перечисление_ОплатаПроцентов;
	Для каждого строкаДок из тзДок Цикл
		Если строкаДок.ДатаВыдачиЗайма < Дата(2020,04,01) Тогда			
			Если ВРЕГ(сокрЛП(строкаДок.ТипОплаты)) = "НАЛ" Тогда
				ЗагрузитьОплатуПоКассеРанееАпреля2020(строкаДок, тзСтран, тзЧерныеСтатусыКлиентов,тзПервыхДатЗБ); 
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		
		НайдДок = ВернутьОперациюПоЗалогуПо_id(строкаДок.id_LX, ВидОперации);
		Если НайдДок = Неопределено Тогда
			ОПЗ = Документы.ЛБ_ОперацияПоЗалогу.СоздатьДокумент();
		Иначе
			ОПЗ = НайдДок.ПолучитьОбъект(); 
			// отменить проведение
			
			ОПЗ.Товары.Очистить();  
			ОПЗ.Вставки.Очистить();
			ОПЗ.ГрафикПлатежей.Очистить(); 
			ОПЗ.ПроцентныеСтавкиПоПериодам.Очистить();
			ОПЗ.НачислениеПроцентовДетально.Очистить(); 
			ОПЗ.ТоварыИзъятыеВозвращенные.Очистить();
			ОПЗ.ТоварыВыкупленные.Очистить(); 
			ОПЗ.ТоварыОтмена.Очистить(); 
			ОПЗ.ТаблицаСостоянийОтмененного.Очистить();			
		КонецЕсли; 
		
		
		
		ОперацияВыдачи = ВернутьОперациюПоЗалогуПо_ЗБ(строкаДок.НомерЗБ);
		Если ОперацияВыдачи = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ОПЗ, ОперацияВыдачи,,"Номер,Дата"); 
		
		ОПЗ.id_LX 		= строкаДок.id_LX; 
		ОПЗ.Дата		= строкаДок.Дата;
		
		Если ВРЕГ(сокрЛП(строкаДок.ТипОплаты)) <> "НАЛ" Тогда
			ОПЗ.БезналичнаяОплата = Истина;
		КонецЕсли;		
		
		
		Если СокрЛП(СтрокаДок.StatTo) = "50" Тогда
			ОПЗ.ВыдачаЗалога = Истина;
			ОПЗ.Выкуп  = Истина; 
			СостЗБ = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗалоговогоБилета(ОПЗ, ОперацияВыдачи); 
			ОПЗ.ДатаВыкупа	       = СостЗБ.ДатаВыкупа;
			ОПЗ.ДатаВыкупаЛьготная = СостЗБ.ДатаВыкупаЛьготныйСрок;
			Для каждого строчТовары из ОперацияВыдачи.Товары Цикл
				НовСтрТовары = ОПЗ.ТоварыВыкупленные.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрТовары, строчТовары);
			КонецЦикла;     
		ИначеЕсли СокрЛП(СтрокаДок.StatTo) = "65" Тогда
			ОПЗ.ВыдачаЗалога = Ложь;
			ОПЗ.Выкуп  = Истина; 
			СостЗБ = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗалоговогоБилета(ОПЗ, ОперацияВыдачи); 
			ОПЗ.ДатаВыкупа	       = СостЗБ.ДатаВыкупа;
			ОПЗ.ДатаВыкупаЛьготная = СостЗБ.ДатаВыкупаЛьготныйСрок;
			//Для каждого строчТовары из ОперацияВыдачи.Товары Цикл
			//	НовСтрТовары = ОПЗ.ТоварыВыкупленные.Добавить();
			//	ЗаполнитьЗначенияСвойств(НовСтрТовары, строчТовары);
			//КонецЦикла; 
		Иначе	
			
			ОПЗ.ВыдачаЗалога = Ложь;
			ОПЗ.Выкуп  = Ложь; 
			СостЗБ = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗалоговогоБилета(ОПЗ, ОперацияВыдачи); 
			
			ОПЗ.ДатаВыкупа	       = СостЗБ.ДатаВыкупа;
			ОПЗ.ДатаВыкупаЛьготная = СостЗБ.ДатаВыкупаЛьготныйСрок;   
		КонецЕсли;
		//Попытка
		//	ОПЗ.СрокЗалога  = (ОПЗ.ДатаВыкупа - ОПЗ.Дата)/86400;
		//	ОПЗ.ДатаВыкупа	       = строкаДок.ДатаВыкупа;
		//	ОПЗ.ДатаВыкупаЛьготная = строкаДок.ДатаРеализации; 
		//Исключение
		//КонецПопытки;
		
		ОПЗ.ВидОперации = Перечисление_ОплатаПроцентов;
		ОПЗ.НомерЗалоговогоБилета = строкаДок.НомерЗБ;
		Если ЗначениеЗаполнено(строкаДок.id_Ломбарда2) Тогда
			ОПЗ.Ломбард = ВернутьЛомбардПоID(строкаДок.id_Ломбарда2); 
		КонецЕсли; 
		//ОПЗ.Ответственный = ВернутьСоздатьПользователя(строкаДок.Ответственный);
		
		
		Для каждого строчТовары из ОперацияВыдачи.Товары Цикл
			НовСтрТовары = ОПЗ.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрТовары, строчТовары);
			
			// здесь надо получать данные из LX по распределению оплаты тела по объектам залога			
			
		КонецЦикла; 
		
		ЗаполнитьТовары(ОПЗ, Опз.Дата, ОПЗ.Товары,  СтрокаДок.СуммаТело);
		
		
		ОПЗ.Вставки.Загрузить(ОперацияВыдачи.Вставки.Выгрузить());
		ОПЗ.ДополнительныеМеталлы.Загрузить(ОперацияВыдачи.ДополнительныеМеталлы.Выгрузить());
		ОПЗ.Дефекты.Загрузить(ОперацияВыдачи.Дефекты.Выгрузить());
		
		НеГрузитьАдреса = Истина;
		
		Если строкаДок.id_клиента <> строкаДок.id_Плательщика Тогда 	
			
			РеквизитыПлательщика = ВернутьРеквизитыКлиентаИзLX(АдоСоединение, тзСтран, "Kodclient = '" + строкаДок.id_Плательщика + "'", НеГрузитьАдреса);
			
			Если ЗначениеЗаполнено(РеквизитыПлательщика[0].ДатаРождения) и (ЗначениеЗаполнено(РеквизитыПлательщика[0].Фамилия) или ЗначениеЗаполнено(РеквизитыПлательщика[0].Имя) или ЗначениеЗаполнено(РеквизитыПлательщика[0].Отчество)) Тогда
				
				Парамс = Новый Структура;
				Парамс.Вставить("Данные", 			РеквизитыПлательщика[0]); 
				Парамс.Вставить("тзСтран", 			тзСтран);
				Парамс.Вставить("АдоСоединение", 	АдоСоединение);
				Парамс.Вставить("СтатусКлиента", 	"");
				Парамс.Вставить("НеГрузитьАдреса", 	НеГрузитьАдреса); 
				Парамс.Вставить("тзЧерныеСтатусыКлиентов", 	тзЧерныеСтатусыКлиентов);
				Парамс.Вставить("тзПервыхДатЗБ", 	тзПервыхДатЗБ);
				
				
				ОПЗ.Залогодатель 	= НайтиСоздатьЗалогодателя(Парамс);
				ОПЗ.Фамилия 		= ОПЗ.Представитель.Фамилия;
				ОПЗ.Имя 			= ОПЗ.Представитель.Имя; 
				ОПЗ.Отчество 		= ОПЗ.Представитель.Отчество;
				
				ОПЗ.Представитель 				= "";
				ОПЗ.ФамилияПредставителя 		= "";
				ОПЗ.ИмяПредставителя 			= ""; 
				ОПЗ.ОтчествоПредставителя 		= "";
				
				//тзКонтИнфо = ВернутьКонтактнуюИнформациюЗалогодателя(строкаДок.Дата+1, ОПЗ.Представитель);
				//Если тзКонтИнфо.Количество() > 0 Тогда   
				//	ЗаполнитьЗначенияСвойств(ОПЗ, тзКонтИнфо[0]);
				//КонецЕсли;			
			КонецЕсли; 
			
			
			
			// документ оплаты получим если распарсим колонку doc
			//select doc from azb_oper where nreczb_oper = -123163226 
			
			РеквДокПлат = ВернутьidДокументаПлательщика(строкаДок.id_LX, строкаДок.id_Плательщика);		
			
			СсылкаДокументаПлательщика = НайтиДокументЗалогодателя(РеквДокПлат, "", "", ОПЗ.Представитель);
			
			ОПЗ.ДокументЗалогодателя = СсылкаДокументаПлательщика; 
			ОПЗ.ДокументВидДокументаЗалогодателя = ОПЗ.ДокументЗалогодателя.ВидДокументаЗалогодателя;
			ОПЗ.ДокументВид = ОПЗ.ДокументЗалогодателя.ВидДокумента;
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	ЛБ_ДокументыЗалогодателя.Владелец КАК Клиент,
			|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
			|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
			|	ЛБ_ДокументыЗалогодателя.Наименование КАК Наименование,
			|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
			|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
			|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
			|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНачалоДействия КАК ДокументНачалоДействия,
			|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия
			|ИЗ
			|	Справочник.ЛБ_ДокументыЗалогодателя КАК ЛБ_ДокументыЗалогодателя
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних КАК ЛБ_ДокументыЗалогодателейСрезПоследних
			|		ПО (ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя = ЛБ_ДокументыЗалогодателя.Ссылка)
			|ГДЕ
			|	ЛБ_ДокументыЗалогодателя.Ссылка = &Док
			|	И ЛБ_ДокументыЗалогодателя.Владелец = &Клиент"; 
			
			Запрос.УстановитьПараметр("Док",    СсылкаДокументаПлательщика);
			Запрос.УстановитьПараметр("Клиент", ОПЗ.Залогодатель);
			
			ВыбДок = Запрос.Выполнить().Выбрать();
			Если ВыбДок.Следующий() Тогда    
				ОПЗ.ДокументДатаВыдачи = ВыбДок.ДокументДатаВыдачи; 
				ОПЗ.ДокументСерия = ВыбДок.ДокументСерия;
				ОПЗ.ДокументНомер = ВыбДок.ДокументНомер;
				ОПЗ.ДокументКемВыдан = ВыбДок.ДокументКемВыдан;
				ОПЗ.ДокументКодПодразделения = ВыбДок.ДокументКодПодразделения;
				ОПЗ.ДокументНачалоДействия = ВыбДок.ДокументНачалоДействия;
				ОПЗ.ДокументСрокДействия = ВыбДок.ДокументСрокДействия;			
			КонецЕсли;			
		КонецЕсли;
		
		
		ОПЗ.СуммаОплатыПроценты = СтрокаДок.СуммаПроценты;
		ОПЗ.СуммаОплатыСсуда    = СтрокаДок.СуммаТело;
		ОПЗ.СуммаОплаты         = СтрокаДок.СуммаТело + СтрокаДок.СуммаПроценты;
		ОПЗ.ПредыдущаяОперация  = НайтиПредыдущуюОперацию(ОПЗ.НомерЗалоговогоБилета);  	
		
		РасчетПроцентовДляОбмена(ОПЗ);
		
		СуммаПроцЗаДень = ВернутьНачисленияПроцентовДетальноЗаПериод(ОПЗ, ОперацияВыдачи);
		Если СуммаПроцЗаДень > 0 Тогда
			Для каждого строч из ОПЗ.НачислениеПроцентовДетально Цикл
				строч.СуммаПроцентов = 0;
			КонецЦикла;
		КонецЕсли;		
		
		ОПЗ.ПСК_LX = СтрокаДок.ПСК;
		
		ОПЗ.Записать(РежимЗаписиДокумента.Запись);
		ОПЗ.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла; 
	
КонецПроцедуры


Функция ВернутьНачисленияПроцентовДетальноЗаПериод(ДокументОбъект, ЗалоговыйБилет) Экспорт 
	
	МоментДоДокумента = Новый Граница(Новый МоментВремени(ДокументОбъект.Дата, ДокументОбъект.Ссылка), ВидГраницы.Исключая);
	ДатаДок = МоментДоДокумента; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаКон", ДатаДок);
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(ДокументОбъект.Дата));
	
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
	Запрос.Текст ="ВЫБРАТЬ
	|	ЛБ_НачислениеПроцентовДетальноОбороты.СуммаПроцентовОборот КАК СуммаПроцентов
	|ИЗ
	|	РегистрНакопления.ЛБ_НачислениеПроцентовДетально.Обороты(&НачалоДня, &ДатаКон, , ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_НачислениеПроцентовДетальноОбороты";	
	СуммаПроц = 0;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СуммаПроц = Выборка.СуммаПроцентов;
	КонецЦикла;
	
	Возврат СуммаПроц;
КонецФункции	 




Процедура РасчетПроцентовДляОбмена(ДокументОбъект) Экспорт     
	ЗалоговыйБилет = ДокументОбъект.ПредыдущаяОперация;
	СтруктураРез = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗалоговогоБилета(ДокументОбъект, ЗалоговыйБилет);
	Если СтруктураРез <> Неопределено Тогда
		ДатаНачалаРасчета = СтруктураРез.ДатаНачалаРасчета; 
		СуммаЗайма = СтруктураРез.СуммаЗайма;  
		СтатусЗБ = СтруктураРез.СтатусЗалоговогоБилета; 
		ПричинаПримененияПроцентнойСхемы = СтруктураРез.ПричинаПрименения;   
		ДокументОбъект.НачислениеПроцентовДетально.Очистить();
		Если СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят ИЛИ 
			СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен ИЛИ
			СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Остановлен Тогда
			СуммаПроцентов = ЛБ_ОбщийМодуль.ПолучитьОстатокПроцентов(ДокументОбъект, ДокументОбъект.ПредыдущаяОперация);
			
			Если НЕ СуммаПроцентов = 0 Тогда
				СтрП = ДокументОбъект.НачислениеПроцентовДетально.Добавить();   
				СтрП.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Базовая; 
				СтрП.ДатаНач = ДатаНачалаРасчета;
				СтрП.ДатаКон = ДокументОбъект.Дата;
				СтрП.ДеньНач = 1;  
				СтрП.ДеньКон = (НачалоДня(СтрП.ДатаКон) - НачалоДня(СтрП.ДатаНач)) / (60 * 60 * 24) + 1; 
				СтрП.СуммаПроцентов = СуммаПроцентов;
			КонецЕсли;
		КонецЕсли;		
		СтруктураП = ЛБ_УправлениеЛомбардом.ПолучитьПредельныеЗначенияПроцентов(ЗалоговыйБилет.Дата, ЗалоговыйБилет.Организация);
		Если НЕ СтруктураП = неопределено Тогда
			ПланкаПроцентов = СтруктураП.ПланкаПроцентов;
			ПредельноеЗначениеПроцентов = ЗалоговыйБилет.СуммаСсуды*СтруктураП.ПланкаПроцентов; 
		Иначе
			ПредельноеЗначениеПроцентов = 0;
		КонецЕсли;   
		СтруктураОкр = ЛБ_УправлениеЛомбардом.ПолучитьУсловияОкругленияПроцентов(ЗалоговыйБилет);
		Установки = ЛБ_УправлениеЛомбардом.ПолучитьУсловияПоДоговору(ЗалоговыйБилет); 	
		ЛБ_ОбщийМодуль.РассчитатьСуммуПроцентовОплата(ДокументОбъект, ДатаНачалаРасчета, ПредельноеЗначениеПроцентов, ПричинаПримененияПроцентнойСхемы, Установки, СтруктураОкр);
	КонецЕсли;
КонецПроцедуры


Функция ВернутьidДокументаПлательщика(id_LX, кодКлиент)
	
	АдоСоединение = АдоНовоеСоединение("dCBDL");
	
	ТекстЗапроса = "select doc from azb_oper where nreczb_oper = '"+ id_LX +"'";		
	
	Выборка = АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса); 
	стрДокум = "";
	Пока не Выборка.eof() Цикл                 
		стрДокум  = Выборка.fields("doc").value;
		
		Выборка.movenext();
	КонецЦикла;
	АдоСоединение.Close();
	
	Серия = "";
	Номер = "";
	Если СтрДокум <> "" Тогда
		ПозНайд = СтрНайти(стрДокум, "pPlat=");
		Если ПозНайд > 0 тогда
			стрПлат = Сред(стрДокум,ПозНайд);
			ПозПасп = СтрНайти(стрПлат, "паспорт РФ");
			Если ПозПасп > 0 Тогда 
				Серия = Сред(стрПлат,ПозПасп+12,4);
				Номер = Сред(стрПлат,ПозПасп+17,6);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	idДокаПлательщика = "";
	
	Если номер <> "" Тогда
		
		АдоСоединение = АдоНовоеСоединение("dCBDL"); 
		ТекстЗапроса = "select * from aclientdoc where kodclient = '"+ кодКлиент +"' and Ndoc = '"+Номер+"'"; 
		Выборка = АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса); 
		стрДокум = "";
		Пока не Выборка.eof() Цикл                 
			idДокаПлательщика  = Выборка.fields("nrecClientDoc").value;
			
			Выборка.movenext();
		КонецЦикла;
		АдоСоединение.Close(); 
	КонецЕсли;	
	
	Возврат idДокаПлательщика;
	
КонецФункции

Функция НайтиПредыдущуюОперацию(НомерЗБ)
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	ЛБ_ОперацияПоЗалогу.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЛБ_ОперацияПоЗалогу КАК ЛБ_ОперацияПоЗалогу
	|ГДЕ
	|	ЛБ_ОперацияПоЗалогу.НомерЗалоговогоБилета = &НомерЗБ 
	| И ЛБ_ОперацияПоЗалогу.ВидОперации = &ВидОперации";
	Запрос.УстановитьПараметр("НомерЗБ", 	 НомерЗБ); 
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат неопределено;
КонецФункции

Функция ВернутьДанныеОбъектаЗалогаИзLX(Артикул, id_LX)
	
	АдоСоединение = АдоНовоеСоединение("dlink"); 
	
	
	ПозТире 	= СтрНайти(Артикул,"-");
	Номер 		= Сред(Артикул, ПозТире+1);  	
	
	ТекстЗапроса = "select * from aZBPoz where nreczb = '"+id_LX+"' and NPoz = '"+СокрЛП(Номер)+"'";
	
	Выборка = АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса);   
	
	Структ = Новый Структура; 
	Структ.Вставить("Клеймо",  Неопределено);
	Структ.Вставить("Именник", Неопределено);
	Структ.Вставить("Описание",Неопределено);
	Структ.Вставить("id_LX_Вставки",Неопределено); 
	
	
	Пока не Выборка.eof() Цикл
		клеймо = Выборка.fields("Kleimo").value;
		Если клеймо = 1 Тогда
			Структ.Вставить("Клеймо", Перечисления.ЛБ_ВидыКлейм.Есть);
		ИначеЕсли клеймо = 2 Тогда
			Структ.Вставить("Клеймо", Перечисления.ЛБ_ВидыКлейм.ЕстьФальшь);  
		ИначеЕсли клеймо = 3 Тогда
			Структ.Вставить("Клеймо", Перечисления.ЛБ_ВидыКлейм.Нет);
		ИначеЕсли клеймо = 4 Тогда
			Структ.Вставить("Клеймо", Перечисления.ЛБ_ВидыКлейм.НеЧитается); 
		ИначеЕсли клеймо = 5 Тогда
			Структ.Вставить("Клеймо", Перечисления.ЛБ_ВидыКлейм.ЧитаетсяЧастично);
		КонецЕсли;		
		
		Именник = Выборка.fields("Imennik").value;
		Если Именник = 1 Тогда  
			Структ.Вставить("Именник", Перечисления.ЛБ_Именник.Да);
		ИначеЕсли Именник = 2 Тогда
			Структ.Вставить("Именник", Перечисления.ЛБ_Именник.Нет);
		КонецЕсли;
		
		Структ.Вставить("Описание", Выборка.fields("Dop").value);  
		Структ.Вставить("id_LX_Вставки", СтрЗаменить(Выборка.fields("NRecZBPoz").value,Символы.НПП, ""));
		
		
		Выборка.movenext();
	КонецЦикла;
	АдоСоединение.Close();
	
	Возврат Структ;	
КонецФункции

Функция ВернутьВставкиОбъектаЗалогаИзLX(id_LX) 	
	
	АдоСоединение = АдоНовоеСоединение("dlink"); 
	
	ТекстЗапроса = "select * from Azbpozvst where nreczbpoz = '"+id_LX+"'";
	
	Выборка = АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса);   
	
	тз = Новый ТаблицаЗначений;
	тз.Колонки.Добавить("ВидВставки"); 
	тз.Колонки.Добавить("Огранка");
	тз.Колонки.Добавить("Количество");
	тз.Колонки.Добавить("Вес"); 
	тз.Колонки.Добавить("Оценка"); 
	тз.Колонки.Добавить("СуммаСсуды");  	
	
	Пока не Выборка.eof() Цикл
		НовСтр = тз.Добавить();
		НовСтр.ВидВставки 	= Выборка.fields("KodVST").value; 
		НовСтр.Огранка 		= Выборка.fields("KodVSTForm").value;  
		НовСтр.Количество 	= Выборка.fields("KolVST").value;
		НовСтр.Вес 			= Выборка.fields("VesVST").value;   
		НовСтр.Оценка 		= Выборка.fields("Ocenka").value;
		НовСтр.СуммаСсуды 	= Выборка.fields("sKred").value;		
		
		Выборка.movenext();
	КонецЦикла;
	АдоСоединение.Close();
	
	Возврат тз;	
КонецФункции


Процедура ЗагрузитьВыдачуОтветхранения(НачДата, КонДата, nObj, ПерезаписыватьКлиентов) Экспорт
	АдоСоединение = АдоНовоеСоединение("dCBDL");
	
	ТекстЗапроса = "select o.nreczb, o.NRecZB_Oper, o.doper, z.nomer, c0.KodClient, dzb.NRecClientDoc,1, dzb.NRecDovZB, buser.fio
	|from azb_oper o
	|inner join azb z on o.NRecZB =z.NRecZB 
	|inner join aclient c on z.KodClient =c.KodClient 
	|left join (aDovZB dzb inner join aclient c0  on dzb.KodClient =c0.KodClient)  on dzb.NRecZB =z.NRecZB 
	|left join buser on o.KodUser =buser.KodUser  
	|where StatTo =50 and StatFrom =65 and xOtmena =0 and c.fiof<>o.FioDS and o.fiods=c0.fiof and doper >= '" + НачДата +"' and doper <= '" +КонДата+"'
	|union
	|select o.nreczb, o.NRecZB_Oper, o.doper, z.nomer, c.KodClient, cd.NRecClientDoc,0, null, buser.fio
	|from azb_oper o
	|inner join azb z on o.NRecZB =z.NRecZB 
	|left join buser on o.KodUser =buser.KodUser  
	|inner join (aclient c inner join aClientDoc cd on c.KodClient =cd.KodClient and cd.xv=1 inner join ssdocvid on ssdocvid.KodDocVid= cd.KodDocVid and ssdocvid.vz=1 ) 
	|on o.FioDS =c.fiof and z.nObj =c.nObj and z.KodClient =c.KodClient 
	|where statfrom=65 and statto = 50 and xOtmena =0 and doper >= '" + НачДата +"' and doper <= '" +КонДата+"'";
	//Если nObj <> Неопределено Тогда
	//	ТекстЗапроса = ТекстЗапроса + " and o.nobj = '"+СокрЛП(nObj)+"'";
	//КонецЕсли;
	
	
	
	Выборка = АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса);   
	
	тз = Новый ТаблицаЗначений;
	тз.Колонки.Добавить("NRecZB", 			Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("NRecZB_Oper", 		Новый ОписаниеТипов("Строка"));  
	тз.Колонки.Добавить("Дата", 			Новый ОписаниеТипов("Дата")); 
	тз.Колонки.Добавить("НомерБилета", 		Новый ОписаниеТипов("Строка")); 
	тз.Колонки.Добавить("КомуВыдано", 		Новый ОписаниеТипов("Строка")); 
	тз.Колонки.Добавить("id_Документа", 	); 
	тз.Колонки.Добавить("id_Доверенности", 	Новый ОписаниеТипов("Строка")); 
	тз.Колонки.Добавить("Ответственный", 	Новый ОписаниеТипов("Строка"));
	
	
	
	
	Пока не Выборка.eof() Цикл
		НовСтр = тз.Добавить();      
		НовСтр.Дата      		= Выборка.fields("DOper").value;
		НовСтр.NRecZB         	= СтрЗаменить(Выборка.fields("NRecZB").value, Символы.НПП, ""); 
		НовСтр.NRecZB_Oper      = СтрЗаменить(Выборка.fields("NRecZB_Oper").value, Символы.НПП, ""); 
		НовСтр.НомерБилета      = Выборка.fields("Nomer").value; 
		НовСтр.КомуВыдано       = СтрЗаменить(Выборка.fields("kodClient").value, Символы.НПП, ""); 
		НовСтр.id_Документа     = Выборка.fields("NRecClientDoc").value; 
		НовСтр.id_Доверенности  = СтрЗаменить(Выборка.fields("NRecDovZB").value, Символы.НПП, "");
		НовСтр.Ответственный    = Выборка.fields("fio").value;
		
		
		
		Выборка.movenext();
	КонецЦикла;
	АдоСоединение.Close();
	
	
	АдоСоединение = АдоНовоеСоединение("dlink");
	
	тзСтран = ВернутьТЗСтран();
	тзЧерныеСтатусыКлиентов = ВернутьКлиентовСЧернойМеткой(); 
	
	тзПервыхДатЗБ = ВернутьТаблицуПервыхДатЗБ();
	
	
	
	ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога;
	Для каждого стр из тз Цикл		
		
		НомерБилета =  стр.НомерБилета; 
		

		
		ОперацияВыдачи = ВернутьОперациюПоЗалогуПо_ЗБ(НомерБилета);
		Если ОперацияВыдачи = Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		
		НайдДок = ВернутьОперациюПоЗалогуПо_id(стр.NRecZB_Oper, ВидОперации);
		Если НайдДок = Неопределено Тогда
			ОПЗ = Документы.ЛБ_ОперацияПоЗалогу.СоздатьДокумент();
		Иначе
			ОПЗ = НайдДок.ПолучитьОбъект(); 
			ОПЗ.Товары.Очистить();  
			ОПЗ.Вставки.Очистить();
			ОПЗ.ТоварыВыкупленные.Очистить();
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ОПЗ, ОперацияВыдачи,,"Номер,Дата"); 
		
		ОПЗ.id_LX 		= стр.NRecZB_Oper; 
		ОПЗ.Дата		= стр.Дата;
		
		ОПЗ.ВыдачаЗалога = Истина;

		
		ОПЗ.ВидОперации = ВидОперации;
		ОПЗ.НомерЗалоговогоБилета = НомерБилета; 
		Для каждого строчТовары из ОперацияВыдачи.Товары Цикл
			НовСтрТовары = ОПЗ.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрТовары, строчТовары);
		КонецЦикла;
		Для каждого строчТовары из ОперацияВыдачи.Товары Цикл
			НовСтрТовары = ОПЗ.ТоварыВыкупленные.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрТовары, строчТовары);
		КонецЦикла; 
		Для каждого строчВставки из ОперацияВыдачи.Вставки Цикл
			НовСтрВставки = ОПЗ.Вставки.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрВставки, строчВставки);
		КонецЦикла; 
		
		НеГрузитьАдреса = Истина;
		
		РеквизитыКлиента = ВернутьРеквизитыКлиентаИзLX(АдоСоединение, тзСтран, "Kodclient = '" + стр.КомуВыдано + "'", НеГрузитьАдреса);
		
		Если ЗначениеЗаполнено(РеквизитыКлиента[0].ДатаРождения) и (ЗначениеЗаполнено(РеквизитыКлиента[0].Фамилия) или ЗначениеЗаполнено(РеквизитыКлиента[0].Имя) или ЗначениеЗаполнено(РеквизитыКлиента[0].Отчество)) Тогда 
			Парамс = Новый Структура;
			Парамс.Вставить("Данные", 			РеквизитыКлиента[0]); 
			Парамс.Вставить("тзСтран", 			тзСтран);
			Парамс.Вставить("АдоСоединение", 	АдоСоединение);
			Парамс.Вставить("СтатусКлиента", 	"");
			Парамс.Вставить("НеГрузитьАдреса", 	НеГрузитьАдреса); 
			Парамс.Вставить("тзЧерныеСтатусыКлиентов", 	тзЧерныеСтатусыКлиентов);
			Парамс.Вставить("тзПервыхДатЗБ", 	тзПервыхДатЗБ); 
			Парамс.Вставить("ПерезаписыватьКлиентов", 	ПерезаписыватьКлиентов);
			
			
			
			ОПЗ.Залогодатель 	= НайтиСоздатьЗалогодателя(Парамс);
			ОПЗ.Фамилия 		= ОПЗ.Залогодатель.Фамилия;
			ОПЗ.Имя 			= ОПЗ.Залогодатель.Имя; 
			ОПЗ.Отчество 		= ОПЗ.Залогодатель.Отчество; 
			
			тзКонтИнфо = ВернутьКонтактнуюИнформациюЗалогодателя(стр.Дата+1, ОПЗ.Залогодатель);
			Если тзКонтИнфо.Количество() > 0 Тогда   
				ЗаполнитьЗначенияСвойств(ОПЗ, тзКонтИнфо[0]);
			КонецЕсли;			
		КонецЕсли;
		
		СсылкаДокументаКлиента = НайтиДокументЗалогодателя(стр.id_Документа, "0",ТекущаяДата(), ОПЗ.Залогодатель);
		
		ОПЗ.ДокументЗалогодателя = СсылкаДокументаКлиента;
		
		
		
		//ОПЗ.Ответственный = ВернутьСоздатьПользователя(стр.Ответственный);
		
		
		
		тзДовер = ВернутьДоверенностиИзLX(стр.NRecZB);
		Для каждого стрДовер из тзДовер Цикл 

			
			НайдДовер = ВернутьДоверенностьПо_id(СокрЛП(стрДовер.id_LX));
			Если НайдДовер = Неопределено Тогда
				ДокДоверенность = Документы.ЛБ_Доверенности.СоздатьДокумент();
			Иначе
				ДокДоверенность = НайдДовер.ПолучитьОбъект();
			КонецЕсли; 
			
			Если стрДовер.Тип = 4 Тогда
				ДокДоверенность.ВидДоверенности = Перечисления.ЛБ_ВидыДоверенностей.Письменная;
			Иначе  
				ДокДоверенность.ВидДоверенности = Перечисления.ЛБ_ВидыДоверенностей.Нотариальная; 
			КонецЕсли;		
			
			ДокДоверенность.ЗалоговыйБилет = ОПЗ.Ссылка;
			ДокДоверенность.Клиент         = ОПЗ.Залогодатель;
			ДокДоверенность.ДокументКлиента= ОПЗ.ДокументЗалогодателя;
			ДокДоверенность.id_LX          = стрДовер.id_LX;
			ДокДоверенность.Ломбард        = ВернутьЛомбардПоID(стрДовер.id_ломбарда); 
			ДокДоверенность.НомерДоверенности = стрДовер.Номер;
			ДокДоверенность.Дата 		   = стрДовер.Дата;   
			ДокДоверенность.ДатаДоверенности 		 = стрДовер.ДатаНачала;
			ДокДоверенность.СрокДействияДоверенности = стрДовер.ДатаОкончания; 
			//Если стрДовер.Статус = 1 Тогда
			ДокДоверенность.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Оформление;
			//КонецЕсли; 
			
			РеквизитыПредставителя = ВернутьРеквизитыКлиентаИзLX(АдоСоединение, тзСтран, "KodClient = '" + стрДовер.id_представителя + "'", НеГрузитьАдреса);
			
			Если ЗначениеЗаполнено(РеквизитыПредставителя[0].ДатаРождения) и (ЗначениеЗаполнено(РеквизитыПредставителя[0].Фамилия) или ЗначениеЗаполнено(РеквизитыПредставителя[0].Имя) или ЗначениеЗаполнено(РеквизитыПредставителя[0].Отчество)) Тогда
				
				Парамс = Новый Структура;
				Парамс.Вставить("Данные", 			РеквизитыПредставителя[0]); 
				Парамс.Вставить("тзСтран", 			тзСтран);
				Парамс.Вставить("АдоСоединение", 	АдоСоединение);
				Парамс.Вставить("СтатусКлиента", 	"");
				Парамс.Вставить("НеГрузитьАдреса", 	НеГрузитьАдреса); 
				Парамс.Вставить("тзЧерныеСтатусыКлиентов", 	тзЧерныеСтатусыКлиентов);
				Парамс.Вставить("тзПервыхДатЗБ", 	тзПервыхДатЗБ);
				
				ДокДоверенность.ПредставительКлиента 	= НайтиСоздатьЗалогодателя(Парамс);
			КонецЕсли;
			
			ДокДоверенность.ДокументПредставителяКлиента = НайтиДокументЗалогодателя(стрДовер.id_ДокПредставителя, "", "", ДокДоверенность.ПредставительКлиента);
			
			
			ДокДоверенность.Записать(РежимЗаписиДокумента.Запись);
			ДокДоверенность.Записать(РежимЗаписиДокумента.Проведение); 
		КонецЦикла;
		
		
		Если ЗначениеЗаполнено(стр.id_Доверенности) Тогда
			ОПЗ.ДоверенностьПредставителя = ВернутьДоверенностьПо_id(СокрЛП(стр.id_Доверенности));
		КонецЕсли;			
		
		
		ОПЗ.ПредыдущаяОперация  = НайтиПредыдущуюОперацию(ОПЗ.НомерЗалоговогоБилета);	
		ОПЗ.Записать(РежимЗаписиДокумента.Запись);
		ОПЗ.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
	
	АдоСоединение.Close();	
КонецПроцедуры

Функция ВернутьКлиентовСЧернойМеткой() Экспорт
	
	АдоСоединение = АдоНовоеСоединение("dCBDL"); 
	
	ТекстЗапроса = "select x.KodClient, DPri, a.IDCd, y.NmKodB
	|from(
	|select kodclient, MIN(DPri) DPri from [dCBDL_dan].[dbo].[azb] a
	|group by kodclient
	|)x
	|join [dCBDL_dan].[dbo].[aClient] a on x.KodClient = a.KodClient 
	|join 
	|   (
	|	select rtrim(FIO) + ' ' + isnull(CONVERT([varchar], [DataR], 103), '') IDCd, ss.NmKodB
	|		from dCBDL_dan.dbo.ssBlackList (nolock) s
	|			 join [dCBDL_dan].[dbo].[ssKodBlack] ss on s.KodBlack = ss.KodBlack
	|	where s.xDel = 0 and 
	|	   s.KodBlack in(2, 14)
	|)y on a.IDCd = y.IDCd"; 
	
	Выборка = АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса) ; 
	
	тз = Новый ТаблицаЗначений;
	тз.Колонки.Добавить("id_Клиента");
	тз.Колонки.Добавить("Метка");
	
	
	Пока не Выборка.eof() Цикл    
		НовСтр = тз.Добавить();
		НовСтр.id_Клиента = СтрЗаменить(Выборка.fields("kodclient").value, Символы.НПП, "");
		НовСтр.Метка = Выборка.fields("NmKodB").value;
		
		Выборка.movenext();
	КонецЦикла;
	
	Возврат тз;	
	
КонецФункции



&НаСервере
Процедура РассчитатьСуммуПроцентов(Параметры) 
	Док 						= Параметры.Док; 
	ОкруглятьЦены 				= Параметры.ОкруглятьЦены;
	ВидОкругленияСуммыПроцентов = Параметры.ВидОкругленияСуммыПроцентов;
	ПорядокОкругления 			= Параметры.ПорядокОкругления; 
	ОкруглятьВБольшуюСторону 	= Параметры.ОкруглятьВБольшуюСторону; 
	СхемаКредитования 			= Параметры.СхемаКредитования;
	ДатаДок 					= Параметры.ДатаДок; 
	ТаблицаСтавок               = Параметры.ТаблицаСтавок;
	СуммаЗайма                  = Параметры.СуммаЗайма; 
	Организация                 = Параметры.Организация;
	
	
	ДатаВыкупа = НачалоДня(ДатаДок) + 86401*Док.СрокЗалога;  
	ДатаВыкупа = ЛБ_УправлениеЛомбардом.ИсключитьДатаВыкупаПразничныйДень(ДатаВыкупа);
	
	
	Док.ГрафикПлатежей.Очистить();
	Если НЕ Док.ПроцентнаяСхема = 0 Тогда                                                                                                                
		СтруктураОкругления = новый Структура;
		СтруктураОкругления.Вставить("ОкруглятьЦены", ОкруглятьЦены);  
		СтруктураОкругления.Вставить("ВидОкругленияСуммыПроцентов", ВидОкругленияСуммыПроцентов);
		СтруктураОкругления.Вставить("ПорядокОкругления", ПорядокОкругления);  
		СтруктураОкругления.Вставить("ОкруглятьВБольшуюСторону", ОкруглятьВБольшуюСторону);  
		ДатаНачала = ЛБ_УправлениеЛомбардом.ПолучитьДатуНачалаРасчетаПроцентов(ДатаДок, Организация);
		
		СуммаПроцентов = 0;
		Для сч = 0 По ТаблицаСтавок.Количество()-1 Цикл 
			СтрС = ТаблицаСтавок.Получить(сч); 
			Если СтрС.ДеньНачалаПрименения = 1 Тогда
				ДатаНач = ДатаНачала;
			Иначе 
				ДатаНач = НачалоДня(ДатаНачала + СтрС.ДеньНачалаПрименения*(60 * 60 * 24));
			КонецЕсли;	
			Если ДатаНач > ДатаВыкупа Тогда 
				Прервать;
			КонецЕсли;	
			
			сч1 = сч + 1;
			Если сч1 >= ТаблицаСтавок.Количество() Тогда
				ДатаКон = ДатаВыкупа; 
				ДеньКон = Док.СрокЗалога;
			Иначе   
				СтрС1 = ТаблицаСтавок.Получить(сч1);
				ДатаКонца = НачалоДня(ДатаНачала + (СтрС1.ДеньНачалаПрименения-1)*(60 * 60 * 24)); 
				Если ДатаКонца > ДатаВыкупа Тогда
					ДатаКон = ДатаВыкупа;
					ДеньКон = Док.СрокЗалога;
				Иначе
					ДатаКон = ДатаКонца; 
					ДеньКон = СтрС1.ДеньНачалаПрименения-1;
				КонецЕсли;	
			КонецЕсли;	
			
			Если НЕ (НачалоДня(ДатаКон) < НачалоДня(ДатаНач)) тогда
				//СтавкаП = СтрС.ПроцентнаяСтавка;
				СтавкаП = Док.ПроцентнаяСхема;  //подменяем ставку из LX, а не рассчитанную
				Если СтрС.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Акционная Тогда
					Если НЕ СтрС.ПроцентнаяСтавкаАкция = 0 Тогда
						СтавкаП = СтрС.ПроцентнаяСтавкаАкция;
					ИначеЕсли НЕ СтрС.ОтклонениеАкцияОтносительное = 0 Тогда	 
						СтавкаП = СтрС.ПроцентнаяСтавка + СтрС.ПроцентнаяСтавка*СтрС.ОтклонениеАкцияОтносительное/100;
					ИначеЕсли НЕ СтрС.ОтклонениеАкцияАбсолютное = 0 Тогда
						СтавкаП = СтрС.ПроцентнаяСтавка + СтрС.ОтклонениеАкцияАбсолютное;
					КонецЕсли; 
				КонецЕсли;	              
				Результат = ЛБ_ОбщийМодуль.РассчитатьСуммуПроцентов(ДатаНач, ДатаКон, СтавкаП, СуммаЗайма, СтруктураОкругления);
				СуммаПроцентов = СуммаПроцентов + Результат.СуммаПроцентов; 
				Если СтрС.ДеньНачалаПрименения = 1 Тогда
					СуммаПроцентовДень = Результат.СуммаПроцентовДень;				
				КонецЕсли;	
				СтрП = Док.ГрафикПлатежей.Добавить();   
				СтрП.ВидПроцентнойСтавки = СтрС.ВидПроцентнойСтавки; 
				СтрП.ДатаНач = ДатаНач;
				СтрП.ДатаКон = ДатаКон;
				СтрП.ДеньНач = СтрС.ДеньНачалаПрименения;  
				СтрП.ДеньКон = ДеньКон; 
				СтрП.ПроцентнаяСтавкаБазовая = СтрС.ПроцентнаяСтавка;
				СтрП.ПроцентнаяСтавкаАкция = СтрС.ПроцентнаяСтавкаАкция;
				СтрП.ОтклонениеАкцияОтносительное = СтрС.ОтклонениеАкцияОтносительное; 
				СтрП.ОтклонениеАкцияАбсолютное = СтрС.ОтклонениеАкцияАбсолютное;
				СтрП.СуммаПроцентов = Результат.СуммаПроцентов;
				СтрП.СуммаПроцентовДень = СуммаПроцентовДень;
			КонецЕсли;	
		Конеццикла;	
	Иначе
		СуммаПроцентов = 0;
		СуммаПроцентовДень = 0;
	КонецЕсли;	
КонецПроцедуры

Функция ВернутьТаблицуСтавок(ОПЗ)
	ПричинаПримененияПроцентнойСхемы = Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма;
	ТаблицаСтавок = Новый ТаблицаЗначений;
	ТаблицаСтавок.Колонки.Добавить("ДеньНачалаПрименения", Новый ОписаниеТипов("Число")); 
	ТаблицаСтавок.Колонки.Добавить("ПроцентнаяСтавка", Новый ОписаниеТипов("Число")); 
	ТаблицаСтавок.Колонки.Добавить("ПроцентнаяСтавкаАкция", Новый ОписаниеТипов("Число"));
	ТаблицаСтавок.Колонки.Добавить("ОтклонениеАкцияОтносительное", Новый ОписаниеТипов("Число"));
	ТаблицаСтавок.Колонки.Добавить("ОтклонениеАкцияАбсолютное", Новый ОписаниеТипов("Число"));
	ТаблицаСтавок.Колонки.Добавить("ВидПроцентнойСтавки");
	
	Если ОПЗ.Дата >= Дата(2023, 02, 01) Тогда	
		//ТаблицаС = ЛБ_ОбщийМодуль.ЗаполнитьТаблицуПроцентныхСтавок(ОПЗ.Дата, ОПЗ.Ломбард, ОПЗ.СхемаКредитования, ОПЗ.Акция, ОПЗ.СтатусЗалогодателя, ОПЗ.СуммаСсуды);					
		//Если НЕ ТаблицаС.Количество() = 0 Тогда  
		
		//ОПЗ.ПроцентныеСтавкиПоПериодам.Загрузить(ТаблицаС);
		//
		//Отбор = Новый структура;
		//Отбор.Вставить("ПричинаПрименения", ПричинаПримененияПроцентнойСхемы); 
		//СтрокиП = опз.ПроцентныеСтавкиПоПериодам.НайтиСтроки(Отбор); 
		Для каждого СтрП из опз.ПроцентныеСтавкиПоПериодам цикл 
			НоваяСтр = ТаблицаСтавок.Добавить(); 
			ЗаполнитьЗначенияСвойств(НоваяСтр, СтрП);
		КонецЦикла;		
		//КонецЕсли;  		
	Иначе
		
		НовС = ТаблицаСтавок.Добавить();
		//НовС.ПричинаПрименения = Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма;
		НовС.ДеньНачалаПрименения = 1;
		НовС.ПроцентнаяСтавка = ОПЗ.ПроцентнаяСхема;
		НовС.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Базовая;
		
		
		
	КонецЕсли;
	
	Возврат ТаблицаСтавок; 
КонецФункции	


Функция ВернутьКоличествоДнейПоСхеме(Схема, Дата)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_ТехническиеСтавкиСрезПоследних.ДеньНачалаПрименения КАК ДеньНачалаПрименения
	|ИЗ
	|	РегистрСведений.ЛБ_ТехническиеСтавки.СрезПоследних(&Дата, СхемаКредитования = &Схема) КАК ЛБ_ТехническиеСтавкиСрезПоследних";
	Запрос.УстановитьПараметр("Дата",Дата);
	Запрос.УстановитьПараметр("Схема",Схема); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДеньНачалаПрименения;
	КонецЕсли;
	
	Возврат 121;
КонецФункции

Функция ВернутьСоздатьПользователя(Ответственный)
	Ответственный = СокрЛП(Ответственный); 
	Ответственный = СтрЗаменить(Ответственный, ".", ""); 
	Ответственный = СтрЗаменить(Ответственный, " ", "");
	
	
	Спр = Справочники.Пользователи.НайтиПоНаименованию(Ответственный);
	Если спр = Справочники.Пользователи.ПустаяСсылка() Тогда
		
		ИмяДляВхода = СтрЗаменить(Ответственный, ".", ""); 
		ИмяДляВхода = СтрЗаменить(ИмяДляВхода, " ", "");
		
		
		ПараметрыПольз = Новый Структура;
		ПараметрыПольз.Вставить("ИмяПользователя",  		Ответственный);  
		ПараметрыПольз.Вставить("ИмяВходаПользователя",  	ИмяДляВхода);
		ПараметрыПольз.Вставить("Пароль",  					"123");
		ПараметрыПольз.Вставить("ИмяПрофиля",  				"Товаровед");
		ПараметрыПольз.Вставить("guid_Физлица",  			"");
		
		ЛБ_ОбменLX.СоздатьПользователя(ПараметрыПольз);
	КонецЕсли; 
	Спр = Справочники.Пользователи.НайтиПоНаименованию(Ответственный);
	
	Возврат Спр;
	
КонецФункции


Процедура РассчитатьПредельныСрокЗайма(Док)
	док.ПредельныйСрокЗаймаДни = ЛБ_УправлениеЛомбардом.ПолучитьПредельныйСрокЗайма(Док.Дата, Док.СхемаКредитования);
	Если НЕ Док.ПредельныйСрокЗаймаДни = 0 Тогда  
		док.ПредельныйСрокЗайма = НачалоДня(Док.Дата) + Док.ПредельныйСрокЗаймаДни*24*60*60;
	Иначе  
		Док.ПредельныйСрокЗайма = Дата(1,1,1);
	КонецЕсли;	
КонецПроцедуры

Функция ВернутьСотрудника(Сотр)
	
	стрСотр = СтрЗаменить(Сотр, ".","");
	стрСотр = СтрЗаменить(стрСотр, " ","");
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ЛБ_Сотрудники.Ссылка КАК Ссылка
	                |ИЗ
	                |	Справочник.ЛБ_Сотрудники КАК ЛБ_Сотрудники
	                |ГДЕ
	                |	ЛБ_Сотрудники.ФизическоеЛицо.ФИОБезТочек = &ФИОБезТочек";
	Запрос.УстановитьПараметр("ФИОБезТочек", СокрЛП(стрСотр));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;	
КонецФункции

Процедура ЗагрузитьВыдачуЗаймов(ПараметрыЗагрузки) Экспорт 
	НачДата = ПараметрыЗагрузки.НачДата;
	КонДата = ПараметрыЗагрузки.КонДата;	
	Ломбард = ПараметрыЗагрузки.Ломбард; 
	
	ТолькоКлиенты = Ложь;
	Если ПараметрыЗагрузки.Свойство("ТолькоКлиенты") Тогда
		ТолькоКлиенты = ПараметрыЗагрузки.ТолькоКлиенты;
	КонецЕсли; 
	
	ПерезаписыватьКлиентов = Истина;
	Если ПараметрыЗагрузки.Свойство("ПерезаписыватьКлиентов") Тогда
		ПерезаписыватьКлиентов = ПараметрыЗагрузки.ПерезаписыватьКлиентов;
	КонецЕсли;
	
	НеГрузитьАдреса = Ложь;
	Если ПараметрыЗагрузки.Свойство("НеГрузитьАдреса") Тогда
		НеГрузитьАдреса = ПараметрыЗагрузки.НеГрузитьАдреса;
	КонецЕсли;  
	
	ИдентификаторЗаписи = "''";
	Если ПараметрыЗагрузки.Свойство("ИдентификаторЗаписи") Тогда
		ИдентификаторЗаписи = ПараметрыЗагрузки.ИдентификаторЗаписи;
	КонецЕсли;  
	
	тзПервыхДатЗБ = Новый ТаблицаЗначений;
	Если ПараметрыЗагрузки.Свойство("тзПервыхДатЗБ") Тогда
		тзПервыхДатЗБ = ПараметрыЗагрузки.тзПервыхДатЗБ;
	КонецЕсли; 
	
	СделатьАпдейт = Ложь;
	Если ПараметрыЗагрузки.Свойство("СделатьАпдейт") Тогда
		СделатьАпдейт = ПараметрыЗагрузки.СделатьАпдейт;
	КонецЕсли; 
	
	
	АдоСоединение = АдоНовоеСоединение("dlink");
	
	pndoc = "";
	Если Не ЗначениеЗаполнено(Ломбард) Тогда
		plat = "";
	Иначе
		plat = Ломбард;
	КонецЕсли; 
	
	db="'" + НачДата + "'";
	de="'" + КонДата + "'"; 
	
	ТекстЗапроса = "exec [z1CAxi_azb] 2,'"+pndoc +"',"+db+","+de+",'"+plat+"',0,"+ИдентификаторЗаписи;
	
	
	Выборка = АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса);
	
	тз = Новый ТаблицаЗначений;
	тз.Колонки.Добавить("id_LX", 			Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("Дата", 			Новый ОписаниеТипов("Дата"));
	тз.Колонки.Добавить("ДатаВыкупа", 		Новый ОписаниеТипов("Дата"));
	тз.Колонки.Добавить("ДатаРеализации", 	Новый ОписаниеТипов("Дата"));
	тз.Колонки.Добавить("НомерЗБ", 			Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("Вес", 				Новый ОписаниеТипов("Число")); 
	тз.Колонки.Добавить("ВесЧистый", 		Новый ОписаниеТипов("Число"));
	тз.Колонки.Добавить("СуммаОценки", 		Новый ОписаниеТипов("Число"));
	тз.Колонки.Добавить("СуммаСсуды", 		Новый ОписаниеТипов("Число")); 
	тз.Колонки.Добавить("Цена", 			Новый ОписаниеТипов("Число"));
	тз.Колонки.Добавить("ТипИзделия", 		Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("Металл", 			Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("Проба", 			Новый ОписаниеТипов("Строка")); 
	тз.Колонки.Добавить("Ставка", 			Новый ОписаниеТипов("Число")); 
	тз.Колонки.Добавить("Ломбард", 			Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("Категория", 		Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("id_Клиента", 		Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("Артикул", 			Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("id_Ломбарда", 		Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("КодСхемыКредитования", Новый ОписаниеТипов("Число"));
	тз.Колонки.Добавить("КодСтатуса", 		Новый ОписаниеТипов("Число")); 
	тз.Колонки.Добавить("ВесБриллиантов", 	Новый ОписаниеТипов("Число"));
	тз.Колонки.Добавить("КоличествоБриллиантов", 	Новый ОписаниеТипов("Число"));
	тз.Колонки.Добавить("СуммаБриллиантов", Новый ОписаниеТипов("Число"));
	тз.Колонки.Добавить("id_Документа",     Новый ОписаниеТипов("Число"));
	тз.Колонки.Добавить("ndoc",     		Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("ddoc",     		Новый ОписаниеТипов("Дата")); 
	тз.Колонки.Добавить("ТипКлассики",     	Новый ОписаниеТипов("Число")); 
	тз.Колонки.Добавить("Ответственный",    Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("ОтказОтВыкупа",    Новый ОписаниеТипов("Булево"));
	тз.Колонки.Добавить("ОценкаМеталла", 	Новый ОписаниеТипов("Число"));
	тз.Колонки.Добавить("ОценкаВставок", 	Новый ОписаниеТипов("Число"));
	тз.Колонки.Добавить("Предъявитель", 	Новый ОписаниеТипов("Число")); 
	тз.Колонки.Добавить("ПСК", 				Новый ОписаниеТипов("Число"));
	
	
	
	
	
	тзСтран = ВернутьТЗСтран();
	
	тзЧерныеСтатусыКлиентов = ВернутьКлиентовСЧернойМеткой(); 
	
	Если тзПервыхДатЗБ.КОличество() = 0 Тогда
		тзПервыхДатЗБ = ВернутьТаблицуПервыхДатЗБ(); 
	КонецЕсли;
	
	
	Пока не Выборка.eof() Цикл
		НовСтр = тз.Добавить();
		НовСтр.Дата         	= Выборка.fields("Dpri").value; 
		НовСтр.ДатаВыкупа       = Выборка.fields("ДатаВыкупа").value;
		НовСтр.ДатаРеализации   = Выборка.fields("ДатаРеализации").value; 
		НовСтр.id_LX           	= СтрЗаменить(Выборка.fields("nrec").value, Символы.НПП, ""); 
		НовСтр.id_Документа    	= Выборка.fields("nrecClientDoc").value;
		НовСтр.ndoc         	= Выборка.fields("ndoc").value; 
		НовСтр.ddoc         	= Выборка.fields("ddoc").value; 
		НовСтр.НомерЗБ         	= Выборка.fields("nomer").value; 
		НовСтр.Ответственный    = Выборка.fields("FIO").value; 
		НовСтр.Вес         		= Выборка.fields("Вес").value; 
		НовСтр.ВесЧистый        = Выборка.fields("ВесЧистый").value;  
		НовСтр.СуммаОценки      = Выборка.fields("СуммаОценки").value; 
		НовСтр.СуммаСсуды       = Выборка.fields("СуммаСсуды").value;
		НовСтр.Цена       		= Выборка.fields("Цена").value;
		НовСтр.ТипИзделия      	= Выборка.fields("##ТипИзделия").value; 
		НовСтр.Металл       	= Выборка.fields("nmmat").value;  
		НовСтр.Проба      		= Выборка.fields("proba").value; 
		НовСтр.Ставка       	= Выборка.fields("ставка").value; 
		НовСтр.Категория       	= Выборка.fields("Kat").value;  
		НовСтр.КодСхемыКредитования = Выборка.fields("Iden").value; 
		НовСтр.ТипКлассики      = Выборка.fields("IdenGP").value; 
		НовСтр.КодСтатуса       = Выборка.fields("KodBlack").value;
		НовСтр.ВесБриллиантов   = Выборка.fields("ВесБриллиантов").value;
		НовСтр.КоличествоБриллиантов = Выборка.fields("КоличествоБриллиантов").value;
		НовСтр.СуммаБриллиантов = Выборка.fields("СуммаБриллиантов").value;    
		НовСтр.ОценкаМеталла 	= Выборка.fields("Оценка металла").value;
		НовСтр.ОценкаВставок 	= Выборка.fields("Оценка вставок").value; 
		НовСтр.Предъявитель 	= Выборка.fields("Предъявитель").value; 
		НовСтр.ПСК 				= Выборка.fields("ПСК").value; 
		
		НовСтр.id_Ломбарда      = СтрЗаменить(Выборка.fields("nobj").value, Символы.НПП, "");
		
		НовСтр.id_Клиента       = СтрЗаменить(Выборка.fields("KodClient").value, Символы.НПП, "");
		АртикулПром      		= Выборка.fields("#Серия").value;  	
		
		ПозСлэша 				= СтрНайти(АртикулПром,"/");
		НаимНоменклатуры 		= Сред(АртикулПром, ПозСлэша+1);  	
		НовСтр.Артикул      	= НаимНоменклатуры;  
		
		ОтказОтВыкупа    = Выборка.fields("Xfnakl").value; 
		Если ОтказОтВыкупа = 1 или ОтказОтВыкупа = Истина Тогда
			НовСтр.ОтказОтВыкупа = Истина;
		Иначе
			НовСтр.ОтказОтВыкупа = Ложь;
		КонецЕсли;		
		
		Выборка.movenext();
	КонецЦикла;
	АдоСоединение.Close();
	
	АдоСоединение = АдоНовоеСоединение("dlink");
	
	Дата1Февраля                = Дата(2023,02,01);
	Дата16102023                = Дата(2023,10,16);
	Перечисление_Залог 			= Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог;
	Организация 				= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ОсновнаяОрганизация");
	ЕдиницаИзмерения_гр 		= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ЕдиницаИзмерения_гр");
	ЕдиницаИзмерения_кар 		= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ЕдиницаИзмерения_кар");
	ВременноеПодразделение 		= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ОсновноеПодразделение");
	СхемаКлассика          		= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СхемаКредитования_Классика");
	СхемаКлассика1День    		= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СхемаКредитования_1День_Классика");
	СхемаКлассикаГибкий         = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СхемаКредитования_Классика_Гибкий");
	СхемаКлассика1ДеньГибкий    = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СхемаКредитования_1День_Классика_Гибкий"); 
	СхемаКлассикаГибкий_5       = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СхемаКредитования_Классика_Гибкий_5");
	
	СхемаЭкспресс          		= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СхемаКредитования_Экспресс");
	СхемаЭкспрессГибкий         = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СхемаКредитования_Экспресс_Гибкий");
	СхемаЭкспрессГибкий_5         = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СхемаКредитования_Экспресс_Гибкий_5");
	
	Приказ_ЭталонДляСтавок      = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("Приказ_ЭталонДляСтавок");  
	
	
	ФормаОгранки_Круглая        = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("Огранка_Круглая");
	ФормаОгранки_Граненый       = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("Огранка_Граненый"); 
	ФормаОгранки_Фантазийная    = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("Огранка_Фантаз"); 
	
	ВидОгранки_57               = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("Огранка_57"); 
	ВидОгранки_17               = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("Огранка_17"); 
	
	КачествоОгранки_А           = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("КачествоОгранки_А"); 
	КачествоОгранки_Б           = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("КачествоОгранки_Б");
	
	
	
	тзПроб = ВернутьТЗПроб();
	
	тзДок = тз.Скопировать();
	тзДок.Свернуть("id_LX, id_Документа, НомерЗБ, Дата, ndoc, ddoc, ДатаВыкупа, ДатаРеализации, id_Ломбарда, id_Клиента, Ставка, КодСтатуса, КодСхемыКредитования, ТипКлассики, Ответственный, ОтказОтВыкупа, Предъявитель, ПСК");   
	ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог;
	Для каждого строкаДок из тзДок Цикл	
		НайдДок = ВернутьОперациюПоЗалогуПо_id(строкаДок.id_LX, ВидОперации);
		Если НайдДок = Неопределено Тогда
			ОПЗ = Документы.ЛБ_ОперацияПоЗалогу.СоздатьДокумент();
		Иначе
			ОПЗ = НайдДок.ПолучитьОбъект();
		КонецЕсли; 	
		
		ОПЗ.id_LX 		= строкаДок.id_LX; 
		ОПЗ.Дата		= строкаДок.Дата;
		ОПЗ.ДатаВыкупа	= строкаДок.ДатаВыкупа;
		ОПЗ.ДатаВыкупаЛьготная = строкаДок.ДатаРеализации;
		ОПЗ.СрокЗалога  = (ОПЗ.ДатаВыкупа - ОПЗ.Дата)/86400; 
		ОПЗ.ВидОперации = Перечисление_Залог;
		ОПЗ.НомерЗалоговогоБилета = строкаДок.НомерЗБ;
		ОПЗ.Организация = Организация; 
		ОПЗ.ПроцентнаяСхема    = строкаДок.Ставка;
		//СтатусЗалогодателя = ВернутьСтатусКлиентаПоКодуLX(строкаДок.КодСтатуса);
		//ОПЗ.СтатусЗалогодателя = СтатусЗалогодателя;   
		
		
		Если строкаДок.Предъявитель = 1 Тогда 
			ОПЗ.Предъявитель = Истина;
		Иначе
			ОПЗ.Предъявитель = Ложь;
		КонецЕсли;			
		
		ОПЗ.ПСК_LX = строкаДок.ПСК;
		ОПЗ.ОтказОтВыкупа = строкаДок.ОтказОтВыкупа; 
		
		Если строкаДок.КодСхемыКредитования = 0 Тогда
			Если ОПЗ.Дата >= Дата1Февраля Тогда 
				Если строкаДок.ТипКлассики = 1 Тогда
					Если ОПЗ.Дата >= Дата16102023 Тогда
						ОПЗ.СхемаКредитования = СхемаКлассикаГибкий_5;	
					Иначе						
						ОПЗ.СхемаКредитования = СхемаКлассика1ДеньГибкий;
					КонецЕсли;
				Иначе
					ОПЗ.СхемаКредитования = СхемаКлассикаГибкий;
				КонецЕсли;
			Иначе
				КолДнейЗалога = (ОПЗ.ДатаВыкупа - ОПЗ.Дата) / 86400;
				Если КолДнейЗалога < 15 Тогда 
					ОПЗ.СхемаКредитования = СхемаКлассика1День;
				Иначе   
					ОПЗ.СхемаКредитования = СхемаКлассика;
				КонецЕсли;
				
				//Если строкаДок.ТипКлассики = 1 Тогда
				//	ОПЗ.СхемаКредитования = СхемаКлассика1День;
				//Иначе				
				//	ОПЗ.СхемаКредитования = СхемаКлассика;
				//КонецЕсли;
			КонецЕсли;
		ИначеЕсли строкаДок.КодСхемыКредитования = 1 Тогда
			Если ОПЗ.Дата >= Дата1Февраля  Тогда
				Если ОПЗ.Дата >= Дата16102023 Тогда
					ОПЗ.СхемаКредитования = СхемаЭкспрессГибкий_5; 
				Иначе
					ОПЗ.СхемаКредитования = СхемаЭкспрессГибкий;
				КонецЕсли;
			Иначе
				ОПЗ.СхемаКредитования = СхемаЭкспресс;
			КонецЕсли;
		ИначеЕсли строкаДок.КодСхемыКредитования = 9 Тогда
			ОПЗ.СхемаКредитования = СхемаКлассика;
		КонецЕсли;	
		
		СсылкаНаЛомбард     = ВернутьЛомбардПоID(строкаДок.id_Ломбарда); 
		
		Если СсылкаНаЛомбард = Неопределено Тогда
			РеквизитыЛомбардаИзLX = ВернутьРеквизитыЛомбардаИзLX(строкаДок.id_Ломбарда);
			Ломб = Справочники.ЛБ_Ломбарды.СоздатьЭлемент();
			Ломб.Наименование 		= РеквизитыЛомбардаИзLX.Наименование;
			Ломб.НомерЛомбарда 		= РеквизитыЛомбардаИзLX.Номер;
			Ломб.НаименованиеПолное = Ломб.Наименование;
			Ломб.id_LX 				= строкаДок.id_Ломбарда; 
			Ломб.Подразделение 		= ВременноеПодразделение;
			Ломб.Записать();
			СсылкаНаЛомбард = Ломб.Ссылка;
		КонецЕсли;			
		
		РеквизитыКлиента = ВернутьРеквизитыКлиентаИзLX(АдоСоединение, тзСтран, "Kodclient = '" + строкаДок.id_Клиента + "'", НеГрузитьАдреса);
		
		Если ЗначениеЗаполнено(РеквизитыКлиента[0].ДатаРождения) и (ЗначениеЗаполнено(РеквизитыКлиента[0].Фамилия) или ЗначениеЗаполнено(РеквизитыКлиента[0].Имя) или ЗначениеЗаполнено(РеквизитыКлиента[0].Отчество)) Тогда 
			Парамс = Новый Структура;
			Парамс.Вставить("Данные", 			РеквизитыКлиента[0]); 
			Парамс.Вставить("тзСтран", 			тзСтран);
			Парамс.Вставить("АдоСоединение", 	АдоСоединение);
			Парамс.Вставить("СтатусКлиента", 	"");
			Парамс.Вставить("НеГрузитьАдреса", 	НеГрузитьАдреса); 
			Парамс.Вставить("тзЧерныеСтатусыКлиентов", 	тзЧерныеСтатусыКлиентов);
			Парамс.Вставить("тзПервыхДатЗБ", 	тзПервыхДатЗБ); 
			Парамс.Вставить("ПерезаписыватьКлиентов", 	ПерезаписыватьКлиентов);
			
			
			
			ОПЗ.Залогодатель 	= НайтиСоздатьЗалогодателя(Парамс);
			ОПЗ.Фамилия 		= ОПЗ.Залогодатель.Фамилия;
			ОПЗ.Имя 			= ОПЗ.Залогодатель.Имя; 
			ОПЗ.Отчество 		= ОПЗ.Залогодатель.Отчество; 
			
			тзКонтИнфо = ВернутьКонтактнуюИнформациюЗалогодателя(строкаДок.Дата+1, ОПЗ.Залогодатель);
			Если тзКонтИнфо.Количество() > 0 Тогда   
				ЗаполнитьЗначенияСвойств(ОПЗ, тзКонтИнфо[0]);
			КонецЕсли;			
		КонецЕсли;
		
		СсылкаДокументаКлиента = НайтиДокументЗалогодателя(строкаДок.id_Документа, СтрокаДок.ndoc, СтрокаДок.ddoc, ОПЗ.Залогодатель);
		
		ОПЗ.ДокументЗалогодателя = СсылкаДокументаКлиента;
		
		Если СсылкаДокументаКлиента <> Неопределено Тогда
			ОПЗ.ДокументВид = СсылкаДокументаКлиента.ВидДокумента;
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
			|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНачалоДействия КАК ДокументНачалоДействия
			|ИЗ
			|	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&НаДату, ДокументЗалогодателя = &Документ) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";
			Запрос.УстановитьПараметр("НаДату", СтрокаДок.Дата+1);
			Запрос.УстановитьПараметр("Документ", СсылкаДокументаКлиента);
			Выб = Запрос.Выполнить().Выбрать();
			Если Выб.Следующий() Тогда   
				ОПЗ.ДокументДатаВыдачи 		= Выб.ДокументДатаВыдачи;
				ОПЗ.ДокументНачалоДействия 	= Выб.ДокументНачалоДействия;
			КонецЕсли;
		КонецЕсли;		
		
		ОПЗ.Ломбард = СсылкаНаЛомбард;
		ОПЗ.СтатусЗалогодателя = ЛБ_УправлениеЛомбардом.ПолучитьТекущийСтатусКлиента(ОПЗ.Дата, ОПЗ.Залогодатель);
		РассчитатьПредельныСрокЗайма(ОПЗ);
		
		ОПЗ.ОтветственныйСотрудник = ВернутьСотрудника(СтрокаДок.Ответственный);
		
			
		ОПЗ.Товары.Очистить();  
		ОПЗ.Вставки.Очистить();
		ОПЗ.ДополнительныеМеталлы.Очистить();
		КлючСтроки = 0;
		
		отбор = Новый Структура("id_LX", строкаДок.id_LX);
		НайдСтроки = тз.НайтиСтроки(отбор);
		Для каждого стр из НайдСтроки Цикл
			НовСтрока = ОПЗ.Товары.Добавить();
			ОбъектЗалога = ВернутьОбъектЗалога(стр.Артикул);
			
			ДанныеОбъектаИзЭликса = ВернутьДанныеОбъектаЗалогаИзLX(стр.Артикул, стр.id_LX); 
			тзВставок             = ВернутьВставкиОбъектаЗалогаИзLX(ДанныеОбъектаИзЭликса.id_LX_Вставки);
			
			Если ОбъектЗалога = Неопределено Тогда
				ОбЗалога = Справочники.ЛБ_ОбъектыЗалога.СоздатьЭлемент();
			Иначе 
				ОбЗалога = ОбъектЗалога.ПолучитьОбъект();
			КонецЕсли;			
			
			ТекМеталл   = Справочники.ЛБ_ДрагоценныеМеталлы.НайтиПоНаименованию(стр.Металл); 
			Проба1С     = ВернутьПробу1С(ТекМеталл, стр.Проба, тзПроб);
			
			ОбЗалога.id_LX 		= стр.Артикул;
			ОбЗалога.Артикул 	= стр.Артикул;
			ВидИзделия = ВернутьВидИзделияИзСоответствия(Стр.ТипИзделия);
			Если ВидИзделия = Неопределено Тогда				
				Сообщить("ЗБ "+СокрЛП(строкаДок.НомерЗБ)+", Дата: "+Формат(ОПЗ.Дата,"ДФ=dd.MM.yy")+", "+СокрЛП(ОПЗ.Ломбард)+". Не нашел соответствие ВИДА изделия: "+СокрЛП(Стр.ТипИзделия));  			
				Возврат;
			Иначе
				ОбЗалога.ВидИзделия 	= ВидИзделия;
			КонецЕсли;
			//ОбЗалога.ВидИзделия 	= Справочники.ЛБ_ВидыИзделий.НайтиПоНаименованию(Стр.ТипИзделия, истина);
			ОбЗалога.Проба 		= Проба1С;
			//КатегорияОбъектаЗалога 		= Справочники.ЛБ_КатегорииОбъектовЗалога.НайтиПоНаименованию(стр.Категория, истина);
			КатегорияИзделия = ВернутьКатегориюИзСоответствия(стр.Категория);
			Если КатегорияИзделия = Неопределено Тогда
				Сообщить("ЗБ "+СокрЛП(строкаДок.НомерЗБ)+", Дата: "+Формат(ОПЗ.Дата,"ДФ=dd.MM.yy")+", "+СокрЛП(ОПЗ.Ломбард)+". Не нашел соответствие КАТЕГОРИИ изделия: "+СокрЛП(стр.Категория));  			
				Возврат;  
			Иначе   
				ОбЗалога.Категория 	= КатегорияИзделия; 
			КонецЕсли;
			ОбЗалога.ЕдиницаИзмерения = ЕдиницаИзмерения_гр;
			ОбЗалога.Количество 	= 1;
			ОбЗалога.Вес 		= стр.Вес; 
			ОбЗалога.ВесЧистый 	= стр.ВесЧистый; 
			ОбЗалога.Клеймо     = ДанныеОбъектаИзЭликса.Клеймо;
			//ОбЗалога.Именник    = ДанныеОбъектаИзЭликса.Именник;
			
			//Если стр.КоличествоБриллиантов > 0 Тогда
			//	ОбЗалога.Вставки.Очистить();
			//	НовВставка = ОбЗалога.Вставки.Добавить();
			//	НовВставка.ВидВставки = Справочники.ЛБ_ДрагоценныеКамни.Бриллиант;
			//	НовВставка.Количество = стр.КоличествоБриллиантов;
			//	Если стр.ВесБриллиантов > 0 Тогда
			//		НовВставка.Вес = стр.ВесБриллиантов;
			//	КонецЕсли; 
			//	НовВставка.ЕдиницаИзмерения = ЕдиницаИзмерения_кар;			
			//КонецЕсли;
			
			ЕстьВставкиВОбъекте = Ложь;
			Если тзВставок.Количество() > 0 Тогда  
				Для каждого строкаВст из тзВставок Цикл
					Если Число(строкаВст.ВидВставки) <= 100 Тогда  
						ЕстьВставкиВОбъекте = Истина;
					КонецЕсли;  
				КонецЦикла;
			КонецЕсли;	
			
			
			ОбЗалога.Залогодатель = ОПЗ.Залогодатель;
			ОбЗалога.Наименование = СокрЛП(ОбЗалога.ВидИзделия.Наименование) + ?(ЕстьВставкиВОбъекте, " с/в", " б/в");
			ОбЗалога.Записать();
			ОбъектЗалога = ОбЗалога.Ссылка;			
			
			НовСтрока.ОбъектЗалога 	= ОбъектЗалога;
			НовСтрока.ВидИзделия   	= ОбъектЗалога.ВидИзделия;
			НовСтрока.Проба   	   	= ОбъектЗалога.Проба;
			НовСтрока.Количество   	= 1;  
			НовСтрока.Вес   		= стр.Вес;  
			НовСтрока.Цена   		= стр.Цена;
			НовСтрока.ВесЧистый   	= стр.ВесЧистый;
			НовСтрока.СуммаОценки   = стр.СуммаОценки;
			НовСтрока.СуммаОценкиМаксимальная   = стр.СуммаОценки;
			НовСтрока.СуммаСсуды   	= стр.СуммаСсуды; 
			НовСтрока.Категория   	= ОбъектЗалога.Категория;   
			НовСтрока.ЕдиницаИзмерения = ОбъектЗалога.ЕдиницаИзмерения;
			КлючСтроки = КлючСтроки + 1;
			НовСтрока.КлючСтроки    = КлючСтроки; 
			НовСтрока.СостояниеИзделия = Перечисления.ЛБ_СостояниеИзделия.БУ;
			//НовСтрока.Описание = СокрЛП(НовСтрока.ОбъектЗалога);
			НовСтрока.Клеймо   = ДанныеОбъектаИзЭликса.Клеймо;
			//НовСтрока.Именник  = Перечисления.ЛБ_Именник.Нет;
			НовСтрока.Именник  = ДанныеОбъектаИзЭликса.Именник;
			НовСтрока.Описание = ДанныеОбъектаИзЭликса.Описание;  
			НовСтрока.СуммаОценкиМеталлы = стр.ОценкаМеталла; 
			//НовСтрока.СуммаОценкиКамни   = стр.ОценкаВставок; 
			
			
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("Дата", ОПЗ.Дата);
			СтруктураПараметров.Вставить("Ломбард", ОПЗ.Ломбард);
			СтруктураПараметров.Вставить("СхемаКредитования", ОПЗ.СхемаКредитования);
			СтруктураПараметров.Вставить("Залогодатель", ОПЗ.Залогодатель);

			СтруктураПараметров.Вставить("Проба", НовСтрока.Проба);
			СтруктураПараметров.Вставить("Категория", НовСтрока.Категория);
			СтруктураПараметров.Вставить("ЕдиницаИзмерения", НовСтрока.ЕдиницаИзмерения);
		
			СтруктураРезЦенаМет = ЛБ_ОбщийМодуль.ПолучитьЦенуМеталлаИзПрейскуранта(СтруктураПараметров);
			НовСтрока.Приказ = СтруктураРезЦенаМет.Приказ;
           		
			
			// вставки грузим из таблицы  Azbpozvst 
			
			// расшифровки огранок смотрим так:
			//SELECT * FROM [dCBDL_dan].[dbo].[sp_VstForm]
			
			СуммаОценкаВставок = 0;
			Если тзВставок.Количество() > 0 Тогда  
				Для каждого строкаВст из тзВставок Цикл
					Если Число(строкаВст.ВидВставки) > 100 Тогда  
						НовСтрока.ЕстьДопМеталлы = Истина;
						
						НовСтрокаВст = ОПЗ.ДополнительныеМеталлы.Добавить();
						ТекМет = "";
						стуктураВст = ВернутьВставкуМеталла(строкаВст.ВидВставки);
						Если стуктураВст.КодМеталла = 1 Тогда
							ТекМет = Справочники.ЛБ_ДрагоценныеМеталлы.НайтиПоНаименованию("Золото");
						ИначеЕсли стуктураВст.КодМеталла = 2 Тогда
							ТекМет = Справочники.ЛБ_ДрагоценныеМеталлы.НайтиПоНаименованию("Серебро"); 
						ИначеЕсли стуктураВст.КодМеталла = 3 Тогда
							ТекМет = Справочники.ЛБ_ДрагоценныеМеталлы.НайтиПоНаименованию("Платина");
						КонецЕсли;  
						НовСтрокаВст.Проба  = ВернутьПробу1С(ТекМет, стуктураВст.Проба, тзПроб);
						НовСтрокаВст.ЕдиницаИзмерения  = ЕдиницаИзмерения_гр; 
						НовСтрокаВст.ВесЧистый  = строкаВст.Вес; 
						НовСтрокаВст.ВесВПробеЧистоты  = строкаВст.Вес; 
						НовСтрокаВст.Цена  = строкаВст.СуммаСсуды;    					
						НовСтрокаВст.СуммаОценкиМеталлы = строкаВст.Оценка;						
						НовСтрокаВст.КлючСтроки = КлючСтроки;
						СуммаОценкаВставок = СуммаОценкаВставок + НовСтрокаВст.СуммаОценкиМеталлы;   
					Иначе
						НовСтрока.ЕстьВставки = Истина;
						
						НовСтрокаВст = ОПЗ.Вставки.Добавить();
						Если СокрЛП(строкаВст.ВидВставки) = "1" Тогда
							НовСтрокаВст.ВидВставки = Справочники.ЛБ_ДрагоценныеКамни.Бриллиант;
						КонецЕсли;
						Если СокрЛП(строкаВст.Огранка) = "1" Тогда
							НовСтрокаВст.ФормаОгранки = ФормаОгранки_Круглая;
							НовСтрокаВст.ВидОгранки   = ВидОгранки_57; 
							НовСтрокаВст.КачествоОгранки = КачествоОгранки_А;
						ИначеЕсли СокрЛП(строкаВст.Огранка) = "2" Тогда
							НовСтрокаВст.ФормаОгранки = ФормаОгранки_Круглая;
							НовСтрокаВст.ВидОгранки   = ВидОгранки_17; 
							НовСтрокаВст.КачествоОгранки = КачествоОгранки_А;
						ИначеЕсли СокрЛП(строкаВст.Огранка) = "3" Тогда // природный граненый
							НовСтрокаВст.ФормаОгранки = ФормаОгранки_Граненый;
						ИначеЕсли СокрЛП(строкаВст.Огранка) = "4" Тогда // Кр-57 группа Б
							НовСтрокаВст.ФормаОгранки = ФормаОгранки_Круглая;
							НовСтрокаВст.ВидОгранки   = ВидОгранки_57; 
							НовСтрокаВст.КачествоОгранки = КачествоОгранки_Б;
						ИначеЕсли СокрЛП(строкаВст.Огранка) = "5" Тогда // Кр-17 группа Б
							НовСтрокаВст.ФормаОгранки = ФормаОгранки_Круглая;
							НовСтрокаВст.ВидОгранки   = ВидОгранки_17; 
							НовСтрокаВст.КачествоОгранки = КачествоОгранки_Б;  
						ИначеЕсли СокрЛП(строкаВст.Огранка) = "6" Тогда // Фантазийная огранкаБ
							НовСтрокаВст.ФормаОгранки = ФормаОгранки_Фантазийная; 
						ИначеЕсли СокрЛП(строкаВст.Огранка) = "7" Тогда // Граненый
							НовСтрокаВст.ФормаОгранки = ФормаОгранки_Граненый;
						КонецЕсли;	
						
						НовСтрокаВст.Количество = строкаВст.Количество;						
						Если строкаВст.Вес > 0 Тогда
							НовСтрокаВст.Вес  = строкаВст.Вес;
							НовСтрокаВст.Цена = строкаВст.СуммаСсуды/строкаВст.Вес;
						КонецЕсли;  
						НовСтрокаВст.ЕдиницаИзмерения = ЕдиницаИзмерения_кар;
						НовСтрокаВст.Сумма 	    = строкаВст.СуммаСсуды; 
						//НовСтрокаВст.Цена      	= строкаВст.СуммаСсуды/строкаВст.Количество;
						НовСтрокаВст.Вид   		= Перечисления.ЛБ_ВидыКомплектующихИзделия.Вставка; 
						НовСтрокаВст.КлючСтроки = КлючСтроки; 
						СуммаОценкаВставок = СуммаОценкаВставок + НовСтрокаВст.Сумма;  
						
						
						СтруктураВставки = новый Структура; 
						СтруктураВставки.Вставить("Дата", ОПЗ.Дата); 
						СтруктураВставки.Вставить("Ломбард", ОПЗ.Ломбард);
						СтруктураВставки.Вставить("ВидВставки", НовСтрокаВст.ВидВставки);
						СтруктураВставки.Вставить("ФормаОгранки", НовСтрокаВст.ФормаОгранки);
						СтруктураВставки.Вставить("ВидОгранки", НовСтрокаВст.ВидОгранки);
						СтруктураВставки.Вставить("КачествоОгранки", НовСтрокаВст.КачествоОгранки);
						СтруктураВставки.Вставить("ЕдиницаИзмерения", НовСтрокаВст.ЕдиницаИзмерения);
						СтруктураВставки.Вставить("Залогодатель", ОПЗ.Залогодатель);
						СтруктураВставки.Вставить("СхемаКредитования", ОПЗ.СхемаКредитования);

						СтруктураВставки.Вставить("Вес", ?(НовСтрокаВст.ЕдиницаИзмерения.Код = "162", НовСтрокаВст.ВесШтКар, НовСтрокаВст.ВесГраммыШт));
						                   					
						СтруктураЦенаДК = ЛБ_ОбщийМодуль.ПолучитьЦенуДрагоценногоКамняИзПрейскуранта(СтруктураВставки);
						НовСтрокаВст.Приказ = СтруктураЦенаДК.Приказ;

						
						
					КонецЕсли;
				КонецЦикла; 
			КонецЕсли;
			НовСтрока.СуммаОценкиКамни   = СуммаОценкаВставок; 
			
			НовСтрока.СуммаОценки   = НовСтрока.СуммаОценкиМеталлы + НовСтрока.СуммаОценкиКамни;
			
			// вставки грузим из таблицы  Azbpozvst
			//Если стр.КоличествоБриллиантов > 0 Тогда  
			//	НовСтрокаВст = ОПЗ.Вставки.Добавить();
			//	НовСтрокаВст.ВидВставки = Справочники.ЛБ_ДрагоценныеКамни.Бриллиант; 
			//	НовСтрокаВст.Количество = стр.КоличествоБриллиантов;
			//	Если стр.ВесБриллиантов > 0 Тогда
			//		НовСтрокаВст.Вес = стр.ВесБриллиантов;
			//	КонецЕсли;     
			//	НовСтрокаВст.ЕдиницаИзмерения = ЕдиницаИзмерения_кар;
			//	НовСтрокаВст.Сумма = стр.СуммаБриллиантов; 
			//	НовСтрокаВст.Цена  = стр.СуммаБриллиантов/стр.КоличествоБриллиантов; 
			//	НовСтрокаВст.Вид   = Перечисления.ЛБ_ВидыКомплектующихИзделия.Вставка; 
			//	НовСтрокаВст.КлючСтроки = КлючСтроки;  
			//КонецЕсли;
			
			// допметаллы грузим из таблицы Sp_matprob
		КонецЦикла;	 
		ОПЗ.СуммаСсуды = ОПЗ.Товары.Итог("СуммаСсуды");    
		
		
		
		ОПЗ.ПроцентныеСтавкиПоПериодам.Очистить();
		
		
		//СтрокаЭталона = Приказ_ЭталонДляСтавок.СтавкиПроцентов[0];  
		
		
		СписокДопСтатусов = Новый СписокЗначений;  	
		ТаблПС = ЛБ_ОбщийМодуль.ЗаполнитьТаблицуПроцентныхСтавок(ОПЗ.Дата, ОПЗ.Ломбард, ОПЗ.СхемаКредитования, ОПЗ.Акция, ОПЗ.СтатусЗалогодателя, СписокДопСтатусов, ОПЗ.СуммаСсуды, ОПЗ.Залогодатель);
		Если ТаблПС.Количество() > 0 Тогда 
			ОПЗ.ПриказСтавки = ТаблПС[0].Приказ; 
			ОПЗ.ПриказАкцияСтавки = ТаблПС[0].ПриказАкция
			
		КонецЕсли;
		
		//ТаблицаС = ЛБ_ОбщийМодуль.ЗаполнитьТаблицуПроцентныхСтавок(ОПЗ.Дата, ОПЗ.Ломбард, ОПЗ.СхемаКредитования, ОПЗ.Акция, ОПЗ.СтатусЗалогодателя, ОПЗ.СуммаСсуды);					
		//Если НЕ ТаблицаС.Количество() = 0 Тогда  						
		//	ОПЗ.ПроцентныеСтавкиПоПериодам.Загрузить(ТаблицаС); 
		//	Если ОПЗ.ПроцентныеСтавкиПоПериодам.Количество() > 0 Тогда
		//		ОПЗ.ПроцентныеСтавкиПоПериодам[0].ПроцентнаяСтавка = ОПЗ.ПроцентнаяСхема;
		//	КонецЕсли;
		//КонецЕсли;
		
		Если ОПЗ.Дата >= Дата(2023, 02, 01) Тогда
			НовС = ОПЗ.ПроцентныеСтавкиПоПериодам.Добавить();
			НовС.ПричинаПрименения = Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма;
			НовС.ДеньНачалаПрименения = 1;
			НовС.ПроцентнаяСтавка = ОПЗ.ПроцентнаяСхема;
			НовС.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Базовая;
			
			КолДнейПоСхеме = ВернутьКоличествоДнейПоСхеме(ОПЗ.СхемаКредитования, ОПЗ.Дата);
			
			НовС = ОПЗ.ПроцентныеСтавкиПоПериодам.Добавить();
			НовС.ПричинаПрименения = Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма;
			НовС.ДеньНачалаПрименения = КолДнейПоСхеме;
			НовС.ПроцентнаяСтавка = 0.001;
			НовС.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Техническая; 
			
			
			
			НовС = ОПЗ.ПроцентныеСтавкиПоПериодам.Добавить();
			НовС.ПричинаПрименения = Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ОплатаПроцентов;
			НовС.ДеньНачалаПрименения = 1;
			НовС.ПроцентнаяСтавка = ОПЗ.ПроцентнаяСхема;
			НовС.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Базовая;
			
			
			НовС = ОПЗ.ПроцентныеСтавкиПоПериодам.Добавить();
			НовС.ПричинаПрименения = Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ОплатаПроцентов;
			НовС.ДеньНачалаПрименения = КолДнейПоСхеме;
			НовС.ПроцентнаяСтавка = 0.001;
			НовС.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Техническая;
			
			//НовС = ОПЗ.ПроцентныеСтавкиПоПериодам.Добавить();
			//НовС.ПричинаПрименения = Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма;
			//НовС.ДеньНачалаПрименения = КолДнейПоСхеме;
			//НовС.ПроцентнаяСтавка = 0.001;
			//НовС.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Техническая;
			//
			//НовС = ОПЗ.ПроцентныеСтавкиПоПериодам.Добавить();
			//НовС.ПричинаПрименения = Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ОплатаПроцентов;
			//НовС.ДеньНачалаПрименения = КолДнейПоСхеме;
			//НовС.ПроцентнаяСтавка = 0.001;
			//НовС.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Техническая; 
			
			
			//СписокДопСтатусов = Новый СписокЗначений; 
			//ПричинаПримененияПроцентнойСхемы = Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма;
			
			//ОПЗ.ПроцентныеСтавкиПоПериодам.Очистить();
			//ТаблицаСтавок.Очистить(); 
			//ТаблицаС = ЛБ_ОбщийМодуль.ЗаполнитьТаблицуПроцентныхСтавок(ОПЗ.Дата, ОПЗ.Ломбард, ОПЗ.СхемаКредитования, ОПЗ.Акция, ОПЗ.СтатусЗалогодателя, СписокДопСтатусов, ОПЗ.СуммаСсуды);					
			//Если НЕ ТаблицаС.Количество() = 0 Тогда  						
			//	ОПЗ.ПроцентныеСтавкиПоПериодам.Загрузить(ТаблицаС);
			//	Для каждого строкаПС из ОПЗ.ПроцентныеСтавкиПоПериодам Цикл 
			//		Если строкаПС.ПроцентнаяСтавка > 0.009 Тогда
			//			 строкаПС.ПроцентнаяСтавка = ОПЗ.ПроцентнаяСхема;
			//		КонецЕсли;					
			//	КонецЦикла;				
			//Отбор = Новый структура;
			//Отбор.Вставить("ПричинаПрименения", ПричинаПримененияПроцентнойСхемы); 
			//СтрокиП = ОПЗ.ПроцентныеСтавкиПоПериодам.НайтиСтроки(Отбор); 
			//Для каждого СтрП из строкиП цикл 
			//	НоваяСтр = ТаблицаСтавок.Добавить(); 
			//	ЗаполнитьЗначенияСвойств(НоваяСтр, СтрП);
			//КонецЦикла;	
			
			//ОтборС = Новый Структура;
			//ОтборС.Вставить("ДеньНачалаПрименения", 1);
			//СтрокиС = ТаблицаСтавок.НайтиСтроки(ОтборС); 
			//Если НЕ СтрокиС.Количество() = 0 Тогда 
			//	СтрС = СтрокиС.Получить(0);	
			//	Если СтрС.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Базовая Тогда 
			//		ОПЗ.ПроцентнаяСхема = СтрС.ПроцентнаяСтавка;
			//	ИначеЕсли СтрС.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Акционная Тогда	
			//		Если НЕ СтрС.ПроцентнаяСтавкаАкция = 0 Тогда 
			//			ОПЗ.ПроцентнаяСхема = СтрС.ПроцентнаяСтавкаАкция;
			//		ИначеЕсли НЕ СтрС.ОтклонениеАкцияАбсолютное = 0 Тогда
			//			ОПЗ.ПроцентнаяСхема = СтрС.ПроцентнаяСтавка + СтрС.ОтклонениеАкцияАбсолютное;
			//		ИначеЕсли НЕ СтрС.ОтклонениеАкцияОтносительное = 0 Тогда
			//			ОПЗ.ПроцентнаяСхема = СтрС.ПроцентнаяСтавка + СтрС.ПроцентнаяСтавка*СтрС.ОтклонениеАкцияОтносительное/100;
			//		КонецЕсли;
			//	КонецЕсли;	
			//КонецЕсли;	
			//КонецЕсли;
			
			
		Иначе
			НовС = ОПЗ.ПроцентныеСтавкиПоПериодам.Добавить();
			НовС.ПричинаПрименения = Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма;
			НовС.ДеньНачалаПрименения = 1;
			НовС.ПроцентнаяСтавка = ОПЗ.ПроцентнаяСхема;
			НовС.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Базовая;
		КонецЕсли;		
		
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Дата", ОПЗ.Дата);
		//Запрос.УстановитьПараметр("СхемаКредитования", ОПЗ.СхемаКредитования);
		//Запрос.Текст = "ВЫБРАТЬ
		//|	ЛБ_УсловияПредоставленияКредитаСрезПоследних.СрокЗалога КАК СрокЗалога,
		//|	ЛБ_УсловияПредоставленияКредитаСрезПоследних.НачислятьПроцентыЗаДеньЗалога КАК НачислятьПроцентыЗаДеньЗалога,
		//|	ЛБ_УсловияПредоставленияКредитаСрезПоследних.НеНачислятьПроцентыЗаПоследнийДень КАК НеНачислятьПроцентыЗаПоследнийДень,
		//|	ЛБ_УсловияПредоставленияКредитаСрезПоследних.ОкруглятьСуммуПроценты КАК ОкруглятьЦены,
		//|	ЛБ_УсловияПредоставленияКредитаСрезПоследних.ПорядокОкругленияПроценты КАК ПорядокОкругления,
		//|	ЛБ_УсловияПредоставленияКредитаСрезПоследних.ОкруглятьВБольшуюСторонуПроценты КАК ОкруглятьВБольшуюСторону,
		//|	ЛБ_УсловияПредоставленияКредитаСрезПоследних.ВидОкругленияСуммыПроцентов КАК ВидОкругленияСуммыПроцентов,
		//|	ЛБ_УсловияПредоставленияКредитаСрезПоследних.СчитатьПроцентыДеньВыдачиРавенДеньВыкупа КАК СчитатьПроцентыДеньВыдачиРавенДеньВыкупа
		//|ИЗ
		//|	РегистрСведений.ЛБ_УсловияПредоставленияКредита.СрезПоследних(&Дата, СхемаКредитования = &СхемаКредитования) КАК ЛБ_УсловияПредоставленияКредитаСрезПоследних";
		
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ЛБ_НастройкиЗаймаВерхнегоУровняСрезПоследних.НачислятьПроцентыЗаДеньЗалога КАК НачислятьПроцентыЗаДеньЗалога,
		|	ЛБ_НастройкиЗаймаВерхнегоУровняСрезПоследних.НеНачислятьПроцентыЗаПоследнийДень КАК НеНачислятьПроцентыЗаПоследнийДень,
		|	ЛБ_НастройкиЗаймаВерхнегоУровняСрезПоследних.ОкруглятьСуммуПроценты КАК ОкруглятьЦены,
		|	ЛБ_НастройкиЗаймаВерхнегоУровняСрезПоследних.ПорядокОкругленияПроценты КАК ПорядокОкругления,
		|	ЛБ_НастройкиЗаймаВерхнегоУровняСрезПоследних.ОкруглятьВБольшуюСторонуПроценты КАК ОкруглятьВБольшуюСторону,
		|	ЛБ_НастройкиЗаймаВерхнегоУровняСрезПоследних.ВидОкругленияСуммыПроцентов КАК ВидОкругленияСуммыПроцентов,
		|	ЛБ_НастройкиЗаймаВерхнегоУровняСрезПоследних.ОкруглятьСуммуОценка КАК ОкруглятьСуммуОценка,
		//|	ЛБ_НастройкиЗаймаВерхнегоУровняСрезПоследних.ПорядокОкругленияОценка КАК ПорядокОкругления,
		|	ЛБ_НастройкиЗаймаВерхнегоУровняСрезПоследних.ОкруглятьВБольшуюСторонуОценка КАК ОкруглятьВБольшуюСторонуОценка,
		|	ЛБ_НастройкиЗаймаВерхнегоУровняСрезПоследних.СчитатьПроцентыДеньВыдачиРавенДеньВыкупа КАК СчитатьПроцентыДеньВыдачиРавенДеньВыкупа
		|ИЗ
		|	РегистрСведений.ЛБ_НастройкиЗаймаВерхнегоУровня.СрезПоследних(&Дата, ) КАК ЛБ_НастройкиЗаймаВерхнегоУровняСрезПоследних";
		
		НашелПараметры = Ложь;
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			НашелПараметры = Истина;
			НачислятьПроцентыЗаДеньЗалога = Выборка.НачислятьПроцентыЗаДеньЗалога;
			НеНачислятьПроцентыЗаПоследнийДень = Выборка.НеНачислятьПроцентыЗаПоследнийДень;
			СчитатьПроцентыДеньВыдачиРавенДеньВыкупа = Выборка.СчитатьПроцентыДеньВыдачиРавенДеньВыкупа;
			ОкруглятьЦены = Выборка.ОкруглятьЦены;
			ПорядокОкругления = Выборка.ПорядокОкругления;
			ОкруглятьВБольшуюСторону = Выборка.ОкруглятьВБольшуюСторону;
			ВидОкругленияСуммыПроцентов = Выборка.ВидОкругленияСуммыПроцентов;
		КонецЕсли;			
		
		Если НашелПараметры Тогда		
			Парамс = Новый Структура; 
			Парамс.Вставить("Док", ОПЗ);
			Парамс.Вставить("ОкруглятьЦены", ОкруглятьЦены);
			Парамс.Вставить("ВидОкругленияСуммыПроцентов", ВидОкругленияСуммыПроцентов);
			Парамс.Вставить("ПорядокОкругления", ПорядокОкругления);
			Парамс.Вставить("ОкруглятьВБольшуюСторону", ОкруглятьВБольшуюСторону);
			Парамс.Вставить("СхемаКредитования", ОПЗ.СхемаКредитования);
			Парамс.Вставить("ДатаДок", ОПЗ.Дата);
			Парамс.Вставить("ТаблицаСтавок", ВернутьТаблицуСтавок(ОПЗ));
			Парамс.Вставить("СуммаЗайма", ОПЗ.СуммаСсуды); 
			Парамс.Вставить("Организация", ОПЗ.Организация);
			
			
			РассчитатьСуммуПроцентов(Парамс); 
		КонецЕсли;
		
		
		
		
		Если Не ТолькоКлиенты Тогда
			ОПЗ.Записать(РежимЗаписиДокумента.Запись);
			ОПЗ.Записать(РежимЗаписиДокумента.Проведение);
			
			Если СделатьАпдейт Тогда 
				а = СделатьАпдейт(ИдентификаторЗаписи);			
			КонецЕсли;
		КонецЕсли;
		
		тзДовер = ВернутьДоверенностиИзLX(строкаДок.id_LX);
		Для каждого стрДовер из тзДовер Цикл 
			//Если стрДовер.Статус <> 1 Тогда
			//	Продолжить;
			//КонецЕсли;
			
			НайдДовер = ВернутьДоверенностьПо_id(СокрЛП(стрДовер.id_LX));
			Если НайдДовер = Неопределено Тогда
				ДокДоверенность = Документы.ЛБ_Доверенности.СоздатьДокумент();
			Иначе
				ДокДоверенность = НайдДовер.ПолучитьОбъект();
			КонецЕсли; 
			
			Если стрДовер.Тип = 4 Тогда
				ДокДоверенность.ВидДоверенности = Перечисления.ЛБ_ВидыДоверенностей.Письменная;
			Иначе  
				ДокДоверенность.ВидДоверенности = Перечисления.ЛБ_ВидыДоверенностей.Нотариальная; 
			КонецЕсли;		
			
			ДокДоверенность.ЗалоговыйБилет = ОПЗ.Ссылка;
			ДокДоверенность.Клиент         = ОПЗ.Залогодатель;
			ДокДоверенность.ДокументКлиента= ОПЗ.ДокументЗалогодателя;
			ДокДоверенность.id_LX          = стрДовер.id_LX;
			ДокДоверенность.Ломбард        = ВернутьЛомбардПоID(стрДовер.id_ломбарда); 
			ДокДоверенность.НомерДоверенности = стрДовер.Номер;
			ДокДоверенность.Дата 		   = стрДовер.Дата;   
			ДокДоверенность.ДатаДоверенности 		 = стрДовер.ДатаНачала;
			ДокДоверенность.СрокДействияДоверенности = стрДовер.ДатаОкончания; 
			//Если стрДовер.Статус = 1 Тогда
			ДокДоверенность.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Оформление;
			//КонецЕсли; 
			
			РеквизитыПредставителя = ВернутьРеквизитыКлиентаИзLX(АдоСоединение, тзСтран, "KodClient = '" + стрДовер.id_представителя + "'", НеГрузитьАдреса);
			Если РеквизитыПредставителя = Неопределено Тогда
				Сообщить("Не могу загрузить реквизиты KodClient: " + СокрЛП(стрДовер.id_представителя));
			Иначе
				
				Если ЗначениеЗаполнено(РеквизитыПредставителя[0].ДатаРождения) и (ЗначениеЗаполнено(РеквизитыПредставителя[0].Фамилия) или ЗначениеЗаполнено(РеквизитыПредставителя[0].Имя) или ЗначениеЗаполнено(РеквизитыПредставителя[0].Отчество)) Тогда
					
					Парамс = Новый Структура;
					Парамс.Вставить("Данные", 			РеквизитыПредставителя[0]); 
					Парамс.Вставить("тзСтран", 			тзСтран);
					Парамс.Вставить("АдоСоединение", 	АдоСоединение);
					Парамс.Вставить("СтатусКлиента", 	"");
					Парамс.Вставить("НеГрузитьАдреса", 	НеГрузитьАдреса); 
					Парамс.Вставить("тзЧерныеСтатусыКлиентов", 	тзЧерныеСтатусыКлиентов);
					Парамс.Вставить("тзПервыхДатЗБ", 	тзПервыхДатЗБ);
					
					ДокДоверенность.ПредставительКлиента 	= НайтиСоздатьЗалогодателя(Парамс);
				КонецЕсли;
				
				ДокДоверенность.ДокументПредставителяКлиента = НайтиДокументЗалогодателя(стрДовер.id_ДокПредставителя, "", "", ДокДоверенность.ПредставительКлиента);
			КонецЕсли;
			
			ДокДоверенность.Записать(РежимЗаписиДокумента.Запись);
			ДокДоверенность.Записать(РежимЗаписиДокумента.Проведение); 
		КонецЦикла;
	КонецЦикла; 
	
КонецПроцедуры


Функция СделатьАпдейт(Идентификатор)
	
	текДата = ТекущаяДата();
	
	ТекстSQL  = "UPDATE ReportTransfer1c SET DateTransfer = '" + текДата + "' WHERE NRecDoc = '" + Идентификатор + "'";	
	
	АдоСоединение = АдоНовоеСоединение("dCBDL");	
	
	rs = АдоВыполнитьЗапрос(АдоСоединение, ТекстSQL);
	
	
	Возврат Истина;
КонецФункции



Функция ВернутьВставкуМеталла(КодВставки)
	
	
	АдоСоединение = АдоНовоеСоединение("dCBDL"); 
	
	ТекстЗапроса = "select * from sp_MatProb where kodvst = "+СокрЛП(КодВставки); 
	
	Выборка = АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса) ; 
	
	Структ = Новый Структура;
	
	Пока не Выборка.eof() Цикл    
		Структ.Вставить("Проба",      Выборка.fields("Proba").value);
		Структ.Вставить("КодМеталла", Выборка.fields("KodMat").value);
		Выборка.movenext();
	КонецЦикла; 
	
	АдоСоединение.Close(); 	
	
	Возврат Структ;
	
КонецФункции

Функция ВернутьДоверенностьПо_id(id_LX)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_Доверенности.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЛБ_Доверенности КАК ЛБ_Доверенности
	|ГДЕ
	|	ЛБ_Доверенности.id_LX = &id_LX";
	Запрос.УстановитьПараметр("id_LX", id_LX);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;	
КонецФункции



Функция ВернутьСтатусКлиентаПоКодуLX(КодLX)
	//-2	Сверхновый
	//-1	Нов/Пост
	//0		Новый
	//1		Чёрный
	//2		Недобросовестный
	//3		Не выкупающий
	//4		Добросовестный
	//5		Постоянный
	//6		Исключен
	//7		Неопределенный
	//8		Специальный
	//9		ВИП
	//10	Сотрудник
	//11	Льготный
	//12	Тёмный
	//13	Замороженный
	//14	Отказ в обслуживании
	//15	Размороженный
	//16	Перечень ФРОМУ
	//17	Запретный
	//18	Мобилизованный
	//19	Перечень СБ ООН
	//22	Нелояльный
	//200	умер
	Если КодLX = 0 Тогда
		Возврат ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СтатусКлиента_Новый"); 
	ИначеЕсли КодLX = 3 Тогда
		Возврат ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СтатусКлиента_НеВыкупающий");
	ИначеЕсли КодLX = 4 Тогда
		Возврат ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СтатусКлиента_Добросовестный");	
	ИначеЕсли КодLX = 5 Тогда	
		Возврат ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СтатусКлиента_Постоянный");
	ИначеЕсли КодLX = 7 Тогда
		Возврат ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СтатусКлиента_Неопределенный");
	ИначеЕсли КодLX = 9 Тогда
		Возврат ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СтатусКлиента_VIP");
	ИначеЕсли КодLX = 10 Тогда
		Возврат ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СтатусКлиента_Сотрудник");
	КонецЕсли;
	
	Возврат ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СтатусКлиента_Сверхновый");
	
КонецФункции

Функция ВернутьВидИзделияИзСоответствия(ВидИзделияLX)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_СоответствиеВидовИзделий.ЛБ_ВидИзделия КАК ЛБ_ВидИзделия
	|ИЗ
	|	РегистрСведений.ЛБ_СоответствиеВидовИзделий КАК ЛБ_СоответствиеВидовИзделий
	|ГДЕ
	|	ЛБ_СоответствиеВидовИзделий.ВидИзделияLX = &ВидИзделияLX";
	Запрос.УстановитьПараметр("ВидИзделияLX", ВидИзделияLX);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЛБ_ВидИзделия;
	КонецЕсли;
	
	Возврат Неопределено;	
КонецФункции

Функция ВернутьКатегориюИзСоответствия(КатегорияLX) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_СоответствиеКатегорий.ЛБ_Категория КАК ЛБ_Категория
	|ИЗ
	|	РегистрСведений.ЛБ_СоответствиеКатегорий КАК ЛБ_СоответствиеКатегорий
	|ГДЕ
	|	ЛБ_СоответствиеКатегорий.КатегорияLX = &КатегорияLX";
	Запрос.УстановитьПараметр("КатегорияLX", КатегорияLX);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЛБ_Категория;
	КонецЕсли;
	
	Возврат Неопределено;	
КонецФункции

Функция ВернутьТЗСтран() Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтраныМира.Ссылка КАК Ссылка,
	|	СтраныМира.Код КАК Код
	|ИЗ
	|	Справочник.СтраныМира КАК СтраныМира"; 
	тз = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;	
КонецФункции 

функция НайтиСтрануМиравТЗ(тзСтран, Код,Наименование)
	поискКод = СокрЛП(КОд);
	Если СтрДлина(поискКод) = 2 Тогда
		поискКод = "0"+поискКод;
	КонецЕсли;
	Если СтрДлина(поискКод) = 1 Тогда
		поискКод = "00"+поискКод;
	КонецЕсли;
	
	НайденнаяСтрока = тзСтран.Найти(поискКод, "Код");
	Если НайденнаяСтрока = Неопределено Тогда
		Возврат Справочники.СтраныМира.ПустаяСсылка();
	Иначе
		Возврат НайденнаяСтрока.Ссылка;
	КонецЕсли; 	
КонецФункции 

Функция ВернутьКОнтактнуюИнформациюЗалогодателя(Дата, Залогодатель)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРождения КАК МестоРождения,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРожденияСтрана КАК МестоРожденияСтрана,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРожденияОбласть КАК МестоРожденияОбласть,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРожденияРайон КАК МестоРожденияРайон,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРожденияНаселенныйПункт КАК МестоРожденияНаселенныйПункт,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Пол КАК Пол,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК Телефон,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ТелефонСтруктура КАК ТелефонСтруктура,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Email КАК Email,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПрописке КАК АдресПоПрописке,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПропискеСтруктура КАК АдресПоПропискеСтруктура,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ФактическийАдрес КАК ФактическийАдрес,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ФактическийАдресСтруктура КАК ФактическийАдресСтруктура,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ПочтовыйАдресСтруктура КАК ПочтовыйАдресСтруктура,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ТелефонДополнительный КАК ТелефонДополнительный,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ТелефонДополнительныйСтруктура КАК ТелефонДополнительныйСтруктура,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.КонтактноеЛицо КАК КонтактноеЛицо,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ТелефонКонтактногоЛица КАК ТелефонКонтактногоЛица,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ТелефонКонтактногоЛицаСтруктура КАК ТелефонКонтактногоЛицаСтруктура,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ИсточникИнформации КАК ИсточникИнформации,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ИсточникИнформацииДругое КАК ИсточникИнформацииДругое,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПропискеВручную КАК АдресПоПропискеВручную,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ФактическийАдресВручную КАК ФактическийАдресВручную,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ПочтовыйАдресВручную КАК ПочтовыйАдресВручную,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Комментарий КАК Комментарий,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаСмерти КАК ДатаСмерти,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия_А КАК Фамилия_А,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя_А КАК Имя_А,
	|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество_А КАК Отчество_А
	|ИЗ
	|	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	тз = Запрос.Выполнить().Выгрузить(); 
	
	Возврат тз;
	
КонецФункции




Функция НайтиСоздатьЗалогодателя(Парамс) Экспорт
	
	Данные = Парамс.Данные;
	тзСтран = Парамс.тзСтран;
	АдоСоединение = Парамс.АдоСоединение;
	СтатусКлиента = Парамс.СтатусКлиента;
	НеГрузитьАдреса = Парамс.НеГрузитьАдреса;
	тзЧерныеСтатусыКлиентов = Парамс.тзЧерныеСтатусыКлиентов;
	тзПервыхДатЗБ = Парамс.тзПервыхДатЗБ;
	
	СозданныйЗалогодатель = Неопределено;
	Если Парамс.Свойство("Залогодатель") Тогда
		СозданныйЗалогодатель = Парамс.Залогодатель;
	КонецЕсли;  
	
	
	ПерезаписыватьКлиентов = Ложь;
	Если Парамс.Свойство("ПерезаписыватьКлиентов") Тогда
		ПерезаписыватьКлиентов = Парамс.ПерезаписыватьКлиентов;
	КонецЕсли;  
	
	Если СозданныйЗалогодатель <> Неопределено Тогда 
		Если ПерезаписыватьКлиентов Тогда
			СоздатьКарточкуЗалогодателя(СозданныйЗалогодатель, Данные, АдоСоединение, тзСтран, СтатусКлиента, НеГрузитьАдреса, тзЧерныеСтатусыКлиентов, тзПервыхДатЗБ);					
			СоздатьСоответствиеЗалогодателя(СозданныйЗалогодатель, Данные.id_LX, Данные.ДатаИзменения);
        КонецЕсли;
		
	Иначе	
		
		Запрос = Новый Запрос;
		Запрос.Текст ="ВЫБРАТЬ
		|	ЛБ_СоответствиеЗалогодателейLX.Залогодатель КАК Залогодатель,
		|	ЛБ_СоответствиеЗалогодателейLX.id_LX КАК id_LX,
		|	ЛБ_СоответствиеЗалогодателейLX.ДатаИзменения КАК ДатаИзменения
		|ИЗ
		|	РегистрСведений.ЛБ_СоответствиеЗалогодателейLX КАК ЛБ_СоответствиеЗалогодателейLX
		|ГДЕ
		|	ЛБ_СоответствиеЗалогодателейLX.id_LX = &id_LX";
		Запрос.УстановитьПараметр("id_LX", Данные.id_LX);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если ПерезаписыватьКлиентов Тогда 
				Если Выборка.ДатаИзменения <> Данные.ДатаИзменения Тогда
					СоздатьКарточкуЗалогодателя(Выборка.Залогодатель, Данные, АдоСоединение, тзСтран, СтатусКлиента, НеГрузитьАдреса, тзЧерныеСтатусыКлиентов, тзПервыхДатЗБ);
					
					СоздатьСоответствиеЗалогодателя(Выборка.Залогодатель, Данные.id_LX, Данные.ДатаИзменения);
				КонецЕсли;
			КонецЕсли;
			Возврат Выборка.Залогодатель;	
		КонецЕсли;
		
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛБ_Залогодатели.Ссылка КАК Ссылка,
	|	ЛБ_Залогодатели.Фамилия КАК Фамилия,
	|	ЛБ_Залогодатели.Имя КАК Имя,
	|	ЛБ_Залогодатели.Отчество КАК Отчество,
	|	ЛБ_Залогодатели.ДатаРождения КАК ДатаРождения
	|ИЗ
	|	Справочник.ЛБ_Залогодатели КАК ЛБ_Залогодатели
	|ГДЕ
	|	ЛБ_Залогодатели.Фамилия = &Фамилия
	|	И ЛБ_Залогодатели.Имя = &Имя
	|	И ЛБ_Залогодатели.Отчество = &Отчество
	|	И ЛБ_Залогодатели.ДатаРождения = &ДатаРождения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Фамилия",	СокрЛП(Данные.Фамилия));	
	Запрос.УстановитьПараметр("Имя",		СокрЛП(Данные.Имя));	
	Запрос.УстановитьПараметр("Отчество",   СокрЛП(Данные.Отчество));
	Запрос.УстановитьПараметр("ДатаРождения",Данные.ДатаРождения);
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Если ВыборкаДетальныеЗаписи.Количество() < 1 Тогда	
		Об = Справочники.ЛБ_Залогодатели.СоздатьЭлемент();
		Об.Фамилия 		= СокрЛП(Данные.Фамилия);
		Об.Имя 			= СокрЛП(Данные.Имя);
		Об.Отчество 	= СокрЛП(Данные.Отчество);
		Об.ДатаРождения = СокрЛП(Данные.ДатаРождения);
		Если Не ЗначениеЗаполнено(Данные.Фамилия) Тогда
			Об.Наименование = СокрЛП(Данные.Имя) + " " + СокрЛП(Данные.Отчество);
		Иначе		
			Об.Наименование = СокрЛП(Данные.Фамилия) + " " + СокрЛП(Данные.Имя) + " " + СокрЛП(Данные.Отчество);
		КонецЕсли;
		Об.Записать();
		
		СоздатьСоответствиеЗалогодателя(Об.Ссылка, Данные.id_LX, Данные.ДатаИзменения);
		
		СоздатьКарточкуЗалогодателя(Об.Ссылка, Данные, АдоСоединение, тзСтран, СтатусКлиента, НеГрузитьАдреса, тзЧерныеСтатусыКлиентов, тзПервыхДатЗБ);
		
		Возврат Об.Ссылка;		
	Иначе
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			//Карточка = ВернутьКарточкуЗалогодателя(ВыборкаДетальныеЗаписи.Ссылка);
			СоздатьСоответствиеЗалогодателя(ВыборкаДетальныеЗаписи.Ссылка, Данные.id_LX, Данные.ДатаИзменения);
			
			СоздатьКарточкуЗалогодателя(ВыборкаДетальныеЗаписи.Ссылка, Данные, АдоСоединение, тзСтран, СтатусКлиента, НеГрузитьАДреса, тзЧерныеСтатусыКлиентов, тзПервыхДатЗБ);
			//Если Карточка = Неопределено Тогда
			//	СоздатьКарточкуЗалогодателя(ВыборкаДетальныеЗаписи.Ссылка, Данные, АдоСоединение, тзСтран, СтатусКлиента);			
			//КонецЕсли;
			
			Возврат ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
	КонецЕсли;
	КонецЕсли;
	
	Возврат Справочники.ЛБ_Залогодатели.ПустаяСсылка();	
КонецФункции

Функция НайтиСоздатьЗалогодателяПокупателя(Парамс) Экспорт
	
	Данные = Парамс.Данные;
	тзСтран = Парамс.тзСтран;
	АдоСоединение = Парамс.АдоСоединение;
	СтатусКлиента = Парамс.СтатусКлиента;
	НеГрузитьАдреса = Парамс.НеГрузитьАдреса;
	тзЧерныеСтатусыКлиентов = Парамс.тзЧерныеСтатусыКлиентов;
	тзПервыхДатЗБ = Парамс.тзПервыхДатЗБ;
	
	
	ПерезаписыватьКлиентов = Ложь;
	Если Парамс.Свойство("ПерезаписыватьКлиентов") Тогда
		ПерезаписыватьКлиентов = Парамс.ПерезаписыватьКлиентов;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	ЛБ_СоответствиеЗалогодателейLX.Залогодатель КАК Залогодатель,
	              |	ЛБ_СоответствиеЗалогодателейLX.id_LX КАК id_LX,
	              |	ЛБ_СоответствиеЗалогодателейLX.ДатаИзменения КАК ДатаИзменения
	              |ИЗ
	              |	РегистрСведений.ЛБ_СоответствиеЗалогодателейLX КАК ЛБ_СоответствиеЗалогодателейLX
	              |ГДЕ
	              |	ЛБ_СоответствиеЗалогодателейLX.id_LX = &id_LX";
	Запрос.УстановитьПараметр("id_LX", Данные.id_LX);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ПерезаписыватьКлиентов Тогда 
			Если Выборка.ДатаИзменения <> Данные.ДатаИзменения Тогда
				СоздатьКарточкуЗалогодателяПокупателя(Выборка.Залогодатель, Данные, АдоСоединение, тзСтран, СтатусКлиента, НеГрузитьАдреса, тзЧерныеСтатусыКлиентов, тзПервыхДатЗБ);
				
				СоздатьСоответствиеЗалогодателя(Выборка.Залогодатель, Данные.id_LX, Данные.ДатаИзменения);
			КонецЕсли;
		КонецЕсли;
		Возврат Выборка.Залогодатель;	
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛБ_Залогодатели.Ссылка КАК Ссылка,
	|	ЛБ_Залогодатели.Фамилия КАК Фамилия,
	|	ЛБ_Залогодатели.Имя КАК Имя,
	|	ЛБ_Залогодатели.Отчество КАК Отчество,
	|	ЛБ_Залогодатели.ДатаРождения КАК ДатаРождения
	|ИЗ
	|	Справочник.ЛБ_Залогодатели КАК ЛБ_Залогодатели
	|ГДЕ
	|	ЛБ_Залогодатели.Фамилия = &Фамилия
	|	И ЛБ_Залогодатели.Имя = &Имя
	|	И ЛБ_Залогодатели.Отчество = &Отчество
	|	И ЛБ_Залогодатели.ДатаРождения = &ДатаРождения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Фамилия",	СокрЛП(Данные.Фамилия));	
	Запрос.УстановитьПараметр("Имя",		СокрЛП(Данные.Имя));	
	Запрос.УстановитьПараметр("Отчество",   СокрЛП(Данные.Отчество));
	Запрос.УстановитьПараметр("ДатаРождения",Данные.ДатаРождения);
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Если ВыборкаДетальныеЗаписи.Количество() < 1 Тогда	
		Об = Справочники.ЛБ_Залогодатели.СоздатьЭлемент();
		Об.Фамилия 		= СокрЛП(Данные.Фамилия);
		Об.Имя 			= СокрЛП(Данные.Имя);
		Об.Отчество 	= СокрЛП(Данные.Отчество);
		Об.ДатаРождения = СокрЛП(Данные.ДатаРождения);
		Если Не ЗначениеЗаполнено(Данные.Фамилия) Тогда
			Об.Наименование = СокрЛП(Данные.Имя) + " " + СокрЛП(Данные.Отчество);
		Иначе		
			Об.Наименование = СокрЛП(Данные.Фамилия) + " " + СокрЛП(Данные.Имя) + " " + СокрЛП(Данные.Отчество);
		КонецЕсли;
		Об.Записать();
		
		СоздатьСоответствиеЗалогодателя(Об.Ссылка, Данные.id_LX, Данные.ДатаИзменения);
		
		СоздатьКарточкуЗалогодателяПокупателя(Об.Ссылка, Данные, АдоСоединение, тзСтран, СтатусКлиента, НеГрузитьАдреса, тзЧерныеСтатусыКлиентов, тзПервыхДатЗБ);
		
		Возврат Об.Ссылка;		
	Иначе
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			//Карточка = ВернутьКарточкуЗалогодателя(ВыборкаДетальныеЗаписи.Ссылка);
			СоздатьСоответствиеЗалогодателя(ВыборкаДетальныеЗаписи.Ссылка, Данные.id_LX, Данные.ДатаИзменения);
			
			СоздатьКарточкуЗалогодателяПокупателя(ВыборкаДетальныеЗаписи.Ссылка, Данные, АдоСоединение, тзСтран, СтатусКлиента, НеГрузитьАДреса, тзЧерныеСтатусыКлиентов, тзПервыхДатЗБ);
			//Если Карточка = Неопределено Тогда
			//	СоздатьКарточкуЗалогодателя(ВыборкаДетальныеЗаписи.Ссылка, Данные, АдоСоединение, тзСтран, СтатусКлиента);			
			//КонецЕсли;
			
			Возврат ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
	КонецЕсли;
	Возврат Справочники.ЛБ_Залогодатели.ПустаяСсылка();	
КонецФункции




Функция НайтиСоздатьЗалогодателяНов(Парамс, тзВсехДокументов, тзВсехАнкет) Экспорт
	
	Данные = Парамс.Данные;
	тзСтран = Парамс.тзСтран;
	АдоСоединение = Парамс.АдоСоединение;
	СтатусКлиента = Парамс.СтатусКлиента;
	НеГрузитьАдреса = Парамс.НеГрузитьАдреса;
	тзЧерныеСтатусыКлиентов = Парамс.тзЧерныеСтатусыКлиентов;
	тзПервыхДатЗБ = Парамс.тзПервыхДатЗБ;
	
	
	ПерезаписыватьКлиентов = Ложь;
	Если Парамс.Свойство("ПерезаписыватьКлиентов") Тогда
		ПерезаписыватьКлиентов = Парамс.ПерезаписыватьКлиентов;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	ЛБ_СоответствиеЗалогодателейLX.Залогодатель КАК Залогодатель,
	              |	ЛБ_СоответствиеЗалогодателейLX.id_LX КАК id_LX,
	              |	ЛБ_СоответствиеЗалогодателейLX.ДатаИзменения КАК ДатаИзменения
	              |ИЗ
	              |	РегистрСведений.ЛБ_СоответствиеЗалогодателейLX КАК ЛБ_СоответствиеЗалогодателейLX
	              |ГДЕ
	              |	ЛБ_СоответствиеЗалогодателейLX.id_LX = &id_LX";
	Запрос.УстановитьПараметр("id_LX", Данные.id_LX);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ПерезаписыватьКлиентов Тогда 
			Если Выборка.ДатаИзменения <> Данные.ДатаИзменения Тогда
				СоздатьКарточкуЗалогодателяНов(Выборка.Залогодатель, Данные, АдоСоединение, тзСтран, СтатусКлиента, НеГрузитьАдреса, тзЧерныеСтатусыКлиентов, тзПервыхДатЗБ, тзВсехДокументов, тзВсехАнкет);
				
				СоздатьСоответствиеЗалогодателя(Выборка.Залогодатель, Данные.id_LX, Данные.ДатаИзменения);
			КонецЕсли;
		КонецЕсли;
		Возврат Выборка.Залогодатель;	
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛБ_Залогодатели.Ссылка КАК Ссылка,
	|	ЛБ_Залогодатели.Фамилия КАК Фамилия,
	|	ЛБ_Залогодатели.Имя КАК Имя,
	|	ЛБ_Залогодатели.Отчество КАК Отчество,
	|	ЛБ_Залогодатели.ДатаРождения КАК ДатаРождения
	|ИЗ
	|	Справочник.ЛБ_Залогодатели КАК ЛБ_Залогодатели
	|ГДЕ
	|	ЛБ_Залогодатели.Фамилия = &Фамилия
	|	И ЛБ_Залогодатели.Имя = &Имя
	|	И ЛБ_Залогодатели.Отчество = &Отчество
	|	И ЛБ_Залогодатели.ДатаРождения = &ДатаРождения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Фамилия",	СокрЛП(Данные.Фамилия));	
	Запрос.УстановитьПараметр("Имя",		СокрЛП(Данные.Имя));	
	Запрос.УстановитьПараметр("Отчество",   СокрЛП(Данные.Отчество));
	Запрос.УстановитьПараметр("ДатаРождения",Данные.ДатаРождения);
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Если ВыборкаДетальныеЗаписи.Количество() < 1 Тогда	
		Об = Справочники.ЛБ_Залогодатели.СоздатьЭлемент();
		Об.Фамилия 		= СокрЛП(Данные.Фамилия);
		Об.Имя 			= СокрЛП(Данные.Имя);
		Об.Отчество 	= СокрЛП(Данные.Отчество);
		Об.ДатаРождения = СокрЛП(Данные.ДатаРождения);
		Если Не ЗначениеЗаполнено(Данные.Фамилия) Тогда
			Об.Наименование = СокрЛП(Данные.Имя) + " " + СокрЛП(Данные.Отчество);
		Иначе		
			Об.Наименование = СокрЛП(Данные.Фамилия) + " " + СокрЛП(Данные.Имя) + " " + СокрЛП(Данные.Отчество);
		КонецЕсли;
		Об.Записать();
		
		СоздатьСоответствиеЗалогодателя(Об.Ссылка, Данные.id_LX, Данные.ДатаИзменения);
		
		СоздатьКарточкуЗалогодателяНов(Об.Ссылка, Данные, АдоСоединение, тзСтран, СтатусКлиента, НеГрузитьАдреса, тзЧерныеСтатусыКлиентов, тзПервыхДатЗБ, тзВсехДокументов, тзВсехАнкет);
		
		Возврат Об.Ссылка;		
	Иначе
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			//Карточка = ВернутьКарточкуЗалогодателя(ВыборкаДетальныеЗаписи.Ссылка);
			СоздатьСоответствиеЗалогодателя(ВыборкаДетальныеЗаписи.Ссылка, Данные.id_LX, Данные.ДатаИзменения);
			
			СоздатьКарточкуЗалогодателяНов(ВыборкаДетальныеЗаписи.Ссылка, Данные, АдоСоединение, тзСтран, СтатусКлиента, НеГрузитьАДреса, тзЧерныеСтатусыКлиентов, тзПервыхДатЗБ,тзВсехДокументов, тзВсехАнкет);
			//Если Карточка = Неопределено Тогда
			//	СоздатьКарточкуЗалогодателя(ВыборкаДетальныеЗаписи.Ссылка, Данные, АдоСоединение, тзСтран, СтатусКлиента);			
			//КонецЕсли;
			
			Возврат ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
	КонецЕсли;
	Возврат Справочники.ЛБ_Залогодатели.ПустаяСсылка();	
КонецФункции


Функция ВернутьКарточкуПоIDДокумента(id_LX)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_КарточкаЗалогодателя.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЛБ_КарточкаЗалогодателя КАК ЛБ_КарточкаЗалогодателя
	|ГДЕ
	|	ЛБ_КарточкаЗалогодателя.id_LX = &id_LX";
	Запрос.УстановитьПараметр("id_LX", id_LX);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	//Найд = Документы.ЛБ_КарточкаЗалогодателя.НайтиПоРеквизиту("id_LX", СокрЛП(id_LX));
	//Если Найд = Документы.ЛБ_КарточкаЗалогодателя.ПустаяСсылка() Тогда
	//	Возврат Неопределено;
	//Иначе
	//	Возврат Найд;
	//КонецЕсли;
	
	Возврат Неопределено;	
КонецФункции

Процедура СоздатьКарточкуЗалогодателя(Ссылка, Данные, АдоСоединение, тзСтран, СтатусКлиента, НеГрузитьАдреса, тзЧерныеСтатусыКлиентов, тзПервыхДатЗБ) 
	АдоСоединениеdCBDL = АдоНовоеСоединение("dCBDL");
	
	Парамс = Новый Структура;
	Парамс.Вставить("АдоСоединение", 		АдоСоединениеdCBDL);
	Парамс.Вставить("ФИО", 			 		СокрЛП(Ссылка.Наименование));
	Парамс.Вставить("ДатаРожденияСтрокой", 	Формат(Ссылка.ДатаРождения, "ДФ=yyyyMMdd"));
	Парамс.Вставить("тзСтран", 				тзСтран);  	  
	Парамс.Вставить("id", 					Данные.id_LX);  	
	
	
	мДокументы = ВернутьДокументыКлиента(Парамс);
	
	промДокументы = мДокументы.Скопировать();
	промДокументы.Свернуть("ВидДокумента, ДокументСерия, ДокументНомер, ДокументДатаВыдачи"); 
	
	
	РеквизитыАнкеты = ВернутьДанныеАнкетыКлиента(АдоСоединениеdCBDL, Данные.id_LX);
	
	ПоследнийДок = Неопределено;
	ЭтоПервыйДок = Истина;
	Для каждого стрПромДокументы из промДокументы Цикл
		Отбор = Новый Структура();
		Отбор.Вставить("ВидДокумента", стрПромДокументы.ВидДокумента); 
		Отбор.Вставить("ДокументСерия", стрПромДокументы.ДокументСерия);
		Отбор.Вставить("ДокументНомер", стрПромДокументы.ДокументНомер);
		Отбор.Вставить("ДокументДатаВыдачи", стрПромДокументы.ДокументДатаВыдачи); 	
		
		НайденныеДоки = мДокументы.НайтиСтроки(Отбор);
		//	НайденныеДоки.Сортировать("ДатаСортировки");
		
		стрДокументы = НайденныеДоки[0];
		
		Карточка_КЛ = ВернутьКарточкуПоIDДокумента(стрДокументы.КодЭликсДокумента);
		Если Карточка_КЛ = Неопределено Тогда	
			Док = Документы.ЛБ_КарточкаЗалогодателя.СоздатьДокумент();
		Иначе
			Док = Карточка_КЛ.ПолучитьОбъект();
		КонецЕсли;
		Док.id_LX               = стрДокументы.КодЭликсДокумента; 
		Док.Залогодатель 		= Ссылка;   
		
		Если НеГрузитьАдреса Тогда    
			ИсключаяСвойства = "id_LX, АдресПоПрописке, АдресПоПропискеLX, АдресПоПропискеСтруктура,ФактическийАдрес,ФактическийАдресLX,ФактическийАдресСтруктура,ПочтовыйАдрес,ПочтовыйАдресLX,ПочтовыйАдресСтруктура";
		Иначе    
			ИсключаяСвойства = "id_LX";
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Док, Данные,,ИсключаяСвойства); 
		
		Если ЗначениеЗаполнено(стрДокументы.ДокументДатаРегистрацииLX) Тогда 
			Если НачалоДня(стрДокументы.ДокументДатаРегистрацииLX) = стрДокументы.ДокументДатаРегистрацииLX Тогда  
				Док.Дата = НачалоДня(стрДокументы.ДокументДатаРегистрацииLX)-1;
			Иначе
				Док.Дата     		= стрДокументы.ДокументДатаРегистрацииLX;
			КонецЕсли;
		Иначе
			Если НЕ ЗначениеЗаполнено(стрДокументы.ДокументДатаВыдачи) Тогда
				Продолжить;
			КонецЕсли;
			Док.Дата 			= стрДокументы.ДокументДатаВыдачи;
		КонецЕсли;
		Если Док.Дата >= Дата(2050,01,01) Тогда
			Док.Дата = Дата(2020,01,01);		
		КонецЕсли;
		Док.ДатаРождения 		= Данные.ДатаРождения;
		Док.Фамилия  			= Данные.Фамилия;
		Док.Имя      			= Данные.Имя;
		Док.Отчество 			= Данные.Отчество;    	
		Док.ПричинаИзменения 	= Справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.ЗагрузкаИзДругойБазы; 
		Док.Ответственный 		= Пользователи.ТекущийПользователь();
		Док.ИзмененияКИ 		= "Загружен из Эликс";  
		//Док.ПричинаИзмененияФИО = Справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.ЗагрузкаИзДругойБазы; 
		Док.ИзмененияАнкета     =  Истина; 
		Док.ИсточникПроисхожденияИмуществаИной       = ""; 
		Док.ИсточникПроисхожденияДенежныхСредствИной = "";
		Если РеквизитыАнкеты.ДеловаяРепутация = "Положительная" Тогда
			Док.ДеловаяРепутацияПоложительная = Истина;
		ИначеЕсли РеквизитыАнкеты.ДеловаяРепутация = "Негативная" Тогда
			Док.ДеловаяРепутацияПоложительная = Ложь;
		КонецЕсли; 
		
		Если СокрЛП(РеквизитыАнкеты.ФинансовоеПоложение) = "1" Тогда
			Док.ФинансовоеПоложениеСтабильное = Истина;
		Иначе
			Док.ФинансовоеПоложениеСтабильное = Ложь;
		КонецЕсли;
		Док.Комментарий = РеквизитыАнкеты.Примечание;	
		
		Если ЗначениеЗаполнено(РеквизитыАнкеты.ИсточникПроисхожденияИмущества) Тогда
			Источн = Справочники.ЛБ_ИсточникиПроисхожденияИмущества.НайтиПоНаименованию(РеквизитыАнкеты.ИсточникПроисхожденияИмущества, Истина);
			Если Источн = Справочники.ЛБ_ИсточникиПроисхожденияИмущества.ПустаяСсылка() Тогда
				Док.ИсточникПроисхожденияИмуществаИной = РеквизитыАнкеты.ИсточникПроисхожденияИмущества;
			Иначе
				Док.ИсточникПроисхожденияИмущества     = Источн;
			КонецЕсли;
		КонецЕсли; 
		Если ЗначениеЗаполнено(РеквизитыАнкеты.ИсточникПроисхожденияДенежныхСредств) Тогда
			Источн = Справочники.ЛБ_ИсточникиПроисхожденияДенежныхСредств.НайтиПоНаименованию(РеквизитыАнкеты.ИсточникПроисхожденияДенежныхСредств, Истина);
			Если Источн = Справочники.ЛБ_ИсточникиПроисхожденияДенежныхСредств.ПустаяСсылка() Тогда
				Док.ИсточникПроисхожденияДенежныхСредствИной = РеквизитыАнкеты.ИсточникПроисхожденияДенежныхСредств;
			Иначе
				Док.ИсточникПроисхожденияДенежныхСредств     = Источн;
			КонецЕсли;
		КонецЕсли;
		
		Если СокрЛП(РеквизитыАнкеты.КатегорияФизЛица) = "1" Тогда 
			Док.КатегорииФизЛица = "Клиент";
		ИначеЕсли СокрЛП(РеквизитыАнкеты.КатегорияФизЛица) = "2" Тогда 
			Док.КатегорииФизЛица = "Представитель клиента"; 
		ИначеЕсли СокрЛП(РеквизитыАнкеты.КатегорияФизЛица) = "3" Тогда 
			Док.КатегорииФизЛица = "Выгодоприобретатель";
		ИначеЕсли СокрЛП(РеквизитыАнкеты.КатегорияФизЛица) = "4" Тогда 
			Док.КатегорииФизЛица = "Бенефициарный владелец";
		КонецЕсли;
		
		УровеньРиска = "Низкий, отсутствуют критерии повышенного риска";
		Если ЗначениеЗаполнено(СокрЛП(РеквизитыАнкеты.УровеньРиска)) Тогда 
			УровеньРиска = СокрЛП(РеквизитыАнкеты.УровеньРиска);
		КонецЕсли;			
		Док.УровеньРиска = УровеньРиска;
		
		
		Док.ДатаОформленияАнкеты = РеквизитыАнкеты.ДатаОформленияАнкеты; 
		
		отбр = Новый Структура("id_Клиента", Данные.id_LX); 
		нстрочки = тзПервыхДатЗБ.НайтиСтроки(Новый Структура("id_Клиента", Данные.id_LX));
		Для каждого стр_Нстрочки из нстрочки Цикл
			Если ЗначениеЗаполнено(РеквизитыАнкеты.ДатаОформленияАнкеты) Тогда
				Если стр_Нстрочки.Дата < РеквизитыАнкеты.ДатаОформленияАнкеты тогда
					Док.ДатаОформленияАнкеты = стр_Нстрочки.Дата; 
				КонецЕсли; 
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(Док.ДатаОформленияАнкеты) Тогда
			Док.СогласиеНаСМСРассылку = РеквизитыАнкеты.РассылкаСМС;
			//ЛБ_УправлениеЛомбардом.СохранитьСогласиеНаСМСРассылки(Док.ДатаОформленияАнкеты-1, Ссылка, РеквизитыАнкеты.РассылкаСМС);
		КонецЕсли;
		
		Док.ЗалогодательБенефициарныйВладелец = Истина;
		
		Док.ТипФизЛица = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
		//Док.ИсточникИнформации = Справочники.ЛБ_ИсточникиИнформации.НайтиПоРеквизиту("id_LX", СокрЛП(РеквизитыАнкеты.КодИсточникаИнформации));
		
		Информирование = СокрЛП(РеквизитыАнкеты.Информирование); 
		СтрокаИнфо = "";
		массив_Инфо = Новый Массив;
		Для инд = 1 по 11 Цикл     
			НольОдин = Сред(Информирование, инд, 1);
			Если СокрЛП(НольОдин) = "1" Тогда 
				знач_Инфо = Справочники.ЛБ_ИсточникиИнформации.НайтиПоРеквизиту("id_LX", СокрЛП(инд));
				СтрокаИнфо = СтрокаИнфо + знач_Инфо+ ";";				
			КонецЕсли;
		КонецЦикла;
		СтрокаИнфо = Лев(СтрокаИнфо, СтрДлина(СтрокаИнфо) - 1);
		Док.ИсточникИнформации = СтрокаИнфо;
		
		//1 - вывеска
		//2 -наружная реклама
		//3 реклама трансп
		//4 реклама лифты
		//5 листовка
		//6 интернет сай
		//7 соц сети
		//8 смс
		//9 колл центр
		//10 посоветовали знакомые
		//11 другое
		
		Док.ИсточникИнформацииДругое = СокрЛП(РеквизитыАнкеты.ДопИнформирование);
		Док.ХарактерОтношений = "Получение краткосрочного займа под залог ювелирных изделий на потребительские нужды";
		
		
		Док.ДокументыЗалогодателя.Очистить();
		
		
		//СсылкаСпр = НайтиДокументЗалогодателя(стрДокументы.КодЭликсДокумента,"0",ТекущаяДата(),Ссылка); 
		
		СсылкаСпр = НайтиДокументЗалогодателяПоРеквизитам(Ссылка,стрДокументы.ДокументНомер,стрДокументы.ВидДокументаЗалогодателя,стрДокументы.ВидДокумента);

		Если СсылкаСпр = Неопределено Тогда
			СпрОбъект = Справочники.ЛБ_ДокументыЗалогодателя.СоздатьЭлемент();
			СпрОбъект.Владелец 		= Ссылка;
			СпрОбъект.Гражданство 	= стрДокументы.Гражданство;
			СпрОбъект.ВидДокументаЗалогодателя = стрДокументы.ВидДокументаЗалогодателя;
			СпрОбъект.ВидДокумента 	= стрДокументы.ВидДокумента;  
			СпрОбъект.id_LX 		= стрДокументы.КодЭликсДокумента;
			СпрОбъект.Номер 		= стрДокументы.ДокументНомер;
			
			СпрОбъект.Наименование = ЛБ_ОбщийМодуль.СформироватьНаименованиеДокументаЗалогодателя(стрДокументы);
			СпрОбъект.НаименованиеПолное = ЛБ_ОбщийМодуль.СформироватьПолноеНаименованиеДокументаЗалогодателя(стрДокументы);
			СпрОбъект.Записать();
			СсылкаСпр = СпрОбъект.Ссылка; 
		Иначе
			ОбДокум = СсылкаСпр.ПолучитьОбъект(); 
			ОбДокум.Гражданство = стрДокументы.Гражданство;
			Если ОбДокум.Владелец <> Ссылка Тогда
				ОбДокум.Владелец = Ссылка;
			КонецЕсли;
			ОбДокум.Наименование = ЛБ_ОбщийМодуль.СформироватьНаименованиеДокументаЗалогодателя(стрДокументы);
			ОбДокум.НаименованиеПолное = ЛБ_ОбщийМодуль.СформироватьПолноеНаименованиеДокументаЗалогодателя(стрДокументы);
			ОбДокум.Записать();			
		КонецЕсли; 
		
		НоваяСтр = Док.ДокументыЗалогодателя.Добавить();
		НоваяСтр.ДокументЗалогодателя 		= СсылкаСпр;
		НоваяСтр.ВидДокумента 				= стрДокументы.ВидДокумента;
		НоваяСтр.ВидДокументаЗалогодателя 	= стрДокументы.ВидДокументаЗалогодателя;
		НоваяСтр.Гражданство 				= стрДокументы.Гражданство;
		НоваяСтр.ДокументСтранаЭмитент 		= стрДокументы.ДокументСтранаЭмитент;
		НоваяСтр.ДокументДатаВыдачи 		= стрДокументы.ДокументДатаВыдачи;
		НоваяСтр.ДокументКемВыдан 			= стрДокументы.ДокументКемВыдан;
		НоваяСтр.ДокументКодПодразделения 	= стрДокументы.ДокументКодПодразделения;
		НоваяСтр.ДокументНачалоДействия 	= стрДокументы.ДокументДатаВыдачи;
		НоваяСтр.ДокументСерия 				= стрДокументы.ДокументСерия;
		НоваяСтр.ДокументНомер 				= стрДокументы.ДокументНомер;
		НоваяСтр.ДокументСрокДействия 		= стрДокументы.ДокументСрокДействия; 
		НоваяСтр.ПричинаИзменения 			= Справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.НовыйДокумент;
		
		//НоваяСтр.ДокументНеДействителен 	= стрДокументы.ДокументНеДействителен;
		//Если стрДокументы.ДокументДУЛ = 1 Тогда
		//	НоваяСтр.ОсновнойДУЛ 	= Истина; 
		//Иначе
		//	НоваяСтр.ОсновнойДУЛ 	= Ложь;
		//КонецЕсли;  
		//Если стрДокументы.ВидДокументаЗалогодателя <> Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность Тогда
		//	НоваяСтр.ОсновнойДУЛ 	= Ложь;
		//КонецЕсли;
		
		Если стрДокументы.ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность или
			стрДокументы.ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийПравоПребыванияРФ Тогда
			НоваяСтр.ОсновнойДУЛ 	= Истина;
		КонецЕсли;
		
		Док.Записать(РежимЗаписиДокумента.Проведение); 
		ПоследнийДок = Док.Ссылка;
	КонецЦикла; 
	
	
	НайденнаяСтрокаЧМ = тзЧерныеСтатусыКлиентов.Найти(Данные.id_LX, "id_Клиента");
	Если НайденнаяСтрокаЧМ <> Неопределено Тогда
		Если ПоследнийДок <> Неопределено Тогда
			КарточкаК = ПоследнийДок.ПолучитьОбъект();
			КарточкаК.СлужебныеСтатусы.Очистить();
			НовСтрочка = КарточкаК.СлужебныеСтатусы.Добавить();
			Если НайденнаяСтрокаЧМ.Метка = "Недобросовестный" Тогда
				НовСтрочка.Статус = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СлужебныйСтатус_Недобросовестный");
			ИначеЕсли НайденнаяСтрокаЧМ.Метка = "Отказ в обслуживании" Тогда
				НовСтрочка.Статус = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СлужебныйСтатус_СтопЛист");
			КонецЕсли; 
			НовСтрочка.Используется = Истина;
			КарточкаК.Записать(РежимЗаписиДокумента.Проведение); 		
		КонецЕсли;
	КонецЕсли; 	
	
	
	
	Если ЗначениеЗаполнено(Данные.ДатаСмерти) Тогда
		Если Данные.ДатаСмерти >= Дата(2020,01,01) Тогда
			
			Карточка_КЛ = ВернутьКарточкуСвидСмерти(Ссылка, Данные.ДатаСмерти);
			Если Карточка_КЛ = Неопределено Тогда	
				Док = Документы.ЛБ_КарточкаЗалогодателя.СоздатьДокумент();
			Иначе
				Док = Карточка_КЛ.ПолучитьОбъект();
			КонецЕсли;
			Док.Залогодатель 		= Ссылка;
			ЗаполнитьЗначенияСвойств(Док, Данные,,"id_LX"); 
			Док.Дата     			= Данные.ДатаСмерти; 
			Док.ДатаРождения 		= Данные.ДатаРождения;
			Док.Фамилия  			= Данные.Фамилия;
			Док.Имя      			= Данные.Имя;
			Док.Отчество 			= Данные.Отчество; 
			Док.ПричинаИзменения 	= Справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.ЗагрузкаИзДругойБазы; 
			Док.Ответственный 		= Пользователи.ТекущийПользователь();
			Док.ИзмененияКИ 		= "Загружен из Эликс";  
			Док.ПричинаИзмененияФИО = Справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.ЗагрузкаИзДругойБазы; 
			Док.ИзмененияАнкета     =  Истина; 
			Док.ИсточникПроисхожденияИмуществаИной       = ""; 
			Док.ИсточникПроисхожденияДенежныхСредствИной = "";
			Если РеквизитыАнкеты.ДеловаяРепутация = "Положительная" Тогда
				Док.ДеловаяРепутацияПоложительная = Истина;
			ИначеЕсли РеквизитыАнкеты.ДеловаяРепутация = "Негативная" Тогда
				Док.ДеловаяРепутацияПоложительная = Ложь;
			КонецЕсли; 
			
			Если СокрЛП(РеквизитыАнкеты.ФинансовоеПоложение) = "1" Тогда
				Док.ФинансовоеПоложениеСтабильное = Истина;
			Иначе
				Док.ФинансовоеПоложениеСтабильное = Ложь;
			КонецЕсли;
			Док.Комментарий = РеквизитыАнкеты.Примечание;	
			
			Если ЗначениеЗаполнено(РеквизитыАнкеты.ИсточникПроисхожденияИмущества) Тогда
				Источн = Справочники.ЛБ_ИсточникиПроисхожденияИмущества.НайтиПоНаименованию(РеквизитыАнкеты.ИсточникПроисхожденияИмущества, Истина);
				Если Источн = Справочники.ЛБ_ИсточникиПроисхожденияИмущества.ПустаяСсылка() Тогда
					Док.ИсточникПроисхожденияИмуществаИной = РеквизитыАнкеты.ИсточникПроисхожденияИмущества;
				Иначе
					Док.ИсточникПроисхожденияИмущества     = Источн;
				КонецЕсли;
			КонецЕсли; 
			Если ЗначениеЗаполнено(РеквизитыАнкеты.ИсточникПроисхожденияДенежныхСредств) Тогда
				Источн = Справочники.ЛБ_ИсточникиПроисхожденияДенежныхСредств.НайтиПоНаименованию(РеквизитыАнкеты.ИсточникПроисхожденияДенежныхСредств, Истина);
				Если Источн = Справочники.ЛБ_ИсточникиПроисхожденияДенежныхСредств.ПустаяСсылка() Тогда
					Док.ИсточникПроисхожденияДенежныхСредствИной = РеквизитыАнкеты.ИсточникПроисхожденияДенежныхСредств;
				Иначе
					Док.ИсточникПроисхожденияДенежныхСредств     = Источн;
				КонецЕсли;
			КонецЕсли;
			
			Если СокрЛП(РеквизитыАнкеты.КатегорияФизЛица) = "1" Тогда 
				Док.КатегорииФизЛица = "Клиент";
			ИначеЕсли СокрЛП(РеквизитыАнкеты.КатегорияФизЛица) = "2" Тогда 
				Док.КатегорииФизЛица = "Представитель клиента"; 
			ИначеЕсли СокрЛП(РеквизитыАнкеты.КатегорияФизЛица) = "3" Тогда 
				Док.КатегорииФизЛица = "Выгодоприобретатель";
			ИначеЕсли СокрЛП(РеквизитыАнкеты.КатегорияФизЛица) = "4" Тогда 
				Док.КатегорииФизЛица = "Бенефициарный владелец";
			КонецЕсли;
			
			УровеньРиска = "Низкий, отсутствуют критерии повышенного риска";
			Если ЗначениеЗаполнено(СокрЛП(РеквизитыАнкеты.УровеньРиска)) Тогда 
				УровеньРиска = СокрЛП(РеквизитыАнкеты.УровеньРиска);
			КонецЕсли;			
			Док.УровеньРиска = УровеньРиска;	
			Док.ДатаОформленияАнкеты = РеквизитыАнкеты.ДатаОформленияАнкеты; 	
			Док.ЗалогодательБенефициарныйВладелец = Истина;
			
			Док.ТипФизЛица = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
			//Док.ИсточникИнформации = Справочники.ЛБ_ИсточникиИнформации.НайтиПоРеквизиту("id_LX", СокрЛП(РеквизитыАнкеты.КодИсточникаИнформации));
			
			Информирование = СокрЛП(РеквизитыАнкеты.Информирование); 
			СтрокаИнфо = "";
			массив_Инфо = Новый Массив;
			Для инд = 1 по 11 Цикл     
				НольОдин = Сред(Информирование, инд, 1);
				Если СокрЛП(НольОдин) = "1" Тогда 
					знач_Инфо = Справочники.ЛБ_ИсточникиИнформации.НайтиПоРеквизиту("id_LX", СокрЛП(инд));
					СтрокаИнфо = СтрокаИнфо + знач_Инфо+ ";";				
				КонецЕсли;
			КонецЦикла;
			СтрокаИнфо = Лев(СтрокаИнфо, СтрДлина(СтрокаИнфо) - 1);
			Док.ИсточникИнформации = СтрокаИнфо;
			
			//1 - вывеска
			//2 -наружная реклама
			//3 реклама трансп
			//4 реклама лифты
			//5 листовка
			//6 интернет сай
			//7 соц сети
			//8 смс
			//9 колл центр
			//10 посоветовали знакомые
			//11 другое
			
			Док.ИсточникИнформацииДругое = СокрЛП(РеквизитыАнкеты.ДопИнформирование);
			Док.ХарактерОтношений = "Получение краткосрочного займа под залог ювелирных изделий на потребительские нужды";
			
			
			Док.ДокументыЗалогодателя.Очистить();
			
			
			СсылкаСпр = НайтиДокументСвидСмерти(Ссылка);
			Если СсылкаСпр = Неопределено Тогда
				СпрОбъект = Справочники.ЛБ_ДокументыЗалогодателя.СоздатьЭлемент();
				СпрОбъект.Владелец 		= Ссылка;
				СпрОбъект.Гражданство 	= Данные.Гражданство;
				СпрОбъект.ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДополнительныйДокумент;;
				СпрОбъект.ВидДокумента 	= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ВидДокумента_СвидетельствоОСмерти"); 		
				СпрОбъект.Наименование  = ЛБ_ОбщийМодуль.СформироватьНаименованиеДокументаЗалогодателя(стрДокументы);
				СпрОбъект.НаименованиеПолное = ЛБ_ОбщийМодуль.СформироватьПолноеНаименованиеДокументаЗалогодателя(стрДокументы);
				СпрОбъект.Записать();
				СсылкаСпр = СпрОбъект.Ссылка; 
			Иначе
				ОбДокум = СсылкаСпр.ПолучитьОбъект(); 
				ОбДокум.Гражданство = Данные.Гражданство;
				ОбДокум.Записать();			
			КонецЕсли; 
			
			НоваяСтр = Док.ДокументыЗалогодателя.Добавить();
			НоваяСтр.ДокументЗалогодателя 		= СсылкаСпр;
			НоваяСтр.ВидДокумента 				= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ВидДокумента_СвидетельствоОСмерти");
			НоваяСтр.ВидДокументаЗалогодателя 	= Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДополнительныйДокумент;;
			НоваяСтр.Гражданство 				= Данные.Гражданство;
			НоваяСтр.ДокументДатаВыдачи 		= Данные.ДатаВыдачиСвидСм;
			НоваяСтр.ДокументНачалоДействия 	= Данные.ДатаВыдачиСвидСм;
			НоваяСтр.ДатаСмерти 				= Данные.ДатаСмерти;
			//НоваяСтр.ДокументСерия 				= Данные.СерияСвидСм;
			НоваяСтр.ДокументНомер 				= Данные.НомерСвидСм;
			
			Док.Записать(РежимЗаписиДокумента.Проведение); 	
		КонецЕсли;
	КонецЕсли;
	
	//+Мельников 16.07.24 Добавление записи о статусе в регистр сведений
	Если Док <> Неопределено Тогда
		НаборЗаписей = РегистрыСведений.ЛБ_СтатусыЗалогодателейДополнительные.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Док.Ссылка);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			
			НаборЗаписей.Записывать = Истина;
			
			Если ЛБ_УправлениеЛомбардом.ПроверитьСтатусПочетный(Док.ДатаРождения, Док.Пол) Тогда
				
				Движение1 = НаборЗаписей.Добавить();
				Движение1.Регистратор = Док.Ссылка;
				Движение1.Залогодатель = Док.Залогодатель;
				Движение1.Период = Док.Дата;
				Движение1.Комментарий = "Загружен из Эликс";
				Движение1.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Почетный;
				Движение1.Используется = Истина;
				
				Движение2 = НаборЗаписей.Добавить();
				Движение2.Регистратор = Док.Ссылка;
				Движение2.Залогодатель = Док.Залогодатель;
				Движение2.Период = Док.Дата;
				Движение2.Комментарий = "Загружен из Эликс";
				Движение2.Статус = Справочники.ЛБ_СтатусыЗалогодателей.VIP;
				Движение2.Используется = Ложь;
				
				Движение3 = НаборЗаписей.Добавить();
				Движение3.Регистратор = Док.Ссылка;
				Движение3.Залогодатель = Док.Залогодатель;
				Движение3.Период = Док.Дата;
				Движение3.Комментарий = "Загружен из Эликс";
				Движение3.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Сотрудник;
				Движение3.Используется = Ложь;
				
			Иначе
				
				Движение1 = НаборЗаписей.Добавить();
				Движение1.Регистратор = Док.Ссылка;
				Движение1.Залогодатель = Док.Залогодатель;
				Движение1.Период = Док.Дата;
				Движение1.Комментарий = "Загружен из Эликс";
				Движение1.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Почетный;
				Движение1.Используется = Ложь;
				
				Движение2 = НаборЗаписей.Добавить();
				Движение2.Регистратор = Док.Ссылка;
				Движение2.Залогодатель = Док.Залогодатель;
				Движение2.Период = Док.Дата;
				Движение2.Комментарий = "Загружен из Эликс";
				Движение2.Статус = Справочники.ЛБ_СтатусыЗалогодателей.VIP;
				Движение2.Используется = Ложь;
				
				Движение3 = НаборЗаписей.Добавить();
				Движение3.Регистратор = Док.Ссылка;
				Движение3.Залогодатель = Док.Залогодатель;
				Движение3.Период = Док.Дата;
				Движение3.Комментарий = "Загружен из Эликс";
				Движение3.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Сотрудник;
				Движение3.Используется = Ложь;
				
			КонецЕсли;
			
			НаборЗаписей.Отбор.Регистратор.Установить(Док.Ссылка);
			НаборЗаписей.Записать(Ложь);
			
		КонецЕсли;
		//-Мельников
	КонецЕсли;
КонецПроцедуры

Процедура СоздатьКарточкуЗалогодателяПокупателя(Ссылка, Данные, АдоСоединение, тзСтран, СтатусКлиента, НеГрузитьАдреса, тзЧерныеСтатусыКлиентов, тзПервыхДатЗБ) 
	АдоСоединениеdCBDL = АдоНовоеСоединение("dCBDL_dan");
	
	Парамс = Новый Структура;
	Парамс.Вставить("АдоСоединение", 		АдоСоединениеdCBDL);
	Парамс.Вставить("ФИО", 			 		СокрЛП(Ссылка.Наименование));
	Парамс.Вставить("ДатаРожденияСтрокой", 	Формат(Ссылка.ДатаРождения, "ДФ=yyyyMMdd"));
	Парамс.Вставить("тзСтран", 				тзСтран);  	  
	Парамс.Вставить("id", 					Данные.id_LX);  	
	
	
	мДокументы = ВернутьДокументыКлиентаПокупателя(Парамс);
	
	промДокументы = мДокументы.Скопировать();
	промДокументы.Свернуть("ВидДокумента, ДокументСерия, ДокументНомер, ДокументДатаВыдачи"); 
	
	
	РеквизитыАнкеты = ВернутьДанныеАнкетыКлиентаПокупателя(АдоСоединениеdCBDL, Данные.id_LX);
	
	ПоследнийДок = Неопределено;
	ЭтоПервыйДок = Истина;
	Для каждого стрПромДокументы из промДокументы Цикл
		Отбор = Новый Структура();
		Отбор.Вставить("ВидДокумента", стрПромДокументы.ВидДокумента); 
		Отбор.Вставить("ДокументСерия", стрПромДокументы.ДокументСерия);
		Отбор.Вставить("ДокументНомер", стрПромДокументы.ДокументНомер);
		Отбор.Вставить("ДокументДатаВыдачи", стрПромДокументы.ДокументДатаВыдачи); 	
		
		НайденныеДоки = мДокументы.НайтиСтроки(Отбор);
		//	НайденныеДоки.Сортировать("ДатаСортировки");
		
		стрДокументы = НайденныеДоки[0];
		
		Карточка_КЛ = ВернутьКарточкуПоIDДокумента(стрДокументы.КодЭликсДокумента);
		Если Карточка_КЛ = Неопределено Тогда	
			Док = Документы.ЛБ_КарточкаЗалогодателя.СоздатьДокумент();
		Иначе
			Док = Карточка_КЛ.ПолучитьОбъект();
		КонецЕсли;
		Док.id_LX               = стрДокументы.КодЭликсДокумента; 
		Док.Залогодатель 		= Ссылка;   
		
		Если НеГрузитьАдреса Тогда    
			ИсключаяСвойства = "id_LX, АдресПоПрописке, АдресПоПропискеLX, АдресПоПропискеСтруктура,ФактическийАдрес,ФактическийАдресLX,ФактическийАдресСтруктура,ПочтовыйАдрес,ПочтовыйАдресLX,ПочтовыйАдресСтруктура";
		Иначе    
			ИсключаяСвойства = "id_LX";
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Док, Данные,,ИсключаяСвойства); 
		
		Если ЗначениеЗаполнено(стрДокументы.ДокументДатаРегистрацииLX) Тогда 
			Если НачалоДня(стрДокументы.ДокументДатаРегистрацииLX) = стрДокументы.ДокументДатаРегистрацииLX Тогда  
				Док.Дата = НачалоДня(стрДокументы.ДокументДатаРегистрацииLX)-1;
			Иначе
				Док.Дата     		= стрДокументы.ДокументДатаРегистрацииLX;
			КонецЕсли;
		Иначе
			Если НЕ ЗначениеЗаполнено(стрДокументы.ДокументДатаВыдачи) Тогда
				Продолжить;
			КонецЕсли;
			Док.Дата 			= стрДокументы.ДокументДатаВыдачи;
		КонецЕсли;
		Если Док.Дата >= Дата(2050,01,01) Тогда
			Док.Дата = Дата(2020,01,01);		
		КонецЕсли;
		Док.ДатаРождения 		= Данные.ДатаРождения;
		Док.Фамилия  			= Данные.Фамилия;
		Док.Имя      			= Данные.Имя;
		Док.Отчество 			= Данные.Отчество;    	
		Док.ПричинаИзменения 	= Справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.ЗагрузкаИзДругойБазы; 
		Док.Ответственный 		= Пользователи.ТекущийПользователь();
		Док.ИзмененияКИ 		= "Загружен из Эликс";  
		//Док.ПричинаИзмененияФИО = Справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.ЗагрузкаИзДругойБазы; 
		Док.ИзмененияАнкета     =  Истина; 
		Док.ИсточникПроисхожденияИмуществаИной       = ""; 
		Док.ИсточникПроисхожденияДенежныхСредствИной = "";
		Если РеквизитыАнкеты.ДеловаяРепутация = "Положительная" Тогда
			Док.ДеловаяРепутацияПоложительная = Истина;
		ИначеЕсли РеквизитыАнкеты.ДеловаяРепутация = "Негативная" Тогда
			Док.ДеловаяРепутацияПоложительная = Ложь;
		КонецЕсли; 
		
		Если СокрЛП(РеквизитыАнкеты.ФинансовоеПоложение) = "1" Тогда
			Док.ФинансовоеПоложениеСтабильное = Истина;
		Иначе
			Док.ФинансовоеПоложениеСтабильное = Ложь;
		КонецЕсли;
		Док.Комментарий = РеквизитыАнкеты.Примечание;	
		
		Если ЗначениеЗаполнено(РеквизитыАнкеты.ИсточникПроисхожденияИмущества) Тогда
			Источн = Справочники.ЛБ_ИсточникиПроисхожденияИмущества.НайтиПоНаименованию(РеквизитыАнкеты.ИсточникПроисхожденияИмущества, Истина);
			Если Источн = Справочники.ЛБ_ИсточникиПроисхожденияИмущества.ПустаяСсылка() Тогда
				Док.ИсточникПроисхожденияИмуществаИной = РеквизитыАнкеты.ИсточникПроисхожденияИмущества;
			Иначе
				Док.ИсточникПроисхожденияИмущества     = Источн;
			КонецЕсли;
		КонецЕсли; 
		Если ЗначениеЗаполнено(РеквизитыАнкеты.ИсточникПроисхожденияДенежныхСредств) Тогда
			Источн = Справочники.ЛБ_ИсточникиПроисхожденияДенежныхСредств.НайтиПоНаименованию(РеквизитыАнкеты.ИсточникПроисхожденияДенежныхСредств, Истина);
			Если Источн = Справочники.ЛБ_ИсточникиПроисхожденияДенежныхСредств.ПустаяСсылка() Тогда
				Док.ИсточникПроисхожденияДенежныхСредствИной = РеквизитыАнкеты.ИсточникПроисхожденияДенежныхСредств;
			Иначе
				Док.ИсточникПроисхожденияДенежныхСредств     = Источн;
			КонецЕсли;
		КонецЕсли;
		
		Если СокрЛП(РеквизитыАнкеты.КатегорияФизЛица) = "1" Тогда 
			Док.КатегорииФизЛица = "Клиент";
		ИначеЕсли СокрЛП(РеквизитыАнкеты.КатегорияФизЛица) = "2" Тогда 
			Док.КатегорииФизЛица = "Представитель клиента"; 
		ИначеЕсли СокрЛП(РеквизитыАнкеты.КатегорияФизЛица) = "3" Тогда 
			Док.КатегорииФизЛица = "Выгодоприобретатель";
		ИначеЕсли СокрЛП(РеквизитыАнкеты.КатегорияФизЛица) = "4" Тогда 
			Док.КатегорииФизЛица = "Бенефициарный владелец";
		КонецЕсли;
		
		УровеньРиска = "Низкий, отсутствуют критерии повышенного риска";
		Если ЗначениеЗаполнено(СокрЛП(РеквизитыАнкеты.УровеньРиска)) Тогда 
			УровеньРиска = СокрЛП(РеквизитыАнкеты.УровеньРиска);
		КонецЕсли;			
		Док.УровеньРиска = УровеньРиска;
		
		
		Док.ДатаОформленияАнкеты = РеквизитыАнкеты.ДатаОформленияАнкеты; 
		
		отбр = Новый Структура("id_Клиента", Данные.id_LX); 
		нстрочки = тзПервыхДатЗБ.НайтиСтроки(Новый Структура("id_Клиента", Данные.id_LX));
		Для каждого стр_Нстрочки из нстрочки Цикл
			Если ЗначениеЗаполнено(РеквизитыАнкеты.ДатаОформленияАнкеты) Тогда
				Если стр_Нстрочки.Дата < РеквизитыАнкеты.ДатаОформленияАнкеты тогда
					Док.ДатаОформленияАнкеты = стр_Нстрочки.Дата; 
				КонецЕсли; 
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(Док.ДатаОформленияАнкеты) Тогда
			Док.СогласиеНаСМСРассылку = РеквизитыАнкеты.РассылкаСМС;
			//ЛБ_УправлениеЛомбардом.СохранитьСогласиеНаСМСРассылки(Док.ДатаОформленияАнкеты-1, Ссылка, РеквизитыАнкеты.РассылкаСМС);
		КонецЕсли;
		
		Док.ЗалогодательБенефициарныйВладелец = Истина;
		
		Док.ТипФизЛица = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
		//Док.ИсточникИнформации = Справочники.ЛБ_ИсточникиИнформации.НайтиПоРеквизиту("id_LX", СокрЛП(РеквизитыАнкеты.КодИсточникаИнформации));
		
		Информирование = СокрЛП(РеквизитыАнкеты.Информирование); 
		СтрокаИнфо = "";
		массив_Инфо = Новый Массив;
		Для инд = 1 по 11 Цикл     
			НольОдин = Сред(Информирование, инд, 1);
			Если СокрЛП(НольОдин) = "1" Тогда 
				знач_Инфо = Справочники.ЛБ_ИсточникиИнформации.НайтиПоРеквизиту("id_LX", СокрЛП(инд));
				СтрокаИнфо = СтрокаИнфо + знач_Инфо+ ";";				
			КонецЕсли;
		КонецЦикла;
		СтрокаИнфо = Лев(СтрокаИнфо, СтрДлина(СтрокаИнфо) - 1);
		Док.ИсточникИнформации = СтрокаИнфо;
		
		//1 - вывеска
		//2 -наружная реклама
		//3 реклама трансп
		//4 реклама лифты
		//5 листовка
		//6 интернет сай
		//7 соц сети
		//8 смс
		//9 колл центр
		//10 посоветовали знакомые
		//11 другое
		
		Док.ИсточникИнформацииДругое = СокрЛП(РеквизитыАнкеты.ДопИнформирование);
		Док.ХарактерОтношений = "Получение краткосрочного займа под залог ювелирных изделий на потребительские нужды";
		
		
		Док.ДокументыЗалогодателя.Очистить();
		
		
		//СсылкаСпр = НайтиДокументЗалогодателя(стрДокументы.КодЭликсДокумента,"0",ТекущаяДата(),Ссылка); 
		
		СсылкаСпр = НайтиДокументЗалогодателяПоРеквизитам(Ссылка,стрДокументы.ДокументНомер,стрДокументы.ВидДокументаЗалогодателя,стрДокументы.ВидДокумента);

		Если СсылкаСпр = Неопределено Тогда
			СпрОбъект = Справочники.ЛБ_ДокументыЗалогодателя.СоздатьЭлемент();
			СпрОбъект.Владелец 		= Ссылка;
			СпрОбъект.Гражданство 	= стрДокументы.Гражданство;
			СпрОбъект.ВидДокументаЗалогодателя = стрДокументы.ВидДокументаЗалогодателя;
			СпрОбъект.ВидДокумента 	= стрДокументы.ВидДокумента;  
			СпрОбъект.id_LX 		= стрДокументы.КодЭликсДокумента;
			СпрОбъект.Номер 		= стрДокументы.ДокументНомер;
			
			СпрОбъект.Наименование = ЛБ_ОбщийМодуль.СформироватьНаименованиеДокументаЗалогодателя(стрДокументы);
			СпрОбъект.НаименованиеПолное = ЛБ_ОбщийМодуль.СформироватьПолноеНаименованиеДокументаЗалогодателя(стрДокументы);
			СпрОбъект.Записать();
			СсылкаСпр = СпрОбъект.Ссылка; 
		Иначе
			ОбДокум = СсылкаСпр.ПолучитьОбъект(); 
			ОбДокум.Гражданство = стрДокументы.Гражданство;
			Если ОбДокум.Владелец <> Ссылка Тогда
				ОбДокум.Владелец = Ссылка;
			КонецЕсли;
			ОбДокум.Наименование = ЛБ_ОбщийМодуль.СформироватьНаименованиеДокументаЗалогодателя(стрДокументы);
			ОбДокум.НаименованиеПолное = ЛБ_ОбщийМодуль.СформироватьПолноеНаименованиеДокументаЗалогодателя(стрДокументы);
			ОбДокум.Записать();			
		КонецЕсли; 
		
		НоваяСтр = Док.ДокументыЗалогодателя.Добавить();
		НоваяСтр.ДокументЗалогодателя 		= СсылкаСпр;
		НоваяСтр.ВидДокумента 				= стрДокументы.ВидДокумента;
		НоваяСтр.ВидДокументаЗалогодателя 	= стрДокументы.ВидДокументаЗалогодателя;
		НоваяСтр.Гражданство 				= стрДокументы.Гражданство;
		НоваяСтр.ДокументСтранаЭмитент 		= стрДокументы.ДокументСтранаЭмитент;
		НоваяСтр.ДокументДатаВыдачи 		= стрДокументы.ДокументДатаВыдачи;
		НоваяСтр.ДокументКемВыдан 			= стрДокументы.ДокументКемВыдан;
		НоваяСтр.ДокументКодПодразделения 	= стрДокументы.ДокументКодПодразделения;
		НоваяСтр.ДокументНачалоДействия 	= стрДокументы.ДокументДатаВыдачи;
		НоваяСтр.ДокументСерия 				= стрДокументы.ДокументСерия;
		НоваяСтр.ДокументНомер 				= стрДокументы.ДокументНомер;
		НоваяСтр.ДокументСрокДействия 		= стрДокументы.ДокументСрокДействия; 
		НоваяСтр.ПричинаИзменения 			= Справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.НовыйДокумент;
		
		//НоваяСтр.ДокументНеДействителен 	= стрДокументы.ДокументНеДействителен;
		//Если стрДокументы.ДокументДУЛ = 1 Тогда
		//	НоваяСтр.ОсновнойДУЛ 	= Истина; 
		//Иначе
		//	НоваяСтр.ОсновнойДУЛ 	= Ложь;
		//КонецЕсли;  
		//Если стрДокументы.ВидДокументаЗалогодателя <> Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность Тогда
		//	НоваяСтр.ОсновнойДУЛ 	= Ложь;
		//КонецЕсли;
		
		Если стрДокументы.ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность или
			стрДокументы.ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийПравоПребыванияРФ Тогда
			НоваяСтр.ОсновнойДУЛ 	= Истина;
		КонецЕсли;
		
		Док.Записать(РежимЗаписиДокумента.Проведение); 
		ПоследнийДок = Док.Ссылка;
	КонецЦикла; 
	
	
	НайденнаяСтрокаЧМ = тзЧерныеСтатусыКлиентов.Найти(Данные.id_LX, "id_Клиента");
	Если НайденнаяСтрокаЧМ <> Неопределено Тогда
		Если ПоследнийДок <> Неопределено Тогда
			КарточкаК = ПоследнийДок.ПолучитьОбъект();
			КарточкаК.СлужебныеСтатусы.Очистить();
			НовСтрочка = КарточкаК.СлужебныеСтатусы.Добавить();
			Если НайденнаяСтрокаЧМ.Метка = "Недобросовестный" Тогда
				НовСтрочка.Статус = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СлужебныйСтатус_Недобросовестный");
			ИначеЕсли НайденнаяСтрокаЧМ.Метка = "Отказ в обслуживании" Тогда
				НовСтрочка.Статус = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СлужебныйСтатус_СтопЛист");
			КонецЕсли; 
			НовСтрочка.Используется = Истина;
			КарточкаК.Записать(РежимЗаписиДокумента.Проведение); 		
		КонецЕсли;
	КонецЕсли; 	
	
	
	
	Если ЗначениеЗаполнено(Данные.ДатаСмерти) Тогда
		Если Данные.ДатаСмерти >= Дата(2020,01,01) Тогда
			
			Карточка_КЛ = ВернутьКарточкуСвидСмерти(Ссылка, Данные.ДатаСмерти);
			Если Карточка_КЛ = Неопределено Тогда	
				Док = Документы.ЛБ_КарточкаЗалогодателя.СоздатьДокумент();
			Иначе
				Док = Карточка_КЛ.ПолучитьОбъект();
			КонецЕсли;
			Док.Залогодатель 		= Ссылка;
			ЗаполнитьЗначенияСвойств(Док, Данные,,"id_LX"); 
			Док.Дата     			= Данные.ДатаСмерти; 
			Док.ДатаРождения 		= Данные.ДатаРождения;
			Док.Фамилия  			= Данные.Фамилия;
			Док.Имя      			= Данные.Имя;
			Док.Отчество 			= Данные.Отчество; 
			Док.ПричинаИзменения 	= Справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.ЗагрузкаИзДругойБазы; 
			Док.Ответственный 		= Пользователи.ТекущийПользователь();
			Док.ИзмененияКИ 		= "Загружен из Эликс";  
			Док.ПричинаИзмененияФИО = Справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.ЗагрузкаИзДругойБазы; 
			Док.ИзмененияАнкета     =  Истина; 
			Док.ИсточникПроисхожденияИмуществаИной       = ""; 
			Док.ИсточникПроисхожденияДенежныхСредствИной = "";
			Если РеквизитыАнкеты.ДеловаяРепутация = "Положительная" Тогда
				Док.ДеловаяРепутацияПоложительная = Истина;
			ИначеЕсли РеквизитыАнкеты.ДеловаяРепутация = "Негативная" Тогда
				Док.ДеловаяРепутацияПоложительная = Ложь;
			КонецЕсли; 
			
			Если СокрЛП(РеквизитыАнкеты.ФинансовоеПоложение) = "1" Тогда
				Док.ФинансовоеПоложениеСтабильное = Истина;
			Иначе
				Док.ФинансовоеПоложениеСтабильное = Ложь;
			КонецЕсли;
			Док.Комментарий = РеквизитыАнкеты.Примечание;	
			
			Если ЗначениеЗаполнено(РеквизитыАнкеты.ИсточникПроисхожденияИмущества) Тогда
				Источн = Справочники.ЛБ_ИсточникиПроисхожденияИмущества.НайтиПоНаименованию(РеквизитыАнкеты.ИсточникПроисхожденияИмущества, Истина);
				Если Источн = Справочники.ЛБ_ИсточникиПроисхожденияИмущества.ПустаяСсылка() Тогда
					Док.ИсточникПроисхожденияИмуществаИной = РеквизитыАнкеты.ИсточникПроисхожденияИмущества;
				Иначе
					Док.ИсточникПроисхожденияИмущества     = Источн;
				КонецЕсли;
			КонецЕсли; 
			Если ЗначениеЗаполнено(РеквизитыАнкеты.ИсточникПроисхожденияДенежныхСредств) Тогда
				Источн = Справочники.ЛБ_ИсточникиПроисхожденияДенежныхСредств.НайтиПоНаименованию(РеквизитыАнкеты.ИсточникПроисхожденияДенежныхСредств, Истина);
				Если Источн = Справочники.ЛБ_ИсточникиПроисхожденияДенежныхСредств.ПустаяСсылка() Тогда
					Док.ИсточникПроисхожденияДенежныхСредствИной = РеквизитыАнкеты.ИсточникПроисхожденияДенежныхСредств;
				Иначе
					Док.ИсточникПроисхожденияДенежныхСредств     = Источн;
				КонецЕсли;
			КонецЕсли;
			
			Если СокрЛП(РеквизитыАнкеты.КатегорияФизЛица) = "1" Тогда 
				Док.КатегорииФизЛица = "Клиент";
			ИначеЕсли СокрЛП(РеквизитыАнкеты.КатегорияФизЛица) = "2" Тогда 
				Док.КатегорииФизЛица = "Представитель клиента"; 
			ИначеЕсли СокрЛП(РеквизитыАнкеты.КатегорияФизЛица) = "3" Тогда 
				Док.КатегорииФизЛица = "Выгодоприобретатель";
			ИначеЕсли СокрЛП(РеквизитыАнкеты.КатегорияФизЛица) = "4" Тогда 
				Док.КатегорииФизЛица = "Бенефициарный владелец";
			КонецЕсли;
			
			УровеньРиска = "Низкий, отсутствуют критерии повышенного риска";
			Если ЗначениеЗаполнено(СокрЛП(РеквизитыАнкеты.УровеньРиска)) Тогда 
				УровеньРиска = СокрЛП(РеквизитыАнкеты.УровеньРиска);
			КонецЕсли;			
			Док.УровеньРиска = УровеньРиска;	
			Док.ДатаОформленияАнкеты = РеквизитыАнкеты.ДатаОформленияАнкеты; 	
			Док.ЗалогодательБенефициарныйВладелец = Истина;
			
			Док.ТипФизЛица = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
			//Док.ИсточникИнформации = Справочники.ЛБ_ИсточникиИнформации.НайтиПоРеквизиту("id_LX", СокрЛП(РеквизитыАнкеты.КодИсточникаИнформации));
			
			Информирование = СокрЛП(РеквизитыАнкеты.Информирование); 
			СтрокаИнфо = "";
			массив_Инфо = Новый Массив;
			Для инд = 1 по 11 Цикл     
				НольОдин = Сред(Информирование, инд, 1);
				Если СокрЛП(НольОдин) = "1" Тогда 
					знач_Инфо = Справочники.ЛБ_ИсточникиИнформации.НайтиПоРеквизиту("id_LX", СокрЛП(инд));
					СтрокаИнфо = СтрокаИнфо + знач_Инфо+ ";";				
				КонецЕсли;
			КонецЦикла;
			СтрокаИнфо = Лев(СтрокаИнфо, СтрДлина(СтрокаИнфо) - 1);
			Док.ИсточникИнформации = СтрокаИнфо;
			
			//1 - вывеска
			//2 -наружная реклама
			//3 реклама трансп
			//4 реклама лифты
			//5 листовка
			//6 интернет сай
			//7 соц сети
			//8 смс
			//9 колл центр
			//10 посоветовали знакомые
			//11 другое
			
			Док.ИсточникИнформацииДругое = СокрЛП(РеквизитыАнкеты.ДопИнформирование);
			Док.ХарактерОтношений = "Получение краткосрочного займа под залог ювелирных изделий на потребительские нужды";
			
			
			Док.ДокументыЗалогодателя.Очистить();
			
			
			СсылкаСпр = НайтиДокументСвидСмерти(Ссылка);
			Если СсылкаСпр = Неопределено Тогда
				СпрОбъект = Справочники.ЛБ_ДокументыЗалогодателя.СоздатьЭлемент();
				СпрОбъект.Владелец 		= Ссылка;
				СпрОбъект.Гражданство 	= Данные.Гражданство;
				СпрОбъект.ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДополнительныйДокумент;;
				СпрОбъект.ВидДокумента 	= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ВидДокумента_СвидетельствоОСмерти"); 		
				СпрОбъект.Наименование  = ЛБ_ОбщийМодуль.СформироватьНаименованиеДокументаЗалогодателя(стрДокументы);
				СпрОбъект.НаименованиеПолное = ЛБ_ОбщийМодуль.СформироватьПолноеНаименованиеДокументаЗалогодателя(стрДокументы);
				СпрОбъект.Записать();
				СсылкаСпр = СпрОбъект.Ссылка; 
			Иначе
				ОбДокум = СсылкаСпр.ПолучитьОбъект(); 
				ОбДокум.Гражданство = Данные.Гражданство;
				ОбДокум.Записать();			
			КонецЕсли; 
			
			НоваяСтр = Док.ДокументыЗалогодателя.Добавить();
			НоваяСтр.ДокументЗалогодателя 		= СсылкаСпр;
			НоваяСтр.ВидДокумента 				= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ВидДокумента_СвидетельствоОСмерти");
			НоваяСтр.ВидДокументаЗалогодателя 	= Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДополнительныйДокумент;;
			НоваяСтр.Гражданство 				= Данные.Гражданство;
			НоваяСтр.ДокументДатаВыдачи 		= Данные.ДатаВыдачиСвидСм;
			НоваяСтр.ДокументНачалоДействия 	= Данные.ДатаВыдачиСвидСм;
			НоваяСтр.ДатаСмерти 				= Данные.ДатаСмерти;
			//НоваяСтр.ДокументСерия 				= Данные.СерияСвидСм;
			НоваяСтр.ДокументНомер 				= Данные.НомерСвидСм;
			
			Док.Записать(РежимЗаписиДокумента.Проведение); 	
		КонецЕсли;
	КонецЕсли;
	
	//+Мельников 16.07.24 Добавление записи о статусе в регистр сведений
	Если Док <> Неопределено Тогда
		НаборЗаписей = РегистрыСведений.ЛБ_СтатусыЗалогодателейДополнительные.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Док.Ссылка);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			
			НаборЗаписей.Записывать = Истина;
			
			Если ЛБ_УправлениеЛомбардом.ПроверитьСтатусПочетный(Док.ДатаРождения, Док.Пол) Тогда
				
				Движение1 = НаборЗаписей.Добавить();
				Движение1.Регистратор = Док.Ссылка;
				Движение1.Залогодатель = Док.Залогодатель;
				Движение1.Период = Док.Дата;
				Движение1.Комментарий = "Загружен из Эликс";
				Движение1.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Почетный;
				Движение1.Используется = Истина;
				
				Движение2 = НаборЗаписей.Добавить();
				Движение2.Регистратор = Док.Ссылка;
				Движение2.Залогодатель = Док.Залогодатель;
				Движение2.Период = Док.Дата;
				Движение2.Комментарий = "Загружен из Эликс";
				Движение2.Статус = Справочники.ЛБ_СтатусыЗалогодателей.VIP;
				Движение2.Используется = Ложь;
				
				Движение3 = НаборЗаписей.Добавить();
				Движение3.Регистратор = Док.Ссылка;
				Движение3.Залогодатель = Док.Залогодатель;
				Движение3.Период = Док.Дата;
				Движение3.Комментарий = "Загружен из Эликс";
				Движение3.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Сотрудник;
				Движение3.Используется = Ложь;
				
			Иначе
				
				Движение1 = НаборЗаписей.Добавить();
				Движение1.Регистратор = Док.Ссылка;
				Движение1.Залогодатель = Док.Залогодатель;
				Движение1.Период = Док.Дата;
				Движение1.Комментарий = "Загружен из Эликс";
				Движение1.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Почетный;
				Движение1.Используется = Ложь;
				
				Движение2 = НаборЗаписей.Добавить();
				Движение2.Регистратор = Док.Ссылка;
				Движение2.Залогодатель = Док.Залогодатель;
				Движение2.Период = Док.Дата;
				Движение2.Комментарий = "Загружен из Эликс";
				Движение2.Статус = Справочники.ЛБ_СтатусыЗалогодателей.VIP;
				Движение2.Используется = Ложь;
				
				Движение3 = НаборЗаписей.Добавить();
				Движение3.Регистратор = Док.Ссылка;
				Движение3.Залогодатель = Док.Залогодатель;
				Движение3.Период = Док.Дата;
				Движение3.Комментарий = "Загружен из Эликс";
				Движение3.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Сотрудник;
				Движение3.Используется = Ложь;
				
			КонецЕсли;
			
			НаборЗаписей.Отбор.Регистратор.Установить(Док.Ссылка);
			НаборЗаписей.Записать(Ложь);
			
		КонецЕсли;
		//-Мельников
	КонецЕсли;
КонецПроцедуры



Процедура СоздатьКарточкуЗалогодателя_02_05_25(Ссылка, Данные, АдоСоединение, тзСтран, СтатусКлиента, НеГрузитьАдреса, тзЧерныеСтатусыКлиентов, тзПервыхДатЗБ) 
	АдоСоединениеdCBDL = АдоНовоеСоединение("dCBDL");
	
	Парамс = Новый Структура;
	Парамс.Вставить("АдоСоединение", 		АдоСоединениеdCBDL);
	Парамс.Вставить("ФИО", 			 		СокрЛП(Ссылка.Наименование));
	Парамс.Вставить("ДатаРожденияСтрокой", 	Формат(Ссылка.ДатаРождения, "ДФ=yyyyMMdd"));
	Парамс.Вставить("тзСтран", 				тзСтран);  	  
	Парамс.Вставить("id", 					Данные.id_LX);  	
	
	
	мДокументы = ВернутьДокументыКлиента(Парамс);
	
	промДокументы = мДокументы.Скопировать();
	промДокументы.Свернуть("ВидДокумента, ДокументСерия, ДокументНомер, ДокументДатаВыдачи"); 
	
	
	РеквизитыАнкеты = ВернутьДанныеАнкетыКлиента(АдоСоединениеdCBDL, Данные.id_LX);
	
	ПоследнийДок = Неопределено;
	ЭтоПервыйДок = Истина;
	Для каждого стрПромДокументы из промДокументы Цикл
		Отбор = Новый Структура();
		Отбор.Вставить("ВидДокумента", стрПромДокументы.ВидДокумента); 
		Отбор.Вставить("ДокументСерия", стрПромДокументы.ДокументСерия);
		Отбор.Вставить("ДокументНомер", стрПромДокументы.ДокументНомер);
		Отбор.Вставить("ДокументДатаВыдачи", стрПромДокументы.ДокументДатаВыдачи); 	
		
		НайденныеДоки = мДокументы.НайтиСтроки(Отбор);
		//	НайденныеДоки.Сортировать("ДатаСортировки");
		
		стрДокументы = НайденныеДоки[0];
		
		Карточка_КЛ = ВернутьКарточкуПоIDДокумента(стрДокументы.КодЭликсДокумента);
		Если Карточка_КЛ = Неопределено Тогда	
			Док = Документы.ЛБ_КарточкаЗалогодателя.СоздатьДокумент();
		Иначе
			Док = Карточка_КЛ.ПолучитьОбъект();
		КонецЕсли;
		Док.id_LX               = стрДокументы.КодЭликсДокумента; 
		Док.Залогодатель 		= Ссылка;   
		
		Если НеГрузитьАдреса Тогда    
			ИсключаяСвойства = "id_LX, АдресПоПрописке, АдресПоПропискеLX, АдресПоПропискеСтруктура,ФактическийАдрес,ФактическийАдресLX,ФактическийАдресСтруктура,ПочтовыйАдрес,ПочтовыйАдресLX,ПочтовыйАдресСтруктура";
		Иначе    
			ИсключаяСвойства = "id_LX";
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Док, Данные,,ИсключаяСвойства); 
		
		Если ЗначениеЗаполнено(стрДокументы.ДокументДатаРегистрацииLX) Тогда 
			Если НачалоДня(стрДокументы.ДокументДатаРегистрацииLX) = стрДокументы.ДокументДатаРегистрацииLX Тогда  
				Док.Дата = НачалоДня(стрДокументы.ДокументДатаРегистрацииLX)-1;
			Иначе
				Док.Дата     		= стрДокументы.ДокументДатаРегистрацииLX;
			КонецЕсли;
		Иначе
			Если НЕ ЗначениеЗаполнено(стрДокументы.ДокументДатаВыдачи) Тогда
				Продолжить;
			КонецЕсли;
			Док.Дата 			= стрДокументы.ДокументДатаВыдачи;
		КонецЕсли;
		Если Док.Дата >= Дата(2050,01,01) Тогда
			Док.Дата = Дата(2020,01,01);		
		КонецЕсли;
		Док.ДатаРождения 		= Данные.ДатаРождения;
		Док.Фамилия  			= Данные.Фамилия;
		Док.Имя      			= Данные.Имя;
		Док.Отчество 			= Данные.Отчество;    	
		Док.ПричинаИзменения 	= Справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.ЗагрузкаИзДругойБазы; 
		Док.Ответственный 		= Пользователи.ТекущийПользователь();
		Док.ИзмененияКИ 		= "Загружен из Эликс";  
		//Док.ПричинаИзмененияФИО = Справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.ЗагрузкаИзДругойБазы; 
		Док.ИзмененияАнкета     =  Истина; 
		Док.ИсточникПроисхожденияИмуществаИной       = ""; 
		Док.ИсточникПроисхожденияДенежныхСредствИной = "";
		Если РеквизитыАнкеты.ДеловаяРепутация = "Положительная" Тогда
			Док.ДеловаяРепутацияПоложительная = Истина;
		ИначеЕсли РеквизитыАнкеты.ДеловаяРепутация = "Негативная" Тогда
			Док.ДеловаяРепутацияПоложительная = Ложь;
		КонецЕсли; 
		
		Если СокрЛП(РеквизитыАнкеты.ФинансовоеПоложение) = "1" Тогда
			Док.ФинансовоеПоложениеСтабильное = Истина;
		Иначе
			Док.ФинансовоеПоложениеСтабильное = Ложь;
		КонецЕсли;
		Док.Комментарий = РеквизитыАнкеты.Примечание;	
		
		Если ЗначениеЗаполнено(РеквизитыАнкеты.ИсточникПроисхожденияИмущества) Тогда
			Источн = Справочники.ЛБ_ИсточникиПроисхожденияИмущества.НайтиПоНаименованию(РеквизитыАнкеты.ИсточникПроисхожденияИмущества, Истина);
			Если Источн = Справочники.ЛБ_ИсточникиПроисхожденияИмущества.ПустаяСсылка() Тогда
				Док.ИсточникПроисхожденияИмуществаИной = РеквизитыАнкеты.ИсточникПроисхожденияИмущества;
			Иначе
				Док.ИсточникПроисхожденияИмущества     = Источн;
			КонецЕсли;
		КонецЕсли; 
		Если ЗначениеЗаполнено(РеквизитыАнкеты.ИсточникПроисхожденияДенежныхСредств) Тогда
			Источн = Справочники.ЛБ_ИсточникиПроисхожденияДенежныхСредств.НайтиПоНаименованию(РеквизитыАнкеты.ИсточникПроисхожденияДенежныхСредств, Истина);
			Если Источн = Справочники.ЛБ_ИсточникиПроисхожденияДенежныхСредств.ПустаяСсылка() Тогда
				Док.ИсточникПроисхожденияДенежныхСредствИной = РеквизитыАнкеты.ИсточникПроисхожденияДенежныхСредств;
			Иначе
				Док.ИсточникПроисхожденияДенежныхСредств     = Источн;
			КонецЕсли;
		КонецЕсли;
		
		Если СокрЛП(РеквизитыАнкеты.КатегорияФизЛица) = "1" Тогда 
			Док.КатегорииФизЛица = "Клиент";
		ИначеЕсли СокрЛП(РеквизитыАнкеты.КатегорияФизЛица) = "2" Тогда 
			Док.КатегорииФизЛица = "Представитель клиента"; 
		ИначеЕсли СокрЛП(РеквизитыАнкеты.КатегорияФизЛица) = "3" Тогда 
			Док.КатегорииФизЛица = "Выгодоприобретатель";
		ИначеЕсли СокрЛП(РеквизитыАнкеты.КатегорияФизЛица) = "4" Тогда 
			Док.КатегорииФизЛица = "Бенефициарный владелец";
		КонецЕсли;
		
		УровеньРиска = "Низкий, отсутствуют критерии повышенного риска";
		Если ЗначениеЗаполнено(СокрЛП(РеквизитыАнкеты.УровеньРиска)) Тогда 
			УровеньРиска = СокрЛП(РеквизитыАнкеты.УровеньРиска);
		КонецЕсли;			
		Док.УровеньРиска = УровеньРиска;
		
		
		Док.ДатаОформленияАнкеты = РеквизитыАнкеты.ДатаОформленияАнкеты; 
		
		отбр = Новый Структура("id_Клиента", Данные.id_LX); 
		нстрочки = тзПервыхДатЗБ.НайтиСтроки(Новый Структура("id_Клиента", Данные.id_LX));
		Для каждого стр_Нстрочки из нстрочки Цикл
			Если ЗначениеЗаполнено(РеквизитыАнкеты.ДатаОформленияАнкеты) Тогда
				Если стр_Нстрочки.Дата < РеквизитыАнкеты.ДатаОформленияАнкеты тогда
					Док.ДатаОформленияАнкеты = стр_Нстрочки.Дата; 
				КонецЕсли; 
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(Док.ДатаОформленияАнкеты) Тогда
			Док.СогласиеНаСМСРассылку = РеквизитыАнкеты.РассылкаСМС;
			//ЛБ_УправлениеЛомбардом.СохранитьСогласиеНаСМСРассылки(Док.ДатаОформленияАнкеты-1, Ссылка, РеквизитыАнкеты.РассылкаСМС);
		КонецЕсли;
		
		Док.ЗалогодательБенефициарныйВладелец = Истина;
		
		Док.ТипФизЛица = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
		//Док.ИсточникИнформации = Справочники.ЛБ_ИсточникиИнформации.НайтиПоРеквизиту("id_LX", СокрЛП(РеквизитыАнкеты.КодИсточникаИнформации));
		
		Информирование = СокрЛП(РеквизитыАнкеты.Информирование); 
		СтрокаИнфо = "";
		массив_Инфо = Новый Массив;
		Для инд = 1 по 11 Цикл     
			НольОдин = Сред(Информирование, инд, 1);
			Если СокрЛП(НольОдин) = "1" Тогда 
				знач_Инфо = Справочники.ЛБ_ИсточникиИнформации.НайтиПоРеквизиту("id_LX", СокрЛП(инд));
				СтрокаИнфо = СтрокаИнфо + знач_Инфо+ ";";				
			КонецЕсли;
		КонецЦикла;
		СтрокаИнфо = Лев(СтрокаИнфо, СтрДлина(СтрокаИнфо) - 1);
		Док.ИсточникИнформации = СтрокаИнфо;
		
		//1 - вывеска
		//2 -наружная реклама
		//3 реклама трансп
		//4 реклама лифты
		//5 листовка
		//6 интернет сай
		//7 соц сети
		//8 смс
		//9 колл центр
		//10 посоветовали знакомые
		//11 другое
		
		Док.ИсточникИнформацииДругое = СокрЛП(РеквизитыАнкеты.ДопИнформирование);
		Док.ХарактерОтношений = "Получение краткосрочного займа под залог ювелирных изделий на потребительские нужды";
		
		
		Док.ДокументыЗалогодателя.Очистить();
		
		
		//СсылкаСпр = НайтиДокументЗалогодателя(стрДокументы.КодЭликсДокумента,"0",ТекущаяДата(),Ссылка); 
		
		СсылкаСпр = НайтиДокументЗалогодателяПоРеквизитам(Ссылка,стрДокументы.ДокументНомер,стрДокументы.ВидДокументаЗалогодателя,стрДокументы.ВидДокумента);
		
		Если СсылкаСпр = Неопределено Тогда
			СпрОбъект = Справочники.ЛБ_ДокументыЗалогодателя.СоздатьЭлемент();
			СпрОбъект.Владелец 		= Ссылка;
			СпрОбъект.Гражданство 	= стрДокументы.Гражданство;
			СпрОбъект.ВидДокументаЗалогодателя = стрДокументы.ВидДокументаЗалогодателя;
			СпрОбъект.ВидДокумента 	= стрДокументы.ВидДокумента;  
			СпрОбъект.id_LX 		= стрДокументы.КодЭликсДокумента; 
			СпрОбъект.Номер 		= стрДокументы.ДокументНомер;
			
			СпрОбъект.Наименование = ЛБ_ОбщийМодуль.СформироватьНаименованиеДокументаЗалогодателя(стрДокументы);
			СпрОбъект.НаименованиеПолное = ЛБ_ОбщийМодуль.СформироватьПолноеНаименованиеДокументаЗалогодателя(стрДокументы);
			СпрОбъект.Записать();
			СсылкаСпр = СпрОбъект.Ссылка; 
		Иначе
			ОбДокум = СсылкаСпр.ПолучитьОбъект(); 
			ОбДокум.Гражданство = стрДокументы.Гражданство;
			Если ОбДокум.Владелец <> Ссылка Тогда
				ОбДокум.Владелец = Ссылка;
			КонецЕсли;
			ОбДокум.Наименование = ЛБ_ОбщийМодуль.СформироватьНаименованиеДокументаЗалогодателя(стрДокументы);
			ОбДокум.НаименованиеПолное = ЛБ_ОбщийМодуль.СформироватьПолноеНаименованиеДокументаЗалогодателя(стрДокументы);
			ОбДокум.Записать();			
		КонецЕсли; 
		
		НоваяСтр = Док.ДокументыЗалогодателя.Добавить();
		НоваяСтр.ДокументЗалогодателя 		= СсылкаСпр;
		НоваяСтр.ВидДокумента 				= стрДокументы.ВидДокумента;
		НоваяСтр.ВидДокументаЗалогодателя 	= стрДокументы.ВидДокументаЗалогодателя;
		НоваяСтр.Гражданство 				= стрДокументы.Гражданство;
		НоваяСтр.ДокументСтранаЭмитент 		= стрДокументы.ДокументСтранаЭмитент;
		НоваяСтр.ДокументДатаВыдачи 		= стрДокументы.ДокументДатаВыдачи;
		НоваяСтр.ДокументКемВыдан 			= стрДокументы.ДокументКемВыдан;
		НоваяСтр.ДокументКодПодразделения 	= стрДокументы.ДокументКодПодразделения;
		НоваяСтр.ДокументНачалоДействия 	= стрДокументы.ДокументДатаВыдачи;
		НоваяСтр.ДокументСерия 				= стрДокументы.ДокументСерия;
		НоваяСтр.ДокументНомер 				= стрДокументы.ДокументНомер;
		НоваяСтр.ДокументСрокДействия 		= стрДокументы.ДокументСрокДействия; 
		НоваяСтр.ПричинаИзменения 			= Справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.НовыйДокумент;
		
		//НоваяСтр.ДокументНеДействителен 	= стрДокументы.ДокументНеДействителен;
		//Если стрДокументы.ДокументДУЛ = 1 Тогда
		//	НоваяСтр.ОсновнойДУЛ 	= Истина; 
		//Иначе
		//	НоваяСтр.ОсновнойДУЛ 	= Ложь;
		//КонецЕсли;  
		//Если стрДокументы.ВидДокументаЗалогодателя <> Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность Тогда
		//	НоваяСтр.ОсновнойДУЛ 	= Ложь;
		//КонецЕсли;
		
		Если стрДокументы.ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность или
			стрДокументы.ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийПравоПребыванияРФ Тогда
			НоваяСтр.ОсновнойДУЛ 	= Истина;
		КонецЕсли;
		
		Док.Записать(РежимЗаписиДокумента.Проведение); 
		ПоследнийДок = Док.Ссылка;
	КонецЦикла; 
	
	
	НайденнаяСтрокаЧМ = тзЧерныеСтатусыКлиентов.Найти(Данные.id_LX, "id_Клиента");
	Если НайденнаяСтрокаЧМ <> Неопределено Тогда
		Если ПоследнийДок <> Неопределено Тогда
			КарточкаК = ПоследнийДок.ПолучитьОбъект();
			КарточкаК.СлужебныеСтатусы.Очистить();
			НовСтрочка = КарточкаК.СлужебныеСтатусы.Добавить();
			Если НайденнаяСтрокаЧМ.Метка = "Недобросовестный" Тогда
				НовСтрочка.Статус = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СлужебныйСтатус_Недобросовестный");
			ИначеЕсли НайденнаяСтрокаЧМ.Метка = "Отказ в обслуживании" Тогда
				НовСтрочка.Статус = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СлужебныйСтатус_СтопЛист");
			КонецЕсли; 
			НовСтрочка.Используется = Истина;
			КарточкаК.Записать(РежимЗаписиДокумента.Проведение); 		
		КонецЕсли;
	КонецЕсли; 	
	
	
	
	Если ЗначениеЗаполнено(Данные.ДатаСмерти) Тогда
		Если Данные.ДатаСмерти >= Дата(2020,01,01) Тогда
			
			Карточка_КЛ = ВернутьКарточкуСвидСмерти(Ссылка, Данные.ДатаСмерти);
			Если Карточка_КЛ = Неопределено Тогда	
				Док = Документы.ЛБ_КарточкаЗалогодателя.СоздатьДокумент();
			Иначе
				Док = Карточка_КЛ.ПолучитьОбъект();
			КонецЕсли;
			Док.Залогодатель 		= Ссылка;
			ЗаполнитьЗначенияСвойств(Док, Данные,,"id_LX"); 
			Док.Дата     			= Данные.ДатаСмерти; 
			Док.ДатаРождения 		= Данные.ДатаРождения;
			Док.Фамилия  			= Данные.Фамилия;
			Док.Имя      			= Данные.Имя;
			Док.Отчество 			= Данные.Отчество; 
			Док.ПричинаИзменения 	= Справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.ЗагрузкаИзДругойБазы; 
			Док.Ответственный 		= Пользователи.ТекущийПользователь();
			Док.ИзмененияКИ 		= "Загружен из Эликс";  
			Док.ПричинаИзмененияФИО = Справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.ЗагрузкаИзДругойБазы; 
			Док.ИзмененияАнкета     =  Истина; 
			Док.ИсточникПроисхожденияИмуществаИной       = ""; 
			Док.ИсточникПроисхожденияДенежныхСредствИной = "";
			Если РеквизитыАнкеты.ДеловаяРепутация = "Положительная" Тогда
				Док.ДеловаяРепутацияПоложительная = Истина;
			ИначеЕсли РеквизитыАнкеты.ДеловаяРепутация = "Негативная" Тогда
				Док.ДеловаяРепутацияПоложительная = Ложь;
			КонецЕсли; 
			
			Если СокрЛП(РеквизитыАнкеты.ФинансовоеПоложение) = "1" Тогда
				Док.ФинансовоеПоложениеСтабильное = Истина;
			Иначе
				Док.ФинансовоеПоложениеСтабильное = Ложь;
			КонецЕсли;
			Док.Комментарий = РеквизитыАнкеты.Примечание;	
			
			Если ЗначениеЗаполнено(РеквизитыАнкеты.ИсточникПроисхожденияИмущества) Тогда
				Источн = Справочники.ЛБ_ИсточникиПроисхожденияИмущества.НайтиПоНаименованию(РеквизитыАнкеты.ИсточникПроисхожденияИмущества, Истина);
				Если Источн = Справочники.ЛБ_ИсточникиПроисхожденияИмущества.ПустаяСсылка() Тогда
					Док.ИсточникПроисхожденияИмуществаИной = РеквизитыАнкеты.ИсточникПроисхожденияИмущества;
				Иначе
					Док.ИсточникПроисхожденияИмущества     = Источн;
				КонецЕсли;
			КонецЕсли; 
			Если ЗначениеЗаполнено(РеквизитыАнкеты.ИсточникПроисхожденияДенежныхСредств) Тогда
				Источн = Справочники.ЛБ_ИсточникиПроисхожденияДенежныхСредств.НайтиПоНаименованию(РеквизитыАнкеты.ИсточникПроисхожденияДенежныхСредств, Истина);
				Если Источн = Справочники.ЛБ_ИсточникиПроисхожденияДенежныхСредств.ПустаяСсылка() Тогда
					Док.ИсточникПроисхожденияДенежныхСредствИной = РеквизитыАнкеты.ИсточникПроисхожденияДенежныхСредств;
				Иначе
					Док.ИсточникПроисхожденияДенежныхСредств     = Источн;
				КонецЕсли;
			КонецЕсли;
			
			Если СокрЛП(РеквизитыАнкеты.КатегорияФизЛица) = "1" Тогда 
				Док.КатегорииФизЛица = "Клиент";
			ИначеЕсли СокрЛП(РеквизитыАнкеты.КатегорияФизЛица) = "2" Тогда 
				Док.КатегорииФизЛица = "Представитель клиента"; 
			ИначеЕсли СокрЛП(РеквизитыАнкеты.КатегорияФизЛица) = "3" Тогда 
				Док.КатегорииФизЛица = "Выгодоприобретатель";
			ИначеЕсли СокрЛП(РеквизитыАнкеты.КатегорияФизЛица) = "4" Тогда 
				Док.КатегорииФизЛица = "Бенефициарный владелец";
			КонецЕсли;
			
			УровеньРиска = "Низкий, отсутствуют критерии повышенного риска";
			Если ЗначениеЗаполнено(СокрЛП(РеквизитыАнкеты.УровеньРиска)) Тогда 
				УровеньРиска = СокрЛП(РеквизитыАнкеты.УровеньРиска);
			КонецЕсли;			
			Док.УровеньРиска = УровеньРиска;	
			Док.ДатаОформленияАнкеты = РеквизитыАнкеты.ДатаОформленияАнкеты; 	
			Док.ЗалогодательБенефициарныйВладелец = Истина;
			
			Док.ТипФизЛица = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
			//Док.ИсточникИнформации = Справочники.ЛБ_ИсточникиИнформации.НайтиПоРеквизиту("id_LX", СокрЛП(РеквизитыАнкеты.КодИсточникаИнформации));
			
			Информирование = СокрЛП(РеквизитыАнкеты.Информирование); 
			СтрокаИнфо = "";
			массив_Инфо = Новый Массив;
			Для инд = 1 по 11 Цикл     
				НольОдин = Сред(Информирование, инд, 1);
				Если СокрЛП(НольОдин) = "1" Тогда 
					знач_Инфо = Справочники.ЛБ_ИсточникиИнформации.НайтиПоРеквизиту("id_LX", СокрЛП(инд));
					СтрокаИнфо = СтрокаИнфо + знач_Инфо+ ";";				
				КонецЕсли;
			КонецЦикла;
			СтрокаИнфо = Лев(СтрокаИнфо, СтрДлина(СтрокаИнфо) - 1);
			Док.ИсточникИнформации = СтрокаИнфо;
			
			//1 - вывеска
			//2 -наружная реклама
			//3 реклама трансп
			//4 реклама лифты
			//5 листовка
			//6 интернет сай
			//7 соц сети
			//8 смс
			//9 колл центр
			//10 посоветовали знакомые
			//11 другое
			
			Док.ИсточникИнформацииДругое = СокрЛП(РеквизитыАнкеты.ДопИнформирование);
			Док.ХарактерОтношений = "Получение краткосрочного займа под залог ювелирных изделий на потребительские нужды";
			
			
			Док.ДокументыЗалогодателя.Очистить();
			
			
			СсылкаСпр = НайтиДокументСвидСмерти(Ссылка);
			Если СсылкаСпр = Неопределено Тогда
				СпрОбъект = Справочники.ЛБ_ДокументыЗалогодателя.СоздатьЭлемент();
				СпрОбъект.Владелец 		= Ссылка;
				СпрОбъект.Гражданство 	= Данные.Гражданство;
				СпрОбъект.ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДополнительныйДокумент;;
				СпрОбъект.ВидДокумента 	= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ВидДокумента_СвидетельствоОСмерти"); 		
				СпрОбъект.Наименование  = ЛБ_ОбщийМодуль.СформироватьНаименованиеДокументаЗалогодателя(стрДокументы);
				СпрОбъект.НаименованиеПолное = ЛБ_ОбщийМодуль.СформироватьПолноеНаименованиеДокументаЗалогодателя(стрДокументы);
				СпрОбъект.Записать();
				СсылкаСпр = СпрОбъект.Ссылка; 
			Иначе
				ОбДокум = СсылкаСпр.ПолучитьОбъект(); 
				ОбДокум.Гражданство = Данные.Гражданство;
				ОбДокум.Записать();			
			КонецЕсли; 
			
			НоваяСтр = Док.ДокументыЗалогодателя.Добавить();
			НоваяСтр.ДокументЗалогодателя 		= СсылкаСпр;
			НоваяСтр.ВидДокумента 				= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ВидДокумента_СвидетельствоОСмерти");
			НоваяСтр.ВидДокументаЗалогодателя 	= Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДополнительныйДокумент;;
			НоваяСтр.Гражданство 				= Данные.Гражданство;
			НоваяСтр.ДокументДатаВыдачи 		= Данные.ДатаВыдачиСвидСм;
			НоваяСтр.ДокументНачалоДействия 	= Данные.ДатаВыдачиСвидСм;
			НоваяСтр.ДатаСмерти 				= Данные.ДатаСмерти;
			//НоваяСтр.ДокументСерия 				= Данные.СерияСвидСм;
			НоваяСтр.ДокументНомер 				= Данные.НомерСвидСм;
			
			Док.Записать(РежимЗаписиДокумента.Проведение); 	
		КонецЕсли;
	КонецЕсли;
	
	//+Мельников 16.07.24 Добавление записи о статусе в регистр сведений
	Если Док <> Неопределено Тогда
		НаборЗаписей = РегистрыСведений.ЛБ_СтатусыЗалогодателейДополнительные.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Док.Ссылка);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			
			НаборЗаписей.Записывать = Истина;
			
			Если ЛБ_УправлениеЛомбардом.ПроверитьСтатусПочетный(Док.ДатаРождения, Док.Пол) Тогда
				
				Движение1 = НаборЗаписей.Добавить();
				Движение1.Регистратор = Док.Ссылка;
				Движение1.Залогодатель = Док.Залогодатель;
				Движение1.Период = Док.Дата;
				Движение1.Комментарий = "Загружен из Эликс";
				Движение1.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Почетный;
				Движение1.Используется = Истина;
				
				Движение2 = НаборЗаписей.Добавить();
				Движение2.Регистратор = Док.Ссылка;
				Движение2.Залогодатель = Док.Залогодатель;
				Движение2.Период = Док.Дата;
				Движение2.Комментарий = "Загружен из Эликс";
				Движение2.Статус = Справочники.ЛБ_СтатусыЗалогодателей.VIP;
				Движение2.Используется = Ложь;
				
				Движение3 = НаборЗаписей.Добавить();
				Движение3.Регистратор = Док.Ссылка;
				Движение3.Залогодатель = Док.Залогодатель;
				Движение3.Период = Док.Дата;
				Движение3.Комментарий = "Загружен из Эликс";
				Движение3.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Сотрудник;
				Движение3.Используется = Ложь;
				
			Иначе
				
				Движение1 = НаборЗаписей.Добавить();
				Движение1.Регистратор = Док.Ссылка;
				Движение1.Залогодатель = Док.Залогодатель;
				Движение1.Период = Док.Дата;
				Движение1.Комментарий = "Загружен из Эликс";
				Движение1.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Почетный;
				Движение1.Используется = Ложь;
				
				Движение2 = НаборЗаписей.Добавить();
				Движение2.Регистратор = Док.Ссылка;
				Движение2.Залогодатель = Док.Залогодатель;
				Движение2.Период = Док.Дата;
				Движение2.Комментарий = "Загружен из Эликс";
				Движение2.Статус = Справочники.ЛБ_СтатусыЗалогодателей.VIP;
				Движение2.Используется = Ложь;
				
				Движение3 = НаборЗаписей.Добавить();
				Движение3.Регистратор = Док.Ссылка;
				Движение3.Залогодатель = Док.Залогодатель;
				Движение3.Период = Док.Дата;
				Движение3.Комментарий = "Загружен из Эликс";
				Движение3.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Сотрудник;
				Движение3.Используется = Ложь;
				
			КонецЕсли;
			
			НаборЗаписей.Отбор.Регистратор.Установить(Док.Ссылка);
			НаборЗаписей.Записать(Ложь);
			
		КонецЕсли;
		//-Мельников
	КонецЕсли;
КонецПроцедуры



Процедура СоздатьКарточкуЗалогодателяНов(Ссылка, Данные, АдоСоединение, тзСтран, СтатусКлиента, НеГрузитьАдреса, тзЧерныеСтатусыКлиентов, тзПервыхДатЗБ, тзВсехДокументов, тзВсехАнкет) 
	//АдоСоединениеdCBDL = АдоНовоеСоединение("dCBDL");
	
	Парамс = Новый Структура;
	//Парамс.Вставить("АдоСоединение", 		АдоСоединениеdCBDL);
	Парамс.Вставить("ФИО", 			 		СокрЛП(Ссылка.Наименование));
	Парамс.Вставить("ДатаРожденияСтрокой", 	Формат(Ссылка.ДатаРождения, "ДФ=yyyyMMdd"));
	Парамс.Вставить("тзСтран", 				тзСтран);  	  
	Парамс.Вставить("id", 					Данные.id_LX); 
	
	КодКлиента = СтрЗаменить(Данные.id_LX,Символы.НПП,""); 
	
	отбор1 = Новый Структура("КодКлиента", КодКлиента);
	мДокументы = тзВсехДокументов.НайтиСтроки(Отбор1);
	
	
	//промДокументы = Новый ТаблицаЗначений;
	//промДокументы.Колонки.Добавить("ВидДокумента");  
	//промДокументы.Колонки.Добавить("ДокументСерия");
	//промДокументы.Колонки.Добавить("ДокументНомер");
	//промДокументы.Колонки.Добавить("ДокументДатаВыдачи"); 
	//Для каждого стр из мДокументы Цикл 
	//	НовСтр = промДокументы.Добавить();
	//	ЗаполнитьЗначенияСвойств(НовСТр, стр);		
	//КонецЦикла;
	//
	//промДокументы.Свернуть("ВидДокумента, ДокументСерия, ДокументНомер, ДокументДатаВыдачи"); 
	
	
	РеквизитыАнкеты = неопределено;
	РеквизитыАнкетыКЛ = тзВсехАнкет.НайтиСтроки(Отбор1);
	Если РеквизитыАнкетыКЛ.Количество() > 0 Тогда 
		РеквизитыАнкеты = РеквизитыАнкетыКЛ[0];
	КонецЕсли; 
			
	
	ПоследнийДок = Неопределено;
	ЭтоПервыйДок = Истина;
	Для каждого стрДокументы из мДокументы Цикл
		//Отбор = Новый Структура();    
		//Отбор.Вставить("КодКлиента", стрПромДокументы.ВидДокумента);
		//Отбор.Вставить("ВидДокумента", стрПромДокументы.ВидДокумента); 
		//Отбор.Вставить("ДокументСерия", стрПромДокументы.ДокументСерия);
		//Отбор.Вставить("ДокументНомер", стрПромДокументы.ДокументНомер);
		//Отбор.Вставить("ДокументДатаВыдачи", стрПромДокументы.ДокументДатаВыдачи); 	
		//
		//НайденныеДоки = мДокументы.НайтиСтроки(Отбор);
		//	НайденныеДоки.Сортировать("ДатаСортировки");
		
		//стрДокументы = НайденныеДоки[0];
		
		Карточка_КЛ = ВернутьКарточкуПоIDДокумента(стрДокументы.КодЭликсДокумента);
		Если Карточка_КЛ = Неопределено Тогда	
			Док = Документы.ЛБ_КарточкаЗалогодателя.СоздатьДокумент();
		Иначе
			Док = Карточка_КЛ.ПолучитьОбъект();
		КонецЕсли;
		Док.id_LX               = стрДокументы.КодЭликсДокумента; 
		Док.Залогодатель 		= Ссылка;   
		
		Если НеГрузитьАдреса Тогда    
			ИсключаяСвойства = "id_LX, АдресПоПрописке, АдресПоПропискеLX, АдресПоПропискеСтруктура,ФактическийАдрес,ФактическийАдресLX,ФактическийАдресСтруктура,ПочтовыйАдрес,ПочтовыйАдресLX,ПочтовыйАдресСтруктура";
		Иначе    
			ИсключаяСвойства = "id_LX";
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Док, Данные,,ИсключаяСвойства); 
		
		Если ЗначениеЗаполнено(стрДокументы.ДокументДатаРегистрацииLX) Тогда 
			Если НачалоДня(стрДокументы.ДокументДатаРегистрацииLX) = стрДокументы.ДокументДатаРегистрацииLX Тогда  
				Док.Дата = НачалоДня(стрДокументы.ДокументДатаРегистрацииLX)-1;
			Иначе
				Док.Дата     		= стрДокументы.ДокументДатаРегистрацииLX;
			КонецЕсли;
		Иначе
			Если НЕ ЗначениеЗаполнено(стрДокументы.ДокументДатаВыдачи) Тогда
				Продолжить;
			КонецЕсли;
			Док.Дата 			= стрДокументы.ДокументДатаВыдачи;
		КонецЕсли;
		Если Док.Дата >= Дата(2050,01,01) Тогда
			Док.Дата = Дата(2020,01,01);		
		КонецЕсли;
		Док.ДатаРождения 		= Данные.ДатаРождения;
		Док.Фамилия  			= Данные.Фамилия;
		Док.Имя      			= Данные.Имя;
		Док.Отчество 			= Данные.Отчество;    	
		Док.ПричинаИзменения 	= Справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.ЗагрузкаИзДругойБазы; 
		Док.Ответственный 		= Пользователи.ТекущийПользователь();
		Док.ИзмененияКИ 		= "Загружен из Эликс";  
		//Док.ПричинаИзмененияФИО = Справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.ЗагрузкаИзДругойБазы; 
		Док.ИзмененияАнкета     =  Истина; 
		Док.ИсточникПроисхожденияИмуществаИной       = ""; 
		Док.ИсточникПроисхожденияДенежныхСредствИной = ""; 
		Если РеквизитыАнкеты <> Неопределено Тогда
			
		Если РеквизитыАнкеты.ДеловаяРепутация = "Положительная" Тогда
			Док.ДеловаяРепутацияПоложительная = Истина;
		ИначеЕсли РеквизитыАнкеты.ДеловаяРепутация = "Негативная" Тогда
			Док.ДеловаяРепутацияПоложительная = Ложь;
		КонецЕсли; 		
		Если СокрЛП(РеквизитыАнкеты.ФинансовоеПоложение) = "1" Тогда
			Док.ФинансовоеПоложениеСтабильное = Истина;
		Иначе
			Док.ФинансовоеПоложениеСтабильное = Ложь;
		КонецЕсли;
		Док.Комментарий = РеквизитыАнкеты.Примечание;	
		
		Если ЗначениеЗаполнено(РеквизитыАнкеты.ИсточникПроисхожденияИмущества) Тогда
			Источн = Справочники.ЛБ_ИсточникиПроисхожденияИмущества.НайтиПоНаименованию(РеквизитыАнкеты.ИсточникПроисхожденияИмущества, Истина);
			Если Источн = Справочники.ЛБ_ИсточникиПроисхожденияИмущества.ПустаяСсылка() Тогда
				Док.ИсточникПроисхожденияИмуществаИной = РеквизитыАнкеты.ИсточникПроисхожденияИмущества;
			Иначе
				Док.ИсточникПроисхожденияИмущества     = Источн;
			КонецЕсли;
		КонецЕсли; 
		Если ЗначениеЗаполнено(РеквизитыАнкеты.ИсточникПроисхожденияДенежныхСредств) Тогда
			Источн = Справочники.ЛБ_ИсточникиПроисхожденияДенежныхСредств.НайтиПоНаименованию(РеквизитыАнкеты.ИсточникПроисхожденияДенежныхСредств, Истина);
			Если Источн = Справочники.ЛБ_ИсточникиПроисхожденияДенежныхСредств.ПустаяСсылка() Тогда
				Док.ИсточникПроисхожденияДенежныхСредствИной = РеквизитыАнкеты.ИсточникПроисхожденияДенежныхСредств;
			Иначе
				Док.ИсточникПроисхожденияДенежныхСредств     = Источн;
			КонецЕсли;
		КонецЕсли;
		
		Если СокрЛП(РеквизитыАнкеты.КатегорияФизЛица) = "1" Тогда 
			Док.КатегорииФизЛица = "Клиент";
		ИначеЕсли СокрЛП(РеквизитыАнкеты.КатегорияФизЛица) = "2" Тогда 
			Док.КатегорииФизЛица = "Представитель клиента"; 
		ИначеЕсли СокрЛП(РеквизитыАнкеты.КатегорияФизЛица) = "3" Тогда 
			Док.КатегорииФизЛица = "Выгодоприобретатель";
		ИначеЕсли СокрЛП(РеквизитыАнкеты.КатегорияФизЛица) = "4" Тогда 
			Док.КатегорииФизЛица = "Бенефициарный владелец";
		КонецЕсли;
		
		УровеньРиска = "Низкий, отсутствуют критерии повышенного риска";
		Если ЗначениеЗаполнено(СокрЛП(РеквизитыАнкеты.УровеньРиска)) Тогда 
			УровеньРиска = СокрЛП(РеквизитыАнкеты.УровеньРиска);
		КонецЕсли;			
		Док.УровеньРиска = УровеньРиска;
		Док.ДатаОформленияАнкеты = РеквизитыАнкеты.ДатаОформленияАнкеты;  
		
				Информирование = СокрЛП(РеквизитыАнкеты.Информирование); 
		СтрокаИнфо = "";
		массив_Инфо = Новый Массив;
		Для инд = 1 по 11 Цикл     
			НольОдин = Сред(Информирование, инд, 1);
			Если СокрЛП(НольОдин) = "1" Тогда 
				знач_Инфо = Справочники.ЛБ_ИсточникиИнформации.НайтиПоРеквизиту("id_LX", СокрЛП(инд));
				СтрокаИнфо = СтрокаИнфо + знач_Инфо+ ";";				
			КонецЕсли;
		КонецЦикла;
		СтрокаИнфо = Лев(СтрокаИнфо, СтрДлина(СтрокаИнфо) - 1);
		Док.ИсточникИнформации = СтрокаИнфо;
		
		//1 - вывеска
		//2 -наружная реклама
		//3 реклама трансп
		//4 реклама лифты
		//5 листовка
		//6 интернет сай
		//7 соц сети
		//8 смс
		//9 колл центр
		//10 посоветовали знакомые
		//11 другое
		
		Док.ИсточникИнформацииДругое = СокрЛП(РеквизитыАнкеты.ДопИнформирование);

		
		отбр = Новый Структура("id_Клиента", Данные.id_LX); 
		нстрочки = тзПервыхДатЗБ.НайтиСтроки(Новый Структура("id_Клиента", Данные.id_LX));
		Для каждого стр_Нстрочки из нстрочки Цикл
			Если ЗначениеЗаполнено(РеквизитыАнкеты.ДатаОформленияАнкеты) Тогда
				Если стр_Нстрочки.Дата < РеквизитыАнкеты.ДатаОформленияАнкеты тогда
					Док.ДатаОформленияАнкеты = стр_Нстрочки.Дата; 
				КонецЕсли; 
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(Док.ДатаОформленияАнкеты) Тогда
			Док.СогласиеНаСМСРассылку = РеквизитыАнкеты.РассылкаСМС;
			//ЛБ_УправлениеЛомбардом.СохранитьСогласиеНаСМСРассылки(Док.ДатаОформленияАнкеты-1, Ссылка, РеквизитыАнкеты.РассылкаСМС);
		КонецЕсли;  
		
		КонецЕсли;

		
		Док.ЗалогодательБенефициарныйВладелец = Истина;
		
		Док.ТипФизЛица = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
		//Док.ИсточникИнформации = Справочники.ЛБ_ИсточникиИнформации.НайтиПоРеквизиту("id_LX", СокрЛП(РеквизитыАнкеты.КодИсточникаИнформации));
		
		Док.ХарактерОтношений = "Получение краткосрочного займа под залог ювелирных изделий на потребительские нужды";
		
		
		Док.ДокументыЗалогодателя.Очистить();
		
		
		СсылкаСпр = НайтиДокументЗалогодателя(стрДокументы.КодЭликсДокумента,"0",ТекущаяДата(),Ссылка);
		Если СсылкаСпр = Неопределено Тогда
			СпрОбъект = Справочники.ЛБ_ДокументыЗалогодателя.СоздатьЭлемент();
			СпрОбъект.Владелец 		= Ссылка;
			СпрОбъект.Гражданство 	= стрДокументы.Гражданство;
			СпрОбъект.ВидДокументаЗалогодателя = стрДокументы.ВидДокументаЗалогодателя;
			СпрОбъект.ВидДокумента 	= стрДокументы.ВидДокумента;  
			СпрОбъект.id_LX 		= стрДокументы.КодЭликсДокумента;
			
			СпрОбъект.Наименование = ЛБ_ОбщийМодуль.СформироватьНаименованиеДокументаЗалогодателя(стрДокументы);
			СпрОбъект.НаименованиеПолное = ЛБ_ОбщийМодуль.СформироватьПолноеНаименованиеДокументаЗалогодателя(стрДокументы);
			СпрОбъект.Записать();
			СсылкаСпр = СпрОбъект.Ссылка; 
		Иначе
			ОбДокум = СсылкаСпр.ПолучитьОбъект(); 
			ОбДокум.Гражданство = стрДокументы.Гражданство;
			Если ОбДокум.Владелец <> Ссылка Тогда
				ОбДокум.Владелец = Ссылка;
			КонецЕсли;
			ОбДокум.Наименование = ЛБ_ОбщийМодуль.СформироватьНаименованиеДокументаЗалогодателя(стрДокументы);
			ОбДокум.НаименованиеПолное = ЛБ_ОбщийМодуль.СформироватьПолноеНаименованиеДокументаЗалогодателя(стрДокументы);
			ОбДокум.Записать();			
		КонецЕсли; 
		
		НоваяСтр = Док.ДокументыЗалогодателя.Добавить();
		НоваяСтр.ДокументЗалогодателя 		= СсылкаСпр;
		НоваяСтр.ВидДокумента 				= стрДокументы.ВидДокумента;
		НоваяСтр.ВидДокументаЗалогодателя 	= стрДокументы.ВидДокументаЗалогодателя;
		НоваяСтр.Гражданство 				= стрДокументы.Гражданство;
		НоваяСтр.ДокументСтранаЭмитент 		= стрДокументы.ДокументСтранаЭмитент;
		НоваяСтр.ДокументДатаВыдачи 		= стрДокументы.ДокументДатаВыдачи;
		НоваяСтр.ДокументКемВыдан 			= стрДокументы.ДокументКемВыдан;
		НоваяСтр.ДокументКодПодразделения 	= стрДокументы.ДокументКодПодразделения;
		НоваяСтр.ДокументНачалоДействия 	= стрДокументы.ДокументДатаВыдачи;
		НоваяСтр.ДокументСерия 				= стрДокументы.ДокументСерия;
		НоваяСтр.ДокументНомер 				= стрДокументы.ДокументНомер;
		НоваяСтр.ДокументСрокДействия 		= стрДокументы.ДокументСрокДействия; 
		НоваяСтр.ПричинаИзменения 			= Справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.НовыйДокумент;
		
		//НоваяСтр.ДокументНеДействителен 	= стрДокументы.ДокументНеДействителен;
		//Если стрДокументы.ДокументДУЛ = 1 Тогда
		//	НоваяСтр.ОсновнойДУЛ 	= Истина; 
		//Иначе
		//	НоваяСтр.ОсновнойДУЛ 	= Ложь;
		//КонецЕсли;  
		//Если стрДокументы.ВидДокументаЗалогодателя <> Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность Тогда
		//	НоваяСтр.ОсновнойДУЛ 	= Ложь;
		//КонецЕсли;
		
		Если стрДокументы.ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность или
			стрДокументы.ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийПравоПребыванияРФ Тогда
			НоваяСтр.ОсновнойДУЛ 	= Истина;
		КонецЕсли;
		
		Док.Записать(РежимЗаписиДокумента.Проведение); 
		ПоследнийДок = Док.Ссылка;
	КонецЦикла; 
	
	
	НайденнаяСтрокаЧМ = тзЧерныеСтатусыКлиентов.Найти(Данные.id_LX, "id_Клиента");
	Если НайденнаяСтрокаЧМ <> Неопределено Тогда
		Если ПоследнийДок <> Неопределено Тогда
			КарточкаК = ПоследнийДок.ПолучитьОбъект();
			КарточкаК.СлужебныеСтатусы.Очистить();
			НовСтрочка = КарточкаК.СлужебныеСтатусы.Добавить();
			Если НайденнаяСтрокаЧМ.Метка = "Недобросовестный" Тогда
				НовСтрочка.Статус = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СлужебныйСтатус_Недобросовестный");
			ИначеЕсли НайденнаяСтрокаЧМ.Метка = "Отказ в обслуживании" Тогда
				НовСтрочка.Статус = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("СлужебныйСтатус_СтопЛист");
			КонецЕсли; 
			НовСтрочка.Используется = Истина;
			КарточкаК.Записать(РежимЗаписиДокумента.Проведение); 		
		КонецЕсли;
	КонецЕсли; 	
	
	
	
	Если ЗначениеЗаполнено(Данные.ДатаСмерти) Тогда
		Если Данные.ДатаСмерти >= Дата(2020,01,01) Тогда
			
			Карточка_КЛ = ВернутьКарточкуСвидСмерти(Ссылка, Данные.ДатаСмерти);
			Если Карточка_КЛ = Неопределено Тогда	
				Док = Документы.ЛБ_КарточкаЗалогодателя.СоздатьДокумент();
			Иначе
				Док = Карточка_КЛ.ПолучитьОбъект();
			КонецЕсли;
			Док.Залогодатель 		= Ссылка;
			ЗаполнитьЗначенияСвойств(Док, Данные,,"id_LX"); 
			Док.Дата     			= Данные.ДатаСмерти; 
			Док.ДатаРождения 		= Данные.ДатаРождения;
			Док.Фамилия  			= Данные.Фамилия;
			Док.Имя      			= Данные.Имя;
			Док.Отчество 			= Данные.Отчество; 
			Док.ПричинаИзменения 	= Справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.ЗагрузкаИзДругойБазы; 
			Док.Ответственный 		= Пользователи.ТекущийПользователь();
			Док.ИзмененияКИ 		= "Загружен из Эликс";  
			Док.ПричинаИзмененияФИО = Справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.ЗагрузкаИзДругойБазы; 
			Док.ИзмененияАнкета     =  Истина; 
			Док.ИсточникПроисхожденияИмуществаИной       = ""; 
			Док.ИсточникПроисхожденияДенежныхСредствИной = "";
			Если РеквизитыАнкеты.ДеловаяРепутация = "Положительная" Тогда
				Док.ДеловаяРепутацияПоложительная = Истина;
			ИначеЕсли РеквизитыАнкеты.ДеловаяРепутация = "Негативная" Тогда
				Док.ДеловаяРепутацияПоложительная = Ложь;
			КонецЕсли; 
			
			Если СокрЛП(РеквизитыАнкеты.ФинансовоеПоложение) = "1" Тогда
				Док.ФинансовоеПоложениеСтабильное = Истина;
			Иначе
				Док.ФинансовоеПоложениеСтабильное = Ложь;
			КонецЕсли;
			Док.Комментарий = РеквизитыАнкеты.Примечание;	
			
			Если ЗначениеЗаполнено(РеквизитыАнкеты.ИсточникПроисхожденияИмущества) Тогда
				Источн = Справочники.ЛБ_ИсточникиПроисхожденияИмущества.НайтиПоНаименованию(РеквизитыАнкеты.ИсточникПроисхожденияИмущества, Истина);
				Если Источн = Справочники.ЛБ_ИсточникиПроисхожденияИмущества.ПустаяСсылка() Тогда
					Док.ИсточникПроисхожденияИмуществаИной = РеквизитыАнкеты.ИсточникПроисхожденияИмущества;
				Иначе
					Док.ИсточникПроисхожденияИмущества     = Источн;
				КонецЕсли;
			КонецЕсли; 
			Если ЗначениеЗаполнено(РеквизитыАнкеты.ИсточникПроисхожденияДенежныхСредств) Тогда
				Источн = Справочники.ЛБ_ИсточникиПроисхожденияДенежныхСредств.НайтиПоНаименованию(РеквизитыАнкеты.ИсточникПроисхожденияДенежныхСредств, Истина);
				Если Источн = Справочники.ЛБ_ИсточникиПроисхожденияДенежныхСредств.ПустаяСсылка() Тогда
					Док.ИсточникПроисхожденияДенежныхСредствИной = РеквизитыАнкеты.ИсточникПроисхожденияДенежныхСредств;
				Иначе
					Док.ИсточникПроисхожденияДенежныхСредств     = Источн;
				КонецЕсли;
			КонецЕсли;
			
			Если СокрЛП(РеквизитыАнкеты.КатегорияФизЛица) = "1" Тогда 
				Док.КатегорииФизЛица = "Клиент";
			ИначеЕсли СокрЛП(РеквизитыАнкеты.КатегорияФизЛица) = "2" Тогда 
				Док.КатегорииФизЛица = "Представитель клиента"; 
			ИначеЕсли СокрЛП(РеквизитыАнкеты.КатегорияФизЛица) = "3" Тогда 
				Док.КатегорииФизЛица = "Выгодоприобретатель";
			ИначеЕсли СокрЛП(РеквизитыАнкеты.КатегорияФизЛица) = "4" Тогда 
				Док.КатегорииФизЛица = "Бенефициарный владелец";
			КонецЕсли;
			
			УровеньРиска = "Низкий, отсутствуют критерии повышенного риска";
			Если ЗначениеЗаполнено(СокрЛП(РеквизитыАнкеты.УровеньРиска)) Тогда 
				УровеньРиска = СокрЛП(РеквизитыАнкеты.УровеньРиска);
			КонецЕсли;			
			Док.УровеньРиска = УровеньРиска;	
			Док.ДатаОформленияАнкеты = РеквизитыАнкеты.ДатаОформленияАнкеты; 	
			Док.ЗалогодательБенефициарныйВладелец = Истина;
			
			Док.ТипФизЛица = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
			//Док.ИсточникИнформации = Справочники.ЛБ_ИсточникиИнформации.НайтиПоРеквизиту("id_LX", СокрЛП(РеквизитыАнкеты.КодИсточникаИнформации));
			
			Информирование = СокрЛП(РеквизитыАнкеты.Информирование); 
			СтрокаИнфо = "";
			массив_Инфо = Новый Массив;
			Для инд = 1 по 11 Цикл     
				НольОдин = Сред(Информирование, инд, 1);
				Если СокрЛП(НольОдин) = "1" Тогда 
					знач_Инфо = Справочники.ЛБ_ИсточникиИнформации.НайтиПоРеквизиту("id_LX", СокрЛП(инд));
					СтрокаИнфо = СтрокаИнфо + знач_Инфо+ ";";				
				КонецЕсли;
			КонецЦикла;
			СтрокаИнфо = Лев(СтрокаИнфо, СтрДлина(СтрокаИнфо) - 1);
			Док.ИсточникИнформации = СтрокаИнфо;
			
			//1 - вывеска
			//2 -наружная реклама
			//3 реклама трансп
			//4 реклама лифты
			//5 листовка
			//6 интернет сай
			//7 соц сети
			//8 смс
			//9 колл центр
			//10 посоветовали знакомые
			//11 другое
			
			Док.ИсточникИнформацииДругое = СокрЛП(РеквизитыАнкеты.ДопИнформирование);
			Док.ХарактерОтношений = "Получение краткосрочного займа под залог ювелирных изделий на потребительские нужды";
			
			
			Док.ДокументыЗалогодателя.Очистить();
			
			
			СсылкаСпр = НайтиДокументСвидСмерти(Ссылка);
			Если СсылкаСпр = Неопределено Тогда
				СпрОбъект = Справочники.ЛБ_ДокументыЗалогодателя.СоздатьЭлемент();
				СпрОбъект.Владелец 		= Ссылка;
				СпрОбъект.Гражданство 	= Данные.Гражданство;
				СпрОбъект.ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДополнительныйДокумент;;
				СпрОбъект.ВидДокумента 	= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ВидДокумента_СвидетельствоОСмерти"); 		
				СпрОбъект.Наименование  = ЛБ_ОбщийМодуль.СформироватьНаименованиеДокументаЗалогодателя(стрДокументы);
				СпрОбъект.НаименованиеПолное = ЛБ_ОбщийМодуль.СформироватьПолноеНаименованиеДокументаЗалогодателя(стрДокументы);
				СпрОбъект.Записать();
				СсылкаСпр = СпрОбъект.Ссылка; 
			Иначе
				ОбДокум = СсылкаСпр.ПолучитьОбъект(); 
				ОбДокум.Гражданство = Данные.Гражданство;
				ОбДокум.Записать();			
			КонецЕсли; 
			
			НоваяСтр = Док.ДокументыЗалогодателя.Добавить();
			НоваяСтр.ДокументЗалогодателя 		= СсылкаСпр;
			НоваяСтр.ВидДокумента 				= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ВидДокумента_СвидетельствоОСмерти");
			НоваяСтр.ВидДокументаЗалогодателя 	= Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДополнительныйДокумент;;
			НоваяСтр.Гражданство 				= Данные.Гражданство;
			НоваяСтр.ДокументДатаВыдачи 		= Данные.ДатаВыдачиСвидСм;
			НоваяСтр.ДокументНачалоДействия 	= Данные.ДатаВыдачиСвидСм;
			НоваяСтр.ДатаСмерти 				= Данные.ДатаСмерти;
			//НоваяСтр.ДокументСерия 				= Данные.СерияСвидСм;
			НоваяСтр.ДокументНомер 				= Данные.НомерСвидСм;
			
			Док.Записать(РежимЗаписиДокумента.Проведение); 	
		КонецЕсли;
	КонецЕсли;
	
	//+Мельников 16.07.24 Добавление записи о статусе в регистр сведений
	Если Док <> Неопределено Тогда
		НаборЗаписей = РегистрыСведений.ЛБ_СтатусыЗалогодателейДополнительные.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Док.Ссылка);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			
			НаборЗаписей.Записывать = Истина;
			
			Если ЛБ_УправлениеЛомбардом.ПроверитьСтатусПочетный(Док.ДатаРождения, Док.Пол) Тогда
				
				Движение1 = НаборЗаписей.Добавить();
				Движение1.Регистратор = Док.Ссылка;
				Движение1.Залогодатель = Док.Залогодатель;
				Движение1.Период = Док.Дата;
				Движение1.Комментарий = "Загружен из Эликс";
				Движение1.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Почетный;
				Движение1.Используется = Истина;
				
				Движение2 = НаборЗаписей.Добавить();
				Движение2.Регистратор = Док.Ссылка;
				Движение2.Залогодатель = Док.Залогодатель;
				Движение2.Период = Док.Дата;
				Движение2.Комментарий = "Загружен из Эликс";
				Движение2.Статус = Справочники.ЛБ_СтатусыЗалогодателей.VIP;
				Движение2.Используется = Ложь;
				
				Движение3 = НаборЗаписей.Добавить();
				Движение3.Регистратор = Док.Ссылка;
				Движение3.Залогодатель = Док.Залогодатель;
				Движение3.Период = Док.Дата;
				Движение3.Комментарий = "Загружен из Эликс";
				Движение3.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Сотрудник;
				Движение3.Используется = Ложь;
				
			Иначе
				
				Движение1 = НаборЗаписей.Добавить();
				Движение1.Регистратор = Док.Ссылка;
				Движение1.Залогодатель = Док.Залогодатель;
				Движение1.Период = Док.Дата;
				Движение1.Комментарий = "Загружен из Эликс";
				Движение1.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Почетный;
				Движение1.Используется = Ложь;
				
				Движение2 = НаборЗаписей.Добавить();
				Движение2.Регистратор = Док.Ссылка;
				Движение2.Залогодатель = Док.Залогодатель;
				Движение2.Период = Док.Дата;
				Движение2.Комментарий = "Загружен из Эликс";
				Движение2.Статус = Справочники.ЛБ_СтатусыЗалогодателей.VIP;
				Движение2.Используется = Ложь;
				
				Движение3 = НаборЗаписей.Добавить();
				Движение3.Регистратор = Док.Ссылка;
				Движение3.Залогодатель = Док.Залогодатель;
				Движение3.Период = Док.Дата;
				Движение3.Комментарий = "Загружен из Эликс";
				Движение3.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Сотрудник;
				Движение3.Используется = Ложь;
				
			КонецЕсли;
			
			НаборЗаписей.Отбор.Регистратор.Установить(Док.Ссылка);
			НаборЗаписей.Записать(Ложь);
			
		КонецЕсли;
		//-Мельников
	КонецЕсли;
КонецПроцедуры


Функция НайтиДокументСвидСмерти(Залогодатель)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_ДокументыЗалогодателя.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЛБ_ДокументыЗалогодателя КАК ЛБ_ДокументыЗалогодателя
	|ГДЕ
	|	ЛБ_ДокументыЗалогодателя.ВидДокумента = &ВидДокумента
	|	И ЛБ_ДокументыЗалогодателя.Владелец = &Залогодатель";
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель); 
	Запрос.УстановитьПараметр("ВидДокумента", ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ВидДокумента_СвидетельствоОСмерти")); 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции



Функция ВернутьКарточкуСвидСмерти(Залогодатель, ДатаСмерти)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_КарточкаЗалогодателя.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЛБ_КарточкаЗалогодателя КАК ЛБ_КарточкаЗалогодателя
	|ГДЕ
	|	ЛБ_КарточкаЗалогодателя.Залогодатель = &Залогодатель
	|	И ЛБ_КарточкаЗалогодателя.Дата = &ДатаСмерти";
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.УстановитьПараметр("ДатаСмерти", ДатаСмерти);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции



Функция ВернутьКарточкуЗалогодателя(Залогодатель) 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_КарточкаЗалогодателя.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЛБ_КарточкаЗалогодателя КАК ЛБ_КарточкаЗалогодателя
	|ГДЕ
	|	ЛБ_КарточкаЗалогодателя.Залогодатель = &Залогодатель";
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция НайтиДокументЗалогодателя(id_LX, ДокументНомер, ДокументДатаВыдачи, Владелец)	
	
	// Жданов +22.07.24
	
	Перем ДокументСерия;
	
	// Жданов -22.07.24
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛБ_ДокументыЗалогодателя.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЛБ_ДокументыЗалогодателя КАК ЛБ_ДокументыЗалогодателя
	|ГДЕ
	|	ЛБ_ДокументыЗалогодателя.id_LX = &id_LX";
	Запрос.УстановитьПараметр("id_LX",id_LX);	
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Возврат ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
	Иначе
		
		
		//ЗаписатьОшибкуВРегистрОшибокИнтеграции(ТекущаяДата(), "Не нашел документ клиента с id = "+СокрЛП(id_LX), СокрЛП(Владелец));
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		// Жданов +22.07.24 
		
		"ВЫБРАТЬ
		|	ЛБ_ДокументыЗалогодателей.ДокументЗалогодателя КАК Ссылка
		|ИЗ
		|	РегистрСведений.ЛБ_ДокументыЗалогодателей КАК ЛБ_ДокументыЗалогодателей
		|ГДЕ
		|	ЛБ_ДокументыЗалогодателей.ДокументНомер = &ДокументНомер
		|	И ЛБ_ДокументыЗалогодателей.Регистратор.Залогодатель = &Залогодатель
		|	И ЛБ_ДокументыЗалогодателей.ДокументСерия = &ДокументСерия";
		//|	И ЛБ_ДокументыЗалогодателей.ВидДокумента = &ВидДокумента";
		
		// Жданов -22.07.24
		
		//"ВЫБРАТЬ
		//|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя КАК Ссылка
		//|ИЗ
		//|	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних КАК ЛБ_ДокументыЗалогодателейСрезПоследних
		//|ГДЕ
		//|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи = &ДокументДатаВыдачи
		//|	И ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер = &ДокументНомер
		//|	И ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя.Владелец = &Владелец";
		
		
		Запрос.УстановитьПараметр("ДокументНомер",				ДокументНомер);
		Запрос.УстановитьПараметр("ДокументСерия",				ДокументСерия);
		Запрос.УстановитьПараметр("Залогодатель",				Владелец);
		//Запрос.УстановитьПараметр("ВидДокумента",				ВидДокумента);
		
		//Запрос.УстановитьПараметр("ДокументДатаВыдачи",		ДокументДатаВыдачи);
		//Запрос.УстановитьПараметр("Владелец",					Владелец);
		
		РезультатЗапроса = Запрос.Выполнить();	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		
		Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда		
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Возврат ВыборкаДетальныеЗаписи.Ссылка;
			КонецЦикла;  
		КонецЕсли;
		
	КонецЕсли;
	Возврат Неопределено; 
	
	
КонецФункции 


Функция НайтиДокументЗалогодателяПоРеквизитам(Владелец, Номер, ВидДокументаЗалогодателя, ВидДокумента)	
	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛБ_ДокументыЗалогодателя.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЛБ_ДокументыЗалогодателя КАК ЛБ_ДокументыЗалогодателя
	|ГДЕ
	|	ЛБ_ДокументыЗалогодателя.Владелец = &Владелец
	|	И ЛБ_ДокументыЗалогодателя.ВидДокументаЗалогодателя = &ВидДокументаЗалогодателя
	|	И ЛБ_ДокументыЗалогодателя.ВидДокумента = &ВидДокумента
	|	И ЛБ_ДокументыЗалогодателя.Номер = &Номер";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Номер",    Номер); 
	Запрос.УстановитьПараметр("ВидДокументаЗалогодателя",    ВидДокументаЗалогодателя);
	Запрос.УстановитьПараметр("ВидДокумента",    ВидДокумента);

	
	Выборка = Запрос.Выполнить().Выбрать();	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции 

Процедура ЗаписатьОшибкуВРегистрОшибокИнтеграции(Дата, Ошибка, Залогодатель)
	МенеджерЗаписи = РегистрыСведений.ЛБ_ОшибкиИнтеграции.СоздатьМенеджерЗаписи(); 
	МенеджерЗаписи.ДатаЗагрузки = Дата; 
	МенеджерЗаписи.Ошибка 		= Ошибка; 
	МенеджерЗаписи.Залогодатель = Залогодатель; 
	МенеджерЗаписи.Записать();  
КонецПроцедуры

Функция НайтиСоздатьВидДокументаФизическогоЛица(КодLX)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛБ_СоответствиеВидовДокументовФизлиц.ВидДокумента КАК ВидДокумента
	|ИЗ
	|	РегистрСведений.ЛБ_СоответствиеВидовДокументовФизлиц КАК ЛБ_СоответствиеВидовДокументовФизлиц
	|ГДЕ
	|	ЛБ_СоответствиеВидовДокументовФизлиц.КодLX = &КодLX";
	
	Запрос.УстановитьПараметр("КодLX", КодLX);	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Если ВыборкаДетальныеЗаписи.Количество() < 1 Тогда
		Возврат Неопределено;		
	Иначе
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Возврат ВыборкаДетальныеЗаписи.ВидДокумента;
		КонецЦикла;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

Функция ВернутьДокументыКлиента(параметры)
	Перем Результат ;
	
	АдоСоединение   = Параметры.АдоСоединение;
	ФИО             = Параметры.ФИО;
	ДатаРожденияСтрокой = Параметры.ДатаРожденияСтрокой; 
	тзСтран 		= Параметры.тзСтран; 
	id 		= Параметры.id;
	
	
	
	ТекстЗапроса = "exec z_FizAxioma '','" +СтрЗаменить(id,Символы.НПП,"")+"'"; 
	
	//ТекстЗапроса = "exec z_FizAxioma '"+СокрЛП(ФИО)+"',0,'"+ДатаРожденияСтрокой+"'";
	
	// 'Тягус Марина Владимировна',0, '19770903'
	
	Выборка = АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса) ;
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("КодЭликс");
	ТЗ.Колонки.Добавить("КодЭликсДокумента");
	ТЗ.Колонки.Добавить("ВидДокумента");	
	ТЗ.Колонки.Добавить("ВидДокументаЗалогодателя");	
	ТЗ.Колонки.Добавить("Гражданство"); 
	ТЗ.Колонки.Добавить("ДокументСтранаЭмитент");
	ТЗ.Колонки.Добавить("ДокументНачалоДействия", Новый ОписаниеТипов("Дата"));		
	ТЗ.Колонки.Добавить("ДокументСерия");
	ТЗ.Колонки.Добавить("ДокументНомер");
	ТЗ.Колонки.Добавить("ДокументДатаВыдачи", Новый ОписаниеТипов("Дата"));	
	ТЗ.Колонки.Добавить("ДокументКемВыдан");
	ТЗ.Колонки.Добавить("ДокументКодПодразделения");
	ТЗ.Колонки.Добавить("ДокументСрокДействия", Новый ОписаниеТипов("Дата"));	
	ТЗ.Колонки.Добавить("ДокументДатаРегистрацииLX");
	ТЗ.Колонки.Добавить("ДокументНеДействителен");
	ТЗ.Колонки.Добавить("ДокументДУЛ"); 
	ТЗ.Колонки.Добавить("ДатаСортировки");
	
	Пока не Выборка.eof() Цикл
		КодДока1С = Выборка.fields("Kod1C").value;
		Если КодДока1С = "36" Тогда
			
		Иначе
			ВидДок = НайтиСоздатьВидДокументаФизическогоЛица(КодДока1С); 
			Если ВидДок = Неопределено Тогда
				Сообщить(СокрЛП(ФИО)+ " "+СокрЛП(id)+". Не нашел вид документа с кодом: "+СокрЛП(КодДока1С)); 
			КонецЕсли;
			
			
			ВидДокумента	 	= НайтиСоздатьВидДокументаФизическогоЛица(Выборка.fields("Kod1C").value);
			ДокументСерия 		= Выборка.fields("SDoc").value;
			ДокументНомер 		= Выборка.fields("NDoc").value;
			ДокументДатаВыдачи 	= Выборка.fields("DDoc").value;
			Если значениеЗаполнено(ДокументДатаВыдачи) Тогда
				Если ДокументДатаВыдачи >= Дата(2050,01,01) Тогда
					ДокументДатаВыдачи = Дата(2020,01,01);		
				КонецЕсли;
			КонецЕсли;
			
			ДокументКемВыдан 	= Выборка.fields("WDoc").value;
			ДокументКодПодразделения = Выборка.fields("KodPodr").value;
			ДокументСрокДействия = Выборка.fields("EndPreb").value;
			Если ДокументСрокДействия >= Дата(2199,01,01) Тогда 
				ДокументСрокДействия = Неопределено;
			КонецЕсли;
			Гражданство 		= НайтиСтрануМиравТЗ(тзСтран, Выборка.fields("KodStrana").value,"");
			
			ВидДокЗалогодателя 	= Выборка.fields("Vz").value;
			
			ВидДокументаЗалогодателя = Неопределено;
			
			Если ВидДокЗалогодателя = 1 Тогда	//	ДУЛ
				ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность;
			ИначеЕсли ВидДокЗалогодателя = 2 Тогда	//	льготы
				ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДополнительныйДокумент;
			ИначеЕсли ВидДокЗалогодателя = 7 Тогда	//	Территория РФ
				ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийПравоПребыванияРФ ;
			ИначеЕсли ВидДокЗалогодателя = 12 Тогда	//	иностранный паспорт
				ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийПравоПребыванияРФ ;				
			Иначе
				//Сообщить("Неправильный вид документа залогодателя "+СтрокаТЗ.КодЭликс) ;
			КонецЕсли;
			
			РеквизитыДока = Новый Структура; 
			РеквизитыДока.Вставить("ВидДокумента",  			ВидДокумента); 
			РеквизитыДока.Вставить("ВидДокументаЗалогодателя",  ВидДокументаЗалогодателя); 
			РеквизитыДока.Вставить("ДокументСерия",  			ДокументСерия); 
			РеквизитыДока.Вставить("ДокументНомер",  			ДокументНомер);
			РеквизитыДока.Вставить("ДокументДатаВыдачи",  		ДокументДатаВыдачи); 
			РеквизитыДока.Вставить("ДокументКемВыдан",  		ДокументКемВыдан);
			РеквизитыДока.Вставить("ДокументКодПодразделения",  ДокументКодПодразделения);  
			РеквизитыДока.Вставить("ДокументГражданство",  		Гражданство);
			РеквизитыДока.Вставить("ДокументСрокДействия",  	ДокументСрокДействия); 			
			
			Если ДокументВалидный(РеквизитыДока) Тогда			
				
				СтрокаТЗ = ТЗ.Добавить();
				СтрокаТЗ.КодЭликс 			= Формат(Выборка.fields("KodClient").value,"ЧГ=0") ;
				СтрокаТЗ.КодЭликсДокумента 	= Выборка.fields("NRecClientDoc").value; 
				
				СтрокаТЗ.ВидДокумента	 	= ВидДокумента;
				Если СтрокаТЗ.ВидДокумента = Неопределено Тогда
					Сообщить("Не нашел вид документа с кодом" + СокрЛП(Выборка.fields("Kod1C").value)); 
				КонецЕсли;
				//  KodStranaD - страна выдачи документа, KodStrana - страна гражданства
				СтрокаТЗ.ДокументСтранаЭмитент = НайтиСтрануМиравТЗ(тзСтран, Выборка.fields("KodStranaD").value,"");
				СтрокаТЗ.Гражданство 		= Гражданство;
				СтрокаТЗ.ДокументСерия 		= ДокументСерия;
				СтрокаТЗ.ДокументНомер 		= ДокументНомер;
				СтрокаТЗ.ДокументДатаВыдачи = ДокументДатаВыдачи;
				СтрокаТЗ.ДокументКемВыдан 	= ДокументКемВыдан;
				СтрокаТЗ.ДокументКодПодразделения = ДокументКодПодразделения;
				СтрокаТЗ.ДокументДатаРегистрацииLX = Выборка.fields("DReg").value;
				СтрокаТЗ.ДокументДУЛ        = Выборка.fields("xv").value; 
				СтрокаТЗ.ДокументСрокДействия = ДокументСрокДействия;
				Попытка
					СтрокаТЗ.ДокументНеДействителен = НЕ СтрокаТЗ.ДокументДУЛ;		
				ИСключение
				КонецПопытки;
				СтрокаТЗ.ВидДокументаЗалогодателя = ВидДокументаЗалогодателя;
				
				Если ЗначениеЗаполнено(СтрокаТЗ.ДокументДатаРегистрацииLX) Тогда
					СтрокаТЗ.ДатаСортировки     		= СтрокаТЗ.ДокументДатаРегистрацииLX;
				Иначе 
					СтрокаТЗ.ДатаСортировки 			= СтрокаТЗ.ДокументДатаВыдачи;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;		
		
		Выборка.movenext();
	КонецЦикла;
	
	тз.Сортировать("ДатаСортировки");
	Возврат ТЗ;  
КонецФункции

Функция ВернутьДокументыКлиентаПокупателя(параметры)
	Перем Результат ;
	
	АдоСоединение   = Параметры.АдоСоединение;
	ФИО             = Параметры.ФИО;
	ДатаРожденияСтрокой = Параметры.ДатаРожденияСтрокой; 
	тзСтран 		= Параметры.тзСтран; 
	id 		= Параметры.id;
	
	
	
	//ТекстЗапроса = "SELECT * FROM [dCBDL_dan].[dbo].[aClientDocP] where kodclient = '"+id+"'"; 
	
	ТекстЗапроса = "SELECT p.*, d.Kod1C FROM [dCBDL_dan].[dbo].[aClientDocP] p   join [dCBDL].[dbo].[ssDocVid] d on p.KodDocVid = d.KodDocVid where p.kodclient = '"+id+"'"; 
	
	
	Выборка = АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса) ;
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("КодЭликс");
	ТЗ.Колонки.Добавить("КодЭликсДокумента");
	ТЗ.Колонки.Добавить("ВидДокумента");	
	ТЗ.Колонки.Добавить("ВидДокументаЗалогодателя");	
	ТЗ.Колонки.Добавить("Гражданство"); 
	ТЗ.Колонки.Добавить("ДокументСтранаЭмитент");
	ТЗ.Колонки.Добавить("ДокументНачалоДействия", Новый ОписаниеТипов("Дата"));		
	ТЗ.Колонки.Добавить("ДокументСерия");
	ТЗ.Колонки.Добавить("ДокументНомер");
	ТЗ.Колонки.Добавить("ДокументДатаВыдачи", Новый ОписаниеТипов("Дата"));	
	ТЗ.Колонки.Добавить("ДокументКемВыдан");
	ТЗ.Колонки.Добавить("ДокументКодПодразделения");
	ТЗ.Колонки.Добавить("ДокументСрокДействия", Новый ОписаниеТипов("Дата"));	
	ТЗ.Колонки.Добавить("ДокументДатаРегистрацииLX");
	ТЗ.Колонки.Добавить("ДокументНеДействителен");
	ТЗ.Колонки.Добавить("ДокументДУЛ"); 
	ТЗ.Колонки.Добавить("ДатаСортировки");
	
	Пока не Выборка.eof() Цикл
		КодДока1С = Выборка.fields("Kod1c").value;
		Если КодДока1С = "36" Тогда
			
		Иначе
			ВидДок = НайтиСоздатьВидДокументаФизическогоЛица(КодДока1С); 
			Если ВидДок = Неопределено Тогда
				Сообщить(СокрЛП(ФИО)+ " "+СокрЛП(id)+". Не нашел вид документа с кодом: "+СокрЛП(КодДока1С)); 
			КонецЕсли;
			
			
			ВидДокумента	 	= НайтиСоздатьВидДокументаФизическогоЛица(Выборка.fields("Kod1c").value);
			ДокументСерия 		= Выборка.fields("SDoc").value;
			ДокументНомер 		= Выборка.fields("NDoc").value;
			ДокументДатаВыдачи 	= Выборка.fields("DDoc").value;
			Если значениеЗаполнено(ДокументДатаВыдачи) Тогда
				Если ДокументДатаВыдачи >= Дата(2050,01,01) Тогда
					ДокументДатаВыдачи = Дата(2020,01,01);		
				КонецЕсли;
			КонецЕсли;
			
			ДокументКемВыдан 	= Выборка.fields("WDoc").value;
			ДокументКодПодразделения = Выборка.fields("KodPodr").value;
			ДокументСрокДействия = Выборка.fields("EndPreb").value; 
			Если НЕ ЗначениеЗаполнено(ДокументСрокДействия) Тогда
				   ДокументСрокДействия = Неопределено; 
			Иначе
				
			Если ДокументСрокДействия >= Дата(2199,01,01) Тогда 
				ДокументСрокДействия = Неопределено;
			КонецЕсли;
			КонецЕсли;
			Гражданство 		= НайтиСтрануМиравТЗ(тзСтран, Выборка.fields("KodStrana").value,"");
			
			//ВидДокЗалогодателя 	= Выборка.fields("Vz").value; 
			ВидДокЗалогодателя = 1;
			
			ВидДокументаЗалогодателя = Неопределено;
			
			Если ВидДокЗалогодателя = 1 Тогда	//	ДУЛ
				ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность;
			ИначеЕсли ВидДокЗалогодателя = 2 Тогда	//	льготы
				ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДополнительныйДокумент;
			ИначеЕсли ВидДокЗалогодателя = 7 Тогда	//	Территория РФ
				ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийПравоПребыванияРФ ;
			ИначеЕсли ВидДокЗалогодателя = 12 Тогда	//	иностранный паспорт
				ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийПравоПребыванияРФ ;				
			Иначе
				//Сообщить("Неправильный вид документа залогодателя "+СтрокаТЗ.КодЭликс) ;
			КонецЕсли;
			
			РеквизитыДока = Новый Структура; 
			РеквизитыДока.Вставить("ВидДокумента",  			ВидДокумента); 
			РеквизитыДока.Вставить("ВидДокументаЗалогодателя",  ВидДокументаЗалогодателя); 
			РеквизитыДока.Вставить("ДокументСерия",  			ДокументСерия); 
			РеквизитыДока.Вставить("ДокументНомер",  			ДокументНомер);
			РеквизитыДока.Вставить("ДокументДатаВыдачи",  		ДокументДатаВыдачи); 
			РеквизитыДока.Вставить("ДокументКемВыдан",  		ДокументКемВыдан);
			РеквизитыДока.Вставить("ДокументКодПодразделения",  ДокументКодПодразделения);  
			РеквизитыДока.Вставить("ДокументГражданство",  		Гражданство);
			РеквизитыДока.Вставить("ДокументСрокДействия",  	ДокументСрокДействия); 			
			
			Если ДокументВалидный(РеквизитыДока) Тогда			
				
				СтрокаТЗ = ТЗ.Добавить();
				СтрокаТЗ.КодЭликс 			= Формат(Выборка.fields("KodClient").value,"ЧГ=0") ;
				СтрокаТЗ.КодЭликсДокумента 	= Выборка.fields("NRecClientDoc").value; 
				
				СтрокаТЗ.ВидДокумента	 	= ВидДокумента;
				Если СтрокаТЗ.ВидДокумента = Неопределено Тогда
					Сообщить("Не нашел вид документа с кодом" + СокрЛП(Выборка.fields("Kod1C").value)); 
				КонецЕсли;
				//  KodStranaD - страна выдачи документа, KodStrana - страна гражданства
				СтрокаТЗ.ДокументСтранаЭмитент = НайтиСтрануМиравТЗ(тзСтран, Выборка.fields("KodStrana").value,"");
				СтрокаТЗ.Гражданство 		= Гражданство;
				СтрокаТЗ.ДокументСерия 		= ДокументСерия;
				СтрокаТЗ.ДокументНомер 		= ДокументНомер;
				СтрокаТЗ.ДокументДатаВыдачи = ДокументДатаВыдачи;
				СтрокаТЗ.ДокументКемВыдан 	= ДокументКемВыдан;
				СтрокаТЗ.ДокументКодПодразделения = ДокументКодПодразделения;
				СтрокаТЗ.ДокументДатаРегистрацииLX = Выборка.fields("DReg").value;
				СтрокаТЗ.ДокументДУЛ        = Выборка.fields("xv").value; 
				СтрокаТЗ.ДокументСрокДействия = ДокументСрокДействия;
				Попытка
					СтрокаТЗ.ДокументНеДействителен = НЕ СтрокаТЗ.ДокументДУЛ;		
				ИСключение
				КонецПопытки;
				СтрокаТЗ.ВидДокументаЗалогодателя = ВидДокументаЗалогодателя;
				
				Если ЗначениеЗаполнено(СтрокаТЗ.ДокументДатаРегистрацииLX) Тогда
					СтрокаТЗ.ДатаСортировки     		= СтрокаТЗ.ДокументДатаРегистрацииLX;
				Иначе 
					СтрокаТЗ.ДатаСортировки 			= СтрокаТЗ.ДокументДатаВыдачи;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;		
		
		Выборка.movenext();
	КонецЦикла;
	
	тз.Сортировать("ДатаСортировки");
	Возврат ТЗ;  
КонецФункции



Функция ВернутьВсеДокументыВсехКлиентов(тзСтран) Экспорт;
	
	АдоСоединение = АдоНовоеСоединение("dCBDL");
	
	ТекстЗапроса = "exec z_FizAxioma"; 
	
	Выборка = АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса);
	
	ТЗ = Новый ТаблицаЗначений; 
	ТЗ.Колонки.Добавить("КодКлиента");
	ТЗ.Колонки.Добавить("КодЭликсДокумента");
	ТЗ.Колонки.Добавить("ВидДокумента");	
	ТЗ.Колонки.Добавить("ВидДокументаЗалогодателя");	
	ТЗ.Колонки.Добавить("Гражданство"); 
	ТЗ.Колонки.Добавить("ДокументСтранаЭмитент");
	ТЗ.Колонки.Добавить("ДокументНачалоДействия", Новый ОписаниеТипов("Дата"));		
	ТЗ.Колонки.Добавить("ДокументСерия");
	ТЗ.Колонки.Добавить("ДокументНомер");
	ТЗ.Колонки.Добавить("ДокументДатаВыдачи", Новый ОписаниеТипов("Дата"));	
	ТЗ.Колонки.Добавить("ДокументКемВыдан");
	ТЗ.Колонки.Добавить("ДокументКодПодразделения");
	ТЗ.Колонки.Добавить("ДокументСрокДействия", Новый ОписаниеТипов("Дата"));	
	ТЗ.Колонки.Добавить("ДокументДатаРегистрацииLX");
	ТЗ.Колонки.Добавить("ДокументНеДействителен");
	ТЗ.Колонки.Добавить("ДокументДУЛ"); 
	ТЗ.Колонки.Добавить("ДатаСортировки"); 
	ТЗ.Индексы.Добавить("КодКлиента");  
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛБ_СоответствиеВидовДокументовФизлиц.ВидДокумента КАК ВидДокумента,
	|	ЛБ_СоответствиеВидовДокументовФизлиц.КодLX КАК КодLX
	|ИЗ
	|	РегистрСведений.ЛБ_СоответствиеВидовДокументовФизлиц КАК ЛБ_СоответствиеВидовДокументовФизлиц "; 
	
	тзСоотв = Запрос.Выполнить().Выгрузить(); 
	СоотвДоков = Новый Соответствие;
	Для каждого строч из тзСоотв Цикл
		СоотвДоков.Вставить(строч.КодLX, строч.ВидДокумента); 			
	КонецЦикла;	 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.Реквизит КАК Реквизит,
	               |	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.Обязателен КАК Обязателен,
	               |	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.Видимость КАК Видимость,
	               |	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.КоличествоСимволов КАК КоличествоСимволов,
	               |	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.ТолькоЦифры КАК ТолькоЦифры,
	               |	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
	               |	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.ВидГражданства КАК ВидГражданства
	               |ИЗ
	               |	РегистрСведений.ЛБ_НастройкаРеквизитовДокументовЗалогодателя КАК ЛБ_НастройкаРеквизитовДокументовЗалогодателя
	               |ГДЕ
	               |	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.Обязателен = ИСТИНА";  
	
	тзНастроек = Запрос.Выполнить().Выгрузить();

	
	Пока не Выборка.eof() Цикл
		КодДока1С = Выборка.fields("Kod1C").value;
		
		Если КодДока1С = "36" Тогда
			
		Иначе
			ВидДок = СоотвДоков.Получить(КодДока1С); 
			Если ВидДок = Неопределено Тогда
				Сообщить("Не нашел вид документа с кодом: "+СокрЛП(КодДока1С)); 
			КонецЕсли;
			           		
			ВидДокумента	 	= ВидДок;
			ДокументСерия 		= Выборка.fields("SDoc").value;
			ДокументНомер 		= Выборка.fields("NDoc").value;
			ДокументДатаВыдачи 	= Выборка.fields("DDoc").value;
			Если значениеЗаполнено(ДокументДатаВыдачи) Тогда
				Если ДокументДатаВыдачи >= Дата(2050,01,01) Тогда
					ДокументДатаВыдачи = Дата(2020,01,01);		
				КонецЕсли;
			КонецЕсли;
			
			ДокументКемВыдан 	= Выборка.fields("WDoc").value;
			ДокументКодПодразделения = Выборка.fields("KodPodr").value;
			ДокументСрокДействия = Выборка.fields("EndPreb").value;
			Если ДокументСрокДействия >= Дата(2199,01,01) Тогда 
				ДокументСрокДействия = Неопределено;
			КонецЕсли;
			Гражданство 		= НайтиСтрануМиравТЗ(тзСтран, Выборка.fields("KodStrana").value,"");
			
			ВидДокЗалогодателя 	= Выборка.fields("Vz").value;
			
			ВидДокументаЗалогодателя = Неопределено;
			
			Если ВидДокЗалогодателя = 1 Тогда	//	ДУЛ
				ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность;
			ИначеЕсли ВидДокЗалогодателя = 2 Тогда	//	льготы
				ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДополнительныйДокумент;
			ИначеЕсли ВидДокЗалогодателя = 7 Тогда	//	Территория РФ
				ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийПравоПребыванияРФ ;
			ИначеЕсли ВидДокЗалогодателя = 12 Тогда	//	иностранный паспорт
				ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийПравоПребыванияРФ ;				
			Иначе
				//Сообщить("Неправильный вид документа залогодателя "+СтрокаТЗ.КодЭликс) ;
			КонецЕсли;
			
			РеквизитыДока = Новый Структура; 
			РеквизитыДока.Вставить("ВидДокумента",  			ВидДокумента); 
			РеквизитыДока.Вставить("ВидДокументаЗалогодателя",  ВидДокументаЗалогодателя); 
			РеквизитыДока.Вставить("ДокументСерия",  			ДокументСерия); 
			РеквизитыДока.Вставить("ДокументНомер",  			ДокументНомер);
			РеквизитыДока.Вставить("ДокументДатаВыдачи",  		ДокументДатаВыдачи); 
			РеквизитыДока.Вставить("ДокументКемВыдан",  		ДокументКемВыдан);
			РеквизитыДока.Вставить("ДокументКодПодразделения",  ДокументКодПодразделения);  
			РеквизитыДока.Вставить("ДокументГражданство",  		Гражданство);
			РеквизитыДока.Вставить("ДокументСрокДействия",  	ДокументСрокДействия); 			
			
			Если ДокументВалидныйНов(тзНастроек,РеквизитыДока) Тогда			
				
				СтрокаТЗ = ТЗ.Добавить(); 
				СтрокаТЗ.КодКлиента 			= Формат(Выборка.fields("KodClient").value,"ЧГ=0") ;
				СтрокаТЗ.КодЭликсДокумента 	= Выборка.fields("NRecClientDoc").value; 
				
				СтрокаТЗ.ВидДокумента	 	= ВидДокумента;
				Если СтрокаТЗ.ВидДокумента = Неопределено Тогда
					Сообщить("Не нашел вид документа с кодом" + СокрЛП(Выборка.fields("Kod1C").value)); 
				КонецЕсли;
				//  KodStranaD - страна выдачи документа, KodStrana - страна гражданства
				СтрокаТЗ.ДокументСтранаЭмитент = НайтиСтрануМиравТЗ(тзСтран, Выборка.fields("KodStranaD").value,"");
				СтрокаТЗ.Гражданство 		= Гражданство;
				СтрокаТЗ.ДокументСерия 		= ДокументСерия;
				СтрокаТЗ.ДокументНомер 		= ДокументНомер;
				СтрокаТЗ.ДокументДатаВыдачи = ДокументДатаВыдачи;
				СтрокаТЗ.ДокументКемВыдан 	= ДокументКемВыдан;
				СтрокаТЗ.ДокументКодПодразделения = ДокументКодПодразделения;
				СтрокаТЗ.ДокументДатаРегистрацииLX = Выборка.fields("DReg").value;
				СтрокаТЗ.ДокументДУЛ        = Выборка.fields("xv").value; 
				СтрокаТЗ.ДокументСрокДействия = ДокументСрокДействия;
				Попытка
					СтрокаТЗ.ДокументНеДействителен = НЕ СтрокаТЗ.ДокументДУЛ;		
				ИСключение
				КонецПопытки;
				СтрокаТЗ.ВидДокументаЗалогодателя = ВидДокументаЗалогодателя;
				
				Если ЗначениеЗаполнено(СтрокаТЗ.ДокументДатаРегистрацииLX) Тогда
					СтрокаТЗ.ДатаСортировки     		= СтрокаТЗ.ДокументДатаРегистрацииLX;
				Иначе 
					СтрокаТЗ.ДатаСортировки 			= СтрокаТЗ.ДокументДатаВыдачи;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;		
		
		Выборка.movenext();
	КонецЦикла;
	
	тз.Сортировать("ДатаСортировки");
	Возврат ТЗ;  
КонецФункции  


Функция ДокументВалидныйНов(тзНастроек, РеквизитыДока)
	Рез = Истина;   		
	
	Отб = Новый Структура;
	Отб.Вставить("ВидДокумента", РеквизитыДока.ВидДокумента); 
	Отб.Вставить("ВидДокументаЗалогодателя", РеквизитыДока.ВидДокументаЗалогодателя); 
	Отб.Вставить("Обязателен", Истина);
	
	БылаВыборка = Ложь;
	НайдСтроки = тзНастроек.НайтиСтроки(отб);
	Для каждого строч из НайдСтроки Цикл
		БылаВыборка = Истина;
		Если строч.Реквизит = Справочники.ЛБ_РеквизитыДокументовЗалогодателя.ДокументСерия И
			НЕ ЗначениеЗаполнено(РеквизитыДока.ДокументСерия) Тогда
			Возврат Ложь;
		КонецЕсли;
		Если строч.Реквизит = Справочники.ЛБ_РеквизитыДокументовЗалогодателя.ДокументНомер И
			НЕ ЗначениеЗаполнено(РеквизитыДока.ДокументНомер) Тогда
			Возврат Ложь; 
		КонецЕсли;
		Если строч.Реквизит = Справочники.ЛБ_РеквизитыДокументовЗалогодателя.ДокументДатаВыдачи И
			НЕ ЗначениеЗаполнено(РеквизитыДока.ДокументДатаВыдачи) Тогда
			Возврат Ложь;
		КонецЕсли; 
		Если строч.Реквизит = Справочники.ЛБ_РеквизитыДокументовЗалогодателя.ДокументКемВыдан И
			НЕ ЗначениеЗаполнено(РеквизитыДока.ДокументКемВыдан) Тогда
			Возврат Ложь;
		КонецЕсли;
		Если строч.Реквизит = Справочники.ЛБ_РеквизитыДокументовЗалогодателя.ДокументКодПодразделения И
			НЕ ЗначениеЗаполнено(РеквизитыДока.ДокументКодПодразделения) Тогда
			Возврат Ложь;
		КонецЕсли;
		Если строч.Реквизит = Справочники.ЛБ_РеквизитыДокументовЗалогодателя.ДокументГражданство И
			НЕ ЗначениеЗаполнено(РеквизитыДока.ДокументГражданство) Тогда
			Возврат Ложь; 
		КонецЕсли; 
		Если строч.Реквизит = Справочники.ЛБ_РеквизитыДокументовЗалогодателя.ДокументСрокДействия И
			НЕ ЗначениеЗаполнено(РеквизитыДока.ДокументСрокДействия) Тогда
			Возврат Ложь;
		КонецЕсли; 
	КонецЦикла; 
	Если Не БылаВыборка Тогда
		Рез = Ложь;
	КонецЕсли;
	
	Возврат Рез;
КонецФункции



Функция ДокументВалидный(РеквизитыДока)
	Рез = Истина;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидДокумента", РеквизитыДока.ВидДокумента);
	Запрос.УстановитьПараметр("ВидДокументаЗалогодателя", РеквизитыДока.ВидДокументаЗалогодателя);
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.Реквизит КАК Реквизит,
	|	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.Обязателен КАК Обязателен,
	|	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.Видимость КАК Видимость,
	|	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.КоличествоСимволов КАК КоличествоСимволов,
	|	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.ТолькоЦифры КАК ТолькоЦифры
	|ИЗ
	|	РегистрСведений.ЛБ_НастройкаРеквизитовДокументовЗалогодателя КАК ЛБ_НастройкаРеквизитовДокументовЗалогодателя
	|ГДЕ
	|	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.ВидДокумента = &ВидДокумента
	|	И ЛБ_НастройкаРеквизитовДокументовЗалогодателя.ВидДокументаЗалогодателя = &ВидДокументаЗалогодателя
	|	И ЛБ_НастройкаРеквизитовДокументовЗалогодателя.Обязателен = ИСТИНА"; 
	
	БылаВыборка = Ложь;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		БылаВыборка = Истина;
		Если Выборка.Реквизит = Справочники.ЛБ_РеквизитыДокументовЗалогодателя.ДокументСерия И
			НЕ ЗначениеЗаполнено(РеквизитыДока.ДокументСерия) Тогда
			Возврат Ложь;
		КонецЕсли;
		Если Выборка.Реквизит = Справочники.ЛБ_РеквизитыДокументовЗалогодателя.ДокументНомер И
			НЕ ЗначениеЗаполнено(РеквизитыДока.ДокументНомер) Тогда
			Возврат Ложь; 
		КонецЕсли;
		Если Выборка.Реквизит = Справочники.ЛБ_РеквизитыДокументовЗалогодателя.ДокументДатаВыдачи И
			НЕ ЗначениеЗаполнено(РеквизитыДока.ДокументДатаВыдачи) Тогда
			Возврат Ложь;
		КонецЕсли; 
		Если Выборка.Реквизит = Справочники.ЛБ_РеквизитыДокументовЗалогодателя.ДокументКемВыдан И
			НЕ ЗначениеЗаполнено(РеквизитыДока.ДокументКемВыдан) Тогда
			Возврат Ложь;
		КонецЕсли;
		Если Выборка.Реквизит = Справочники.ЛБ_РеквизитыДокументовЗалогодателя.ДокументКодПодразделения И
			НЕ ЗначениеЗаполнено(РеквизитыДока.ДокументКодПодразделения) Тогда
			Возврат Ложь;
		КонецЕсли;
		Если Выборка.Реквизит = Справочники.ЛБ_РеквизитыДокументовЗалогодателя.ДокументГражданство И
			НЕ ЗначениеЗаполнено(РеквизитыДока.ДокументГражданство) Тогда
			Возврат Ложь; 
		КонецЕсли; 
		Если Выборка.Реквизит = Справочники.ЛБ_РеквизитыДокументовЗалогодателя.ДокументСрокДействия И
			НЕ ЗначениеЗаполнено(РеквизитыДока.ДокументСрокДействия) Тогда
			Возврат Ложь;
		КонецЕсли; 
	КонецЦикла; 
	Если Не БылаВыборка Тогда
		Рез = Ложь;
	КонецЕсли;
	
	Возврат Рез;
КонецФункции


Функция ВернутьДанныеАнкетыКлиента(АдоСоединение, id)
	Перем Результат ;
	
	ТекстЗапроса = "
	|SELECT TOP 1 KodClient 
	|,kodRekl КодИсточникаИнформации
	|,AnkFin ФинансовоеПоложение
	|,KodVid КатегорияФизЛица
	|,StRisk УровеньРиска
	|,Anksnils Снилс   
	|,Prim Примечание
	|,DopRekl ДопИнформирование 
	|,INN Информирование
	|,DAnket ДатаОформленияАнкеты
	|,AnkRep ДеловаяРепутация
	|,AnkIstD ИсточникПроисхожденияДенежныхСредств
	|,AnkIstM ИсточникПроисхожденияИмущества
	|,xSMS РассылкаСМС
	|FROM [dCBDL].[dbo].[aClient]
	|where KodClient = " + СокрЛП(id);
	
	
	Выборка = АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса) ;
	
	Рез = Новый Структура;
	Рез.Вставить("ИсточникПроисхожденияДенежныхСредств", 	"");
	Рез.Вставить("ИсточникПроисхожденияИмущества", 			""); 
	Рез.Вставить("ДеловаяРепутация", 						""); 
	Рез.Вставить("Снилс", 									"");
	Рез.Вставить("КатегорияФизЛица", 						""); 
	Рез.Вставить("УровеньРиска", 							""); 
	Рез.Вставить("ДатаОформленияАнкеты", 					"");
	Рез.Вставить("КодИсточникаИнформации", 					"");
	Рез.Вставить("ФинансовоеПоложение", 					""); 
	Рез.Вставить("Примечание", 								"");
	Рез.Вставить("Информирование", 							"");
	Рез.Вставить("ДопИнформирование", 						"");
	Рез.Вставить("РассылкаСМС", 						    "");
	
	
	Пока не Выборка.eof() Цикл
		Рез.Вставить("ИсточникПроисхожденияДенежныхСредств", 	Выборка.fields("ИсточникПроисхожденияДенежныхСредств").value);
		Рез.Вставить("ИсточникПроисхожденияИмущества", 			Выборка.fields("ИсточникПроисхожденияИмущества").value); 
		Рез.Вставить("ДеловаяРепутация", 						Выборка.fields("ДеловаяРепутация").value);    
		Рез.Вставить("Снилс", 									Выборка.fields("Снилс").value);
		Рез.Вставить("КатегорияФизЛица", 						Выборка.fields("КатегорияФизЛица").value); 
		Рез.Вставить("УровеньРиска", 							Выборка.fields("УровеньРиска").value); 
		Рез.Вставить("ДатаОформленияАнкеты", 					Выборка.fields("ДатаОформленияАнкеты").value); 
		Рез.Вставить("КодИсточникаИнформации", 					Выборка.fields("КодИсточникаИнформации").value); 
		Рез.Вставить("ФинансовоеПоложение", 					Выборка.fields("ФинансовоеПоложение").value);
		Рез.Вставить("Примечание", 								Выборка.fields("Примечание").value);
		Рез.Вставить("Информирование", 							Выборка.fields("Информирование").value);
		Рез.Вставить("ДопИнформирование", 						Выборка.fields("ДопИнформирование").value); 
		РассылкаСМС =                                           Выборка.fields("РассылкаСМС").value;
		Если РассылкаСМС = -1 Тогда
			Рез.Вставить("РассылкаСМС", 							Истина);
		Иначе
			Рез.Вставить("РассылкаСМС", 							Ложь);
		КонецЕсли;	
		
		Выборка.movenext();
	КонецЦикла; 
	
	
	//ТекстЗапроса2 = "
	//|SELECT TOP 1 KodClient 
	//|,kodRekl КодИсточникаИнформации
	//|,AnkFin ФинансовоеПоложение
	//|,KodVid КатегорияФизЛица
	//|,StRisk УровеньРиска
	//|,Anksnils Снилс   
	//|,Prim Примечание
	//|,DopRekl ДопИнформирование 
	//|,INN Информирование
	//|,DAnket ДатаОформленияАнкеты
	//|,AnkRep ДеловаяРепутация
	//|,AnkIstD ИсточникПроисхожденияДенежныхСредств
	//|,AnkIstM ИсточникПроисхожденияИмущества
	//|FROM [dCBDL].[dbo].[aClient]
	//|where KodClient = " + СокрЛП(id);
	
	//
	//Выборка = АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса) ;
	//
	//Рез = Новый Структура;
	//Рез.Вставить("ИсточникПроисхожденияДенежныхСредств", 	"");
	//Рез.Вставить("ИсточникПроисхожденияИмущества", 			""); 
	//Рез.Вставить("ДеловаяРепутация", 						""); 
	//Рез.Вставить("Снилс", 									"");
	//Рез.Вставить("КатегорияФизЛица", 						""); 
	//Рез.Вставить("УровеньРиска", 							""); 
	//Рез.Вставить("ДатаОформленияАнкеты", 					"");
	//Рез.Вставить("КодИсточникаИнформации", 					"");
	//Рез.Вставить("ФинансовоеПоложение", 					""); 
	//Рез.Вставить("Примечание", 								"");
	//Рез.Вставить("Информирование", 							"");
	//Рез.Вставить("ДопИнформирование", 						"");
	
	//
	//Пока не Выборка.eof() Цикл
	//	Рез.Вставить("ИсточникПроисхожденияДенежныхСредств", 	Выборка.fields("ИсточникПроисхожденияДенежныхСредств").value);
	//	Рез.Вставить("ИсточникПроисхожденияИмущества", 			Выборка.fields("ИсточникПроисхожденияИмущества").value); 
	//	Рез.Вставить("ДеловаяРепутация", 						Выборка.fields("ДеловаяРепутация").value);    
	//	Рез.Вставить("Снилс", 									Выборка.fields("Снилс").value);
	//	Рез.Вставить("КатегорияФизЛица", 						Выборка.fields("КатегорияФизЛица").value); 
	//	Рез.Вставить("УровеньРиска", 							Выборка.fields("УровеньРиска").value); 
	//	Рез.Вставить("ДатаОформленияАнкеты", 					Выборка.fields("ДатаОформленияАнкеты").value); 
	//	Рез.Вставить("КодИсточникаИнформации", 					Выборка.fields("КодИсточникаИнформации").value); 
	//	Рез.Вставить("ФинансовоеПоложение", 					Выборка.fields("ФинансовоеПоложение").value);
	//	Рез.Вставить("Примечание", 								Выборка.fields("Примечание").value);
	//	Рез.Вставить("Информирование", 							Выборка.fields("Информирование").value);
	//	Рез.Вставить("ДопИнформирование", 						Выборка.fields("ДопИнформирование").value);
	//	
	//	Выборка.movenext();
	//КонецЦикла;
	
	
	
	
	Возврат Рез;	
КонецФункции     

Функция ВернутьДанныеАнкетыКлиентаПокупателя(АдоСоединение, id)
	Перем Результат ;
	
	ТекстЗапроса = "
	|SELECT TOP 1 KodClient 
	|,kodRekl КодИсточникаИнформации
	|,AnkFin ФинансовоеПоложение
	|,KodVid КатегорияФизЛица
	|,StRisk УровеньРиска
	|,Anksnils Снилс   
	|,Prim Примечание
	|,DopRekl ДопИнформирование 
	|,INN Информирование
	|,DAnket ДатаОформленияАнкеты
	|,AnkRep ДеловаяРепутация
	|,AnkIstD ИсточникПроисхожденияДенежныхСредств
	|,AnkIstM ИсточникПроисхожденияИмущества
	|,xSMS РассылкаСМС
	|FROM [dCBDL_dan].[dbo].[aClientP]
	|where KodClient = " + СокрЛП(id);
	
	
	Выборка = АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса) ;
	
	Рез = Новый Структура;
	Рез.Вставить("ИсточникПроисхожденияДенежныхСредств", 	"");
	Рез.Вставить("ИсточникПроисхожденияИмущества", 			""); 
	Рез.Вставить("ДеловаяРепутация", 						""); 
	Рез.Вставить("Снилс", 									"");
	Рез.Вставить("КатегорияФизЛица", 						""); 
	Рез.Вставить("УровеньРиска", 							""); 
	Рез.Вставить("ДатаОформленияАнкеты", 					"");
	Рез.Вставить("КодИсточникаИнформации", 					"");
	Рез.Вставить("ФинансовоеПоложение", 					""); 
	Рез.Вставить("Примечание", 								"");
	Рез.Вставить("Информирование", 							"");
	Рез.Вставить("ДопИнформирование", 						"");
	Рез.Вставить("РассылкаСМС", 						    "");
	
	
	Пока не Выборка.eof() Цикл
		Рез.Вставить("ИсточникПроисхожденияДенежныхСредств", 	Выборка.fields("ИсточникПроисхожденияДенежныхСредств").value);
		Рез.Вставить("ИсточникПроисхожденияИмущества", 			Выборка.fields("ИсточникПроисхожденияИмущества").value); 
		Рез.Вставить("ДеловаяРепутация", 						Выборка.fields("ДеловаяРепутация").value);    
		Рез.Вставить("Снилс", 									Выборка.fields("Снилс").value);
		Рез.Вставить("КатегорияФизЛица", 						Выборка.fields("КатегорияФизЛица").value); 
		Рез.Вставить("УровеньРиска", 							Выборка.fields("УровеньРиска").value); 
		Рез.Вставить("ДатаОформленияАнкеты", 					Выборка.fields("ДатаОформленияАнкеты").value); 
		Рез.Вставить("КодИсточникаИнформации", 					Выборка.fields("КодИсточникаИнформации").value); 
		Рез.Вставить("ФинансовоеПоложение", 					Выборка.fields("ФинансовоеПоложение").value);
		Рез.Вставить("Примечание", 								Выборка.fields("Примечание").value);
		Рез.Вставить("Информирование", 							Выборка.fields("Информирование").value);
		Рез.Вставить("ДопИнформирование", 						Выборка.fields("ДопИнформирование").value); 
		РассылкаСМС =                                           Выборка.fields("РассылкаСМС").value;
		Если РассылкаСМС = -1 Тогда
			Рез.Вставить("РассылкаСМС", 							Истина);
		Иначе
			Рез.Вставить("РассылкаСМС", 							Ложь);
		КонецЕсли;	
		
		Выборка.movenext();
	КонецЦикла; 
	
	
		
	
	
	Возврат Рез;	
КонецФункции     




Функция ВернутьДанныеАнкетыВсехКлиентов() Экспорт

	АдоСоединение = АдоНовоеСоединение("dCBDL");
	                           	
	ТекстЗапроса = "
	|SELECT KodClient 
	|,kodRekl КодИсточникаИнформации
	|,AnkFin ФинансовоеПоложение
	|,KodVid КатегорияФизЛица
	|,StRisk УровеньРиска
	|,Anksnils Снилс   
	|,Prim Примечание
	|,DopRekl ДопИнформирование 
	|,INN Информирование
	|,DAnket ДатаОформленияАнкеты
	|,AnkRep ДеловаяРепутация
	|,AnkIstD ИсточникПроисхожденияДенежныхСредств
	|,AnkIstM ИсточникПроисхожденияИмущества
	|,xSMS РассылкаСМС
	|FROM [dCBDL].[dbo].[aClient]";
	
	Выборка = АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса) ; 
	
	тз = новый ТаблицаЗначений;
	тз.Колонки.Добавить("КодКлиента");  
	тз.Колонки.Добавить("ИсточникПроисхожденияДенежныхСредств");
	тз.Колонки.Добавить("ИсточникПроисхожденияИмущества");
	тз.Колонки.Добавить("ДеловаяРепутация");
	тз.Колонки.Добавить("Снилс"); 
	тз.Колонки.Добавить("КатегорияФизЛица");  
	тз.Колонки.Добавить("УровеньРиска");
	тз.Колонки.Добавить("ДатаОформленияАнкеты");
	тз.Колонки.Добавить("КодИсточникаИнформации");
	тз.Колонки.Добавить("ФинансовоеПоложение");
	тз.Колонки.Добавить("Примечание");  
	тз.Колонки.Добавить("Информирование");
	тз.Колонки.Добавить("ДопИнформирование");
	тз.Колонки.Добавить("РассылкаСМС");   
	тз.Индексы.Добавить("КодКлиента"); 
	
	Пока не Выборка.eof() Цикл   
		стр = тз.Добавить();
		стр.КодКлиента = Формат(Выборка.fields("KodClient").value,"ЧГ=0") ;
		стр.ИсточникПроисхожденияДенежныхСредств = Выборка.fields("ИсточникПроисхожденияДенежныхСредств").value;
		стр.ИсточникПроисхожденияИмущества= 			Выборка.fields("ИсточникПроисхожденияИмущества").value; 
		стр.ДеловаяРепутация=						Выборка.fields("ДеловаяРепутация").value;    
		стр.Снилс= 									Выборка.fields("Снилс").value;
		стр.КатегорияФизЛица= 						Выборка.fields("КатегорияФизЛица").value; 
		стр.УровеньРиска= 							Выборка.fields("УровеньРиска").value; 
		стр.ДатаОформленияАнкеты=					Выборка.fields("ДатаОформленияАнкеты").value; 
		стр.КодИсточникаИнформации= 					Выборка.fields("КодИсточникаИнформации").value; 
		стр.ФинансовоеПоложение= 					Выборка.fields("ФинансовоеПоложение").value;
		стр.Примечание= 								Выборка.fields("Примечание").value;
		стр.Информирование= 							Выборка.fields("Информирование").value;
		стр.ДопИнформирование= 						Выборка.fields("ДопИнформирование").value; 
		РассылкаСМС =                                           Выборка.fields("РассылкаСМС").value;
		Если РассылкаСМС = -1 Тогда
			стр.РассылкаСМС= 							Истина;
		Иначе
			стр.РассылкаСМС=							Ложь;
		КонецЕсли;	
		
		Выборка.movenext();
	КонецЦикла; 

	Возврат тз;	
КонецФункции



Функция ВернутьТаблицуПервыхДатЗБ(КодКлиент = Неопределено) Экспорт 
	АдоСоединение = АдоНовоеСоединение("dCBDL"); 
	
	ТекстЗапроса = "select kodclient, MIN(DPri) DPri from [dCBDL_dan].[dbo].[azb] a group by kodclient";
	
	Выборка = АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса) ; 
	
	тз = Новый ТаблицаЗначений;
	тз.Колонки.Добавить("id_Клиента", Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	
	
	Пока не Выборка.eof() Цикл    
		НовСтр = тз.Добавить();
		//НовСтр.id_Клиента = СтрЗаменить(Выборка.fields("kodclient").value, Символы.НПП, ""); 
		НовСтр.id_Клиента = Выборка.fields("kodclient").value;
		
		НовСтр.Дата = Выборка.fields("DPri").value;
		
		Выборка.movenext();
	КонецЦикла;
	
	Возврат тз;	
КонецФункции


Функция ВернутьДоверенностиИзLX(id)  
	АдоСоединение = АдоНовоеСоединение("dCBDL");
	
	
	ТекстЗапроса = "
	|SELECT * FROM [dCBDL].[dbo].[aDovZB]
	|where NRecZB = " + СокрЛП(id); 
	
	Выборка = АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса) ;
	
	тз = Новый ТаблицаЗначений;
	тз.Колонки.Добавить("id_LX");
	тз.Колонки.Добавить("Номер");
	тз.Колонки.Добавить("Дата");
	тз.Колонки.Добавить("Статус");
	тз.Колонки.Добавить("ДатаНачала");
	тз.Колонки.Добавить("ДатаОкончания");
	тз.Колонки.Добавить("Тип");  
	тз.Колонки.Добавить("id_ломбарда");
	тз.Колонки.Добавить("id_представителя");
	тз.Колонки.Добавить("id_ДокПредставителя");
	
	
	Пока не Выборка.eof() Цикл 
		НовСтр = тз.Добавить();
		НовСтр.id_LX  			= СтрЗаменить(Выборка.fields("NRecDovZB").value, Символы.НПП, "");
		НовСтр.Номер  			= Выборка.fields("NomDov").value;
		НовСтр.Дата   			= Выборка.fields("Data").value;
		НовСтр.Статус  			= Выборка.fields("Stat").value;
		НовСтр.ДатаНачала  		= Выборка.fields("dBeg").value;
		НовСтр.ДатаОкончания 	= Выборка.fields("dEnd").value;  
		НовСтр.Тип  			= Выборка.fields("Tip").value; 
		НовСтр.id_ломбарда  	= СокрЛП(Выборка.fields("nObj").value);
		НовСтр.id_представителя = СтрЗаменить(Выборка.fields("KodClient").value, Символы.НПП, ""); 
		НовСтр.id_ДокПредставителя = Выборка.fields("NRecClientDoc").value;
		
		
		Выборка.movenext();
	КонецЦикла; 
	
	Возврат тз;
	
КонецФункции

Процедура СоздатьСоответствиеЗалогодателя(Залогодатель, id_LX, ДатаИзменения)
	//Запрос = Новый Запрос;
	//Запрос.Текст ="ВЫБРАТЬ
	//|	ЛБ_СоответствиеЗалогодателейLX.Залогодатель КАК Залогодатель,
	//|	ЛБ_СоответствиеЗалогодателейLX.id_LX КАК id_LX
	//|ИЗ
	//|	РегистрСведений.ЛБ_СоответствиеЗалогодателейLX КАК ЛБ_СоответствиеЗалогодателейLX
	//|ГДЕ
	//|	ЛБ_СоответствиеЗалогодателейLX.Залогодатель = &Залогодатель
	//|	И ЛБ_СоответствиеЗалогодателейLX.id_LX = &id_LX";
	//Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	//Запрос.УстановитьПараметр("id_LX", id_LX);
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
		
		НаборЗаписей = РегистрыСведений.ЛБ_СоответствиеЗалогодателейLX.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.Залогодатель.Установить(Залогодатель); 
		НаборЗаписей.Отбор.id_LX.Установить(id_LX); 		
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.Залогодатель = Залогодатель; 
		НоваяЗапись.id_LX = id_LX; 
		НоваяЗапись.ДатаИзменения = ДатаИзменения; 
		НаборЗаписей.Записать();    
	//Иначе   
	//	НаборЗаписей = РегистрыСведений.ЛБ_СоответствиеЗалогодателейLX.СоздатьНаборЗаписей(); 
	//	НаборЗаписей.Отбор.Залогодатель.Установить(Залогодатель); 
	//	НаборЗаписей.Отбор.id_LX.Установить(id_LX); 		
	//	НоваяЗапись = НаборЗаписей.Добавить(); 
	//	НоваяЗапись.Залогодатель = Залогодатель; 
	//	НоваяЗапись.id_LX = id_LX; 
	//	НоваяЗапись.ДатаИзменения = ДатаИзменения; 
	//	НаборЗаписей.Записать();   
	//КонецЕсли;	
КонецПроцедуры

Функция ПреобразоватьДатуРожденияИзБудущего(ДатаРождения)
	промДата = СокрЛП(ДатаРождения);
	День = День(ДатаРождения);
	Месяц = Месяц(ДатаРождения);
	Год = Год(ДатаРождения);
	
	Если Сред(промДата, 7, 1) = "2" Тогда 
		ГодСтр = Год - 1000;
	ИначеЕсли Сред(промДата, 7, 1) = "3" Тогда 
		ГодСтр = Год - 2000;
	ИначеЕсли Сред(промДата, 7, 1) = "4" Тогда 
		ГодСтр = Год - 3000;
	ИначеЕсли Сред(промДата, 7, 1) = "5" Тогда 
		ГодСтр = Год - 4000;
	ИначеЕсли Сред(промДата, 7, 1) = "6" Тогда 
		ГодСтр = Год - 5000;
	ИначеЕсли Сред(промДата, 7, 1) = "7" Тогда 
		ГодСтр = Год - 6000;
	ИначеЕсли Сред(промДата, 7, 1) = "8" Тогда 
		ГодСтр = Год - 6000;
	ИначеЕсли Сред(промДата, 7, 1) = "9" Тогда 
		ГодСтр = Год - 6000;
	КонецЕсли; 
	
	Возврат Дата(ГодСтр, Месяц, День);	
КонецФункции

Функция ВернутьРеквизитыПокупателяРеализацииИзLX(АдоСоединение, тзСтран, СтрокаОтбора="", НеГрузитьАдреса) Экспорт
	Перем Результат ;  	
	
	СтрокаОтбораВЗапросе = "" ;
	Если ПустаяСтрока(СтрокаОтбора) = 0 Тогда
		СтрокаОтбораВЗапросе = "WHERE "+СтрокаОтбора;
	КонецЕсли; 
	
	
	ТекстЗапроса = "SELECT
	|		KodClient id_LX,
	|		Danket ДатаИзменения,
	|		Name Имя,
	|		Patr Отчество,
	|		Fam Фамилия,
	//|		clienCitizenship Гражданство,
	|		KodStrana ГражданствоКод,
	|		xSex Пол,
	|		DataR ДатаРождения,
	|		BirthPlace МестоРождения,
	|		TelMob Телефон,
	|		Tel ТелефонДополнительный,
	|		Email Емейл,
	|		Adres АдресПоПрописке,
	|		AdresFact ФактическийАдрес,
	|		AdresPost ПочтовыйАдрес, 
	|		dMort ДатаСмерти, 
	|		IPRegDoc   ДатаВыдачиСвидСм,
	|		IPRegOrgan НомерСвидСм,
	//|		IPContact  СерияСвидСм,
	|		nobj Ломбард
	|	
	|	FROM
	//|		[dCBDL].[dbo].[aclient] 
	|		[dCBDL_dan].[dbo].[aClientP]
	|	"+СтрокаОтбораВЗапросе+"
	|	";  	
	
	Выборка = АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса) ;
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("id_LX"); 
	ТЗ.Колонки.Добавить("ДатаИзменения");
	ТЗ.Колонки.Добавить("Имя"     , Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("Фамилия" , Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("Отчество", Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("Гражданство");  
	ТЗ.Колонки.Добавить("МестоРожденияСтрана", Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("МестоРожденияСтрана1");
	ТЗ.Колонки.Добавить("ГражданствоКод");
	ТЗ.Колонки.Добавить("Пол");
	ТЗ.Колонки.Добавить("ДатаРождения");
	ТЗ.Колонки.Добавить("МестоРождения");
	ТЗ.Колонки.Добавить("Телефон");
	ТЗ.Колонки.Добавить("ТелефонДополнительный");
	ТЗ.Колонки.Добавить("Емейл");
	ТЗ.Колонки.Добавить("АдресПоПрописке"); 
	ТЗ.Колонки.Добавить("АдресПоПропискеLX");
	ТЗ.Колонки.Добавить("АдресПоПропискеСтруктура");
	ТЗ.Колонки.Добавить("АдресПоПропискеВручную"); 
	ТЗ.Колонки.Добавить("ФактическийАдрес");  
	ТЗ.Колонки.Добавить("ФактическийАдресLX"); 
	ТЗ.Колонки.Добавить("ФактическийАдресСтруктура"); 
	ТЗ.Колонки.Добавить("ФактическийАдресВручную");
	ТЗ.Колонки.Добавить("ПочтовыйАдрес");
	ТЗ.Колонки.Добавить("ПочтовыйАдресLX");
	ТЗ.Колонки.Добавить("ПочтовыйАдресСтруктура");
	ТЗ.Колонки.Добавить("ПочтовыйАдресВручную");
	ТЗ.Колонки.Добавить("Ломбард");
	ТЗ.Колонки.Добавить("ДатаСмерти");
	ТЗ.Колонки.Добавить("ДатаВыдачиСвидСм");
	ТЗ.Колонки.Добавить("НомерСвидСм");
	//ТЗ.Колонки.Добавить("СерияСвидСм");
	
	//тзСтран = ВернутьТЗСтран();
	
	ном = 0;
	Пока не Выборка.eof() Цикл 
		ном = ном + 1;
		Если ном =500 тогда
			прервать;
		КонецЕсли;
		
		СтрокаТЗ = ТЗ.Добавить();
		СтрокаТЗ.id_LX = Формат(Выборка.fields("id_LX").value,"ЧГ=0");  
		СтрокаТЗ.ДатаИзменения = Выборка.fields("ДатаИзменения").value; 
		
		//СтрокаТЗ.Гражданство = НайтиСтрануМира(Выборка.fields("ГражданствоКод").value,Выборка.fields("Гражданство").value);  
		
		СтрокаТЗ.МестоРожденияСтрана1 = НайтиСтрануМиравТЗ(тзСтран, Выборка.fields("ГражданствоКод").value,"");
		СтрокаТЗ.Гражданство        = СтрокаТЗ.МестоРожденияСтрана1;
		
		СтрокаТЗ.Фамилия 			= СокрЛП(Выборка.fields("Фамилия").value);
		СтрокаТЗ.Имя 				= СокрЛП(Выборка.fields("Имя").value);
		СтрокаТЗ.Отчество 			= СокрЛП(Выборка.fields("Отчество").value);
		ДатаРождения = Выборка.fields("ДатаРождения").value;
		Если НЕ ЗначениеЗаполнено(ДатаРождения) Тогда
			Возврат Неопределено;
		КонецЕсли;
		Если ДатаРождения > ТекущаяДата() Тогда
			ДатаРождения = ПреобразоватьДатуРожденияИзБудущего(ДатаРождения);			
		КонецЕсли;
		
		СтрокаТЗ.ДатаРождения 		= ДатаРождения;
		СтрокаТЗ.МестоРождения 		= Выборка.fields("МестоРождения").value;
		СтрокаТЗ.Телефон	 		= ПривестиТелефонКМаске(Выборка.fields("Телефон").value);
		
		СтрокаТЗ.ТелефонДополнительный = ПривестиТелефонКМаске(Выборка.fields("ТелефонДополнительный").value);
		
		СтрокаТЗ.Пол 				= ?(СокрЛП(Выборка.fields("Пол").value)="0", Перечисления.ПолФизическогоЛица.Женский, Перечисления.ПолФизическогоЛица.Мужской);
		СтрокаТЗ.Емейл 				= Выборка.fields("Емейл").value;  	
		
		Если НЕ НеГрузитьАдреса Тогда 
			
			СтруктураРучногоАдреса = "<Адрес СтранаКод="""" НаселенныйПункт="""" Индекс="""" Область="""" Район="""" Улица="""" Дом="""" Корпус="""" Квартира=""""/>";
			
			АдресПоПрописке = Выборка.fields("АдресПоПрописке").value;
 
			СтрокаТЗ.АдресПоПрописке  	= АдресПоПрописке;
			СтрокаТЗ.АдресПоПропискеВручную = Истина;
			СтрокаТЗ.АдресПоПропискеСтруктура = "";			
			
			ФактическийАдрес = Выборка.fields("ФактическийАдрес").value;  
			СтрокаТЗ.ФактическийАдрес  	= ФактическийАдрес;
			СтрокаТЗ.ФактическийАдресВручную = Истина; 
			СтрокаТЗ.ФактическийАдресСтруктура = "";	
			
			ПочтовыйАдрес = Выборка.fields("ПочтовыйАдрес").value;
			СтрокаТЗ.ПочтовыйАдрес  	= ПочтовыйАдрес; 
			СтрокаТЗ.ПочтовыйАдресВручную = Истина; 
			СтрокаТЗ.ПочтовыйАдресСтруктура = "";
				
		КонецЕсли;
		
		СтрокаТЗ.Ломбард 			= Выборка.fields("Ломбард").value;  
		
		//СтрокаТЗ.ДатаСмерти         = Выборка.fields("ДатаСмерти").value;  
		//СтрокаТЗ.ДатаВыдачиСвидСм   = СтроковыеФункцииКлиентСервер.СтрокаВДату(Выборка.fields("ДатаВыдачиСвидСм").value); 
		//СтрокаТЗ.НомерСвидСм        = Выборка.fields("НомерСвидСм").value; 
		//СтрокаТЗ.СерияСвидСм        = Выборка.fields("СерияСвидСм").value;  
		Выборка.movenext();
	КонецЦикла;
	
	Если ТЗ.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат ТЗ;
	КонецЕсли; 
	
КонецФункции


Функция ВернутьРеквизитыКлиентаИзLX(АдоСоединение, тзСтран, СтрокаОтбора="", НеГрузитьАдреса) Экспорт
	Перем Результат ;  	
	
	СтрокаОтбораВЗапросе = "" ;
	Если ПустаяСтрока(СтрокаОтбора) = 0 Тогда
		СтрокаОтбораВЗапросе = "WHERE "+СтрокаОтбора;
	КонецЕсли; 
	
	
	ТекстЗапроса = "SELECT
	|		KodClient id_LX,
	|		Dizm ДатаИзменения,
	|		Name Имя,
	|		Patr Отчество,
	|		Fam Фамилия,
	//|		clienCitizenship Гражданство,
	|		KodStrana ГражданствоКод,
	|		xSex Пол,
	|		DataR ДатаРождения,
	|		BirthPlace МестоРождения,
	|		TelMob Телефон,
	|		Tel ТелефонДополнительный,
	|		Email Емейл,
	|		Adres АдресПоПрописке,
	|		AdresFact ФактическийАдрес,
	|		AdresPost ПочтовыйАдрес, 
	|		dMort ДатаСмерти, 
	|		IPRegDoc   ДатаВыдачиСвидСм,
	|		IPRegOrgan НомерСвидСм,
	//|		IPContact  СерияСвидСм,
	|		nobj Ломбард
	|	
	|	FROM
	//|		[dCBDL].[dbo].[aclient] 
	|		[dcbdl_uni].[dbo].[aclient]
	|	"+СтрокаОтбораВЗапросе+"
	|	";  	
	
	Выборка = АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса) ;
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("id_LX"); 
	ТЗ.Колонки.Добавить("ДатаИзменения");
	ТЗ.Колонки.Добавить("Имя"     , Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("Фамилия" , Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("Отчество", Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("Гражданство");  
	ТЗ.Колонки.Добавить("МестоРожденияСтрана", Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("МестоРожденияСтрана1");
	ТЗ.Колонки.Добавить("ГражданствоКод");
	ТЗ.Колонки.Добавить("Пол");
	ТЗ.Колонки.Добавить("ДатаРождения");
	ТЗ.Колонки.Добавить("МестоРождения");
	ТЗ.Колонки.Добавить("Телефон");
	ТЗ.Колонки.Добавить("ТелефонДополнительный");
	ТЗ.Колонки.Добавить("Емейл");
	ТЗ.Колонки.Добавить("АдресПоПрописке"); 
	ТЗ.Колонки.Добавить("АдресПоПропискеLX");
	ТЗ.Колонки.Добавить("АдресПоПропискеСтруктура");
	ТЗ.Колонки.Добавить("АдресПоПропискеВручную"); 
	ТЗ.Колонки.Добавить("ФактическийАдрес");  
	ТЗ.Колонки.Добавить("ФактическийАдресLX"); 
	ТЗ.Колонки.Добавить("ФактическийАдресСтруктура"); 
	ТЗ.Колонки.Добавить("ФактическийАдресВручную");
	ТЗ.Колонки.Добавить("ПочтовыйАдрес");
	ТЗ.Колонки.Добавить("ПочтовыйАдресLX");
	ТЗ.Колонки.Добавить("ПочтовыйАдресСтруктура");
	ТЗ.Колонки.Добавить("ПочтовыйАдресВручную");
	ТЗ.Колонки.Добавить("Ломбард");
	ТЗ.Колонки.Добавить("ДатаСмерти");
	ТЗ.Колонки.Добавить("ДатаВыдачиСвидСм");
	ТЗ.Колонки.Добавить("НомерСвидСм");
	//ТЗ.Колонки.Добавить("СерияСвидСм");
	
	//тзСтран = ВернутьТЗСтран();
	
	ном = 0;
	Пока не Выборка.eof() Цикл 
		ном = ном + 1;
		Если ном =500 тогда
			прервать;
		КонецЕсли;
		
		СтрокаТЗ = ТЗ.Добавить();
		СтрокаТЗ.id_LX = Формат(Выборка.fields("id_LX").value,"ЧГ=0");  
		СтрокаТЗ.ДатаИзменения = Выборка.fields("ДатаИзменения").value; 
		
		//СтрокаТЗ.Гражданство = НайтиСтрануМира(Выборка.fields("ГражданствоКод").value,Выборка.fields("Гражданство").value);  
		
		СтрокаТЗ.МестоРожденияСтрана1 = НайтиСтрануМиравТЗ(тзСтран, Выборка.fields("ГражданствоКод").value,"");
		СтрокаТЗ.Гражданство        = СтрокаТЗ.МестоРожденияСтрана1;
		
		СтрокаТЗ.Фамилия 			= СокрЛП(Выборка.fields("Фамилия").value);
		СтрокаТЗ.Имя 				= СокрЛП(Выборка.fields("Имя").value);
		СтрокаТЗ.Отчество 			= СокрЛП(Выборка.fields("Отчество").value);
		ДатаРождения = Выборка.fields("ДатаРождения").value;
		Если НЕ ЗначениеЗаполнено(ДатаРождения) Тогда
			Возврат Неопределено;
		КонецЕсли;
		Если ДатаРождения > ТекущаяДата() Тогда
			ДатаРождения = ПреобразоватьДатуРожденияИзБудущего(ДатаРождения);			
		КонецЕсли;
		
		СтрокаТЗ.ДатаРождения 		= ДатаРождения;
		СтрокаТЗ.МестоРождения 		= Выборка.fields("МестоРождения").value;
		//		СтрокаТЗ.Нерезидент 		= ?(Выборка.fields("Резидент").value=0,Истина,Ложь);
		//СтрокаТЗ.Телефон 			= Выборка.fields("Телефон").value; 
		СтрокаТЗ.Телефон	 		= ПривестиТелефонКМаске(Выборка.fields("Телефон").value);
		
		СтрокаТЗ.ТелефонДополнительный = ПривестиТелефонКМаске(Выборка.fields("ТелефонДополнительный").value);
		
		СтрокаТЗ.Пол 				= ?(СокрЛП(Выборка.fields("Пол").value)="0", Перечисления.ПолФизическогоЛица.Женский, Перечисления.ПолФизическогоЛица.Мужской);
		СтрокаТЗ.Емейл 				= Выборка.fields("Емейл").value;  	
		
		Если НЕ НеГрузитьАдреса Тогда 
			
			СтруктураРучногоАдреса = "<Адрес СтранаКод="""" НаселенныйПункт="""" Индекс="""" Область="""" Район="""" Улица="""" Дом="""" Корпус="""" Квартира=""""/>";
			
			АдресПоПрописке = Выборка.fields("АдресПоПрописке").value;
			//СтрокаТЗ.АдресПоПропискеLX  = АдресПоПрописке;
			//АдресПоПрописке = СтрЗаменить(АдресПоПрописке, "кв.", "квартира "); 
			//АдресПоПрописке = СтрЗаменить(АдресПоПрописке, "дом №", "дом № "); 
			//АдресПоПропискеСтруктура = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияПоПредставлению(АдресПоПрописке, Перечисления.ТипыКонтактнойИнформации.Адрес,Истина);
			//СтрокаТЗ.АдресПоПропискеСтруктура = УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(АдресПоПропискеСтруктура); 
			//СтрокаТЗ.АдресПоПрописке  	= АдресПоПропискеСтруктура.value;
			//Если ЗначениеЗаполнено(АдресПоПропискеСтруктура.comment) Тогда
			//	МенеджерЗаписи = РегистрыСведений.ЛБ_ОшибкиИнтеграции.СоздатьМенеджерЗаписи(); 
			//	МенеджерЗаписи.ДатаЗагрузки = ТекущаяДата(); 
			//	МенеджерЗаписи.Ошибка       = "Адрес по прописке: "+СокрЛП(АдресПоПрописке)+", ошибка: "+СокрЛП(АдресПоПропискеСтруктура.comment); 
			//	МенеджерЗаписи.Залогодатель = СокрЛП(СтрокаТЗ.Фамилия) +" "+ СокрЛП(СтрокаТЗ.Имя) +" "+ СокрЛП(СтрокаТЗ.Отчество); 
			//	МенеджерЗаписи.Записать(); 
			СтрокаТЗ.АдресПоПрописке  	= АдресПоПрописке;
			СтрокаТЗ.АдресПоПропискеВручную = Истина;
			СтрокаТЗ.АдресПоПропискеСтруктура = "";			
			//КонецЕсли;
			
			ФактическийАдрес = Выборка.fields("ФактическийАдрес").value;  
			//СтрокаТЗ.ФактическийАдресLX  = ФактическийАдрес; 	
			//ФактическийАдрес = СтрЗаменить(ФактическийАдрес, "кв.", "квартира ");
			//ФактическийАдрес = СтрЗаменить(ФактическийАдрес, "дом №", "дом № ");
			//ФактическийАдресСтруктура = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияПоПредставлению(ФактическийАдрес, Перечисления.ТипыКонтактнойИнформации.Адрес,Истина);
			//СтрокаТЗ.ФактическийАдресСтруктура = УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(ФактическийАдресСтруктура);  
			//СтрокаТЗ.ФактическийАдрес  	= ФактическийАдресСтруктура.value;
			//Если ЗначениеЗаполнено(ФактическийАдресСтруктура.comment) Тогда		
			//	МенеджерЗаписи = РегистрыСведений.ЛБ_ОшибкиИнтеграции.СоздатьМенеджерЗаписи(); 
			//	МенеджерЗаписи.ДатаЗагрузки = ТекущаяДата(); 
			//	МенеджерЗаписи.Ошибка       = "Фактический адрес: "+СокрЛП(ФактическийАдрес)+", ошибка: "+СокрЛП(ФактическийАдресСтруктура.comment); 
			//	МенеджерЗаписи.Залогодатель = СокрЛП(СтрокаТЗ.Фамилия) +" "+ СокрЛП(СтрокаТЗ.Имя) +" "+ СокрЛП(СтрокаТЗ.Отчество); 
			//	МенеджерЗаписи.Записать(); 
			СтрокаТЗ.ФактическийАдрес  	= ФактическийАдрес;
			СтрокаТЗ.ФактическийАдресВручную = Истина; 
			СтрокаТЗ.ФактическийАдресСтруктура = "";	
			//КонецЕсли;
			
			ПочтовыйАдрес = Выборка.fields("ПочтовыйАдрес").value;
			//СтрокаТЗ.ПочтовыйАдресLX  	= ПочтовыйАдрес; 
			//ПочтовыйАдрес = СтрЗаменить(ПочтовыйАдрес, "кв.", "квартира "); 
			//ПочтовыйАдрес = СтрЗаменить(ПочтовыйАдрес, "дом №", "дом № ");
			//ПочтовыйАдресСтруктура = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияПоПредставлению(ПочтовыйАдрес, Перечисления.ТипыКонтактнойИнформации.Адрес,Истина);
			//СтрокаТЗ.ПочтовыйАдресСтруктура = УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(ПочтовыйАдресСтруктура);  
			//СтрокаТЗ.ПочтовыйАдрес  	= ПочтовыйАдресСтруктура.value;
			//Если ЗначениеЗаполнено(ПочтовыйАдресСтруктура.comment) Тогда
			//	МенеджерЗаписи = РегистрыСведений.ЛБ_ОшибкиИнтеграции.СоздатьМенеджерЗаписи(); 
			//	МенеджерЗаписи.ДатаЗагрузки = ТекущаяДата(); 
			//	МенеджерЗаписи.Ошибка       = "Почтовый адрес: "+СокрЛП(ПочтовыйАдрес)+", ошибка: "+СокрЛП(ПочтовыйАдресСтруктура.comment);
			//	МенеджерЗаписи.Залогодатель = СокрЛП(СтрокаТЗ.Фамилия) +" "+ СокрЛП(СтрокаТЗ.Имя) +" "+ СокрЛП(СтрокаТЗ.Отчество); 
			//	МенеджерЗаписи.Записать();
			СтрокаТЗ.ПочтовыйАдрес  	= ПочтовыйАдрес; 
			СтрокаТЗ.ПочтовыйАдресВручную = Истина; 
			СтрокаТЗ.ПочтовыйАдресСтруктура = "";
			//КонецЕсли;
			
		КонецЕсли;
		
		СтрокаТЗ.Ломбард 			= Выборка.fields("Ломбард").value;  
		
		СтрокаТЗ.ДатаСмерти         = Выборка.fields("ДатаСмерти").value;  
		СтрокаТЗ.ДатаВыдачиСвидСм   = СтроковыеФункцииКлиентСервер.СтрокаВДату(Выборка.fields("ДатаВыдачиСвидСм").value); 
		СтрокаТЗ.НомерСвидСм        = Выборка.fields("НомерСвидСм").value; 
		//СтрокаТЗ.СерияСвидСм        = Выборка.fields("СерияСвидСм").value;  
		Выборка.movenext();
	КонецЦикла;
	
	Если ТЗ.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат ТЗ;
	КонецЕсли; 
	
КонецФункции



Функция ПривестиТелефонКМаске(НомерТелефона) 
	НовТел = НомерТелефона;
	Если стрДлина(НомерТелефона) = 10 И Лев(НомерТелефона,1) = "9" Тогда
		НовТел = "+7 (" + Лев(НомерТелефона,3) + ") "+Прав(НомерТелефона, 7);
	КОнецЕсли;
	Возврат НовТел;
КонецФункции


Процедура ЗаполнитьРеквизитыЛомбардов() Экспорт
	Выборка = Справочники.ЛБ_Ломбарды.Выбрать();
	Пока Выборка.Следующий() Цикл 
		Если ЗначениеЗаполнено(Выборка.id_LX) Тогда
			
			РеквизитыЛомбардаИзLX = ВернутьРеквизитыЛомбардаИзLX(Выборка.id_LX);  
			Об = Выборка.Ссылка.ПолучитьОбъект();
			Об.НомерЛомбарда 		= РеквизитыЛомбардаИзLX.Номер; 
			Об.Записать();  
			
			Данные = Выборка.Ссылка.ПолучитьОбъект();		
			БылоСтрок = Данные.КонтактнаяИнформация.Количество(); 
			
			Для Счетчик =1 по Данные.КонтактнаяИнформация.Количество() Цикл 			
				НомерСтроки= БылоСтрок-Счетчик;  	
				
				лСтр = Данные.КонтактнаяИнформация[НомерСтроки]; 
				Если лСтр.ТИп = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда				
					Данные.КонтактнаяИнформация.Удалить(НомерСтроки);  			
				КонецЕсли; 		
			КонецЦикла;	
			Данные.Записать();
			
			стрАдр = СокрЛП(РеквизитыЛомбардаИзLX.NMGOROD) + ","+ СокрЛП(РеквизитыЛомбардаИзLX.Adres);
			ФактическийАдресСтруктура = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияПоПредставлению(стрАдр, Перечисления.ТипыКонтактнойИнформации.Адрес,Истина);
			ФактическийАдресСтруктура2 = УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(ФактическийАдресСтруктура);  
			
			Если ЗначениеЗаполнено(ФактическийАдресСтруктура.comment) Тогда
				Сообщить(СокрЛП(Выборка.Ссылка)+". Ошибка: "+СокрЛП(ФактическийАдресСтруктура.comment));  
				//УправлениеКонтактнойИнформацией.УстановитьКонтактнуюИнформациюОбъекта(Выборка.Ссылка);		
				
				
			Иначе 			
				УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(Выборка.Ссылка, ФактическийАдресСтруктура2, Справочники.ВидыКонтактнойИнформации.ФактАдресЛомбарда, ТекущаяДата(), Ложь);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	
КонецПроцедуры


Функция ВернутьОбъектЗалога(id_LX)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_ОбъектыЗалога.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЛБ_ОбъектыЗалога КАК ЛБ_ОбъектыЗалога
	|ГДЕ
	|	ЛБ_ОбъектыЗалога.id_LX = &id_LX"; 
	Запрос.УстановитьПараметр("id_LX", id_LX);
	Рез = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Рез = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Рез; 
КонецФункции

Функция ВернутьОперациюПоЗалогуПо_id(id_LX, ВидОперации)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_ОперацияПоЗалогу.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЛБ_ОперацияПоЗалогу КАК ЛБ_ОперацияПоЗалогу
	|ГДЕ
	|	ЛБ_ОперацияПоЗалогу.id_LX = &id_LX
	|	И ЛБ_ОперацияПоЗалогу.ВидОперации = &ВидОперации";
	Запрос.УстановитьПараметр("id_LX", id_LX);
	Запрос.УстановитьПараметр("ВидОперации", ВидОперации);
	
	Рез = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Рез = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Рез;	
	
КонецФункции 

Функция ПрочитатьCSV(Папка, ИмяФайла, КолПолей) Экспорт
	// Параметры:
	
	// "Папка" - путь к файлу без имени файла с завершающим слешем,
	
	// "ИмяФайла" - имя файла,
	
	// "КолПолей" - количество колонок (число).
	
	Текст = "[" + ИмяФайла + "]
	|ColNameHeader=False
	|Format=TabDelimited
	|TextDelimiter ="+Символы.Таб +"
	|CharacterSet=ANSI
	|";
	
	Для ы = 1 По КолПолей Цикл
		Текст = Текст + "Col" + ы + "=Field" + ы + " Text" + Символы.ПС;
	КонецЦикла;
	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.УстановитьТекст(Текст);
	ТекстДок.Записать(Папка + "Schema.ini");
	objRec = Новый COMОбъект("ADODB.Recordset");
	strQuery = "SELECT * FROM [" + ИмяФайла + "]"; // плюс прописать фильтр на поля, используя where
	strConn = "Provider=Microsoft.Jet.OLEDB.4.0;Data Source=" + Папка + ";Extended Properties=""text;""";
	adOpenStatic = 3;
	adLockOptimistic = 3;
	adCmdText = 1;
	ТаблЗнач = Новый ТаблицаЗначений;
	Для ы = 1 По КолПолей Цикл
		ТаблЗнач.Колонки.Добавить();
	КонецЦикла;
	objRec.Open(strQuery, strConn, adOpenStatic, adLockOptimistic, adCmdText);
	КолСтрок = objRec.RecordCount;
	Ном = 1;
	Пока Не objRec.EOF Цикл
		Если Ном % 500 = 0 Тогда
			//Состояние(ИмяФайла + " " + Ном + " из " + КолСтрок);
		КонецЕсли;
		НовСтр = ТаблЗнач.Добавить();
		Для i=0 По objRec.Fields.Count-1 Цикл
			НовСтр[i] = Строка(objRec.Fields(i).Value);
		КонецЦикла;
		objRec.MoveNext();
		Ном = Ном + 1;
	КонецЦикла;
	objRec.Close();
	Возврат ТаблЗнач;
	
КонецФункции

Процедура ЗаполнитьРегистрПеречень639ИзLX() Экспорт
	
	Расшифровки = Новый Соответствие;
	Расшифровки.Вставить("07", "для совершения операции не представлены документы, необходимые для фиксирования информации в соответствии с положениями Федерального закона № 115-ФЗ");
	Расшифровки.Вставить("08", "в результате реализации ПВК по ПОД/ФТ у работников организации возникли подозрения, что операция совершается в целях легализации (отмывания) доходов, полученных преступным путем");
	Расшифровки.Вставить("80", "в результате реализации ПВК по ПОД/ФТ у работников организации возникли подозрения, что операция совершается в целях финансирования терроризм");
	
	
	АдоСоединение = АдоНовоеСоединение("dCBDL");
	
	ТекстЗапроса = "select * from ssBL639";		
	
	Выборка = АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса);
	
	тз = Новый ТаблицаЗначений;
	тз.Колонки.Добавить("id_записи", 		Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("ФИО", 				Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("ДатаРождения", 	Новый ОписаниеТипов("Дата"));
	тз.Колонки.Добавить("КодКлиента", 		Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("Фамилия", 			Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("Имя", 				Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("Отчество", 		Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("КодДокумента", 	Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("СерияДокумента", 	Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("НомерДокумента", 	Новый ОписаниеТипов("Строка")); 
	тз.Колонки.Добавить("ДатаДокумента", 	Новый ОписаниеТипов("Дата"));
	тз.Колонки.Добавить("ДокументКемВыдан", Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("ДатаФиксации", 	Новый ОписаниеТипов("Дата"));
	тз.Колонки.Добавить("ДатаКонтакт", 		Новый ОписаниеТипов("Дата")); 
	тз.Колонки.Добавить("dFix", 			Новый ОписаниеТипов("Дата"));
	тз.Колонки.Добавить("КодОтказа", 		Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("РасшифровкаКодаОтказа", 		Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("ДатаОтказа", 		Новый ОписаниеТипов("Дата"));
	тз.Колонки.Добавить("DFile", 			Новый ОписаниеТипов("Дата"));
	тз.Колонки.Добавить("НомерЗаписи", 		Новый ОписаниеТипов("Строка"));
	
	Пока не Выборка.eof() Цикл
		НовСтр = тз.Добавить();
		НовСтр.id_записи 		= СтрЗаменить(Выборка.fields("nRecBL639").value, Символы.НПП, "");
		НовСтр.ФИО         		= Выборка.fields("FIOf369").value; 
		НовСтр.ДатаРождения     = Выборка.fields("DataR").value; 
		НовСтр.КодКлиента     	= СтрЗаменить(Выборка.fields("KodClient639").value, Символы.НПП, "");
		НовСтр.Фамилия     		= Выборка.fields("Fam").value;
		НовСтр.Имя     			= Выборка.fields("Name").value;
		НовСтр.Отчество     	= Выборка.fields("Patr").value;
		НовСтр.КодДокумента     = Выборка.fields("Kod1C").value;
		НовСтр.СерияДокумента   = Выборка.fields("SDoc").value;
		НовСтр.НомерДокумента   = Выборка.fields("NDoc").value; 
		НовСтр.ДатаДокумента   	= Выборка.fields("DDoc").value;
		НовСтр.ДокументКемВыдан = Выборка.fields("WDoc").value;
		НовСтр.ДатаФиксации   	= Выборка.fields("DFix").value;
		НовСтр.ДатаКонтакт   	= Выборка.fields("DKontakt").value; 
		
		НовСтр.dFix   			= Выборка.fields("dFix").value; 
		НовСтр.КодОтказа   		= Выборка.fields("KODBL639").value;  
		НовСтр.ДатаОтказа   	= Выборка.fields("DBL639").value;
		НовСтр.DFile   			= Выборка.fields("DFile").value;
		НовСтр.НомерЗаписи   	= Выборка.fields("NomZap").value;
		НовСтр.РасшифровкаКодаОтказа = Расшифровки.Получить(НовСтр.КодОтказа);
		
		Выборка.movenext();
	КонецЦикла;
	АдоСоединение.Close(); 
	
	
	РегистрСвед = РегистрыСведений.ЛБ_Перечень639;
	Набор = РегистрСвед.СоздатьНаборЗаписей();
	Набор.Загрузить(тз);
	Набор.Записать();
	
КонецПроцедуры

Процедура АвтоматическаяЗагрузкаИзLX() Экспорт 
	Если НЕ ЛБ_ОбщийМодуль.ЭтоРабочаяБаза() Тогда
		Возврат;
	КонецЕсли;

	
	тз = Новый ТаблицаЗначений;
	тз.Колонки.Добавить("NRecReportTransfer"); 
	тз.Колонки.Добавить("NRecDoc");
	тз.Колонки.Добавить("DDoc");
	тз.Колонки.Добавить("TDoc");
	тз.Колонки.Добавить("DateTransfer");
	тз.Колонки.Добавить("StatTransfer");
	тз.Колонки.Добавить("WLast");
	тз.Колонки.Добавить("PK");
	тз.Колонки.Добавить("Nomer");
	тз.Колонки.Добавить("NRecZB");
	тз.Колонки.Добавить("Plat");
	
	ДатаЗагрузки = "01.04.2020";
	
	
	ТекстSQL  = "select top 500 * FROM ReportTransfer1c WHERE (DateTransfer IS NULL) and TDoc = 'Выдача' and Ddoc >= '"+ДатаЗагрузки+"' order by Ddoc";	//Таблица в базе dCBDL
	
	АдоСоединение = АдоНовоеСоединение("dCBDL");	
	
	rs = АдоВыполнитьЗапрос(АдоСоединение, ТекстSQL);
	
	
	имя0 = rs.Fields(0);
	имя1 = rs.Fields(1);
	имя2 = rs.Fields(2);
	имя3 = rs.Fields(3);
	имя4 = rs.Fields(4);
	имя5 = rs.Fields(5);
	имя6 = rs.Fields(6);
	имя7 = rs.Fields(7);
	имя8 = rs.Fields(8);
	имя9 = rs.Fields(9);
	имя10 = rs.Fields(10);
	
	
	Если не rs.eof() тогда  
		rs.MoveFirst();  
		пока не rs.eof() цикл    			
			
			НоваяСтрока           = ТЗ.Добавить();
			НоваяСтрока.NRecReportTransfer 	= имя0.value;
			НоваяСтрока.NRecDoc 			= имя1.value;
			НоваяСтрока.DDoc 				= имя2.value;
			НоваяСтрока.TDoc 				= имя3.value;
			НоваяСтрока.DateTransfer 		= имя4.value;
			НоваяСтрока.StatTransfer 		= имя5.value;
			НоваяСтрока.WLast 				= имя6.value;
			НоваяСтрока.PK 					= имя7.value;
			НоваяСтрока.Nomer 				= имя8.value;
			НоваяСтрока.NRecZB 				= имя9.value;
			НоваяСтрока.Plat 				= имя10.value;
			
			
			rs.movenext();
			
		КонецЦикла;	
	Конецесли;
	
	
	Подключение ="Provider=SQLOLEDB.1;data PROVIDER=SQLOLEDB.1;PASSWORD=123456;PERSIST SECURITY INFO=TRUE;USER ID=elix;INITIAL CATALOG=dlink;DATA SOURCE=192.168.0.244";	
	
	СоединениеSQL = Новый COMObject("ADODB.Connection");
	СоединениеSQL.ConnectionString = Подключение;
	СоединениеSQL.Open();
	СоединениеSQL.commandTimeout=600;
	ЗаписиSQL = Новый COMObject("ADODB.Recordset");
	ЗаписиSQL.CursorLocation = 3;
	
	Если тз.Количество() > 0 Тогда
		тзПервыхДатЗБ = ВернутьТаблицуПервыхДатЗБ();
	КонецЕсли;
	
	НачалоТекДня = НачалоДня(ТекущаяДата());
	
	Для каждого стр из тз Цикл     		
		Если СокрЛП(стр.TDoc) = "Выдача" Тогда
			Если СокрЛП(стр.StatTransfer) = "2" Тогда
				//НайдДок = НайтиДокументПоИдентификатору("АКСЛМБВыдачаЗайма", стр.NRecDoc);
				//
				//Если НайдДок <> Неопределено Тогда
				//	obj = НайдДок.ПолучитьОбъект();
				//	obj.УстановитьПометкуУдаления(Истина);
				//	
				//	НайдПКО = ВернутьРКО(НайдДок);
				//	Если НайдПКО <> Неопределено Тогда
				//		об = НайдПКО.ПолучитьОбъект();
				//		об.УстановитьПометкуУдаления(Истина);
				//	КонецЕсли; 							
				//				
				//	ПервыйИдентификаторСтр = СтрЗаменить(стр.NRecDoc, Символы.НПП, "");
				//	СделатьАпдейт(ПервыйИдентификаторСтр); 
				//КонецЕсли;     
			Иначе     
				
				
				
				ФильтрИдентификаторСтр = СтрЗаменить(стр.NRecDoc, Символы.НПП, "");
				
				
				Парамс = Новый Структура;
				
				Дат = СтроковыеФункцииКлиентСервер.СтрокаВДату(стр.DDoc); 
				
				Парамс.Вставить("ИдентификаторЗаписи", ФильтрИдентификаторСтр);
				Парамс.Вставить("НачДата",         Формат(Дат,"ДФ=dd.MM.yyyy"));
				Парамс.Вставить("КонДата",         Формат(Дат,"ДФ=dd.MM.yyyy"));
				Парамс.Вставить("ТолькоКлиенты",   Ложь);
				Парамс.Вставить("НеГрузитьАдреса", Истина); 
				Парамс.Вставить("ПерезаписыватьКлиентов", Истина); 				
				Парамс.Вставить("Ломбард", "");
				
				Парамс.Вставить("тзПервыхДатЗБ", тзПервыхДатЗБ); 
				Парамс.Вставить("СделатьАпдейт",  Истина);
				
				ЛБ_ОбменLX.ЗагрузитьВыдачуЗаймов(Парамс); 	
				
				
			КонецЕсли;
		ИначеЕсли СокрЛП(стр.TDoc) = "Оплата" Тогда   
			
			//Если СокрЛП(стр.StatTransfer) = "2" Тогда
			//	
			//	НайдДок = НайтиВозвратПоИдентификатору(стр.NRecDoc);
			//	Если НайдДок <> Неопределено Тогда
			//		obj = НайдДок.ПолучитьОбъект();
			//		obj.УстановитьПометкуУдаления(Истина);
			//		
			//		НайдПКО = ВернутьПКО(НайдДок);
			//		Если НайдПКО <> Неопределено Тогда
			//			об = НайдПКО.ПолучитьОбъект();
			//			об.УстановитьПометкуУдаления(Истина);
			//		КонецЕсли;
			//		
			//		НайдОК = ВернутьОплатуКартой(НайдДок);
			//		Если НайдОК <> Неопределено Тогда
			//			об = НайдОК.ПолучитьОбъект();
			//			об.УстановитьПометкуУдаления(Истина);
			//		КонецЕсли; 				
			//	КонецЕсли; 
			//	
			//	ПервыйИдентификаторСтр = СтрЗаменить(стр.NRecDoc, Символы.НПП, "");
			//	СделатьАпдейт(ПервыйИдентификаторСтр);  
			//	
			//Иначе	
			//	Если НачалоДня(Дата(стр.DDoc)) = НачалоТекДня Тогда
			//		
			//	Иначе 					
			//		ПараметрыЗайма.Вставить("Ломбард",             стр.Plat); 
			//		ПараметрыЗайма.Вставить("ДатаВозврата",        стр.DDoc);
			//		ПараметрыЗайма.Вставить("ПервыйИдентификатор", стр.NRecDoc);
			//		
			//		//ОбновитьНумерацию();
			//		zb_vnb (стр.NRecZB, ЗаписиSQL, СоединениеSQL, ПараметрыЗайма);	
			//	КонецЕсли;
			//КонецЕсли;   		
		КонецЕсли;	
		
		//Прервать;
	КонецЦикла;
	
	
	
	
	
	
КонецПроцедуры


Функция НайтиДокументПоПредставлениюНомера(Номер, Дата, ТипДокумента)
	Запрос = Новый Запрос;	
	Если ТипДокумента = "ЛБ_ПриходныйКассовыйОрдер" Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|	ЛБ_ПриходныйКассовыйОрдер.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЛБ_ПриходныйКассовыйОрдер КАК ЛБ_ПриходныйКассовыйОрдер
		|ГДЕ
		|	ЛБ_ПриходныйКассовыйОрдер.ПредставлениеНомераПКО = &Номер
		|	И ЛБ_ПриходныйКассовыйОрдер.Дата МЕЖДУ &НачДата И &КонДата";
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		|	ЛБ_РасходныйКассовыйОрдер.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЛБ_РасходныйКассовыйОрдер КАК ЛБ_РасходныйКассовыйОрдер
		|ГДЕ
		|	ЛБ_РасходныйКассовыйОрдер.ПредставлениеНомераРКО = &Номер
		|	И ЛБ_РасходныйКассовыйОрдер.Дата МЕЖДУ &НачДата И &КонДата";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Номер", Номер);
	Запрос.УстановитьПараметр("НачДата", НачалоДня(Дата));
	Запрос.УстановитьПараметр("КонДата", КонецДня(Дата));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции



функция Kassa(НачДата, КонДата, Ломбард) Экспорт
	
	pOrg="02";  
	
	db="'" + НачДата + "'";
	de="'" + КонДата + "'"; 
	
	Если Не ЗначениеЗаполнено(Ломбард) Тогда
		plat = "";
	Иначе
		plat = Ломбард;
	КонецЕсли; 
	
	
	//ТекстЗапроса = "exec [Z1CKorp_Kassa_auto_CF] "+db+","+de+",'"+plat+"',0,'02','',''"; 
	ТекстЗапроса = "exec [Z1CKorp_Kassa_auto_CF_dev] "+db+","+de+",'"+plat+"',0,'02','',''";
	
	
	АдоСоединение = АдоНовоеСоединение("dlink");	
	
	Организация 	= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ОсновнаяОрганизация");
	ЦентральныйОфис = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ЦентральныйОфис"); 
	ВременноеПодразделение 		= ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ОсновноеПодразделение");
	Боровский = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ФизическоеЛицо_Боровский");


	
	Выборка = АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса);
	
	тз = Новый ТаблицаЗначений;
	
	тзДней = Новый ТаблицаЗначений;
	тзДней.Колонки.Добавить("День");
	тзДней.Колонки.Добавить("Ломбард");

	Пока не Выборка.eof() Цикл 
		
		КодОперации = Выборка.fields("KodOperKass").value;
		Если КодОперации = 0 или КодОперации = -1 Тогда
			Выборка.movenext();
			продолжить;
		КонецЕсли; 
		
		Удаленный = Выборка.fields("xdel").value;
		Если Удаленный = 1 Тогда
			Выборка.movenext();
			продолжить;
		КонецЕсли;
		
		ТипДока = Выборка.fields("tp").value;
		Если ТипДока = -1 Тогда
			ТипДокумента = "ЛБ_РасходныйКассовыйОрдер";
		Иначе    
			ТипДокумента = "ЛБ_ПриходныйКассовыйОрдер";
		КонецЕсли;
		
		//Идентификатор= ЗаписиSQL.fields("iden").value ;
		
		Дата  = Выборка.fields("data").value;
		Номер = Выборка.fields("nomer").value;
		
		

		id_Ломбарда   = СтрЗаменить(Выборка.fields("nobj").value, Символы.НПП, "");
		Если Не ЗначениеЗаполнено(id_Ломбарда) Тогда
			Сообщить("Не заполнен id ломбарда в документе № "+СокрЛП(Выборка.fields("ndoc").value));
			Выборка.movenext();
			продолжить;
		КонецЕсли;
			
		
		СсылкаНаЛомбард     = ВернутьЛомбардПоID(id_Ломбарда); 
		
		Если СсылкаНаЛомбард = Неопределено Тогда
			РеквизитыЛомбардаИзLX = ВернутьРеквизитыЛомбардаИзLX(id_Ломбарда);
			Ломб = Справочники.ЛБ_Ломбарды.СоздатьЭлемент();
			Ломб.Наименование 		= РеквизитыЛомбардаИзLX.Наименование;
			Ломб.НомерЛомбарда 		= РеквизитыЛомбардаИзLX.Номер;
			Ломб.НаименованиеПолное = Ломб.Наименование;
			Ломб.id_LX 				= id_Ломбарда; 
			Ломб.Подразделение 		= ВременноеПодразделение;
			Ломб.Записать();
			СсылкаНаЛомбард = Ломб.Ссылка;
		КонецЕсли;
		
		Ломбард       = СсылкаНаЛомбард;
		промЛомб2     = СтрЗаменить(Выборка.fields("nobj2").value, Символы.НПП, "");  
		ДругойЛомбард = ""; 
		Если ЗначениеЗаполнено(промЛомб2) Тогда
			
			СсылкаНаДрЛомбард     = ВернутьЛомбардПоID(промЛомб2); 
			
			Если СсылкаНаДрЛомбард = Неопределено Тогда
				РеквизитыЛомбардаИзLX = ВернутьРеквизитыЛомбардаИзLX(промЛомб2);
				Ломб = Справочники.ЛБ_Ломбарды.СоздатьЭлемент();
				Ломб.Наименование 		= РеквизитыЛомбардаИзLX.Наименование;
				Ломб.НомерЛомбарда 		= РеквизитыЛомбардаИзLX.Номер;
				Ломб.НаименованиеПолное = Ломб.Наименование;
				Ломб.id_LX 				= промЛомб2; 
				Ломб.Подразделение 		= ВременноеПодразделение;
				Ломб.Записать();
				СсылкаНаДрЛомбард = Ломб.Ссылка;
			КонецЕсли;
			
			
			
			ДругойЛомбард       = СсылкаНаДрЛомбард; 
		КонецЕсли;			
		
		Основание = Выборка.fields("osnova").value; 
		Сумма     = Выборка.fields("Summa").value;  
		
		ОткрытьКассовуюСмену(Дата, Ломбард);
		НовСтрДней = тзДней.Добавить();
		НовСтрДней.День = НачалоДня(Дата); 
		НовСтрДней.Ломбард = Ломбард;
	
		НайдДок = НайтиДокументПоПредставлениюНомера(Номер, Дата, ТипДокумента);
		
		Если НайдДок = Неопределено Тогда
			Док = Документы[ТипДокумента].СоздатьДокумент();
			Если ТипДокумента = "ЛБ_РасходныйКассовыйОрдер" Тогда		
				Док.ПредставлениеНомераРКО =  Номер;
			Иначе
				Док.ПредставлениеНомераПКО =  Номер;
			КонецЕсли;
		Иначе
			Док = НайдДок.ПолучитьОбъект();
		КонецЕсли;  
		Док.Комментарий		= "Код операции LX: " + КодОперации; 
		Док.Дата 			= Дата;
		Док.Организация 	= Организация; 
		Док.Ломбард 		= Ломбард;
		Док.Сумма   		= Сумма;
		Док.Основание   	= Основание;
		
		
		Если ТипДокумента = "ЛБ_РасходныйКассовыйОрдер" Тогда 
			Док.ЗагруженИзLX = Истина;
			Если КодОперации = 8 Тогда
				Док.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ВыдачаПодОтчет;
				//Док.Контрагент  = ЦентральныйОфис;
				Док.Дт = "60308";
				Док.Кт = "20202";     
				Выдано          = СокрЛП(Выборка.fields("RKO_FIO").value);
				Док.Выдано      = Выдано; 
				
				
				Док.Контрагент  = НайтиФизЛицоПоIDLX(Выборка.fields("kodUser").value, Выдано);
			КонецЕсли;
			
			Если КодОперации = 10 Тогда
				Док.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ВыплатаЗарплаты; 
				ЗПКОму          = Выборка.fields("Contra1C").value; 
				Док.Выдано      = Выборка.fields("Contra").value;
				Док.Контрагент  = ЦентральныйОфис;
				Док.Дт = "60305";
				Док.Кт = "20202";				
			КонецЕсли; 
			
			Если КодОперации = 12 Тогда
				Док.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ПередачаВЦентральнуюКассу;
				Док.Контрагент  = ЦентральныйОфис;
				Док.Дт = "20209";
				Док.Кт = "20202";
				Док.Выдано      = Выборка.fields("RKO_FIO").value;
			КонецЕсли;
			
			Если КодОперации = 16 Тогда
				Док.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ВозвратПроцентов;
				//Док.Контрагент  = ЦентральныйОфис;
				Док.Дт = "47423";
				Док.Кт = "20202";				
			КонецЕсли; 
			
			Если КодОперации = 17 Тогда
				Док.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ПрочиеРасходныеОперацииПоСогласованиюСЦО;
				//Док.Контрагент  = ЦентральныйОфис;
				Док.Дт = "20209";
				Док.Кт = "20202";			
			КонецЕсли;

			
			Если КодОперации = 18 или КодОперации = 35 или КодОперации = 37 Тогда
				Док.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ОплатаКонтрагента;
				Док.Контрагент  = Боровский;
				Док.Выдано      = Выборка.fields("RKO_FIO").value; 
				Док.Дт = "60312";
				Док.Кт = "20202";				
			КонецЕсли; 
			
			Если КодОперации = 19 Тогда
				Док.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ПередачаВКассуЛомбарда;
				Док.Контрагент  = ДругойЛомбард; 
				Док.Выдано      = Выборка.fields("RKO_FIO").value;
				
				Док.Дт = "20209";
				Док.Кт = "20202";				
			КонецЕсли;
			
			Если КодОперации = 23 Тогда
				Док.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.РасходныеОперацииПоСогласованиюСЦО;
				
						
				Выдано          = СокрЛП(Выборка.fields("RKO_FIO").value);
				Док.Выдано      = Выдано; 
				Док.Контрагент  = НайтиФизЛицоПоIDLX(Выборка.fields("kodUser").value, Выдано);

				
				Док.Дт = "20209";
				Док.Кт = "20202";				
			КонецЕсли;
			
			Если КодОперации = 27 или КодОперации = 5 Тогда // инкассация
				Док.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.Инкассация; 
				Док.Дт = "20209";
				Док.Кт = "20202";
					
				Выдано          = СокрЛП(Выборка.fields("RKO_FIO").value);
				Док.Выдано      = Выдано; 
				Док.Контрагент  = НайтиФизЛицоПоIDLX(Выборка.fields("kodUser").value, Выдано);

			КонецЕсли;
			
			Если КодОперации = 28 Тогда 
				Док.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ВыдачаДляЗачисленияНаКорпоративнуюКарту; 
				Док.Дт = "20209";
				Док.Кт = "20202";
				Док.Выдано     = Выборка.fields("RKO_FIO").value;
				
				НомерКарты     = Выборка.fields("nom").value;   
				
				ФизЛ  = НайтиФизЛицоПоIDLX(Выборка.fields("KodUser").value, Док.Выдано);

				СтруктБК = ВернутьСтруктуруБанковскойКартуПоНомеру(НомерКарты, ФизЛ); 
				Док.БанковскаяКарта = СтруктБК.Карта; 
				Док.ФизическоеЛицо = СтруктБК.Физлицо;
				Док.Контрагент     = СтруктБК.Физлицо;
			КонецЕсли;
			
			Если КодОперации = 41 Тогда
				Док.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ВозвратРазницыРеализацииНевостребованногоЗалога;
				//Док.Контрагент  = ЦентральныйОфис;
				Док.Дт = "20209";
				Док.Кт = "60322";				
			КонецЕсли;  
			
			Если КодОперации = 42 Тогда
				Док.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.Недостача;
				Док.Дт = "20202";
				Док.Кт = "60323";	
				Док.Выдано      = Выборка.fields("RKO_FIO").value; 
				Док.Контрагент  = НайтиФизЛицоПоIDLX(Выборка.fields("KodUser").value, Док.Выдано);
			КонецЕсли;

		КонецЕсли; 
		
		Если ТипДокумента = "ЛБ_ПриходныйКассовыйОрдер" Тогда   
			Если КодОперации = 9 Тогда         
				Док.ПринятоОт   = Выборка.fields("PKO_FIO").value; 
				Док.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ВозвратОтПодотчетника;
				Док.Контрагент  = НайтиФизЛицоПоIDLX(Выборка.fields("KodUser").value, Док.ПринятоОт);
 				Док.Дт = "20202";
				Док.Кт = "20209";
			КонецЕсли;

			Если КодОперации = 11 Тогда
				Док.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПолучениеИзЦентральнойКассы;
				Док.Контрагент  = ЦентральныйОфис;   
				Док.ПринятоОт   = Выборка.fields("PKO_FIO").value;

				Док.Дт = "20202";
				Док.Кт = "20209";
			КонецЕсли;
			Если КодОперации = 13 Тогда
				Док.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ВозвратЗарплатыПоОшибке;
				ПринятоОт       = Выборка.fields("Contra").value;
				
				Док.ПринятоОт   = ПринятоОт; 
				Док.Контрагент  = НайтиФизЛицоПоIDLX(Выборка.fields("KodUser").value);
				Док.Дт = "20202";
				Док.Кт = "60305";
			КонецЕсли;
			Если КодОперации = 14 Тогда
				Док.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПолучениеСКорпоративнойКарты; 
				Док.Дт = "20202";
				Док.Кт = "20209"; 
				Док.ПринятоОт   = Выборка.fields("PKO_FIO").value;
				
				НомерКарты     = Выборка.fields("nom").value;
				СтруктБК = ВернутьСтруктуруБанковскойКартуПоНомеру(НомерКарты); 
				Док.БанковскаяКарта = СтруктБК.Карта; 
				Док.ФизическоеЛицо = СтруктБК.Физлицо;
				Док.Контрагент     = СтруктБК.Физлицо;				
			КонецЕсли;
			
			Если КодОперации = 20 Тогда
				Док.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПолучениеИзКассыДругогоЛомбарда;
				Док.Контрагент  = ДругойЛомбард;
				Док.ПринятоОт   = Выборка.fields("PKO_FIO").value;
				Док.Дт = "20202";
				Док.Кт = "20209";
			КонецЕсли; 
			
			Если КодОперации = 24 Тогда
				Док.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПогашениеНедостачиСотрудником;
				Док.Контрагент  = НайтиФизЛицоПоIDLX(Выборка.fields("KodUser").value);
                Док.ПринятоОт   = Выборка.fields("PKO_FIO").value;   
				Док.Дт = "20202";
				Док.Кт = "20209";
			КонецЕсли;

			
			Если КодОперации = 34 Тогда
				Док.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПогашениеНедостачиСотрудником;  
				ПринятоОт       = Выборка.fields("Contra").value; 
				
				Док.ПринятоОт   = ПринятоОт;
				Док.Контрагент  = Справочники.ФизическиеЛица.НайтиПоНаименованию(ПринятоОт);
				Док.Дт = "20202";
				Док.Кт = "60307";
			КонецЕсли; 
			
			Если КодОперации = 36 Тогда
				Док.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПрочиеПриходныеОперацииПоСогласованиюСЦО; 
				Док.ПринятоОт   = Выборка.fields("PKO_FIO").value; 
			    Док.Контрагент  = Боровский;
				Док.Дт = "20202";
				Док.Кт = "20209";
			КонецЕсли;
			
			Если КодОперации = 40 Тогда
				Док.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ОприходованиеИзлишков;  
				Док.Дт = "20202";
				Док.Кт = "60322";
			КонецЕсли;
			
			Если КодОперации = 50 Тогда
				Док.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПоступленияОтПокупателейНевостребованныхЗалогов;  
				Док.Дт = "20202";
				Док.Кт = "60331";
			КонецЕсли;
			
		КонецЕсли;
		
		Попытка	
			Док.Записать(РежимЗаписиДокумента.Проведение);
		Исключение 
			Док.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;		
		
		Выборка.movenext();
		
	КонецЦикла;
	
	тзДней.Свернуть("День, Ломбард");
	Для каждого стр из тзДней Цикл
		ЗакрытьКассовуюСмену(стр.День, стр.Ломбард);	
	КонецЦикла;	
конецфункции

Функция ВернутьСтруктуруБанковскойКартуПоНомеру(НомерКарты, Физлицо = Неопределено)
	Рез = Новый Структура;
	Рез.Вставить("Карта", Неопределено);
	Рез.Вставить("Физлицо", Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КорпоративныеКарты.Ссылка КАК Ссылка,
	               |	ЛБ_КорпоративныеКарты.ФизическоеЛицо КАК ФизическоеЛицо
	               |ИЗ
	               |	Справочник.ЛБ_КорпоративныеКарты КАК ЛБ_КорпоративныеКарты
	               |ГДЕ
	               |	ЛБ_КорпоративныеКарты.НомерКарты = &НомерКарты";
	Запрос.УстановитьПараметр("НомерКарты", НомерКарты);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда

		Рез.Вставить("Карта", Выборка.Ссылка);
		Рез.Вставить("Физлицо", Выборка.ФизическоеЛицо); 
		
	Иначе
		НовКарта = Справочники.ЛБ_КорпоративныеКарты.СоздатьЭлемент();
		НовКарта.НомерКарты = НомерКарты;
		НовКарта.ФизическоеЛицо = Физлицо;
		НовКарта.ДатаНачалаДействия = Дата(2020,01,01);
		НовКарта.ВидКарты = "visa";
		НовКарта.Записать();
		
		Рез.Вставить("Карта",   НовКарта.Ссылка);
		Рез.Вставить("Физлицо", Физлицо); 
		
		
		
		
	КонецЕсли;
		
	Возврат Рез;
КонецФункции 

Функция НайтиФизЛицоПоIDLX(id_lx, ФИО = "") 
	КодЮз = id_lx; 
	
	КодЮз = СтрЗаменить(КодЮз,Символы.НПП,"");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СоответствиеФизлица_idLX.ФизическоеЛицо КАК Ссылка
	               |ИЗ
	               |	РегистрСведений.ЛБ_СоответствиеФизлица_idLX КАК ЛБ_СоответствиеФизлица_idLX
	               |ГДЕ
	               |	ЛБ_СоответствиеФизлица_idLX.idLX = &id_LX";
	Запрос.УстановитьПараметр("id_LX", КодЮз);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли; 
	
	
	Если ФИО <> "" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст ="ВЫБРАТЬ
		              |	ЛБ_ФИОФизическихЛиц.ФизическоеЛицо КАК Ссылка,
		              |	ЛБ_ФИОФизическихЛиц.ФИОСлужебные КАК ФИОСлужебные
		              |ИЗ
		              |	РегистрСведений.ЛБ_ФИОФизическихЛиц КАК ЛБ_ФИОФизическихЛиц
		              |ГДЕ
		              |	ЛБ_ФИОФизическихЛиц.ФИОСлужебные = &ФИОСлужебные";
		Запрос.УстановитьПараметр("ФИОСлужебные", ФИО); 
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;  
	КонецЕсли;
		
	Возврат Неопределено; 	
КонецФункции

Процедура ОткрытьКассовуюСмену(Дата, Ломбард) 
	Дата = НачалоДня(Дата);
	Запрос =  Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	ЛБ_ОперацииКассовойСмены.Ссылка КАК Ссылка
	              |ИЗ
	              |	Документ.ЛБ_ОперацииКассовойСмены КАК ЛБ_ОперацииКассовойСмены
	              |ГДЕ
	              |	НАЧАЛОПЕРИОДА(ЛБ_ОперацииКассовойСмены.Дата, ДЕНЬ) = &Дата
	              |	И ЛБ_ОперацииКассовойСмены.Ломбард = &Ломбард
	              |	И ЛБ_ОперацииКассовойСмены.ВидОперации = &ВидОперации
	              |	И ЛБ_ОперацииКассовойСмены.Проведен = ИСТИНА";
	Запрос.УстановитьПараметр("Дата", Дата); 
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ЛБ_ВидыОперацийКассовойСмены.Открыть);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
	Иначе
		Док = Документы.ЛБ_ОперацииКассовойСмены.СоздатьДокумент();
		Док.Дата = НачалоДня(Дата);
		Док.Организация = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ОсновнаяОрганизация");
		Док.Ломбард = Ломбард;
		Док.ВидОперации = Перечисления.ЛБ_ВидыОперацийКассовойСмены.Открыть;
		Док.Записать(РежимЗаписиДокумента.Запись);
		Док.Записать(РежимЗаписиДокумента.Проведение); 			
	КонецЕсли;
КонецПроцедуры

Процедура ЗакрытьКассовуюСмену(Дата, Ломбард) 
	Дата = КонецДня(Дата);
	Запрос =  Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	ЛБ_ОперацииКассовойСмены.Ссылка КАК Ссылка
	              |ИЗ
	              |	Документ.ЛБ_ОперацииКассовойСмены КАК ЛБ_ОперацииКассовойСмены
	              |ГДЕ
	              |	НАЧАЛОПЕРИОДА(ЛБ_ОперацииКассовойСмены.Дата, ДЕНЬ) = &Дата
	              |	И ЛБ_ОперацииКассовойСмены.Ломбард = &Ломбард
	              |	И ЛБ_ОперацииКассовойСмены.ВидОперации = &ВидОперации
	              |	И ЛБ_ОперацииКассовойСмены.Проведен = ИСТИНА";
	Запрос.УстановитьПараметр("Дата", Дата); 
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ЛБ_ВидыОперацийКассовойСмены.ЗакрытьКассовыйДень);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
	Иначе
		Док = Документы.ЛБ_ОперацииКассовойСмены.СоздатьДокумент();
		Док.Дата = Дата;
		Док.Организация = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ОсновнаяОрганизация");
		Док.Ломбард = Ломбард;
		Док.ВидОперации = Перечисления.ЛБ_ВидыОперацийКассовойСмены.ЗакрытьКассовыйДень;
		Док.Записать(РежимЗаписиДокумента.Запись);
		Док.Записать(РежимЗаписиДокумента.Проведение); 			
	КонецЕсли;
КонецПроцедуры

Функция ЗагрузитьКлиентов() Экспорт
	
	ТекстЗапроса = "SELECT KodClient id_LX, Dizm	
	|	FROM
	|		[dcbdl_uni].[dbo].[aclient]"; 
	
	
		
	НеГрузитьАдреса = Истина;
	ПерезаписыватьКлиентов = Истина;
	
	тз = Новый ТаблицаЗначений;
	тз.Колонки.Добавить("id_LX"); 
	тз.Колонки.Добавить("ДатаИзменения");
	тз.Колонки.Добавить("ДатаИзменения1С");

	

	
	тзСтран = ВернутьТЗСтран();
	тзПервыхДатЗБ = ВернутьТаблицуПервыхДатЗБ();
	тзЧерныеСтатусыКлиентов = ВернутьКлиентовСЧернойМеткой();

	
	АдоСоединение = АдоНовоеСоединение("dcbdl_uni");

	Выборка = АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса); 
	Пока не Выборка.eof() Цикл  
		Если Выборка.fields("Dizm").value = null Тогда
			
		Иначе 
			НовСТр = тз.Добавить();
			НовСтр.id_LX = СтрЗаменить(Выборка.fields("id_LX").value, Символы.НПП, ""); 

			НовСтр.ДатаИзменения = Выборка.fields("Dizm").value - Дата(1970,1,1);
		КонецЕсли;
		Выборка.movenext(); 	
	КонецЦикла; 
	
	
	//массивУдаляемых = Новый Массив;
	Запрос0 = Новый Запрос;
	Запрос0.Текст = "ВЫБРАТЬ
	               |	ЛБ_СоответствиеЗалогодателейLX.id_LX КАК id_LX,
	               |	ЛБ_СоответствиеЗалогодателейLX.ДатаИзменения КАК ДатаИзменения
	               |ИЗ
	               |	РегистрСведений.ЛБ_СоответствиеЗалогодателейLX КАК ЛБ_СоответствиеЗалогодателейLX"; 
	
	тзСоотв = Запрос0.Выполнить().Выгрузить(); 
	Для каждого стр из тзСоотв Цикл 
		НовСТр = тз.Добавить();
		НовСтр.id_LX = стр.id_LX;
		НовСтр.ДатаИзменения1С = стр.ДатаИзменения - Дата(1970,1,1);
	КонецЦикла;
	
	тз.Свернуть("id_LX", "ДатаИзменения,ДатаИзменения1С");

	Для Индекс = -ТЗ.Количество()+1 По 0 Цикл
		стр = ТЗ[-Индекс]; 
    	Если стр.ДатаИзменения = стр.ДатаИзменения1С Тогда
        	ТЗ.Удалить(-Индекс);
    	КонецЕсли;
	КонецЦикла;

	
	Ном = 0;
	Для каждого стр из тз Цикл 		
		ном = ном + 1;  
		
		Грузим = Истина;  
		
		//отб = Новый Структура();
		//отб.Вставить("id_LX", стр.id_LX); 
		//отб.Вставить("ДатаИзменения", стр.ДатаИзменения);
		//НайдСтроч = тзСоотв.НайтиСтроки(отб);
		//Если НайдСтроч.Количество() > 0 Тогда 
		//	Грузим = Ложь;
		//КонецЕсли;

 		
		Если Грузим Тогда
			
			РеквизитыКлиента = ВернутьРеквизитыКлиентаИзLX(АдоСоединение, тзСтран, "Kodclient = '" + стр.id_LX + "'", НеГрузитьАдреса);
			
			Если РеквизитыКлиента <> Неопределено Тогда
				Если ЗначениеЗаполнено(РеквизитыКлиента[0].ДатаРождения) и (ЗначениеЗаполнено(РеквизитыКлиента[0].Фамилия) или ЗначениеЗаполнено(РеквизитыКлиента[0].Имя) или ЗначениеЗаполнено(РеквизитыКлиента[0].Отчество)) Тогда 
					Парамс = Новый Структура;
					Парамс.Вставить("Данные", 			РеквизитыКлиента[0]); 
					Парамс.Вставить("тзСтран", 			тзСтран);
					Парамс.Вставить("АдоСоединение", 	АдоСоединение);
					Парамс.Вставить("СтатусКлиента", 	"");
					Парамс.Вставить("НеГрузитьАдреса", 	НеГрузитьАдреса); 
					Парамс.Вставить("тзЧерныеСтатусыКлиентов", 	тзЧерныеСтатусыКлиентов);
					Парамс.Вставить("тзПервыхДатЗБ", 	тзПервыхДатЗБ); 
					Парамс.Вставить("ПерезаписыватьКлиентов", 	ПерезаписыватьКлиентов);
					
					Залогодатель 	= НайтиСоздатьЗалогодателя(Парамс);
					
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ном;
	
КонецФункции


Процедура ЗагрузитьЗалогодателя(тз, тзСтран, тзПервыхДатЗБ, тзЧерныеСтатусыКлиентов) Экспорт
	Залогодатель = Неопределено;
	Если тз.Количество() > 0 Тогда
		
		id_lx = тз[0].nrecblacklist;
		id_lx = СтрЗаменить(id_lx, Символы.НПП, "");
 
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЛБ_Залогодатели.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЛБ_Залогодатели КАК ЛБ_Залогодатели
		|ГДЕ
		|	ЛБ_Залогодатели.id_lx = &id_lx";
		Запрос.УстановитьПараметр("id_lx", id_lx);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Залогодатель = Выборка.Ссылка;			
		Иначе
			Об = Справочники.ЛБ_Залогодатели.СоздатьЭлемент();
			Об.Наименование = тз[0].fiof;
			Об.ДатаРождения = тз[0].datar;
			Об.id_lx        = id_lx;
			Об.Фамилия      = тз[0].fam;
			Об.Имя      	= тз[0].name;
			Об.Отчество     = тз[0].patr;
			Об.Записать();
			
			Залогодатель = Об.Ссылка; 		
		КонецЕсли;
	КонецЕсли;
	
	НеГрузитьАдреса = Ложь;
	ПерезаписыватьКлиентов = Истина;
	
	АдоСоединение = АдоНовоеСоединение("dcbdl_uni");

	
	Если Залогодатель <> Неопределено Тогда
		Для каждого стр из тз Цикл 
			
		kodclient = СтрЗаменить(стр.kodclient, Символы.НПП, "");
	
			
		РеквизитыКлиента = ВернутьРеквизитыКлиентаИзLX(АдоСоединение, тзСтран, "Kodclient = '" + kodclient + "'", НеГрузитьАдреса);
			
			Если РеквизитыКлиента <> Неопределено Тогда
				Если ЗначениеЗаполнено(РеквизитыКлиента[0].ДатаРождения) и (ЗначениеЗаполнено(РеквизитыКлиента[0].Фамилия) или ЗначениеЗаполнено(РеквизитыКлиента[0].Имя) или ЗначениеЗаполнено(РеквизитыКлиента[0].Отчество)) Тогда 
					Парамс = Новый Структура;
					Парамс.Вставить("Данные", 			РеквизитыКлиента[0]); 
					Парамс.Вставить("тзСтран", 			тзСтран);
					Парамс.Вставить("АдоСоединение", 	АдоСоединение);
					Парамс.Вставить("СтатусКлиента", 	"");
					Парамс.Вставить("НеГрузитьАдреса", 	НеГрузитьАдреса); 
					Парамс.Вставить("тзЧерныеСтатусыКлиентов", 	тзЧерныеСтатусыКлиентов);
					Парамс.Вставить("тзПервыхДатЗБ", 	тзПервыхДатЗБ); 
					Парамс.Вставить("ПерезаписыватьКлиентов", 	ПерезаписыватьКлиентов); 
					Парамс.Вставить("Залогодатель", Залогодатель); 
					
					Клиент 	= НайтиСоздатьЗалогодателя(Парамс);
					
				КонецЕсли; 
			КонецЕсли;
			
		КонецЦикла;
		
		
		
		
	КонецЕсли;		
КонецПроцедуры



Процедура ЗагрузитьКодыФизлиц() Экспорт
	
	ТекстЗапроса = "select * from dCBDL_dan.dbo.bUser"; 
	              
	
	АдоСоединение = АдоНовоеСоединение("dCBDL_dan");

	Выборка = АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса); 
	Пока не Выборка.eof() Цикл 
		фам = Выборка.fields("Fam").value;
		имя = Выборка.fields("Name").value;
		отч = Выборка.fields("Patr").value;

		фио = СокрЛП(Фам)+" "+СокрЛП(имя) + " "+СокрЛП(отч); 
		
		id_LX = СтрЗаменить(Выборка.fields("kodUser").value,Символы.НПП, "");

		
		Спр = Справочники.ФизическиеЛица.НайтиПоНаименованию(ФИО,Истина);
		Если спр <> Справочники.ФизическиеЛица.ПустаяСсылка() Тогда 
			
			НаборЗаписей = РегистрыСведений.ЛБ_СоответствиеФизлица_idLX.СоздатьНаборЗаписей(); 
			НаборЗаписей.Отбор.ФизическоеЛицо.Установить(спр); 
			НаборЗаписей.Отбор.idLX.Установить(id_LX); 
			
			НоваяЗапись = НаборЗаписей.Добавить(); 
			НоваяЗапись.ФизическоеЛицо = спр; 
			НоваяЗапись.idLX = id_LX; 

			НаборЗаписей.Записать();   
			
			
			
		КонецЕсли;
		
		
		Выборка.movenext(); 	
	КонецЦикла; 
	
	
КонецПроцедуры

//+МАН 06.11.25 Выгрузка клиентов в Эликс
#Область ОбластьВыгрузки

Процедура ВыгрузитьКлиентов(Залогодатель, ПроверятьДокументы) Экспорт
	Если Залогодатель <> Неопределено Тогда
		СобратьДанныеИВыгрузить(Залогодатель, ПроверятьДокументы);
	КонецЕсли;
КонецПроцедуры

Процедура СобратьДанныеИВыгрузить(Залогодатель, ПроверятьДокументы)

	ТЗКлиента = ИнформацияОклиенте(Залогодатель);

	//Нужно определиться как будет работать выгрузка
	//Если создание карточки, то такой вариант может прокатить, а если операция по займу, то нет.
	//Какой ломбард указывать если карточка или ДУЛ созданы в ЦО???
	Если ТЗКлиента[0].DIzm >= НачалоДня(ТекущаяДата()) Тогда
		Ломбард = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();
	Иначе
		Ломбард = ТЗКлиента[0].ОтветственныйЛомбард;
	КонецЕсли;
	//
	
	Если Ломбард.id_LX = "" Тогда
		Сообщить("В карточке ломбарда " + """" + ТЗКлиента[0].ОтветственныйЛомбард.Наименование + """" + " не указан его код в Эликсе");
		Возврат;
	КонецЕсли;
	
	KodBlack = ОпределитьKodBlack(Залогодатель);
	КодКлиента = ПолучитьСформироватьКодКлиента(Залогодатель, Ломбард);
	
	Если КодКлиента = 0 Тогда
		Сообщить("В таблице соответствий не введен код клиента в ломбарде.");
		Возврат;
	КонецЕсли;
	
	Информирование = СформироватьПолеИнформирования(ТЗКлиента[0].ИсточникИнформации, ТЗКлиента[0].ИсточникИнформацииДругое);
	
	СсылкаНаЗапись = ВнешниеИсточникиДанных.Transit1C.Таблицы.dbo_aClient.НайтиПоПолю("KodClient", КодКлиента);
	
	Если ЗначениеЗаполнено(СсылкаНаЗапись) Тогда
		//Убрал на время тестирования
		//И ТЗКлиента[0].DIzm >= НачалоДня(ТекущаяДата()) Тогда
		//
		
		ОбъектЗаписи = СсылкаНаЗапись.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(ОбъектЗаписи, ТЗКлиента[0]);
		ОбъектЗаписи.KodBlack = KodBlack;
		ОбъектЗаписи.KodClient = КодКлиента;
		ОбъектЗаписи.Data1C = NULL;
		ОбъектЗаписи.INN = Информирование;
		
		Если ОбъектЗаписи.DMort <> NULL Тогда
			СтруктураДанныхСмерти = ПолучитьДанныеСмерти(Залогодатель);
			
			ОбъектЗаписи.IPRegDoc = СтруктураДанныхСмерти.ДатаВыдачи;
			ОбъектЗаписи.IPRegOrgan = СтруктураДанныхСмерти.Номер;
		КонецЕсли;
		
		ОбъектЗаписи.Записать();
		
	ИначеЕсли НЕ ЗначениеЗаполнено(СсылкаНаЗапись) Тогда
		
		НоваяСтр = ВнешниеИсточникиДанных.Transit1C.Таблицы.dbo_aClient.СоздатьОбъект();
		ЗаполнитьЗначенияСвойств(НоваяСтр, ТЗКлиента[0]);
		НоваяСтр.KodBlack = KodBlack;
		НоваяСтр.KodClient = КодКлиента;
		НоваяСтр.Data1C = NULL;
		НоваяСтр.INN = Информирование;
		
		Если НоваяСтр.DMort <> NULL Тогда
			СтруктураДанныхСмерти = ПолучитьДанныеСмерти(Залогодатель);
			
			НоваяСтр.IPRegDoc = СтруктураДанныхСмерти.ДатаВыдачи;
			НоваяСтр.IPRegOrgan = СтруктураДанныхСмерти.Номер;
		КонецЕсли;
		
		НоваяСтр.Записать();
		
	КонецЕсли;
	
	ВыгрузитьДокументыЗалогодателя(Залогодатель, Ломбард, КодКлиента, ПроверятьДокументы);
	
	ТекстЗапроса = "exec [Transit1C].[dbo].[Transit1C_aClient]";
	ЗагрузитьИзТранзитнойБазыВЭликс("Transit1C", ТекстЗапроса);

	ТекстЗапроса = "exec [Transit1C].[dbo].[Transit1C_aClientDoc]";
	ЗагрузитьИзТранзитнойБазыВЭликс("Transit1C", ТекстЗапроса);
	
	Сообщить("Выгрузка завершена");
КонецПроцедуры

Процедура ВыгрузитьДокументыЗалогодателя(Залогодатель, Ломбард, КодКлиента, ПроверятьДокументы)
	ТЗДокКлиентаДоСегодня = ПолучитьДокументыКлиента(Залогодатель, НачалоДня(ТекущаяДата()) - 1, Истина);
	ТЗДокКлиентаОтСегодня = ПолучитьДокументыКлиента(Залогодатель, НачалоДня(ТекущаяДата()), Ложь);
	
	Если ТЗДокКлиентаДоСегодня <> Неопределено И ТЗДокКлиентаДоСегодня.Количество() > 0 Тогда
		Для каждого СтрТЗДокДо Из ТЗДокКлиентаДоСегодня Цикл
			//Как быть с выгрузкой ДУЛ которые были созданы в ломбарде на Эликсе и изменены в другом ломбарде на 1С.
			
			КодДокументаКлиента = 0;
			СсылкаНаЗаписьДокумента = ВнешниеИсточникиДанных.Transit1C.Таблицы.dbo_aClientDoc.ПустаяСсылка();
			
			Если ЗначениеЗаполнено(СтрТЗДокДо.NRecClientDoc) Тогда
				
				КодДокументаКлиента = СтрТЗДокДо.NRecClientDoc;
				
				СсылкаНаЗаписьДокумента = ВнешниеИсточникиДанных.Transit1C.Таблицы.dbo_aClientDoc.НайтиПоПолю("NRecClientDoc", СтрТЗДокДо.NRecClientDoc);
				
				Если ЗначениеЗаполнено(СсылкаНаЗаписьДокумента) И ПроверятьДокументы Тогда
					Продолжить;
				КонецЕсли;
			Иначе
				КодДокументаКлиента = ПолучитьСформироватьКодДокументаКлиента(Залогодатель, Ломбард, СтрТЗДокДо.СсылкаДок);
			КонецЕсли;

			Если КодДокументаКлиента = 0 Тогда
				Сообщить("В таблице соответствий не введен код документа клиента в ломбарде.");
				Возврат;
			КонецЕсли;

			ЗаполненаяСтрока = ЗаполнитьСтрокуТЗ(Залогодатель, Ломбард, КодКлиента, КодДокументаКлиента, СтрТЗДокДо);
			
			Если ЗаполненаяСтрока.Kod1C = Null Тогда
				Сообщить("В таблице соответствий видов документов не указан код LX у вида документа " + """" + ЗаполненаяСтрока.ВидДокумента.Наименование + """");
				Возврат;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СсылкаНаЗаписьДокумента) И НЕ ПроверятьДокументы Тогда
				ОбъектЗаписиДок = СсылкаНаЗаписьДокумента.ПолучитьОбъект();
				ЗаполнитьЗначенияСвойств(ОбъектЗаписиДок, ЗаполненаяСтрока);
				ОбъектЗаписиДок.Data1C = NULL;
				ОбъектЗаписиДок.Записать();
			Иначе
				НоваяСтр = ВнешниеИсточникиДанных.Transit1C.Таблицы.dbo_aClientDoc.СоздатьОбъект();
				ЗаполнитьЗначенияСвойств(НоваяСтр, ЗаполненаяСтрока);
				
				Если ПроверятьДокументы Тогда
					НоваяСтр.Data1C = ТекущаяДата();
				Иначе
					НоваяСтр.Data1C = NULL;
				КонецЕсли;
				
				НоваяСтр.Записать();
			КонецЕсли;
		КонецЦикла;
	//Иначе    
	//	Сообщить("Не найдены первые ДУЛ клиента. Они не будут проверены и выгружены.");
	КонецЕсли;
	
	Если ТЗДокКлиентаОтСегодня <> Неопределено И ТЗДокКлиентаОтСегодня.Количество() > 0 Тогда
		Для каждого СтрТЗДокОт Из ТЗДокКлиентаОтСегодня Цикл
			
			КодДокументаКлиента = 0;
			СсылкаНаЗаписьДокумента = ВнешниеИсточникиДанных.Transit1C.Таблицы.dbo_aClientDoc.ПустаяСсылка();
	
			Если ЗначениеЗаполнено(СтрТЗДокОт.NRecClientDoc) Тогда
				КодДокументаКлиента = СтрТЗДокОт.NRecClientDoc;
				СсылкаНаЗаписьДокумента = ВнешниеИсточникиДанных.Transit1C.Таблицы.dbo_aClientDoc.НайтиПоПолю("NRecClientDoc", СтрТЗДокОт.NRecClientDoc);
			Иначе
				КодДокументаКлиента = ПолучитьСформироватьКодДокументаКлиента(Залогодатель, Ломбард, СтрТЗДокОт.СсылкаДок);
			КонецЕсли;
			
			Если КодДокументаКлиента = 0 Тогда
				Сообщить("В таблице соответствий не введен код документа клиента в ломбарде.");
				Возврат;
			КонецЕсли;
			
			ЗаполненаяСтрока = ЗаполнитьСтрокуТЗ(Залогодатель, Ломбард, КодКлиента, КодДокументаКлиента, СтрТЗДокОт);
			
			Если ЗаполненаяСтрока.Kod1C = Null Тогда
				Сообщить("В таблице соответствий видов документов не указан код LX у вида документа " + """" + ЗаполненаяСтрока.ВидДокумента.Наименование + """");
				Возврат;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СсылкаНаЗаписьДокумента) Тогда
				ОбъектЗаписиДок = СсылкаНаЗаписьДокумента.ПолучитьОбъект();
				ЗаполнитьЗначенияСвойств(ОбъектЗаписиДок, ЗаполненаяСтрока);
				ОбъектЗаписиДок.Data1C = NULL;
				ОбъектЗаписиДок.Записать();
			Иначе
				НоваяСтр = ВнешниеИсточникиДанных.Transit1C.Таблицы.dbo_aClientDoc.СоздатьОбъект();
				ЗаполнитьЗначенияСвойств(НоваяСтр, ЗаполненаяСтрока);
				НоваяСтр.Data1C = NULL;
				НоваяСтр.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция ИнформацияОклиенте(Залогодатель)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПрописке КАК Adres,
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ФактическийАдрес КАК AdresFact,
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ПочтовыйАдрес КАК AdresPost,
		|	ВЫБОР
		|		КОГДА ЛБ_АнкетаЗалогодателяСрезПоследних.ФинансовоеПоложениеСтабильное
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК AnkFin,
		|	ВЫБОР
		|		КОГДА ЛБ_АнкетаЗалогодателяСрезПоследних.ИсточникПроисхожденияДенежныхСредствИной = """"
		|			ТОГДА ЛБ_АнкетаЗалогодателяСрезПоследних.ИсточникПроисхожденияДенежныхСредств.Наименование
		|		ИНАЧЕ ЛБ_АнкетаЗалогодателяСрезПоследних.ИсточникПроисхожденияДенежныхСредствИной
		|	КОНЕЦ КАК AnkIstD,
		|	ВЫБОР
		|		КОГДА ЛБ_АнкетаЗалогодателяСрезПоследних.ИсточникПроисхожденияИмуществаИной = """"
		|			ТОГДА ЛБ_АнкетаЗалогодателяСрезПоследних.ИсточникПроисхожденияИмущества.Наименование
		|		ИНАЧЕ ЛБ_АнкетаЗалогодателяСрезПоследних.ИсточникПроисхожденияИмуществаИной
		|	КОНЕЦ КАК AnkIstM,
		|	ЛБ_АнкетаЗалогодателяСрезПоследних.ДеловаяРепутацияПоложительная КАК AnkRep,
		|	СТРЗАМЕНИТЬ(СТРЗАМЕНИТЬ(ЛБ_АнкетаЗалогодателяСрезПоследних.СНИЛС, ""-"", """"), "" "", """") КАК AnkSNILS,
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРождения КАК BirthPlace,
		|	ЛБ_АнкетаЗалогодателяСрезПоследних.Период КАК DAnket,
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК DataR,
		|	ЛБ_СоглашенияЭДОСрезПоследних.Период КАК DEDOCL,
		|	ВЫБОР
		|		КОГДА ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Период > ЛБ_АнкетаЗалогодателяСрезПоследних.Период
		|			ТОГДА ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Период
		|		КОГДА ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Период < ЛБ_АнкетаЗалогодателяСрезПоследних.Период
		|			ТОГДА ЛБ_АнкетаЗалогодателяСрезПоследних.Период
		|		КОГДА ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Период = ЛБ_АнкетаЗалогодателяСрезПоследних.Период
		|			ТОГДА ЛБ_АнкетаЗалогодателяСрезПоследних.Период
		|	КОНЕЦ КАК DIzm,
		|	ВЫБОР
		|		КОГДА ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаСмерти = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА NULL
		|		ИНАЧЕ ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаСмерти
		|	КОНЕЦ КАК dMort,
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ИсточникИнформацииДругое КАК DopRekl,
		|	NULL КАК DSOGL,
		|	ВЫБОР
		|		КОГДА ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Email = """"
		|			ТОГДА NULL
		|		ИНАЧЕ ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Email
		|	КОНЕЦ КАК EMail,
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ИсточникИнформации КАК ИсточникИнформации,
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ИсточникИнформацииДругое КАК ИсточникИнформацииДругое,
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Fam,
		|	"""" КАК Gorod,
		|	"""" КАК Hist,
		|	ЛБ_АнкетаЗалогодателяСрезПоследних.ИНН КАК INNalog,
		|	"""" КАК IPContact,
		|	ВЫБОР
		|		КОГДА ЛБ_АнкетаЗалогодателяСрезПоследних.ЯвляетсяИПДЛ
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК IPDL,
		|	"""" КАК IPOGRN,
		|	"""" КАК IPRegDoc,
		|	"""" КАК IPRegOrgan,
		|	"""" КАК KLADR1,
		|	"""" КАК KLADR2,
		|	"""" КАК KLADR3,
		|	"""" КАК KodBlack,
		|	"""" КАК KodClient,
		|	NULL КАК KodRekl,
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство.Код КАК KodStrana,
		|	ВЫБОР
		|		КОГДА ЛБ_АнкетаЗалогодателяСрезПоследних.ТипФизЛица = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
		|			ТОГДА 1
		|		КОГДА ЛБ_АнкетаЗалогодателяСрезПоследних.ТипФизЛица = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)
		|			ТОГДА 2
		|	КОНЕЦ КАК KodTip,
		|	1 КАК KodVid,
		|	ВЫБОР
		|		КОГДА ЛБ_АнкетаЗалогодателяСрезПоследних.КатегорияДЛПМО_РДПЛ = ЗНАЧЕНИЕ(Перечисление.ЛБ_КатегорииДЛПМО_РДПЛ.ДЛПМО)
		|			ТОГДА 1
		|		КОГДА ЛБ_АнкетаЗалогодателяСрезПоследних.КатегорияДЛПМО_РДПЛ = ЗНАЧЕНИЕ(Перечисление.ЛБ_КатегорииДЛПМО_РДПЛ.ГосДолжность)
		|			ТОГДА 2
		|		КОГДА ЛБ_АнкетаЗалогодателяСрезПоследних.КатегорияДЛПМО_РДПЛ = ЗНАЧЕНИЕ(Перечисление.ЛБ_КатегорииДЛПМО_РДПЛ.СоветДиректоровЦБ)
		|			ТОГДА 3
		|		КОГДА ЛБ_АнкетаЗалогодателяСрезПоследних.КатегорияДЛПМО_РДПЛ = ЗНАЧЕНИЕ(Перечисление.ЛБ_КатегорииДЛПМО_РДПЛ.ФедеральнаяГосСлужба)
		|			ТОГДА 4
		|		КОГДА ЛБ_АнкетаЗалогодателяСрезПоследних.КатегорияДЛПМО_РДПЛ = ЗНАЧЕНИЕ(Перечисление.ЛБ_КатегорииДЛПМО_РДПЛ.ИныеГосСлужбы)
		|			ТОГДА 5
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК KodZdec,
		|	NULL КАК KorProc,
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Name,
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ОтветственныйЛомбард.id_LX КАК nObj,
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Patr,
		|	0 КАК pdSync,
		|	"""" КАК Plat_Uni,
		|	"""" КАК Predst,
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Комментарий КАК Prim,
		|	ВЫБОР
		|		КОГДА ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаСмерти = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА 1
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК Stat,
		|	ЛБ_АнкетаЗалогодателяСрезПоследних.УровеньРиска КАК StRisk,
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК TelMob,
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ТелефонДополнительный КАК Tel,
		|	"""" КАК WLast,
		|	0 КАК xAr,
		|	0 КАК xDel,
		|	ВЫБОР
		|		КОГДА ЛБ_СоглашенияЭДОСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыСоглашенийЭДО.Заключено)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК xEDOCL,
		|	NULL КАК xFATF,
		|	NULL КАК xM,
		|	ВЫБОР
		|		КОГДА ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Мужской)
		|			ТОГДА 1
		|		КОГДА ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Женский)
		|			ТОГДА 0
		|	КОНЕЦ КАК xSex,
		|	ВЫБОР
		|		КОГДА ЛБ_СогласиеНаСМСРассылкуСрезПоследних.Согласен
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК xSMS,
		|	0 КАК xSOGL,
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ОтветственныйЛомбард КАК ОтветственныйЛомбард
		|ИЗ
		|	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_АнкетаЗалогодателя.СрезПоследних(, Залогодатель = &Залогодатель) КАК ЛБ_АнкетаЗалогодателяСрезПоследних
		|		ПО ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Залогодатель = ЛБ_АнкетаЗалогодателяСрезПоследних.Залогодатель
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_СогласиеНаСМСРассылку.СрезПоследних(, Залогодатель = &Залогодатель) КАК ЛБ_СогласиеНаСМСРассылкуСрезПоследних
		|		ПО ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Залогодатель = ЛБ_СогласиеНаСМСРассылкуСрезПоследних.Залогодатель
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_СоглашенияЭДО.СрезПоследних(, Клиент = &Залогодатель) КАК ЛБ_СоглашенияЭДОСрезПоследних
		|		ПО ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Залогодатель = ЛБ_СоглашенияЭДОСрезПоследних.Клиент";
	
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() > 0 Тогда
		Возврат РезультатЗапроса;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

//Статусы KodBlack:
//1. Статусы перечней и специальные статусы (Искать по всем перечням)
//	- Террорист
//		- 1 - Черный (Включен)
//		- 6 - Исключен
//	- МВК
//		- 13 - Включен
//		- 15 - исключен
//	- 16 - ФРОМУ
//	- 19 - СБ ООН
//	
//	- 2 - Недобросовестный
//	- 9 - ВИП
//	- 10 - Сотрудник
//	- 12 - Тёмный (Стоп-лист)
//	- 20 - Банкрот
//	
//2. Расчетный статус по системе лояльности
//	- 0 - Новый
//	- 3 - Не выкупающий
//	- 4 - Добросовестный
//	- 5 - Постоянный
//	- 7 - Неопределенный
//	- -2 - Сверхновый
Функция ОпределитьKodBlack(Залогодатель)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ПереченьНежелательныхЛицСрезПоследних.Статус КАК Статус,
		|	ЛБ_ПереченьНежелательныхЛицСрезПоследних.ВидПеречня КАК ВидПеречня,
		|	ЛБ_ПереченьНежелательныхЛицСрезПоследних.ИД КАК ИД
		|ИЗ
		|	РегистрСведений.ЛБ_ПереченьНежелательныхЛиц.СрезПоследних(
		|			,
		|			Наименование = &Наименование
		|					И ВЫБОР
		|						КОГДА ДатаРождения <> ДАТАВРЕМЯ(1, 1, 1)
		|							ТОГДА ДатаРождения = НАЧАЛОПЕРИОДА(&ДатаРождения, ДЕНЬ)
		|						КОГДА ДатаРождения = ДАТАВРЕМЯ(1, 1, 1)
		|								И ГодРождения <> """"
		|							ТОГДА ГодРождения = ГОД(&ДатаРождения)
		|					КОНЕЦ
		|				ИЛИ НаименованиеЛат = &Наименование
		|					И ВЫБОР
		|						КОГДА ДатаРождения <> ДАТАВРЕМЯ(1, 1, 1)
		|							ТОГДА ДатаРождения = НАЧАЛОПЕРИОДА(&ДатаРождения, ДЕНЬ)
		|						КОГДА ДатаРождения = ДАТАВРЕМЯ(1, 1, 1)
		|								И ГодРождения <> """"
		|							ТОГДА ГодРождения = ГОД(&ДатаРождения)
		|					КОНЕЦ
		|				ИЛИ ТехническоеНаименование = &Наименование
		|					И ВЫБОР
		|						КОГДА ДатаРождения <> ДАТАВРЕМЯ(1, 1, 1)
		|							ТОГДА ДатаРождения = НАЧАЛОПЕРИОДА(&ДатаРождения, ДЕНЬ)
		|						КОГДА ДатаРождения = ДАТАВРЕМЯ(1, 1, 1)
		|								И ГодРождения <> """"
		|							ТОГДА ГодРождения = ГОД(&ДатаРождения)
		|					КОНЕЦ
		|				ИЛИ ИД В
		|						(ВЫБРАТЬ
		|							ЛБ_ПереченьНежелательныхЛицДрНаименованияСрезПоследних.ИД КАК ИД
		|						ИЗ
		|							РегистрСведений.ЛБ_ПереченьНежелательныхЛицДрНаименования.СрезПоследних(, Наименование = &Наименование
		|									И ВЫБОР
		|										КОГДА ДатаРождения <> ДАТАВРЕМЯ(1, 1, 1)
		|											ТОГДА ДатаРождения = НАЧАЛОПЕРИОДА(&ДатаРождения, ДЕНЬ)
		|										КОГДА ДатаРождения = ДАТАВРЕМЯ(1, 1, 1)
		|												И ГодРождения <> """"
		|											ТОГДА ГодРождения = ГОД(&ДатаРождения)
		|									КОНЕЦ
		|								ИЛИ ТехническоеНаименование = &Наименование
		|									И ВЫБОР
		|										КОГДА ДатаРождения <> ДАТАВРЕМЯ(1, 1, 1)
		|											ТОГДА ДатаРождения = НАЧАЛОПЕРИОДА(&ДатаРождения, ДЕНЬ)
		|										КОГДА ДатаРождения = ДАТАВРЕМЯ(1, 1, 1)
		|												И ГодРождения <> """"
		|											ТОГДА ГодРождения = ГОД(&ДатаРождения)
		|									КОНЕЦ) КАК ЛБ_ПереченьНежелательныхЛицДрНаименованияСрезПоследних
		|						СГРУППИРОВАТЬ ПО
		|							ЛБ_ПереченьНежелательныхЛицДрНаименованияСрезПоследних.ИД)
		|					И ВЫБОР
		|						КОГДА ДатаРождения <> ДАТАВРЕМЯ(1, 1, 1)
		|							ТОГДА ДатаРождения = НАЧАЛОПЕРИОДА(&ДатаРождения, ДЕНЬ)
		|						КОГДА ДатаРождения = ДАТАВРЕМЯ(1, 1, 1)
		|								И ГодРождения <> """"
		|							ТОГДА ГодРождения = ГОД(&ДатаРождения)
		|					КОНЕЦ) КАК ЛБ_ПереченьНежелательныхЛицСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛБ_ПереченьНежелательныхЛицСрезПоследних.ВидПеречня,
		|	ЛБ_ПереченьНежелательныхЛицСрезПоследних.Статус,
		|	ЛБ_ПереченьНежелательныхЛицСрезПоследних.ИД";
	
	Запрос.УстановитьПараметр("ДатаРождения", Залогодатель.ДатаРождения);
	Запрос.УстановитьПараметр("Наименование", Залогодатель.Наименование);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Если РезультатЗапроса.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.Террористы
			И РезультатЗапроса.Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен Тогда
			Возврат 1;
		ИначеЕсли РезультатЗапроса.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.Террористы
			И РезультатЗапроса.Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Исключен Тогда
			Возврат 6;
		ИначеЕсли РезультатЗапроса.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.МВК
			И РезультатЗапроса.Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен Тогда
			Возврат 13;
		ИначеЕсли РезультатЗапроса.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.МВК
			И РезультатЗапроса.Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Исключен Тогда
			Возврат 15;
		ИначеЕсли РезультатЗапроса.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ФРОМУ Тогда
			Возврат 16;
		ИначеЕсли РезультатЗапроса.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ООН Тогда
			Возврат 19;
		КонецЕсли;
	КонецЕсли;
	
	СтатусЛояльности = ПолучитьСтатусЛояльности(Залогодатель);
	
	Если ПолучитьСлужебныйСтатус(Залогодатель, "Недобросовестный") Тогда
		Возврат 2;
	КонецЕсли;
	
	Если ПолучитьДополнительныйСтатус(Залогодатель, Справочники.ЛБ_СтатусыЗалогодателей.VIP) Тогда
		Возврат 9;
	КонецЕсли;
	
	Если ПолучитьДополнительныйСтатус(Залогодатель, Справочники.ЛБ_СтатусыЗалогодателей.Сотрудник) Тогда
		Возврат 10;
	КонецЕсли;
	
	Если ПолучитьСлужебныйСтатус(Залогодатель, "Стоп-лист") Тогда //Темный
		Возврат 12;
	КонецЕсли;
	
	Если ПолучитьСлужебныйСтатус(Залогодатель, "Банкрот") Тогда
		Возврат 20;
	КонецЕсли;
	
	Если СтатусЛояльности = Справочники.ЛБ_СтатусыЗалогодателей.Новый Тогда
		Возврат 0;
	КонецЕсли;
	
	Если СтатусЛояльности = Справочники.ЛБ_СтатусыЗалогодателей.Невыкупающий Тогда
		Возврат 3;
	КонецЕсли;
	
	Если СтатусЛояльности = Справочники.ЛБ_СтатусыЗалогодателей.Добросовестный Тогда
		Возврат 4;
	КонецЕсли;
	
	Если СтатусЛояльности = Справочники.ЛБ_СтатусыЗалогодателей.Постоянный Тогда
		Возврат 5;
	КонецЕсли;
	
	Если СтатусЛояльности = Справочники.ЛБ_СтатусыЗалогодателей.Неопределенный Тогда
		Возврат 7;
	КонецЕсли;
	
	Если СтатусЛояльности = Справочники.ЛБ_СтатусыЗалогодателей.Сверхновый Тогда
		Возврат -2;
	КонецЕсли;
КонецФункции

Функция ПолучитьСлужебныйСтатус(Залогодатель, Статус)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СтатусыЗалогодателейСлужебныеСрезПоследних.Статус КАК Статус,
		|	ЛБ_СтатусыЗалогодателейСлужебныеСрезПоследних.Используется КАК Используется
		|ИЗ
		|	РегистрСведений.ЛБ_СтатусыЗалогодателейСлужебные.СрезПоследних(
		|			,
		|			Залогодатель = &Залогодатель
		|				И Статус.Наименование = &Статус) КАК ЛБ_СтатусыЗалогодателейСлужебныеСрезПоследних";
	
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.УстановитьПараметр("Статус", Статус);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Возврат РезультатЗапроса.Используется;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьДополнительныйСтатус(Залогодатель, Статус)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус,
		|	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Используется КАК Используется
		|ИЗ
		|	РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(
		|			,
		|			Залогодатель = &Залогодатель
		|				И Статус = &Статус) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.УстановитьПараметр("Статус", Статус);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Возврат РезультатЗапроса.Используется;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьСтатусЛояльности(Залогодатель)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СтатусыЗалогодателейСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.ЛБ_СтатусыЗалогодателей.СрезПоследних(, Залогодатель = &Залогодатель) КАК ЛБ_СтатусыЗалогодателейСрезПоследних";
	
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Возврат РезультатЗапроса.Статус;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьСформироватьКодКлиента(Залогодатель, Ломбард)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СоответствиеЗалогодателейLX.id_LX КАК id_LX
		|ИЗ
		|	РегистрСведений.ЛБ_СоответствиеЗалогодателейLX КАК ЛБ_СоответствиеЗалогодателейLX
		|ГДЕ
		|	ЛБ_СоответствиеЗалогодателейLX.Залогодатель = &Залогодатель";
	
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		РасчитанныйКодЛомбарда = Прав(РезультатЗапроса.id_LX, 3);
		
		Если Лев(РасчитанныйКодЛомбарда, 1) = "0" Тогда
			РасчитанныйКодЛомбарда = Прав(РасчитанныйКодЛомбарда, 2);
			
			Если Лев(РасчитанныйКодЛомбарда, 1) = "0" Тогда
				РасчитанныйКодЛомбарда = Прав(РасчитанныйКодЛомбарда, 1);
			КонецЕсли;
		КонецЕсли;
		
		ЛомбардПоРасчитанномуКоду = ПолучитьЛомбардПоКодуLX(РасчитанныйКодЛомбарда);
		
		Если ЛомбардПоРасчитанномуКоду = Ломбард Тогда
			Возврат Число(РезультатЗапроса.id_LX);
		КонецЕсли;
	КонецЦикла;
	
	//Формируем новый код
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СоответствиеКодаЗалогодателяВЛомбардеLX.КодВLX КАК КодВLX,
		|	ЛБ_СоответствиеКодаЗалогодателяВЛомбардеLX.КодДокВLX КАК КодДокВLX
		|ИЗ
		|	РегистрСведений.ЛБ_СоответствиеКодаЗалогодателяВЛомбардеLX КАК ЛБ_СоответствиеКодаЗалогодателяВЛомбардеLX
		|ГДЕ
		|	ЛБ_СоответствиеКодаЗалогодателяВЛомбардеLX.Ломбард = &Ломбард";
	
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Если РезультатЗапроса.КодВLX = 0 Тогда
			Возврат 0;
		КонецЕсли;
		
		КодКлиента = РезультатЗапроса.КодВLX * -1000 - Ломбард.id_LX;
		
		СоздатьСоответствиеЗалогодателя(Залогодатель, СтрЗаменить(Строка(КодКлиента), " ", ""), Дата(1,1,1));
		
		НаборЗаписей = РегистрыСведений.ЛБ_СоответствиеКодаЗалогодателяВЛомбардеLX.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Ломбард.Установить(Ломбард);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Ломбард = Ломбард;
		НоваяЗапись.КодВLX = РезультатЗапроса.КодВLX + 1;
		НоваяЗапись.КодДокВLX = РезультатЗапроса.КодДокВLX;
		НаборЗаписей.Записать();
		
		Возврат КодКлиента;
	КонецЕсли;
	
	Возврат 0;

КонецФункции

Функция ПолучитьЛомбардПоКодуLX(КодЛомбарда)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_Ломбарды.Ссылка КАК Ссылка,
		|	ЛБ_Ломбарды.id_LX КАК id_LX
		|ИЗ
		|	Справочник.ЛБ_Ломбарды КАК ЛБ_Ломбарды
		|ГДЕ
		|	ЛБ_Ломбарды.id_LX = &id_LX";
	
	Запрос.УстановитьПараметр("id_LX", КодЛомбарда);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Возврат РезультатЗапроса.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

//поле inn [Информирование]
//
//10111110111 - значение
//
//1,2,3,4,5,6,7,8,9,10,11 - порядковый номер в значении
//
//далее если в порядковом номере '1' стоит 0 значит пусто 
//
//иначе значения по табличке 
//
// порядковый номер     значение
//1    Вывеска на фасаде
//2    Наружная реклама (билл-борд, баннер, ситилайт и пр.)
//3    Реклама в/на транспорте
//4    Реклама в лифтах/подъездах
//5    Листовка
//6    Интернет/сайт ЛКДУ
//7    Социальные сети
//8    СМС
//9    Сall-центр
//10    Посоветовали знакомые
//11    Другое
Функция СформироватьПолеИнформирования(ИсточникИнформации, ИсточникИнформацииДругое)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ИсточникиИнформации.Наименование КАК Наименование,
		|	ЛБ_ИсточникиИнформации.id_LX КАК id_LX
		|ИЗ
		|	Справочник.ЛБ_ИсточникиИнформации КАК ЛБ_ИсточникиИнформации
		|ГДЕ
		|	ЛБ_ИсточникиИнформации.id_LX <> """"
		|
		|УПОРЯДОЧИТЬ ПО
		|	id_LX";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	РезультатЗапроса.Сортировать("id_LX Возр");
	
	НаружнаяРеклама = Ложь;
	СтрокаВозврата = "";
	
	Для каждого Стр Из РезультатЗапроса Цикл
		НайденнаяСтрока = СтрНайти(ИсточникИнформации, Стр.Наименование);
		
		Если НайденнаяСтрока > 0 И Стр.id_LX = "1" Тогда
			СтрокаВозврата = СтрокаВозврата + "1";
		ИначеЕсли НайденнаяСтрока = 0 И Стр.id_LX = "1" Тогда
			СтрокаВозврата = СтрокаВозврата + "0";
		КонецЕсли;
		
		Если НайденнаяСтрока > 0 И Стр.id_LX = "2" Тогда
			СтрокаВозврата = СтрокаВозврата + "1";
		ИначеЕсли НайденнаяСтрока = 0 И Стр.id_LX = "2" Тогда
			СтрокаВозврата = СтрокаВозврата + "0";
		КонецЕсли;
		
		Если НайденнаяСтрока > 0 И Стр.id_LX = "3" Тогда
			СтрокаВозврата = СтрокаВозврата + "1";
		ИначеЕсли НайденнаяСтрока = 0 И Стр.id_LX = "3" Тогда
			СтрокаВозврата = СтрокаВозврата + "0";
		КонецЕсли;
		
		Если НайденнаяСтрока > 0 И Стр.id_LX = "4" Тогда
			СтрокаВозврата = СтрокаВозврата + "1";
		ИначеЕсли НайденнаяСтрока = 0 И Стр.id_LX = "4" Тогда
			СтрокаВозврата = СтрокаВозврата + "0";
		КонецЕсли;
		
		Если НайденнаяСтрока > 0 И Стр.id_LX = "5" Тогда
			СтрокаВозврата = СтрокаВозврата + "1";
		ИначеЕсли НайденнаяСтрока = 0 И Стр.id_LX = "5" Тогда
			СтрокаВозврата = СтрокаВозврата + "0";
		КонецЕсли;
		
		Если НайденнаяСтрока > 0 И Стр.id_LX = "6" Тогда
			СтрокаВозврата = СтрокаВозврата + "1";
		ИначеЕсли НайденнаяСтрока = 0 И Стр.id_LX = "6" Тогда
			СтрокаВозврата = СтрокаВозврата + "0";
		КонецЕсли;
		
		Если НайденнаяСтрока > 0 И Стр.id_LX = "7" Тогда
			СтрокаВозврата = СтрокаВозврата + "1";
		ИначеЕсли НайденнаяСтрока = 0 И Стр.id_LX = "7" Тогда
			СтрокаВозврата = СтрокаВозврата + "0";
		КонецЕсли;
		
		Если НайденнаяСтрока > 0 И Стр.id_LX = "8" Тогда
			СтрокаВозврата = СтрокаВозврата + "1";
		ИначеЕсли НайденнаяСтрока = 0 И Стр.id_LX = "8" Тогда
			СтрокаВозврата = СтрокаВозврата + "0";
		КонецЕсли;
		
		Если НайденнаяСтрока > 0 И Стр.id_LX = "9" Тогда
			СтрокаВозврата = СтрокаВозврата + "1";
		ИначеЕсли НайденнаяСтрока = 0 И Стр.id_LX = "9" Тогда
			СтрокаВозврата = СтрокаВозврата + "0";
		КонецЕсли;
		
		Если НайденнаяСтрока > 0 И Стр.id_LX = "10" Тогда
			НаружнаяРеклама = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если НаружнаяРеклама Тогда
		СтрокаВозврата = СтрокаВозврата + "1";
	Иначе
		СтрокаВозврата = СтрокаВозврата + "0";
	КонецЕсли;
	
	Если ИсточникИнформацииДругое <> "" Тогда
		СтрокаВозврата = СтрокаВозврата + "1";
	Иначе
		СтрокаВозврата = СтрокаВозврата + "0";
	КонецЕсли;
	
	Возврат СтрокаВозврата;
КонецФункции

Процедура ЗагрузитьИзТранзитнойБазыВЭликс(База, ТекстЗапроса);
	АдоСоединение = АдоНовоеСоединение(База);
	
	//ТекстЗапроса = "exec [Transit1C].[dbo].[Transit1C_aClient]";
	
	Выборка = АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса);
	
	Пока НЕ Выборка.eof() Цикл
		РезультатЗагрузки = Выборка.fields("ID").value;
		
		Если РезультатЗагрузки = -1 Тогда
			Сообщить("Ошибка загрузки данных в Эликс");
		КонецЕсли;
		
		Выборка.movenext();
	КонецЦикла;
	
	АдоСоединение.Close();
КонецПроцедуры

Функция ПолучитьДокументыКлиента(Залогодатель, Дата, ДокументыДо)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	NULL КАК AdrDoc,
		|	ВЫБОР
		|		КОГДА ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК BegPreb,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК DDoc,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.Период КАК DReg,
		|	ВЫБОР
		|		КОГДА ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК EndPreb,
		|	NULL КАК Gorod,
		|	0 КАК KodClient,
		|	NULL КАК KodDocVid,
		//+МАН 16.12.25 Будем всегда искать в регистре соответствий т.к. у некоторых видов документов не различаются коды
		//|	ВЫБОР
		//|		КОГДА ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента.КодМВД = """"
		//|			ТОГДА """"
		//|		ИНАЧЕ ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента.КодМВД
		//|	КОНЕЦ КАК Kod1C,
		|	""  "" КАК Kod1C,
		//-МАН
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК KodPodr,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство.Код КАК KodStrana,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК NDoc,
		|	0 КАК nObj,
		|	ЛБ_ДокументыЗалогодателя.id_LX КАК NRecClientDoc,
		|	ЛБ_ДокументыЗалогодателя.Ссылка КАК СсылкаДок,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК SDoc,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК WDoc,
		|	NULL КАК WLast,
		|	ВЫБОР
		|		КОГДА ЛБ_ДокументыЗалогодателейСрезПоследних.ОсновнойДоп 
		|			ТОГДА ЛБ_ДокументыЗалогодателейСрезПоследних.ОсновнойДоп
		|		ИНАЧЕ ЛБ_ДокументыЗалогодателейСрезПоследних.ОсновнойДУЛ
		|	КОНЕЦ КАК xV
		|ИЗ
		|	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(
		|			,
		|			ДокументЗалогодателя.Владелец = &Залогодатель
		//|				И ПричинаИзменения = ЗНАЧЕНИЕ(Справочник.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.НовыйДокумент)
		//|				И ВЫБОР
		//|					КОГДА СТРНАЙТИ(Изменения, ""Создан новый документ"") > 0
		//|						ТОГДА ИСТИНА
		//|					ИНАЧЕ ЛОЖЬ
		//|				КОНЕЦ
		|				) КАК ЛБ_ДокументыЗалогодателейСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЛБ_ДокументыЗалогодателя КАК ЛБ_ДокументыЗалогодателя
		|		ПО ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя = ЛБ_ДокументыЗалогодателя.Ссылка
		|ГДЕ
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.Период 111 = 111 &Дата";
		
	Если ДокументыДо Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "111 = 111", "<=");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "111 = 111", ">=");
	КонецЕсли;
		
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() > 0 Тогда
		Возврат РезультатЗапроса;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ВернутьКодLXПоВидДокументаФизлица(ВидДокумента)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СоответствиеВидовДокументовФизлиц.КодLX КАК КодLX
	               |ИЗ
	               |	РегистрСведений.ЛБ_СоответствиеВидовДокументовФизлиц КАК ЛБ_СоответствиеВидовДокументовФизлиц
	               |ГДЕ
	               |	ЛБ_СоответствиеВидовДокументовФизлиц.ВидДокумента = &ВидДокумента";
	
	Запрос.УстановитьПараметр("ВидДокумента", ВидДокумента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КодLX;
	КонецЕсли;
	
	Возврат Null;
КонецФункции

Функция ПолучитьСформироватьКодДокументаКлиента(Залогодатель, Ломбард, СсылкаДок)
	
	//Формируем новый код
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СоответствиеКодаЗалогодателяВЛомбардеLX.КодВLX КАК КодВLX,
		|	ЛБ_СоответствиеКодаЗалогодателяВЛомбардеLX.КодДокВLX КАК КодДокВLX
		|ИЗ
		|	РегистрСведений.ЛБ_СоответствиеКодаЗалогодателяВЛомбардеLX КАК ЛБ_СоответствиеКодаЗалогодателяВЛомбардеLX
		|ГДЕ
		|	ЛБ_СоответствиеКодаЗалогодателяВЛомбардеLX.Ломбард = &Ломбард";
	
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Если РезультатЗапроса.КодДокВLX = 0 Тогда
			Возврат 0;
		КонецЕсли;
		
		КодДокументаКлиента = РезультатЗапроса.КодДокВLX * -1000 - Ломбард.id_LX;
		
		НаборЗаписей = РегистрыСведений.ЛБ_СоответствиеКодаЗалогодателяВЛомбардеLX.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Ломбард.Установить(Ломбард);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Ломбард = Ломбард;
		НоваяЗапись.КодВLX = РезультатЗапроса.КодВLX;;
		НоваяЗапись.КодДокВLX = РезультатЗапроса.КодДокВLX + 1;
		НаборЗаписей.Записать();
		
		ДокОбъект = СсылкаДок.ПолучитьОбъект();
		ДокОбъект.id_LX = КодДокументаКлиента;
		ДокОбъект.Записать();
		
		Возврат КодДокументаКлиента;
	КонецЕсли;
	
	Возврат 0;

КонецФункции

Функция ЗаполнитьСтрокуТЗ(Залогодатель, Ломбард, КодКлиента, КодДокументаКлиента, СтрТЗ)
	
	Если ЗначениеЗаполнено(СтрТЗ.NRecClientDoc) Тогда
		
		РасчитанныйКодЛомбарда = Прав(СтрТЗ.NRecClientDoc, 3);
		
		Если Лев(РасчитанныйКодЛомбарда, 1) = "0" Тогда
			РасчитанныйКодЛомбарда = Прав(РасчитанныйКодЛомбарда, 2);
			
			Если Лев(РасчитанныйКодЛомбарда, 1) = "0" Тогда
				РасчитанныйКодЛомбарда = Прав(РасчитанныйКодЛомбарда, 1);
			КонецЕсли;
		КонецЕсли;
		
		ЛомбардПоРасчитанномуКоду = ПолучитьЛомбардПоКодуLX(РасчитанныйКодЛомбарда);
		
		Если ЛомбардПоРасчитанномуКоду <> Неопределено Тогда
			СтрТЗ.nObj = РасчитанныйКодЛомбарда;
		КонецЕсли;
		
		//Если НЕ ЗначениеЗаполнено(СтрТЗ.Kod1C) Тогда
			Если СтрТЗ.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ВоенныйБилет Тогда
				СтрТЗ.Kod1C = "07";
			ИначеЕсли СтрТЗ.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.НайтиПоНаименованию("миграционная карта") Тогда
				СтрТЗ.Kod1C = "3";
			Иначе
				СтрТЗ.Kod1C = ВернутьКодLXПоВидДокументаФизлица(СтрТЗ.ВидДокумента);
			КонецЕсли;
			//СтрТЗ.Kod1C = ВернутьКодLXПоВидДокументаФизлица(СтрТЗ.ВидДокумента);
		//КонецЕсли;
		
		СтрТЗ.KodClient = КодКлиента;

	Иначе
		//КодДокументаКлиента = ПолучитьСформироватьКодДокументаКлиента(Залогодатель, Ломбард, СтрТЗ.СсылкаДок);
		СтрТЗ.NRecClientDoc = КодДокументаКлиента;
		СтрТЗ.nObj = Ломбард.id_LX;
		
		//Если НЕ ЗначениеЗаполнено(СтрТЗ.Kod1C) Тогда
			Если СтрТЗ.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ВоенныйБилет Тогда
				СтрТЗ.Kod1C = "07";
			ИначеЕсли СтрТЗ.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.НайтиПоНаименованию("миграционная карта") Тогда
				СтрТЗ.Kod1C = "3";
			Иначе
				СтрТЗ.Kod1C = ВернутьКодLXПоВидДокументаФизлица(СтрТЗ.ВидДокумента);
			КонецЕсли;
			//СтрТЗ.Kod1C = ВернутьКодLXПоВидДокументаФизлица(СтрТЗ.ВидДокумента);
		//КонецЕсли;
		
		СтрТЗ.KodClient = КодКлиента;
	КонецЕсли;
	
	Возврат СтрТЗ;
КонецФункции

Функция ПолучитьДанныеСмерти(Залогодатель)
	
	СтруктураВозврата = Новый Структура("ДатаВыдачи, Номер");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДатаВыдачи,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК Номер
		|ИЗ
		|	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(
		|			,
		|			ДокументЗалогодателя.Владелец = &Залогодатель
		|				И ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.СвидетельствоОСмерти)) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";
	
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, РезультатЗапроса);
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти
//-МАН        


Процедура РегламентнаяЗагрузкаКЛиентов() Экспорт  
	
		
	тзСтран = ЛБ_ОбменLX.ВернутьТЗСтран();
	тзПервыхДатЗБ = ЛБ_ОбменLX.ВернутьТаблицуПервыхДатЗБ();
	тзЧерныеСтатусыКлиентов = ЛБ_ОбменLX.ВернутьКлиентовСЧернойМеткой(); 

	
	
	АдоСоединение = ЛБ_ОбменLX.АдоНовоеСоединение("dlink") ;  
	
	
	ТекстЗапроса = "SELECT TOP (100000) * FROM [dLink].[dbo].[SootClient_2603] where loaded = 0";  
	
	Списокid = Новый Массив;
	
	Выборка = ЛБ_ОбменLX.АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса);
	
	
	ном = 0;
	Пока не Выборка.eof() Цикл 
		ном = ном + 1;
		
		nrecblacklist = Выборка.fields("nrecblacklist").value; 
		Если nrecblacklist = null Тогда
			
		Иначе
			Списокid.Добавить(nrecblacklist);	
		КонецЕсли;
	       				
		Выборка.movenext();
	КонецЦикла; 
	АдоСоединение.Close();
	
	
	Для каждого элем из Списокid Цикл 
		Если ЗагрузитьОдногоКлиентаПоID(тзСтран, тзПервыхДатЗБ, тзЧерныеСтатусыКлиентов, элем) Тогда   
			 СделатьАпдейтТаблицыКлиента(элем); 			
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

Процедура СделатьАпдейтТаблицыКлиента(id)
	
	ТекстЗапроса  = "UPDATE SootClient_2603 SET loaded = 1 WHERE nrecblacklist = '" + id + "'";	  
	АдоСоединение = ЛБ_ОбменLX.АдоНовоеСоединение("dlink") ;  

	rt =  ЛБ_ОбменLX.АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса); 


КонецПроцедуры 



Функция ЗагрузитьОдногоКлиентаПоID(тзСтран, тзПервыхДатЗБ, тзЧерныеСтатусыКлиентов, id)
	
	АдоСоединение = ЛБ_ОбменLX.АдоНовоеСоединение("dlink") ;  
	
	id = СтрЗаменить(id, Символы.НПП, "");
	
	ТекстЗапроса = "SELECT * FROM [dLink].[dbo].[SootClientBlack] where nrecblacklist = '"+ id +"'";
	
	Выборка = ЛБ_ОбменLX.АдоВыполнитьЗапрос(АдоСоединение, ТекстЗапроса) ;
	
	ТЗ = Новый ТаблицаЗначений;
	тз.Колонки.Добавить("nrecblacklist"); 
	тз.Колонки.Добавить("fiof"); 
	тз.Колонки.Добавить("datar");
	тз.Колонки.Добавить("kodclient");
	тз.Колонки.Добавить("nobj");
	тз.Колонки.Добавить("fam");
	тз.Колонки.Добавить("name");
	тз.Колонки.Добавить("patr");  
	
	
	ном = 0;
	Пока не Выборка.eof() Цикл 
		ном = ном + 1;
		
		СтрокаТЗ = ТЗ.Добавить();			
		СтрокаТЗ.nrecblacklist = Выборка.fields("nrecblacklist").value; 
		СтрокаТЗ.fiof = Выборка.fields("fiof").value; 
		СтрокаТЗ.datar = Выборка.fields("datar").value; 
		СтрокаТЗ.kodclient = Выборка.fields("kodclient").value; 
		СтрокаТЗ.nobj = Выборка.fields("nobj").value;
		СтрокаТЗ.fam = Выборка.fields("fam").value;
		СтрокаТЗ.name = Выборка.fields("name").value;
		СтрокаТЗ.patr = Выборка.fields("patr").value;
		
		Выборка.movenext();
	КонецЦикла; 
	
	АдоСоединение.Close() ; 
		
	ЛБ_ОбменLX.ЗагрузитьЗалогодателя(ТЗ, тзСтран, тзПервыхДатЗБ, тзЧерныеСтатусыКлиентов); 
	
	Возврат Истина;
	
КонецФункции



