
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	Если Объект.Ссылка = справочники.ЛБ_ОтделенияЛомбардов.ЛомбардыВнеОтделений Тогда  
		Элементы.Ломбарды.Видимость = Ложь;
	Иначе	
		УстановитьОтборЛомбарды();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборЛомбарды() 
	ЭлементОтбора = Ломбарды.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отделение");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
КонецПроцедуры	

&НаСервере
Процедура ПослеУстановкиВОтделение(Результат, ДопПараметры) Экспорт
	Ломбарды.Отбор.Элементы.Очистить();
	УстановитьОтборЛомбарды();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВОтделение(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Необходимо сначала записать элемент справочника", Статуссообщения.Информация);
		Возврат;
	КонецЕсли;	

	Параметрыформы = Новый структура;
	ПараметрыФормы.Вставить("Отделение", Объект.Ссылка);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеУстановкиВОтделение", ЭтаФорма);
	ОткрытьФорму("Документ.ЛБ_УстановитьЛомбардыВОтделение.ФормаОбъекта", Параметрыформы, ЭтотОбъект,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
