
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Объект.Дата = ТекущаяДата(); 
		Объект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить();
		Объект.Ответственный = Пользователи.ТекущийПользователь(); 
	Иначе
		Если ЛБ_УправлениеЛомбардом.ЕстьНакладныеНаОтгрузу(Объект.Ссылка) Тогда
			Этаформа.ТолькоПросмотр = Истина;
        КонецЕсли;
	КонецЕсли;            
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);

	УстановитьСостояниеДокумента(); 
	ЛБ_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(, Объект, ЭтаФорма);
КонецПроцедуры   

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ЛБ_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(, Объект, ЭтаФорма);	
	УстановитьСостояниеДокумента();
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры   
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


&НаКлиенте
Процедура ВыборПериодаПриИзменении(Элемент)
	Объект.ПорядокВыбораДня = ВыборПериода;
КонецПроцедуры

&НаКлиенте
Процедура ВыборДняНеделиПриИзменении(Элемент)
	Объект.ДеньНедели = ВыборДняНедели;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность()
	Если НЕ Объект.ЕстьОграничениеОценки Тогда 
		Элементы.СуммаОценки.ТолькоПросмотр = Истина;
	Иначе 
		Элементы.СуммаОценки.ТолькоПросмотр = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	 ВыборПериода = Объект.ПорядокВыбораДня;  
	 ВыборДняНедели = Объект.ДеньНедели;
	 УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ЕстьОграничениеОценкиПриИзменении(Элемент) 
	Если НЕ Объект.ЕстьОграничениеОценки Тогда 
		Объект.СуммаОценки = 0;
	КонецЕсли;	
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.ЕстьОграничениеОценки Тогда
		Если Объект.СуммаОценки = 0 Тогда
			Сообщить("Не выбрана оценка залога для ограничения включения в залоговый билет!");  
			Отказ = Истина;
		КонецЕсли; 
		Если НЕ ЗначениеЗаполнено(Объект.СообщениеВключениеЗБ) Тогда
			Сообщить("Не заполнено сообщение пользователю для ограничения включения в залоговый билет!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;	 

КонецПроцедуры
