&НаКлиенте
Перем ВыполняетсяЗакрытие;

&НаСервере
Функция ПолучитьКаталогВременныхФайлов()
    Возврат Константы.ЛБ_КаталогВременныхФайлов.Получить();  
КонецФункции

&НаКлиенте
// Функция формирует уникальное имя временного файла
//
// Параметры
//  Нет
//
// Возвращаемое значение
//  Строка - имя временного файла
//
Функция УстановитьИмяВременногоФайла() 
	
	КаталогВременныхФайлов = ПолучитьКаталогВременныхФайлов();
	Если НЕ Прав(СокрЛП(КаталогВременныхФайлов), 1) = "\" Тогда		
	    КаталогВременныхФайлов = СокрЛП(КаталогВременныхФайлов) + "\";
	КонецЕсли;	
	Возврат КаталогВременныхФайлов +  Строка(Новый УникальныйИдентификатор)+".doc";
	
КонецФункции

&НаСервере
Функция ПроверитьШаблон()
	СпрОбъект = РеквизитФормыВЗначение("Объект");
	Если ТипЗнч(СпрОбъект.ХранилищеШаблона.Получить()) = Тип("ДвоичныеДанные") Тогда
		ДД = СпрОбъект.ХранилищеШаблона.Получить();
		АдресВременногоХранилища = ПоместитьВоВременноеХранилище(ДД,ЭтаФорма.УникальныйИдентификатор);
		Возврат АдресВременногоХранилища;
	КонецЕсли;
	Возврат "";
КонецФункции	

&НаКлиенте
Процедура РедактироватьШаблон(Команда)
	Если мШаблонУдален Тогда
		Сообщить("Шаблон не загружен!");
	ИначеЕсли мСохранитьВХранилище Тогда
		Сообщить("Необходимо сначала записать шаблон!");
	Иначе	
		мИмяВременногоФайла = УстановитьИмяВременногоФайла();  
		Адрес = ПроверитьШаблон();
		Если НЕ Пустаястрока(Адрес) Тогда
		    ДД=ПолучитьИзВременногоХранилища(Адрес);
			ДД.Записать(мИмяВременногоФайла);
		    ЗапуститьПриложение(мИмяВременногоФайла);
			//ФайловаяСистемаКлиент.ОткрытьФайл(мИмяВременногоФайла);
		Иначе
			Сообщить("Шаблон не загружен!");
		КонецЕсли;	
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
// Функция возвращает данные о файле выбранном пользователем в диалоге
//
// Параметры: 
//  Фильтр - строка, содержащая описание фильтра для диалога выбора файла
//
// Возвращаемое значение:
//  Структура, содержащая полное имя, каталог и расширение выбранного файла
//
Функция ВыборФайла(Фильтр) Экспорт
	
	Результат = Новый Структура;
	
	Диалог	= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.ПолноеИмяФайла = "";
	Диалог.ПредварительныйПросмотр = Истина;
	Диалог.Заголовок = "Выберите файл";
	Диалог.Фильтр = Фильтр;
	Диалог.ИндексФильтра					=	0;
	Диалог.ПроверятьСуществованиеФайла	=	Истина;
	
	Если Диалог.Выбрать() Тогда
		Результат.Вставить("Каталог",Диалог.Каталог);
		Результат.Вставить("ПолноеИмяФайла",Диалог.ПолноеИмяФайла);
		Результат.Вставить("Расширение",ЛБ_ОбщегоНазначения.ПолучитьРасширениеФайла(Диалог.ПолноеИмяФайла));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаписатьШаблон()
	СпрОбъект = РеквизитФормыВЗначение("Объект");
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХранилища); 
	
	//СпрОбъект.ХранилищеШаблона = Новый ХранилищеЗначения(Новый ДвоичныеДанные(мИмяВременногоФайла));
	СпрОбъект.ХранилищеШаблона = Новый ХранилищеЗначения(ДвоичныеДанные);
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьШаблон(Команда)
	Фильтр = "DOC (*.doc)|*.doc|DOCX (*.docx)|*.docx"; 
	ВыбранныйФайл = ВыборФайла(Фильтр);
	ПолноеИмяФайла = Неопределено;
	ВыбранныйФайл.Свойство("ПолноеИмяФайла",ПолноеИмяФайла);
	Если ПолноеИмяФайла = Неопределено Тогда
		Сообщить("Шаблон не выбран!");
		Возврат;
	КонецЕсли;	
	ПолноеИмяФайла = ВыбранныйФайл.ПолноеИмяФайла;
	Если ЗначениеЗаполнено(ПолноеИмяФайла) Тогда
		Ф = Новый Файл(ПолноеИмяФайла);
		Если Ф.Существует() Тогда
			//мИмяВременногоФайла = УстановитьИмяВременногоФайла();
			//КопироватьФайл(ПолноеИмяФайла, мИмяВременногоФайла); 
			ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяФайла);
	        Идентификатор  = Новый УникальныйИдентификатор;
	
	        АдресХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Идентификатор); 
			
			ЗаписатьШаблон();
			мСохранитьВХранилище = Истина;
			УстановитьСостояниеШаблона(Истина);
		Иначе
			Сообщить("Выбранный файл не существует!");
		КонецЕсли;	
	Иначе
		Сообщить("Файл не выбран!");
	КонецЕсли;	

КонецПроцедуры


&НаКлиенте
Процедура ОчиститьШаблон(Команда)
	мШаблонУдален = Истина;
	мСохранитьВХранилище = Истина;
	УстановитьСостояниеШаблона();
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если НЕ мИмяВременногоФайла = Неопределено Тогда
		Попытка
			УдалитьФайлы(мИмяВременногоФайла);
		Исключение
			// ++ Сербаев 22.05.2023
			//Сообщить("Не удалось удалить временный файл, использовавшийся для просмотра или загрузки шаблона ",СтатусСообщения.Информация);
			// -- Сербаев 22.05.2023
		КонецПопытки;	
		мИмяВременногоФайла = Неопределено;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПроверитьСостояниеШаблона()
	СпрОбъект = РеквизитФормыВЗначение("Объект");
	Если ТипЗнч(СпрОбъект.ХранилищеШаблона.Получить()) = Тип("ДвоичныеДанные") Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура УстановитьСостояниеШаблона(ЕстьШаблон = Ложь)
	Если ЕстьШаблон Тогда
		Элементы.СостояниеШаблона.Заголовок = "шаблон загружен";
	Иначе
		Элементы.СостояниеШаблона.Заголовок = "шаблон не загружен";
    КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
КонецПроцедуры


&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если мСохранитьВХранилище Тогда
		Если мШаблонУдален Тогда
			ТекущийОбъект.ХранилищеШаблона = Новый ХранилищеЗначения(Неопределено);
		Иначе	    
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХранилища);      
			ТекущийОбъект.ХранилищеШаблона = Новый ХранилищеЗначения(ДвоичныеДанные);
		    //ТекущийОбъект.ХранилищеШаблона = Новый ХранилищеЗначения(Новый ДвоичныеДанные(мИмяВременногоФайла));
		КонецЕсли;	
		ТекущийОбъект.Записать();
		мСохранитьВХранилище = Ложь;
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//мИмяВременногоФайла = Неопределено;

	ШаблонЗагружен = ПроверитьСостояниеШаблона();
	УстановитьСостояниеШаблона(ШаблонЗагружен);
КонецПроцедуры
 
&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ПараметрыЗаписи) Экспорт
        
         Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
                   ВыполняетсяЗакрытие = Истина;
                   Закрыть();
         КонецЕсли;
        
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если мСохранитьВХранилище Тогда
		Если Не ВыполняетсяЗакрытие Тогда
		    Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);	
	 
	        ПоказатьВопрос(Оповещение,
	           "Объект был модифицирован. После закрытия изменения не будут сохранены. Закрыть форму?", РежимДиалогаВопрос.ДаНетОтмена, 0, КодВозвратаДиалога.Да);

		 КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

ВыполняетсяЗакрытие = Ложь;

