&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Залогодатель") Тогда
		Отчет.Залогодатель = Параметры.Залогодатель;
	КонецЕсли;  
	Если ЗначениеЗаполнено(Отчет.Залогодатель) Тогда
		Отчет.НачПериода = Дата(1,1,1);
		Отчет.КонПериода = Дата(1,1,1);
		Отчет.Горизонтальный = Истина;
		СформироватьНаСервере();
	КонецЕсли;
 КонецПроцедуры

&НаКлиенте
Процедура НастроитьИнтервал(Команда)
	
	ДиалогРедактирования = Новый ДиалогРедактированияСтандартногоПериода;
	
	Если ДиалогРедактирования.Редактировать() Тогда
		Отчет.НачПериода	= ДиалогРедактирования.Период.ДатаНачала;
		Отчет.КонПериода 	= ДиалогРедактирования.Период.ДатаОкончания;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если НЕ ЗначениеЗаполнено(Отчет.Залогодатель) Тогда
		Сообщить("Не выбран залогодатель!");
		Возврат;
	КонецЕсли;
	
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуИзменений(Изменения, ТаблицаИзменений)
	 ТаблицаИзменений.Очистить();
	 КоличествоСтрок = СтрЧислоСтрок(Изменения);
	 Для НомерСтроки = 1 По КоличествоСтрок Цикл   
		 ИсходнаяСтрока = СтрПолучитьСтроку(Изменения, НомерСтроки);
		 Поз = Найти(ИсходнаяСтрока, "Изменен");
		 Если НЕ Поз = 0 Тогда
			 ИсходнаяСтрока = Сред(ИсходнаяСтрока, Поз + 7);  
			 Пока НЕ Лев(ИсходнаяСтрока, 1) = " " Цикл  
				  ИсходнаяСтрока = " " + Сред(ИсходнаяСтрока, 2);
			 КонецЦикла;	 
			 
			 Поз = Найти(ИсходнаяСтрока, " с "); 
			 Если НЕ Поз = 0 Тогда 
				 Вид = СокрЛП(Сред(ИсходнаяСтрока, 1, Поз-1)); 
				 НоваяСтр = ТаблицаИзменений.Добавить(); 
				 НоваяСтр.Вид = Врег(Лев(Вид,1)) + Сред(Вид, 2);
				 ИсходнаяСтрока = Сред(ИсходнаяСтрока, Поз + 2);
				 
				 Поз = Найти(ИсходнаяСтрока, " на ");
				 Если НЕ Поз = 0 Тогда 
					 СтароеЗнч = Сред(ИсходнаяСтрока, 1, Поз-1);
					 СтароеЗнч = СтрЗаменить(СтароеЗнч, "<", "");
					 СтароеЗнч = СтрЗаменить(СтароеЗнч, ">", ""); 
					 СтароеЗнч = СокрЛП(СтароеЗнч);  
					 НоваяСтр.ЗначениеСтарое = СтароеЗнч;  
					 
					 НовоеЗнч = Сред(ИсходнаяСтрока, Поз+3);
					 НовоеЗнч = СтрЗаменить(НовоеЗнч, "<", "");
					 НовоеЗнч = СтрЗаменить(НовоеЗнч, ">", ""); 
					 НовоеЗнч = СокрЛП(НовоеЗнч);  
					 НоваяСтр.ЗначениеНовое = НовоеЗнч;
				 КонецЕсли;	 
			 КонецЕсли;	 
		 КонецЕсли;	 
	 КонецЦикла;
	 Возврат ТаблицаИзменений;
 КонецФункции      
 
 &НаСервере
Функция ПолучитьТаблицуИзмененийДок(Изменения, ПричинаИзменения, Документ, ТаблицаИзменений)
	 КоличествоСтрок = СтрЧислоСтрок(Изменения);
	 Для НомерСтроки = 1 По КоличествоСтрок Цикл   
		 ИсходнаяСтрока = СтрПолучитьСтроку(Изменения, НомерСтроки);
		 Поз = Найти(ИсходнаяСтрока, "Изменен");
		 Если НЕ Поз = 0 Тогда
			 ИсходнаяСтрока = Сред(ИсходнаяСтрока, Поз + 7);  
			 Пока НЕ Лев(ИсходнаяСтрока, 1) = " " Цикл  
				  ИсходнаяСтрока = " " + Сред(ИсходнаяСтрока, 2);
			 КонецЦикла;	 
			 
			 Поз = Найти(ИсходнаяСтрока, " с "); 
			 Если НЕ Поз = 0 Тогда 
				 Вид = СокрЛП(Сред(ИсходнаяСтрока, 1, Поз-1)); 
				 НоваяСтр = ТаблицаИзменений.Добавить(); 
				 НоваяСтр.Вид = Врег(Лев(Вид,1)) + Сред(Вид, 2);  
				 НоваяСтр.ПричинаИзменения = ПричинаИзменения;
			     НоваяСтр.Документ = Документ;
				 ИсходнаяСтрока = Сред(ИсходнаяСтрока, Поз + 2);
				 
				 Поз = Найти(ИсходнаяСтрока, " на ");
				 Если НЕ Поз = 0 Тогда 
					 СтароеЗнч = Сред(ИсходнаяСтрока, 1, Поз-1);
					 СтароеЗнч = СтрЗаменить(СтароеЗнч, "<", "");
					 СтароеЗнч = СтрЗаменить(СтароеЗнч, ">", ""); 
					 СтароеЗнч = СокрЛП(СтароеЗнч);  
					 НоваяСтр.ЗначениеСтарое = СтароеЗнч;  
					 
					 НовоеЗнч = Сред(ИсходнаяСтрока, Поз+3);
					 НовоеЗнч = СтрЗаменить(НовоеЗнч, "<", "");
					 НовоеЗнч = СтрЗаменить(НовоеЗнч, ">", ""); 
					 НовоеЗнч = СокрЛП(НовоеЗнч);  
					 НоваяСтр.ЗначениеНовое = НовоеЗнч;
				 КонецЕсли;	 
			 КонецЕсли;	 
		 КонецЕсли;	 
	 КонецЦикла;   
	 Если ТаблицаИзменений.Количество() = 0 Тогда 
		 Если Изменения = "Создан новый документ" Тогда
			 НоваяСтр = ТаблицаИзменений.Добавить(); 
			 НоваяСтр.ПричинаИзменения = ?(ЗначениеЗаполнено(ПричинаИзменения), ПричинаИзменения, Изменения);
			 НоваяСтр.Документ = Документ;
			 НоваяСтр.Вид = "";
			 НоваяСтр.ЗначениеСтарое = ""; 
			 НоваяСтр.ЗначениеНовое = "";
         КонецЕсли;
	 КонецЕсли;	 
	 Возврат ТаблицаИзменений;
КонецФункции

&НаСервере
Функция ПолучитьПричинуОтказа(Регистратор)	
	ЗапросС = Новый Запрос; 
	ЗапросС.УстановитьПараметр("Залогодатель", Отчет.Залогодатель);  
	ЗапросС.УстановитьПараметр("Регистратор", Регистратор);  
	ЗапросС.Текст = "ВЫБРАТЬ
	                |	ЛБ_ОтказыКлиентамВОбслуживании.Изменения КАК Изменения
	                |ИЗ
	                |	РегистрСведений.ЛБ_ОтказыКлиентамВОбслуживании КАК ЛБ_ОтказыКлиентамВОбслуживании
	                |ГДЕ
	                |	ЛБ_ОтказыКлиентамВОбслуживании.Залогодатель = &Залогодатель
	                |	И ЛБ_ОтказыКлиентамВОбслуживании.Регистратор = &Регистратор";
	
	ВыборкаС = ЗапросС.Выполнить().Выбрать();
	Если ВыборкаС.Следующий() тогда
		Возврат ВыборкаС.Изменения;  
	КонецЕсли;		
	Возврат "";	
КонецФункции	   

&НаСервере
Функция ПолучитьСтатусКлиента(Дата)	
	ЗапросС = Новый Запрос; 
	ЗапросС.УстановитьПараметр("Залогодатель", Отчет.Залогодатель);  
	ЗапросС.УстановитьПараметр("Дата", Дата);  
	ЗапросС.Текст = "ВЫБРАТЬ
	                |	ЛБ_СтатусыЗалогодателейСрезПоследних.Статус КАК Статус
	                |ИЗ
	                |	РегистрСведений.ЛБ_СтатусыЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_СтатусыЗалогодателейСрезПоследних";
	
	ВыборкаС = ЗапросС.Выполнить().Выбрать();
	Если ВыборкаС.Следующий() тогда
		Возврат ВыборкаС.Статус;  
	КонецЕсли;		
	Возврат неопределено;	
КонецФункции	   

&НаСервере
Функция ПолучитьСтатусыКлиентаДоп(Регистратор, Статус) 
	Результат = Новый Структура;
	Результат.Вставить("ЗначениеСтарое", "не установлен");
	Результат.Вставить("ЗначениеНовое", "не установлен");
	
	ЗапросС = Новый Запрос; 
	ЗапросС.УстановитьПараметр("Залогодатель", Отчет.Залогодатель);	
	ЗапросС.УстановитьПараметр("Статус", Статус);
	ЗапросС.Текст = "ВЫБРАТЬ
	                |	ЛБ_СтатусыЗалогодателейСрезПоследних.Используется КАК Используется,
	                |	ЛБ_СтатусыЗалогодателейСрезПоследних.СрокДействия КАК СрокДействия,
	                |	ЛБ_СтатусыЗалогодателейСрезПоследних.Комментарий КАК Комментарий
	                |ИЗ
	                |	РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(
	                |			&МомВрем,
	                |			Залогодатель = &Залогодатель
	                |				И Статус = &Статус) КАК ЛБ_СтатусыЗалогодателейСрезПоследних";
	ЗапросС.УстановитьПараметр("МомВрем", Новый Граница(Регистратор.МоментВремени(), ВидГраницы.Исключая));  
	ВыборкаС = ЗапросС.Выполнить().Выбрать();
	Если ВыборкаС.Следующий() тогда
		Результат.ЗначениеСтарое = ?(ВыборкаС.Используется, "установлен", "не установлен");  
		Если ВыборкаС.Используется Тогда
			Если НЕ ВыборкаС.СрокДействия = Дата(1,1,1) Тогда 
			    Результат.ЗначениеСтарое = Результат.ЗначениеСтарое + " до " + Формат(КонецДня(ВыборкаС.СрокДействия)+1, "ДФ=dd.MM.yyyy");
			КонецЕсли;	
			Результат.ЗначениеСтарое = Результат.ЗначениеСтарое + ?(ПустаяСтрока(ВыборкаС.Комментарий), "", " " + СокрЛП(ВыборкаС.Комментарий));
		КонецЕсли;	
	КонецЕсли;
	
	ЗапросС.Текст = "ВЫБРАТЬ
	                |	ЛБ_СтатусыЗалогодателей.Используется КАК Используется,
	                |	ЛБ_СтатусыЗалогодателей.СрокДействия КАК СрокДействия,
	                |	ЛБ_СтатусыЗалогодателей.Комментарий КАК Комментарий
	                |ИЗ
	                |	РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные КАК ЛБ_СтатусыЗалогодателей
	                |ГДЕ
	                |	ЛБ_СтатусыЗалогодателей.Регистратор = &Регистратор
	                |	И ЛБ_СтатусыЗалогодателей.Залогодатель = &Залогодатель
	                |	И ЛБ_СтатусыЗалогодателей.Статус = &Статус";
	ЗапросС.УстановитьПараметр("Регистратор", Регистратор);  
	ВыборкаС = ЗапросС.Выполнить().Выбрать();
	Если ВыборкаС.Следующий() тогда
		Результат.ЗначениеНовое = ?(ВыборкаС.Используется, "установлен", "не установлен");  
		Если ВыборкаС.Используется Тогда
			Если НЕ ВыборкаС.СрокДействия = Дата(1,1,1) Тогда 
			    Результат.ЗначениеНовое = Результат.ЗначениеНовое + " до " + Формат(КонецДня(ВыборкаС.СрокДействия)+1, "ДФ=dd.MM.yyyy");
			КонецЕсли;	
			Результат.ЗначениеНовое = Результат.ЗначениеНовое + ?(ПустаяСтрока(ВыборкаС.Комментарий), "", ", " + СокрЛП(ВыборкаС.Комментарий));
		КонецЕсли;	
	Иначе
		Результат.ЗначениеНовое = Результат.ЗначениеСтарое;
	КонецЕсли;  
		
	Возврат Результат;	
КонецФункции	                            

&НаСервере
Функция ПолучитьСтатусыКлиентаСлужебные(Регистратор, Статус) 
	Результат = Новый Структура;
	Результат.Вставить("ЗначениеСтарое", "не установлен");
	Результат.Вставить("ЗначениеНовое", "не установлен");
	
	ЗапросС = Новый Запрос; 
	ЗапросС.УстановитьПараметр("Залогодатель", Отчет.Залогодатель);	
	ЗапросС.УстановитьПараметр("Статус", Статус);
	ЗапросС.Текст = "ВЫБРАТЬ
	                |	ЛБ_СтатусыЗалогодателейСрезПоследних.Используется КАК Используется,
	                |	ЛБ_СтатусыЗалогодателейСрезПоследних.Комментарий КАК Комментарий
	                |ИЗ
	                |	РегистрСведений.ЛБ_СтатусыЗалогодателейСлужебные.СрезПоследних(
	                |			&МомВрем,
	                |			Залогодатель = &Залогодатель
	                |				И Статус = &Статус) КАК ЛБ_СтатусыЗалогодателейСрезПоследних";
	ЗапросС.УстановитьПараметр("МомВрем", Новый Граница(Регистратор.МоментВремени(), ВидГраницы.Исключая));  
	ВыборкаС = ЗапросС.Выполнить().Выбрать();
	Если ВыборкаС.Следующий() тогда
		Результат.ЗначениеСтарое = ?(ВыборкаС.Используется, "установлен", "не установлен");  
		Если ВыборкаС.Используется Тогда 
			Результат.ЗначениеСтарое = Результат.ЗначениеСтарое + ?(ПустаяСтрока(ВыборкаС.Комментарий), "", ", " + СокрЛП(ВыборкаС.Комментарий));
        КонецЕсли;
	КонецЕсли;
	
	ЗапросС.Текст = "ВЫБРАТЬ
	                |	ЛБ_СтатусыЗалогодателей.Используется КАК Используется,
	                |	ЛБ_СтатусыЗалогодателей.Комментарий КАК Комментарий
	                |ИЗ
	                |	РегистрСведений.ЛБ_СтатусыЗалогодателейСлужебные КАК ЛБ_СтатусыЗалогодателей
	                |ГДЕ
	                |	ЛБ_СтатусыЗалогодателей.Регистратор = &Регистратор
	                |	И ЛБ_СтатусыЗалогодателей.Залогодатель = &Залогодатель
	                |	И ЛБ_СтатусыЗалогодателей.Статус = &Статус";
	ЗапросС.УстановитьПараметр("Регистратор", Регистратор);  
	ВыборкаС = ЗапросС.Выполнить().Выбрать();
	Если ВыборкаС.Следующий() тогда
		Результат.ЗначениеНовое = ?(ВыборкаС.Используется, "установлен", "не установлен"); 
		Если ВыборкаС.Используется Тогда 
			Результат.ЗначениеНовое = Результат.ЗначениеНовое + ?(ПустаяСтрока(ВыборкаС.Комментарий), "", ", " + СокрЛП(ВыборкаС.Комментарий));
        КонецЕсли;
	Иначе
		Результат.ЗначениеНовое = Результат.ЗначениеСтарое;
	КонецЕсли;  
		
	Возврат Результат;	
КонецФункции	                            

&НаСервере
Процедура СформироватьНаСервере()
	
	ТаблицаИзменений = Новый ТаблицаЗначений; 
	ТаблицаИзменений.Колонки.Добавить("Вид"); 
	ТаблицаИзменений.Колонки.Добавить("ЗначениеСтарое");
	ТаблицаИзменений.Колонки.Добавить("ЗначениеНовое");
	
	ТаблицаИзмененийДок = Новый ТаблицаЗначений; 
	ТаблицаИзмененийДок.Колонки.Добавить("Документ");
	ТаблицаИзмененийДок.Колонки.Добавить("ПричинаИзменения");
	ТаблицаИзмененийДок.Колонки.Добавить("Вид"); 
	ТаблицаИзмененийДок.Колонки.Добавить("ЗначениеСтарое");
	ТаблицаИзмененийДок.Колонки.Добавить("ЗначениеНовое"); 
	ТаблицаИзмененийДок.Колонки.Добавить("Обработано");

	
	ДокументРезультат.Очистить(); 
	
	НачДата = Отчет.НачПериода;
	КонДата = ?(Отчет.КонПериода = Дата(1,1,1), ТекущаяДата(), КонецДня(Отчет.КонПериода));

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Залогодатель", Отчет.Залогодатель); 
	Запрос.УстановитьПараметр("ПустаяПричинаИзмененияФИО", Справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПериодНач", НачДата);
	Запрос.УстановитьПараметр("ПериодКон", КонДата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателей.Период КАК Период,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателей.Регистратор КАК Регистратор,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателей.ПричинаИзменения КАК ПричинаИзменения,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателей.ПричинаИзмененияФИО КАК ПричинаИзмененияФИО,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателей.Ответственный КАК Ответственный,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателей.ОтветственныйЛомбард КАК ОтветственныйЛомбард,	//+++ МоисеевЕС 20250526
	               |	ЛБ_КонтактнаяИнформацияЗалогодателей.Изменения КАК Изменения,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателей.ОснованиеИзмененияФИО КАК ОснованиеИзмененияФИО,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателей.СменилсяАдресПрописки КАК СменилсяАдресПрописки,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателей.СменилсяФактическийАдрес КАК СменилсяФактическийАдрес,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателей.СменилсяПочтовыйАдрес КАК СменилсяПочтовыйАдрес,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателей.ПричинаИзмененияАдресаПоПрописке КАК ПричинаИзмененияАдресаПоПрописке,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателей.ПричинаИзмененияФактическогоАдреса КАК ПричинаИзмененияФактическогоАдреса,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателей.ПричинаИзмененияПочтовогоАдреса КАК ПричинаИзмененияПочтовогоАдреса
	               |ИЗ
	               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей КАК ЛБ_КонтактнаяИнформацияЗалогодателей
	               |ГДЕ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателей.Залогодатель = &Залогодатель
	               |	И ЛБ_КонтактнаяИнформацияЗалогодателей.Период МЕЖДУ &ПериодНач И &ПериодКон
	               |АВТОУПОРЯДОЧИВАНИЕ";
	ТаблицаКИ = Запрос.Выполнить().Выгрузить();
	ТаблицаКарточкаЗалогодателя = ТаблицаКИ.Скопировать();
	ТаблицаКарточкаЗалогодателя.Свернуть("Период, Регистратор");  
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_АнкетаЗалогодателя.Период КАК Период,
	               |	ЛБ_АнкетаЗалогодателя.Регистратор КАК Регистратор,
	               |	ЛБ_АнкетаЗалогодателя.ПричинаИзменения КАК ПричинаИзменения,
	               |	ЛБ_АнкетаЗалогодателя.Ответственный КАК Ответственный,
	               |	ЛБ_АнкетаЗалогодателя.Изменения КАК Изменения
	               |ИЗ
	               |	РегистрСведений.ЛБ_АнкетаЗалогодателя КАК ЛБ_АнкетаЗалогодателя
	               |ГДЕ
	               |	ЛБ_АнкетаЗалогодателя.Залогодатель = &Залогодатель
	               |	И ЛБ_АнкетаЗалогодателя.Период МЕЖДУ &ПериодНач И &ПериодКон
	               |АВТОУПОРЯДОЧИВАНИЕ";
	ТаблицаАнкета = Запрос.Выполнить().Выгрузить();
	Для каждого Выборка Из ТаблицаАнкета Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Период", Выборка.Период);
		Отбор.Вставить("Регистратор", Выборка.Регистратор);
		 
		Строки = ТаблицаКарточкаЗалогодателя.НайтиСтроки(Отбор);
		Если Строки.Количество() = 0 Тогда
			НоваяСтр = ТаблицаКарточкаЗалогодателя.Добавить();
			НоваяСтр.Период = Выборка.Период;
			НоваяСтр.Регистратор = Выборка.Регистратор;
		КонецЕсли;	
	КонецЦикла;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателей.Период КАК Период,
	               |	ЛБ_ДокументыЗалогодателей.Регистратор КАК Регистратор,
	               |	ЛБ_ДокументыЗалогодателей.ПричинаИзменения КАК ПричинаИзменения,
	               |	ЛБ_ДокументыЗалогодателей.Ответственный КАК Ответственный,
	               |	ЛБ_ДокументыЗалогодателей.Изменения КАК Изменения,
	               |	ЛБ_ДокументыЗалогодателей.ДокументЗалогодателя КАК Документ,
	               |	ЛБ_ДокументыЗалогодателей.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателей.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_ДокументыЗалогодателей.Гражданство КАК Гражданство,
	               |	ЛБ_ДокументыЗалогодателей.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	               |	ЛБ_ДокументыЗалогодателей.ДокументКемВыдан КАК ДокументКемВыдан,
	               |	ЛБ_ДокументыЗалогодателей.ДокументКодПодразделения КАК ДокументКодПодразделения,
	               |	ЛБ_ДокументыЗалогодателей.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателей.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателей.ДокументСрокДействия КАК ДокументСрокДействия
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей КАК ЛБ_ДокументыЗалогодателей
	               |ГДЕ
	               |	ЛБ_ДокументыЗалогодателей.ДокументЗалогодателя.Владелец = &Залогодатель
	               |	И ЛБ_ДокументыЗалогодателей.Период МЕЖДУ &ПериодНач И &ПериодКон
	               |АВТОУПОРЯДОЧИВАНИЕ";
	ТаблицаДок = Запрос.Выполнить().Выгрузить();
	
	Для каждого Выборка Из ТаблицаДок Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Период", Выборка.Период);
		Отбор.Вставить("Регистратор", Выборка.Регистратор);
		 
		Строки = ТаблицаКарточкаЗалогодателя.НайтиСтроки(Отбор);
		Если Строки.Количество() = 0 Тогда
			НоваяСтр = ТаблицаКарточкаЗалогодателя.Добавить();
			НоваяСтр.Период = Выборка.Период;
			НоваяСтр.Регистратор = Выборка.Регистратор;
		КонецЕсли;	
	КонецЦикла;   
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Отказы.Период КАК Период,
	               |	Отказы.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрСведений.ЛБ_ОтказыКлиентамВОбслуживании КАК Отказы
	               |ГДЕ
	               |	Отказы.Период МЕЖДУ &ПериодНач И &ПериодКон
	               |	И Отказы.Залогодатель = &Залогодатель
	               |АВТОУПОРЯДОЧИВАНИЕ";
	ТаблицаСтатусы = Запрос.Выполнить().Выгрузить();
	
	Для каждого Выборка Из ТаблицаСтатусы Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Период", Выборка.Период);
		Отбор.Вставить("Регистратор", Выборка.Регистратор);
		 
		Строки = ТаблицаКарточкаЗалогодателя.НайтиСтроки(Отбор);
		Если Строки.Количество() = 0 Тогда
			НоваяСтр = ТаблицаКарточкаЗалогодателя.Добавить();
			НоваяСтр.Период = Выборка.Период;
			НоваяСтр.Регистратор = Выборка.Регистратор;
		КонецЕсли;	
	КонецЦикла; 
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СтатусыЗалогодателейДополнительные.Период КАК Период,
	               |	ЛБ_СтатусыЗалогодателейДополнительные.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные КАК ЛБ_СтатусыЗалогодателейДополнительные
	               |ГДЕ
	               |	ЛБ_СтатусыЗалогодателейДополнительные.Период МЕЖДУ &ПериодНач И &ПериодКон
	               |	И ЛБ_СтатусыЗалогодателейДополнительные.Залогодатель = &Залогодатель
				   //МАН 30.01.25 Изменил запрос, чтобы попадали документы приказа ВИП. Заявка 2792
	               //Было:|	И ЛБ_СтатусыЗалогодателейДополнительные.Регистратор ССЫЛКА Документ.ЛБ_КарточкаЗалогодателя
				   |	И (ЛБ_СтатусыЗалогодателейДополнительные.Регистратор ССЫЛКА Документ.ЛБ_КарточкаЗалогодателя
				   |		ИЛИ ЛБ_СтатусыЗалогодателейДополнительные.Регистратор ССЫЛКА Документ.ЛБ_ПриказИндивидуальныеУсловия)
				   //-МАН
	               |АВТОУПОРЯДОЧИВАНИЕ";
	ТаблицаСтатусыДополнительные = Запрос.Выполнить().Выгрузить();

	//МАН 30.01.25 Добавил колонку для дальнейшего заполнения. Заявка 2792.
	МасивТипов = Новый Массив;
	МасивТипов.Добавить(Тип("Булево"));
	
	МасивТиповД = Новый Массив;
	МасивТиповД.Добавить(Тип("Дата"));

	МасивТиповСтатус = Новый Массив;
	МасивТиповСтатус.Добавить(Тип("СправочникСсылка.ЛБ_СтатусыЗалогодателей"));
	
	МассивТиповПриказ = Новый Массив;
	МассивТиповПриказ.Добавить(Тип("ДокументСсылка.ЛБ_ПриказИндивидуальныеУсловия"));
	
	МассивТиповВидОперации = Новый Массив;
	МассивТиповВидОперации.Добавить(Тип("ПеречислениеСсылка.ЛБ_ВидыОперацийПриказы"));

	ОписаниеТиповБулево = Новый ОписаниеТипов(МасивТипов);
	ОписаниеТиповДата = Новый ОписаниеТипов(МасивТиповД);
	ОписаниеТиповСтатус = Новый ОписаниеТипов(МасивТиповСтатус);
	ОписаниеТиповПриказ = Новый ОписаниеТипов(МассивТиповПриказ);
	ОписаниеТиповВидыОперации = Новый ОписаниеТипов(МассивТиповВидОперации);
	
	ТаблицаКарточкаЗалогодателя.Колонки.Добавить("ВИП", ОписаниеТиповБулево, "ВИП");
	ТаблицаКарточкаЗалогодателя.Колонки.Добавить("ДатаЗаписи", ОписаниеТиповДата, "ДатаЗаписи");
	ТаблицаКарточкаЗалогодателя.Колонки.Добавить("Статус", ОписаниеТиповСтатус, "Статус");
	ТаблицаКарточкаЗалогодателя.Колонки.Добавить("Приказ", ОписаниеТиповПриказ, "Приказ");
	ТаблицаКарточкаЗалогодателя.Колонки.Добавить("ВидОперации", ОписаниеТиповВидыОперации, "ВидОперации");
	//-МАН
	
	Для каждого Выборка Из ТаблицаСтатусыДополнительные Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Период", Выборка.Период);
		Отбор.Вставить("Регистратор", Выборка.Регистратор);
		 
		Строки = ТаблицаКарточкаЗалогодателя.НайтиСтроки(Отбор);
		Если Строки.Количество() = 0 Тогда
			НоваяСтр = ТаблицаКарточкаЗалогодателя.Добавить();
			//+МАН
			//Было: НоваяСтр.Период = Выборка.Период;
			Если ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.ЛБ_ПриказИндивидуальныеУсловия") Тогда
				//+МАН 07.04.25 определяем какую дату будем записывать.
				Если НачалоДня(Выборка.Период) = НачалоДня(Выборка.Регистратор.Дата) Тогда
					НоваяСтр.Период = Выборка.Регистратор.Дата;
				Иначе
					НоваяСтр.Период = Выборка.Период;
				КонецЕсли;
			Иначе
				НоваяСтр.Период = Выборка.Период;
			КонецЕсли;
			//-МАН
			НоваяСтр.Регистратор = Выборка.Регистратор;
			//МАН 30.01.25 Добавил пометку, что это ВИП для дальнейшей проверки. Заявка 2792.
			Если ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.ЛБ_ПриказИндивидуальныеУсловия") Тогда
				НоваяСтр.ВИП = Истина;
				НоваяСтр.ВидОперации = Выборка.Регистратор.ВидОперации;
				НоваяСтр.Приказ = Выборка.Регистратор;
			КонецЕсли;
			//-МАН
		КонецЕсли;	
	КонецЦикла;    
	
	//проверим окончание срока действия служебных статусов  
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
	//+МАН 06.02.25 Закоментировал. Изменил запрос для получения полной информации по закончившимся условиям т.к. могут быть записи с одинаковым сроком окнончания.
	//Было:Запрос.Текст = "ВЫБРАТЬ
	//               |	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Период КАК Период,
	//               |	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Статус КАК Статус,
	//               |	ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.СрокДействия, ДЕНЬ), СЕКУНДА, 1) КАК СрокДействия,
	//               |	ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних.Комментарий КАК Комментарий
	//               |ИЗ
	//               |	РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные.СрезПоследних(
	//               |			&ПериодКон,
	//               |			Залогодатель = &Залогодатель
	//               |				И Используется = ИСТИНА
	//               |				И НЕ СрокДействия = &ПустаяДата
	//               |				И СрокДействия < НАЧАЛОПЕРИОДА(&ПериодКон, ДЕНЬ)) КАК ЛБ_СтатусыЗалогодателейДополнительныеСрезПоследних"; 
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СтатусыЗалогодателейДополнительные.Период КАК Период,
	               |	ЛБ_СтатусыЗалогодателейДополнительные.Статус КАК Статус,
	               |	ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ЛБ_СтатусыЗалогодателейДополнительные.СрокДействия, ДЕНЬ), СЕКУНДА, 1) КАК СрокДействия,
	               |	ЛБ_СтатусыЗалогодателейДополнительные.Комментарий КАК Комментарий,
	               |	ЛБ_СтатусыЗалогодателейДополнительные.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные КАК ЛБ_СтатусыЗалогодателейДополнительные
	               |ГДЕ
	               |	ЛБ_СтатусыЗалогодателейДополнительные.Используется
	               |	И НЕ ЛБ_СтатусыЗалогодателейДополнительные.СрокДействия = &ПустаяДата
	               |	И ЛБ_СтатусыЗалогодателейДополнительные.Залогодатель = &Залогодатель
	               |	И ЛБ_СтатусыЗалогодателейДополнительные.Период <= &ПериодКон
	               |	И ЛБ_СтатусыЗалогодателейДополнительные.СрокДействия < НАЧАЛОПЕРИОДА(&ПериодКон, ДЕНЬ)";
	//-МАН
	ТаблицаСтатусыДополнительныеОкончаниеДействия = Запрос.Выполнить().Выгрузить(); 
	Для каждого Выборка Из ТаблицаСтатусыДополнительныеОкончаниеДействия Цикл 
		Если Выборка.СрокДействия <= КонДата Тогда
			//+МАН 28.02.25
			//Было:
			//НоваяСтр = ТаблицаКарточкаЗалогодателя.Добавить();
			//НоваяСтр.Период = Выборка.СрокДействия; 
			//
			ЕстьУсловия = ПроверитьУсловияВДокументеПоЗалогодателю(Выборка.Регистратор, Отчет.Залогодатель);
			
			Если НЕ ЕстьУсловия Тогда
			//-МАН
				НоваяСтр = ТаблицаКарточкаЗалогодателя.Добавить();
				НоваяСтр.Период = Выборка.СрокДействия;
				//+МАН 06.02.25 Добавил запись периода для поиска регистратора. Заявка 2792
				НоваяСтр.ДатаЗаписи = Выборка.Период;
				НоваяСтр.Статус = Выборка.Статус;
				Если ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.ЛБ_ПриказИндивидуальныеУсловия") Тогда
					НоваяСтр.ВИП = Истина;
					НоваяСтр.ВидОперации = Выборка.Регистратор.ВидОперации;
					НоваяСтр.Приказ = Выборка.Регистратор;
				КонецЕсли;
			КонецЕсли;
			//-МАН
		КонецЕсли;	
    КонецЦикла;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СтатусыЗалогодателейСлужебные.Период КАК Период,
	               |	ЛБ_СтатусыЗалогодателейСлужебные.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрСведений.ЛБ_СтатусыЗалогодателейСлужебные КАК ЛБ_СтатусыЗалогодателейСлужебные
	               |ГДЕ
	               |	ЛБ_СтатусыЗалогодателейСлужебные.Период МЕЖДУ &ПериодНач И &ПериодКон
	               |	И ЛБ_СтатусыЗалогодателейСлужебные.Залогодатель = &Залогодатель
	               |	И ЛБ_СтатусыЗалогодателейСлужебные.Регистратор ССЫЛКА Документ.ЛБ_КарточкаЗалогодателя
	               |АВТОУПОРЯДОЧИВАНИЕ";
	ТаблицаСтатусыСлужебные = Запрос.Выполнить().Выгрузить();
	
	Для каждого Выборка Из ТаблицаСтатусыСлужебные Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Период", Выборка.Период);
		Отбор.Вставить("Регистратор", Выборка.Регистратор);
		 
		Строки = ТаблицаКарточкаЗалогодателя.НайтиСтроки(Отбор);
		Если Строки.Количество() = 0 Тогда
			НоваяСтр = ТаблицаКарточкаЗалогодателя.Добавить();
			НоваяСтр.Период = Выборка.Период;
			НоваяСтр.Регистратор = Выборка.Регистратор;
		КонецЕсли;	
	КонецЦикла;      
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СогласиеНаСМСРассылку.Период КАК Период,
	               |	ЛБ_СогласиеНаСМСРассылку.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрСведений.ЛБ_СогласиеНаСМСРассылку КАК ЛБ_СогласиеНаСМСРассылку
	               |ГДЕ
	               |	ЛБ_СогласиеНаСМСРассылку.Период МЕЖДУ &ПериодНач И &ПериодКон
	               |	И ЛБ_СогласиеНаСМСРассылку.Залогодатель = &Залогодатель
	               |АВТОУПОРЯДОЧИВАНИЕ";
	ТаблицаСогласиеНаСМСРассылку = Запрос.Выполнить().Выгрузить();
	
	Для каждого Выборка Из ТаблицаСогласиеНаСМСРассылку Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Период", Выборка.Период);
		Отбор.Вставить("Регистратор", Выборка.Регистратор);
		 
		Строки = ТаблицаКарточкаЗалогодателя.НайтиСтроки(Отбор);
		Если Строки.Количество() = 0 Тогда
			НоваяСтр = ТаблицаКарточкаЗалогодателя.Добавить();
			НоваяСтр.Период = Выборка.Период;
			НоваяСтр.Регистратор = Выборка.Регистратор;
		КонецЕсли;	
	КонецЦикла;      		

	
	//+МАН 30.01.25 Добавил ВИП. Заявка 2792
	//Было: ТаблицаКарточкаЗалогодателя.Свернуть("Период, Регистратор");
	ТаблицаКарточкаЗалогодателя.Свернуть("Период, Регистратор, ВИП, ДатаЗаписи, Статус, Приказ, ВидОперации");
	//-МАН
	
	//++ИвановВВ, подписание заявления об изменении конт. данных
	ТаблицаКарточкаЗалогодателя.Колонки.Добавить("ЗаявлениеОбИзменении", Новый ОписаниеТипов("Булево"));
	ТаблицаКарточкаЗалогодателя.Колонки.Добавить("ЗаявлениеОбИзмененииДанные", Новый ОписаниеТипов("Структура"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛБ_ИзменениеКонтактныхДанныхКлиента.Период КАК Период,
	|	ЛБ_ИзменениеКонтактныхДанныхКлиента.Ответственный КАК Ответственный,
	|	ЛБ_ИзменениеКонтактныхДанныхКлиента.Ломбард КАК Ломбард,
	|	ЛБ_ИзменениеКонтактныхДанныхКлиента.Статус КАК Статус,
	|	ЛБ_ИзменениеКонтактныхДанныхКлиента.Основание КАК Основание
	|ИЗ
	|	РегистрСведений.ЛБ_ИзменениеКонтактныхДанныхКлиента КАК ЛБ_ИзменениеКонтактныхДанныхКлиента
	|ГДЕ
	|	ЛБ_ИзменениеКонтактныхДанныхКлиента.Клиент = &Клиент";
	
	Запрос.УстановитьПараметр("Клиент", Отчет.Залогодатель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрокаТЗКарточкаЗалогодателя = ТаблицаКарточкаЗалогодателя.Добавить();
		НоваяСтрокаТЗКарточкаЗалогодателя.Период = Выборка.Период;
		НоваяСтрокаТЗКарточкаЗалогодателя.ЗаявлениеОбИзменении = Истина;
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("Ответственный", Выборка.Ответственный);
		СтруктураДанных.Вставить("Ломбард", Выборка.Ломбард);
		СтруктураДанных.Вставить("Статус", Выборка.Статус);
		СтруктураДанных.Вставить("Основание", Выборка.Основание);
		НоваяСтрокаТЗКарточкаЗалогодателя.ЗаявлениеОбИзмененииДанные = СтруктураДанных;
	КонецЦикла;
	//--ИвановВВ
		
	// ++ Сербаев 15.05.2023
	//ТаблицаКарточкаЗалогодателя.Сортировать("Период");
	Если Отчет.СортироватьПоУбыванию Тогда
	    ТаблицаКарточкаЗалогодателя.Сортировать("Период УБЫВ");
	Иначе	
	    ТаблицаКарточкаЗалогодателя.Сортировать("Период");
	КонецЕсли;
	// -- Сербаев 15.05.2023
	
	ДокументРезультат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИсторияИзмененияКонтактнойИнформацииЗалогодателя";
	Если Отчет.Горизонтальный Тогда  
		Макет 			 = Отчет.РеквизитМакетГоризонтальный;
        ОбластьШапки 	 = Макет.ПолучитьОбласть("Шапка"); 
		ОбластьСтрока 	 = Макет.ПолучитьОбласть("Строка");  
		ОбластьСтрокаДоп 	 = Макет.ПолучитьОбласть("СтрокаС");
		
		ОбластьШапки.Параметры.Залогодатель = Отчет.Залогодатель;   
		Если Отчет.НачПериода = Дата(1,1,1) И Отчет.КонПериода = Дата(1,1,1) Тогда 
			ОбластьШапки.Параметры.Период = " по " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
		ИначеЕсли Отчет.НачПериода = Дата(1,1,1) Тогда
			ОбластьШапки.Параметры.Период = " по " + Формат(Отчет.КонПериода, "ДФ=dd.MM.yyyy");    
		ИначеЕсли Отчет.КонПериода = Дата(1,1,1) Тогда
			ОбластьШапки.Параметры.Период = " с " + Формат(Отчет.НачПериода, "ДФ=dd.MM.yyyy") + " по " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	    Иначе	
		    ОбластьШапки.Параметры.Период =  " с " + Формат(Отчет.НачПериода, "ДФ=dd.MM.yyyy") + " по " + Формат(Отчет.КонПериода, "ДФ=dd.MM.yyyy");   
		КонецЕсли;	    
		ДокументРезультат.Вывести(ОбластьШапки);
		
		Для каждого СтрДок Из ТаблицаКарточкаЗалогодателя Цикл
			//++ИвановВВ, подписание заявления об изменении конт. данных
			Если СтрДок.ЗаявлениеОбИзменении Тогда
			ОбластьСтрока.Параметры.Период = СтрДок.Период;
			Если СтрДок.ЗаявлениеОбИзмененииДанные.Статус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыИзмененийКонтактныхДанных.Изменены")
				Или Не ЗначениеЗаполнено(СтрДок.ЗаявлениеОбИзмененииДанные.Статус) Тогда
				ОбластьСтрока.Параметры.ВидИнф = СтрДок.ЗаявлениеОбИзмененииДанные.Основание;
				ОбластьСтрока.Параметры.ПричинаИзменения = "Подписано заявление";
			ИначеЕсли СтрДок.ЗаявлениеОбИзмененииДанные.Статус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыИзмененийКонтактныхДанных.ОтменаИзменения") Тогда
				ОбластьСтрока.Параметры.ВидИнф = СтрДок.ЗаявлениеОбИзмененииДанные.Основание;
				ОбластьСтрока.Параметры.ПричинаИзменения = "Исправление ошибки";
			КонецЕсли;
			ОбластьСтрока.Параметры.СтрокаИнф = "Контактные данные";
			ОбластьСтрока.Параметры.СтароеЗначение = "";
			ОбластьСтрока.Параметры.НовоеЗначение = "";
			ОбластьСтрока.Параметры.Ответственный = СтрДок.ЗаявлениеОбИзмененииДанные.Ответственный;
			//+МАН 17.03.26 Изменил. Заявка 3654
			//ОбластьСтрока.Параметры.ОтветственныйЛомбард = СтрДок.ЗаявлениеОбИзмененииДанные.Ломбард;
			ОбластьСтрока.Параметры.ОтветственныйЛомбард = СтрДок.ЗаявлениеОбИзмененииДанные.Ломбард.НаименованиеПолное;
			//-МАН
			ДокументРезультат.Вывести(ОбластьСтрока);
			КонецЕсли;
			//--ИвановВВ
			Если НЕ ЗначениеЗаполнено(СтрДок.Регистратор) Тогда 
				//+МАН 30.01.25 Добавил условие. Заявка 2792.
				Если НЕ СтрДок.ВИП Тогда
				//-МАН
					Запрос = Новый Запрос;   
					Запрос.УстановитьПараметр("Дата", СтрДок.Период); 
					Запрос.УстановитьПараметр("Залогодатель", отчет.Залогодатель);
					Запрос.Текст = "ВЫБРАТЬ
					|	ЛБ_СогласиеНаСМСРассылку.Согласен КАК Согласен,
					|	ЛБ_СогласиеНаСМСРассылку.Регистратор КАК Регистратор
					|ИЗ
					|	РегистрСведений.ЛБ_СогласиеНаСМСРассылку КАК ЛБ_СогласиеНаСМСРассылку
					|ГДЕ
					|	ЛБ_СогласиеНаСМСРассылку.Период = &Дата
					|	И ЛБ_СогласиеНаСМСРассылку.Залогодатель = &Залогодатель
					|	И ЛБ_СогласиеНаСМСРассылку.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
					|АВТОУПОРЯДОЧИВАНИЕ";
					Выборка = Запрос.Выполнить().Выбрать();
					Если Выборка.Следующий() Тогда 
						ОбластьСтрока.Параметры.Период = СтрДок.Период;
						ОбластьСтрока.Параметры.Ответственный = Выборка.Регистратор.ОтветственныйСотрудник; 
						СтруктураР = новый Структура;
						СтруктураР.Вставить("Вид", 2); 
						СтруктураР.Вставить("Регистратор", Выборка.Регистратор); 
						ОбластьСтрока.Параметры.СтруктураР = СтруктураР;
						
						ОбластьСтрока.Параметры.ВидИнф = "Согласие на СМС-рассылку";
						//+МАН 23.04.25 Иначе подтягивается предыдущее значение. Заявка 2956
						ОбластьСтрока.Параметры.СтрокаИнф = "";
						//-МАН
						ОбластьСтрока.Параметры.СтароеЗначение = ?(Выборка.Согласен, "Не согласен", "Согласен");
						ОбластьСтрока.Параметры.НовоеЗначение = ?(Выборка.Согласен, "Согласен", "Не согласен");
						ОбластьСтрока.Параметры.ПричинаИзменения = "ЗБ № " + СокрЛП(Выборка.Регистратор.НомерЗалоговогоБилета) + " от " + Формат(Выборка.Регистратор.Дата, "ДФ=dd.MM.yyyy");  
						ДокументРезультат.Вывести(ОбластьСтрока);
					КонецЕсли;  
					
					ОтборС = Новый структура;
					ОтборС.Вставить("СрокДействия", стрДок.Период);
					СтрокиС = ТаблицаСтатусыДополнительныеОкончаниеДействия.НайтиСтроки(ОтборС);
					Если НЕ СтрокиС.Количество() = 0 тогда
						СтрС = строкиС.Получить(0); 
						//+МАН 03.02.25 Заявка 2792
						ОбластьСтрокаДоп.Параметры.ВидИнф = "Окончание срока действия статуса";
						//-МАН
						ОбластьСтрокаДоп.Параметры.Период = СтрДок.Период;
						ОбластьСтрокаДоп.Параметры.СтрокаИнф = СтрС.Статус;
						ОбластьСтрокаДоп.Параметры.СтароеЗначение = "установлен" + ?(СтрС.СрокДействия = Дата(1,1,1), "", " до " + Формат(СтрС.СрокДействия, "ДФ=dd.MM.yyyy")) + 
						?(ПустаяСтрока(СтрС.Комментарий), "", " " + СокрЛП(СтрС.Комментарий));
						ОбластьСтрокаДоп.Параметры.НовоеЗначение = "не установлен"; 
						ОбластьСтрокаДоп.Параметры.ПричинаИзменения = "Окончание срока действия статуса"; 
						ДокументРезультат.Вывести(ОбластьСтрокаДоп);
					КонецЕсли;	
					Продолжить;
				//+МАН 30.01.25 Добавил условие. Заявка 2792.
				Иначе
					Если СтрДок.Статус <> Справочники.ЛБ_СтатусыЗалогодателей.VIP Тогда

						Статусы = ПолучитьДопСтатусыКлиента(СтрДок.Приказ, Справочники.ЛБ_СтатусыЗалогодателей.VIP);
						
						Если СтрДок.Приказ.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ВИП Тогда
							ОбластьСтрокаДоп.Параметры.ВидИнф = "Установка дополнительного статуса ВИП";
						Иначе
							ОбластьСтрокаДоп.Параметры.ВидИнф = "Отмена дополнительного статуса ВИП";
						КонецЕсли;
						
						ОбластьСтрокаДоп.Параметры.Период = СтрДок.Период;
						ОбластьСтрокаДоп.Параметры.СтрокаИнф = Справочники.ЛБ_СтатусыЗалогодателей.VIP;
						ОбластьСтрокаДоп.Параметры.СтароеЗначение = Статусы.ЗначениеСтарое;
						ОбластьСтрокаДоп.Параметры.НовоеЗначение = Статусы.ЗначениеНовое;
						ОбластьСтрокаДоп.Параметры.Ответственный = СтрДок.Приказ.Ответственный;
						
						Ставки = ?(СтрДок.Приказ.СтавкиПроцентов.Количество() > 0, Истина, Ложь);
						Металлы = ?(СтрДок.Приказ.НастройкаОтклоненийОтБазовыхЦенМеталлы.Количество() > 0, Истина, Ложь);
						Вставки = ?(СтрДок.Приказ.НастройкаОтклоненийОтБазовыхЦенВставки.Количество() > 0, Истина, Ложь);
						
						//+МАН 15.08.25 Проверку какие условия отменяются. Заявка 2792
						Если СтрДок.Приказ.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП Тогда
							//+МАН 25.08.25 Изменил
							//ОтменяемыеУсловия = ПолучитьОтменяемыеУсловия(Отчет.Залогодатель, СтрДок.Приказ);
							
							//ПричинаИзменений = "Приказ № " + СтрДок.Приказ.НомерПриказа + " от " + Формат(СтрДок.Приказ.Дата, "ДФ=dd.MM.yyyy") + " ("
							//+ ?(ОтменяемыеУсловия.Ставки, "Ст.", "")
							//+ ?(ОтменяемыеУсловия.Металлы, ?(ОтменяемыеУсловия.Ставки, ", Мет.", "Мет."), "")
							//+ ?(ОтменяемыеУсловия.Вставки, ?(ОтменяемыеУсловия.Ставки ИЛИ ОтменяемыеУсловия.Металлы, ", Вст.)", "Вст.)"), ")");
							
							ПричинаИзменений = "Приказ № " + СтрДок.Приказ.НомерПриказа + " от " + Формат(СтрДок.Приказ.Дата, "ДФ=dd.MM.yyyy") + " ("
							+ ?(СтрДок.Приказ.ОтменаСтавок, "Ст.", "")
							+ ?(СтрДок.Приказ.ОтменаМеталлов, ?(СтрДок.Приказ.ОтменаСтавок, ", Мет.", "Мет."), "")
							+ ?(СтрДок.Приказ.ОтменаВставкок, ?(СтрДок.Приказ.ОтменаСтавок ИЛИ СтрДок.Приказ.ОтменаМеталлов, ", Вст.)", "Вст.)"), ")");
							//-МАН
						Иначе
							
							//+МАН 25.08.25 Добавил
							МассивУдаленияСтрок = Новый Массив;
							
							ТЗСтавкиВПриказе = СтрДок.Приказ.СтавкиПроцентов.Выгрузить(, "Ставка");
							
							Для каждого СтрС Из ТЗСтавкиВПриказе Цикл
								Если СтрС.Ставка = 0 Тогда
									МассивУдаленияСтрок.Добавить(СтрС);
								КонецЕсли;			
							КонецЦикла;
							
							Если МассивУдаленияСтрок.Количество() > 0 Тогда
								Для каждого СтрМ Из МассивУдаленияСтрок Цикл
									ТЗСтавкиВПриказе.Удалить(СтрМ);
								КонецЦикла;
							КонецЕсли;
							
							Ставки = ?(ТЗСтавкиВПриказе.Количество() > 0, Истина, Ложь);
							//-МАН
							
							ПричинаИзменений = "Приказ № " + СтрДок.Приказ.НомерПриказа + " от " + Формат(СтрДок.Приказ.Дата, "ДФ=dd.MM.yyyy") + " ("
							+ ?(Ставки, "Ст.", "")
							+ ?(Металлы, ?(Ставки, ", Мет.", "Мет."), "")
							+ ?(Вставки, ?(Ставки ИЛИ Металлы, ", Вст.)", "Вст.)"), ")");
						КонецЕсли;
						//-МАН
						
						Если СтрДок.Приказ.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП Тогда
							//+МАН 25.08.25 Сделал прроход по ТЧ приказов.
							//СтавкиОтмена = ?(СтрДок.Приказ.ОтменяемыйПриказ.СтавкиПроцентов.Количество() > 0, Истина, Ложь);
							//МеталлыОтмена = ?(СтрДок.Приказ.ОтменяемыйПриказ.НастройкаОтклоненийОтБазовыхЦенМеталлы.Количество() > 0, Истина, Ложь);
							//ВставкиОтмена = ?(СтрДок.Приказ.ОтменяемыйПриказ.НастройкаОтклоненийОтБазовыхЦенВставки.Количество() > 0, Истина, Ложь);
							//
							//ПричинаИзменений = ПричинаИзменений + ", отменяет действие приказа № " + СтрДок.Приказ.ОтменяемыйПриказ.НомерПриказа
							//+ " от " + Формат(СтрДок.Приказ.ОтменяемыйПриказ.Дата, "ДФ=dd.MM.yyyy") + " по ("
							//+ ?(СтавкиОтмена, "Ст.", "")
							//+ ?(МеталлыОтмена, ?(СтавкиОтмена, ", Мет.", "Мет."), "")
							//+ ?(ВставкиОтмена, ?(СтавкиОтмена ИЛИ МеталлыОтмена, ", Вст.)", "Вст.)"), ")");
							
							Нпп = 1;
							
							ОтборЗ = Новый Структура;
							ОтборЗ.Вставить("Залогодатель", Отчет.Залогодатель);
							
							МассивПриказовОтмены = СтрДок.Приказ.ОтменяемыеПриказы.НайтиСтроки(ОтборЗ);
							
							Для каждого СтрП Из МассивПриказовОтмены Цикл
								
								СтавкиОтмена = ?(СтрП.Ставки , Истина, Ложь);
								МеталлыОтмена = ?(СтрП.Металлы, Истина, Ложь);
								ВставкиОтмена = ?(СтрП.Вставки, Истина, Ложь);
								
								Если Нпп = 1 Тогда
									ПричинаИзменений = ПричинаИзменений + ", отменяет действие приказа № ";
									Нпп = Нпп + 1;
								Иначе
									ПричинаИзменений = ПричинаИзменений + ", ";
								КонецЕсли;
								
								ПричинаИзменений = ПричинаИзменений + СтрП.НомерПриказа
								+ " от " + Формат(СтрП.ДатаДокумента, "ДФ=dd.MM.yyyy") + " по ("
								+ ?(СтавкиОтмена, "Ст.", "")
								+ ?(МеталлыОтмена, ?(СтавкиОтмена, ", Мет.", "Мет."), "")
								+ ?(ВставкиОтмена, ?(СтавкиОтмена ИЛИ МеталлыОтмена, ", Вст.)", "Вст.)"), ")");
							КонецЦикла;
							//-МАН
						КонецЕсли;
						
						ОбластьСтрокаДоп.Параметры.ПричинаИзменения = ПричинаИзменений;
						
						ДокументРезультат.Вывести(ОбластьСтрокаДоп);
					Иначе
						ОтборС = Новый структура;
						ОтборС.Вставить("Регистратор", СтрДок.Приказ);
						
						СтрокиС = ТаблицаСтатусыДополнительныеОкончаниеДействия.НайтиСтроки(ОтборС);
						
						Если НЕ СтрокиС.Количество() = 0 тогда

							СтрС = строкиС.Получить(0);
							
							Статусы = ПолучитьДопСтатусыКлиента(СтрС.Регистратор, Справочники.ЛБ_СтатусыЗалогодателей.VIP, Истина, СтрДок.Период);
							
							ОбластьСтрокаДоп.Параметры.ВидИнф = "Окончание срока действия приказа";
							ОбластьСтрокаДоп.Параметры.Период = СтрДок.Период;
							ОбластьСтрокаДоп.Параметры.СтрокаИнф = СтрС.Статус;
							ОбластьСтрокаДоп.Параметры.СтароеЗначение = Статусы.ЗначениеСтарое;
							ОбластьСтрокаДоп.Параметры.НовоеЗначение = Статусы.ЗначениеНовое;
							ОбластьСтрокаДоп.Параметры.ПричинаИзменения = "Окончание срока действия приказа № " + СтрС.Регистратор.НомерПриказа;
							ДокументРезультат.Вывести(ОбластьСтрокаДоп);
						КонецЕсли;
					КонецЕсли;
					
					Продолжить;
				КонецЕсли;
				//-МАН
			КонецЕсли;
			
			Отбор = Новый Структура;
		    Отбор.Вставить("Период", СтрДок.Период);
		    Отбор.Вставить("Регистратор", СтрДок.Регистратор); 
			
			СтруктураР = Новый Структура;  
			СтруктураР.Вставить("Вид", 1);
			СтруктураР.Вставить("Залогодатель", Отчет.Залогодатель);
			СтруктураР.Вставить("Дата", СтрДок.Период);
			ОбластьСтрока.Параметры.СтруктураР = СтруктураР;
			
			НоваяКарточка = ложь;
			ОбластьСтрока.Параметры.ПричинаИзменения = "";
			ОбластьСтрока.Параметры.СтрокаИнф = "";
			ОбластьСтрока.Параметры.ВидИнф = "";
			ОбластьСтрока.Параметры.СтароеЗначение = ""; 
			ОбластьСтрока.Параметры.НовоеЗначение = "";
			
			СтрокиКИ = ТаблицаКИ.НайтиСтроки(Отбор);		
			Если НЕ СтрокиКИ.Количество() = 0 Тогда 				
		        СтрК = СтрокиКИ.Получить(0); 
				Если СтрК.ПричинаИзменения = справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.НоваяКарточка ИЛИ СтрК.ПричинаИзменения = справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.ЗагрузкаИзДругойБазы Тогда
					НоваяКарточка = Истина;
				КонецЕсли;	
				//Если НЕ ЗначениеЗаполнено(СтрК.ПричинаИзмененияФИО) ИЛИ (СтрК.ПричинаИзменения = СтрК.ПричинаИзмененияФИО) Тогда 
				//	ПричинаИзмененияКИ = СтрК.ПричинаИзменения;
				//Иначе
				//	ПричинаИзмененияКИ = СокрЛП(СтрК.ПричинаИзменения) + Символы.ПС + "Причина изменения ФИО: " + СокрЛП(СтрК.ПричинаИзмененияФИО) + 
				//	    ?(ПустаяСтрока(СтрК.ОснованиеИзмененияФИО), "", ", основание изменения: " + СокрЛП(СтрК.ОснованиеИзмененияФИО));				
				//КонецЕсли;
				
				Если НЕ ПустаяСтрока(СтрК.ПричинаИзмененияФИО) Тогда    
					ИзмФИО = СтрК.ОснованиеИзмененияФИО;
					ОснованиеИзмененияФИО = СокрЛП(ИзмФИО.Документ) + ?(НЕ ПустаяСтрока(ИзмФИО.Серия), " серия " + СокрЛП(ИзмФИО.Серия), "") + " № " + СокрЛП(ИзмФИО.Номер) +
					             ?(НЕ ПустаяСтрока(ИзмФИО.КемВыдан), " выдан " + СокрЛП(ИзмФИО.КемВыдан), "") + " дата выдачи " + Формат(ИзмФИО.Дата, "ДФ=dd.MM.yyyy");
				    ПричинаИзмененияКИ = СокрЛП(СтрК.ПричинаИзмененияФИО) + ?(ПустаяСтрока(СтрК.ОснованиеИзмененияФИО), "", ", основание изменения: " + СокрЛП(ОснованиеИзмененияФИО)); 
				Иначе 
					ПричинаИзмененияКИ = ?(НоваяКарточка, "", СокрЛП(СтрК.ПричинаИзменения));
				КонецЕсли;	
				     						
				ТаблицаИзменений = ПолучитьТаблицуИзменений(СтрК.Изменения, ТаблицаИзменений);  
				Если НЕ ТаблицаИзменений.Количество() = 0 Тогда 
					Для каждого СтрКИ Из ТаблицаИзменений Цикл 	
						ОбластьСтрока.Параметры.Период = СтрДок.Период;
			            ОбластьСтрока.Параметры.Ответственный = СтрДок.Регистратор.Ответственный;
						//+МАН 17.03.26 Изменил. Заявка 3654
						//ОбластьСтрока.Параметры.ОтветственныйЛомбард = СтрК.ОтветственныйЛомбард.НомерЛомбарда;	//+++ МоисеевЕС 20250526
						ОбластьСтрока.Параметры.ОтветственныйЛомбард = СтрК.ОтветственныйЛомбард.НаименованиеПолное;
						//-МАН
						
						Если СтрКИ.Вид = "Фамилия" ИЛИ СтрКИ.Вид = "Имя" ИЛИ СтрКИ.Вид = "Отчество" Тогда
							СменаФИО = истина;
						Иначе
							СменаФИО = Ложь;
						КонецЕсли;	   
						СменаАдреса = ложь;
						Если (СтрКИ.Вид = "Адрес по прописке") И СтрК.СменилсяАдресПрописки Тогда  
							ПричинаИзмененияКИ = строка(СтрК.ПричинаИзмененияАдресаПоПрописке);
							СменаАдреса = Истина;
					    ИначеЕсли (СтрКИ.Вид = "Факт. адрес") И СтрК.СменилсяФактическийАдрес Тогда  
							ПричинаИзмененияКИ = строка(СтрК.ПричинаИзмененияФактическогоАдреса);
							СменаАдреса = Истина;
						ИначеЕсли (СтрКИ.Вид = "Почтовый адрес") И СтрК.СменилсяПочтовыйАдрес Тогда  
							ПричинаИзмененияКИ = строка(СтрК.ПричинаИзмененияПочтовогоАдреса);
							СменаАдреса = Истина;
						КонецЕсли;	
						ОбластьСтрока.Параметры.СтрокаИнф = СтрКИ.Вид;
						ОбластьСтрока.Параметры.СтароеЗначение = СтрКИ.ЗначениеСтарое;
						ОбластьСтрока.Параметры.НовоеЗначение = СтрКИ.ЗначениеНовое; 
		                ОбластьСтрока.Параметры.ПричинаИзменения = ?(СменаФИО ИЛИ СменаАдреса, ПричинаИзмененияКИ, ""); 
				        ДокументРезультат.Вывести(ОбластьСтрока);
					КонецЦикла;	
				//ИначеЕсли НоваяКарточка Тогда
				//	ОбластьСтрока.Параметры.Период = СтрДок.Период;
				//    ОбластьСтрока.Параметры.Ответственный = СтрДок.Регистратор.Ответственный;
				//    ОбластьСтрока.Параметры.ПричинаИзменения = ПричинаИзмененияКИ; 
				//    ДокументРезультат.Вывести(ОбластьСтрока);
				КонецЕсли;
			КонецЕсли;
			
			Если НЕ НоваяКарточка Тогда
				СтрокиАнкета = ТаблицаАнкета.НайтиСтроки(Отбор);		
				Если НЕ СтрокиАнкета.Количество() = 0 Тогда 
					СтрАнкета = СтрокиАнкета.Получить(0);    
				    //ПричинаИзмененияАнкета = СтрАнкета.ПричинаИзменения; 
					ПричинаИзмененияАнкета = "";
						            						
					ТаблицаИзменений = ПолучитьТаблицуИзменений(СтрАнкета.Изменения, ТаблицаИзменений);  
					Если НЕ ТаблицаИзменений.Количество() = 0 Тогда 
						Для каждого СтрКИ Из ТаблицаИзменений Цикл 	
							ОбластьСтрока.Параметры.Период = СтрДок.Период;
				            ОбластьСтрока.Параметры.Ответственный = СтрДок.Регистратор.Ответственный;
							//+МАН 17.03.26 Изменил. Заявка 3654
							//ОбластьСтрока.Параметры.ОтветственныйЛомбард = СтрДок.Регистратор.ОтветственныйЛомбард.НомерЛомбарда;	//+++ Моисеев 20250602
							ОбластьСтрока.Параметры.ОтветственныйЛомбард = СтрДок.Регистратор.ОтветственныйЛомбард.НаименованиеПолное;
							//-МАН
							ОбластьСтрока.Параметры.СтрокаИнф = СтрКИ.Вид;
							ОбластьСтрока.Параметры.СтароеЗначение = СтрКИ.ЗначениеСтарое;
							ОбластьСтрока.Параметры.НовоеЗначение = СтрКИ.ЗначениеНовое; 
			                ОбластьСтрока.Параметры.ПричинаИзменения = ПричинаИзмененияАнкета; 
					        ДокументРезультат.Вывести(ОбластьСтрока);
						КонецЦикла;
	               	КонецЕсли;
				КонецЕсли;	
			КонецЕсли;	

			СтрокиДок = ТаблицаДок.НайтиСтроки(Отбор);
			Если НЕ СтрокиДок.Количество() = 0 Тогда   
				Для каждого Стр Из СтрокиДок Цикл 	 
					Если НоваяКарточка Тогда
					    ПричинаИзмененияДок = ?(СтрК.ПричинаИзменения = Справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.ЗагрузкаИзДругойБазы, СтрК.Изменения, "");
					Иначе 
						//Если стр.Документ.ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность	Или
						//	   стр.Документ.ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийПравоПребыванияРФ Тогда 
							ПричинаИзмененияДок = ?(Стр.ПричинаИзменения = Справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.НовыйДокумент, "", Стр.ПричинаИзменения);  
						//КонецЕсли;	
					КонецЕсли;	
				    ТаблицаИзменений = ПолучитьТаблицуИзменений(Стр.Изменения, ТаблицаИзменений);  
				    Если НЕ ТаблицаИзменений.Количество() = 0 Тогда 
					    Для каждого СтрКИ Из ТаблицаИзменений Цикл 	
							ОбластьСтрока.Параметры.Период = СтрДок.Период;
				            ОбластьСтрока.Параметры.Ответственный = СтрДок.Регистратор.Ответственный;
							//+МАН 17.03.26 Изменил. Заявка 3654
							//ОбластьСтрока.Параметры.ОтветственныйЛомбард = СтрДок.Регистратор.ОтветственныйЛомбард.НомерЛомбарда;	//+++ Моисеев 20250602
							ОбластьСтрока.Параметры.ОтветственныйЛомбард = СтрДок.Регистратор.ОтветственныйЛомбард.НаименованиеПолное;
							//-МАН
							ОбластьСтрока.Параметры.ВидИнф = ЛБ_ОбщийМодуль.СформироватьПолноеНаименованиеДокументаЗалогодателя(Стр); //СокрЛП(Стр.Документ.НаименованиеПолное);
							ОбластьСтрока.Параметры.СтрокаИнф = СтрКИ.Вид;
							ОбластьСтрока.Параметры.СтароеЗначение = СтрКИ.ЗначениеСтарое;
							ОбластьСтрока.Параметры.НовоеЗначение = СтрКИ.ЗначениеНовое; 
			                ОбластьСтрока.Параметры.ПричинаИзменения = ПричинаИзмененияДок; 
					        ДокументРезультат.Вывести(ОбластьСтрока);
						КонецЦикла;
					Иначе
						ОбластьСтрока.Параметры.Период = СтрДок.Период;
				        ОбластьСтрока.Параметры.Ответственный = СтрДок.Регистратор.Ответственный;
						//+МАН 17.03.26 Изменил. Заявка 3654
						//ОбластьСтрока.Параметры.ОтветственныйЛомбард = СтрДок.Регистратор.ОтветственныйЛомбард.НомерЛомбарда;	//+++ Моисеев 20250602
						ОбластьСтрока.Параметры.ОтветственныйЛомбард = СтрДок.Регистратор.ОтветственныйЛомбард.НаименованиеПолное;
						//-МАН
						ОбластьСтрока.Параметры.ПричинаИзменения = ПричинаИзмененияДок; 
					    ОбластьСтрока.Параметры.ВидИнф = ЛБ_ОбщийМодуль.СформироватьПолноеНаименованиеДокументаЗалогодателя(Стр); //СокрЛП(Стр.Документ.НаименованиеПолное); 
						ОбластьСтрока.Параметры.СтрокаИнф = "";    
						ОбластьСтрока.Параметры.СтароеЗначение = "";
						ОбластьСтрока.Параметры.НовоеЗначение = ""; 
						ДокументРезультат.Вывести(ОбластьСтрока);
				    КонецЕсли;
				КонецЦикла;
			КонецЕсли;	
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ЛБ_СтатусыЗалогодателей.Ссылка КАК Статус
			               |ИЗ
			               |	Справочник.ЛБ_СтатусыЗалогодателей КАК ЛБ_СтатусыЗалогодателей
			               |ГДЕ
			               |	ЛБ_СтатусыЗалогодателей.ПометкаУдаления = ЛОЖЬ
			               |	И ЛБ_СтатусыЗалогодателей.ЭтоГруппа = ЛОЖЬ
			               |	И ЛБ_СтатусыЗалогодателей.ДоступенДляВыбораВручную = ИСТИНА
			               |АВТОУПОРЯДОЧИВАНИЕ";
			ТаблицаДопСтатусов = Запрос.Выполнить().Выгрузить();
			Новаястр = ТаблицаДопСтатусов.Добавить();
			НоваяСтр.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Почетный;
			Для каждого Стр Из ТаблицаДопСтатусов Цикл 
				Статусы = ПолучитьСтатусыКлиентаДоп(СтрДок.Регистратор, Стр.Статус);
				Если НЕ Статусы.ЗначениеСтарое = Статусы.ЗначениеНовое Тогда
					ОбластьСтрока.Параметры.Период = СтрДок.Период;
				    ОбластьСтрока.Параметры.Ответственный = СтрДок.Регистратор.Ответственный;
					//+МАН 17.03.26 Изменил. Заявка 3654
					//ОбластьСтрока.Параметры.ОтветственныйЛомбард = СтрДок.Регистратор.ОтветственныйЛомбард.НомерЛомбарда;	//+++ Моисеев 20250602
					ОбластьСтрока.Параметры.ОтветственныйЛомбард = СтрДок.Регистратор.ОтветственныйЛомбард.НаименованиеПолное;
					//-МАН
					ОбластьСтрока.Параметры.ВидИнф = "Дополнительный статус";
					ОбластьСтрока.Параметры.СтрокаИнф = Стр.Статус;
					ОбластьСтрока.Параметры.СтароеЗначение = Статусы.ЗначениеСтарое;
					ОбластьСтрока.Параметры.НовоеЗначение = Статусы.ЗначениеНовое;
					ОбластьСтрока.Параметры.ПричинаИзменения = "";
			        ДокументРезультат.Вывести(ОбластьСтрока);
				КонецЕсли;
			КонецЦикла;  
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ЛБ_СлужебныеСтатусыКлиентов.Ссылка КАК Статус
			               |ИЗ
			               |	Справочник.ЛБ_СлужебныеСтатусыКлиентов КАК ЛБ_СлужебныеСтатусыКлиентов
			               |ГДЕ
			               |	ЛБ_СлужебныеСтатусыКлиентов.ПометкаУдаления = ЛОЖЬ
			               |АВТОУПОРЯДОЧИВАНИЕ";
			ТаблицаСлужебныхСтатусов = Запрос.Выполнить().Выгрузить();
			Для каждого Стр Из ТаблицаСлужебныхСтатусов Цикл 
				Статусы = ПолучитьСтатусыКлиентаСлужебные(СтрДок.Регистратор, Стр.Статус);
				Если НЕ Статусы.ЗначениеСтарое = Статусы.ЗначениеНовое Тогда
					ОбластьСтрока.Параметры.Период = СтрДок.Период;
				    ОбластьСтрока.Параметры.Ответственный = СтрДок.Регистратор.Ответственный;
					//+МАН 17.03.26 Изменил. Заявка 3654
					//ОбластьСтрока.Параметры.ОтветственныйЛомбард = СтрДок.Регистратор.ОтветственныйЛомбард.НомерЛомбарда;	//+++ Моисеев 20250602
					ОбластьСтрока.Параметры.ОтветственныйЛомбард = СтрДок.Регистратор.ОтветственныйЛомбард.НаименованиеПолное;
					//-МАН
					ОбластьСтрока.Параметры.ВидИнф = "Служебный статус";
					ОбластьСтрока.Параметры.СтрокаИнф = Стр.Статус;
					ОбластьСтрока.Параметры.СтароеЗначение = Статусы.ЗначениеСтарое;
					ОбластьСтрока.Параметры.НовоеЗначение = Статусы.ЗначениеНовое; 
					ОбластьСтрока.Параметры.ПричинаИзменения = "";
			        ДокументРезультат.Вывести(ОбластьСтрока);
				КонецЕсли;
			КонецЦикла;  

			Запрос = Новый Запрос;   
			Запрос.УстановитьПараметр("Регистратор", СтрДок.Регистратор);
			Запрос.Текст = "ВЫБРАТЬ
			               |	ЛБ_СогласиеНаСМСРассылку.Согласен КАК Согласен
			               |ИЗ
			               |	РегистрСведений.ЛБ_СогласиеНаСМСРассылку КАК ЛБ_СогласиеНаСМСРассылку
			               |ГДЕ
			               |	ЛБ_СогласиеНаСМСРассылку.Регистратор = &Регистратор
			               |АВТОУПОРЯДОЧИВАНИЕ";
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда 
				ОбластьСтрока.Параметры.Период = СтрДок.Период;
			    ОбластьСтрока.Параметры.Ответственный = СтрДок.Регистратор.Ответственный;
				//+МАН 17.03.26 Изменил. Заявка 3654
				//ОбластьСтрока.Параметры.ОтветственныйЛомбард = СтрДок.Регистратор.ОтветственныйЛомбард.НомерЛомбарда;	//+++ Моисеев 20250602
				ОбластьСтрока.Параметры.ОтветственныйЛомбард = СтрДок.Регистратор.ОтветственныйЛомбард.НаименованиеПолное;
				//-МАН
				ОбластьСтрока.Параметры.ВидИнф = "Согласие на СМС-рассылку";
				//+МАН 23.04.25 Иначе подтягивается предыдущее значение. Заявка 2956
				ОбластьСтрока.Параметры.СтрокаИнф = "";
				//-МАН
				ОбластьСтрока.Параметры.СтароеЗначение = ?(Выборка.Согласен, "Не согласен", "Согласен");
				ОбластьСтрока.Параметры.НовоеЗначение = ?(Выборка.Согласен, "Согласен", "Не согласен");
				ОбластьСтрока.Параметры.ПричинаИзменения = "";
			    ДокументРезультат.Вывести(ОбластьСтрока);
			КонецЕсли;  

			ПричинаОтказа = ПолучитьПричинуОтказа(СтрДок.Регистратор);  
			Если НЕ ПустаяСтрока(ПричинаОтказа) Тогда 
				ОбластьСтрока.Параметры.ВидИнф = "Отказ в проведении оперции с клиентом";
				Областьстрока.Параметры.ПричинаИзменения = ПричинаОтказа;
			    ДокументРезультат.Вывести(ОбластьСтрока); 
			КонецЕсли;	
		КонецЦикла;
	Иначе
		Макет 			 = Отчет.РеквизитМакет;
		ОбластьШапки 	 = Макет.ПолучитьОбласть("Шапка");
		ОбластьПериод 	 = Макет.ПолучитьОбласть("Период"); 
		ОбластьПериод1 	 = Макет.ПолучитьОбласть("Период1");
		ОбластьКИ 	 = Макет.ПолучитьОбласть("КИ");
		ОбластьСтрокаКИ 	 = Макет.ПолучитьОбласть("СтрокаКИ"); 
		ОбластьДок 	 = Макет.ПолучитьОбласть("Док");
		ОбластьСтрокаДок 	 = Макет.ПолучитьОбласть("СтрокаДок"); 
		ОбластьАнкета 	 = Макет.ПолучитьОбласть("Анкета");
		ОбластьСтрокаАнкета 	 = Макет.ПолучитьОбласть("СтрокаАнкета");   
		ОбластьСтатус 	 = Макет.ПолучитьОбласть("Статус");
		ОбластьСтрокаСтатус 	 = Макет.ПолучитьОбласть("Строкастатус"); 
		ОбластьСтатусС 	 = Макет.ПолучитьОбласть("СтатусС");
		ОбластьСтрокаСтатусС 	 = Макет.ПолучитьОбласть("СтрокастатусС");
		ОбластьОтказ 	 = Макет.ПолучитьОбласть("Отказ"); 
		ОбластьПусто 	 = Макет.ПолучитьОбласть("Пустаястрока"); 
		ОбластьСМС 	 = Макет.ПолучитьОбласть("СМС");
		ОбластьСтрокаСМС 	 = Макет.ПолучитьОбласть("СтрокаСМС");

		
		ОбластьШапки.Параметры.Залогодатель = Отчет.Залогодатель;   
		Если Отчет.НачПериода = Дата(1,1,1) И Отчет.КонПериода = Дата(1,1,1) Тогда 
			ОбластьШапки.Параметры.Период = " по " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
		ИначеЕсли Отчет.НачПериода = Дата(1,1,1) Тогда
			ОбластьШапки.Параметры.Период = " по " + Формат(Отчет.КонПериода, "ДФ=dd.MM.yyyy");    
		ИначеЕсли Отчет.КонПериода = Дата(1,1,1) Тогда
			ОбластьШапки.Параметры.Период = " с " + Формат(Отчет.НачПериода, "ДФ=dd.MM.yyyy") + " по " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	    Иначе	
		    ОбластьШапки.Параметры.Период =  " с " + Формат(Отчет.НачПериода, "ДФ=dd.MM.yyyy") + " по " + Формат(Отчет.КонПериода, "ДФ=dd.MM.yyyy");   
		КонецЕсли;	    
		СтатусПосистемеЛояльности = ПолучитьСтатусКлиента(КонДата);
		ОбластьШапки.Параметры.Статус = ?(СтатусПосистемеЛояльности = неопределено, "не определен", СтатусПосистемеЛояльности);
	    ДокументРезультат.Вывести(ОбластьШапки);
		
		ДокументРезультат.НачатьАвтогруппировкуСтрок();
		Для каждого СтрДок Из ТаблицаКарточкаЗалогодателя Цикл
			Если НЕ ЗначениеЗаполнено(СтрДок.Регистратор) Тогда	
				ЕстьЗаголовок = Ложь;
				Запрос = Новый Запрос;   
				Запрос.УстановитьПараметр("Дата", СтрДок.Период);  
				Запрос.УстановитьПараметр("Залогодатель", Отчет.Залогодатель);
				Запрос.Текст = "ВЫБРАТЬ
				               |	ЛБ_СогласиеНаСМСРассылку.Согласен КАК Согласен,
				               |	ЛБ_СогласиеНаСМСРассылку.Регистратор КАК Регистратор
				               |ИЗ
				               |	РегистрСведений.ЛБ_СогласиеНаСМСРассылку КАК ЛБ_СогласиеНаСМСРассылку
				               |ГДЕ
				               |	ЛБ_СогласиеНаСМСРассылку.Период = &Дата
				               |	И ЛБ_СогласиеНаСМСРассылку.Залогодатель = &Залогодатель
				               |	И ЛБ_СогласиеНаСМСРассылку.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
				               |АВТОУПОРЯДОЧИВАНИЕ";
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда  
					СтруктураР = Новый Структура;  
			        СтруктураР.Вставить("Вид", 2);  
					СтруктураР.Вставить("Регистратор", Выборка.Регистратор);
					ОбластьПериод1.Параметры.Период = Формат(СтрДок.Период, "ДЛФ=DT");
					ОбластьПериод1.Параметры.СтруктураР = СтруктураР; 
					ОбластьПериод1.Параметры.Ответственный = "ответственный " + СокрЛП(Выборка.Регистратор.Ответственный);
				    ДокументРезультат.Вывести(ОбластьПериод1, 1); 
					ЕстьЗаголовок = Истина;

					ПричинаИзменения = "ЗБ № " + СокрЛП(Выборка.Регистратор.НомерЗалоговогоБилета) + " от " + Формат(Выборка.Регистратор.Дата, "ДФ=dd.MM.yyyy");                                 
					ОбластьСМС.Параметры.ПричинаИзменения = ПричинаИзменения;
					ДокументРезультат.Вывести(ОбластьПусто, 2);
				    ДокументРезультат.Вывести(ОбластьСМС, 2); 
							
					ДокументРезультат.Вывести(ОбластьПусто, 2);  
					ОбластьСтрокаСМС.Параметры.СтароеЗначение = ?(Выборка.Согласен, "Не согласен", "Согласен");
					ОбластьСтрокаСМС.Параметры.НовоеЗначение = ?(Выборка.Согласен, "Согласен", "Не согласен"); 
			        ДокументРезультат.Вывести(ОбластьСтрокаСМС, 2);
	   			КонецЕсли;  
     								
				ОтборС = Новый структура;
				ОтборС.Вставить("СрокДействия", стрДок.Период);
				СтрокиС = ТаблицаСтатусыДополнительныеОкончаниеДействия.НайтиСтроки(ОтборС);
				Если НЕ СтрокиС.Количество() = 0 тогда   
					Если НЕ ЕстьЗаголовок Тогда 
						ОбластьПериод1.Параметры.Период = Формат(СтрДок.Период, "ДЛФ=DT");
						ОбластьПериод1.Параметры.СтруктураР = неопределено; 
						ДокументРезультат.Вывести(ОбластьПериод1, 1);  
					КонецЕсли;	

					СтрС = строкиС.Получить(0); 
					ОбластьСтатус.Параметры.ПричинаИзмененияКИ = "Окончание срока действия статуса";
					ДокументРезультат.Вывести(ОбластьСтатус);
					ОбластьСтрокаСтатус.Параметры.СтатусДоп = СтрС.Статус;
					ОбластьСтрокаСтатус.Параметры.СтароеСтатус = "установлен" + ?(СтрС.СрокДействия = Дата(1,1,1), "", " до " + Формат(КонецДня(СтрС.СрокДействия)+1, "ДФ=dd.MM.yyyy")) + 
					        ?(ПустаяСтрока(СтрС.Комментарий), "", " " + СокрЛП(СтрС.Комментарий));
					ОбластьСтрокаСтатус.Параметры.Новоестатус = "не установлен"; 
	                ДокументРезультат.Вывести(ОбластьСтрокаСтатус);
				КонецЕсли;	
				Продолжить;
			КонецЕсли;
			
			ОбластьПериод.Параметры.Период = СтрДок.Период;
			СтруктураР = Новый Структура;
			СтруктураР.Вставить("Вид", 1);
			СтруктураР.Вставить("Залогодатель", Отчет.Залогодатель);
			СтруктураР.Вставить("Дата", СтрДок.Период);
			ОбластьПериод.Параметры.СтруктураР = СтруктураР;  
			ОбластьПериод.Параметры.Ответственный = СтрДок.Регистратор.Ответственный;
			ДокументРезультат.Вывести(ОбластьПериод, 1); 

			Отбор = Новый Структура;
			Отбор.Вставить("Период", СтрДок.Период);
			Отбор.Вставить("Регистратор", СтрДок.Регистратор);
			
			НоваяКарточка = ложь;
			
			СтрокиКИ = ТаблицаКИ.НайтиСтроки(Отбор);		
			Если НЕ СтрокиКИ.Количество() = 0 Тогда 
				ДокументРезультат.Вывести(ОбластьПусто, 2);
	            СтрК = СтрокиКИ.Получить(0); 
				Если СтрК.ПричинаИзменения = справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.НоваяКарточка Тогда
					НоваяКарточка = Истина;
				КонецЕсли;	
				Если НЕ ЗначениеЗаполнено(СтрК.ПричинаИзмененияФИО) ИЛИ (СтрК.ПричинаИзменения = СтрК.ПричинаИзмененияФИО) Тогда 
					ПричинаИзмененияКИ = СтрК.ПричинаИзменения;
				Иначе
					ПричинаИзмененияКИ = СокрЛП(СтрК.ПричинаИзменения) + Символы.ПС + "Причина изменения ФИО: " + СокрЛП(СтрК.ПричинаИзмененияФИО) + 
					    ?(ПустаяСтрока(СтрК.ОснованиеИзмененияФИО), "", ", основание изменения: " + СокрЛП(СтрК.ОснованиеИзмененияФИО));				
				КонецЕсли;	  
				ОбластьКИ.Параметры.ПричинаИзмененияКИ = ПричинаИзмененияКИ; 
				ДокументРезультат.Вывести(ОбластьКИ, 2);
	            						
				ТаблицаИзменений = ПолучитьТаблицуИзменений(СтрК.Изменения, ТаблицаИзменений);  
				Если НЕ ТаблицаИзменений.Количество() = 0 Тогда 
					ДокументРезультат.Вывести(ОбластьПусто, 2);
					Для каждого СтрКИ Из ТаблицаИзменений Цикл 				 
						ОбластьСтрокаКИ.Параметры.ВидКИ = СтрКИ.Вид;
						ОбластьСтрокаКИ.Параметры.СтароеКИ = СтрКИ.ЗначениеСтарое;
						ОбластьСтрокаКИ.Параметры.НовоеКИ = СтрКИ.ЗначениеНовое; 
		                ДокументРезультат.Вывести(ОбластьСтрокаКИ, 2);
					КонецЦикла;	
				КонецЕсли;
			КонецЕсли;	  
			
			СтрокиАнкета = ТаблицаАнкета.НайтиСтроки(Отбор);		
			Если НЕ СтрокиАнкета.Количество() = 0 Тогда 
				ДокументРезультат.Вывести(ОбластьПусто, 2);
	            СтрА = СтрокиАнкета.Получить(0);    
				ОбластьАнкета.Параметры.ПричинаИзмененияАнкета = СтрА.ПричинаИзменения; 
				ДокументРезультат.Вывести(ОбластьАнкета, 2);
	            						
				ТаблицаИзменений = ПолучитьТаблицуИзменений(СтрА.Изменения, ТаблицаИзменений);  
				Если НЕ ТаблицаИзменений.Количество() = 0 Тогда 
					ДокументРезультат.Вывести(ОбластьПусто, 2);
					Для каждого Стр2 Из ТаблицаИзменений Цикл 				 
						ОбластьСтрокаАнкета.Параметры.ВидАнкета = Стр2.Вид;
						ОбластьСтрокаАнкета.Параметры.СтароеАнкета = Стр2.ЗначениеСтарое;
						ОбластьСтрокаАнкета.Параметры.НовоеАнкета = Стр2.ЗначениеНовое; 
		                ДокументРезультат.Вывести(ОбластьСтрокаАнкета, 2);
					КонецЦикла;	
				КонецЕсли;
			КонецЕсли;	
							
			СтрокиДок = ТаблицаДок.НайтиСтроки(Отбор);
			Если НЕ СтрокиДок.Количество() = 0 Тогда   
				Для каждого Стр Из СтрокиДок Цикл 
				    ДокументРезультат.Вывести(ОбластьПусто, 2); 
				    ОбластьДок.Параметры.ПричинаИзмененияДок = Стр.ПричинаИзменения; 
				    ОбластьДок.Параметры.Документ = ЛБ_ОбщийМодуль.СформироватьПолноеНаименованиеДокументаЗалогодателя(Стр); //СокрЛП(Стр.Документ.НаименованиеПолное);
				    ДокументРезультат.Вывести(ОбластьДок, 2);
					    			
				    ТаблицаИзменений = ПолучитьТаблицуИзменений(Стр.Изменения, ТаблицаИзменений);  
				    Если НЕ ТаблицаИзменений.Количество() = 0 Тогда 
					    ДокументРезультат.Вывести(ОбластьПусто, 2);
					    Для каждого Стр1 Из ТаблицаИзменений Цикл 				 
							ОбластьСтрокаДок.Параметры.ВидДок = Стр1.Вид;
							ОбластьСтрокаДок.Параметры.СтароеДок = Стр1.ЗначениеСтарое;
							ОбластьСтрокаДок.Параметры.НовоеДок = Стр1.ЗначениеНовое; 
			                ДокументРезультат.Вывести(ОбластьСтрокаДок, 2);
					    КонецЦикла;	
				    КонецЕсли;
				КонецЦикла;
			КонецЕсли;	
						
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ЛБ_СтатусыЗалогодателей.Ссылка КАК Статус
			               |ИЗ
			               |	Справочник.ЛБ_СтатусыЗалогодателей КАК ЛБ_СтатусыЗалогодателей
			               |ГДЕ
			               |	ЛБ_СтатусыЗалогодателей.ПометкаУдаления = ЛОЖЬ
			               |	И ЛБ_СтатусыЗалогодателей.ЭтоГруппа = ЛОЖЬ
			               |	И ЛБ_СтатусыЗалогодателей.ДоступенДляВыбораВручную = ИСТИНА
			               |АВТОУПОРЯДОЧИВАНИЕ";
			ТаблицаДопСтатусов = Запрос.Выполнить().Выгрузить();
			Новаястр = ТаблицаДопСтатусов.Добавить();
			НоваяСтр.Статус = Справочники.ЛБ_СтатусыЗалогодателей.Почетный;
			Ном = 0;
			Для каждого Стр Из ТаблицаДопСтатусов Цикл 
				Статусы = ПолучитьСтатусыКлиентаДоп(СтрДок.Регистратор, Стр.Статус);
				Если НЕ Статусы.ЗначениеСтарое = Статусы.ЗначениеНовое Тогда
					Если Ном = 0 Тогда
						ДокументРезультат.Вывести(ОбластьПусто, 2);
			            ДокументРезультат.Вывести(ОбластьСтатус, 2); 
					КонецЕсли;	
		            						
					ДокументРезультат.Вывести(ОбластьПусто, 2);  
					ОбластьСтрокаСтатус.Параметры.СтатусДоп = Стр.Статус;
					ОбластьСтрокаСтатус.Параметры.СтароеСтатус = Статусы.ЗначениеСтарое;
					ОбластьСтрокаСтатус.Параметры.НовоеСтатус = Статусы.ЗначениеНовое; 
			        ДокументРезультат.Вывести(ОбластьСтрокаСтатус, 2);
					Ном = Ном + 1;
				КонецЕсли;
			КонецЦикла; 
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ЛБ_СлужебныеСтатусыКлиентов.Ссылка КАК Статус
			               |ИЗ
			               |	Справочник.ЛБ_СлужебныеСтатусыКлиентов КАК ЛБ_СлужебныеСтатусыКлиентов
			               |ГДЕ
			               |	ЛБ_СлужебныеСтатусыКлиентов.ПометкаУдаления = ЛОЖЬ
			               |АВТОУПОРЯДОЧИВАНИЕ";
			ТаблицаСтатусовСлужебных = Запрос.Выполнить().Выгрузить();
			Ном = 0;
			Для каждого Стр Из ТаблицаСтатусовСлужебных Цикл 
				Статусы = ПолучитьСтатусыКлиентаСлужебные(СтрДок.Регистратор, Стр.Статус);
				Если НЕ Статусы.ЗначениеСтарое = Статусы.ЗначениеНовое Тогда
					Если Ном = 0 Тогда
						ДокументРезультат.Вывести(ОбластьПусто, 2);
			            ДокументРезультат.Вывести(ОбластьСтатусС, 2); 
					КонецЕсли;	
		            						
					ДокументРезультат.Вывести(ОбластьПусто, 2);  
					ОбластьСтрокаСтатусС.Параметры.СтатусСлужебный = Стр.Статус;
					ОбластьСтрокаСтатусС.Параметры.СтароеСтатус = Статусы.ЗначениеСтарое;
					ОбластьСтрокаСтатусС.Параметры.НовоеСтатус = Статусы.ЗначениеНовое; 
			        ДокументРезультат.Вывести(ОбластьСтрокаСтатусС, 2);
					Ном = Ном + 1;
				КонецЕсли;
			КонецЦикла;  

			Запрос = Новый Запрос;   
			Запрос.УстановитьПараметр("Регистратор", СтрДок.Регистратор);
			Запрос.Текст = "ВЫБРАТЬ
			               |	ЛБ_СогласиеНаСМСРассылку.Согласен КАК Согласен
			               |ИЗ
			               |	РегистрСведений.ЛБ_СогласиеНаСМСРассылку КАК ЛБ_СогласиеНаСМСРассылку
			               |ГДЕ
			               |	ЛБ_СогласиеНаСМСРассылку.Регистратор = &Регистратор
			               |АВТОУПОРЯДОЧИВАНИЕ";
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда 
				Если ТипЗнч(СтрДок.Регистратор) = Тип("ДокументСсылка.ЛБ_ОперацияПоЗалогу") Тогда
					ПричинаИзменения = "ЗБ № " + СокрЛП(СтрДок.Регистратор.НомерЗалоговогоБилета) + " от " + Формат(СтрДок.Регистратор.Дата, "ДФ=dd.MM.yyyy");  
				Иначе 
					ПричинаИзменения = "Карточка клиента";
				КонецЕсли;                                   
				ОбластьСМС.Параметры.ПричинаИзменения = ПричинаИзменения;
				ДокументРезультат.Вывести(ОбластьПусто, 2);
			    ДокументРезультат.Вывести(ОбластьСМС, 2); 
						
				ДокументРезультат.Вывести(ОбластьПусто, 2);  
				ОбластьСтрокаСМС.Параметры.СтароеЗначение = ?(Выборка.Согласен, "Не согласен", "Согласен");
				ОбластьСтрокаСМС.Параметры.НовоеЗначение = ?(Выборка.Согласен, "Согласен", "Не согласен");; 
		        ДокументРезультат.Вывести(ОбластьСтрокаСМС, 2);
   			КонецЕсли;  

			ПричинаОтказа = ПолучитьПричинуОтказа(СтрДок.Регистратор);  
			Если НЕ ПустаяСтрока(ПричинаОтказа) Тогда 
				ДокументРезультат.Вывести(ОбластьПусто, 2); 
				ОбластьОтказ.Параметры.ПричинаОтказа = ПричинаОтказа;
			    ДокументРезультат.Вывести(ОбластьОтказ, 2); 
			КонецЕсли;	
		Конеццикла;		
		ДокументРезультат.ЗакончитьАвтогруппировкуСтрок();  
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьОперацию(Документ)
	Возврат Документ.ВидОперации;
КонецФункции	

&НаКлиенте
Процедура ДокументРезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда 
		СтандартнаяОбработка = Ложь; 
		Если Расшифровка.Вид = 1 Тогда			
			Расшифровка.Вставить("НеРедактировать", Истина);
			ОткрытьФорму("ОбщаяФорма.ЛБ_КарточкаЗалогодателя", Расшифровка, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
		Иначе
			Параметрыформы = Новый Структура;
			Параметрыформы.Вставить("Документ", Расшифровка.Регистратор); 
			ВидОперации = ПолучитьОперацию(Расшифровка.Регистратор);
			Если ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог") Тогда
				ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаВыдачиЗайма", Параметрыформы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление") Тогда 
				ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаПереоформленияЗайма", Параметрыформы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			КонецЕсли;  
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьДопСтатусыКлиента(Регистратор, Статус, ИстекСрок = Ложь, ДатаОтчета = Неопределено) 
	Результат = Новый Структура;
	Результат.Вставить("ЗначениеСтарое", "не установлен");
	Результат.Вставить("ЗначениеНовое", "не установлен");
	
	ЗапросС = Новый Запрос; 
	ЗапросС.УстановитьПараметр("Залогодатель", Отчет.Залогодатель);	
	ЗапросС.УстановитьПараметр("Статус", Статус);
	Если ИстекСрок Тогда
		//+МАН 25.08.25 Изменил
		//ДействующийПриказ = НайтиДействующийПриказ(Отчет.Залогодатель, Регистратор.ДатаОкончанияДействияПриказа, ИстекСрок, Регистратор, Истина, ДатаОтчета); //, Истина);
		ДействующийПриказ = НайтиДействующийПриказ(Отчет.Залогодатель, Регистратор.ДатаОкончанияДействияПриказа, ИстекСрок, Регистратор); //, Истина);
		//-МАН
	Иначе
		Если НачалоДня(Регистратор.Дата) = НачалоДня(Регистратор.ДатаНачалаДействияПриказа) Тогда
			ДатаНачала = Регистратор.Дата;
		Иначе
			ДатаНачала = Регистратор.ДатаНачалаДействияПриказа;
		КонецЕсли;
		ДействующийПриказ = НайтиДействующийПриказ(Отчет.Залогодатель, ДатаНачала, ИстекСрок, Регистратор, Истина);
	КонецЕсли;
	
	Если ДействующийПриказ = Неопределено ИЛИ ?(ИстекСрок, Ложь, ДействующийПриказ = Регистратор) Тогда
		Результат.ЗначениеНовое = "не установлен";
	Иначе					
		Если ИстекСрок Тогда
			Результат.ЗначениеСтарое = ?(ДействующийПриказ <> Неопределено, "установлен", "не установлен");
			Если ДействующийПриказ <> Неопределено И ДействующийПриказ.ДатаОкончанияДействияПриказа <> Дата(1,1,1) Тогда
				Результат.ЗначениеСтарое = Результат.ЗначениеСтарое + " по " + Формат(ДействующийПриказ.ДатаОкончанияДействияПриказа, "ДФ=dd.MM.yyyy") + " включительно";
			КонецЕсли;
		Иначе
			Результат.ЗначениеСтарое = ?(ДействующийПриказ <> Неопределено, "установлен", "не установлен");
			Если ДействующийПриказ <> Неопределено Тогда
				Если ДействующийПриказ <> Неопределено И ДействующийПриказ.ДатаОкончанияДействияПриказа <> Дата(1,1,1) Тогда // НЕ ВыборкаС.СрокДействия = Дата(1,1,1) Тогда 
					Если Регистратор.ВидОперации <> Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП Тогда
						Результат.ЗначениеСтарое = Результат.ЗначениеСтарое + " по " + Формат(ДействующийПриказ.ДатаОкончанияДействияПриказа, "ДФ=dd.MM.yyyy") + " включительно";
					Иначе
						Результат.ЗначениеСтарое = Результат.ЗначениеСтарое + " по " + Формат(ДействующийПриказ.ДатаОкончанияДействияПриказа, "ДФ=dd.MM.yyyy") + " включительно";
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	Если Регистратор.ВидОперации <> Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП Тогда
		ЗапросС.Текст = "ВЫБРАТЬ
		|	ЛБ_СтатусыЗалогодателей.Используется КАК Используется,
		|	ЛБ_СтатусыЗалогодателей.СрокДействия КАК СрокДействия,
		|	ЛБ_СтатусыЗалогодателей.Комментарий КАК Комментарий
		|ИЗ
		|	РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные КАК ЛБ_СтатусыЗалогодателей
		|ГДЕ
		|	ЛБ_СтатусыЗалогодателей.Регистратор = &Регистратор
		|	И ЛБ_СтатусыЗалогодателей.Залогодатель = &Залогодатель
		|	И ЛБ_СтатусыЗалогодателей.Статус = &Статус";
		ЗапросС.УстановитьПараметр("Регистратор", Регистратор);  
		ВыборкаС = ЗапросС.Выполнить().Выбрать();
		Если ВыборкаС.Следующий() Тогда
			Если ИстекСрок Тогда
				//+МАН 25.08.25
				//ДействующийПриказ = НайтиДействующийПриказ(Отчет.Залогодатель, Регистратор.ДатаОкончанияДействияПриказа, Истина, Регистратор,,ДатаОтчета);
				ДействующийПриказ = НайтиДействующийПриказ(Отчет.Залогодатель, ДатаОтчета, Истина, Регистратор);
				//-МАН
				
				Если ДействующийПриказ = Неопределено Тогда
					Результат.ЗначениеНовое = "не установлен";
				Иначе					
					Результат.ЗначениеНовое = ?(ВыборкаС.Используется, "установлен", "не установлен");  
					Если ВыборкаС.Используется Тогда
						Если НЕ ДействующийПриказ.ДатаОкончанияДействияПриказа = Дата(1,1,1) Тогда 
							//Было: Результат.ЗначениеНовое = Результат.ЗначениеНовое + " до " + Формат(КонецДня(ДействующийПриказ.ДатаОкончанияДействияПриказа)+1, "ДФ=dd.MM.yyyy");
							Результат.ЗначениеНовое = Результат.ЗначениеНовое + " по " + Формат(ДействующийПриказ.ДатаОкончанияДействияПриказа, "ДФ=dd.MM.yyyy") + " включительно";
						КонецЕсли;	
						Результат.ЗначениеНовое = Результат.ЗначениеНовое + ?(ПустаяСтрока(ВыборкаС.Комментарий), "", ", " + СокрЛП(ВыборкаС.Комментарий));
						Результат.ЗначениеНовое = Результат.ЗначениеНовое + Символы.ПС + "Действует приказ №" + ДействующийПриказ.НомерПриказа;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Результат.ЗначениеНовое = ?(ВыборкаС.Используется, "установлен", "не установлен");  
				Если ВыборкаС.Используется Тогда
					Если НЕ ВыборкаС.СрокДействия = Дата(1,1,1) Тогда 
						//Было: Результат.ЗначениеНовое = Результат.ЗначениеНовое + " до " + Формат(КонецДня(ВыборкаС.СрокДействия)+1, "ДФ=dd.MM.yyyy");
						Результат.ЗначениеНовое = Результат.ЗначениеНовое + " по " + Формат(ВыборкаС.СрокДействия, "ДФ=dd.MM.yyyy") + " включительно";
					КонецЕсли;	
					Результат.ЗначениеНовое = Результат.ЗначениеНовое + ?(ПустаяСтрока(ВыборкаС.Комментарий), "", ", " + СокрЛП(ВыборкаС.Комментарий));
				КонецЕсли;
			КонецЕсли;
		Иначе
			Результат.ЗначениеНовое = Результат.ЗначениеСтарое;
		КонецЕсли;
	Иначе
		//+МАН 08.04.25
		ЗапросС.Текст = "ВЫБРАТЬ
		                |	ЛБ_СтатусыЗалогодателей.Используется КАК Используется,
		                |	ЛБ_СтатусыЗалогодателей.СрокДействия КАК СрокДействия,
		                |	ЛБ_СтатусыЗалогодателей.Комментарий КАК Комментарий,
		                |	ЛБ_СтатусыЗалогодателей.Регистратор КАК Регистратор,
		                |	ЛБ_СтатусыЗалогодателей.Период КАК Период,
		                |	ЛБ_СтатусыЗалогодателей.Регистратор.НомерПриказа КАК РегистраторНомерПриказа
		                |ИЗ
		                |	РегистрСведений.ЛБ_СтатусыЗалогодателейДополнительные КАК ЛБ_СтатусыЗалогодателей
		                |ГДЕ
		                |	ЛБ_СтатусыЗалогодателей.Залогодатель = &Залогодатель
		                |	И ЛБ_СтатусыЗалогодателей.Статус = &Статус
		                |	И ЛБ_СтатусыЗалогодателей.Период < &Дата
						//+МАН 08.04.25
						|	И 100 = 100
		                |
		                |УПОРЯДОЧИТЬ ПО
		                //Было: |	ЛБ_СтатусыЗалогодателей.Период УБЫВ";
						|	ЛБ_СтатусыЗалогодателей.Регистратор.Дата УБЫВ";
						//-МАН
		//+МАН 08.04.25
		//Было: ЗапросС.УстановитьПараметр("Дата", Регистратор.Дата);
		Если НачалоДня(Регистратор.Дата) = НачалоДня(Регистратор.ДатаНачалаДействияПриказа) Тогда
			ЗапросС.УстановитьПараметр("Дата", Регистратор.Дата);
		Иначе
			ЗапросС.УстановитьПараметр("Дата", Регистратор.ДатаНачалаДействияПриказа);
		КонецЕсли;
		
		Если Регистратор.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП Тогда
			ЗапросС.Текст = СтрЗаменить(ЗапросС.Текст, "100 = 100", "НЕ ЛБ_СтатусыЗалогодателей.Регистратор = &Регистратор");
			ЗапросС.УстановитьПараметр("Регистратор", Регистратор);
		КонецЕсли;
		//-МАН

		ВыборкаС = ЗапросС.Выполнить().Выгрузить();
		Если ВыборкаС.Количество() > 0 тогда
			ДействующийПриказ = НайтиДействующийПриказ(Отчет.Залогодатель, ЗапросС.Параметры.Дата,, Регистратор);
			
			Если ДействующийПриказ <> Неопределено Тогда
				Отбор = Новый Структура;
				Отбор.Вставить("Регистратор", ДействующийПриказ);
				
				МассивСтр = ВыборкаС.НайтиСтроки(Отбор);
				
				Если МассивСтр.Количество() > 0 Тогда
					Стр = МассивСтр.Получить(0);
					Результат.ЗначениеНовое = ?(Стр.Используется, "установлен", "не установлен");
					Если Стр.Используется Тогда
						Если НЕ Стр.СрокДействия = Дата(1,1,1) Тогда 
							//Было: Результат.ЗначениеНовое = Результат.ЗначениеНовое + " до " + Формат(КонецДня(Стр.СрокДействия)+1, "ДФ=dd.MM.yyyy");
							Результат.ЗначениеНовое = Результат.ЗначениеНовое + " по " + Формат(Стр.СрокДействия, "ДФ=dd.MM.yyyy") + " включительно";
						КонецЕсли;
						
						Результат.ЗначениеНовое = Результат.ЗначениеНовое + Символы.ПС + "Действует приказ №" + Стр.РегистраторНомерПриказа;
						
					КонецЕсли;	
				Иначе
					Результат.ЗначениеНовое = "не установлен";
				КонецЕсли;
			Иначе
				Результат.ЗначениеНовое = "не установлен";
			КонецЕсли;
		Иначе
			Результат.ЗначениеНовое = Результат.ЗначениеСтарое;
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат Результат;	
КонецФункции	                            

//+МАН 25.08.25 Переименовал и сделал новую, с изменениями.
&НаСервере
Функция НайтиДействующийПриказСтарый(Залогодатель, Дата, ИстекСрок = Ложь, Регистратор = Неопределено, СтароеЗначение = Ложь, ДатаОтчета = Неопределено)
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	                |	Ставки.Регистратор КАК Регистратор,
	                |	Ставки.Период КАК Период
	                |ИЗ
	                |	(ВЫБРАТЬ ПЕРВЫЕ 1
	                |		ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК Регистратор,
	                |		ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период КАК Период
	                |	ИЗ
	                |		РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
	                |	ГДЕ
	                |		ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель = &Залогодатель
					|		И ВЫБОР
					|			КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период, ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия, ДЕНЬ) = 0
					|				ТОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период <= &Дата
					|			ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
					|		КОНЕЦ
	                //|		И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
	                |		И ВЫБОР
	                |				КОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	                |					ТОГДА ИСТИНА
	                |				КОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия >= &Дата
	                |					ТОГДА ИСТИНА
	                |				ИНАЧЕ ЛОЖЬ
	                |			КОНЕЦ
	                |		И 111 = 111
	                |		И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ВИП)
	                |	
	                |	УПОРЯДОЧИТЬ ПО
	                |		ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период УБЫВ) КАК Ставки
	                |
	                |ОБЪЕДИНИТЬ
	                |
	                |ВЫБРАТЬ
	                |	Металлы.Регистратор,
	                |	Металлы.Период
	                |ИЗ
	                |	(ВЫБРАТЬ ПЕРВЫЕ 1
	                |		ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор КАК Регистратор,
	                |		ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период КАК Период
	                |	ИЗ
	                |		РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
	                |	ГДЕ
	                |		ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель = &Залогодатель
					|		И ВЫБОР
					|			КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период, ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия, ДЕНЬ) = 0
					|				ТОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период <= &Дата
					|			ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
					|		КОНЕЦ
	                //|		И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
	                |		И ВЫБОР
	                |				КОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	                |					ТОГДА ИСТИНА
	                |				КОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия >= &Дата
	                |					ТОГДА ИСТИНА
	                |				ИНАЧЕ ЛОЖЬ
	                |			КОНЕЦ
	                |		И 222 = 222
	                |		И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ВИП)
	                |	
	                |	УПОРЯДОЧИТЬ ПО
	                |		ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период УБЫВ) КАК Металлы
	                |
	                |ОБЪЕДИНИТЬ
	                |
	                |ВЫБРАТЬ
	                |	Вставки.Регистратор,
	                |	Вставки.Период
	                |ИЗ
	                |	(ВЫБРАТЬ ПЕРВЫЕ 1
	                |		ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор КАК Регистратор,
	                |		ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период КАК Период
	                |	ИЗ
	                |		РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
	                |	ГДЕ
	                |		ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель = &Залогодатель
					|		И ВЫБОР
					|			КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период, ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия, ДЕНЬ) = 0
					|				ТОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период <= &Дата
					|			ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
					|		КОНЕЦ
	                //|		И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
	                |		И ВЫБОР
	                |				КОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	                |					ТОГДА ИСТИНА
	                |				КОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия >= &Дата
	                |					ТОГДА ИСТИНА
	                |				ИНАЧЕ ЛОЖЬ
	                |			КОНЕЦ
					|		И 333 = 333
	                |		И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ВИП)
	                |	
	                |	УПОРЯДОЧИТЬ ПО
	                |		ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период УБЫВ) КАК Вставки
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	Период УБЫВ";

	Если ИстекСрок Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "111 = 111", "НЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор В (&Регистратор)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "222 = 222", "НЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор В (&Регистратор)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "333 = 333", "НЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор В (&Регистратор)");
	КонецЕсли;
	//Иначе
	//+МАН 28.07.25 Закомментировал, чтобы отображались и отмененные документы
		//Запрос.Текст = СтрЗаменить(Запрос.Текст, "111 = 111", "НЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор В
		//            |					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		//            |						ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ОтменяемыйПриказ КАК ОтменяемыйПриказ
		//            |					ИЗ
		//            |						РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		//            |					ГДЕ
		//			|						ВЫБОР
		//			|							КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период, ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия, ДЕНЬ) = 0
		//			|								ТОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период <= &Дата
		//			|							ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
		//			|						КОНЕЦ
		//			//|						ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
		//            |						И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель = &Залогодатель
		//            |						И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ОтменяемыйПриказ <> ЗНАЧЕНИЕ(Документ.ЛБ_ПриказИндивидуальныеУсловия.ПустаяСсылка))");

		//Запрос.Текст = СтрЗаменить(Запрос.Текст, "222 = 222", "НЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор В
		//            |					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		//            |						ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ОтменяемыйПриказ КАК ОтменяемыйПриказ
		//            |					ИЗ
		//            |						РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
		//            |					ГДЕ
		//			|						ВЫБОР
		//			|							КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период, ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия, ДЕНЬ) = 0
		//			|								ТОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период <= &Дата
		//			|							ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
		//			|						КОНЕЦ
		//			//|						ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
		//            |						И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель = &Залогодатель
		//            |						И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ОтменяемыйПриказ <> ЗНАЧЕНИЕ(Документ.ЛБ_ПриказИндивидуальныеУсловия.ПустаяСсылка))");
		//Запрос.Текст = СтрЗаменить(Запрос.Текст, "333 = 333", "НЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор В
		//            |					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		//            |						ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ОтменяемыйПриказ КАК ОтменяемыйПриказ
		//            |					ИЗ
		//            |						РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
		//            |					ГДЕ
		//			|						ВЫБОР
		//			|							КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период, ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия, ДЕНЬ) = 0
		//			|								ТОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период <= &Дата
		//			|							ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
		//			|						КОНЕЦ
		//			//|						ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
		//            |						И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель = &Залогодатель
		//            |						И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ОтменяемыйПриказ <> ЗНАЧЕНИЕ(Документ.ЛБ_ПриказИндивидуальныеУсловия.ПустаяСсылка))");
	//-МАН
	//КонецЕсли;
	
	
	
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);	
	//+МАН 08.04.25
	//Было: Запрос.УстановитьПараметр("Дата", Дата);
	Если СтароеЗначение Тогда
		Запрос.УстановитьПараметр("Дата", Дата - 1);
	Иначе
		Запрос.УстановитьПараметр("Дата", Дата);
	КонецЕсли;
	//-МАН
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	//+МАН 28.07.25 Закомментировал, Изменил проверку результата
	//Если Результат.Следующий() Тогда
	//	Возврат Результат.Регистратор;
	//Иначе
	//	Возврат Неопределено;
	//КонецЕсли;
	//-МАН
	
	Пока Результат.Следующий() Цикл
		Если СтароеЗначение Тогда
			Возврат ПроверитьДействующий(Запрос.Параметры.Дата, Регистратор, Залогодатель, СтароеЗначение, ИстекСрок);
			//Возврат Результат.Регистратор;
		Иначе
			
			ПриказОтменен = ПроверитьОтмены(Запрос.Параметры.Дата, Регистратор, Залогодатель);
			
			Если ПриказОтменен <> Неопределено Тогда
				Возврат ПриказОтменен;
			Иначе
				ДействующийПриказ = ПроверитьДействующий(?(ИстекСрок, ДатаОтчета, Запрос.Параметры.Дата), Регистратор, Залогодатель, СтароеЗначение, ИстекСрок);
				
				Если ДействующийПриказ <> Неопределено Тогда
					Возврат ДействующийПриказ;
				КонецЕсли;
			КонецЕсли;
			
			//Отбор = Новый Структура;
			//Отбор.Вставить("Залогодатель", Залогодатель);
			//
			//МассивЗ = Результат.Регистратор.Залогодатели.НайтиСтроки(Отбор);
			//
			//Если МассивЗ.Количество() = 1 Тогда
			//	Если НЕ МассивЗ[0].НетСтавок ИЛИ НЕ МассивЗ[0].НетМеталлов ИЛИ НЕ МассивЗ[0].НетВставок Тогда
			//		Возврат Результат.Регистратор;
			//	КонецЕсли;
			//КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция НайтиДействующийПриказ (Залогодатель, Дата, ИстекСрок = Ложь, Регистратор = Неопределено, СтароеЗначение = Ложь)
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ Ставки
	               |ИЗ
	               |	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период, ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия, ДЕНЬ) = 0
	               |				ТОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период <= &Дата
	               |			ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ Металлы
	               |ИЗ
	               |	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период, ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия, ДЕНЬ) = 0
	               |				ТОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период <= &Дата
	               |			ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ Вставки
	               |ИЗ
	               |	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период, ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия, ДЕНЬ) = 0
	               |				ТОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период <= &Дата
	               |			ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Ставки.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ СтавкиСорт
	               |ИЗ
	               |	Ставки КАК Ставки
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Ставки.Регистратор.ДатаНачалаДействияПриказа УБЫВ,
	               |	Ставки.Регистратор.Дата УБЫВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Металлы.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ МеталыСорт
	               |ИЗ
	               |	Металлы КАК Металлы
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Металлы.Регистратор.ДатаНачалаДействияПриказа УБЫВ,
	               |	Металлы.Регистратор.Дата УБЫВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Вставки.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ ВставкиСорт
	               |ИЗ
	               |	Вставки КАК Вставки
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Вставки.Регистратор.ДатаНачалаДействияПриказа УБЫВ,
	               |	Вставки.Регистратор.Дата УБЫВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СтавкиСорт.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ СтавкиПерв
	               |ИЗ
	               |	СтавкиСорт КАК СтавкиСорт
	               |ГДЕ
	               |	НЕ СтавкиСорт.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
	               |	И НЕ СтавкиСорт.Регистратор В
	               |				(ВЫБРАТЬ
	               |					ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ОтменяемыйПриказ КАК ОтменяемыйПриказ
	               |				ИЗ
	               |					РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
	               |				ГДЕ
	               |					ВЫБОР
	               |						КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период, ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия, ДЕНЬ) = 0
	               |							ТОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период <= &Дата
	               |						ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
	               |					КОНЕЦ
	               |					И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
				   |					И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель = &Залогодатель
	               |				СГРУППИРОВАТЬ ПО
	               |					ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ОтменяемыйПриказ)
	               |	И ВЫБОР
	               |			КОГДА СтавкиСорт.Регистратор.ДатаОкончанияДействияПриказа = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА ИСТИНА
	               |			КОГДА СтавкиСорт.Регистратор.ДатаОкончанияДействияПриказа >= &Дата
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |	И 111 = 111
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МеталыСорт.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ МеталыПерв
	               |ИЗ
	               |	МеталыСорт КАК МеталыСорт
	               |ГДЕ
	               |	НЕ МеталыСорт.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
	               |	И НЕ МеталыСорт.Регистратор В
	               |				(ВЫБРАТЬ
	               |					ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ОтменяемыйПриказ КАК ОтменяемыйПриказ
	               |				ИЗ
	               |					РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
	               |				ГДЕ
	               |					ВЫБОР
	               |						КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период, ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия, ДЕНЬ) = 0
	               |							ТОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период <= &Дата
	               |						ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
	               |					КОНЕЦ
	               |					И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
				   |					И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель = &Залогодатель
	               |				СГРУППИРОВАТЬ ПО
	               |					ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ОтменяемыйПриказ)
	               |	И ВЫБОР
	               |			КОГДА МеталыСорт.Регистратор.ДатаОкончанияДействияПриказа = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА ИСТИНА
	               |			КОГДА МеталыСорт.Регистратор.ДатаОкончанияДействияПриказа >= &Дата
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |	И 222 = 222
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВставкиСорт.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ ВставкиПерв
	               |ИЗ
	               |	ВставкиСорт КАК ВставкиСорт
	               |ГДЕ
	               |	НЕ ВставкиСорт.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
	               |	И НЕ ВставкиСорт.Регистратор В
	               |				(ВЫБРАТЬ
	               |					ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ОтменяемыйПриказ КАК ОтменяемыйПриказ
	               |				ИЗ
	               |					РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
	               |				ГДЕ
	               |					ВЫБОР
	               |						КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период, ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия, ДЕНЬ) = 0
	               |							ТОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период <= &Дата
	               |						ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
	               |					КОНЕЦ
	               |					И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
				   |					И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель = &Залогодатель
	               |				СГРУППИРОВАТЬ ПО
	               |					ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ОтменяемыйПриказ)
	               |	И ВЫБОР
	               |			КОГДА ВставкиСорт.Регистратор.ДатаОкончанияДействияПриказа = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА ИСТИНА
	               |			КОГДА ВставкиСорт.Регистратор.ДатаОкончанияДействияПриказа >= &Дата
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |	И 333 = 333
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СтавкиПерв.Регистратор КАК Приказ,
	               |	СтавкиПерв.Регистратор.НомерПриказа КАК НомерПриказа,
	               |	СтавкиПерв.Регистратор.НомерСистемныйЧисло КАК СистемныйНомер,
	               |	СтавкиПерв.Регистратор.Дата КАК ДатаДокумента,
	               |	СтавкиПерв.Регистратор.ДатаНачалаДействияПриказа КАК ДатаНачалаДействия,
	               |	СтавкиПерв.Регистратор.ДатаОкончанияДействияПриказа КАК ДатаОкончанияДействия,
	               |	ИСТИНА КАК Ставки,
	               |	ЛОЖЬ КАК Металлы,
	               |	ЛОЖЬ КАК Вставки
	               |ПОМЕСТИТЬ Общая
	               |ИЗ
	               |	СтавкиПерв КАК СтавкиПерв
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	МеталыПерв.Регистратор,
	               |	МеталыПерв.Регистратор.НомерПриказа,
	               |	МеталыПерв.Регистратор.НомерСистемныйЧисло,
	               |	МеталыПерв.Регистратор.Дата,
	               |	МеталыПерв.Регистратор.ДатаНачалаДействияПриказа,
	               |	МеталыПерв.Регистратор.ДатаОкончанияДействияПриказа,
	               |	ЛОЖЬ,
	               |	ИСТИНА,
	               |	ЛОЖЬ
	               |ИЗ
	               |	МеталыПерв КАК МеталыПерв
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	ВставкиПерв.Регистратор,
	               |	ВставкиПерв.Регистратор.НомерПриказа,
	               |	ВставкиПерв.Регистратор.НомерСистемныйЧисло,
	               |	ВставкиПерв.Регистратор.Дата,
	               |	ВставкиПерв.Регистратор.ДатаНачалаДействияПриказа,
	               |	ВставкиПерв.Регистратор.ДатаОкончанияДействияПриказа,
	               |	ЛОЖЬ,
	               |	ЛОЖЬ,
	               |	ИСТИНА
	               |ИЗ
	               |	ВставкиПерв КАК ВставкиПерв
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Общая.Приказ КАК Приказ,
	               |	Общая.НомерПриказа КАК НомерПриказа,
	               |	Общая.СистемныйНомер КАК СистемныйНомер,
	               |	Общая.ДатаДокумента КАК ДатаДокумента,
	               |	Общая.ДатаНачалаДействия КАК ДатаНачалаДействия,
	               |	Общая.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	               |	МАКСИМУМ(Общая.Ставки) КАК Ставки,
	               |	МАКСИМУМ(Общая.Металлы) КАК Металлы,
	               |	МАКСИМУМ(Общая.Вставки) КАК Вставки
	               |ИЗ
	               |	Общая КАК Общая
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Общая.Приказ,
	               |	Общая.НомерПриказа,
	               |	Общая.ДатаДокумента,
	               |	Общая.ДатаНачалаДействия,
	               |	Общая.ДатаОкончанияДействия,
	               |	Общая.СистемныйНомер
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаНачалаДействия УБЫВ,
	               |	ДатаДокумента УБЫВ";

	//Если ИстекСрок Тогда
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "111 = 111", "НЕ СтавкиСорт.Регистратор = &Регистратор");
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "222 = 222", "НЕ МеталыСорт.Регистратор = &Регистратор");
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "333 = 333", "НЕ ВставкиСорт.Регистратор = &Регистратор");
	//КонецЕсли;
	
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);	

	Если СтароеЗначение Тогда
		Запрос.УстановитьПараметр("Дата", Дата - 1);
	Иначе
		Запрос.УстановитьПараметр("Дата", Дата);
	КонецЕсли;

	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		Возврат Результат.Приказ;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции
//

//+МАН 28.02.25
&НаСервере
Функция ПроверитьУсловияВДокументеПоЗалогодателю(Документ, Залогодатель)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИСТИНА КАК НетУсловий
		|ИЗ
		|	Документ.ЛБ_ПриказИндивидуальныеУсловия.Залогодатели КАК ЛБ_ПриказИндивидуальныеУсловияЗалогодатели
		|ГДЕ
		|	ЛБ_ПриказИндивидуальныеУсловияЗалогодатели.Ссылка = &Ссылка
		|	И ЛБ_ПриказИндивидуальныеУсловияЗалогодатели.Залогодатель = &Залогодатель
		|	И ВЫБОР
		|			КОГДА ЛБ_ПриказИндивидуальныеУсловияЗалогодатели.НетСтавок = ИСТИНА
		|					И ЛБ_ПриказИндивидуальныеУсловияЗалогодатели.НетМеталлов = ИСТИНА
		|					И ЛБ_ПриказИндивидуальныеУсловияЗалогодатели.НетВставок = ИСТИНА
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
//-МАН

&НаСервере
Функция ПроверитьОтмены(ДатаКон, Приказ, Залогодатель)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК Регистратор,
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период КАК Период
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.СрезПервых(
		|			&ДатаНач,
		|			Залогодатель В (&Залогодатель)
		|				И ОтменяемыйПриказ = &Регистратор
		|				И Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)) КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		|ГДЕ
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период МЕЖДУ &ДатаНач И &ДатаКон
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор,
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия,
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.СрезПервых(
		|			&ДатаНач,
		|			Залогодатель В (&Залогодатель)
		|				И ОтменяемыйПриказ = &Регистратор
		|				И Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)) КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
		|ГДЕ
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период МЕЖДУ &ДатаНач И &ДатаКон
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор,
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия,
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.СрезПервых(
		|			&ДатаНач,
		|			Залогодатель В (&Залогодатель)
		|				И ОтменяемыйПриказ = &Регистратор
		|				И Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)) КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
		|ГДЕ
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период МЕЖДУ &ДатаНач И &ДатаКон
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаНачалаДействия";

	Запрос.УстановитьПараметр("ДатаНач", ?(НачалоДня(Приказ.ОтменяемыйПриказ.ДатаНачалаДействияПриказа) > НачалоДня(Приказ.ОтменяемыйПриказ.Дата), Приказ.ОтменяемыйПриказ.ДатаНачалаДействияПриказа, Приказ.ОтменяемыйПриказ.Дата));
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.УстановитьПараметр("Регистратор", Приказ.ОтменяемыйПриказ);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	МассивУдаленияСтрок = Новый Массив;
	
	ТЗСтавки = Приказ.ОтменяемыйПриказ.СтавкиПроцентов.Выгрузить(, "Ставка");
	
	Для каждого СтрС Из ТЗСтавки Цикл
		Если СтрС.Ставка = 0 Тогда
			МассивУдаленияСтрок.Добавить(СтрС);
		КонецЕсли;			
	КонецЦикла;
	
	Если МассивУдаленияСтрок.Количество() > 0 Тогда
		Для каждого СтрМ Из МассивУдаленияСтрок Цикл
			ТЗСтавки.Удалить(СтрМ);
		КонецЦикла;
	КонецЕсли;

	УстановленныСтавки = ТЗСтавки.Количество() > 0;
	УстановленныМеталлы = Приказ.ОтменяемыйПриказ.НастройкаОтклоненийОтБазовыхЦенМеталлы.Количество() > 0;
	УстановленныВставки = Приказ.ОтменяемыйПриказ.НастройкаОтклоненийОтБазовыхЦенВставки.Количество() > 0;

	Для каждого Стр Из РезультатЗапроса Цикл
		Если УстановленныСтавки Тогда
			Если Стр.Регистратор.СтавкиПроцентов.Количество() > 0 Тогда
					
					ТЗСтавки.Очистить();
					МассивУдаленияСтрок.Очистить();
					
					ТЗСтавки = Стр.Регистратор.СтавкиПроцентов.Выгрузить(, "Ставка");
					
					Для каждого СтрТЗ Из ТЗСтавки Цикл
						Если СтрТЗ.Ставка = 0 Тогда
							МассивУдаленияСтрок.Добавить(СтрТЗ);
						КонецЕсли;			
					КонецЦикла;
					
					Если МассивУдаленияСтрок.Количество() > 0 Тогда
						Для каждого СтрМ Из МассивУдаленияСтрок Цикл
							ТЗСтавки.Удалить(СтрМ);
						КонецЦикла;
					КонецЕсли;

					Если ТЗСтавки.Количество() > 0 Тогда
						УстановленныСтавки = НЕ ТЗСтавки.Количество() > 0;
					КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если УстановленныМеталлы Тогда
			Если Стр.Регистратор.НастройкаОтклоненийОтБазовыхЦенМеталлы.Количество() > 0 Тогда
				УстановленныМеталлы = НЕ Стр.Регистратор.НастройкаОтклоненийОтБазовыхЦенМеталлы.Количество() > 0;
			КонецЕсли;
		КонецЕсли;
		
		Если УстановленныВставки Тогда
			Если Стр.Регистратор.НастройкаОтклоненийОтБазовыхЦенВставки.Количество() > 0 Тогда
				УстановленныВставки = НЕ Стр.Регистратор.НастройкаОтклоненийОтБазовыхЦенВставки.Количество() > 0;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ УстановленныСтавки И НЕ УстановленныМеталлы И НЕ УстановленныВставки Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ?(Приказ.ОтменяемыйПриказ = Документы.ЛБ_ПриказИндивидуальныеУсловия.ПустаяСсылка(), Неопределено, Приказ.ОтменяемыйПриказ);
	
КонецФункции

&НаСервере
Функция ПроверитьДействующий(ДатаКон, Приказ, Залогодатель, СтароеЗначение, ИстекСрок)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	Ставки.Регистратор КАК Регистратор,
		//|	Ставки.Период КАК Период
		//|ПОМЕСТИТЬ ВТ
		//|ИЗ
		//|	(ВЫБРАТЬ
		//|		ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК Регистратор,
		//|		ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период КАК Период
		//|	ИЗ
		//|		РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		//|	ГДЕ
		//|		ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель = &Залогодатель
		//|		И ВЫБОР
		//|				КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период, ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия, ДЕНЬ) = 0
		//|					ТОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период <= &Дата
		//|				ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
		//|			КОНЕЦ
		//|		И ВЫБОР
		//|				КОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		//|					ТОГДА ИСТИНА
		//|				КОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия >= &Дата
		//|					ТОГДА ИСТИНА
		//|				ИНАЧЕ ЛОЖЬ
		//|			КОНЕЦ) КАК Ставки
		//|
		//|ОБЪЕДИНИТЬ
		//|
		//|ВЫБРАТЬ
		//|	Металлы.Регистратор,
		//|	Металлы.Период
		//|ИЗ
		//|	(ВЫБРАТЬ
		//|		ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор КАК Регистратор,
		//|		ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период КАК Период
		//|	ИЗ
		//|		РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
		//|	ГДЕ
		//|		ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель = &Залогодатель
		//|		И ВЫБОР
		//|				КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период, ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия, ДЕНЬ) = 0
		//|					ТОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период <= &Дата
		//|				ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
		//|			КОНЕЦ
		//|		И ВЫБОР
		//|				КОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		//|					ТОГДА ИСТИНА
		//|				КОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия >= &Дата
		//|					ТОГДА ИСТИНА
		//|				ИНАЧЕ ЛОЖЬ
		//|			КОНЕЦ) КАК Металлы
		//|
		//|ОБЪЕДИНИТЬ
		//|
		//|ВЫБРАТЬ
		//|	Вставки.Регистратор,
		//|	Вставки.Период
		//|ИЗ
		//|	(ВЫБРАТЬ
		//|		ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор КАК Регистратор,
		//|		ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период КАК Период
		//|	ИЗ
		//|		РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
		//|	ГДЕ
		//|		ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель = &Залогодатель
		//|		И ВЫБОР
		//|				КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период, ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия, ДЕНЬ) = 0
		//|					ТОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период <= &Дата
		//|				ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
		//|			КОНЕЦ
		//|		И ВЫБОР
		//|				КОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		//|					ТОГДА ИСТИНА
		//|				КОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия >= &Дата
		//|					ТОГДА ИСТИНА
		//|				ИНАЧЕ ЛОЖЬ
		//|			КОНЕЦ) КАК Вставки
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ.Регистратор КАК Регистратор,
		//|	ВТ.Период КАК Период
		//|ИЗ
		//|	ВТ КАК ВТ
		//|ГДЕ
		//|	НЕ ВТ.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	Период УБЫВ";
///
		//"ВЫБРАТЬ
		//|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК Регистратор,
		//|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период КАК Период
		//|ПОМЕСТИТЬ ВТ
		//|ИЗ
		//|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		//|ГДЕ
		//|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель = &Залогодатель
		//|	И ВЫБОР
		//|			КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период, ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия, ДЕНЬ) = 0
		//|				ТОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период <= &Дата
		//|			ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
		//|		КОНЕЦ
		//|	И ВЫБОР
		//|			КОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		//|				ТОГДА ИСТИНА
		//|			КОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия >= &Дата
		//|				ТОГДА ИСТИНА
		//|			ИНАЧЕ ЛОЖЬ
		//|		КОНЕЦ
		//|	И НЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор.Ссылка В
		//|				(ВЫБРАТЬ
		//|					ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ОтменяемыйПриказ КАК ОтменяемыйПриказ
		//|				ИЗ
		//|					РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		//|				ГДЕ
		//|					ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель = &Залогодатель
		//|					И ВЫБОР
		//|						КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период, ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия, ДЕНЬ) = 0
		//|							ТОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период <= &Дата
		//|						ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
		//|					КОНЕЦ
		//|					И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		//|				СГРУППИРОВАТЬ ПО
		//|					ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ОтменяемыйПриказ)
		//|
		//|ОБЪЕДИНИТЬ
		//|
		//|ВЫБРАТЬ
		//|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор,
		//|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период
		//|ИЗ
		//|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
		//|ГДЕ
		//|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель = &Залогодатель
		//|	И ВЫБОР
		//|			КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период, ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия, ДЕНЬ) = 0
		//|				ТОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период <= &Дата
		//|			ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
		//|		КОНЕЦ
		//|	И ВЫБОР
		//|			КОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		//|				ТОГДА ИСТИНА
		//|			КОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия >= &Дата
		//|				ТОГДА ИСТИНА
		//|			ИНАЧЕ ЛОЖЬ
		//|		КОНЕЦ
		//|	И НЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор В
		//|				(ВЫБРАТЬ
		//|					ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ОтменяемыйПриказ КАК ОтменяемыйПриказ
		//|				ИЗ
		//|					РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
		//|				ГДЕ
		//|					ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель = &Залогодатель
		//|					И ВЫБОР
		//|						КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период, ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия, ДЕНЬ) = 0
		//|							ТОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период <= &Дата
		//|						ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
		//|					КОНЕЦ
		//|					И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		//|				СГРУППИРОВАТЬ ПО
		//|					ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ОтменяемыйПриказ)
		//|
		//|ОБЪЕДИНИТЬ
		//|
		//|ВЫБРАТЬ
		//|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор,
		//|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период
		//|ИЗ
		//|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
		//|ГДЕ
		//|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель = &Залогодатель
		//|	И ВЫБОР
		//|			КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период, ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия, ДЕНЬ) = 0
		//|				ТОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период <= &Дата
		//|			ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
		//|		КОНЕЦ
		//|	И ВЫБОР
		//|			КОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		//|				ТОГДА ИСТИНА
		//|			КОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия >= &Дата
		//|				ТОГДА ИСТИНА
		//|			ИНАЧЕ ЛОЖЬ
		//|		КОНЕЦ
		//|	И НЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор В
		//|				(ВЫБРАТЬ
		//|					ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ОтменяемыйПриказ КАК ОтменяемыйПриказ
		//|				ИЗ
		//|					РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
		//|				ГДЕ
		//|					ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель = &Залогодатель
		//|					И ВЫБОР
		//|						КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период, ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия, ДЕНЬ) = 0
		//|							ТОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период <= &Дата
		//|						ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
		//|					КОНЕЦ
		//|					И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		//|				СГРУППИРОВАТЬ ПО
		//|					ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ОтменяемыйПриказ)
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ.Регистратор КАК Регистратор,
		//|	ВТ.Период КАК Период
		//|ИЗ
		//|	ВТ КАК ВТ
		//|ГДЕ
		//|	НЕ ВТ.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	Период УБЫВ";
///
		"ВЫБРАТЬ
		|	Ставки.Регистратор КАК Регистратор,
		|	Ставки.Период КАК Период
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК Регистратор,
		|		ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период КАК Период
		|	ИЗ
		|		РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		|	ГДЕ
		|		ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель = &Залогодатель
		|		И ВЫБОР
		|				КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период, ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия, ДЕНЬ) = 0
		|					ТОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период <= &Дата
		|				ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
		|			КОНЕЦ
		|		И ВЫБОР
		|				КОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА ИСТИНА
		|				КОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия >= &Дата
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ
		|		И НЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор В
		|					(ВЫБРАТЬ
		|						ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ОтменяемыйПриказ КАК ОтменяемыйПриказ
		|					ИЗ
		|						РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		|					ГДЕ
		|						ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель = &Залогодатель
		|						И ВЫБОР
		|							КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период, ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия, ДЕНЬ) = 0
		|								ТОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период <= &Дата
		|							ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
		|						КОНЕЦ
		|						И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|					СГРУППИРОВАТЬ ПО
		|						ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ОтменяемыйПриказ)) КАК Ставки
		|ГДЕ
		|	111 = 111
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Металлы.Регистратор,
		|	Металлы.Период
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор КАК Регистратор,
		|		ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период КАК Период
		|	ИЗ
		|		РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
		|	ГДЕ
		|		ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель = &Залогодатель
		|		И ВЫБОР
		|				КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период, ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия, ДЕНЬ) = 0
		|					ТОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период <= &Дата
		|				ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
		|			КОНЕЦ
		|		И ВЫБОР
		|				КОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА ИСТИНА
		|				КОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия >= &Дата
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ
		|		И НЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор В
		|					(ВЫБРАТЬ
		|						ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ОтменяемыйПриказ КАК ОтменяемыйПриказ
		|					ИЗ
		|						РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
		|					ГДЕ
		|						ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель = &Залогодатель
		|						И ВЫБОР
		|							КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период, ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия, ДЕНЬ) = 0
		|								ТОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период <= &Дата
		|							ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
		|						КОНЕЦ
		|						И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|					СГРУППИРОВАТЬ ПО
		|						ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ОтменяемыйПриказ)) КАК Металлы
		|ГДЕ
		|	222 = 222
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Вставки.Регистратор,
		|	Вставки.Период
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор КАК Регистратор,
		|		ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период КАК Период
		|	ИЗ
		|		РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
		|	ГДЕ
		|		ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель = &Залогодатель
		|		И ВЫБОР
		|				КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период, ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия, ДЕНЬ) = 0
		|					ТОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период <= &Дата
		|				ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
		|			КОНЕЦ
		|		И ВЫБОР
		|				КОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА ИСТИНА
		|				КОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия >= &Дата
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ
		|		И НЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор В
		|					(ВЫБРАТЬ
		|						ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ОтменяемыйПриказ КАК ОтменяемыйПриказ
		|					ИЗ
		|						РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
		|					ГДЕ
		|						ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель = &Залогодатель
		|						И ВЫБОР
		|							КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период, ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия, ДЕНЬ) = 0
		|								ТОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период <= &Дата
		|							ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
		|						КОНЕЦ
		|						И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|					СГРУППИРОВАТЬ ПО
		|						ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ОтменяемыйПриказ)) КАК Вставки
		|ГДЕ
		|	333 = 333
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Регистратор КАК Регистратор,
		|	ВТ.Период КАК Период
		|ИЗ
		|	ВТ КАК ВТ
		|ГДЕ
		|	НЕ ВТ.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";

    Если НЕ СтароеЗначение Тогда
		МассивУдаленияСтрок = Новый Массив;
		
		ТЗСтавки = Приказ.СтавкиПроцентов.Выгрузить(, "Ставка");
		
		Для каждого СтрС Из ТЗСтавки Цикл
			Если СтрС.Ставка = 0 Тогда
				МассивУдаленияСтрок.Добавить(СтрС);
			КонецЕсли;			
		КонецЦикла;
		
		Если МассивУдаленияСтрок.Количество() > 0 Тогда
			Для каждого СтрМ Из МассивУдаленияСтрок Цикл
				ТЗСтавки.Удалить(СтрМ);
			КонецЦикла;
		КонецЕсли;
		
		Если ТЗСтавки.Количество() > 0 Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "111 = 111", "НЕ Ставки.Регистратор = &Регистратор");
		КонецЕсли;
		
		Если Приказ.НастройкаОтклоненийОтБазовыхЦенМеталлы.Количество() > 0 Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "222 = 222", "НЕ Металлы.Регистратор = &Регистратор");
		КонецЕсли;
		
		Если Приказ.НастройкаОтклоненийОтБазовыхЦенВставки.Количество() > 0 Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "333 = 333", "НЕ Вставки.Регистратор = &Регистратор");
		КонецЕсли;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.УстановитьПараметр("Дата", ДатаКон);
	Запрос.УстановитьПараметр("Регистратор", Приказ.ОтменяемыйПриказ);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() > 0 Тогда
		Если (Приказ.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП И НЕ СтароеЗначение) ИЛИ (ИстекСрок И НЕ СтароеЗначение) Тогда
			Для каждого Стр Из РезультатЗапроса Цикл
				//ПриказДействует = ПроверитьПриказ(?(НачалоДня(Стр.Регистратор.ДатаНачалаДействияПриказа) > НачалоДня(Стр.Регистратор.Дата), Стр.Регистратор.ДатаНачалаДействияПриказа, Стр.Регистратор.Дата), Залогодатель);
				ПриказДействует = ПроверитьПриказ(?(НачалоДня(Стр.Регистратор.ДатаНачалаДействияПриказа) > НачалоДня(Стр.Регистратор.Дата), Стр.Регистратор.ДатаНачалаДействияПриказа, Стр.Регистратор.Дата),
				ДатаКон, Залогодатель, Приказ.ОтменяемыйПриказ, Стр.Регистратор);
				
				//Если ПриказДействует.Ставки ИЛИ ПриказДействует.Металлы ИЛИ ПриказДействует.Вставки Тогда
				Если ПриказДействует Тогда
					Возврат Стр.Регистратор;
				Иначе
					Возврат Неопределено;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Возврат РезультатЗапроса[0].Регистратор;
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьОтменяемыеУсловия(Залогодатель, ПриказОтмены)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		|ГДЕ
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель = &Залогодатель
		|	И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор = &Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор,
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
		|ГДЕ
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель = &Залогодатель
		|	И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор = &Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор,
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
		|ГДЕ
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель = &Залогодатель
		|	И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор = &Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор,
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.УстановитьПараметр("Регистратор", ПриказОтмены);
	
	Пакеты = Запрос.ВыполнитьПакет();
	
	Ставки = Пакеты[0].Выбрать();
	Металлы = Пакеты[1].Выбрать();
	Вставки = Пакеты[2].Выбрать();
	
	СтруктураВозврата = Новый Структура("Ставки, Металлы, Вставки", Ставки.Следующий(), Металлы.Следующий(), Вставки.Следующий());
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаСервере
Функция ПроверитьПриказ(ДатаНач, ДатаКон, Залогодатель, ПриказОтмены, ПроверяемыйПриказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК Регистратор,
		//|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период КАК Период
		//|ИЗ
		//|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		//|ГДЕ
		//|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель = &Залогодатель
		//|	И НЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		//|	И ВЫБОР
		//|			КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период, ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия, ДЕНЬ) = 0
		//|				ТОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период < &Дата
		//|			ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия < &Дата
		//|		КОНЕЦ
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор,
		//|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор КАК Регистратор,
		//|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период КАК Период
		//|ИЗ
		//|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
		//|ГДЕ
		//|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель = &Залогодатель
		//|	И НЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		//|	И ВЫБОР
		//|			КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период, ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия, ДЕНЬ) = 0
		//|				ТОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период < &Дата
		//|			ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия < &Дата
		//|		КОНЕЦ
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор,
		//|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор КАК Регистратор,
		//|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период КАК Период
		//|ИЗ
		//|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
		//|ГДЕ
		//|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель = &Залогодатель
		//|	И НЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		//|	И ВЫБОР
		//|			КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период, ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия, ДЕНЬ) = 0
		//|				ТОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период < &Дата
		//|			ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия < &Дата
		//|		КОНЕЦ
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор,
		//|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период";
///
		//"ВЫБРАТЬ
		//|	Ставки.Регистратор КАК Регистратор,
		//|	Ставки.Период КАК Период
		//|ПОМЕСТИТЬ ВТ
		//|ИЗ
		//|	(ВЫБРАТЬ
		//|		ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК Регистратор,
		//|		ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период КАК Период
		//|	ИЗ
		//|		РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		//|	ГДЕ
		//|		ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель = &Залогодатель
		//|		И ВЫБОР
		//|				КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период, ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия, ДЕНЬ) = 0
		////|					ТОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период <= &Дата
		////|				ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
		//|					ТОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период МЕЖДУ &ДатаНач И &ДатаКон
		//|				ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия МЕЖДУ &ДатаНач И &ДатаКон
		//|			КОНЕЦ) КАК Ставки
		//|ГДЕ
		//|	НЕ Ставки.Регистратор = &Регистратор
		//|
		//|ОБЪЕДИНИТЬ
		//|
		//|ВЫБРАТЬ
		//|	Металлы.Регистратор,
		//|	Металлы.Период
		//|ИЗ
		//|	(ВЫБРАТЬ
		//|		ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор КАК Регистратор,
		//|		ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период КАК Период
		//|	ИЗ
		//|		РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
		//|	ГДЕ
		//|		ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель = &Залогодатель
		//|		И ВЫБОР
		//|				КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период, ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия, ДЕНЬ) = 0
		////|					ТОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период <= &Дата
		////|				ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
		//|					ТОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период МЕЖДУ &ДатаНач И &ДатаКон
		//|				ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия МЕЖДУ &ДатаНач И &ДатаКон
		//|			КОНЕЦ) КАК Металлы
		//|ГДЕ
		//|	НЕ Металлы.Регистратор = &Регистратор
		//|
		//|ОБЪЕДИНИТЬ
		//|
		//|ВЫБРАТЬ
		//|	Вставки.Регистратор,
		//|	Вставки.Период
		//|ИЗ
		//|	(ВЫБРАТЬ
		//|		ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор КАК Регистратор,
		//|		ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период КАК Период
		//|	ИЗ
		//|		РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
		//|	ГДЕ
		//|		ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель = &Залогодатель
		//|		И ВЫБОР
		//|				КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период, ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия, ДЕНЬ) = 0
		////|					ТОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период <= &Дата
		////|				ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
		//|					ТОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период МЕЖДУ &ДатаНач И &ДатаКон
		//|				ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия МЕЖДУ &ДатаНач И &ДатаКон
		//|			КОНЕЦ) КАК Вставки
		//|ГДЕ
		//|	НЕ Вставки.Регистратор = &Регистратор
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ.Регистратор КАК Регистратор,
		//|	ВТ.Период КАК Период
		//|ИЗ
		//|	ВТ КАК ВТ
		//|ГДЕ
		//|	НЕ ВТ.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	Период УБЫВ";
///
		"ВЫБРАТЬ
		|	Ставки.Регистратор КАК Регистратор,
		|	Ставки.Период КАК Период
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	(ВЫБРАТЬ ПЕРВЫЕ 1
		|		ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК Регистратор,
		|		ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период КАК Период
		|	ИЗ
		|		РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.СрезПоследних(, Залогодатель = &Залогодатель) КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		|	ГДЕ
		|		ВЫБОР
		|				КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период, ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия, ДЕНЬ) = 0
		|					ТОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период МЕЖДУ &ДатаНач И &ДатаКон
		|				ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия МЕЖДУ &ДатаНач И &ДатаКон
		|			КОНЕЦ
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор,
		|		ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период
		|	
		|	УПОРЯДОЧИТЬ ПО
		|		Период УБЫВ) КАК Ставки
		|ГДЕ
		|	НЕ Ставки.Регистратор = &Регистратор
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Металлы.Регистратор,
		|	Металлы.Период
		|ИЗ
		|	(ВЫБРАТЬ ПЕРВЫЕ 1
		|		ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор КАК Регистратор,
		|		ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период КАК Период
		|	ИЗ
		|		РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.СрезПоследних(, Залогодатель = &Залогодатель) КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
		|	ГДЕ
		|		ВЫБОР
		|				КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период, ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия, ДЕНЬ) = 0
		|					ТОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период МЕЖДУ &ДатаНач И &ДатаКон
		|				ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия МЕЖДУ &ДатаНач И &ДатаКон
		|			КОНЕЦ
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор,
		|		ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период
		|	
		|	УПОРЯДОЧИТЬ ПО
		|		Период УБЫВ) КАК Металлы
		|ГДЕ
		|	НЕ Металлы.Регистратор = &Регистратор
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Вставки.Регистратор,
		|	Вставки.Период
		|ИЗ
		|	(ВЫБРАТЬ ПЕРВЫЕ 1
		|		ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор КАК Регистратор,
		|		ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период КАК Период
		|	ИЗ
		|		РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.СрезПоследних(, Залогодатель = &Залогодатель) КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
		|	ГДЕ
		|		ВЫБОР
		|				КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период, ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия, ДЕНЬ) = 0
		|					ТОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период МЕЖДУ &ДатаНач И &ДатаКон
		|				ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия МЕЖДУ &ДатаНач И &ДатаКон
		|			КОНЕЦ
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор,
		|		ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период
		|	
		|	УПОРЯДОЧИТЬ ПО
		|		Период УБЫВ) КАК Вставки
		|ГДЕ
		|	НЕ Вставки.Регистратор = &Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Регистратор КАК Регистратор,
		|	ВТ.Период КАК Период
		|ИЗ
		|	ВТ КАК ВТ
		|ГДЕ
		|	НЕ ВТ.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
///
	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.УстановитьПараметр("Регистратор", ПриказОтмены);
	
	//Пакеты = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	//
	//Ставки = Пакеты[0].Выгрузить();
	//Металлы = Пакеты[1].Выгрузить();
	//Вставки = Пакеты[2].Выгрузить();

	СтруктураВозврата = Новый Структура("Ставки, Металлы, Вставки");
	//СтруктураВозврата.Ставки = Ставки.Количество() > 0;
	//СтруктураВозврата.Металлы = Металлы.Количество() > 0;
	//СтруктураВозврата.Вставки = Вставки.Количество() > 0;
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	Если РезультатЗапроса.Количество() > 0 Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("Регистратор", ПроверяемыйПриказ);
		
		МассивПоиска = РезультатЗапроса.НайтиСтроки(Отбор);
		
		Если МассивПоиска.Количество() > 0 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;

	Возврат Ложь;
	//Возврат СтруктураВозврата;

КонецФункции




