&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ПредыдущаяОперация") Тогда 
		ПредыдущаяОперация = Параметры.ПредыдущаяОперация; 
		
		Если Параметры.Свойство("ИнформацияВыкуп") Тогда 
		    ИнформацияВыкуп = Параметры.ИнформацияВыкуп;  
		КонецЕсли;
		
		ПереоформляемйЗБ = "Переоформляемый залоговый билет № " + СокрЛП(ПредыдущаяОперация.НомерЗалоговогоБилета); 
		ПереоформляемйЗБ = ПереоформляемйЗБ + Символы.ПС + "выдан " + Формат(ПредыдущаяОперация.Дата, "ДЛФ=DT") + 
		           ?(ЗначениеЗаполнено(ПредыдущаяОперация.Ломбард.НомерЛомбарда), " в ломбарде № " + СокрЛП(ПредыдущаяОперация.Ломбард.НомерЛомбарда), ", " + СокрЛП(ПредыдущаяОперация.Ломбард));
		ПереоформляемйЗБ = ПереоформляемйЗБ + Символы.ПС + "сумма займа " + СокрЛП(Формат(Этаформа.ПредыдущаяОперация.СуммаСсуды, "ЧЦ=15; ЧДЦ=2")) + " руб.";		   
		ПереоформляемйЗБ = ПереоформляемйЗБ + Символы.ПС + "заемщик " + СокрЛП(ПредыдущаяОперация.Залогодатель);  
		ПереоформляемйЗБ = ПереоформляемйЗБ + Символы.ПС + СокрЛП(ПредыдущаяОперация.СхемаКредитования) + " на " + СокрЛП(ПредыдущаяОперация.СрокЗалога) + " дн.";
		ПереоформляемйЗБ = ПереоформляемйЗБ + Символы.ПС + ИнформацияВыкуп; 
		
		Элементы.ИнформацияПереоформления.Заголовок = ПереоформляемйЗБ;  
	Иначе
		Элементы.ИнформацияПереоформления.Заголовок = ""; 
	КонецЕсли;	 
	Если Параметры.Свойство("Залогодатель") Тогда 
        Залогодатель = Параметры.Залогодатель;
	КонецЕсли;	
	Если Параметры.Свойство("Представитель") Тогда 
        Представитель = Параметры.Представитель;
	КонецЕсли;	
    Если Параметры.Свойство("СхемаКредитования") Тогда 
        СхемаКредитования = Параметры.СхемаКредитования;
	КонецЕсли;	
    Если Параметры.Свойство("СрокЗалога") Тогда 
        СрокЗалога = Параметры.СрокЗалога;
		СрокЗалогаСтрока = Строка(СрокЗалога) + " дн."
	КонецЕсли;	
    Если Параметры.Свойство("СуммаЗайма") Тогда 
        СуммаЗайма = Параметры.СуммаЗайма; 
		СуммаЗаймаСтрока = СокрЛП(Формат(СуммаЗайма, "ЧЦ=15; ЧДЦ=2")) + " руб.";
	КонецЕсли;	
    Если Параметры.Свойство("СписокОбъектовВыкуп") Тогда 
        СписокВыкупленныхОбъектовЗалога = Параметры.СписокОбъектовВыкуп;
	КонецЕсли; 	
	Если Параметры.Свойство("СуммаКВнесению") Тогда
	    СуммаКВнесению = Параметры.СуммаКВнесению;  		
	КонецЕсли;	
	Если Параметры.Свойство("СуммаКВыдаче") Тогда
	    СуммаКВыдаче = Параметры.СуммаКВыдаче;		
	КонецЕсли;	 
	Если Параметры.Свойство("ЕстьВНакладной") Тогда
	    ЕстьВНакладной = Параметры.ЕстьВНакладной;		
	КонецЕсли;	
	
	Если НЕ СуммаКВнесению = 0 Тогда   
		Элементы.ДекорацияВыдатьПолучить.Заголовок = "Получить от заемщика/доверенного лица " + СокрЛП(Формат(СуммаКВнесению, "ЧЦ=15; ЧДЦ=2")) + " руб.";
	ИначеЕсли НЕ СуммаКВыдаче = 0 Тогда	 
		Элементы.ДекорацияВыдатьПолучить.Заголовок = "Выдать заемщику/доверенному лицу " + СокрЛП(Формат(СуммаКВыдаче, "ЧЦ=15; ЧДЦ=2")) + " руб.";
	Иначе
		Элементы.ДекорацияВыдатьПолучить.Видимость = Ложь;
	КонецЕсли;
	
	Если СписокВыкупленныхОбъектовЗалога.Количество() = 0  И НЕ ЭтотОбъект.ЕстьВНакладной Тогда
		Элементы.ГруппаВнимание.Видимость = ложь;                                         
	Иначе	
		Если НЕ СписокВыкупленныхОбъектовЗалога.Количество() = 0 Тогда 
			ИнфВнимание  = ?(СписокВыкупленныхОбъектовЗалога.Количество() > 1, "Залоги:", "Залог:");
			Для каждого Эл Из ЭтаФорма.СписокВыкупленныхОбъектовЗалога Цикл
				ИнфВнимание = ИнфВнимание + Символы.ПС + " - " + Эл.Значение;
			КонецЦикла;	  
			Если СписокВыкупленныхОбъектовЗалога.Количество() > 1 Тогда
			    ИнфВнимание = ИнфВнимание + Символы.ПС + "не оформлены в новый билет и их необходимо выдать заемщику/доверенному лицу";
			Иначе
				ИнфВнимание = ИнфВнимание + Символы.ПС + "не оформлен в новый билет и его необходимо выдать заемщику/доверенному лицу";
			КонецЕсли;	
			Элементы.ДекорацияВнимание.Заголовок = ИнфВнимание;  
		Иначе
			Элементы.ДекорацияВнимание.Видимость = Ложь;
		КонецЕсли;	     
		Если ЕстьВНакладной Тогда 
			Элементы.ДекорацияВниманиеНакладная.Заголовок = "Предметы залога ЗБ № " + СокрЛП(ПредыдущаяОперация.НомерЗалоговогоБилета) + " от " + Формат(ПредыдущаяОперация.Дата, "ДФ=dd.MM.yyyy") + " будут исключены из накладной!";
		Иначе
			Элементы.ДекорацияВниманиеНакладная.Видимость = Ложь;
		КонецЕсли;	 
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(Представитель) Тогда
		Элементы.Представитель.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Переоформить(Команда)
	Закрыть(Истина);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

