// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда   
		Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийУстановитьШаблонПриказа.ПроцентныеСтавки Тогда
			Если НЕ ЗначениеЗаполнено(Этотобъект.СхемаКредитования) Тогда
				ОбщегоНазначения.СообщитьПользователю("Не выбрана схема кредитования!");
			    Отказ = Истина;                                                       
			КонецЕсли;	                                                              
			Если ЭтотОбъект.СтавкиПроцентов.Количество() = 0 Тогда 
				ОбщегоНазначения.СообщитьПользователю("Не заполнена табличная часть шаблона процентных ставок!");
			    Отказ = Истина;    
			КонецЕсли;	
		ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийУстановитьШаблонПриказа.ПроцентныеСтавкиАкция Тогда
			Если НЕ ЗначениеЗаполнено(Этотобъект.Акция) Тогда
				ОбщегоНазначения.СообщитьПользователю("Не выбрана акция!");
			    Отказ = Истина;                                                       
			КонецЕсли;	                                                              
			Если ЭтотОбъект.СтавкиПроцентовАкция.Количество() = 0 Тогда 
				ОбщегоНазначения.СообщитьПользователю("Не заполнена табличная часть шаблона процентных ставок (акция)!");
			    Отказ = Истина;    
			КонецЕсли;	
		ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийУстановитьШаблонПриказа.Вставки Тогда                                                              
			Если ЭтотОбъект.Вставки.Количество() = 0 Тогда 
				ОбщегоНазначения.СообщитьПользователю("Не заполнена табличная часть шаблона драгоценных вставок!");
			    Отказ = Истина;  
			Иначе
				ТаблицаПроверок = ЭтотОбъект.Вставки.Выгрузить();
				ТаблицаПроверок.Свернуть("Вставка, ФормаОгранки, ВидОгранки, КачествоОгранки, ВесоваяГруппа");
				
				Для каждого СтрП Из ТаблицаПроверок Цикл 
					Отбор = Новый Структура;
					Отбор.Вставить("Вставка", СтрП.Вставка); 
					Отбор.Вставить("ФормаОгранки", СтрП.ФормаОгранки);
					Отбор.Вставить("ВидОгранки", СтрП.ВидОгранки);
					Отбор.Вставить("КачествоОгранки", СтрП.КачествоОгранки);
					Отбор.Вставить("ВесоваяГруппа", СтрП.ВесоваяГруппа);
					Строки = ЭтотОбъект.Вставки.НайтиСтроки(Отбор); 
					Если Строки.Количество() > 1 Тогда  
						СтрокаДубля = СокрЛП(СтрП.Вставка) + ?(ЗначениеЗаполнено(СтрП.ФормаОгранки), ", " + СокрЛП(СтрП.ФормаОгранки), "") +  
						      ?(ЗначениеЗаполнено(СтрП.ВидОгранки), ", " + СокрЛП(СтрП.ВидОгранки), "") +
							  ?(ЗначениеЗаполнено(СтрП.КачествоОгранки), ", " + СокрЛП(СтрП.КачествоОгранкии), "") +
                              ?(ЗначениеЗаполнено(СтрП.ВесоваяГруппа), ", " + СокрЛП(СтрП.ВесоваяГруппа), "");
						ОбщегоНазначения.СообщитьПользователю("Дублирование строк в таблице вставок: " + СтрокаДубля + "!");
			            Отказ = Истина; 
					КонецЕсли;	
				КонецЦикла;	   
  			КонецЕсли;
		ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийУстановитьШаблонПриказа.Металлы Тогда                                                              
			Если ЭтотОбъект.Металлы.Количество() = 0 Тогда 
				ОбщегоНазначения.СообщитьПользователю("Не заполнена табличная часть шаблона драгоценных металлов!");
			    Отказ = Истина;  
			Иначе
				ТаблицаПроверок = ЭтотОбъект.Металлы.Выгрузить(); 
				ТаблицаПроверок.Свернуть("Металл, Проба, КатегорияОбъектаЗалога");
				Для каждого СтрП Из ТаблицаПроверок Цикл 
					Отбор = Новый Структура;
					Отбор.Вставить("Металл", СтрП.Металл); 
					Отбор.Вставить("Проба", СтрП.Проба);
					Отбор.Вставить("КатегорияОбъектаЗалога", СтрП.КатегорияОбъектаЗалога);
					Строки = ЭтотОбъект.Металлы.НайтиСтроки(Отбор); 
					Если Строки.Количество() > 1 Тогда  
						СтрокаДубля = СокрЛП(СтрП.Металл) + ", " + СокрЛП(СтрП.Проба) +  ", " + СокрЛП(СтрП.КатегорияОбъектаЗалога); 
						ОбщегоНазначения.СообщитьПользователю("Дублирование строк в таблице металлов: " + СтрокаДубля + "!");
			            Отказ = Истина; 
					КонецЕсли;	
				КонецЦикла;	   
				
				Если НЕ ЭтотОбъект.ОценкаПоБазовойКатегории.Количество() = 0 Тогда  
					ТаблицаПроверок = ЭтотОбъект.ОценкаПоБазовойКатегории.Выгрузить(); 
					ТаблицаПроверок.Свернуть("Металл, Проба, КатегорияОбъектаЗалога");
					Для каждого СтрП Из ТаблицаПроверок Цикл 
						Отбор = Новый Структура;
						Отбор.Вставить("Металл", СтрП.Металл); 
						Отбор.Вставить("Проба", СтрП.Проба);
						Отбор.Вставить("КатегорияОбъектаЗалога", СтрП.КатегорияОбъектаЗалога);
						Строки = ЭтотОбъект.ОценкаПоБазовойКатегории.НайтиСтроки(Отбор); 
						Если Строки.Количество() > 1 Тогда  
							СтрокаДубля = СокрЛП(СтрП.Металл) + ", " + СокрЛП(СтрП.Проба) +  ", " + СокрЛП(СтрП.КатегорияОбъектаЗалога); 
							ОбщегоНазначения.СообщитьПользователю("Дублирование строк в таблице основной настройки сценария оценки: " + СтрокаДубля + "!");
				            Отказ = Истина; 
						КонецЕсли;	
					КонецЦикла;	   
				КонецЕсли;	  
				
				Если НЕ ЭтотОбъект.НастройкаОтклоненийОтБазовыхЦен.Количество() = 0 Тогда 
					ТаблицаПроверок = ЭтотОбъект.НастройкаОтклоненийОтБазовыхЦен.Выгрузить(); 
					ТаблицаПроверок.Свернуть("СхемаКредитования, Металл, Проба, КатегорияОбъектаЗалога");
					Для каждого СтрП Из ТаблицаПроверок Цикл 
						Отбор = Новый Структура;   
						Отбор.Вставить("СхемаКредитования", СтрП.СхемаКредитования); 
						Отбор.Вставить("Металл", СтрП.Металл); 
						Отбор.Вставить("Проба", СтрП.Проба);
						Отбор.Вставить("КатегорияОбъектаЗалога", СтрП.КатегорияОбъектаЗалога);
						Строки = ЭтотОбъект.НастройкаОтклоненийОтБазовыхЦен.НайтиСтроки(Отбор); 
						Если Строки.Количество() > 1 Тогда  
							СтрокаДубля = СокрЛП(СтрП.СхемаКредитования) + ", " + СокрЛП(СтрП.Металл) + ", " + СокрЛП(СтрП.Проба) +  ", " + СокрЛП(СтрП.КатегорияОбъектаЗалога); 
							ОбщегоНазначения.СообщитьПользователю("Дублирование строк в таблице основной настройки отклонений по кредитным схемам: " + СтрокаДубля + "!");
				            Отказ = Истина; 
						КонецЕсли;	
					КонецЦикла;	   
				КонецЕсли;	

			КонецЕсли;			
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры
	
// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)  
	Движения.ЛБ_УстановкаОтменаШаблонаПриказа.Записывать = Истина;
	Движения.ЛБ_ТекущийШаблонПриказаПроцентныеСтавки.Записывать = Истина;
	Движения.ЛБ_ТекущийШаблонПриказаПроцентныеСтавкиАкция.Записывать = Истина;    
	Движения.ЛБ_ТекущийШаблонПриказаВставки.Записывать = Истина; 
	Движения.ЛБ_ТекущийШаблонПриказаМеталлы.Записывать = Истина; 
	Движения.ЛБ_ТекущийШаблонПриказаМеталлыНастройкаОтклонений.Записывать = Истина;
	
	ОбменДаннымиСервер.УдалитьДвиженияУДокумента(ЭтотОбъект);
	
	СписокЛ = Новый СписокЗначений;
	Для каждого СтрЛ Из Этотобъект.Ломбарды Цикл
		СписокЛ.Добавить(СтрЛ.Ломбард);
	КонецЦикла;                        
	Если СписокЛ.Количество() = 0 Тогда 
		СписокЛ.Добавить(Справочники.ЛБ_Ломбарды.ПустаяСсылка());
	КонецЕсли;	

	Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийУстановитьШаблонПриказа.ПроцентныеСтавки Тогда
		Для каждого Эл Из СписокЛ Цикл
			ДвижениеШаблон = Движения.ЛБ_УстановкаОтменаШаблонаПриказа.Добавить();
			ДвижениеШаблон.Период = Дата;
			ДвижениеШаблон.Ломбард = Эл.Значение;
			ДвижениеШаблон.СхемаКредитования = ЭтотОбъект.СхемаКредитования;  
			ДвижениеШаблон.ВидШаблона = ЭтотОбъект.ВидОперации;
			ДвижениеШаблон.ШаблонПриказа = ЭтотОбъект.Ссылка;

			Для каждого Стр Из ЭтотОбъект.СтавкиПроцентов Цикл 
				Движение = Движения.ЛБ_ТекущийШаблонПриказаПроцентныеСтавки.Добавить();
				Движение.Период = Дата;
				Движение.Ломбард = Эл.Значение;
				Движение.СхемаКредитования = ЭтотОбъект.СхемаКредитования;
				Движение.ПричинаПрименения = Стр.ПричинаПрименения;
				Движение.СтатусЗалогодателя = Стр.СтатусЗалогодателя;
				Движение.ДиапазонСумм = стр.ДиапазонСумм;
				Движение.ДеньНачалаПрименения = стр.ДеньНачалаПрименения;
			КонецЦикла;
		Конеццикла;	
	ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийУстановитьШаблонПриказа.ПроцентныеСтавкиАкция Тогда
		Для каждого Эл Из СписокЛ Цикл
			ДвижениеШаблон = Движения.ЛБ_УстановкаОтменаШаблонаПриказа.Добавить();
			ДвижениеШаблон.Период = Дата;
			ДвижениеШаблон.Ломбард = Эл.Значение;
			ДвижениеШаблон.ВидШаблона = ЭтотОбъект.ВидОперации;   
			ДвижениеШаблон.Акция = ЭтотОбъект.Акция;
			ДвижениеШаблон.ШаблонПриказа = ЭтотОбъект.Ссылка;

			Для каждого Стр Из ЭтотОбъект.СтавкиПроцентовАкция Цикл 
				Движение = Движения.ЛБ_ТекущийШаблонПриказаПроцентныеСтавкиАкция.Добавить();
				Движение.Период = Дата; 
				Движение.Акция = ЭтотОбъект.Акция;
				Движение.Ломбард = Эл.Значение;
				Движение.СхемаКредитования = Стр.СхемаКредитования;
				Движение.ПричинаПрименения = Стр.ПричинаПрименения;
				Движение.СтатусЗалогодателя = Стр.СтатусЗалогодателя;
				Движение.ДиапазонСумм = стр.ДиапазонСумм;
			КонецЦикла;
		Конеццикла;	   
	ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийУстановитьШаблонПриказа.Вставки Тогда
		Для каждого Эл Из СписокЛ Цикл	 
			ДвижениеШаблон = Движения.ЛБ_УстановкаОтменаШаблонаПриказа.Добавить();
			ДвижениеШаблон.Период = Дата;
			ДвижениеШаблон.Ломбард = Эл.Значение;
			ДвижениеШаблон.ВидШаблона = ЭтотОбъект.ВидОперации;
			ДвижениеШаблон.ШаблонПриказа = ЭтотОбъект.Ссылка;

			Для каждого Стр Из ЭтотОбъект.Вставки Цикл   				
				Движение = Движения.ЛБ_ТекущийШаблонПриказаВставки.Добавить();
				Движение.Период = Дата; 
				Движение.Ломбард = Эл.Значение;
				Движение.Вставка = Стр.Вставка;
				Движение.ФормаОгранки = Стр.ФормаОгранки;
				Движение.ВидОгранки = Стр.ВидОгранки;
				Движение.КачествоОгранки = стр.КачествоОгранки; 
				Движение.ВесоваяГруппа = стр.ВесоваяГруппа;
			КонецЦикла;
		Конеццикла;	
	ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийУстановитьШаблонПриказа.Металлы Тогда
		Для каждого Эл Из СписокЛ Цикл
			ДвижениеШаблон = Движения.ЛБ_УстановкаОтменаШаблонаПриказа.Добавить();
			ДвижениеШаблон.Период = Дата;
			ДвижениеШаблон.Ломбард = Эл.Значение;
			ДвижениеШаблон.ВидШаблона = ЭтотОбъект.ВидОперации;
			ДвижениеШаблон.ШаблонПриказа = ЭтотОбъект.Ссылка;

			Для каждого Стр Из ЭтотОбъект.Металлы Цикл 
				Движение = Движения.ЛБ_ТекущийШаблонПриказаМеталлы.Добавить();
				Движение.Период = Дата; 
				Движение.Ломбард = Эл.Значение;
				Движение.Металл = Стр.Металл;
				Движение.Проба = Стр.Проба;
				Движение.Категория = Стр.КатегорияОбъектаЗалога;   
				
				ГруппаПроб = ЛБ_ОбщийМодуль.ПолучитьГруппуПроб(Стр.Проба);
				ОтборБ = Новый структура;
				ОтборБ.Вставить("Металл", Стр.Металл);
				ОтборБ.Вставить("БазоваяПроба", ГруппаПроб);
				ОтборБ.Вставить("БазоваяКатегория", Стр.КатегорияОбъектаЗалога);
				
				СтрокиБ = ЭтотОбъект.БазовыеНастройки.НайтиСтроки(ОтборБ);
				Если НЕ СтрокиБ.Количество() = 0 Тогда  
					СтрБ = СтрокиБ.Получить(0); 
					Движение.БазоваяНастройка = Истина;
					Движение.БазоваяЦена = СтрБ.БазоваяЦена; 
				Иначе	               
					Отбор = Новый структура;
					Отбор.Вставить("Металл", Стр.Металл);
					Отбор.Вставить("Проба", ГруппаПроб);
					Отбор.Вставить("КатегорияОбъектаЗалога", Стр.КатегорияОбъектаЗалога);

					Строки = ЭтотОбъект.ОценкаПоБазовойКатегории.НайтиСтроки(Отбор); 
					Если НЕ Строки.Количество() = 0 Тогда 
						СтрО = Строки.Получить(0);
						Движение.ОклонениеОтБазовой = стрО.ОклонениеОтБазовой; 
						Движение.ЗначениеОтклонения = стрО.ЗначениеОтклонения;
						Движение.ПорядокОкругления = стрО.ПорядокОкругления;
						Движение.ОкруглятьВБольшуюСторону = стрО.ОкруглятьВБольшуюСторону;
					КонецЕсли;
				КонецЕсли;	
			КонецЦикла;
		Конеццикла;	
		
		Если НЕ ЭтотОбъект.НастройкаОтклоненийОтБазовыхЦен.Количество() = 0 Тогда 
			Для каждого Эл Из СписокЛ Цикл	
				Для каждого Стр Из ЭтотОбъект.НастройкаОтклоненийОтБазовыхЦен Цикл
					Если Стр.ЗначениеОтклонения = 0 Тогда
						Продолжить;
					КонецЕсли;	  
					Если ЗначениеЗаполнено(Стр.Проба) Тогда
						Для каждого СтрП Из Стр.Проба.Пробы Цикл 
							ОтборМ = Новый Структура;
							ОтборМ.Вставить("Металл",  Стр.Металл);
							ОтборМ.Вставить("Проба",  СтрП.Проба);
							
							СтрокиМ = ЭтотОбъект.Металлы.НайтиСтроки(ОтборМ);  
							Если СтрокиМ.Количество()= 0 Тогда 
								Продолжить;
							КонецЕсли;	

							Движение = Движения.ЛБ_ТекущийШаблонПриказаМеталлыНастройкаОтклонений.Добавить();
							Движение.Период = Дата; 
						    Движение.Ломбард = Эл.Значение;
		                    Движение.СхемаКредитования = Стр.СхемаКредитования;
							Движение.Металл = Стр.Металл;
						    Движение.Проба = СтрП.Проба;
						    Движение.Категория = Стр.КатегорияОбъектаЗалога;   
		                    Движение.ОклонениеОтБазовой = стр.ОтклонениеОтБазовойЦены; 
							Движение.ЗначениеОтклонения = стр.ЗначениеОтклонения;   
						КонецЦикла;	 
					Иначе  
						Движение = Движения.ЛБ_ТекущийШаблонПриказаМеталлыНастройкаОтклонений.Добавить();
						Движение.Период = Дата; 
					    Движение.Ломбард = Эл.Значение;
	                    Движение.СхемаКредитования = Стр.СхемаКредитования;
						Движение.Металл = Стр.Металл;
					    Движение.Категория = Стр.КатегорияОбъектаЗалога;   
	                    Движение.ОклонениеОтБазовой = стр.ОтклонениеОтБазовойЦены; 
						Движение.ЗначениеОтклонения = стр.ЗначениеОтклонения;   
					КонецЕсли;	
				КонецЦикла;
			КонецЦикла;	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаУдаленияПроведения".
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	Если НЕ ЭтотОбъект.ПометкаУдаления Тогда  
		Запрос = Новый Запрос; 
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийУстановитьШаблонПриказа.ПроцентныеСтавки Тогда
			Запрос.Текст = "ВЫБРАТЬ
			               |	ЛБ_ПриказУсловияПредоставленияЗаймовСхемыКредитования.Ссылка КАК Ссылка
			               |ИЗ
			               |	Документ.ЛБ_ПриказУсловияПредоставленияЗаймов.СхемыКредитования КАК ЛБ_ПриказУсловияПредоставленияЗаймовСхемыКредитования
			               |ГДЕ
			               |	ЛБ_ПриказУсловияПредоставленияЗаймовСхемыКредитования.Ссылка.ПометкаУдаления = ЛОЖЬ
			               |	И ЛБ_ПриказУсловияПредоставленияЗаймовСхемыКредитования.ШаблонПроцентныеСтавки = &Ссылка";
			Выборка = Запрос.Выполнить().Выбрать();
			Если НЕ Выборка.Количество() = 0 Тогда
				ОбщегоНазначения.СообщитьПользователю("Шаблон приказа уже использован для заполнения документа приказа. Отмена проведения запрещена.");
				Отказ = Истина;
			КонецЕсли;	
		ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийУстановитьШаблонПриказа.Вставки Тогда
			Запрос.Текст = "ВЫБРАТЬ
			               |	ЛБ_ПриказУсловияПредоставленияЗаймов.Ссылка КАК Ссылка
			               |ИЗ
			               |	Документ.ЛБ_ПриказУсловияПредоставленияЗаймов КАК ЛБ_ПриказУсловияПредоставленияЗаймов
			               |ГДЕ
			               |	ЛБ_ПриказУсловияПредоставленияЗаймов.ПометкаУдаления = ЛОЖЬ
			               |	И ЛБ_ПриказУсловияПредоставленияЗаймов.ШаблонВставки = &Ссылка";
			Выборка = Запрос.Выполнить().Выбрать();
			Если НЕ Выборка.Количество() = 0 Тогда
				ОбщегоНазначения.СообщитьПользователю("Шаблон приказа уже использован для заполнения документа приказа. Отмена проведения запрещена.");
				Отказ = Истина;
			КонецЕсли;	
        ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийУстановитьШаблонПриказа.Металлы Тогда
			Запрос.Текст = "ВЫБРАТЬ
			               |	ЛБ_ПриказУсловияПредоставленияЗаймов.Ссылка КАК Ссылка
			               |ИЗ
			               |	Документ.ЛБ_ПриказУсловияПредоставленияЗаймов КАК ЛБ_ПриказУсловияПредоставленияЗаймов
			               |ГДЕ
			               |	ЛБ_ПриказУсловияПредоставленияЗаймов.ПометкаУдаления = ЛОЖЬ
			               |	И ЛБ_ПриказУсловияПредоставленияЗаймов.ШаблонМеталлы = &Ссылка";
			Выборка = Запрос.Выполнить().Выбрать();
			Если НЕ Выборка.Количество() = 0 Тогда
				ОбщегоНазначения.СообщитьПользователю("Шаблон приказа уже использован для заполнения документа приказа. Отмена проведения запрещена.");
				Отказ = Истина;
			КонецЕсли;	
        ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийУстановитьШаблонПриказа.ПроцентныеСтавкиАкция Тогда
			Запрос.Текст = "ВЫБРАТЬ
			               |	ЛБ_ПриказУсловияПредоставленияЗаймов.Ссылка КАК Ссылка
			               |ИЗ
			               |	Документ.ЛБ_ПриказУсловияПредоставленияЗаймов КАК ЛБ_ПриказУсловияПредоставленияЗаймов
			               |ГДЕ
			               |	ЛБ_ПриказУсловияПредоставленияЗаймов.ПометкаУдаления = ЛОЖЬ
			               |	И ЛБ_ПриказУсловияПредоставленияЗаймов.ШаблонАкцииПроцентныеСтавки = &Ссылка";
			Выборка = Запрос.Выполнить().Выбрать();
			Если НЕ Выборка.Количество() = 0 Тогда
				ОбщегоНазначения.СообщитьПользователю("Шаблон приказа уже использован для заполнения документа приказа. Отмена проведения запрещена.");
				Отказ = Истина;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры // ОбработкаУдаленияПроведения()  

//+МАН 16.03.26 Добавлена запись номера без нулей. Завка 3654.
Процедура ПриЗаписи(Отказ)
	Если ПустаяСтрока(ЭтотОбъект.НомерДокументаБезНулей) Тогда
		ЭтотОбъект.НомерДокументаБезНулей = СтроковыеФункцииКлиентСервер.УдалитьПовторяющиесяСимволы(ЭтотОбъект.Номер, "0");
		ЭтотОбъект.Записать();
	КонецЕсли;
КонецПроцедуры
//-МАН
