
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Сценарий") Тогда 
		Сценарий = Параметры.Сценарий; 
		
		Для каждого СтрСпр из Сценарий.БазовыеНастройки Цикл    
			Стр = ТаблицаБазовыхЦен.Добавить(); 
			Стр.Металл = СтрСпр.Металл;
			Стр.БазоваяПроба = СтрСпр.БазоваяПроба;
			Стр.БазоваяКатегория = СтрСпр.БазоваяКатегория;
			Стр.БазоваяЦена = СтрСпр.БазоваяЦена;
		Конеццикла;	
	Иначе  
		ОбщегоНазначения.СообщитьПользователю("Не выбран сценарий!",,,,Истина);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)  
	ВсеОК = Истина;
	Для каждого Стр Из ТаблицаБазовыхЦен Цикл 
		Если Стр.БазоваяЦена = 0 Тогда
			ВсеОК = Ложь;
		КонецЕсли;	
	Конеццикла;	        
	Если ВсеОК Тогда  
		СтруктураВозврата = Новый структура;  
		СтруктураВозврата.Вставить("ТаблицаБазовыхЦен", ТаблицаБазовыхЦен);
		Закрыть(СтруктураВозврата);   
	Иначе
		Сообщить("Необходимо заполнить все базовые цены!", статусСообщения.Важное);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры
