Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.Базовый Тогда
		Движения.ЛБ_ТекущийШаблонПриказа.Записывать = Истина;                        
		Если ЭтотОбъект.Ломбарды.Количество() = 0 Тогда
			Движение = Движения.ЛБ_ТекущийШаблонПриказа.Добавить();
		    Движение.Период = Дата; 
			Движение.ВидПрейскуранта = Перечисления.ЛБ_ВидыПрейскурантов.Металлы;
			Движение.ШаблонПриказа = Шаблон;  
		Иначе  
			Для каждого стр Из ЭтотОбъект.Ломбарды Цикл 
				Движение = Движения.ЛБ_ТекущийШаблонПриказа.Добавить();
			    Движение.Период = Дата; 
				Движение.ВидПрейскуранта = Перечисления.ЛБ_ВидыПрейскурантов.Металлы; 
				Движение.Ломбард = Стр.Ломбард;
				Движение.ШаблонПриказа = Шаблон;
			КонецЦикла;	
		КонецЕсли;	
	Иначе
		Движения.ЛБ_ТекущийШаблонПриказаАкции.Записывать = Истина;   
		Для каждого стр Из ЭтотОбъект.ШаблоныАкция Цикл 
			Движение = Движения.ЛБ_ТекущийШаблонПриказаАкции.Добавить();
		    Движение.Период = Дата; 
			Движение.ВидПрейскуранта = Перечисления.ЛБ_ВидыПрейскурантов.Металлы;
			Движение.Акция = Стр.Акция;
			Движение.ШаблонПриказа = Стр.Шаблон;
		КонецЦикла;	 
	КонецЕсли;
КонецПроцедуры
