#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда  
	
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	//+МАН 16.12.24 Убирал стандартную кнопку печати т.к. добавлена своя. Заявка 2936.
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор  = "РКО";
	//КомандаПечати.Представление  = НСтр("ru = 'Печать РКО'");
	//-МАН
КонецПроцедуры	

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт	
	
	// Устанавливаем признак доступности печати покомплектно.
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	// Проверяем, нужно ли для макета ЗаключениеОбОценке формировать табличный документ.
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РКО") Тогда
		
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "РКО", "Печать РКО", 
		ПечатьРКО(МассивОбъектов, ОбъектыПечати));  
   	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьРКО(МассивОбъектов, ОбъектыПечати)
	Ссылка = МассивОбъектов[0];
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_РКО";  
	//+МАН 16.12.24 Только просмотр. Заявка 2936.
	ТабличныйДокумент.ТолькоПросмотр		= Истина;
	//-МАН
	
	// Получаем макет
	Макет = ПолучитьОбщийМакет("ПФ_MXL_КО2");
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.ПредставлениеОрганизации = СокрЛП(Ссылка.Организация); 
	ОбластьМакета.Параметры.ОрганизацияПоОКПО = "4107218";
	//+МАН Изменилось наименование ломбарда. Берем наименование из полного. Заявка 2956
	//Было: ОбластьМакета.Параметры.ПредставлениеПодразделения = СокрЛП(Ссылка.Ломбард);
	ОбластьМакета.Параметры.ПредставлениеПодразделения = СокрЛП(Ссылка.Ломбард.НаименованиеПолное);
	//-МАН
	ОбластьМакета.Параметры.КодПодразделения = СокрЛП(Ссылка.Ломбард.НомерЛомбарда);
	ОбластьМакета.Параметры.НомерДокумента = Ссылка.ПредставлениеНомераРКО;
	ОбластьМакета.Параметры.ДатаДокумента = Формат(Ссылка.Дата, "ДФ=dd.MM.yyyy"); 
	ОбластьМакета.Параметры.ФИОПолучателя = Ссылка.Выдано; 
	ОбластьМакета.Параметры.Основание = Ссылка.Основание; 
			
	МассивП = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СокрЛП(Ссылка.ДополнительнаяИнформация), " ");           
	Приложение = "";
	ПриложениеПродолжение = "";
	Для сч = 0 По МассивП.Количество() - 1 Цикл   
		СтрокаДобавить = " " + МассивП.Получить(сч);
		Если СтрДлина(Приложение + СтрокаДобавить)  <= 92 Тогда
		    Приложение = Приложение + СтрокаДобавить;
		Иначе
			ПриложениеПродолжение = ПриложениеПродолжение + СтрокаДобавить;
		КонецЕсли;	
	Конеццикла;	
	ОбластьМакета.Параметры.Приложение = Приложение; 
	ОбластьМакета.Параметры.ПриложениеПродолжение = ПриложениеПродолжение;

	
	МассивДул = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СокрЛП(Ссылка.ДУЛ), " ");           
	РеквизитыДокументаУдостоверяющегоЛичность = "";
	РеквизитыДокументаУдостоверяющегоЛичностьПродолжение = "";
	Для сч = 0 По МассивДул.Количество() - 1 Цикл   
		СтрокаДобавить = " " + МассивДул.Получить(сч);
		Если СтрДлина(РеквизитыДокументаУдостоверяющегоЛичность + СтрокаДобавить)  <= 92 Тогда
		    РеквизитыДокументаУдостоверяющегоЛичность = РеквизитыДокументаУдостоверяющегоЛичность + СтрокаДобавить;
		Иначе
			РеквизитыДокументаУдостоверяющегоЛичностьПродолжение = РеквизитыДокументаУдостоверяющегоЛичностьПродолжение + СтрокаДобавить;
		КонецЕсли;	
	Конеццикла;	
	ОбластьМакета.Параметры.РеквизитыДокументаУдостоверяющегоЛичность = РеквизитыДокументаУдостоверяющегоЛичность; 
	ОбластьМакета.Параметры.РеквизитыДокументаУдостоверяющегоЛичностьПродолжение = РеквизитыДокументаУдостоверяющегоЛичностьПродолжение;
	ОбластьМакета.Параметры.ФИОКассира = Ссылка.Ответственный; 
	ОбластьМакета.Параметры.ФИОГлавногоБухгалтера = Ссылка.Ответственный;
	
	СуммаРуб = Цел(Ссылка.Сумма);
	СуммаКоп = (Ссылка.Сумма - Цел(Ссылка.Сумма))*100;
	СуммаРубКоп = СокрЛП(Формат(СуммаРуб, "ЧЦ=15; ЧРГ=' '")) + " руб. " + СокрЛП(Формат(СуммаКоп, "ЧЦ=2; ЧН=00; ЧВН=")) + " коп."; 
	
	ФормСтрока = "Л = ru_RU; ДП = Ложь";
    ПарПредмета="рубль,рубля,рублей,м,копейка,копейки,копеек,м,2";
	СуммаПрописью = ЧислоПрописью(Ссылка.Сумма, ФормСтрока, ПарПредмета);	
	СуммаПрописьюПродолжение = "";
	Если СтрДлина(СуммаПрописью) > 92 Тогда
		н = 92;
		Пока н > 0 И Сред(СуммаПрописью, н, 1) <> " " Цикл
			н = н-1;
		КонецЦикла;
		
		СуммаПрописьюПродолжение = Сред(СуммаПрописью, н + 1);
		СуммаПрописью = Лев(СуммаПрописью, н);
	КонецЕсли;
	ОбластьМакета.Параметры.СуммаПрописью         = СуммаПрописью;
	ОбластьМакета.Параметры.СуммаПрописьюПродолжение = СуммаПрописьюПродолжение;

    ОбластьМакета.Параметры.ДебетСубСчет = СокрЛП(Ссылка.Дт); 
	ОбластьМакета.Параметры.КредитСубСчет = СокрЛП(Ссылка.Кт); 
	ОбластьМакета.Параметры.Сумма  = СуммаРубКоп;  
	ОбластьМакета.Параметры.ДатаДокументаПрописью = Формат(Ссылка.Дата, "ДФ='dd MMMM yyyy ""г.""'");
	ТабличныйДокумент.Вывести(ОбластьМакета);

	Возврат ТабличныйДокумент;
КонецФункции
#КонецЕсли	