Перем КассоваяСмена Экспорт; 

Функция ПолучитьДатуНачалаРасчетаПроцентов(ЗалоговыйБилет)
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилета.Период КАК Период,
	               |	ЛБ_СостояниеЗалоговогоБилета.ДатаНачалаРасчетаПроцентов КАК ДатаНачалаРасчета
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета КАК ЛБ_СостояниеЗалоговогоБилета
	               |ГДЕ
	               |	ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет = &ЗалоговыйБилет
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ";   
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Если НЕ Выборка.ДатаНачалаРасчета = Дата(1,1,1) Тогда
			Возврат Выборка.ДатаНачалаРасчета;
		КонецЕсли;	
	КонецЦикла;
	Возврат ЗалоговыйБилет.Дата;
КонецФункции

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда  
		СписокНеЗаполненныхРеквизитов = "";
		КолРеквизитов = 0;
		ПроверятьОстаток = Истина;
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Организация) Тогда 
			СписокНеЗаполненныхРеквизитов = СписокНеЗаполненныхРеквизитов + ?(ПустаяСтрока(СписокНеЗаполненныхРеквизитов), "", ", ") + "Организация"; 
			КолРеквизитов = КолРеквизитов + 1; 
			ПроверятьОстаток = Ложь;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Ломбард) Тогда 
			СписокНеЗаполненныхРеквизитов = СписокНеЗаполненныхРеквизитов + ?(ПустаяСтрока(СписокНеЗаполненныхРеквизитов), "", ", ") + "Ломбард"; 
			КолРеквизитов = КолРеквизитов + 1;
			ПроверятьОстаток = Ложь;
		КонецЕсли; 
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ВидОперации) Тогда 
			СписокНеЗаполненныхРеквизитов = СписокНеЗаполненныхРеквизитов + ?(ПустаяСтрока(СписокНеЗаполненныхРеквизитов), "", ", ") + "Вид операции"; 
			КолРеквизитов = КолРеквизитов + 1;
		КонецЕсли;
        Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ПредставлениеНомераРКО) Тогда 
			СписокНеЗаполненныхРеквизитов = СписокНеЗаполненныхРеквизитов + ?(ПустаяСтрока(СписокНеЗаполненныхРеквизитов), "", ", ") + "Номер РКО";
			КолРеквизитов = КолРеквизитов + 1;
		КонецЕсли;                        
		Если НЕ ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.СводныйРКО Тогда
	        Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Сумма) Тогда 
				СписокНеЗаполненныхРеквизитов = СписокНеЗаполненныхРеквизитов + ?(ПустаяСтрока(СписокНеЗаполненныхРеквизитов), "", ", ") + "Сумма";
				КолРеквизитов = КолРеквизитов + 1;
			КонецЕсли;
			//Савранин ++
			Если НЕ ЗагруженИзLX Тогда
				Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Контрагент) Тогда 
					СписокНеЗаполненныхРеквизитов = СписокНеЗаполненныхРеквизитов + ?(ПустаяСтрока(СписокНеЗаполненныхРеквизитов), "", ", ") + "Получатель";
					КолРеквизитов = КолРеквизитов + 1;
				КонецЕсли;  
				Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Выдано) Тогда 
					СписокНеЗаполненныхРеквизитов = СписокНеЗаполненныхРеквизитов + ?(ПустаяСтрока(СписокНеЗаполненныхРеквизитов), "", ", ") + "Выдано";
					КолРеквизитов = КолРеквизитов + 1;
				КонецЕсли; 
			КонецЕсли; 
			//Савранин ++
			Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ВыдачаДляЗачисленияНаКорпоративнуюКарту Тогда
				Если НЕ ЗначениеЗаполнено(ЭтотОбъект.БанковскаяКарта) Тогда 
					СписокНеЗаполненныхРеквизитов = СписокНеЗаполненныхРеквизитов + ?(ПустаяСтрока(СписокНеЗаполненныхРеквизитов), "", ", ") + "Банковская карта";
					КолРеквизитов = КолРеквизитов + 1;
				КонецЕсли;
			КонецЕсли;  
		КонецЕсли;	
		
		Если НЕ КолРеквизитов = 0 Тогда   
			ТекстСообщения = ?(КолРеквизитов = 1, "Не заполнен реквизит документа ", "Не заполнены реквизиты документа ");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения + СписокНеЗаполненныхРеквизитов);
			Отказ = Истина;
		КонецЕсли;	
		
		Если ПроверятьОстаток Тогда
			СуммаОстаток = ЛБ_ОбщийМодуль.ПроверитьНаличиеСуммыВКассеЛомбарда(?(ЗначениеЗаполнено(ЭтотОбъект.Ссылка), Дата, ТекущаяДатаСеанса()), Организация, Ломбард); 
			Если СуммаОстаток < ЭтотОбъект.Сумма Тогда
				ОбщегоНазначения.СообщитьПользователю("Остаток в кассе ломбарда " + СокрЛП(Формат(СуммаОстаток, "ЧЦ=15; ЧДЦ=2; ЧРД=,; ЧН=0,00")) + " руб., выдача ден. средств запрещена!");
				//Отказ = Истина;  //Закомментировала временно. Убрать потом!!!
			КонецЕсли;	
		КонецЕсли;	    
		//Закомментировала временно. Убрать потом!!!
		//Если НЕ Отказ Тогда
		//	Если РежимПроведения = РежимПроведенияДокумента.Неоперативный Тогда
		//		Если НачалоДня(Дата) = НачалоДня(ТекущаяДатаСеанса()) Тогда 
		//			Если НЕ ЭтотОбъект.Проведен ИЛИ ЛБ_ОбщийМодуль.КассовыеСменаСовпадаетСТекущей(ЭтотОбъект) Тогда
		//			    Дата = ТекущаяДатаСеанса(); 
		//			КонецЕсли;	
		//		ИначеЕсли НЕ ЭтотОбъект.Проведен Тогда
		//			ОбщегоНазначения.СообщитьПользователю("Неоперативное проведение документа запрещено!");
		//		    Отказ = Истина;
		//		КонецЕсли;	                   
		//	КонецЕсли;	
		//КонецЕсли;                                  
		//Закомментировала временно. Убрать потом!!!

		//Если НЕ Отказ Тогда
		//     Результат = ЛБ_ОбщийМодуль.ПолучитьОткрытуюКассовуюСмену(Дата, Организация, Ломбард); 
		//	 Если НЕ Результат = неопределено Тогда 
		//	     КассоваяСмена = Результат.КассоваяСмена;
		//	Иначе           
		//		ОбщегоНазначения.СообщитьПользователю("На дату документа не открыта кассовая смена!");
		//		Отказ = Истина;
		//	КонецЕсли;	  
		//КонецЕсли;
		//Если НЕ Отказ Тогда
		//	Если ЛБ_ОбщийМодуль.ПроверитьЕстьОтменаКО(Ссылка) Тогда 
		//		ОбщегоНазначения.СообщитьПользователю("Эта операция отменена!");
		//		Отказ = Истина;
		//	КонецЕсли;
		//КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры // ПередЗаписью()


// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)  
	Результат = ЛБ_ОбщийМодуль.ПолучитьОткрытуюКассовуюСмену(Дата, Организация, Ломбард); 
	Если НЕ Результат = неопределено Тогда 
	     КассоваяСмена = Результат.КассоваяСмена;  
	Иначе	 
        Отказ = Истина;  
		ОбщегоНазначения.СообщитьПользователю("На дату документа не открыта кассовая смена!");
		Возврат;
	КонецЕсли;	   
	
	Движения.ЛБ_ДенежныеСредства.Записывать = Истина;
    Движения.ЛБ_ДвиженияДенежныхСредств.Записывать = Истина;
	Движения.ЛБ_РасчетыСКлиентами.Записывать = Истина;

	Если НЕ ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.СводныйРКО Тогда
		Движение = Движения.ЛБ_ДенежныеСредства.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Ломбард = Ломбард;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.ВидДенежныхСредств = Перечисления.ЛБ_ВидыДенежныхСредств.Наличные;	
		Движение.Сумма = ЭтотОбъект.Сумма;

		Движение = Движения.ЛБ_ДвиженияДенежныхСредств.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Ломбард = Ломбард;
		Движение.ВидДенежныхСредств = Перечисления.ЛБ_ВидыДенежныхСредств.Наличные;	
		Движение.КассоваяСмена = КассоваяСмена;
		Движение.КассоваяОперация = ЭтотОбъект.Ссылка;
		Движение.Сумма = ЭтотОбъект.Сумма;      
		Движение.ВидОперации = ЭтотОбъект.ВидОперации;   
		Движение.ВидДвиженияДС = Перечисления.ЛБ_ВидыДвиженияДС.Расход;
		Движение.Номер = ЭтотОбъект.ПредставлениеНомераРКО;
		Движение.Дт = ЭтотОбъект.Дт;
		Движение.Кт = ЭтотОбъект.Кт;  
		Движение.ФизическоеЛицо = ЭтотОбъект.Контрагент;
		Движение.Контрагент = ЭтотОбъект.Контрагент;
		Движение.ФИО = ЭтотОбъект.Выдано; 
		Движение.ДУЛ = ЭтотОбъект.ДУЛ;
		Движение.Основание = ЭтотОбъект.Основание;  
		Движение.Приложение = ЭтотОбъект.Приложение;
		Движение.ДополнительнаяИнформация = ЭтотОбъект.ДополнительнаяИнформация; 
		Движение.БанковскаяКарта = ЭтотОбъект.БанковскаяКарта;
		
 //   	Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ВозвратПроцентов ИЛИ 
 //   		 ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ВозвратПроцентовПоЗаявке Тогда  
 //   	    ДатаНачалаРасчета = ПолучитьДатуНачалаРасчетаПроцентов(ЭтотОбъект.ЗалоговыйБилет); 
 //
 //   		Движение = Движения.ЛБ_РасчетыСКлиентами.Добавить();
 //   		Движение.Период = Дата;
 //   		Движение.Организация = Организация;   
 //   		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
 //   		Движение.Клиент = Контрагент;    
 //   		Движение.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам;
 //   		Движение.ДатаНачалаРасчета = ПолучитьДатуНачалаРасчетаПроцентов(ЭтотОбъект.ЗалоговыйБилет);
 //   		Движение.ЗалоговыйБилет = ЭтотОбъект.ЗалоговыйБилет;
 //   		Движение.Сумма = -Сумма;
 //   	КонецЕсли;	 
	КонецЕсли;	
КонецПроцедуры	        

КассоваяСмена = Документы.ЛБ_ОперацииКассовойСмены.ПустаяСсылка();
