&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	Объект.ОтветственныйСотрудник = ПараметрыСеанса.ТекущийСотрудник; 
	Объект.ОтветственныйПользователь = ПараметрыСеанса.ТекущийПользователь; 
	
	УстановитьСостояниеДокумента();
	ЛБ_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(, Объект, ЭтаФорма);
	
	ОсновнаяЕдиницаИзмерения = Константы.ЛБ_ОсновнаяЕдиницаМеталлы.Получить();
	ЗаполнитьВыборЕдиницИзмерения();
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьСписокЛомбардов();
	Элементы.СписокЛомбардов.Подсказка = Элементы.СписокЛомбардов.Заголовок;	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)  
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписидокумента.Проведение Тогда
		Если ТекущийОбъект.ДатаНачалаДействия < ТекущийОбъект.Дата Тогда
			Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
				Сообщить("Дата начала действия прейскуранта не может быть меньше даты документа!");
	            //Отказ = Истина;	
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЛБ_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(, Объект, ЭтаФорма);
	
	УстановитьСостояниеДокумента();
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура СписокЛомбардовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	
	ПараметрыФормы = Новый Структура;    
	ПараметрыФормы.Вставить("Ломбарды", Объект.Ломбарды); 
	ПараметрыФормы.Вставить("ДатаДок", ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Дата, ТекущаяДата()));
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЛомбардов",ЭтаФорма);
	
	ОткрытьФорму("Обработка.ЛБ_ВыборЛомбардовИзСписка.Форма", ПараметрыФормы, Элементы.СписокЛомбардов,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокЛомбардов()
	Результат = "";
	Для каждого Стр Из Объект.Ломбарды Цикл
		Результат = Результат + ?(ПустаяСтрока(Результат), "", "; ") + СокрЛП(Стр.Ломбард);
	КонецЦикла;	
	СписокЛомбардов = Результат;
	Объект.СтрокаЛомбарды = Результат;
КонецПроцедуры	
 
&НаСервере
Процедура ПослеВыбораЛомбардов(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;

	Объект.Ломбарды.Очистить();
	КоличествоВыбрано = Результат.Количество;
	Для сч = 1 По КоличествоВыбрано Цикл
		НоваяСтр = Объект.Ломбарды.Добавить();
		НоваяСтр.Ломбард = Результат["Значение" + Строка(сч)];
	КонецЦикла;	
	
	ЗаполнитьСписокЛомбардов();
	Элементы.СписокЛомбардов.Подсказка = Элементы.СписокЛомбардов.Заголовок;
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьВыборЕдиницИзмерения()
	ТаблицаЕдиницИзмерения = ЛБ_ОбщийМодуль.ВыборЕдиницИзмеренияРасчетаЦенМеталлов();
	Элементы.ЦеныЕдиницаИзмерения.СписокВыбора.Очистить();		
	Для каждого Стр Из ТаблицаЕдиницИзмерения Цикл
		Элементы.ЦеныЕдиницаИзмерения.СписокВыбора.Добавить(Стр.ЕдиницаИзмерения);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЦеныПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекСтрока = Элементы.Цены.ТекущиеДанные;
	Если НоваяСтрока Тогда		
		ТекСтрока.ЕдиницаИзмерения = ОсновнаяЕдиницаИзмерения;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если Объект.Дата > Объект.ДатаНачалаДействия Тогда
		Объект.ДатаНачалаДействия = Объект.Дата;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаОтклоненийОтБазовыхЦенПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И НЕ Копирование Тогда 
		ТекСтрока = Элементы.НастройкаОтклоненийОтБазовыхЦен.ТекущиеДанные;
        ТекСтрока.ОтклонениеОтБазовойЦены = ПредопределенноеЗначение("Перечисление.ЛБ_ОтклонениеОтБазовойЦены.Абсолютное");
	КонецЕсли;	
КонецПроцедуры







