&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ЗалоговыйБилет") Тогда 
		ЗалоговыйБилет = Параметры.ЗалоговыйБилет; 
		Если Параметры.Свойство("Получатель") Тогда  
			Получатель = Параметры.Получатель;
		КонецЕсли;	
		Если Параметры.Свойство("ФИОПолучателя") Тогда  
			ФИОПолучателя = Параметры.ФИОПолучателя;
		КонецЕсли;	
		Если Параметры.Свойство("ДоверенностьПолучателя") Тогда  
			ДоверенностьПолучателя = Параметры.ДоверенностьПолучателя;
		КонецЕсли;	
		Если Параметры.Свойство("Доверенность") Тогда  
			Доверенность = Параметры.Доверенность;
		КонецЕсли;	 
		Если Параметры.Свойство("Ломбард") Тогда  
			Ломбард = Параметры.Ломбард;
		КонецЕсли;	    

		Элементы.ДекорацияЗБ.Заголовок = "Залоговый билет № " + СокрЛП(ЗалоговыйБилет.НомерЗалоговогоБилета) + ", " + ?(ЗначениеЗаполнено(Ломбард.НомерЛомбарда), "ломбард № " + СокрЛП(Ломбард.НомерЛомбарда), сокрЛП(Ломбард));  
		Элементы.ДекорацияЗаемщик.Заголовок = "Заемщик: " + СокрЛП(ЗалоговыйБилет.Залогодатель.Фамилия) + " " + СокрЛП(ЗалоговыйБилет.Залогодатель.Имя) + ?(НЕ ПустаяСтрока(ЗалоговыйБилет.Залогодатель.Отчество), " " + СокрЛП(ЗалоговыйБилет.Залогодатель.Отчество), ""); 
		Если ЗалоговыйБилет.Залогодатель = Получатель Тогда
			Элементы.ДекорацияПолучатель.Заголовок = "Получатель залога: тот же";
		Иначе	
		    Элементы.ДекорацияПолучатель.Заголовок = "Получатель залога: " + ФИОПолучателя + ?(Не Пустаястрока(Доверенность), " (" + СокрЛП(Доверенность) + ")", "");  
		КонецЕсли;	
		Если Параметры.Свойство("ДатаДок") Тогда  
			ДатаДок = Параметры.ДатаДок;
		КонецЕсли;   
						
		Если ЗалоговыйБилет.Залогодатель = Получатель Тогда   
			Элементы.СпособПереоформления1.Видимость = Истина; 
			Элементы.СпособПереоформления.Видимость = Ложь;  
			Элементы.СпособПереоформления2.Видимость = Ложь; 
		ИначеЕсли НЕ ЛБ_ОбщийМодуль.ПроверитьЕстьДатаСмерти(ЗалоговыйБилет.Залогодатель, ДатаДок) = неопределено Тогда 
			Элементы.СпособПереоформления2.Видимость = Истина;
			Элементы.СпособПереоформления1.Видимость = Ложь; 
			Элементы.СпособПереоформления.Видимость = Ложь;
			СпособПереоформления = 1;
		Иначе  
			Элементы.СпособПереоформления1.Видимость = Ложь;  
			Элементы.СпособПереоформления2.Видимость = Ложь;
			Элементы.СпособПереоформления.Видимость = Истина;
		КонецЕсли;	
	Иначе
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры   

&НаКлиенте
Процедура ВыдатьЗалог(Команда)  
	Результат = Новый Структура;
	Результат.Вставить("Операция", 1);
	Закрыть(Результат);
КонецПроцедуры

&НаКлиенте
Процедура Переоформить(Команда)
	Результат = Новый Структура;
	Результат.Вставить("Операция", 2); 
	Результат.Вставить("СпособПереоформления", СпособПереоформления);
	Закрыть(Результат);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

