
// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)   
	Движения.ЛБ_КассоваяСмена.Записывать = Истина;
	Если Этотобъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийКассовойСмены.Открыть Тогда
		Движение = Движения.ЛБ_КассоваяСмена.Добавить();   
		Движение.Период = Дата;
		Движение.Статус = Перечисления.ЛБ_КассоваяСменаСтатус.Открыта;
		Движение.Организация = Организация;
		Движение.Ломбард = Ломбард;    
		Движение.КассоваяСмена = ЭтотОбъект.Ссылка;
		Движение.КассовыйДень = Дата;
		Движение.ПКОСводный = ЭтотОбъект.СводныйПКО;  
		Движение.РКОСводный = ЭтотОбъект.СводныйРКО;
		Движение.Ответственный = ЭтотОбъект.Ответственный;  
	ИначеЕсли Этотобъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийКассовойСмены.Закрыть Тогда
		ВозвратРезультат = ЛБ_ОбщийМодуль.ПолучитьОткрытуюКассовуюСмену(Дата, Организация, Ломбард);
		Если НЕ ВозвратРезультат = неопределено Тогда
			Движение = Движения.ЛБ_КассоваяСмена.Добавить();   
			Движение.Период = Дата;
			Движение.Статус = Перечисления.ЛБ_КассоваяСменаСтатус.Закрыта;
			Движение.КассоваяСмена = ВозвратРезультат.КассоваяСмена;      
			Движение.КассовыйДень = Движение.КассоваяСмена.Дата;
			Движение.Организация = Организация;
			Движение.Ломбард = Ломбард;
			Движение.РКОСводный = ВозвратРезультат.РКОСводный; 
			Движение.ПКОСводный = ВозвратРезультат.ПКОСводный; 
			Движение.Ответственный = ВозвратРезультат.Ответственный; 
		КонецЕсли;	
	ИначеЕсли Этотобъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийКассовойСмены.ЗакрытьКассовыйДень Тогда 
		ВозвратРезультат = ЛБ_ОбщийМодуль.ПолучитьТекущийСтатусКассовойСмены(Дата, Организация, Ломбард);
		Если НЕ ВозвратРезультат = неопределено Тогда
		    Движение = Движения.ЛБ_КассоваяСмена.Добавить();   
			Движение.Период = Дата;
			Движение.Статус = Перечисления.ЛБ_КассоваяСменаСтатус.КассовыйДеньЗакрыт; 
			Движение.КассовыйДень = ВозвратРезультат.КассовыйДень;
			Движение.Организация = Организация;
			Движение.Ломбард = Ломбард;    
			Движение.Ответственный = ЭтотОбъект.Ответственный;  
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры	