//УИН_Изделия
//
Функция СтрПодобна_Строка_16_Цифр(Текст) Экспорт
	Возврат ЛБ_СтрПодобнаПоРегулярномуВыражению(Текст, "^\d{16}$");
КонецФункции

Функция ЛБ_СтрПодобнаПоРегулярномуВыражению(Текст, РегулярноеВыражение, ИгнорироватьРегистр = Ложь, МногострочныйПоиск = Ложь) Экспорт
	Текст = СтрШаблон("%1", Текст);
	Возврат СтрПодобнаПоРегулярномуВыражению(Текст, РегулярноеВыражение, ИгнорироватьРегистр, МногострочныйПоиск);
КонецФункции

Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита, ВыбратьРазрешенные = Ложь, КодЯзыка = Неопределено, ЕслиНеопределено = Ложь) Экспорт
	Значение =ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита, ВыбратьРазрешенные = Ложь, КодЯзыка = Неопределено);
	Если Значение = Неопределено Тогда
		Возврат ЕслиНеопределено;
	КонецЕсли;
	Возврат Значение;
КонецФункции

Функция НайтиПоПолномуИмени(ИмяФормы) Экспорт
	Возврат Метаданные.НайтиПоПолномуИмени(ИмяФормы).Имя;
КонецФункции
