&НаКлиенте
Перем Сохранить Экспорт;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТолькоПросмотр") Тогда
		Элементы.СохранитьИЗакрыть.Доступность = НЕ Параметры.ТолькоПросмотр;
	КонецЕсли;
	
	Если Параметры.Свойство("Категория") Тогда 
		Категория = Параметры.Категория;
	КонецЕсли;
	
	Если Параметры.Свойство("Артикул") Тогда 
		Артикул = Параметры.Артикул;
		Элементы.Артикул.МаксимальнаяШирина = СтрДлина(Артикул);
	КонецЕсли;
	
	Если Параметры.Свойство("Именник") Тогда 
		Именник = Параметры.Именник;
	КонецЕсли;
	
	Если Параметры.Свойство("ДанныеИменника") Тогда 
		ДанныеИменника = Параметры.ДанныеИменника;
	КонецЕсли;
	
	Если Параметры.Свойство("ВидИзделия") Тогда 
		ВидИзделия = Параметры.ВидИзделия;
	КонецЕсли;
	
	Если Параметры.Свойство("Клеймо") Тогда 
		Клеймо = Параметры.Клеймо;
	КонецЕсли;
	
	Если Параметры.Свойство("Количество") Тогда 
		Количество = Параметры.Количество;
	КонецЕсли;
	
	Если Параметры.Свойство("МассаМеталла") Тогда 
		МассаМеталла = Параметры.МассаМеталла;
	КонецЕсли;
	
	Если Параметры.Свойство("ОбщаяМасса") Тогда 
		ОбщаяМасса = Параметры.ОбщаяМасса;
	КонецЕсли;
	
	Если Параметры.Свойство("Проба") Тогда 
		Проба = Параметры.Проба;
	КонецЕсли;
	
	Если Параметры.Свойство("КатегорияФакт") Тогда 
		КатегорияФакт = Параметры.КатегорияФакт;
	КонецЕсли;
	
	Если Параметры.Свойство("ИменникФакт") Тогда 
		ИменникФакт = Параметры.ИменникФакт;
	КонецЕсли;
	
	Если Параметры.Свойство("ВидИзделияФакт") Тогда 
		ВидИзделияФакт = Параметры.ВидИзделияФакт;
	КонецЕсли;
	
	Если Параметры.Свойство("КлеймоФакт") Тогда 
		КлеймоФакт = Параметры.КлеймоФакт;
	КонецЕсли;
	
	Если Параметры.Свойство("КоличествоФакт") Тогда 
		КоличествоФакт = Параметры.КоличествоФакт;
	КонецЕсли;
	
	Если Параметры.Свойство("МассаМеталлаФакт") Тогда 
		МассаМеталлаФакт = Параметры.МассаМеталлаФакт;
	КонецЕсли;
	
	Если Параметры.Свойство("ОбщаяМассаФакт") Тогда 
		ОбщаяМассаФакт = Параметры.ОбщаяМассаФакт;
	КонецЕсли;
	
	Если Параметры.Свойство("ПробаФакт") Тогда 
		ПробаФакт = Параметры.ПробаФакт;
	КонецЕсли;
	
	Если Параметры.Свойство("ДанныеИменникаФакт") Тогда 
		ДанныеИменникаФакт = Параметры.ДанныеИменникаФакт;
	КонецЕсли;
	
	Если Параметры.Свойство("НоваяСтрокаТЧ") Тогда
		НоваяСтрока = Параметры.НоваяСтрокаТЧ;
	Иначе
		НоваяСтрока = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("ИДНоваяСтрокаТЧ") Тогда
		ИДНоваяСтрока = Параметры.ИДНоваяСтрокаТЧ;
	КонецЕсли;
	
	Если Параметры.Свойство("Дата") Тогда
		Дата = Параметры.Дата;
	КонецЕсли;
	
	Если Параметры.Свойство("Ломбард") Тогда
		Ломбард = Параметры.Ломбард;
	КонецЕсли;
	
	Если Параметры.Свойство("СхемаКредитования") Тогда
		СхемаКредитования = Параметры.СхемаКредитования;
	КонецЕсли;
	
	Если Параметры.Свойство("ВесКамней") Тогда
		ВесКамней = Параметры.ВесКамней;
	КонецЕсли;
	
	Если Параметры.Свойство("ВесВставокМеталлов") Тогда
		ВесВставокМеталлов = Параметры.ВесВставокМеталлов;
	КонецЕсли;
	
	Если Параметры.Свойство("ЕдиницаИзмерения") Тогда
		ЕдиницаИзмерения = Параметры.ЕдиницаИзмерения;
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Отмена", Истина);
	СтруктураВозврата.Вставить("НоваяСтрокаТЧ", НоваяСтрока);
	СтруктураВозврата.Вставить("ИДНоваяСтрокаТЧ", ИДНоваяСтрока);
	
	Если Модифицированность Тогда
		
		Вопрос("Данные изменены!
		|Сохранить изменения?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
		
		Если КодВозвратаДиалога.Да = Истина Тогда
			СохранитьИЗакрыть(Истина);
		Иначе
			Модифицированность = Ложь;
			Этаформа.Закрыть(?(НоваяСтрока, СтруктураВозврата, Неопределено));
		КонецЕсли;
	Иначе
		Этаформа.Закрыть(?(НоваяСтрока, СтруктураВозврата, Неопределено));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	
	Если НЕ Проверить() Тогда
		Возврат;
	КонецЕсли;
	
	//ЕстьИзменения = ПроверитьНаличиеИзменений();
	//
	//Если ЕстьИзменения Тогда
	Сохранить = Истина;
	
	Если Категория <> КатегорияФакт Тогда
		Предупреждение("Изменилась категория изделия. Проверьте соответствие вставки фактической категории изделия!",,"Внимание!");
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ВидИзделияФакт", ВидИзделияФакт);
	СтруктураВозврата.Вставить("ИменникФакт", ИменникФакт);
	СтруктураВозврата.Вставить("ДанныеИменникаФакт", ДанныеИменникаФакт);
	СтруктураВозврата.Вставить("КатегорияФакт", КатегорияФакт);
	СтруктураВозврата.Вставить("КлеймоФакт", КлеймоФакт);
	СтруктураВозврата.Вставить("ПробаФакт", ПробаФакт);
	СтруктураВозврата.Вставить("КоличествоФакт", КоличествоФакт);
	СтруктураВозврата.Вставить("ОбщаяМассаФакт", ОбщаяМассаФакт);
	СтруктураВозврата.Вставить("МассаМеталлаФакт", МассаМеталлаФакт);
	СтруктураВозврата.Вставить("НоваяСтрокаТЧ", НоваяСтрока);
	СтруктураВозврата.Вставить("Отмена", Ложь);
	
	Этаформа.Закрыть(СтруктураВозврата);
	//Иначе
	//	Этаформа.Закрыть(Неопределено);
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция Проверить()
	
	ВсеОК = Истина;
	
	Если НЕ ЗначениеЗаполнено(ВидИзделияФакт) Тогда
		Сообщить("Не выбран вид изделия");
		ВсеОК = Ложь;
	КонецЕсли;
	
	//++ООВ 26.03.2026 Заявка 3757 Добавила условие
	
	//Если НЕ ЗначениеЗаполнено(ИменникФакт) Тогда
	//	Сообщить("Не указан именник");
	//	ВсеОК = Ложь;
	Если НЕ ЗначениеЗаполнено(ИменникФакт) И КоличествоФакт <> 0 Тогда
		Сообщить("Не указан именник");
		ВсеОК = Ложь;
		//--ООВ 26.03.2026 Заявка 3757	
	КонецЕсли;
	
	Если ИменникФакт = ПредопределенноеЗначение("Перечисление.ЛБ_Именник.Да") Тогда
		Если НЕ ЗначениеЗаполнено(ДанныеИменникаФакт) Тогда
			Сообщить("Не введены данные именника");
			ВсеОК = Ложь;
		КонецЕсли;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(КатегорияФакт) Тогда
		Сообщить("Не выбрана категория");
		ВсеОК = Ложь;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(КлеймоФакт) Тогда
		Сообщить("Не указано клеймо");
		ВсеОК = Ложь;
	КонецЕсли;
	
	//++ООВ 26.03.2026 Заявка 3757 Добавила условие
	
	//Если НЕ ЗначениеЗаполнено(ПробаФакт) Тогда
	//	Сообщить("Не выбрана проба");
	//	ВсеОК = Ложь; 
	Если НЕ ЗначениеЗаполнено(ПробаФакт) И КоличествоФакт <> 0 Тогда
		Сообщить("Не выбрана проба");
		ВсеОК = Ложь;
		//--ООВ 26.03.2026 Заявка 3757
		
	КонецЕсли;
	//Если КоличествоФакт = 0 Тогда
	//	Сообщить("Не указано количество");
	//	ВсеОК = Ложь;
	//КонецЕсли;
	
	//+МАН 26.05.25 Изменил
	Если КоличествоФакт > 0 И ОбщаяМассаФакт = 0 Тогда
		Сообщить("Не указан вес изделия");
		ВсеОК = Ложь;
	КонецЕсли;
	//-МАН
	
	Возврат ВсеОК;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Сохранить = Ложь;
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	
	Если Именник = ПредопределенноеЗначение("Перечисление.ЛБ_Именник.Да") Тогда
		Элементы.ДанныеИменника.Видимость = Истина;
	Иначе
		Элементы.ДанныеИменника.Видимость = Ложь;
	КонецЕсли;
	
	Если ИменникФакт = ПредопределенноеЗначение("Перечисление.ЛБ_Именник.Да") Тогда
		Элементы.ДанныеИменникаФакт.Видимость = Истина;
	Иначе
		Элементы.ДанныеИменникаФакт.Видимость = Ложь;
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		Элементы.ГруппаУчетныхДанных.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИменникФактПриИзменении(Элемент)
	
	Если ИменникФакт = ПредопределенноеЗначение("Перечисление.ЛБ_Именник.Нет") Тогда
		ДанныеИменникаФакт = "";
	КонецЕсли;
	
	Модифицированность = Истина;
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Сохранить Тогда
		Этаформа.Закрыть(); // ?(НоваяСтрока, СтруктураВозврата, Неопределено));
	Иначе
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("Отмена", Истина);
		СтруктураВозврата.Вставить("НоваяСтрокаТЧ", НоваяСтрока);
		СтруктураВозврата.Вставить("ИДНоваяСтрокаТЧ", ИДНоваяСтрока);
		
		Если Модифицированность Тогда
			
			Вопрос("Данные изменены!
			|Сохранить изменения?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
			
			Если КодВозвратаДиалога.Да = Истина Тогда
				СохранитьИЗакрыть(Истина);
			Иначе
				Модифицированность = Ложь;
				Этаформа.Закрыть(?(НоваяСтрока, СтруктураВозврата, Неопределено));
			КонецЕсли;
		Иначе
			Этаформа.Закрыть(?(НоваяСтрока, СтруктураВозврата, Неопределено));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПробаФактПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КатегорияФактПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбщаяМассаФактПриИзменении(Элемент)
	Модифицированность = Истина;
	//МассаМеталлаФакт = Цел(((ОбщаяМассаФакт - ВесКамней - ВесВставокМеталлов)*КоличествоФакт)*100)/100;
	МассаМеталлаФакт = Цел(((ОбщаяМассаФакт - ВесКамней - ВесВставокМеталлов))*100)/100;
КонецПроцедуры

&НаКлиенте
Процедура МассаМеталлаФактПриИзменении(Элемент)
	Модифицированность = Истина;
	МассаМеталлаФакт = Цел((МассаМеталлаФакт*КоличествоФакт)*100)/100;
КонецПроцедуры

&НаКлиенте
Функция ПроверитьНаличиеИзменений()
	Для каждого Элем Из Элементы.ГруппаУчетныхДанных.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(Элем) = Тип("ПолеФормы") Тогда
			Если ЭтотОбъект[Элем.Имя] <> ЭтотОбъект[Элем.Имя + "Факт"] Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура КоличествоФактОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	//Модифицированность = Истина;
	//
	//ВводимоеЧисло = Число(Текст);
	//
	//ОбщаяМассаФакт = ОбщаяМассаФакт/КоличествоФакт * ВводимоеЧисло;
	//МассаМеталлаФакт = МассаМеталлаФакт/КоличествоФакт * ВводимоеЧисло;
	//КоличествоФакт = ВводимоеЧисло;
КонецПроцедуры

// ++ ООВ 26.03.26 Заявка 3757
&НаКлиенте
Процедура КоличествоФактПриИзменении(Элемент)
	Если КоличествоФакт = 0 Тогда
		ПробаФакт = ПредопределенноеЗначение("Справочник.ЛБ_Пробы.ПустаяСсылка");
		ОбщаяМассаФакт = 0;
		МассаМеталлаФакт = 0;
	КонецЕсли;
КонецПроцедуры // -- ООВ 26.03.26 Заявка 3757
                                                