
&НаКлиенте
Процедура ВидДокументаЗалогодателяПриИзменении(Элемент)
	Если НЕ Запись.ВидДокументаЗалогодателя = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность") Тогда
		Если Запись.ТребуетсяДополнительныйДокумент Тогда
			Запись.ТребуетсяДополнительныйДокумент = Ложь;
		КонецЕсли;	
	КонецЕсли;	
	УстановитьДостпность();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДостпность();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДостпность()
	Если Запись.ВидДокументаЗалогодателя = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность") Тогда
		Элементы.ТребуетсяДополнительныйДокумент.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.ТребуетсяДополнительныйДокумент.ТолькоПросмотр = Истина;
	КонецЕсли;	
КонецПроцедуры	
