
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("НоваяСтрокаТЧ") Тогда
		НоваяСтрока = Параметры.НоваяСтрокаТЧ;
	Иначе
		НоваяСтрока = Ложь;
	КонецЕсли;

	Если Параметры.Свойство("ИДНоваяСтрокаТЧ") Тогда
		ИДНоваяСтрока = Параметры.ИДНоваяСтрокаТЧ;
	КонецЕсли;

	Если Параметры.Свойство("Ломбард") Тогда
		Ломбард = Параметры.Ломбард;
	КонецЕсли;

	Если Параметры.Свойство("ДатаИнвентаризации") Тогда
		ДатаИнвентаризации = Параметры.ДатаИнвентаризации;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Отмена", Истина);
	СтруктураВозврата.Вставить("НоваяСтрокаТЧ", НоваяСтрока);
	СтруктураВозврата.Вставить("ИДНоваяСтрокаТЧ", ИДНоваяСтрока);
	
	Этаформа.Закрыть(?(НоваяСтрока, СтруктураВозврата, Неопределено));
	
КонецПроцедуры

&НаСервере
Процедура НайтиОЗПоАртикулу()
	
	Если НЕ ПустаяСтрока(Артикул) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			|	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул
			|ИЗ
			|	РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
			|			&НаДату,
			|			Артикул ПОДОБНО &НомерЛомбарда + ""%"" + &АртикулОЗ + ""%""
			|				И Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|				И НЕ Регистратор В(ВЫБРАТЬ
		    |										ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
		    |									ИЗ
		    |										РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&НаДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
		    |									ГДЕ
		    |										ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (Регистратор))
			|				И Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			|			ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога
			|		ИЗ
			|			РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(
			|					&НаДату,
			|					Регистратор.ДокументОтмены = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)
			|						И НЕ Регистратор В(ВЫБРАТЬ
		    |										ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент КАК ОтмененныйДокумент
		    |									ИЗ
		    |										РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&НаДату, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
		    |									ГДЕ
		    |										ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор В (Регистратор))
			|						И Регистратор.ОтмененныйДокумент = ЗНАЧЕНИЕ(Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка)) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних) КАК СостояниеОбъектаЗалога
			|		ПО ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога = СостояниеОбъектаЗалога.ОбъектЗалога
			|ГДЕ
			|	СостояниеОбъектаЗалога.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Принят)
			|
			|УПОРЯДОЧИТЬ ПО
			|	Артикул";
		
		Запрос.УстановитьПараметр("АртикулОЗ", Артикул);
		Запрос.УстановитьПараметр("НаДату", ДатаИнвентаризации);
		
		Если СтрНайти(Артикул, "/") > 1 Тогда
            Запрос.Текст = СтрЗаменить(Запрос.Текст, "&НомерЛомбарда + ", "");
		Иначе
			//Преобразование строки в число, чтобы убрать нули
			Запрос.УстановитьПараметр("НомерЛомбарда", "" + СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Ломбард.НомерЛомбарда) + ?(СтрНайти(Артикул, "/") = 1, "", "/"));
		КонецЕсли;
		
		ОбъектыЗалога.Загрузить(Запрос.Выполнить().Выгрузить());
		
	Иначе
		ОбъектыЗалога.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НомерОчистка(Элемент, СтандартнаяОбработка)
	Артикул = "";
	НайтиОЗПоАртикулу();
КонецПроцедуры

//+Мельников 29.05.24 Закоментированно т.к. Автоматически не выделяется строка в ТЧ.

//&НаКлиенте
//Процедура НомерИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
//	Если СтрДлина(Текст) > 2 Тогда
//		Артикул = Текст;
//        НайтиОЗПоАртикулу(); 
//	ИначеЕсли СтрДлина(Текст) = 0 Тогда	 
//		Артикул = Текст;
//		ОбъектыЗалога.Очистить();
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура НомерОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
//	Если СтрДлина(Текст) > 2 Тогда
//		Артикул = Текст;
//	    НайтиОЗПоАртикулу();
//	ИначеЕсли СтрДлина(Текст) = 0 Тогда	 
//		Артикул = Текст;
//		ОбъектыЗалога.Очистить();
//	КонецЕсли;
//	//ЭтаФорма.ТекущийЭлемент = Элементы.ОбъектыЗалога;
//	//ЭтотОбъект.ТекущийЭлемент = Элементы.ОбъектыЗалога;
//	//ОбъектыЗалога
//	
//	
//КонецПроцедуры

//-Мельников

&НаКлиенте
Процедура ВыбратьОЗ(Команда)
	Если ОбъектыЗалога.Количество() > 0 Тогда
		ОкончаниеВыбораОЗ();
	Иначе
		Сообщить("Не выбран объект залога");
		Возврат
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыЗалогаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ОбъектыЗалога.Количество() > 0 Тогда
		ОкончаниеВыбораОЗ();
	Иначе
		Сообщить("Не выбран объект залога");
		Возврат
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеВыбораОЗ()

	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Отмена", Ложь);
	СтруктураВозврата.Вставить("НоваяСтрокаТЧ", НоваяСтрока);
	СтруктураВозврата.Вставить("ИДНоваяСтрокаТЧ", ИДНоваяСтрока);
	//Элементы.ОбъектыЗалога.ТекущаяСтрока = 1;
	СтруктураВозврата.Вставить("ОбъектЗалога", Элементы.ОбъектыЗалога.ТекущиеДанные.ОбъектЗалога);
	
	Этаформа.Закрыть(?(НоваяСтрока, СтруктураВозврата, Неопределено));
	
КонецПроцедуры

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	
	НайтиОЗПоАртикулу();
	
	Если ОбъектыЗалога.Количество() > 0 Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.ОбъектыЗалога;
		ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока = 0;
		
		//ОбъектShell = Новый COMОбъект("Wscript.Shell");
		//ОбъектShell.SendKeys("{DOWN}");
	КонецЕсли;
КонецПроцедуры
