
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Документ") Тогда
		Приказ = Параметры.Документ.Ссылка;  
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Приказ) Тогда 
		Сообщить("Не выбран приказ!");
		Возврат;
	КонецЕсли;   
	
	Если Параметры.ТолькоПросмотр = Истина Тогда
		Элементы.СохранитьИзменения.Доступность = ложь; 
		Элементы.ТаблицаВ.ТолькоПросмотр = Истина;  
	КонецЕсли;	
	
	ТаблицаВставок.Загрузить(Приказ.ЦеныВставки.Выгрузить());
	УдСтроки = Новый СписокЗначений;	
	Для каждого Стр Из ТаблицаВставок Цикл 
		Если НЕ Стр.ВидВставки = Справочники.ЛБ_ДрагоценныеКамни.Бриллиант Тогда 
			УдСтроки.Добавить(Стр);
		КонецЕсли;	
	КонецЦикла;                    
	
	Для каждого Эл из Удстроки Цикл
		ТаблицаВставок.Удалить(Эл.Значение);
	Конеццикла;	
	
	ВесовыеГруппыДоп = ТаблицаВставок.Выгрузить(, "ВесоваяГруппа");
	ВесовыеГруппыДоп.Свернуть("ВесоваяГруппа");   
	
	КлючСтроки = 0; 
	ВесовыеГруппы.Очистить();
	Для каждого СтрД Из ВесовыеГруппыДоп Цикл 
		КлючСтроки = КлючСтроки + 1;
		НоваяСтрД = ВесовыеГруппы.Добавить(); 
		НоваяСтрД.КлючСтроки = КлючСтроки; 
		НоваяСтрД.ВесоваяГруппа = СтрД.ВесоваяГруппа;
	КонецЦикла;
	
	Для каждого СтрД Из ВесовыеГруппы Цикл
	    ДобавитьКолонкуДоп(СтрД.КлючСтроки, СтрД.ВесоваяГруппа);
	КонецЦикла;   

	ЗаполнитьТаблицыИзПриказа();   
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицыИзПриказа() 		
	ТаблицаВставокДоп = ТаблицаВставок.Выгрузить();
	ТаблицаВставокДоп.Свернуть("ВидВставки, ФормаОгранки, ВидОгранки, КачествоОгранки");
	
	ТаблицаВ.Очистить();
	Для каждого Стр Из ТаблицаВставокДоп Цикл  
		НоваяСтр = ТаблицаВ.Добавить();		 
		НоваяСтр.ВидВставки = Стр.ВидВставки; 
		НоваяСтр.ФормаОгранки = Стр.ФормаОгранки;  
		НоваяСтр.ВидОгранки = Стр.ВидОгранки;
		НоваяСтр.КачествоОгранки = Стр.КачествоОгранки;
		
	    Отбор = Новый Структура;
		Отбор.Вставить("ВидВставки", Стр.ВидВставки); 
		Отбор.Вставить("ФормаОгранки", Стр.ФормаОгранки);
		Отбор.Вставить("ВидОгранки", Стр.ВидОгранки);
		Отбор.Вставить("КачествоОгранки", Стр.КачествоОгранки);
		Для каждого СтрК Из ВесовыеГруппы Цикл
			Отбор.Вставить("ВесоваяГруппа", СтрК.ВесоваяГруппа);
			Строки = ТаблицаВставок.НайтиСтроки(Отбор);
			Если НЕ Строки.Количество() = 0 Тогда 
				СтрВ = Строки.Получить(0);
			    НоваяСтр["ВесоваяГруппа_" + Строка(СтрК.КлючСтроки)] = СтрВ.Цена;
			КонецЕсли;	
        Конеццикла;
	Конеццикла;	   
	
КонецПроцедуры   

&НаСервере
Процедура ДобавитьКолонкуДоп(КлючСтроки, ВесоваяГруппа)
	МассивДобавляемыхРеквизитов = Новый Массив; 
	СписокТипов = Новый Массив;
    СписокТипов.Добавить(Тип("Число"));
    ОписаниеСоставногоТипа = Новый ОписаниеТипов(СписокТипов,,,Новый КвалификаторыЧисла(12,2));
	НовыйРеквизит = Новый РеквизитФормы("ВесоваяГруппа_" + СокрЛП(КлючСтроки), ОписаниеСоставногоТипа, "ТаблицаВ");
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);  
	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	 
	ПолеВвода = Элементы.Добавить(
		"ВесоваяГруппа_" + СокрЛП(КлючСтроки),    //Имя элемента формы
		Тип("ПолеФормы"), //Тип, всегда ПолеФормы
		Элементы.ТаблицаВ); //Контейнер для поля ввода (Форма,Группа,Страница)
		
	ПолеВвода.Заголовок = СокрЛП(ВесоваяГруппа);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода; 
	ПолеВвода.АвтоМаксимальнаяШирина = Ложь; 
	ПолеВвода.Ширина = 10;
	
	//Установка связи элемента с данными
	ПолеВвода.ПутьКДанным = "ТаблицаВ.ВесоваяГруппа_" + СокрЛП(КлючСтроки); 
	ПолеВвода.ВыбиратьТип = Ложь;
	ПолеВвода.КнопкаСоздания = Ложь;
	ПолеВвода.КнопкаОткрытия = Ложь;  
	
КонецПроцедуры	

&НаКлиенте
Процедура СохранитьИзменения(Команда)
	СохранитьПриказ();
	ЭтаФорма.Закрыть(Истина);
КонецПроцедуры

&НаСервере
Процедура СохранитьПриказ()
	СохранитьИзмененияВставокСФормы();
	ДокументОбъект = Приказ.ПолучитьОбъект();
	ДокументОбъект.ЦеныВставки.Загрузить(ТаблицаВставок.Выгрузить());
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура СохранитьИзмененияВставокСФормы()
	ТаблицаВставок.Загрузить(Приказ.ЦеныВставки.Выгрузить());
	Для каждого Стр Из ТаблицаВ Цикл  
		Отбор = Новый Структура;
		Отбор.Вставить("ВидВставки", Стр.ВидВставки); 
		Отбор.Вставить("ФормаОгранки", Стр.ФормаОгранки);
		Отбор.Вставить("ВидОгранки", Стр.ВидОгранки);
		Отбор.Вставить("КачествоОгранки", Стр.КачествоОгранки);	
		
		СтрокиС = ТаблицаВставок.НайтиСтроки(Отбор);
		Для каждого СтрС Из СтрокиС Цикл 
			ОтборД = Новый Структура;  
			ОтборД.Вставить("ВесоваяГруппа", СтрС.ВесоваяГруппа);
			СтрокиД = ВесовыеГруппы.НайтиСтроки(ОтборД); 
			Если НЕ СтрокиД.Количество() = 0 Тогда
				КлючСтроки = СтрокиД.Получить(0).КлючСтроки;
				СтрС.Цена = Стр["ВесоваяГруппа_" + Строка(КлючСтроки)];
			КонецЕсли;	
		Конеццикла;	
	Конеццикла;	  
КонецПроцедуры	

