
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	Если Параметры.Свойство("ЗалоговыйБилет") Тогда
		ЗалоговыйБилет = Параметры.ЗалоговыйБилет;
		Если Параметры.Свойство("Установить") Тогда  
			Установить = Параметры.Установить; 
		КонецЕсли;	 
	    Список.Параметры.УстановитьЗначениеПараметра("ЗалоговыйБилет", ЗалоговыйБилет);
		Список.Параметры.УстановитьЗначениеПараметра("Установить", Установить);
		
		Если Установить = Перечисления.ЛБ_УстановитьВПриказе.Ставки Тогда
			ТекстУстановить  = "приказы по % ставкам"; 
		ИначеЕсли Установить = Перечисления.ЛБ_УстановитьВПриказе.Металлы Тогда
			ТекстУстановить  = "приказы по ценам металлов";
		ИначеЕсли Установить = Перечисления.ЛБ_УстановитьВПриказе.Вставки Тогда
			ТекстУстановить  = "приказы по ценам драг. вставок";	
	    КонецЕсли;
		ЭтаФорма.Заголовок  = "ЗБ № " + СокрЛП(ЗалоговыйБилет.НомерЗалоговогоБилета)+ ": " + ТекстУстановить;
	Иначе	
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
