Функция СоздатьНовуюОплатуПроцентов(ЗалоговыйБилет)
	ДокументОбъект = Документы.ЛБ_ОперацияПоЗалогу.СоздатьДокумент(); 
	ДокументОбъект.ПредыдущаяОперация = ЗалоговыйБилет; 
	ДокументОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов;
	ДокументОбъект.Дата = ЭтотОбъект.Дата; 
	ДокументОбъект.Организация = ЭтотОбъект.Организация;
	ДокументОбъект.ПроцентнаяСхема = ЗалоговыйБилет.ПроцентнаяСхема;  
	Возврат ДокументОбъект; 
КонецФункции
	   
	   
 ////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ПередЗаписью".
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
КонецПроцедуры

// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	СписокСтатусовЗБ = Новый СписокЗначений;
	СписокСтатусовЗБ.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Оформлен); 
	СписокСтатусовЗБ.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Продлен);
    СписокСтатусовЗБ.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Наследство);
	СписокСтатусовЗБ.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ВключенВНакладную);  
	СписокСтатусовЗБ.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОбъявленТорг); 
	СписокСтатусовЗБ.Добавить(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Отгружен);  
	Запрос.УстановитьПараметр("СтатусыЗБ", СписокСтатусовЗБ); 
	Если ЭтотОбъект.Ломбарды.Количество() = 0 Тогда 
		ОтборПоЛомбардам = Ложь;
	Иначе  
		ОтборПоЛомбардам = Истина; 
		Запрос.УстановитьПараметр("Ломбарды", ЭтотОбъект.Ломбарды.ВыгрузитьКолонку("Ломбард"));
	КонецЕсли;	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаНачалаРасчетаПроцентов КАК ДатаНачалаРасчета
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&Дата, ЗалоговыйБилет.Организация = &Организация"; 
	Если  ОтборПоЛомбардам Тогда  
		Запрос.Текст = Запрос.Текст + "
	               |				И ЗалоговыйБилет.Ломбард В (&Ломбарды)";  
	КонецЕсли;	
	Запрос.Текст = Запрос.Текст + ") КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних
	               |ГДЕ
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета В (&СтатусыЗБ)";
	 
	ТаблицаЗБ = Запрос.Выполнить().Выгрузить(); 
	УдСтроки = Новый СписокЗначений;
	
	ЗапросИзъятие = Новый Запрос;
	ЗапросИзъятие.УстановитьПараметр("Дата", ЭтотОбъект.Дата);      
	ЗапросИзъятие.УстановитьПараметр("ЗБ", ТаблицаЗБ.ВыгрузитьКолонку("ЗалоговыйБилет"));
	ЗапросИзъятие.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет КАК ЗалоговыйБилет
	                      |ИЗ
	                      |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета КАК ЛБ_СостояниеЗалоговогоБилета
	                      |ГДЕ
	                      |	(ЛБ_СостояниеЗалоговогоБилета.СтатусЗалоговогоБилета = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыЗалоговыхБилетов.Изъят)
	                      |			ИЛИ ЛБ_СостояниеЗалоговогоБилета.СтатусЗалоговогоБилета = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыЗалоговыхБилетов.Остановлен)
	                      |				И ЛБ_СостояниеЗалоговогоБилета.Период < &Дата
	                      |				И ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет В (&ЗБ))";
    ВыборкаИзътие = ЗапросИзъятие.Выполнить().Выбрать();
	Пока ВыборкаИзътие.Следующий() Цикл  
		Отбор = Новый структура;
		Отбор.Вставить("ЗалоговыйБилет", ВыборкаИзътие.ЗалоговыйБилет);
		Строки = ТаблицаЗБ.НайтиСтроки(Отбор); 
		Если НЕ Строки.Количество() = 0 Тогда 
			УдСтроки.Добавить(Строки.Получить(0));
		КонецЕсли;	
	Конеццикла;	
	
	Для каждого Эл Из УдСтроки Цикл 
		ТаблицаЗБ.Удалить(Эл.Значение);
	Конеццикла;	
	
	Движения.ЛБ_РасчетыСКлиентамиБУ.Записывать = Истина;
	Если НЕ ТаблицаЗБ.Количество() = 0 Тогда    
		ЗапросРасчеты = Новый Запрос;  
		ЗапросРасчеты.УстановитьПараметр("ЗалоговыеБилеты", ТаблицаЗБ.ВыгрузитьКолонку("ЗалоговыйБилет"));
		ЗапросРасчеты.УстановитьПараметр("Организация", ЭтотОбъект.Организация); 
		ЗапросРасчеты.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
		ЗапросРасчеты.Текст = "ВЫБРАТЬ
		                      |	ЛБ_РасчетыСКлиентамиБУ.Регистратор КАК Регистратор,
		                      |	ЛБ_РасчетыСКлиентамиБУ.ЗалоговыйБилет КАК ЗалоговыйБилет,
		                      |	ЛБ_РасчетыСКлиентамиБУ.ДатаНачалаРасчета КАК ДатаНачалаРасчета,
		                      |	ЛБ_РасчетыСКлиентамиБУ.Сумма КАК Сумма
		                      |ИЗ
		                      |	РегистрНакопления.ЛБ_РасчетыСКлиентамиБУ КАК ЛБ_РасчетыСКлиентамиБУ
		                      |ГДЕ
		                      |	ЛБ_РасчетыСКлиентамиБУ.ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыРасчетов.ПоПроцентам)
		                      |	И ЛБ_РасчетыСКлиентамиБУ.ЗалоговыйБилет В(&ЗалоговыеБилеты)
		                      |	И ЛБ_РасчетыСКлиентамиБУ.Организация = &Организация
		                      |	И ЛБ_РасчетыСКлиентамиБУ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		                      |	И ЛБ_РасчетыСКлиентамиБУ.Период < &Дата
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	ЛБ_РасчетыСКлиентамиБУ.Период УБЫВ";
		ТаблицаРасчетов = ЗапросРасчеты.Выполнить().Выгрузить();
				
		Для каждого стр Из  ТаблицаЗБ Цикл    
			СтруктураП = ЛБ_УправлениеЛомбардом.ПолучитьПредельныеЗначенияПроцентов(Стр.ЗалоговыйБилет.Дата, стр.ЗалоговыйБилет.Организация);
			Если НЕ СтруктураП = неопределено Тогда
			    ПланкаПроцентов = СтруктураП.ПланкаПроцентов;
				ПредельноеЗначениеПроцентов = Стр.ЗалоговыйБилет.СуммаСсуды*СтруктураП.ПланкаПроцентов; 
			Иначе
				ПредельноеЗначениеПроцентов = 0;
			КонецЕсли;   
			СтруктураОкр = ЛБ_УправлениеЛомбардом.ПолучитьУсловияОкругленияПроцентов(Стр.ЗалоговыйБилет);
			Установки = ЛБ_УправлениеЛомбардом.ПолучитьУсловияПоДоговору(Стр.ЗалоговыйБилет); 
			ДокументОплатыПроцентов = СоздатьНовуюОплатуПроцентов(Стр.ЗалоговыйБилет);
			ПричинаПримененияПроцентнойСхемы = ЛБ_УправлениеЛомбардом.ПолучитьПричинуПримененияПроцентнойСхемы(ДокументОплатыПроцентов, Стр.ЗалоговыйБилет);
			Результат = ЛБ_ОбщийМодуль.РассчитатьСуммуПроцентовОплата(ДокументОплатыПроцентов, Стр.ДатаНачалаРасчета, ПредельноеЗначениеПроцентов, ПричинаПримененияПроцентнойСхемы, Установки, СтруктураОкр); 
			
			Если Результат.СуммаПроцентов = 0 Тогда
				Продолжить;
			КонецЕсли;	
			
			СуммаНачислено = 0;
			Отбор = Новый структура;
			Отбор.Вставить("ЗалоговыйБилет", Стр.ЗалоговыйБилет); 
			Отбор.Вставить("ДатаНачалаРасчета", Стр.ДатаНачалаРасчета);  
			
			СуммаОтмены = 0;
			СтрокиР = ТаблицаРасчетов.НайтиСтроки(Отбор);  
			Для каждого стрР Из СтрокиР Цикл  
				Если НЕ ТипЗнч(СтрР.Регистратор) = Тип("ДокументСсылка.ЛБ_РегламентноеНачислениеПроцентов") Тогда 
					Если СтрР.Сумма < 0 Тогда //отмена 
						СуммаОтмены = СтрР.Сумма;
						Продолжить;
					ИначеЕсли (СтрР.Сумма + СуммаОтмены) = 0 Тогда 
						СуммаОтмены = 0;
						Продолжить;
					Иначе	
					    Прервать;
					КонецЕсли;	
				КонецЕсли;	
				СуммаНачислено  = СуммаНачислено + стрР.Сумма;  
			Конеццикла;		
			
			СуммаПроцентовОстаток = ЛБ_ОбщийМодуль.ПолучитьОстатокПроцентов(ДокументОплатыПроцентов, Стр.ЗалоговыйБилет);
			СуммаПроцентов = Результат.СуммаПроцентов - СуммаНачислено - СуммаПроцентовОстаток;
			Если НЕ СуммаПроцентов = 0 Тогда
				Движение = Движения.ЛБ_РасчетыСКлиентамиБУ.Добавить();
				Движение.Период = Дата;     
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Организация = Организация; 
				Движение.Ломбард = Стр.ЗалоговыйБилет.Ломбард;
				Движение.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам;
				Движение.Клиент = Стр.ЗалоговыйБилет.Залогодатель;
				Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;				
				Движение.ДатаНачалаРасчета = Стр.ДатаНачалаРасчета;		
				Движение.Сумма = СуммаПроцентов;     
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры	