	
// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Ссылка) тогда
	//    ЭтотОбъект.Дата = ТекущаяДатаСеанса();
	КонецЕсли;	
	
	Если НЕ ЭтотОбъект.ЗагруженИЗLX Тогда
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда  
			ЕстьВРеализации = Ложь;
			Для каждого Стр Из ЭтотОбъект.Товары Цикл
				СтруктураВ = ЛБ_УправлениеЛомбардом.ПроверитьОбъектЗалогаДобавленВРеализацию(Стр.ЗалоговыйБилет, Стр.ОбъектЗалога);
				Если СтруктураВ = неопределено Тогда
					Продолжить;
				Иначе 
					ЕстьВРеализации = Истина;               
					ТекстСообщения = "Залог " + ПолучитьАртикулОЗ(Стр.ЗалоговыйБилет, Стр.ОбъектЗалога) + " добавлен в реализацию" + 
					?(ЗначениеЗаполнено(СтруктураВ.Регистратор), " № " + СокрЛП(СтруктураВ.Регистратор.ПредставлениеНомера) + " от " + Формат(СтруктураВ.Регистратор.Дата, "ДЛФ="), "") + 
					", ответственный " + СтруктураВ.Ответственный;
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				КонецЕсли;	 
			КонецЦикла;	 
			
			Если ЕстьВРеализации Тогда 
				Отказ = Истина;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьАртикулОЗ(ЗалоговыйБилет, ОбъектЗалога)
	Запрос = Новый Запрос;        
	Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.УстановитьПараметр("ОбъектЗалога", ОбъектЗалога);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
	               |			&Дата,
	               |			ЗалоговыйБилет = &ЗалоговыйБилет
	               |				И ОбъектЗалога = &ОбъектЗалога) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		Возврат Выборка.Артикул;
	КонецЕсли;	
	Возврат "<не определен>";
КонецФункции

// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	Движения.ЛБ_ОбъектыЗалога.Записывать = Истина;    
	Движения.ЛБ_ОбъектыЗалогаВПути.Записывать = Истина; 	
	Движения.ЛБ_ОборотыПоОперациямЗайма.Записывать = Истина;
    Движения.ЛБ_СостояниеОбъектаЗалога.Записывать = Истина; 
	Движения.ЛБ_СостояниеЗалоговогоБилета.Записывать = Истина;
	Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Записывать = Истина; 
	Движения.ЛБ_ОприходованныеОбъектыЗалога.Записывать = Истина;  
	
	ТаблицаЗБ = ЭтотОбъект.Товары.Выгрузить(); 
	ТаблицаЗБ.Свернуть("ЗалоговыйБилет");  
	ТаблицаЗБ.Очистить();
	
	Если ЭтотОбъект.Категория = Перечисления.ЛБ_КатегорииПоступленияОбъектовЗалога.Поштучно Тогда
		ТаблицаОстатков = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбарда(Дата-1, Организация, ЭтотОбъект.ЛомбардОткуда, ЭтотОбъект.СкладОтправитель);   
		
		Для каждого Стр Из ЭтотОбъект.Товары Цикл  
			Отбор = новый структура;
			Отбор.Вставить("ЗалоговыйБилет", Стр.ЗалоговыйБилет); 
			Отбор.Вставить("ОбъектЗалога", Стр.ОбъектЗалога);
			СтрокиОст = ТаблицаОстатков.НайтиСтроки(Отбор);
			Если СтрокиОст.Количество() = 0 Тогда 
				ОбщегоНазначения.СообщитьПользователю("Изделие с артикулом " + ПолучитьАртикулОЗ(Стр.ЗалоговыйБилет, Стр.ОбъектЗалога) + " не найдено на складе " + СокрЛП(ЭтотОбъект.СкладОтправитель));
			Иначе      
				СтрЗБ = ТаблицаЗБ.Добавить();  
				СтрЗБ.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
				
				СтрОст = СтрокиОст.Получить(0);
				Движение = Движения.ЛБ_ОбъектыЗалога.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Организация = Организация;
				Движение.Ломбард = ЛомбардОткуда; 
				Движение.Склад = ЭтотОбъект.СкладОтправитель;
				Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
				Движение.ОбъектЗалога = Стр.ОбъектЗалога;
				Движение.Количество = Стр.Количество;
				Движение.СуммаОценки = СтрОст.СуммаОценки; 
				//Савранин
				//Движение.СуммаОценкиНачальная = СтрОст.СуммаОценки;    
				
				Если ЭтотОбъект.ЗагруженИЗLX Тогда 
					Движение = Движения.ЛБ_ОбъектыЗалога.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Период = Дата;
					Движение.Организация = Организация;
					Движение.Ломбард = ЛомбардКуда;   
					Движение.Склад = ЭтотОбъект.СкладПолучатель;
					Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
					Движение.ОбъектЗалога = Стр.ОбъектЗалога;
					Движение.Количество = Стр.Количество;
					Движение.СуммаОценки = СтрОст.СуммаОценки;  
					//Савранин
					//Движение.СуммаОценкиНачальная = СтрОст.СуммаОценки;

					
				Иначе
				
					
				Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыПеремещенияОбъектовЗалога.ВнутриПодразделения Тогда   
					Движение = Движения.ЛБ_ОбъектыЗалога.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Период = Дата;
					Движение.Организация = Организация;
					Движение.Ломбард = ЛомбардКуда;   
					Движение.Склад = ЭтотОбъект.СкладПолучатель;
					Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
					Движение.ОбъектЗалога = Стр.ОбъектЗалога;
					Движение.Количество = Стр.Количество;
					Движение.СуммаОценки = СтрОст.СуммаОценки;  
					//Савранин
					//Движение.СуммаОценкиНачальная = СтрОст.СуммаОценки;

					
					Движение = Движения.ЛБ_ОприходованныеОбъектыЗалога.Добавить();
					Движение.Период = Дата;
		            Движение.Склад = СкладПолучатель;
					Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
					Движение.ОбъектЗалога = Стр.ОбъектЗалога;

					Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить();
					Движение.Период = Дата;
					Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
					Движение.ОбъектЗалога = Стр.ОбъектЗалога;
					Движение.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ПринятНаСклад;
					СтруктураСостояниеОЗ = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектовЗалогаЗалоговогоБилета(Дата-1, Стр.ЗалоговыйБилет, Стр.ОбъектЗалога);
					Если НЕ СтруктураСостояниеОЗ = неопределено Тогда  
						Движение.СуммаЗайма = СтруктураСостояниеОЗ.СуммаЗайма;
						Движение.СуммаОценки = СтруктураСостояниеОЗ.СуммаОценки;
						Движение.СуммаДолгаЗайма = СтруктураСостояниеОЗ.СуммаДолгаЗайма;
						Движение.СуммаОплаты = СтруктураСостояниеОЗ.СуммаОплаты;   
						Движение.СуммаОценкиНачальная = СтруктураСостояниеОЗ.СуммаОценкиНач;
					КонецЕсли;			   
					Движение.Комментарий = "Принят " + СокрЛП(ЭтотОбъект.ЛомбардКуда) + ", склад-получатель " + СокрЛП(ЭтотОбъект.СкладПолучатель) + " из: " +
					                  СокрЛП(ЭтотОбъект.ЛомбардОткуда) + ", склад отгрузки " + СокрЛП(ЭтотОбъект.СкладОтправитель);   
									  
				Иначе
					Движение = Движения.ЛБ_ОбъектыЗалогаВПути.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Период = Дата;
					Движение.Организация = Организация;
					Движение.Отправитель = ЛомбардОткуда; 
					Движение.СкладОтправитель = ЭтотОбъект.СкладОтправитель; 
					Движение.Получатель = ЛомбардКуда; 
					Движение.СкладПолучатель = ЭтотОбъект.СкладПолучатель;
					Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
					Движение.ОбъектЗалога = Стр.ОбъектЗалога;
					Движение.Количество = Стр.Количество;
					Движение.СуммаОценки = СтрОст.СуммаОценки; 
					Движение.Инкассатор = ЭтотОбъект.Инкассатор;
					Движение.НакладнаяНаОтгрузку = ЭтотОбъект.НакладнаяНаОтгрузку;
					
	                Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить();
					Движение.Период = Дата;
					Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
					Движение.ОбъектЗалога = Стр.ОбъектЗалога;  
			        СтатусЗБ = ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(Дата-1, Стр.ЗалоговыйБилет);
					Движение.СтатусОбъектаЗалога = ?(СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ГотовКОтправкеОХ, Перечисления.ЛБ_СтатусыОбъектовЗалога.ВПутиОХ, Перечисления.ЛБ_СтатусыОбъектовЗалога.ВПути);
					СтруктураСостояниеОЗ = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектовЗалогаЗалоговогоБилета(Дата-1, Стр.ЗалоговыйБилет, Стр.ОбъектЗалога);
					Если НЕ СтруктураСостояниеОЗ = неопределено Тогда  
						Движение.СуммаЗайма = СтруктураСостояниеОЗ.СуммаЗайма;
						Движение.СуммаОценки = СтруктураСостояниеОЗ.СуммаОценки;
						Движение.СуммаДолгаЗайма = СтруктураСостояниеОЗ.СуммаДолгаЗайма;
						Движение.СуммаОплаты = СтруктураСостояниеОЗ.СуммаОплаты;  
						Движение.СуммаОценкиНачальная = СтруктураСостояниеОЗ.СуммаОценкиНач;
					КонецЕсли;			
					Движение.Комментарий = "Отправитель: " + СокрЛП(ЭтотОбъект.ЛомбардОткуда) + ", склад отгрузки " + СокрЛП(ЭтотОбъект.СкладОтправитель) + ", Получатель " +
					                  СокрЛП(ЭтотОбъект.ЛомбардКуда) + ?(ВидОперации = Перечисления.ЛБ_ВидыПеремещенияОбъектовЗалога.СторонннемуКонтрагенту, "", ", склад-получатель " + СокрЛП(ЭтотОбъект.СкладПолучатель));
									  
				КонецЕсли; 
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;	     
	
	ИначеЕсли ЭтотОбъект.Категория = Перечисления.ЛБ_КатегорииПоступленияОбъектовЗалога.Сумка Тогда 
		Движения.ЛБ_ОбъектыЗалогаВСумке.Записывать = Истина;
		
		ТаблицаОстатковВСумке = ЛБ_УправлениеЛомбардом.ПолучитьТоварыВСумке(Дата-1, Организация, ЭтотОбъект.ЛомбардОткуда, ЭтотОбъект.СкладОтправитель, ЭтотОбъект.НакладнаяНаОтгрузку);     
		Для каждого Стр Из ЭтотОбъект.Товары Цикл  
			Отбор = новый структура;
			Отбор.Вставить("ЗалоговыйБилет", Стр.ЗалоговыйБилет); 
			Отбор.Вставить("ОбъектЗалога", Стр.ОбъектЗалога);
			СтрокиОст = ТаблицаОстатковВСумке.НайтиСтроки(Отбор);
			Если СтрокиОст.Количество() = 0 Тогда 
				ОбщегоНазначения.СообщитьПользователю("Изделие с артикулом " + ПолучитьАртикулОЗ(Стр.ЗалоговыйБилет, Стр.ОбъектЗалога) + " не найдено в сумке на складе " + СокрЛП(ЭтотОбъект.СкладОтправитель));
			Иначе 
				СтрЗБ = ТаблицаЗБ.Добавить();  
				СтрЗБ.ЗалоговыйБилет = Стр.ЗалоговыйБилет;

				СтрОст = СтрокиОст.Получить(0);
				Движение = Движения.ЛБ_ОбъектыЗалогаВСумке.ДобавитьРасход();
				Движение.Период = Дата;
				Движение.Организация = Организация;
				Движение.Отправитель = СтрОст.Отправитель; 
				Движение.СкладОтправитель = СтрОст.СкладОтправитель; 
				Движение.Получатель = СтрОст.Получатель; 
				Движение.СкладПолучатель = СтрОст.СкладПолучатель;
				Движение.ЗалоговыйБилет = СтрОст.ЗалоговыйБилет;
				Движение.ОбъектЗалога = СтрОст.ОбъектЗалога;
				Движение.Количество = СтрОст.Количество;
				Движение.СуммаОценки = СтрОст.СуммаОценки; 
				Движение.Инкассатор = СтрОст.Инкассатор;
                Движение.НакладнаяНаОтгрузку = СтрОст.НакладнаяНаОтгрузку; 
								
				Движение = Движения.ЛБ_ОбъектыЗалогаВПути.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Организация = Организация;
				Движение.Отправитель = ЛомбардОткуда; 
				Движение.СкладОтправитель = ЭтотОбъект.СкладОтправитель; 
				Движение.Получатель = ЛомбардКуда; 
				Движение.СкладПолучатель = ЭтотОбъект.СкладПолучатель;
				Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
				Движение.ОбъектЗалога = Стр.ОбъектЗалога;
				Движение.Количество = Стр.Количество;
				Движение.СуммаОценки = СтрОст.СуммаОценки; 
				Движение.Инкассатор = ЭтотОбъект.Инкассатор;
				Движение.НакладнаяНаОтгрузку = ЭтотОбъект.НакладнаяНаОтгрузку;
				
                Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить();
				Движение.Период = Дата;
				Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
				Движение.ОбъектЗалога = Стр.ОбъектЗалога;
				Движение.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ВПути;
				СтруктураСостояниеОЗ = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектовЗалогаЗалоговогоБилета(Дата-1, Стр.ЗалоговыйБилет, Стр.ОбъектЗалога);
				Если НЕ СтруктураСостояниеОЗ = неопределено Тогда  
					Движение.СуммаЗайма = СтруктураСостояниеОЗ.СуммаЗайма;
					Движение.СуммаОценки = СтруктураСостояниеОЗ.СуммаОценки;
					Движение.СуммаДолгаЗайма = СтруктураСостояниеОЗ.СуммаДолгаЗайма;
					Движение.СуммаОплаты = СтруктураСостояниеОЗ.СуммаОплаты;  
					Движение.СуммаОценкиНачальная = СтруктураСостояниеОЗ.СуммаОценкиНач;
				КонецЕсли;			
				Движение.Комментарий = "Отправитель: " + СокрЛП(ЭтотОбъект.ЛомбардОткуда) + ", склад отгрузки " + СокрЛП(ЭтотОбъект.СкладОтправитель) + ", Получатель " +
				                  СокрЛП(ЭтотОбъект.ЛомбардКуда) + ?(ВидОперации = Перечисления.ЛБ_ВидыПеремещенияОбъектовЗалога.СторонннемуКонтрагенту, "", ", склад-получатель " + СокрЛП(ЭтотОбъект.СкладПолучатель));	
								  
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;	
	
	//ТаблицаЗБ = ЭтотОбъект.Товары.Выгрузить(); 
	ТаблицаЗБ.Свернуть("ЗалоговыйБилет");  
	
	Для каждого Стр Из ТаблицаЗБ Цикл
	    Движение = Движения.ЛБ_ОборотыПоОперациямЗайма.Добавить();
		Движение.Период = Дата; 
		Движение.Залогодатель = Стр.ЗалоговыйБилет.Залогодатель;
		Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет; 
		Движение.Организация = ЭтотОбъект.Организация;  
		Движение.Ломбард = ЭтотОбъект.ЛомбардОткуда;
		Если ЭтотОбъект.Категория = Перечисления.ЛБ_КатегорииПоступленияОбъектовЗалога.Сумка Тогда	
		    Движение.ВидОперации = "Перемещение объектов залога (сумка)"; 
		Иначе 
			Движение.ВидОперации = "Перемещение объектов залога";
			
			Если НЕ ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыПеремещенияОбъектовЗалога.ВнутриПодразделения Тогда
				СтатусЗБ = ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(Дата-1, Стр.ЗалоговыйБилет);
				Если СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ГотовКОтправкеОХ Тогда
					СостояниеЗБ = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗалоговогоБилета(ЭтотОбъект, Стр.ЗалоговыйБилет);				  
					Движение = Движения.ЛБ_СостояниеЗалоговогоБилета.Добавить();
				    Движение.Период = Дата;
			        Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет; 
					Движение.Залогодатель = Стр.ЗалоговыйБилет.Залогодатель;
					Движение.НомерЗалоговогоБилета = Стр.ЗалоговыйБилет.НомерЗалоговогоБилета; 
					Движение.СхемаКредитования = Стр.ЗалоговыйБилет.СхемаКредитования;
		            Движение.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ВПутиОХ; 
					Если НЕ СостояниеЗБ = неопределено Тогда
						Движение.СуммаЗайма = СостояниеЗБ.СуммаЗайма; 
						Движение.ДатаНачалаРасчетаПроцентов = СостояниеЗБ.ДатаНачалаРасчета;
						Движение.ДатаВыкупа = СостояниеЗБ.ДатаВыкупа;
						Движение.ДатаВыкупаЛьготныйСрок = СостояниеЗБ.ДатаВыкупаЛьготныйСрок;
						Движение.ПричинаПрименения = СостояниеЗБ.ПричинаПрименения;
						Движение.НомерДопСоглашения = СостояниеЗБ.НомерДопСоглашения; 
					КонецЕсли;	
				КонецЕсли;	 
			КонецЕсли;	
		КонецЕсли;	
    КонецЦикла;
	
	Движение = Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Добавить();
	Движение.Период = Дата;
	Движение.Организация = Организация;  
	Движение.ПодразделениеОсновное = ЭтотОбъект.ЛомбардОткуда;
	Движение.СкладОсновной = ЭтотОбъект.СкладОтправитель;
	Движение.ПодразделениеОтправитель = ЭтотОбъект.ЛомбардОткуда;
	Движение.СкладОтправитель = ЭтотОбъект.СкладОтправитель;   
	Движение.ПодразделениеПолучатель = ЭтотОбъект.ЛомбардКуда;
	Движение.СкладПолучатель = ЭтотОбъект.СкладПолучатель;
	Движение.Количество = Товары.Итог("Количество");
	Движение.Ответственный = ЭтотОбъект.Ответственный; 
	Движение.Инкассатор = ЭтотОбъект.Инкассатор; 
	Движение.НакладнаяНаОтгрузку = ЭтотОбъект.НакладнаяНаОтгрузку;
	Движение.ВидОперации = "Перемещение" + ?(ЭтотОбъект.Категория = Перечисления.ЛБ_КатегорииПоступленияОбъектовЗалога.Сумка, " (сумка)", "");

КонецПроцедуры    

// Процедура - обработчик события "ОбработкаУдаленияПроведения".
//
Процедура ОбработкаУдаленияПроведения(Отказ)
				
	ЗапросП = Новый Запрос;
	ЗапросП.УстановитьПараметр("Дата", ЭтотОбъект.Дата); 
	ЗапросП.УстановитьПараметр("ОбъектыЗалога", ЭтотОбъект.Товары.ВыгрузитьКолонку("ОбъектЗалога"));
	ЗапросП.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                |	ЛБ_ОбъектыЗалога.Регистратор КАК Регистратор
	                |ИЗ
	                |	РегистрНакопления.ЛБ_ОбъектыЗалога КАК ЛБ_ОбъектыЗалога
	                |ГДЕ
	                |	ЛБ_ОбъектыЗалога.ОбъектЗалога В(&ОбъектыЗалога)
	                |	И ЛБ_ОбъектыЗалога.Период > &Дата
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                |	ЛБ_ОбъектыЗалогаВПути.Регистратор
	                |ИЗ
	                |	РегистрНакопления.ЛБ_ОбъектыЗалогаВПути КАК ЛБ_ОбъектыЗалогаВПути
	                |ГДЕ
	                |	ЛБ_ОбъектыЗалогаВПути.Период > &Дата
	                |	И ЛБ_ОбъектыЗалогаВПути.ОбъектЗалога В(&ОбъектыЗалога)";
	ВыборкаП = ЗапросП.Выполнить().Выбрать();
	Если ВыборкаП.Следующий() тогда 
		Сообщить("Есть более поздние операции по движению объектов залога из документа. Снятие документа с проведения запрещено.");  
		Отказ = Истина;
		Возврат;
	КонецЕсли;                                        
		
КонецПроцедуры // ОбработкаУдаленияПроведения()

