&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Дата = ТекущаяДата();
	Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить();
	ПолучитьЗначенияНаДату();
КонецПроцедуры

&НаСервере
Процедура ПолучитьЗначенияНаДату()
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПредельныеЗначенияПроцентовСрезПоследних.ПредельнаяВеличинаПроцентов КАК ПредельнаяВеличинаПроцентов,
	               |	ЛБ_ПредельныеЗначенияПроцентовСрезПоследних.ПредельнаяСтавкаКредитованияГод КАК ПредельнаяСтавкаКредитованияГод
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПредельныеЗначенияПроцентов.СрезПоследних(&Дата, Организация = &Организация) КАК ЛБ_ПредельныеЗначенияПроцентовСрезПоследних";
	
    Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		ПредельнаяВеличинаПроцентовНовая = Выборка.ПредельнаяВеличинаПроцентов;
		ПредельнаяСтавкаКредитованияГодНовая = Выборка.ПредельнаяСтавкаКредитованияГод;		
	Иначе                
		ПредельнаяВеличинаПроцентовНовая = 0;
		ПредельнаяСтавкаКредитованияГодНовая = 0;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьНаСервере()
	МенеджерЗаписи = РегистрыСведений.ЛБ_ПредельныеЗначенияПроцентов.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Организация = Организация;
	МенеджерЗаписи.Период = Дата;
	МенеджерЗаписи.ПредельнаяВеличинаПроцентов = ПредельнаяВеличинаПроцентовНовая;
    МенеджерЗаписи.ПредельнаяСтавкаКредитованияГод = ПредельнаяСтавкаКредитованияГодНовая;
	
    МенеджерЗаписи.Записать();  
КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда)
	Если Дата = Дата(1,1,1) Тогда
	    Сообщить("Не выбрана дата установки новых значений.");
		Возврат;
	ИначеЕсли ПредельнаяВеличинаПроцентовНовая = 0 И ПредельнаяСтавкаКредитованияГодНовая = 0 Тогда 
		Сообщить("Не выбраны значения для установки");
		Возврат;
	КонецЕсли;	 
	
	УстановитьНаСервере();
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ПолучитьЗначенияНаДату();
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры


