&НаСервере
Процедура УстановитьСтатусДокумента()  
	Если Объект.Архив Тогда 
		ЭтаФорма.СтатусДокумента = "АРХИВ"; 
		Элементы.СтатусДокумента.ЦветТекста = WebЦвета.Черный;
	Иначе 
		Если Объект.Проведен Тогда
			ЭтаФорма.СтатусДокумента = "ФАКТ"; 
			Элементы.СтатусДокумента.ЦветТекста = WebЦвета.Зеленый;
		Иначе
			ЭтаФорма.СтатусДокумента = "ПРОЕКТ"; 
			Элементы.СтатусДокумента.ЦветТекста = WebЦвета.Черный;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ДанныеОВремениВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Объект.Проведен Тогда
		Возврат;
	КонецЕсли;
	Если СтрНайти(Поле.Имя, "ВремяПредставление") > 0 Тогда
		СтандартнаяОбработка = Ложь;
		НомерДня = СтрЗаменить(Поле.Имя, "ВремяПредставление", "");
		
		ТекСтрока = Элементы.ДанныеОВремени.ТекущиеДанные;  
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Сотрудник", 	ТекСтрока.Сотрудник);
		ПараметрыФормы.Вставить("Часов", 		ТекСтрока["Часов"+НомерДня]); 
		ПараметрыФормы.Вставить("ВидВремени", 	ТекСтрока["ВидВремени"+НомерДня]); 
		ПараметрыФормы.Вставить("Территория", 	ТекСтрока["Территория"+НомерДня]);
		ПараметрыФормы.Вставить("НомерДня", 	НомерДня);
		ПараметрыФормы.Вставить("ПолучитьЧасыИзГрафика", 	Истина);
		ПараметрыФормы.Вставить("ДатаРаботы",   Объект.ПериодРегистрации + НомерДня*86400);
		ПараметрыФормы.Вставить("Ломбард",      ТекСтрока.Ломбард);
		
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеОкончанииРедактированияДанныхОВремени", ЭтотОбъект);
		ОткрытьФорму("ОбщаяФорма.ЛБ_РедактированиеДанныхУчетаВремениЗаДень", Параметрыформы, ЭтаФорма,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	КонецЕсли;
КонецПроцедуры

Функция ВернутьЧасыИзГрафика(Параметры)
	ВидВремени 		= Параметры.ВидВремени; 
	Часов 			= Параметры.Часов;
	НомерДня 		= Параметры.НомерДня;  
	Территория 		= Параметры.Территория; 
	Сотрудник 		= Параметры.Сотрудник; 
	ДатаРаботы     	= Параметры.ДатаРаботы;
	Ломбард     	= Параметры.Ломбард;  
	Текст           = Параметры.Текст; 
	
	ЧасыВведеныВручную = Ложь;
	
	Если нрег(Текст) = "х" тогда
		ВидВремени = "";
		Часов = 0;
		
		Рез = Новый Структура;
		Рез.Вставить("Часов",      Часов); 
		Рез.Вставить("НомерДня",   НомерДня); 
		Рез.Вставить("ВидВремени", ВидВремени); 
		Рез.Вставить("Территория", "");
		
		Возврат Рез;
		
	ИначеЕсли Текст = " " Тогда
		ВидВремени = Справочники.ЛБ_ВидыИспользованияРабочегоВремени.Явка;
		Территория = "";

		ЧасыВведеныВручную = Ложь;

	ИначеЕсли нрег(Текст) = "в" тогда 
		ВидВремени = Справочники.ЛБ_ВидыИспользованияРабочегоВремени.ВыходныеДни;  
		Территория = "";

		ЧасыВведеныВручную = Истина;

	ИначеЕсли нрег(Текст) = "б" тогда 
		ВидВремени = Справочники.ЛБ_ВидыИспользованияРабочегоВремени.Болезнь; 
		Территория = "";

		ЧасыВведеныВручную = Истина;

	ИначеЕсли нрег(Текст) = "о" тогда 
		ВидВремени = Справочники.ЛБ_ВидыИспользованияРабочегоВремени.ОсновнойОтпуск;  
		Территория = "";
		
		ЧасыВведеныВручную = Истина;

	ИначеЕсли нрег(Текст) = "у" тогда 
		ВидВремени = Справочники.ЛБ_ВидыИспользованияРабочегоВремени.Увольнение;
		Территория = "";

		ЧасыВведеныВручную = Истина;

	Иначе
		Если Текст = "" Тогда
			
		Иначе
			Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Текст) Тогда
				Часов = Число(Текст);
				ЧасыВведеныВручную = Истина;  
				Территория = "";

			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	
	
	Если НЕ ЗначениеЗаполнено(ВидВремени) Тогда
		ВидВремени = Справочники.ЛБ_ВидыИспользованияРабочегоВремени.Явка;
	КонецЕсли;
	
	Если НЕ ЧасыВведеныВручную и Параметры.ПолучитьЧасыИзГрафика Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЛБ_РабочиеДниЛомбарда.РабочиеМинуты КАК РабочиеМинуты,
		|	ЛБ_РабочиеДниЛомбарда.Выходной КАК Выходной
		|ИЗ
		|	РегистрСведений.ЛБ_РабочиеДниЛомбарда КАК ЛБ_РабочиеДниЛомбарда
		|ГДЕ
		|	ЛБ_РабочиеДниЛомбарда.Ломбард = &Ломбард
		|	И ЛБ_РабочиеДниЛомбарда.Период = &ДатаРаботы";
		Запрос.УстановитьПараметр("Ломбард", Ломбард);
		Запрос.УстановитьПараметр("ДатаРаботы", ДатаРаботы);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Часов = Выборка.РабочиеМинуты/60; 
			Если Выборка.Выходной Тогда
				Если ВидВремени <> Справочники.ЛБ_ВидыИспользованияРабочегоВремени.Увольнение Тогда
					ВидВремени = Справочники.ЛБ_ВидыИспользованияРабочегоВремени.ВыходныеДни;				
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидВремени) Тогда		
		Если ВидВремени.Целосменное Тогда
			Часов = 0;
		КонецЕсли;
	КонецЕсли;  
	
	ПД = СтруктураПраздничныхДней(ДатаРаботы);  
	
	Если ПД <> Неопределено Тогда
		
		Если ПД.ЧасовСокращено > 0 тогда
			Часов = Часов - ПД.ЧасовСокращено;
		ИначеЕсли ЗначениеЗаполнено(ПД.ВремяНачала) Тогда 
			Часов = (ПД.ВремяОкончания - ПД.ВремяНачала)/3600; 
		КонецЕсли;
	КонецЕсли;
 
	
	
	Рез = Новый Структура;
	Рез.Вставить("Часов", Часов); 
	Рез.Вставить("НомерДня", НомерДня); 
	Рез.Вставить("ВидВремени", ВидВремени); 
	Рез.Вставить("Территория", Территория);
	
	Возврат Рез
КонецФункции

&НаКлиенте
Процедура МесяцРегистрацииСтрокойПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтаФорма, "Объект.ПериодРегистрации", "МесяцРегистрацииСтрокой", Модифицированность);
	
	ПериодРегистрацииПриИзменении(); 
	
	ПроверитьДействующиеПриказы();
	
КонецПроцедуры

&НаСервере
Процедура ПериодРегистрацииПриИзменении()
	Для инд = 29 по 31 Цикл
		Элементы["ВремяПредставление"+СокрЛП(инд)].Видимость = Истина;
	КонецЦикла;
	
	КоличествоДнейвМесяце = День(КонецМесяца(Объект.ПериодРегистрации));
	Если КоличествоДнейвМесяце = 30 Тогда
		Элементы.ВремяПредставление31.Видимость = Ложь;
	ИначеЕсли КоличествоДнейвМесяце = 29 Тогда
		Элементы.ВремяПредставление31.Видимость = Ложь;
		Элементы.ВремяПредставление30.Видимость = Ложь; 
	ИначеЕсли КоличествоДнейвМесяце = 28 Тогда
		Элементы.ВремяПредставление31.Видимость = Ложь;
		Элементы.ВремяПредставление30.Видимость = Ложь; 
		Элементы.ВремяПредставление29.Видимость = Ложь; 
	КонецЕсли;  
	
	Объект.ДатаНачалаПериода = НачалоМесяца(Объект.ПериодРегистрации);
	Объект.ДатаОкончанияПериода =  КонецМесяца(Объект.ПериодРегистрации);  
КонецПроцедуры


&НаКлиенте
Процедура МесяцРегистрацииСтрокойНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Оповещение = Новый ОписаниеОповещения("ПериодРегистрацииНачалоВыбораЗавершение", ЭтотОбъект);
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтаФорма, ЭтаФорма, "Объект.ПериодРегистрации", "МесяцРегистрацииСтрокой", , Оповещение);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииНачалоВыбораЗавершение(ЗначениеВыбрано, ДополнительныеПараметры) Экспорт
	
	ПериодРегистрацииПриИзменении();
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеОкончанииРедактированияДанныхОВремени(Результат, ДопПараметр) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	НомерДня = Результат.НомерДня;
	ТекСтрока = Элементы.ДанныеОВремени.ТекущиеДанные; 
	Если Результат.Часов > 12 Тогда
		Результат.Часов = 12;
	КонецЕсли;    
	
	
	ТекСтрока["Часов"+НомерДня] 				= Результат.Часов; 
	ТекСтрока["ВидВремени"+НомерДня] 			= Результат.ВидВремени;
	ТекСтрока["Территория"+НомерДня] 			= Результат.Территория;
	ТекСтрока["ВремяПредставление"+НомерДня] 	= СформируйПредставлениеВремени(Результат.ВидВремени, Результат.Часов, "");
	
	Отб = Новый Структура("Сотрудник", ТекСтрока.Сотрудник);
	
	Если Результат.Часов > 0 Тогда
		НайдСтроки = Объект.ДанныеОВремени.НайтиСтроки(Отб);
		Для каждого НСтрока из НайдСтроки Цикл
			Если НСтрока.НомерСтроки <> ТекСтрока.НомерСтроки Тогда 
				
				Если Результат.Часов > 0 Тогда
					НСтрока["Часов"+НомерДня] = 0;
					НСтрока["ВидВремени"+НомерДня] = "";
					НСтрока["Территория"+НомерДня] = ТекСтрока.Ломбард;
				КонецЕсли;
				//Если НСтрока["Часов"+НомерДня] > 0 Тогда 
				//	НСтрока["Часов"+НомерДня] = 0;
				//	НСтрока["Территория"+НомерДня] = ТекСтрока.Ломбард; 
				НСтрока["ВремяПредставление"+НомерДня] = СформируйПредставлениеВремени(Результат.ВидВремени, Результат.Часов, ТекСтрока.Ломбард);
				//КонецЕсли;				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Результат.ПересчитыватьИтог Тогда
		ПересчетИтоговЧасов();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция СформируйПредставлениеВремени(ВидВремени, Часов, Территория)
	Возврат СформироватьПредставлениеВремени(ВидВремени, Часов, Территория);
КонецФункции 

&НаСервереБезКонтекста
Функция СформироватьПредставлениеВремени(ВидВремени, Часов, Территория) Экспорт
	Рез = "";
	Если ЗначениеЗаполнено(ВидВремени) Тогда
		Если ВидВремени = Справочники.ЛБ_ВидыИспользованияРабочегоВремени.Явка Тогда
			Если Часов > 0 Тогда
				Рез = СокрЛП(Часов);
			КонецЕсли;
		Иначе
			Рез = СокрЛП(ВидВремени.БуквенныйКод);
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Территория) Тогда
			Рез = Рез +" "+"л"+СокрЛП(Территория.НомерЛомбарда);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Рез;	
КонецФункции

Функция СтруктураПраздничныхДней(Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПраздничныеСокращенныеДни.Дата КАК Дата,
	               |	ЛБ_ПраздничныеСокращенныеДни.Выходной КАК Выходной,
	               |	ЛБ_ПраздничныеСокращенныеДни.ВремяНачала КАК ВремяНачала,
	               |	ЛБ_ПраздничныеСокращенныеДни.ВремяОкончания КАК ВремяОкончания,
	               |	ЛБ_ПраздничныеСокращенныеДни.ЧасовСокращено КАК ЧасовСокращено,
	               |	ЛБ_ПраздничныеСокращенныеДни.РабочийДень КАК РабочийДень
	               |ИЗ
	               |	Справочник.ЛБ_ПраздничныеСокращенныеДни КАК ЛБ_ПраздничныеСокращенныеДни
	               |ГДЕ
	               |	ЛБ_ПраздничныеСокращенныеДни.ПометкаУдаления = Ложь
	               |	И ЛБ_ПраздничныеСокращенныеДни.Дата >= &ДатаНач
	               |	И ЛБ_ПраздничныеСокращенныеДни.Дата <= &ДатаКон";
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Дата));
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(Дата)); 
	
	Рез = Неопределено;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Рез = Новый Структура;
		Рез.Вставить("Дата", 			Выборка.Дата);
		Рез.Вставить("Выходной", 		Выборка.Выходной);
		Рез.Вставить("ВремяНачала", 	Выборка.ВремяНачала);
		Рез.Вставить("ВремяОкончания", 	Выборка.ВремяОкончания);
		Рез.Вставить("ЧасовСокращено", 	Выборка.ЧасовСокращено); 
		Рез.Вставить("РабочийДень", 	Выборка.РабочийДень);
	КонецЕсли; 
	
	Возврат Рез;	
	
КонецФункции


&НаСервере
Процедура ЗаполнитьИзГрафикаНаСервере() 
	Объект.ДанныеОВремени.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ссылка
	|ИЗ
	|	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(
	|			&НаДату,
	|			Отделение = &Отделение
	|				И Ломбард.Закрыт = ЛОЖЬ) КАК ЛБ_ОтделенияЛомбардовСрезПоследних"; 
	Запрос.УстановитьПараметр("НаДату", Объект.Дата);
	Запрос.УстановитьПараметр("Отделение", Объект.Отделение);
	
	тз = Запрос.Выполнить().Выгрузить(); 
	массивЛомб = тз.ВыгрузитьКолонку("Ссылка");    
	
	ЗапросВых = Новый Запрос;
	ЗапросВых.Текст = "ВЫБРАТЬ
	|	ЛБ_РабочиеДниЛомбарда.Ломбард КАК Ломбард,
	|	ЛБ_РабочиеДниЛомбарда.Выходной КАК Выходной,
	|	ЛБ_РабочиеДниЛомбарда.ДеньНедели КАК ДеньНедели,
	|	ЛБ_РабочиеДниЛомбарда.НомерДня КАК НомерДня,
	|	ЛБ_РабочиеДниЛомбарда.Период КАК Период
	|ИЗ
	|	РегистрСведений.ЛБ_РабочиеДниЛомбарда КАК ЛБ_РабочиеДниЛомбарда
	|ГДЕ
	|	ЛБ_РабочиеДниЛомбарда.Период МЕЖДУ &НачДата И &КонДата
	|	И ЛБ_РабочиеДниЛомбарда.Ломбард В(&Подразделение)
	|	И ЛБ_РабочиеДниЛомбарда.Выходной = ИСТИНА";	
	ЗапросВых.УстановитьПараметр("Подразделение", массивЛомб);
	ЗапросВых.УстановитьПараметр("НачДата", Объект.ДатаНачалаПериода);
	ЗапросВых.УстановитьПараметр("КонДата", КонецДня(Объект.ДатаОкончанияПериода));
	тзВых = ЗапросВых.Выполнить().Выгрузить();  
	
	ЗапросРабочиеДни = Новый Запрос;
	ЗапросРабочиеДни.Текст = "ВЫБРАТЬ
	|	ЛБ_РабочиеДниЛомбарда.Ломбард КАК Ломбард,
	|	СУММА(ЛБ_РабочиеДниЛомбарда.РабочиеМинуты) КАК РабочиеМинуты
	|ИЗ
	|	РегистрСведений.ЛБ_РабочиеДниЛомбарда КАК ЛБ_РабочиеДниЛомбарда
	|ГДЕ
	|	ЛБ_РабочиеДниЛомбарда.Период МЕЖДУ &НачДата И &КонДата
	|	И ЛБ_РабочиеДниЛомбарда.Ломбард В(&Подразделение)
	|	И ЛБ_РабочиеДниЛомбарда.Выходной = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЛБ_РабочиеДниЛомбарда.Ломбард";	
	ЗапросРабочиеДни.УстановитьПараметр("Подразделение", массивЛомб);
	ЗапросРабочиеДни.УстановитьПараметр("НачДата", Объект.ДатаНачалаПериода);
	ЗапросРабочиеДни.УстановитьПараметр("КонДата", КонецДня(Объект.ДатаОкончанияПериода));
	тзРабочиеДни = ЗапросРабочиеДни.Выполнить().Выгрузить(); 
	
	
	
	
	Запрос2 = Новый Запрос;
	
	Запрос2.Текст = "ВЫБРАТЬ
	|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Подразделение КАК Ломбард,
	|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия КАК ВидСобытия
	|ИЗ
	|	РегистрСведений.ЛБ_КадроваяИсторияСотрудников.СрезПоследних(&НаДату, ) КАК ЛБ_КадроваяИсторияСотрудниковСрезПоследних
	|ГДЕ
	|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Подразделение В(&Подразделение)
	|	И ЛБ_КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия <> &ВидСобытия
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Подразделение.НомерЧисловой";
	Запрос2.УстановитьПараметр("НаДату", Объект.Дата);
	Запрос2.УстановитьПараметр("Подразделение", массивЛомб); 
	Запрос2.УстановитьПараметр("ВидСобытия", Перечисления.ЛБ_ВидыКадровыхСобытий.Увольнение);
	
	
	КоличествоДнейвМесяце = День(КонецМесяца(Объект.ПериодРегистрации)); 
	
	ВидВремени_Выходной = Справочники.ЛБ_ВидыИспользованияРабочегоВремени.ВыходныеДни;  
	ВидВремени_Увольнение = Справочники.ЛБ_ВидыИспользованияРабочегоВремени.Увольнение;

	
	Выборка = Запрос2.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		//Если Выборка.ВидСобытия = Перечисления.ЛБ_ВидыКадровыхСобытий.Увольнение Тогда
		//	Продолжить;
		//КонецЕсли; 
		
		Если ЛБ_ОбщегоНазначения.СотрудникЯвляетсяНачальникомОтделения(Выборка.Сотрудник, Объект.ДатаНачалаПериода) Тогда
			продолжить;
		КонецЕсли;
		
		ДатаУвольнения = ВернутьДатуУвольненияСотрудника(Выборка.Сотрудник, Объект.ДатаНачалаПериода, КонецДня(Объект.ДатаОкончанияПериода));

		
		НовСтроч = Объект.ДанныеОВремени.Добавить();
		НовСтроч.Сотрудник = Выборка.Сотрудник;
		НовСтроч.Ломбард   = Выборка.Ломбард; 
		строкаРабМинуты = тзРабочиеДни.Найти(Выборка.Ломбард, "Ломбард"); 
		Если строкаРабМинуты <> Неопределено Тогда
			НовСтроч.НормаПоПриказу = строкаРабМинуты.РабочиеМинуты/60;
		КонецЕсли;   
		
		
		
		Для номерДня = 1 по КоличествоДнейвМесяце Цикл
			промДата = Объект.ПериодРегистрации + (номерДня-1)*86400; 
			отбВых = Новый Структура;
			отбВых.Вставить("Ломбард", Выборка.Ломбард);
			отбВых.Вставить("Период", промДата);
			
			найдСтрВых = тзВых.НайтиСтроки(ОтбВых);
			Если найдСтрВых.Количество() > 0 Тогда  
				НовСтроч["ВидВремени"+СокрЛП(номерДня)] = ВидВремени_Выходной;
				НовСтроч["ВремяПредставление"+СокрЛП(номерДня)] = СформироватьПредставлениеВремени(ВидВремени_Выходной, 0, "");
			КонецЕсли;
			
			ПД = СтруктураПраздничныхДней(промДата);
			Если ПД <> Неопределено Тогда
				Если ПД.Выходной = 2 Тогда 
					НовСтроч["ВидВремени"+СокрЛП(номерДня)] = ВидВремени_Выходной;
					НовСтроч["ВремяПредставление"+СокрЛП(номерДня)] = СформироватьПредставлениеВремени(ВидВремени_Выходной, 0, ""); 
				ИначеЕсли ПД.Выходной = 1 и ПД.ЧасовСокращено > 0 тогда
					НовСтроч.НормаПоПриказу = НовСтроч.НормаПоПриказу - ПД.ЧасовСокращено;  			
				КонецЕсли;
			КонецЕсли;
			
			тзНеявка = НеявкаСотрудника(Выборка.Сотрудник, промДата); 
			Если тзНеявка.Количество() > 0 Тогда 			
				Для каждого стр из тзНеявка Цикл
					НовСтроч["ВидВремени"+СокрЛП(номерДня)] = стр.ВидВремени; 
					НовСтроч["ВремяПредставление"+СокрЛП(номерДня)] = СформироватьПредставлениеВремени(стр.ВидВремени, 0, "");
				КонецЦикла;	
			КонецЕсли; 
			
			Если ДатаУвольнения <> Неопределено Тогда
				Если промДата >= ДатаУвольнения Тогда 
					НовСтроч["ВидВремени"+СокрЛП(номерДня)] = ВидВремени_Увольнение;
					НовСтроч["ВремяПредставление"+СокрЛП(номерДня)] = СформироватьПредставлениеВремени(ВидВремени_Увольнение, 0, "");
				КонецЕсли;				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры


Функция НеявкаСотрудника(Сотр, Дата)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_СостоянияСотрудников.Сотрудник КАК Сотрудник,
	|	ЛБ_СостоянияСотрудников.Период КАК НачалоНеявки,
	|	ЛБ_СостоянияСотрудников.ДействуетДо КАК КонецНеявки,
	|	ЛБ_СостоянияСотрудников.ВидВремени КАК ВидВремени
	|ИЗ
	|	РегистрСведений.ЛБ_СостоянияСотрудников КАК ЛБ_СостоянияСотрудников
	|ГДЕ
	|	ЛБ_СостоянияСотрудников.Сотрудник = &Сотрудник
	|	И ЛБ_СостоянияСотрудников.Период <= &НачалоНеявки
	|	И ЛБ_СостоянияСотрудников.ДействуетДо >= &КонецНеявки";  
	
	Запрос.УстановитьПараметр("Сотрудник", Сотр); 
	Запрос.УстановитьПараметр("НачалоНеявки", НачалоДня(Дата)); 
	Запрос.УстановитьПараметр("КонецНеявки", КонецДня(Дата));
	
	тз = Запрос.Выполнить().Выгрузить();
	
	Возврат тз;		
КонецФункции

&НаКлиенте
Процедура ЗаполнитьИзГрафика(Команда)
	Если Объект.ДанныеОВремени.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru = 'Перед заполнением табличная часть будет очищена. Заполнить?'");
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьИзГрафикаЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, Заголовок);
	Иначе
		ЗаполнитьИзГрафикаНаСервере(); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзГрафикаЗавершение(Результат, ДополнительныеПараметры) Экспорт	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьИзГрафикаНаСервере();
	КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтаФорма, "Объект.ПериодРегистрации", "МесяцРегистрацииСтрокой");
	
	СтрокаСвертки = "";
	первый = Истина;
	Для инд = 1 по 31 Цикл
		Если Первый Тогда
			Первый = Ложь;
			СтрокаСвертки = СтрокаСвертки + "Часов"+СокрЛП(Инд);
		Иначе 
			СтрокаСвертки = СтрокаСвертки + ",Часов"+СокрЛП(Инд);
		КонецЕсли; 
	КонецЦикла;
	
	ПериодРегистрацииПриИзменении();
	
	Элементы.ДанныеОВремени.ФиксацияСлева = 4; 
КонецПроцедуры

&НаКлиенте
Процедура МесяцРегистрацииСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтаФорма, "Объект.ПериодРегистрации", "МесяцРегистрацииСтрокой", Направление, Модифицированность);
	
	ПериодРегистрацииПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура МесяцРегистрацииСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
	ПериодРегистрацииПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура МесяцРегистрацииСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
	ПериодРегистрацииПриИзменении();
	
КонецПроцедуры


&НаСервере
Процедура ПересчетИтоговЧасов() 
	тз = Объект.ДанныеОВремени.Выгрузить();
	
	тз.Свернуть("Сотрудник", СокрЛП(СтрокаСвертки));
	тз.Колонки.Добавить("Итого");
	Для каждого стр из тз Цикл 
		Итого = 0;
		Для инд = 1 по 31 Цикл 		
			Итого = Итого + Стр["Часов"+инд]; 
		КонецЦикла; 
		стр.Итого = Итого;
		
		отб = Новый Структура("Сотрудник", стр.Сотрудник); 
		
		НайденСтроки = Объект.ДанныеОВремени.НайтиСтроки(Отб);
		Для каждого СтрДокумента из НайденСтроки Цикл
			СтрДокумента.ИтогоЧасов = Итого;
		КонецЦикла;			
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеОВремениЛомбардНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;   
	Элемент.РежимВыбораИзСписка = Истина;
	
	Элемент.СписокВыбора.Очистить();
	
	массивЛомбардов = СформироватьМассивЛомбардов();    
	
	Элемент.СписокВыбора.ЗагрузитьЗначения(массивЛомбардов);
КонецПроцедуры  

Функция СформироватьМассивЛомбардов()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард
	|ИЗ
	|	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&НаДату, Отделение = &Отделение) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
	|ГДЕ
	|	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.Закрыт = Ложь";
	Запрос.УстановитьПараметр("НаДату", Объект.Дата); 
	Запрос.УстановитьПараметр("Отделение", Объект.Отделение);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ломбард");
	
КонецФункции

Функция СформироватьМассивОтделений() 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
	|ИЗ
	|	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(
	|			,
	|			Ломбард = &Ломбард
	|				И Ломбард.Закрыт = ЛОЖЬ) КАК ЛБ_ОтделенияЛомбардовСрезПоследних"; 
	Запрос.УстановитьПараметр("Ломбард", ПараметрыСеанса.ТекущийЛомбард);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Отделение");
	
КонецФункции

Функция СформироватьМассивСотрудниковОтделения() 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ссылка
	|ИЗ
	|	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(
	|			&НаДату,
	|			Отделение = &Отделение
	|				И Ломбард.Закрыт = ЛОЖЬ) КАК ЛБ_ОтделенияЛомбардовСрезПоследних"; 
	Запрос.УстановитьПараметр("НаДату", Объект.Дата);
	Запрос.УстановитьПараметр("Отделение", Объект.Отделение);
	
	тз = Запрос.Выполнить().Выгрузить(); 
	массивЛомб = тз.ВыгрузитьКолонку("Ссылка");	
	
	
	Запрос2 = Новый Запрос; 
	Запрос2.Текст = "ВЫБРАТЬ
	|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Подразделение КАК Ломбард,
	|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия КАК ВидСобытия
	|ИЗ
	|	РегистрСведений.ЛБ_КадроваяИсторияСотрудников.СрезПоследних(&НаДату, ) КАК ЛБ_КадроваяИсторияСотрудниковСрезПоследних
	|ГДЕ
	|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Подразделение В(&Подразделение)
	|	И ЛБ_КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия <> &ВидСобытия
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Подразделение.НомерЛомбарда";
	Запрос2.УстановитьПараметр("НаДату", Объект.Дата);
	Запрос2.УстановитьПараметр("Подразделение", массивЛомб); 
	Запрос2.УстановитьПараметр("ВидСобытия", Перечисления.ЛБ_ВидыКадровыхСобытий.Увольнение);
	
	
	массив = Новый Массив;
	
	Выборка = Запрос2.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ВидСобытия = Перечисления.ЛБ_ВидыКадровыхСобытий.Увольнение Тогда
			Продолжить;
		КонецЕсли;
		массив.Добавить(Выборка.Сотрудник);
		
	КонецЦикла; 	
	
	Возврат Массив;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект); 
	
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ОтветственныйСотрудник = ПараметрыСеанса.ТекущийСотрудник;
		Объект.ОтветственныйПользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;      
	
	УстановитьСтатусДокумента(); 
	
	УстановитьДоступностьЭлементов();
КонецПроцедуры 

&НаСервере
Процедура УстановитьДоступностьЭлементов()
	Если Объект.Проведен Тогда  
		Этаформа.ТолькоПросмотр = Истина; 
		Элементы.кнопкаЗаполнитьИзГрафика.Доступность = Ложь;   
		Элементы.КнопкаДобавитьСотрудника.Доступность = Ложь;
		Элементы.ДанныеОВремени.ТолькоПросмотр = Истина;
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте 
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда) 
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект); 
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	//ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры 

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ДанныеОВремениПослеУдаления(Элемент)
	//	ПолныйПересчет();
	ПересчетИтоговЧасов();
КонецПроцедуры

&НаКлиенте
Процедура ОтработатьПоНажатиюКлавиши(Элемент, Текст)
	Если СтрНайти(Элемент.Имя, "ВремяПредставление") > 0 Тогда
		НомерДня = СтрЗаменить(Элемент.Имя, "ВремяПредставление", ""); 
		
		ТекСтрока = Элементы.ДанныеОВремени.ТекущиеДанные;  
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Сотрудник", 	ТекСтрока.Сотрудник);
		ПараметрыФормы.Вставить("Часов", 		ТекСтрока["Часов"+НомерДня]); 
		ПараметрыФормы.Вставить("ВидВремени", 	ТекСтрока["ВидВремени"+НомерДня]); 
		ПараметрыФормы.Вставить("Территория", 	ТекСтрока["Территория"+НомерДня]);
		ПараметрыФормы.Вставить("НомерДня", 	НомерДня);
		ПараметрыФормы.Вставить("ПолучитьЧасыИзГрафика", 	Истина);
		ПараметрыФормы.Вставить("ДатаРаботы",   Объект.ПериодРегистрации + (НомерДня-1)*86400);
		ПараметрыФормы.Вставить("Ломбард",      ТекСтрока.Ломбард); 
		ПараметрыФормы.Вставить("Текст",        Текст);
		
		Рез = ВернутьЧасыИзГрафика(ПараметрыФормы);
		
		рез.Вставить("ПересчитыватьИтог", Истина);
		рез.Вставить("ДатаРаботы", Объект.ПериодРегистрации + (НомерДня-1)*86400);

		ПослеОкончанииРедактированияДанныхОВремени(Рез, Неопределено);  
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолныйПересчет()
	//Для каждого ТекСтрока из Объект.ДанныеОВремени Цикл
	//	Для НомерДня = 1 по 31 Цикл
	//		
	//		
	//		Рез = Новый Структура;
	//		Рез.Вставить("Часов", ТекСтрока["Часов"+НомерДня]); 
	//		Рез.Вставить("НомерДня", НомерДня); 
	//		Рез.Вставить("ВидВремени", ТекСтрока["ВидВремени"+НомерДня]); 
	//		Рез.Вставить("Территория", ТекСтрока.Ломбард);
	//		
	//		ПослеОкончанииРедактированияДанныхОВремени(Рез, Неопределено, Ложь);
	//	КонецЦикла;
	//КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление1ИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОтработатьПоНажатиюКлавиши(Элемент, Текст); 
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление2ИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОтработатьПоНажатиюКлавиши(Элемент, Текст);
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление3ИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОтработатьПоНажатиюКлавиши(Элемент, Текст);
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление4ИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОтработатьПоНажатиюКлавиши(Элемент, Текст);
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление5ИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка) 
	СтандартнаяОбработка = Ложь;
	ОтработатьПоНажатиюКлавиши(Элемент, Текст);
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление6ИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОтработатьПоНажатиюКлавиши(Элемент, Текст);
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление7ИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОтработатьПоНажатиюКлавиши(Элемент, Текст);
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление8ИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОтработатьПоНажатиюКлавиши(Элемент, Текст);
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление9ИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОтработатьПоНажатиюКлавиши(Элемент, Текст);
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление10ИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОтработатьПоНажатиюКлавиши(Элемент, Текст);
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление11ИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОтработатьПоНажатиюКлавиши(Элемент, Текст);
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление12ИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОтработатьПоНажатиюКлавиши(Элемент, Текст);
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление13ИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОтработатьПоНажатиюКлавиши(Элемент, Текст);
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление14ИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОтработатьПоНажатиюКлавиши(Элемент, Текст);
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление15ИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОтработатьПоНажатиюКлавиши(Элемент, Текст);
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление16ИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОтработатьПоНажатиюКлавиши(Элемент, Текст);
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление17ИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОтработатьПоНажатиюКлавиши(Элемент, Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление18ИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОтработатьПоНажатиюКлавиши(Элемент, Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление19ИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОтработатьПоНажатиюКлавиши(Элемент, Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление20ИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОтработатьПоНажатиюКлавиши(Элемент, Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление21ИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОтработатьПоНажатиюКлавиши(Элемент, Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление22ИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОтработатьПоНажатиюКлавиши(Элемент, Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление23ИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОтработатьПоНажатиюКлавиши(Элемент, Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление24ИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОтработатьПоНажатиюКлавиши(Элемент, Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление25ИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОтработатьПоНажатиюКлавиши(Элемент, Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление26ИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОтработатьПоНажатиюКлавиши(Элемент, Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление27ИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОтработатьПоНажатиюКлавиши(Элемент, Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление28ИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОтработатьПоНажатиюКлавиши(Элемент, Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление29ИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОтработатьПоНажатиюКлавиши(Элемент, Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление30ИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОтработатьПоНажатиюКлавиши(Элемент, Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление31ИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОтработатьПоНажатиюКлавиши(Элемент, Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеОВремениСотрудникНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Элемент.РежимВыбораИзСписка = Истина;
	
	//СтандартнаяОбработка = Ложь; 
	
	Элемент.СписокВыбора.Очистить();
	
	массивСотрудников = СформироватьМассивСотрудниковОтделения();    
	
	Элемент.СписокВыбора.ЗагрузитьЗначения(массивСотрудников);
	
КонецПроцедуры

//&НаКлиенте
//Процедура ОтделениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
//	
//	Если Пользователь_ЭтоЛомбард() Тогда 
//		
//		Элемент.РежимВыбораИзСписка = Истина;
//		
//		Элемент.СписокВыбора.Очистить();
//		
//		массивОтделений = СформироватьМассивОтделений();    
//		
//		Элемент.СписокВыбора.ЗагрузитьЗначения(массивОтделений); 
//	Иначе
//		Элемент.РежимВыбораИзСписка = Ложь;
//	КонецЕсли;

//КонецПроцедуры

Функция Пользователь_ЭтоЛомбард()
	Возврат ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард;	
КонецФункции

&НаКлиенте
Процедура ДанныеОВремениСотрудникПриИзменении(Элемент)
	ТекСтр = Элементы.ДанныеОВремени.ТекущиеДанные; 
	Ошибка = Ложь; 
	
	Для каждого стр из Объект.ДанныеОВремени Цикл
		Если стр <> ТекСтр и ТекСтр.Ломбард = Стр.Ломбард и ТекСтр.Сотрудник = Стр.Сотрудник Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Сотрудник указан дважды в одном ломбарде";   
			Сообщение.Поле = "Объект.ДанныеОВремени["+СокрЛП(Стр.НомерСтроки-1)+"].Сотрудник";
			Сообщение.Сообщить(); 
		
			Ошибка = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Ошибка Тогда
		Объект.ДанныеОВремени.Удалить(Элементы.ДанныеОВремени.ТекущиеДанные.НомерСтроки - 1);
	Иначе
		ЗаполнитьПервоначальныеДанныеПоСотруднику();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтроку(Команда)
	Элементы.ДанныеОВремени.ДобавитьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура Отделение1НачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	
	
	
	
	//Если Объект.ДанныеОВремени.Количество() > 0 Тогда
	//	ТекстВопроса = НСтр("ru = 'Табличная часть будет очищена. Продолжить?'");
	//	Оповещение = Новый ОписаниеОповещения("ОтделениеВыборЗавершение", ЭтотОбъект);
	//	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, Заголовок);   
	//	
	//	
	//Иначе   
	
	Если Пользователь_ЭтоЛомбард() Тогда 
		
		Элементы.Отделение.РежимВыбораИзСписка = Истина;
		
		Элементы.Отделение.СписокВыбора.Очистить();
		
		массивОтделений = СформироватьМассивОтделений();    
		
		Элементы.Отделение.СписокВыбора.ЗагрузитьЗначения(массивОтделений); 
	Иначе
		Элементы.Отделение.РежимВыбораИзСписка = Ложь;
	КонецЕсли; 
КонецПроцедуры 


&НаКлиенте
Процедура ОтделениеВыборЗавершение(Результат, ДополнительныеПараметры) Экспорт	
	
	
	Если Результат = КодВозвратаДиалога.Да Тогда  
		
		
		Если Пользователь_ЭтоЛомбард() Тогда 
			
			Элементы.Отделение.РежимВыбораИзСписка = Истина;
			
			Элементы.Отделение.СписокВыбора.Очистить();
			
			массивОтделений = СформироватьМассивОтделений();    
			
			Элементы.Отделение.СписокВыбора.ЗагрузитьЗначения(массивОтделений); 
		Иначе
			Элементы.Отделение.РежимВыбораИзСписка = Ложь;
		КонецЕсли; 
		
		
		
		ЗаполнитьИзГрафикаНаСервере();
	КонецЕсли; 
	
	
КонецПроцедуры




&НаКлиенте
Процедура ОтделениеПриИзменении(Элемент) 
	
	
	ПроверитьДействующиеПриказы();
КонецПроцедуры  

Процедура ПроверитьДействующиеПриказы()
	Ошибка = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	|	ЛБ_РабочиеДниЛомбарда.Ломбард КАК Ломбард,
	|	ЛБ_РабочиеДниЛомбарда.РабочиеМинуты КАК РабочиеМинуты,
	|	ЛБ_РабочиеДниЛомбарда.Выходной КАК Выходной,
	|	ЛБ_РабочиеДниЛомбарда.Период КАК Период
	|ИЗ
	|	РегистрСведений.ЛБ_РабочиеДниЛомбарда КАК ЛБ_РабочиеДниЛомбарда";
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеОВремениЛомбардПриИзменении(Элемент) 
	ТекСтр = Элементы.ДанныеОВремени.ТекущиеДанные; 
	Ошибка = Ложь; 
	
	Для каждого стр из Объект.ДанныеОВремени Цикл
		Если стр <> ТекСтр и ТекСтр.Ломбард = Стр.Ломбард и ТекСтр.Сотрудник = Стр.Сотрудник Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Сотрудник указан дважды в одном ломбарде";   
			Сообщение.Поле = "Объект.ДанныеОВремени["+СокрЛП(Стр.НомерСтроки-1)+"].Сотрудник";
			Сообщение.Сообщить(); 
		
			Ошибка = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Ошибка Тогда
		Объект.ДанныеОВремени.Удалить(Элементы.ДанныеОВремени.ТекущиеДанные.НомерСтроки - 1);
	Иначе
    	ЗаполнитьПервоначальныеДанныеПоСотруднику();
	КонецЕсли;
КонецПроцедуры     



&НаСервере
Процедура ЗаполнитьПервоначальныеДанныеПоСотруднику() 
	ИдентификаторСтроки = ЭтаФорма.Элементы.ДанныеОВремени.ТекущаяСтрока;
	ТекСтр = Объект.ДанныеОВремени.НайтиПоИдентификатору(ИдентификаторСтроки); 
	КоличествоДнейвМесяце = День(КонецМесяца(Объект.ПериодРегистрации)); 
	
	Если ЗначениеЗаполнено(ТекСтр.Сотрудник) и ЗначениеЗаполнено(ТекСтр.Ломбард) Тогда
		ТекСтр.ИтогоЧасов = 0;
		
		ЗапросВых = Новый Запрос;
		ЗапросВых.Текст = "ВЫБРАТЬ
		|	ЛБ_РабочиеДниЛомбарда.Ломбард КАК Ломбард,
		|	ЛБ_РабочиеДниЛомбарда.Выходной КАК Выходной,
		|	ЛБ_РабочиеДниЛомбарда.ДеньНедели КАК ДеньНедели,
		|	ЛБ_РабочиеДниЛомбарда.НомерДня КАК НомерДня,
		|	ЛБ_РабочиеДниЛомбарда.Период КАК Период
		|ИЗ
		|	РегистрСведений.ЛБ_РабочиеДниЛомбарда КАК ЛБ_РабочиеДниЛомбарда
		|ГДЕ
		|	ЛБ_РабочиеДниЛомбарда.Период МЕЖДУ &НачДата И &КонДата
		|	И ЛБ_РабочиеДниЛомбарда.Ломбард = (&Подразделение)
		|	И ЛБ_РабочиеДниЛомбарда.Выходной = Истина";	
		ЗапросВых.УстановитьПараметр("Подразделение", ТекСтр.Ломбард);
		ЗапросВых.УстановитьПараметр("НачДата", Объект.ДатаНачалаПериода);
		ЗапросВых.УстановитьПараметр("КонДата", КонецДня(Объект.ДатаОкончанияПериода));
		
		тзВых = ЗапросВых.Выполнить().Выгрузить(); 
		
		ЗапросРабочиеДни = Новый Запрос;
		ЗапросРабочиеДни.Текст = "ВЫБРАТЬ
		|	ЛБ_РабочиеДниЛомбарда.Ломбард КАК Ломбард,
		|	СУММА(ЛБ_РабочиеДниЛомбарда.РабочиеМинуты) КАК РабочиеМинуты
		|ИЗ
		|	РегистрСведений.ЛБ_РабочиеДниЛомбарда КАК ЛБ_РабочиеДниЛомбарда
		|ГДЕ
		|	ЛБ_РабочиеДниЛомбарда.Период МЕЖДУ &НачДата И &КонДата
		|	И ЛБ_РабочиеДниЛомбарда.Ломбард = &Подразделение
		|	И ЛБ_РабочиеДниЛомбарда.Выходной = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛБ_РабочиеДниЛомбарда.Ломбард";	
		ЗапросРабочиеДни.УстановитьПараметр("Подразделение", ТекСтр.Ломбард);
		ЗапросРабочиеДни.УстановитьПараметр("НачДата", Объект.ДатаНачалаПериода);
		ЗапросРабочиеДни.УстановитьПараметр("КонДата", КонецДня(Объект.ДатаОкончанияПериода));
		тзРабочиеДни = ЗапросРабочиеДни.Выполнить().Выгрузить(); 
		
		ТекСтр.НормаПоПриказу = 0;
		строкаРабМинуты = тзРабочиеДни.Найти(ТекСтр.Ломбард, "Ломбард"); 
		Если строкаРабМинуты <> Неопределено Тогда
			ТекСтр.НормаПоПриказу = строкаРабМинуты.РабочиеМинуты/60;
		КонецЕсли;
		

		ДатаУвольнения = ВернутьДатуУвольненияСотрудника(ТекСтр.Сотрудник, Объект.ДатаНачалаПериода, КонецДня(Объект.ДатаОкончанияПериода));
        
		
			
		ВидВремени_Выходной = Справочники.ЛБ_ВидыИспользованияРабочегоВремени.ВыходныеДни;  
		ВидВремени_Увольнение = Справочники.ЛБ_ВидыИспользованияРабочегоВремени.Увольнение;
		
		
		Для номерДня = 1 по КоличествоДнейвМесяце Цикл 
			промДата = Объект.ПериодРегистрации + (номерДня-1)*86400; 
			
			ТекСтр["ВидВремени"+СокрЛП(номерДня)] = "";
			ТекСтр["ВремяПредставление"+СокрЛП(номерДня)] = ""; 
			ТекСтр["Часов"+СокрЛП(номерДня)] = 0; 		
			
			
			отбВых = Новый Структура;
			отбВых.Вставить("Ломбард", ТекСтр.Ломбард);
			отбВых.Вставить("Период", промДата);
			
			найдСтрВых = тзВых.НайтиСтроки(ОтбВых);
			Если найдСтрВых.Количество() > 0 Тогда  
				ТекСтр["ВидВремени"+СокрЛП(номерДня)] = ВидВремени_Выходной;
				ТекСтр["ВремяПредставление"+СокрЛП(номерДня)] = СформироватьПредставлениеВремени(ВидВремени_Выходной, 0, "");
			КонецЕсли;
			
			
			тзНеявка = НеявкаСотрудника(ТекСтр.Сотрудник, промДата); 
			Если тзНеявка.Количество() > 0 Тогда 			
				Для каждого стр из тзНеявка Цикл
					ТекСтр["ВидВремени"+СокрЛП(номерДня)] = стр.ВидВремени; 
					ТекСтр["ВремяПредставление"+СокрЛП(номерДня)] = СформироватьПредставлениеВремени(стр.ВидВремени, 0, "");
				КонецЦикла;	
			КонецЕсли;  
			
			Если ДатаУвольнения <> Неопределено Тогда
				Если промДата >= ДатаУвольнения Тогда 
					ТекСтр["ВидВремени"+СокрЛП(номерДня)] = ВидВремени_Увольнение;
					ТекСтр["ВремяПредставление"+СокрЛП(номерДня)] = СформироватьПредставлениеВремени(ВидВремени_Увольнение, 0, "");
				КонецЕсли;				
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры 


Функция ВернутьДатуУвольненияСотрудника(Сотр, НачДата, КонДата)
	
	ЗапросУв = Новый Запрос;
	ЗапросУв.Текст = "ВЫБРАТЬ
	|	ЛБ_КадроваяИсторияСотрудников.Период КАК Период
	|ИЗ
	|	РегистрСведений.ЛБ_КадроваяИсторияСотрудников КАК ЛБ_КадроваяИсторияСотрудников
	|ГДЕ
	|	ЛБ_КадроваяИсторияСотрудников.ВидСобытия = &ВидСобытия
	|	И ЛБ_КадроваяИсторияСотрудников.Период МЕЖДУ &НачДата И &КонДата
	|	И ЛБ_КадроваяИсторияСотрудников.Сотрудник = &Сотрудник";
	
	ЗапросУв.УстановитьПараметр("НачДата",    НачДата);
	ЗапросУв.УстановитьПараметр("КонДата",    КонДата); 
	ЗапросУв.УстановитьПараметр("Сотрудник",  Сотр);
	ЗапросУв.УстановитьПараметр("ВидСобытия", Перечисления.ЛБ_ВидыКадровыхСобытий.Увольнение); 
	
	ДатаУвольнения = Неопределено;
	
	ВыборкаУв = ЗапросУв.Выполнить().Выбрать();
	Если ВыборкаУв.Следующий() Тогда
		ДатаУвольнения = ВыборкаУв.Период;
	КонецЕсли;
	
	Возврат ДатаУвольнения;
КонецФункции



&НаКлиенте
Процедура ВремяПредставление1Очистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; ОтработатьПоНажатиюКлавиши(Элемент, "Х"); 
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление2Очистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; ОтработатьПоНажатиюКлавиши(Элемент, "Х"); 
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление3Очистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; ОтработатьПоНажатиюКлавиши(Элемент, "Х");
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление4Очистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; ОтработатьПоНажатиюКлавиши(Элемент, "Х");
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление5Очистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; ОтработатьПоНажатиюКлавиши(Элемент, "Х");
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление6Очистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; ОтработатьПоНажатиюКлавиши(Элемент, "Х");
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление7Очистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; ОтработатьПоНажатиюКлавиши(Элемент, "Х");
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление8Очистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; ОтработатьПоНажатиюКлавиши(Элемент, "Х");
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление9Очистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; ОтработатьПоНажатиюКлавиши(Элемент, "Х");
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление10Очистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; ОтработатьПоНажатиюКлавиши(Элемент, "Х");
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление11Очистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; ОтработатьПоНажатиюКлавиши(Элемент, "Х");
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление12Очистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; ОтработатьПоНажатиюКлавиши(Элемент, "Х");
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление13Очистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; ОтработатьПоНажатиюКлавиши(Элемент, "Х");
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление14Очистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; ОтработатьПоНажатиюКлавиши(Элемент, "Х");
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление15Очистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; ОтработатьПоНажатиюКлавиши(Элемент, "Х");
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление16Очистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; ОтработатьПоНажатиюКлавиши(Элемент, "Х");
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление17Очистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; ОтработатьПоНажатиюКлавиши(Элемент, "Х");
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление18Очистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; ОтработатьПоНажатиюКлавиши(Элемент, "Х");
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление19Очистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; ОтработатьПоНажатиюКлавиши(Элемент, "Х");
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление20Очистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; ОтработатьПоНажатиюКлавиши(Элемент, "Х");
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление21Очистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; ОтработатьПоНажатиюКлавиши(Элемент, "Х");
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление22Очистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; ОтработатьПоНажатиюКлавиши(Элемент, "Х");
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление23Очистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; ОтработатьПоНажатиюКлавиши(Элемент, "Х");
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление24Очистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; ОтработатьПоНажатиюКлавиши(Элемент, "Х");
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление25Очистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; ОтработатьПоНажатиюКлавиши(Элемент, "Х");
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление26Очистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; ОтработатьПоНажатиюКлавиши(Элемент, "Х");
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление27Очистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; ОтработатьПоНажатиюКлавиши(Элемент, "Х");
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление28Очистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; ОтработатьПоНажатиюКлавиши(Элемент, "Х");
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление29Очистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; ОтработатьПоНажатиюКлавиши(Элемент, "Х");
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление30Очистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; ОтработатьПоНажатиюКлавиши(Элемент, "Х");
КонецПроцедуры

&НаКлиенте
Процедура ВремяПредставление31Очистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; ОтработатьПоНажатиюКлавиши(Элемент, "Х");
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьСтатусДокумента();

КонецПроцедуры

&НаКлиенте
Процедура Редактировать(Команда)
	ЭтаФорма.ТолькоПросмотр = Ложь;
	ОтменитьПроведение();
	УстановитьСтатусДокумента(); 
	ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаКнопка2.Видимость = Ложь; 
КонецПроцедуры 

&НаСервере
Процедура ОтменитьПроведение()  
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения));
КонецПроцедуры









