//////////////////////////////////////////////////////////////////////////////////
//// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА
//////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

Процедура ПроверитьТаблицуБланковБилетов(Отказ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_БланкиЗалоговыхБилетовОстатки.Организация КАК Организация,
	               |	ЛБ_БланкиЗалоговыхБилетовОстатки.Ломбард КАК Ломбард,
	               |	ЛБ_БланкиЗалоговыхБилетовОстатки.Номер КАК Номер,
	               |	СУММА(ЛБ_БланкиЗалоговыхБилетовОстатки.КоличествоОстаток) КАК КоличествоОстаток
	               |ИЗ
	               |	РегистрНакопления.ЛБ_БланкиЗалоговыхБилетов.Остатки КАК ЛБ_БланкиЗалоговыхБилетовОстатки
	               |ГДЕ
	               |	ЛБ_БланкиЗалоговыхБилетовОстатки.Номер В(&СписокНомеров)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_БланкиЗалоговыхБилетовОстатки.Организация,
	               |	ЛБ_БланкиЗалоговыхБилетовОстатки.Ломбард,
	               |	ЛБ_БланкиЗалоговыхБилетовОстатки.Номер";	
    Запрос.УстановитьПараметр("ДатаДок",Новый Граница(Дата,ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("СписокНомеров",БланкиБилетов.ВыгрузитьКолонку("Номер"));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество()>0 Тогда
		Отказ = Истина;
		Пока Выборка.Следующий() Цикл
			Сообщить("Бланк с № "+Выборка.Номер+" не может быть оприходован!"+Символы.ПС
			+ "Уже есть в базе: Организация: "+Выборка.Организация+", ломбард: "+Выборка.Ломбард);
		КонецЦикла;	
	КонецЕсли;	

КонецПроцедуры	

Процедура ДвиженияПоРегистрам()
	// регистр ЛБ_БланкиЗалоговыхБилетов Приход
	Для Каждого ТекСтрокаБланкиБилетов Из БланкиБилетов Цикл
		Движение = Движения.ЛБ_БланкиЗалоговыхБилетов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Ломбард = Ломбард;
				Движение.Номер = ТекСтрокаБланкиБилетов.Номер;
		Движение.Количество = ТекСтрокаБланкиБилетов.Количество;
	КонецЦикла;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ПроверитьТаблицуБланковБилетов(Отказ);

	// Движения по документу.
	Если НЕ Отказ Тогда
		
		ДвиженияПоРегистрам();
		
	КонецЕсли;

КонецПроцедуры // ОбработкаПроведения()

