&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТолькоПросмотр") Тогда
		//+МАН 14.11.24 Добавлено условие. Заявка 2464
		Если Параметры.ТолькоПросмотр <> Неопределено Тогда
			Элементы.СохранитьИЗакрыть.Доступность = НЕ Параметры.ТолькоПросмотр;
		КонецЕсли;
		//-МАН
	КонецЕсли;
	
	Если Параметры.Свойство("Проба") Тогда
		Проба = Параметры.Проба;
	КонецЕсли;
	
	Если Параметры.Свойство("Вес") Тогда
		Вес = Параметры.Вес;
	КонецЕсли;
	
	Если Параметры.Свойство("ВесВПробеЧистоты") Тогда
		ВесВПробеЧистоты = Параметры.ВесВПробеЧистоты;
	КонецЕсли;
	
	Если Параметры.Свойство("СуммаОценки") Тогда
		СуммаОценки = Параметры.СуммаОценки;
	КонецЕсли;
	
	Если Параметры.Свойство("ПробаФакт") Тогда
		ПробаФакт = Параметры.ПробаФакт;
	КонецЕсли;
	
    Если Параметры.Свойство("ВесФакт") Тогда
		ВесФакт = Параметры.ВесФакт;
	КонецЕсли;
	
	Если Параметры.Свойство("ВесВПробеЧистотыФакт") Тогда
		ВесВПробеЧистотыФакт = Параметры.ВесВПробеЧистотыФакт;
	КонецЕсли;
	
	Если Параметры.Свойство("СуммаОценкиФакт") Тогда
		СуммаОценкиФакт = Параметры.СуммаОценкиФакт;
	КонецЕсли;
	
	Если Параметры.Свойство("ОсновнойМеталл") Тогда
		ОсновнойМеталл = Параметры.ОсновнойМеталл;
	КонецЕсли;
	
	Если Параметры.Свойство("ОперацияЗайма") Тогда
		ОперацияЗайма = Параметры.ОперацияЗайма;
	КонецЕсли;
	
	Если Параметры.Свойство("Категория") Тогда
		Категория = Параметры.Категория;
	КонецЕсли;
	
	Если Параметры.Свойство("ЕдиницаИзмерения") Тогда 
		ЕдиницаИзмерения = Параметры.ЕдиницаИзмерения;
		Если НЕ ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
			ПолучитьЕдИзм = ЛБ_ОбщийМодуль.ВыборЕдиницИзмеренияРасчетаЦенМеталлов();
			ЕдиницаИзмерения = ПолучитьЕдИзм[0].ЕдиницаИзмерения;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("НоваяСтрокаТЧ") Тогда
		НоваяСтрока = Параметры.НоваяСтрокаТЧ;
	Иначе
		НоваяСтрока = Ложь;
	КонецЕсли;

	Если Параметры.Свойство("ИДНоваяСтрокаТЧ") Тогда
		ИДНоваяСтрока = Параметры.ИДНоваяСтрокаТЧ;
	КонецЕсли;

	Если Параметры.Свойство("ОбъектЗалога") Тогда 
		ОбъектЗалога = Параметры.ОбъектЗалога;
	КонецЕсли;

	Если Параметры.Свойство("ТЧ") Тогда
		ТЧВставкаК = Параметры.ТЧ.ВставкаК;
		ТЧВставкаМ = Параметры.ТЧ.ВставкаМ;
		ТЧОсновная = Параметры.ТЧ.Основная;
	КонецЕсли;

	Если Параметры.Свойство("ОбщаяМассаФакт") Тогда 
		ОбщаяМассаФакт = Параметры.ОбщаяМассаФакт;
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		Элементы.ГруппаУчетныхДанных.Видимость = Ложь;
	КонецЕсли;
	
	ЗаполнитьСписокВыбораПробы();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)

	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Отмена", Истина);
	СтруктураВозврата.Вставить("НоваяСтрокаТЧ", НоваяСтрока);
	СтруктураВозврата.Вставить("ИДНоваяСтрокаТЧ", ИДНоваяСтрока);
	
	Этаформа.Закрыть(?(НоваяСтрока, СтруктураВозврата, Неопределено));

КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	
	Если НЕ Проверить() Тогда
		Возврат;
	КонецЕсли;

	ЕстьИзменения = ПроверитьНаличиеИзменений();
	
	Если ЕстьИзменения Тогда
		
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("ПробаФакт", ПробаФакт);
		СтруктураВозврата.Вставить("ВесФакт", ВесФакт);
		СтруктураВозврата.Вставить("ВесВПробеЧистотыФакт", ВесВПробеЧистотыФакт);
		СтруктураВозврата.Вставить("СуммаОценкиФакт", СуммаОценкиФакт);
		СтруктураВозврата.Вставить("ОбъектЗалога", ОбъектЗалога);
		СтруктураВозврата.Вставить("НоваяСтрокаТЧ", НоваяСтрока);
		СтруктураВозврата.Вставить("ИДНоваяСтрокаТЧ", ИДНоваяСтрока);
		СтруктураВозврата.Вставить("ЕдиницаИзмерения", ЕдиницаИзмерения);
		СтруктураВозврата.Вставить("ЦенаФакт", ЦенаФакт);
		СтруктураВозврата.Вставить("Отмена", Ложь);
		
		Этаформа.Закрыть(СтруктураВозврата);
	Иначе
		Этаформа.Закрыть(Неопределено);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция Проверить()

	ВсеОК = Истина;
	Если НЕ ЗначениеЗаполнено(ПробаФакт) Тогда
		Сообщить("Не выбрана проба");
		ВсеОК = Ложь;
	КонецЕсли;
	Если ВесФакт = 0 Тогда
		Сообщить("Не задан вес");
		ВсеОК = Ложь;
	КонецЕсли;
	//Если ВесВПробеЧистотыФакт = 0 Тогда
	//	Сообщить("Не задан вес чистоты");
	//	ВсеОК = Ложь;
	//КонецЕсли;
	
	ДокументОбъект = ЭтотОбъект.ВладелецФормы.Объект;

	Если ПроверитьОбщийВес(ДокументОбъект) Тогда
		Сообщить("Общий вес изделия не может быть меньше общего веса вставки/ доп.металла/ комплектующего!");
		ВсеОК = Ложь;
	КонецЕсли;
	
	Возврат ВсеОК;

КонецФункции

&НаСервере
Функция ПроверитьОбщийВес(ДокументОбъект)
	Отбор = Новый Структура;
	Отбор.Вставить("ОбъектЗалога", ОбъектЗалога);
	
	СтрокиВ = ДокументОбъект[ТЧВставкаК].НайтиСтроки(Отбор);
	
	ВесК = 0;
	ВесМ = 0;
		
	Для каждого СтрВК Из СтрокиВ Цикл
		ВесК = ВесК + СтрВК.ВесГраммыФакт;
	КонецЦикла;

	СтрокиВМ = ДокументОбъект[ТЧВставкаМ].НайтиСтроки(Отбор);
	
	Для каждого СтрВМ Из СтрокиВМ Цикл
		ВесМ = ВесМ + СтрВМ.ВесФакт;
	КонецЦикла;
	
	//ВесК = ВесК - ВесГраммы + ВесГраммыФакт;
	ВесМ = ВесМ - Вес + ВесФакт;

	Результат = ?(Цел((ОбщаяМассаФакт - (ВесК + ВесМ))*100)/100 <= 0, Истина, Ложь);

	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Отмена", Истина);
	СтруктураВозврата.Вставить("НоваяСтрокаТЧ", НоваяСтрока);
	СтруктураВозврата.Вставить("ИДНоваяСтрокаТЧ", ИДНоваяСтрока);

	Этаформа.Закрыть(?(НоваяСтрока, СтруктураВозврата, Неопределено));
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораПробы()
		
	Элементы.ПробаФакт.СписокВыбора.Очистить();
	
	ЗапросП = Новый Запрос;
	ЗапросП.Текст = "ВЫБРАТЬ
	                |	ЛБ_Пробы.Ссылка КАК Проба
	                |ИЗ
	                |	Справочник.ЛБ_Пробы КАК ЛБ_Пробы
	                |ГДЕ
	                |	ЛБ_Пробы.Владелец = &Владелец
	                |	И ЛБ_Пробы.ПометкаУдаления = ЛОЖЬ
	                |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос = Новый Запрос;  

	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДополнительныеМеталлыВИзделиях.ДополнительныйМеталл КАК ДополнительныйМеталл
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДополнительныеМеталлыВИзделиях КАК ЛБ_ДополнительныеМеталлыВИзделиях
	               |ГДЕ
	               |	ЛБ_ДополнительныеМеталлыВИзделиях.ОсновнойМеталл = &ОсновнойМеталл
	               |АВТОУПОРЯДОЧИВАНИЕ";  

	Запрос.УстановитьПараметр("ОсновнойМеталл", ОсновнойМеталл.Владелец);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗапросП.УстановитьПараметр("Владелец", Выборка.ДополнительныйМеталл); 

		ВыборкаП = ЗапросП.Выполнить().Выбрать();

		Пока ВыборкаП.Следующий() Цикл 
			Элементы.ПробаФакт.СписокВыбора.Добавить(ВыборкаП.Проба);
		Конеццикла;	
	Конеццикла;	 

КонецПроцедуры

&НаСервере
Процедура РассчитатьРеквизиты()

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Дата", НачалоДня(ОперацияЗайма.Дата));
	СтруктураПараметров.Вставить("Ломбард", ОперацияЗайма.Ломбард);
	СтруктураПараметров.Вставить("СхемаКредитования", ОперацияЗайма.СхемаКредитования);
	СтруктураПараметров.Вставить("Проба", ПробаФакт);
	СтруктураПараметров.Вставить("Категория", Категория);
	СтруктураПараметров.Вставить("ЕдиницаИзмерения", ЕдиницаИзмерения);
	
	Результат = ЛБ_ОбщийМодуль.ПолучитьЦенуМеталлаИзПрейскуранта(СтруктураПараметров);
	ЦенаФакт = Результат.Цена; 
	СуммаОценкиФакт = ВесФакт*ЦенаФакт; 	 
	ВесВПробеЧистотыФакт = ЛБ_ОбщийМодуль.ПеревестиВЧистоту(ВесФакт, ПробаФакт);

КонецПроцедуры

&НаКлиенте
Процедура ПробаФактПриИзменении(Элемент)
	РассчитатьРеквизиты();
КонецПроцедуры

&НаКлиенте
Процедура ВесФактПриИзменении(Элемент)
	РассчитатьРеквизиты();
КонецПроцедуры

&НаКлиенте
Функция ПроверитьНаличиеИзменений()
	Для каждого Элем Из Элементы.ГруппаУчетныхДанных.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(Элем) = Тип("ПолеФормы") Тогда
			Если ЭтотОбъект[Элем.Имя] <> ЭтотОбъект[Элем.Имя + "Факт"] Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции
