
&НаКлиенте
Процедура Выбор(Команда)
	ПреобразоватьВТЗ();
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Количество", ТаблицаРезультат.Количество());
	Ном = 0;
	Для каждого Стр Из ТаблицаРезультат Цикл
		Ном = Ном + 1;
		СтруктураВозврата.Вставить("Значение" + Строка(Ном), Стр.Ломбард);
	КонецЦикла;	

	Закрыть(СтруктураВозврата);
КонецПроцедуры

&НаСервере
Процедура ПреобразоватьВТЗ()	
	ТаблицаРезультат.Очистить();
	
	ДеревоНаСервере = РеквизитФормыВЗначение("Дерево");
	ПреобразоватьВТЗРекурсивно(ДеревоНаСервере, ТаблицаРезультат);
	
КонецПроцедуры	

&НаСервере
Процедура  ПреобразоватьВТЗРекурсивно(ДеревоНаСервере, ТаблицаРезультат)
	Для каждого Строка Из ДеревоНаСервере.Строки Цикл
		Если Строка.Пометка И НЕ Строка.ЭтоГруппа Тогда
			НоваяСтр = ТаблицаРезультат.Добавить();
			НоваяСтр.Ломбард = Строка.Ломбард;
		КонецЕсли;
		
		Если НЕ Строка.Строки.Количество() = 0 Тогда
			ПреобразоватьВТЗРекурсивно(Строка, ТаблицаРезультат);
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Запрос = Новый Запрос;	
	Если Параметры.Свойство("ДатаДок") Тогда  
		ДатаДок = Параметры.ДатаДок;
		ДатаДок = ?(ДатаДок = Дата(1,1,1), ТекущаяДатаСеанса(), ДатаДок);
		Запрос.УстановитьПараметр("Дата", ДатаДок);
	Иначе    
		ДатаДок = ТекущаяДатаСеанса();
		Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	КонецЕсли;	 
	Если Параметры.Свойство("Вид") Тогда 
		Объект.ВидОтбора = Параметры.Вид;
		Элементы.ВидОтбора.Видимость = ложь;
	КонецЕсли;	
	Если Объект.ВидОтбора = 0 Тогда //по отделениям
	    Запрос.Текст = "ВЫБРАТЬ
					|	ЛБ_Ломбарды.Ссылка КАК Ломбард,
					|	ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
					|ИЗ
					|	Справочник.ЛБ_Ломбарды КАК ЛБ_Ломбарды
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, ) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
					|		ПО (ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард = ЛБ_Ломбарды.Ссылка)
					|ГДЕ
					//+МАН 12.03.26 Добавил сортировку. Заявка 3654
					//Было: |	ЛБ_Ломбарды.Закрыт = ЛОЖЬ"; 
					|	ЛБ_Ломбарды.Закрыт = ЛОЖЬ
					|
					|УПОРЯДОЧИТЬ ПО
					|	ЛБ_Ломбарды.НомерЧисловой";
					//-МАН
	Иначе  // по группам
		Запрос.Текст = "ВЫБРАТЬ
					|	ЛБ_Ломбарды.Ссылка КАК Ломбард,
					|	ЛБ_ГруппыЛомбардовСрезПоследних.Группа КАК Отделение
					|ИЗ
					|	Справочник.ЛБ_Ломбарды КАК ЛБ_Ломбарды
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ГруппыЛомбардов.СрезПоследних(&Дата, ) КАК ЛБ_ГруппыЛомбардовСрезПоследних
					|		ПО (ЛБ_ГруппыЛомбардовСрезПоследних.Ломбард = ЛБ_Ломбарды.Ссылка)
					|ГДЕ
					//+МАН 12.03.26 Добавил сортировку. Заявка 3654
					//Было: |	ЛБ_Ломбарды.Закрыт = ЛОЖЬ"; 
					|	ЛБ_Ломбарды.Закрыт = ЛОЖЬ
					|
					|УПОРЯДОЧИТЬ ПО
					|	ЛБ_Ломбарды.НомерЧисловой";
					//-МАН
	КонецЕсли;	
    ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
    Отделения = ТаблицаЗапроса.Скопировать(); 
    Отделения.Свернуть("Отделение"); 
	//+МАН 12.03.26 Добавил сортировку. Заявка 3654
	Отделения.Сортировать("Отделение");
    //-МАН

	ДанныеДерево =  Новый ДеревоЗначений;  
	ДанныеДерево.Колонки.Добавить("Ломбард"); 
	ДанныеДерево.Колонки.Добавить("Пометка", Новый ОписаниеТипов("Булево"));
	ДанныеДерево.Колонки.Добавить("ЭтоГруппа", Новый ОписаниеТипов("Булево"));
	ДанныеДерево.Колонки.Добавить("ОтделениеРодитель");
	Для каждого СтрО Из Отделения Цикл 
		СтрокаВерхнего = ДанныеДерево.Строки.Добавить();
        СтрокаВерхнего.Ломбард = ?(СтрО.Отделение = null, ?(Объект.ВидОтбора = 0, Справочники.ЛБ_ОтделенияЛомбардов.ЛомбардыВнеОтделений, Справочники.ЛБ_ГруппыЛомбардов.ЛомбардыВнеГрупп), СтрО.Отделение);
		СтрокаВерхнего.ЭтоГруппа = Истина;
		
		Отбор = Новый Структура; 
		Отбор.Вставить("Отделение", СтрО.Отделение);          
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
		Для каждого стр Из Строки Цикл		
		   СтрокаВторого = СтрокаВерхнего.Строки.Добавить();
		   СтрокаВторого.Ломбард = Стр.Ломбард;
		   СтрокаВторого.ОтделениеРодитель = СтрокаВерхнего.Ломбард;
		КонецЦикла;
	Конеццикла;	 
	//+МАН 12.03.26 Убрал. Сортировка идет раньше. Заявка 3654
	//ДанныеДерево.Строки.Сортировать("Ломбард", Истина);
	//-МАН
		
	ЗначениеВРеквизитФормы(ДанныеДерево, "Дерево");
	
	Если Параметры.Свойство("Ломбарды") Тогда
		ТаблицаЛомбардов = Параметры.Ломбарды;
		ДеревоНаСервере = РеквизитФормыВЗначение("Дерево");
		ПроставитьГалочки(ДеревоНаСервере, ТаблицаЛомбардов);
		ЗначениеВРеквизитФормы(ДеревоНаСервере, "Дерево");		
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПроставитьГалочкиВГруппе();
КонецПроцедуры


&НаСервере
Процедура ПроставитьГалочки(ДеревоНаСервере, ТаблицаЛомбардов)
	Для каждого Строка Из ДеревоНаСервере.Строки Цикл		
		Отбор = Новый Структура;
		Отбор.Вставить("Ломбард", Строка.Ломбард);
		Строки = ТаблицаЛомбардов.НайтиСтроки(Отбор);
		Если НЕ строки.Количество() = 0  Тогда
			Строка.Пометка = Истина; 
		КонецЕсли;		

		Если НЕ Строка.Строки.Количество() = 0 Тогда
			ПроставитьГалочки(Строка, ТаблицаЛомбардов);
		КонецЕсли;	
	
	КонецЦикла;	
КонецПроцедуры	

&НаКлиенте
Процедура ПроставитьГалочкиВГруппе() 
    ЭлементыДерева = Дерево.ПолучитьЭлементы();
	Для каждого Элемент Из ЭлементыДерева Цикл		
		ВлЭлементы = Элемент.ПолучитьЭлементы();
		Если ВлЭлементы.Количество()  > 0 Тогда
			Пометка = Истина;  
			ЕстьОтмеченные = ложь;
			Для каждого ВлЭлемент Из ВлЭлементы Цикл
				Если НЕ ВлЭлемент.Пометка Тогда
					Пометка = Ложь;
					//Прервать;					
				Иначе
					ЕстьОтмеченные = Истина;
				КонецЕсли;
			КонецЦикла;
			Элемент.Пометка = Пометка;  
			Если ЕстьОтмеченные Тогда
			    Элементы.СписокЛомбардов.Развернуть(Элемент.ПолучитьИдентификатор(), Истина); 
			КонецЕсли;	
		КонецЕсли;		
	КонецЦикла;	

КонецПроцедуры	

&НаСервере
Процедура ПроставитьГалочкиПоГруппе(ДеревоНаСервере, Группа, Пометка)
	Для каждого Строка Из ДеревоНаСервере.Строки Цикл
		Если Строка.Ломбард = Группа Тогда
			Строка.Пометка = Пометка;
		ИначеЕсли Строка.ОтделениеРодитель = Группа Тогда
			Строка.Пометка = Пометка;	
		Иначе
			Продолжить;
		КонецЕсли;		

		Если НЕ Строка.Строки.Количество() = 0 Тогда
			ПроставитьГалочкиПоГруппе(Строка, Группа, Пометка);
		КонецЕсли;	
	
	КонецЦикла;	
КонецПроцедуры	

&НаСервере
Процедура ОбработатьОтметкуГруппы(Ломбард, Пометка)
	ДеревоНаСервере = РеквизитФормыВЗначение("Дерево");
	ПроставитьГалочкиПоГруппе(ДеревоНаСервере, Ломбард, Пометка);
	ЗначениеВРеквизитФормы(ДеревоНаСервере, "Дерево");
КонецПроцедуры	
	
&НаКлиенте
Процедура СписокЛомбардовПометкаПриИзменении(Элемент)
	ТекСтрока = Элементы.СписокЛомбардов.ТекущиеДанные;
	Если ТекСтрока.ЭтоГруппа Тогда
		ОбработатьОтметкуГруппы(ТекСтрока.Ломбард, ТекСтрока.Пометка);
		ЭлементыДерева = Дерево.ПолучитьЭлементы();
		Для каждого ЭлементГруппа Из ЭлементыДерева Цикл
			Если ЭлементГруппа.Ломбард = ТекСтрока.Ломбард Тогда
				Если ТекСтрока.Пометка Тогда				
			        Элементы.СписокЛомбардов.Развернуть(ЭлементГруппа.ПолучитьИдентификатор(), Истина);
				Иначе
					Элементы.СписокЛомбардов.Свернуть(ЭлементГруппа.ПолучитьИдентификатор());
				КонецЕсли; 
				Элементы.СписокЛомбардов.ТекущаяСтрока = ЭлементГруппа.ПолучитьИдентификатор();
				Прервать;
			КонецЕсли;	 
		КонецЦикла;	    		
	Иначе
		//проверить отметку родителя
		ЭлементыДерева = Дерево.ПолучитьЭлементы();
		Для каждого ЭлементГруппа Из ЭлементыДерева Цикл
			Если ЭлементГруппа.Ломбард = ТекСтрока.ОтделениеРодитель Тогда
				Пометка = ТекСтрока.Пометка;
				ВлЭлементы = ЭлементГруппа.ПолучитьЭлементы();
				Для каждого ВлЭлемент Из ВлЭлементы Цикл
					Если НЕ ВлЭлемент.Пометка = ТекСтрока.Пометка Тогда
						Пометка = ВлЭлемент.Пометка;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				ЭлементГруппа.Пометка = ?(Пометка = ТекСтрока.Пометка, ТекСтрока.Пометка, ложь);
				Прервать;
			КонецЕсли;	
		КонецЦикла;		
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	Закрыть(неопределено);
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДерево(ЭлементыДерева)
	Для каждого Элемент Из ЭлементыДерева Цикл
		ВлЭлементыДерева = Элемент.ПолучитьЭлементы();
		Если ВлЭлементыДерева.Количество() > 0 Тогда
			СвернутьДерево(ВлЭлементыДерева);
		КонецЕсли;	
		Элементы.СписокЛомбардов.Свернуть(Элемент.ПолучитьИдентификатор());
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура Развернуть(Команда)
	ЭлементыДерева = Дерево.ПолучитьЭлементы();
	Для каждого Элемент Из ЭлементыДерева Цикл		
		 Элементы.СписокЛомбардов.Развернуть(Элемент.ПолучитьИдентификатор(), Истина);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура Свернуть(Команда)
	ЭлементыДерева = Дерево.ПолучитьЭлементы();
	СвернутьДерево(ЭлементыДерева);
КонецПроцедуры

&НаСервере
Процедура ОтметитьВсеНаСервере(ДеревоНаСервере)
	Для каждого Строка Из ДеревоНаСервере.Строки Цикл
		Строка.Пометка = Истина;	

		Если НЕ Строка.Строки.Количество() = 0 Тогда
			ОтметитьВсеНаСервере(Строка);
		КонецЕсли;	
	
	КонецЦикла;	
КонецПроцедуры	

&НаСервере
Процедура ПроставитьФлажки()
	ДеревоНаСервере = РеквизитФормыВЗначение("Дерево");
	ОтметитьВсеНаСервере(ДеревоНаСервере);
	ЗначениеВРеквизитФормы(ДеревоНаСервере, "Дерево");
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	ПроставитьФлажки();
КонецПроцедуры

&НаСервере
Процедура СнятьОтметкуНаСервере(ДеревоНаСервере)
	Для каждого Строка Из ДеревоНаСервере.Строки Цикл
		Строка.Пометка = ложь;	

		Если НЕ Строка.Строки.Количество() = 0 Тогда
			СнятьОтметкуНаСервере(Строка);
		КонецЕсли;	
	
	КонецЦикла;	
КонецПроцедуры	

&НаСервере
Процедура СнятьФлажки()
	ДеревоНаСервере = РеквизитФормыВЗначение("Дерево");
	СнятьОтметкуНаСервере(ДеревоНаСервере);
	ЗначениеВРеквизитФормы(ДеревоНаСервере, "Дерево");
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметку(Команда)
	СнятьФлажки();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуВыбранныхЛомбардов(ДеревоНаСервере, ТаблицаЛомбардов)
	Для каждого Строка Из ДеревоНаСервере.Строки Цикл		
		Если Строка.Пометка И НЕ Строка.ЭтоГруппа Тогда
			НоваяСтр = ТаблицаЛомбардов.Добавить();
			НоваяСтр.Ломбард = Строка.Ломбард;
		КонецЕсли;
		
		Если НЕ Строка.Строки.Количество() = 0 Тогда
			ЗаполнитьТаблицуВыбранныхЛомбардов(Строка, ТаблицаЛомбардов)
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры	

&НаСервере
Процедура ИзменениеОтбора() 
	ТаблицаЛомбардов = Новый ТаблицаЗначений;  
	ТаблицаЛомбардов.Колонки.Добавить("Ломбард"); 
	ДеревоНаСервере = РеквизитФормыВЗначение("Дерево");
	ЗаполнитьТаблицуВыбранныхЛомбардов(ДеревоНаСервере, ТаблицаЛомбардов);

	Запрос = Новый Запрос;    
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Если Объект.ВидОтбора = 0 Тогда //по отделениям
	    Запрос.Текст = "ВЫБРАТЬ
					|	ЛБ_Ломбарды.Ссылка КАК Ломбард,
					|	ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
					|ИЗ
					|	Справочник.ЛБ_Ломбарды КАК ЛБ_Ломбарды
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, ) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
					|		ПО (ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард = ЛБ_Ломбарды.Ссылка)
					|ГДЕ
					//+МАН 12.03.26 Добавил сортировку. Заявка 3654
					//Было: |	ЛБ_Ломбарды.Закрыт = ЛОЖЬ"; 
					|	ЛБ_Ломбарды.Закрыт = ЛОЖЬ
					|
					|УПОРЯДОЧИТЬ ПО
					|	ЛБ_Ломбарды.НомерЧисловой";
					//-МАН
	Иначе  // по группам
		Запрос.Текст = "ВЫБРАТЬ
					|	ЛБ_Ломбарды.Ссылка КАК Ломбард,
					|	ЛБ_ГруппыЛомбардовСрезПоследних.Группа КАК Отделение
					|ИЗ
					|	Справочник.ЛБ_Ломбарды КАК ЛБ_Ломбарды
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ГруппыЛомбардов.СрезПоследних(&Дата, ) КАК ЛБ_ГруппыЛомбардовСрезПоследних
					|		ПО (ЛБ_ГруппыЛомбардовСрезПоследних.Ломбард = ЛБ_Ломбарды.Ссылка)
					|ГДЕ
					//+МАН 12.03.26 Добавил сортировку. Заявка 3654
					//Было: |	ЛБ_Ломбарды.Закрыт = ЛОЖЬ"; 
					|	ЛБ_Ломбарды.Закрыт = ЛОЖЬ
					|
					|УПОРЯДОЧИТЬ ПО
					|	ЛБ_Ломбарды.НомерЧисловой";
					//-МАН
	КонецЕсли;	
    ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
    Отделения = ТаблицаЗапроса.Скопировать(); 
    Отделения.Свернуть("Отделение"); 
	//+МАН 12.03.26 Добавил сортировку. Заявка 3654
	Отделения.Сортировать("Отделение");
    //-МАН

	ДанныеДерево =  Новый ДеревоЗначений;  
	ДанныеДерево.Колонки.Добавить("Ломбард"); 
	ДанныеДерево.Колонки.Добавить("Пометка", Новый ОписаниеТипов("Булево"));
	ДанныеДерево.Колонки.Добавить("ЭтоГруппа", Новый ОписаниеТипов("Булево"));
	ДанныеДерево.Колонки.Добавить("ОтделениеРодитель");
	Для каждого СтрО Из Отделения Цикл 
		СтрокаВерхнего = ДанныеДерево.Строки.Добавить();
        СтрокаВерхнего.Ломбард = ?(СтрО.Отделение = null, ?(Объект.ВидОтбора = 0, Справочники.ЛБ_ОтделенияЛомбардов.ЛомбардыВнеОтделений, Справочники.ЛБ_ГруппыЛомбардов.ЛомбардыВнеГрупп), СтрО.Отделение);
		СтрокаВерхнего.ЭтоГруппа = Истина;
		
		Отбор = Новый Структура; 
		Отбор.Вставить("Отделение", СтрО.Отделение);          
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
		Для каждого стр Из Строки Цикл		
		   СтрокаВторого = СтрокаВерхнего.Строки.Добавить();
		   СтрокаВторого.Ломбард = Стр.Ломбард;
		   СтрокаВторого.ОтделениеРодитель = СтрокаВерхнего.Ломбард;
		КонецЦикла;
	Конеццикла;	 
	//+МАН 12.03.26 Убрал. Сортировка идет раньше. Заявка 3654
	//ДанныеДерево.Строки.Сортировать("Ломбард", Истина);
	//-МАН
	
	ЗначениеВРеквизитФормы(ДанныеДерево, "Дерево");
	ДеревоНаСервере = РеквизитФормыВЗначение("Дерево");
	ПроставитьГалочки(ДеревоНаСервере, ТаблицаЛомбардов);
	ЗначениеВРеквизитФормы(ДеревоНаСервере, "Дерево");		
КонецПроцедуры

&НаКлиенте
Процедура ВидОтбораПриИзменении(Элемент)
	ИзменениеОтбора();	
	ПроставитьГалочкиВГруппе();
КонецПроцедуры



