
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("ВидКамня", Параметры.ВидВставки);
	Список.Параметры.УстановитьЗначениеПараметра("ВидОгранки", Параметры.ВидОгранки);
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	ВыбратьЭлемент();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЭлемент()
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("КачествоОгранки", ТекСтрока.КачествоОгранки);
	
	Закрыть(СтруктураВозврата);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыбратьЭлемент();
КонецПроцедуры
