&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Документ") Тогда
        ДокументОплаты = Параметры.Документ; 
		Если ДокументОплаты.Проведен тогда
			НеРедактировать = Истина;
			Элементы.ДекорацияСтатусДокумента.Заголовок = "Факт"; 
			Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноБордовый;  
			Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.ТусклоРозовый;
		Иначе
			Элементы.ДекорацияСтатусДокумента.Заголовок = "Проект"; 
			Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноЗеленый;
			Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.СветлоЗеленый;
		КонецЕсли;	
		ДатаДок = ДокументОплаты.Дата; 
		Ломбард = ДокументОплаты.Ломбард;  
		ОтветственныйПользователь = ДокументОплаты.ОтветственныйПользователь; 
		ОтветственныйСотрудник = ДокументОплаты.ОтветственныйСотрудник; 
		Комментарий = ДокументОплаты.Комментарий;
		ЗалоговыйБилет = ДокументОплаты.ПредыдущаяОперация; 
		ПСК_LX = СокрЛП(Формат(ЗалоговыйБилет.ПСК_LX, "ЧЦ=10; ЧДЦ=3; ЧН=0,00"));
		Плательщик = ДокументОплаты.Залогодатель; 
		ПричинаПримененияПроцентнойСхемы = ЛБ_УправлениеЛомбардом.ПолучитьПричинуПримененияПроцентнойСхемы(ДокументОплаты, ЗалоговыйБилет); 
		ЗаполнитьТовары();
		Если НЕ ДокументОплаты.БезналичнаяОплата Тогда
			ЗаполнитьКонтакнуюИнформацию();
			ДокументПлательщика = ДокументОплаты.ДокументЗалогодателя;
			ЗаполнитьИнформациюОДокументе();		
			ДопДокументы.Загрузить(ДокументОплаты.ДополнительныеДокументыПравоПребыванияРФ.Выгрузить()); 
			Если НЕ Плательщик = ЗалоговыйБилет.Залогодатель Тогда 
				Элементы.ГруппаДоверенность.Видимость = Истина; 
				ЗаполнитьСписокВыбораДоверенностейПлательщика();
				ДоверенностьПлательщика = ДокументОплаты.ДоверенностьПредставителя;
				ЗаполнитьТекстДоверенности();
			КонецЕсли;	
			ПроверитьОХПоПлательщику();
		КонецЕсли;	
		Выкуп = ДокументОплаты.Выкуп; 
		ВыдачаЗалога = ДокументОплаты.ВыдачаЗалога;
		СпособОплаты = 1; 
		СуммаОплаты = ДокументОплаты.СуммаОплаты;
		СуммаОплатыПроценты = ДокументОплаты.СуммаОплатыПроценты;
		СуммаОплатыСсуда = ДокументОплаты.СуммаОплатыСсуда; 		
		НакладнаяНаОтгрузку = ЛБ_УправлениеЛомбардом.ПолучитьНакладнуюНаОтгрузкуЗалогоговогоБилета(ДатаДок-1, ЗалоговыйБилет);
		БезналичнаяОплата = ДокументОплаты.БезналичнаяОплата; 
		Если БезналичнаяОплата Тогда
			РеестрПлатежей = ДокументОплаты.РеестрПлатежей; 
			СуммаПлатежа = ДокументОплаты.СуммаПлатежа;
			ДатаПлатежа = ДокументОплаты.ДатаПлатежа;
			ИдентификаторПлатежа = ДокументОплаты.ИдентификаторПлатежа;
			РаспределениеПереплаты = ДокументОплаты.РаспределениеПереплаты; 
			Если Выкуп Тогда 
				ОХ = Истина;
			КонецЕсли;	
		КонецЕсли;	
		ЗаполнитьСостояниеЗалоговогоБилета(); 
		ЗаполнитьСтрокуСостоянияПослеОплаты(Выкуп);	 
		//ЗаполнитьТовары(); 
				
		ИнформацияОплата(); 	
		//+Мельников 25.04.24 Отмена операции.
		ДокументОтмены = ПолучитьДокументОтмены(ДокументОплаты); //Было: ДокументОплаты.ДокументОтмены;
		//-Мельников     
		Если Параметры.ТолькоПросмотр = Истина Тогда	
			Этаформа.ТолькоПросмотр = Истина;
		КонецЕсли;
	ИначеЕсли Параметры.Свойство("ЗалоговыйБилет") Тогда
		ЗалоговыйБилет = Параметры.ЗалоговыйБилет; 
		Ломбард = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя(); 
		ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
		//Если НЕ ТекПользователь.ЭтоЛомбард Тогда
		//  	ОтветственныйПользователь = ТекПользователь;
		//Иначе
		//	ОтветственныйПользователь = ПараметрыСеанса.ТекущийСотрудник;
		//КонецЕсли;	
		ОтветственныйПользователь = ПараметрыСеанса.ТекущийПользователь; 
		ОтветственныйСотрудник = ПараметрыСеанса.ТекущийСотрудник;

		
		ДатаДок = ТекущаяДата();
		ПричинаПримененияПроцентнойСхемы = ЛБ_УправлениеЛомбардом.ПолучитьПричинуПримененияПроцентнойСхемы(, ЗалоговыйБилет, ДатаДок);
		ЗаполнитьТовары();
		СтатусЗБ = ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(ТекущаяДата(), ЗалоговыйБилет);
		//Если СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Оформлен ИЛИ СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Продлен Тогда
			Если Параметры.Свойство("Плательщик") Тогда
				Плательщик = Параметры.Плательщик;  
				Если Параметры.Свойство("ДокументПлательщика") Тогда 
					ДокументПлательщика = Параметры.ДокументПлательщика;
					Если ЗначениеЗаполнено(ДокументПлательщика) Тогда 
						ЗаполнитьИнформациюОДокументе();
					КонецЕсли;	
				КонецЕсли;	
            Иначе
			    Плательщик = ЗалоговыйБилет.Залогодатель;
				ДокументПлательщика = ЗалоговыйБилет.ДокументЗалогодателя;
			    ЗаполнитьИнформациюОДокументе(); 
			КонецЕсли;	
			ЗаполнитьКонтакнуюИнформацию();
			Если НЕ Плательщик = ЗалоговыйБилет.Залогодатель Тогда 
				Элементы.ГруппаДоверенность.Видимость = Истина; 
				ЗаполнитьСписокВыбораДоверенностейПлательщика();
				Если Параметры.Свойство("Доверенность") Тогда
					Для Сч = 0 По Элементы.Доверенность.СписокВыбора.Количество()-1 Цикл 
						Если Элементы.Доверенность.СписокВыбора.Получить(сч).Значение = Параметры.Доверенность Тогда
						    ДоверенностьПлательщика = Элементы.Доверенность.СписокВыбора.Получить(сч).Значение;
						    ЗаполнитьТекстДоверенности();
							Прервать;
						КонецЕсли;	
					КонецЦикла;  
				КонецЕсли;
			КонецЕсли;	    
			ЗаполнитьДопДокументы();
			НакладнаяНаОтгрузку = ЛБ_УправлениеЛомбардом.ПолучитьНакладнуюНаОтгрузкуЗалогоговогоБилета(ДатаДок, ЗалоговыйБилет);
			ЗаполнитьСостояниеЗалоговогоБилета();  
			ПроверитьОХПоПлательщику();
       		//ЗаполнитьТовары();  			
			СпособОплаты = 1; 			
		//Иначе 
		//	Сообщить("Статус выбранного залогового билета " + ?(СтатусЗБ = неопределено, "не определен", строка(СтатусЗБ)) + ". Оплата процентов невозможна!");//lion 
		//    Отказ = Истина;
		//КонецЕсли;	
	Иначе 
		Сообщить("Не выбран залоговый билет!"); 
		Отказ = Истина;
	КонецЕсли;     
	//ПроверитьПредельныйСрокЗайма();
	//УстановитьВидимость();
КонецПроцедуры  

&НаСервере
Функция ПолучитьСлужебныеСтатусыКлиента(Клиент)
	Возврат ЛБ_ОбщийМодуль.ПолучитьСлужебныеСтатусыКлиента(ДатаДок, Клиент);
КонецФункции	

&НаСервере
Функция ПроверитьСлужебныйСтатус(Статус)  
	Возврат ЛБ_ОбщийМодуль.ПроверитьСлужебныйСтатус(Статус, Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов);
КонецФункции
	
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СписокСС = ПолучитьСлужебныеСтатусыКлиента(ЭтаФорма.Плательщик);
	Если НЕ СписокСС.Количество() = 0 Тогда 
		ПредупреждениеП = "";
		Для каждого Элемент из СписокСС Цикл 
			СтруктураВозврата = ПроверитьСлужебныйСтатус(Элемент.Значение);
			Если СтруктураВозврата.Запрет Тогда 
				ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов");
				//+МАН 03.04.26 Изменено сообщение. Заявка 3759
				//Предупреждение("Для клиента " + СокрЛП(Плательщик) + " определен запрет на операцию " + Строка(ВидОперации), 60, "Проверка служебных статусов клиента");
				Предупреждение("Клиенту " + СокрЛП(Плательщик) + " присвоен служебный статус """ + Строка(Элемент.Значение) + """, в связи с чем запрещена операция: """ + Строка(ВидОперации) + """", 60, "Проверка служебных статусов клиента");
				//-МАН
				Отказ = Истина;
				Возврат;  
			Иначе
				ПредупреждениеП = СтруктураВозврата.Предупредить;
			КонецЕсли;	
		КонецЦикла;   
		Если НЕ ПустаяСтрока(ПредупреждениеП) Тогда
			Ответ = Вопрос(ПредупреждениеП + " Продолжить?", РежимДиалогаВопрос.ОКОтмена); 
			Если Ответ = КодВозвратаДиалога.Отмена Тогда  
				Отказ = Истина;
			    Возврат;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;   

	Если НеРедактировать Тогда  
		Элементы.Редактировать.Видимость = ?(Этаформа.ТолькоПросмотр, Ложь, Истина);  
		Элементы.Оплатить.Доступность = ложь;
		Элементы.Отмена.Заголовок = "Закрыть";
	КонецЕсли;
	Элементы.ОсновнаяПанель.ТолькоПросмотр = ?(БезналичнаяОплата, Истина, НеРедактировать);
	ПриСменеСтраницы(Элементы.ОсновнаяПанель.ТекущаяСтраница);  
	
	Если НЕ ДопДокументы.Количество() = 0 Тогда
		Элементы.ГруппаДопДокумент.Показать(); 
	КонецЕсли;	
	
	Отбор = новый Структура;
	Отбор.Вставить("КлючСтроки", 2); 
	СтрокиС = ТаблицаСостояний.НайтиСтроки(Отбор);  
	СтрС = СтрокиС.Получить(0);
	СтатусЗБ = СтрС.Статус;
	Если СтатусЗБ = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыЗалоговыхБилетов.Отгружен") Тогда  
		СпособОплаты = 4;                             
		Если (СтрС.СуммаПроцентовДолг + СтрС.СуммаЗайма) = 0 Тогда
			Элементы.ДекорацияОплаченПолностью.Видимость = Истина; 
			Элементы.ДекорацияОплаченПолностью.Заголовок = "Задолженность по договору займа полностью погашена в результате поступления денежных средств от реализации предмета (-ов) залога." +
			    Символы.ПС + "Залоговый билет необходимо перевести в статус «ОХ (готов к отправке)». Нажмите кнопку «Принять оплату»";
		КонецЕсли;	
		Элементы.СуммаОплаты.ТолькоПросмотр = Истина; 
		Если ЗначениеЗаполнено(ДокументОплаты) Тогда 
			Элементы.Редактировать.Видимость = ложь;
		Иначе	
		    ПолныйВыкуп();
		КонецЕсли;	
	Иначе	
		ЗаполнитьСостояниеТоваровПерезалог();
		ПроверитьПредельныйСрокЗайма();
		УстановитьВидимость();	
	КонецЕсли;	 
	
	Если ЗначениеЗаполнено(Плательщик) И НЕ ЗначениеЗаполнено(ДокументОплаты) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Залогодатель", Плательщик);	
			
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеПроверкиАктуальности",ЭтаФорма);
		ОткрытьФорму("ОбщаяФорма.ЛБ_ПроверкаАктуальностиДанныхКлиента", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
	КонецЕсли;   

КонецПроцедуры  

&НаКлиенте
Процедура ПослеПроверкиАктуальности(Результат, ДопПараметры) Экспорт
	Если Результат = Ложь тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Залогодатель", Плательщик);
		ПараметрыФормы.Вставить("Дата", ДатаДок);	 
		
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеИзмененияКарточки",ЭтаФорма);
		ОткрытьФорму("ОбщаяФорма.ЛБ_КарточкаЗалогодателя", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ПриПовторномОткрытии()  
	ЭтаФорма.ТолькоПросмотр = НеРедактировать; 
	Элементы.ДекорацияСтатусДокумента.Заголовок = "Проект"; 
	Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноЗеленый;
	Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.СветлоЗеленый;
	Элементы.Редактировать.Видимость = Ложь;  
	Элементы.Оплатить.Доступность = Истина;
	Элементы.Отмена.Заголовок = "Отмена";    
	Если Выкуп Тогда 
		ЗаполнитьТоварыПослеВыкупа(Ложь);
		ИнформацияОплата(); 		
	КонецЕсли;	
КонецПроцедуры    

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ЭтаФорма.Закрыть(?(ЗначениеЗаполнено(ДокументОплаты), ДокументОплаты, неопределено));
КонецПроцедуры

&НаСервере
Функция ПроверитьИзделияИзъяты()
	ВсеИзделияИзъяты = Истина;
	Для каждого стр Из ТаблицаТоваров Цикл
		Если НЕ Стр.СтатусОбъекта = Перечисления.ЛБ_СтатусыОбъектовЗалога.Изъят Тогда 
			ВсеИзделияИзъяты = Ложь;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	Возврат ВсеИзделияИзъяты; 
КонецФункции

&НаСервере
Процедура ПроверитьОХПоПлательщику()
	Если Плательщик = ЗалоговыйБилет.Залогодатель Тогда
		ОХ = Ложь
	ИначеЕсли ЗначениеЗаполнено(ДоверенностьПлательщика) Тогда
		ОХ = ложь;   
	ИначеЕсли ПроверитьИзделияИзъяты() Тогда
		ОХ = ложь;	
	Иначе                                                              
		ОХ = Истина;
	КонецЕсли;
КонецПроцедуры	
	
&НаСервере
Процедура УстановитьВидимость()
	Если Гражданство = Справочники.СтраныМира.Россия Тогда 
		Элементы.ГруппаДопДокумент.Видимость = Ложь;
	Иначе 
		Элементы.ГруппаДопДокумент.Видимость = Истина;
	КонецЕсли;	
	//+Мельников 25.04.24 Отмена операции
	ПроверкаПоследующихОпереаций = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(ЗалоговыйБилет.НомерЗалоговогоБилета, ТекущаяДата(),,Истина);
	ЛомбардПользователя = ЛБ_ОбщийМодуль.ПолучитьЛомбардПользователя(ПараметрыСеанса.ТекущийПользователь);

	Если ДокументОплаты.Проведен И НЕ ТекущаяДата() - ДатаДок >= 3600 И ЛомбардПользователя = ДокументОплаты.Ломбард И
		?(ЗначениеЗаполнено(ДокументОплаты), ?(ПроверкаПоследующихОпереаций = Неопределено, Истина, ?(ПроверкаПоследующихОпереаций.Регистратор = ДокументОплаты, Истина, Ложь)), Ложь) Тогда

		Элементы.ОтменитьОперацию.Доступность = Истина;
	Иначе
		Элементы.ОтменитьОперацию.Доступность = Ложь;
	КонецЕсли;

	//+МАН 17.06.25 Изменил
	//Если ЗначениеЗаполнено(ДокументОплаты.ДокументОтмены) Тогда
	Если ЗначениеЗаполнено(ДокументОтмены) Тогда
	//-МАН
		Элементы.ГруппаОтмена.Видимость = Истина;
		//+Мельников 28.05.24
		Элементы.Расчеты.Доступность = Ложь;
		Элементы.Редактировать.Доступность = Ложь;
		//-Мельников
	КонецЕсли;
	//-Мельников  
	Если БезналичнаяОплата Тогда 
		Элементы.ГруппаПлательщик.Видимость = Ложь; 
		Элементы.ГруппаДопДокумент.Видимость = Ложь;
		Элементы.Редактировать.Видимость = Ложь;
		Элементы.ГруппаБезНал.Видимость = Истина; 
		ИнформацияРеестр = "";    
		Если РаспределениеПереплаты Тогда
			ИнформацияРеестр = ИнформацияРеестр + "Уточнение переплаты: ";
		КонецЕсли;	
		Если ЗначениеЗаполнено(РеестрПлатежей) Тогда
			ИнформацияРеестр = ИнформацияРеестр + "Реестр платежей № " + СокрЛП(РеестрПлатежей.НомерРеестра);
			ВидПлатежа = ?(РеестрПлатежей.ВидОперации = Перечисления.ЛБ_ВидыБезналичныхПлатежей.РасчетыйСчет, " п/п ", " идентификатор ");   
		Иначе
			ВидПлатежа = " идентификатор ";
		КонецЕсли;	 
		Если ЗначениеЗаполнено(ИдентификаторПлатежа) Тогда
			ИнформацияРеестр = ИнформацияРеестр + ВидПлатежа + СокрЛП(ИдентификаторПлатежа);
		КонецЕсли;	
		Если ЗначениеЗаполнено(ДатаПлатежа) Тогда
			ИнформацияРеестр = ИнформацияРеестр + " от " + Формат(ДатаПлатежа, "ДЛФ=DT");
		КонецЕсли;	        
		Если НЕ СуммаПлатежа = 0 Тогда
			ИнформацияРеестр = ИнформацияРеестр + " сумма платежа " + СокрЛП(Формат(СуммаПлатежа, "ЧЦ=15; ЧДЦ=2")) + " руб."; 
			Если НЕ СуммаОплаты = СуммаПлатежа Тогда  
				ИнформацияРеестр = ИнформацияРеестр + " переплата " + СокрЛП(Формат(СуммаПлатежа-СуммаОплаты, "ЧЦ=15; ЧДЦ=2")) + " руб.";
			КонецЕсли;	
		КонецЕсли;	
		Элементы.ДекорацияРеестр.Заголовок = ИнформацияРеестр;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция СоздатьНовуюОплатуПроцентов()
	ДокументОбъект = Документы.ЛБ_ОперацияПоЗалогу.СоздатьДокумент(); 
	ДокументОбъект.ПредыдущаяОперация = ЗалоговыйБилет; 
	ДокументОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов;
	//ДокументОбъект.Дата = ?(ЗначениеЗаполнено(ДокументОплаты), ДатаДок-1, ДатаДок);
	ДокументОбъект.Дата = ДатаДок; 
	ДокументОбъект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить();
	ДокументОбъект.ПроцентнаяСхема = ЗалоговыйБилет.ПроцентнаяСхема;  
	ДокументОбъект.Выкуп = Выкуп;
	Возврат ДокументОбъект; 
КонецФункции

&НаСервере
Процедура ЗаполнитьДопДокументы()  
	Если НЕ ЗначениеЗаполнено(Гражданство) Или Гражданство = Справочники.СтраныМира.Россия тогда 
		ДопДокументы.Очистить();
	Иначе	
		ДопДокументы.Загрузить(ЛБ_УправлениеЛомбардом.ПолучитьДокументыПравоПребыванияРФ(ДатаДок, Плательщик, Гражданство));
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьТоварыПослеВыкупа(ВыводитьСообщение = Истина) 
	Отбор = новый Структура;
	Отбор.Вставить("КлючСтроки", 2); 
	СтрокиС = ТаблицаСостояний.НайтиСтроки(Отбор);  
	СтатусЗБ = СтрокиС.Получить(0).Статус;
	
	Запрос = новый Запрос;   
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
    Запрос.УстановитьПараметр("Дата", ДатаДок);	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_ОбъектыЗалогаОстатки.Ломбард КАК Ломбард,
	               |	СУММА(ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток) КАК Количество
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(&Дата, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_ОбъектыЗалогаОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога,
	               |	ЛБ_ОбъектыЗалогаОстатки.Ломбард";
	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
	
	Для каждого стр Из ТаблицаТоваров цикл  
		Если Стр.СтатусОбъекта = Перечисления.ЛБ_СтатусыОбъектовЗалога.Выкуплен тогда
			Стр.ПроверкаВернутьЗалог = Ложь;
			Стр.ВернутьЗалог = Ложь; 
			Продолжить;
		КонецЕсли;
		
		//+Мельников 05.07.24 Банкрот
		Банкрот = ПроверитьСтатусБанкрот(ЗалоговыйБилет);
		//-Мельников
		
		Если СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Отгружен Тогда 
			Стр.ПроверкаВернутьЗалог = ложь;
			Стр.ПроверкаВернутьЗалог = ложь;  
			Если НЕ Стр.СтатусОбъекта = Перечисления.ЛБ_СтатусыОбъектовЗалога.Реализован Тогда
			    Стр.СтатусПослеОплаты = Перечисления.ЛБ_СтатусыОбъектовЗалога.ГотовКОтправкеОХ;
			КонецЕсли;	
		Иначе
			Отбор = Новый структура;
			Отбор.Вставить("ОбъектЗалога", Стр.ОбъектЗалога);
			Отбор.Вставить("Ломбард", Ломбард);
			Строки = ТаблицаОстатков.НайтиСтроки(Отбор);
			Если НЕ Строки.Количество() = 0 тогда  
				Если Стр.СтатусОбъекта = Перечисления.ЛБ_СтатусыОбъектовЗалога.Изъят Тогда 
					Стр.ПроверкаВернутьЗалог = Ложь;
					Стр.ВернутьЗалог = Ложь;    
					Стр.СтатусПослеОплаты = Перечисления.ЛБ_СтатусыОбъектовЗалога.Изъят;
				ИначеЕсли ОХ = Истина тогда 
					Стр.ПроверкаВернутьЗалог = Ложь;
					Стр.ВернутьЗалог = Ложь;
					Стр.СтатусПослеОплаты = ?(Стр.СтатусОбъекта = Перечисления.ЛБ_СтатусыОбъектовЗалога.Наследство, Перечисления.ЛБ_СтатусыОбъектовЗалога.Наследство, Перечисления.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение);
	            //+Мельников 05.07.24 Банкрот
				ИначеЕсли Банкрот Тогда
					Стр.ПроверкаВернутьЗалог = Ложь;
					Стр.ВернутьЗалог = Ложь;    
					Стр.СтатусПослеОплаты = Перечисления.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение;
				//-Мельников
				Иначе	
					Стр.ПроверкаВернутьЗалог = Истина;
					Стр.ВернутьЗалог = Истина;
					Стр.СтатусПослеОплаты = Перечисления.ЛБ_СтатусыОбъектовЗалога.Выкуплен;
				КонецЕсли;	
			Иначе             
				Если НЕ ОХ И ВыводитьСообщение Тогда
					Отбор.Удалить("Ломбард");
					Строки = ТаблицаОстатков.НайтиСтроки(Отбор);
					Если НЕ Строки.Количество() = 0 тогда 
						Сообщить("Объект залога " + сокрЛП(стр.ОбъектЗалога) + " находится в " + СокрЛП(Строки.Получить(0).Ломбард));
					ИначеЕсли НЕ Стр.СтатусОбъекта = Перечисления.ЛБ_СтатусыОбъектовЗалога.Изъят Тогда	
					    Сообщить("Местонахождение объекта залога " + сокрЛП(стр.ОбъектЗалога) + " не определено", СтатусСообщения.Важное); 	
					КонецЕсли; 
				КонецЕсли;	
				Стр.ПроверкаВернутьЗалог = ложь;
				Стр.ПроверкаВернутьЗалог = ложь;  
				Стр.СтатусПослеОплаты = ?(Стр.СтатусОбъекта = Перечисления.ЛБ_СтатусыОбъектовЗалога.Изъят ИЛИ Стр.СтатусОбъекта = Перечисления.ЛБ_СтатусыОбъектовЗалога.Наследство, Стр.СтатусОбъекта, Перечисления.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение);
			КонецЕсли;
		КонецЕсли;	
	Конеццикла;	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьТовары() 
	Запрос = новый Запрос;   
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
	Если ЗначениеЗаполнено(ДокументОплаты) И ДокументОплаты.Проведен Тогда 
		ДатаПроверки = ДатаДок-1; 
	Иначе	
	    ДатаПроверки = ДатаДок;
	КонецЕсли;	   
	Запрос.УстановитьПараметр("Дата", ДатаПроверки);

	//+Мельников 25.04.24 Закомментировал
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.ОбъектЗалога КАК ОбъектЗалога,
	               |	СУММА(ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.СуммаРасход) КАК СуммаОплаты
	               |ИЗ
	               |	РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Обороты(, &Дата, , ) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты
	               |ГДЕ
	               |	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.ЗалоговыйБилет = &ЗалоговыйБилет
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.ОбъектЗалога";
	
	//+Мельников 25.04.24 Отмена операции. Убрал старый запрос т.к. он не учитывал суммы по отмененным операциям.
	//Запрос.Текст = "ВЫБРАТЬ
	//				|	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.ОбъектЗалога КАК ОбъектЗалога,
	//				|	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.СуммаОборот КАК СуммаОборот,
	//				|	СУММА(ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.СуммаРасход) КАК СуммаОплаты
	//				|ИЗ
	//				|	РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Обороты(, &Дата, , ) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты
	//				|ГДЕ
	//				|	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.ЗалоговыйБилет = &ЗалоговыйБилет
	//				|
	//				|СГРУППИРОВАТЬ ПО
	//				|	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.ОбъектЗалога,
	//				|	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.СуммаОборот,
	//				|	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.СуммаРасход";
	//-Мельников
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_ОбъектыЗалогаОстатки.Ломбард КАК Ломбард,
	               |	СУММА(ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток) КАК Количество
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(&Дата, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_ОбъектыЗалогаОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога,
	               |	ЛБ_ОбъектыЗалогаОстатки.Ломбард";
	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
	
	ТаблицаТоваров.Очистить();  
	Ном = 0;
	Для каждого стр Из ЗалоговыйБилет.Товары цикл  
		Если ЗалоговыйБилет.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда 
			Если НЕ Стр.Переоформить тогда
				Продолжить;
			КонецЕсли;	
		КонецЕсли;	      
		Ном = Ном + 1;
		НоваяСтр = ТаблицаТоваров.Добавить(); 
		НоваяСтр.Номерстроки = Стр.Номерстроки;
		НоваяСтр.Артикул = ЛБ_УправлениеЛомбардом.АртикулОбъектаЗалога(ЗалоговыйБилет, Ном);
		НоваяСтр.ОбъектЗалога = стр.ОбъектЗалога;
		НоваяСтр.СтатусОбъекта = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектаЗалога(ДатаПроверки, НоваяСтр.ОбъектЗалога, ЗалоговыйБилет);  
		//Если ЗначениеЗаполнено(НакладнаяНаОтгрузку) Тогда 
		//	Отбор = Новый структура;
		//	Отбор.Вставить("КлючСтроки", 2);
		//	Строки = ТаблицаСостояний.НайтиСтроки(Отбор);  
		//	СтрНач = Строки.Получить(0);  
		//	СуммаПроцентовНач = СтрНач.СуммаПроцентовДолг;  
		//    ПроцентДляИсключенияИзНакладной = ?(СуммаПроцентовНач = 0, 0, СуммаОплаты/СуммаПроцентовНач);
		//	Если ПроцентДляИсключенияИзНакладной >= 0.9 Тогда 
		//		НоваяСтр.СтатусПослеОплаты = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектаЗалога(НакладнаяНаОтгрузку.Дата-1, НоваяСтр.ОбъектЗалога, ЗалоговыйБилет);
		//	Иначе   
		//		НоваяСтр.СтатусПослеОплаты = НоваяСтр.СтатусОбъекта;
		//	КонецЕсли;	
		//Иначе	
		//     НоваяСтр.СтатусПослеОплаты = НоваяСтр.СтатусОбъекта;
		//КонецЕсли;
		НоваяСтр.СтатусПослеОплаты = НоваяСтр.СтатусОбъекта; 
		НоваяСтр.СуммаОценки = стр.СуммаСсуды;  
		Отбор = Новый структура;
		Отбор.Вставить("ОбъектЗалога", НоваяСтр.ОбъектЗалога);
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
		Если НЕ строки.Количество() = 0 тогда			
			НоваяСтр.СуммаОплатыНач = Строки.Получить(0).СуммаОплаты; 
			Если НоваяСтр.СуммаОплатыНач < 0 Тогда 
				НоваяСтр.СуммаОценки = НоваяСтр.СуммаОценки - НоваяСтр.СуммаОплатыНач;
				НоваяСтр.СуммаОплатыНач = 0;
			КонецЕсли;	
		КонецЕсли;	 
		Если ЗначениеЗаполнено(ДокументОплаты) Тогда
			Строки = ДокументОплаты.Товары.НайтиСтроки(Отбор);
			Если НЕ строки.Количество() = 0 тогда			
				НоваяСтр.СуммаОплаты = Строки.Получить(0).СуммаОплаты;
			КонецЕсли;	 
		КонецЕсли;	   
		Если Выкуп Тогда   
			ЗаполнитьТоварыПослеВыкупа(Ложь); 
			//ИнформацияОплата();
		КонецЕсли;
		НоваяСтр.ЗадолженностьНач = НоваяСтр.СуммаОценки - НоваяСтр.СуммаОплатыНач; 
		НоваяСтр.ЗадолженностьКон = НоваяСтр.ЗадолженностьНач - НоваяСтр.СуммаОплаты;
	Конеццикла;	
	
	ТоварыИтогОценка = ТаблицаТоваров.Итог("СуммаОценки");
	ТоварыИтогОплатаНач = ТаблицаТоваров.Итог("СуммаОплатыНач");
	ТоварыИтогДолгНач = ТаблицаТоваров.Итог("ЗадолженностьНач");
	ТоварыИтогОплатаКон = ТаблицаТоваров.Итог("СуммаОплаты");
	ТоварыИтогДолгКон = ТаблицаТоваров.Итог("Задолженностькон");
КонецПроцедуры	

&НаСервере
Функция РасчитатьДолгПоПроцентам(СтатусЗБ, СуммаЗайма, ПроцентнаяСтавка, ДатаНачалаРасчета) 
	ТаблицаОплатДетально.Очистить();
	Если ЗначениеЗаполнено(ДокументОплаты) И ДокументОплаты.Проведен Тогда 
		ДокументОбъект = ДокументОплаты.ПолучитьОбъект();
	Иначе	      
		ДокументОбъект = СоздатьНовуюОплатуПроцентов(); 	    
	КонецЕсли;	     
	
	НачисленияОстановлены = Ложь;
	ДатаСмертиКлиента = ЛБ_ОбщийМодуль.ПроверитьЕстьДатаСмерти(ЗалоговыйБилет.Залогодатель, ДатаДок);   
	Если НЕ ДатаСмертиКлиента = неопределено Тогда   
		ПредыдущийСтатусЗБ = ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(ДатаСмертиКлиента-1, ЗалоговыйБилет); 
		Если ПредыдущийСтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят ИЛИ 
		     ПредыдущийСтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен ИЛИ
		     ПредыдущийСтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Остановлен Тогда 
			НачисленияОстановлены = Истина; 
		КонецЕсли; 
	КонецЕсли;

	Если НачисленияОстановлены ИЛИ
		 СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят ИЛИ 
		 СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен ИЛИ
		 СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Остановлен Тогда
		СуммаПроцентов = ЛБ_ОбщийМодуль.ПолучитьОстатокПроцентов(ДокументОбъект, ДокументОбъект.ПредыдущаяОперация);
		
		Если НЕ СуммаПроцентов = 0 Тогда
			СтрП = ТаблицаОплатДетально.Добавить();   
			СтрП.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Базовая; 
			СтрП.ДатаНач = ДатаНачалаРасчета;
			СтрП.ДатаКон = ДокументОбъект.Дата;
			СтрП.ДеньНач = 1;  
			СтрП.ДеньКон = (НачалоДня(СтрП.ДатаКон) - НачалоДня(СтрП.ДатаНач)) / (60 * 60 * 24) + 1; 
			СтрП.СуммаПроцентов = СуммаПроцентов;
			//СтрП.СуммаПроцентовДень = СуммаПроцентов/СтрП.ДеньКон; 
			//СтрП.ПроцентнаяСтавкаБазовая = СтрП.СуммаПроцентовДень/СтрП.СуммаПроцентов*100;
		КонецЕсли;
		
		Возврат СуммаПроцентов;
	КонецЕсли;		
	СтруктураП = ЛБ_УправлениеЛомбардом.ПолучитьПредельныеЗначенияПроцентов(ЗалоговыйБилет.Дата, ЗалоговыйБилет.Организация);
	Если НЕ СтруктураП = неопределено Тогда
	    ПланкаПроцентов = СтруктураП.ПланкаПроцентов;
		ПредельноеЗначениеПроцентов = ЗалоговыйБилет.СуммаСсуды*СтруктураП.ПланкаПроцентов; 
	Иначе
		ПредельноеЗначениеПроцентов = 0;
	КонецЕсли;   
	СтруктураОкр = ЛБ_УправлениеЛомбардом.ПолучитьУсловияОкругленияПроцентов(ЗалоговыйБилет);
	Установки = ЛБ_УправлениеЛомбардом.ПолучитьУсловияПоДоговору(ЗалоговыйБилет); 	
	Результат = ЛБ_ОбщийМодуль.РассчитатьСуммуПроцентовОплата(ДокументОбъект, ДатаНачалаРасчета, ПредельноеЗначениеПроцентов, ПричинаПримененияПроцентнойСхемы, Установки, СтруктураОкр); 
	Если Результат.ПредельноеЗначениеПоДоговору Тогда     
		Если НЕ ДостигнутПределПроценты Тогда    
			ДостигнутПределПроценты = Истина;
	        Сообщить("Достигнуто предельное значение суммы процентов по договору.", Статуссообщения.Информация);
		КонецЕсли;	   
	ИначеЕсли ДостигнутПределПроценты Тогда
		ДостигнутПределПроценты = ложь;
	КонецЕсли; 
		
	Для каждого стр из ДокументОбъект.НачислениеПроцентовДетально Цикл 
	    НоваяСтр = ТаблицаОплатДетально.Добавить(); 
		ЗаполнитьЗначенияСвойств(НоваяСтр, стр);
	КонецЦиклА;
	
	НачисленоПроцентов = Результат.СуммаПроцентовНачислено;
	
	Возврат Результат.СуммаПроцентов;
КонецФункции
	

&НаСервере
Процедура ЗаполнитьСостояниеЗалоговогоБилета() 
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
	//Если ЗначениеЗаполнено(ДокументОплаты) Тогда
	//	Запрос.УстановитьПараметр("Период", ?(ДокументОплаты.Проведен, ДатаДок-1, ДатаДок)); 
	//Иначе	
	    Запрос.УстановитьПараметр("Период", ДатаДок);  		
	//КонецЕсли;	                                       
		
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилета.Регистратор КАК Регистратор,
	               |	ЛБ_СостояниеЗалоговогоБилета.СуммаЗайма КАК СуммаЗайма,
	               |	ЛБ_СостояниеЗалоговогоБилета.ДатаВыкупа КАК ДатаВыкупа,
	               |	ЛБ_СостояниеЗалоговогоБилета.ДатаВыкупаЛьготныйСрок КАК ДатаВыкупаЛьготныйСрок,
	               |	ЛБ_СостояниеЗалоговогоБилета.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета,
	               |	ЛБ_СостояниеЗалоговогоБилета.ДатаНачалаРасчетаПроцентов КАК ДатаНачалаРасчетаПроцентов,
	               |	ЛБ_СостояниеЗалоговогоБилета.СуммаПроцентовДень КАК СуммаПроцентовДень,
	               |	ЛБ_СостояниеЗалоговогоБилета.СуммаПроцентовСрок КАК СуммаПроцентовСрок,
	               |	ЛБ_СостояниеЗалоговогоБилета.ПредельныйСрокЗайма КАК ПредельныйСрокЗайма,
	               |	ЛБ_СостояниеЗалоговогоБилета.ПредельныйСрокЗаймаДни КАК ПредельныйСрокЗаймаДни,
	               |	ЛБ_СостояниеЗалоговогоБилета.НомерДопСоглашения КАК НомерДопСоглашения,
	               |	ЛБ_СостояниеЗалоговогоБилета.ПричинаПрименения КАК ПричинаПрименения
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета КАК ЛБ_СостояниеЗалоговогоБилета
	               |ГДЕ
	               |	ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет = &ЗалоговыйБилет
	               |	И ЛБ_СостояниеЗалоговогоБилета.Период < &Период
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_СостояниеЗалоговогоБилета.Период";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	ТаблицаСостояний.Очистить();
	Если ТаблицаЗапроса.Количество() > 0 Тогда
		СтрСостояние = ТаблицаЗапроса.Получить(0);
		НоваяСтр = ТаблицаСостояний.Добавить();
		НоваяСтр.Состояние = "Начальные условия займа";
		НоваяСтр.КлючСтроки = 1;
		НоваяСтр.Статус = СтрСостояние.СтатусЗалоговогоБилета;
		НоваяСтр.СуммаЗайма = СтрСостояние.СуммаЗайма;
		НоваяСтр.ДатаВозврата = СтрСостояние.ДатаВыкупа;
		НоваяСтр.ДатаВозвратаЛьготная = СтрСостояние.ДатаВыкупаЛьготныйСрок; 
		НоваяСтр.ДатаНачалаРасчета = СтрСостояние.ДатаНачалаРасчетаПроцентов;
		НоваяСтр.ПроцентнаяСтавка = ЗалоговыйБилет.ПроцентнаяСхема;
		НоваяСтр.СуммаПроцентовДень = СтрСостояние.СуммаПроцентовДень;
		НоваяСтр.СуммаПроцентовСрок = СтрСостояние.СуммаПроцентовСрок;
		НоваяСтр.ПредельныйСрокЗайма = СтрСостояние.ПредельныйСрокЗайма;
		НоваяСтр.ПредельныйСрокЗаймаДни = СтрСостояние.ПредельныйСрокЗаймаДни;  
				
		КолСтр = ТаблицаЗапроса.Количество()-1;  		
		СтрСостояние = ТаблицаЗапроса.Получить(КолСтр);   
		Если ТипЗнч(СтрСостояние.Регистратор) = Тип("ДокументСсылка.ЛБ_КарточкаЗалогодателя") Тогда
			ТекущийСтатусЗБ = СтрСостояние.СтатусЗалоговогоБилета; 
			СтрСостояние = ТаблицаЗапроса.Получить(КолСтр-1); 
		Иначе
			ТекущийСтатусЗБ = неопределено;
		КонецЕсли;	
		НоваяСтр = ТаблицаСостояний.Добавить();
		НоваяСтр.Состояние = "Состояние залогового билета до уплаты процентов";
		НоваяСтр.КлючСтроки = 2;
		НоваяСтр.Статус = ?(ТекущийСтатусЗБ = неопределено, СтрСостояние.СтатусЗалоговогоБилета, ТекущийСтатусЗБ); 
		НоваяСтр.СуммаЗайма = СтрСостояние.СуммаЗайма;
		НоваяСтр.ДатаВозврата = СтрСостояние.ДатаВыкупа;
		НоваяСтр.ДатаВозвратаЛьготная = СтрСостояние.ДатаВыкупаЛьготныйСрок; 
		НоваяСтр.ДатаНачалаРасчета = СтрСостояние.ДатаНачалаРасчетаПроцентов;  
		Если НЕ НоваяСтр.Статус = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят И 
			 НЕ НоваяСтр.Статус = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен И 
			 НЕ НоваяСтр.Статус = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Остановлен тогда
			//НоваяСтр.ПроцентнаяСтавка = ЗалоговыйБилет.ПроцентнаяСхема;  
			НоваяСтр.ПроцентнаяСтавка = ЛБ_ОбщийМодуль.ПолучитьПроцентнуюСхемуЗБ(ЗалоговыйБилет, СтрСостояние.ПричинаПрименения);
			НоваяСтр.СуммаПроцентовДень = СтрСостояние.СуммаПроцентовДень;  
		    НоваяСтр.СуммаПроцентовДолг = РасчитатьДолгПоПроцентам(НоваяСтр.Статус, НоваяСтр.СуммаЗайма, НоваяСтр.ПроцентнаяСтавка, НоваяСтр.ДатаНачалаРасчета);
			СуммаОплатыДляПродленияДоговора = окр(НоваяСтр.СуммаПроцентовДолг*90/100, 2);
		Иначе              
			Если ЗначениеЗаполнено(ДокументОплаты) И ДокументОплаты.Проведен Тогда 
				ДокументОбъект = ДокументОплаты.ПолучитьОбъект();
			Иначе	      
				ДокументОбъект = СоздатьНовуюОплатуПроцентов(); 	    
			КонецЕсли;	   
			НоваяСтр.СуммаПроцентовДолг = ЛБ_Общиймодуль.ПолучитьОстатокПроцентов(ДокументОбъект, ЗалоговыйБилет);				
		КонецЕсли;	 
		НоваяСтр.НомерДС = СтрСостояние.НомерДопСоглашения;
			  
		БезПродленияДоговора = ложь;
		СтатусЗалоговогоБилетаНач = ?(ТекущийСтатусЗБ = неопределено, СтрСостояние.СтатусЗалоговогоБилета, ТекущийСтатусЗБ);
		Если СтатусЗалоговогоБилетаНач = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят ИЛИ 
			 СтатусЗалоговогоБилетаНач = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен ИЛИ
			 СтатусЗалоговогоБилетаНач = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Остановлен ИЛИ 
			 СтатусЗалоговогоБилетаНач = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Наследство тогда  
			БезПродленияДоговора = Истина;
		Иначе	
		    БезПродленияДоговора = ЗалоговыйБилет.СхемаКредитования.БезПродленияДоговора;
		КонецЕсли;   
	Иначе
		НоваяСтр = ТаблицаСостояний.Добавить();
		НоваяСтр.Состояние = "Начальные условия займа";
		НоваяСтр.КлючСтроки = 1;
		
		НоваяСтр = ТаблицаСостояний.Добавить();
		НоваяСтр.Состояние = "Состояние залогового билета до уплаты процентов";
		НоваяСтр.КлючСтроки = 2;     
		
		БезПродленияДоговора = ложь;
	КонецЕсли;	
	БилетИзъят = ?(НоваяСтр.Статус = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят или НоваяСтр.Статус = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен, Истина, Ложь); 
	БилетОтгружен = ?(НоваяСтр.Статус = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Отгружен, Истина, Ложь);

	НоваяСтр = ТаблицаСостояний.Добавить();
	НоваяСтр.Состояние = "Состояние залогового билета после уплаты процентов";
	НоваяСтр.КлючСтроки = 3;  
	
	Отбор = новый Структура;
	Отбор.Вставить("КлючСтроки", 1); 
	СтрокиС = ТаблицаСостояний.НайтиСтроки(Отбор);  
	ПСЗ = СтрокиС.Получить(0).ПредельныйСрокЗайма;
	Если НЕ ПСЗ = Дата(1,1,1) Тогда
	    ДостигнутПСЗ = ?(ДатаДок < ПСЗ, Ложь, Истина);
	Иначе
		ДостигнутПСЗ = Ложь;
	КонецЕсли;	  
	Если БилетОтгружен Тогда
		Элементы.ГруппаПредельныйсрокЗайма.Видимость = Истина;  
		Элементы.СпособОплаты.Видимость = Ложь; 
		Элементы.СпособОплатыБезПродления.Видимость = Ложь;
        Элементы.ГруппаДекорацииПС.Видимость = ложь;
		Элементы.ГруппаОплатаОтгружен.Видимость = Истина; 
	Иначе	
		Если НЕ ДостигнутПСЗ Тогда
			Если БезПродленияДоговора Тогда 
				Элементы.СпособОплаты.Видимость = Ложь; 
				Элементы.СпособОплатыБезПродления.Видимость = Истина;
			Иначе	
				Элементы.СпособОплаты.Видимость = Истина; 
				Элементы.СпособОплатыБезПродления.Видимость = Ложь;		 
			КонецЕсли;   
		ИначеЕсли БезналичнаяОплата Тогда  
			Если БезПродленияДоговора Тогда 
				Элементы.СпособОплаты.Видимость = Ложь; 
				Элементы.СпособОплатыБезПродления.Видимость = Истина;
			Иначе	
				Элементы.СпособОплаты.Видимость = Истина; 
				Элементы.СпособОплатыБезПродления.Видимость = Ложь;		 
			КонецЕсли;     
			Элементы.ГруппаБезналичнаяОплата.Видимость = Истина; 
		Иначе
			Элементы.ГруппаПредельныйсрокЗайма.Видимость = Истина;  
			Элементы.СпособОплаты.Видимость = Ложь; 
			Элементы.СпособОплатыБезПродления.Видимость = Ложь;

			Если (НЕ (Плательщик = ЗалоговыйБилет.Залогодатель) И НЕ ЗначениеЗаполнено(ДоверенностьПлательщика)) ИЛИ БилетИзъят Тогда
			    Элементы.ДекорацияПредельныйСрокДоп.Заголовок = "Возможен только полный выкуп.";
			Иначе
				Элементы.ДекорацияПредельныйСрокДоп.Заголовок = "Возможен только полный выкуп или переоформление." + 
				  ?(ЭтаФорма.НеРедактировать, "", " Нажмите кнопку ""Принять оплату"" и выберите необходимое действие.");
			КонецЕсли;	  
		КонецЕсли;   
	КонецЕсли;	
КонецПроцедуры  

&НаСервере
Процедура УстановитьИнформациюВыкуп()
	Если ДостигнутПредельныйСрокЗайма И НЕ БезналичнаяОплата Тогда
		Если (НЕ (Плательщик = ЗалоговыйБилет.Залогодатель) И НЕ ЗначениеЗаполнено(ДоверенностьПлательщика)) ИЛИ БилетИзъят Тогда
		    Элементы.ДекорацияПредельныйСрокДоп.Заголовок = "Возможен только полный выкуп.";
		Иначе
			Элементы.ДекорацияПредельныйСрокДоп.Заголовок = "Возможен только полный выкуп или переоформление." + 
			  ?(ЭтаФорма.НеРедактировать, "", " Нажмите кнопку ""Принять оплату"" и выберите необходимое действие.");
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПроверитьПредельныйСрокЗайма() 
	Отбор = Новый структура;
	Отбор.Вставить("КлючСтроки", 1);
	СтрокиС = ТаблицаСостояний.НайтиСтроки(Отбор);  
	Если НЕ СтрокиС.Количество() = 0 Тогда  
		СтрСостояние = СтрокиС.Получить(0); 
		ПредельныйСрокЗайма = СтрСостояние.ПредельныйСрокЗайма;
		Если НЕ ПредельныйСрокЗайма = Дата(1,1,1) тогда
			Если ПредельныйСрокЗайма > НачалоДня(ДатаДок) Тогда
				ДостигнутПредельныйСрокЗайма = Ложь;	
			Иначе  
				ДостигнутПредельныйСрокЗайма = Истина;
				Если НЕ БезналичнаяОплата Тогда
					СпособОплаты = 4;
					ПолныйВыкуп(); 
				КонецЕсли;	
				//ЗаполнитьВернутьЗалог();
			КонецЕсли; 
		КонецЕсли;	
	КонецЕсли;	 
КонецПроцедуры		
		

&НаСервере
Процедура ЗаполнитьКонтакнуюИнформацию()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("Залогодатель", Плательщик);
    Запрос.Текст = "ВЫБРАТЬ
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРождения КАК МестоРождения,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Email КАК Email,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПрописке КАК АдресПоПрописке,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ФактическийАдрес КАК ФактическийАдрес,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Пол КАК Пол,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК Телефон,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество
                   |ИЗ
                   |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		КонтактнаяИнформация = "";
		КонтактнаяИнформация = КонтактнаяИнформация + ?(ЗначениеЗаполнено(Выборка.Гражданство), СокрЛП(Выборка.Гражданство), "");
		КонтактнаяИнформация = КонтактнаяИнформация + ?(ЗначениеЗаполнено(Выборка.Пол), ?(ПустаяСтрока(КонтактнаяИнформация), "", "; ") + "пол.: " + Строка(Выборка.Пол), "");
		КонтактнаяИнформация = КонтактнаяИнформация + ?(ЗначениеЗаполнено(Выборка.ДатаРождения), ?(ПустаяСтрока(КонтактнаяИнформация), "", "; ") + "дата рожд.: " +  Формат(Выборка.ДатаРождения, "ДФ=dd.MM.yyyy"), "");
		КонтактнаяИнформация = КонтактнаяИнформация + ?(ЗначениеЗаполнено(Выборка.МестоРождения), ?(ПустаяСтрока(КонтактнаяИнформация), "", "; ") + "место рожд.: " +  СокрЛП(Выборка.МестоРождения), "");
		КонтактнаяИнформация = КонтактнаяИнформация + ?(ЗначениеЗаполнено(Выборка.Телефон), ?(ПустаяСтрока(КонтактнаяИнформация), "", "; ") + "тел.: " + СокрЛП(Выборка.Телефон), "");
		КонтактнаяИнформация = КонтактнаяИнформация + ?(ЗначениеЗаполнено(Выборка.Email), ?(ПустаяСтрока(КонтактнаяИнформация), "", "; ") + "email: " + СокрЛП(Выборка.Email), "");  
		Если ЗначениеЗаполнено(Выборка.АдресПоПрописке) Тогда
			АдресК = "адрес по прописке: " + СокрЛП(Выборка.АдресПоПрописке);
		Иначе  
			АдресК = "фактический адрес: " + СокрЛП(Выборка.ФактическийАдрес);
		КонецЕсли;	
		КонтактнаяИнформация = КонтактнаяИнформация +  ?(ПустаяСтрока(КонтактнаяИнформация), "", "; ") + АдресК;

		ФИО = СокрЛП(Выборка.Фамилия) + " " + СокрЛП(Выборка.Имя) + ?(НЕ ПустаяСтрока(Выборка.Отчество), " " + СокрЛП(Выборка.Отчество), "");
		Гражданство = Выборка.Гражданство; 
		ДатаРождения = Выборка.ДатаРождения;   
	Иначе
		КонтактнаяИнформация = "";
        ФИО = "";
		Гражданство = справочники.СтраныМира.ПустаяСсылка(); 
		ДатаРождения = Дата(1,1,1); 
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьИнформациюОДокументе()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("ДокументЗалогодателя", ДокументПлательщика);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНачалоДействия КАК ДокументНачалоДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&Дата, ДокументЗалогодателя = &ДокументЗалогодателя) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Информация = "";
		Информация = СокрЛП(Выборка.ВидДокумента);
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументСерия), " " + СокрЛП(Выборка.ДокументСерия), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументНомер), " " + СокрЛП(Выборка.ДокументНомер), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументКемВыдан), " выдан " + СокрЛП(Выборка.ДокументКемВыдан), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументДатаВыдачи), " " + Формат(Выборка.ДокументДатаВыдачи,"ДФ=dd.MM.yyyy"), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументКодПодразделения), " код подр. " + СокрЛП(Выборка.ДокументКодПодразделения), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументНачалоДействия), " действует с " + Формат(Выборка.ДокументНачалоДействия,"ДФ=dd.MM.yyyy"), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументСрокДействия), " по " + Формат(Выборка.ДокументСрокДействия,"ДФ=dd.MM.yyyy"), "");
		Паспорт = Информация;  
	Иначе
		Паспорт = "";
   	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПроверитьНачалоДействияДокумента()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("Владелец", Плательщик); 
	Запрос.Текст ="ВЫБРАТЬ
	              |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя КАК ДокументЗалогодателя
	              |ИЗ
	              |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(
	              |			&Дата,
	              |			ДокументЗалогодателя.Владелец = &Владелец
	              |				И ВидДокументаЗалогодателя = Значение(Перечисление.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность)) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";

КонецФункции	

&НаКлиенте
Процедура КарточкаПлательщика(Команда)
	СтандартнаяОбработка = ложь;
	Если ЗначениеЗаполнено(плательщик) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Залогодатель", Плательщик);
		ПараметрыФормы.Вставить("Дата", ДатаДок);	
		ПараметрыФормы.Вставить("ТолькоПросмотр", истина);
		//ПараметрыФормы.Вставить("НеРедактировать", истина); 
		
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеИзмененияКарточки",ЭтаФорма);
		ОткрытьФорму("ОбщаяФорма.ЛБ_КарточкаЗалогодателя", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Сообщить("Не выбран плательщик!");
	КонецЕсли;	
КонецПроцедуры 

&НаСервере
Функция ПолучитьДокументПлательщика() 
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("Залогодатель", Плательщик);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя КАК ДокументЗалогодателя
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(
	               |			&Дата,
	               |			ДокументЗалогодателя.Владелец = &Залогодатель
	               |				И ОсновнойДУЛ = ИСТИНА) КАК ЛБ_ДокументыЗалогодателейСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Период УБЫВ"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДокументЗалогодателя;
	КонецЕсли; 
	Возврат ДокументПлательщика;
КонецФункции


&НаКлиенте
Процедура ПослеИзмененияКарточки(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;   
	
	Если ЭтаФорма.НеРедактировать тогда
		Возврат;
	КонецЕсли;	
	
	//Если НЕ ЗначениеЗаполнено(ДокументОплаты) И НачалоДня(ДатаДок) = НачалоДня(ТекущаяДата()) Тогда 
	ДатаСеанса = ОбщегоНазначенияКлиент.ДатаСеанса();
	Если НачалоДня(ДатаДок) = НачалоДня(ДатаСеанса) Тогда
		ДатаДок = ДатаСеанса;
	КонецЕсли;	
    ЗаполнитьКонтакнуюИнформацию(); 
	НовыйДокументПлательщика = ПолучитьДокументПлательщика();
	Если НЕ ДокументПлательщика = НовыйДокументПлательщика Тогда
		ДокументПлательщика = НовыйДокументПлательщика;
		ЗаполнитьИнформациюОДокументе();
	    ЗаполнитьДопДокументы();	
	КонецЕсли;	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьИнформациюОплательщике() 
	ЗаполнитьКонтакнуюИнформацию(); 
	ЗаполнитьИнформациюОДокументе();	  
	ЗаполнитьДопДокументы(); 
	Если НЕ Плательщик = ЗалоговыйБилет.Залогодатель Тогда 
		ЗаполнитьСписокВыбораДоверенностейПлательщика();  
		Если НЕ Элементы.Доверенность.СписокВыбора.Количество() = 0 Тогда
			Если НЕ ДоверенностьПлательщика = Элементы.Доверенность.СписокВыбора.Получить(0).Значение Тогда
			    ДоверенностьПлательщика = Элементы.Доверенность.СписокВыбора.Получить(0).Значение;
				ЗаполнитьТекстДоверенности();
			КонецЕсли; 
		Иначе    
			ДоверенностьПлательщика = ПредопределенноеЗначение("Документ.ЛБ_Доверенности.ПустаяСсылка");
			Доверенность = "";
		КонецЕсли;	
	КонецЕсли;	    
КонецПроцедуры	

&НаСервере 
Функция ПолучитьПричинуПримененияПроцентнойСхемы()
	Возврат ЛБ_УправлениеЛомбардом.ПолучитьПричинуПримененияПроцентнойСхемы(, ЗалоговыйБилет, ДатаДок); 
КонецФункции

&НаСервере 
Функция ПолучитьНакладнуюНаОтгрузку()
	Возврат ЛБ_УправлениеЛомбардом.ПолучитьНакладнуюНаОтгрузкуЗалогоговогоБилета(ДатаДок, ЗалоговыйБилет);
КонецФункции


&НаКлиенте
Процедура ДатаДокПриИзменении(Элемент)  
	ЗаполнитьИнформациюОплательщике(); 
	НакладнаяНаОтгрузку = ПолучитьНакладнуюНаОтгрузку();
	
	ТаблицаСостояний.Очистить(); 
	ТаблицаТоваров.Очистить();
	ПричинаПримененияПроцентнойСхемы = ПолучитьПричинуПримененияПроцентнойСхемы();
	ЗаполнитьСостояниеЗалоговогоБилета(); 
	ЗаполнитьТовары(); 
	Если Выкуп тогда
		ЗаполнитьТоварыПослеВыкупа(Ложь);
		ИнформацияОплата();
	КонецЕсли;   

	СпособОплаты = 1; 	
	СуммаОплаты = 0;
	Наличные = 0;
	Сдача = 0;
	Элементы.ДекорацияОплата.Заголовок = "";
	ПроверитьПредельныйСрокЗайма();
    Если НЕ ДостигнутПредельныйСрокЗайма Тогда
		Если БезПродленияДоговора Тогда 
			Элементы.СпособОплаты.Видимость = Ложь; 
			Элементы.СпособОплатыБезПродления.Видимость = Истина;
		Иначе	
			Элементы.СпособОплаты.Видимость = Истина; 
			Элементы.СпособОплатыБезПродления.Видимость = Ложь;		 
		КонецЕсли;                                                
		Элементы.ГруппаПредельныйсрокЗайма.Видимость = ложь; 
		Элементы.ГруппаБезналичнаяОплата.Видимость = Ложь;
	ИначеЕсли БезналичнаяОплата Тогда  
		Если БезПродленияДоговора Тогда 
			Элементы.СпособОплаты.Видимость = Ложь; 
			Элементы.СпособОплатыБезПродления.Видимость = Истина;
		Иначе	
			Элементы.СпособОплаты.Видимость = Истина; 
			Элементы.СпособОплатыБезПродления.Видимость = Ложь;		 
		КонецЕсли;     
		Элементы.ГруппаПредельныйсрокЗайма.Видимость = Ложь; 
		Элементы.ГруппаБезналичнаяОплата.Видимость = Истина;
	 Иначе
		Элементы.ГруппаПредельныйсрокЗайма.Видимость = Истина;  
		Элементы.ГруппаБезналичнаяОплата.Видимость = Ложь;
		Элементы.СпособОплаты.Видимость = Ложь; 
		Элементы.СпособОплатыБезПродления.Видимость = Ложь;	 
		Если (НЕ (Плательщик = ПолучитьЗалогодателя()) И НЕ ЗначениеЗаполнено(ДоверенностьПлательщика)) ИЛИ ЭтаФорма.БилетИзъят Тогда
		    Элементы.ДекорацияПредельныйСрокДоп.Заголовок = "Возможен только полный выкуп.";
		Иначе
			Элементы.ДекорацияПредельныйСрокДоп.Заголовок = "Возможен только полный выкуп или переоформление." + 
			  ?(ЭтаФорма.НеРедактировать, "", " Нажмите кнопку ""Принять оплату"" и выберите необходимое действие.");
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть(?(ЗначениеЗаполнено(ДокументОплаты), ДокументОплаты, неопределено));
КонецПроцедуры

&НаКлиенте
Процедура ОплатаПроцентов(Полностью = ложь)  
	Выкуп = ложь; 
	ЗаполнитьСостояниеЗалоговогоБилета();
	Отбор = Новый Структура;
	Отбор.Вставить("КлючСтроки", 2);       
	Строки = ТаблицаСостояний.НайтиСтроки(Отбор);
	СуммаПроцентов = Строки[0].СуммаПроцентовДолг; 
	Если Полностью Тогда 
		СуммаОплаты = СуммаПроцентов;
	Иначе	
	    СуммаОплаты = СуммаОплатыДляПродленияДоговора; 
	КонецЕсли;	
	СуммаОплатыПроценты = СуммаОплаты;
	СуммаОплатыСсуда = 0; 
	РаспределитьСуммуОплатыСсудыТовары(); 	
	ЗаполнитьСтрокуСостоянияПослеОплаты(); 
	ЗаполнитьСостояниеТоваровПерезалог();
	ИнформацияОплата(); 
КонецПроцедуры    

&НаКлиенте
Процедура ПолныйВыкуп()   
	Выкуп = Истина;    
	ЗаполнитьСостояниеЗалоговогоБилета(); 
	Отбор = Новый Структура;
	Отбор.Вставить("КлючСтроки", 2);       
	Строки = ТаблицаСостояний.НайтиСтроки(Отбор);
    СуммаОплатыПроценты = Строки[0].СуммаПроцентовДолг;
	СуммаОплатыСсуда = Строки[0].СуммаЗайма;
	СуммаОплаты = СуммаОплатыПроценты + СуммаОплатыСсуда; 
	РаспределитьСуммуОплатыСсудыТовары(Истина); 
	ЗаполнитьВернутьЗалог();  	
	ЗаполнитьСтрокуСостоянияПослеОплаты(Истина);
	ИнформацияОплата(); 
КонецПроцедуры   


&НаСервере
Процедура ИнформацияОплата()
	СтрокаОплата = "Оплата проценты " + сокрЛП(Формат(СуммаОплатыПроценты, "ЧЦ=15; ЧДЦ=2; ЧН='0, 00'")) + " руб., тело займа " + сокрЛП(Формат(СуммаОплатыСсуда, "ЧЦ=15; ЧДЦ=2; ЧН='0, 00'")) + " руб.";
	Элементы.ДекорацияОплата.Заголовок = СтрокаОплата;  
	СтрокаВыкуп = "";
	Если Выкуп Тогда
		Если НЕ Плательщик = ЗалоговыйБилет.Залогодатель Тогда
			Если НЕ ЗначениеЗаполнено(ДоверенностьПлательщика) Тогда   
				СтрокаВыкуп = "Внимание! Не выбрана доверенность представителя заемщика. Выкупленные объекты залога будут оставлены в ломбарде на отвественное хранение.";
			КонецЕсли;	
		КонецЕсли; 
	Иначе	
	КонецЕсли;
	Элементы.ДекорацияВыкуп.Заголовок = СтрокаВыкуп; 
	УстановитьИнформациюВыкуп();
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьСостояниеТоваровПерезалог() 
	Если Выкуп Тогда
		Возврат;
	КонецЕсли;	
	Перезалог = ?(ПродлитьДоговорДни = 0, Ложь, Истина);
	Если Перезалог Тогда
		Для каждого стр из ТаблицаТоваров Цикл 
			Если Стр.СтатусПослеОплаты = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыОбъектовЗалога.Принят") ИЛИ 
				 Стр.СтатусПослеОплаты = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыОбъектовЗалога.ВключенВНакладную") ИЛИ
				 Стр.СтатусПослеОплаты = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыОбъектовЗалога.ОбъявленТорг") Тогда
			    Стр.СтатусПослеОплаты = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыОбъектовЗалога.Продлен");
			КонецЕсли;	
		Конеццикла;	
	Иначе
		Для каждого стр из ТаблицаТоваров Цикл
			Стр.СтатусПослеОплаты = Стр.СтатусОбъекта;
		Конеццикла;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВернутьЗалог()
	Если Выкуп Тогда
		ЗаполнитьТоварыПослеВыкупа(Ложь); 
		ИнформацияОплата();
	Иначе
		Для каждого стр из ТаблицаТоваров Цикл
			Стр.ВернутьЗалог = ложь;
			Стр.ПроверкаВернутьЗалог = ложь;
		Конеццикла;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СпособОплатыПриИзменении(Элемент) 
	Элементы.СуммаОплаты.ТолькоПросмотр = Истина;
	Если СпособОплаты = 1 Тогда //Свободная оплата
		Элементы.СуммаОплаты.ТолькоПросмотр = ложь;
	ИначеЕсли СпособОплаты = 2 Тогда //продление договора
		ОплатаПроцентов();
	ИначеЕсли СпособОплаты = 3 Тогда //все проценты
		ОплатаПроцентов(Истина);
	ИначеЕсли СпособОплаты = 4 Тогда //выкуп
		ПолныйВыкуп();	
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура СуммаОплатыПриИзменении(Элемент)	
	Выкуп = Истина;
	ЗаполнитьСостояниеЗалоговогоБилета();
	Отбор = Новый Структура;
	Отбор.Вставить("КлючСтроки", 2);       
	Строки = ТаблицаСостояний.НайтиСтроки(Отбор);  
	ОбщаяСуммаДолга = Строки[0].СуммаЗайма + Строки[0].СуммаПроцентовДолг;
	Если СуммаОплаты > ОбщаяСуммаДолга Тогда 
		Сообщить("Введенная сумма оплаты " + СокрЛП(Формат(СуммаОплаты,"ЧЦ=15; ЧДЦ=2" )) + " руб. больше суммы долга клиента по оплате процентов и тела займа " + СокрЛП(Формат(ОбщаяСуммаДолга,"ЧЦ=15; ЧДЦ=2" )) + " руб.");
		СуммаОплаты = ОбщаяСуммаДолга;
	КонецЕсли;	
    СуммаОплатыПроценты = Строки[0].СуммаПроцентовДолг;
	Если СуммаОплаты <= Строки[0].СуммаПроцентовДолг Тогда
		СуммаОплатыПроценты = СуммаОплаты;
		СуммаОплатыСсуда = 0;
	Иначе	
		СуммаОплатыПроценты = Строки[0].СуммаПроцентовДолг;
		СуммаОплатыСсуда = СуммаОплаты - СуммаОплатыПроценты;
	КонецЕсли;  
	ЭтоВыкуп = ?(СуммаОплатыСсуда = Строки[0].СуммаЗайма, истина, ложь);  
	Если НЕ Выкуп = ЭтоВыкуп Тогда
		Выкуп = ЭтоВыкуп;     
		ЗаполнитьСостояниеЗалоговогоБилета(); 
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки", 2);       
		Строки = ТаблицаСостояний.НайтиСтроки(Отбор);   
		СуммаОплатыПроценты = Строки[0].СуммаПроцентовДолг;
		Если СуммаОплаты <= Строки[0].СуммаПроцентовДолг Тогда
			СуммаОплатыПроценты = СуммаОплаты;
			СуммаОплатыСсуда = 0;
		Иначе	
			СуммаОплатыПроценты = Строки[0].СуммаПроцентовДолг;
			СуммаОплатыСсуда = СуммаОплаты - СуммаОплатыПроценты;
		КонецЕсли;  
	КонецЕсли;	       
	РаспределитьСуммуОплатыСсудыТовары(ЭтоВыкуп);
	ЗаполнитьВернутьЗалог();
	ЗаполнитьСтрокуСостоянияПослеОплаты(ЭтоВыкуп);	
	ЗаполнитьСостояниеТоваровПерезалог();
	ИнформацияОплата();    
КонецПроцедуры 

&НаСервере
Процедура РаспределитьСуммуОплатыСсудыТовары(Выкуп = ложь) 
	Если Выкуп Тогда 
		Для каждого Стр Из ТаблицаТоваров Цикл 
			Стр.СуммаОплаты = Стр.ЗадолженностьНач;  
			Стр.ЗадолженностьКон = 0;
		КонецЦикла;	
	Иначе	
		СуммаДляРаспределения = СуммаОплатыСсуда;
		Если СуммаДляРаспределения = 0 Тогда
			Для каждого Стр Из ТаблицаТоваров Цикл
				Стр.СуммаОплаты = 0;   
				Стр.ЗадолженностьКон = Стр.ЗадолженностьНач - Стр.СуммаОплаты;
			Конеццикла;	
		Иначе	
			НомСтрМакс = 0; 
			МаксЗадолженность = 0;
			ЗадолженностьНачИтог = ТаблицаТоваров.Итог("ЗадолженностьНач");
			Для каждого Стр Из ТаблицаТоваров Цикл 
			    Коэфф = Стр.ЗадолженностьНач/ЗадолженностьНачИтог;
				Стр.СуммаОплаты = СуммаОплатыСсуда*Коэфф;
				Стр.ЗадолженностьКон = Стр.ЗадолженностьНач - Стр.СуммаОплаты;
				СуммаДляРаспределения = СуммаДляРаспределения - Стр.СуммаОплаты;
				Если Стр.ЗадолженностьНач > МаксЗадолженность Тогда
					МаксЗадолженность = Стр.ЗадолженностьНач;  
					НомСтрМакс = стр.НомерСтроки-1;
				КонецЕсли;	
			КонецЦикла;
			Если НЕ СуммаДляРаспределения = 0 Тогда
				Стр = ТаблицаТоваров.Получить(НомСтрМакс);
				Стр.СуммаОплаты = Стр.СуммаОплаты + СуммаДляРаспределения;
				Стр.ЗадолженностьКон = Стр.ЗадолженностьНач - Стр.СуммаОплаты;
			КонецЕсли;  
		КонецЕсли;	
	КонецЕсли;	
	
	ТоварыИтогОплатаКон = ТаблицаТоваров.Итог("СуммаОплаты");
	ТоварыИтогДолгКон = ТаблицаТоваров.Итог("ЗадолженностьКон");
КонецПроцедуры	

&НаСервере
Функция ЗаполнитьСписокТоваровНеВЛомбарде()  
    СписокТоваров = Новый СписокЗначений;
	
	Запрос = новый Запрос;   
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
    Запрос.УстановитьПараметр("Дата", ДатаДок);	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_ОбъектыЗалогаОстатки.Ломбард КАК Ломбард,
	               |	СУММА(ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток) КАК Количество
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(&Дата, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_ОбъектыЗалогаОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога,
	               |	ЛБ_ОбъектыЗалогаОстатки.Ломбард";
	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
	
	Для каждого стр Из ТаблицаТоваров цикл  
		Если Стр.СтатусОбъекта = Перечисления.ЛБ_СтатусыОбъектовЗалога.Выкуплен тогда
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый структура;
		Отбор.Вставить("ОбъектЗалога", Стр.ОбъектЗалога);
		Отбор.Вставить("Ломбард", Ломбард);
		Строки = ТаблицаОстатков.НайтиСтроки(Отбор);
		Если Строки.Количество() = 0 тогда 			
			Отбор.Удалить("Ломбард");
			Строки = ТаблицаОстатков.НайтиСтроки(Отбор);
			Если НЕ Строки.Количество() = 0 тогда 
				ИнформацияВыкуп = ЛБ_УправлениеЛомбардом.АртикулОбъектаЗалога(ЗалоговыйБилет, Стр.НомерСтроки) + " " + СокрЛП(Стр.ОбъектЗалога) + ": находится в " + СокрЛП(Строки.Получить(0).Ломбард);
				СписокТоваров.Добавить(ИнформацияВыкуп);
			ИначеЕсли НЕ Стр.СтатусОбъекта = Перечисления.ЛБ_СтатусыОбъектовЗалога.Изъят Тогда	 
				ИнформацияВыкуп = ЛБ_УправлениеЛомбардом.АртикулОбъектаЗалога(ЗалоговыйБилет, Стр.НомерСтроки) + " " + СокрЛП(Стр.ОбъектЗалога) + ": местонахождение не определено";
			    СписокТоваров.Добавить(ИнформацияВыкуп); 	
			КонецЕсли; 
		КонецЕсли;	
	Конеццикла;	   
	
	Возврат СписокТоваров;
КонецФункции	

&НаСервере
Функция ПроверитьВозможноПереоформление()  
	СтатусЗБ = ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(ДатаДок, ЗалоговыйБилет);
	Если СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят Или СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен Тогда
		Возврат ложь;                                                                                                
	//ИначеЕсли НЕ ЗалоговыйБилет.Ломбард = Ломбард Тогда
	//	Возврат Ложь;
	ИначеЕсли ЛБ_ОбщийМодуль.ПроверитьЕстьДатаСмерти(ЗалоговыйБилет.Залогодатель, ДатаДок) = неопределено Тогда 
	    Возврат ?(НЕ ПроверитьПлательщикЭтоЗаемщик() И НЕ ЗначениеЗаполнено(ДоверенностьПлательщика), Ложь, Истина); 	
	Иначе      
		Если НЕ ЗначениеЗаполнено(ДоверенностьПлательщика) Тогда
			Возврат Ложь;
		ИначеЕсли НЕ ДоверенностьПлательщика.ВидДоверенности = Перечисления.ЛБ_ВидыДоверенностей.СвидетельствоОСмерти Тогда
			Возврат ложь;
		Иначе      
			Возврат Истина;
		КонецЕсли;	  
	КонецЕсли;	
КонецФункции

&НаСервере
Функция ПроверитьКассовуюСмену(ДатаПроверки = неопределено) 	            
	Возврат ЛБ_ОбщийМодуль.ПолучитьОткрытуюКассовуюСмену(?(ДатаПроверки = неопределено, ТекущаяДатаСеанса(), ДатаПроверки), ЗалоговыйБилет.Организация, Ломбард);
КонецФункции

&НаСервере
Функция ПроверитьЕстьВНакладной()
	Возврат  ЛБ_УправлениеЛомбардом.ПолучитьСтатусНакладнойПоЗБ(ДатаДок, ЗалоговыйБилет); 
КонецФункции

&НаСервере
Функция ОплатаМеньше90Процентов()
	Отбор = Новый Структура;
	Отбор.Вставить("КлючСтроки", 2);       
	Строки = ТаблицаСостояний.НайтиСтроки(Отбор);  
	СуммаДолга = Строки[0].СуммаПроцентовДолг;
	Если НЕ СуммаДолга = 0 Тогда
		Если окр(СуммаОплаты/СуммаДолга*100, 2) < 90 Тогда 
			Возврат Истина;
		КонецЕсли; 
	КонецЕсли;
	Возврат Ложь;
КонецФункции

&НаСервере
Функция ПолучитьНомерЗБ() 
	Возврат ЗалоговыйБилет.НомерЗалоговогоБилета;
КонецФункции

&НаСервере
Функция ПолучитьЛомбардЗБ() 
	СтруктураВ = Новый Структура;
	СтруктураВ.Вставить("Ломбард", ЗалоговыйБилет.Ломбард);
	СтруктураВ.Вставить("Номер", ЗалоговыйБилет.Ломбард.НомерЛомбарда);
	Возврат СтруктураВ;
КонецФункции

&НаСервере
Функция ПолучитьРеквизитыНакладной(НакладнаяНаОтгрузку)  
	СтруктураВ = Новый Структура;
	СтруктураВ.Вставить("Номер", НакладнаяНаОтгрузку.ПредставлениеНомераНакладной); 
	СтруктураВ.Вставить("Дата", НакладнаяНаОтгрузку.Дата);
	Возврат СтруктураВ; 
КонецФункции

&НаСервере
Функция ПолучитьБезПродленияДоговора()
    Возврат ЗалоговыйБилет.СхемаКредитования.БезПродленияДоговора; 
КонецФункции

&НаКлиенте
Функция ОткрытыеФормыПоИмени(ИмяФормы, ВернутьПервые = 0) Экспорт

   Результат = Новый Массив; // Массив из ФормаКлиентскогоПриложения

   ОткрытыеОкна = ПолучитьОкна();
   Для Каждого ОткрытоеОкно Из ОткрытыеОкна Цикл

       Для Каждого ОткрытаяФорма Из ОткрытоеОкно.Содержимое Цикл //ФормаКлиентскогоПриложения

           Если ТипЗнч(ОткрытаяФорма) = Тип("ФормаКлиентскогоПриложения") Тогда

               Если ОткрытаяФорма.ИмяФормы = ИмяФормы Тогда

                   Результат.Добавить(ОткрытаяФорма);

                   Если ВернутьПервые > 0 И Результат.Количество() = ВернутьПервые Тогда
                       Прервать;
                   КонецЕсли;

               КонецЕсли;

           КонецЕсли;

       КонецЦикла;

   КонецЦикла;

   Возврат Результат;

КонецФункции

&НаКлиенте
Процедура Оплатить(Команда)      
	Если НеРедактировать Тогда
		Возврат;
	КонецЕсли;   

	Если НЕ ЗначениеЗаполнено(ДокументОплаты) И НачалоДня(ДатаДок) = НачалоДня(ТекущаяДата()) Тогда
	    ДатаПроверки = ТекущаяДата();		
	Иначе
		ДатаПроверки = ДатаДок;  
	КонецЕсли;	      
	СтруктураКС = ПроверитьКассовуюСмену(ДатаПроверки);
	Если СтруктураКС = неопределено И НЕ СуммаОплаты = 0 Тогда
		Предупреждение("Не открыта кассовая смена в ломбарде. Оплата процентов запрещена.", 60);
		Возврат;
	КонецЕсли;	

	Если ПроверкаКлиента() Тогда   
		Если НЕ ЗначениеЗаполнено(ДокументОплаты) И НачалоДня(ДатаДок) = НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса()) Тогда
		    ДатаДок = ОбщегоНазначенияКлиент.ДатаСеанса();
		КонецЕсли;	
		
		Отбор = новый Структура;
		Отбор.Вставить("КлючСтроки", 2); 
		СтрокиС = ТаблицаСостояний.НайтиСтроки(Отбор);  
		СтатусЗБ = СтрокиС.Получить(0).Статус;
		Если СтатусЗБ = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыЗалоговыхБилетов.Отгружен") Тогда 
            ЕстьНеПроведенные  = СоздатьДокументНаСервере();
			Если НЕ ЕстьНеПроведенные Тогда
				НеРедактировать = Истина;
				Элементы.ДекорацияСтатусДокумента.Заголовок = "Факт"; 
				Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноБордовый;  
				Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.ТусклоРозовый;		       
				Элементы.Оплатить.Доступность = Ложь;
			    Элементы.Отмена.Заголовок = "Закрыть"; 
				Элементы.ОсновнаяПанель.ТолькоПросмотр = НеРедактировать;
				УстановитьИнформациюВыкуп();
				УстановитьВидимость(); 
				Если ВладелецФормы.ИмяФормы = "ОбщаяФорма.ЛБ_РабочееМестоПриемщикаЛомбарда" Тогда
		   	        ФормаРМП = ВладелецФормы;  
					Если ФормаРМП.Залогодатель = ПолучитьЗалогодателя() Тогда
		                ФормаРМП.ПослеВыбораТекущееСостояниеЗБ(Истина, неопределено); 
					КонецЕсли;	
				КонецЕсли;
	       	КонецЕсли;		
		Иначе
			Отбор = Новый Структура;
			Отбор.Вставить("КлючСтроки", 1);       
			Строки = ТаблицаСостояний.НайтиСтроки(Отбор);   
			Если НЕ Строки.Количество() = 0 Тогда  
				ДатаПЗС = Строки.Получить(0).ПредельныйСрокЗайма; 
			КонецЕсли;	
			
			БудетДостигнутПредельныйСрокЗайма = Ложь;
			Отбор.Вставить("КлючСтроки", 3);       
			Строки = ТаблицаСостояний.НайтиСтроки(Отбор);   
			Если НЕ Строки.Количество() = 0 Тогда  
				ДатаВозвратаРасчет = Строки.Получить(0).ДатаВозврата;
				Если ДатаВозвратаРасчет >= ДатаПЗС Тогда   
					БудетДостигнутПредельныйСрокЗайма = Истина;
					СпособОплаты = 4;      
					ПолныйВыкуп();
				КонецЕсли;	
			КонецЕсли;	
			
			СтруктураВ = ПроверитьЕстьВНакладной();
			Если СтруктураВ = неопределено Тогда
				ЕстьВНакладной = Ложь;
			Иначе
				ЕстьВНакладной = Истина;
				НакладнаяНаОтгрузку = СтруктураВ.НакладнаяНаОтгрузку; 
				СтатусНакладной = СтруктураВ.СтатусНакладной;
			КонецЕсли;  
			
			Если ЕстьВНакладной Тогда   
				СтруктураН = ПолучитьРеквизитыНакладной(НакладнаяНаОтгрузку); 
			    ТекстПредупреждения = "Предметы залога по ЗБ № " + СокрЛП(ПолучитьНомерЗБ()) + " в накладной № " + СокрЛП(СтруктураН.Номер)+ " от " + Формат(СтруктураН.Дата, "ДЛФ=DT");
			    Если СтатусНакладной = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыНакладнойНаОтгрузку.Отгружена") Тогда
				    ТекстПредупреждения = ТекстПредупреждения + " уже отгружены.";   			
					ТекстПредупреждения = ТекстПредупреждения + " Для согласования возможности приема оплаты/выкупа обратитесь в ЦО.";
					Предупреждение(ТекстПредупреждения, 60);
					Возврат;
			    ИначеЕсли СтатусНакладной = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыНакладнойНаОтгрузку.СумкаОткрыта") ИЛИ  
					      СтатусНакладной = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыНакладнойНаОтгрузку.СумкаЗакрыта") Тогда  
				   ТекстПредупреждения = ТекстПредупреждения + " в сумке.";	
				   
				   СтруктураВ = ПолучитьЛомбардЗБ();
				   Если НЕ Ломбард = СтруктураВ.Ломбард Тогда
				        ТекстПредупреждения = "Внимание! Изделия по ЗБ № " + СокрЛП(ПолучитьНомерЗБ()) + " в сумке! Для проведения оплаты свяжитесь с ломбардом № " + СокрЛП(СтруктураВ.Номер) + "." ;
				   Иначе	   
					   Если Выкуп Тогда
					       ТекстПредупреждения = ТекстПредупреждения + Символы.ПС + "Для выкупа или переоформления ЗБ измените статус накладной и вскройте сумку."; 
					   Иначе 
						   ТекстПредупреждения = ТекстПредупреждения + Символы.ПС + "Для оплаты ЗБ измените статус накладной и вскройте сумку."; 
					   КонецЕсли;	
				   КонецЕсли;	   
			   	   Предупреждение(ТекстПредупреждения, 60);  
				   Возврат; 
			    КонецЕсли;	   
			КонецЕсли;		  

			
			ВозможноПереоформление = ПроверитьВозможноПереоформление();		
			Если Выкуп И НЕ ВозможноПереоформление Тогда 
				Если ЕстьВНакладной Тогда
				    Предупреждение("Внимание! В результате выкупа предметы залога будут исключены из накладной!", 60); 
				КонецЕсли;	
				ЕстьНеПроведенные  = СоздатьДокументНаСервере();
				Если НЕ ЕстьНеПроведенные Тогда
					НеРедактировать = Истина;
					Элементы.ДекорацияСтатусДокумента.Заголовок = "Факт"; 
					Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноБордовый;  
					Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.ТусклоРозовый;
			        Элементы.Редактировать.Видимость = Истина; 
					Элементы.Оплатить.Доступность = Ложь;
				    Элементы.Отмена.Заголовок = "Закрыть"; 
					Элементы.ОсновнаяПанель.ТолькоПросмотр = НеРедактировать;
					УстановитьИнформациюВыкуп();
	                //+Мельников 25.04.24 Отмена операции
					УстановитьВидимость();
					//-Мельников      
					Если ВладелецФормы.ИмяФормы = "ОбщаяФорма.ЛБ_РабочееМестоПриемщикаЛомбарда" Тогда
			   	        ФормаРМП = ВладелецФормы;  
						Если ФормаРМП.Залогодатель = ПолучитьЗалогодателя() Тогда
			                ФормаРМП.ПослеВыбораТекущееСостояниеЗБ(Истина, неопределено); 
						КонецЕсли;	
					КонецЕсли;
		       	КонецЕсли;		
			ИначеЕсли Выкуп ИЛИ ДостигнутПредельныйСрокЗайма ИЛИ БудетДостигнутПредельныйСрокЗайма Тогда
				ПараметрыФормы = Новый Структура;
				ПараметрыФормы.Вставить("ЗалоговыйБилет", ЗалоговыйБилет); 
				ПараметрыФормы.Вставить("Ломбард", Ломбард);
				ПараметрыФормы.Вставить("Плательщик", Плательщик);
				ПараметрыФормы.Вставить("ДоверенностьПлательщика", ДоверенностьПлательщика); 
				ПараметрыФормы.Вставить("ДатаДок", ДатаДок);  
				ПараметрыФормы.Вставить("Выкуп", ?(ДостигнутПредельныйСрокЗайма, Истина, Выкуп));
				ПараметрыФормы.Вставить("СуммаОплаты", СуммаОплаты); 
				ПараметрыФормы.Вставить("СуммаПроценты", СуммаОплатыПроценты);
				ПараметрыФормы.Вставить("СуммаЗайм", СуммаОплатыСсуда); 
				ПараметрыФормы.Вставить("ФИОПлательщика", ФИО); 
				ПараметрыФормы.Вставить("Доверенность", Доверенность);  
				ПараметрыФормы.Вставить("СписокНельзяВыкупить", ЗаполнитьСписокТоваровНеВЛомбарде());
				ПараметрыФормы.Вставить("ДатаПЗС", ДатаПЗС);  
				ПараметрыФормы.Вставить("ДатаВозврата", ДатаВозвратаРасчет);  
				ПараметрыФормы.Вставить("ЕстьВНакладной", ЕстьВНакладной);
				
				//+МАН 29.11.24 Дополнение для вывода сообщения при экспресе и накладной в факте. Заявка 2904.
				Если ЕстьВНакладной Тогда
					ПараметрыФормы.Вставить("СтатусНакладной", СтатусНакладной);
				КонецЕсли;
				//-МАН
				
				Отбор.Вставить("КлючСтроки", 2);       
				Строки = ТаблицаСостояний.НайтиСтроки(Отбор);   
				Если НЕ Строки.Количество() = 0 Тогда  
					ПараметрыФормы.Вставить("СтатусЗБ", Строки.Получить(0).Статус); 
				КонецЕсли;	
				
				ОписаниеОповещения = новый ОписаниеОповещения("ПослеВыбораОплатаПереоформить", ЭтотОбъект);
				ОткрытьФорму("ОбщаяФорма.ЛБ_ОплатаПереоформить", ПараметрыФормы, ЭтаФорма, Истина,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			Иначе          
				Если ЕстьВНакладной И НЕ ПолучитьБезПродленияДоговора() Тогда
					Если ОплатаМеньше90Процентов() Тогда
						Режим = РежимДиалогаВопрос.ДаНет;
					    ТекстВопроса = "Внимание! Сумма оплаты менее 90% от суммы начисленных процентов. Предметы залога не будут исключены из накладной!"; 
					    Ответ = Вопрос(ТекстВопроса + Символы.ПС + "Продолжить выполнение операции?", Режим, 0);
					    Если Ответ = КодВозвратаДиалога.Нет Тогда
						    Возврат;
					    КонецЕсли;  
					Иначе   
						Предупреждение("Внимание! В результате оплаты предметы залога будут исключены из накладной!", 60);
					КонецЕсли;
				КонецЕсли;
				
				//+МАН 29.11.24 Дополнение для вывода сообщения при экспресе и накладной в факте. Заявка 2904.
				Если ЕстьВНакладной И ПолучитьБезПродленияДоговора() Тогда
					
						ПродлениеСК = ПолучитьСхемуКредитования(ЗалоговыйБилет);
						
						Предупреждение("Внимание! Вид займа " + ПродлениеСК.НаименованиеСК
						+ ", продление срока займа не предусмотрено. Предметы залога не будут исключены из накладной!");
				КонецЕсли;
				//-МАН
				
				ЕстьНеПроведенные  = СоздатьДокументНаСервере();
				Если НЕ ЕстьНеПроведенные Тогда
					НеРедактировать = Истина;
					Элементы.ДекорацияСтатусДокумента.Заголовок = "Факт"; 
					Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноБордовый;  
					Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.ТусклоРозовый;
			        Элементы.Редактировать.Видимость = Истина; 
					Элементы.Оплатить.Доступность = Ложь;
				    Элементы.Отмена.Заголовок = "Закрыть"; 
					Элементы.ОсновнаяПанель.ТолькоПросмотр = НеРедактировать;  			
					//+Мельников 25.04.24 Отмена операции
					УстановитьВидимость();
					//-Мельников    
					Если ВладелецФормы.ИмяФормы = "ОбщаяФорма.ЛБ_РабочееМестоПриемщикаЛомбарда" Тогда
			   	        ФормаРМП = ВладелецФормы;  
						Если ФормаРМП.Залогодатель = ПолучитьЗалогодателя() Тогда
			                ФормаРМП.ПослеВыбораТекущееСостояниеЗБ(Истина, неопределено); 
						КонецЕсли;	
					КонецЕсли;
		       	КонецЕсли;	
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры 

&НаСервере
Функция ПолучитьОсновнойДокументПереоформление(Клиент) 
	Если Клиент = Плательщик Тогда
		Возврат ДокументПлательщика;
	КонецЕсли;
	
	Гражданство = Справочники.СтраныМира.Россия;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса()); 
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство
	               |ИЗ
	               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Клиент) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Гражданство = Выборка.Гражданство;
	КонецЕсли;	
	Возврат ЛБ_УправлениеЛомбардом.ПроверитьОсновнойДокумент(ДатаДок, Клиент, Гражданство);
КонецФункции

//+Мельников 05.07.24 Проверка на банкрота
&НаСервере
Функция ПроверитьСтатусБанкрот(ЗБ)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СтатусыЗалогодателейСлужебныеСрезПоследних.Используется КАК Используется
		|ИЗ
		|	РегистрСведений.ЛБ_СтатусыЗалогодателейСлужебные.СрезПоследних(
		|			&Дата,
		|			Залогодатель = &Залогодатель
		|				И Статус.Несостоятельный = ИСТИНА) КАК ЛБ_СтатусыЗалогодателейСлужебныеСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("Залогодатель", ЗБ.Залогодатель);
	//Запрос.УстановитьПараметр("Статус", Справочники.ЛБ_СлужебныеСтатусыКлиентов.НайтиПоКоду("000000003"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Используется;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
//-Мельников

//+МАН 29.11.24 Дополнение для вывода сообщения при экспресе и накладной в факте. Заявка 2904.
&НаСервереБезКонтекста
Функция ПолучитьСхемуКредитования(ЗалоговыйБилет)

	Результат = Новый Структура;
	Результат.Вставить("БезПродленияДоговора", ЗалоговыйБилет.СхемаКредитования.БезПродленияДоговора);
	Результат.Вставить("НаименованиеСК", ЗалоговыйБилет.СхемаКредитования.НаименованиеДляПечати);
	
	Возврат Результат;

КонецФункции
//-МАН

&НаКлиенте
Процедура ПослеВыбораОплатаПереоформить(Результат, ДопПараметры) Экспорт
    Если НЕ ТипЗнч(Результат) = Тип("Структура") Тогда
        Возврат;
	КонецЕсли; 

	//+Мельников 05.07.24 Проверка на банкрота
	Банкрот = ПроверитьСтатусБанкрот(ЗалоговыйБилет);
	//-Мельников    
	
	Если Результат.Операция = 1 Тогда 
		Если Результат.ЕстьВНакладной Тогда
		    Предупреждение("Внимание! В результате оплаты предметы залога будут исключены из накладной!", 60); 
		КонецЕсли;   
		ЕстьНеПроведенные  = СоздатьДокументНаСервере();
		Если НЕ ЕстьНеПроведенные Тогда
			НеРедактировать = Истина;
			Элементы.ДекорацияСтатусДокумента.Заголовок = "Факт"; 
			Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноБордовый;  
			Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.ТусклоРозовый;
	        Элементы.Редактировать.Видимость = Истина; 
			Элементы.Оплатить.Доступность = Ложь;
		    Элементы.Отмена.Заголовок = "Закрыть"; 
			Элементы.ОсновнаяПанель.ТолькоПросмотр = НеРедактировать;  	
			УстановитьИнформациюВыкуп();  
			Если ВладелецФормы.ИмяФормы = "ОбщаяФорма.ЛБ_РабочееМестоПриемщикаЛомбарда" Тогда
			      ФормаРМП = ВладелецФормы;  
				Если ФормаРМП.Залогодатель = ПолучитьЗалогодателя() Тогда
			        ФормаРМП.ПослеВыбораТекущееСостояниеЗБ(Истина, неопределено); 
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;	
		
		//+Мельников 05.07.24 Банкрот
		Если Банкрот Тогда
			//+МАН 06.04.26 Изменил сообщение. Заявка 3759
			ТекстСообщения = "Клиенту " + Строка(ПолучитьЗалогодателя()) + " присвоен служебный статус ""Банкрот"", в связи с чем выдача залога клиенту/доверенному лицу запрещена!";
			//Было:
			//Предупреждение("Полная оплата займа клиента – банкрота.
			//				|Выдача залога клиенту/доверенному лицу запрещена!");
			//Сообщить("Полная оплата займа клиента – банкрота.
			//				|Выдача залога клиенту/доверенному лицу запрещена!", СтатусСообщения.ОченьВажное);
			Предупреждение(ТекстСообщения);
			Сообщить(ТекстСообщения, СтатусСообщения.ОченьВажное);
			//-МАН
		КонецЕсли;
		//-Мельников
	ИначеЕсли Результат.Операция = 2 Тогда   
		Если Результат.ЕстьВНакладной Тогда
		    Предупреждение("Внимание! В результате выкупа/переоформления предметы залога будут исключены из накладной!", 60);  
		КонецЕсли;	
	
		ПараметрыФормы = Новый Структура;      
		ПараметрыФормы.Вставить("Дата", ДатаДок); 
		ПараметрыФормы.Вставить("ПредыдущаяОперация", ЗалоговыйБилет);  
			
		Если Результат.СпособПереоформления = 0 Тогда  //на заемщика  
			Залогодатель = ПолучитьЗалогодателя();
			ПараметрыФормы.Вставить("Залогодатель", Залогодатель);
			ПараметрыФормы.Вставить("ДокументЗалогодателя", ПолучитьОсновнойДокументПереоформление(Залогодатель)); 
			Если НЕ Плательщик = Залогодатель Тогда  
				ПараметрыФормы.Вставить("Представитель", Плательщик);
				ПараметрыФормы.Вставить("ДокументПредставителя", ДокументПлательщика); 
				ПараметрыФормы.Вставить("ДоверенностьПредставителя", ДоверенностьПлательщика);
			КонецЕсли;	  
		Иначе //на доверенное лицо
			ПараметрыФормы.Вставить("Залогодатель", Плательщик);
			ПараметрыФормы.Вставить("ДокументЗалогодателя", ДокументПлательщика); 
			ПараметрыФормы.Вставить("ДоверенностьПредставителя", ДоверенностьПлательщика);
		КонецЕсли;
		ОписаниеОповещения = новый ОписаниеОповещения("ПослеСозданияПереоформления", ЭтотОбъект); 
		Если ВладелецФормы.ИмяФормы = "ОбщаяФорма.ЛБ_РабочееМестоПриемщикаЛомбарда" Тогда
		    ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаПереоформленияЗайма", ПараметрыФормы, ЭтаФорма.ВладелецФормы, Истина,,,ОписаниеОповещения); 
		Иначе 
			ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаПереоформленияЗайма", ПараметрыФормы, ЭтаФорма, Истина,,,ОписаниеОповещения);
		КонецЕсли;	
	КонецЕсли;	
	//+Мельников 20.06.24 Установка видимости т.к. кнопка "отмена" не активна
	УстановитьВидимость();
	//-Мельников
КонецПроцедуры

&НаКлиенте
Процедура ПослеСозданияПереоформления(Результат, ДопПараметры) Экспорт
	Если Результат = неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.Открыта() Тогда
	    ЭтаФорма.Закрыть();  
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Функция ПроверитьКлиентаПоПеречням() 
	РезультатПроверки = Истина;
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Залогодатель", Плательщик);  
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КлиентыВПеречняхСрезПоследних.ВидПеречня КАК ВидПеречня,
	               |	ЛБ_КлиентыВПеречняхСрезПоследних.СтатусКлиентаВПеречне КАК СтатусКлиентаВПеречне,
	               |	ЛБ_КлиентыВПеречняхСрезПоследних.Период КАК Период
	               |ИЗ
	               |	РегистрСведений.ЛБ_КлиентыВПеречнях.СрезПоследних(
	               |			&Дата,
	               |			Залогодатель = &Залогодатель
	               |				И ВидПеречня = &ВидПеречня) КАК ЛБ_КлиентыВПеречняхСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ"; 

	СписокПеречней = Новый СписокЗначений;
	СписокПеречней.Добавить(Перечисления.ЛБ_ВидыПеречней.Террористы);  
	СписокПеречней.Добавить(Перечисления.ЛБ_ВидыПеречней.ФРОМУ);
	СписокПеречней.Добавить(Перечисления.ЛБ_ВидыПеречней.МВК);
	СписокПеречней.Добавить(Перечисления.ЛБ_ВидыПеречней.ООН);
	
	Для каждого Эл из СписокПеречней Цикл 
		Запрос.УстановитьПараметр("ВидПеречня", Эл.Значение);
	
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда  
			Если Выборка.СтатусКлиентаВПеречне = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Исключен Тогда
				Продолжить;
			КонецЕсли;	
			Если Выборка.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.Террористы Тогда
				ОбщегоНазначения.СообщитьПользователю("Клиент " + СокрЛП(ФИО) + " найден в перечне террористов. Операции с клиентом запрещены!");  
				РезультатПроверки = Ложь;
			ИначеЕсли Выборка.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ФРОМУ Тогда
				ОбщегоНазначения.СообщитьПользователю("Клиент " + СокрЛП(ФИО) + " найден в перечне ФРОМУ. Операции с клиентом запрещены!");  
				РезультатПроверки = Ложь;
		    ИначеЕсли Выборка.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.МВК Тогда
				ОбщегоНазначения.СообщитьПользователю("Клиент " + СокрЛП(ФИО) + " найден в списке МВК. Операции с клиентом запрещены!");  
				РезультатПроверки = Ложь;
			ИначеЕсли Выборка.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ООН Тогда
				ОбщегоНазначения.СообщитьПользователю("Клиент " + СокрЛП(ФИО) + " найден в перечне ООН. Операции с клиентом запрещены!");  
				РезультатПроверки = Ложь;		
			КонецЕсли;
		КонецЕсли;	
	Конеццикла;     
	
	Если РезультатПроверки И НЕ Плательщик = ЗалоговыйБилет.Залогодатель Тогда
		//проверим владельца залогового билета
		Запрос.УстановитьПараметр("Залогодатель", ЗалоговыйБилет.Залогодатель);  
		
		Для каждого Эл из СписокПеречней Цикл 
			Запрос.УстановитьПараметр("ВидПеречня", Эл.Значение);
		
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда   
				Если Выборка.СтатусКлиентаВПеречне = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Исключен Тогда
					Продолжить;
				КонецЕсли;	
				Если Выборка.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.Террористы Тогда
					ОбщегоНазначения.СообщитьПользователю("Заемщик найден в перечне террористов. Операции с клиентом запрещены!");  
					РезультатПроверки = Ложь;
				ИначеЕсли Выборка.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ФРОМУ Тогда
					ОбщегоНазначения.СообщитьПользователю("Заемщик найден в перечне ФРОМУ. Операции с клиентом запрещены!");  
					РезультатПроверки = Ложь;
		        ИначеЕсли Выборка.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.МВК Тогда
					ОбщегоНазначения.СообщитьПользователю("Заемщик найден в списке МВК. Операции с клиентом запрещены!");  
					РезультатПроверки = Ложь;
				ИначеЕсли Выборка.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ООН Тогда
					ОбщегоНазначения.СообщитьПользователю("Заемщик найден в перечне ООН. Операции с клиентом запрещены!");  
					РезультатПроверки = Ложь;		
				КонецЕсли;
			КонецЕсли;	
		Конеццикла;  
	КонецЕсли;	

	Возврат РезультатПроверки;
КонецФункции	

&НаСервере
Функция ПроверкаКлиента() 
	ВсеОК = Истина;
	Если СуммаОплаты = 0 Тогда    
		Отбор = новый Структура;
		Отбор.Вставить("КлючСтроки", 2); 
		СтрокиС = ТаблицаСостояний.НайтиСтроки(Отбор);  
		Если НЕ СтрокиС.Количество() = 0 Тогда			
		   СтатусЗБ = СтрокиС.Получить(0).Статус;
		   Если НЕ СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Отгружен Тогда
			   Сообщить("Не определена сумма оплаты! Документ не может быть записан.");
			   Возврат ложь; 
		   КонецЕсли;
	    Иначе 
		    Сообщить("Не определена сумма оплаты! Документ не может быть записан.");
		    Возврат ложь;
		КонецЕсли;   
	КонецЕсли;    
	
	//Если НЕ Выкуп Тогда
	//	Отбор = Новый структура;
	//	Отбор.Вставить("КлючСтроки", 3);
	//	Строки = ТаблицаСостояний.НайтиСтроки(Отбор);  
	//	СтрКон = Строки.Получить(0);     
	//	Если НЕ ПредельныйСрокЗайма = Дата(1,1,1) И ПредельныйСрокЗайма < СтрКон.ДатаВозврата Тогда 
	//		ОбщегоНазначения.СообщитьПользователю("Дата возврата " + Формат(СтрКон.ДатаВозврата, "ДФ=dd.MM.yyyy") + " больше предельного срока займа " + Формат(ПредельныйСрокЗайма, "ДФ=dd.MM.yyyy") + ".");
	//		//Возврат ложь;
	//	КонецЕсли;	
	//КонецЕсли;	
	
	ВозрастКлиента = ЛБ_ОбщийМодуль.ВычислитьВозраст(ДатаРождения);
	Если ВозрастКлиента  < 18 Тогда
		// ++ Сербаев 20.06.2023 
        //Сообщить("Клиенту " + Строка(ВозрастКлиента) + " лет, работа с несовершеннолетними клиентами не осуществляется!", СтатусСообщения.Важное);
		ТекстОшибки = СтрШаблон("Клиенту %1 %2, работа с несовершеннолетними клиентами не осуществляется!", Строка(ВозрастКлиента), ЛБ_ОбщегоНазначения.ОписаниеВозраста(ВозрастКлиента));
	    ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		// -- Сербаев 20.06.2023
		ВсеОК = ложь;
	КонецЕсли;	
	
	Если НЕ ПроверитьКлиентаПоПеречням() Тогда
		ВсеОК = ложь;
	КонецЕсли; 
	
	//Если НЕ Плательщик = ЗалоговыйБилет.Залогодатель Тогда
	//	Если НЕ ЗначениеЗаполнено(ДоверенностьПлательщика) И Тогда
	//		Сообщить("Не выбрана доверенность представителя заемщика");
	//		ВсеОк = ложь;
	//	КонецЕсли;
	//КонецЕсли;	
		
	Возврат ВсеОК;
КонецФункции    

&НаСервере
Функция ПроверкаЗаполненияДокумента(НовыйДокумент) 
	Результат = Истина;
	Если ((НовыйДокумент.ДокументВид = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ) ИЛИ 
	   (НовыйДокумент.ДокументВид = Справочники.ВидыДокументовФизическихЛиц.ВидНаЖительство И НовыйДокумент.ДокументВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность)) Тогда
	    Если НовыйДокумент.ДокументВид = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ Тогда 			    
			Парам = Новый Структура("Серия, Номер", СокрЛП(НовыйДокумент.ДокументСерия), СокрЛП(НовыйДокумент.ДокументНомер));
			Если ЛБ_ОбменLX.ПаспортНедействителен(Парам) Тогда 
				Сообщить("Документ найден в списке недействительных паспортов!");
				Результат = ложь; 
			ИначеЕсли НЕ ЛБ_ОбщийМодуль.ПроверитьПаспортРФДействует(НовыйДокумент.ДатаРождения, НовыйДокумент.ДокументДатаВыдачи) Тогда
				Сообщить("Документ удостоверяющий личность залогодателя просрочен!");
			    Результат = ложь;	
			КонецЕсли;	
		ИначеЕсли НЕ ЛБ_ОбщийМодуль.ПроверитьПаспортРФДействует(НовыйДокумент.ДатаРождения, НовыйДокумент.ДокументДатаВыдачи) Тогда
			Сообщить("Документ удостоверяющий личность залогодателя просрочен!");
		    Результат = ложь;   
		КонецЕсли;	
	ИначеЕсли (НовыйДокумент.ДокументВид = Справочники.ВидыДокументовФизическихЛиц.СвидетельствоОРождении) И НЕ ЛБ_ОбщийМодуль.ПроверитьСвидетельствоОРожденииДействует(НовыйДокумент.ДатаРождения, ДатаДок) Тогда
		Сообщить("Документ удостоверяющий личность залогодателя просрочен!");
	    Результат = ложь;
	КонецЕсли;	
	Если ЛБ_ОбщийМодуль.ДокументСоСрокомДействия(Гражданство, НовыйДокумент.ДокументВидДокументаЗалогодателя, НовыйДокумент.ДокументВид) тогда
		Если НЕ ЗначениеЗаполнено(НовыйДокумент.ДокументСрокДействия) Тогда
			Сообщить("Для документ удостоверяющего личность залогодателя необходимо заполнить срок действия!");
	        Результат = ложь;
		ИначеЕсли НовыйДокумент.ДокументСрокДействия <	НачалоДня(ДатаДок) Тогда
			Сообщить("Документ удостоверяющий личность залогодателя просрочен!");
	        Результат = ложь;
		КонецЕсли;	
	КонецЕсли;	 
	Если НЕ НовыйДокумент.Гражданство = Справочники.СтраныМира.Россия Тогда
		Отбор = Новый Структура; 
		Отбор.Вставить("Клиент", НовыйДокумент.Залогодатель);
		Строки = НовыйДокумент.ДополнительныеДокументыПравоПребыванияРФ.НайтиСтроки(Отбор);
		Если Строки.Количество() = 0 Тогда 
			Сообщить("Не выбран документ удостоверяющий право пребывания клиента на территории РФ!");
	        Результат = ложь;
		Иначе                  
			ЕстьДокументГражданствоНЕРФ = ложь;
			Для каждого Стр Из Строки Цикл
				//Если ЛБ_ОбщийМодуль.ДокументСоСрокомДействия(Гражданство, Стр.ДокументЗалогодателя, Стр.ВидДокумента) тогда 
				//	Если НЕ ЗначениеЗаполнено(НовыйДокумент.ДокументСрокДействия) Тогда
				//		Продолжить;
				//	ИначеЕсли НовыйДокумент.ДокументСрокДействия <	НачалоДня(ДатаДок) Тогда
				//		Продолжить;
				//	КонецЕсли;	
				//    ЕстьДокументГражданствоНЕРФ = Истина;
				//	Прервать;  
				//Иначе
				//	ЕстьДокументГражданствоНЕРФ = Истина;
				//	Прервать; 
				//КонецЕсли;	
				Если Стр.ДокументГражданство = Гражданство Тогда
					ЕстьДокументГражданствоНЕРФ = Истина;
					Если Стр.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ВидНаЖительство Тогда 
					    Если НЕ ЛБ_ОбщийМодуль.ДокументСоСрокомДействия(Стр.ДокументГражданство, Стр.ВидДокументаЗалогодателя, Стр.ВидДокумента) тогда
					         ТекстСообщения1 = ЛБ_ОбщийМодуль.ПроверитьСменаВидНаЖительствоВозраст(ДатаРождения, Стр.ДокументДатаВыдачи); 
							 Если НЕ Пустаястрока(ТекстСообщения1) тогда 
								 Сообщить(ТекстСообщения1); 
								 Результат = ложь;
							 КонецЕсли;	  								  
						 КонецЕсли;       
						 ТекстСообщения2 = ЛБ_ОбщийМодуль.ПроверитьСменаВидНаЖительствоКонтактнаяИнформация(Плательщик, Стр.ДокументДатаВыдачи, ДатаДок); 
						 Если НЕ Пустаястрока(ТекстСообщения2) тогда 
							 Сообщить(ТекстСообщения2); 
							 Результат = ложь;
						 КонецЕсли;	
					КонецЕсли;	 
				КонецЕсли;	
			КонецЦикла;	
			Если НЕ ЕстьДокументГражданствоНЕРФ Тогда
				Сообщить("У клиента нет действующего документа, удостоверяющего право пребывания на территории РФ!");
				Результат = ложь;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	
	// ++ Сербаев 08.06.2023  (Проверка документа Вид на жительство на действительность)
	Если НовыйДокумент.ДокументВид = Справочники.ВидыДокументовФизическихЛиц.ВидНаЖительство Тогда
		СтруктураД = Новый Структура("ДокументСрокДействия, ДокументДатаВыдачи", НовыйДокумент.ДокументСрокДействия, НовыйДокумент.ДокументДатаВыдачи);        
	    Если ЛБ_ОбщийМодуль.ПроверитьДействительностьВидаНаЖительство(СтруктураД, ДатаРождения, ДатаДок) Тогда
		    ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Документ вид на жительство просрочен!'"));
			Результат = ложь;
		КонецЕсли;
	КонецЕсли;
    // -- Сербаев 08.06.2023
	
	Возврат Результат;
КонецФункции


&НаСервере
Функция СоздатьДокументНаСервере()  
	Если ЗначениеЗаполнено(ДокументОплаты) Тогда
		ДокументОбъект = ДокументОплаты.ПолучитьОбъект(); 
		ДокументОбъект.Дата = ДатаДок;
	Иначе	
	    ДокументОбъект = Документы.ЛБ_ОперацияПоЗалогу.СоздатьДокумент(); 
		ДокументОбъект.Дата = ДатаДок;
		ДокументОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов;  
	    ДокументОбъект.ПредыдущаяОперация = ЗалоговыйБилет;
        ДокументОбъект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить(); 
        ДокументОбъект.Товары.Загрузить(ДокументОбъект.ПредыдущаяОперация.Товары.Выгрузить());
		ДокументОбъект.Вставки.Загрузить(ДокументОбъект.ПредыдущаяОперация.Вставки.Выгрузить());
		ДокументОбъект.ДополнительныеМеталлы.Загрузить(ДокументОбъект.ПредыдущаяОперация.ДополнительныеМеталлы.Выгрузить());
		ДокументОбъект.Дефекты.Загрузить(ДокументОбъект.ПредыдущаяОперация.Дефекты.Выгрузить()); 
		Если ДокументОбъект.ПредыдущаяОперация.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда
			СтрокиТоварыУдалить = Новый СписокЗначений;
			СтрокиДефектыУдалить = Новый СписокЗначений;
			СтрокиВставкиУдалить = Новый СписокЗначений;
			СтрокиДополнительныеМеталлыУдалить = Новый СписокЗначений;
			Для каждого СтрТ Из ДокументОбъект.Товары Цикл  
				Если НЕ СтрТ.Переоформить Тогда
					СтрокиТоварыУдалить.Добавить(СтрТ);
					ОтборТ = Новый Структура;
					ОтборТ.Вставить("КлючСтроки", СтрТ.КлючСтроки); 
					
					СтрокиД = ДокументОбъект.Дефекты.НайтиСтроки(ОтборТ);
					Для каждого СтрД Из СтрокиД Цикл 
						СтрокиДефектыУдалить.Добавить(СтрД);
					КонецЦикла;	 
					
					СтрокиВ = ДокументОбъект.Вставки.НайтиСтроки(ОтборТ);
					Для каждого СтрВ Из СтрокиВ Цикл 
						СтрокиВставкиУдалить.Добавить(СтрВ);
					КонецЦикла;	
					
					СтрокиДМ = ДокументОбъект.ДополнительныеМеталлы.НайтиСтроки(ОтборТ);
					Для каждого СтрДМ Из СтрокиДМ Цикл 
						СтрокиДополнительныеМеталлыУдалить.Добавить(СтрДМ);
					КонецЦикла;	
				КонецЕсли;	
			КонецЦикла;	        
			Для каждого Эл Из СтрокиТоварыУдалить Цикл 
				ДокументОбъект.Товары.Удалить(Эл.Значение);
			КонецЦикла;	
			Для каждого Эл Из СтрокиДефектыУдалить Цикл 
				ДокументОбъект.Дефекты.Удалить(Эл.Значение);
			КонецЦикла;	 
            Для каждого Эл Из СтрокиВставкиУдалить Цикл 
				ДокументОбъект.Вставки.Удалить(Эл.Значение);
			КонецЦикла;	 
            Для каждого Эл Из СтрокиДополнительныеМеталлыУдалить Цикл 
				ДокументОбъект.ДополнительныеМеталлы.Удалить(Эл.Значение);
			КонецЦикла;	 			 
		КонецЕсли;	
		ДокументОбъект.ПредыдущаяОперация = ЗалоговыйБилет; 
		ДокументОбъект.СтатусЗалогодателя = ЛБ_УправлениеЛомбардом.ПолучитьТекущийСтатусКлиента(ДокументОбъект.Дата, ДокументОбъект.ПредыдущаяОперация.Залогодатель);
	КонецЕсли;	
	ДокументОбъект.Ломбард = Ломбард; 
	ДокументОбъект.ОтветственныйПользователь = ОтветственныйПользователь;
	ДокументОбъект.ОтветственныйСотрудник = ОтветственныйСотрудник;
	ДокументОбъект.Комментарий = Комментарий;
	ДокументОбъект.Залогодатель = Плательщик;  
	ДокументОбъект.ДокументЗалогодателя = ДокументПлательщика;
	ДокументОбъект.ДоверенностьПредставителя = ДоверенностьПлательщика;
	ДокументОбъект.СхемаКредитования = ЗалоговыйБилет.СхемаКредитования;  
	ДокументОбъект.СрокЗалога = ЗалоговыйБилет.СрокЗалога; 
	ДокументОбъект.Акция = ЗалоговыйБилет.Акция;
	ДокументОбъект.НомерЗалоговогоБилета = ЗалоговыйБилет.НомерЗалоговогоБилета;  
	ДокументОбъект.НомерДопСоглашения = НомерДопСоглашения;
	ДокументОбъект.БезналичнаяОплата = БезналичнаяОплата;
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("Залогодатель", ДокументОбъект.Залогодатель);
    Запрос.Текст = "ВЫБРАТЬ
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРождения КАК МестоРождения,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Email КАК Email,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПрописке КАК АдресПоПрописке,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Пол КАК Пол,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК Телефон,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество
                   |ИЗ
                   |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументОбъект.Фамилия = Выборка.Фамилия;
        ДокументОбъект.Имя = Выборка.Имя;
        ДокументОбъект.Отчество = Выборка.Отчество;		
		ДокументОбъект.ДатаРождения = Выборка.ДатаРождения;		
		ДокументОбъект.Гражданство = Выборка.Гражданство;
		ДокументОбъект.Пол = Выборка.Пол;  
		ДокументОбъект.ВозрастЗалогодателя = ЛБ_ОбщийМодуль.ВычислитьВозраст(ДокументОбъект.ДатаРождения);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДокументЗалогодателя", ДокументОбъект.ДокументЗалогодателя);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНачалоДействия КАК ДокументНачалоДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&Дата, ДокументЗалогодателя = &ДокументЗалогодателя) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументОбъект.ДокументВидДокументаЗалогодателя = Выборка.ВидДокументаЗалогодателя;
		ДокументОбъект.ДокументВид = Выборка.ВидДокумента;
		ДокументОбъект.ДокументГражданство = Выборка.Гражданство;
		ДокументОбъект.ДокументСерия = Выборка.ДокументСерия;
		ДокументОбъект.ДокументНомер = Выборка.ДокументНомер;
		ДокументОбъект.ДокументДатаВыдачи = Выборка.ДокументДатаВыдачи;
		ДокументОбъект.ДокументКемВыдан = Выборка.ДокументКемВыдан;
		ДокументОбъект.ДокументКодПодразделения = Выборка.ДокументКодПодразделения;
		ДокументОбъект.ДокументНачалоДействия = Выборка.ДокументНачалоДействия;
		ДокументОбъект.ДокументСрокДействия = Выборка.ДокументСрокДействия;
	КонецЕсли;
	
	ДокументОбъект.ДополнительныеДокументыПравоПребыванияРФ.Загрузить(ДопДокументы.Выгрузить());
	
	Для каждого стр из ТаблицаТоваров Цикл 		
		Отбор = новый структура;
		Отбор.Вставить("ОбъектЗалога", стр.ОбъектЗалога);
		
		СтрокиТ = ДокументОбъект.Товары.НайтиСтроки(Отбор); 
		Если НЕ СтрокиТ.Количество() = 0 Тогда
			СтрТ = строкиТ.получить(0); 
		Иначе
			СтрТ = ДокументОбъект.Товары.Добавить(); 
			СтрТ.ОбъектЗалога = стр.ОбъектЗалога;
		КонецЕсли;	   
		СтрТ.СуммаОценки = Стр.ЗадолженностьКон;
		СтрТ.СуммаОплаты = Стр.СуммаОплаты;
	Конеццикла;	
	
	Отбор = Новый структура;
	Отбор.Вставить("КлючСтроки", 2);
	Строки = ТаблицаСостояний.НайтиСтроки(Отбор);  
	СтрНач = Строки.Получить(0);
	ДокументОбъект.ДатаВыкупа = СтрНач.ДатаВозврата;
    ДокументОбъект.ДатаВыкупаЛьготная = СтрНач.ДатаВозвратаЛьготная;
	
	ДокументОбъект.СуммаСсуды = ТаблицаТоваров.Итог("ЗадолженностьКон");
	ДокументОбъект.СуммаОплаты = СуммаОплаты;
	ДокументОбъект.СуммаОплатыПроценты = СуммаОплатыПроценты;
	ДокументОбъект.СуммаОплатыСсуда = СуммаОплатыСсуда;
	ДокументОбъект.Выкуп = Выкуп;
	ДокументОбъект.ВыдачаЗалога = ВыдачаЗалога;  
	
	ДокументОбъект.НачислениеПроцентовДетально.Очистить();
	Для каждого стр из ТаблицаОплатДетально Цикл 
	    НоваяСтр = ДокументОбъект.НачислениеПроцентовДетально.Добавить(); 
		ЗаполнитьЗначенияСвойств(НоваяСтр, стр);  
		Если Стр.ДеньНач = 1 Тогда     
			СтавкаП = Стр.ПроцентнаяСтавкаБазовая; 
			Если Стр.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Акционная Тогда
				Если НЕ Стр.ПроцентнаяСтавкаАкция = 0 Тогда
					СтавкаП = Стр.ПроцентнаяСтавкаАкция;
				ИначеЕсли НЕ Стр.ОтклонениеАкцияОтносительное = 0 Тогда	 
					СтавкаП = Стр.ПроцентнаяСтавкаБазовая + Стр.ПроцентнаяСтавкаБазовая*Стр.ОтклонениеАкцияОтносительное/100;
				ИначеЕсли НЕ Стр.ОтклонениеАкцияАбсолютное = 0 Тогда
					СтавкаП = Стр.ПроцентнаяСтавкаБазовая + Стр.ОтклонениеАкцияАбсолютное;
			    КонецЕсли; 
			КонецЕсли;	
			ДокументОбъект.ПроцентнаяСхема = ставкаП;
		КонецЕсли;	
	КонецЦиклА;    
	
	СуммаПроцентов = ДокументОбъект.НачислениеПроцентовДетально.Итог("СуммаПроцентов");
	//Если ДокументОбъект.СхемаКредитования.ПризнакПримененияГибкогоПроцента Тогда
	//	//заполним новый график платежей если нужно
	//	Если НЕ ДокументОбъект.СхемаКредитования.БезПродленияДоговора Тогда
	//		Если ДокументОбъект.Выкуп Тогда
	//            ПродлитьДоговорДни = 0;				
	//		Иначе	
	//			ПроцентДляПродленияДоговора = ?(СуммаПроцентов = 0, 0, ДокументОбъект.СуммаОплатыПроценты/СуммаПроцентов);
	//			Если ПроцентДляПродленияДоговора >= 0.9 Тогда 
	//				КолДней = Окр(ДокументОбъект.СрокЗалога*ПроцентДляПродленияДоговора, 3);
	//				Если Цел(КолДней) = КолДней тогда
	//					ПродлитьДоговорДни = КолДней;
	//				Иначе 
	//					ПродлитьДоговорДни = Цел(КолДней) + 1; 
	//				КонецЕсли;	
	//			Иначе      
	//				ПродлитьДоговорДни = 0;
	//			КонецЕсли;   
	//		КонецЕсли;	
	//	Иначе
	//		ПродлитьДоговорДни = 0;
	//	КонецЕсли;
	//	
	//	ДокументОбъект.ГрафикПлатежей.Очистить();
	//	Если  НЕ (ПродлитьДоговорДни = 0) Тогда
	//		ПричинаПримененияНовая = ЛБ_УправлениеЛомбардом.ПолучитьПричинуПримененияГибкийПроцент(ДокументОбъект.СхемаКредитования, Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Продлен);
	//		ОтборС = Новый структура;
	//		ОтборС.Вставить("ПричинаПрименения", ПричинаПримененияНовая);
	//		СтрокиС = ДокументОбъект.ПредыдущаяОперация.ПроцентныеСтавкиПоПериодам.НайтиСтроки(ОтборС);
	//		ДатаНачала = НачалоДня(ДокументОбъект.Дата) + (60 * 60 * 24);
	//		НоваяДатаВыкупа = ДокументОбъект.ДатаВыкупа + ПродлитьДоговорДни*(60 * 60 * 24);
	//		Для сч = 0 По СтрокиС.Количество()-1 Цикл 
	//			СтрС = СтрокиС.Получить(сч); 
	//			Если СтрС.ДеньНачалаПрименения = 1 Тогда
	//				ДатаНач = ДатаНачала;
	//			Иначе 
	//				ДатаНач = НачалоДня(ДатаНачала + СтрС.ДеньНачалаПрименения*(60 * 60 * 24));
	//			КонецЕсли;	
	//			Если ДатаНач > НоваяДатаВыкупа Тогда 
	//		 		Прервать;
	//			КонецЕсли;	
	//			
	//			сч1 = сч + 1;
	//			Если сч1 >= СтрокиС.Количество() Тогда
	//				ДатаКон = НоваяДатаВыкупа; 
	//				ДеньКон = (НоваяДатаВыкупа - ДатаНач) / (60 * 60 * 24);
	//			Иначе   
	//				СтрС1 = СтрокиС.Получить(сч1);
	//				ДатаКонца = НачалоДня(ДатаНачала + (СтрС1.ДеньНачалаПрименения-1)*(60 * 60 * 24)); 
	//				Если ДатаКонца > ДокументОбъект.ДатаВыкупа Тогда
	//					ДатаКон = НоваяДатаВыкупа; 
	//				    ДеньКон = (НоваяДатаВыкупа - ДатаНач) / (60 * 60 * 24);
	//				Иначе
	//					ДатаКон = ДатаКонца; 
	//					ДеньКон = СтрС1.ДеньНачалаПрименения-1;
	//				КонецЕсли;	
	//			КонецЕсли;	
	//			
	//			Если НЕ (НачалоДня(ДатаКон) < НачалоДня(ДатаНач)) тогда		
	//				СтрП = ДокументОбъект.ГрафикПлатежей.Добавить();   
	//				СтрП.ВидПроцентнойСтавки = СтрС.ВидПроцентнойСтавки; 
	//				СтрП.ДатаНач = ДатаНач;
	//				СтрП.ДатаКон = ДатаКон;
	//				СтрП.ДеньНач = СтрС.ДеньНачалаПрименения;  
	//				СтрП.ДеньКон = ДеньКон; 
	//				СтрП.ПроцентнаяСтавкаБазовая = СтрС.ПроцентнаяСтавка;
	//				СтрП.ПроцентнаяСтавкаАкция = СтрС.ПроцентнаяСтавкаАкция;
	//				СтрП.ОтклонениеАкцияОтносительное = СтрС.ОтклонениеАкцияОтносительное; 
	//				СтрП.ОтклонениеАкцияАбсолютное = СтрС.ОтклонениеАкцияАбсолютное;  
	//				ОтборП = Новый Структура;
	//				ОтборП.Вставить("ДеньНач", СтрС.ДеньНачалаПрименения);
	//				СтрокиП = ДокументОбъект.НачислениеПроцентовДетально.НайтиСтроки(ОтборП);
	//				Если НЕ СтрокиП.Количество() = 0 Тогда
	//	                СтрП.СуммаПроцентов = СтрокиП.Получить(0).СуммаПроцентов;
	//					СтрП.СуммаПроцентовДень = СтрокиП.Получить(0).СуммаПроцентовДень; 
	//				КонецЕсли;	
	//			КонецЕсли;	
	//		Конеццикла;	
	//	КонецЕсли;	
	//КонецЕсли;  
	
	ДокументОбъект.ТоварыВыкупленные.Очистить();
	Для каждого стр из ТаблицаТоваров Цикл 
		Если НЕ стр.ВернутьЗалог И НЕ Стр.СтатусПослеОплаты = Перечисления.ЛБ_СтатусыОбъектовЗалога.Изъят Тогда
			Продолжить;
		КонецЕсли;	
		НоваяСтр = ДокументОбъект.ТоварыВыкупленные.Добавить();
		НоваяСтр.ОбъектЗалога = Стр.ОбъектЗалога;  
		НоваяСтр.СуммаОценки = Стр.СуммаОценки;
	Конеццикла;	

	    	 	
	Если ПроверкаЗаполненияДокумента(ДокументОбъект) Тогда	
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		Попытка           
		    ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение); 
			ДокументОплаты = ДокументОбъект.Ссылка;
			Возврат ложь;
		Исключение   
			ОбщегоНазначения.СообщитьПользователю("Не удалось провести документ " + строка(ДокументОбъект.Ссылка));
			Возврат Истина;
		КонецПопытки;  
	Иначе  
		Возврат Истина;
	КонецЕсли;	
КонецФункции	
	
&НаСервере
Процедура ЗаполнитьСписокВыбораДоверенностейПлательщика() 
	Элементы.Доверенность.СписокВыбора.Очистить();
	Если Плательщик = ЗалоговыйБилет.Залогодатель Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.УстановитьПараметр("Клиент", ЗалоговыйБилет.Залогодатель);
	Запрос.УстановитьПараметр("Представитель", Плательщик);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДоверенностиСрезПоследних.Доверенность КАК Доверенность
	               |ИЗ
	               |	РегистрСведений.ЛБ_Доверенности.СрезПоследних(
	               |			&Дата,
	               |			ЗалоговыйБилет = &ЗалоговыйБилет
	               |				И Клиент = &Клиент
	               |				И Доверенность.ПредставительКлиента = &Представитель
	               |				И СтатусДоверенности = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыДоверенностей.ДоверенностьОформлена)) КАК ЛБ_ДоверенностиСрезПоследних";  
	Выборка = Запрос.Выполнить().Выбрать(); 	
	Пока Выборка.Следующий() Цикл  
		Если Выборка.Доверенность.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Наследство Тогда   
			ОписаниеДоверенности = "Свидетельство о праве на наследство № " + СокрЛП(Выборка.Доверенность.НомерДоверенности) + " от " + Формат(Выборка.Доверенность.ДатаДоверенности, "ДФ=dd.MM.yyyy");
		Иначе	
			Если Выборка.Доверенность.СрокДействияДоверенности  < НачалоДня(ДатаДок) Тогда
				Продолжить;
			КонецЕсли;	      
			ОписаниеДоверенности = "Доверенность " + НРег(строка(Выборка.Доверенность.ВидДоверенности)) + " № " +
					   ?(НЕ ПустаяСтрока(Выборка.Доверенность.НомерДоверенности), СокрЛП(Выборка.Доверенность.НомерДоверенности), "б/н") + " от " + Формат(Выборка.Доверенность.ДатаДоверенности, "ДФ=dd.MM.yyyy") +
					   " действует до " + Формат(Выборка.Доверенность.СрокДействияДоверенности, "ДФ=dd.MM.yyyy");   
		КонецЕсли;			   
		Элементы.Доверенность.СписокВыбора.Добавить(Выборка.Доверенность, ОписаниеДоверенности);
	Конеццикла;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекстДоверенности()   
	Если ЗначениеЗаполнено(ДоверенностьПлательщика) Тогда  
		Если ДоверенностьПлательщика.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Наследство Тогда   
			Доверенность = "Свидетельство о праве на наследство № " + СокрЛП(ДоверенностьПлательщика.НомерДоверенности) + " от " + Формат(ДоверенностьПлательщика.ДатаДоверенности, "ДФ=dd.MM.yyyy"); 
		Иначе	
		    Доверенность = "Доверенность " + НРег(строка(ДоверенностьПлательщика.ВидДоверенности)) + " № " +                                                                                               		
				   ?(НЕ ПустаяСтрока(ДоверенностьПлательщика.НомерДоверенности), СокрЛП(ДоверенностьПлательщика.НомерДоверенности), "б/н") + " от " + Формат(ДоверенностьПлательщика.ДатаДоверенности, "ДФ=dd.MM.yyyy") +
				   " действует до " + Формат(ДоверенностьПлательщика.СрокДействияДоверенности, "ДФ=dd.MM.yyyy"); 
		КонецЕсли;		   
	Иначе
		Доверенность = "";
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПроверитьПлательщикЭтоЗаемщик() 
	Возврат ?(Плательщик = ЗалоговыйБилет.Залогодатель, Истина, Ложь);
КонецФункции	

&НаКлиенте
Процедура ПослеВыбораПлательщика(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли; 
	
	СписокСС = ПолучитьСлужебныеСтатусыКлиента(Результат.Залогодатель);  
	Если НЕ СписокСС.Количество() = 0 Тогда 
		ПредупреждениеП = "";
		Для каждого Элемент из СписокСС Цикл 
			СтруктураВозврата = ПроверитьСлужебныйСтатус(Элемент.Значение);
			Если СтруктураВозврата.Запрет Тогда    
				ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов");
				//+МАН 03.04.26 Изменено сообщение. Заявка 3759
				//Предупреждение("Для клиента " + СокрЛП(Результат.Залогодатель) + " определен запрет на операцию " + Строка(ВидОперации), 60, "Проверка служебных статусов клиента");
				Предупреждение("Клиенту " + СокрЛП(Результат.Залогодатель) + " присвоен служебный статус """ + Строка(Элемент.Значение) + """, в связи с чем запрещена операция: """ + Строка(ВидОперации) + """", 60, "Проверка служебных статусов клиента");
				//-МАН
				Возврат;  
			Иначе
				ПредупреждениеП = СтруктураВозврата.Предупредить;
			КонецЕсли;	
		КонецЦикла;   
		Если НЕ ПустаяСтрока(ПредупреждениеП) Тогда
			Ответ = Вопрос(ПредупреждениеП + " Продолжить?", РежимДиалогаВопрос.ОКОтмена, , "Проверка служебных статусов клиента"); 
			Если Ответ = КодВозвратаДиалога.Отмена Тогда  
			    Возврат;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;  

	Если Результат.Свойство("Залогодатель") Тогда 
		Плательщик = Результат.Залогодатель;
		ЗаполнитьКонтакнуюИнформацию();
	конецЕсли;	
	
	Если Результат.Свойство("ДокументЗалогодателя") Тогда
		ДокументПлательщика = Результат.ДокументЗалогодателя; 
		ЗаполнитьИнформациюОДокументе();
	КонецЕсли;	  
	ЗаполнитьДопДокументы();
	
	Если НЕ ПроверитьПлательщикЭтоЗаемщик() Тогда
		Элементы.ГруппаДоверенность.Видимость = Истина;
		ЗаполнитьСписокВыбораДоверенностейПлательщика();
		Если НЕ Элементы.Доверенность.СписокВыбора.Количество() = 0 Тогда 
			ДоверенностьПлательщика = Элементы.Доверенность.СписокВыбора.Получить(0).Значение;
			ЗаполнитьТекстДоверенности();
		КонецЕсли;      
		ПроверитьОХПоПлательщику();
		Если НЕ СуммаОплаты = 0 тогда 			
		    ЗаполнитьСтрокуСостоянияПослеОплаты(Выкуп); 
			Если Выкуп Тогда
				ЗаполнитьТоварыПослеВыкупа(ложь);           				
			КонецЕсли;                                  
			ЗаполнитьСостояниеТоваровПерезалог();
		КонецЕсли;		
	иначе
		Элементы.ГруппаДоверенность.Видимость = ложь; 
		ДоверенностьПлательщика = ПредопределенноеЗначение("Документ.ЛБ_Доверенности.ПустаяСсылка");
	КонецЕсли;     	
	ИнформацияОплата();
    УстановитьВидимость();
КонецПроцедуры


&НаКлиенте
Процедура ФИОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура;
	Если ЗначениеЗаполнено(Плательщик) Тогда
		ПараметрыФормы.Вставить("Залогодатель", Плательщик);
	КонецЕсли;	  
    ПараметрыФормы.Вставить("Дата", ДатаДок);  	
	Если НЕ ЗначениеЗаполнено(ДокументОплаты) И НачалоДня(ДатаДок) = НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса()) Тогда
		ПараметрыФормы.Вставить("НаТекущуюДату", Истина);
	КонецЕсли;	
	ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов"));
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораПлательщика",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателя", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


&НаКлиенте
Процедура ПаспортНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура;
	Если ЗначениеЗаполнено(Плательщик) Тогда
		ПараметрыФормы.Вставить("Залогодатель", Плательщик);
	КонецЕсли;	
	ПараметрыФормы.Вставить("Дата", ДатаДок);
	Если НЕ ЗначениеЗаполнено(ДокументОплаты) И НачалоДня(ДатаДок) = НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса()) Тогда
		ПараметрыФормы.Вставить("НаТекущуюДату", Истина);
	КонецЕсли;	
	ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов"));
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораПлательщика",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателя", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


&НаКлиенте
Процедура ДоверенностьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВыбЭлемент = ЭтаФорма.ВыбратьИзСписка(Элемент.СписокВыбора, Элемент, 0);
	Если НЕ ВыбЭлемент = Неопределено Тогда 
		ДоверенностьПлательщика = ВыбЭлемент.Значение;    
		ЗаполнитьТекстДоверенности();  
		ПроверитьОХПоПлательщику();
		Если НЕ СуммаОплаты = 0 тогда
		    ЗаполнитьСтрокуСостоянияПослеОплаты(Выкуп); 
			Если Выкуп Тогда
				ЗаполнитьТоварыПослеВыкупа(Ложь);				 
	        КонецЕсли;
		КонецЕсли;   
		ЗаполнитьСостояниеТоваровПерезалог();
		ИнформацияОплата(); 		
	КонецЕсли;
КонецПроцедуры   

&НаКлиенте
Процедура ДоверенностьОчистка(Элемент, СтандартнаяОбработка)  
	ДоверенностьПлательщика = ПредопределенноеЗначение("Документ.ЛБ_Доверенности.ПустаяСсылка");
	ПроверитьОХПоПлательщику();
	Если НЕ СуммаОплаты = 0 тогда
		ЗаполнитьСтрокуСостоянияПослеОплаты(Выкуп); 
		Если Выкуп Тогда
			ЗаполнитьТоварыПослеВыкупа(Ложь);
		КонецЕсли;  
		ЗаполнитьСостояниеТоваровПерезалог();
		ИнформацияОплата(); 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура НаличныеПриИзменении(Элемент)
	Сдача = Наличные - СуммаОплаты;
КонецПроцедуры   

&НаСервере
Процедура ЗаполнитьСтрокуСостоянияПослеОплаты(ЭтоВыкуп = ложь)            
	Отбор = Новый структура;
	Отбор.Вставить("КлючСтроки", 2);
	Строки = ТаблицаСостояний.НайтиСтроки(Отбор);  
	СтрНач = Строки.Получить(0);  
	Если СтрНач.СуммаЗайма + СтрНач.СуммаПроцентовДолг = СуммаОплаты Тогда
		ЭтоВыкуп = Истина;
	КонецЕсли;	
	СуммаПроцентовНач = СтрНач.СуммаПроцентовДолг;  
	СуммаПроцентовДень = СтрНач.СуммаПроцентовДень;
	ДатаНачалаРасчетаНач = СтрНач.ДатаНачалаРасчета;
	НомерДопСоглашенияНач = СтрНач.НомерДС;
	СтатусЗБ = СтрНач.Статус;
	Если СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят ИЛИ 
		 СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен ИЛИ
		 СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Остановлен ИЛИ 
		 СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Наследство тогда
	    БезПродленияДоговора = Истина;
	Иначе	
        БезПродленияДоговора = ЗалоговыйБилет.СхемаКредитования.БезПродленияДоговора;
	КонецЕсли;  
	ДатаНачалаРасчета = КонецДня(ДатаДок)+1;
	
	Отбор = Новый структура;
	Отбор.Вставить("КлючСтроки", 3);
	Строки = ТаблицаСостояний.НайтиСтроки(Отбор);  
	СтрКон = Строки.Получить(0);  

	Если ЭтоВыкуп Тогда  
		МожноЗакрытьБилет = Истина;
		Для каждого Стр из ТаблицаТоваров цикл
			Если Стр.СтатусОбъекта = Перечисления.ЛБ_СтатусыОбъектовЗалога.Выкуплен ИЛИ Стр.СтатусОбъекта = Перечисления.ЛБ_СтатусыОбъектовЗалога.Изъят Тогда
				Продолжить;
			КонецЕсли;	
			Если НЕ Стр.ВернутьЗалог Тогда
				МожноЗакрытьБилет = Ложь;
				Прервать;
			КонецЕсли;	
		КонецЦикла;
		
		Если СтрНач.Статус = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Отгружен Тогда
			СтрКон.Статус = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ГотовКОтправкеОХ; 
			ВыдачаЗалога = Ложь;
		Иначе	
			Если НЕ ОХ И МожноЗакрытьБилет Тогда
				СтрКон.Статус = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт; 
				ВыдачаЗалога = Истина;
			Иначе                                                              
				СтрКон.Статус = ?(СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Наследство, СтатусЗБ, Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтвественноеХранение);
				ВыдачаЗалога = Ложь;
			КонецЕсли;  
		КонецЕсли;	
		СтрКон.ПроцентнаяСтавка = 0; 			
		СтрКон.ДатаВозврата = Дата(1,1,1);
		СтрКон.ДатаВозвратаЛьготная = Дата(1,1,1);	
		СтрКон.СуммаЗайма = 0;  
        СтрКон.СуммаПроцентовДень = 0;
		СтрКон.СуммаПроцентовДолг = 0;
		//НомерДопСоглашения = НомерДопСоглашенияНач;  
		//СтрКон.НомерДС = НомерДопСоглашенияНач;
	Иначе	
		Если НЕ БезПродленияДоговора Тогда  
			СуммаПроцентовДеньРасчет = СтрНач.СуммаЗайма*СтрНач.ПроцентнаяСтавка/100;    
			ОстатокПроцентовНаНачалоРасчета = ЛБ_ОбщийМодуль.ПолучитьОстатокПроцентовНаДату(ДатаНачалаРасчетаНач, ЗалоговыйБилет);
			СуммаПроцентовНачислено = ЛБ_ОбщийМодуль.ПолучитьНачисленияПроцентов(?(ЗначениеЗаполнено(ДокументОплаты), ДокументОплаты, неопределено), ЗалоговыйБилет, ДатаНачалаРасчетаНач);  
			СуммаПроцентовНачислено = СуммаПроцентовНачислено + ОстатокПроцентовНаНачалоРасчета; 
			ПроцентДляПродленияДоговора = ?(СуммаПроцентовНач = 0, 0, СуммаОплатыПроценты/СуммаПроцентовНач);
			//Если ПроцентДляПродленияДоговора >= 0.9 Тогда    
			Если СуммаОплатыПроценты >= СуммаОплатыДляПродленияДоговора Тогда
				Если ПроцентДляПродленияДоговора = 1 Тогда 
					Если СуммаПроцентовНачислено = 0 Тогда
					    СуммаПроцентовНачислено = СуммаПроцентовНачислено + СуммаПроцентовНач;
					Иначе
						ДолгПоПроцентам = СуммаПроцентовНач - НачисленоПроцентов;
					    СуммаПроцентовНачислено = СуммаПроцентовНачислено + СуммаПроцентовНач - ДолгПоПроцентам;
                    КонецЕсли;
                    Коэфф = СуммаПроцентовНачислено/СуммаПроцентовДеньРасчет;  
					
					ПродлитьДоговорДни = Цел(Коэфф) + ?(Коэфф = Цел(Коэфф), 0, 1);
				Иначе	
					СуммаПроцентовНачислено = СуммаПроцентовНачислено + НачисленоПроцентов;
					Коэфф = СуммаПроцентовНачислено/СуммаПроцентовДеньРасчет;
					ПродлитьДоговорДни = Цел(Коэфф) + ?(Коэфф = Цел(Коэфф), 0, 1);
					
					СуммаПроцентовДолг = СтрНач.СуммаПроцентовДолг - СуммаОплатыПроценты;
					Коэфф = СуммаПроцентовДолг/СуммаПроцентовДеньРасчет;  
					КорректировкаПоДолгу = Цел(Коэфф) + ?(Коэфф = Цел(Коэфф), 0, 1);  
					
					ПродлитьДоговорДни = ПродлитьДоговорДни - КорректировкаПоДолгу;
				КонецЕсли;	
          	Иначе      
				ПродлитьДоговорДни = 0;
			КонецЕсли;  
			
			Отбор = Новый структура;
			Отбор.Вставить("КлючСтроки", 3);
			Строки = ТаблицаСостояний.НайтиСтроки(Отбор);  
			СтрКон = Строки.Получить(0); 
			СтрКон.Статус = ?(ПродлитьДоговорДни = 0, СтатусЗБ, Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Продлен); 
			Если НЕ ПродлитьДоговорДни = 0 Тогда  
				СтрКон.НомерДС = НомерДопСоглашенияНач + 1;
			ИначеЕсли (СуммаПроцентовНачислено = 0) И НЕ (СуммаОплатыСсуда = 0) Тогда
				СтрКон.НомерДС = НомерДопСоглашенияНач + 1;
			Иначе	
				СтрКон.НомерДС = НомерДопСоглашенияНач;
			КонецЕсли;	
			СтрКон.ПроцентнаяСтавка = СтрНач.ПроцентнаяСтавка; 	
			Если НЕ ПродлитьДоговорДни = 0 Тогда
				ДатаВыкупа = СтрНач.ДатаВозврата + ПродлитьДоговорДни*(60 * 60 * 24);  
				ДатаВыкупа = ?(ДатаВыкупа < ДатаНачалаРасчета, ДатаНачалаРасчета, ДатаВыкупа);
				ЛБ_УправлениеЛомбардом.ИсключитьДатаВыкупаПразничныйДень(ДатаВыкупа);
				ДатаВыкупаЛьготная = ЛБ_УправлениеЛомбардом.ПолучитьЛьготныйСрокЗалоговогоБилета(ДатаВыкупа);
			Иначе 
				ДатаВыкупа = СтрНач.ДатаВозврата;
				ДатаВыкупаЛьготная = СтрНач.ДатаВозвратаЛьготная;
			КонецЕсли;	
			СтрКон.ДатаВозврата = ДатаВыкупа;
			СтрКон.ДатаВозвратаЛьготная = ДатаВыкупаЛьготная;	
			СтрКон.СуммаЗайма = СтрНач.СуммаЗайма - СуммаОплатыСсуда;     
		    СтрКон.СуммаПроцентовДень = СтрКон.СуммаЗайма*СтрНач.ПроцентнаяСтавка/100;
			СтрКон.СуммаПроцентовДолг = СтрНач.СуммаПроцентовДолг - СуммаОплатыПроценты;  
			ВыдачаЗалога = Ложь;       
			Если НЕ ПредельныйСрокЗайма = Дата(1,1,1) И ПредельныйСрокЗайма <= СтрКон.ДатаВозврата Тогда    
				ОбщегоНазначения.СообщитьПользователю("Внимание! В результате оплаты новая расчетная дата возврата ("+Формат(СтрКон.ДатаВозврата, "ДФ=dd.MM.yyyy")+") превысит предельный срок займа ("+Формат(ПредельныйСрокЗайма, "ДФ=dd.MM.yyyy")+")"+
                        Символы.ПС + ?((НЕ ПроверитьПлательщикЭтоЗаемщик() И НЕ ЗначениеЗаполнено(ДоверенностьПлательщика)) ИЛИ БилетИзъят, "Возможен только полный выкуп. Нажмите кнопку «Принять оплату».", "Возможен только полный выкуп или переоформление. Нажмите кнопку «Принять оплату» и выберите необходимое действие."));
			КонецЕсли;	    
			//Если ПродлитьДоговорДни = 0 Тогда
			//    ЗаполнитьСостояниеТоваровПерезалог(Ложь);
			//Иначе  
			//	ЗаполнитьСостояниеТоваровПерезалог();
			//КонецЕсли;	
			НомерДопСоглашения = СтрКон.НомерДС;
		Иначе    
			//Если ЗначениеЗаполнено(НакладнаяНаОтгрузку) Тогда  
			//	ПроцентДляИсключенияИзНакладной = ?(СуммаПроцентовНач = 0, 0, СуммаОплатыПроценты/СуммаПроцентовНач);
			//    Если ПроцентДляИсключенияИзНакладной >= 0.9 Тогда   
			//	    СтрКон.Статус = ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(НакладнаяНаОтгрузку.Дата-1, ЗалоговыйБилет);
			//		ЗаполнитьСостояниеТоваровИсключитьИзНакладной(НакладнаяНаОтгрузку);
			//	Иначе 
			//		СтрКон.Статус = СтатусЗБ;  
			//		ЗаполнитьСостояниеТоваровИсключитьИзНакладной();
			//	КонецЕсли;	
			//Иначе	
			//    СтрКон.Статус = СтатусЗБ; 
			//КонецЕсли;	 
			ПродлитьДоговорДни = 0;
			СтрКон.Статус = СтатусЗБ;
			СтрКон.ДатаВозврата = СтрНач.ДатаВозврата;
			СтрКон.ДатаВозвратаЛьготная = СтрНач.ДатаВозвратаЛьготная;	
			СтрКон.СуммаЗайма = СтрНач.СуммаЗайма - СуммаОплатыСсуда;  
			Если НЕ СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят И НЕ СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен И НЕ СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Остановлен тогда 
				СтрКон.ПроцентнаяСтавка = СтрНач.ПроцентнаяСтавка; 
	            СтрКон.СуммаПроцентовДень = СтрКон.СуммаЗайма*СтрКон.ПроцентнаяСтавка/100;
			КонецЕсли;	
			СтрКон.СуммаПроцентовДолг = СтрНач.СуммаПроцентовДолг - СуммаОплатыПроценты; 
			ВыдачаЗалога = Ложь;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры  

&НаСервере 
Процедура ЗаполнитьСостояниеТоваровИсключитьИзНакладной(НакладнаяНаОтгрузку = неопределено)  
	Для каждого Стр Из ТаблицаТоваров Цикл
		Если НЕ НакладнаяНаОтгрузку = неопределено Тогда 
			Стр.СтатусПослеОплаты = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектаЗалога(НакладнаяНаОтгрузку.Дата-1, Стр.ОбъектЗалога, ЗалоговыйБилет);
		Иначе   
			Стр.СтатусПослеОплаты = Стр.СтатусОбъекта;
		КонецЕсли;	 
	Конеццикла;
КонецПроцедуры	

&НаКлиенте
Процедура ДобавитьДокументПравоПребывания(Команда)
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораДокументаПравоПребывания",ЭтаФорма);
    ЗначениеОтбора = Новый Структура;
    ЗначениеОтбора.Вставить("Залогодатель", Плательщик);
    ЗначениеОтбора.Вставить("ВидДокументаЗалогодателя", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийПравоПребыванияРФ"));
    ЗначениеОтбора.Вставить("Дата", ДатаДок);

    ОткрытьФорму("ОбщаяФорма.ЛБ_ПодборДокументовКлиента", ЗначениеОтбора, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры  

&НаСервере
Процедура ПослеВыбораДокументаПравоПребывания(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	НоваяСтр = ДопДокументы.Добавить();
	НоваяСтр.ДокументЗалогодателя = Результат.ДокументЗалогодателя;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("ДокументЗалогодателя", НоваяСтр.ДокументЗалогодателя);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя.Владелец КАК Клиент,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНачалоДействия КАК ДокументНачалоДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&Дата, ДокументЗалогодателя = &ДокументЗалогодателя) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		НоваяСтр.Клиент = Плательщик;
		НоваяСтр.ВидДокументаЗалогодателя = Выборка.ВидДокументаЗалогодателя;
		НоваяСтр.ВидДокумента = Выборка.ВидДокумента;
		НоваяСтр.ДокументГражданство = Выборка.Гражданство;
		НоваяСтр.ДокументСерия = Выборка.ДокументСерия;
		НоваяСтр.ДокументНомер = Выборка.ДокументНомер;
		НоваяСтр.ДокументДатаВыдачи = Выборка.ДокументДатаВыдачи;
		НоваяСтр.ДокументКемВыдан = Выборка.ДокументКемВыдан;
		НоваяСтр.ДокументКодПодразделения = Выборка.ДокументКодПодразделения;
		НоваяСтр.ДокументНачалоДействия = Выборка.ДокументНачалоДействия;
		НоваяСтр.ДокументСрокДействия = Выборка.ДокументСрокДействия;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция СнятьСПроведения(Документ)  
	ДокОбъект = Документ.ПолучитьОбъект(); 
	Если ДокОбъект.Проведен Тогда  
		ЗапросП = Новый Запрос;  
		ЗапросП.УстановитьПараметр("ЗБ", ЗалоговыйБилет); 
		ЗапросП.УстановитьПараметр("Ссылка", Документ);  
		ЗапросП.УстановитьПараметр("Дата", ДатаДок);
		ЗапросП.Текст = "ВЫБРАТЬ
		                |	ЛБ_ОперацияПоЗалогу.Ссылка КАК Ссылка
		                |ИЗ
		                |	Документ.ЛБ_ОперацияПоЗалогу КАК ЛБ_ОперацияПоЗалогу
		                |ГДЕ
		                |	ЛБ_ОперацияПоЗалогу.ПредыдущаяОперация = &ЗБ
		                |	И ЛБ_ОперацияПоЗалогу.Проведен = ИСТИНА
		                |	И ЛБ_ОперацияПоЗалогу.Дата >= &Дата
		                |	И НЕ ЛБ_ОперацияПоЗалогу.Ссылка = &Ссылка";
		ВыборкаП = ЗапросП.Выполнить().Выбрать();
		Если ВыборкаП.Следующий() тогда 
			Сообщить("По залоговому билету " + СокрЛП(Документ.НомерЗалоговогоБилета) + " есть проведенные документы с более поздней датой. Редактирование запрещено.");
			Возврат Ложь;
		КонецЕсли;                                          
		Попытка
		    ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);  
			Возврат Истина;
		Исключение   
			Сообщить("Не удалось снять с проведения документ оплаты. Редактирование запрещено.");
			Возврат Ложь;
		КонецПопытки;	
	Иначе
		возврат Истина;
	КонецЕсли;
КонецФункции	

&НаКлиенте
Процедура Редактировать(Команда)
	ПроверкаМожноРедактировать = Истина;
	Если ЭтаФорма.НеРедактировать Тогда 
		Результат = СнятьСПроведения(ДокументОплаты);
		Если НЕ Результат тогда  
			ПроверкаМожноРедактировать = Ложь;
		КонецЕсли;	
		Если ПроверкаМожноРедактировать Тогда  
			НеРедактировать = Ложь;
			Элементы.ОсновнаяПанель.ТолькоПросмотр = Ложь;  			
			Этаформа.Открыть();
		КонецЕсли;	
	КонецЕсли;	
	//+Мельников 25.04.24 Отмена операции
	УстановитьВидимость();
	//-Мельников
КонецПроцедуры

&НаКлиенте
Процедура ИсторияЗБ(Команда)
	Если ЗначениеЗаполнено(ЗалоговыйБилет) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Клиент", ПолучитьЗалогодателя());
		ПараметрыФормы.Вставить("ЗалоговыйБилет", ЗалоговыйБилет);	 
								
		ОткрытьФорму("Отчет.ЛБ_ИсторияЗалоговогоБилета.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ДокументОплатыПроведен()  
	Возврат ДокументОплаты.Проведен;
КонецФункции   

&НаСервере
Функция ПроверитьПечататьДопСоглашение() 
	Отбор = Новый структура;
	Отбор.Вставить("КлючСтроки", 2);
	Строки = ТаблицаСостояний.НайтиСтроки(Отбор);  
	СтрНач = Строки.Получить(0); 
	
	Отбор.Вставить("КлючСтроки", 3);
	Строки = ТаблицаСостояний.НайтиСтроки(Отбор);  
	СтрКон = Строки.Получить(0);  
	
	Если НЕ СтрКон.статус = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Оформлен И 
		 НЕ СтрКон.статус = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Продлен Тогда
        Возврат  Ложь;
	КонецЕсли;   
	
	Если НЕ СуммаОплатыПроценты = 0 Тогда 
		Если СуммаОплатыСсуда = 0 Тогда
	        Возврат НЕ (СтрНач.НомерДС = СтрКон.НомерДС); 
		Иначе
			Возврат Истина;
		КонецЕсли;	
	КонецЕсли;   
	
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура Печать(Команда)
    Если ЗначениеЗаполнено(ДокументОплаты) Тогда	
		Если ДокументОплатыПроведен() Тогда  
			Если НЕ ПроверитьПечататьДопСоглашение() Тогда
				Предупреждение("Печать дополнительного соглашения не требуется", 60);
			Иначе	
				ПараметрыФормы = Новый Структура;
				ПараметрыФормы.Вставить("ИменаМакетов", "ДополнительноеСоглашение"); 
				ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_ОперацияПоЗалогу");
				МассивОбъектов = Новый Массив;
				МассивОбъектов.Добавить(ДокументОплаты);
				ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
				ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,); 
			КонецЕсли;	
		Иначе  
			Предупреждение("Печать проекта документа оплаты процентов не разрешена!", 60);
		КонецЕсли;	
	Иначе     
		Предупреждение("Документ оплаты процентов не записан!", 60);
	КонецЕсли;	

КонецПроцедуры 

&НаКлиенте
Процедура ПечатьПКО(Команда)
	 Если ЗначениеЗаполнено(ДокументОплаты) Тогда	
		Если ДокументОплатыПроведен() Тогда  
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ИменаМакетов", "ПКО"); 
			ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_ОперацияПоЗалогу");
			МассивОбъектов = Новый Массив;
			МассивОбъектов.Добавить(ДокументОплаты);
			ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
			ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,); 
		Иначе  
			Предупреждение("Печать проекта документа оплаты процентов не разрешена!", 60);
		КонецЕсли;	
	Иначе     
		Предупреждение("Документ оплаты процентов не записан!", 60);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Вперед(Команда)
	Если Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаПлательщик тогда 
		Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаДополнительно; 
	КонецЕсли;	  
	ПриСменеСтраницы(Элементы.ОсновнаяПанель.ТекущаяСтраница);
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	Если Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаДополнительно тогда 
		Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаПлательщик; 
	конецЕсли;	  
	ПриСменеСтраницы(Элементы.ОсновнаяПанель.ТекущаяСтраница);
КонецПроцедуры

&НаКлиенте
Процедура ПриСменеСтраницы(ТекущаяСтраница)
    Если ТекущаяСтраница = Элементы.СтраницаПлательщик Тогда 
		Элементы.Вперед.Доступность = Истина; 
		Элементы.Назад.Доступность = Ложь;
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаДополнительно Тогда 
		Элементы.Вперед.Доступность = Ложь; 
		Элементы.Назад.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ОсновнаяПанельПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ПриСменеСтраницы(ТекущаяСтраница);
КонецПроцедуры

&НаСервере
Функция ПолучитьЗалогодателя()
	Возврат  ЗалоговыйБилет.Залогодатель;
КонецФункции

&НаКлиенте
Процедура СтатистикаПоКлиенту(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Клиент", ПолучитьЗалогодателя());
	ПараметрыФормы.Вставить("Дата", ДатаДок);	 
							
	ОткрытьФорму("Отчет.ЛБ_СтатистикаОбращенийКлиента.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура Расчеты(Команда)
	ПараметрыФормы = Новый Структура;  
	ПараметрыФормы.Вставить("Клиент", ПолучитьЗалогодателя());
	ПараметрыФормы.Вставить("ЗалоговыйБилет", ЭтаФорма.ЗалоговыйБилет);	
	ПараметрыФормы.Вставить("Дата", ЭтаФорма.ДатаДок);	
							
	ОткрытьФорму("Отчет.ЛБ_НачисленныеПроцентыПоДоговоруЗайма.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЛомбардПриИзменении(Элемент)
	Если Выкуп Тогда  		
		ЗаполнитьТоварыПослеВыкупа();  
		ЗаполнитьСтрокуСостоянияПослеОплаты(Выкуп); 
		ЗаполнитьСостояниеТоваровПерезалог();
		ИнформацияОплата();
	КонецЕсли;	
КонецПроцедуры 

//+Мельников 26.03.24 Отмена операции
&НаКлиенте
Процедура ОтменитьОперацию(Команда)

	ПоследняяОперация = ПолучитьИнформациюОЗБ(ЗалоговыйБилет, ТекущаяДата());
	ЛомбардПользователя = ПолучитьЛомбардПольвателя();
	ЛомбардВДокументе = ПолучитьЛомбардВдокументе(ПоследняяОперация.ДокументОперации);

	Если ЛомбардПользователя <> ЛомбардВДокументе Тогда
		Предупреждение("Операция оформлена в другом ломбарде.
		|Действия с документом запрещены!");
		Возврат
	ИначеЕсли Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy") <> Формат(ПоследняяОперация.Дата, "ДФ=dd.MM.yyyy") Тогда
		Предупреждение("Отмена операции возможна только в текущем дне.");
		Возврат
	ИначеЕсли ТекущаяДата() - ДатаДок >= 3600 Тогда
		Предупреждение("Прошло больше часа от времени оформления текущей операции.");
		Возврат
	ИначеЕсли ПроверитьКассовуюСмену() = неопределено Тогда 
		Предупреждение("Не открыта кассовая смена в ломбарде.");
	    Возврат;
	Иначе	

		Ответ = Вопрос("Выполнить отмену текущей операции?", РежимДиалогаВопрос.ДаНет);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ДокументПроведен = ОтменаОплатыНаСервере();
			УстановитьВидимость();
		Иначе
			Возврат;
		КонецЕсли;
		
		Если ДокументПроведен Тогда
			Сообщить("Документ отмены создан");  
			Если ВладелецФормы.ИмяФормы = "ОбщаяФорма.ЛБ_РабочееМестоПриемщикаЛомбарда" Тогда
	   	        ФормаРМП = ВладелецФормы;  
				Если ФормаРМП.Залогодатель = ПолучитьЗалогодателя() Тогда
	                ФормаРМП.ПослеВыбораТекущееСостояниеЗБ(Истина, неопределено); 
				КонецЕсли;	
			КонецЕсли;

		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИнформациюОЗБ(ЗалоговыйБилет, Дата)
	
	Результат = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(ЗалоговыйБилет.НомерЗалоговогоБилета, Дата,, Истина);
	
	//+Мельников 06.05.24 Сделано на время тестирования. Убрать при запуске ломбардов.
	Если Результат = Неопределено Тогда
		ДатаПроверки = ТекущаяДата() + 94608000; // + три года к дате проверки документа
		Результат = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(ЗалоговыйБилет.НомерЗалоговогоБилета, ДатаПроверки,, Истина);
	КонецЕсли;
	//-Мельников

	ПоследняяОперация = Новый Структура;
	ПоследняяОперация.Вставить("Дата", Результат.Регистратор.Дата);
	ПоследняяОперация.Вставить("ВидОперации", Результат.Регистратор.ВидОперации);
	ПоследняяОперация.Вставить("ДокументОперации", Результат.Регистратор);
	
	Возврат ПоследняяОперация;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЛомбардПольвателя()
	Возврат ЛБ_ОбщийМодуль.ПолучитьЛомбардПользователя(ПараметрыСеанса.ТекущийПользователь);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЛомбардВдокументе(Ссылка)
	Возврат Ссылка.Ломбард;
КонецФункции

&НаСервере
Функция ОтменаОплатыНаСервере()
	
	ДокументОбъект = Документы.ЛБ_ОперацияПоЗалогу.СоздатьДокумент(); 
	ДокументОбъект.Дата = ТекущаяДата();
	ДокументОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаОплаты;  
	ДокументОбъект.ПредыдущаяОперация = ЗалоговыйБилет;
	ДокументОбъект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить(); 
	ДокументОбъект.Товары.Загрузить(ДокументОплаты.Товары.Выгрузить());
	ДокументОбъект.Вставки.Загрузить(ДокументОплаты.Вставки.Выгрузить());
	ДокументОбъект.ДополнительныеМеталлы.Загрузить(ДокументОплаты.ДополнительныеМеталлы.Выгрузить());
	ДокументОбъект.Дефекты.Загрузить(ДокументОплаты.Дефекты.Выгрузить());
	ДокументОбъект.СтатусЗалогодателя = ЛБ_УправлениеЛомбардом.ПолучитьТекущийСтатусКлиента(ДокументОбъект.Дата, ДокументОбъект.ПредыдущаяОперация.Залогодатель);
	
	ДокументОбъект.Ломбард = Ломбард; 
	ДокументОбъект.ОтветственныйПользователь = ОтветственныйПользователь; 
	ДокументОбъект.ОтветственныйСотрудник = ОтветственныйСотрудник;

	ДокументОбъект.Комментарий = Комментарий;
	ДокументОбъект.Залогодатель = Плательщик;  
	ДокументОбъект.ДокументЗалогодателя = ДокументПлательщика;
	ДокументОбъект.ДоверенностьПредставителя = ДоверенностьПлательщика;
	ДокументОбъект.СхемаКредитования = ЗалоговыйБилет.СхемаКредитования;  
	ДокументОбъект.СрокЗалога = ЗалоговыйБилет.СрокЗалога; 
	ДокументОбъект.Акция = ЗалоговыйБилет.Акция;
	ДокументОбъект.НомерЗалоговогоБилета = ЗалоговыйБилет.НомерЗалоговогоБилета;  
	ДокументОбъект.НомерДопСоглашения = НомерДопСоглашения;
	ДокументОбъект.ОтмененныйДокумент = ДокументОплаты;
	
	Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРождения КАК МестоРождения,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Email КАК Email,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПрописке КАК АдресПоПрописке,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Пол КАК Пол,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК Телефон,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество
                   |ИЗ
                   |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";

	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("Залогодатель", ДокументОбъект.Залогодатель);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументОбъект.Фамилия = Выборка.Фамилия;
        ДокументОбъект.Имя = Выборка.Имя;
        ДокументОбъект.Отчество = Выборка.Отчество;		
		ДокументОбъект.ДатаРождения = Выборка.ДатаРождения;		
		ДокументОбъект.Гражданство = Выборка.Гражданство;
		ДокументОбъект.Пол = Выборка.Пол;  
		ДокументОбъект.ВозрастЗалогодателя = ЛБ_ОбщийМодуль.ВычислитьВозраст(ДокументОбъект.ДатаРождения);
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНачалоДействия КАК ДокументНачалоДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&Дата, ДокументЗалогодателя = &ДокументЗалогодателя) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";

	Запрос.УстановитьПараметр("ДокументЗалогодателя", ДокументОбъект.ДокументЗалогодателя);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументОбъект.ДокументВидДокументаЗалогодателя = Выборка.ВидДокументаЗалогодателя;
		ДокументОбъект.ДокументВид = Выборка.ВидДокумента;
		ДокументОбъект.ДокументГражданство = Выборка.Гражданство;
		ДокументОбъект.ДокументСерия = Выборка.ДокументСерия;
		ДокументОбъект.ДокументНомер = Выборка.ДокументНомер;
		ДокументОбъект.ДокументДатаВыдачи = Выборка.ДокументДатаВыдачи;
		ДокументОбъект.ДокументКемВыдан = Выборка.ДокументКемВыдан;
		ДокументОбъект.ДокументКодПодразделения = Выборка.ДокументКодПодразделения;
		ДокументОбъект.ДокументНачалоДействия = Выборка.ДокументНачалоДействия;
		ДокументОбъект.ДокументСрокДействия = Выборка.ДокументСрокДействия;
	КонецЕсли;
	
	ДокументОбъект.ДополнительныеДокументыПравоПребыванияРФ.Загрузить(ДопДокументы.Выгрузить());
	
    ДокументОбъект.ТоварыОтмена.Очистить();
	Для каждого стр из ТаблицаТоваров Цикл 		
		СтрТОт = ДокументОбъект.ТоварыОтмена.Добавить();
		СтрТОт.ОбъектЗалога = стр.ОбъектЗалога;
		СтрТОт.Статус = Стр.СтатусОбъекта;
		СтрТОт.СуммаОценки = Стр.ЗадолженностьНач;
	Конеццикла;
	
	Отбор = Новый Структура;
	Отбор.Вставить("КлючСтроки", ТаблицаСостояний.Количество()-1);
	Строки = ТаблицаСостояний.НайтиСтроки(Отбор);  
	СтрНач = Строки.Получить(0);
	ДокументОбъект.ДатаВыкупа = СтрНач.ДатаВозврата;
	ДокументОбъект.ДатаВыкупаЛьготная = СтрНач.ДатаВозвратаЛьготная;
	
	СостояниеДоОтменяемойОперации = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(ДокументОбъект.НомерЗалоговогоБилета, ДокументОплаты.Дата-1,, Истина);
	
	Если СостояниеДоОтменяемойОперации <> Неопределено Тогда
		ДокументОбъект.СуммаОплаты = -ЭтотОбъект.ДокументОплаты.СуммаОплаты;
		ДокументОбъект.СуммаОплатыПроценты = -ЭтотОбъект.ДокументОплаты.СуммаОплатыПроценты;
		ДокументОбъект.СуммаОплатыСсуда = -ЭтотОбъект.ДокументОплаты.СуммаОплатыСсуда;
		ДокументОбъект.СуммаСсуды = СостояниеДоОтменяемойОперации.Регистратор.СуммаСсуды;
		ДокументОбъект.Выкуп = СостояниеДоОтменяемойОперации.Регистратор.Выкуп;
		ДокументОбъект.ВыдачаЗалога = СостояниеДоОтменяемойОперации.Регистратор.ВыдачаЗалога;
	КонецЕсли;
	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	Попытка           
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение); 
		
		//+МАН 17.06.25 Убрал
		//ДокументОтмены = ДокументОбъект.Ссылка;
		//
		////Установка отментки об отмене документа в отменяемом документе
		//ОтменяемыйДокумент = ДокументОплаты.ПолучитьОбъект();
		//ОтменяемыйДокумент.ДокументОтмены = ДокументОтмены;
		//
		//ОтменяемыйДокумент.Записать(РежимЗаписиДокумента.Запись);
		//
		//Попытка           
		//	ОтменяемыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		//Исключение
		//	ОбщегоНазначения.СообщитьПользователю("Не удалось установить отметку в отменяемом документе");
		//КонецПопытки;
		////
		
		Возврат Истина;
	Исключение   
		ОбщегоНазначения.СообщитьПользователю("Не удалось провести документ " + строка(ДокументОбъект.Ссылка));
		Возврат Ложь;
	КонецПопытки;  
	
КонецФункции

&НаКлиенте
Процедура ДокументОтменыНажатие(Элемент, СтандартнаяОбработка)
	
	Если ПолучитьВидОперации(ДокументОтмены) = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаОплаты") Тогда 
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Документ", ДокументОтмены);    
		ОткрытьФорму("ОбщаяФорма.ЛБ_ОтменаОперацииПоЗайму", ПараметрыФормы, ЭтаФорма, Истина,,,);	
	Иначе                           
		СтандартнаяОбработка = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВидОперации(Ссылка)
    Возврат Ссылка.ВидОперации
КонецФункции

&НаСервере
Функция ПолучитьДокументОтмены(Ссылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&Период, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
		|ГДЕ
		|	ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент В(&ЗБ)";
	
	Запрос.УстановитьПараметр("ЗБ", Ссылка);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Регистратор;
	КонецЕсли;
	
	Возврат Документы.ЛБ_ОперацияПоЗалогу.ПустаяСсылка();
	
КонецФункции
//-Мельников










