// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	Движения.ЛБ_СкидкаНаОбъектыЗалога.Записывать = Истина;  
	Движения.ЛБ_УстановкаОтменаСкидки.Записывать = Истина;
		
	СписокЛ = Новый СписокЗначений;
	Для каждого СтрЛ Из Этотобъект.Ломбарды Цикл
		СписокЛ.Добавить(СтрЛ.Ломбард);
	КонецЦикла;                        
	Если СписокЛ.Количество() = 0 Тогда 
		СписокЛ.Добавить(Справочники.ЛБ_Ломбарды.ПустаяСсылка());
	КонецЕсли;	 

	Для каждого Стр Из ЭтотОбъект.СкидкиВДокументах Цикл
		Если НЕ Стр.Использовать Тогда
			Продолжить;
		КонецЕсли;	    
		Для каждого Эл Из СписокЛ Цикл
			Движение = Движения.ЛБ_СкидкаНаОбъектыЗалога.Добавить();
			Движение.Период = Дата; 
			Движение.Ломбард = Эл.Значение;
			Движение.СкидкаВДокументах = Стр.СкидкаВДокументах;
			Движение.Отклонение = стр.Отклонение; 
			Если Стр.УвеличитьУменьшить = Перечисления.ЛБ_УвеличитьУменьшить.Увеличить тогда
			    Движение.Скидка = стр.Скидка;   
			Иначе   
				Движение.Скидка = -стр.Скидка;
			КонецЕсли;	  
			Если Стр.ДействуетС = НачалоДня(Дата) Тогда
				Движение.ДействуетС = Дата;
			Иначе	
			    Движение.ДействуетС = Стр.ДействуетС; 
			КонецЕсли;    
			
			ДвижениеУ = Движения.ЛБ_УстановкаОтменаСкидки.Добавить();
			ДвижениеУ.Период = Дата; 
			ДвижениеУ.Ломбард = Эл.Значение;
			ДвижениеУ.СкидкаВДокументах = Стр.СкидкаВДокументах;  
		    ДвижениеУ.ДокументСкидки = Ссылка;
			ДвижениеУ.ДействуетС = Движение.ДействуетС;
		КонецЦикла;	
	Конеццикла;		
КонецПроцедуры

// Процедура - обработчик события "ОбработкаУдаленияПроведения".
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	Если НЕ НачалоДня(ЭтотОбъект.Дата) = НачалоДня(ТекущаяДатаСеанса()) Тогда  
		Если НЕ УправлениеДоступом.ЕстьРоль("ЛБ_Суперпользователь") Тогда 
            ОбщегоНазначения.СообщитьПользователю("Вам запрещена отмена проведения этого документа!");
			Отказ = Истина; 
		КонецЕсли;	
	КонецЕсли;	                   		
КонецПроцедуры // ОбработкаУдаленияПроведения()
