
&НаКлиенте
Процедура СоздатьБазовый(Команда)  
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.Базовый"));
	ОткрытьФорму("Документ.ЛБ_ПриказУсловияПредоставленияЗаймов.Форма.ФормаДокумента", СтруктураПараметров, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьАкция(Команда)  
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.Акция"));
	ОткрытьФорму("Документ.ЛБ_ПриказУсловияПредоставленияЗаймов.Форма.ФормаДокумента", СтруктураПараметров, ЭтаФорма);
КонецПроцедуры


