
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Приказ") Тогда
		Приказ = Параметры.Приказ; 
		ВыбратьСК(); 
		//Элементы.ТаблицаСКЛомбард.СписокВыбора.ЗагрузитьЗначения(Приказ.Ломбарды.ВыгрузитьКолонку("Ломбард"));
	Иначе
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаСервере 
Процедура ВыбратьСК()   
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", Приказ.Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СхемыКредитования.Ссылка КАК СхемаКредитования
	               |ИЗ
	               |	Справочник.ЛБ_СхемыКредитования КАК ЛБ_СхемыКредитования
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_УсловияПредоставленияКредита.СрезПоследних(&Дата, ) КАК ЛБ_УсловияПредоставленияКредитаСрезПоследних
	               |		ПО (ЛБ_УсловияПредоставленияКредитаСрезПоследних.СхемаКредитования = ЛБ_СхемыКредитования.Ссылка)
	               |ГДЕ
	               |	ЛБ_СхемыКредитования.ПометкаУдаления = ЛОЖЬ";
	ТЗ = Запрос.Выполнить().Выгрузить();     
	ТаблицаСК.Загрузить(ТЗ);
	
	Для каждого Стр Из Приказ.СхемыКредитования Цикл 
		Отбор = Новый Структура;   
		Отбор.Вставить("СхемаКредитования", Стр.СхемаКредитования);
		Строки = ТаблицаСК.НайтиСтроки(Отбор);
		Если НЕ Строки.Количество() = 0 Тогда 
			СтрСК = Строки.Получить(0);
	        СтрСК.ФлВкл = Истина; 
			СтрСК.ШаблонПроцентныеСтавки = Стр.ШаблонПроцентныеСтавки;
			Если Не ЗначениеЗаполнено(СтрСК.ШаблонПроцентныеСтавки) Тогда    
				СписокЛ = Новый СписокЗначений;
				СписокЛ.Добавить(ЛБ_ОбщийМодуль.ПолучитьЛомбардПользователя(Пользователи.ТекущийПользователь()));

				//СписокЛ.Добавить(Справочники.ЛБ_Ломбарды.ПустаяСсылка());
				//Для каждого СтрЛ Из Приказ.Ломбарды цикл 
				//	СписокЛ.Добавить(СтрЛ.Ломбард);
				//Конеццикла;	
				СтрСК.ШаблонПроцентныеСтавки = ЛБ_ОбщийМодуль.ПолучитьТекущийШаблон(Приказ.Дата, Перечисления.ЛБ_ВидыПрейскурантов.ПроцентныеСтавки, СписокЛ, Стр.СхемаКредитования);
			КонецЕсли;	  
			//СтрСК.Ломбард = Стр.Ломбард;
		КонецЕсли;
	Конеццикла;
КонецПроцедуры     

&НаСервере 
Процедура ЗаполнитьСК() 
	ДокументОбъект = Приказ.ПолучитьОбъект();
	ДокументОбъект.СхемыКредитования.Очистить();
	Для каждого СтрСК Из ТаблицаСК Цикл 
		Если НЕ СтрСК.ФлВкл Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтр = ДокументОбъект.СхемыКредитования.Добавить();  
		НоваяСтр.СхемаКредитования = СтрСК.СхемаКредитования;
		НоваяСтр.ШаблонПроцентныеСтавки = СтрСК.ШаблонПроцентныеСтавки; 
		//НоваяСтр.Ломбард = СтрСК.Ломбард;
	КонецЦикла;	
	ДокументОбъект.Записать();
КонецПроцедуры	

&НаКлиенте
Процедура Выбрать(Команда) 
	ЗаполнитьСК();
	ЭтаФорма.Закрыть(Истина);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере 
Процедура ТаблицаСКФлВклПриИзмененииНаСервере(Идентификатор) 
	СтрСК = ТаблицаСК.НайтиПоИдентификатору(Идентификатор);
	Если СтрСК.ФлВкл Тогда  
		СписокЛ = Новый СписокЗначений;
		//+Мельников Убрать
		//СписокЛ.Добавить(ЛБ_ОбщийМодуль.ПолучитьЛомбардПользователя(Пользователи.ТекущийПользователь()));
		СписокЛ.Добавить(Справочники.ЛБ_Ломбарды.ПустаяСсылка());
		Ном = 0;
		Для каждого Стр Из Приказ.Ломбарды цикл  
			Если Ном = 0 Тогда  
				СтрСК.Ломбард = Стр.Ломбард;
				Ном = Ном + 1;
			КонецЕсли;	
			СписокЛ.Добавить(Стр.Ломбард);
		Конеццикла;
		//-Мельников Убрать
		СтрСК.ШаблонПроцентныеСтавки = ЛБ_ОбщийМодуль.ПолучитьТекущийШаблон(Приказ.Дата, Перечисления.ЛБ_ВидыПрейскурантов.ПроцентныеСтавки, СписокЛ, СтрСК.СхемаКредитования);
	Иначе     
		СтрСК.ШаблонПроцентныеСтавки = Справочники.ЛБ_ШаблоныПриказовПроцентныеСтавки.ПустаяСсылка();
		//СтрСК.Ломбард = Справочники.ЛБ_Ломбарды.ПустаяСсылка(); 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСКФлВклПриИзменении(Элемент) 
	ТаблицаСКФлВклПриИзмененииНаСервере(Элементы.ТаблицаСК.ТекущиеДанные.ПолучитьИдентификатор());
КонецПроцедуры
