
&НаКлиенте
Процедура ПереченьВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекСтрока = Элементы.Перечень.ТекущиеДанные; 
	Если НЕ Текстрока = неопределено Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ИД", ТекСтрока.ИД); 
		ПараметрыФормы.Вставить("ВидПеречня", ТекСтрока.ВидПеречня); 
		ПараметрыФормы.Вставить("ДатаПеречня", ТекСтрока.ДатаПеречня);
		ПараметрыФормы.Вставить("Наименование", ТекСтрока.Наименование);
		ПараметрыФормы.Вставить("МестоРождения", ТекСтрока.МестоРождения);
		ПараметрыФормы.Вставить("ДатаРождения", ТекСтрока.ДатаРождения);
		ПараметрыФормы.Вставить("ГодРождения", ТекСтрока.ГодРождения);
		ПараметрыФормы.Вставить("ГодРождения", ТекСтрока.ГодРождения);
        ПараметрыФормы.Вставить("Статус", ТекСтрока.Статус);
        ПараметрыФормы.Вставить("ДатаВключения", ТекСтрока.ДатаВключенияВПеречень);
		ОткрытьФорму("Обработка.ЛБ_ПросмотрПеречней.Форма.ФормаПросмотра", ПараметрыФормы, ЭтаФорма);  
	КонецЕсли;	
КонецПроцедуры
