&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 	

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Если Параметры.Свойство("ВидОперации") Тогда
			Объект.ВидОперации = Параметры.ВидОперации; 
		Иначе
			Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.Базовый;
		КонецЕсли;  
		Объект.ВидПриказа = Перечисления.ЛБ_ВидыПриказа.Проект;
		Объект.Дата = ТекущаяДата();
		Объект.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;                      
	ДатаДок = Объект.Дата; 
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	УстановитьСостояниеДокумента();
	ЛБ_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект.ВидОперации, Объект, ЭтаФорма);
	
	ОсновнаяЕдиницаИзмерения = Константы.ЛБ_ОсновнаяЕдиницаМеталлы.Получить();
	ЗаполнитьВыборЕдиницИзмерения();
	
	ОсновнаяЕдиницаИзмеренияВставки = Константы.ЛБ_ОсновнаяЕдиницаКамни.Получить();
	ЗаполнитьВыборЕдиницИзмеренияВставки(); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДиапазоныСуммЗайма.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЛБ_ДиапазоныСуммЗайма КАК ЛБ_ДиапазоныСуммЗайма
	               |ГДЕ
	               |	ЛБ_ДиапазоныСуммЗайма.ЭтоГруппа = ЛОЖЬ
	               |	И ЛБ_ДиапазоныСуммЗайма.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ДиапазоныСуммЗайма.ПорядокСортировки";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	    Элементы.СтавкиПроцентовДиапазонСумм.СписокВыбора.Добавить(Выборка.Ссылка);  
		Элементы.УсловияСтавкиПроцентовДиапазонСумм.СписокВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;	 
	
	Элементы.СпособВыводаЛомбардовНаПечать.СписокВыбора.Очистить();  
	Элементы.СпособВыводаЛомбардовНаПечать.СписокВыбора.Добавить(0, "по ломбардам"); 
	Элементы.СпособВыводаЛомбардовНаПечать.СписокВыбора.Добавить(1, "по отделениям ломбардов");
	
	СпособВыводаЛомбардовНаПечать = Объект.ВыводитьЛомбарды;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьСписокСК();
	ЗаполнитьСписокЛомбардов();
	Элементы.СписокЛомбардов.Подсказка = Элементы.СписокЛомбардов.Заголовок;
	УстановитьВидимость();
КонецПроцедуры  

&НаКлиенте
Процедура УстановитьВидимость()
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.Базовый") Тогда 
		Элементы.ГруппаСК.Видимость = Истина; 
		Элементы.ГруппаАкция.Видимость = ложь; 
		Элементы.ДатаОкончанияДействияПриказа.Видимость = Ложь;
		Элементы.ГруппаАкцииПроцентныеСтавки.Видимость = ложь;  
		Элементы.ГруппаАкцииМеталлы.Видимость = ложь;
	Иначе          
		Элементы.ГруппаАкция.Видимость = Истина; 
		Элементы.ГруппаСК.Видимость = ложь;
		Элементы.ГруппаЦеныМеталлы.Видимость = ложь;  
		Элементы.ГруппаЦеныВставки.Видимость = ложь;
		Элементы.ГруппаСтавки.Видимость = ложь;
	КонецЕсли;	
КонецПроцедуры  

&НаСервере
Функция ПроверитьПСК()
	ПСКДень = 0; 
	ВсеОК = Истина;
    СтруктураП = ЛБ_УправлениеЛомбардом.ПолучитьПредельныеЗначенияПроцентов(Объект.Дата, Константы.ЛБ_ОсновнаяОрганизация.Получить());  
	Если НЕ СтруктураП = неопределено Тогда		
	    ПСКДень = окр(СтруктураП.ПСКГод/365, 3); 
	КонецЕсли;  
	Если НЕ ПСКДень = 0 Тогда 
		Для каждого Стр Из Объект.СтавкиПроцентов Цикл  
			Если Стр.Ставка > ПСКДень Тогда 
				ВсеОК = ложь;
				Сообщить(СокрЛП(Стр.ПричинаПрименения) + " " + СокрЛП(Стр.СхемаКредитования) + ", статус клиента " + ?(ЗначениеЗаполнено(Стр.статусЗалогодателя),СокрЛП((Стр.статусЗалогодателя)), "любой") +
				         ": процентная ставка для займа в диапазоне " + СокрЛП(Стр.ДиапазонСумм) + " превышает предельный размер ставки кредитования в день.");
			КонецЕсли;	
		Конеццикла;	
	КонецЕсли;
	Если ВсеОК Тогда 
		Возврат Истина;
	Иначе   
		Возврат ложь;
	КонецЕсли;	
КонецФункции	  

&НаСервере
Функция ПроверитьПСКАкции()
	ПСКДень = 0; 
	ВсеОК = Истина;
    СтруктураП = ЛБ_УправлениеЛомбардом.ПолучитьПредельныеЗначенияПроцентов(Объект.Дата, Константы.ЛБ_ОсновнаяОрганизация.Получить());  
	Если НЕ СтруктураП = неопределено Тогда		
	    ПСКДень = окр(СтруктураП.ПСКГод/365, 3); 
	КонецЕсли;  
	Если НЕ ПСКДень = 0 Тогда 
		Для каждого Стр Из Объект.УсловияАкцииСтавки Цикл
			Если Стр.УстановитьЗначениеИлиОтклонение = Перечисления.ЛБ_УстановкаЗначенияИлиОтклонения.Значение Тогда
				Если Стр.Ставка > ПСКДень Тогда 
					ВсеОК = ложь;
					Сообщить(СокрЛП(Стр.ПричинаПрименения) + " " + СокрЛП(Стр.СхемаКредитования) + ", статус клиента " + ?(ЗначениеЗаполнено(Стр.статусЗалогодателя),СокрЛП((Стр.статусЗалогодателя)), "любой") +
					         ": процентная ставка по акции в диапазоне " + СокрЛП(Стр.ДиапазонСумм) + " превышает предельный размер ставки кредитования в день.");
				КонецЕсли;	
			КонецЕсли;	
		Конеццикла;	
	КонецЕсли;
	Если ВсеОК Тогда 
		Возврат Истина;
	Иначе   
		Возврат ложь;
	КонецЕсли;	
КонецФункции	


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписидокумента.Проведение Тогда		
		Если Объект.ВидПриказа = Перечисления.ЛБ_ВидыПриказа.Факт Тогда
			Если ТекущийОбъект.ДатаНачалаДействияПриказа < ТекущийОбъект.Дата Тогда
				Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
					Сообщить("Дата начала действия прейскуранта не может быть меньше даты документа!");
		            Отказ = Истина;	
				КонецЕсли;	
			КонецЕсли;	  
		КонецЕсли;	
		Если (Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.Базовый) И  НЕ (Объект.СтавкиПроцентов.Количество() = 0) тогда
			Если (Объект.СхемыКредитования.Количество() = 0) Тогда 
				Сообщить("Не выбраны схемы кредитования!");
			    Отказ = Истина;
			КонецЕсли;	
		КонецЕсли;			
		Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.Акция Тогда 
			Если НЕ ЗначениеЗаполнено(Объект.Акция) Тогда   
				Сообщить("Не выбрана акция!"); 
				Отказ = Истина;	
			КонецЕсли;	
			Если Объект.ДатаОкончанияДействияПриказа = Дата(1,1,1) Тогда  
				Сообщить("Не заполнена дата окончания акции!"); 
				Отказ = Истина;	
			КонецЕсли;
			Если ТекущийОбъект.ДатаОкончанияДействияПриказа < ТекущийОбъект.ДатаНачалаДействияПриказа Тогда
				Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
					Сообщить("Дата начала окончания действия акции не может быть меньше даты начала действия!");
		            Отказ = Истина;	
				КонецЕсли;	
			КонецЕсли;
			Если НЕ Объект.УсловияАкцииСтавки.Количество() = 0 Тогда
				Если НЕ ПроверитьПСКАкции() Тогда
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;	
		ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.Базовый Тогда 
			Если НЕ Объект.СтавкиПроцентов.Количество() = 0 Тогда
				Если НЕ ПроверитьПСК() Тогда
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	ЛБ_УправлениеЛомбардом.ЗаполнитьДополнительныеРеквизитыПриказа(ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЛБ_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект.ВидОперации, Объект, ЭтаФорма);	
	УстановитьСостояниеДокумента();
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура СписокЛомбардовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	
	ПараметрыФормы = Новый Структура;    
	ПараметрыФормы.Вставить("Ломбарды", Объект.Ломбарды); 
	ПараметрыФормы.Вставить("ДатаДок", Объект.Дата);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЛомбардов",ЭтаФорма);
	
	ОткрытьФорму("Обработка.ЛБ_ВыборЛомбардовИзСписка.Форма", ПараметрыФормы, Элементы.СписокЛомбардов,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокЛомбардов()
	Результат = "";
	Для каждого Стр Из Объект.Ломбарды Цикл
		Результат = Результат + ?(ПустаяСтрока(Результат), "", "; ") + ?(НЕ ПустаяСтрока(Стр.Ломбард.НаименованиеПолное), СокрЛП(Стр.Ломбард.НаименованиеПолное), СокрЛП(Стр.Ломбард.Наименование));
	КонецЦикла;	
	СписокЛомбардов = Результат;
	Объект.СтрокаЛомбарды = Результат;
КонецПроцедуры	
 
&НаСервере
Процедура ПослеВыбораЛомбардов(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;

	Объект.Ломбарды.Очистить();
	КоличествоВыбрано = Результат.Количество;
	Для сч = 1 По КоличествоВыбрано Цикл
		НоваяСтр = Объект.Ломбарды.Добавить();
		НоваяСтр.Ломбард = Результат["Значение" + Строка(сч)];
	КонецЦикла;	
	
	ЗаполнитьСписокЛомбардов();
	Элементы.СписокЛомбардов.Подсказка = Элементы.СписокЛомбардов.Заголовок;
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьВыборЕдиницИзмерения()
	ТаблицаЕдиницИзмерения = ЛБ_ОбщийМодуль.ВыборЕдиницИзмеренияРасчетаЦенМеталлов();
	Элементы.ЦеныЕдиницаИзмерения.СписокВыбора.Очистить();		
	Для каждого Стр Из ТаблицаЕдиницИзмерения Цикл
		Элементы.ЦеныЕдиницаИзмерения.СписокВыбора.Добавить(Стр.ЕдиницаИзмерения);
	КонецЦикла;
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьВыборЕдиницИзмеренияВставки()
	ТаблицаЕдиницИзмерения = ЛБ_ОбщийМодуль.ВыборЕдиницИзмеренияРасчетаЦенКамней();
	Элементы.ЦеныВставкиЕдиницаИзмерения.СписокВыбора.Очистить();		
	Для каждого Стр Из ТаблицаЕдиницИзмерения Цикл
		Элементы.ЦеныВставкиЕдиницаИзмерения.СписокВыбора.Добавить(Стр.ЕдиницаИзмерения);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЦеныПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекСтрока = Элементы.Цены.ТекущиеДанные;
	Если НоваяСтрока Тогда		
		ТекСтрока.ЕдиницаИзмерения = ОсновнаяЕдиницаИзмерения;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦеныМеталловПоСценариюНаСервере(ШаблонМеталлы)
	Объект.ЦеныМеталлы.Очистить();  
	ТаблицаЦен = Объект.ЦеныМеталлы.Выгрузить();
	Для каждого Стр Из Объект.СценарийОценкиМеталлов.БазовыеНастройки Цикл
		Для каждого СтрГруппа Из Стр.БазоваяПроба.Пробы Цикл
		    НоваяСтр = ТаблицаЦен.Добавить();
		    НоваяСтр.Металл = Стр.Металл;
		    НоваяСтр.Проба = СтрГруппа.Проба;
		    НоваяСтр.КатегорияОбъектаЗалога = Стр.БазоваяКатегория;
		    НоваяСтр.Цена = Стр.БазоваяЦена;
		    НоваяСтр.ЕдиницаИзмерения = ОсновнаяЕдиницаИзмерения;
		КонецЦикла;
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки", Стр.КлючСтроки);
		Строки =  Объект.СценарийОценкиМеталлов.ОценкаПоБазовойКатегории.НайтиСтроки(Отбор);
		Для каждого СтрО Из Строки Цикл
			Если (СтрО.Проба = Стр.БазоваяПроба) И (СтрО.КатегорияОбъектаЗалога = Стр.БазоваяКатегория) Тогда 
			    Продолжить;
			КонецЕсли;	 
			Для каждого СтрГруппа Из СтрО.Проба.Пробы Цикл
			    НоваяСтр = ТаблицаЦен.Добавить();
			    НоваяСтр.Металл = Стр.Металл;
			    НоваяСтр.Проба = СтрГруппа.Проба;
			    НоваяСтр.КатегорияОбъектаЗалога = СтрО.КатегорияОбъектаЗалога;
			    НоваяСтр.Цена = ?(СтрО.ОклонениеОтБазовой = Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Абсолютное, Стр.БазоваяЦена + СтрО.ЗначениеОтклонения, Стр.БазоваяЦена * (1+СтрО.ЗначениеОтклонения/100));
			    Если ЗначениеЗаполнено(СтрО.ПорядокОкругления) Тогда
			        НоваяСтр.Цена = ЛБ_ОбщийМодуль.ОкруглитьЦену(НоваяСтр.Цена, СтрО.ПорядокОкругления, СтрО.ОкруглятьВБольшуюСторону);
			    КонецЕсли;	 
			    НоваяСтр.ЕдиницаИзмерения = ОсновнаяЕдиницаИзмерения;
			КонецЦикла;	
		КонецЦикла;
	Конеццикла;	    
	
	Для каждого Стр Из ШаблонМеталлы.Металлы Цикл
	     НоваяСтр = Объект.ЦеныМеталлы.Добавить();
		 НоваяСтр.Металл = Стр.Металл;
		 НоваяСтр.Проба = Стр.Проба;
		 НоваяСтр.КатегорияОбъектаЗалога = Стр.КатегорияОбъектаЗалога;
		 
		 Отбор = новый Структура;
		 Отбор.Вставить("Металл", Стр.Металл);
		 Отбор.Вставить("Проба", Стр.Проба);
		 Отбор.Вставить("КатегорияОбъектаЗалога", Стр.КатегорияОбъектаЗалога);
		 
		 СтрокиЦен = ТаблицаЦен.НайтиСтроки(Отбор);
		 Если СтрокиЦен.Количество() = 0 Тогда
			 НоваяСтр.ЕдиницаИзмерения = ОсновнаяЕдиницаИзмерения;
		 Иначе
			 СтрЦ = СтрокиЦен.Получить(0);
			 НоваяСтр.Цена = СтрЦ.Цена;
			 НоваяСтр.ЕдиницаИзмерения = СтрЦ.ЕдиницаИзмерения;
		 КонецЕсли;	 
	конецЦикла;	 
	Объект.ЦеныМеталлы.Сортировать("Металл, Проба, КатегорияОбъектаЗалога");
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьЦеныМеталловПоСценарию(Команда)
	Если ЗначениеЗаполнено(Объект.СценарийОценкиМеталлов) Тогда 
		ШаблонПриказа = ПолучитьТекущийШаблон(ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПрейскурантов.Металлы"));
		Если НЕ ШаблонПриказа = неопределено Тогда 
			ЗаполнитьЦеныМеталловПоСценариюНаСервере(ШаблонПриказа); 
		Иначе  
			Сообщить("Не установлен шаблон цен металлов!");
		КонецЕсли;			    
	Иначе
		Сообщить("Не выбран сценарий оценки!");
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦеныМеталловПоНастройкамНаСервере(ШаблонМеталлы)	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ?(Не ЗначениеЗаполнено(Объект.Ссылка), ТекущаяДата(), Объект.Дата));
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних.Проба.Владелец КАК Металл,
	               |	ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних.Проба КАК Проба,
	               |	ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних.Категория КАК КатегорияОбъектаЗалога,
	               |	ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних.Цена КАК Цена,
	               |	ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПрейскурантЦенНаМеталлы.СрезПоследних(&Дата, Ломбард В (&Ломбарды)) КАК ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Металл,
	               |	Проба,
	               |	КатегорияОбъектаЗалога";
	СписокЛ = Новый СписокЗначений;
	Для каждого СтрЛ из Объект.Ломбарды Цикл
		СписокЛ.Добавить(СтрЛ.Ломбард);
	КонецЦикла;	
	Запрос.УстановитьПараметр("Ломбарды", СписокЛ);
	ТаблицаЦен = Запрос.Выполнить().Выгрузить();
	Объект.ЦеныМеталлы.Очистить();
	
	Для каждого Стр Из ШаблонМеталлы.Металлы Цикл
	     НоваяСтр = Объект.ЦеныМеталлы.Добавить();
		 НоваяСтр.Металл = Стр.Металл;
		 НоваяСтр.Проба = Стр.Проба;
		 НоваяСтр.КатегорияОбъектаЗалога = Стр.КатегорияОбъектаЗалога;
		 
		 Отбор = новый Структура;
		 Отбор.Вставить("Металл", Стр.Металл);
		 Отбор.Вставить("Проба", Стр.Проба);
		 Отбор.Вставить("КатегорияОбъектаЗалога", Стр.КатегорияОбъектаЗалога);
		 
		 СтрокиЦен = ТаблицаЦен.НайтиСтроки(Отбор);
		 Если СтрокиЦен.Количество() = 0 Тогда
			 НоваяСтр.ЕдиницаИзмерения = ОсновнаяЕдиницаИзмерения;
		 Иначе
			 СтрЦ = СтрокиЦен.Получить(0);
			 НоваяСтр.Цена = СтрЦ.Цена;
			 НоваяСтр.ЕдиницаИзмерения = СтрЦ.ЕдиницаИзмерения;
		 КонецЕсли;	 
	конецЦикла	 
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦеныМеталловПоНастройкам(Команда)
	Если Объект.Ломбарды.Количество() = 0 Тогда
		Сообщить("Не выбраны ломбарды!");
	Иначе	
		ШаблонПриказа = ПолучитьТекущийШаблон(ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПрейскурантов.Металлы"));  
		Если НЕ ШаблонПриказа = неопределено Тогда 
			ЗаполнитьЦеныМеталловПоНастройкамНаСервере(ШаблонПриказа);  
		Иначе  
			Сообщить("Не установлен шаблон цен металлов!");
		КонецЕсли;			   		    
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦеныВставокПоНастройкамНаСервере(ШаблонВставки)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ?(Не ЗначениеЗаполнено(Объект.Ссылка), ТекущаяДата(), Объект.Дата));
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.Ломбард КАК Ломбард,
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.ВидВставки КАК ВидВставки,
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.ВесоваяГруппа КАК ВесоваяГруппа,
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.ФормаОгранки КАК ФормаОгранки,
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.ВидОгранки КАК ВидОгранки,
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.КачествоОгранки КАК КачествоОгранки,
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.Цена КАК Цена,
	               |	ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПрейскурантЦенНаДрагоценныеКамни.СрезПоследних(&Дата, Ломбард В (&Ломбарды)) КАК ЛБ_ПрейскурантЦенНаДрагоценныеКамниСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВидВставки,
	               |	ФормаОгранки,
	               |	ВидОгранки,
	               |	КачествоОгранки,
	               |	ВесоваяГруппа";
	СписокЛ = Новый СписокЗначений;
	СписокЛ.Добавить(Справочники.ЛБ_Ломбарды.ПустаяСсылка());
	Для каждого СтрЛ из Объект.Ломбарды Цикл
		СписокЛ.Добавить(СтрЛ.Ломбард);
	КонецЦикла;	
	Запрос.УстановитьПараметр("Ломбарды", СписокЛ);	
	ТаблицаЦен = Запрос.Выполнить().Выгрузить();
	Объект.ЦеныВставки.Очистить();
	
	Для каждого Стр Из ШаблонВставки.Вставки Цикл
	     НоваяСтр = Объект.ЦеныВставки.Добавить();
		 НоваяСтр.ВидВставки = Стр.Вставка;
		 НоваяСтр.ВесоваяГруппа = Стр.ВесоваяГруппа;
		 НоваяСтр.КачествоОгранки = Стр.КачествоОгранки;
		 НоваяСтр.ФормаОгранки = Стр.ФормаОгранки; 
		 НоваяСтр.ВидОгранки = Стр.ВидОгранки;
		 
		 Отбор = новый Структура;
		 Отбор.Вставить("ВидВставки", Стр.Вставка);
		 Отбор.Вставить("ВесоваяГруппа", Стр.ВесоваяГруппа);
		 Отбор.Вставить("КачествоОгранки", Стр.КачествоОгранки);
		 Отбор.Вставить("ФормаОгранки", Стр.ФормаОгранки);
		 Отбор.Вставить("ВидОгранки", Стр.ВидОгранки);
		 
		 СтрокиЦен = ТаблицаЦен.НайтиСтроки(Отбор);
		 Если СтрокиЦен.Количество() = 0 Тогда
			 НоваяСтр.ЕдиницаИзмерения = ОсновнаяЕдиницаИзмеренияВставки;
		 Иначе
			 СтрЦ = СтрокиЦен.Получить(0);
			 НоваяСтр.Цена = СтрЦ.Цена;
			 НоваяСтр.ЕдиницаИзмерения = СтрЦ.ЕдиницаИзмерения;
		 КонецЕсли;	 
	конецЦикла	 
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦеныВставокПоНастройкам(Команда)
	Если Объект.Ломбарды.Количество() = 0 Тогда
		Сообщить("Не выбраны ломбарды!");
	Иначе	 
		ШаблонПриказа = ПолучитьТекущийШаблон(ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПрейскурантов.Вставки")); 
		Если НЕ ШаблонПриказа = неопределено Тогда
		    ЗаполнитьЦеныВставокПоНастройкамНаСервере(ШаблонПриказа); 
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекущийШаблон(ВидПрейскуранта)    
	СписокЛ = Новый СписокЗначений; 
	СписокЛ.Добавить(Справочники.ЛБ_Ломбарды.ПустаяСсылка());
	Для каждого Стр Из Объект.Ломбарды цикл 
		СписокЛ.Добавить(Стр.Ломбард);
	Конеццикла;	

	Возврат ЛБ_ОбщийМодуль.ПолучитьТекущийШаблон(ДатаДок, ВидПрейскуранта, СписокЛ);
КонецФункции	

&НаКлиенте
Процедура СценарийОценкиМеталловПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.СценарийОценкиМеталлов) Тогда  
		ШаблонПриказа = ПолучитьТекущийШаблон(ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПрейскурантов.Металлы"));
		Если НЕ ШаблонПриказа = неопределено Тогда 
			ЗаполнитьЦеныМеталловПоСценариюНаСервере(ШаблонПриказа); 
		КонецЕсли;			  
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныВставкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекСтрока = Элементы.ЦеныВставки.ТекущиеДанные;
	//Если НоваяСтрока Тогда		
	//	ТекСтрока.ЕдиницаИзмерения = ОсновнаяЕдиницаИзмеренияВставки;
	//КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СтавкиПроцентовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	СтрокаТабличнойЧастиСтавки = Элементы.СтавкиПроцентов.ТекущиеДанные;
	Если НоваяСтрока И Не Копирование Тогда
		СтрокаТабличнойЧастиСтавки.ПричинаПрименения = ПредопределенноеЗначение("Перечисление.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма");
		СтрокаТабличнойЧастиСтавки.Ставка = 0;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура УсловияСтавкиПроцентовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекСтрока = Элементы.УсловияСтавкиПроцентов.ТекущиеДанные;
	Если НоваяСтрока И Не Копирование Тогда
		ТекСтрока.ПричинаПрименения = ПредопределенноеЗначение("Перечисление.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма"); 
		ТекСтрока.УстановитьЗначениеИлиОтклонение = ПредопределенноеЗначение("Перечисление.ЛБ_УстановкаЗначенияИлиОтклонения.Значение"); 
		ТекСтрока.Ставка = 0;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура УсловияАкцииМеталлыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекСтрока = Элементы.УсловияАкцииМеталлы.ТекущиеДанные;
	Если НоваяСтрока И НЕ Копирование Тогда		
		ТекСтрока.ЕдиницаИзмерения = ОсновнаяЕдиницаИзмерения; 
		ТекСтрока.УстановитьЗначениеИлиОтклонение = ПредопределенноеЗначение("Перечисление.ЛБ_УстановкаЗначенияИлиОтклонения.Значение");
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура НастройкаОтклоненийОтБазовыхЦенМеталлыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И НЕ Копирование Тогда 
		ТекСтрока = Элементы.НастройкаОтклоненийОтБазовыхЦенМеталлы.ТекущиеДанные;
        ТекСтрока.ОтклонениеОтБазовойЦены = ПредопределенноеЗначение("Перечисление.ЛБ_ОтклонениеОтБазовойЦены.Абсолютное");
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтклоненияМеталлыПоНастрокамНаСервере()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ?(Не ЗначениеЗаполнено(Объект.Ссылка), ТекущаяДата(), Объект.Дата));
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_НастройкаРасчетаОценкиЗалогаСрезПоследних.Металл КАК Металл,
	               |	ЛБ_НастройкаРасчетаОценкиЗалогаСрезПоследних.Проба КАК Проба,
	               |	ЛБ_НастройкаРасчетаОценкиЗалогаСрезПоследних.СхемаКредитования КАК СхемаКредитования,
	               |	ЛБ_НастройкаРасчетаОценкиЗалогаСрезПоследних.КатегорияОбъектаЗалога КАК КатегорияОбъектаЗалога,
	               |	ЛБ_НастройкаРасчетаОценкиЗалогаСрезПоследних.ОтклонениеОтБазовойЦены КАК ОтклонениеОтБазовойЦены,
	               |	ЛБ_НастройкаРасчетаОценкиЗалогаСрезПоследних.ЗначениеОтклонения КАК ЗначениеОтклонения
	               |ИЗ
	               |	РегистрСведений.ЛБ_НастройкаРасчетаОценкиЗалога.СрезПоследних(&Дата, Ломбард В (&Ломбарды)) КАК ЛБ_НастройкаРасчетаОценкиЗалогаСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Металл,
	               |	Проба,
	               |	СхемаКредитования,
	               |	КатегорияОбъектаЗалога,
	               |	ЛБ_НастройкаРасчетаОценкиЗалогаСрезПоследних.Период УБЫВ";
	СписокЛ = Новый СписокЗначений;
	Для каждого СтрЛ из Объект.Ломбарды Цикл
		СписокЛ.Добавить(СтрЛ.Ломбард);
	КонецЦикла;	
	Запрос.УстановитьПараметр("Ломбарды", СписокЛ);
	ТаблицаНастроек = Запрос.Выполнить().Выгрузить();
	Объект.НастройкаОтклоненийОтБазовыхЦенМеталлы.Очистить();
	
	Для каждого Стр Из ТаблицаНастроек Цикл  
		 Отбор = новый Структура;
		 Отбор.Вставить("Металл", Стр.Металл);
		 Отбор.Вставить("Проба", Стр.Проба);
		 Отбор.Вставить("СхемаКредитования", Стр.СхемаКредитования); 
		 Отбор.Вставить("КатегорияОбъектаЗалога", Стр.КатегорияОбъектаЗалога);

		 
		 Строки = ТаблицаНастроек.НайтиСтроки(Отбор);
		 Если Строки.Количество() = 0 Тогда
		     НоваяСтр = Объект.НастройкаОтклоненийОтБазовыхЦенМеталлы.Добавить();
			 НоваяСтр.Металл = Стр.Металл;
			 НоваяСтр.Проба = Стр.Проба;
			 НоваяСтр.СхемаКредитования = Стр.СхемаКредитования; 
			 НоваяСтр.КатегорияОбъектаЗалога = Стр.КатегорияОбъектаЗалога;
	         НоваяСтр.ОтклонениеОтБазовойЦены = Стр.ОтклонениеОтБазовойЦены;
	         НоваяСтр.ЗначениеОтклонения = Стр.ЗначениеОтклонения;
         КонецЕсли;
	КонецЦикла	 

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОтклоненияМеталлыПоНастрокам(Команда)
	ЗаполнитьОтклоненияМеталлыПоНастрокамНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НастройкаОтклоненийОтБазовыхЦенВставкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И НЕ Копирование Тогда 
		ТекСтрока = Элементы.НастройкаОтклоненийОтБазовыхЦенВставки.ТекущиеДанные;
        ТекСтрока.ОтклонениеОтБазовойЦены = ПредопределенноеЗначение("Перечисление.ЛБ_ОтклонениеОтБазовойЦены.Абсолютное");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура УсловияСтавкиПроцентовУстановитьЗначениеИлиОтконениеПриИзменении(Элемент)
	ТекСтрока = Элементы.УсловияСтавкиПроцентов.ТекущиеДанные; 
	Если ТекСтрока.УстановитьЗначениеИлиОтклонение = ПредопределенноеЗначение("Перечисление.ЛБ_УстановкаЗначенияИлиОтклонения.Значение") Тогда 
		ТекСтрока.Отклонение = ПредопределенноеЗначение("Перечисление.ЛБ_ОтклонениеОтБазовойЦены.ПустаяСсылка");
		ТекСтрока.ЗначениеОтклонения = 0;
	ИначеЕсли ТекСтрока.УстановитьЗначениеИлиОтклонение = ПредопределенноеЗначение("Перечисление.ЛБ_УстановкаЗначенияИлиОтклонения.Отклонение") Тогда
        ТекСтрока.Ставка = 0;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура УсловияСтавкиПроцентовПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ТекСтрока = Элементы.УсловияСтавкиПроцентов.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекСтрока.СхемаКредитования) Тогда   
		ТекСтрока.УстановитьЗначениеИлиОтклонение = ПредопределенноеЗначение("Перечисление.ЛБ_УстановкаЗначенияИлиОтклонения.Значение");
		ТекСтрока.Отклонение = ПредопределенноеЗначение("Перечисление.ЛБ_ОтклонениеОтБазовойЦены.ПустаяСсылка"); 
		ТекСтрока.ЗначениеОтклонения = 0;
	КонецЕсли;	
КонецПроцедуры

&НаСервере 
Функция ВыбратьСК() 
	СК = Новый СписокЗначений;
    Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Дата, ТекущаяДата()));
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СхемыКредитования.Ссылка КАК СхемаКредитования
	               |ИЗ
	               |	Справочник.ЛБ_СхемыКредитования КАК ЛБ_СхемыКредитования
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_УсловияПредоставленияКредита.СрезПоследних(&Дата, ) КАК ЛБ_УсловияПредоставленияКредитаСрезПоследних
	               |		ПО (ЛБ_УсловияПредоставленияКредитаСрезПоследних.СхемаКредитования = ЛБ_СхемыКредитования.Ссылка)
	               |ГДЕ
	               |	ЛБ_СхемыКредитования.ПометкаУдаления = ЛОЖЬ";
	ТЗ = Запрос.Выполнить().Выгрузить();     
	Массив = ТЗ.ВыгрузитьКолонку("СхемаКредитования");//выгружаем таблицу значений в массив
    СК.ЗагрузитьЗначения(Массив);//загружаем массив в список значений  
	
	Для каждого Стр Из Объект.СхемыКредитования Цикл 
		Эл = СК.НайтиПоЗначению(Стр.СхемаКредитования);
		Если НЕ Эл = неопределено Тогда
	        Эл.Пометка = Истина; 
		КонецЕсли;
	Конеццикла;
	Возврат СК;
КонецФункции

&НаКлиенте
Процедура СписокСКНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СК = ВыбратьСК();  
	
	// процедура ПослеОтметкиЭлементов определена чуть ниже
    ОповещениеПослеОтметкиЭлементов = Новый ОписаниеОповещения(
        "ПослеОтметкиЭлементов", ЭтотОбъект
    );	
 
    СК.ПоказатьОтметкуЭлементов(
        ОповещениеПослеОтметкиЭлементов,
        "Выберите схемы кредитования"
    );
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьСписокСК()
	Результат = "";
	Для каждого Стр Из Объект.СхемыКредитования Цикл
		Результат = Результат + ?(ПустаяСтрока(Результат), "", "; ") + СокрЛП(Стр.СхемаКредитования.Наименование);
	КонецЦикла;	
	СписокСК = Результат; 
	Объект.СтрокаСхемыКредитования = Результат;
КонецПроцедуры	
 

&НаСервере
Процедура ПослеОтметкиЭлементов(Элементы, Параметры) Экспорт 	
	Если Элементы <> Неопределено Тогда   
		ДатаПроверки = ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Дата, ТекущаяДата());
		ТаблицаСК = Объект.СхемыКредитования.Выгрузить();
		ТаблицаСтавок = Объект.СтавкиПроцентов.Выгрузить();
		Объект.СхемыКредитования.Очистить();
		Для Каждого Эл Из Элементы Цикл 
			Если Эл.Пометка Тогда    
				СписокЛ = Новый СписокЗначений; 
				СписокЛ.Добавить(Справочники.ЛБ_Ломбарды.ПустаяСсылка());
				Для каждого Стр Из Объект.Ломбарды цикл 
					СписокЛ.Добавить(Стр.Ломбард);
				Конеццикла;	

				ШаблонПриказа = ЛБ_ОбщийМодуль.ПолучитьТекущийШаблон(ДатаПроверки, Перечисления.ЛБ_ВидыПрейскурантов.ПроцентныеСтавки, СписокЛ, Эл.Значение);
				Если НЕ ШаблонПриказа = неопределено Тогда 
					НоваяСтр = Объект.СхемыКредитования.Добавить(); 
				    НоваяСтр.СхемаКредитования = Эл.Значение;
					НоваяСтр.ШаблонПроцентныеСтавки = ШаблонПриказа;
					
					Отбор = Новый Структура;
				    Отбор.Вставить("СхемаКредитования",Эл.Значение);
					Строки = ТаблицаСК.НайтиСтроки(Отбор);
					Если Строки.Количество() = 0 Тогда
						Для каждого СтрШ Из НоваяСтр.ШаблонПроцентныеСтавки.СтавкиПроцентов Цикл 
							НоваяСтрП = Объект.СтавкиПроцентов.Добавить();
							НоваяСтрП.СхемаКредитования = НоваяСтр.СхемаКредитования;
							НоваяСтрП.СтатусЗалогодателя = СтрШ.СтатусЗалогодателя;
							НоваяСтрП.ДиапазонСумм = СтрШ.ДиапазонСумм;						
							НоваяСтрП.Ставка = 0;
						Конеццикла;	
					Иначе
						СтрокаСК = Строки.Получить(0);
						Если НЕ СтрокаСК.ШаблонПроцентныеСтавки = ШаблонПриказа Тогда 
							СтрокиУдалить = Объект.СтавкиПроцентов.НайтиСтроки(Отбор);  
							Для каждого Стр Из СтрокиУдалить Цикл
								Объект.СтавкиПроцентов.Удалить(Стр);
							КонецЦикла; 
							Для каждого СтрШ Из НоваяСтр.ШаблонПроцентныеСтавки.СтавкиПроцентов Цикл
	                            НоваяСтрП = Объект.СтавкиПроцентов.Добавить();
								НоваяСтрП.СхемаКредитования = НоваяСтр.СхемаКредитования;
								НоваяСтрП.ПричинаПрименения = СтрШ.ПричинаПрименения;
								НоваяСтрП.СтатусЗалогодателя = СтрШ.СтатусЗалогодателя;
								НоваяСтрП.ДиапазонСумм = СтрШ.ДиапазонСумм;
								
								ОтборП = Новый Структура;
					            ОтборП.Вставить("СхемаКредитования", НоваяСтрП.СхемаКредитования);
								ОтборП.Вставить("ПричинаПрименения", НоваяСтрП.ПричинаПрименения);
								ОтборП.Вставить("СтатусЗалогодателя", НоваяСтрП.СтатусЗалогодателя);
								ОтборП.Вставить("ДиапазонСумм", НоваяСтрП.ДиапазонСумм); 
								
								СтрокиП = ТаблицаСтавок.НайтиСтроки(ОтборП); 
								Если НЕ СтрокиП.Количество() = 0 Тогда
									СтрП = строкиП.Получить(0);
								    НоваяСтрП.Ставка = СтрП.ставка;
								Иначе  
								    НоваяСтрП.Ставка = 0;
								КонецЕсли;	
							КонецЦикла;	
						КонецЕсли;	
                    КонецЕсли;
				Иначе
					Сообщить("Для кредитной схемы " + СокрЛП(Эл.Значение) + " не установлен шаблон процентных ставок!");					
				КонецЕсли;	
			Иначе  
				Отбор = Новый Структура;
				Отбор.Вставить("СхемаКредитования",Эл.Значение); 
				Строки = ТаблицаСК.НайтиСтроки(Отбор);
				Если НЕ Строки.Количество() = 0 Тогда
					СтрокиУдалить = Объект.СтавкиПроцентов.НайтиСтроки(Отбор);  
					Для каждого Стр Из СтрокиУдалить Цикл
						Объект.СтавкиПроцентов.Удалить(Стр);
					КонецЦикла; 	 
				КонецЕсли;	
			КонецЕсли;				
		КонецЦикла; 
		ЗаполнитьСписокСК();
    КонецЕсли; 
КонецПроцедуры  

&НаСервере  
Функция ПолучитьШаблонПриказаПроцентныеставкиНасервере(ДатаПроверки, СК)  
	СписокЛ = Новый СписокЗначений; 
	СписокЛ.Добавить(Справочники.ЛБ_Ломбарды.ПустаяСсылка());
	Для каждого Стр Из Объект.Ломбарды цикл 
		СписокЛ.Добавить(Стр.Ломбард);
	Конеццикла;	
	Возврат ЛБ_ОбщийМодуль.ПолучитьТекущийШаблон(ДатаПроверки, Перечисления.ЛБ_ВидыПрейскурантов.ПроцентныеСтавки, СписокЛ, СК);
КонецФункции

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если Объект.Проведен Тогда
		Сообщить("Для изменения даты документа необходимо отменить проведение!"); 
		Объект.Дата = ДатаДок;
		Возврат;
	КонецЕсли;     
	
	Если НЕ Объект.СхемыКредитования.Количество() = 0 Тогда 
		ТекстВопроса = "";        
		ДатаПроверки = ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Дата, ТекущаяДата());
		Для каждого стр Из Объект.СхемыКредитования цикл 
			ШаблонПриказа = ПолучитьШаблонПриказаПроцентныеставкиНасервере(ДатаПроверки, Стр.СхемаКредитования);  
			Если ШаблонПриказа = неопределено Тогда 
				ТекстВопроса = ТекстВопроса + ?(Пустаястрока(ТекстВопроса), "", Символы.ПС) + "Для кредитной схемы " + СокрЛП(Стр.СхемаКредитования) + " на выбранную дату не установлен шаблон процентных ставок, все настройки процентых ставок будут удалены.";
			ИначеЕсли НЕ ШаблонПриказа = Стр.ШаблонПроцентныеСтавки Тогда  
				ТекстВопроса = ТекстВопроса + ?(Пустаястрока(ТекстВопроса), "", Символы.ПС) + "Для кредитной схемы " + СокрЛП(Стр.СхемаКредитования) + " на выбранную дату установлен другой шаблон процентных ставок, процентные ставки будут перезаполнены.";
			КонецЕсли;	
		Конеццикла;	
		Если НЕ Пустаястрока(ТекстВопроса) Тогда  
			ТекстВопроса = ТекстВопроса + Символы.ПС + "Продолжить?";
		    Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопрос", ЭтаФорма); 
            ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, 0,  КодВозвратаДиалога.Нет); 
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры    

&НаКлиенте
Процедура ПослеОтветаНаВопрос(Результат, Параметры) Экспорт 
	Если Результат = КодВозвратаДиалога.Да Тогда 
		ДатаПроверки = ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Дата, ТекущаяДата());
        ТаблицаСтавок = Объект.СтавкиПроцентов.Выгрузить();
		УдСтрокиСК = Новый СписокЗначений;
		Для каждого стр Из Объект.СхемыКредитования цикл 
			ШаблонПриказа = ПолучитьШаблонПриказаПроцентныеставкиНасервере(ДатаПроверки, Стр.СхемаКредитования);
			Отбор = Новый Структура;
			Отбор.Вставить("СхемаКредитования", Стр.СхемаКредитования);
			Если ШаблонПриказа = неопределено Тогда 
				УдСтрокиСК.Добавить(Стр);				 
				СтрокиУдалить = Объект.СтавкиПроцентов.НайтиСтроки(Отбор);  
				Для каждого СтрП Из СтрокиУдалить Цикл
					Объект.СтавкиПроцентов.Удалить(СтрП);
				КонецЦикла; 	 
			ИначеЕсли НЕ ШаблонПриказа = Стр.ШаблонПроцентныеСтавки Тогда 
				Стр.ШаблонПроцентныеСтавки = ШаблонПриказа;
				СтрокиУдалить = Объект.СтавкиПроцентов.НайтиСтроки(Отбор);  
				Для каждого Стр Из СтрокиУдалить Цикл
					Объект.СтавкиПроцентов.Удалить(Стр);
				КонецЦикла; 	
				Для каждого СтрШ Из Стр.ШаблонПроцентныеСтавки.СтавкиПроцентов Цикл
	                НоваяСтрП = Объект.СтавкиПроцентов.Добавить();
					НоваяСтрП.СхемаКредитования = Стр.СхемаКредитования;
					НоваяСтрП.ПричинаПрименения = СтрШ.ПричинаПрименения;
					НоваяСтрП.СтатусЗалогодателя = СтрШ.СтатусЗалогодателя;
					НоваяСтрП.ДиапазонСумм = СтрШ.ДиапазонСумм;
					
					ОтборП = Новый Структура;
		            ОтборП.Вставить("СхемаКредитования", НоваяСтрП.СхемаКредитования);
					ОтборП.Вставить("ПричинаПрименения", НоваяСтрП.ПричинаПрименения);
					ОтборП.Вставить("СтатусЗалогодателя", НоваяСтрП.СтатусЗалогодателя);
					ОтборП.Вставить("ДиапазонСумм", НоваяСтрП.ДиапазонСумм); 
					
					СтрокиП = ТаблицаСтавок.НайтиСтроки(ОтборП); 
					Если НЕ СтрокиП.Количество() = 0 Тогда
						СтрП = строкиП.Получить(0);
					    НоваяСтрП.Ставка = СтрП.ставка;
					Иначе  
					    НоваяСтрП.Ставка = 0;
					КонецЕсли;	
                Конеццикла;
			КонецЕсли;	
		Конеццикла;	 
		Для каждого Эл Из УдСтрокиСК Цикл
			Объект.СхемыКредитования.Удалить(Эл.Значение);
		КонецЦикла;	
	Иначе
       Объект.Дата = ДатаДок;	
    КонецЕсли;   
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокВыбораВидовОгранки(Идентификатор)
	Стр = Объект.ЦеныВставки.НайтиПоИдентификатору(Идентификатор); 
	Возврат ЛБ_УправлениеЛомбардом.ПолучитьСписокВыбораВидовОгранки(Стр.ВидВставки, Стр.ФормаОгранки);
КонецФункции

&НаКлиенте
Процедура ЦеныВставкиВидОгранкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	ТекСтрока = Элементы.ЦеныВставки.ТекущиеДанные;
	СписокВ = ПолучитьСписокВыбораВидовОгранки(ТекСтрока.ПолучитьИдентификатор());
    ВыбЗначение = ВыбратьИзСписка(СписокВ, Элемент);
	Если НЕ ВыбЗначение = неопределено Тогда  
		ТекСтрока.ВидОгранки = ВыбЗначение.Значение;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьЕдиницуИзмерения(Идентификатор)
	Стр = Объект.ЦеныВставки.НайтиПоИдентификатору(Идентификатор); 
    Возврат Стр.ВидВставки.ЕдиницаИзмерения;
КонецФункции	

&НаКлиенте
Процедура ЦеныВставкиВидВставкиПриИзменении(Элемент)
	ТекСтрока = Элементы.ЦеныВставки.ТекущиеДанные; 
	ТекСтрока.ЕдиницаИзмерения = ПолучитьЕдиницуИзмерения(ТекСтрока.ПолучитьИдентификатор());
КонецПроцедуры

&НаКлиенте
Процедура СпособВыводаЛомбардовНаПечатьПриИзменении(Элемент) 
	Объект.ВыводитьЛомбарды = СпособВыводаЛомбардовНаПечать;
КонецПроцедуры







