// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	Движения.ЛБ_ЦеныОбъектовЗалога.Записывать = Истина;
		
	Для каждого Стр Из ЭтотОбъект.Товары Цикл
		Если Стр.ФактическаяЦена = 0 Тогда
			Продолжить;
		КонецЕсли;	
		Движение = Движения.ЛБ_ЦеныОбъектовЗалога.Добавить();
		Движение.Период = Дата; 
		Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
		Движение.ОбъектЗалога = Стр.ОбъектЗалога;
		Движение.Цена = стр.ФактическаяЦена; 
	Конеццикла;		
КонецПроцедуры

// Процедура - обработчик события "ОбработкаУдаленияПроведения".
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	Если НЕ НачалоДня(ЭтотОбъект.Дата) = НачалоДня(ТекущаяДатаСеанса()) Тогда  
		Если НЕ УправлениеДоступом.ЕстьРоль("ЛБ_Суперпользователь") Тогда 
            ОбщегоНазначения.СообщитьПользователю("Вам запрещена отмена проведения этого документа!");
			Отказ = Истина; 
			Возврат;
		КонецЕсли;	
	КонецЕсли;	
			
	ЗапросП = Новый Запрос;
	ЗапросП.УстановитьПараметр("Дата", ЭтотОбъект.Дата); 
	ЗапросП.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	ЗапросП.УстановитьПараметр("ОбъектыЗалога", ЭтотОбъект.Товары.ВыгрузитьКолонку("ОбъектЗалога"));
	ЗапросП.Текст = "ВЫБРАТЬ
	                |	ЛБ_УстановкаЦеныТовары.Ссылка КАК Ссылка
	                |ИЗ
	                |	Документ.ЛБ_УстановкаЦены.Товары КАК ЛБ_УстановкаЦеныТовары
	                |ГДЕ
	                |	ЛБ_УстановкаЦеныТовары.Ссылка <> &Ссылка
	                |	И ЛБ_УстановкаЦеныТовары.ОбъектЗалога В(&ОбъектыЗалога)
	                |	И ЛБ_УстановкаЦеныТовары.Ссылка.Дата >= &Дата
	                |	И ЛБ_УстановкаЦеныТовары.Ссылка.ПометкаУдаления = ЛОЖЬ";
	ВыборкаП = ЗапросП.Выполнить().Выбрать();
	Если ВыборкаП.Следующий() тогда 
		Сообщить("Есть более поздние документы установки цены объектов залога из документа. Снятие документа с проведения запрещено.");  
		Отказ = Истина;
		Возврат;
	КонецЕсли;                                        
		
КонецПроцедуры // ОбработкаУдаленияПроведения()
