&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Документ") Тогда
        ДокументВыдачиЗалога = Параметры.Документ;
		Если ДокументВыдачиЗалога.Проведен тогда
			НеРедактировать = Истина;
			Элементы.ДекорацияСтатусДокумента.Заголовок = "Факт"; 
			Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноБордовый;  
			Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.ТусклоРозовый;
		Иначе
			Элементы.ДекорацияСтатусДокумента.Заголовок = "Проект"; 
			Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноЗеленый;
			Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.СветлоЗеленый;
		КонецЕсли;	
		ДатаДок = ДокументВыдачиЗалога.Дата; 
		Ломбард = ДокументВыдачиЗалога.Ломбард; 
		ОтветственныйПользователь = ДокументВыдачиЗалога.ОтветственныйПользователь;
		ОтветственныйСотрудник = ДокументВыдачиЗалога.ОтветственныйСотрудник;
		Комментарий = ДокументВыдачиЗалога.Комментарий;
		ЗалоговыйБилет = ДокументВыдачиЗалога.ПредыдущаяОперация;
		Получатель = ДокументВыдачиЗалога.Залогодатель; 
		ЗаполнитьКонтакнуюИнформацию();
		ДокументПолучателя = ДокументВыдачиЗалога.ДокументЗалогодателя;
		ЗаполнитьИнформациюОДокументе();		
		ДопДокументы.Загрузить(ДокументВыдачиЗалога.ДополнительныеДокументыПравоПребыванияРФ.Выгрузить()); 
		Если НЕ Получатель = ЗалоговыйБилет.Залогодатель Тогда 
			Элементы.ГруппаДоверенность.Видимость = Истина; 
			ЗаполнитьСписокВыбораДоверенностейПолучателя();
			ДоверенностьПолучателя = ДокументВыдачиЗалога.ДоверенностьПредставителя;
			ЗаполнитьТекстДоверенности();
		КонецЕсли;	
		ЗаполнитьТовары();  
		ЗаполнитьСостояниеЗалоговогоБилета();
		//+Мельников 25.04.24 Отмена операции.
		ДокументОтмены = ПолучитьДокументОтмены(ДокументВыдачиЗалога); //Было: ДокументВыдачиЗалога.ДокументОтмены;
		//-Мельников        
		Если Параметры.ТолькоПросмотр = Истина Тогда	
			Этаформа.ТолькоПросмотр = Истина;
		КонецЕсли;
	ИначеЕсли Параметры.Свойство("ЗалоговыйБилет") Тогда
		ЗалоговыйБилет = Параметры.ЗалоговыйБилет; 
		Ломбард = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя(); 
		ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
		//Если НЕ ТекПользователь.ЭтоЛомбард Тогда
		//  	Ответственный = ТекПользователь;
		//Иначе
		//	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
		//КонецЕсли;
		ОтветственныйПользователь = ПараметрыСеанса.ТекущийПользователь;
		ОтветственныйСотрудник = ПараметрыСеанса.ТекущийСотрудник;


		
		ДатаДок = ТекущаяДатаСеанса();
				
		Если Параметры.Свойство("Получатель") Тогда
			Получатель = Параметры.Получатель;  
			Если Параметры.Свойство("ДокументПолучателя") Тогда 
				ДокументПолучателя = Параметры.ДокументПолучателя;
				Если ЗначениеЗаполнено(ДокументПолучателя) Тогда 
					ЗаполнитьИнформациюОДокументе();
				КонецЕсли;	
			КонецЕсли;	
        Иначе
		    Получатель = ЗалоговыйБилет.Залогодатель;
			ДокументПолучателя = ЗалоговыйБилет.ДокументЗалогодателя;
		    ЗаполнитьИнформациюОДокументе(); 
		КонецЕсли;	
		ЗаполнитьКонтакнуюИнформацию();
		Если НЕ Получатель = ЗалоговыйБилет.Залогодатель Тогда 
			Элементы.ГруппаДоверенность.Видимость = Истина; 
			ЗаполнитьСписокВыбораДоверенностейПолучателя();
			Если Параметры.Свойство("Доверенность") Тогда
				Для Сч = 0 По Элементы.Доверенность.СписокВыбора.Количество()-1 Цикл 
					Если Элементы.Доверенность.СписокВыбора.Получить(сч).Значение = Параметры.Доверенность Тогда
					    ДоверенностьПолучателя = Элементы.Доверенность.СписокВыбора.Получить(сч).Значение;
					    ЗаполнитьТекстДоверенности();
						Прервать;
					КонецЕсли;	
				КонецЦикла;  
			КонецЕсли;
		КонецЕсли;	        
		ЗаполнитьДопДокументы(); 
   		ЗаполнитьТовары();  
		ЗаполнитьСостояниеЗалоговогоБилета();
		СпособОплаты = 1; 	
			
		//СтатусЗБ = ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(ДатаДок, ЗалоговыйБилет);	
		//Если НЕ СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтвественноеХранение Тогда	
		//	Сообщить("Статус выбранного залогового билета на " + Формат(ЭтаФорма.ДатаДок, "ДЛФ=DT") + ?(СтатусЗБ = неопределено, " не определен", " " + строка(СтатусЗБ)) + ". Выдача залога не возможна!"); 
		//    //Отказ = Истина;
		//КонецЕсли;	
	Иначе 
		Сообщить("Не выбран залоговый билет!"); 
		Отказ = Истина;
	КонецЕсли;
	УстановитьВидимость();
КонецПроцедуры   

&НаСервере
Процедура УстановитьВидимость()
	Если Гражданство = Справочники.СтраныМира.Россия Тогда 
		Элементы.ГруппаДопДокумент.Видимость = Ложь;
	Иначе 
		Элементы.ГруппаДопДокумент.Видимость = Истина;
	КонецЕсли;	
	//+Мельников 25.04.24 Отмена операции
	ПроверкаПоследующихОпереаций = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(ЗалоговыйБилет.НомерЗалоговогоБилета, ТекущаяДата(),,Истина);
	ЛомбардПользователя = ЛБ_ОбщийМодуль.ПолучитьЛомбардПользователя(ПараметрыСеанса.ТекущийПользователь);

	Если ДокументВыдачиЗалога.Проведен И НЕ ТекущаяДата() - ДатаДок >= 3600 И ЛомбардПользователя = ДокументВыдачиЗалога.Ломбард И
		?(ЗначениеЗаполнено(ДокументВыдачиЗалога), ?(ПроверкаПоследующихОпереаций = Неопределено, Истина, ?(ПроверкаПоследующихОпереаций.Регистратор = ДокументВыдачиЗалога, Истина, Ложь)), Ложь) Тогда

		Элементы.ОтменитьОперацию.Доступность = Истина;
	Иначе
		Элементы.ОтменитьОперацию.Доступность = Ложь;
	КонецЕсли;

	//+МАН 17.06.25 Изменил
	//Если ЗначениеЗаполнено(ДокументВыдачиЗалога.ДокументОтмены) Тогда
	Если ЗначениеЗаполнено(ДокументОтмены) Тогда
	//-МАН
		Элементы.ГруппаОтмена.Видимость = Истина;
		//+Мельников 28.05.24
		Элементы.Расчеты.Доступность = Ложь;
		Элементы.Редактировать.Доступность = Ложь;
		//-Мельников
	КонецЕсли;
	//-Мельников
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДопДокументы()  
	Если НЕ ЗначениеЗаполнено(Гражданство) Или Гражданство = Справочники.СтраныМира.Россия тогда 
		ДопДокументы.Очистить();
	Иначе	
		ДопДокументы.Загрузить(ЛБ_УправлениеЛомбардом.ПолучитьДокументыПравоПребыванияРФ(ДатаДок, Получатель, Гражданство));
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьТовары() 
	Запрос = новый Запрос;   
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Если ЗначениеЗаполнено(ДокументВыдачиЗалога) И ДокументВыдачиЗалога.Проведен Тогда 
		ДатаПроверки = ДатаДок-1; 
	Иначе	
	    ДатаПроверки = ДатаДок;
	КонецЕсли;	   
	Запрос.УстановитьПараметр("Дата", ДатаПроверки);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.ОбъектЗалога КАК ОбъектЗалога,
	               |	СУММА(ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.СуммаРасход) КАК СуммаОплаты
	               |ИЗ
	               |	РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Обороты(, &Дата, , ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.ОбъектЗалога";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_ОбъектыЗалогаОстатки.Ломбард КАК Ломбард,
	               |	СУММА(ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток) КАК Количество
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(&Дата, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_ОбъектыЗалогаОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога,
	               |	ЛБ_ОбъектыЗалогаОстатки.Ломбард";
	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
	
	ТаблицаТоваров.Очистить(); 
	Ном = 0;
	Для каждого стр Из ЗалоговыйБилет.Товары цикл  
		Если ЗалоговыйБилет.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда 
			Если НЕ Стр.Переоформить тогда
				Продолжить;
			КонецЕсли;	
		КонецЕсли;	      
		Ном = Ном + 1;
		НоваяСтр = ТаблицаТоваров.Добавить(); 
		НоваяСтр.Номерстроки = Стр.Номерстроки;
		НоваяСтр.Артикул = ЛБ_УправлениеЛомбардом.АртикулОбъектаЗалога(ЗалоговыйБилет, Ном);
		НоваяСтр.ОбъектЗалога = стр.ОбъектЗалога;
		НоваяСтр.СуммаОценки = стр.СуммаСсуды;  
		НоваяСтр.СтатусОбъектаЗалога = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектаЗалога(ДатаДок, Стр.ОбъектЗалога, ЗалоговыйБилет);
		Отбор = Новый структура;
		Отбор.Вставить("ОбъектЗалога", НоваяСтр.ОбъектЗалога);
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
		Если НЕ строки.Количество() = 0 тогда			
			НоваяСтр.СуммаОплаты = Строки.Получить(0).СуммаОплаты;
		КонецЕсли;	    
		НоваяСтр.Задолженность = НоваяСтр.СуммаОценки - НоваяСтр.СуммаОплаты;
		//Если ЗначениеЗаполнено(ДокументВыдачиЗалога) И НеРедактировать Тогда 
		//	Строки = ДокументВыдачиЗалога.ТоварыВыкупленные.НайтиСтроки(Отбор);
		//	Если НЕ Строки.Количество() = 0 тогда
		//		НоваяСтр.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.Выкуплен;
		//		НоваяСтр.ВернутьЗалог = Истина; 
		//		НоваяСтр.ПроверкаВернутьЗалог = ложь;  
		//	КонецЕсли;	
		//Иначе	
			Отбор.Вставить("Ломбард", Ломбард);
			Строки = ТаблицаОстатков.НайтиСтроки(Отбор);
			Если НЕ Строки.Количество() = 0 тогда  
				НоваяСтр.ВернутьЗалог = Истина; 
				НоваяСтр.ПроверкаВернутьЗалог = ?(НоваяСтр.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.Выкуплен ИЛИ НоваяСтр.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.Изъят, Ложь, Истина);   
			ИначеЕсли НЕ НоваяСтр.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.Изъят И НЕ НоваяСтр.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.Реализован  Тогда
				Отбор.Удалить("Ломбард");
				Строки = ТаблицаОстатков.НайтиСтроки(Отбор);
				Если НЕ Строки.Количество() = 0 тогда 
					Сообщить("Объект залога " + сокрЛП(стр.ОбъектЗалога) + " находится в " + СокрЛП(Строки.Получить(0).Ломбард));
				Иначе
					Сообщить("Местонахождение объекта залога " + сокрЛП(стр.ОбъектЗалога) + " не определено", СтатусСообщения.Важное);
	            КонецЕсли;
			КонецЕсли;
		//КонецЕсли;	
	Конеццикла;	
	
	ТоварыИтогОценка = ТаблицаТоваров.Итог("СуммаОценки");
	ТоварыИтогОплата = ТаблицаТоваров.Итог("СуммаОплаты");
	ТоварыИтогДолг = ТаблицаТоваров.Итог("Задолженность");
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьСостояниеЗалоговогоБилета() 
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
	Если ЗначениеЗаполнено(ДокументВыдачиЗалога) Тогда
		Запрос.УстановитьПараметр("Период", ДатаДок-1); 
	Иначе	
	    Запрос.УстановитьПараметр("Период", ДатаДок); 
	КонецЕсли;	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилета.Регистратор КАК Регистратор,
	               |	ЛБ_СостояниеЗалоговогоБилета.СуммаЗайма КАК СуммаЗайма,
	               |	ЛБ_СостояниеЗалоговогоБилета.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета КАК ЛБ_СостояниеЗалоговогоБилета
	               |ГДЕ
	               |	ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет = &ЗалоговыйБилет
	               |	И ЛБ_СостояниеЗалоговогоБилета.Период <= &Период
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_СостояниеЗалоговогоБилета.Период";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	Если ТаблицаЗапроса.Количество() > 0 Тогда   
		КолСтр = ТаблицаЗапроса.Количество()-1;
		СтрСостояние = ТаблицаЗапроса.Получить(КолСтр);
		НоваяСтр = ТаблицаСостояний.Добавить();
		НоваяСтр.Состояние = "Состояние залогового билета до возврата залога"; 
		НоваяСтр.КлючСтроки = 2;
		НоваяСтр.Статус = СтрСостояние.СтатусЗалоговогоБилета; 
		НоваяСтр.СуммаЗайма = СтрСостояние.СуммаЗайма; 
		
		НоваяСтр = ТаблицаСостояний.Добавить();
		НоваяСтр.Состояние = "Состояние залогового билета после возврата залога";
		НоваяСтр.КлючСтроки = 3;  
		НоваяСтр.Статус = ?(СтрСостояние.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтвественноеХранение ИЛИ СтрСостояние.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Наследство, Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт, СтрСостояние.СтатусЗалоговогоБилета); 
		НоваяСтр.СуммаЗайма = СтрСостояние.СуммаЗайма;   
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтакнуюИнформацию()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("Залогодатель", Получатель);
    Запрос.Текст = "ВЫБРАТЬ
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРождения КАК МестоРождения,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Email КАК Email,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПрописке КАК АдресПоПрописке,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ФактическийАдрес КАК ФактическийАдрес,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Пол КАК Пол,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК Телефон,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество
                   |ИЗ
                   |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		КонтактнаяИнформация = "";
		КонтактнаяИнформация = КонтактнаяИнформация + ?(ЗначениеЗаполнено(Выборка.Гражданство), СокрЛП(Выборка.Гражданство), "");
		КонтактнаяИнформация = КонтактнаяИнформация + ?(ЗначениеЗаполнено(Выборка.Пол), ?(ПустаяСтрока(КонтактнаяИнформация), "", "; ") + "пол.: " + Строка(Выборка.Пол), "");
		КонтактнаяИнформация = КонтактнаяИнформация + ?(ЗначениеЗаполнено(Выборка.ДатаРождения), ?(ПустаяСтрока(КонтактнаяИнформация), "", "; ") + "дата рожд.: " +  Формат(Выборка.ДатаРождения, "ДФ=dd.MM.yyyy"), "");
		КонтактнаяИнформация = КонтактнаяИнформация + ?(ЗначениеЗаполнено(Выборка.МестоРождения), ?(ПустаяСтрока(КонтактнаяИнформация), "", "; ") + "место рожд.: " +  СокрЛП(Выборка.МестоРождения), "");
		КонтактнаяИнформация = КонтактнаяИнформация + ?(ЗначениеЗаполнено(Выборка.Телефон), ?(ПустаяСтрока(КонтактнаяИнформация), "", "; ") + "тел.: " + СокрЛП(Выборка.Телефон), "");
		КонтактнаяИнформация = КонтактнаяИнформация + ?(ЗначениеЗаполнено(Выборка.Email), ?(ПустаяСтрока(КонтактнаяИнформация), "", "; ") + "email: " + СокрЛП(Выборка.Email), "");
		Если ЗначениеЗаполнено(Выборка.АдресПоПрописке) Тогда
			АдресК = "адрес по прописке: " + СокрЛП(Выборка.АдресПоПрописке);
		Иначе  
			АдресК = "фактический адрес: " + СокрЛП(Выборка.ФактическийАдрес);
		КонецЕсли;	
		КонтактнаяИнформация = КонтактнаяИнформация + ?(ПустаяСтрока(КонтактнаяИнформация), "", "; ") + АдресК;

		ФИО = СокрЛП(Выборка.Фамилия) + " " + СокрЛП(Выборка.Имя) + ?(НЕ ПустаяСтрока(Выборка.Отчество), " " + СокрЛП(Выборка.Отчество), "");
		Гражданство = Выборка.Гражданство; 
		ДатаРождения = Выборка.ДатаРождения;
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьИнформациюОДокументе()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("ДокументЗалогодателя", ДокументПолучателя);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНачалоДействия КАК ДокументНачалоДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&Дата, ДокументЗалогодателя = &ДокументЗалогодателя) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Информация = "";
		Информация = СокрЛП(Выборка.ВидДокумента);
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументСерия), " " + СокрЛП(Выборка.ДокументСерия), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументНомер), " " + СокрЛП(Выборка.ДокументНомер), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументКемВыдан), " выдан " + СокрЛП(Выборка.ДокументКемВыдан), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументДатаВыдачи), " " + Формат(Выборка.ДокументДатаВыдачи,"ДФ=dd.MM.yyyy"), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументКодПодразделения), " код подр. " + СокрЛП(Выборка.ДокументКодПодразделения), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументНачалоДействия), " действует с " + Формат(Выборка.ДокументНачалоДействия,"ДФ=dd.MM.yyyy"), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументСрокДействия), " по " + Формат(Выборка.ДокументСрокДействия,"ДФ=dd.MM.yyyy"), "");
		Паспорт = Информация;
   	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КарточкаПолучателя(Команда)
	СтандартнаяОбработка = ложь;
	Если ЗначениеЗаполнено(Получатель) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Залогодатель", Получатель);
		ПараметрыФормы.Вставить("Дата", ДатаДок);	
		ПараметрыФормы.Вставить("ТолькоПросмотр", истина);
		//ПараметрыФормы.Вставить("НеРедактировать", истина); 
		
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеИзмененияКарточки",ЭтаФорма);
		ОткрытьФорму("ОбщаяФорма.ЛБ_КарточкаЗалогодателя", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Сообщить("Не выбран получатель!");
	КонецЕсли;	
КонецПроцедуры 

&НаСервере
Функция ПолучитьДокументПолучателя() 
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("Залогодатель", Получатель);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя КАК ДокументЗалогодателя
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(
	               |			&Дата,
	               |			ДокументЗалогодателя.Владелец = &Залогодатель
	               |				И ОсновнойДУЛ = ИСТИНА) КАК ЛБ_ДокументыЗалогодателейСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Период УБЫВ"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДокументЗалогодателя;
	КонецЕсли; 
	Возврат ДокументПолучателя;
КонецФункции

&НаКлиенте
Процедура ПослеИзмененияКарточки(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;   
	
	Если ЭтаФорма.НеРедактировать тогда
		Возврат;
	КонецЕсли;	
	
	//Если НЕ ЗначениеЗаполнено(ДокументВыдачиЗалога) И НачалоДня(ДатаДок) = НачалоДня(ТекущаяДата()) Тогда	
	ДатаСеанса = ОбщегоНазначенияКлиент.ДатаСеанса();
	Если НачалоДня(ДатаДок) = НачалоДня(ДатаСеанса) Тогда	
		ДатаДок = ДатаСеанса;
	КонецЕсли;	
    ЗаполнитьКонтакнуюИнформацию(); 
	НовыйДокументПолучателя = ПолучитьДокументПолучателя();
	Если НЕ ДокументПолучателя = НовыйДокументПолучателя Тогда
		ДокументПолучателя = НовыйДокументПолучателя;
		ЗаполнитьИнформациюОДокументе();
	    ЗаполнитьДопДокументы();	
	КонецЕсли;	
 КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьИнформациюОплательщике() 
	ЗаполнитьКонтакнуюИнформацию(); 
	ЗаполнитьИнформациюОДокументе();	  
	ЗаполнитьДопДокументы(); 
	Если НЕ Получатель = ЗалоговыйБилет.Залогодатель Тогда 
		ЗаполнитьСписокВыбораДоверенностейПолучателя();
		Если НЕ Элементы.Доверенность.СписокВыбора.Количество() = 0 Тогда
			Для Сч = 0 По Элементы.Доверенность.СписокВыбора.Количество()-1 Цикл 
				Если НЕ Элементы.Доверенность.СписокВыбора.Получить(сч).Значение = ДоверенностьПолучателя Тогда
				    ДоверенностьПолучателя = Элементы.Доверенность.СписокВыбора.Получить(сч).Значение;
				    ЗаполнитьТекстДоверенности();
					Прервать;
				КонецЕсли;	
			КонецЦикла; 
		Иначе    
			ДоверенностьПолучателя = ПредопределенноеЗначение("Документ.ЛБ_Доверенности.ПустаяСсылка");
			Доверенность = "";
		КонецЕсли;	
	КонецЕсли;	    
КонецПроцедуры	

&НаКлиенте
Процедура ДатаДокПриИзменении(Элемент) 
	ЗаполнитьИнформациюОплательщике();
	
	ТаблицаСостояний.Очистить(); 
	ТаблицаТоваров.Очистить();
	ЗаполнитьТовары();  
	ЗаполнитьСостояниеЗалоговогоБилета();   
	
	Отбор = Новый структура;
	Отбор.Вставить("КлючСтроки", 2);
	СтрокиС = ТаблицаСостояний.НайтиСтроки(Отбор);
	Если НЕ СтрокиС.Количество() = 0 Тогда    
		СтатусЗБ = СтрокиС.Получить(0).Статус;
		Если НЕ СтатусЗБ = Строка(ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыЗалоговыхБилетов.ОтвественноеХранение")) Тогда 
			Сообщить("Статус выбранного залогового билета на " + Формат(ЭтаФорма.ДатаДок, "ДЛФ=DT") + ?(СтатусЗБ = неопределено, " не определен", " """ + строка(СтатусЗБ)+ """") + ". Выдача залога не возможна!");
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры        
	

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть(?(ЗначениеЗаполнено(ДокументВыдачиЗалога), ДокументВыдачиЗалога, неопределено));
КонецПроцедуры

&НаСервере
Функция ПроверитьКлиентаПоПеречням()
	РезультатПроверки = Истина;
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Залогодатель", Получатель);  
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КлиентыВПеречняхСрезПоследних.ВидПеречня КАК ВидПеречня
	               |ИЗ
	               |	РегистрСведений.ЛБ_КлиентыВПеречнях.СрезПоследних(
	               |			&Дата,
	               |			Залогодатель = &Залогодатель
	               |				И СтатусКлиентаВПеречне = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыКлиентаВПеречнях.Включен)) КАК ЛБ_КлиентыВПеречняхСрезПоследних"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Если Выборка.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.Террористы Тогда
			ОбщегоНазначения.СообщитьПользователю("Клиент " + СокрЛП(ФИО) + " найден в перечне террористов. Операции с клиентом запрещены!");  
			РезультатПроверки = Ложь;
		ИначеЕсли Выборка.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ФРОМУ Тогда
			ОбщегоНазначения.СообщитьПользователю("Клиент " + СокрЛП(ФИО) + " найден в перечне ФРОМУ. Операции с клиентом запрещены!");  
			РезультатПроверки = Ложь;
        ИначеЕсли Выборка.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.МВК Тогда
			ОбщегоНазначения.СообщитьПользователю("Клиент " + СокрЛП(ФИО) + " найден в списке МВК. Операции с клиентом запрещены!");  
			РезультатПроверки = Ложь;
		ИначеЕсли Выборка.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ООН Тогда
			ОбщегоНазначения.СообщитьПользователю("Клиент " + СокрЛП(ФИО) + " найден в перечне ООН. Операции с клиентом запрещены!", СтатусСообщения.Важное);  
			РезультатПроверки = Ложь;		
		КонецЕсли;	
	Конеццикла;  
	
	Если РезультатПроверки И НЕ Получатель = ЗалоговыйБилет.Залогодатель Тогда  
		//проверим владельца залогового билета
		Запрос.УстановитьПараметр("Залогодатель", ЗалоговыйБилет.Залогодатель);  
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_КлиентыВПеречняхСрезПоследних.ВидПеречня КАК ВидПеречня
		               |ИЗ
		               |	РегистрСведений.ЛБ_КлиентыВПеречнях.СрезПоследних(
		               |			&Дата,
		               |			Залогодатель = &Залогодатель
		               |				И СтатусКлиентаВПеречне = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыКлиентаВПеречнях.Включен)) КАК ЛБ_КлиентыВПеречняхСрезПоследних"; 
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл 
			Если Выборка.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.Террористы Тогда
				ОбщегоНазначения.СообщитьПользователю("Заемщик найден в перечне террористов. Операции с клиентом запрещены!");  
				РезультатПроверки = Ложь;
			ИначеЕсли Выборка.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ФРОМУ Тогда
				ОбщегоНазначения.СообщитьПользователю("Заемщик найден в перечне ФРОМУ. Операции с клиентом запрещены!");  
				РезультатПроверки = Ложь;
	        ИначеЕсли Выборка.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.МВК Тогда
				ОбщегоНазначения.СообщитьПользователю("Заемщик найден в списке МВК. Операции с клиентом запрещены!");  
				РезультатПроверки = Ложь;
			ИначеЕсли Выборка.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ООН Тогда
				ОбщегоНазначения.СообщитьПользователю("Заемщик найден в перечне ООН. Операции с клиентом запрещены!", СтатусСообщения.Важное);  
				РезультатПроверки = Ложь;		
			КонецЕсли;	
		Конеццикла;  
	КонецЕсли;	
	Возврат РезультатПроверки;
КонецФункции	

&НаСервере
Функция ПроверкаКлиента() 
	ВсеОК = Истина;
	//Если СуммаОплаты = 0 Тогда
	//	Сообщить("Не определена сумма оплаты! Документ не может быть записан.");
	//	ВсеОК = ложь;
	//КонецЕсли;  
	
	ВозрастКлиента = ЛБ_ОбщийМодуль.ВычислитьВозраст(ДатаРождения);
	Если ВозрастКлиента  < 18 Тогда 
		Если НЕ ДоверенностьПолучателя.ВидДоверенности = Перечисления.ЛБ_ВидыДоверенностей.СвидетельствоОСмерти Тогда
		    Сообщить("Клиенту " + Строка(ВозрастКлиента) + " лет, работа с несовершеннолетними клиентами не осуществляется!", СтатусСообщения.Важное);
			ВсеОК = ложь;  
		КонецЕсли;	
	КонецЕсли;	
	
	Если НЕ ПроверитьКлиентаПоПеречням() Тогда
		ВсеОК = ложь;
	КонецЕсли; 
	
	Если НЕ Получатель = ЗалоговыйБилет.Залогодатель Тогда
		Если НЕ ЗначениеЗаполнено(ДоверенностьПолучателя) Тогда
			Сообщить("Не выбрана доверенность представителя заемщика");
			ВсеОк = ложь;
		КонецЕсли;
	КонецЕсли;	
		
	Возврат ВсеОК;
КонецФункции    

&НаСервере
Функция ПроверкаЗаполненияДокумента(НовыйДокумент) 
	Результат = Истина;
	Если ((НовыйДокумент.ДокументВид = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ) ИЛИ 
	   (НовыйДокумент.ДокументВид = Справочники.ВидыДокументовФизическихЛиц.ВидНаЖительство И НовыйДокумент.ДокументВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность)) Тогда
	    Если НовыйДокумент.ДокументВид = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ Тогда 			    
			Парам = Новый Структура("Серия, Номер", СокрЛП(НовыйДокумент.ДокументСерия), СокрЛП(НовыйДокумент.ДокументНомер));
			Если ЛБ_ОбменLX.ПаспортНедействителен(Парам) Тогда 
				Сообщить("Документ найден в списке недействительных паспортов!");
				Результат = ложь; 
			ИначеЕсли НЕ ЛБ_ОбщийМодуль.ПроверитьПаспортРФДействует(НовыйДокумент.ДатаРождения, НовыйДокумент.ДокументДатаВыдачи) Тогда
				Сообщить("Документ удостоверяющий личность залогодателя просрочен!");
			    Результат = ложь;	
			КонецЕсли;	
		ИначеЕсли НЕ ЛБ_ОбщийМодуль.ПроверитьПаспортРФДействует(НовыйДокумент.ДатаРождения, НовыйДокумент.ДокументДатаВыдачи) Тогда
			Сообщить("Документ удостоверяющий личность залогодателя просрочен!");
		    Результат = ложь;   
		КонецЕсли;	
	ИначеЕсли (НовыйДокумент.ДокументВид = Справочники.ВидыДокументовФизическихЛиц.СвидетельствоОРождении) И НЕ ЛБ_ОбщийМодуль.ПроверитьСвидетельствоОРожденииДействует(НовыйДокумент.ДатаРождения, ДатаДок) Тогда
		Сообщить("Документ удостоверяющий личность залогодателя просрочен!");
	    Результат = ложь;
	КонецЕсли;	
	Если ЛБ_ОбщийМодуль.ДокументСоСрокомДействия(Гражданство, НовыйДокумент.ДокументВидДокументаЗалогодателя, НовыйДокумент.ДокументВид) тогда
		Если НЕ ЗначениеЗаполнено(НовыйДокумент.ДокументСрокДействия) Тогда
			Сообщить("Для документ удостоверяющего личность залогодателя необходимо заполнить срок действия!");
	        Результат = ложь;
		ИначеЕсли НовыйДокумент.ДокументСрокДействия <	НачалоДня(ДатаДок) Тогда
			Сообщить("Документ удостоверяющий личность залогодателя просрочен!");
	        Результат = ложь;
		КонецЕсли;	
	КонецЕсли;	 
	Если НЕ НовыйДокумент.Гражданство = Справочники.СтраныМира.Россия Тогда
		Отбор = Новый Структура; 
		Отбор.Вставить("Клиент", НовыйДокумент.Залогодатель);
		Строки = НовыйДокумент.ДополнительныеДокументыПравоПребыванияРФ.НайтиСтроки(Отбор);
		Если Строки.Количество() = 0 Тогда 
			Сообщить("Не выбран документ удостоверяющий право пребывания клиента на территории РФ!");
	        Результат = ложь;
		Иначе                  
			ЕстьДокументГражданствоНЕРФ = ложь;
			Для каждого Стр Из Строки Цикл
				//Если ЛБ_ОбщийМодуль.ДокументСоСрокомДействия(Гражданство, Стр.ДокументЗалогодателя, Стр.ВидДокумента) тогда 
				//	Если НЕ ЗначениеЗаполнено(НовыйДокумент.ДокументСрокДействия) Тогда
				//		Продолжить;
				//	ИначеЕсли НовыйДокумент.ДокументСрокДействия <	НачалоДня(ДатаДок) Тогда
				//		Продолжить;
				//	КонецЕсли;	
				//    ГражданствоНЕРФ = Истина;
				//	Прервать;  
				//Иначе
				//	ГражданствоНЕРФ = Истина;
				//	Прервать; 
				//КонецЕсли;
				Если Стр.ДокументГражданство = Гражданство Тогда
					ЕстьДокументГражданствоНЕРФ = Истина;   
					Если Стр.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ВидНаЖительство Тогда 
					    Если НЕ ЛБ_ОбщийМодуль.ДокументСоСрокомДействия(Стр.ДокументГражданство, Стр.ВидДокументаЗалогодателя, Стр.ВидДокумента) тогда
					         ТекстСообщения1 = ЛБ_ОбщийМодуль.ПроверитьСменаВидНаЖительствоВозраст(ДатаРождения, Стр.ДокументДатаВыдачи); 
							 Если НЕ Пустаястрока(ТекстСообщения1) тогда 
								 Сообщить(ТекстСообщения1); 
								 //Результат = ложь;
							 КонецЕсли;	  
						 КонецЕсли;
						 ТекстСообщения2 = ЛБ_ОбщийМодуль.ПроверитьСменаВидНаЖительствоКонтактнаяИнформация(Получатель, Стр.ДокументДатаВыдачи, ДатаДок); 
						 Если НЕ Пустаястрока(ТекстСообщения2) тогда 
							 Сообщить(ТекстСообщения2); 
							 //Результат = ложь;
						 КонецЕсли;	 
					КонецЕсли;	 	
				КонецЕсли;	
			КонецЦикла;	
			Если НЕ ЕстьДокументГражданствоНЕРФ Тогда
				Сообщить("У клиента нет действующего документа, удостоверяющего право пребывания на территории РФ!");
				Результат = ложь;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция СоздатьДокументНаСервере()  
	Если ЗначениеЗаполнено(ДокументВыдачиЗалога) Тогда
		ДокументОбъект = ДокументВыдачиЗалога.ПолучитьОбъект();
	Иначе	
	    ДокументОбъект = Документы.ЛБ_ОперацияПоЗалогу.СоздатьДокумент(); 
		ДокументОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога;  
	    ДокументОбъект.ПредыдущаяОперация = ЗалоговыйБилет;	    
	    ДокументОбъект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить(); 
	    ДокументОбъект.Товары.Загрузить(ДокументОбъект.ПредыдущаяОперация.Товары.Выгрузить());
		ДокументОбъект.Вставки.Загрузить(ДокументОбъект.ПредыдущаяОперация.Вставки.Выгрузить());
		ДокументОбъект.ДополнительныеМеталлы.Загрузить(ДокументОбъект.ПредыдущаяОперация.ДополнительныеМеталлы.Выгрузить());
		ДокументОбъект.Дефекты.Загрузить(ДокументОбъект.ПредыдущаяОперация.Дефекты.Выгрузить()); 
		Если ДокументОбъект.ПредыдущаяОперация.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда
			СтрокиТоварыУдалить = Новый СписокЗначений;
			СтрокиДефектыУдалить = Новый СписокЗначений;
			СтрокиВставкиУдалить = Новый СписокЗначений;
			СтрокиДополнительныеМеталлыУдалить = Новый СписокЗначений;
			Для каждого СтрТ Из ДокументОбъект.Товары Цикл  
				Если НЕ СтрТ.Переоформить Тогда
					СтрокиТоварыУдалить.Добавить(СтрТ);
					ОтборТ = Новый Структура;
					ОтборТ.Вставить("КлючСтроки", СтрТ.КлючСтроки); 
					
					СтрокиД = ДокументОбъект.Дефекты.НайтиСтроки(ОтборТ);
					Для каждого СтрД Из СтрокиД Цикл 
						СтрокиДефектыУдалить.Добавить(СтрД);
					КонецЦикла;	 
					
					СтрокиВ = ДокументОбъект.Вставки.НайтиСтроки(ОтборТ);
					Для каждого СтрВ Из СтрокиВ Цикл 
						СтрокиВставкиУдалить.Добавить(СтрВ);
					КонецЦикла;	
					
					СтрокиДМ = ДокументОбъект.ДополнительныеМеталлы.НайтиСтроки(ОтборТ);
					Для каждого СтрДМ Из СтрокиДМ Цикл 
						СтрокиДополнительныеМеталлыУдалить.Добавить(СтрДМ);
					КонецЦикла;	
				КонецЕсли;	
			КонецЦикла;	        
			Для каждого Эл Из СтрокиТоварыУдалить Цикл 
				ДокументОбъект.Товары.Удалить(Эл.Значение);
			КонецЦикла;	
			Для каждого Эл Из СтрокиДефектыУдалить Цикл 
				ДокументОбъект.Дефекты.Удалить(Эл.Значение);
			КонецЦикла;	 
            Для каждого Эл Из СтрокиВставкиУдалить Цикл 
				ДокументОбъект.Вставки.Удалить(Эл.Значение);
			КонецЦикла;	 
            Для каждого Эл Из СтрокиДополнительныеМеталлыУдалить Цикл 
				ДокументОбъект.ДополнительныеМеталлы.Удалить(Эл.Значение);
			КонецЦикла;	 			 
		КонецЕсли;	
		ДокументОбъект.ПредыдущаяОперация = ЗалоговыйБилет; 
		ДокументОбъект.СтатусЗалогодателя = ЛБ_УправлениеЛомбардом.ПолучитьТекущийСтатусКлиента(ДокументОбъект.Дата, ДокументОбъект.ПредыдущаяОперация.Залогодатель);
	КонецЕсли;	
	ДокументОбъект.Дата = ДатаДок;	
	ДокументОбъект.Ломбард = Ломбард;
	ДокументОбъект.ОтветственныйСотрудник = ОтветственныйСотрудник; 
	ДокументОбъект.ОтветственныйПользователь = ОтветственныйПользователь;

	ДокументОбъект.Комментарий = Комментарий;
	ДокументОбъект.Залогодатель = Получатель;  
	ДокументОбъект.ДокументЗалогодателя = ДокументПолучателя;
	ДокументОбъект.ДоверенностьПредставителя = ДоверенностьПолучателя;
	ДокументОбъект.СхемаКредитования = ЗалоговыйБилет.СхемаКредитования;  
	ДокументОбъект.СрокЗалога = ЗалоговыйБилет.СрокЗалога; 
	ДокументОбъект.Акция = ЗалоговыйБилет.Акция;
	ДокументОбъект.НомерЗалоговогоБилета = ЗалоговыйБилет.НомерЗалоговогоБилета;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("Залогодатель", ДокументОбъект.Залогодатель);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРождения КАК МестоРождения,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Email КАК Email,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПрописке КАК АдресПоПрописке,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Пол КАК Пол,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК Телефон,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество
	               |ИЗ
	               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументОбъект.Фамилия = Выборка.Фамилия;
	    ДокументОбъект.Имя = Выборка.Имя;
	    ДокументОбъект.Отчество = Выборка.Отчество;		
		ДокументОбъект.ДатаРождения = Выборка.ДатаРождения;		
		ДокументОбъект.Гражданство = Выборка.Гражданство;
		ДокументОбъект.Пол = Выборка.Пол;  
		ДокументОбъект.ВозрастЗалогодателя = ЛБ_ОбщийМодуль.ВычислитьВозраст(ДокументОбъект.ДатаРождения);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДокументЗалогодателя", ДокументОбъект.ДокументЗалогодателя);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНачалоДействия КАК ДокументНачалоДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&Дата, ДокументЗалогодателя = &ДокументЗалогодателя) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументОбъект.ДокументВидДокументаЗалогодателя = Выборка.ВидДокументаЗалогодателя;
		ДокументОбъект.ДокументВид = Выборка.ВидДокумента;
		ДокументОбъект.ДокументГражданство = Выборка.Гражданство;
		ДокументОбъект.ДокументСерия = Выборка.ДокументСерия;
		ДокументОбъект.ДокументНомер = Выборка.ДокументНомер;
		ДокументОбъект.ДокументДатаВыдачи = Выборка.ДокументДатаВыдачи;
		ДокументОбъект.ДокументКемВыдан = Выборка.ДокументКемВыдан;
		ДокументОбъект.ДокументКодПодразделения = Выборка.ДокументКодПодразделения;
		ДокументОбъект.ДокументНачалоДействия = Выборка.ДокументНачалоДействия;
		ДокументОбъект.ДокументСрокДействия = Выборка.ДокументСрокДействия;
	КонецЕсли;
	
	ДокументОбъект.ДополнительныеДокументыПравоПребыванияРФ.Загрузить(ДопДокументы.Выгрузить());  
	
	ДокументОбъект.ТоварыВыкупленные.Очистить();
	Для каждого стр из ТаблицаТоваров Цикл 
		Если НЕ стр.ВернутьЗалог Тогда
			Продолжить;
		КонецЕсли;	
		НоваяСтр = ДокументОбъект.ТоварыВыкупленные.Добавить();
		НоваяСтр.ОбъектЗалога = Стр.ОбъектЗалога;  
		НоваяСтр.СуммаОценки = Стр.СуммаОценки;
	Конеццикла;	
		    	 	
	Если ПроверкаЗаполненияДокумента(ДокументОбъект) Тогда	
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		Попытка           
		    ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение); 
			ДокументВыдачиЗалога = ДокументОбъект.Ссылка;
			Возврат ложь;
		Исключение   
			ОбщегоНазначения.СообщитьПользователю("Не удалось провести документ " + строка(ДокументОбъект.Ссылка));
			Возврат Истина;
		КонецПопытки;  
	Иначе  
		Возврат Истина;
	КонецЕсли;	
КонецФункции	
	
&НаСервере
Процедура ЗаполнитьСписокВыбораДоверенностейПолучателя() 
	Элементы.Доверенность.СписокВыбора.Очистить();
	Если Получатель = ЗалоговыйБилет.Залогодатель Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.УстановитьПараметр("Клиент", ЗалоговыйБилет.Залогодатель);
	Запрос.УстановитьПараметр("Представитель", Получатель);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДоверенностиСрезПоследних.Доверенность КАК Доверенность
	               |ИЗ
	               |	РегистрСведений.ЛБ_Доверенности.СрезПоследних(
	               |			&Дата,
	               |			ЗалоговыйБилет = &ЗалоговыйБилет
	               |				И Клиент = &Клиент
	               |				И Доверенность.ПредставительКлиента = &Представитель
	               |				И СтатусДоверенности = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыДоверенностей.ДоверенностьОформлена)) КАК ЛБ_ДоверенностиСрезПоследних";  
	Выборка = Запрос.Выполнить().Выбрать(); 	
	Пока Выборка.Следующий() Цикл  
		Если Выборка.Доверенность.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Наследство Тогда   
			ОписаниеДоверенности = "Свидетельство о праве на наследство № " + СокрЛП(Выборка.Доверенность.НомерДоверенности) + " от " + Формат(Выборка.Доверенность.ДатаДоверенности, "ДФ=dd.MM.yyyy");
		Иначе	
			Если Выборка.Доверенность.СрокДействияДоверенности  < НачалоДня(ДатаДок) Тогда
				Продолжить;
			КонецЕсли;	      
			ОписаниеДоверенности = "Доверенность " + НРег(строка(Выборка.Доверенность.ВидДоверенности)) + " № " +
					   ?(НЕ ПустаяСтрока(Выборка.Доверенность.НомерДоверенности), СокрЛП(Выборка.Доверенность.НомерДоверенности), "б/н") + " от " + Формат(Выборка.Доверенность.ДатаДоверенности, "ДФ=dd.MM.yyyy") +
					   " действует до " + Формат(Выборка.Доверенность.СрокДействияДоверенности, "ДФ=dd.MM.yyyy");   
		КонецЕсли;			   
		Элементы.Доверенность.СписокВыбора.Добавить(Выборка.Доверенность, ОписаниеДоверенности);
	Конеццикла;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекстДоверенности() 
	Если ЗначениеЗаполнено(ДоверенностьПолучателя) Тогда
	   Если ДоверенностьПолучателя.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Наследство Тогда   
			Доверенность = "Свидетельство о праве на наследство № " + СокрЛП(ДоверенностьПолучателя.НомерДоверенности) + " от " + Формат(ДоверенностьПолучателя.ДатаДоверенности, "ДФ=dd.MM.yyyy"); 
		Иначе	
		    Доверенность = "Доверенность " + НРег(строка(ДоверенностьПолучателя.ВидДоверенности)) + " № " +                                                                                               		
				   ?(НЕ ПустаяСтрока(ДоверенностьПолучателя.НомерДоверенности), СокрЛП(ДоверенностьПолучателя.НомерДоверенности), "б/н") + " от " + Формат(ДоверенностьПолучателя.ДатаДоверенности, "ДФ=dd.MM.yyyy") +
				   " действует до " + Формат(ДоверенностьПолучателя.СрокДействияДоверенности, "ДФ=dd.MM.yyyy"); 
		КонецЕсли;		 
	Иначе  
		Доверенность = "";	   
	КонецЕсли;		   
КонецПроцедуры

&НаСервере
Функция ПроверитьПолучательЭтоЗаемщик() 
	Возврат ?(Получатель = ЗалоговыйБилет.Залогодатель, Истина, Ложь);
КонецФункции	

&НаКлиенте
Процедура ПослеВыбораПолучателя(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли; 
	
	СписокСС = ПолучитьСлужебныеСтатусыКлиента(Результат.Залогодатель);  
	Если НЕ СписокСС.Количество() = 0 Тогда 
		ПредупреждениеП = "";
		Для каждого Элемент из СписокСС Цикл 
			СтруктураВозврата = ПроверитьСлужебныйСтатус(Элемент.Значение);
			Если СтруктураВозврата.Запрет Тогда    
				ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога");
				//+МАН 03.04.26 Изменено сообщение. Заявка 3759
				//Предупреждение("Для клиента " + СокрЛП(Результат.Залогодатель) + " определен запрет на операцию " + Строка(ВидОперации), 60, "Проверка служебных статусов клиента");
				Предупреждение("Клиенту " + СокрЛП(Результат.Залогодатель) + " присвоен служебный статус """ + Строка(Элемент.Значение) + """, в связи с чем запрещена операция: """ + Строка(ВидОперации) + """", 60, "Проверка служебных статусов клиента");
				//-МАН
				Возврат;  
			Иначе
				ПредупреждениеП = СтруктураВозврата.Предупредить;
			КонецЕсли;	
		КонецЦикла;   
		Если НЕ ПустаяСтрока(ПредупреждениеП) Тогда
			Ответ = Вопрос(ПредупреждениеП + " Продолжить?", РежимДиалогаВопрос.ОКОтмена, , "Проверка служебных статусов клиента"); 
			Если Ответ = КодВозвратаДиалога.Отмена Тогда  
			    Возврат;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;  

	Если Результат.Свойство("Залогодатель") Тогда 
		Получатель = Результат.Залогодатель;
		ЗаполнитьКонтакнуюИнформацию();
	конецЕсли;	
	
	Если Результат.Свойство("ДокументЗалогодателя") Тогда
		ДокументПолучателя = Результат.ДокументЗалогодателя; 
		ЗаполнитьИнформациюОДокументе();
	КонецЕсли;	
	ЗаполнитьДопДокументы();  
		
	Если НЕ ПроверитьПолучательЭтоЗаемщик() Тогда
		Элементы.ГруппаДоверенность.Видимость = Истина;
		ЗаполнитьСписокВыбораДоверенностейПолучателя();
		Если Элементы.Доверенность.СписокВыбора.Количество() = 1 Тогда 
			ДоверенностьПолучателя = Элементы.Доверенность.СписокВыбора.Получить(0).Значение;
			ЗаполнитьТекстДоверенности();
		КонецЕсли;
	иначе
		Элементы.ГруппаДоверенность.Видимость = ложь; 
		ДоверенностьПолучателя = ПредопределенноеЗначение("Документ.ЛБ_Доверенности.ПустаяСсылка");
	КонецЕсли;    
    УстановитьВидимость();
КонецПроцедуры


&НаКлиенте
Процедура ФИОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура;
	Если ЗначениеЗаполнено(Получатель) Тогда
		ПараметрыФормы.Вставить("Залогодатель", Получатель);
	КонецЕсли;	  
	ПараметрыФормы.Вставить("Дата", ДатаДок); 
	Если НЕ ЗначениеЗаполнено(ДокументВыдачиЗалога) И НачалоДня(ДатаДок) = НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса()) Тогда
		ПараметрыФормы.Вставить("НаТекущуюДату", Истина);
	КонецЕсли;	
	ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога"));	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораПолучателя",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателя", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


&НаКлиенте
Процедура ПаспортНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура;
	Если ЗначениеЗаполнено(Получатель) Тогда
		ПараметрыФормы.Вставить("Залогодатель", Получатель);
	КонецЕсли;	
	ПараметрыФормы.Вставить("Дата", ДатаДок);	
	Если НЕ ЗначениеЗаполнено(ДокументВыдачиЗалога) И НачалоДня(ДатаДок) = НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса()) Тогда
		ПараметрыФормы.Вставить("НаТекущуюДату", Истина);
	КонецЕсли;	
	ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога"));
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораПолучателя",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателя", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


&НаКлиенте
Процедура ДоверенностьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВыбЭлемент = ЭтаФорма.ВыбратьИзСписка(Элемент.СписокВыбора, Элемент, 0);
	Если НЕ ВыбЭлемент = Неопределено Тогда 
		ДоверенностьПолучателя = ВыбЭлемент.Значение;    
		ЗаполнитьТекстДоверенности();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДокументПравоПребывания(Команда)
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораДокументаПравоПребывания",ЭтаФорма);
    ЗначениеОтбора = Новый Структура;
    ЗначениеОтбора.Вставить("Залогодатель", Получатель);
    ЗначениеОтбора.Вставить("ВидДокументаЗалогодателя", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийПравоПребыванияРФ"));
    ЗначениеОтбора.Вставить("Дата", ДатаДок);

    ОткрытьФорму("ОбщаяФорма.ЛБ_ПодборДокументовКлиента", ЗначениеОтбора, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры  

&НаСервере
Процедура ПослеВыбораДокументаПравоПребывания(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	НоваяСтр = ДопДокументы.Добавить();
	НоваяСтр.ДокументЗалогодателя = Результат.ДокументЗалогодателя;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("ДокументЗалогодателя", НоваяСтр.ДокументЗалогодателя);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя.Владелец КАК Клиент,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНачалоДействия КАК ДокументНачалоДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&Дата, ДокументЗалогодателя = &ДокументЗалогодателя) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		НоваяСтр.Клиент = Получатель;
		НоваяСтр.ВидДокументаЗалогодателя = Выборка.ВидДокументаЗалогодателя;
		НоваяСтр.ВидДокумента = Выборка.ВидДокумента;
		НоваяСтр.ДокументГражданство = Выборка.Гражданство;
		НоваяСтр.ДокументСерия = Выборка.ДокументСерия;
		НоваяСтр.ДокументНомер = Выборка.ДокументНомер;
		НоваяСтр.ДокументДатаВыдачи = Выборка.ДокументДатаВыдачи;
		НоваяСтр.ДокументКемВыдан = Выборка.ДокументКемВыдан;
		НоваяСтр.ДокументКодПодразделения = Выборка.ДокументКодПодразделения;
		НоваяСтр.ДокументНачалоДействия = Выборка.ДокументНачалоДействия;
		НоваяСтр.ДокументСрокДействия = Выборка.ДокументСрокДействия;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция СнятьСПроведения(Документ)  
	ДокОбъект = Документ.ПолучитьОбъект(); 
	Если ДокОбъект.Проведен Тогда                                
		Попытка
		    ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);  
			Возврат Истина;
		Исключение   
			Сообщить("Не удалось снять с проведения документ выдачи залога по залоговому билету № " + СокрЛП(Документ.НомерЗалоговогоБилета) + ". Редактирование запрещено.");
			Возврат Ложь;
		КонецПопытки;	
	Иначе
		возврат Истина;
	КонецЕсли;
КонецФункции	

&НаКлиенте
Процедура Редактировать(Команда)
	ПроверкаМожноРедактировать = Истина;
	Если ЭтаФорма.НеРедактировать Тогда 
		Результат = СнятьСПроведения(ДокументВыдачиЗалога);
		Если НЕ Результат тогда  
			ПроверкаМожноРедактировать = Ложь;
		КонецЕсли;	
		Если ПроверкаМожноРедактировать Тогда  
			НеРедактировать = Ложь;
			Элементы.ОсновнаяПанель.ТолькоПросмотр = Ложь;
			Этаформа.Открыть();
		КонецЕсли;	
	КонецЕсли;	
	//+Мельников 25.04.24 Отмена операции
	УстановитьВидимость();
	//-Мельников
КонецПроцедуры

&НаСервере
Функция ПолучитьСлужебныеСтатусыКлиента(Клиент)
	Возврат ЛБ_ОбщийМодуль.ПолучитьСлужебныеСтатусыКлиента(ДатаДок, Клиент);
КонецФункции	

&НаСервере
Функция ПроверитьСлужебныйСтатус(Статус)  
	Возврат ЛБ_ОбщийМодуль.ПроверитьСлужебныйСтатус(Статус, Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога);
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СписокСС = ПолучитьСлужебныеСтатусыКлиента(ЭтаФорма.Получатель);
	Если НЕ СписокСС.Количество() = 0 Тогда 
		ПредупреждениеП = "";
		Для каждого Элемент из СписокСС Цикл 
			СтруктураВозврата = ПроверитьСлужебныйСтатус(Элемент.Значение);
			Если СтруктураВозврата.Запрет Тогда 
				ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога");
				//+МАН 03.04.26 Изменено сообщение. Заявка 3759
				//Предупреждение("Для клиента " + СокрЛП(Получатель) + " определен запрет на операцию " + Строка(ВидОперации), 60, "Проверка служебных статусов клиента");
				Предупреждение("Клиенту " + СокрЛП(Получатель) + " присвоен служебный статус """ + Строка(Элемент.Значение) + """, в связи с чем запрещена операция: """ + Строка(ВидОперации) + """", 60, "Проверка служебных статусов клиента");
				//-МАН
				Отказ = Истина;
				Возврат;  
			Иначе
				ПредупреждениеП = СтруктураВозврата.Предупредить;
			КонецЕсли;	
		КонецЦикла;   
		Если НЕ ПустаяСтрока(ПредупреждениеП) Тогда
			Ответ = Вопрос(ПредупреждениеП + " Продолжить?", РежимДиалогаВопрос.ОКОтмена); 
			Если Ответ = КодВозвратаДиалога.Отмена Тогда  
				Отказ = Истина;
			    Возврат;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;   

	Если НеРедактировать Тогда  
		Элементы.Редактировать.Видимость = ?(ЭтаФорма.ТолькоПросмотр, ложь, Истина);  
		Элементы.ВернутьЗалог.Доступность = ложь;
		Элементы.Отмена.Заголовок = "Закрыть";
	КонецЕсли;
	Элементы.ОсновнаяПанель.ТолькоПросмотр = НеРедактировать;
	ПриСменеСтраницы(Элементы.ОсновнаяПанель.ТекущаяСтраница);
	
	Если НЕ ДопДокументы.Количество() = 0 Тогда
		Элементы.ГруппаДопДокумент.Показать(); 
	КонецЕсли;	
    Если ЗначениеЗаполнено(Получатель) И НЕ ЗначениеЗаполнено(ДокументВыдачиЗалога) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Залогодатель", Получатель);	
			
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеПроверкиАктуальности",ЭтаФорма);
		ОткрытьФорму("ОбщаяФорма.ЛБ_ПроверкаАктуальностиДанныхКлиента", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
	КонецЕсли;
КонецПроцедуры  

&НаКлиенте
Процедура ПослеПроверкиАктуальности(Результат, ДопПараметры) Экспорт
	Если Результат = Ложь тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Залогодатель", Получатель);
		ПараметрыФормы.Вставить("Дата", ДатаДок);	 
		
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеИзмененияКарточки",ЭтаФорма);
		ОткрытьФорму("ОбщаяФорма.ЛБ_КарточкаЗалогодателя", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры	
&НаКлиенте
Процедура ПриПовторномОткрытии()
	ЭтаФорма.ТолькоПросмотр = НеРедактировать;  
	Элементы.ДекорацияСтатусДокумента.Заголовок = "Проект"; 
	Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноЗеленый;
	Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.СветлоЗеленый;
	Элементы.Редактировать.Видимость = Ложь;  
	Элементы.ВернутьЗалог.Доступность = Истина;
	Элементы.Отмена.Заголовок = "Отмена"; 
	ЗаполнитьТовары();
КонецПроцедуры 

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ЭтаФорма.Закрыть(?(ЗначениеЗаполнено(ДокументВыдачиЗалога), ДокументВыдачиЗалога, неопределено));
КонецПроцедуры


&НаСервере
Функция ПроверитьЕстьВНакладной()
    Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", ДатаДок);   
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
	Запрос.УстановитьПараметр("СтатусЗалоговогоБилета", Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Отгружен);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилета.Период КАК Дата,
	               |	ЛБ_СостояниеЗалоговогоБилета.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета КАК ЛБ_СостояниеЗалоговогоБилета
	               |ГДЕ
	               |	ЛБ_СостояниеЗалоговогоБилета.Период <= &Дата
	               |	И ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет = &ЗалоговыйБилет
	               |	И ЛБ_СостояниеЗалоговогоБилета.СтатусЗалоговогоБилета = &СтатусЗалоговогоБилета
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_СостояниеЗалоговогоБилета.Период УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		Возврат Выборка.СтатусЗалоговогоБилета;
	КонецЕсли;	                            
	Возврат неопределено;
КонецФункции  

&НаКлиенте
Процедура ВернутьЗалог(Команда)
	Если НеРедактировать Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый структура;
	Отбор.Вставить("КлючСтроки", 2);
	СтрокиС = ТаблицаСостояний.НайтиСтроки(Отбор);
	Если НЕ СтрокиС.Количество() = 0 Тогда    
		СтатусЗБ = СтрокиС.Получить(0).Статус;
		Если НЕ СтатусЗБ = Строка(ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыЗалоговыхБилетов.ОтвественноеХранение")) И
			 НЕ СтатусЗБ = Строка(ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыЗалоговыхБилетов.Наследство")) Тогда 
			Сообщить("Статус выбранного залогового билета на " + Формат(ЭтаФорма.ДатаДок, "ДЛФ=DT") + ?(СтатусЗБ = неопределено, " не определен", " """ + строка(СтатусЗБ)) + """. Выдача залога не возможна!");
			Возврат;
		КонецЕсли;	
	Иначе
		Сообщить("Статус выбранного залогового билета на " + Формат(ЭтаФорма.ДатаДок, "ДЛФ=DT") + " не определен. Выдача залога не возможна!");
		Возврат;
	КонецЕсли;	
	
	Если ПроверитьЕстьВНакладной() = неопределено Тогда
		ЕстьВНакладной = Ложь;
	Иначе	         
		ЕстьВНакладной = Истина;
	КонецЕсли;

	БилетИзъят = Ложь;
	ЕстьВернутьЗалог = ложь;
	Для каждого Стр из ТаблицаТоваров Цикл  
		Если Стр.ВернутьЗалог Тогда
			ЕстьВернутьЗалог = Истина;
		КонецЕсли;	
		Если Стр.СтатусОбъектаЗалога = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыОбъектовЗалога.Изъят") ИЛИ	Стр.СтатусОбъектаЗалога = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыОбъектовЗалога.Возвращен") Тогда  
			БилетИзъят = Истина
		КонецЕсли;	
	Конеццикла;	     
	Если НЕ ЕстьВернутьЗалог Тогда
		Сообщить("Не выбраны возвращаемые объекты залога!");
		Возврат;
	КонецЕсли;
	
	Отбор = новый Структура;
	Отбор.Вставить("КлючСтроки", 3); 
	Строки = ТаблицаСостояний.НайтиСтроки(Отбор); 
	Если НЕ Строки.Количество() = 0 Тогда
		ЗаймДолг = Строки.Получить(0).СуммаЗайма;
		Если НЕ ЗаймДолг = 0 Тогда  
			Сообщить("Долг по оплате суммы займа " + СокрЛП(Формат(ЗаймДолг, "ЧЦ=15; ЧДЦ=2")) + ". Выдача объектов залога запрещена.");
			Возврат;
		КонецЕсли;
	КонецЕсли;	

	Если ПроверкаКлиента() Тогда  
		Если НЕ ЗначениеЗаполнено(ДокументВыдачиЗалога) И НачалоДня(ДатаДок) = НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса()) Тогда
		    ДатаДок = ОбщегоНазначенияКлиент.ДатаСеанса();
		КонецЕсли;	   
		
		Если НЕ БилетИзъят И НЕ ЕстьВНакладной Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ЗалоговыйБилет", ЗалоговыйБилет); 
			ПараметрыФормы.Вставить("Ломбард", Ломбард);
			ПараметрыФормы.Вставить("Получатель", Получатель);
			ПараметрыФормы.Вставить("ДоверенностьПолучателя", ДоверенностьПолучателя); 
			ПараметрыФормы.Вставить("ДатаДок", ДатаДок);  
			ПараметрыФормы.Вставить("ФИОПолучателя", ФИО); 
			ПараметрыФормы.Вставить("Доверенность", Доверенность);  
							
			ОписаниеОповещения = новый ОписаниеОповещения("ПослеВыбораПереоформить", ЭтотОбъект);
			ОткрытьФорму("ОбщаяФорма.ЛБ_ВыдатьЗалогПереоформить", ПараметрыФормы, ЭтаФорма, Истина,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе  
			ЕстьНеПроведенные  = СоздатьДокументНаСервере();
			Если НЕ ЕстьНеПроведенные Тогда
				НеРедактировать = Истина;
				Элементы.ДекорацияСтатусДокумента.Заголовок = "Факт"; 
				Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноБордовый;  
				Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.ТусклоРозовый;
		        Элементы.Редактировать.Видимость = Истина; 
				Элементы.ВернутьЗалог.Доступность = Ложь;
			    Элементы.Отмена.Заголовок = "Закрыть"; 
				Элементы.ОсновнаяПанель.ТолькоПросмотр = НеРедактировать;
				ЗаполнитьТовары();
				Если ВладелецФормы.ИмяФормы = "ОбщаяФорма.ЛБ_РабочееМестоПриемщикаЛомбарда" Тогда
		   	        ФормаРМП = ВладелецФормы;   
					Если ФормаРМП.Залогодатель = ПолучитьЗалогодателя() Тогда
		                ФормаРМП.ПослеВыбораТекущееСостояниеЗБ(Истина, неопределено); 
					КонецЕсли;	
	            КонецЕсли;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры      

&НаСервере
Функция ПолучитьОсновнойДокументПереоформление(Клиент) 
	Если Клиент = Получатель Тогда
		Возврат ДокументПолучателя;
	КонецЕсли;
	
	Гражданство = Справочники.СтраныМира.Россия;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса()); 
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство
	               |ИЗ
	               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Клиент) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Гражданство = Выборка.Гражданство;
	КонецЕсли;	
	Возврат ЛБ_УправлениеЛомбардом.ПроверитьОсновнойДокумент(ДатаДок, Клиент, Гражданство);
КонецФункции

&НаКлиенте
Процедура ПослеВыбораПереоформить(Результат, ДопПараметры) Экспорт
    Если НЕ ТипЗнч(Результат) = Тип("Структура") Тогда
        Возврат;
	КонецЕсли; 
	
	Если Результат.Операция = 1 Тогда 
		ЕстьНеПроведенные  = СоздатьДокументНаСервере();
		Если НЕ ЕстьНеПроведенные Тогда
			НеРедактировать = Истина;
			Элементы.ДекорацияСтатусДокумента.Заголовок = "Факт"; 
			Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноБордовый;  
			Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.ТусклоРозовый;
	        Элементы.Редактировать.Видимость = Истина; 
			Элементы.ВернутьЗалог.Доступность = Ложь;
		    Элементы.Отмена.Заголовок = "Закрыть"; 
			Элементы.ОсновнаяПанель.ТолькоПросмотр = НеРедактировать;
			ЗаполнитьТовары();    
			Если ВладелецФормы.ИмяФормы = "ОбщаяФорма.ЛБ_РабочееМестоПриемщикаЛомбарда" Тогда
	   	        ФормаРМП = ВладелецФормы;   
				Если ФормаРМП.Залогодатель = ПолучитьЗалогодателя() Тогда
	                ФормаРМП.ПослеВыбораТекущееСостояниеЗБ(Истина, неопределено); 
				КонецЕсли;	
            КонецЕсли;
		КонецЕсли;	
	ИначеЕсли Результат.Операция = 2 Тогда 
		ПараметрыФормы = Новый Структура;      
		ПараметрыФормы.Вставить("Дата", ДатаДок); 
		ПараметрыФормы.Вставить("ПредыдущаяОперация", ЗалоговыйБилет);  
		Если Результат.СпособПереоформления = 0 Тогда  //на заемщика  
			Залогодатель = ПолучитьЗалогодателя();
			ПараметрыФормы.Вставить("Залогодатель", Залогодатель);
			ПараметрыФормы.Вставить("ДокументЗалогодателя", ПолучитьОсновнойДокументПереоформление(Залогодатель)); 
			Если НЕ Получатель = Залогодатель Тогда  
				ПараметрыФормы.Вставить("Представитель", Получатель);
				ПараметрыФормы.Вставить("ДокументПредставителя", ДокументПолучателя); 
				ПараметрыФормы.Вставить("ДоверенностьПредставителя", ДоверенностьПолучателя); 
			КонецЕсли;	  
		Иначе //на доверенное лицо
			ПараметрыФормы.Вставить("Залогодатель", Получатель);
			ПараметрыФормы.Вставить("ДокументЗалогодателя", ДокументПолучателя);
			ПараметрыФормы.Вставить("ДоверенностьПредставителя", ДоверенностьПолучателя); 
		КонецЕсли;
		ОписаниеОповещения = новый ОписаниеОповещения("ПослеСозданияПереоформления", ЭтотОбъект);  
		Если ВладелецФормы.ИмяФормы = "ОбщаяФорма.ЛБ_РабочееМестоПриемщикаЛомбарда" Тогда
		    ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаПереоформленияЗайма", ПараметрыФормы, ЭтаФорма.ВладелецФормы, Истина,,,ОписаниеОповещения); 
		Иначе
			ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаПереоформленияЗайма", ПараметрыФормы, ЭтаФорма, Истина,,,ОписаниеОповещения); 
        КонецЕсли;
	КонецЕсли;	
	//+Мельников 25.04.24 Отмена операции
	УстановитьВидимость();
	//-Мельников
КонецПроцедуры

&НаКлиенте
Процедура ПослеСозданияПереоформления(Результат, ДопПараметры) Экспорт
	Если Результат = неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.Открыта() Тогда
	    ЭтаФорма.Закрыть();  
	КонецЕсли;	
КонецПроцедуры	


&НаКлиенте
Процедура ИсторияЗБ(Команда)
	Если ЗначениеЗаполнено(ЗалоговыйБилет) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Клиент", ПолучитьЗалогодателя());
		ПараметрыФормы.Вставить("ЗалоговыйБилет", ЗалоговыйБилет);	 
								
		ОткрытьФорму("Отчет.ЛБ_ИсторияЗалоговогоБилета.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Вперед(Команда)
	Если Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаПолучатель тогда 
		Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаДополнительно; 
	КонецЕсли;	  
	ПриСменеСтраницы(Элементы.ОсновнаяПанель.ТекущаяСтраница);
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	Если Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаДополнительно тогда 
		Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаПолучатель; 
	конецЕсли;	  
	ПриСменеСтраницы(Элементы.ОсновнаяПанель.ТекущаяСтраница);
КонецПроцедуры

&НаКлиенте
Процедура ПриСменеСтраницы(ТекущаяСтраница)
    Если ТекущаяСтраница = Элементы.СтраницаПолучатель Тогда 
		Элементы.Вперед.Доступность = Истина; 
		Элементы.Назад.Доступность = Ложь;
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаДополнительно Тогда 
		Элементы.Вперед.Доступность = Ложь; 
		Элементы.Назад.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ОсновнаяПанельПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ПриСменеСтраницы(ТекущаяСтраница);
КонецПроцедуры

&НаСервере
Функция ПолучитьЗалогодателя()
	Возврат  ЗалоговыйБилет.Залогодатель;
КонецФункции

&НаКлиенте
Процедура СтатистикаПоКлиенту(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Клиент", ПолучитьЗалогодателя());
	ПараметрыФормы.Вставить("Дата", ДатаДок);	 
							
	ОткрытьФорму("Отчет.ЛБ_СтатистикаОбращенийКлиента.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура Расчеты(Команда)
	ПараметрыФормы = Новый Структура;  
	ПараметрыФормы.Вставить("Клиент", ПолучитьЗалогодателя());
	ПараметрыФормы.Вставить("ЗалоговыйБилет", ЭтаФорма.ЗалоговыйБилет);	
	ПараметрыФормы.Вставить("Дата", ЭтаФорма.ДатаДок);
							
	ОткрытьФорму("Отчет.ЛБ_НачисленныеПроцентыПоДоговоруЗайма.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЛомбардПриИзменении(Элемент)
	ЗаполнитьТовары();
КонецПроцедуры

//+Мельников 25.04.24 Отмена операции
&НаКлиенте
Процедура ОтменитьОперациюПеред(Команда)
	
	ПоследняяОперация = ПолучитьИнформациюОЗБ(ЗалоговыйБилет, ТекущаяДата());
	ЛомбардПользователя = ПолучитьЛомбардПольвателя();
	ЛомбардВДокументе = ПолучитьЛомбардВдокументе(ПоследняяОперация.ДокументОперации);

	Если ЛомбардПользователя <> ЛомбардВДокументе Тогда
		Предупреждение("Операция оформлена в другом ломбарде.
		|Действия с документом запрещены!");
		Возврат
	ИначеЕсли Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy") <> Формат(ПоследняяОперация.Дата, "ДФ=dd.MM.yyyy") Тогда
		Предупреждение("Отмена операции возможна только в текущем дне.");
		Возврат
	ИначеЕсли ТекущаяДата() - ДатаДок >= 3600 Тогда
		Предупреждение("Прошло больше часа от времени оформления текущей операции.");
		Возврат
	Иначе
		Ответ = Вопрос("Выполнить отмену текущей операции?", РежимДиалогаВопрос.ДаНет);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ДокументПроведен = ОтменаОплатыНаСервере();
			УстановитьВидимость();
		Иначе
			Возврат;
		КонецЕсли;
		
		Если ДокументПроведен Тогда
			Сообщить("Документ отмены создан");
			Если ВладелецФормы.ИмяФормы = "ОбщаяФорма.ЛБ_РабочееМестоПриемщикаЛомбарда" Тогда
	   	        ФормаРМП = ВладелецФормы;  
				Если ФормаРМП.Залогодатель = ПолучитьЗалогодателя() Тогда
	                ФормаРМП.ПослеВыбораТекущееСостояниеЗБ(Истина, неопределено); 
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИнформациюОЗБ(ЗалоговыйБилет, Дата)

	Результат = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(ЗалоговыйБилет.НомерЗалоговогоБилета, Дата,, Истина);
	
	//+Мельников 06.05.24 Сделано на время тестирования. Убрать при запуске ломбардов.
	Если Результат = Неопределено Тогда
		ДатаПроверки = ТекущаяДата() + 94608000; // + три года к дате проверки документа
		Результат = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(ЗалоговыйБилет.НомерЗалоговогоБилета, ДатаПроверки,, Истина);
	КонецЕсли;
	//-Мельников

	ПоследняяОперация = Новый Структура;
	ПоследняяОперация.Вставить("Дата", Результат.Регистратор.Дата);
	ПоследняяОперация.Вставить("ВидОперации", Результат.Регистратор.ВидОперации);
	ПоследняяОперация.Вставить("ДокументОперации", Результат.Регистратор);
	
	Возврат ПоследняяОперация;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЛомбардПольвателя()
	Возврат ЛБ_ОбщийМодуль.ПолучитьЛомбардПользователя(ПараметрыСеанса.ТекущийПользователь);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЛомбардВдокументе(Ссылка)
	Возврат Ссылка.Ломбард;
КонецФункции

&НаСервере
Функция ОтменаОплатыНаСервере()
	
	ДокументОбъект = Документы.ЛБ_ОперацияПоЗалогу.СоздатьДокумент();
	ДокументОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаВыдачиСОХ;
	ДокументОбъект.ПредыдущаяОперация = ЗалоговыйБилет;
	ДокументОбъект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить();
	ДокументОбъект.Товары.Загрузить(ДокументОбъект.Товары.Выгрузить());
	ДокументОбъект.Вставки.Загрузить(ДокументОбъект.Вставки.Выгрузить());
	ДокументОбъект.ДополнительныеМеталлы.Загрузить(ДокументОбъект.ДополнительныеМеталлы.Выгрузить());
	ДокументОбъект.Дефекты.Загрузить(ДокументОбъект.Дефекты.Выгрузить());
	ДокументОбъект.СтатусЗалогодателя = ЛБ_УправлениеЛомбардом.ПолучитьТекущийСтатусКлиента(ДокументОбъект.Дата, ДокументОбъект.ПредыдущаяОперация.Залогодатель);
	ДокументОбъект.Дата = ТекущаяДата();	
	ДокументОбъект.Ломбард = Ломбард;

	ДокументОбъект.ОтветственныйСотрудник = ОтветственныйСотрудник; 
	ДокументОбъект.ОтветственныйПользователь = ОтветственныйПользователь;
	
	ДокументОбъект.Комментарий = Комментарий;
	ДокументОбъект.Залогодатель = Получатель;  
	ДокументОбъект.ДокументЗалогодателя = ДокументПолучателя;
	ДокументОбъект.ДоверенностьПредставителя = ДоверенностьПолучателя;
	ДокументОбъект.СхемаКредитования = ЗалоговыйБилет.СхемаКредитования;  
	ДокументОбъект.СрокЗалога = ЗалоговыйБилет.СрокЗалога; 
	ДокументОбъект.Акция = ЗалоговыйБилет.Акция;
	ДокументОбъект.НомерЗалоговогоБилета = ЗалоговыйБилет.НомерЗалоговогоБилета;
	ДокументОбъект.ОтмененныйДокумент = ДокументВыдачиЗалога;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("Залогодатель", ДокументОбъект.Залогодатель);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРождения КАК МестоРождения,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Email КАК Email,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПрописке КАК АдресПоПрописке,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Пол КАК Пол,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК Телефон,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество
	               |ИЗ
	               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументОбъект.Фамилия = Выборка.Фамилия;
	    ДокументОбъект.Имя = Выборка.Имя;
	    ДокументОбъект.Отчество = Выборка.Отчество;		
		ДокументОбъект.ДатаРождения = Выборка.ДатаРождения;		
		ДокументОбъект.Гражданство = Выборка.Гражданство;
		ДокументОбъект.Пол = Выборка.Пол;  
		ДокументОбъект.ВозрастЗалогодателя = ЛБ_ОбщийМодуль.ВычислитьВозраст(ДокументОбъект.ДатаРождения);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДокументЗалогодателя", ДокументОбъект.ДокументЗалогодателя);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНачалоДействия КАК ДокументНачалоДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&Дата, ДокументЗалогодателя = &ДокументЗалогодателя) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументОбъект.ДокументВидДокументаЗалогодателя = Выборка.ВидДокументаЗалогодателя;
		ДокументОбъект.ДокументВид = Выборка.ВидДокумента;
		ДокументОбъект.ДокументГражданство = Выборка.Гражданство;
		ДокументОбъект.ДокументСерия = Выборка.ДокументСерия;
		ДокументОбъект.ДокументНомер = Выборка.ДокументНомер;
		ДокументОбъект.ДокументДатаВыдачи = Выборка.ДокументДатаВыдачи;
		ДокументОбъект.ДокументКемВыдан = Выборка.ДокументКемВыдан;
		ДокументОбъект.ДокументКодПодразделения = Выборка.ДокументКодПодразделения;
		ДокументОбъект.ДокументНачалоДействия = Выборка.ДокументНачалоДействия;
		ДокументОбъект.ДокументСрокДействия = Выборка.ДокументСрокДействия;
	КонецЕсли;
	
	ДокументОбъект.ДополнительныеДокументыПравоПребыванияРФ.Загрузить(ДопДокументы.Выгрузить());  
	
	ДокументОбъект.ТоварыВыкупленные.Очистить();
	Для каждого стр из ТаблицаТоваров Цикл 
		Если НЕ стр.ВернутьЗалог Тогда
			Продолжить;
		КонецЕсли;	
		НоваяСтр = ДокументОбъект.ТоварыВыкупленные.Добавить();
		НоваяСтр.ОбъектЗалога = Стр.ОбъектЗалога;  
		НоваяСтр.СуммаОценки = Стр.СуммаОценки;
	Конеццикла;	
		    	 	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	Попытка           
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		//+МАН 17.06.25 Убрал
		//ДокументОтмены = ДокументОбъект.Ссылка;
		//
		////Установка отментки об отмене документа в отменяемом документе
		//ОтменяемыйДокумент = ДокументВыдачиЗалога.ПолучитьОбъект();
		//ОтменяемыйДокумент.ДокументОтмены = ДокументОтмены;
		//
		//ОтменяемыйДокумент.Записать(РежимЗаписиДокумента.Запись);
		//
		//Попытка           
		//	ОтменяемыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		//Исключение
		//	ОбщегоНазначения.СообщитьПользователю("Не удалось установить отметку в отменяемом документе");
		//КонецПопытки;
		//
		
		Возврат Истина;
	Исключение   
		ОбщегоНазначения.СообщитьПользователю("Не удалось провести документ " + строка(ДокументОбъект.Ссылка));
		Возврат Ложь;
	КонецПопытки;  
КонецФункции

&НаКлиенте
Процедура ДокументОтменыНажатие(Элемент, СтандартнаяОбработка)
	
	Если ПолучитьВидОперации(ДокументОтмены) = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаВыдачиСОХ") Тогда 
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Документ", ДокументОтмены);    
		ОткрытьФорму("ОбщаяФорма.ЛБ_ОтменаОперацииПоЗайму", ПараметрыФормы, ЭтаФорма, Истина,,,);	
	Иначе                           
		СтандартнаяОбработка = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВидОперации(Ссылка)
    Возврат Ссылка.ВидОперации
КонецФункции

&НаСервере
Функция ПолучитьДокументОтмены(Ссылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&Период, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
		|ГДЕ
		|	ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент В(&ЗБ)";
	
	Запрос.УстановитьПараметр("ЗБ", Ссылка);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Регистратор;
	КонецЕсли;
	
	Возврат Документы.ЛБ_ОперацияПоЗалогу.ПустаяСсылка();
	
КонецФункции
//-Мельников







