
&НаКлиенте
Процедура Выбрать(Команда) 
	Результат = Новый СписокЗначений;
	Для каждого стр Из СписокГрупп Цикл 
		Если Стр.Вкл Тогда
		   Результат.Добавить(Стр.Группа);  
		КонецЕсли;   
	КонецЦикла;	                      
	Если Результат.Количество() = 0 Тогда 
		Закрыть();
	Иначе	
	    Закрыть(Результат);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ГруппыОбъектовЗалога.Ссылка КАК Группа
	               |ИЗ
	               |	Справочник.ЛБ_ГруппыОбъектовЗалога КАК ЛБ_ГруппыОбъектовЗалога
	               |ГДЕ
	               |	ЛБ_ГруппыОбъектовЗалога.ПометкаУдаления = ЛОЖЬ
	               |АВТОУПОРЯДОЧИВАНИЕ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	СписокГрупп.Загрузить(ТаблицаЗапроса);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры
