&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ РольДоступна("Администрирование") Тогда
		Элементы.Код.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.ВесОт = 0 И Объект.ВесДо = 0 Тогда
		Сообщить("Необходимо задать или минимальный или максимальный вес!");
		Отказ = Истина;
	ИначеЕсли (Объект.ВесОт > Объект.ВесДо) И НЕ (Объект.ВесДо = 0) Тогда
		Сообщить("Минимальный вес в группе не может быть больше максимального!");
		Отказ = Истина;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		СформироватьНаименование();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВесОтПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВесДоПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименование()
    Если Объект.ВесОт = 0 Тогда
		Объект.Наименование = "0,00-" + Формат(Объект.ВесДо, "ЧДЦ=2");
	ИначеЕсли Объект.ВесДо = 0 Тогда
		Объект.Наименование = "свыше " + Формат(Объект.ВесОт, "ЧДЦ=2");
	Иначе 
	    Объект.Наименование = Формат(Объект.ВесОт, "ЧДЦ=2") + "-" + Формат(Объект.ВесДо, "ЧДЦ=2");
	КонецЕсли;
КонецПроцедуры	

