	
// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	Движения.ЛБ_РаспределенныеБезналичныеПлатежи.Записывать = Истина;
	Движения.ЛБ_РаспределениеПереплаты.Записывать = Истина;  
	Движения.ЛБ_БезналичныеПлатежиКРаспределению.Записывать = Истина;
	Движения.ЛБ_РеестрБезначныхПлатежейПереплаты.Записывать = Истина;
	
	Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыИзмененийБезналичныхПлатежей.Изменение Тогда
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ДокументОплаты) Тогда   
			Если ЭтотОбъект.НовыйСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.КВозврату Тогда 
				Движение = Движения.ЛБ_РеестрБезначныхПлатежейПереплаты.Добавить();
				Движение.Период = Дата;  
				Движение.РеестрПлатежей = РеестрПлатежей;
				Движение.ДатаПлатежа = ДатаПлатежа;
				Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
				Движение.НомерЗБ = НомерЗБ;
				Движение.ЗалоговыйБилет = ЗалоговыйБилет;  
				Движение.СуммаПлатежа = СуммаПлатежа;
				Движение.ПереплатаНачальная = ЭтотОбъект.Переплата;  
				Движение.СтатусПлатежа = ЭтотОбъект.НовыйСтатусПлатежа; 
				Движение.Ответственный = ЭтотОбъект.Ответственный; 
			Иначе	
				Движение = Движения.ЛБ_РеестрБезначныхПлатежейПереплаты.Добавить();
				Движение.Период = Дата;  
				Движение.РеестрПлатежей = РеестрПлатежей;
				Движение.ДатаПлатежа = ДатаПлатежа;
				Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
				Движение.НомерЗБ = НомерЗБ;
				Движение.ЗалоговыйБилет = ЗалоговыйБилет;  
				Движение.СуммаПлатежа = СуммаПлатежа;
				Движение.ПереплатаНачальная = ЭтотОбъект.Переплата;  
				Движение.СтатусПлатежа = ЭтотОбъект.НовыйСтатусПлатежа;
				Движение.Возврат = ?(ЭтотОбъект.НовыйСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.Возвращено, Переплата, 0);  
				Движение.Ответственный = ЭтотОбъект.Ответственный; 

				Движение = Движения.ЛБ_РаспределениеПереплаты.Добавить();
				Движение.Период = Дата; 
				Движение.РеестрПлатежей = РеестрПлатежей;
				Движение.ДатаПлатежа = ДатаПлатежа;
				Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
				Движение.НомерЗБ = НомерЗБ;
				Движение.СуммаПлатежа = СуммаПлатежа;                
				Движение.ЗалоговыйБилет = ЗалоговыйБилет;
				Движение.Переплата = -Переплата;
				Движение.Возвращено = ?(ЭтотОбъект.НовыйСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.Возвращено, Переплата, 0); 
				Движение.ВДоходы = ?(ЭтотОбъект.НовыйСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ОтнесеноВДоходы, Переплата, 0); 
													
				Движение = Движения.ЛБ_РаспределенныеБезналичныеПлатежи.Добавить();
				Движение.Период = Дата;                              
				Движение.РеестрПлатежей = ЭтотОбъект.РеестрПлатежей;
				Движение.ДатаПлатежа = ДатаПлатежа;
				Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
				Движение.НомерЗБ = НомерЗБ;   
				Движение.СуммаПлатежа = СуммаПлатежа;  
				Движение.ЗалоговыйБилет = ЗалоговыйБилет; 
				Движение.Переплата = -Переплата;
				Если ЭтотОбъект.НовыйСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ОтнесеноВДоходы Тогда
				    Движение.ВДоходы = Переплата;
				ИначеЕсли ЭтотОбъект.НовыйСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.Возвращено Тогда
				    Движение.Возвращено = Переплата;	 	
				КонецЕсли;  
				СтатусПлатежа = ЛБ_ОбщийМодуль.ПолучитьИтоговыйСтатусБезналичногоПлатежа(Дата, РеестрПлатежей, ИдентификаторПлатежа, ДатаПлатежа, НомерЗБ);
				Если СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.КВозврату тогда
					Движение.КВозврату = -СуммаПлатежа; 
				ИначеЕсли СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ДоВыяснения тогда
		            Движение.ДоВыяснения = -СуммаПлатежа;
				КонецЕсли;	
				
				Запрос = Новый Запрос;
				Запрос.УстановитьПараметр("Дата", Дата);
				Запрос.УстановитьПараметр("РеестрПлатежей", РеестрПлатежей); 
				Запрос.УстановитьПараметр("ДатаПлатежа", ДатаПлатежа);
				Запрос.УстановитьПараметр("ИдентификаторПлатежа", ИдентификаторПлатежа);
				Запрос.УстановитьПараметр("НомерЗБ", НомерЗБ);
				Запрос.Текст = "ВЫБРАТЬ
				               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.РеестрПлатежей КАК РеестрПлатежей,
				               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.НомерЗБ КАК НомерЗБ,
				               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
				               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.ДатаПлатежа КАК ДатаПлатежа,
				               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.СуммаПлатежа КАК СуммаПлатежа,
				               |	СУММА(ЛБ_БезналичныеПлатежиКРаспределениюОстатки.СуммаОстаток) КАК Сумма
				               |ИЗ
				               |	РегистрНакопления.ЛБ_БезналичныеПлатежиКРаспределению.Остатки(
				               |			&Дата,
				               |			РеестрПлатежей = &РеестрПлатежей
				               |				И ИдентификаторПлатежа = &ИдентификаторПлатежа
				               |				И НомерЗБ = &НомерЗБ
				               |				И ДатаПлатежа = &ДатаПлатежа) КАК ЛБ_БезналичныеПлатежиКРаспределениюОстатки
				               |
				               |СГРУППИРОВАТЬ ПО
				               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.НомерЗБ,
				               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.РеестрПлатежей,
				               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.ДатаПлатежа,
				               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.СуммаПлатежа,
				               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.ИдентификаторПлатежа"; 
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда  
					Движение = Движения.ЛБ_БезналичныеПлатежиКРаспределению.ДобавитьРасход();
				    Движение.Период = Дата;   
					Движение.РеестрПлатежей = Выборка.РеестрПлатежей; 
					Движение.ДатаПлатежа = Выборка.ДатаПлатежа;
					Движение.ИдентификаторПлатежа = Выборка.ИдентификаторПлатежа;
					Движение.НомерЗБ = Выборка.НомерЗБ; 
					Движение.СуммаПлатежа = Выборка.СуммаПлатежа;
		            Движение.Сумма = Переплата;
				КонецЕсли; 
			КонецЕсли;	
		Иначе //это оплата	  
			СуммаОплаты = ДокументОплаты.СуммаОплатыПроценты + ДокументОплаты.СуммаОплатыСсуда;
			Если Переплата > СуммаОплаты Тогда  
				НоваяПереплата = ЭтотОбъект.Переплата - СуммаОплаты;
			Иначе
				НоваяПереплата = 0;
			КонецЕсли;
			
			Движение = Движения.ЛБ_РеестрБезначныхПлатежейПереплаты.Добавить();
			Движение.Период = Дата;  
			Движение.РеестрПлатежей = РеестрПлатежей;
			Движение.ДатаПлатежа = ДатаПлатежа;
			Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
			Движение.НомерЗБ = НомерЗБ;
			Движение.ЗалоговыйБилет = ЗалоговыйБилет;  
			Движение.СуммаПлатежа = СуммаПлатежа;
			Движение.ПереплатаНачальная = ЭтотОбъект.Переплата;  
			Движение.СтатусПлатежа = ЭтотОбъект.НовыйСтатусПлатежа;
			Движение.ОплатаПроценты = ДокументОплаты.СуммаОплатыПроценты;
			Движение.ОплатаЗайм = ДокументОплаты.СуммаОплатыСсуда;
			Движение.Переплата = НоваяПереплата; 			
			Движение.Ответственный = ЭтотОбъект.Ответственный;  
			Движение.ДокументОплаты = ЭтотОбъект.ДокументОплаты;
			
			Движение = Движения.ЛБ_РаспределениеПереплаты.Добавить();
			Движение.Период = Дата; 
			Движение.РеестрПлатежей = РеестрПлатежей;
			Движение.ДатаПлатежа = ДатаПлатежа;
			Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
			Движение.НомерЗБ = НомерЗБ;
			Движение.ЗалоговыйБилет = ЗалоговыйБилет;  
			Движение.СуммаПлатежа = СуммаПлатежа;
			Движение.Переплата = -СуммаОплаты; 

			Движение = Движения.ЛБ_РаспределениеПереплаты.Добавить();
			Движение.Период = Дата; 
			Движение.РеестрПлатежей = РеестрПлатежей;
			Движение.ДатаПлатежа = ДатаПлатежа;
			Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
			Движение.НомерЗБ = НомерЗБ;
			Движение.ЗалоговыйБилет = ЗалоговыйБилет;  
			Движение.СуммаПлатежа = СуммаПлатежа;
			Движение.ОплатаПроценты = ДокументОплаты.СуммаОплатыПроценты;
			Движение.ОплатаЗайм = ДокументОплаты.СуммаОплатыСсуда;
			Движение.Переплата = НоваяПереплата;  
										
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Дата", Дата);
			Запрос.УстановитьПараметр("РеестрПлатежей", РеестрПлатежей); 
			Запрос.УстановитьПараметр("ДатаПлатежа", ДатаПлатежа);
			Запрос.УстановитьПараметр("ИдентификаторПлатежа", ИдентификаторПлатежа);
			Запрос.УстановитьПараметр("НомерЗБ", НомерЗБ);
			Запрос.Текст = "ВЫБРАТЬ
			               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.РеестрПлатежей КАК РеестрПлатежей,
			               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.НомерЗБ КАК НомерЗБ,
			               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
			               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.ДатаПлатежа КАК ДатаПлатежа,
			               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.СуммаПлатежа КАК СуммаПлатежа,
			               |	СУММА(ЛБ_БезналичныеПлатежиКРаспределениюОстатки.СуммаОстаток) КАК Сумма
			               |ИЗ
			               |	РегистрНакопления.ЛБ_БезналичныеПлатежиКРаспределению.Остатки(
			               |			&Дата,
			               |			РеестрПлатежей = &РеестрПлатежей
			               |				И ИдентификаторПлатежа = &ИдентификаторПлатежа
			               |				И НомерЗБ = &НомерЗБ
			               |				И ДатаПлатежа = &ДатаПлатежа) КАК ЛБ_БезналичныеПлатежиКРаспределениюОстатки
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.НомерЗБ,
			               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.РеестрПлатежей,
			               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.ДатаПлатежа,
			               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.СуммаПлатежа,
			               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.ИдентификаторПлатежа"; 
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда  
				СуммаРасход = СуммаОплаты;
				Если СуммаРасход > Выборка.Сумма Тогда
					СуммаРасход = Выборка.Сумма;
					ОбщегоНазначения.СообщитьПользователю("Остаток по безналичным платежам к распределению " + СокрЛП(Формат(Выборка.Сумма, "ЧЦ=15; ЧДЦ=2")) + " меньше оплаты по ЗБ № " + СокрЛП(ЭтотОбъект.ЗалоговыйБилет.НомерЗалоговогоБилета));
				КонецЕсли;	
				Движение = Движения.ЛБ_БезналичныеПлатежиКРаспределению.ДобавитьРасход();
			    Движение.Период = Дата;   
				Движение.РеестрПлатежей = Выборка.РеестрПлатежей; 
				Движение.ДатаПлатежа = Выборка.ДатаПлатежа;
				Движение.ИдентификаторПлатежа = Выборка.ИдентификаторПлатежа;
				Движение.НомерЗБ = Выборка.НомерЗБ; 
				Движение.СуммаПлатежа = Выборка.СуммаПлатежа;
                Движение.Сумма = СуммаРасход;
			КонецЕсли;	       
			
			Движение = Движения.ЛБ_РаспределенныеБезналичныеПлатежи.Добавить();
			Движение.Период = Дата;                              
			Движение.РеестрПлатежей = ЭтотОбъект.РеестрПлатежей; 
			Движение.ДатаПлатежа = ДатаПлатежа;
			Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
			Движение.НомерЗБ = НомерЗБ;
			Движение.СуммаПлатежа = СуммаПлатежа; 
			Движение.ЗалоговыйБилет = ЭтотОбъект.ДокументОплаты.ПредыдущаяОперация;
			Движение.Переплата = -Переплата;   
								
			Движение = Движения.ЛБ_РаспределенныеБезналичныеПлатежи.Добавить();
			Движение.Период = Дата;                              
			Движение.РеестрПлатежей = ЭтотОбъект.РеестрПлатежей; 
			Движение.ДатаПлатежа = ДатаПлатежа;
			Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
			Движение.НомерЗБ = НомерЗБ;
			Движение.СуммаПлатежа = СуммаПлатежа; 
			Движение.ЗалоговыйБилет = ЭтотОбъект.ДокументОплаты.ПредыдущаяОперация;
			Если НЕ ЭтотОбъект.ДокументОплаты.СуммаОплатыПроценты = 0 Тогда
			    Движение.ОплатаПроценты = ЭтотОбъект.ДокументОплаты.СуммаОплатыПроценты;
			КонецЕсли;
			Если НЕ ЭтотОбъект.ДокументОплаты.СуммаОплатыСсуда = 0 Тогда
			    Движение.ОплатаЗайм = ЭтотОбъект.ДокументОплаты.СуммаОплатыСсуда;
			КонецЕсли;	
            Если НЕ НоваяПереплата = 0 Тогда
			    Движение.Переплата = НоваяПереплата;
			КонецЕсли;	
        КонецЕсли;
		
	ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыИзмененийБезналичныхПлатежей.ОтменаИзменения Тогда  
		Запрос = Новый Запрос;    
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("РеестрПлатежей", РеестрПлатежей); 
		Запрос.УстановитьПараметр("ДатаПлатежа", ДатаПлатежа);
		Запрос.УстановитьПараметр("ИдентификаторПлатежа", ИдентификаторПлатежа);
		Запрос.УстановитьПараметр("НомерЗБ", НомерЗБ);  
		Запрос.УстановитьПараметр("ДокументОплаты", ЭтотОбъект.ДокументОплаты);   
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_РаспределениеПереплаты.Регистратор КАК Регистратор,
		               |	ЛБ_РаспределениеПереплаты.Период КАК Период
		               |ИЗ
		               |	РегистрСведений.ЛБ_РеестрБезначныхПлатежейПереплаты КАК ЛБ_РаспределениеПереплаты
		               |ГДЕ
		               |	ЛБ_РаспределениеПереплаты.РеестрПлатежей = &РеестрПлатежей
		               |	И ЛБ_РаспределениеПереплаты.НомерЗБ = &НомерЗБ
		               |	И ЛБ_РаспределениеПереплаты.ДатаПлатежа = &ДатаПлатежа
		               |	И ЛБ_РаспределениеПереплаты.ИдентификаторПлатежа = &ИдентификаторПлатежа
		               |	И ЛБ_РаспределениеПереплаты.ДокументОплаты = &ДокументОплаты
		               |	И ЛБ_РаспределениеПереплаты.Период < &Дата
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Период УБЫВ";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда  
			НаборЗаписей = РегистрыСведений.ЛБ_РеестрБезначныхПлатежейПереплаты.СоздатьНаборЗаписей();
            НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
            НаборЗаписей.Прочитать(); 

        	Для каждого Запись Из НаборЗаписей Цикл  
				Движение = Движения.ЛБ_РеестрБезначныхПлатежейПереплаты.Добавить();
				Движение.Период = Дата; 
				Движение.РеестрПлатежей = Запись.РеестрПлатежей;
				Движение.ДатаПлатежа = Запись.ДатаПлатежа;
				Движение.ИдентификаторПлатежа = Запись.ИдентификаторПлатежа;
				Движение.НомерЗБ = Запись.НомерЗБ;
				Движение.ЗалоговыйБилет = Запись.ЗалоговыйБилет;
				Движение.СуммаПлатежа = Запись.СуммаПлатежа;
				Движение.ПереплатаНачальная = Запись.ПереплатаНачальная; 
				Движение.СтатусПлатежа = ЭтотОбъект.НовыйСтатусПлатежа;
				Движение.ДокументОплаты = Запись.ДокументОплаты;
				Движение.Ответственный = ЭтотОбъект.Ответственный;
				Если Выборка.Регистратор.НовыйСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.Возвращено ИЛИ
					 Выборка.Регистратор.НовыйСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ОтнесеноВДоходы Тогда
				    Движение.ОтменаСотрудникомЦО = Истина; 
				КонецЕсли;	
				Движение.Переплата = Запись.ПереплатаНачальная;
			КонецЦикла;	  			

			
			НаборЗаписей = РегистрыНакопления.ЛБ_РаспределениеПереплаты.СоздатьНаборЗаписей();
            НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
            НаборЗаписей.Прочитать(); 

        	Для каждого Запись Из НаборЗаписей Цикл  
				Движение = Движения.ЛБ_РаспределениеПереплаты.Добавить();
				Движение.Период = Дата; 
				Движение.РеестрПлатежей = Запись.РеестрПлатежей;
				Движение.ДатаПлатежа = Запись.ДатаПлатежа;
				Движение.ИдентификаторПлатежа = Запись.ИдентификаторПлатежа;
				Движение.НомерЗБ = Запись.НомерЗБ;
				Движение.ЗалоговыйБилет = Запись.ЗалоговыйБилет;
				Движение.СуммаПлатежа = Запись.СуммаПлатежа;
				Движение.ОплатаПроценты = -Запись.ОплатаПроценты; 
				Движение.ОплатаЗайм = -Запись.ОплатаЗайм;
				Движение.Переплата = -Запись.Переплата;
				Движение.Возвращено = -Запись.Возвращено; 
				Движение.ВДоходы = -Запись.ВДоходы;	
			КонецЦикла;	  
			
		  	НаборЗаписей = РегистрыНакопления.ЛБ_БезналичныеПлатежиКРаспределению.СоздатьНаборЗаписей();
            НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
            НаборЗаписей.Прочитать(); 
			
			Для каждого Запись Из НаборЗаписей Цикл
				Движение = Движения.ЛБ_БезналичныеПлатежиКРаспределению.Добавить();
				Движение.Период = Дата;   
				Движение.ВидДвижения = Запись.ВидДвижения;
				Движение.РеестрПлатежей = Запись.РеестрПлатежей; 
				Движение.ДатаПлатежа = Запись.ДатаПлатежа;
				Движение.ИдентификаторПлатежа = Запись.ИдентификаторПлатежа; 
				Движение.НомерЗБ = Запись.НомерЗБ; 
				Движение.СуммаПлатежа = Запись.СуммаПлатежа;
				Движение.Сумма = -Запись.Сумма;
			КонецЦикла;	
			
			НаборЗаписей = РегистрыНакопления.ЛБ_РаспределенныеБезналичныеПлатежи.СоздатьНаборЗаписей();
            НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
            НаборЗаписей.Прочитать(); 
			
			Для каждого Запись Из НаборЗаписей Цикл
				Движение = Движения.ЛБ_РаспределенныеБезналичныеПлатежи.Добавить();
				Движение.Период = Дата;                              
				Движение.РеестрПлатежей = Запись.РеестрПлатежей;
				Движение.ДатаПлатежа = Запись.ДатаПлатежа;
				Движение.ИдентификаторПлатежа = Запись.ИдентификаторПлатежа;
				Движение.НомерЗБ = Запись.НомерЗБ;
				Движение.СуммаПлатежа = Запись.СуммаПлатежа;                 
				Движение.ЗалоговыйБилет = Запись.ЗалоговыйБилет;
				Движение.СуммаПлатежа = Запись.СуммаПлатежа;
				Движение.ОплатаПроценты = -Запись.ОплатаПроценты; 
				Движение.ОплатаЗайм = -Запись.ОплатаЗайм;
				Движение.Переплата = -Запись.Переплата;
				Движение.ВДоходы = -Запись.ВДоходы;
				Движение.Возвращено = -Запись.Возвращено;      
			КонецЦикла;	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры