Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.Базовый Тогда
		Движения.ЛБ_ТекущийШаблонПриказа.Записывать = Истина;  
		Если ЭтотОбъект.Ломбарды.Количество() = 0 Тогда
			Для каждого стр Из ЭтотОбъект.Шаблоны Цикл 
				Движение = Движения.ЛБ_ТекущийШаблонПриказа.Добавить();
			    Движение.Период = Дата; 
				Движение.ВидПрейскуранта = Перечисления.ЛБ_ВидыПрейскурантов.ПроцентныеСтавки;
				Движение.СхемаКредитования = Стр.СхемаКредитования;
				Движение.ШаблонПриказа = Стр.Шаблон;
			КонецЦикла;	 
		Иначе                                           
			Для каждого стрЛ Из ЭтотОбъект.Ломбарды Цикл
				Для каждого стр Из ЭтотОбъект.Шаблоны Цикл 
					Движение = Движения.ЛБ_ТекущийШаблонПриказа.Добавить();
				    Движение.Период = Дата; 
					Движение.ВидПрейскуранта = Перечисления.ЛБ_ВидыПрейскурантов.ПроцентныеСтавки;
					Движение.СхемаКредитования = Стр.СхемаКредитования;  
					Движение.Ломбард = СтрЛ.Ломбард;
					Движение.ШаблонПриказа = Стр.Шаблон;
				КонецЦикла;	 
			КонецЦикла;	
		КонецЕсли;	
	Иначе 
		Движения.ЛБ_ТекущийШаблонПриказаАкции.Записывать = Истина;   
		Для каждого стр Из ЭтотОбъект.Шаблоны Цикл 
			Движение = Движения.ЛБ_ТекущийШаблонПриказаАкции.Добавить();
		    Движение.Период = Дата; 
			Движение.ВидПрейскуранта = Перечисления.ЛБ_ВидыПрейскурантов.ПроцентныеСтавки;
			Движение.Акция = Стр.Акция;
			Движение.ШаблонПриказа = Стр.ШаблонАкция;
		КонецЦикла;	 
	КонецЕсли;	
КонецПроцедуры
