////////////////////////////////////////////////////////////////////////////////
// УчетЗарплаты: методы, используемые:
//               - при настройке зарплаты и кадров;
//               - при отражении зарплаты и налогов/взносов с ФОТ в учете;
//               - при получении сведений о документах подсистем учета зарплаты и кадров;
//               - ...
////////////////////////////////////////////////////////////////////////////////

#Область ИнтерфейсВзаимодейтвияБЗКБ

////////////////////////////////////////////////////////////////////////////////
// ИНТЕРФЕЙС ВЗАИМОДЕЙСТВИЯ С БЗКБ
//
// Предназначена для генерации всех движений, связанных с отражением в регл. учете
//
// Параметры:
//	Движения
//	Отказ
//	Организация
//	ПериодРегистрации
//	ДанныеДляОтражения - таблицы движений
//
Процедура СформироватьДвиженияПоОтражениюЗарплатыВРегламентированномУчете(Движения, Отказ, Организация, ПериодРегистрации, ДанныеДляОтражения) Экспорт
	
	ВедетсяУчетРасчетовПоЗарплатеПоРаботникам = ПолучитьФункциональнуюОпцию("ВедетсяУчетРасчетовПоЗарплатеПоРаботникам");
	Если Не ВедетсяУчетРасчетовПоЗарплатеПоРаботникам Тогда
		ОбщегоНазначения.СообщитьПользователю("В форме ""Настройки зарплаты"" не установлен флаг ""Ведется учет расчетов по зарплате по работникам""! Проводки не будут сформированы");
		Возврат;
	КонецЕсли;
	
	// Резервы по отпускам
	Если ДанныеДляОтражения.Свойство("ОценочныеОбязательстваПоСотрудникам") Тогда
		ДанныеПоРезервам = ДанныеДляОтражения.ОценочныеОбязательстваПоСотрудникам;
		Если ДанныеПоРезервам.Количество() <> 0 Тогда
			СформироватьДвиженияНачислениеРезервов(Движения, Отказ, Организация, ПериодРегистрации, ДанныеПоРезервам);
		КонецЕсли;
	КонецЕсли;

	// Начисление зарплаты и налогов с ФОТ, НДФЛ
	ДанныеПоЗарплате = Новый Структура;
	Если ДанныеДляОтражения.Свойство("НачисленнаяЗарплатаИВзносы") Тогда
		ДанныеПоЗарплате.Вставить("НачисленнаяЗарплатаИВзносы", ДанныеДляОтражения.НачисленнаяЗарплатаИВзносы);
		Если ДанныеДляОтражения.Свойство("УдержаннаяЗарплата") Тогда
			ДанныеПоЗарплате.Вставить("УдержаннаяЗарплата", ДанныеДляОтражения.УдержаннаяЗарплата);
		КонецЕсли;
	КонецЕсли;
	Если ДанныеДляОтражения.Свойство("НачисленныйНДФЛ") Тогда
		ДанныеПоЗарплате.Вставить("НачисленныйНДФЛ", ДанныеДляОтражения.НачисленныйНДФЛ);
	КонецЕсли;
	Если ДанныеПоЗарплате.Количество() <> 0 Тогда
		СформироватьДвиженияНачислениеЗарплаты(Движения, Отказ, Организация, ПериодРегистрации, ДанныеПоЗарплате);
	КонецЕсли;
	
	// Зачет аванса
	Если ДанныеДляОтражения.Свойство("ЗачетАванса") Тогда
		Если ДанныеДляОтражения.ЗачетАванса = Истина Тогда
			СформироватьДвиженияЗачетАванса(Движения, Отказ, Организация, ПериодРегистрации);
		КонецЕсли;
	КонецЕсли;

	// Депонирование выплат
	Если ДанныеДляОтражения.Свойство("Депоненты") Тогда
		ДанныеПоДепонентам = ДанныеДляОтражения.Депоненты;
		Если ДанныеПоДепонентам.Количество() <> 0 Тогда
			СформироватьДвиженияДепонированиеЗарплаты(Движения, Отказ, Организация, ПериодРегистрации, ДанныеПоДепонентам);
		КонецЕсли;
	КонецЕсли;
	
	// Удержания
	Если ДанныеДляОтражения.Свойство("УдержаннаяЗарплата") Тогда
		ДанныеПоУдержаниям = ДанныеДляОтражения.УдержаннаяЗарплата;
		Если ДанныеДляОтражения.Свойство("НачисленнаяЗарплатаИВзносы") Тогда
			НачисленнаяЗарплатаИВзносы = ДанныеДляОтражения.НачисленнаяЗарплатаИВзносы;
		Иначе
			НачисленнаяЗарплатаИВзносы = Неопределено;
		КонецЕсли;
		Если ДанныеПоУдержаниям.Количество() <> 0 Тогда
			СформироватьДвиженияУдержания(Движения, Отказ, Организация, ПериодРегистрации, ДанныеПоУдержаниям, НачисленнаяЗарплатаИВзносы);
		КонецЕсли;
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти

#Область Начисление

Процедура СформироватьДвиженияЗачетАванса(Движения, Отказ, Организация, Знач ПериодРегистрации)
	
	Регистратор         = Движения.ЕПС.Отбор.Регистратор.Значение;
	ПериодРегистрации	= ПолучитьПериодРегистрации(Регистратор, ПериодРегистрации);

	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Организация", 	Организация);
	Реквизиты.Вставить("Период", 		ПериодРегистрации);

	Запрос = Новый Запрос();
	Запрос.Текст = ТекстЗапросаСверткаПарныхСчетовДляЗачетаАвансов();
	
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("Период",			Новый Граница(Реквизиты.Период, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Содержание",		"Свёртка парных лицевых счетов");
	Запрос.УстановитьПараметр("СчетАктивный",	ПланыСчетов.ЕПС.НайтиПоКоду("60306"));

	ДанныеСверткиПарныхСчетов = Запрос.Выполнить().Выгрузить();
	
	ЮС_РегламентныеОперации.СверткаПарныхСчетовРасчетовСКонтрагентами(Реквизиты, ДанныеСверткиПарныхСчетов, Движения, Отказ);
	
КонецПроцедуры

Функция ТекстЗапросаСверткаПарныхСчетовДляЗачетаАвансов() Экспорт

	// Расшифровка временных таблиц запроса:
	// ПарныеСчетаУчета 		- данные из р-ра ЕПСПарныеСчетаУчета
	// ПарныеЛицевыеСчета 	- данные парных лицевых счетов из р-ра ЕПСПарныеЛицевыеСчета по счетам из ПарныеСчетаУчета
	// РазличныеПарныеЛицевыеСчета - итоговая таблица данных парных лицевых счетов
	
	// СК [01.11.2022] - разбила субконто на СубконтоДт1,СубконтоДт2,СубконтоДт3,СубконтоКт1,СубконтоКт1,СубконтоКт1
	
	Возврат "ВЫБРАТЬ
	        |	ЕПСПарныеСчетаУчета.СчетАктивный КАК СчетАктивный,
	        |	ЕПСПарныеСчетаУчета.СчетПассивный КАК СчетПассивный
	        |ПОМЕСТИТЬ ПарныеСчетаУчета
	        |ИЗ
	        |	РегистрСведений.ЕПСПарныеСчетаУчета КАК ЕПСПарныеСчетаУчета
	        |ГДЕ
	        |	ЕПСПарныеСчетаУчета.СчетАктивный = &СчетАктивный
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЕПСПарныеЛицевыеСчета.СчетАктивный КАК ЛицевойСчетАктивный,
	        |	ЕПСПарныеЛицевыеСчета.СчетПассивный КАК ЛицевойСчетПассивный,
	        |	ЕПСИспользуемыеЛицевыеСчета.Аналитика2 КАК Аналитика2
	        |ПОМЕСТИТЬ ПарныеЛицевыеСчета
	        |ИЗ
	        |	РегистрСведений.ЕПСПарныеЛицевыеСчета КАК ЕПСПарныеЛицевыеСчета
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЕПСИспользуемыеЛицевыеСчета КАК ЕПСИспользуемыеЛицевыеСчета
	        |		ПО ЕПСПарныеЛицевыеСчета.СчетАктивный = ЕПСИспользуемыеЛицевыеСчета.ЛицевойСчет
	        |ГДЕ
	        |	ЕПСПарныеЛицевыеСчета.Организация = &Организация
	        |	И ЕПСПарныеЛицевыеСчета.СчетАктивный.Владелец В
	        |			(ВЫБРАТЬ
	        |				ПарныеСчетаУчета.СчетАктивный
	        |			ИЗ
	        |				ПарныеСчетаУчета КАК ПарныеСчетаУчета)
	        |	И ЕПСПарныеЛицевыеСчета.СчетПассивный.Владелец В
	        |			(ВЫБРАТЬ
	        |				ПарныеСчетаУчета.СчетПассивный
	        |			ИЗ
	        |				ПарныеСчетаУчета КАК ПарныеСчетаУчета)
	        |	И ЕПСИспользуемыеЛицевыеСчета.Аналитика2 = ЗНАЧЕНИЕ(Перечисление.ЮС_ВидыВыплатРаботникам.ОплатаТруда)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ЛицевыеСчета.ЛицевойСчет КАК ЛицевойСчет,
	        |	ВЫРАЗИТЬ(ЛицевыеСчета.ЛицевойСчет КАК Справочник.ЕПСЛицевыеСчета).Владелец КАК ЛицевойСчетВладелец
	        |ПОМЕСТИТЬ РазличныеПарныеЛицевыеСчета
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		ПарныеЛицевыеСчета.ЛицевойСчетАктивный КАК ЛицевойСчет
	        |	ИЗ
	        |		ПарныеЛицевыеСчета КАК ПарныеЛицевыеСчета
	        |	
	        |	ОБЪЕДИНИТЬ ВСЕ
	        |	
	        |	ВЫБРАТЬ
	        |		ПарныеЛицевыеСчета.ЛицевойСчетПассивный
	        |	ИЗ
	        |		ПарныеЛицевыеСчета КАК ПарныеЛицевыеСчета) КАК ЛицевыеСчета
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЕПСОстатки.ЛицевойСчет КАК ЛицевойСчет,
	        |	ЕПСОстатки.Субконто1 КАК Субконто1,
	        |	ЕПСОстатки.Субконто2 КАК Субконто2,
	        |	ЕПСОстатки.Субконто3 КАК Субконто3,
	        |	ЕПСОстатки.Валюта КАК Валюта,
	        |	ЕПСОстатки.СуммаОстаток * ВЫБОР
	        |		КОГДА ЕПСОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	        |			ТОГДА -1
	        |		ИНАЧЕ 1
	        |	КОНЕЦ КАК СуммаОстаток,
	        |	ЕСТЬNULL(ЕПСОстатки.СуммаНУОстаток, 0) * ВЫБОР
	        |		КОГДА ЕПСОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	        |			ТОГДА -1
	        |		ИНАЧЕ 1
	        |	КОНЕЦ КАК СуммаНУОстаток,
	        |	ЕСТЬNULL(ЕПСОстатки.СуммаПРОстаток, 0) * ВЫБОР
	        |		КОГДА ЕПСОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	        |			ТОГДА -1
	        |		ИНАЧЕ 1
	        |	КОНЕЦ КАК СуммаПРОстаток,
	        |	ЕСТЬNULL(ЕПСОстатки.СуммаВРОстаток, 0) * ВЫБОР
	        |		КОГДА ЕПСОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	        |			ТОГДА -1
	        |		ИНАЧЕ 1
	        |	КОНЕЦ КАК СуммаВРОстаток,
	        |	ЕСТЬNULL(ЕПСОстатки.ВалютнаяСуммаОстаток, 0) * ВЫБОР
	        |		КОГДА ЕПСОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	        |			ТОГДА -1
	        |		ИНАЧЕ 1
	        |	КОНЕЦ КАК ВалютнаяСуммаОстаток,
	        |	ЕПСОстатки.Подразделение КАК Подразделение
	        |ПОМЕСТИТЬ ДанныеРегистра
	        |ИЗ
	        |	РегистрБухгалтерии.ЕПС.Остатки(
	        |			&Период,
	        |			Счет В
	        |				(ВЫБРАТЬ
	        |					РазличныеПарныеЛицевыеСчета.ЛицевойСчетВладелец
	        |				ИЗ
	        |					РазличныеПарныеЛицевыеСчета КАК РазличныеПарныеЛицевыеСчета),
	        |			,
	        |			Организация = &Организация
	        |				И ЛицевойСчет В
	        |					(ВЫБРАТЬ
	        |						РазличныеПарныеЛицевыеСчета.ЛицевойСчет
	        |					ИЗ
	        |						РазличныеПарныеЛицевыеСчета КАК РазличныеПарныеЛицевыеСчета)) КАК ЕПСОстатки
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВложенныйЗапрос.ЛицевойСчетАктивный КАК ЛицевойСчетАктивный,
	        |	ВложенныйЗапрос.ЛицевойСчетПассивный КАК ЛицевойСчетПассивный,
	        |	ВложенныйЗапрос.Субконто1 КАК Субконто1,
	        |	ВложенныйЗапрос.Субконто2 КАК Субконто2,
	        |	ВложенныйЗапрос.Субконто3 КАК Субконто3,
	        |	ВложенныйЗапрос.Валюта КАК Валюта,
	        |	ВложенныйЗапрос.Подразделение КАК Подразделение,
	        |	СУММА(ВложенныйЗапрос.СуммаАктивный) КАК СуммаАктивный,
	        |	СУММА(ВложенныйЗапрос.СуммаНУАктивный) КАК СуммаНУАктивный,
	        |	СУММА(ВложенныйЗапрос.СуммаПРАктивный) КАК СуммаПРАктивный,
	        |	СУММА(ВложенныйЗапрос.СуммаВРАктивный) КАК СуммаВРАктивный,
	        |	СУММА(ВложенныйЗапрос.ВалютнаяСуммаАктивный) КАК ВалютнаяСуммаАктивный,
	        |	СУММА(ВложенныйЗапрос.СуммаПассивный) КАК СуммаПассивный,
	        |	СУММА(ВложенныйЗапрос.СуммаНУПассивный) КАК СуммаНУПассивный,
	        |	СУММА(ВложенныйЗапрос.СуммаПРПассивный) КАК СуммаПРПассивный,
	        |	СУММА(ВложенныйЗапрос.СуммаВРПассивный) КАК СуммаВРПассивный,
	        |	СУММА(ВложенныйЗапрос.ВалютнаяСуммаПассивный) КАК ВалютнаяСуммаПассивный,
	        |	ВЫБОР
	        |		КОГДА СУММА(ВложенныйЗапрос.СуммаАктивный) <> 0
	        |			ТОГДА СУММА(ВложенныйЗапрос.СуммаАктивный) < 0
	        |		КОГДА СУММА(ВложенныйЗапрос.СуммаНУАктивный) <> 0
	        |			ТОГДА СУММА(ВложенныйЗапрос.СуммаНУАктивный) < 0
	        |		КОГДА СУММА(ВложенныйЗапрос.СуммаПРАктивный) <> 0
	        |			ТОГДА СУММА(ВложенныйЗапрос.СуммаПРАктивный) < 0
	        |		КОГДА СУММА(ВложенныйЗапрос.СуммаВРАктивный) <> 0
	        |			ТОГДА СУММА(ВложенныйЗапрос.СуммаВРАктивный) < 0
	        |		ИНАЧЕ ЛОЖЬ
	        |	КОНЕЦ КАК ОтрицательныйОстатокАктивный,
	        |	ВЫБОР
	        |		КОГДА СУММА(ВложенныйЗапрос.СуммаПассивный) <> 0
	        |			ТОГДА СУММА(ВложенныйЗапрос.СуммаПассивный) < 0
	        |		КОГДА СУММА(ВложенныйЗапрос.СуммаНУПассивный) <> 0
	        |			ТОГДА СУММА(ВложенныйЗапрос.СуммаНУПассивный) < 0
	        |		КОГДА СУММА(ВложенныйЗапрос.СуммаПРПассивный) <> 0
	        |			ТОГДА СУММА(ВложенныйЗапрос.СуммаПРПассивный) < 0
	        |		КОГДА СУММА(ВложенныйЗапрос.СуммаВРПассивный) <> 0
	        |			ТОГДА СУММА(ВложенныйЗапрос.СуммаВРПассивный) < 0
	        |		ИНАЧЕ ЛОЖЬ
	        |	КОНЕЦ КАК ОтрицательныйОстатокПассивный
	        |ПОМЕСТИТЬ ДанныеСвертки
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		ПарныеЛицевыеСчета.ЛицевойСчетАктивный КАК ЛицевойСчетАктивный,
	        |		ПарныеЛицевыеСчета.ЛицевойСчетПассивный КАК ЛицевойСчетПассивный,
	        |		ДанныеРегистра.Субконто1 КАК Субконто1,
	        |		ДанныеРегистра.Субконто2 КАК Субконто2,
	        |		ДанныеРегистра.Субконто3 КАК Субконто3,
	        |		ДанныеРегистра.Валюта КАК Валюта,
	        |		ДанныеРегистра.Подразделение КАК Подразделение,
	        |		ДанныеРегистра.СуммаОстаток КАК СуммаАктивный,
	        |		ДанныеРегистра.СуммаНУОстаток КАК СуммаНУАктивный,
	        |		ДанныеРегистра.СуммаПРОстаток КАК СуммаПРАктивный,
	        |		ДанныеРегистра.СуммаВРОстаток КАК СуммаВРАктивный,
	        |		ДанныеРегистра.ВалютнаяСуммаОстаток КАК ВалютнаяСуммаАктивный,
	        |		0 КАК СуммаПассивный,
	        |		0 КАК СуммаНУПассивный,
	        |		0 КАК СуммаПРПассивный,
	        |		0 КАК СуммаВРПассивный,
	        |		0 КАК ВалютнаяСуммаПассивный
	        |	ИЗ
	        |		ПарныеЛицевыеСчета КАК ПарныеЛицевыеСчета
	        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеРегистра КАК ДанныеРегистра
	        |			ПО ПарныеЛицевыеСчета.ЛицевойСчетАктивный = ДанныеРегистра.ЛицевойСчет
	        |	
	        |	ОБЪЕДИНИТЬ ВСЕ
	        |	
	        |	ВЫБРАТЬ
	        |		ПарныеЛицевыеСчета.ЛицевойСчетАктивный,
	        |		ПарныеЛицевыеСчета.ЛицевойСчетПассивный,
	        |		ДанныеРегистра.Субконто1,
	        |		ДанныеРегистра.Субконто2,
	        |		ДанныеРегистра.Субконто3,
	        |		ДанныеРегистра.Валюта,
	        |		ДанныеРегистра.Подразделение,
	        |		0,
	        |		0,
	        |		0,
	        |		0,
	        |		0,
	        |		ДанныеРегистра.СуммаОстаток,
	        |		ДанныеРегистра.СуммаНУОстаток,
	        |		ДанныеРегистра.СуммаПРОстаток,
	        |		ДанныеРегистра.СуммаВРОстаток,
	        |		ДанныеРегистра.ВалютнаяСуммаОстаток
	        |	ИЗ
	        |		ПарныеЛицевыеСчета КАК ПарныеЛицевыеСчета
	        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеРегистра КАК ДанныеРегистра
	        |			ПО ПарныеЛицевыеСчета.ЛицевойСчетПассивный = ДанныеРегистра.ЛицевойСчет) КАК ВложенныйЗапрос
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВложенныйЗапрос.Валюта,
	        |	ВложенныйЗапрос.Субконто1,
	        |	ВложенныйЗапрос.Субконто2,
	        |	ВложенныйЗапрос.ЛицевойСчетПассивный,
	        |	ВложенныйЗапрос.Субконто3,
	        |	ВложенныйЗапрос.ЛицевойСчетАктивный,
	        |	ВложенныйЗапрос.Подразделение
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ЛицевойСчетАктивный,
	        |	ЛицевойСчетПассивный
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ОстаткиПоПарнымСчетам.ЛицевойСчетПассивный КАК ЛицевойСчетДт,
	        |	ОстаткиПоПарнымСчетам.ЛицевойСчетАктивный КАК ЛицевойСчетКт,
	        |	ВЫБОР
	        |		КОГДА ОстаткиПоПарнымСчетам.СуммаПассивный <> ОстаткиПоПарнымСчетам.СуммаАктивный
	        |			ТОГДА ОстаткиПоПарнымСчетам.СуммаПассивный > ОстаткиПоПарнымСчетам.СуммаАктивный
	        |		КОГДА ОстаткиПоПарнымСчетам.СуммаНУПассивный <> ОстаткиПоПарнымСчетам.СуммаНУАктивный
	        |			ТОГДА ОстаткиПоПарнымСчетам.СуммаНУПассивный > ОстаткиПоПарнымСчетам.СуммаНУАктивный
	        |		КОГДА ОстаткиПоПарнымСчетам.СуммаПРПассивный <> ОстаткиПоПарнымСчетам.СуммаПРАктивный
	        |			ТОГДА ОстаткиПоПарнымСчетам.СуммаПРПассивный > ОстаткиПоПарнымСчетам.СуммаПРАктивный
	        |		КОГДА ОстаткиПоПарнымСчетам.СуммаВРПассивный <> ОстаткиПоПарнымСчетам.СуммаВРАктивный
	        |			ТОГДА ОстаткиПоПарнымСчетам.СуммаВРПассивный > ОстаткиПоПарнымСчетам.СуммаВРАктивный
	        |		ИНАЧЕ ЛОЖЬ
	        |	КОНЕЦ КАК ОстатокНаПассивном
	        |ПОМЕСТИТЬ ЛицевыеСчетаПроводки
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		ДанныеСвертки.ЛицевойСчетАктивный КАК ЛицевойСчетАктивный,
	        |		ДанныеСвертки.ЛицевойСчетПассивный КАК ЛицевойСчетПассивный,
	        |		СУММА(ДанныеСвертки.СуммаАктивный) КАК СуммаАктивный,
	        |		СУММА(ДанныеСвертки.СуммаНУАктивный) КАК СуммаНУАктивный,
	        |		СУММА(ДанныеСвертки.СуммаПРАктивный) КАК СуммаПРАктивный,
	        |		СУММА(ДанныеСвертки.СуммаВРАктивный) КАК СуммаВРАктивный,
	        |		СУММА(ДанныеСвертки.СуммаПассивный) КАК СуммаПассивный,
	        |		СУММА(ДанныеСвертки.СуммаНУПассивный) КАК СуммаНУПассивный,
	        |		СУММА(ДанныеСвертки.СуммаПРПассивный) КАК СуммаПРПассивный,
	        |		СУММА(ДанныеСвертки.СуммаВРПассивный) КАК СуммаВРПассивный
	        |	ИЗ
	        |		ДанныеСвертки КАК ДанныеСвертки
	        |	
	        |	СГРУППИРОВАТЬ ПО
	        |		ДанныеСвертки.ЛицевойСчетПассивный,
	        |		ДанныеСвертки.ЛицевойСчетАктивный) КАК ОстаткиПоПарнымСчетам
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ЛицевойСчетДт,
	        |	ЛицевойСчетКт
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЕПСЛицевыеСчета.ЛицевойСчетВладелец КАК СчетУчета,
	        |	ЕПСЛицевыеСчета.ЛицевойСчет КАК ЛицевойСчет,
	        |	ЕПСЛицевыеСчета.ЛицевойСчетВладелец.Валютный КАК ЛицевойСчетВладелецВалютный
	        |ПОМЕСТИТЬ СчетаУчетаБанковский
	        |ИЗ
	        |	РазличныеПарныеЛицевыеСчета КАК ЕПСЛицевыеСчета
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ЛицевойСчет
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЛицевыеСчетаПроводки.ЛицевойСчетДт КАК ЛицевойСчетДт,
	        |	ЛицевыеСчетаПроводки.ЛицевойСчетКт КАК ЛицевойСчетКт,
	        |	СчетаУчетаБанковскийДт.СчетУчета КАК СчетУчетаДт,
	        |	СчетаУчетаБанковскийКт.СчетУчета КАК СчетУчетаКт,
	        |	ЛицевыеСчетаПроводки.ОстатокНаПассивном КАК ОстатокНаПассивном
	        |ПОМЕСТИТЬ СчетаУчета
	        |ИЗ
	        |	ЛицевыеСчетаПроводки КАК ЛицевыеСчетаПроводки
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СчетаУчетаБанковский КАК СчетаУчетаБанковскийДт
	        |		ПО ЛицевыеСчетаПроводки.ЛицевойСчетДт = СчетаУчетаБанковскийДт.ЛицевойСчет
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СчетаУчетаБанковский КАК СчетаУчетаБанковскийКт
	        |		ПО ЛицевыеСчетаПроводки.ЛицевойСчетКт = СчетаУчетаБанковскийКт.ЛицевойСчет
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВЫБОР
	        |		КОГДА ДанныеСвертки.ОтрицательныйОстатокАктивный
	        |			ТОГДА СчетаУчета.ЛицевойСчетКт
	        |		ИНАЧЕ СчетаУчета.ЛицевойСчетДт
	        |	КОНЕЦ КАК ЛицевойСчетДт,
	        |	ВЫБОР
	        |		КОГДА ДанныеСвертки.ОтрицательныйОстатокАктивный
	        |			ТОГДА СчетаУчета.ЛицевойСчетДт
	        |		ИНАЧЕ СчетаУчета.ЛицевойСчетКт
	        |	КОНЕЦ КАК ЛицевойСчетКт,
	        |	ВЫБОР
	        |		КОГДА ДанныеСвертки.ОтрицательныйОстатокАктивный
	        |			ТОГДА СчетаУчета.СчетУчетаКт
	        |		ИНАЧЕ СчетаУчета.СчетУчетаДт
	        |	КОНЕЦ КАК СчетУчетаДт,
	        |	ВЫБОР
	        |		КОГДА ДанныеСвертки.ОтрицательныйОстатокАктивный
	        |			ТОГДА СчетаУчета.СчетУчетаДт
	        |		ИНАЧЕ СчетаУчета.СчетУчетаКт
	        |	КОНЕЦ КАК СчетУчетаКт,
	        |	ДанныеСвертки.Валюта КАК Валюта,
	        |	ДанныеСвертки.Подразделение КАК Подразделение,
	        |	ДанныеСвертки.Субконто1 КАК Субконто1,
	        |	ДанныеСвертки.Субконто2 КАК Субконто2,
	        |	ДанныеСвертки.Субконто3 КАК Субконто3,
	        |	ДанныеСвертки.СуммаАктивный * ВЫБОР
	        |		КОГДА ДанныеСвертки.ОтрицательныйОстатокАктивный
	        |			ТОГДА -1
	        |		ИНАЧЕ 1
	        |	КОНЕЦ КАК Сумма,
	        |	ДанныеСвертки.ВалютнаяСуммаАктивный * ВЫБОР
	        |		КОГДА ДанныеСвертки.ОтрицательныйОстатокАктивный
	        |			ТОГДА -1
	        |		ИНАЧЕ 1
	        |	КОНЕЦ КАК ВалютнаяСумма,
	        |	ДанныеСвертки.СуммаНУАктивный * ВЫБОР
	        |		КОГДА ДанныеСвертки.ОтрицательныйОстатокАктивный
	        |			ТОГДА -1
	        |		ИНАЧЕ 1
	        |	КОНЕЦ КАК СуммаНУ,
	        |	ДанныеСвертки.СуммаПРАктивный * ВЫБОР
	        |		КОГДА ДанныеСвертки.ОтрицательныйОстатокАктивный
	        |			ТОГДА -1
	        |		ИНАЧЕ 1
	        |	КОНЕЦ КАК СуммаПР,
	        |	ДанныеСвертки.СуммаВРАктивный * ВЫБОР
	        |		КОГДА ДанныеСвертки.ОтрицательныйОстатокАктивный
	        |			ТОГДА -1
	        |		ИНАЧЕ 1
	        |	КОНЕЦ КАК СуммаВР,
	        |	&Содержание КАК Содержание,
	        |	ДанныеСвертки.ЛицевойСчетАктивный КАК ЛицевойСчетАктивный,
	        |	ДанныеСвертки.ЛицевойСчетПассивный КАК ЛицевойСчетПассивный,
	        |	ДанныеСвертки.ЛицевойСчетАктивный.Владелец КАК СчетУчетаАктивный,
	        |	ДанныеСвертки.ЛицевойСчетПассивный.Владелец КАК СчетУчетаПассивный
	        |ПОМЕСТИТЬ ВрТ_Итог
	        |ИЗ
	        |	СчетаУчета КАК СчетаУчета
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеСвертки КАК ДанныеСвертки
	        |		ПО СчетаУчета.ЛицевойСчетДт = ДанныеСвертки.ЛицевойСчетПассивный
	        |			И СчетаУчета.ЛицевойСчетКт = ДанныеСвертки.ЛицевойСчетАктивный
	        |ГДЕ
	        |	(ДанныеСвертки.СуммаАктивный <> 0
	        |			ИЛИ ДанныеСвертки.СуммаНУАктивный <> 0
	        |			ИЛИ ДанныеСвертки.СуммаПРАктивный <> 0
	        |			ИЛИ ДанныеСвертки.СуммаВРАктивный <> 0)
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ВЫБОР
	        |		КОГДА ДанныеСвертки.ОтрицательныйОстатокПассивный
	        |			ТОГДА СчетаУчета.ЛицевойСчетКт
	        |		ИНАЧЕ СчетаУчета.ЛицевойСчетДт
	        |	КОНЕЦ,
	        |	ВЫБОР
	        |		КОГДА ДанныеСвертки.ОтрицательныйОстатокПассивный
	        |			ТОГДА СчетаУчета.ЛицевойСчетДт
	        |		ИНАЧЕ СчетаУчета.ЛицевойСчетКт
	        |	КОНЕЦ,
	        |	ВЫБОР
	        |		КОГДА ДанныеСвертки.ОтрицательныйОстатокПассивный
	        |			ТОГДА СчетаУчета.СчетУчетаКт
	        |		ИНАЧЕ СчетаУчета.СчетУчетаДт
	        |	КОНЕЦ,
	        |	ВЫБОР
	        |		КОГДА ДанныеСвертки.ОтрицательныйОстатокПассивный
	        |			ТОГДА СчетаУчета.СчетУчетаДт
	        |		ИНАЧЕ СчетаУчета.СчетУчетаКт
	        |	КОНЕЦ,
	        |	ДанныеСвертки.Валюта,
	        |	ДанныеСвертки.Подразделение,
	        |	ДанныеСвертки.Субконто1,
	        |	ДанныеСвертки.Субконто2,
	        |	ДанныеСвертки.Субконто3,
	        |	ДанныеСвертки.СуммаПассивный * ВЫБОР
	        |		КОГДА ДанныеСвертки.ОтрицательныйОстатокПассивный
	        |			ТОГДА -1
	        |		ИНАЧЕ 1
	        |	КОНЕЦ,
	        |	ДанныеСвертки.ВалютнаяСуммаПассивный * ВЫБОР
	        |		КОГДА ДанныеСвертки.ОтрицательныйОстатокПассивный
	        |			ТОГДА -1
	        |		ИНАЧЕ 1
	        |	КОНЕЦ,
	        |	ДанныеСвертки.СуммаНУПассивный * ВЫБОР
	        |		КОГДА ДанныеСвертки.ОтрицательныйОстатокПассивный
	        |			ТОГДА -1
	        |		ИНАЧЕ 1
	        |	КОНЕЦ,
	        |	ДанныеСвертки.СуммаПРПассивный * ВЫБОР
	        |		КОГДА ДанныеСвертки.ОтрицательныйОстатокПассивный
	        |			ТОГДА -1
	        |		ИНАЧЕ 1
	        |	КОНЕЦ,
	        |	ДанныеСвертки.СуммаВРПассивный * ВЫБОР
	        |		КОГДА ДанныеСвертки.ОтрицательныйОстатокПассивный
	        |			ТОГДА -1
	        |		ИНАЧЕ 1
	        |	КОНЕЦ,
	        |	&Содержание,
	        |	NULL,
	        |	NULL,
	        |	NULL,
	        |	NULL
	        |ИЗ
	        |	СчетаУчета КАК СчетаУчета
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеСвертки КАК ДанныеСвертки
	        |		ПО СчетаУчета.ЛицевойСчетДт = ДанныеСвертки.ЛицевойСчетПассивный
	        |			И СчетаУчета.ЛицевойСчетКт = ДанныеСвертки.ЛицевойСчетАктивный
	        |ГДЕ
	        |	(ДанныеСвертки.СуммаПассивный <> 0
	        |			ИЛИ ДанныеСвертки.СуммаНУПассивный <> 0
	        |			ИЛИ ДанныеСвертки.СуммаПРПассивный <> 0
	        |			ИЛИ ДанныеСвертки.СуммаВРПассивный <> 0)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВрТ_Итог.ЛицевойСчетДт КАК ЛицевойСчетДт,
	        |	ВрТ_Итог.ЛицевойСчетКт КАК ЛицевойСчетКт,
	        |	ВрТ_Итог.СчетУчетаДт КАК СчетУчетаДт,
	        |	ВрТ_Итог.СчетУчетаКт КАК СчетУчетаКт,
	        |	ВрТ_Итог.Валюта КАК Валюта,
	        |	ВрТ_Итог.Подразделение КАК Подразделение,
	        |	ВрТ_Итог.Субконто1 КАК СубконтоДт1,
	        |	ВрТ_Итог.Субконто2 КАК СубконтоДт2,
	        |	ВрТ_Итог.Субконто3 КАК СубконтоДт3,
	        |	ВрТ_Итог.Субконто1 КАК СубконтоКт1,
	        |	ВрТ_Итог.Субконто2 КАК СубконтоКт2,
	        |	ВрТ_Итог.Субконто3 КАК СубконтоКт3,
	        |	ВрТ_Итог.Сумма КАК Сумма,
	        |	ВрТ_Итог.ВалютнаяСумма КАК ВалютнаяСумма,
	        |	ВрТ_Итог.СуммаНУ КАК СуммаНУ,
	        |	ВрТ_Итог.СуммаПР КАК СуммаПР,
	        |	ВрТ_Итог.СуммаВР КАК СуммаВР,
	        |	ВрТ_Итог.Содержание КАК Содержание,
	        |	ВрТ_Итог.ЛицевойСчетАктивный КАК ЛицевойСчетАктивный,
	        |	ВрТ_Итог.ЛицевойСчетПассивный КАК ЛицевойСчетПассивный,
	        |	ВрТ_Итог.СчетУчетаАктивный КАК СчетУчетаАктивный,
	        |	ВрТ_Итог.СчетУчетаПассивный КАК СчетУчетаПассивный
	        |ИЗ
	        |	ВрТ_Итог КАК ВрТ_Итог
	        |ГДЕ
	        |	НЕ ВрТ_Итог.ЛицевойСчетПассивный ЕСТЬ NULL
	        |	И НЕ ВрТ_Итог.ЛицевойСчетАктивный ЕСТЬ NULL";
	
	 //Возврат "ВЫБРАТЬ
	 //        |	ЕПСПарныеСчетаУчета.СчетАктивный КАК СчетАктивный,
	 //        |	ЕПСПарныеСчетаУчета.СчетПассивный КАК СчетПассивный
	 //        |ПОМЕСТИТЬ ПарныеСчетаУчета
	 //        |ИЗ
	 //        |	РегистрСведений.ЕПСПарныеСчетаУчета КАК ЕПСПарныеСчетаУчета
	 //        |ГДЕ
	 //        |	ЕПСПарныеСчетаУчета.СчетАктивный = &СчетАктивный
	 //        |;
	 //        |
	 //        |////////////////////////////////////////////////////////////////////////////////
	 //        |ВЫБРАТЬ
	 //        |	ЕПСПарныеЛицевыеСчета.СчетАктивный КАК ЛицевойСчетАктивный,
	 //        |	ЕПСПарныеЛицевыеСчета.СчетПассивный КАК ЛицевойСчетПассивный
	 //        |ПОМЕСТИТЬ ПарныеЛицевыеСчета
	 //        |ИЗ
	 //        |	РегистрСведений.ЕПСПарныеЛицевыеСчета КАК ЕПСПарныеЛицевыеСчета
	 //        |ГДЕ
	 //        |	ЕПСПарныеЛицевыеСчета.Организация = &Организация
	 //        |	И ЕПСПарныеЛицевыеСчета.СчетАктивный.Владелец В
	 //        |			(ВЫБРАТЬ
	 //        |				ПарныеСчетаУчета.СчетАктивный
	 //        |			ИЗ
	 //        |				ПарныеСчетаУчета КАК ПарныеСчетаУчета)
	 //        |	И ЕПСПарныеЛицевыеСчета.СчетПассивный.Владелец В
	 //        |			(ВЫБРАТЬ
	 //        |				ПарныеСчетаУчета.СчетПассивный
	 //        |			ИЗ
	 //        |				ПарныеСчетаУчета КАК ПарныеСчетаУчета)
	 //        |;
	 //        |
	 //        |////////////////////////////////////////////////////////////////////////////////
	 //        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	 //        |	ЛицевыеСчета.ЛицевойСчет КАК ЛицевойСчет,
	 //        |	ВЫРАЗИТЬ(ЛицевыеСчета.ЛицевойСчет КАК Справочник.ЕПСЛицевыеСчета).Владелец КАК ЛицевойСчетВладелец
	 //        |ПОМЕСТИТЬ РазличныеПарныеЛицевыеСчета
	 //        |ИЗ
	 //        |	(ВЫБРАТЬ
	 //        |		ПарныеЛицевыеСчета.ЛицевойСчетАктивный КАК ЛицевойСчет
	 //        |	ИЗ
	 //        |		ПарныеЛицевыеСчета КАК ПарныеЛицевыеСчета
	 //        |	
	 //        |	ОБЪЕДИНИТЬ ВСЕ
	 //        |	
	 //        |	ВЫБРАТЬ
	 //        |		ПарныеЛицевыеСчета.ЛицевойСчетПассивный
	 //        |	ИЗ
	 //        |		ПарныеЛицевыеСчета КАК ПарныеЛицевыеСчета) КАК ЛицевыеСчета
	 //        |;
	 //        |
	 //        |////////////////////////////////////////////////////////////////////////////////
	 //        |ВЫБРАТЬ
	 //        |	ЕПСОстатки.ЛицевойСчет КАК ЛицевойСчет,
	 //        |	ЕПСОстатки.Субконто1 КАК Субконто1,
	 //        |	ЕПСОстатки.Субконто2 КАК Субконто2,
	 //        |	ЕПСОстатки.Субконто3 КАК Субконто3,
	 //        |	ЕПСОстатки.Валюта КАК Валюта,
	 //        |	ЕПСОстатки.СуммаОстаток * ВЫБОР
	 //        |		КОГДА ЕПСОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	 //        |			ТОГДА -1
	 //        |		ИНАЧЕ 1
	 //        |	КОНЕЦ КАК СуммаОстаток,
	 //        |	ЕСТЬNULL(ЕПСОстатки.СуммаНУОстаток, 0) * ВЫБОР
	 //        |		КОГДА ЕПСОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	 //        |			ТОГДА -1
	 //        |		ИНАЧЕ 1
	 //        |	КОНЕЦ КАК СуммаНУОстаток,
	 //        |	ЕСТЬNULL(ЕПСОстатки.СуммаПРОстаток, 0) * ВЫБОР
	 //        |		КОГДА ЕПСОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	 //        |			ТОГДА -1
	 //        |		ИНАЧЕ 1
	 //        |	КОНЕЦ КАК СуммаПРОстаток,
	 //        |	ЕСТЬNULL(ЕПСОстатки.СуммаВРОстаток, 0) * ВЫБОР
	 //        |		КОГДА ЕПСОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	 //        |			ТОГДА -1
	 //        |		ИНАЧЕ 1
	 //        |	КОНЕЦ КАК СуммаВРОстаток,
	 //        |	ЕСТЬNULL(ЕПСОстатки.ВалютнаяСуммаОстаток, 0) * ВЫБОР
	 //        |		КОГДА ЕПСОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	 //        |			ТОГДА -1
	 //        |		ИНАЧЕ 1
	 //        |	КОНЕЦ КАК ВалютнаяСуммаОстаток,
	 //        |	ЕПСОстатки.Подразделение КАК Подразделение
	 //        |ПОМЕСТИТЬ ДанныеРегистра
	 //        |ИЗ
	 //        |	РегистрБухгалтерии.ЕПС.Остатки(
	 //        |			&Период,
	 //        |			Счет В
	 //        |				(ВЫБРАТЬ
	 //        |					РазличныеПарныеЛицевыеСчета.ЛицевойСчетВладелец
	 //        |				ИЗ
	 //        |					РазличныеПарныеЛицевыеСчета КАК РазличныеПарныеЛицевыеСчета),
	 //        |			,
	 //        |			Организация = &Организация
	 //        |				И ЛицевойСчет В
	 //        |					(ВЫБРАТЬ
	 //        |						РазличныеПарныеЛицевыеСчета.ЛицевойСчет
	 //        |					ИЗ
	 //        |						РазличныеПарныеЛицевыеСчета КАК РазличныеПарныеЛицевыеСчета)) КАК ЕПСОстатки
	 //        |;
	 //        |
	 //        |////////////////////////////////////////////////////////////////////////////////
	 //        |ВЫБРАТЬ
	 //        |	ВложенныйЗапрос.ЛицевойСчетАктивный КАК ЛицевойСчетАктивный,
	 //        |	ВложенныйЗапрос.ЛицевойСчетПассивный КАК ЛицевойСчетПассивный,
	 //        |	ВложенныйЗапрос.Субконто1 КАК Субконто1,
	 //        |	ВложенныйЗапрос.Субконто2 КАК Субконто2,
	 //        |	ВложенныйЗапрос.Субконто3 КАК Субконто3,
	 //        |	ВложенныйЗапрос.Валюта КАК Валюта,
	 //        |	ВложенныйЗапрос.Подразделение КАК Подразделение,
	 //        |	СУММА(ВложенныйЗапрос.СуммаАктивный) КАК СуммаАктивный,
	 //        |	СУММА(ВложенныйЗапрос.СуммаНУАктивный) КАК СуммаНУАктивный,
	 //        |	СУММА(ВложенныйЗапрос.СуммаПРАктивный) КАК СуммаПРАктивный,
	 //        |	СУММА(ВложенныйЗапрос.СуммаВРАктивный) КАК СуммаВРАктивный,
	 //        |	СУММА(ВложенныйЗапрос.ВалютнаяСуммаАктивный) КАК ВалютнаяСуммаАктивный,
	 //        |	СУММА(ВложенныйЗапрос.СуммаПассивный) КАК СуммаПассивный,
	 //        |	СУММА(ВложенныйЗапрос.СуммаНУПассивный) КАК СуммаНУПассивный,
	 //        |	СУММА(ВложенныйЗапрос.СуммаПРПассивный) КАК СуммаПРПассивный,
	 //        |	СУММА(ВложенныйЗапрос.СуммаВРПассивный) КАК СуммаВРПассивный,
	 //        |	СУММА(ВложенныйЗапрос.ВалютнаяСуммаПассивный) КАК ВалютнаяСуммаПассивный,
	 //        |	ВЫБОР
	 //        |		КОГДА СУММА(ВложенныйЗапрос.СуммаАктивный) <> 0
	 //        |			ТОГДА СУММА(ВложенныйЗапрос.СуммаАктивный) < 0
	 //        |		КОГДА СУММА(ВложенныйЗапрос.СуммаНУАктивный) <> 0
	 //        |			ТОГДА СУММА(ВложенныйЗапрос.СуммаНУАктивный) < 0
	 //        |		КОГДА СУММА(ВложенныйЗапрос.СуммаПРАктивный) <> 0
	 //        |			ТОГДА СУММА(ВложенныйЗапрос.СуммаПРАктивный) < 0
	 //        |		КОГДА СУММА(ВложенныйЗапрос.СуммаВРАктивный) <> 0
	 //        |			ТОГДА СУММА(ВложенныйЗапрос.СуммаВРАктивный) < 0
	 //        |		ИНАЧЕ ЛОЖЬ
	 //        |	КОНЕЦ КАК ОтрицательныйОстатокАктивный,
	 //        |	ВЫБОР
	 //        |		КОГДА СУММА(ВложенныйЗапрос.СуммаПассивный) <> 0
	 //        |			ТОГДА СУММА(ВложенныйЗапрос.СуммаПассивный) < 0
	 //        |		КОГДА СУММА(ВложенныйЗапрос.СуммаНУПассивный) <> 0
	 //        |			ТОГДА СУММА(ВложенныйЗапрос.СуммаНУПассивный) < 0
	 //        |		КОГДА СУММА(ВложенныйЗапрос.СуммаПРПассивный) <> 0
	 //        |			ТОГДА СУММА(ВложенныйЗапрос.СуммаПРПассивный) < 0
	 //        |		КОГДА СУММА(ВложенныйЗапрос.СуммаВРПассивный) <> 0
	 //        |			ТОГДА СУММА(ВложенныйЗапрос.СуммаВРПассивный) < 0
	 //        |		ИНАЧЕ ЛОЖЬ
	 //        |	КОНЕЦ КАК ОтрицательныйОстатокПассивный
	 //        |ПОМЕСТИТЬ ДанныеСвертки
	 //        |ИЗ
	 //        |	(ВЫБРАТЬ
	 //        |		ПарныеЛицевыеСчета.ЛицевойСчетАктивный КАК ЛицевойСчетАктивный,
	 //        |		ПарныеЛицевыеСчета.ЛицевойСчетПассивный КАК ЛицевойСчетПассивный,
	 //        |		ДанныеРегистра.Субконто1 КАК Субконто1,
	 //        |		ДанныеРегистра.Субконто2 КАК Субконто2,
	 //        |		ДанныеРегистра.Субконто3 КАК Субконто3,
	 //        |		ДанныеРегистра.Валюта КАК Валюта,
	 //        |		ДанныеРегистра.Подразделение КАК Подразделение,
	 //        |		ДанныеРегистра.СуммаОстаток КАК СуммаАктивный,
	 //        |		ДанныеРегистра.СуммаНУОстаток КАК СуммаНУАктивный,
	 //        |		ДанныеРегистра.СуммаПРОстаток КАК СуммаПРАктивный,
	 //        |		ДанныеРегистра.СуммаВРОстаток КАК СуммаВРАктивный,
	 //        |		ДанныеРегистра.ВалютнаяСуммаОстаток КАК ВалютнаяСуммаАктивный,
	 //        |		0 КАК СуммаПассивный,
	 //        |		0 КАК СуммаНУПассивный,
	 //        |		0 КАК СуммаПРПассивный,
	 //        |		0 КАК СуммаВРПассивный,
	 //        |		0 КАК ВалютнаяСуммаПассивный
	 //        |	ИЗ
	 //        |		ПарныеЛицевыеСчета КАК ПарныеЛицевыеСчета
	 //        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеРегистра КАК ДанныеРегистра
	 //        |			ПО ПарныеЛицевыеСчета.ЛицевойСчетАктивный = ДанныеРегистра.ЛицевойСчет
	 //        |	
	 //        |	ОБЪЕДИНИТЬ ВСЕ
	 //        |	
	 //        |	ВЫБРАТЬ
	 //        |		ПарныеЛицевыеСчета.ЛицевойСчетАктивный,
	 //        |		ПарныеЛицевыеСчета.ЛицевойСчетПассивный,
	 //        |		ДанныеРегистра.Субконто1,
	 //        |		ДанныеРегистра.Субконто2,
	 //        |		ДанныеРегистра.Субконто3,
	 //        |		ДанныеРегистра.Валюта,
	 //        |		ДанныеРегистра.Подразделение,
	 //        |		0,
	 //        |		0,
	 //        |		0,
	 //        |		0,
	 //        |		0,
	 //        |		ДанныеРегистра.СуммаОстаток,
	 //        |		ДанныеРегистра.СуммаНУОстаток,
	 //        |		ДанныеРегистра.СуммаПРОстаток,
	 //        |		ДанныеРегистра.СуммаВРОстаток,
	 //        |		ДанныеРегистра.ВалютнаяСуммаОстаток
	 //        |	ИЗ
	 //        |		ПарныеЛицевыеСчета КАК ПарныеЛицевыеСчета
	 //        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеРегистра КАК ДанныеРегистра
	 //        |			ПО ПарныеЛицевыеСчета.ЛицевойСчетПассивный = ДанныеРегистра.ЛицевойСчет) КАК ВложенныйЗапрос
	 //        |
	 //        |СГРУППИРОВАТЬ ПО
	 //        |	ВложенныйЗапрос.Валюта,
	 //        |	ВложенныйЗапрос.Субконто1,
	 //        |	ВложенныйЗапрос.Субконто2,
	 //        |	ВложенныйЗапрос.ЛицевойСчетПассивный,
	 //        |	ВложенныйЗапрос.Субконто3,
	 //        |	ВложенныйЗапрос.ЛицевойСчетАктивный,
	 //        |	ВложенныйЗапрос.Подразделение
	 //        |
	 //        |ИНДЕКСИРОВАТЬ ПО
	 //        |	ЛицевойСчетАктивный,
	 //        |	ЛицевойСчетПассивный
	 //        |;
	 //        |
	 //        |////////////////////////////////////////////////////////////////////////////////
	 //        |ВЫБРАТЬ
	 //        |	ОстаткиПоПарнымСчетам.ЛицевойСчетПассивный КАК ЛицевойСчетДт,
	 //        |	ОстаткиПоПарнымСчетам.ЛицевойСчетАктивный КАК ЛицевойСчетКт,
	 //        |	ВЫБОР
	 //        |		КОГДА ОстаткиПоПарнымСчетам.СуммаПассивный <> ОстаткиПоПарнымСчетам.СуммаАктивный
	 //        |			ТОГДА ОстаткиПоПарнымСчетам.СуммаПассивный > ОстаткиПоПарнымСчетам.СуммаАктивный
	 //        |		КОГДА ОстаткиПоПарнымСчетам.СуммаНУПассивный <> ОстаткиПоПарнымСчетам.СуммаНУАктивный
	 //        |			ТОГДА ОстаткиПоПарнымСчетам.СуммаНУПассивный > ОстаткиПоПарнымСчетам.СуммаНУАктивный
	 //        |		КОГДА ОстаткиПоПарнымСчетам.СуммаПРПассивный <> ОстаткиПоПарнымСчетам.СуммаПРАктивный
	 //        |			ТОГДА ОстаткиПоПарнымСчетам.СуммаПРПассивный > ОстаткиПоПарнымСчетам.СуммаПРАктивный
	 //        |		КОГДА ОстаткиПоПарнымСчетам.СуммаВРПассивный <> ОстаткиПоПарнымСчетам.СуммаВРАктивный
	 //        |			ТОГДА ОстаткиПоПарнымСчетам.СуммаВРПассивный > ОстаткиПоПарнымСчетам.СуммаВРАктивный
	 //        |		ИНАЧЕ ЛОЖЬ
	 //        |	КОНЕЦ КАК ОстатокНаПассивном
	 //        |ПОМЕСТИТЬ ЛицевыеСчетаПроводки
	 //        |ИЗ
	 //        |	(ВЫБРАТЬ
	 //        |		ДанныеСвертки.ЛицевойСчетАктивный КАК ЛицевойСчетАктивный,
	 //        |		ДанныеСвертки.ЛицевойСчетПассивный КАК ЛицевойСчетПассивный,
	 //        |		СУММА(ДанныеСвертки.СуммаАктивный) КАК СуммаАктивный,
	 //        |		СУММА(ДанныеСвертки.СуммаНУАктивный) КАК СуммаНУАктивный,
	 //        |		СУММА(ДанныеСвертки.СуммаПРАктивный) КАК СуммаПРАктивный,
	 //        |		СУММА(ДанныеСвертки.СуммаВРАктивный) КАК СуммаВРАктивный,
	 //        |		СУММА(ДанныеСвертки.СуммаПассивный) КАК СуммаПассивный,
	 //        |		СУММА(ДанныеСвертки.СуммаНУПассивный) КАК СуммаНУПассивный,
	 //        |		СУММА(ДанныеСвертки.СуммаПРПассивный) КАК СуммаПРПассивный,
	 //        |		СУММА(ДанныеСвертки.СуммаВРПассивный) КАК СуммаВРПассивный
	 //        |	ИЗ
	 //        |		ДанныеСвертки КАК ДанныеСвертки
	 //        |	
	 //        |	СГРУППИРОВАТЬ ПО
	 //        |		ДанныеСвертки.ЛицевойСчетПассивный,
	 //        |		ДанныеСвертки.ЛицевойСчетАктивный) КАК ОстаткиПоПарнымСчетам
	 //        |
	 //        |ИНДЕКСИРОВАТЬ ПО
	 //        |	ЛицевойСчетДт,
	 //        |	ЛицевойСчетКт
	 //        |;
	 //        |
	 //        |////////////////////////////////////////////////////////////////////////////////
	 //        |ВЫБРАТЬ
	 //        |	ЕПСЛицевыеСчета.ЛицевойСчетВладелец КАК СчетУчета,
	 //        |	ЕПСЛицевыеСчета.ЛицевойСчет КАК ЛицевойСчет,
	 //        |	ЕПСЛицевыеСчета.ЛицевойСчетВладелец.Валютный КАК ЛицевойСчетВладелецВалютный
	 //        |ПОМЕСТИТЬ СчетаУчетаБанковский
	 //        |ИЗ
	 //        |	РазличныеПарныеЛицевыеСчета КАК ЕПСЛицевыеСчета
	 //        |
	 //        |ИНДЕКСИРОВАТЬ ПО
	 //        |	ЛицевойСчет
	 //        |;
	 //        |
	 //        |////////////////////////////////////////////////////////////////////////////////
	 //        |ВЫБРАТЬ
	 //        |	ЛицевыеСчетаПроводки.ЛицевойСчетДт КАК ЛицевойСчетДт,
	 //        |	ЛицевыеСчетаПроводки.ЛицевойСчетКт КАК ЛицевойСчетКт,
	 //        |	СчетаУчетаБанковскийДт.СчетУчета КАК СчетУчетаДт,
	 //        |	СчетаУчетаБанковскийКт.СчетУчета КАК СчетУчетаКт,
	 //        |	ЛицевыеСчетаПроводки.ОстатокНаПассивном КАК ОстатокНаПассивном
	 //        |ПОМЕСТИТЬ СчетаУчета
	 //        |ИЗ
	 //        |	ЛицевыеСчетаПроводки КАК ЛицевыеСчетаПроводки
	 //        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СчетаУчетаБанковский КАК СчетаУчетаБанковскийДт
	 //        |		ПО ЛицевыеСчетаПроводки.ЛицевойСчетДт = СчетаУчетаБанковскийДт.ЛицевойСчет
	 //        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СчетаУчетаБанковский КАК СчетаУчетаБанковскийКт
	 //        |		ПО ЛицевыеСчетаПроводки.ЛицевойСчетКт = СчетаУчетаБанковскийКт.ЛицевойСчет
	 //        |;
	 //        |
	 //        |////////////////////////////////////////////////////////////////////////////////
	 //        |ВЫБРАТЬ
	 //        |	ВЫБОР
	 //        |		КОГДА ДанныеСвертки.ОтрицательныйОстатокАктивный
	 //        |			ТОГДА СчетаУчета.ЛицевойСчетКт
	 //        |		ИНАЧЕ СчетаУчета.ЛицевойСчетДт
	 //        |	КОНЕЦ КАК ЛицевойСчетДт,
	 //        |	ВЫБОР
	 //        |		КОГДА ДанныеСвертки.ОтрицательныйОстатокАктивный
	 //        |			ТОГДА СчетаУчета.ЛицевойСчетДт
	 //        |		ИНАЧЕ СчетаУчета.ЛицевойСчетКт
	 //        |	КОНЕЦ КАК ЛицевойСчетКт,
	 //        |	ВЫБОР
	 //        |		КОГДА ДанныеСвертки.ОтрицательныйОстатокАктивный
	 //        |			ТОГДА СчетаУчета.СчетУчетаКт
	 //        |		ИНАЧЕ СчетаУчета.СчетУчетаДт
	 //        |	КОНЕЦ КАК СчетУчетаДт,
	 //        |	ВЫБОР
	 //        |		КОГДА ДанныеСвертки.ОтрицательныйОстатокАктивный
	 //        |			ТОГДА СчетаУчета.СчетУчетаДт
	 //        |		ИНАЧЕ СчетаУчета.СчетУчетаКт
	 //        |	КОНЕЦ КАК СчетУчетаКт,
	 //        |	ДанныеСвертки.Валюта КАК Валюта,
	 //        |	ДанныеСвертки.Подразделение КАК Подразделение,
	 //        |	ДанныеСвертки.Субконто1 КАК Субконто1,
	 //        |	ДанныеСвертки.Субконто2 КАК Субконто2,
	 //        |	ДанныеСвертки.Субконто3 КАК Субконто3,
	 //        |	ДанныеСвертки.СуммаАктивный * ВЫБОР
	 //        |		КОГДА ДанныеСвертки.ОтрицательныйОстатокАктивный
	 //        |			ТОГДА -1
	 //        |		ИНАЧЕ 1
	 //        |	КОНЕЦ КАК Сумма,
	 //        |	ДанныеСвертки.ВалютнаяСуммаАктивный * ВЫБОР
	 //        |		КОГДА ДанныеСвертки.ОтрицательныйОстатокАктивный
	 //        |			ТОГДА -1
	 //        |		ИНАЧЕ 1
	 //        |	КОНЕЦ КАК ВалютнаяСумма,
	 //        |	ДанныеСвертки.СуммаНУАктивный * ВЫБОР
	 //        |		КОГДА ДанныеСвертки.ОтрицательныйОстатокАктивный
	 //        |			ТОГДА -1
	 //        |		ИНАЧЕ 1
	 //        |	КОНЕЦ КАК СуммаНУ,
	 //        |	ДанныеСвертки.СуммаПРАктивный * ВЫБОР
	 //        |		КОГДА ДанныеСвертки.ОтрицательныйОстатокАктивный
	 //        |			ТОГДА -1
	 //        |		ИНАЧЕ 1
	 //        |	КОНЕЦ КАК СуммаПР,
	 //        |	ДанныеСвертки.СуммаВРАктивный * ВЫБОР
	 //        |		КОГДА ДанныеСвертки.ОтрицательныйОстатокАктивный
	 //        |			ТОГДА -1
	 //        |		ИНАЧЕ 1
	 //        |	КОНЕЦ КАК СуммаВР,
	 //        |	&Содержание КАК Содержание,
	 //        |	ДанныеСвертки.ЛицевойСчетАктивный КАК ЛицевойСчетАктивный,
	 //        |	ДанныеСвертки.ЛицевойСчетПассивный КАК ЛицевойСчетПассивный,
	 //        |	ДанныеСвертки.ЛицевойСчетАктивный.Владелец КАК СчетУчетаАктивный,
	 //        |	ДанныеСвертки.ЛицевойСчетПассивный.Владелец КАК СчетУчетаПассивный
	 //        |ИЗ
	 //        |	СчетаУчета КАК СчетаУчета
	 //        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеСвертки КАК ДанныеСвертки
	 //        |		ПО СчетаУчета.ЛицевойСчетДт = ДанныеСвертки.ЛицевойСчетПассивный
	 //        |			И СчетаУчета.ЛицевойСчетКт = ДанныеСвертки.ЛицевойСчетАктивный
	 //        |ГДЕ
	 //        |	(ДанныеСвертки.СуммаАктивный <> 0
	 //        |			ИЛИ ДанныеСвертки.СуммаНУАктивный <> 0
	 //        |			ИЛИ ДанныеСвертки.СуммаПРАктивный <> 0
	 //        |			ИЛИ ДанныеСвертки.СуммаВРАктивный <> 0)
	 //        |
	 //        |ОБЪЕДИНИТЬ ВСЕ
	 //        |
	 //        |ВЫБРАТЬ
	 //        |	ВЫБОР
	 //        |		КОГДА ДанныеСвертки.ОтрицательныйОстатокПассивный
	 //        |			ТОГДА СчетаУчета.ЛицевойСчетКт
	 //        |		ИНАЧЕ СчетаУчета.ЛицевойСчетДт
	 //        |	КОНЕЦ,
	 //        |	ВЫБОР
	 //        |		КОГДА ДанныеСвертки.ОтрицательныйОстатокПассивный
	 //        |			ТОГДА СчетаУчета.ЛицевойСчетДт
	 //        |		ИНАЧЕ СчетаУчета.ЛицевойСчетКт
	 //        |	КОНЕЦ,
	 //        |	ВЫБОР
	 //        |		КОГДА ДанныеСвертки.ОтрицательныйОстатокПассивный
	 //        |			ТОГДА СчетаУчета.СчетУчетаКт
	 //        |		ИНАЧЕ СчетаУчета.СчетУчетаДт
	 //        |	КОНЕЦ,
	 //        |	ВЫБОР
	 //        |		КОГДА ДанныеСвертки.ОтрицательныйОстатокПассивный
	 //        |			ТОГДА СчетаУчета.СчетУчетаДт
	 //        |		ИНАЧЕ СчетаУчета.СчетУчетаКт
	 //        |	КОНЕЦ,
	 //        |	ДанныеСвертки.Валюта,
	 //        |	ДанныеСвертки.Подразделение,
	 //        |	ДанныеСвертки.Субконто1,
	 //        |	ДанныеСвертки.Субконто2,
	 //        |	ДанныеСвертки.Субконто3,
	 //        |	ДанныеСвертки.СуммаПассивный * ВЫБОР
	 //        |		КОГДА ДанныеСвертки.ОтрицательныйОстатокПассивный
	 //        |			ТОГДА -1
	 //        |		ИНАЧЕ 1
	 //        |	КОНЕЦ,
	 //        |	ДанныеСвертки.ВалютнаяСуммаПассивный * ВЫБОР
	 //        |		КОГДА ДанныеСвертки.ОтрицательныйОстатокПассивный
	 //        |			ТОГДА -1
	 //        |		ИНАЧЕ 1
	 //        |	КОНЕЦ,
	 //        |	ДанныеСвертки.СуммаНУПассивный * ВЫБОР
	 //        |		КОГДА ДанныеСвертки.ОтрицательныйОстатокПассивный
	 //        |			ТОГДА -1
	 //        |		ИНАЧЕ 1
	 //        |	КОНЕЦ,
	 //        |	ДанныеСвертки.СуммаПРПассивный * ВЫБОР
	 //        |		КОГДА ДанныеСвертки.ОтрицательныйОстатокПассивный
	 //        |			ТОГДА -1
	 //        |		ИНАЧЕ 1
	 //        |	КОНЕЦ,
	 //        |	ДанныеСвертки.СуммаВРПассивный * ВЫБОР
	 //        |		КОГДА ДанныеСвертки.ОтрицательныйОстатокПассивный
	 //        |			ТОГДА -1
	 //        |		ИНАЧЕ 1
	 //        |	КОНЕЦ,
	 //        |	&Содержание,
	 //        |	NULL,
	 //        |	NULL,
	 //        |	NULL,
	 //        |	NULL
	 //        |ИЗ
	 //        |	СчетаУчета КАК СчетаУчета
	 //        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеСвертки КАК ДанныеСвертки
	 //        |		ПО СчетаУчета.ЛицевойСчетДт = ДанныеСвертки.ЛицевойСчетПассивный
	 //        |			И СчетаУчета.ЛицевойСчетКт = ДанныеСвертки.ЛицевойСчетАктивный
	 //        |ГДЕ
	 //        |	(ДанныеСвертки.СуммаПассивный <> 0
	 //        |			ИЛИ ДанныеСвертки.СуммаНУПассивный <> 0
	 //        |			ИЛИ ДанныеСвертки.СуммаПРПассивный <> 0
	 //        |			ИЛИ ДанныеСвертки.СуммаВРПассивный <> 0)"

КонецФункции

Процедура СформироватьДвиженияНачислениеЗарплаты(Движения, Отказ, Организация, Знач ПериодРегистрации, ДанныеДляОтражения)
	
	Дополнять         = Ложь;
	Реквизиты         = Неопределено;
	Регистратор       = Движения.ЕПС.Отбор.Регистратор.Значение;
	
	ПериодРегистрации = ПолучитьПериодРегистрации(Регистратор, ПериодРегистрации);
	
	Если ДанныеДляОтражения.Свойство("НачисленнаяЗарплатаИВзносы") Тогда
		
		Параметры = ПодготовитьПараметрыПоОтражениюЗарплатыВУчете(ДанныеДляОтражения.НачисленнаяЗарплатаИВзносы, Организация, ПериодРегистрации, Регистратор);
		Реквизиты = Параметры.Реквизиты[0];
		ТаблицаЗаработнойПлаты = Параметры.ТаблицаЗаработнойПлаты;
		
		Если ТаблицаЗаработнойПлаты.Колонки.Найти("РегистрацияВНалоговомОргане") = Неопределено Тогда
			Массив = Новый Массив;
			Массив.Добавить(Тип("СправочникСсылка.РегистрацииВНалоговомОргане"));
			ТаблицаЗаработнойПлаты.Колонки.Добавить("РегистрацияВНалоговомОргане", Новый ОписаниеТипов(Массив, , ));
		КонецЕсли;
		
		РазвернутьТаблицуЗаработнойПлаты(ТаблицаЗаработнойПлаты);
		Дополнять = Истина;
		
	КонецЕсли;
	
	Если ДанныеДляОтражения.Свойство("НачисленныйНДФЛ") Тогда
		
		ПараметрыНДФЛ = ПодготовитьПараметрыПоОтражениюНДФЛВУчете(ДанныеДляОтражения.НачисленныйНДФЛ, Организация, ПериодРегистрации, Регистратор);
		ТаблицаНДФЛ	  = ПараметрыНДФЛ.ТаблицаНДФЛ;
		
		Если Реквизиты = Неопределено Тогда
			Реквизиты = ПараметрыНДФЛ.Реквизиты[0];
		КонецЕсли;
		
		ПроверитьЗаполненностьРегистрацииВНалоговомОргане(ТаблицаНДФЛ, Реквизиты, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		ТаблицаНДФЛ = ДополнитьТаблицуНДФЛАналитикойПоРегистрации(ТаблицаНДФЛ, Организация);
		
		Если Дополнять Тогда
			ТаблицаЗаработнойПлаты = ДополнитьТаблицуЗаработнойПлатыДаннымиПоНДФЛ(ТаблицаЗаработнойПлаты, ТаблицаНДФЛ, Организация, ПериодРегистрации, Регистратор);
		Иначе
			ТаблицаЗаработнойПлаты = ТаблицаНДФЛ;
			ТаблицаЗаработнойПлаты.Колонки.Добавить("ВидОперацииРасходовЗаСчетФСС", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОперацийПоЗарплате"));
			Дополнять = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	ОчиститьТаблицуЗаработнойПлаты(ТаблицаЗаработнойПлаты);
	
	ТаблицаЗаработнойПлаты = ДополнитьТаблицуЗарплатыАналитикойБухУчета(ТаблицаЗаработнойПлаты, Реквизиты);
	
	ПроверитьЗаполненностьСпособаОтраженияВУчете(ТаблицаЗаработнойПлаты, Реквизиты);
	
	СформироватьПроводкиПоОтражениюЗарплатыВУчете(ТаблицаЗаработнойПлаты, Реквизиты, Движения, Отказ);
		
КонецПроцедуры

Процедура СформироватьДвиженияДепонированиеЗарплаты(Движения, Отказ, Организация, Знач ПериодРегистрации, Депоненты)
	
	Регистратор            = Движения.ЕПС.Отбор.Регистратор.Значение;
	ПериодРегистрации      = ПолучитьПериодРегистрации(Регистратор, ПериодРегистрации);
	Параметры              = ПодготовитьПараметрыПоОтражениюДепонентовУчете(Депоненты, Организация, ПериодРегистрации, Регистратор);
	Реквизиты              = Параметры.Реквизиты[0];
	ТаблицаЗаработнойПлаты = Параметры.ТаблицаДепонирование;
	Дополнять 			   = Истина;
	
	ТаблицаЗаработнойПлаты = ДополнитьТаблицуДепонированияЗарплатыАналитикойБухУчета(ТаблицаЗаработнойПлаты, Реквизиты);
	
	ОсновноеПодразделение = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновноеПодразделениеОрганизации");
	// Чтобы не подставлять подразделение от другой организации
	Если ОсновноеПодразделение.Владелец <> Организация Тогда
		ОсновноеПодразделение = Неопределено;
	КонецЕсли;
	ТаблицаЗаработнойПлаты.ЗаполнитьЗначения(ОсновноеПодразделение, "Подразделение");
	Если Не УчетЗарплаты.ВестиУчетНачисленияЗаработнойПлатыВРазрезеПодразделений(Организация, ПериодРегистрации) Тогда
		ТаблицаЗаработнойПлаты.ЗаполнитьЗначения(ОсновноеПодразделение, "ПодразделениеУчетаНачислений");	
	КонецЕсли; 		
	// СК [07.10.2022] (доходы/расходы ЗП по подразделениям) - требуется, чтобы дальше не упало в ошибку в ПодготовитьТаблицуНачисленийУдержаний
	ТаблицаЗаработнойПлаты.Колонки.Добавить("ПодразделениеДоходовРасходов", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	// \   
	
	ПроверитьЗаполненностьСпособаОтраженияВУчете(ТаблицаЗаработнойПлаты, Реквизиты);
		
	СформироватьПроводкиПоОтражениюЗарплатыВУчете(ТаблицаЗаработнойПлаты, Реквизиты, Движения, Отказ);
		
КонецПроцедуры

Процедура РазвернутьТаблицуЗаработнойПлаты(ТаблицаЗаработнойПлаты)
	
	ВидыОпераций = Новый Соответствие;
	ВидыОпераций.Вставить("ПФРНакопительная",
		Перечисления.ВидыОперацийПоЗарплате.ПФРНакопительнаяЧасть);
	ВидыОпераций.Вставить("ПФРСтраховая",
		Перечисления.ВидыОперацийПоЗарплате.ПФРСтраховаяЧасть);
	ВидыОпераций.Вставить("ПФРПоСуммарномуТарифу",
		Перечисления.ВидыОперацийПоЗарплате.ПФРПоСуммарномуТарифу);
	ВидыОпераций.Вставить("ПФРДоПредельнойВеличины",
		Перечисления.ВидыОперацийПоЗарплате.ПФРДоПредельнойВеличины);
	ВидыОпераций.Вставить("ПФРСПревышения",
		Перечисления.ВидыОперацийПоЗарплате.ПФРСПревышения);
	ВидыОпераций.Вставить("ПФРНаДоплатуЛетчикам",
		Перечисления.ВидыОперацийПоЗарплате.ПФРДополнительныйТарифЛЭ);
	ВидыОпераций.Вставить("ПФРНаДоплатуШахтерам",
		Перечисления.ВидыОперацийПоЗарплате.ПФРДополнительныйТарифШахтеры);
	ВидыОпераций.Вставить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботах",
		Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах);
	ВидыОпераций.Вставить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах",
		Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах);
	ВидыОпераций.Вставить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки",
		Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки);
	ВидыОпераций.Вставить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка",
		Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка);
	ВидыОпераций.Вставить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки",
		Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки);
	ВидыОпераций.Вставить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка",
		Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка);
	ВидыОпераций.Вставить("ФСС",
		Перечисления.ВидыОперацийПоЗарплате.ФСС);
	ВидыОпераций.Вставить("ФССНесчастныеСлучаи",
		Перечисления.ВидыОперацийПоЗарплате.ФССНС);
	ВидыОпераций.Вставить("ФФОМС",
		Перечисления.ВидыОперацийПоЗарплате.ФФОМС);
	ВидыОпераций.Вставить("ТФОМС",
		Перечисления.ВидыОперацийПоЗарплате.ТФОМС);
	ВидыОпераций.Вставить("ВзносыПоЕдиномуТарифу",
		Перечисления.ВидыОперацийПоЗарплате.ВзносыПоЕдиномуТарифу);
		
	МассивОперацийРасходовЗаСчетФСС = Новый Массив;
	МассивОперацийРасходовЗаСчетФСС.Добавить(Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюФСС);
	
	МассивКолонок = Новый Массив;
	МассивКолонок.Добавить("ПФРНакопительная");
	МассивКолонок.Добавить("ПФРСтраховая");
	МассивКолонок.Добавить("ПФРПоСуммарномуТарифу");
	МассивКолонок.Добавить("ПФРДоПредельнойВеличины");
	МассивКолонок.Добавить("ПФРСПревышения");
	МассивКолонок.Добавить("ПФРНаДоплатуЛетчикам");
	МассивКолонок.Добавить("ПФРНаДоплатуШахтерам");
	МассивКолонок.Добавить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботах");
	МассивКолонок.Добавить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах");
	МассивКолонок.Добавить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки");
	МассивКолонок.Добавить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка");
	МассивКолонок.Добавить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки");
	МассивКолонок.Добавить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка");
	МассивКолонок.Добавить("ФСС");
	МассивКолонок.Добавить("ФССНесчастныеСлучаи");
	МассивКолонок.Добавить("ФФОМС");
	МассивКолонок.Добавить("ТФОМС");
	МассивКолонок.Добавить("ВзносыПоЕдиномуТарифу");

	КоличествоИндексовМассива = МассивКолонок.Количество() - 1;
	
	ТаблицаЗаработнойПлаты.Колонки.Добавить("ВидОперацииРасходовЗаСчетФСС", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОперацийПоЗарплате"));
	ТаблицаЗаработнойПлаты.Колонки.Добавить("ВедущийВидОперации", 			Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОперацийПоЗарплате"));
	
	ТаблицаНалоговСФОТ = ТаблицаЗаработнойПлаты.СкопироватьКолонки();

	Для Каждого СтрокаТаблицы Из ТаблицаЗаработнойПлаты Цикл
		
		СтрокаТаблицы.ВедущийВидОперации = СтрокаТаблицы.ВидОперации;
		
		Для ИндексМассива = 0 По КоличествоИндексовМассива Цикл
			
			Если СтрокаТаблицы[МассивКолонок[ИндексМассива]] <> 0 Тогда
				НоваяСтрока = ТаблицаНалоговСФОТ.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
				НоваяСтрока.Сумма = СтрокаТаблицы[МассивКолонок[ИндексМассива]];
				Если МассивОперацийРасходовЗаСчетФСС.Найти(НоваяСтрока.ВидОперации) <> Неопределено Тогда
					НоваяСтрока.ВидОперацииРасходовЗаСчетФСС = НоваяСтрока.ВидОперации;
				КонецЕсли;
				НоваяСтрока.ВидОперации = ВидыОпераций.Получить(МассивКолонок[ИндексМассива]);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;

	Для Каждого СтрокаТаблицы Из ТаблицаНалоговСФОТ Цикл
		
		НоваяСтрока = ТаблицаЗаработнойПлаты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		
	КонецЦикла;
	
	ТаблицаЗаработнойПлаты.Свернуть("ФизическоеЛицо, ВидОперации, Подразделение, ПодразделениеУчетаНачислений, ПодразделениеДоходовРасходов, 
									|СпособОтраженияЗарплатыВБухучете, СтатьяРасходов, ОблагаетсяЕНВД, 
									|ВидНачисленияОплатыТрудаДляНУ,
									|РегистрацияВНалоговомОргане,
									|ВидОперацииРасходовЗаСчетФСС,
									|ВедущийВидОперации, ДоговорКонтрагента", "Сумма"); // СС 05.10.2022 // СК [07.10.2022] (доходы/расходы ЗП по подразделениям) - добавила ПодразделениеДоходовРасходов
	
КонецПроцедуры

Процедура ОчиститьТаблицуЗаработнойПлаты(ТаблицаЗаработнойПлаты)
	
	Отбор = Новый Структура("Сумма", 0);
	МассивСтрок = ТаблицаЗаработнойПлаты.НайтиСтроки(Отбор);
	Для Каждого СтрокаМассива ИЗ МассивСтрок Цикл
		ТаблицаЗаработнойПлаты.Удалить(СтрокаМассива);
	КонецЦикла;
		
КонецПроцедуры

Функция ПодготовитьПараметрыПоОтражениюЗарплатыВУчете(ДанныеДляПроводок, Организация, ПериодРегистрации, Регистратор)
	
	Параметры = Новый Структура;
	
	// Подготовка таблицы шапки документа
	Реквизиты = Новый ТаблицаЗначений;
	
	Реквизиты.Колонки.Добавить("Организация");
	Реквизиты.Колонки.Добавить("Период");
	Реквизиты.Колонки.Добавить("Регистратор");
	
	НоваяСтрока             = Реквизиты.Добавить();
	НоваяСтрока.Организация = Организация;
	НоваяСтрока.Период      = ПериодРегистрации;
	НоваяСтрока.Регистратор = Регистратор;
	
	Параметры.Вставить("Реквизиты", Реквизиты);
		
	// Подготовка таблицы по заработной плате:
	СписокОбязательныхКолонок = ""
	+ "ФизическоеЛицо,"
	+ "ВидОперации,"
	+ "Подразделение,"
	+ "ПодразделениеУчетаНачислений,"
	+ "ПодразделениеДоходовРасходов,"
	+ "СпособОтраженияЗарплатыВБухучете,"
	+ "СтатьяРасходов,"
	+ "ОблагаетсяЕНВД,"	
	+ "ВидНачисленияОплатыТрудаДляНУ,"
	+ "ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,"
	+ "ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,"
	+ "ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки,"    
	+ "ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка,"       
	+ "ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки,"       
	+ "ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка,"          
	+ "ПФРНаДоплатуЛетчикам,"
	+ "ПФРНаДоплатуШахтерам,"
	+ "ПФРНакопительная,"
	+ "ПФРСтраховая,"
	+ "ПФРПоСуммарномуТарифу,"
	+ "ПФРДоПредельнойВеличины,"
	+ "ПФРСПревышения,"
	+ "ТФОМС,"
	+ "ФСС,"
	+ "ФССНесчастныеСлучаи,"
	+ "ФФОМС,"
	+ "ВзносыПоЕдиномуТарифу,"
	+ "Сумма,"
	+ "ДоговорКонтрагента" // СС 05.10.2022 // СК [07.10.2022] (доходы/расходы ЗП по подразделениям)
	;	
	Параметры.Вставить("ТаблицаЗаработнойПлаты", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ДанныеДляПроводок, СписокОбязательныхКолонок));

	Возврат Параметры;

КонецФункции

Функция ПодготовитьПараметрыПоОтражениюНДФЛВУчете(ДанныеДляПроводок, Организация, ПериодРегистрации, Регистратор)
	
	Параметры = Новый Структура;
	
	// Подготовка таблицы шапки документа
	Реквизиты = Новый ТаблицаЗначений;
	
	Реквизиты.Колонки.Добавить("Организация");
	Реквизиты.Колонки.Добавить("Период");
	Реквизиты.Колонки.Добавить("Регистратор");
	
	НоваяСтрока             = Реквизиты.Добавить();
	НоваяСтрока.Организация = Организация;
	НоваяСтрока.Период      = КонецМесяца(ПериодРегистрации);
	НоваяСтрока.Регистратор = Регистратор;
	
	Параметры.Вставить("Реквизиты", Реквизиты);
		
	// Подготовка таблицы по заработной плате:
	СписокОбязательныхКолонок = ""
	+ "ФизическоеЛицо,"
	+ "ВидОперации,"
	+ "КПП,"
	+ "КодНалоговогоОргана,"
	+ "КодПоОКАТО,"
	+ "КодПоОКТМО,"
	+ "РегистрацияВНалоговомОргане,"
	+ "СтатьяРасходов,"
	+ "Сумма,"
	+ "Подразделение,"
	+ "ПодразделениеУчетаНачислений,"
	+ "ДоговорКонтрагента"
	;	
	Параметры.Вставить("ТаблицаНДФЛ", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ДанныеДляПроводок, СписокОбязательныхКолонок));

	Возврат Параметры;

КонецФункции

Функция ПодготовитьПараметрыПоОтражениюДепонентовУчете(ДанныеДляПроводок, Организация, ПериодРегистрации, Регистратор)
	
	Параметры = Новый Структура;
	
	// Подготовка таблицы шапки документа
	Реквизиты = Новый ТаблицаЗначений;
	
	Реквизиты.Колонки.Добавить("Организация");
	Реквизиты.Колонки.Добавить("Период");
	Реквизиты.Колонки.Добавить("Регистратор");
	
	НоваяСтрока             = Реквизиты.Добавить();
	НоваяСтрока.Организация = Организация;
	НоваяСтрока.Период      = ПериодРегистрации;
	НоваяСтрока.Регистратор = Регистратор;
	
	Параметры.Вставить("Реквизиты", Реквизиты);
		
	// Подготовка таблицы по заработной плате:
	СписокОбязательныхКолонок = ""
	+ "ФизическоеЛицо,"
	+ "ВидОперации,"
	+ "СтатьяРасходов,"
	+ "Сумма,"
	+ "Подразделение,"
	+ "ПодразделениеУчетаНачислений,"
	+ "ЭтоМатериальнаяПомощь,"
	+ "ДоговорКонтрагента"
	;	
	Параметры.Вставить("ТаблицаДепонирование", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ДанныеДляПроводок, СписокОбязательныхКолонок));

	Возврат Параметры;

КонецФункции

Функция ДополнитьТаблицуЗаработнойПлатыДаннымиПоНДФЛ(НачисленнаяЗарплатаИВзносы, НачисленныйНДФЛ, Организация, ПериодРегистрации, Регистратор)
	
	ДополнятьТаблицуНДФЛ = Ложь;
	
	Если НачисленнаяЗарплатаИВзносы.Колонки.Найти("ВидОперацииРасходовЗаСчетФСС") = Неопределено Тогда
		НачисленнаяЗарплатаИВзносы.Колонки.Добавить("ВидОперацииРасходовЗаСчетФСС", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОперацийПоЗарплате"));
	КонецЕсли;
	
	Результат = НачисленныйНДФЛ;
	
	Для Каждого СтрокаРезультата Из Результат Цикл
		
		НоваяСтрока = НачисленнаяЗарплатаИВзносы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРезультата);
		
		Если Регистратор.Метаданные().Реквизиты.Найти("Подразделение") <> Неопределено Тогда
			НоваяСтрока.Подразделение = Регистратор.Подразделение;
		КонецЕсли;
		Если Регистратор.Метаданные().Реквизиты.Найти("ПодразделениеОрганизации") <> Неопределено Тогда
			НоваяСтрока.Подразделение = Регистратор.ПодразделениеОрганизации;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(НоваяСтрока.Подразделение) Тогда
			
			Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.БольничныйЛист") Или ТипЗнч(Регистратор) = Тип("ДокументСсылка.Отпуск") Тогда
				
				ТаблицаКадровыхДанных = КадровыйУчет.КадровыеДанныеСотрудников(
				Ложь,
				ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Регистратор.Сотрудник),
				"Подразделение",
				ПериодРегистрации);
				Если ТаблицаКадровыхДанных.Количество() Тогда
					НоваяСтрока.Подразделение = ТаблицаКадровыхДанных[0].Подразделение;	
				КонецЕсли; 
				
			ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.ОтражениеЗарплатыВБухучете") Тогда
				
				ОсновноеПодразделение = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновноеПодразделениеОрганизации");
				// Чтобы не подставлять подразделение от другой организации
				Если ЗначениеЗаполнено(ОсновноеПодразделение) И ОсновноеПодразделение.Владелец = Организация Тогда
					НоваяСтрока.Подразделение 					= ОсновноеПодразделение;
					НоваяСтрока.ПодразделениеУчетаНачислений 	= ОсновноеПодразделение;
					НоваяСтрока.ПодразделениеДоходовРасходов 	= ОсновноеПодразделение; // СК [07.10.2022] (доходы/расходы ЗП по подразделениям)
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Если ДополнятьТаблицуНДФЛ Тогда
		Для Каждого СтрокаРезультата Из НачисленныйНДФЛ Цикл
			Если СтрокаРезультата.Сумма <> 0 Тогда
				НоваяСтрока = НачисленнаяЗарплатаИВзносы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРезультата);
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
		
	Возврат НачисленнаяЗарплатаИВзносы;
	
КонецФункции

Функция ДополнитьТаблицуНДФЛАналитикойПоРегистрации(ТаблицаНДФЛ, Организация)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ТаблицаНДФЛ", ТаблицаНДФЛ);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ТаблицаНДФЛ.Сумма КАК Сумма,
	|	ТаблицаНДФЛ.ВидОперации КАК ВидОперации,
	|	ВЫРАЗИТЬ(ТаблицаНДФЛ.КПП КАК СТРОКА(9)) КАК КПП,
	|	ВЫРАЗИТЬ(ТаблицаНДФЛ.КодНалоговогоОргана КАК СТРОКА(4)) КАК КодНалоговогоОргана,
	|	ВЫРАЗИТЬ(ТаблицаНДФЛ.КодПоОКАТО КАК СТРОКА(11)) КАК КодПоОКАТО,
	|	ВЫРАЗИТЬ(ТаблицаНДФЛ.КодПоОКТМО КАК СТРОКА(11)) КАК КодПоОКТМО,
	|	ТаблицаНДФЛ.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ТаблицаНДФЛ.СтатьяРасходов КАК СтатьяРасходов,
	|	ТаблицаНДФЛ.Подразделение КАК Подразделение,
	|	ТаблицаНДФЛ.ПодразделениеУчетаНачислений КАК ПодразделениеУчетаНачислений,
	|	ТаблицаНДФЛ.ДоговорКонтрагента КАК ДоговорКонтрагента
	|ПОМЕСТИТЬ ВТ_ТаблицаНДФЛ
	|ИЗ
	|	&ТаблицаНДФЛ КАК ТаблицаНДФЛ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(РегистрацииВНалоговомОргане.Ссылка) КАК Ссылка,
	|	РегистрацииВНалоговомОргане.КПП КАК КПП,
	|	РегистрацииВНалоговомОргане.Код КАК КодНалоговогоОргана,
	|	РегистрацииВНалоговомОргане.КодПоОКАТО КАК КодПоОКАТО,
	|	РегистрацииВНалоговомОргане.КодПоОКТМО КАК КодПоОКТМО
	|ПОМЕСТИТЬ ВТ_РегистрацииВНалоговомОргане
	|ИЗ
	|	Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
	|ГДЕ
	|	(РегистрацииВНалоговомОргане.Владелец = &Организация
	|			ИЛИ РегистрацииВНалоговомОргане.Владелец.ГоловнаяОрганизация = &Организация)
	|	И НЕ РегистрацииВНалоговомОргане.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	РегистрацииВНалоговомОргане.КПП,
	|	РегистрацииВНалоговомОргане.Код,
	|	РегистрацииВНалоговомОргане.КодПоОКАТО,
	|	РегистрацииВНалоговомОргане.КодПоОКТМО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СУММА(ВТ_ТаблицаНДФЛ.Сумма) КАК Сумма,
	|	ВТ_ТаблицаНДФЛ.ВидОперации КАК ВидОперации,
	|	ВТ_ТаблицаНДФЛ.КПП КАК КПП,
	|	ВТ_ТаблицаНДФЛ.КодПоОКАТО КАК КодПоОКАТО,
	|	ВТ_ТаблицаНДФЛ.КодПоОКТМО КАК КодПоОКТМО,
	|	ВТ_РегистрацииВНалоговомОргане.Ссылка КАК РегистрацияВНалоговомОргане,
	|	ВТ_ТаблицаНДФЛ.СтатьяРасходов КАК СтатьяРасходов,
	|	ВТ_ТаблицаНДФЛ.Подразделение КАК Подразделение,
	|	ВТ_ТаблицаНДФЛ.ПодразделениеУчетаНачислений КАК ПодразделениеУчетаНачислений,
	|	ВТ_ТаблицаНДФЛ.ДоговорКонтрагента КАК ДоговорКонтрагента
	|ПОМЕСТИТЬ ВТ_ДополненныеДанные
	|ИЗ
	|	ВТ_ТаблицаНДФЛ КАК ВТ_ТаблицаНДФЛ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РегистрацииВНалоговомОргане КАК ВТ_РегистрацииВНалоговомОргане
	|		ПО ВТ_ТаблицаНДФЛ.КПП = ВТ_РегистрацииВНалоговомОргане.КПП
	|			И ВТ_ТаблицаНДФЛ.КодПоОКАТО = ВТ_РегистрацииВНалоговомОргане.КодПоОКАТО
	|			И ВТ_ТаблицаНДФЛ.КодПоОКТМО = ВТ_РегистрацииВНалоговомОргане.КодПоОКТМО
	|			И ВТ_ТаблицаНДФЛ.КодНалоговогоОргана = ВТ_РегистрацииВНалоговомОргане.КодНалоговогоОргана
	|ГДЕ
	|	ВТ_ТаблицаНДФЛ.РегистрацияВНалоговомОргане = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаНДФЛ.ФизическоеЛицо,
	|	ВТ_ТаблицаНДФЛ.КодПоОКАТО,
	|	ВТ_ТаблицаНДФЛ.КодПоОКТМО,
	|	ВТ_ТаблицаНДФЛ.ВидОперации,
	|	ВТ_ТаблицаНДФЛ.КПП,
	|	ВТ_ТаблицаНДФЛ.КодНалоговогоОргана,
	|	ВТ_РегистрацииВНалоговомОргане.Ссылка,
	|	ВТ_ТаблицаНДФЛ.СтатьяРасходов,
	|	ВТ_ТаблицаНДФЛ.Подразделение,
	|	ВТ_ТаблицаНДФЛ.ПодразделениеУчетаНачислений,
	|	ВТ_ТаблицаНДФЛ.ДоговорКонтрагента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТаблицаНДФЛ.ФизическоеЛицо,
	|	СУММА(ВТ_ТаблицаНДФЛ.Сумма),
	|	ВТ_ТаблицаНДФЛ.ВидОперации,
	|	ВТ_ТаблицаНДФЛ.КПП,
	|	ВТ_ТаблицаНДФЛ.КодПоОКАТО,
	|	ВТ_ТаблицаНДФЛ.КодПоОКТМО,
	|	ВТ_ТаблицаНДФЛ.РегистрацияВНалоговомОргане,
	|	ВТ_ТаблицаНДФЛ.СтатьяРасходов,
	|	ВТ_ТаблицаНДФЛ.Подразделение,
	|	ВТ_ТаблицаНДФЛ.ПодразделениеУчетаНачислений,
	|	ВТ_ТаблицаНДФЛ.ДоговорКонтрагента
	|ИЗ
	|	ВТ_ТаблицаНДФЛ КАК ВТ_ТаблицаНДФЛ
	|ГДЕ
	|	ВТ_ТаблицаНДФЛ.РегистрацияВНалоговомОргане <> ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаНДФЛ.ФизическоеЛицо,
	|	ВТ_ТаблицаНДФЛ.КодПоОКАТО,
	|	ВТ_ТаблицаНДФЛ.КодПоОКТМО,
	|	ВТ_ТаблицаНДФЛ.ВидОперации,
	|	ВТ_ТаблицаНДФЛ.КПП,
	|	ВТ_ТаблицаНДФЛ.КодНалоговогоОргана,
	|	ВТ_ТаблицаНДФЛ.РегистрацияВНалоговомОргане,
	|	ВТ_ТаблицаНДФЛ.СтатьяРасходов,
	|	ВТ_ТаблицаНДФЛ.Подразделение,
	|	ВТ_ТаблицаНДФЛ.ПодразделениеУчетаНачислений,
	|	ВТ_ТаблицаНДФЛ.ДоговорКонтрагента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДополненныеДанные.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СУММА(ВТ_ДополненныеДанные.Сумма) КАК Сумма,
	|	ВТ_ДополненныеДанные.ВидОперации КАК ВидОперации,
	|	ВТ_ДополненныеДанные.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ВТ_ДополненныеДанные.СтатьяРасходов КАК СтатьяРасходов,
	|	ВТ_ДополненныеДанные.Подразделение КАК Подразделение,
	|	ВТ_ДополненныеДанные.ПодразделениеУчетаНачислений КАК ПодразделениеУчетаНачислений,
	|	ВТ_ДополненныеДанные.ДоговорКонтрагента КАК ДоговорКонтрагента
	|ИЗ
	|	ВТ_ДополненныеДанные КАК ВТ_ДополненныеДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДополненныеДанные.ВидОперации,
	|	ВТ_ДополненныеДанные.ФизическоеЛицо,
	|	ВТ_ДополненныеДанные.РегистрацияВНалоговомОргане,
	|	ВТ_ДополненныеДанные.СтатьяРасходов,
	|	ВТ_ДополненныеДанные.Подразделение,
	|	ВТ_ДополненныеДанные.ПодразделениеУчетаНачислений,
	|	ВТ_ДополненныеДанные.ДоговорКонтрагента";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ДополнитьТаблицуЗарплатыАналитикойБухУчета(ТаблицаЗаработнойПлаты, Реквизиты)
	
	///////////////////////////////////////
	// Описание типов для дополнения таблиц
	
	Если ТаблицаЗаработнойПлаты.Колонки.Найти("ВидНачисленияОплатыТрудаДляНУ") = Неопределено Тогда
		ТаблицаЗаработнойПлаты.Колонки.Добавить("ВидНачисленияОплатыТрудаДляНУ", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыНачисленийОплатыТрудаДляНУ"));
	КонецЕсли;
	
	Если ТаблицаЗаработнойПлаты.Колонки.Найти("СпособОтраженияЗарплатыВБухУчете") = Неопределено Тогда
		ТаблицаЗаработнойПлаты.Колонки.Добавить("СпособОтраженияЗарплатыВБухУчете", Новый ОписаниеТипов("СправочникСсылка.СпособыОтраженияЗарплатыВБухУчете"));
	КонецЕсли;
	
	Если ТаблицаЗаработнойПлаты.Колонки.Найти("Подразделение") = Неопределено Тогда
		ТаблицаЗаработнойПлаты.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	КонецЕсли;
	
	// СК [07.10.2022] (доходы/расходы ЗП по подразделениям)
	Если ТаблицаЗаработнойПлаты.Колонки.Найти("ПодразделениеДоходовРасходов") = Неопределено Тогда
		ТаблицаЗаработнойПлаты.Колонки.Добавить("ПодразделениеДоходовРасходов", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	КонецЕсли;
	// \
	
	Если ТаблицаЗаработнойПлаты.Колонки.Найти("ПодразделениеУчетаНачислений") = Неопределено Тогда
		ТаблицаЗаработнойПлаты.Колонки.Добавить("ПодразделениеУчетаНачислений", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	КонецЕсли;
	
	Если ТаблицаЗаработнойПлаты.Колонки.Найти("ОблагаетсяЕНВД") = Неопределено Тогда
		ТаблицаЗаработнойПлаты.Колонки.Добавить("ОблагаетсяЕНВД", Новый ОписаниеТипов("Булево"));
	КонецЕсли;
	
	Если ТаблицаЗаработнойПлаты.Колонки.Найти("РегистрацияВНалоговомОргане") = Неопределено Тогда
		ТаблицаЗаработнойПлаты.Колонки.Добавить("РегистрацияВНалоговомОргане", Новый ОписаниеТипов("СправочникСсылка.РегистрацииВНалоговомОргане"));
	КонецЕсли;
	
	Если ТаблицаЗаработнойПлаты.Колонки.Найти("ВидОперацииРасходовЗаСчетФСС") = Неопределено Тогда
		ТаблицаЗаработнойПлаты.Колонки.Добавить("ВидОперацииРасходовЗаСчетФСС", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОперацийПоЗарплате"));
	КонецЕсли;
	
	Если ТаблицаЗаработнойПлаты.Колонки.Найти("ВедущийВидОперации") = Неопределено Тогда
		ТаблицаЗаработнойПлаты.Колонки.Добавить("ВедущийВидОперации", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОперацийПоЗарплате"));
		Для Каждого СтрокаТаблицы Из ТаблицаЗаработнойПлаты Цикл
			СтрокаТаблицы.ВедущийВидОперации = СтрокаТаблицы.ВидОперации;
		КонецЦикла;
	КонецЕсли;
		
	Если ТаблицаЗаработнойПлаты.Колонки.Найти("РасчетныйДокумент") = Неопределено Тогда
		ТаблицаЗаработнойПлаты.Колонки.Добавить("РасчетныйДокумент", Метаданные.РегистрыНакопления.РасходыПриУСН.Измерения.РасчетныйДокумент.Тип);
	КонецЕсли;
	
	Если ТаблицаЗаработнойПлаты.Колонки.Найти("ДоговорКонтрагента") = Неопределено Тогда
		ТаблицаЗаработнойПлаты.Колонки.Добавить("ДоговорКонтрагента", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	КонецЕсли;

	// Описание типов для дополнения таблиц
	///////////////////////////////////////
	
	МассивОпераций = Новый Массив;
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРНакопительнаяЧасть);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРСтраховаяЧасть);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРПоСуммарномуТарифу);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРДоПредельнойВеличины);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРСПревышения);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРДополнительныйТарифЛЭ);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРДополнительныйТарифШахтеры);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ФСС);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ФССНС);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ФФОМС);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ТФОМС);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ВзносыПоЕдиномуТарифу);

	МассивОперацийРасходовПоСтрахованию = Новый Массив;
	МассивОперацийРасходовПоСтрахованию.Добавить(Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюФСС);
	МассивОперацийРасходовПоСтрахованию.Добавить(Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюФССНС);
	МассивОперацийРасходовПоСтрахованию.Добавить(Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюБюджет);
	
	МассивОперацийНезарплатногоНДФЛ = Новый Массив;
	МассивОперацийНезарплатногоНДФЛ.Добавить(Перечисления.ВидыОперацийПоЗарплате.НДФЛДоначисленныйПоРезультатамПроверки);
	МассивОперацийНезарплатногоНДФЛ.Добавить(Перечисления.ВидыОперацийПоЗарплате.НДФЛДоходыКонтрагентов);
	МассивОперацийНезарплатногоНДФЛ.Добавить(Перечисления.ВидыОперацийПоЗарплате.НДФЛПередачаЗадолженностиВНалоговыйОрган);
	МассивОперацийНезарплатногоНДФЛ.Добавить(Перечисления.ВидыОперацийПоЗарплате.НДФЛРасчетыСБывшимиСотрудниками);
	МассивОперацийНезарплатногоНДФЛ.Добавить(Перечисления.ВидыОперацийПоЗарплате.НФДЛДивиденды);
	МассивОперацийНезарплатногоНДФЛ.Добавить(Перечисления.ВидыОперацийПоЗарплате.НФДЛДивидендыСотрудникам);
	МассивОперацийНезарплатногоНДФЛ.Добавить(Перечисления.ВидыОперацийПоЗарплате.НДФЛПрочиеРасчетыСПерсоналом);
	
	МассивСчетовУчетаНУ = Новый Массив;
	
	РасходыПоУплатеСтраховыхВзносов      = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПрочиеДоходыИРасходы.РасходыПоУплатеСтраховыхВзносов");	
	ПрочиеВнереализационныеДоходыРасходы = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПрочиеДоходыИРасходы.ПрочиеВнереализационныеДоходыРасходы");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("НачисленнаяЗарплатаИВзносы",           ТаблицаЗаработнойПлаты);
	Запрос.УстановитьПараметр("МассивСчетовУчетаНУ",                  МассивСчетовУчетаНУ);
	Запрос.УстановитьПараметр("МассивОпераций",                       МассивОпераций);
	Запрос.УстановитьПараметр("РасходыПоУплатеСтраховыхВзносов",      РасходыПоУплатеСтраховыхВзносов);
	Запрос.УстановитьПараметр("ПрочиеВнереализационныеДоходыРасходы", ПрочиеВнереализационныеДоходыРасходы);
	Запрос.УстановитьПараметр("МассивОперацийРасходовПоСтрахованию",  МассивОперацийРасходовПоСтрахованию);
	Запрос.УстановитьПараметр("МассивОперацийНезарплатногоНДФЛ",      МассивОперацийНезарплатногоНДФЛ);
	
	ТаблицаПорядокОтраженияЗарплатыВБухУчете = ПолучитьПорядокОтраженияЗарплаты(ПланыВидовХарактеристик.ЕПСПравилаОтраженияЗарплаты.Начисления, Реквизиты);
	Запрос.УстановитьПараметр("ПорядокОтраженияЗарплатыВБухУчете",      ТаблицаПорядокОтраженияЗарплатыВБухУчете);
	
	// СК [07.10.2022] (доходы/расходы ЗП по подразделениям) - добавила в запрос ПодразделениеДоходовРасходов
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачисленнаяЗарплатаИВзносы.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НачисленнаяЗарплатаИВзносы.Сумма КАК Сумма,
	|	НачисленнаяЗарплатаИВзносы.ВидОперации КАК ВидОперации,
	|	НачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ КАК ВидНачисленияОплатыТрудаДляНУ,
	|	НачисленнаяЗарплатаИВзносы.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
	|	НачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухУчете КАК СпособОтраженияЗарплатыВБухУчете,
	|	НачисленнаяЗарплатаИВзносы.Подразделение КАК Подразделение,
	|	НачисленнаяЗарплатаИВзносы.ПодразделениеУчетаНачислений КАК ПодразделениеУчетаНачислений,
	|	НачисленнаяЗарплатаИВзносы.ПодразделениеДоходовРасходов КАК ПодразделениеДоходовРасходов,
	|	НачисленнаяЗарплатаИВзносы.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	НачисленнаяЗарплатаИВзносы.ВидОперацииРасходовЗаСчетФСС КАК ВидОперацииРасходовЗаСчетФСС,
	|	НачисленнаяЗарплатаИВзносы.ВедущийВидОперации КАК ВедущийВидОперации,
	|	НачисленнаяЗарплатаИВзносы.РасчетныйДокумент КАК РасчетныйДокумент,
	|	НачисленнаяЗарплатаИВзносы.СтатьяРасходов КАК СтатьяРасходов,
	|	НачисленнаяЗарплатаИВзносы.ДоговорКонтрагента КАК ДоговорКонтрагента
	|ПОМЕСТИТЬ ВТ_НачисленнаяЗарплатаИВзносы
	|ИЗ
	|	&НачисленнаяЗарплатаИВзносы КАК НачисленнаяЗарплатаИВзносы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПорядокОтраженияЗарплатыВБухУчете.СпособОтраженияЗарплатыВБухУчете КАК СпособОтраженияЗарплатыВБухУчете,
	|	ПорядокОтраженияЗарплатыВБухУчете.Счет КАК Счет,
	|	ПорядокОтраженияЗарплатыВБухУчете.Субконто1 КАК Субконто1,
	|	ПорядокОтраженияЗарплатыВБухУчете.Субконто2 КАК Субконто2,
	|	ПорядокОтраженияЗарплатыВБухУчете.Субконто3 КАК Субконто3,
	|	ПорядокОтраженияЗарплатыВБухУчете.СчетНУ КАК СчетНУ,
	|	ПорядокОтраженияЗарплатыВБухУчете.СубконтоНУ1 КАК СубконтоНУ1,
	|	ПорядокОтраженияЗарплатыВБухУчете.СубконтоНУ2 КАК СубконтоНУ2,
	|	ПорядокОтраженияЗарплатыВБухУчете.СубконтоНУ3 КАК СубконтоНУ3,
	|	ПорядокОтраженияЗарплатыВБухУчете.ЕНВД КАК ЕНВД
	|ПОМЕСТИТЬ ПорядокОтраженияЗарплатыВБухУчете
	|ИЗ
	|	&ПорядокОтраженияЗарплатыВБухУчете КАК ПорядокОтраженияЗарплатыВБухУчете
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НачисленнаяЗарплатаИВзносы.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТ_НачисленнаяЗарплатаИВзносы.Сумма КАК Сумма,
	|	ВТ_НачисленнаяЗарплатаИВзносы.ВидОперации КАК ВидОперации,
	|	ВТ_НачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ КАК ВидНачисленияОплатыТрудаДляНУ,
	|	ВТ_НачисленнаяЗарплатаИВзносы.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
	|	ВТ_НачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухУчете КАК СпособОтраженияЗарплатыВБухУчете,
	|	ВТ_НачисленнаяЗарплатаИВзносы.Подразделение КАК Подразделение,
	|	ВТ_НачисленнаяЗарплатаИВзносы.ПодразделениеУчетаНачислений КАК ПодразделениеУчетаНачислений,
	|	ВТ_НачисленнаяЗарплатаИВзносы.ПодразделениеДоходовРасходов КАК ПодразделениеДоходовРасходов,
	|	ВТ_НачисленнаяЗарплатаИВзносы.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ПорядокОтраженияЗарплатыВБухУчете.Счет КАК Счет,
	|	ПорядокОтраженияЗарплатыВБухУчете.Субконто1 КАК Субконто1,
	|	ПорядокОтраженияЗарплатыВБухУчете.Субконто2 КАК Субконто2,
	|	ПорядокОтраженияЗарплатыВБухУчете.Субконто3 КАК Субконто3,
	|	ВЫБОР
	|		КОГДА ВТ_НачисленнаяЗарплатаИВзносы.ВидОперации В (&МассивОпераций)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_НачисленнаяЗарплатаИВзносы.ОблагаетсяЕНВД
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)
	|					КОГДА НЕ ПорядокОтраженияЗарплатыВБухУчете.Счет В (&МассивСчетовУчетаНУ)
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)
	|					ИНАЧЕ ПорядокОтраженияЗарплатыВБухУчете.СчетНУ
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)
	|	КОНЕЦ КАК СчетНУ,
	|	ВЫБОР
	|		КОГДА ВТ_НачисленнаяЗарплатаИВзносы.ВидОперации В (&МассивОпераций)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_НачисленнаяЗарплатаИВзносы.ОблагаетсяЕНВД
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)
	|					КОГДА НЕ ПорядокОтраженияЗарплатыВБухУчете.Счет В (&МассивСчетовУчетаНУ)
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)
	|					ИНАЧЕ ПорядокОтраженияЗарплатыВБухУчете.СубконтоНУ1
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)
	|	КОНЕЦ КАК СубконтоНУ1,
	|	ВЫБОР
	|		КОГДА ВТ_НачисленнаяЗарплатаИВзносы.ВидОперации В (&МассивОпераций)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_НачисленнаяЗарплатаИВзносы.ОблагаетсяЕНВД
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)
	|					КОГДА НЕ ПорядокОтраженияЗарплатыВБухУчете.Счет В (&МассивСчетовУчетаНУ)
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)
	|					ИНАЧЕ ПорядокОтраженияЗарплатыВБухУчете.СубконтоНУ2
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)
	|	КОНЕЦ КАК СубконтоНУ2,
	|	ВЫБОР
	|		КОГДА ВТ_НачисленнаяЗарплатаИВзносы.ВидОперации В (&МассивОпераций)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_НачисленнаяЗарплатаИВзносы.ОблагаетсяЕНВД
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)
	|					КОГДА НЕ ПорядокОтраженияЗарплатыВБухУчете.Счет В (&МассивСчетовУчетаНУ)
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)
	|					ИНАЧЕ ПорядокОтраженияЗарплатыВБухУчете.СубконтоНУ3
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)
	|	КОНЕЦ КАК СубконтоНУ3,
	|	ВТ_НачисленнаяЗарплатаИВзносы.ВидОперацииРасходовЗаСчетФСС КАК ВидОперацииРасходовЗаСчетФСС,
	|	ВТ_НачисленнаяЗарплатаИВзносы.ВедущийВидОперации КАК ВедущийВидОперации,
	|	ВТ_НачисленнаяЗарплатаИВзносы.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ВТ_НачисленнаяЗарплатаИВзносы.СтатьяРасходов КАК СтатьяРасходов,
	|	ВТ_НачисленнаяЗарплатаИВзносы.ДоговорКонтрагента КАК ДоговорКонтрагента
	|ПОМЕСТИТЬ ВТ_ТаблицаСПроводками
	|ИЗ
	|	ВТ_НачисленнаяЗарплатаИВзносы КАК ВТ_НачисленнаяЗарплатаИВзносы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокОтраженияЗарплатыВБухУчете КАК ПорядокОтраженияЗарплатыВБухУчете
	|		ПО ВТ_НачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухУчете = ПорядокОтраженияЗарплатыВБухУчете.СпособОтраженияЗарплатыВБухУчете
	|			И ВТ_НачисленнаяЗарплатаИВзносы.ОблагаетсяЕНВД = ПорядокОтраженияЗарплатыВБухУчете.ЕНВД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаСПроводками.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТ_ТаблицаСПроводками.Сумма КАК Сумма,
	|	ВТ_ТаблицаСПроводками.ВидОперации КАК ВидОперации,
	|	ВТ_ТаблицаСПроводками.ВидНачисленияОплатыТрудаДляНУ КАК ВидНачисленияОплатыТрудаДляНУ,
	|	ВТ_ТаблицаСПроводками.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
	|	ВТ_ТаблицаСПроводками.СпособОтраженияЗарплатыВБухУчете КАК СпособОтраженияЗарплатыВБухУчете,
	|	ВТ_ТаблицаСПроводками.Подразделение КАК Подразделение,
	|	ВТ_ТаблицаСПроводками.ПодразделениеУчетаНачислений КАК ПодразделениеУчетаНачислений,
	|	ВТ_ТаблицаСПроводками.ПодразделениеДоходовРасходов КАК ПодразделениеДоходовРасходов,
	|	ВТ_ТаблицаСПроводками.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСПроводками.ОблагаетсяЕНВД
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ВТ_ТаблицаСПроводками.Счет, ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)
	|						ТОГДА ПорядокОтраженияЗарплатыВБухУчете.Счет
	|					ИНАЧЕ ВТ_ТаблицаСПроводками.Счет
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_ТаблицаСПроводками.Счет
	|	КОНЕЦ КАК Счет,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСПроводками.ОблагаетсяЕНВД
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ВТ_ТаблицаСПроводками.Счет, ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)
	|						ТОГДА ПорядокОтраженияЗарплатыВБухУчете.Субконто1
	|					ИНАЧЕ ВТ_ТаблицаСПроводками.Субконто1
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_ТаблицаСПроводками.Субконто1
	|	КОНЕЦ КАК Субконто1,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСПроводками.ОблагаетсяЕНВД
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ВТ_ТаблицаСПроводками.Счет, ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)
	|						ТОГДА ПорядокОтраженияЗарплатыВБухУчете.Субконто2
	|					ИНАЧЕ ВТ_ТаблицаСПроводками.Субконто2
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_ТаблицаСПроводками.Субконто2
	|	КОНЕЦ КАК Субконто2,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСПроводками.ОблагаетсяЕНВД
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ВТ_ТаблицаСПроводками.Счет, ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)
	|						ТОГДА ПорядокОтраженияЗарплатыВБухУчете.Субконто3
	|					ИНАЧЕ ВТ_ТаблицаСПроводками.Субконто3
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_ТаблицаСПроводками.Субконто3
	|	КОНЕЦ КАК Субконто3,
	|	ВТ_ТаблицаСПроводками.СчетНУ КАК СчетНУ,
	|	ВТ_ТаблицаСПроводками.СубконтоНУ1 КАК СубконтоНУ1,
	|	ВТ_ТаблицаСПроводками.СубконтоНУ2 КАК СубконтоНУ2,
	|	ВТ_ТаблицаСПроводками.СубконтоНУ3 КАК СубконтоНУ3,
	|	ВТ_ТаблицаСПроводками.ВидОперацииРасходовЗаСчетФСС КАК ВидОперацииРасходовЗаСчетФСС,
	|	ВТ_ТаблицаСПроводками.ВедущийВидОперации КАК ВедущийВидОперации,
	|	ВТ_ТаблицаСПроводками.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ВТ_ТаблицаСПроводками.СтатьяРасходов КАК СтатьяРасходов,
	|	ВТ_ТаблицаСПроводками.ДоговорКонтрагента КАК ДоговорКонтрагента
	|ПОМЕСТИТЬ ВТ_ИтоговаяТаблица
	|ИЗ
	|	ВТ_ТаблицаСПроводками КАК ВТ_ТаблицаСПроводками
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокОтраженияЗарплатыВБухУчете КАК ПорядокОтраженияЗарплатыВБухУчете
	|		ПО ВТ_ТаблицаСПроводками.СпособОтраженияЗарплатыВБухУчете = ПорядокОтраженияЗарплатыВБухУчете.СпособОтраженияЗарплатыВБухУчете
	|			И (ВТ_ТаблицаСПроводками.ОблагаетсяЕНВД)
	|			И (ЕСТЬNULL(ВТ_ТаблицаСПроводками.Счет, ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИтоговаяТаблица.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТ_ИтоговаяТаблица.Сумма КАК Сумма,
	|	ВТ_ИтоговаяТаблица.ВидОперации КАК ВидОперации,
	|	ВТ_ИтоговаяТаблица.ВидНачисленияОплатыТрудаДляНУ КАК ВидНачисленияОплатыТрудаДляНУ,
	|	ВТ_ИтоговаяТаблица.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
	|	ВТ_ИтоговаяТаблица.СпособОтраженияЗарплатыВБухУчете КАК СпособОтраженияЗарплатыВБухУчете,
	|	ВТ_ИтоговаяТаблица.Подразделение КАК Подразделение,
	|	ВТ_ИтоговаяТаблица.ПодразделениеУчетаНачислений КАК ПодразделениеУчетаНачислений,
	|	ВТ_ИтоговаяТаблица.ПодразделениеДоходовРасходов КАК ПодразделениеДоходовРасходов,
	|	ВТ_ИтоговаяТаблица.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ВТ_ИтоговаяТаблица.Счет КАК Счет,
	|	ВТ_ИтоговаяТаблица.Субконто1 КАК Субконто1,
	|	ВТ_ИтоговаяТаблица.Субконто2 КАК Субконто2,
	|	ВТ_ИтоговаяТаблица.Субконто3 КАК Субконто3,
	|	ВТ_ИтоговаяТаблица.СчетНУ КАК СчетНУ,
	|	ВТ_ИтоговаяТаблица.СубконтоНУ1 КАК СубконтоНУ1,
	|	ВТ_ИтоговаяТаблица.СубконтоНУ2 КАК СубконтоНУ2,
	|	ВТ_ИтоговаяТаблица.СубконтоНУ3 КАК СубконтоНУ3,
	|	ВТ_ИтоговаяТаблица.ВидОперацииРасходовЗаСчетФСС КАК ВидОперацииРасходовЗаСчетФСС,
	|	ВТ_ИтоговаяТаблица.ВедущийВидОперации КАК ВедущийВидОперации,
	|	ВТ_ИтоговаяТаблица.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ВТ_ИтоговаяТаблица.СтатьяРасходов КАК СтатьяРасходов,
	|	ВТ_ИтоговаяТаблица.ДоговорКонтрагента КАК ДоговорКонтрагента
	|ИЗ
	|	ВТ_ИтоговаяТаблица КАК ВТ_ИтоговаяТаблица";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ДополнитьТаблицуДепонированияЗарплатыАналитикойБухУчета(ТаблицаЗаработнойПлаты, Реквизиты)
	
	///////////////////////////////////////
	// Описание типов для дополнения таблиц
	
	ТаблицаЗаработнойПлаты.Колонки.Добавить("ВидНачисленияОплатыТрудаДляНУ", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыНачисленийОплатыТрудаДляНУ"));
	ТаблицаЗаработнойПлаты.Колонки.Добавить("СпособОтраженияЗарплатыВБухУчете", Новый ОписаниеТипов("СправочникСсылка.СпособыОтраженияЗарплатыВБухУчете"));
	ТаблицаЗаработнойПлаты.Колонки.Добавить("ОблагаетсяЕНВД", Новый ОписаниеТипов("Булево"));
	ТаблицаЗаработнойПлаты.Колонки.Добавить("РегистрацияВНалоговомОргане", Новый ОписаниеТипов("СправочникСсылка.РегистрацииВНалоговомОргане"));
	ТаблицаЗаработнойПлаты.Колонки.Добавить("ВидОперацииРасходовЗаСчетФСС", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОперацийПоЗарплате"));
	ТаблицаЗаработнойПлаты.Колонки.Добавить("РасчетныйДокумент", Метаданные.РегистрыНакопления.РасходыПриУСН.Измерения.РасчетныйДокумент.Тип);

	ТаблицаЗаработнойПлаты.Колонки.Добавить("ВедущийВидОперации", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОперацийПоЗарплате"));
	Для Каждого СтрокаТаблицы Из ТаблицаЗаработнойПлаты Цикл
		СтрокаТаблицы.ВедущийВидОперации = СтрокаТаблицы.ВидОперации;
	КонецЦикла;
	
	// Описание типов для дополнения таблиц
	///////////////////////////////////////
	
	МассивОпераций = Новый Массив;
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРНакопительнаяЧасть);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРСтраховаяЧасть);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРПоСуммарномуТарифу);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРДоПредельнойВеличины);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРСПревышения);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРДополнительныйТарифЛЭ);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРДополнительныйТарифШахтеры);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ФСС);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ФССНС);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ФФОМС);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ТФОМС);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ВзносыПоЕдиномуТарифу);
	
	МассивОперацийРасходовПоСтрахованию = Новый Массив;
	МассивОперацийРасходовПоСтрахованию.Добавить(Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюФСС);
	МассивОперацийРасходовПоСтрахованию.Добавить(Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюФССНС);
	МассивОперацийРасходовПоСтрахованию.Добавить(Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюБюджет);
	
	МассивОперацийНезарплатногоНДФЛ = Новый Массив;
	МассивОперацийНезарплатногоНДФЛ.Добавить(Перечисления.ВидыОперацийПоЗарплате.НДФЛДоначисленныйПоРезультатамПроверки);
	МассивОперацийНезарплатногоНДФЛ.Добавить(Перечисления.ВидыОперацийПоЗарплате.НДФЛДоходыКонтрагентов);
	МассивОперацийНезарплатногоНДФЛ.Добавить(Перечисления.ВидыОперацийПоЗарплате.НДФЛПередачаЗадолженностиВНалоговыйОрган);
	МассивОперацийНезарплатногоНДФЛ.Добавить(Перечисления.ВидыОперацийПоЗарплате.НДФЛРасчетыСБывшимиСотрудниками);
	МассивОперацийНезарплатногоНДФЛ.Добавить(Перечисления.ВидыОперацийПоЗарплате.НФДЛДивиденды);
	МассивОперацийНезарплатногоНДФЛ.Добавить(Перечисления.ВидыОперацийПоЗарплате.НФДЛДивидендыСотрудникам);
	МассивОперацийНезарплатногоНДФЛ.Добавить(Перечисления.ВидыОперацийПоЗарплате.НДФЛПрочиеРасчетыСПерсоналом);
	
	МассивСчетовУчетаНУ = Новый Массив;
	РасходыПоУплатеСтраховыхВзносов      = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПрочиеДоходыИРасходы.РасходыПоУплатеСтраховыхВзносов");	
	ПрочиеВнереализационныеДоходыРасходы = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПрочиеДоходыИРасходы.ПрочиеВнереализационныеДоходыРасходы");
	ТаблицаПорядокОтраженияЗарплатыВБухУчете = ПолучитьПорядокОтраженияЗарплаты(ПланыВидовХарактеристик.ЕПСПравилаОтраженияЗарплаты.Начисления, Реквизиты);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("НачисленнаяЗарплатаИВзносы",           ТаблицаЗаработнойПлаты);
	Запрос.УстановитьПараметр("МассивСчетовУчетаНУ",                  МассивСчетовУчетаНУ);
	Запрос.УстановитьПараметр("МассивОпераций",                       МассивОпераций);
	Запрос.УстановитьПараметр("РасходыПоУплатеСтраховыхВзносов",      РасходыПоУплатеСтраховыхВзносов);
	Запрос.УстановитьПараметр("ПрочиеВнереализационныеДоходыРасходы", ПрочиеВнереализационныеДоходыРасходы);
	Запрос.УстановитьПараметр("МассивОперацийРасходовПоСтрахованию",  МассивОперацийРасходовПоСтрахованию);
	Запрос.УстановитьПараметр("МассивОперацийНезарплатногоНДФЛ",      МассивОперацийНезарплатногоНДФЛ);
	Запрос.УстановитьПараметр("ПорядокОтраженияЗарплатыВБухУчете",    ТаблицаПорядокОтраженияЗарплатыВБухУчете);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачисленнаяЗарплатаИВзносы.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НачисленнаяЗарплатаИВзносы.Сумма КАК Сумма,
	|	НачисленнаяЗарплатаИВзносы.ВидОперации КАК ВидОперации,
	|	НачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ КАК ВидНачисленияОплатыТрудаДляНУ,
	|	НачисленнаяЗарплатаИВзносы.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
	|	НачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухУчете КАК СпособОтраженияЗарплатыВБухУчете,
	|	НачисленнаяЗарплатаИВзносы.Подразделение КАК Подразделение,
	|	НачисленнаяЗарплатаИВзносы.ПодразделениеУчетаНачислений КАК ПодразделениеУчетаНачислений,
	|	НачисленнаяЗарплатаИВзносы.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	НачисленнаяЗарплатаИВзносы.ВидОперацииРасходовЗаСчетФСС КАК ВидОперацииРасходовЗаСчетФСС,
	|	НачисленнаяЗарплатаИВзносы.ВедущийВидОперации КАК ВедущийВидОперации,
	|	НачисленнаяЗарплатаИВзносы.РасчетныйДокумент КАК РасчетныйДокумент,
	|	НачисленнаяЗарплатаИВзносы.СтатьяРасходов КАК СтатьяРасходов,
	|	НачисленнаяЗарплатаИВзносы.ЭтоМатериальнаяПомощь КАК ЭтоМатериальнаяПомощь,
	|	НачисленнаяЗарплатаИВзносы.ДоговорКонтрагента КАК ДоговорКонтрагента
	|ПОМЕСТИТЬ ВТ_НачисленнаяЗарплатаИВзносы
	|ИЗ
	|	&НачисленнаяЗарплатаИВзносы КАК НачисленнаяЗарплатаИВзносы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПорядокОтраженияЗарплатыВБухУчете.СпособОтраженияЗарплатыВБухУчете КАК СпособОтраженияЗарплатыВБухУчете,
	|	ПорядокОтраженияЗарплатыВБухУчете.Счет КАК Счет,
	|	ПорядокОтраженияЗарплатыВБухУчете.Субконто1 КАК Субконто1,
	|	ПорядокОтраженияЗарплатыВБухУчете.Субконто2 КАК Субконто2,
	|	ПорядокОтраженияЗарплатыВБухУчете.Субконто3 КАК Субконто3,
	|	ПорядокОтраженияЗарплатыВБухУчете.СчетНУ КАК СчетНУ,
	|	ПорядокОтраженияЗарплатыВБухУчете.СубконтоНУ1 КАК СубконтоНУ1,
	|	ПорядокОтраженияЗарплатыВБухУчете.СубконтоНУ2 КАК СубконтоНУ2,
	|	ПорядокОтраженияЗарплатыВБухУчете.СубконтоНУ3 КАК СубконтоНУ3,
	|	ПорядокОтраженияЗарплатыВБухУчете.ЕНВД КАК ЕНВД
	|ПОМЕСТИТЬ ПорядокОтраженияЗарплатыВБухУчете
	|ИЗ
	|	&ПорядокОтраженияЗарплатыВБухУчете КАК ПорядокОтраженияЗарплатыВБухУчете
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НачисленнаяЗарплатаИВзносы.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТ_НачисленнаяЗарплатаИВзносы.Сумма КАК Сумма,
	|	ВТ_НачисленнаяЗарплатаИВзносы.ВидОперации КАК ВидОперации,
	|	ВТ_НачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ КАК ВидНачисленияОплатыТрудаДляНУ,
	|	ВТ_НачисленнаяЗарплатаИВзносы.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
	|	ВТ_НачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухУчете КАК СпособОтраженияЗарплатыВБухУчете,
	|	ВТ_НачисленнаяЗарплатаИВзносы.Подразделение КАК Подразделение,
	|	ВТ_НачисленнаяЗарплатаИВзносы.ПодразделениеУчетаНачислений КАК ПодразделениеУчетаНачислений,
	|	ВТ_НачисленнаяЗарплатаИВзносы.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ПорядокОтраженияЗарплатыВБухУчете.Счет КАК Счет,
	|	ПорядокОтраженияЗарплатыВБухУчете.Субконто1 КАК Субконто1,
	|	ПорядокОтраженияЗарплатыВБухУчете.Субконто2 КАК Субконто2,
	|	ПорядокОтраженияЗарплатыВБухУчете.Субконто3 КАК Субконто3,
	|	ВЫБОР
	|		КОГДА ВТ_НачисленнаяЗарплатаИВзносы.ВидОперации В (&МассивОпераций)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_НачисленнаяЗарплатаИВзносы.ОблагаетсяЕНВД
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)
	|					КОГДА НЕ ПорядокОтраженияЗарплатыВБухУчете.Счет В (&МассивСчетовУчетаНУ)
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)
	|					ИНАЧЕ ПорядокОтраженияЗарплатыВБухУчете.СчетНУ
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)
	|	КОНЕЦ КАК СчетНУ,
	|	ВЫБОР
	|		КОГДА ВТ_НачисленнаяЗарплатаИВзносы.ВидОперации В (&МассивОпераций)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_НачисленнаяЗарплатаИВзносы.ОблагаетсяЕНВД
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)
	|					КОГДА НЕ ПорядокОтраженияЗарплатыВБухУчете.Счет В (&МассивСчетовУчетаНУ)
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)
	|					ИНАЧЕ ПорядокОтраженияЗарплатыВБухУчете.СубконтоНУ1
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)
	|	КОНЕЦ КАК СубконтоНУ1,
	|	ВЫБОР
	|		КОГДА ВТ_НачисленнаяЗарплатаИВзносы.ВидОперации В (&МассивОпераций)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_НачисленнаяЗарплатаИВзносы.ОблагаетсяЕНВД
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)
	|					КОГДА НЕ ПорядокОтраженияЗарплатыВБухУчете.Счет В (&МассивСчетовУчетаНУ)
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)
	|					ИНАЧЕ ПорядокОтраженияЗарплатыВБухУчете.СубконтоНУ2
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)
	|	КОНЕЦ КАК СубконтоНУ2,
	|	ВЫБОР
	|		КОГДА ВТ_НачисленнаяЗарплатаИВзносы.ВидОперации В (&МассивОпераций)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_НачисленнаяЗарплатаИВзносы.ОблагаетсяЕНВД
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)
	|					КОГДА НЕ ПорядокОтраженияЗарплатыВБухУчете.Счет В (&МассивСчетовУчетаНУ)
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)
	|					ИНАЧЕ ПорядокОтраженияЗарплатыВБухУчете.СубконтоНУ3
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)
	|	КОНЕЦ КАК СубконтоНУ3,
	|	ВТ_НачисленнаяЗарплатаИВзносы.ВидОперацииРасходовЗаСчетФСС КАК ВидОперацииРасходовЗаСчетФСС,
	|	ВТ_НачисленнаяЗарплатаИВзносы.ВедущийВидОперации КАК ВедущийВидОперации,
	|	ВТ_НачисленнаяЗарплатаИВзносы.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ВТ_НачисленнаяЗарплатаИВзносы.СтатьяРасходов КАК СтатьяРасходов,
	|	ВТ_НачисленнаяЗарплатаИВзносы.ЭтоМатериальнаяПомощь КАК ЭтоМатериальнаяПомощь,
	|	ВТ_НачисленнаяЗарплатаИВзносы.ДоговорКонтрагента КАК ДоговорКонтрагента
	|ПОМЕСТИТЬ ВТ_ТаблицаСПроводками
	|ИЗ
	|	ВТ_НачисленнаяЗарплатаИВзносы КАК ВТ_НачисленнаяЗарплатаИВзносы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокОтраженияЗарплатыВБухУчете КАК ПорядокОтраженияЗарплатыВБухУчете
	|		ПО ВТ_НачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухУчете = ПорядокОтраженияЗарплатыВБухУчете.СпособОтраженияЗарплатыВБухУчете
	|			И ВТ_НачисленнаяЗарплатаИВзносы.ОблагаетсяЕНВД = ПорядокОтраженияЗарплатыВБухУчете.ЕНВД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаСПроводками.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТ_ТаблицаСПроводками.Сумма КАК Сумма,
	|	ВТ_ТаблицаСПроводками.ВидОперации КАК ВидОперации,
	|	ВТ_ТаблицаСПроводками.ВидНачисленияОплатыТрудаДляНУ КАК ВидНачисленияОплатыТрудаДляНУ,
	|	ВТ_ТаблицаСПроводками.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
	|	ВТ_ТаблицаСПроводками.СпособОтраженияЗарплатыВБухУчете КАК СпособОтраженияЗарплатыВБухУчете,
	|	ВТ_ТаблицаСПроводками.Подразделение КАК Подразделение,
	|	ВТ_ТаблицаСПроводками.ПодразделениеУчетаНачислений КАК ПодразделениеУчетаНачислений,
	|	ВТ_ТаблицаСПроводками.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСПроводками.ОблагаетсяЕНВД
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ВТ_ТаблицаСПроводками.Счет, ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)
	|						ТОГДА ПорядокОтраженияЗарплатыВБухУчете.Счет
	|					ИНАЧЕ ВТ_ТаблицаСПроводками.Счет
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_ТаблицаСПроводками.Счет
	|	КОНЕЦ КАК Счет,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСПроводками.ОблагаетсяЕНВД
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ВТ_ТаблицаСПроводками.Счет, ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)
	|						ТОГДА ПорядокОтраженияЗарплатыВБухУчете.Субконто1
	|					ИНАЧЕ ВТ_ТаблицаСПроводками.Субконто1
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_ТаблицаСПроводками.Субконто1
	|	КОНЕЦ КАК Субконто1,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСПроводками.ОблагаетсяЕНВД
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ВТ_ТаблицаСПроводками.Счет, ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)
	|						ТОГДА ПорядокОтраженияЗарплатыВБухУчете.Субконто2
	|					ИНАЧЕ ВТ_ТаблицаСПроводками.Субконто2
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_ТаблицаСПроводками.Субконто2
	|	КОНЕЦ КАК Субконто2,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСПроводками.ОблагаетсяЕНВД
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ВТ_ТаблицаСПроводками.Счет, ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)
	|						ТОГДА ПорядокОтраженияЗарплатыВБухУчете.Субконто3
	|					ИНАЧЕ ВТ_ТаблицаСПроводками.Субконто3
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_ТаблицаСПроводками.Субконто3
	|	КОНЕЦ КАК Субконто3,
	|	ВТ_ТаблицаСПроводками.СчетНУ КАК СчетНУ,
	|	ВТ_ТаблицаСПроводками.СубконтоНУ1 КАК СубконтоНУ1,
	|	ВТ_ТаблицаСПроводками.СубконтоНУ2 КАК СубконтоНУ2,
	|	ВТ_ТаблицаСПроводками.СубконтоНУ3 КАК СубконтоНУ3,
	|	ВТ_ТаблицаСПроводками.ВидОперацииРасходовЗаСчетФСС КАК ВидОперацииРасходовЗаСчетФСС,
	|	ВТ_ТаблицаСПроводками.ВедущийВидОперации КАК ВедущийВидОперации,
	|	ВТ_ТаблицаСПроводками.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ВТ_ТаблицаСПроводками.СтатьяРасходов КАК СтатьяРасходов,
	|	ВТ_ТаблицаСПроводками.ЭтоМатериальнаяПомощь КАК ЭтоМатериальнаяПомощь,
	|	ВТ_ТаблицаСПроводками.ДоговорКонтрагента КАК ДоговорКонтрагента
	|ПОМЕСТИТЬ ВТ_ИтоговаяТаблица
	|ИЗ
	|	ВТ_ТаблицаСПроводками КАК ВТ_ТаблицаСПроводками
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокОтраженияЗарплатыВБухУчете КАК ПорядокОтраженияЗарплатыВБухУчете
	|		ПО ВТ_ТаблицаСПроводками.СпособОтраженияЗарплатыВБухУчете = ПорядокОтраженияЗарплатыВБухУчете.СпособОтраженияЗарплатыВБухУчете
	|			И (ВТ_ТаблицаСПроводками.ОблагаетсяЕНВД)
	|			И (ЕСТЬNULL(ВТ_ТаблицаСПроводками.Счет, ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ЕПСЛицевыеСчета.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИтоговаяТаблица.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТ_ИтоговаяТаблица.Сумма КАК Сумма,
	|	ВТ_ИтоговаяТаблица.ВидОперации КАК ВидОперации,
	|	ВТ_ИтоговаяТаблица.ВидНачисленияОплатыТрудаДляНУ КАК ВидНачисленияОплатыТрудаДляНУ,
	|	ВТ_ИтоговаяТаблица.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
	|	ВТ_ИтоговаяТаблица.СпособОтраженияЗарплатыВБухУчете КАК СпособОтраженияЗарплатыВБухУчете,
	|	ВТ_ИтоговаяТаблица.Подразделение КАК Подразделение,
	|	ВТ_ИтоговаяТаблица.ПодразделениеУчетаНачислений КАК ПодразделениеУчетаНачислений,
	|	ВТ_ИтоговаяТаблица.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ВТ_ИтоговаяТаблица.Счет КАК Счет,
	|	ВТ_ИтоговаяТаблица.Субконто1 КАК Субконто1,
	|	ВТ_ИтоговаяТаблица.Субконто2 КАК Субконто2,
	|	ВТ_ИтоговаяТаблица.Субконто3 КАК Субконто3,
	|	ВТ_ИтоговаяТаблица.СчетНУ КАК СчетНУ,
	|	ВТ_ИтоговаяТаблица.СубконтоНУ1 КАК СубконтоНУ1,
	|	ВТ_ИтоговаяТаблица.СубконтоНУ2 КАК СубконтоНУ2,
	|	ВТ_ИтоговаяТаблица.СубконтоНУ3 КАК СубконтоНУ3,
	|	ВТ_ИтоговаяТаблица.ВидОперацииРасходовЗаСчетФСС КАК ВидОперацииРасходовЗаСчетФСС,
	|	ВТ_ИтоговаяТаблица.ВедущийВидОперации КАК ВедущийВидОперации,
	|	ВТ_ИтоговаяТаблица.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ВТ_ИтоговаяТаблица.СтатьяРасходов КАК СтатьяРасходов,
	|	ВТ_ИтоговаяТаблица.ЭтоМатериальнаяПомощь КАК ЭтоМатериальнаяПомощь,
	|	ВТ_ИтоговаяТаблица.ДоговорКонтрагента КАК ДоговорКонтрагента
	|ИЗ
	|	ВТ_ИтоговаяТаблица КАК ВТ_ИтоговаяТаблица";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьПорядокОтраженияЗарплаты(ПравилоОтражения, Реквизиты, СпособОтражения = Неопределено)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация", 		Реквизиты.Организация);
	Запрос.УстановитьПараметр("ПравилоОтражения",	ПравилоОтражения);
	Запрос.УстановитьПараметр("СпособОтражения", 	СпособОтражения);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕПСПорядокОтраженияЗарплаты.СпособОтраженияЗарплатыВБухУчете,
	|	ЕПСПорядокОтраженияЗарплаты.Счет,
	|	ЕПСПорядокОтраженияЗарплаты.Субконто1,
	|	ЕПСПорядокОтраженияЗарплаты.Субконто2,
	|	ЕПСПорядокОтраженияЗарплаты.Субконто3,
	|	ЕПСПорядокОтраженияЗарплаты.ЕПСПараметрОтраженияВБУ,
	|	ЕПСПорядокОтраженияЗарплаты.СчетНУ,
	|	ЕПСПорядокОтраженияЗарплаты.СубконтоНУ1,
	|	ЕПСПорядокОтраженияЗарплаты.СубконтоНУ2,
	|	ЕПСПорядокОтраженияЗарплаты.СубконтоНУ3,
	|	ЕПСПорядокОтраженияЗарплаты.ЕНВД,
	|	0 КАК Порядок
	|ПОМЕСТИТЬ ВТ_ПорядокОтражения
	|ИЗ
	|	РегистрСведений.ЕПСПорядокОтраженияЗарплаты КАК ЕПСПорядокОтраженияЗарплаты
	|ГДЕ
	|	ЕПСПорядокОтраженияЗарплаты.Организация = &Организация
	|	И ЕПСПорядокОтраженияЗарплаты.ПравилоОтражения = &ПравилоОтражения
	|	И ВЫБОР
	|			КОГДА &СпособОтражения = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЕПСПорядокОтраженияЗарплаты.СпособОтраженияЗарплатыВБухУчете = &СпособОтражения
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕПСПорядокОтраженияЗарплаты.СпособОтраженияЗарплатыВБухУчете,
	|	ЕПСПорядокОтраженияЗарплаты.Счет,
	|	ЕПСПорядокОтраженияЗарплаты.Субконто1,
	|	ЕПСПорядокОтраженияЗарплаты.Субконто2,
	|	ЕПСПорядокОтраженияЗарплаты.Субконто3,
	|	ЕПСПорядокОтраженияЗарплаты.ЕПСПараметрОтраженияВБУ,
	|	ЕПСПорядокОтраженияЗарплаты.СчетНУ,
	|	ЕПСПорядокОтраженияЗарплаты.СубконтоНУ1,
	|	ЕПСПорядокОтраженияЗарплаты.СубконтоНУ2,
	|	ЕПСПорядокОтраженияЗарплаты.СубконтоНУ3,
	|	ЕПСПорядокОтраженияЗарплаты.ЕНВД,
	|	1
	|ИЗ
	|	РегистрСведений.ЕПСПорядокОтраженияЗарплаты КАК ЕПСПорядокОтраженияЗарплаты
	|ГДЕ
	|	ЕПСПорядокОтраженияЗарплаты.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И ЕПСПорядокОтраженияЗарплаты.ПравилоОтражения = &ПравилоОтражения
	|	И ВЫБОР
	|			КОГДА &СпособОтражения = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЕПСПорядокОтраженияЗарплаты.СпособОтраженияЗарплатыВБухУчете = &СпособОтражения
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПорядокОтражения.СпособОтраженияЗарплатыВБухУчете,
	|	МИНИМУМ(ВТ_ПорядокОтражения.Порядок) КАК Порядок
	|ПОМЕСТИТЬ ВТ_ТаблицаОтбор
	|ИЗ
	|	ВТ_ПорядокОтражения КАК ВТ_ПорядокОтражения
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПорядокОтражения.СпособОтраженияЗарплатыВБухУчете
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПорядокОтражения.СпособОтраженияЗарплатыВБухУчете,
	|	ВТ_ПорядокОтражения.ЕНВД,
	|	ВТ_ПорядокОтражения.Счет,
	|	ВТ_ПорядокОтражения.Субконто1,
	|	ВТ_ПорядокОтражения.Субконто2,
	|	ВТ_ПорядокОтражения.Субконто3,
	|	ВТ_ПорядокОтражения.ЕПСПараметрОтраженияВБУ,
	|	ВТ_ПорядокОтражения.СчетНУ,
	|	ВТ_ПорядокОтражения.СубконтоНУ1,
	|	ВТ_ПорядокОтражения.СубконтоНУ2,
	|	ВТ_ПорядокОтражения.СубконтоНУ3
	|ИЗ
	|	ВТ_ПорядокОтражения КАК ВТ_ПорядокОтражения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаОтбор КАК ВТ_ТаблицаОтбор
	|		ПО ВТ_ПорядокОтражения.СпособОтраженияЗарплатыВБухУчете = ВТ_ТаблицаОтбор.СпособОтраженияЗарплатыВБухУчете
	|			И ВТ_ПорядокОтражения.Порядок = ВТ_ТаблицаОтбор.Порядок";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() = 0 Тогда
		
		ПустаяТаблица = РегистрыСведений.ЕПСПорядокОтраженияЗарплаты.СоздатьНаборЗаписей().ВыгрузитьКолонки();
		Возврат ПустаяТаблица;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДополнитьТаблицуНачисленийПараметрамиОтраженияВБУ(ПравилоОтражения, Реквизиты, ТаблицаНачислений)
	
	Запрос = Новый Запрос;
	
	Если ПравилоОтражения = ПланыВидовХарактеристик.ЕПСПравилаОтраженияЗарплаты.Начисления Тогда
		
		МассивОпераций = Новый Массив;
	
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.НачисленоДоход);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.НачисленоСдельноДоход);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ДивидендыСотрудников);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюФССНС);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюФСС);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюРаботодатель);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюБюджет);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ДоговорАвторскогоЗаказа);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ДоговорРаботыУслуги);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.МатериальнаяПомощь);
		
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпуска);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпускаОценочныеОбязательства);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательстваИРезервы);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЗаЗадержкуЗарплаты);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПрочиеРасчетыСПерсоналом);
				
	ИначеЕсли ПравилоОтражения = ПланыВидовХарактеристик.ЕПСПравилаОтраженияЗарплаты.Взносы Тогда
		
		МассивОпераций = Новый Массив;
		
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРНакопительнаяЧасть);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРСтраховаяЧасть);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРПоСуммарномуТарифу);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРДоПредельнойВеличины);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРСПревышения);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРДополнительныйТарифЛЭ);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРДополнительныйТарифШахтеры);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ФСС);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ФССНС);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ФФОМС);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ТФОМС);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.СтраховыеВзносыПоРезервамПоОтпускам);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПособиеНаПогребение);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ВзносыПоЕдиномуТарифу);

	ИначеЕсли ПравилоОтражения = ПланыВидовХарактеристик.ЕПСПравилаОтраженияЗарплаты.НДФЛ Тогда
		
		МассивОпераций = Новый Массив;
		
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.НДФЛ); 
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.НДФЛСПревышения); 
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.НДФЛДоначисленныйПоРезультатамПроверки);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.НДФЛДоходыКонтрагентов);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.НДФЛПередачаЗадолженностиВНалоговыйОрган);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.НДФЛПрочиеРасчетыСПерсоналом);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.НДФЛРасчетыСБывшимиСотрудниками);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.НФДЛДивиденды);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.НФДЛДивидендыСотрудникам);
		
	ИначеЕсли ПравилоОтражения = ПланыВидовХарактеристик.ЕПСПравилаОтраженияЗарплаты.Удержания Тогда
		
		МассивОпераций = Новый Массив;
	
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПогашениеЗаймов);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПроцентыПоЗайму);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛисты);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ДСВ);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.Профвзносы);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ДобровольныеВзносыВНПФ);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгента);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ВозмещениеУщерба);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.УдержаниеПоПрочимОперациямСРаботниками);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.УдержаниеНеизрасходованныхПодотчетныхСумм);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ВозвратИзлишнеВыплаченныхСуммВследствиеСчетныхОшибок);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.УдержаниеЗаОтпуск);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.НачисленоПроцентовПоЗайму); 
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПрочиеУдержания); 
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПогашениеПроцентовПоЗайму); 
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.СписаниеКорректировкиАСПоЗайму); 

	ИначеЕсли ПравилоОтражения = ПланыВидовХарактеристик.ЕПСПравилаОтраженияЗарплаты.Депонирование Тогда
		
		МассивОпераций = Новый Массив;
		
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.Депонирование); 
	
	ИначеЕсли ПравилоОтражения = ПланыВидовХарактеристик.ЕПСПравилаОтраженияЗарплаты.СписаниеДепонента Тогда
		
		МассивОпераций = Новый Массив;
		
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.СписаниеДепонента);

	ИначеЕсли ПравилоОтражения = ПланыВидовХарактеристик.ЕПСПравилаОтраженияЗарплаты.РезервыПоОтпускам Тогда
		
		МассивОпераций = Новый Массив;
		
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпуск);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускРезервы);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательства);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательстваИРезервы);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускРезервыЗаПрошлыеПериоды);

	ИначеЕсли ПравилоОтражения = ПланыВидовХарактеристик.ЕПСПравилаОтраженияЗарплаты.ВзносыСРезервовПоОтпускам Тогда
		
		МассивОпераций = Новый Массив;
		
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.СтраховыеВзносыПоРезервамПоОтпускам);
		МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.СтраховыеВзносыПоРезервамПоОтпускамЗаПрошлыеПериоды);
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация", 		Реквизиты.Организация);
	Запрос.УстановитьПараметр("ПравилоОтражения",	ПравилоОтражения);
	Запрос.УстановитьПараметр("ВидыОпераций",       МассивОпераций);
	Запрос.УстановитьПараметр("ТаблицаНачислений", 	ТаблицаНачислений);
	Запрос.УстановитьПараметр("СоединениеПоВиду",   Истина);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаНачислений.ФизическоеЛицо,
	|	ТаблицаНачислений.Подразделение,
	|	ТаблицаНачислений.ВидОперации,
	|	ТаблицаНачислений.ДоговорКонтрагента,
	|	ТаблицаНачислений.СпособОтраженияЗарплатыВБухучете
	|ПОМЕСТИТЬ ТаблицаНачисленийИсходная
	|ИЗ
	|	&ТаблицаНачислений КАК ТаблицаНачислений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНачислений.ФизическоеЛицо,
	|	ТаблицаНачислений.Подразделение,
	|	ТаблицаНачислений.ВидОперации,
	|	ТаблицаНачислений.ДоговорКонтрагента,
	|	ТаблицаНачислений.СпособОтраженияЗарплатыВБухучете
	|ПОМЕСТИТЬ ТаблицаНачислений
	|ИЗ
	|	ТаблицаНачисленийИсходная КАК ТаблицаНачислений
	|ГДЕ
	|	ТаблицаНачислений.ВидОперации В(&ВидыОпераций)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА &СоединениеПоВиду
	|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ЕПСПорядокОтраженияЗарплаты.СпособОтраженияЗарплатыВБухУчете КАК Перечисление.ВидыОперацийПоЗарплате), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Пустаяссылка))
	|		ИНАЧЕ ЕСТЬNULL(ВЫРАЗИТЬ(ЕПСПорядокОтраженияЗарплаты.СпособОтраженияЗарплатыВБухУчете КАК Справочник.СпособыОтраженияЗарплатыВБухУчете), ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВБухУчете.Пустаяссылка))
	|	КОНЕЦ КАК СпособОтраженияЗарплатыВБухУчете,
	|	ЕПСПорядокОтраженияЗарплаты.Счет,
	|	ЕПСПорядокОтраженияЗарплаты.Субконто1,
	|	ЕПСПорядокОтраженияЗарплаты.Субконто2,
	|	ЕПСПорядокОтраженияЗарплаты.Субконто3,
	|	ЕПСПорядокОтраженияЗарплаты.ЕПСПараметрОтраженияВБУ,
	|	0 КАК Порядок
	|ПОМЕСТИТЬ ВТ_ПорядокОтражения
	|ИЗ
	|	РегистрСведений.ЕПСПорядокОтраженияЗарплаты КАК ЕПСПорядокОтраженияЗарплаты
	|ГДЕ
	|	ЕПСПорядокОтраженияЗарплаты.Организация = &Организация
	|	И ЕПСПорядокОтраженияЗарплаты.ПравилоОтражения = &ПравилоОтражения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА &СоединениеПоВиду
	|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ЕПСПорядокОтраженияЗарплаты.СпособОтраженияЗарплатыВБухУчете КАК Перечисление.ВидыОперацийПоЗарплате), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Пустаяссылка))
	|		ИНАЧЕ ЕСТЬNULL(ВЫРАЗИТЬ(ЕПСПорядокОтраженияЗарплаты.СпособОтраженияЗарплатыВБухУчете КАК Справочник.СпособыОтраженияЗарплатыВБухУчете), ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВБухУчете.Пустаяссылка))
	|	КОНЕЦ,
	|	ЕПСПорядокОтраженияЗарплаты.Счет,
	|	ЕПСПорядокОтраженияЗарплаты.Субконто1,
	|	ЕПСПорядокОтраженияЗарплаты.Субконто2,
	|	ЕПСПорядокОтраженияЗарплаты.Субконто3,
	|	ЕПСПорядокОтраженияЗарплаты.ЕПСПараметрОтраженияВБУ,
	|	1
	|ИЗ
	|	РегистрСведений.ЕПСПорядокОтраженияЗарплаты КАК ЕПСПорядокОтраженияЗарплаты
	|ГДЕ
	|	ЕПСПорядокОтраженияЗарплаты.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И ЕПСПорядокОтраженияЗарплаты.ПравилоОтражения = &ПравилоОтражения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПорядокОтражения.СпособОтраженияЗарплатыВБухУчете,
	|	МИНИМУМ(ВТ_ПорядокОтражения.Порядок) КАК Порядок
	|ПОМЕСТИТЬ ВТ_ТаблицаОтбор
	|ИЗ
	|	ВТ_ПорядокОтражения КАК ВТ_ПорядокОтражения
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПорядокОтражения.СпособОтраженияЗарплатыВБухУчете
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПорядокОтражения.СпособОтраженияЗарплатыВБухУчете,
	|	ВТ_ПорядокОтражения.Счет,
	|	ВТ_ПорядокОтражения.Субконто1,
	|	ВТ_ПорядокОтражения.Субконто2,
	|	ВТ_ПорядокОтражения.Субконто3,
	|	ВТ_ПорядокОтражения.ЕПСПараметрОтраженияВБУ,
	|	ВЫБОР
	|		КОГДА ВТ_ПорядокОтражения.ЕПСПараметрОтраженияВБУ В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Пустаяссылка), ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВБухУчете.Пустаяссылка))
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПорядокПараметраОтраженияВБУ
	|ПОМЕСТИТЬ ВТ_Итоговая
	|ИЗ
	|	ВТ_ПорядокОтражения КАК ВТ_ПорядокОтражения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаОтбор КАК ВТ_ТаблицаОтбор
	|		ПО ВТ_ПорядокОтражения.СпособОтраженияЗарплатыВБухУчете = ВТ_ТаблицаОтбор.СпособОтраженияЗарплатыВБухУчете
	|			И ВТ_ПорядокОтражения.Порядок = ВТ_ТаблицаОтбор.Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНачислений.ФизическоеЛицо,
	|	ТаблицаНачислений.Подразделение,
	|	ТаблицаНачислений.ВидОперации,
	|	ТаблицаНачислений.ДоговорКонтрагента,
	|	ТаблицаНачислений.СпособОтраженияЗарплатыВБухучете,
	|	ВТ_Итоговая.Счет,
	|	ВТ_Итоговая.Субконто1,
	|	ВТ_Итоговая.Субконто2,
	|	ВТ_Итоговая.Субконто3,
	|	ВТ_Итоговая.ЕПСПараметрОтраженияВБУ,
	|	ВТ_Итоговая.ПорядокПараметраОтраженияВБУ
	|ПОМЕСТИТЬ ВТ_ПредварительныйРезультат
	|ИЗ
	|	ТаблицаНачислений КАК ТаблицаНачислений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Итоговая КАК ВТ_Итоговая
	|		ПО %Условие соединения%
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПредварительныйРезультат.ФизическоеЛицо,
	|	ВТ_ПредварительныйРезультат.Подразделение,
	|	ВТ_ПредварительныйРезультат.ВидОперации,
	|	ВТ_ПредварительныйРезультат.ДоговорКонтрагента,
	|	ВТ_ПредварительныйРезультат.СпособОтраженияЗарплатыВБухучете,
	|	МИНИМУМ(ВТ_ПредварительныйРезультат.ПорядокПараметраОтраженияВБУ) КАК ПорядокПараметраОтраженияВБУ
	|ПОМЕСТИТЬ ВТ_ПромежуточныйРезультат
	|ИЗ
	|	ВТ_ПредварительныйРезультат КАК ВТ_ПредварительныйРезультат
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПредварительныйРезультат.ФизическоеЛицо,
	|	ВТ_ПредварительныйРезультат.Подразделение,
	|	ВТ_ПредварительныйРезультат.ВидОперации,
	|	ВТ_ПредварительныйРезультат.ДоговорКонтрагента,
	|	ВТ_ПредварительныйРезультат.СпособОтраженияЗарплатыВБухучете
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПредварительныйРезультат.ФизическоеЛицо,
	|	ВТ_ПредварительныйРезультат.Подразделение,
	|	ВТ_ПредварительныйРезультат.ВидОперации,
	|	ВТ_ПредварительныйРезультат.ДоговорКонтрагента,
	|	ВТ_ПредварительныйРезультат.Счет,
	|	ВТ_ПредварительныйРезультат.Субконто1,
	|	ВТ_ПредварительныйРезультат.Субконто2,
	|	ВТ_ПредварительныйРезультат.Субконто3,
	|	ВТ_ПредварительныйРезультат.СпособОтраженияЗарплатыВБухучете,
	|	ВТ_ПредварительныйРезультат.ЕПСПараметрОтраженияВБУ
	|ИЗ
	|	ВТ_ПредварительныйРезультат КАК ВТ_ПредварительныйРезультат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПромежуточныйРезультат КАК ВТ_ПромежуточныйРезультат
	|		ПО ВТ_ПредварительныйРезультат.ФизическоеЛицо = ВТ_ПромежуточныйРезультат.ФизическоеЛицо
	|			И ВТ_ПредварительныйРезультат.Подразделение = ВТ_ПромежуточныйРезультат.Подразделение
	|			И ВТ_ПредварительныйРезультат.ВидОперации = ВТ_ПромежуточныйРезультат.ВидОперации
	|			И ВТ_ПредварительныйРезультат.СпособОтраженияЗарплатыВБухучете = ВТ_ПромежуточныйРезультат.СпособОтраженияЗарплатыВБухучете
	|			И ВТ_ПредварительныйРезультат.ПорядокПараметраОтраженияВБУ = ВТ_ПромежуточныйРезультат.ПорядокПараметраОтраженияВБУ";
	
	ТекстУсловияЗапроса = "";
	
	ТекстУсловияЗапроса = "(ВЫБОР
	|				КОГДА ВТ_Итоговая.СпособОтраженияЗарплатыВБухУчете = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ТаблицаНачислений.ВидОперации = ВТ_Итоговая.СпособОтраженияЗарплатыВБухУчете
	|			КОНЕЦ)";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%Условие соединения%", ТекстУсловияЗапроса);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

Функция ДополнитьТаблицуНДФЛПараметрамиОтраженияВБУ(ТаблицаНачислений, Реквизиты)
	
	// Подбор счетов по НДФЛ идет через поиск лицевых счетов, открытых по Регистрации в налоговом органе
	МассивОпераций = Новый Массив;
	
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.НДФЛ); 
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.НДФЛСПревышения); 
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.НДФЛДоначисленныйПоРезультатамПроверки);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.НДФЛДоходыКонтрагентов);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.НДФЛПередачаЗадолженностиВНалоговыйОрган);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.НДФЛПрочиеРасчетыСПерсоналом);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.НДФЛРасчетыСБывшимиСотрудниками);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.НФДЛДивиденды);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.НФДЛДивидендыСотрудникам);

	Запрос = Новый Запрос;
		
	Запрос.УстановитьПараметр("ВидыОпераций",       МассивОпераций);
	Запрос.УстановитьПараметр("ТаблицаНачислений", 	ТаблицаНачислений);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаНачислений.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ТаблицаНачислений.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете,
	|	ТаблицаНачислений.Подразделение КАК Подразделение,
	|	ТаблицаНачислений.ВидОперации КАК ВидОперации,
	|	ТаблицаНачислений.СтатьяРасходов КАК СтатьяРасходов,
	|	ТаблицаНачислений.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ТаблицаНачислений.ДоговорКонтрагента КАК ДоговорКонтрагента
	|ПОМЕСТИТЬ ТаблицаНачисленийИсходная
	|ИЗ
	|	&ТаблицаНачислений КАК ТаблицаНачислений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНачислений.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ТаблицаНачислений.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете,
	|	ТаблицаНачислений.Подразделение КАК Подразделение,
	|	ТаблицаНачислений.ВидОперации КАК ВидОперации,
	|	ТаблицаНачислений.СтатьяРасходов КАК СтатьяРасходов,
	|	ТаблицаНачислений.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ТаблицаНачислений.ДоговорКонтрагента КАК ДоговорКонтрагента
	|ПОМЕСТИТЬ ТаблицаНачислений
	|ИЗ
	|	ТаблицаНачисленийИсходная КАК ТаблицаНачислений
	|ГДЕ
	|	ТаблицаНачислений.ВидОперации В(&ВидыОпераций)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНачислений.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ТаблицаНачислений.Подразделение КАК Подразделение,
	|	ТаблицаНачислений.ВидОперации КАК ВидОперации,
	|	ТаблицаНачислений.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете,
	|	ТаблицаНачислений.СтатьяРасходов КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК Счет,
	|	НЕОПРЕДЕЛЕНО КАК Субконто1,
	|	НЕОПРЕДЕЛЕНО КАК Субконто2,
	|	НЕОПРЕДЕЛЕНО КАК Субконто3,
	|	ТаблицаНачислений.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ТаблицаНачислений.ДоговорКонтрагента КАК ДоговорКонтрагента
	|ИЗ
	|	ТаблицаНачислений КАК ТаблицаНачислений";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	СправочникНалогНДФЛ = Справочники.ВидыНалоговИПлатежейВБюджет.НайтиПоРеквизиту("КодБК", "18210102010011000110");
	
	Для Каждого СтрокаРезультат Из Результат Цикл
		СтрокаРезультат.Счет 		= ЮС_СчетаУчетаВДокументах.ПолучитьСчетаУчетаВидовНалогов(Реквизиты.Организация, СправочникНалогНДФЛ, СтрокаРезультат.РегистрацияВНалоговомОргане).СчетУчетаПассивный;
		СтрокаРезультат.Субконто1 	= Перечисления.ВидыПлатежейВГосБюджет.Налог;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура СформироватьПроводкиПоОтражениюЗарплатыВУчете(ТаблицаЗаработнойПлаты, Реквизиты, Движения, Отказ)
	
	Если ТаблицаЗаработнойПлаты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОтражатьВНалоговомУчете = УчетнаяПолитика.ПлательщикНалогаНаПрибыль(Реквизиты.Организация, Реквизиты.Период);
	ВестиУчетПоРаботникам   = Константы.ВедетсяУчетРасчетовПоЗарплатеПоРаботникам.Получить();
	
	ДополнитьТаблицуЗаработнойПлатыРезервовЛицевымиСчетами(ТаблицаЗаработнойПлаты, Реквизиты, ВестиУчетПоРаботникам);
	
	ТаблицаНачисленийУдержаний = ПодготовитьТаблицуНачисленийУдержаний(ТаблицаЗаработнойПлаты,,,Реквизиты);
	ТаблицаНалоговВзносовСФОТ  = ПодготовитьТаблицуНалоговВзносовСФОТ(ТаблицаЗаработнойПлаты,,,Реквизиты);
	ТаблицаДепонентов          = ПодготовитьТаблицуДепонентов(Реквизиты, ТаблицаЗаработнойПлаты);
	
	МассивТаблицПоЗаработнойПлате = Новый Массив;
	МассивТаблицПоЗаработнойПлате.Добавить(ТаблицаНачисленийУдержаний);
	МассивТаблицПоЗаработнойПлате.Добавить(ТаблицаНалоговВзносовСФОТ);
	МассивТаблицПоЗаработнойПлате.Добавить(ТаблицаДепонентов);
	
	СодержанияПроводок = Новый Соответствие;	
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.НачисленоДоход,
									НСтр("ru = 'Начислена заработная плата'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.НатуральныйДоход,
									НСтр("ru = 'Начислен доход в натуральной форме'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.НачисленоСдельноДоход,
									НСтр("ru = 'Начислена заработная плата (сдельно)'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ДивидендыСотрудников,
									НСтр("ru = 'Начислены дивиденды'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.Дивиденды,
									НСтр("ru = 'Начислены дивиденды'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ДоходыКонтрагентов,
									НСтр("ru = 'Начислен доход прочему физическому лицу'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ВыплатыБывшимСотрудникам,
									НСтр("ru = 'Начислен доход бывшему работнику'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ДоговорАвторскогоЗаказа,
									НСтр("ru = 'Начислен доход по договору авторского заказа'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ДоговорРаботыУслуги,
									НСтр("ru = 'Начислен доход по договору гражданско-правового характера'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.НДФЛ,
									НСтр("ru = 'Удержан НДФЛ'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.НДФЛСПревышения,
									НСтр("ru = 'Удержан НДФЛ с доходов свыше предельной величины'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.НДФЛДоначисленныйПоРезультатамПроверки,
									НСтр("ru = 'Доначислен НДФЛ'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.НФДЛДивидендыСотрудникам,
									НСтр("ru = 'Удержан НДФЛ с дивидендов'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.НФДЛДивиденды,
									НСтр("ru = 'Удержан НДФЛ с дивидендов'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.НДФЛПрочиеРасчетыСПерсоналом,
									НСтр("ru = 'Удержан НДФЛ по прочим расчетам с персоналом'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.НДФЛПередачаЗадолженностиВНалоговыйОрган,
									НСтр("ru = 'Задолженность по НДФЛ передана в налоговый орган'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.НДФЛДоходыКонтрагентов,
									НСтр("ru = 'Удержан НДФЛ по расчетам с прочими физическими лицами'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.НДФЛРасчетыСБывшимиСотрудниками,
									НСтр("ru = 'Удержан НДФЛ по расчетам с бывшим работником'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ВзносыПоЕдиномуТарифу,
									НСтр("ru = 'Страховые взносы (единый тариф)'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ПФРНакопительнаяЧасть,
									НСтр("ru = 'Накопительная часть трудовой пенсии'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ПФРСтраховаяЧасть,
									НСтр("ru = 'Страховая часть трудовой пенсии'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ПФРПоСуммарномуТарифу,
									НСтр("ru = 'Обязательное пенсионное страхование'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ПФРДоПредельнойВеличины,
									НСтр("ru = 'Обязательное пенсионное страхование'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ПФРСПревышения,
									НСтр("ru = 'Обязательное пенсионное страхование по тарифу свыше предельной величины базы для начисления страховых взносов'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ПФРДополнительныйТарифЛЭ,
									НСтр("ru = 'Взносы на доплату к пенсии членам летных экипажей'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ПФРДополнительныйТарифШахтеры,
									НСтр("ru = 'Взносы на доплату к пенсии работникам угольной промышленности'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
									НСтр("ru = 'Дополнительные взносы на работников, занятым на работах с вредными условиями труда'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
									НСтр("ru = 'Дополнительные взносы на работников, занятым на работах с тяжелыми условиями труда'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки,
									НСтр("ru = 'Дополнительные взносы на работников, занятым на работах с вредными условиями труда при отсутствии спецоценки'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка,
									НСтр("ru = 'Дополнительные взносы на работников, занятым на работах с вредными условиями труда'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки,
									НСтр("ru = 'Дополнительные взносы на работников, занятым на работах с тяжелыми условиями труда при отсутствии спецоценки'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка,
									НСтр("ru = 'Дополнительные взносы на работников, занятым на работах с тяжелыми условиями труда'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ФСС,
									НСтр("ru = 'Расчеты по социальному страхованию'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ФССНС,
									НСтр("ru = 'Расчеты по обязательному социальному страхованию от НС и ПЗ'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ФФОМС,
									НСтр("ru = 'Федеральный фонд ОМС'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ТФОМС,
									НСтр("ru = 'Территориальный фонд ОМС'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюФССНС,
									НСтр("ru = 'Расчеты по обязательному социальному страхованию от НС и ПЗ'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюФСС,
									НСтр("ru = 'Расчеты по социальному страхованию'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.Депонирование,
									НСтр("ru = 'Депонирование невыплаченной заработной платы'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.СписаниеДепонента,
									НСтр("ru = 'Списание депонированной заработной платы'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ПрочиеРасчетыСПерсоналом,
									НСтр("ru = 'Прочие расчеты с персоналом'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.МатериальнаяПомощь,
									НСтр("ru = 'Материальная помощь'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюРаботодатель,
									НСтр("ru = 'Оплата больничного за счет работодателя'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЗаЗадержкуЗарплаты,
									НСтр("ru = 'Компенсация за задержку зарплаты'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпуск,
									НСтр("ru = 'Начислен ежегодный отпуск'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательства,
									НСтр("ru = 'Начислен ежегодный отпуск за счете оценочных обязательств по отпускам'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательстваИРезервы,
									НСтр("ru = 'Начислен ежегодный отпуск'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускРезервы,
									НСтр("ru = 'Начислен ежегодный отпуск за счет резервов отпусков'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпуска,
									НСтр("ru = 'Компенсация ежегодного отпуска'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпускаОценочныеОбязательства,
									НСтр("ru = 'Компенсация ежегодного отпуска за счете оценочных обязательств по отпускам'"));
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ПособиеНаПогребение,
									НСтр("ru = 'Социальное пособие на погребение'"));
	
	МассивСчетРасчетовСПерсоналомПоОплатеТруда = Новый Массив();
	МассивСчетРасчетовСПерсоналомПоОплатеТруда.Добавить(ПланыСчетов.ЕПС.НайтиПоКоду("60305"));
	МассивСчетРасчетовСПерсоналомПоОплатеТруда.Добавить(ПланыСчетов.ЕПС.НайтиПоКоду("60306"));
	
	// СК [07.10.2022] (доходы/расходы ЗП по подразделениям)
	МассивСчетовДоходовРасходов = Новый Массив();
	МассивСчетовДоходовРасходов.Добавить(ПланыСчетов.ЕПС.НайтиПоКоду("71801"));
	МассивСчетовДоходовРасходов.Добавить(ПланыСчетов.ЕПС.НайтиПоКоду("71802"));
	// \

	ВалютаУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Если Движения.ЕПС.ДополнительныеСвойства.Свойство("СуммыНалоговогоУчетаЗаполнены")
		И Движения.ЕПС.ДополнительныеСвойства.СуммыНалоговогоУчетаЗаполнены = Истина Тогда
		СуммыНалоговогоУчетаЗаполнены = Истина;
	Иначе
		СуммыНалоговогоУчетаЗаполнены = Ложь;
	КонецЕсли;
	
	Для Каждого ТаблицаМассива Из МассивТаблицПоЗаработнойПлате Цикл
		
		Если ТаблицаМассива.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ЕстьКолонкаСчетНУ = Ложь;
		Если ТаблицаМассива.Колонки.Найти("СчетНУ") <> Неопределено Тогда
			ЕстьКолонкаСчетНУ = Истина;
		КонецЕсли;
		
		Для Каждого СтрокаТаблицы Из ТаблицаМассива Цикл
			
			Если Не ЗначениеЗаполнено(СтрокаТаблицы.Счет)
				Или Не ЗначениеЗаполнено(СтрокаТаблицы.КорСчет) Тогда
				// не заполнены счет и аналитика
				Продолжить;
			КонецЕсли;
			
			Если СтрокаТаблицы.Сумма = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			УказанСчетНУ = Ложь;
			Если ЕстьКолонкаСчетНУ Тогда
				УказанСчетНУ = ЗначениеЗаполнено(СтрокаТаблицы.СчетНУ);
			КонецЕсли;
			
			Проводка = Движения.ЕПС.Добавить();
			Проводка.Период      = Реквизиты.Период;
			Проводка.Организация = Реквизиты.Организация;
			Проводка.Сумма       = СтрокаТаблицы.Сумма;
			Проводка.Содержание  = СодержанияПроводок.Получить(СтрокаТаблицы.ВидОперации);
			
			Проводка.СчетДт 		= СтрокаТаблицы.Счет.Владелец;
			Проводка.ЛицевойСчетДт  = СтрокаТаблицы.Счет;
			
			Если Проводка.СчетДт.Валютный Тогда
				Проводка.ВалютаДт        = ВалютаУчета;
				Проводка.ВалютнаяСуммаДт = Проводка.Сумма;
			КонецЕсли;
			
			// Для материальной помощи, если она не должна отражаться в НУ (не заполнен ВидНачисленийОплатыТрудаПоСтатье255НК)
			// требуется отразить ПР
			Если СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.МатериальнаяПомощь Тогда
				Если ВестиУчетПоРаботникам Тогда
					Если Не ЗначениеЗаполнено(СтрокаТаблицы.Субконто2) Тогда
						Проводка.СуммаПРДт = Проводка.Сумма;
					КонецЕсли;
				КонецЕсли; 
			КонецЕсли;
			
			СвойстваСчетаДт = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка.СчетДт);
			Если МассивСчетРасчетовСПерсоналомПоОплатеТруда.Найти(Проводка.СчетДт) <> Неопределено  Тогда
				Если ВестиУчетПоРаботникам Тогда
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "РаботникиОрганизаций", 					СтрокаТаблицы.Субконто1);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ВидНачисленийОплатыТрудаПоСтатье255НК", СтрокаТаблицы.Субконто2);
				Иначе
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ВидНачисленийОплатыТрудаПоСтатье255НК", СтрокаТаблицы.Субконто1);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТаблицы.Субконто2);
				КонецЕсли;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТаблицы.Субконто3);
				// Требуется при переносе сумм сформированного резерва в подразделение Дт записывать всегда основное
				Если СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпуск
					Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательства
					Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательстваИРезервы
					Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпуска
					Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпускаОценочныеОбязательства Тогда
					Если СвойстваСчетаДт.УчетПоПодразделениям Тогда
						Проводка.ПодразделениеДт = СтрокаТаблицы.Подразделение;
					КонецЕсли;
				Иначе
					Если СвойстваСчетаДт.УчетПоПодразделениям Тогда
						Проводка.ПодразделениеДт = СтрокаТаблицы.ПодразделениеУчетаНачислений;
					КонецЕсли;
				КонецЕсли;
			Иначе
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТаблицы.Субконто1);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТаблицы.Субконто2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТаблицы.Субконто3);
				Если СвойстваСчетаДт.УчетПоПодразделениям Тогда
					// СК [07.10.2022] (доходы/расходы ЗП по подразделениям)	
					Если МассивСчетовДоходовРасходов.Найти(Проводка.СчетДт) <> Неопределено  Тогда
						Проводка.ПодразделениеДт = СтрокаТаблицы.ПодразделениеДоходовРасходов;	
					Иначе
						Проводка.ПодразделениеДт = СтрокаТаблицы.Подразделение;	
					КонецЕсли;
					// \  									
				КонецЕсли;
			КонецЕсли;
						
			Если УказанСчетНУ 
				И ОтражатьВНалоговомУчете Тогда
				Если СвойстваСчетаДт.НалоговыйУчет Тогда
					Проводка.СуммаВРДт = СтрокаТаблицы.Сумма;
				КонецЕсли;
			КонецЕсли;
			
			Проводка.СчетКт 		= СтрокаТаблицы.КорСчет.Владелец;
			Проводка.ЛицевойСчетКт 	= СтрокаТаблицы.КорСчет;
			
			Если Проводка.СчетКт.Валютный Тогда
				Проводка.ВалютаКт        = ВалютаУчета;
				Проводка.ВалютнаяСуммаКт = Проводка.Сумма;
			КонецЕсли;
			
			СвойстваСчетаКт = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка.СчетКт);
			Если МассивСчетРасчетовСПерсоналомПоОплатеТруда.Найти(Проводка.СчетКт) <> Неопределено Тогда
				Если ВестиУчетПоРаботникам Тогда
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "РаботникиОрганизаций", СтрокаТаблицы.КорСубконто1);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ВидНачисленийОплатыТрудаПоСтатье255НК", СтрокаТаблицы.КорСубконто2);
				Иначе
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ВидНачисленийОплатыТрудаПоСтатье255НК", СтрокаТаблицы.КорСубконто1);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаТаблицы.КорСубконто2);
				КонецЕсли;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтрокаТаблицы.КорСубконто3);
				Если СвойстваСчетаКт.УчетПоПодразделениям Тогда
					Проводка.ПодразделениеКт = СтрокаТаблицы.ПодразделениеУчетаНачислений;					
				КонецЕсли;
			Иначе
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаТаблицы.КорСубконто1);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаТаблицы.КорСубконто2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтрокаТаблицы.КорСубконто3);
				Если СвойстваСчетаКт.УчетПоПодразделениям Тогда
					// СК [07.10.2022] (доходы/расходы ЗП по подразделениям)	
					Если МассивСчетовДоходовРасходов.Найти(Проводка.СчетКт) <> Неопределено  Тогда
						Проводка.ПодразделениеКт = СтрокаТаблицы.ПодразделениеДоходовРасходов;	
					Иначе
						Проводка.ПодразделениеКт = СтрокаТаблицы.Подразделение;	
					КонецЕсли;
					// \
				КонецЕсли; 				
				
			КонецЕсли;
			
			Если УказанСчетНУ 
				И ОтражатьВНалоговомУчете Тогда
				
				// указан счет НУ - отличный от БУ
				// это в частности страховые взносы 
				// по переходящим отпускам
				
				СвойстваСчетаДт = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(СтрокаТаблицы.СчетНУ);
				Если НЕ СвойстваСчетаДт.НалоговыйУчет Тогда
					Продолжить;
				КонецЕсли;
				
				Проводка = Движения.ЕПС.Добавить();
				Проводка.Период      = Реквизиты.Период;
				Проводка.Организация = Реквизиты.Организация;
				Проводка.СуммаНУДт   = СтрокаТаблицы.Сумма;
				Проводка.СуммаВРДт   = -СтрокаТаблицы.Сумма;
				Проводка.Содержание  = СодержанияПроводок.Получить(СтрокаТаблицы.ВидОперации);
				
				Проводка.СчетДт = СтрокаТаблицы.СчетНУ;
				
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТаблицы.СубконтоНУ1);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТаблицы.СубконтоНУ2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТаблицы.СубконтоНУ3);
				
				СвойстваСчетаДт = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка.СчетДт);
				Если СвойстваСчетаДт.УчетПоПодразделениям Тогда
					Проводка.ПодразделениеДт = СтрокаТаблицы.Подразделение;
				КонецЕсли;
				
				Проводка.СчетКт = СтрокаТаблицы.КорСчет;
				
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаТаблицы.КорСубконто1);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаТаблицы.КорСубконто2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтрокаТаблицы.КорСубконто3);
				
				СвойстваСчетаКт = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка.СчетКт);
				Если СвойстваСчетаКт.УчетПоПодразделениям Тогда
					Проводка.ПодразделениеКт = СтрокаТаблицы.Подразделение;
				КонецЕсли;
				
			КонецЕсли;
			
			// Ситуация может возникнуть, если в док-те есть компенсации отпусков
			Если СуммыНалоговогоУчетаЗаполнены Тогда
				
				СвойствоСчетДт = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка.СчетДт);
				СвойствоСчетКт = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка.СчетКт);
				
				Если НЕ СвойствоСчетДт.НалоговыйУчет И (Проводка.СуммаНУДт <> 0 ИЛИ Проводка.СуммаПРДт <> 0 ИЛИ Проводка.СуммаВРДт <> 0) Тогда
					
					Проводка.СуммаНУДт = 0;
					Проводка.СуммаПРДт = 0;
					Проводка.СуммаВРДт = 0;
					
				КонецЕсли;
				Если НЕ СвойствоСчетКт.НалоговыйУчет И (Проводка.СуммаНУКт <> 0 ИЛИ Проводка.СуммаПРКт <> 0 ИЛИ Проводка.СуммаВРКт <> 0) Тогда
					
					Проводка.СуммаНУКт = 0;
					Проводка.СуммаПРКт = 0;
					Проводка.СуммаВРКт = 0;
					
				КонецЕсли;
				Если СвойствоСчетДт.НалоговыйУчет И Проводка.СуммаНУДт = 0 И Проводка.СуммаПРДт = 0 И Проводка.СуммаВРДт = 0 Тогда
					
					Проводка.СуммаНУДт = Проводка.Сумма;
					
				КонецЕсли;
				Если СвойствоСчетКт.НалоговыйУчет И Проводка.СуммаНУКт = 0 И Проводка.СуммаПРКт = 0 И Проводка.СуммаВРКт = 0 Тогда
					
					Проводка.СуммаНУКт = Проводка.Сумма;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Движения.ЕПС.Записывать = Истина;
	
КонецПроцедуры

Функция СоздатьКлючСортировки(ИсходныеДанные)
	
	ПриоритетВидаОперации = 1000;
	
	// Доходы
	// Диапазон ключей 1-100
	// 1-50   :: Доходы работников
	// 51-70  :: Договора
	// 71-80  :: Дивиденды
	// 81-100 :: Прочие

	Если ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НачисленоДоход Тогда
		ПриоритетВидаОперации = 1;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НачисленоСдельноДоход Тогда
		ПриоритетВидаОперации = 2;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НатуральныйДоход Тогда
		ПриоритетВидаОперации = 3;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.МатериальнаяПомощь Тогда
		ПриоритетВидаОперации = 4;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюБюджет Тогда
		ПриоритетВидаОперации = 5;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюРаботодатель Тогда
		ПриоритетВидаОперации = 6;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюФСС Тогда
		ПриоритетВидаОперации = 7;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюФССНС Тогда
		ПриоритетВидаОперации = 8;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпуск Тогда
		ПриоритетВидаОперации = 9;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательстваИРезервы Тогда
		ПриоритетВидаОперации = 10;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательства Тогда
		ПриоритетВидаОперации = 11;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускРезервы Тогда
		ПриоритетВидаОперации = 12;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпуска Тогда
		ПриоритетВидаОперации = 31;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпускаОценочныеОбязательства Тогда
		ПриоритетВидаОперации = 32;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ДоговорРаботыУслуги Тогда
		ПриоритетВидаОперации = 51;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ДоходыКонтрагентов Тогда
		ПриоритетВидаОперации = 52;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ДоговорАвторскогоЗаказа Тогда
		ПриоритетВидаОперации = 53;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ДивидендыСотрудников Тогда
		ПриоритетВидаОперации = 71;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.Дивиденды Тогда
		ПриоритетВидаОперации = 72;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПрочиеРасчетыСПерсоналом Тогда
		ПриоритетВидаОперации = 82;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгента Тогда
		ПриоритетВидаОперации = 83;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ВыплатыБывшимСотрудникам Тогда
		ПриоритетВидаОперации = 84;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПособиеНаПогребение Тогда
		ПриоритетВидаОперации = 85;
	КонецЕсли;
	
	// Удержания
	// Диапазон ключей 201-300
	// 201-220 :: НДФЛ
	// 221-240 :: Исполительные документы
	// 241-260 :: Удержания текущей деятельности
	// 261-270 :: Удержания текущей деятельности (нарушения)
	// 271–280 :: Удержания добровольных взносов
	// 291-300 :: Прочие
	Если ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НДФЛ Тогда
		ПриоритетВидаОперации = 201;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НДФЛДоходыКонтрагентов Тогда
		ПриоритетВидаОперации = 202;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НФДЛДивидендыСотрудникам Тогда
		ПриоритетВидаОперации = 203;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НДФЛДоначисленныйПоРезультатамПроверки Тогда
		ПриоритетВидаОперации = 204;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НФДЛДивиденды Тогда
		ПриоритетВидаОперации = 205;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НДФЛПрочиеРасчетыСПерсоналом Тогда
		ПриоритетВидаОперации = 206;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НДФЛРасчетыСБывшимиСотрудниками Тогда
		ПриоритетВидаОперации = 207;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НДФЛСПревышения Тогда
		ПриоритетВидаОперации = 208;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛисты Тогда
		ПриоритетВидаОперации = 221;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.Профвзносы Тогда
		ПриоритетВидаОперации = 241;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПроцентыПоЗайму Тогда
		ПриоритетВидаОперации = 242;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПогашениеЗаймов Тогда
		ПриоритетВидаОперации = 243;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ВозмещениеУщерба Тогда
		ПриоритетВидаОперации = 261;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.УдержаниеНеизрасходованныхПодотчетныхСумм Тогда
		ПриоритетВидаОперации = 262;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.УдержаниеЗаОтпуск Тогда
		ПриоритетВидаОперации = 263;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.УдержаниеПоПрочимОперациямСРаботниками Тогда
		ПриоритетВидаОперации = 264;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ДСВ Тогда
		ПриоритетВидаОперации = 271;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ДобровольныеВзносыВНПФ Тогда
		ПриоритетВидаОперации = 272;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ДобровольныеВзносыВНПФ Тогда
		ПриоритетВидаОперации = 281;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НачисленоПроцентовПоЗайму Тогда
		ПриоритетВидаОперации = 291;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛистыКонтрагенты Тогда
		ПриоритетВидаОперации = 292;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгентаКонтрагенты Тогда
		ПриоритетВидаОперации = 293;
	КонецЕсли;
	
	// Взносы
	// Диапазон ключей 301-400
	Если ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ФСС Тогда
		ПриоритетВидаОперации = 301;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПФРПоСуммарномуТарифу Тогда
		ПриоритетВидаОперации = 302;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПФРСтраховаяЧасть Тогда
		ПриоритетВидаОперации = 303;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПФРНакопительнаяЧасть Тогда
		ПриоритетВидаОперации = 304;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ФФОМС Тогда
		ПриоритетВидаОперации = 305;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ТФОМС Тогда
		ПриоритетВидаОперации = 306;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ФССНС Тогда
		ПриоритетВидаОперации = 307;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПФРДополнительныйТарифШахтеры Тогда
		ПриоритетВидаОперации = 308;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПФРДополнительныйТарифЛЭ Тогда
		ПриоритетВидаОперации = 309;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах Тогда
		ПриоритетВидаОперации = 310;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах Тогда
		ПриоритетВидаОперации = 311;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПФРДоПредельнойВеличины Тогда
		ПриоритетВидаОперации = 312;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПФРСПревышения Тогда
		ПриоритетВидаОперации = 313;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки Тогда
		ПриоритетВидаОперации = 314;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка Тогда
		ПриоритетВидаОперации = 315;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки Тогда
		ПриоритетВидаОперации = 316;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка Тогда
		ПриоритетВидаОперации = 317;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ВзносыПоЕдиномуТарифу Тогда
		ПриоритетВидаОперации = 318;
	КонецЕсли;
	
	// Расчеты
	// Диапазон ключей 401-...
	// 401-410  :: Депоненты
	// 411-420  :: Компенсации
	// 421-430  :: Расчеты по налогам
	// 431-...  :: Расчеты по доходам
	Если ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.Депонирование Тогда
		ПриоритетВидаОперации = 401;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.СписаниеДепонента Тогда
		ПриоритетВидаОперации = 402;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЗаЗадержкуЗарплаты Тогда
		ПриоритетВидаОперации = 411;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НДФЛПередачаЗадолженностиВНалоговыйОрган Тогда
		ПриоритетВидаОперации = 421;
	ИначеЕсли ИсходныеДанные.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ВозвратИзлишнеВыплаченныхСуммВследствиеСчетныхОшибок Тогда
		ПриоритетВидаОперации = 431;
	КонецЕсли;
	
	Возврат ПриоритетВидаОперации;
		
КонецФункции

Функция ПодготовитьТаблицуНачисленийУдержаний(ТаблицаЗаработнойПлаты, УСН = Ложь, ИП = Ложь, Реквизиты)
		
	ТаблицаНачисленийИУдержаний = ТаблицаЗаработнойПлаты.СкопироватьКолонки();
	ТаблицаНачисленийИУдержаний.Колонки.Добавить("КорСчет");
	ТаблицаНачисленийИУдержаний.Колонки.Добавить("КорСубконто1");
	ТаблицаНачисленийИУдержаний.Колонки.Добавить("КорСубконто2");
	ТаблицаНачисленийИУдержаний.Колонки.Добавить("КорСубконто3");
	ТаблицаНачисленийИУдержаний.Колонки.Добавить("КлючСортировки");
		
	ЕстьУчетНУ = Ложь;
	
	Если ТаблицаЗаработнойПлаты.Найти(Перечисления.ВидыОперацийПоЗарплате.МатериальнаяПомощь, "ВидОперации") <> Неопределено
		Или ТаблицаЗаработнойПлаты.Найти(Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускРезервы, "ВидОперации") <> Неопределено
		Или ТаблицаЗаработнойПлаты.Найти(Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательства , "ВидОперации") <> Неопределено
		Или ТаблицаЗаработнойПлаты.Найти(Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательстваИРезервы , "ВидОперации") <> Неопределено
		Или ТаблицаЗаработнойПлаты.Найти(Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпускаОценочныеОбязательства , "ВидОперации") <> Неопределено Тогда
		
		ЕстьУчетНУ = Истина;
		
	КонецЕсли;
	
	// Счета учета
	СчетРасчетовПоУдержаниям			        = ПланыСчетов.ЕПС.НайтиПоКоду("10801");             
	ПустойСчет                                  = ПланыСчетов.ЕПС.ПустаяСсылка();
	
	// Аналитика учета
	ВидПлатежаВГосБюджет                        = Перечисления.ВидыПлатежейВГосБюджет.Налог;
	ВидПлатежаВГосБюджетАкт                     = Перечисления.ВидыПлатежейВГосБюджет.НалогАкт;
	ВидПлатежаВГосБюджетРасходыПоСтрахованию    = Перечисления.ВидыПлатежейВГосБюджет.РасходыПоСтрахованию;
	КомпенсацияЗаЗадержкуЗарплаты               = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПрочиеДоходыИРасходы.КомпенсацияЗаЗадержкуЗарплаты");
	ВидыНачисленийОплатыТрудаДляНУ_пп7ст255     = Перечисления.ВидыНачисленийОплатыТрудаДляНУ.пп7ст255;
	ПустоеСубконто                              = ПланыВидовХарактеристик.ЕПСВидыСубконто.ПустаяСсылка();
	
	ОтражениеВРегламентированномУчетеНастройкиОрганизаций 	= ОтражениеЗарплатыВБухучете.ОтражениеВРегламентированномУчетеНастройкиОрганизаций();
	ФормироватьПроводкиВКонцеПериодаПоОрганизациям			= ОтражениеВРегламентированномУчетеНастройкиОрганизаций.ФормироватьПроводкиВКонцеПериодаПоОрганизациям[Реквизиты.Организация];
	
	ВестиУчетПоРаботникам                    = Константы.ВедетсяУчетРасчетовПоЗарплатеПоРаботникам.Получить();
	УчетЗарплатыИКадровСредствамиБухгалтерии = Константы.УчетЗарплатыИКадровСредствамиБухгалтерии.Получить();
	УчетРезервовОтпусковНУ                   = ВедетсяУчетРезервовОтпусковПоВидамУчета(Реквизиты.Организация, Реквизиты.Период, "НУ");
	
	Для Каждого СтрокаТаблицы Из ТаблицаЗаработнойПлаты Цикл
		
		Если СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НачисленоДоход
			Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НачисленоСдельноДоход
			Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ДивидендыСотрудников
			Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюФССНС
			Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюФСС
			Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюРаботодатель
			Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюБюджет
			Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.МатериальнаяПомощь
			Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпуска 
			Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпускаОценочныеОбязательства Тогда
			
			НоваяСтрока = ТаблицаНачисленийИУдержаний.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			
			НоваяСтрока.КорСчет      = СтрокаТаблицы.СчетУчетаПассивный;
			Если ВестиУчетПоРаботникам Или УчетЗарплатыИКадровСредствамиБухгалтерии Тогда
				НоваяСтрока.КорСубконто1 = СтрокаТаблицы.ФизическоеЛицо;
				НоваяСтрока.КорСубконто2 = СтрокаТаблицы.ВидНачисленияОплатыТрудаДляНУ;
			Иначе
				НоваяСтрока.КорСубконто1 = СтрокаТаблицы.ВидНачисленияОплатыТрудаДляНУ;
			КонецЕсли;
						
			НоваяСтрока.КлючСортировки = СоздатьКлючСортировки(СтрокаТаблицы);
			
		ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ДоговорАвторскогоЗаказа
			Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ДоговорРаботыУслуги 
			Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПособиеНаПогребение Тогда
						
			Если ЗначениеЗаполнено(СтрокаТаблицы.ДоговорКонтрагента) Тогда
				
				// Ищем лицевые счета по найденному договору и контрагенту
				ЛицевойСчетПоДоговору = ЮС_СчетаУчетаВДокументах.ПолучитьСчетаРасчетовСКонтрагентом(Реквизиты.Организация, СтрокаТаблицы.ДоговорКонтрагента.Владелец, 
										СтрокаТаблицы.ДоговорКонтрагента, СтрокаТаблицы.ДоговорКонтрагента.ЕПСПараметрОтраженияВБУ).СчетУчетаКредиторскойЗадолженности;
				
				Если ЗначениеЗаполнено(ЛицевойСчетПоДоговору) Тогда
					
					НоваяСтрока = ТаблицаНачисленийИУдержаний.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
					
					НоваяСтрока.КорСчет      	= ЛицевойСчетПоДоговору;
					НоваяСтрока.КорСубконто1 	= СтрокаТаблицы.ДоговорКонтрагента.Владелец;
					НоваяСтрока.КорСубконто2 	= СтрокаТаблицы.ДоговорКонтрагента;
					НоваяСтрока.КлючСортировки 	= СоздатьКлючСортировки(СтрокаТаблицы);
					
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпуск Тогда
			
			// В ЕПС не используется, т.к. необходимо всегда формировать резервы по отпускам
			Продолжить; 
			
		ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательстваИРезервы
			Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательства Тогда
			
			// Начисление отпускных за счет резерва
			
			// Все начисления сделал документ "Отпуск" (за исключение ситуации, когда для организации выставлена настройка "Формировать проводки в конце периода"
			Если ТипЗнч(Реквизиты.Регистратор) = Тип("ДокументСсылка.ОтражениеЗарплатыВБухучете") 
				И Не ФормироватьПроводкиВКонцеПериодаПоОрганизациям Тогда
				Продолжить;
			КонецЕсли;
			
			// Найдем лицевые счета по резервам по отпускам, т.к. мы должны перенести с них сумму отпуска к выплате
			ТипВыплатыРаботнику = Перечисления.ЮС_ВидыВыплатРаботникам.РезервыПоОтпускам; 
			ИспользуемыеСчетаПоРаботникуРезервы = ЮС_СчетаУчетаВДокументах.ПолучитьСчетаРасчетовСРаботниками(Реквизиты.Организация, СтрокаТаблицы.ФизическоеЛицо,, ТипВыплатыРаботнику);
			
			Если ИспользуемыеСчетаПоРаботникуРезервы <> Неопределено
				Или ЗначениеЗаполнено(ИспользуемыеСчетаПоРаботникуРезервы.СчетУчетаПассивный) Тогда
				
				НоваяСтрока = ТаблицаНачисленийИУдержаний.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
				
				НоваяСтрока.Счет         = ИспользуемыеСчетаПоРаботникуРезервы.СчетУчетаПассивный;
				НоваяСтрока.Субконто1	 = СтрокаТаблицы.ФизическоеЛицо;
				
				НоваяСтрока.КорСчет      = СтрокаТаблицы.СчетУчетаПассивный;
				Если ВестиУчетПоРаботникам Тогда				
					НоваяСтрока.КорСубконто1 = СтрокаТаблицы.ФизическоеЛицо;
					НоваяСтрока.КорСубконто2 = ВидыНачисленийОплатыТрудаДляНУ_пп7ст255;				
				Иначе				
					НоваяСтрока.КорСубконто1 = ВидыНачисленийОплатыТрудаДляНУ_пп7ст255;				
				КонецЕсли;
				
				НоваяСтрока.СчетНУ = СтрокаТаблицы.СчетУчетаПассивный;
				НоваяСтрока.СубконтоНУ1 = СтрокаТаблицы.ФизическоеЛицо;
				НоваяСтрока.СубконтоНУ2 = ПустоеСубконто;
				НоваяСтрока.СубконтоНУ3 = ПустоеСубконто;
				
				НоваяСтрока.КлючСортировки = СоздатьКлючСортировки(СтрокаТаблицы);
				
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По сотруднику " + СтрокаТаблицы.ФизическоеЛицо + " не найдены лицевые счета! Начисления по нему не будут сформированы");
				Продолжить;
			КонецЕсли;
			
		ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускРезервы Тогда
			
			// Формирование резерва по отпускам
			Продолжить; 
						
		ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПрочиеРасчетыСПерсоналом Тогда
			
			НоваяСтрока = ТаблицаНачисленийИУдержаний.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			НоваяСтрока.КорСчет      = СтрокаТаблицы.СчетУчетаПассивный;;
			НоваяСтрока.КорСубконто1 = СтрокаТаблицы.ФизическоеЛицо;
			
			НоваяСтрока.КлючСортировки = СоздатьКлючСортировки(СтрокаТаблицы);
			
		ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ДоходыКонтрагентов
			Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ВыплатыБывшимСотрудникам Тогда
			
			НоваяСтрока = ТаблицаНачисленийИУдержаний.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			
			НоваяСтрока.КорСчет      	= СтрокаТаблицы.СчетУчетаПассивный;
			НоваяСтрока.КорСубконто1 	= СтрокаТаблицы.ФизическоеЛицо;
			НоваяСтрока.КлючСортировки 	= СоздатьКлючСортировки(СтрокаТаблицы);
			
		ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПособиеНаПогребение Тогда
			
			НоваяСтрока = ТаблицаНачисленийИУдержаний.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			НоваяСтрока.КорСчет      = СтрокаТаблицы.СчетУчетаПассивный;
			НоваяСтрока.КорСубконто1 = СтрокаТаблицы.ФизическоеЛицо;
						
			НоваяСтрока.КлючСортировки = СоздатьКлючСортировки(СтрокаТаблицы);
			
		ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.Дивиденды Тогда
			
			НоваяСтрока = ТаблицаНачисленийИУдержаний.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			НоваяСтрока.КорСчет      = СтрокаТаблицы.СчетУчетаПассивный;
			НоваяСтрока.КорСубконто1 = ПустоеСубконто; //Контрагент
			
			НоваяСтрока.КлючСортировки = СоздатьКлючСортировки(СтрокаТаблицы);
			
		ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЗаЗадержкуЗарплаты Тогда
			
			НоваяСтрока = ТаблицаНачисленийИУдержаний.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			
			НоваяСтрока.КорСчет      = СтрокаТаблицы.СчетУчетаПассивный;
			Если ВестиУчетПоРаботникам Или УчетЗарплатыИКадровСредствамиБухгалтерии Тогда
				НоваяСтрока.КорСубконто1 = СтрокаТаблицы.ФизическоеЛицо;
				НоваяСтрока.КорСубконто2 = СтрокаТаблицы.ВидНачисленияОплатыТрудаДляНУ;
			Иначе
				НоваяСтрока.КорСубконто1 = СтрокаТаблицы.ВидНачисленияОплатыТрудаДляНУ;
			КонецЕсли;
						
			НоваяСтрока.КлючСортировки = СоздатьКлючСортировки(СтрокаТаблицы);
			
		ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НДФЛ 
			Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НФДЛДивидендыСотрудникам
			Или  СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НДФЛСПревышения  Тогда
			
			НоваяСтрока = ТаблицаНачисленийИУдержаний.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			НоваяСтрока.Счет = СтрокаТаблицы.СчетУчетаПассивный;
			
			Если Не ЗначениеЗаполнено(НоваяСтрока.Субконто1) Тогда
				Если ВестиУчетПоРаботникам Или УчетЗарплатыИКадровСредствамиБухгалтерии Тогда
					НоваяСтрока.Субконто1    = СтрокаТаблицы.ФизическоеЛицо;			
				Иначе
					НоваяСтрока.Субконто1    = ПустоеСубконто;
				КонецЕсли;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(НоваяСтрока.Субконто2) Тогда
				НоваяСтрока.Субконто2    = ПустоеСубконто;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(НоваяСтрока.Субконто3) Тогда
				НоваяСтрока.Субконто3    = ПустоеСубконто;
			КонецЕсли;
			
			НоваяСтрока.КорСчет      = СтрокаТаблицы.СчетУчета;
			НоваяСтрока.КорСубконто1 = ВидПлатежаВГосБюджет;
			НоваяСтрока.КорСубконто2 = СтрокаТаблицы.РегистрацияВНалоговомОргане;
			НоваяСтрока.КорСубконто3 = ПустоеСубконто;
			
			НоваяСтрока.КлючСортировки = СоздатьКлючСортировки(СтрокаТаблицы);
			
		ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НДФЛДоначисленныйПоРезультатамПроверки Тогда
			
			НоваяСтрока = ТаблицаНачисленийИУдержаний.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			НоваяСтрока.Счет         = СтрокаТаблицы.СчетУчетаПассивный;
			
			Если ВестиУчетПоРаботникам ИЛИ ((УСН ИЛИ ИП) И УчетЗарплатыИКадровСредствамиБухгалтерии) Тогда
				НоваяСтрока.Субконто1    = СтрокаТаблицы.ФизическоеЛицо;			
			Иначе
				НоваяСтрока.Субконто1    = ПустоеСубконто;
			КонецЕсли;
			
			НоваяСтрока.Субконто2    = ПустоеСубконто;
			НоваяСтрока.Субконто3    = ПустоеСубконто;
			
			НоваяСтрока.КорСчет      = СтрокаТаблицы.СчетУчета;
			НоваяСтрока.КорСубконто1 = ВидПлатежаВГосБюджетАкт;
			НоваяСтрока.КорСубконто2 = СтрокаТаблицы.РегистрацияВНалоговомОргане;
			НоваяСтрока.КорСубконто3 = ПустоеСубконто;
			
			НоваяСтрока.КлючСортировки = СоздатьКлючСортировки(СтрокаТаблицы);
			
		ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НДФЛПрочиеРасчетыСПерсоналом Тогда
			
			НоваяСтрока = ТаблицаНачисленийИУдержаний.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			НоваяСтрока.Счет         = СтрокаТаблицы.СчетУчетаПассивный;
			НоваяСтрока.Субконто1    = СтрокаТаблицы.ФизическоеЛицо;			
			НоваяСтрока.Субконто2    = ПустоеСубконто;
			НоваяСтрока.Субконто3    = ПустоеСубконто;
			
			НоваяСтрока.КорСчет      = СтрокаТаблицы.СчетУчета;
			НоваяСтрока.КорСубконто1 = ВидПлатежаВГосБюджет;
			НоваяСтрока.КорСубконто2 = СтрокаТаблицы.РегистрацияВНалоговомОргане;
			НоваяСтрока.КорСубконто3 = ПустоеСубконто;
			
			НоваяСтрока.КлючСортировки = СоздатьКлючСортировки(СтрокаТаблицы);
			
		ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НДФЛПередачаЗадолженностиВНалоговыйОрган Тогда
			
			НоваяСтрока = ТаблицаНачисленийИУдержаний.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			НоваяСтрока.Счет = СтрокаТаблицы.СчетУчетаПассивный;
			
			Если ВестиУчетПоРаботникам Или ((УСН Или ИП) И УчетЗарплатыИКадровСредствамиБухгалтерии) Тогда
				НоваяСтрока.Субконто1    = СтрокаТаблицы.ФизическоеЛицо;			
			Иначе
				НоваяСтрока.Субконто1    = ПустоеСубконто;
			КонецЕсли;
			
			НоваяСтрока.Субконто2    = ПустоеСубконто;
			НоваяСтрока.Субконто3    = ПустоеСубконто;
			
			НоваяСтрока.КорСчет      = СтрокаТаблицы.СчетУчета;
			НоваяСтрока.КорСубконто1 = ВидПлатежаВГосБюджетАкт;
			НоваяСтрока.КорСубконто2 = СтрокаТаблицы.РегистрацияВНалоговомОргане;
			НоваяСтрока.КорСубконто3 = ПустоеСубконто;
			
			НоваяСтрока.Сумма        = - НоваяСтрока.Сумма;
			
			НоваяСтрока.КлючСортировки = СоздатьКлючСортировки(СтрокаТаблицы);
			
		ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НДФЛДоходыКонтрагентов 
			Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НДФЛРасчетыСБывшимиСотрудниками Тогда
			
			НоваяСтрока = ТаблицаНачисленийИУдержаний.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			
			НоваяСтрока.Счет         = СтрокаТаблицы.СчетУчетаПассивный;
			НоваяСтрока.Субконто1    = СтрокаТаблицы.ДоговорКонтрагента.Владелец; // Контрагент
			НоваяСтрока.Субконто2    = СтрокаТаблицы.ДоговорКонтрагента; // Договор
			НоваяСтрока.Субконто3    = ПустоеСубконто;
			
			НоваяСтрока.КорСчет      = СтрокаТаблицы.СчетУчета;
			НоваяСтрока.КорСубконто1 = ВидПлатежаВГосБюджет;
			НоваяСтрока.КорСубконто2 = СтрокаТаблицы.РегистрацияВНалоговомОргане;
			НоваяСтрока.КорСубконто3 = ПустоеСубконто;
			
			НоваяСтрока.КлючСортировки = СоздатьКлючСортировки(СтрокаТаблицы);
			
		ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НФДЛДивиденды Тогда
			
			НоваяСтрока = ТаблицаНачисленийИУдержаний.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			НоваяСтрока.Счет         = СтрокаТаблицы.СчетУчетаПассивный;
			Если ЗначениеЗаполнено(СтрокаТаблицы.ДоговорКонтрагента) Тогда
				НоваяСтрока.Субконто1    = СтрокаТаблицы.ДоговорКонтрагента.Владелец; // Контрагент
				НоваяСтрока.Субконто2    = СтрокаТаблицы.ДоговорКонтрагента; // Договор
				НоваяСтрока.Субконто3    = ПустоеСубконто;
			КонецЕсли;		
			НоваяСтрока.КорСчет      = СтрокаТаблицы.СчетУчета;
			НоваяСтрока.КорСубконто1 = ВидПлатежаВГосБюджет;
			НоваяСтрока.КорСубконто2 = СтрокаТаблицы.РегистрацияВНалоговомОргане;
			НоваяСтрока.КорСубконто3 = ПустоеСубконто;
			
			НоваяСтрока.КлючСортировки = СоздатьКлючСортировки(СтрокаТаблицы);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// СК [07.10.2022] (доходы/расходы ЗП по подразделениям) - добавила ПодразделениеДоходовРасходов
	
	СтрокаСвертки = "КлючСортировки, ВидОперации, Подразделение, ПодразделениеУчетаНачислений, ПодразделениеДоходовРасходов, Счет, Субконто1, Субконто2, Субконто3, КорСчет, КорСубконто1, КорСубконто2, КорСубконто3";
	
	Если ЕстьУчетНУ Тогда
		СтрокаСвертки = СтрокаСвертки + ", СчетНУ, СубконтоНУ1, СубконтоНУ2, СубконтоНУ3";
	КонецЕсли;
	
	ТаблицаНачисленийИУдержаний.Свернуть(СтрокаСвертки, "Сумма");
	ТаблицаНачисленийИУдержаний.Сортировать(СтрокаСвертки);
	
	Возврат ТаблицаНачисленийИУдержаний;
		
КонецФункции

// Получить контрагента и основной договор по физическому лицу
//
// Параметры:
//  Организация		 - СправочникСсылка.Организации	 - организация, по которой нужно найти основной договор контрагента
//  ФизическоеЛицо	 - СправочникСсылка.ФизическиеЛица	 - физ. лицо, по которому нужно выполнить поиск 
// 
// Возвращаемое значение:
//  Структуру - Контрагент, Договор 
//
Функция ПолучитьКонтрагентаПоФизическомуЛицу(Организация, ФизическоеЛицо) Экспорт
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Контрагент");
	СтруктураВозврата.Вставить("Договор");
	
	// Необходимо найти контрагента, связанного с физ. лицом
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Контрагенты.Ссылка КАК Контрагент
	|ПОМЕСТИТЬ ВрТ_Контрагент
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Наименование = &Наименование
	|	И Контрагенты.ИНН = &ИНН
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТ_Контрагент.Контрагент КАК Контрагент,
	|	ОсновныеДоговорыКонтрагента.Договор КАК Договор
	|ИЗ
	|	ВрТ_Контрагент КАК ВрТ_Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеДоговорыКонтрагента КАК ОсновныеДоговорыКонтрагента
	|		ПО ВрТ_Контрагент.Контрагент = ОсновныеДоговорыКонтрагента.Контрагент
	|ГДЕ
	|	ОсновныеДоговорыКонтрагента.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Наименование", 	ФизическоеЛицо.Наименование);
	Запрос.УстановитьПараметр("ИНН", 			ФизическоеЛицо.ИНН);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);
	Иначе
		СтруктураВозврата.Контрагент 	= Справочники.Контрагенты.ПустаяСсылка();
		СтруктураВозврата.Договор 		= Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	Возврат СтруктураВозврата;

КонецФункции

// Процедура дополняет таблицу с начислениями по ЗП, резервам лицевыми счетами по работникам
//
Процедура ДополнитьТаблицуЗаработнойПлатыРезервовЛицевымиСчетами(ТаблицаЗаработнойПлаты, Реквизиты, ВестиУчетПоРаботникам = Истина, ДоначислениеРезервовПоОтпускам = Ложь) 
	
	ТаблицаЗаработнойПлаты.Колонки.Добавить("СчетУчетаПассивный", 	Новый ОписаниеТипов("СправочникСсылка.ЕПСЛицевыеСчета"));
	ТаблицаЗаработнойПлаты.Колонки.Добавить("СчетУчетаАктивный", 	Новый ОписаниеТипов("СправочникСсылка.ЕПСЛицевыеСчета"));
	ТаблицаЗаработнойПлаты.Колонки.Добавить("СчетУчета", 			Новый ОписаниеТипов("СправочникСсылка.ЕПСЛицевыеСчета"));
	ТаблицаЗаработнойПлаты.Колонки.Добавить("СубконтоНДФЛ1");
	ТаблицаЗаработнойПлаты.Колонки.Добавить("СубконтоНДФЛ2");
	ТаблицаЗаработнойПлаты.Колонки.Добавить("СубконтоНДФЛ3");
	
	// Для сохранения признака ЭтоМатериалньаяПомощь для определения правильного лицевого счета
	Если ТипЗнч(Реквизиты.Регистратор) = Тип("ДокументСсылка.ДепонированиеЗарплаты") Тогда 
		СтрокаКолонокДляОпределенияСчетов = "Подразделение, ВидОперации, СпособОтраженияЗарплатыВБухучете, ФизическоеЛицо, СтатьяРасходов, РегистрацияВНалоговомОргане, ДоговорКонтрагента, ЭтоМатериальнаяПомощь"; 		
	Иначе
		СтрокаКолонокДляОпределенияСчетов = "Подразделение, ВидОперации, СпособОтраженияЗарплатыВБухучете, ФизическоеЛицо, СтатьяРасходов, РегистрацияВНалоговомОргане, ДоговорКонтрагента";
	КонецЕсли;
	
	ТаблицаДляПолученияСчетов = ТаблицаЗаработнойПлаты.Скопировать(,СтрокаКолонокДляОпределенияСчетов);
	
	Если Не ВестиУчетПоРаботникам Тогда
		ТаблицаДляПолученияСчетов.ЗаполнитьЗначения(Неопределено, "ФизическоеЛицо");	
	КонецЕсли;
	
	ТаблицаДляПолученияСчетов.Свернуть(СтрокаКолонокДляОпределенияСчетов);
	
	// Для взносов требуется определить - взносы для резервов по отпускам или иным начислениям
	// Для начислений требуется определить - начисление отпуска это или заработной платы
	ЭтоВзносыДляРезервовПоОтпускам 			= Ложь;
	ЭтоНачисленияЗаСчетРезервовПоОтпускам 	= Ложь;
	Если ТипЗнч(Реквизиты.Регистратор) = Тип("ДокументСсылка.НачислениеОценочныхОбязательствПоОтпускам") 
		Или ТипЗнч(Реквизиты.Регистратор) = Тип("ДокументСсылка.Отпуск") // Документ Отпуск может доначислять сумму необходимого резерва
		Или ДоначислениеРезервовПоОтпускам Тогда 
		ЭтоВзносыДляРезервовПоОтпускам 			= Истина;
		ЭтоНачисленияЗаСчетРезервовПоОтпускам	= Истина;
	КонецЕсли;
	
	ОтражениеСуммРезервовПоОтпускамДо2022Года = Ложь;
	Если ТипЗнч(Реквизиты.Регистратор) = Тип("ДокументСсылка.НачислениеОценочныхОбязательствПоОтпускам") 
		И Реквизиты.КорректировкаОбязательств
		И ЗначениеЗаполнено(Реквизиты.Регистратор.СчетНачисленияДляКорректировкиОстатков)
		И Реквизиты.Регистратор.СчетНачисленияДляКорректировкиОстатков.Владелец = ПланыСчетов.ЕПС.ВспомогательныйСчет Тогда
		ОтражениеСуммРезервовПоОтпускамДо2022Года = Истина;
	КонецЕсли;
		
	МассивТаблицаДляПолученияСчетов = Новый Массив;
	
	Если ЭтоНачисленияЗаСчетРезервовПоОтпускам Тогда
		МассивТаблицаДляПолученияСчетов.Добавить(ДополнитьТаблицуНачисленийПараметрамиОтраженияВБУ(ПланыВидовХарактеристик.ЕПСПравилаОтраженияЗарплаты.РезервыПоОтпускам,        	Реквизиты, ТаблицаДляПолученияСчетов));
	Иначе
		МассивТаблицаДляПолученияСчетов.Добавить(ДополнитьТаблицуНачисленийПараметрамиОтраженияВБУ(ПланыВидовХарактеристик.ЕПСПравилаОтраженияЗарплаты.Начисления,        			Реквизиты, ТаблицаДляПолученияСчетов));
	КонецЕсли;
	Если ЭтоВзносыДляРезервовПоОтпускам Тогда
		МассивТаблицаДляПолученияСчетов.Добавить(ДополнитьТаблицуНачисленийПараметрамиОтраженияВБУ(ПланыВидовХарактеристик.ЕПСПравилаОтраженияЗарплаты.ВзносыСРезервовПоОтпускам,   Реквизиты, ТаблицаДляПолученияСчетов));
	Иначе
		МассивТаблицаДляПолученияСчетов.Добавить(ДополнитьТаблицуНачисленийПараметрамиОтраженияВБУ(ПланыВидовХарактеристик.ЕПСПравилаОтраженияЗарплаты.Взносы,            			Реквизиты, ТаблицаДляПолученияСчетов));
	КонецЕсли;

	МассивТаблицаДляПолученияСчетов.Добавить(ДополнитьТаблицуНачисленийПараметрамиОтраженияВБУ(ПланыВидовХарактеристик.ЕПСПравилаОтраженияЗарплаты.Депонирование,     				Реквизиты, ТаблицаДляПолученияСчетов));
	МассивТаблицаДляПолученияСчетов.Добавить(ДополнитьТаблицуНачисленийПараметрамиОтраженияВБУ(ПланыВидовХарактеристик.ЕПСПравилаОтраженияЗарплаты.СписаниеДепонента, 				Реквизиты, ТаблицаДляПолученияСчетов));

	ТаблицаДляПолученияСчетовНДФЛ = ДополнитьТаблицуНДФЛПараметрамиОтраженияВБУ(ТаблицаДляПолученияСчетов, Реквизиты);
	
	// Для отпуска требуется дозаполнить в таблице строки с переносом сумм со счетов, НЕ ПРИНИМАЕМЫХ к НУ на счета ПРИНИМАЕМЫЕ к НУ
	Если ТипЗнч(Реквизиты.Регистратор) = Тип("ДокументСсылка.Отпуск") 
		Или ДоначислениеРезервовПоОтпускам Тогда
		
		ВспомогательныйСчет00000 = ЮС_СчетаУчетаВДокументах.ПолучитьСчетаУчетаВспомогательныеСчета(Реквизиты.Организация, ПланыСчетов.ЕПС.ВспомогательныйСчет);
		
		ТаблицаЗаработнойПлаты.Колонки.Добавить("СубконтоКт1");
		ТаблицаЗаработнойПлаты.Колонки.Добавить("СубконтоКт2");
		ТаблицаЗаработнойПлаты.Колонки.Добавить("СубконтоКт3");

		МассивПравилОтражения = Новый Массив;
		МассивПравилОтражения.Добавить(ПланыВидовХарактеристик.ЕПСПравилаОтраженияЗарплаты.Взносы);
		МассивПравилОтражения.Добавить(ПланыВидовХарактеристик.ЕПСПравилаОтраженияЗарплаты.ВзносыСРезервовПоОтпускам);
		МассивПравилОтражения.Добавить(ПланыВидовХарактеристик.ЕПСПравилаОтраженияЗарплаты.РезервыПоОтпускам);
		МассивПравилОтражения.Добавить(ПланыВидовХарактеристик.ЕПСПравилаОтраженияЗарплаты.Начисления);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЕПСПорядокОтраженияЗарплаты.ПравилоОтражения КАК ПравилоОтражения,
		               |	ЕПСПорядокОтраженияЗарплаты.Счет КАК Счет,
		               |	ЕПСПорядокОтраженияЗарплаты.Субконто1 КАК Субконто1,
		               |	ЕПСПорядокОтраженияЗарплаты.Субконто2 КАК Субконто2,
		               |	ЕПСПорядокОтраженияЗарплаты.Субконто3 КАК Субконто3
		               |ИЗ
		               |	РегистрСведений.ЕПСПорядокОтраженияЗарплаты КАК ЕПСПорядокОтраженияЗарплаты
		               |ГДЕ
		               |	ЕПСПорядокОтраженияЗарплаты.ПравилоОтражения В(&ПравилаОтражения)
		               |	И ВЫБОР
		               |			КОГДА ЕПСПорядокОтраженияЗарплаты.ПравилоОтражения = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ЕПСПравилаОтраженияЗарплаты.Начисления)
		               |				ТОГДА ЕПСПорядокОтраженияЗарплаты.СпособОтраженияЗарплатыВБухУчете = &СпособОтраженияЗарплатыВБухУчете
		               |			ИНАЧЕ ИСТИНА
		               |		КОНЕЦ
		               |	И ЕПСПорядокОтраженияЗарплаты.Организация = &Организация";
		
		Запрос.УстановитьПараметр("Организация",						Реквизиты.Организация);
		Запрос.УстановитьПараметр("ПравилаОтражения",					МассивПравилОтражения);
		Запрос.УстановитьПараметр("СпособОтраженияЗарплатыВБухУчете",	Справочники.СпособыОтраженияЗарплатыВБухУчете.ОтражениеНачисленийПоУмолчанию);
		
		ТаблицаСчетовОтражения = Запрос.Выполнить().Выгрузить();
		Если ТаблицаСчетовОтражения.Количество() Тогда
			
			Для Каждого СтрокаТаблицы Из ТаблицаЗаработнойПлаты Цикл
				
				Если СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.РасходыПоОплатеТрудаЗаСчетРезервовПоОтпускам Тогда
										
					СтрокаСчетРезервыПоОтпускам = ТаблицаСчетовОтражения.Найти(ПланыВидовХарактеристик.ЕПСПравилаОтраженияЗарплаты.РезервыПоОтпускам);
					СтрокаСчетНачисления		= ТаблицаСчетовОтражения.Найти(ПланыВидовХарактеристик.ЕПСПравилаОтраженияЗарплаты.Начисления);
					
					Если СтрокаСчетРезервыПоОтпускам <> Неопределено 
						И СтрокаСчетНачисления <> Неопределено Тогда
						
						СтрокаТаблицы.Счет 					= СтрокаСчетНачисления.Счет;
						СтрокаТаблицы.СчетУчетаПассивный 	= СтрокаСчетРезервыПоОтпускам.Счет;
						
						СтрокаТаблицы.Субконто1 			= СтрокаСчетНачисления.Субконто1;
						СтрокаТаблицы.Субконто2 			= СтрокаСчетНачисления.Субконто2;
						СтрокаТаблицы.Субконто3 			= СтрокаСчетНачисления.Субконто3;

						СтрокаТаблицы.СубконтоКт1 			= СтрокаСчетРезервыПоОтпускам.Субконто1;
						СтрокаТаблицы.СубконтоКт2 			= СтрокаСчетРезервыПоОтпускам.Субконто2;
						СтрокаТаблицы.СубконтоКт3 			= СтрокаСчетРезервыПоОтпускам.Субконто3;

					КонецЕсли;
					
				ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.РасходыПоОплатеТрудаЗаСчетРезервовПоОтпускамЗаПрошлыеПериоды Тогда
					
					СтрокаСчетНачисления		= ТаблицаСчетовОтражения.Найти(ПланыВидовХарактеристик.ЕПСПравилаОтраженияЗарплаты.Начисления);
					СтрокаСчетРезервыПоОтпускам = ТаблицаСчетовОтражения.Найти(ПланыВидовХарактеристик.ЕПСПравилаОтраженияЗарплаты.РезервыПоОтпускам);

					Если СтрокаСчетНачисления <> Неопределено 
						И ВспомогательныйСчет00000 <> Неопределено Тогда
						
						СтрокаТаблицы.СчетНУ 				= СтрокаСчетНачисления.Счет;
						СтрокаТаблицы.СчетУчетаПассивный 	= ВспомогательныйСчет00000;
						
						СтрокаТаблицы.СубконтоНУ1 			= СтрокаСчетНачисления.Субконто1;
						СтрокаТаблицы.СубконтоНУ2 			= СтрокаСчетНачисления.Субконто2;
						СтрокаТаблицы.СубконтоНУ3 			= СтрокаСчетНачисления.Субконто3;
												
					КонецЕсли;
					
				ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтраховымВзносамЗаСчетРезервовПоОтпускам Тогда
					
					СтрокаСчетВзносыСРезервовПоОтпускам = ТаблицаСчетовОтражения.Найти(ПланыВидовХарактеристик.ЕПСПравилаОтраженияЗарплаты.ВзносыСРезервовПоОтпускам);
					СтрокаСчетВзносы					= ТаблицаСчетовОтражения.Найти(ПланыВидовХарактеристик.ЕПСПравилаОтраженияЗарплаты.Взносы);
					
					Если СтрокаСчетВзносыСРезервовПоОтпускам <> Неопределено 
						И СтрокаСчетВзносы <> Неопределено Тогда
						
						СтрокаТаблицы.Счет 					= СтрокаСчетВзносы.Счет;
						СтрокаТаблицы.СчетУчетаПассивный 	= СтрокаСчетВзносыСРезервовПоОтпускам.Счет;
						
						СтрокаТаблицы.Субконто1 			= СтрокаСчетВзносы.Субконто1;
						СтрокаТаблицы.Субконто2 			= СтрокаСчетВзносы.Субконто2;
						СтрокаТаблицы.Субконто3 			= СтрокаСчетВзносы.Субконто3;

						СтрокаТаблицы.СубконтоКт1 			= СтрокаСчетВзносыСРезервовПоОтпускам.Субконто1;
						СтрокаТаблицы.СубконтоКт2 			= СтрокаСчетВзносыСРезервовПоОтпускам.Субконто2;
						СтрокаТаблицы.СубконтоКт3 			= СтрокаСчетВзносыСРезервовПоОтпускам.Субконто3;

					КонецЕсли;
					
				ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтраховымВзносамЗаСчетРезервовПоОтпускамЗаПрошлыеПериоды Тогда
					
					СтрокаСчетВзносы					= ТаблицаСчетовОтражения.Найти(ПланыВидовХарактеристик.ЕПСПравилаОтраженияЗарплаты.Взносы);

					Если ВспомогательныйСчет00000 <> Неопределено 
						И СтрокаСчетВзносы <> Неопределено Тогда
						
						СтрокаТаблицы.СчетНУ 				= СтрокаСчетВзносы.Счет;
						СтрокаТаблицы.СчетУчетаПассивный 	= ВспомогательныйСчет00000;
						
						СтрокаТаблицы.СубконтоНУ1 			= СтрокаСчетВзносы.Субконто1;
						СтрокаТаблицы.СубконтоНУ2 			= СтрокаСчетВзносы.Субконто2;
						СтрокаТаблицы.СубконтоНУ3 			= СтрокаСчетВзносы.Субконто3;

					КонецЕсли;

				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	СоответствиеСчетовУчета = Новый Соответствие;
	СоответствиеСчетовУчета.Вставить(Перечисления.ЕПСВидыСчетов.СчетУчетаПассивный, "СчетУчетаПассивный");
	СоответствиеСчетовУчета.Вставить(Перечисления.ЕПСВидыСчетов.СчетУчетаАктивный, 	"СчетУчетаАктивный");
	
	ИспользуемыеСчетаПоРаботникам = Новый Соответствие;
	
	// СС 11.01.2023
	СписыватьСуммуСформированногоРезерваПриКомпенсацииБезДоначисления = РегистрыСведений.НастройкиРасчетаРезервовОтпусков.СписыватьСуммуСформированногоРезерваПриКомпенсацииБезДоначисления(Реквизиты.Организация, Реквизиты.Период);
	
	Для каждого СтрокаТаблицы Из МассивТаблицаДляПолученияСчетов[0] Цикл // начисления
		
		// Для поиска открытых лицевых счетов требуется определить по виду начисления нужный тип выплаты
		Если ОтражениеСуммРезервовПоОтпускамДо2022Года Тогда
			ТипВыплатыРаботнику = Перечисления.ЮС_ВидыВыплатРаботникам.РезервыПоОтпускамДо2022Года;  
		Иначе
			Если СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускРезервы // Формирование резерва на отпуск
				Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускРезервыЗаПрошлыеПериоды Тогда 
				ТипВыплатыРаботнику = Перечисления.ЮС_ВидыВыплатРаботникам.РезервыПоОтпускам;
			ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.МатериальнаяПомощь Тогда
				ТипВыплатыРаботнику = Перечисления.ЮС_ВидыВыплатРаботникам.СоциальныеВыплаты;
			Иначе // Включая выплаты отпуска за счет резерва
				ТипВыплатыРаботнику = Перечисления.ЮС_ВидыВыплатРаботникам.ОплатаТруда;  
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпуска
			Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпускаОценочныеОбязательства Тогда 
			
			ТипВыплатыРаботникуРезервы 			= Перечисления.ЮС_ВидыВыплатРаботникам.РезервыПоОтпускам;
			ИспользуемыеСчетаПоРаботникуРезервы = ЮС_СчетаУчетаВДокументах.ПолучитьСчетаРасчетовСРаботниками(Реквизиты.Организация, СтрокаТаблицы.ФизическоеЛицо,, ТипВыплатыРаботникуРезервы);
			
			Если ИспользуемыеСчетаПоРаботникуРезервы = Неопределено
				Или Не ЗначениеЗаполнено(ИспользуемыеСчетаПоРаботникуРезервы.СчетУчетаПассивный) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По сотруднику " + СтрокаТаблицы.ФизическоеЛицо + " не найдены лицевые счета для учета резервов отпусков! Начисления по нему не будут сформированы");
				Продолжить;
			КонецЕсли;

		КонецЕсли;
		
		Если СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускРезервыЗаПрошлыеПериоды Тогда  // Использование резерва, сформированного в прошлом году
			
			Если Год(Реквизиты.Период) <= 2022 Тогда
				ТипВыплатыРаботникуРезервыПрошлогоПериода = Перечисления.ЮС_ВидыВыплатРаботникам.РезервыПоОтпускамДо2022Года;
			Иначе
				ТипВыплатыРаботникуРезервыПрошлогоПериода = Перечисления.ЮС_ВидыВыплатРаботникам.РезервыПоОтпускамЗаПрошлыеПериоды;
			КонецЕсли;
			ИспользуемыеСчетаПоРаботникуРезервыДоПрошлогоПериода 	= ЮС_СчетаУчетаВДокументах.ПолучитьСчетаРасчетовСРаботниками(Реквизиты.Организация, СтрокаТаблицы.ФизическоеЛицо,, ТипВыплатыРаботникуРезервыПрошлогоПериода);

			Если ИспользуемыеСчетаПоРаботникуРезервыДоПрошлогоПериода = Неопределено
				Или Не ЗначениеЗаполнено(ИспользуемыеСчетаПоРаботникуРезервыДоПрошлогоПериода.СчетУчетаПассивный) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По сотруднику " + СтрокаТаблицы.ФизическоеЛицо + " не найдены лицевые счета для учета резервов отпусков! Начисления по нему не будут сформированы");
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		ИспользуемыеСчетаПоРаботнику = ЮС_СчетаУчетаВДокументах.ПолучитьСчетаРасчетовСРаботниками(Реквизиты.Организация, СтрокаТаблицы.ФизическоеЛицо,, ТипВыплатыРаботнику);
						
		Если ИспользуемыеСчетаПоРаботнику <> Неопределено
			И ЗначениеЗаполнено(ИспользуемыеСчетаПоРаботнику.СчетУчетаПассивный) Тогда
			
			// Сохраняем счета по оплате труда, т.к. только с них мы удерживаем НДФЛ
			Если ТипВыплатыРаботнику = Перечисления.ЮС_ВидыВыплатРаботникам.ОплатаТруда Тогда
				ИспользуемыеСчетаПоРаботникам.Вставить(СтрокаТаблицы.ФизическоеЛицо, ИспользуемыеСчетаПоРаботнику); 
			КонецЕсли;
			
			СтруктураПоиска = Новый Структура("Подразделение, ВидОперации, СпособОтраженияЗарплатыВБухучете");
			
			Если ВестиУчетПоРаботникам Тогда
				СтруктураПоиска.Вставить("ФизическоеЛицо");
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТаблицы);
			
			СтрокиЗаработнойПлаты = ТаблицаЗаработнойПлаты.НайтиСтроки(СтруктураПоиска);
			
			Для каждого СтрокаЗаработнойПлаты Из СтрокиЗаработнойПлаты Цикл
				
				Если ИспользуемыеСчетаПоРаботнику.Свойство("СчетУчетаПассивный") Тогда
					СтрокаЗаработнойПлаты.СчетУчетаПассивный 	= ИспользуемыеСчетаПоРаботнику.СчетУчетаПассивный;
				КонецЕсли;
				Если ИспользуемыеСчетаПоРаботнику.Свойство("СчетУчетаАктивный") Тогда
					СтрокаЗаработнойПлаты.СчетУчетаАктивный 	= ИспользуемыеСчетаПоРаботнику.СчетУчетаАктивный;
				КонецЕсли;
				
				// СС 11.01.2023
				МассивВидовОперацииПоКомпенсации = Новый Массив;
				Если СписыватьСуммуСформированногоРезерваПриКомпенсацииБезДоначисления Тогда
					МассивВидовОперацииПоКомпенсации.Добавить(Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпускаОценочныеОбязательства);
				Иначе
					МассивВидовОперацииПоКомпенсации.Добавить(Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпуска);
					МассивВидовОперацииПоКомпенсации.Добавить(Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпускаОценочныеОбязательства);
				КонецЕсли;

				Если МассивВидовОперацииПоКомпенсации.Найти(СтрокаТаблицы.ВидОперации) <> Неопределено Тогда
					
					СтрокаЗаработнойПлаты.Счет 		= ИспользуемыеСчетаПоРаботникуРезервы.СчетУчетаПассивный;
					СтрокаЗаработнойПлаты.Субконто1 = СтрокаТаблицы.ФизическоеЛицо;
				//\	
				ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускРезервыЗаПрошлыеПериоды Тогда	
					
					СтрокаЗаработнойПлаты.Счет 		= ИспользуемыеСчетаПоРаботникуРезервыДоПрошлогоПериода.СчетУчетаПассивный;
					СтрокаЗаработнойПлаты.Субконто1 = СтрокаТаблицы.ФизическоеЛицо;

				Иначе
					
					Если ЗначениеЗаполнено(СтрокаТаблицы.Счет) Тогда
						СтрокаЗаработнойПлаты.Счет = СтрокаТаблицы.Счет;	
					КонецЕсли;
					
					Если ЗначениеЗаполнено(СтрокаТаблицы.Субконто1) Тогда
						СтрокаЗаработнойПлаты.Субконто1 = СтрокаТаблицы.Субконто1;	
					КонецЕсли;
					
					Если ЗначениеЗаполнено(СтрокаТаблицы.Субконто2) Тогда
						СтрокаЗаработнойПлаты.Субконто2 = СтрокаТаблицы.Субконто2;	
					КонецЕсли;
					
					Если ЗначениеЗаполнено(СтрокаТаблицы.Субконто3) Тогда
						СтрокаЗаработнойПлаты.Субконто3 = СтрокаТаблицы.Субконто3;	
					КонецЕсли;
					
				КонецЕсли;
													
			КонецЦикла;
			
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По сотруднику " + СтрокаТаблицы.ФизическоеЛицо + " не найдены лицевые счета! Начисления по нему не будут сформированы");
		КонецЕсли;
		
	КонецЦикла;
	
	ПараметрОтраженияВБУСтраховыеВзносы = ЮС_СчетаУчетаВДокументах.ПараметрОтраженияВБУСтраховыеВзносы();	
	Для каждого СтрокаТаблицы Из МассивТаблицаДляПолученияСчетов[1] Цикл // взносы
		
		ВидСтраховогоВзноса = ОпределитьВидСтраховогоВзносаДляПоискаЛицевогоСчета(СтрокаТаблицы, 
			ЭтоВзносыДляРезервовПоОтпускам, ОтражениеСуммРезервовПоОтпускамДо2022Года);
		ИспользуемыеСчета 	= ЮС_СчетаУчетаВДокументах.ПолучитьСчетаУчетаВидовСтраховыхВзносов(Реквизиты.Организация,
			ВидСтраховогоВзноса, ПараметрОтраженияВБУСтраховыеВзносы);
		
		Если ЗначениеЗаполнено(ИспользуемыеСчета) Тогда
			
			СтруктураПоиска = Новый Структура("Подразделение, ВидОперации, СпособОтраженияЗарплатыВБухучете");
			
			Если ВестиУчетПоРаботникам Тогда
				СтруктураПоиска.Вставить("ФизическоеЛицо");
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТаблицы);
			
			СтрокиЗаработнойПлаты = ТаблицаЗаработнойПлаты.НайтиСтроки(СтруктураПоиска);
			
			Для каждого СтрокаЗаработнойПлаты Из СтрокиЗаработнойПлаты Цикл
				
				Если СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПособиеНаПогребение Тогда
					
					// Дт 60336 Кт 60322
					Если Не ЗначениеЗаполнено(СтрокаТаблицы.ДоговорКонтрагента) Тогда
						СтруктураДанныхПоФизЛицу = ПолучитьКонтрагентаПоФизическомуЛицу(Реквизиты.Организация, СтрокаТаблицы.ФизическоеЛицо);
						СтрокаЗаработнойПлаты.ДоговорКонтрагента 	= СтруктураДанныхПоФизЛицу.Договор;
						СтрокаТаблицы.ДоговорКонтрагента 			= СтруктураДанныхПоФизЛицу.Договор;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(СтрокаТаблицы.ДоговорКонтрагента) Тогда
						
						// Ищем лицевые счета по найденному договору и контрагенту
						ЛицевыеСчетПоДоговору = ЮС_СчетаУчетаВДокументах.ПолучитьСчетаРасчетовСКонтрагентом(Реквизиты.Организация,
							СтрокаТаблицы.ДоговорКонтрагента.Владелец, СтрокаТаблицы.ДоговорКонтрагента, 
							СтрокаТаблицы.ДоговорКонтрагента.ЕПСПараметрОтраженияВБУ);
						
						ИспользуемыеСчетаПоРаботнику = Новый Структура;
						ИспользуемыеСчетаПоРаботнику.Вставить("СчетУчетаПассивный");
						ИспользуемыеСчетаПоРаботнику.Вставить("СчетУчетаАктивный");
						
						ИспользуемыеСчетаПоРаботнику.СчетУчетаПассивный = ЛицевыеСчетПоДоговору.СчетУчетаКредиторскойЗадолженности;
						ИспользуемыеСчетаПоРаботнику.СчетУчетаАктивный 	= ЛицевыеСчетПоДоговору.СчетУчетаДебиторскойЗадолженности;
						
					Иначе
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По сотруднику " + СтрокаТаблицы.ФизическоеЛицо 
							+ " не найден контрагент! Начисления по виду операции " + """" +  СтрокаТаблицы.ВидОперации + """" +  " не будут сформированы");
					КонецЕсли;
					
					Если ЗначениеЗаполнено(ИспользуемыеСчетаПоРаботнику) Тогда
						Если ИспользуемыеСчета.Свойство("СчетУчетаПассивный") Тогда
							СтрокаЗаработнойПлаты.СчетУчетаПассивный 	= ИспользуемыеСчетаПоРаботнику.СчетУчетаПассивный;
						КонецЕсли;
						Если ИспользуемыеСчета.Свойство("СчетУчетаАктивный") Тогда
							СтрокаЗаработнойПлаты.СчетУчетаАктивный 	= ИспользуемыеСчетаПоРаботнику.СчетУчетаАктивный;
						КонецЕсли;
						
						СтрокаЗаработнойПлаты.Счет 		= ИспользуемыеСчета.СчетУчетаАктивный;	
						СтрокаЗаработнойПлаты.Субконто1 = Перечисления.ВидыПлатежейВГосБюджет.Налог;	
					КонецЕсли;
					
				Иначе
					
					Если ИспользуемыеСчета.Свойство("СчетУчетаПассивный") Тогда
						СтрокаЗаработнойПлаты.СчетУчетаПассивный 	= ИспользуемыеСчета.СчетУчетаПассивный;
					КонецЕсли;
					Если ИспользуемыеСчета.Свойство("СчетУчетаАктивный") Тогда
						СтрокаЗаработнойПлаты.СчетУчетаАктивный 	= ИспользуемыеСчета.СчетУчетаАктивный;
					КонецЕсли;
					
					Если СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.СтраховыеВзносыПоРезервамПоОтпускамЗаПрошлыеПериоды Тогда
						
						Если Год(Реквизиты.Период) <= 2022 Тогда
							ВидСтраховогоВзносаПоРезервамПоОтпускамПрошлогоПериода 	
								= Перечисления.ЮС_ВидыСтраховыхВзносов.СтраховыеВзносыПоРезервамПоОтпускамДо2022Года;
						Иначе
							ВидСтраховогоВзносаПоРезервамПоОтпускамПрошлогоПериода 	
								= Перечисления.ЮС_ВидыСтраховыхВзносов.СтраховыеВзносыПоРезервамПоОтпускамЗаПрошлыеПериоды;
						КонецЕсли;
						ИспользуемыеСчетаПоРезервамПоОтпускамПрошлогоПериода = ЮС_СчетаУчетаВДокументах.ПолучитьСчетаУчетаВидовСтраховыхВзносов(
							Реквизиты.Организация, 
							ВидСтраховогоВзносаПоРезервамПоОтпускамПрошлогоПериода, 
							ПараметрОтраженияВБУСтраховыеВзносы);
						
						СтрокаЗаработнойПлаты.Счет 		= ИспользуемыеСчетаПоРезервамПоОтпускамПрошлогоПериода.СчетУчетаПассивный;
						СтрокаЗаработнойПлаты.Субконто1 = Перечисления.ВидыПлатежейВГосБюджет.Налог;	
						
					Иначе
						
						Если ЗначениеЗаполнено(СтрокаТаблицы.Счет) Тогда
							СтрокаЗаработнойПлаты.Счет = СтрокаТаблицы.Счет;	
						КонецЕсли;
						
						Если ЗначениеЗаполнено(СтрокаТаблицы.Субконто1) Тогда
							СтрокаЗаработнойПлаты.Субконто1 = СтрокаТаблицы.Субконто1;	
						КонецЕсли;
						
						Если ЗначениеЗаполнено(СтрокаТаблицы.Субконто2) Тогда
							СтрокаЗаработнойПлаты.Субконто2 = СтрокаТаблицы.Субконто2;	
						КонецЕсли;
						
						Если ЗначениеЗаполнено(СтрокаТаблицы.Субконто3) Тогда
							СтрокаЗаработнойПлаты.Субконто3 = СтрокаТаблицы.Субконто3;	
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого СтрокаТаблицы Из МассивТаблицаДляПолученияСчетов[2] Цикл // депонирования
		
		ИспользуемыеСчетаПоРаботникуОплатаТруда 		= ЮС_СчетаУчетаВДокументах.ПолучитьСчетаРасчетовСРаботниками(Реквизиты.Организация, СтрокаТаблицы.ФизическоеЛицо,, Перечисления.ЮС_ВидыВыплатРаботникам.ОплатаТруда);
		ИспользуемыеСчетаПоРаботникуДепоненты 			= ЮС_СчетаУчетаВДокументах.ПолучитьСчетаРасчетовСРаботниками(Реквизиты.Организация, СтрокаТаблицы.ФизическоеЛицо,, Перечисления.ЮС_ВидыВыплатРаботникам.ДепонированиеВыплат);
		ИспользуемыеСчетаПоРаботникуСоциальныеВыплаты 	= ЮС_СчетаУчетаВДокументах.ПолучитьСчетаРасчетовСРаботниками(Реквизиты.Организация, СтрокаТаблицы.ФизическоеЛицо,, Перечисления.ЮС_ВидыВыплатРаботникам.СоциальныеВыплаты);
		
		Если ЗначениеЗаполнено(ИспользуемыеСчетаПоРаботникуОплатаТруда.СчетУчетаПассивный)
			И ЗначениеЗаполнено(ИспользуемыеСчетаПоРаботникуДепоненты.СчетУчетаПассивный) 
			И ЗначениеЗаполнено(ИспользуемыеСчетаПоРаботникуСоциальныеВыплаты.СчетУчетаПассивный) Тогда
						
			СтруктураПоиска = Новый Структура("Подразделение, ВидОперации, СпособОтраженияЗарплатыВБухучете");
			Если ВестиУчетПоРаботникам Тогда
				СтруктураПоиска.Вставить("ФизическоеЛицо");
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТаблицы);
			
			СтрокиЗаработнойПлаты = ТаблицаЗаработнойПлаты.НайтиСтроки(СтруктураПоиска);
			Для каждого СтрокаЗаработнойПлаты Из СтрокиЗаработнойПлаты Цикл
				
				Если Реквизиты.Регистратор.Ведомость.СпособВыплаты = Справочники.СпособыВыплатыЗарплаты.Аванс() Тогда
					// Должны отразить отнесение суммы аванса с счета 60306 (оплата труда) на счет 60305 (депонирование выплаты)
					СтрокаЗаработнойПлаты.СчетУчета = ИспользуемыеСчетаПоРаботникуОплатаТруда.СчетУчетаАктивный;
					СтрокаЗаработнойПлаты.Счет 		= ИспользуемыеСчетаПоРаботникуОплатаТруда.СчетУчетаАктивный;
				Иначе
					Если СтрокаЗаработнойПлаты.ЭтоМатериальнаяПомощь Тогда
						// Должны отразить отнесение суммы начислений с счета 60305 (соц. выплаты) на счет 60305 (депонирование выплаты)
						СтрокаЗаработнойПлаты.СчетУчета = ИспользуемыеСчетаПоРаботникуСоциальныеВыплаты.СчетУчетаПассивный;
						СтрокаЗаработнойПлаты.Счет 		= ИспользуемыеСчетаПоРаботникуСоциальныеВыплаты.СчетУчетаПассивный;
					Иначе
						// Должны отразить отнесение суммы начислений с счета 60305 (оплата труда) на счет 60305 (депонирование выплаты)
						СтрокаЗаработнойПлаты.СчетУчета = ИспользуемыеСчетаПоРаботникуОплатаТруда.СчетУчетаПассивный;
						СтрокаЗаработнойПлаты.Счет 		= ИспользуемыеСчетаПоРаботникуОплатаТруда.СчетУчетаПассивный;
					КонецЕсли;
				КонецЕсли;
				Если ИспользуемыеСчетаПоРаботникуДепоненты.Свойство("СчетУчетаПассивный") Тогда
					СтрокаЗаработнойПлаты.СчетУчетаПассивный 	= ИспользуемыеСчетаПоРаботникуДепоненты.СчетУчетаПассивный;
				КонецЕсли;
				Если ИспользуемыеСчетаПоРаботникуДепоненты.Свойство("СчетУчетаАктивный") Тогда
					СтрокаЗаработнойПлаты.СчетУчетаАктивный 	= ИспользуемыеСчетаПоРаботникуДепоненты.СчетУчетаАктивный;
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По сотруднику " + СтрокаТаблицы.ФизическоеЛицо + " не найдены лицевые счета! Начисления по нему не будут сформированы");
		КонецЕсли;
		
	КонецЦикла;
	
	МассивНеНайденныхЛСПоРегистрацииВНалоговомОргане = Новый Массив;
	Для каждого СтрокаТаблицы Из ТаблицаДляПолученияСчетовНДФЛ Цикл // НДФЛ
			
		СтруктураПоиска = Новый Структура("Подразделение, ВидОперации, СпособОтраженияЗарплатыВБухучете, СтатьяРасходов, РегистрацияВНалоговомОргане");
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТаблицы);
		
		СтрокиЗаработнойПлаты = ТаблицаЗаработнойПлаты.НайтиСтроки(СтруктураПоиска);
		
		Для каждого СтрокаЗаработнойПлаты Из СтрокиЗаработнойПлаты Цикл
			
			Если Не ЗначениеЗаполнено(СтрокаТаблицы.Счет) Тогда
				Если МассивНеНайденныхЛСПоРегистрацииВНалоговомОргане.Найти(СтрокаТаблицы.РегистрацияВНалоговомОргане) = Неопределено Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По регистрации в налоговом органе " + СтрокаТаблицы.РегистрацияВНалоговомОргане + " не найдены лицевые счета! Начисления НДФЛ не будут сформированы");
					МассивНеНайденныхЛСПоРегистрацииВНалоговомОргане.Добавить(СтрокаТаблицы.РегистрацияВНалоговомОргане);
				КонецЕсли;
			КонецЕсли;
			
			СтрокаЗаработнойПлаты.СчетУчета 	= СтрокаТаблицы.Счет;
			СтрокаЗаработнойПлаты.СубконтоНДФЛ1 = СтрокаТаблицы.Субконто1;
			СтрокаЗаработнойПлаты.СубконтоНДФЛ2 = СтрокаТаблицы.Субконто2;
			СтрокаЗаработнойПлаты.СубконтоНДФЛ3 = СтрокаТаблицы.Субконто3;
			
		КонецЦикла;
				
		// "КА" - расчеты с контрагентом. Возникает при договорах ГПХ
		// "ДВ" - дивиденды
		Если СтрокаТаблицы.СтатьяРасходов.Код = "КА"
			Или СтрокаТаблицы.СтатьяРасходов.Код = "ДВ" Тогда
			
			Если Не ЗначениеЗаполнено(СтрокаТаблицы.ДоговорКонтрагента) Тогда
				СтруктураДанныхПоФизЛицу = ПолучитьКонтрагентаПоФизическомуЛицу(Реквизиты.Организация, СтрокаТаблицы.ФизическоеЛицо);
				СтрокаЗаработнойПлаты.ДоговорКонтрагента 	= СтруктураДанныхПоФизЛицу.Договор;
				СтрокаТаблицы.ДоговорКонтрагента 			= СтруктураДанныхПоФизЛицу.Договор;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.ДоговорКонтрагента) Тогда
				
				// Ищем лицевые счета по найденному договору и контрагенту
				ЛицевыеСчетПоДоговору = ЮС_СчетаУчетаВДокументах.ПолучитьСчетаРасчетовСКонтрагентом(Реквизиты.Организация, СтрокаТаблицы.ДоговорКонтрагента.Владелец, 
											СтрокаТаблицы.ДоговорКонтрагента, СтрокаТаблицы.ДоговорКонтрагента.ЕПСПараметрОтраженияВБУ);
				
				ИспользуемыеСчетаПоРаботнику = Новый Структура;
				ИспользуемыеСчетаПоРаботнику.Вставить("СчетУчетаПассивный");
				ИспользуемыеСчетаПоРаботнику.Вставить("СчетУчетаАктивный");
				
				ИспользуемыеСчетаПоРаботнику.СчетУчетаПассивный = ЛицевыеСчетПоДоговору.СчетУчетаКредиторскойЗадолженности;
				ИспользуемыеСчетаПоРаботнику.СчетУчетаАктивный 	= ЛицевыеСчетПоДоговору.СчетУчетаДебиторскойЗадолженности;
				
			КонецЕсли;
			
		Иначе
			
			ИспользуемыеСчетаПоРаботнику = ИспользуемыеСчетаПоРаботникам.Получить(СтрокаТаблицы.ФизическоеЛицо);
						
		КонецЕсли;
		
		Если ИспользуемыеСчетаПоРаботнику <> Неопределено 
			И ЗначениеЗаполнено(ИспользуемыеСчетаПоРаботнику.СчетУчетаПассивный) Тогда
			
			СтруктураПоиска = Новый Структура("Подразделение, ВидОперации, СпособОтраженияЗарплатыВБухучете, СтатьяРасходов");
			Если ВестиУчетПоРаботникам Тогда
				СтруктураПоиска.Вставить("ФизическоеЛицо");
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаТаблицы.ДоговорКонтрагента) Тогда
				СтруктураПоиска.Вставить("ДоговорКонтрагента");
			КонецЕсли;

			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТаблицы);
			
			СтрокиЗаработнойПлаты = ТаблицаЗаработнойПлаты.НайтиСтроки(СтруктураПоиска);
			
			Для каждого СтрокаЗаработнойПлаты Из СтрокиЗаработнойПлаты Цикл
				
				Если ИспользуемыеСчетаПоРаботнику.Свойство("СчетУчетаПассивный") Тогда
					СтрокаЗаработнойПлаты.СчетУчетаПассивный 	= ИспользуемыеСчетаПоРаботнику.СчетУчетаПассивный;
				КонецЕсли;
				Если ИспользуемыеСчетаПоРаботнику.Свойство("СчетУчетаАктивный") Тогда
					СтрокаЗаработнойПлаты.СчетУчетаАктивный 	= ИспользуемыеСчетаПоРаботнику.СчетУчетаАктивный;
				КонецЕсли;
				
				Если СтрокаТаблицы.СтатьяРасходов.Код = "КА" Тогда
					СтрокаЗаработнойПлаты.Субконто1 = СтрокаТаблицы.ДоговорКонтрагента.Владелец;
					СтрокаЗаработнойПлаты.Субконто2 = СтрокаТаблицы.ДоговорКонтрагента;
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По сотруднику " + СтрокаТаблицы.ФизическоеЛицо + " не найдены лицевые счета! Начисления по нему не будут сформированы");
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

Функция ОпределитьВидСтраховогоВзносаДляПоискаЛицевогоСчета(СтрокаТаблицы, ЭтоВзносыДляРезервовПоОтпускам, 
			ОтражениеСуммРезервовПоОтпускамДо2022Года)
		
	// Для поиска открытых лицевых счетов требуется определить по виду операции нужную группу страховых взносов
	Если СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПФРСтраховаяЧасть
		Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПФРПоСуммарномуТарифу
		Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПФРДоПредельнойВеличины
		Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПФРСПревышения Тогда
		
		Если ОтражениеСуммРезервовПоОтпускамДо2022Года Тогда
			ВидСтраховогоВзноса = Перечисления.ЮС_ВидыСтраховыхВзносов.СтраховыеВзносыПоРезервамПоОтпускамДо2022Года;
		Иначе
			Если ЭтоВзносыДляРезервовПоОтпускам Тогда
				ВидСтраховогоВзноса = Перечисления.ЮС_ВидыСтраховыхВзносов.СтраховыеВзносыПоРезервамПоОтпускам;
			Иначе
				ВидСтраховогоВзноса = Перечисления.ЮС_ВидыСтраховыхВзносов.ОбязательноеПенсионноеСтрахование;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПФРДополнительныйТарифЛЭ
		Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПФРДополнительныйТарифШахтеры
		Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах
		Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки
		Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка
		Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки
		Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка Тогда
		
		ВидСтраховогоВзноса = Перечисления.ЮС_ВидыСтраховыхВзносов.ОбязательноеПенсионноеСтрахование;
		
	ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПособиеНаПогребение Тогда
		
		ВидСтраховогоВзноса = Перечисления.ЮС_ВидыСтраховыхВзносов.РасчетыПоСоциальномуСтрахованию;
		
	ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ФСС
		Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюФСС Тогда
		
		Если ОтражениеСуммРезервовПоОтпускамДо2022Года Тогда
			ВидСтраховогоВзноса = Перечисления.ЮС_ВидыСтраховыхВзносов.СтраховыеВзносыПоРезервамПоОтпускамДо2022Года;
		Иначе
			Если ЭтоВзносыДляРезервовПоОтпускам Тогда
				ВидСтраховогоВзноса = Перечисления.ЮС_ВидыСтраховыхВзносов.СтраховыеВзносыПоРезервамПоОтпускам;
			Иначе
				ВидСтраховогоВзноса = Перечисления.ЮС_ВидыСтраховыхВзносов.РасчетыПоСоциальномуСтрахованию;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ФССНС
		Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюФССНС Тогда
		
		Если ОтражениеСуммРезервовПоОтпускамДо2022Года Тогда
			ВидСтраховогоВзноса = Перечисления.ЮС_ВидыСтраховыхВзносов.СтраховыеВзносыПоРезервамПоОтпускамДо2022Года;
		Иначе
			Если ЭтоВзносыДляРезервовПоОтпускам Тогда
				ВидСтраховогоВзноса = Перечисления.ЮС_ВидыСтраховыхВзносов.СтраховыеВзносыПоРезервамПоОтпускам;
			Иначе
				ВидСтраховогоВзноса = Перечисления.ЮС_ВидыСтраховыхВзносов.РасчетыПоОбязательномуСоцСтрахованиюОтНСИПЗ;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ФФОМС Тогда
		
		Если ОтражениеСуммРезервовПоОтпускамДо2022Года Тогда
			ВидСтраховогоВзноса = Перечисления.ЮС_ВидыСтраховыхВзносов.СтраховыеВзносыПоРезервамПоОтпускамДо2022Года;
		Иначе
			Если ЭтоВзносыДляРезервовПоОтпускам Тогда
				ВидСтраховогоВзноса = Перечисления.ЮС_ВидыСтраховыхВзносов.СтраховыеВзносыПоРезервамПоОтпускам;
			Иначе
				ВидСтраховогоВзноса = Перечисления.ЮС_ВидыСтраховыхВзносов.ФедеральныйФондОМС;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.СтраховыеВзносыПоРезервамПоОтпускам 
		Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.СтраховыеВзносыПоРезервамПоОтпускамЗаПрошлыеПериоды Тогда
		
		Если ОтражениеСуммРезервовПоОтпускамДо2022Года Тогда
			ВидСтраховогоВзноса = Перечисления.ЮС_ВидыСтраховыхВзносов.СтраховыеВзносыПоРезервамПоОтпускамДо2022Года;
		Иначе
			ВидСтраховогоВзноса = Перечисления.ЮС_ВидыСтраховыхВзносов.СтраховыеВзносыПоРезервамПоОтпускам;
		КонецЕсли;
		
	ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ВзносыПоЕдиномуТарифу Тогда
		
		Если ОтражениеСуммРезервовПоОтпускамДо2022Года Тогда
			ВидСтраховогоВзноса = Перечисления.ЮС_ВидыСтраховыхВзносов.СтраховыеВзносыПоРезервамПоОтпускамДо2022Года;
		Иначе
			Если ЭтоВзносыДляРезервовПоОтпускам Тогда
				ВидСтраховогоВзноса = Перечисления.ЮС_ВидыСтраховыхВзносов.СтраховыеВзносыПоРезервамПоОтпускам;
			Иначе
				ВидСтраховогоВзноса = Перечисления.ЮС_ВидыСтраховыхВзносов.СоциальныйФондРоссии;
			КонецЕсли;
		КонецЕсли;

	Иначе
		
		ВидСтраховогоВзноса = Перечисления.ЮС_ВидыСтраховыхВзносов.ПустаяСсылка();
		
	КонецЕсли;
	
	Возврат ВидСтраховогоВзноса;

КонецФункции

Функция ПодготовитьТаблицуНалоговВзносовСФОТ(ТаблицаЗаработнойПлаты, УСН = Ложь, ИП = Ложь, Реквизиты)
	
	МассивОперацийНалоговВзносовСФОТ = Новый Массив;
	
	МассивОперацийНалоговВзносовСФОТ.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРНакопительнаяЧасть);
	МассивОперацийНалоговВзносовСФОТ.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРСтраховаяЧасть);
	МассивОперацийНалоговВзносовСФОТ.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРПоСуммарномуТарифу);
	МассивОперацийНалоговВзносовСФОТ.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРДоПредельнойВеличины);
	МассивОперацийНалоговВзносовСФОТ.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРСПревышения);
	МассивОперацийНалоговВзносовСФОТ.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРДополнительныйТарифЛЭ);
	МассивОперацийНалоговВзносовСФОТ.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРДополнительныйТарифШахтеры);
	МассивОперацийНалоговВзносовСФОТ.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах);
	МассивОперацийНалоговВзносовСФОТ.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах);
	МассивОперацийНалоговВзносовСФОТ.Добавить(Перечисления.ВидыОперацийПоЗарплате.ФСС);
	МассивОперацийНалоговВзносовСФОТ.Добавить(Перечисления.ВидыОперацийПоЗарплате.ФССНС);
	МассивОперацийНалоговВзносовСФОТ.Добавить(Перечисления.ВидыОперацийПоЗарплате.ФФОМС);
	МассивОперацийНалоговВзносовСФОТ.Добавить(Перечисления.ВидыОперацийПоЗарплате.ТФОМС);
	МассивОперацийНалоговВзносовСФОТ.Добавить(Перечисления.ВидыОперацийПоЗарплате.ВзносыПоЕдиномуТарифу);

	ОперацииУчетаОсобыхДопВзносов = Новый Массив;
	ОперацииУчетаОсобыхДопВзносов.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки);
	ОперацииУчетаОсобыхДопВзносов.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки);
	
	ТаблицаНалоговВзносовСФОТ = ТаблицаЗаработнойПлаты.СкопироватьКолонки();
	ТаблицаНалоговВзносовСФОТ.Колонки.Добавить("КорСчет");
	ТаблицаНалоговВзносовСФОТ.Колонки.Добавить("КорСубконто1");
	ТаблицаНалоговВзносовСФОТ.Колонки.Добавить("КорСубконто2");
	ТаблицаНалоговВзносовСФОТ.Колонки.Добавить("КорСубконто3");	
	ТаблицаНалоговВзносовСФОТ.Колонки.Добавить("КлючСортировки");
			
	// Аналитика учета
	ПустоеСубконто                           = ПланыВидовХарактеристик.ЕПСВидыСубконто.ПустаяСсылка();
	ВидПлатежаВГосБюджет                     = Перечисления.ВидыПлатежейВГосБюджет.Налог;
	РасходыПоУплатеСтраховыхВзносов          = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПрочиеДоходыИРасходы.РасходыПоУплатеСтраховыхВзносов");
	ВидПлатежаВГосБюджетВзносыБезСпецоценки  = Перечисления.ВидыПлатежейВГосБюджет.ВзносыБезСпецоценки;
	ВидПлатежаВГосБюджетРасходыПоСтрахованию = Перечисления.ВидыПлатежейВГосБюджет.РасходыПоСтрахованию;
	
	НастройкиУчетаЗарплаты = РегистрыСведений.НастройкиУчетаЗарплаты.Получить(Новый Структура("Организация", Реквизиты.Организация));
	РезервОтпусковЭлемент  = НастройкиУчетаЗарплаты.РезервОтпусков;
	
	УчетРезервовОтпусковНУ = ВедетсяУчетРезервовОтпусковПоВидамУчета(Реквизиты.Организация, Реквизиты.Период, "НУ");
	
	МассивСчет108 = Новый Массив();
	ВыборкаСчетов = ПланыСчетов.ЕПС.ВыбратьИерархически(ПланыСчетов.ЕПС.НайтиПоКоду("108"));
	Пока ВыборкаСчетов.Следующий() Цикл
		МассивСчет108.Добавить(ВыборкаСчетов.Ссылка);
	КонецЦикла;
	
	// СС 11.01.2023
	СписыватьСуммуСформированногоРезерваПриКомпенсацииБезДоначисления = РегистрыСведений.НастройкиРасчетаРезервовОтпусков.СписыватьСуммуСформированногоРезерваПриКомпенсацииБезДоначисления(Реквизиты.Организация, Реквизиты.Период);
	
	МассивВидовОперацииВзносыЗаСчетРезервов = Новый Массив;
	Если СписыватьСуммуСформированногоРезерваПриКомпенсацииБезДоначисления Тогда
		МассивВидовОперацииВзносыЗаСчетРезервов.Добавить(Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательстваИРезервы);
		МассивВидовОперацииВзносыЗаСчетРезервов.Добавить(Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательства);
		МассивВидовОперацииВзносыЗаСчетРезервов.Добавить(Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускРезервы);
		МассивВидовОперацииВзносыЗаСчетРезервов.Добавить(Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпуск);
		МассивВидовОперацииВзносыЗаСчетРезервов.Добавить(Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпускаОценочныеОбязательства);
	Иначе
		МассивВидовОперацииВзносыЗаСчетРезервов.Добавить(Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательстваИРезервы);
		МассивВидовОперацииВзносыЗаСчетРезервов.Добавить(Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательства);
		МассивВидовОперацииВзносыЗаСчетРезервов.Добавить(Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускРезервы);
		МассивВидовОперацииВзносыЗаСчетРезервов.Добавить(Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпуск);
		МассивВидовОперацииВзносыЗаСчетРезервов.Добавить(Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпуска);
		МассивВидовОперацииВзносыЗаСчетРезервов.Добавить(Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпускаОценочныеОбязательства);
	КонецЕсли;
	
	ПараметрОтраженияВБУСтраховыеВзносы = ЮС_СчетаУчетаВДокументах.ПараметрОтраженияВБУСтраховыеВзносы();
	Для Каждого СтрокаТаблицы Из ТаблицаЗаработнойПлаты Цикл
		
		Если МассивОперацийНалоговВзносовСФОТ.Найти(СтрокаТаблицы.ВидОперации) = Неопределено Тогда
			
			Продолжить;
			
		Иначе
			
			НоваяСтрока = ТаблицаНалоговВзносовСФОТ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			
			Если МассивВидовОперацииВзносыЗаСчетРезервов.Найти(НоваяСтрока.ВедущийВидОперации) <> Неопределено Тогда
				
				СчетаУчетаСтраховыхВзносовПоРезервамПоОтпускма = ЮС_СчетаУчетаВДокументах.ПолучитьСчетаУчетаВидовСтраховыхВзносов(
					Реквизиты.Организация, 
					Перечисления.ЮС_ВидыСтраховыхВзносов.СтраховыеВзносыПоРезервамПоОтпускам, 
					ПараметрОтраженияВБУСтраховыеВзносы);
				
				Если ЗначениеЗаполнено(СчетаУчетаСтраховыхВзносовПоРезервамПоОтпускма) Тогда					
					
					НоваяСтрока.КорСчет     = СтрокаТаблицы.СчетУчетаПассивный;
					
					НоваяСтрока.Счет      = СчетаУчетаСтраховыхВзносовПоРезервамПоОтпускма.СчетУчетаПассивный;
					НоваяСтрока.Субконто1 = ВидПлатежаВГосБюджет;
					НоваяСтрока.Субконто2 = ПустоеСубконто;
					НоваяСтрока.Субконто3 = ПустоеСубконто;
					
				КонецЕсли;
				
			ИначеЕсли ЗначениеЗаполнено(НоваяСтрока.Счет) И МассивСчет108.Найти(НоваяСтрока.Счет.Владелец) = Неопределено Тогда
				
				НоваяСтрока.Счет         = НоваяСтрока.Счет;
				НоваяСтрока.Субконто1    = НоваяСтрока.Субконто1;
				НоваяСтрока.Субконто2    = НоваяСтрока.Субконто2;
				НоваяСтрока.Субконто3    = НоваяСтрока.Субконто3;

			КонецЕсли;
			
			КорСубконто = ОперацииУчетаОсобыхДопВзносов.Найти(СтрокаТаблицы.ВидОперации);
			НоваяСтрока.КорСчет      = СтрокаТаблицы.СчетУчетаПассивный;
			НоваяСтрока.КорСубконто1 = ?(КорСубконто = Неопределено, ВидПлатежаВГосБюджет, ВидПлатежаВГосБюджетВзносыБезСпецоценки);
			НоваяСтрока.КорСубконто2 = ПустоеСубконто;
			НоваяСтрока.КорСубконто3 = ПустоеСубконто;
			
			НоваяСтрока.КлючСортировки = СоздатьКлючСортировки(СтрокаТаблицы);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// СК [07.10.2022] (доходы/расходы ЗП по подразделениям) - добавила ПодразделениеУчетаНачислений

	СтрокаСвертки = "КлючСортировки, ВидОперации, Подразделение, ПодразделениеУчетаНачислений, ПодразделениеДоходовРасходов, Счет, Субконто1, Субконто2, Субконто3, КорСчет, КорСубконто1, КорСубконто2, КорСубконто3";
	СтрокаСвертки = СтрокаСвертки + ", СчетНУ, СубконтоНУ1, СубконтоНУ2, СубконтоНУ3";
	
	ТаблицаНалоговВзносовСФОТ.Свернуть(СтрокаСвертки, "Сумма");
	ТаблицаНалоговВзносовСФОТ.Сортировать(СтрокаСвертки);
	
	// Замена статей затрат, видов прочих расходов	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА СтатьиЗатратПоНалогамВзносамСФОТ.СтатьяЗатратНачисления <> НЕОПРЕДЕЛЕНО
	|			ТОГДА СтатьиЗатратПоНалогамВзносамСФОТ.СтатьяЗатратНачисления
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СтатьиЗатратПоНалогамВзносамСФОТ.СтатьяЗатрат ССЫЛКА Справочник.ПрочиеДоходыИРасходы
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.ПрочиеДоходыИРасходы.ПустаяСсылка)
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
	|			КОНЕЦ
	|	КОНЕЦ КАК СтатьяЗатратНачисления,
	|	СтатьиЗатратПоНалогамВзносамСФОТ.СтатьяЗатрат КАК СтатьяЗатрат
	|ИЗ
	|	РегистрСведений.СтатьиЗатратПоНалогамВзносамСФОТ КАК СтатьиЗатратПоНалогамВзносамСФОТ
	|ГДЕ
	|	СтатьиЗатратПоНалогамВзносамСФОТ.ВидСтатьиЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДополнительныхСтатейЗатрат.ФСС_НС)";
	
	СтатьиЗатрат_ФСС_НСиПЗ = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА СтатьиЗатратПоНалогамВзносамСФОТ.СтатьяЗатратНачисления <> НЕОПРЕДЕЛЕНО
	|			ТОГДА СтатьиЗатратПоНалогамВзносамСФОТ.СтатьяЗатратНачисления
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СтатьиЗатратПоНалогамВзносамСФОТ.СтатьяЗатрат ССЫЛКА Справочник.ПрочиеДоходыИРасходы
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.ПрочиеДоходыИРасходы.ПустаяСсылка)
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
	|			КОНЕЦ
	|	КОНЕЦ КАК СтатьяЗатратНачисления,
	|	СтатьиЗатратПоНалогамВзносамСФОТ.СтатьяЗатрат КАК СтатьяЗатрат
	|ИЗ
	|	РегистрСведений.СтатьиЗатратПоНалогамВзносамСФОТ КАК СтатьиЗатратПоНалогамВзносамСФОТ
	|ГДЕ
	|	СтатьиЗатратПоНалогамВзносамСФОТ.ВидСтатьиЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДополнительныхСтатейЗатрат.СтраховыеВзносы)";
	
	СтатьиЗатрат_СтраховыеВзносы = Запрос.Выполнить().Выгрузить();
	
	ЕстьУчетНУ = Ложь;
	Если ТаблицаНалоговВзносовСФОТ.Колонки.Найти("СчетНУ") <> Неопределено Тогда
		ЕстьУчетНУ = Истина;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы ИЗ ТаблицаНалоговВзносовСФОТ Цикл
		
		Если СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ФССНС
			ИЛИ СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюФССНС Тогда
			
			// Взносы в ФСС от НС и ПЗ
			Для НомерСубконто = 1 По 3 Цикл
				
				ЗаменитьЗначениеСтатьиЗатрат(СтрокаТаблицы, НомерСубконто, , СтатьиЗатрат_ФСС_НСиПЗ);
				Если ЕстьУчетНУ Тогда
					ЗаменитьЗначениеСтатьиЗатрат(СтрокаТаблицы, НомерСубконто, "НУ", СтатьиЗатрат_ФСС_НСиПЗ);
				КонецЕсли;

			КонецЦикла;
			
		Иначе
			
			// Взносы в ПФР, ФОМС и ФСС
			Для НомерСубконто = 1 По 3 Цикл
				
				ЗаменитьЗначениеСтатьиЗатрат(СтрокаТаблицы, НомерСубконто, , СтатьиЗатрат_СтраховыеВзносы);
				Если ЕстьУчетНУ Тогда
					ЗаменитьЗначениеСтатьиЗатрат(СтрокаТаблицы, НомерСубконто, "НУ", СтатьиЗатрат_СтраховыеВзносы);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаНалоговВзносовСФОТ;
		
КонецФункции

Функция ПодготовитьТаблицуДепонентов(Реквизиты, ТаблицаЗаработнойПлаты, УСН = Ложь)
	
	ТаблицаНачисленийИУдержаний = ТаблицаЗаработнойПлаты.СкопироватьКолонки();
	ТаблицаНачисленийИУдержаний.Колонки.Добавить("КорСчет");
	ТаблицаНачисленийИУдержаний.Колонки.Добавить("КорСубконто1");
	ТаблицаНачисленийИУдержаний.Колонки.Добавить("КорСубконто2");
	ТаблицаНачисленийИУдержаний.Колонки.Добавить("КорСубконто3");
	ТаблицаНачисленийИУдержаний.Колонки.Добавить("КлючСортировки");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Реквизиты.Организация);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПорядокОтраженияЗарплатыВБухУчете.Счет КАК КорСчет,
	|	ПорядокОтраженияЗарплатыВБухУчете.Субконто1 КАК КорСубконто1,
	|	ПорядокОтраженияЗарплатыВБухУчете.Субконто2 КАК КорСубконто2,
	|	ПорядокОтраженияЗарплатыВБухУчете.Субконто3 КАК КорСубконто3,
	|	ПорядокОтраженияЗарплатыВБухУчете.ОтражениеВУСН КАК ОтражениеВУСН,
	|	НастройкиУчетаЗарплаты.СписаниеДепонированныхСумм
	|ИЗ
	|	РегистрСведений.НастройкиУчетаЗарплаты КАК НастройкиУчетаЗарплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияЗарплатыВБухУчете КАК ПорядокОтраженияЗарплатыВБухУчете
	|		ПО НастройкиУчетаЗарплаты.СписаниеДепонированныхСумм = ПорядокОтраженияЗарплатыВБухУчете.СпособОтраженияЗарплатыВБухУчете
	|ГДЕ
	|	НастройкиУчетаЗарплаты.Организация = &Организация
	|	И НЕ ПорядокОтраженияЗарплатыВБухУчете.ЕНВД";
	
	ПорядокСписанияДепонентов = Запрос.Выполнить().Выбрать();
	ПорядокСписанияДепонентов.Следующий();
				
	ВестиУчетПоРаботникам                    = Константы.ВедетсяУчетРасчетовПоЗарплатеПоРаботникам.Получить();
	УчетЗарплатыИКадровСредствамиБухгалтерии = Константы.УчетЗарплатыИКадровСредствамиБухгалтерии.Получить();
	
	Для Каждого СтрокаТаблицы Из ТаблицаЗаработнойПлаты Цикл
		
		Если СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.Депонирование Тогда
			
			НоваяСтрока = ТаблицаНачисленийИУдержаний.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			
			НоваяСтрока.Счет = СтрокаТаблицы.Счет;
			НоваяСтрока.КорСчет = СтрокаТаблицы.СчетУчетаПассивный;
			
			Если ВестиУчетПоРаботникам Тогда 
				НоваяСтрока.Субконто1    = СтрокаТаблицы.ФизическоеЛицо;
				НоваяСтрока.КорСубконто1 = СтрокаТаблицы.ФизическоеЛицо;				
			КонецЕсли;
			
			НоваяСтрока.КлючСортировки = СоздатьКлючСортировки(СтрокаТаблицы);
			
		ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.СписаниеДепонента Тогда
			
			Если Не ЗначениеЗаполнено(ПорядокСписанияДепонентов.СписаниеДепонированныхСумм) Тогда
				ТекстСообщения = НСтр("ru = '%1. В настройках учета зарплаты не задан способ учета для списания депонированных сумм.'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ТекстСообщения,
				Реквизиты.Регистратор); 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Реквизиты.Регистратор);
			КонецЕсли;
			
			НоваяСтрока = ТаблицаНачисленийИУдержаний.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ПорядокСписанияДепонентов);
						
			НоваяСтрока.Счет 	= СтрокаТаблицы.СчетУчетаПассивный;
			НоваяСтрока.КорСчет = СтрокаТаблицы.Счет; 
			
			Если ВестиУчетПоРаботникам Тогда
				НоваяСтрока.Субконто1    = СтрокаТаблицы.ФизическоеЛицо;
			КонецЕсли;
						
			НоваяСтрока.КлючСортировки = СоздатьКлючСортировки(СтрокаТаблицы);
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтрокаСвертки = "КлючСортировки, ВидОперации, Подразделение, ПодразделениеУчетаНачислений, Счет, Субконто1, Субконто2, Субконто3, КорСчет, КорСубконто1, КорСубконто2, КорСубконто3";
		
	ТаблицаНачисленийИУдержаний.Свернуть(СтрокаСвертки, "Сумма");
	ТаблицаНачисленийИУдержаний.Сортировать(СтрокаСвертки);
	
	Возврат ТаблицаНачисленийИУдержаний;
		
КонецФункции

Процедура ЗаменитьЗначениеСтатьиЗатрат(СтрокаТаблицы, НомерСубконто, ВидУчета = "", ТаблицаЗамены)
	
	ТекущаяКолонка = "Субконто" + ВидУчета + НомерСубконто;
	
	ИскомоеЗначение = СтрокаТаблицы[ТекущаяКолонка];
	
	СтрокаЗамещения = ТаблицаЗамены.Найти(ИскомоеЗначение, "СтатьяЗатратНачисления");
	
	Если СтрокаЗамещения <> Неопределено Тогда
		СтрокаТаблицы[ТекущаяКолонка] = СтрокаЗамещения.СтатьяЗатрат;
	Иначе
		Если ТипЗнч(ИскомоеЗначение) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
			СтрокаЗамещения = ТаблицаЗамены.Найти(Справочники.СтатьиЗатрат.ПустаяСсылка(), "СтатьяЗатратНачисления");
			Если СтрокаЗамещения <> Неопределено Тогда
				СтрокаТаблицы[ТекущаяКолонка] = СтрокаЗамещения.СтатьяЗатрат;
			КонецЕсли;
		ИначеЕсли ТипЗнч(ИскомоеЗначение) = Тип("СправочникСсылка.ПрочиеДоходыИРасходы") Тогда
			СтрокаЗамещения = ТаблицаЗамены.Найти(Справочники.ПрочиеДоходыИРасходы.ПустаяСсылка(), "СтатьяЗатратНачисления");
			Если СтрокаЗамещения <> Неопределено Тогда
				СтрокаТаблицы[ТекущаяКолонка] = СтрокаЗамещения.СтатьяЗатрат;
			КонецЕсли;
		КонецЕсли;					
	КонецЕсли;
		
КонецПроцедуры

Процедура ПроверитьЗаполненностьСпособаОтраженияВУчете(ТаблицаЗаработнойПлаты, Реквизиты)
	
	ТаблицаПроверки = ТаблицаЗаработнойПлаты.Скопировать(,"ФизическоеЛицо, СпособОтраженияЗарплатыВБухУчете, Счет");	
	ТаблицаПроверки.Свернуть("ФизическоеЛицо, СпособОтраженияЗарплатыВБухУчете, Счет",);
	
	ДополнениеСообщения = "";
	Если Константы.УчетЗарплатыИКадровСредствамиБухгалтерии.Получить() Тогда
		ДополнениеСообщения = НСтр("ru = ' Проверьте настройку начислений/удержаний.'");
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы ИЗ ТаблицаПроверки Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.СпособОтраженияЗарплатыВБухУчете) Тогда
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Счет) Тогда
				ТекстСообщения = НСтр("ru = '%1. Работник: %2 - не указаны счет и аналитика для способа учета зарплаты ""%3""!%4'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					ТекстСообщения,
					Реквизиты.Регистратор,
					СтрокаТаблицы.ФизическоеЛицо,
					СтрокаТаблицы.СпособОтраженияЗарплатыВБухУчете,
					ДополнениеСообщения); 
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Реквизиты.Регистратор);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

Процедура ПроверитьЗаполненностьРегистрацииВНалоговомОргане(ТаблицаНДФЛ, Реквизиты, Отказ)
	
	Если Константы.УчетЗарплатыИКадровСредствамиБухгалтерии.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаПроверки = ТаблицаНДФЛ.Скопировать(,"ФизическоеЛицо, РегистрацияВНалоговомОргане");
	
	ДополнениеСообщения = "";
	
	Для Каждого СтрокаТаблицы ИЗ ТаблицаПроверки Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.РегистрацияВНалоговомОргане) Тогда
			ТекстСообщения = НСтр("ru = '%1. Работник: %2 - на закладке ""Начисленный НДФЛ"" не указана регистрация в налоговом органе!%4'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ТекстСообщения,
				Реквизиты.Регистратор,
				СтрокаТаблицы.ФизическоеЛицо,
				ДополнениеСообщения); 
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Реквизиты.Регистратор,,,Отказ);
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

Процедура ЗаполнитьРегистрациюВНалоговомОрганеВКоллекцииСтрок(Организация, КоллекцияНачисленныйНДФЛ) Экспорт
	
	СведенияОбОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, "ГоловнаяОрганизация, ЮридическоеФизическоеЛицо");
	ОрганизацияЮрлицо     = СведенияОбОрганизации.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", СведенияОбОрганизации.ГоловнаяОрганизация);
	
	Если ТипЗнч(КоллекцияНачисленныйНДФЛ) = Тип("ДанныеФормыКоллекция") Тогда
		ТаблицаНДФЛ = КоллекцияНачисленныйНДФЛ.Выгрузить();
	Иначе
		// передана таблица значений
		
		ТаблицаНДФЛ = КоллекцияНачисленныйНДФЛ.Скопировать();
		
		Если КоллекцияНачисленныйНДФЛ.Колонки.Найти("РегистрацияВНалоговомОргане") = Неопределено Тогда
			КоллекцияНачисленныйНДФЛ.Колонки.Добавить("РегистрацияВНалоговомОргане", Новый ОписаниеТипов("СправочникСсылка.РегистрацииВНалоговомОргане"));
		КонецЕсли;
		
	КонецЕсли;
	
	ИмяКолонкиОКТМО = "КодПоОКТМО";
	Если ТаблицаНДФЛ.Колонки.Найти("КодПоОКТМО") = Неопределено Тогда
		ТаблицаНДФЛ.Колонки.ОКАТО.Имя = "КодПоОКТМО";
		ИмяКолонкиОКТМО = "ОКАТО";		
	КонецЕсли;
	
	ПоляСвертки = "КодНалоговогоОргана";
	Если ОрганизацияЮрлицо Тогда
		ПоляСвертки = ПоляСвертки + ",КПП";
	КонецЕсли;
	ПоляДополнительногоОтбора = ПоляСвертки;
	ПоляСвертки = ПоляСвертки + ",КодПоОКТМО";
	
	ТаблицаНДФЛ.Свернуть(ПоляСвертки);
	ТаблицаНДФЛ.Колонки.Добавить("РегистрацияВНалоговомОргане", Новый ОписаниеТипов("СправочникСсылка.РегистрацииВНалоговомОргане"));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РегистрацииВНалоговомОргане.Ссылка КАК РегистрацияВНалоговомОргане,
	|	РегистрацииВНалоговомОргане.КодПоОКТМО КАК КодПоОКТМО,
	|	РегистрацииВНалоговомОргане.КПП КАК КПП,
	|	РегистрацииВНалоговомОргане.Код КАК КодНалоговогоОргана
	|ИЗ
	|	Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
	|ГДЕ
	|	РегистрацииВНалоговомОргане.Владелец = &Организация";
	
	ДействующиеРегистрации = Запрос.Выполнить().Выгрузить();
	
	Отбор = Новый Структура(ПоляСвертки);
	ОтборДополнительный = Новый Структура(ПоляДополнительногоОтбора);
	
	Для каждого СтрокаТЗ Из ТаблицаНДФЛ Цикл
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаТЗ);
		Регистрации = ДействующиеРегистрации.НайтиСтроки(Отбор);
		Если Регистрации.Количество() > 0 Тогда
			СтрокаТЗ.РегистрацияВНалоговомОргане = Регистрации[0].РегистрацияВНалоговомОргане;
		Иначе
			ЗаполнитьЗначенияСвойств(ОтборДополнительный, СтрокаТЗ);
			Регистрации = ДействующиеРегистрации.НайтиСтроки(ОтборДополнительный);
			Если Регистрации.Количество() > 0 Тогда
				СтрокаТЗ.РегистрацияВНалоговомОргане = Регистрации[0].РегистрацияВНалоговомОргане;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого СтрокаКоллекции Из КоллекцияНачисленныйНДФЛ Цикл
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаКоллекции); 
		Отбор.КодПоОКТМО = СтрокаКоллекции[ИмяКолонкиОКТМО];		
		Регистрации = ТаблицаНДФЛ.НайтиСтроки(Отбор);
		Если Регистрации.Количество() > 0 Тогда
			СтрокаКоллекции.РегистрацияВНалоговомОргане = Регистрации[0].РегистрацияВНалоговомОргане;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#Область НачислениеУСН

// Формирует движения по отражению зарплаты в УСН
Процедура СформироватьДвиженияОтраженияЗарплатыУСН(ТаблицаОтраженияЗарплатыУСН, ТаблицаРеквизиты, Движения, Отказ) Экспорт
	
	Параметры = ПодготовитьПараметрыДвиженийОтраженияЗарплатыУСН(ТаблицаОтраженияЗарплатыУСН, ТаблицаРеквизиты);
	Реквизиты = Параметры.Реквизиты[0];
	
	Если Параметры.ТаблицаОтраженияЗарплатыУСН.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Движения.Найти("РасходыПриУСН") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Вставить("ТаблицаУСННачислениеЗарплаты", Параметры.ТаблицаОтраженияЗарплатыУСН);
	Параметры.Вставить("ПериодРегистрации", Реквизиты.Период);
	
	ДокументОбъект = Новый Структура();
	ДокументОбъект.Вставить("Организация", Реквизиты.Организация);
	ДокументОбъект.Вставить("Дата",        Реквизиты.Период);
	ДокументОбъект.Вставить("Имя",         "НачислениеЗарплаты");
	ДокументОбъект.Вставить("Ссылка",      Реквизиты.Ссылка);	
	ДокументОбъект.Вставить("Движения",    Движения);
	
	НалоговыйУчетУСН.СформироватьДвиженияУСН(ДокументОбъект, Параметры, Ложь);

КонецПроцедуры

Функция ПодготовитьПараметрыДвиженийОтраженияЗарплатыУСН(ТаблицаОтраженияЗарплатыУСН, ТаблицаРеквизиты)
	
	Параметры = Новый Структура;
	
	// Подготовка таблицы шапки документа
	СписокОбязательныхКолонок = ""
	+ "Период,"				// <Дата> - счет по дебету проводки (счет учета денежных средств)
	+ "Организация,"		// <СправочникСсылка.Организации> - организация документа
	+ "Ссылка,"				// <ДокументСсылка> - документ-регистратор
	+ "ПериодРегистрации"   // <Дата> - период регистрации
	;
	
	Параметры.Вставить("Реквизиты", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(ТаблицаРеквизиты, СписокОбязательныхКолонок));
	
	
	// Подготовка таблицы по заработной плате:
	СписокОбязательныхКолонок = ""
	+ "Счет,"						// <ПланСчетовСсылка.Хозрасчетный>
	+ "Субконто1,"					// <> - значение аналитики 
	+ "Субконто2,"					// <> - значение аналитики 
	+ "Субконто3,"					// <> - значение аналитики
	+ "КорСчет,"					// <ПланСчетовСсылка.Хозрасчетный>
	+ "КорСубконто1,"				// <> - значение аналитики 
	+ "КорСубконто2,"				// <> - значение аналитики 
	+ "КорСубконто3,"				// <> - значение аналитики	
	+ "ОтражениеВУСН,"				// <Перечисление.ОтражениеВУСН>
	+ "РасчетныйДокумент,"			// <ДокументСсылка> - документ-регистратор
	+ "Сумма"						// <Число(15,2)>
	;	
	
	Параметры.Вставить("ТаблицаОтраженияЗарплатыУСН", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(ТаблицаОтраженияЗарплатыУСН, СписокОбязательныхКолонок));

	Возврат Параметры;

КонецФункции

#КонецОбласти

#Область НачислениеИП

Процедура ОпределитьВидНачисленийУдержанийИП(ТаблицаЗаработнойПлаты, Реквизиты)
	
	СоответствиеВидовНачисленийУдержаний = Новый Соответствие;
	СоответствиеВидовНачисленийУдержаний.Вставить(Перечисления.ВидыОперацийПоЗарплате.НачисленоДоход,               Перечисления.ИПВидыНачисленийУдержаний.НачисленоПовременно);
	СоответствиеВидовНачисленийУдержаний.Вставить(Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпуск,              Перечисления.ИПВидыНачисленийУдержаний.НачисленоПовременно);
	СоответствиеВидовНачисленийУдержаний.Вставить(Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпуска, Перечисления.ИПВидыНачисленийУдержаний.НачисленоПовременно);
	СоответствиеВидовНачисленийУдержаний.Вставить(Перечисления.ВидыОперацийПоЗарплате.НачисленоСдельноДоход,        Перечисления.ИПВидыНачисленийУдержаний.НачисленоСдельно);
	СоответствиеВидовНачисленийУдержаний.Вставить(Перечисления.ВидыОперацийПоЗарплате.НатуральныйДоход,             Перечисления.ИПВидыНачисленийУдержаний.НачисленоНатуральныйДоход);
	СоответствиеВидовНачисленийУдержаний.Вставить(Перечисления.ВидыОперацийПоЗарплате.НДФЛ,                         Перечисления.ИПВидыНачисленийУдержаний.УдержаноНДФЛ);
	СоответствиеВидовНачисленийУдержаний.Вставить(Перечисления.ВидыОперацийПоЗарплате.НДФЛСПревышения,              Перечисления.ИПВидыНачисленийУдержаний.УдержаноНДФЛ);

	Если Реквизиты.Период >= ДатаНачалаАдминистрированияСтраховыхВзносовФНС() Тогда
		СоответствиеВидовНачисленийУдержаний.Вставить(Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюРаботодатель, Перечисления.ИПВидыНачисленийУдержаний.НачисленоДругое);
		СоответствиеВидовНачисленийУдержаний.Вставить(Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюФСС,          Перечисления.ИПВидыНачисленийУдержаний.НачисленоДругое);
		СоответствиеВидовНачисленийУдержаний.Вставить(Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюФССНС,        Перечисления.ИПВидыНачисленийУдержаний.НачисленоДругое);
	КонецЕсли;
	
	Если ТаблицаЗаработнойПлаты.Колонки.Найти("ВидНачисленияУдержания") = Неопределено Тогда
		ТаблицаЗаработнойПлаты.Колонки.Добавить("ВидНачисленияУдержания", Новый ОписаниеТипов("ПеречислениеСсылка.ИПВидыНачисленийУдержаний"));
		Для каждого Начисление Из ТаблицаЗаработнойПлаты Цикл
			Начисление.ВидНачисленияУдержания	= СоответствиеВидовНачисленийУдержаний.Получить(Начисление.ВидОперации);			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ПодготовитьПараметрыДвиженийОтраженияЗарплатыИП(ТаблицаНачисленияУдержания, ТаблицаРеквизитов)
	
	Параметры = Новый Структура;
	
	// Подготовка таблицы Параметры.Реквизиты
	
	СписокОбязательныхКолонок = ""
		+ "Период,"						// <Дата> - период движений - дата документа
		+ "Ссылка,"						// <ДокументСсылка.*> - документ-регистратор движений
		+ "Организация";				// <СправочникСсылка.Организации> - оранизация
		
	Параметры.Вставить("Реквизиты", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ТаблицаРеквизитов, СписокОбязательныхКолонок));
	
	// Подготовка таблицы Параметры.ТаблицаОтраженияЗарплатыИП
	
	СписокОбязательныхКолонок = ""
		+ "Счет,"						//	<ПланСчетовСсылка.Хозрасчетный>
		+ "Субконто1,"					//  <Характеристика.ВидыСубконтоХозрасчетные>
		+ "Субконто2,"					//  <Характеристика.ВидыСубконтоХозрасчетные> 
		+ "Субконто3,"					//  <Характеристика.ВидыСубконтоХозрасчетные>
		+ "КорСчет,"					//	<ПланСчетовСсылка.Хозрасчетный> 
		+ "КорСубконто1,"				//  <Характеристика.ВидыСубконтоХозрасчетные>
		+ "КорСубконто2,"				//  <Характеристика.ВидыСубконтоХозрасчетные> 
		+ "КорСубконто3,"				//  <Характеристика.ВидыСубконтоХозрасчетные>
		+ "ВидНачисленияУдержания,"		//  <ПеречислениеСсылка.ИПВидыНачисленийУдержаний> - вид начисления/удержания
		+ "Сумма";						//	<Сумма, 15, 2> - сумма начисления/удержания в рублях
		
	Параметры.Вставить("ТаблицаОтраженияЗарплатыИП", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ТаблицаНачисленияУдержания, СписокОбязательныхКолонок));
		
	Возврат Параметры;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область Удержание

Процедура СформироватьДвиженияУдержания(Движения, Отказ, Организация, Знач ПериодРегистрации, ДанныеДляОтражения, НачисленнаяЗарплатаИВзносы = Неопределено)
		
	Если Константы.УчетЗарплатыИКадровСредствамиБухгалтерии.Получить() И НЕ Константы.РасчетЗарплатыДляНебольшихОрганизаций.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	Регистратор       = Движения.ЕПС.Отбор.Регистратор.Значение;
	ПериодРегистрации = ПолучитьПериодРегистрации(Регистратор, ПериодРегистрации);
	Параметры         = ПодготовитьПараметрыПоОтражениюУдержанийВУчете(ДанныеДляОтражения, Организация, ПериодРегистрации, Регистратор);
	Реквизиты         = Параметры.Реквизиты[0];
	
	СформироватьПроводкиПоОтражениюУдержанийВУчете(Параметры.ТаблицаУдержаний, Реквизиты, Движения, Отказ);
		
КонецПроцедуры

Функция ПодготовитьПараметрыПоОтражениюУдержанийВУчете(ДанныеДляПроводок, Организация, ПериодРегистрации, Регистратор)
	
	Параметры = Новый Структура;
	
	// Подготовка таблицы шапки документа
	Реквизиты = Новый ТаблицаЗначений;
	
	Реквизиты.Колонки.Добавить("Организация");
	Реквизиты.Колонки.Добавить("Период");
	Реквизиты.Колонки.Добавить("Регистратор");
	
	НоваяСтрока             = Реквизиты.Добавить();
	НоваяСтрока.Организация = Организация;
	НоваяСтрока.Период      = ПериодРегистрации;
	НоваяСтрока.Регистратор = Регистратор;
	
	Параметры.Вставить("Реквизиты", Реквизиты);
		
	// Подготовка таблицы по заработной плате:
	СписокОбязательныхКолонок = ""
	+ "ФизическоеЛицо,"
	+ "ВидОперации,"
	+ "Подразделение,"
	+ "ПодразделениеУчетаНачислений,"
	+ "Контрагент,"	
	+ "ДоговорКонтрагента,"	
	+ "НазначениеПодотчетныхСредствПриВозмещениеУщерба,"
	+ "ЛицевойСчетНачУдержания,"	
	+ "Сумма"
	;	
	Параметры.Вставить("ТаблицаУдержаний", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ДанныеДляПроводок, СписокОбязательныхКолонок));

	Возврат Параметры;

КонецФункции

Процедура СформироватьПроводкиПоОтражениюУдержанийВУчете(ТаблицаУдержаний, Реквизиты, Движения, Отказ)
	
	Если ТаблицаУдержаний.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВестиУчетПоРаботникам = Константы.ВедетсяУчетРасчетовПоЗарплатеПоРаботникам.Получить();
	ВалютаУчета			  = Константы.ВалютаРегламентированногоУчета.Получить();
	
	ДополнитьТаблицуУдержанийЛицевымиСчетами(ТаблицаУдержаний, Реквизиты);
		
	ТаблицаУдержанийРаботников = ПодготовитьТаблицуУдержаний(ТаблицаУдержаний);
	
	СодержанияПроводок = Новый Соответствие;
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.НачисленоПроцентовПоЗайму,
								"Начислены проценты по займу");
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ПроцентыПоЗайму,
									"Удержаны проценты по займам");
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ПогашениеЗаймов,
									"Удержано погашение займа");
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛисты,
									"Удержано по исполнительному листу");
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.Профвзносы,
									"Удержаны профвзносы");
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ДСВ,
									"Удержаны добровольные взносы на накопительная часть трудовой пенсии");
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ПрочиеУдержания,
									"Прочие удержания из заработной платы");
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ДобровольныеВзносыВНПФ,
									"Удержаны добровольные взносы в негосударственный пенсионный фонд");
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгента,
									"Удержано вознаграждение платежного агента");
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ВозмещениеУщерба,
									"Удержано возмещение ущерба");
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.УдержаниеПоПрочимОперациямСРаботниками,
									"Удержание по прочим операциям с работниками");
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.УдержаниеНеизрасходованныхПодотчетныхСумм,
									"Удержание неизрасходованных подотчетных сумм");
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ВозвратИзлишнеВыплаченныхСуммВследствиеСчетныхОшибок,
									"Возврат излишне выплаченных сумм");
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.УдержаниеЗаОтпуск,
									"Удержание за неотработанные дни предоставленного авансом отпуска");
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгентаКонтрагенты,
									"Удержано вознаграждение платежного агента из доходов контрагента");
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛистыКонтрагенты,
									"Удержано по исполнительному листу из доходов контрагента");
	СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.СписаниеКорректировкиАСПоЗайму,
									"Корректировка амортизированной стоимости выданного займа");
	
	МассивСчетРасчетовСПерсоналомПоОплатеТруда = Новый Массив();
	МассивСчетРасчетовСПерсоналомПоОплатеТруда.Добавить(ПланыСчетов.ЕПС.НайтиПоКоду("60305"));
	МассивСчетРасчетовСПерсоналомПоОплатеТруда.Добавить(ПланыСчетов.ЕПС.НайтиПоКоду("60306"));

	Для Каждого СтрокаТаблицы Из ТаблицаУдержанийРаботников Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Счет)
			Или Не ЗначениеЗаполнено(СтрокаТаблицы.КорСчет) Тогда
			// не заполнены счет и аналитика
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТаблицы.Сумма = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Проводка = Движения.ЕПС.Добавить();
		Проводка.Период      = Реквизиты.Период;
		Проводка.Организация = Реквизиты.Организация;
		Проводка.Сумма       = СтрокаТаблицы.Сумма;
		Проводка.Содержание  = СодержанияПроводок.Получить(СтрокаТаблицы.ВидОперации);
		
		Проводка.ЛицевойСчетКт 	= СтрокаТаблицы.Счет;
		Проводка.СчетКт 		= СтрокаТаблицы.Счет.Владелец;
		
		Если Проводка.СчетКт.Валютный Тогда
			Проводка.ВалютаКт        = ВалютаУчета;
			Проводка.ВалютнаяСуммаКт = Проводка.Сумма;
		КонецЕсли;

		БухгалтерскийУчет.УстановитьСубконто(Проводка.ЛицевойСчетКт, Проводка.СубконтоКт, 1, СтрокаТаблицы.Субконто1);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.ЛицевойСчетКт, Проводка.СубконтоКт, 2, СтрокаТаблицы.Субконто2);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.ЛицевойСчетКт, Проводка.СубконтоКт, 3, СтрокаТаблицы.Субконто3);
		
		СвойстваСчетаКт = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка.СчетКт);
		
		Если СвойстваСчетаКт.УчетПоПодразделениям Тогда
			Проводка.ПодразделениеКт = СтрокаТаблицы.Подразделение;
		КонецЕсли;
		
		Проводка.ЛицевойСчетДт 	= СтрокаТаблицы.КорСчет;
		Проводка.СчетДт 		= СтрокаТаблицы.КорСчет.Владелец;
		
		Если Проводка.СчетДт.Валютный Тогда
			Проводка.ВалютаДт        = ВалютаУчета;
			Проводка.ВалютнаяСуммаДт = Проводка.Сумма;
		КонецЕсли;

		Если ВестиУчетПоРаботникам Тогда
			БухгалтерскийУчет.УстановитьСубконто(Проводка.ЛицевойСчетДт, Проводка.СубконтоДт, 1, СтрокаТаблицы.КорСубконто1);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.ЛицевойСчетДт, Проводка.СубконтоДт, 2, СтрокаТаблицы.КорСубконто2);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.ЛицевойСчетДт, Проводка.СубконтоДт, 3, СтрокаТаблицы.КорСубконто3);
		КонецЕсли;
		
		СвойстваСчетаДт = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка.СчетДт);
		
		// СС 11.01.2023
		//Если СвойстваСчетаДт.УчетПоПодразделениям Тогда
		//	Проводка.ПодразделениеДт = СтрокаТаблицы.Подразделение;
		//КонецЕсли;
		
		Если МассивСчетРасчетовСПерсоналомПоОплатеТруда.Найти(Проводка.СчетДт) <> Неопределено  Тогда
			Если СвойстваСчетаДт.УчетПоПодразделениям Тогда
				Проводка.ПодразделениеДт = СтрокаТаблицы.ПодразделениеУчетаНачислений;
			КонецЕсли;
		Иначе
			Если СвойстваСчетаДт.УчетПоПодразделениям Тогда
				Проводка.ПодразделениеДт = СтрокаТаблицы.Подразделение;	
			КонецЕсли;
		КонецЕсли;
		//\
		
	КонецЦикла;
	
	Движения.ЕПС.Записывать = Истина;
	
КонецПроцедуры

Функция ПодготовитьТаблицуУдержаний(ТаблицаУдержанийРаботника, УСН = Ложь, ИП = Ложь)
	
	Если ТаблицаУдержанийРаботника = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаУдержаний = ТаблицаУдержанийРаботника.СкопироватьКолонки();
	ТаблицаУдержаний.Колонки.Добавить("Счет");
	ТаблицаУдержаний.Колонки.Добавить("Субконто1");
	ТаблицаУдержаний.Колонки.Добавить("Субконто2");
	ТаблицаУдержаний.Колонки.Добавить("Субконто3");
	ТаблицаУдержаний.Колонки.Добавить("КорСчет");
	ТаблицаУдержаний.Колонки.Добавить("КорСубконто1");
	ТаблицаУдержаний.Колонки.Добавить("КорСубконто2");
	ТаблицаУдержаний.Колонки.Добавить("КорСубконто3");
	
	ПустоеСубконто 			= ПланыВидовХарактеристик.ЕПСВидыСубконто.ПустаяСсылка();
	ВидПлатежаВГосБюджет 	= Перечисления.ВидыПлатежейВГосБюджет.Налог;

	Для Каждого СтрокаТаблицы Из ТаблицаУдержанийРаботника Цикл
		
		Если СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПогашениеЗаймов
			Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПроцентыПоЗайму Тогда
			
			НоваяСтрока = ТаблицаУдержаний.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			НоваяСтрока.Счет         = СтрокаТаблицы.УдержаниеСчетУчетаПассивный;
			НоваяСтрока.Субконто1    = СтрокаТаблицы.Контрагент;
			НоваяСтрока.Субконто2    = СтрокаТаблицы.ДоговорКонтрагента;
			НоваяСтрока.КорСчет      = СтрокаТаблицы.НачислениеСчетУчетаПассивный;
			НоваяСтрока.КорСубконто1 = СтрокаТаблицы.ФизическоеЛицо;
						
		ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛисты
			Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛистыКонтрагенты Тогда
			
			НоваяСтрока = ТаблицаУдержаний.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			
			НоваяСтрока.Счет         = СтрокаТаблицы.УдержаниеСчетУчетаПассивный;
			НоваяСтрока.Субконто1    = СтрокаТаблицы.Контрагент;
			НоваяСтрока.Субконто2    = СтрокаТаблицы.ДоговорКонтрагента;

			НоваяСтрока.КорСчет      = СтрокаТаблицы.НачислениеСчетУчетаПассивный;
			НоваяСтрока.КорСубконто1 = СтрокаТаблицы.ФизическоеЛицо;
			
		ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ДСВ 
			Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ДобровольныеВзносыВНПФ Тогда
			
			НоваяСтрока = ТаблицаУдержаний.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			НоваяСтрока.Счет         = СтрокаТаблицы.УдержаниеСчетУчетаПассивный;
			НоваяСтрока.Субконто1    = СтрокаТаблицы.Контрагент;
			НоваяСтрока.Субконто2    = СтрокаТаблицы.ДоговорКонтрагента;
			НоваяСтрока.КорСчет      = СтрокаТаблицы.НачислениеСчетУчетаПассивный;
			НоваяСтрока.КорСубконто1 = СтрокаТаблицы.ФизическоеЛицо;
			
		ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.Профвзносы Тогда
			
			НоваяСтрока = ТаблицаУдержаний.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			НоваяСтрока.Счет         = СтрокаТаблицы.УдержаниеСчетУчетаПассивный;
			НоваяСтрока.Субконто1    = СтрокаТаблицы.Контрагент;
			НоваяСтрока.КорСчет      = СтрокаТаблицы.УдержаниеСчетУчетаАктивный;
			НоваяСтрока.КорСубконто1 = СтрокаТаблицы.ФизическоеЛицо;
			
		ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПрочиеУдержания Тогда
			
			НоваяСтрока = ТаблицаУдержаний.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			Если ЗначениеЗаполнено(СтрокаТаблицы.Контрагент) Тогда
				НоваяСтрока.Счет      = СтрокаТаблицы.УдержаниеСчетУчетаПассивный;
				НоваяСтрока.Субконто1 = СтрокаТаблицы.Контрагент;
			Иначе
				НоваяСтрока.Счет      = СтрокаТаблицы.УдержаниеСчетУчетаПассивный;
				НоваяСтрока.Субконто1 = СтрокаТаблицы.ФизическоеЛицо;
			КонецЕсли;
			НоваяСтрока.КорСчет      = СтрокаТаблицы.УдержаниеСчетУчетаАктивный;
			НоваяСтрока.КорСубконто1 = СтрокаТаблицы.ФизическоеЛицо;
			
		ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгента
			Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгентаКонтрагенты Тогда
			
			НоваяСтрока = ТаблицаУдержаний.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			НоваяСтрока.Счет         = СтрокаТаблицы.УдержаниеСчетУчетаПассивный;
			НоваяСтрока.Субконто1    = СтрокаТаблицы.Контрагент;
			Если СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгентаКонтрагенты Тогда
				НоваяСтрока.КорСчет      = СтрокаТаблицы.УдержаниеСчетУчетаАктивный;
			Иначе
				НоваяСтрока.КорСчет      = СтрокаТаблицы.УдержаниеСчетУчетаАктивный;
			КонецЕсли;
			НоваяСтрока.КорСубконто1 = СтрокаТаблицы.ФизическоеЛицо;
			
		ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ВозмещениеУщерба 
			Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.УдержаниеПоПрочимОперациямСРаботниками Тогда
			
			НоваяСтрока = ТаблицаУдержаний.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			
			НоваяСтрока.Счет         = СтрокаТаблицы.УдержаниеСчетУчетаПассивный;
			НоваяСтрока.Субконто1    = СтрокаТаблицы.СубконтоУдержания1;
			НоваяСтрока.Субконто2    = СтрокаТаблицы.СубконтоУдержания2;
			НоваяСтрока.Субконто3    = СтрокаТаблицы.СубконтоУдержания3;
			НоваяСтрока.КорСчет      = СтрокаТаблицы.НачислениеСчетУчетаПассивный;
			НоваяСтрока.КорСубконто1 = СтрокаТаблицы.ФизическоеЛицо;
			
		ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.УдержаниеНеизрасходованныхПодотчетныхСумм Тогда
			
			НоваяСтрока = ТаблицаУдержаний.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			НоваяСтрока.Счет         = СтрокаТаблицы.УдержаниеСчетУчетаПассивный;
			НоваяСтрока.Субконто1    = СтрокаТаблицы.ФизическоеЛицо;
			НоваяСтрока.КорСчет      = СтрокаТаблицы.УдержаниеСчетУчетаАктивный;
			НоваяСтрока.КорСубконто1 = СтрокаТаблицы.ФизическоеЛицо;
			
		ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ВозвратИзлишнеВыплаченныхСуммВследствиеСчетныхОшибок Тогда
			
			НоваяСтрока = ТаблицаУдержаний.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			НоваяСтрока.Счет         = СтрокаТаблицы.СчетУдержания;
			НоваяСтрока.Субконто1    = СтрокаТаблицы.СубконтоУдержания1;
			НоваяСтрока.КорСчет      = СтрокаТаблицы.НачислениеСчетУчетаАктивный;
			НоваяСтрока.КорСубконто1 = СтрокаТаблицы.ФизическоеЛицо;
			
		ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.УдержаниеЗаОтпуск Тогда
			
			НоваяСтрока = ТаблицаУдержаний.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			НоваяСтрока.Счет         = СтрокаТаблицы.СчетУдержания;
			НоваяСтрока.Субконто1    = СтрокаТаблицы.СубконтоУдержания1;
			НоваяСтрока.КорСчет      = СтрокаТаблицы.НачислениеСчетУчетаАктивный;
			НоваяСтрока.КорСубконто1 = СтрокаТаблицы.ФизическоеЛицо;
			
		ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НачисленоПроцентовПоЗайму
			Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПогашениеПроцентовПоЗайму Тогда
			
			НоваяСтрока = ТаблицаУдержаний.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			НоваяСтрока.Счет      = СтрокаТаблицы.СчетУдержания;
			НоваяСтрока.Субконто1 = СтрокаТаблицы.СубконтоУдержания1;
			НоваяСтрока.Субконто2 = ?(ЗначениеЗаполнено(СтрокаТаблицы.СубконтоУдержания2), СтрокаТаблицы.СубконтоУдержания2, ПустоеСубконто);
			НоваяСтрока.Субконто3 = ПустоеСубконто;
			НоваяСтрока.КорСчет         = СтрокаТаблицы.НачислениеСчетУчетаАктивный;
			НоваяСтрока.КорСубконто1    = СтрокаТаблицы.Контрагент;
			НоваяСтрока.КорСубконто2    = СтрокаТаблицы.ДоговорКонтрагента;
			НоваяСтрока.КорСубконто3    = ПустоеСубконто;
			
		ИначеЕсли СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.СписаниеКорректировкиАСПоЗайму Тогда
			
			НоваяСтрока = ТаблицаУдержаний.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			Если ЗначениеЗаполнено(СтрокаТаблицы.НачислениеСчетУчетаПассивный) Тогда // 48608
				НоваяСтрока.Счет      = СтрокаТаблицы.СчетУдержания;
				НоваяСтрока.Субконто1 = СтрокаТаблицы.СубконтоУдержания1;
				НоваяСтрока.Субконто2 = ПустоеСубконто;
				НоваяСтрока.Субконто3 = ПустоеСубконто;
				НоваяСтрока.КорСчет         = СтрокаТаблицы.НачислениеСчетУчетаПассивный;
				НоваяСтрока.КорСубконто1    = СтрокаТаблицы.Контрагент;
				НоваяСтрока.КорСубконто2    = СтрокаТаблицы.ДоговорКонтрагента;
				НоваяСтрока.КорСубконто3    = ПустоеСубконто;
			Иначе //48607
				НоваяСтрока.Счет      = СтрокаТаблицы.НачислениеСчетУчетаАктивный;
				НоваяСтрока.Субконто1 = СтрокаТаблицы.Контрагент;
				НоваяСтрока.Субконто2 = СтрокаТаблицы.ДоговорКонтрагента;
				НоваяСтрока.Субконто3 = ПустоеСубконто;
				НоваяСтрока.КорСчет         = СтрокаТаблицы.СчетУдержания;
				НоваяСтрока.КорСубконто1    = СтрокаТаблицы.СубконтоУдержания1;
				НоваяСтрока.КорСубконто2    = ПустоеСубконто;
				НоваяСтрока.КорСубконто3    = ПустоеСубконто;
			КонецЕсли;

		КонецЕсли;
		
	КонецЦикла;
		
	СтрокаСвертки = "ВидОперации, Подразделение, ПодразделениеУчетаНачислений, Счет, Субконто1, Субконто2, Субконто3, КорСчет, КорСубконто1, КорСубконто2, КорСубконто3"; // СС 11.01.2023
			
	ТаблицаУдержаний.Свернуть(СтрокаСвертки, "Сумма");
	
	Возврат ТаблицаУдержаний;
	
КонецФункции

Процедура ДополнитьТаблицуУдержанийЛицевымиСчетами(ТаблицаУдержаний, Реквизиты, ВестиУчетПоРаботникам = Истина)
	
	ТаблицаУдержаний.Колонки.Добавить("УдержаниеСчетУчетаПассивный", 		Новый ОписаниеТипов("СправочникСсылка.ЕПСЛицевыеСчета"));
	ТаблицаУдержаний.Колонки.Добавить("УдержаниеСчетУчетаАктивный", 		Новый ОписаниеТипов("СправочникСсылка.ЕПСЛицевыеСчета"));
	ТаблицаУдержаний.Колонки.Добавить("НачислениеСчетУчетаПассивный", 		Новый ОписаниеТипов("СправочникСсылка.ЕПСЛицевыеСчета"));
	ТаблицаУдержаний.Колонки.Добавить("НачислениеСчетУчетаАктивный", 		Новый ОписаниеТипов("СправочникСсылка.ЕПСЛицевыеСчета"));
	ТаблицаУдержаний.Колонки.Добавить("СчетУдержания", 						Новый ОписаниеТипов("СправочникСсылка.ЕПСЛицевыеСчета"));
	ТаблицаУдержаний.Колонки.Добавить("СубконтоУдержания1");
	ТаблицаУдержаний.Колонки.Добавить("СубконтоУдержания2");
	ТаблицаУдержаний.Колонки.Добавить("СубконтоУдержания3");
	
	СтрокаКолонокДляОпределенияСчетов = "Подразделение, ВидОперации, Контрагент, ДоговорКонтрагента, ЛицевойСчетНачУдержания, ФизическоеЛицо, НазначениеПодотчетныхСредствПриВозмещениеУщерба";
	
	ТаблицаДляПолученияСчетов = ТаблицаУдержаний.Скопировать(,СтрокаКолонокДляОпределенияСчетов);
	
	Если Не ВестиУчетПоРаботникам Тогда
		ТаблицаДляПолученияСчетов.ЗаполнитьЗначения(Неопределено, "ФизическоеЛицо");	
	КонецЕсли;
	
	ТаблицаДляПолученияСчетов.Свернуть(СтрокаКолонокДляОпределенияСчетов);
	
	ТаблицаДляПолученияСчетов = ДополнитьТаблицуУдержанийПараметрамиОтраженияВБУ(ТаблицаДляПолученияСчетов, Реквизиты);
	
	СоответствиеСчетовУчета = Новый Соответствие;
	СоответствиеСчетовУчета.Вставить(Перечисления.ЕПСВидыСчетов.СчетУчетаПассивный, "СчетУчетаПассивный");
	СоответствиеСчетовУчета.Вставить(Перечисления.ЕПСВидыСчетов.СчетУчетаАктивный, 	"СчетУчетаАктивный");
	
	// СС 04.10.202
	// Выданные займы сотрудникам
	УчетнаяПолитикаЛомбарда = ЮС_УправлениеЛомбардомРасчет.ПолучитьУчетнуюПолитикуЛомбарда(Реквизиты.Период, Реквизиты.Организация);
	СтатьяДляОтраженияКорректировокУменПроцентныеДоходы		= УчетнаяПолитикаЛомбарда.СтатьяДляОтраженияКорректировокУменПроцентныеДоходы;
	СтатьяДляОтраженияКорректировокУвелПроцентныеДоходы 	= УчетнаяПолитикаЛомбарда.СтатьяДляОтраженияКорректировокУвелПроцентныеРасходыПоВыданнымЗаймам;
	ЛицевойСчетКорректировокУвеличивающихПроцентныеДоходы 	= ЮС_СчетаУчетаВДокументах.ПолучитьСчетаУчетаДоходовИРасходовИзРегистраСведений(Реквизиты.Организация,
																СтатьяДляОтраженияКорректировокУвелПроцентныеДоходы.ЕПСВидДоходов, СтатьяДляОтраженияКорректировокУвелПроцентныеДоходы).СчетУчета;
	ЛицевойСчетКорректировокУменьшающихПроцентныеДоходы		= ЮС_СчетаУчетаВДокументах.ПолучитьСчетаУчетаДоходовИРасходовИзРегистраСведений(Реквизиты.Организация,
																СтатьяДляОтраженияКорректировокУменПроцентныеДоходы.ЕПСВидРасходов, СтатьяДляОтраженияКорректировокУменПроцентныеДоходы).СчетУчета;

	Для каждого СтрокаТаблицы Из ТаблицаДляПолученияСчетов Цикл
		
		ИспользуемыеСчетаНачисление = ЮС_СчетаУчетаВДокументах.ПолучитьСчетаРасчетовСРаботниками(Реквизиты.Организация, СтрокаТаблицы.ФизическоеЛицо,,
			Перечисления.ЮС_ВидыВыплатРаботникам.ОплатаТруда);
		
		Если ЗначениеЗаполнено(ИспользуемыеСчетаНачисление) Тогда
			
			СтруктураПоиска = Новый Структура("Подразделение, ВидОперации");
			
			Если ВестиУчетПоРаботникам Тогда
				СтруктураПоиска.Вставить("ФизическоеЛицо");
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаТаблицы.ДоговорКонтрагента) Тогда
				СтруктураПоиска.Вставить("ДоговорКонтрагента");
			КонецЕсли;

			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТаблицы);
			
			СтрокиТаблицыУдержаний = ТаблицаУдержаний.НайтиСтроки(СтруктураПоиска);
			
			Для каждого СтрокаТаблицыУдержаний Из СтрокиТаблицыУдержаний Цикл
				
				Если СтрокаТаблицыУдержаний.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.УдержаниеЗаОтпуск Тогда
					Если ИспользуемыеСчетаНачисление.Свойство("СчетУчетаАктивный") Тогда
						СтрокаТаблицыУдержаний.НачислениеСчетУчетаАктивный 	= ИспользуемыеСчетаНачисление.СчетУчетаПассивный;
					КонецЕсли;
				ИначеЕсли СтрокаТаблицыУдержаний.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НачисленоПроцентовПоЗайму 
					Или СтрокаТаблицыУдержаний.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПогашениеПроцентовПоЗайму Тогда
					СтрокаТаблицыУдержаний.НачислениеСчетУчетаАктивный 	= СтрокаТаблицыУдержаний.ЛицевойСчетНачУдержания;
				ИначеЕсли СтрокаТаблицыУдержаний.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.СписаниеКорректировкиАСПоЗайму Тогда
					Если СтрокаТаблицыУдержаний.ЛицевойСчетНачУдержания.Владелец.Вид = ВидСчета.Пассивный Тогда // 48608
						СтрокаТаблицыУдержаний.НачислениеСчетУчетаПассивный = СтрокаТаблицыУдержаний.ЛицевойСчетНачУдержания;
					Иначе  // 48607
						СтрокаТаблицыУдержаний.НачислениеСчетУчетаАктивный 	= СтрокаТаблицыУдержаний.ЛицевойСчетНачУдержания;
					КонецЕсли;
				Иначе
					Если ИспользуемыеСчетаНачисление.Свойство("СчетУчетаПассивный") Тогда
						СтрокаТаблицыУдержаний.НачислениеСчетУчетаПассивный = ИспользуемыеСчетаНачисление.СчетУчетаПассивный;
					КонецЕсли;
					Если ИспользуемыеСчетаНачисление.Свойство("СчетУчетаАктивный") Тогда
						СтрокаТаблицыУдержаний.НачислениеСчетУчетаАктивный 	= ИспользуемыеСчетаНачисление.СчетУчетаАктивный;
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
				
		Если ЗначениеЗаполнено(СтрокаТаблицы.ЛицевойСчетНачУдержания) Тогда
			
			СтруктураПоиска = Новый Структура("Подразделение, ВидОперации, Контрагент");
			Если ВестиУчетПоРаботникам Тогда
				СтруктураПоиска.Вставить("ФизическоеЛицо");
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаТаблицы.ДоговорКонтрагента) Тогда
				СтруктураПоиска.Вставить("ДоговорКонтрагента");
			КонецЕсли;

			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТаблицы);
			
			СтрокиТаблицыУдержаний = ТаблицаУдержаний.НайтиСтроки(СтруктураПоиска);
			
			Для каждого СтрокаТаблицыУдержаний Из СтрокиТаблицыУдержаний Цикл
				СтрокаТаблицыУдержаний.УдержаниеСчетУчетаПассивный = СтрокаТаблицы.ЛицевойСчетНачУдержания;
			КонецЦикла;
			
		КонецЕсли;

		СтруктураПоиска = Новый Структура("Подразделение, ВидОперации, ФизическоеЛицо, ДоговорКонтрагента");
			
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТаблицы);
		
		СтрокиТаблицыУдержаний = ТаблицаУдержаний.НайтиСтроки(СтруктураПоиска);
		
		Для каждого СтрокаТаблицыУдержаний Из СтрокиТаблицыУдержаний Цикл
			
			СтрокаТаблицыУдержаний.СчетУдержания = СтрокаТаблицы.ЛицевойСчетНачУдержания;
			Если СтрокаТаблицыУдержаний.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ВозмещениеУщерба Тогда
				// Назначение подотчетных средств
				СтрокаТаблицыУдержаний.СубконтоУдержания1 = СтрокаТаблицы.ФизическоеЛицо;
				СтрокаТаблицыУдержаний.СубконтоУдержания2 = СтрокаТаблицы.НазначениеПодотчетныхСредствПриВозмещениеУщерба;
			ИначеЕсли СтрокаТаблицыУдержаний.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.УдержаниеЗаОтпуск Тогда
				СтрокаТаблицыУдержаний.СчетУдержания      = СтрокаТаблицы.СчетУдержания;
				СтрокаТаблицыУдержаний.СубконтоУдержания1 = СтрокаТаблицы.СубконтоУдержания1;
			ИначеЕсли СтрокаТаблицыУдержаний.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НачисленоПроцентовПоЗайму Тогда
				СтрокаТаблицыУдержаний.СчетУдержания      = СтрокаТаблицы.СчетУдержания;
				СтрокаТаблицыУдержаний.СубконтоУдержания1 = СтрокаТаблицы.СубконтоУдержания1;
			ИначеЕсли СтрокаТаблицыУдержаний.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.СписаниеКорректировкиАСПоЗайму Тогда
				Если СтрокаТаблицыУдержаний.ЛицевойСчетНачУдержания.Владелец.Вид = ВидСчета.Пассивный Тогда // 48608
					// Дт 71006 (символ ОФР 31618) Кт 48607
					СтрокаТаблицыУдержаний.СчетУдержания 		= ЛицевойСчетКорректировокУвеличивающихПроцентныеДоходы;
					СтрокаТаблицыУдержаний.СубконтоУдержания1 	= СтатьяДляОтраженияКорректировокУвелПроцентныеДоходы;
				Иначе // Дт 48608 Кт 71005 (символ ОФР 31518)
					СтрокаТаблицыУдержаний.СчетУдержания 		= ЛицевойСчетКорректировокУменьшающихПроцентныеДоходы;
					СтрокаТаблицыУдержаний.СубконтоУдержания1 	= СтатьяДляОтраженияКорректировокУменПроцентныеДоходы;
				КонецЕсли;
			ИначеЕсли СтрокаТаблицыУдержаний.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПогашениеПроцентовПоЗайму Тогда
				// Необходимо найти счет начисления процентов
				СтруктураПоискаСчетНачислениеПроцентов = Новый Структура("ВидОперации, ДоговорКонтрагента");
				СтруктураПоискаСчетНачислениеПроцентов.ВидОперации 			= Перечисления.ВидыОперацийПоЗарплате.НачисленоПроцентовПоЗайму;
				СтруктураПоискаСчетНачислениеПроцентов.ДоговорКонтрагента 	= СтрокаТаблицы.ДоговорКонтрагента;
				
				СтрокиТаблицыУдержанийНачислениеПроцентов = ТаблицаУдержаний.НайтиСтроки(СтруктураПоискаСчетНачислениеПроцентов);
				Если СтрокиТаблицыУдержанийНачислениеПроцентов.Количество() Тогда
					СтрокаТаблицыУдержаний.СчетУдержания 		= СтрокиТаблицыУдержанийНачислениеПроцентов[0].ЛицевойСчетНачУдержания;					
					СтрокаТаблицыУдержаний.СубконтоУдержания1 	= СтрокаТаблицы.Контрагент;
					СтрокаТаблицыУдержаний.СубконтоУдержания2 	= СтрокаТаблицы.ДоговорКонтрагента;
				КонецЕсли;
			Иначе
				СтрокаТаблицыУдержаний.СубконтоУдержания1 = СтрокаТаблицы.Контрагент;
				СтрокаТаблицыУдержаний.СубконтоУдержания2 = СтрокаТаблицы.ДоговорКонтрагента;
			КонецЕсли;
			СтрокаТаблицыУдержаний.СубконтоУдержания3 = Неопределено;
			
		КонецЦикла;
		
	КонецЦикла;
			
КонецПроцедуры

Функция ДополнитьТаблицуУдержанийПараметрамиОтраженияВБУ(ТаблицаУдержаний, Реквизиты)
	
	Запрос = Новый Запрос;
	
	МассивОпераций = Новый Массив;	
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПогашениеЗаймов);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПроцентыПоЗайму);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛисты);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ДСВ);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.Профвзносы);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ДобровольныеВзносыВНПФ);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгента);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ВозмещениеУщерба);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.УдержаниеПоПрочимОперациямСРаботниками);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.УдержаниеНеизрасходованныхПодотчетныхСумм);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ВозвратИзлишнеВыплаченныхСуммВследствиеСчетныхОшибок);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.УдержаниеЗаОтпуск);
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.НачисленоПроцентовПоЗайму); 
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПрочиеУдержания); 
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПогашениеПроцентовПоЗайму); 
	МассивОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.СписаниеКорректировкиАСПоЗайму); 

	ПравилаОтражений = Новый Массив;
	ПравилаОтражений.Добавить(ПланыВидовХарактеристик.ЕПСПравилаОтраженияЗарплаты.Начисления);
	ПравилаОтражений.Добавить(ПланыВидовХарактеристик.ЕПСПравилаОтраженияЗарплаты.Удержания);
	
	Запрос.УстановитьПараметр("Организация", 		Реквизиты.Организация);
	Запрос.УстановитьПараметр("ПравилаОтражения",	ПравилаОтражений);
	Запрос.УстановитьПараметр("ВидыОпераций",       МассивОпераций);
	Запрос.УстановитьПараметр("ТаблицаУдержаний", 	ТаблицаУдержаний);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаУдержаний.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ТаблицаУдержаний.Контрагент КАК Контрагент,
	|	ТаблицаУдержаний.Подразделение КАК Подразделение,
	|	ТаблицаУдержаний.ВидОперации КАК ВидОперации,
	|	ТаблицаУдержаний.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ТаблицаУдержаний.ЛицевойСчетНачУдержания КАК ЛицевойСчетНачУдержания,
	|	ТаблицаУдержаний.НазначениеПодотчетныхСредствПриВозмещениеУщерба КАК НазначениеПодотчетныхСредствПриВозмещениеУщерба
	|ПОМЕСТИТЬ ТаблицаУдержанийИсходная
	|ИЗ
	|	&ТаблицаУдержаний КАК ТаблицаУдержаний
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаУдержаний.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ТаблицаУдержаний.Контрагент КАК Контрагент,
	|	ТаблицаУдержаний.Подразделение КАК Подразделение,
	|	ТаблицаУдержаний.ВидОперации КАК ВидОперации,
	|	ТаблицаУдержаний.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ТаблицаУдержаний.ЛицевойСчетНачУдержания КАК ЛицевойСчетНачУдержания,
	|	ТаблицаУдержаний.НазначениеПодотчетныхСредствПриВозмещениеУщерба КАК НазначениеПодотчетныхСредствПриВозмещениеУщерба
	|ПОМЕСТИТЬ ТаблицаУдержаний
	|ИЗ
	|	ТаблицаУдержанийИсходная КАК ТаблицаУдержаний
	|ГДЕ
	|	ТаблицаУдержаний.ВидОперации В(&ВидыОпераций)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ЕПСПорядокОтраженияЗарплаты.СпособОтраженияЗарплатыВБухУчете КАК Перечисление.ВидыОперацийПоЗарплате), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Пустаяссылка)) КАК СпособОтраженияЗарплатыВБухУчете,
	|	ЕПСПорядокОтраженияЗарплаты.ПравилоОтражения КАК ПравилоОтражения,
	|	ЕПСПорядокОтраженияЗарплаты.Счет КАК Счет,
	|	ЕПСПорядокОтраженияЗарплаты.ЕПСПараметрОтраженияВБУ КАК ЕПСПараметрОтраженияВБУ,
	|	0 КАК Порядок,
	|	ЕПСПорядокОтраженияЗарплаты.Субконто1 КАК Субконто1,
	|	ЕПСПорядокОтраженияЗарплаты.Субконто2 КАК Субконто2,
	|	ЕПСПорядокОтраженияЗарплаты.Субконто3 КАК Субконто3
	|ПОМЕСТИТЬ ВТ_ПорядокОтражения
	|ИЗ
	|	РегистрСведений.ЕПСПорядокОтраженияЗарплаты КАК ЕПСПорядокОтраженияЗарплаты
	|ГДЕ
	|	ЕПСПорядокОтраженияЗарплаты.Организация = &Организация
	|	И ЕПСПорядокОтраженияЗарплаты.ПравилоОтражения В(&ПравилаОтражения)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ЕПСПорядокОтраженияЗарплаты.СпособОтраженияЗарплатыВБухУчете КАК Перечисление.ВидыОперацийПоЗарплате), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Пустаяссылка)),
	|	ЕПСПорядокОтраженияЗарплаты.ПравилоОтражения,
	|	ЕПСПорядокОтраженияЗарплаты.Счет,
	|	ЕПСПорядокОтраженияЗарплаты.ЕПСПараметрОтраженияВБУ,
	|	1,
	|	ЕПСПорядокОтраженияЗарплаты.Субконто1,
	|	ЕПСПорядокОтраженияЗарплаты.Субконто2,
	|	ЕПСПорядокОтраженияЗарплаты.Субконто3
	|ИЗ
	|	РегистрСведений.ЕПСПорядокОтраженияЗарплаты КАК ЕПСПорядокОтраженияЗарплаты
	|ГДЕ
	|	ЕПСПорядокОтраженияЗарплаты.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И ЕПСПорядокОтраженияЗарплаты.ПравилоОтражения В(&ПравилаОтражения)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПорядокОтражения.ПравилоОтражения КАК ПравилоОтражения,
	|	ВТ_ПорядокОтражения.СпособОтраженияЗарплатыВБухУчете КАК СпособОтраженияЗарплатыВБухУчете,
	|	МИНИМУМ(ВТ_ПорядокОтражения.Порядок) КАК Порядок
	|ПОМЕСТИТЬ ВТ_ТаблицаОтбор
	|ИЗ
	|	ВТ_ПорядокОтражения КАК ВТ_ПорядокОтражения
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПорядокОтражения.ПравилоОтражения,
	|	ВТ_ПорядокОтражения.СпособОтраженияЗарплатыВБухУчете
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПорядокОтражения.СпособОтраженияЗарплатыВБухУчете КАК СпособОтраженияЗарплатыВБухУчете,
	|	ВТ_ПорядокОтражения.ПравилоОтражения КАК ПравилоОтражения,
	|	ВТ_ПорядокОтражения.Счет КАК Счет,
	|	ВТ_ПорядокОтражения.ЕПСПараметрОтраженияВБУ КАК ЕПСПараметрОтраженияВБУ,
	|	ВЫБОР
	|		КОГДА ВТ_ПорядокОтражения.СпособОтраженияЗарплатыВБухУчете = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПорядокПараметраОтраженияВБУ,
	|	ВТ_ПорядокОтражения.Субконто1 КАК Субконто1,
	|	ВТ_ПорядокОтражения.Субконто2 КАК Субконто2,
	|	ВТ_ПорядокОтражения.Субконто3 КАК Субконто3
	|ПОМЕСТИТЬ ВТ_Итоговая
	|ИЗ
	|	ВТ_ПорядокОтражения КАК ВТ_ПорядокОтражения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаОтбор КАК ВТ_ТаблицаОтбор
	|		ПО ВТ_ПорядокОтражения.СпособОтраженияЗарплатыВБухУчете = ВТ_ТаблицаОтбор.СпособОтраженияЗарплатыВБухУчете
	|			И ВТ_ПорядокОтражения.Порядок = ВТ_ТаблицаОтбор.Порядок
	|			И ВТ_ПорядокОтражения.ПравилоОтражения = ВТ_ТаблицаОтбор.ПравилоОтражения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаУдержаний.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ТаблицаУдержаний.Контрагент КАК Контрагент,
	|	ТаблицаУдержаний.Подразделение КАК Подразделение,
	|	ТаблицаУдержаний.ВидОперации КАК ВидОперации,
	|	ВТ_ИтоговаяУдержания.ЕПСПараметрОтраженияВБУ КАК ЕПСПараметрОтраженияВБУУдержания,
	|	ВТ_ИтоговаяНачисления.ЕПСПараметрОтраженияВБУ КАК ЕПСПараметрОтраженияВБУНачисления,
	|	ВТ_ИтоговаяУдержания.ПорядокПараметраОтраженияВБУ КАК ПорядокПараметраОтраженияВБУУдержания,
	|	ВТ_ИтоговаяНачисления.ПорядокПараметраОтраженияВБУ КАК ПорядокПараметраОтраженияВБУНачисления,
	|	ВТ_ИтоговаяУдержания.Счет КАК СчетУдержания,
	|	ВТ_ИтоговаяУдержания.Субконто1 КАК Субконто1,
	|	ВТ_ИтоговаяУдержания.Субконто2 КАК Субконто2,
	|	ВТ_ИтоговаяУдержания.Субконто3 КАК Субконто3,
	|	ТаблицаУдержаний.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ТаблицаУдержаний.ЛицевойСчетНачУдержания КАК ЛицевойСчетНачУдержания,
	|	ТаблицаУдержаний.НазначениеПодотчетныхСредствПриВозмещениеУщерба КАК НазначениеПодотчетныхСредствПриВозмещениеУщерба
	|ПОМЕСТИТЬ ВТ_ПредварительныйРезультат
	|ИЗ
	|	ТаблицаУдержаний КАК ТаблицаУдержаний
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Итоговая КАК ВТ_ИтоговаяУдержания
	|		ПО (ВТ_ИтоговаяУдержания.ПравилоОтражения = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ЕПСПравилаОтраженияЗарплаты.Удержания))
	|			И (ВЫБОР
	|				КОГДА ВТ_ИтоговаяУдержания.ПорядокПараметраОтраженияВБУ = 1
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ТаблицаУдержаний.ВидОперации = ВТ_ИтоговаяУдержания.СпособОтраженияЗарплатыВБухУчете
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Итоговая КАК ВТ_ИтоговаяНачисления
	|		ПО (ВТ_ИтоговаяНачисления.ПравилоОтражения = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ЕПСПравилаОтраженияЗарплаты.Начисления))
	|			И (ВЫБОР
	|				КОГДА ВТ_ИтоговаяНачисления.ПорядокПараметраОтраженияВБУ = 1
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ТаблицаУдержаний.ВидОперации = ВТ_ИтоговаяНачисления.СпособОтраженияЗарплатыВБухУчете
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПредварительныйРезультат.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТ_ПредварительныйРезультат.Контрагент КАК Контрагент,
	|	ВТ_ПредварительныйРезультат.Подразделение КАК Подразделение,
	|	ВТ_ПредварительныйРезультат.ВидОперации КАК ВидОперации,
	|	МИНИМУМ(ВТ_ПредварительныйРезультат.ПорядокПараметраОтраженияВБУУдержания) КАК ПорядокПараметраОтраженияВБУУдержания,
	|	МИНИМУМ(ВТ_ПредварительныйРезультат.ПорядокПараметраОтраженияВБУНачисления) КАК ПорядокПараметраОтраженияВБУНачисления,
	|	ВТ_ПредварительныйРезультат.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВТ_ПредварительныйРезультат.ЛицевойСчетНачУдержания КАК ЛицевойСчетНачУдержания,
	|	ВТ_ПредварительныйРезультат.НазначениеПодотчетныхСредствПриВозмещениеУщерба КАК НазначениеПодотчетныхСредствПриВозмещениеУщерба
	|ПОМЕСТИТЬ ВТ_РезультатПромежуточная
	|ИЗ
	|	ВТ_ПредварительныйРезультат КАК ВТ_ПредварительныйРезультат
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПредварительныйРезультат.ФизическоеЛицо,
	|	ВТ_ПредварительныйРезультат.Контрагент,
	|	ВТ_ПредварительныйРезультат.Подразделение,
	|	ВТ_ПредварительныйРезультат.ВидОперации,
	|	ВТ_ПредварительныйРезультат.ДоговорКонтрагента,
	|	ВТ_ПредварительныйРезультат.ЛицевойСчетНачУдержания,
	|	ВТ_ПредварительныйРезультат.НазначениеПодотчетныхСредствПриВозмещениеУщерба
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПредварительныйРезультат.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТ_ПредварительныйРезультат.Контрагент КАК Контрагент,
	|	ВТ_ПредварительныйРезультат.Подразделение КАК Подразделение,
	|	ВТ_ПредварительныйРезультат.ВидОперации КАК ВидОперации,
	|	ВТ_ПредварительныйРезультат.ЕПСПараметрОтраженияВБУУдержания КАК ЕПСПараметрОтраженияВБУУдержания,
	|	ВТ_ПредварительныйРезультат.ЕПСПараметрОтраженияВБУНачисления КАК ЕПСПараметрОтраженияВБУНачисления,
	|	ВТ_ПредварительныйРезультат.СчетУдержания КАК СчетУдержания,
	|	ВТ_ПредварительныйРезультат.Субконто1 КАК СубконтоУдержания1,
	|	ВТ_ПредварительныйРезультат.Субконто2 КАК СубконтоУдержания2,
	|	ВТ_ПредварительныйРезультат.Субконто3 КАК СубконтоУдержания3,
	|	ВТ_ПредварительныйРезультат.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВТ_ПредварительныйРезультат.ЛицевойСчетНачУдержания КАК ЛицевойСчетНачУдержания,
	|	ВТ_ПредварительныйРезультат.НазначениеПодотчетныхСредствПриВозмещениеУщерба КАК НазначениеПодотчетныхСредствПриВозмещениеУщерба
	|ИЗ
	|	ВТ_ПредварительныйРезультат КАК ВТ_ПредварительныйРезультат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РезультатПромежуточная КАК ВТ_РезультатПромежуточная
	|		ПО ВТ_ПредварительныйРезультат.ПорядокПараметраОтраженияВБУУдержания = ВТ_РезультатПромежуточная.ПорядокПараметраОтраженияВБУУдержания
	|			И ВТ_ПредварительныйРезультат.ПорядокПараметраОтраженияВБУНачисления = ВТ_РезультатПромежуточная.ПорядокПараметраОтраженияВБУНачисления
	|			И ВТ_ПредварительныйРезультат.ФизическоеЛицо = ВТ_РезультатПромежуточная.ФизическоеЛицо
	|			И ВТ_ПредварительныйРезультат.Контрагент = ВТ_РезультатПромежуточная.Контрагент
	|			И ВТ_ПредварительныйРезультат.Подразделение = ВТ_РезультатПромежуточная.Подразделение
	|			И ВТ_ПредварительныйРезультат.ВидОперации = ВТ_РезультатПромежуточная.ВидОперации";
		
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

#Область УдержанияИП

Процедура ОпределитьВидУдержанийИП(ТаблицаЗаработнойПлаты)
	
	СоответствиеВидовНачисленийУдержаний = Новый Соответствие;
	СоответствиеВидовНачисленийУдержаний.Вставить(Перечисления.ВидыОперацийПоЗарплате.ПрочиеУдержания,                           Перечисления.ИПВидыНачисленийУдержаний.УдержаноДругое);
	СоответствиеВидовНачисленийУдержаний.Вставить(Перечисления.ВидыОперацийПоЗарплате.ДСВ,                                       Перечисления.ИПВидыНачисленийУдержаний.УдержаноДругое);
	СоответствиеВидовНачисленийУдержаний.Вставить(Перечисления.ВидыОперацийПоЗарплате.ДобровольныеВзносыВНПФ,                    Перечисления.ИПВидыНачисленийУдержаний.УдержаноДругое);
	СоответствиеВидовНачисленийУдержаний.Вставить(Перечисления.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгента,            Перечисления.ИПВидыНачисленийУдержаний.УдержаноДругое);
	СоответствиеВидовНачисленийУдержаний.Вставить(Перечисления.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛисты,         Перечисления.ИПВидыНачисленийУдержаний.УдержаноИсполнительныйЛист);
	СоответствиеВидовНачисленийУдержаний.Вставить(Перечисления.ВидыОперацийПоЗарплате.ПогашениеЗаймов,                           Перечисления.ИПВидыНачисленийУдержаний.УдержаноДругое);
	СоответствиеВидовНачисленийУдержаний.Вставить(Перечисления.ВидыОперацийПоЗарплате.ПроцентыПоЗайму,                           Перечисления.ИПВидыНачисленийУдержаний.УдержаноДругое);
	СоответствиеВидовНачисленийУдержаний.Вставить(Перечисления.ВидыОперацийПоЗарплате.ВозмещениеУщерба,                          Перечисления.ИПВидыНачисленийУдержаний.УдержаноДругое);
	СоответствиеВидовНачисленийУдержаний.Вставить(Перечисления.ВидыОперацийПоЗарплате.УдержаниеПоПрочимОперациямСРаботниками,    Перечисления.ИПВидыНачисленийУдержаний.УдержаноДругое);
	СоответствиеВидовНачисленийУдержаний.Вставить(Перечисления.ВидыОперацийПоЗарплате.УдержаниеНеизрасходованныхПодотчетныхСумм, Перечисления.ИПВидыНачисленийУдержаний.УдержаноДругое);
		
	Если ТаблицаЗаработнойПлаты.Колонки.Найти("ВидНачисленияУдержания") = Неопределено Тогда
		ТаблицаЗаработнойПлаты.Колонки.Добавить("ВидНачисленияУдержания", Новый ОписаниеТипов("ПеречислениеСсылка.ИПВидыНачисленийУдержаний"));
		Для каждого Начисление Из ТаблицаЗаработнойПлаты Цикл
			Начисление.ВидНачисленияУдержания = СоответствиеВидовНачисленийУдержаний.Получить(Начисление.ВидОперации);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьДвиженияПоРегистрамИПУдержания(Параметры, ТаблицаУдержаний, Реквизиты, ТаблицаЗаработнойПлаты, Движения, Отказ)
	
	ОпределитьВидУдержанийИП(ТаблицаУдержаний);
	
	Если ТаблицаУдержаний.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаУдержаний = ПодготовитьТаблицуУдержаний(ТаблицаУдержаний, , Истина);
	
	Если ТаблицаУдержаний.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
			
	Если Движения.Найти("ИПРасходыНаОплатуТруда") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТаблицаЗаработнойПлаты <> Неопределено Тогда
		ДополнитьТаблицуУдержанийИсточникамиДоходов(ТаблицаУдержаний, ТаблицаЗаработнойПлаты, Реквизиты);
	КонецЕсли;
		
	Если Параметры.Реквизиты.Колонки.Найти("Ссылка") = Неопределено Тогда
		Параметры.Реквизиты.Колонки.Добавить("Ссылка",	Документы.ТипВсеСсылки());
		Параметры.Реквизиты.ЗаполнитьЗначения(Реквизиты.Регистратор, "Ссылка");
	КонецЕсли;
	
	Если Параметры.Реквизиты.Колонки.Найти("Удержания") = Неопределено Тогда
		Параметры.Реквизиты.Колонки.Добавить("Удержания");
		Параметры.Реквизиты.ЗаполнитьЗначения(Истина, "Удержания");
	КонецЕсли;
	
	Параметры.Вставить("ТаблицаНачисленияУдержания", ТаблицаУдержаний);
	
	УчетДоходовИРасходовПредпринимателя.СформироватьДвиженияРасходовНаОплатуТруда_Удержания(Параметры, Движения, Отказ);
	
КонецПроцедуры

Процедура ДополнитьТаблицуУдержанийИсточникамиДоходов(ТаблицаУдержаний, ТаблицаЗаработнойПлаты, Реквизиты)
	
	ОчиститьТаблицуЗаработнойПлаты(ТаблицаЗаработнойПлаты);
	ТаблицаЗаработнойПлаты = ДополнитьТаблицуЗарплатыАналитикойБухУчета(ТаблицаЗаработнойПлаты, Реквизиты);
	ОпределитьВидНачисленийУдержанийИП(ТаблицаЗаработнойПлаты, Реквизиты);
	ТаблицаЗаработнойПлаты = ПодготовитьТаблицуНачисленийУдержаний(ТаблицаЗаработнойПлаты, , Истина, Реквизиты);
	
	Для Каждого СтрокаТаблицы ИЗ ТаблицаЗаработнойПлаты Цикл
		
		СтруктураСчетАналитика = Новый Структура("Счет, Субконто1, Субконто2, Субконто3",
			СтрокаТаблицы.КорСчет, СтрокаТаблицы.КорСубконто1, СтрокаТаблицы.КорСубконто2, СтрокаТаблицы.КорСубконто3);
		
		СтруктураКорСчетАналитика = Новый Структура("КорСчет, КорСубконто1, КорСубконто2, КорСубконто3",
			СтрокаТаблицы.Счет, СтрокаТаблицы.Субконто1, СтрокаТаблицы.Субконто2, СтрокаТаблицы.Субконто3);
			
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтруктураСчетАналитика);
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтруктураКорСчетАналитика);
		
		НоваяСтрока = ТаблицаУдержаний.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Резервы

Процедура СформироватьДвиженияНачислениеРезервов(Движения, Отказ, Организация, Знач ПериодРегистрации, ДанныеПоРезервам)
	
	Регистратор       = Движения.ЕПС.Отбор.Регистратор.Значение;
	ПериодРегистрации = ПолучитьПериодРегистрации(Регистратор, ПериодРегистрации);
	Параметры         = ПодготовитьПараметрыПоОтражениюРезервовВУчете(ДанныеПоРезервам, Организация, ПериодРегистрации, Регистратор);
	Реквизиты         = Параметры.Реквизиты[0];
	ТаблицаРезервов   = Параметры.ТаблицаРезервов;
	
	РазвернутьТаблицуРезервов(ТаблицаРезервов);
	
	ТаблицаРезервов = ДополнитьТаблицуЗарплатыАналитикойБухУчета(ТаблицаРезервов, Реквизиты);
	
	ПроверитьЗаполненностьСпособаОтраженияВУчетеРезервов(ТаблицаРезервов, Реквизиты);
	
	СформироватьПроводкиПоОтражениюРезервовВУчете(ТаблицаРезервов, Реквизиты, Движения, Отказ);
		
КонецПроцедуры

Функция ПодготовитьПараметрыПоОтражениюРезервовВУчете(ДанныеДляПроводок, Организация, ПериодРегистрации, Регистратор)
	
	Параметры = Новый Структура;
	
	// Подготовка таблицы шапки документа
	Реквизиты = Новый ТаблицаЗначений;
	
	Реквизиты.Колонки.Добавить("Организация");
	Реквизиты.Колонки.Добавить("Период");
	Реквизиты.Колонки.Добавить("Регистратор");
	Реквизиты.Колонки.Добавить("КорректировкаОбязательств");

	НоваяСтрока             = Реквизиты.Добавить();
	НоваяСтрока.Организация = Организация;
	Если ТипЗнч(Регистратор)= Тип("ДокументСсылка.Отпуск") Тогда
		// Оставляем период регистрации датой документа
		НоваяСтрока.Период      				= ПериодРегистрации;
		НоваяСтрока.КорректировкаОбязательств 	= Ложь;
	ИначеЕсли ТипЗнч(Регистратор)= Тип("ДокументСсылка.ОтражениеЗарплатыВБухучете") Тогда
		// Оставляем период регистрации датой документа
		НоваяСтрока.Период      				= ПериодРегистрации;
		НоваяСтрока.КорректировкаОбязательств 	= Ложь;
	Иначе
		Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.НачислениеОценочныхОбязательствПоОтпускам") 
			И ЗначениеЗаполнено(Регистратор.ДатаВводаОстатков) Тогда
			НоваяСтрока.Период 					= КонецДня(Регистратор.ДатаВводаОстатков);
		Иначе
			НоваяСтрока.Период      			= КонецМесяца(ПериодРегистрации);
		КонецЕсли;
		НоваяСтрока.КорректировкаОбязательств 	= Регистратор.КорректировкаОбязательств;
	КонецЕсли;
	НоваяСтрока.Регистратор = Регистратор;
	
	Параметры.Вставить("Реквизиты", Реквизиты);
	
	// СК [07.10.2022] (доходы/расходы ЗП по подразделениям) - добавила ПодразделениеДоходовРасходов
		
	// Подготовка таблицы по заработной плате:
	СписокОбязательныхКолонок = ""
	+ "ФизическоеЛицо,"
	+ "Подразделение,"
	+ "ПодразделениеУчетаНачислений,"
	+ "ПодразделениеДоходовРасходов,"
	+ "СпособОтраженияЗарплатыВБухучете,"
	+ "ОблагаетсяЕНВД,"
	+ "СуммаРезерва,"
	+ "СуммаРезерваСтраховыхВзносов,"
	+ "СуммаРезерваФССНесчастныеСлучаи,"
	+ "СуммаРезерваНУ,"
	+ "СуммаРезерваСтраховыхВзносовНУ,"
	+ "СуммаРезерваФССНесчастныеСлучаиНУ,"
	+ "СуммаРезерваОбщая,"
	+ "СуммаРезерваСтраховыеВзносы,"
	+ "СуммаРезерваЗаПрошлыеПериоды,"
	+ "СуммаРезерваВзносыЗаПрошлыеПериоды"
	;	
	
	Параметры.Вставить("ТаблицаРезервов", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ДанныеДляПроводок, СписокОбязательныхКолонок));

	Возврат Параметры;

КонецФункции

Процедура РазвернутьТаблицуРезервов(ТаблицаРезервов)
	
	/////////////////////////////////////////
	//// Описание типов для дополнения таблиц
	ТипЧисла    = Новый КвалификаторыЧисла(15,2);
	Массив      = Новый Массив;
	Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧисла    = Новый ОписаниеТипов(Массив, , ,ТипЧисла);
	// Описание типов для дополнения таблиц
	///////////////////////////////////////
	
	Если ТаблицаРезервов.Колонки.Найти("ВидОперации") = Неопределено Тогда
		ТаблицаРезервов.Колонки.Добавить("ВидОперации", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОперацийПоЗарплате"));
	КонецЕсли;
	
	Если ТаблицаРезервов.Колонки.Найти("СтатьяРасходов") = Неопределено Тогда
		ТаблицаРезервов.Колонки.Добавить("СтатьяРасходов", Новый ОписаниеТипов("СправочникСсылка.СтатьиРасходовЗарплата"));
	КонецЕсли;

	Если ТаблицаРезервов.Колонки.Найти("СуммаНУ") = Неопределено Тогда
		ТаблицаРезервов.Колонки.Добавить("СуммаНУ", ОписаниеТиповЧисла);
	КонецЕсли;
	
	Если ТаблицаРезервов.Колонки.Найти("Сумма") = Неопределено Тогда
		ТаблицаРезервов.Колонки.Добавить("Сумма", ОписаниеТиповЧисла);
	КонецЕсли;

	ВидыОпераций = Новый Соответствие;
	ВидыОпераций.Вставить("СуммаРезерва",
		Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускРезервы);
	ВидыОпераций.Вставить("СуммаРезерваСтраховыхВзносов",
		Перечисления.ВидыОперацийПоЗарплате.СтраховыеВзносыПоРезервамПоОтпускам);
	ВидыОпераций.Вставить("СуммаРезерваФССНесчастныеСлучаи",
		Перечисления.ВидыОперацийПоЗарплате.СтраховыеВзносыПоРезервамПоОтпускам);
	ВидыОпераций.Вставить("СуммаРезерваОбщая",
		Перечисления.ВидыОперацийПоЗарплате.РасходыПоОплатеТрудаЗаСчетРезервовПоОтпускам);
	ВидыОпераций.Вставить("СуммаРезерваСтраховыеВзносы",
		Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтраховымВзносамЗаСчетРезервовПоОтпускам);
	ВидыОпераций.Вставить("СуммаРезерваЗаПрошлыеПериоды",
		Перечисления.ВидыОперацийПоЗарплате.РасходыПоОплатеТрудаЗаСчетРезервовПоОтпускамЗаПрошлыеПериоды);
	ВидыОпераций.Вставить("СуммаРезерваВзносыЗаПрошлыеПериоды",
		Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтраховымВзносамЗаСчетРезервовПоОтпускамЗаПрошлыеПериоды);

	МассивКолонок = Новый Массив;
	МассивКолонок.Добавить("СуммаРезерва");                        	// Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускРезервы
	МассивКолонок.Добавить("СуммаРезерваСтраховыхВзносов");        	// Перечисления.ВидыОперацийПоЗарплате.СтраховыеВзносыПоРезервамПоОтпускам
	МассивКолонок.Добавить("СуммаРезерваФССНесчастныеСлучаи");     	// Перечисления.ВидыОперацийПоЗарплате.СтраховыеВзносыПоРезервамПоОтпускам
	МассивКолонок.Добавить("СуммаРезерваОбщая");        			// Перечисления.ВидыОперацийПоЗарплате.РасходыПоОплатеТрудаЗаСчетРезервовПоОтпускам
	МассивКолонок.Добавить("СуммаРезерваСтраховыеВзносы");     		// Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтраховымВзносамЗаСчетРезервовПоОтпускам
	МассивКолонок.Добавить("СуммаРезерваЗаПрошлыеПериоды");        	// Перечисления.ВидыОперацийПоЗарплате.РасходыПоОплатеТрудаЗаСчетРезервовПоОтпускамЗаПрошлыеПериоды
	МассивКолонок.Добавить("СуммаРезерваВзносыЗаПрошлыеПериоды");   // Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтраховымВзносамЗаСчетРезервовПоОтпускамЗаПрошлыеПериоды
	
	КоличествоИндексовМассива 	= МассивКолонок.Количество() - 1;
	ТаблицаНалоговСРезервами 	= ТаблицаРезервов.СкопироватьКолонки();
		
	Для Каждого СтрокаТаблицы Из ТаблицаРезервов Цикл
				
		Для ИндексМассива = 0 По КоличествоИндексовМассива Цикл
			
			Если СтрокаТаблицы[МассивКолонок[ИндексМассива]] <> 0 Тогда
				НоваяСтрока = ТаблицаНалоговСРезервами.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
				НоваяСтрока.Сумма 		= СтрокаТаблицы[МассивКолонок[ИндексМассива]];
				НоваяСтрока.ВидОперации = ВидыОпераций.Получить(МассивКолонок[ИндексМассива]);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;

	Для Каждого СтрокаТаблицы Из ТаблицаНалоговСРезервами Цикл
		
		НоваяСтрока = ТаблицаРезервов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		// Необходимо добавить доп. строки для переноса сумм между счетами
		Если СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.РасходыПоОплатеТрудаЗаСчетРезервовПоОтпускамЗаПрошлыеПериоды
			И СтрокаТаблицы.Сумма <> 0 Тогда
			НоваяСтрока = ТаблицаРезервов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			НоваяСтрока.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускРезервыЗаПрошлыеПериоды;
		КонецЕсли;
		Если СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтраховымВзносамЗаСчетРезервовПоОтпускамЗаПрошлыеПериоды
			И СтрокаТаблицы.Сумма <> 0 Тогда
			НоваяСтрока = ТаблицаРезервов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			НоваяСтрока.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.СтраховыеВзносыПоРезервамПоОтпускамЗаПрошлыеПериоды;
		КонецЕсли;
	КонецЦикла;

	// СК [07.10.2022] (доходы/расходы ЗП по подразделениям) - добавила ПодразделениеДоходовРасходов 
	
	ТаблицаРезервов.Свернуть("ВидОперации, Подразделение, ПодразделениеУчетаНачислений, ПодразделениеДоходовРасходов, ФизическоеЛицо, СпособОтраженияЗарплатыВБухучете, ОблагаетсяЕНВД, СтатьяРасходов",
							"Сумма, СуммаНУ");
	
КонецПроцедуры

Процедура СформироватьПроводкиПоОтражениюРезервовВУчете(ТаблицаРезервов, Реквизиты, Движения, Отказ)
	
	Если ТаблицаРезервов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СодержанияПроводок = Новый Соответствие;
	Если КонецГода(Реквизиты.Период) = КонецМесяца(Реквизиты.Период) Тогда
		СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускРезервы, 				НСтр("ru = 'Инвентаризация обязательств по предстоящим отпускам'"));
		СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.СтраховыеВзносыПоРезервамПоОтпускам,	НСтр("ru = 'Инвентаризация страховых взносов с обязательств по предстоящим отпускам'"));
	Иначе
		СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускРезервы, 				НСтр("ru = 'Начисление обязательств по предстоящим отпускам'"));
		СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.СтраховыеВзносыПоРезервамПоОтпускам, 	НСтр("ru = 'Начисление страховых взносов с обязательств по предстоящим отпускам'"));
	КонецЕсли;
	
	Если Год(Реквизиты.Период) <= 2022 Тогда
		СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.РасходыПоОплатеТрудаЗаСчетРезервовПоОтпускамЗаПрошлыеПериоды, 		НСтр("ru = 'Начисление обязательств по предстоящим отпускам (за счет резервов, сформированных до 01.01.2022 г.)'"));
		СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтраховымВзносамЗаСчетРезервовПоОтпускамЗаПрошлыеПериоды,	НСтр("ru = 'Начисление страховых взносов с обязательств по предстоящим отпускам (за счет резервов, сформированных до 01.01.2022 г.)'"));
		СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускРезервыЗаПрошлыеПериоды, 							НСтр("ru = 'Перенос суммы резервов по предстоящим отпускам, сформированных до 01.01.2022 г.'"));
		СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.СтраховыеВзносыПоРезервамПоОтпускамЗаПрошлыеПериоды,				НСтр("ru = 'Перенос суммы резервов страховых взносов с обязательств по предстоящим отпускам, сформированных до 01.01.2022 г.'"));
	Иначе
		СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.РасходыПоОплатеТрудаЗаСчетРезервовПоОтпускамЗаПрошлыеПериоды, 		НСтр("ru = 'Начисление обязательств по предстоящим отпускам (за счет резервов, сформированных в прошлом году)'"));
		СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтраховымВзносамЗаСчетРезервовПоОтпускамЗаПрошлыеПериоды,	НСтр("ru = 'Начисление страховых взносов с обязательств по предстоящим отпускам (за счет резервов, сформированных в прошлом году)'"));
		СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускРезервыЗаПрошлыеПериоды, 							НСтр("ru = 'Перенос суммы резервов по предстоящим отпускам, сформированных в прошлом году'"));
		СодержанияПроводок.Вставить(Перечисления.ВидыОперацийПоЗарплате.СтраховыеВзносыПоРезервамПоОтпускамЗаПрошлыеПериоды,				НСтр("ru = 'Перенос суммы резервов страховых взносов с обязательств по предстоящим отпускам, сформированных в прошлом году'"));
	КонецЕсли;
	
	ДополнитьТаблицуЗаработнойПлатыРезервовЛицевымиСчетами(ТаблицаРезервов, Реквизиты, , Истина);
	
	МассивСчетРасчетовСПерсоналомПоОплатеТруда = Новый Массив();
	МассивСчетРасчетовСПерсоналомПоОплатеТруда.Добавить(ПланыСчетов.ЕПС.НайтиПоКоду("60305"));
	МассивСчетРасчетовСПерсоналомПоОплатеТруда.Добавить(ПланыСчетов.ЕПС.НайтиПоКоду("60306"));
	
	// СК [07.10.2022] (доходы/расходы ЗП по подразделениям)
	МассивСчетовДоходовРасходов = Новый Массив();
	МассивСчетовДоходовРасходов.Добавить(ПланыСчетов.ЕПС.НайтиПоКоду("71801"));
	МассивСчетовДоходовРасходов.Добавить(ПланыСчетов.ЕПС.НайтиПоКоду("71802"));
	// \
	
	// Суммы по налоговому учету прописываются в зависимости от условий проведения
	Для Каждого СтрокаТаблицы Из ТаблицаРезервов Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Счет) 
			И Не ЗначениеЗаполнено(СтрокаТаблицы.СчетНУ) Тогда
			// не заполнены счет и аналитика
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТаблицы.Сумма = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Проводка = Движения.ЕПС.Добавить();
		Проводка.Период      = Реквизиты.Период;
		Проводка.Организация = Реквизиты.Организация;
		Проводка.Содержание  = СодержанияПроводок.Получить(СтрокаТаблицы.ВидОперации);
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.СчетНУ) Тогда
			Проводка.Сумма   = СтрокаТаблицы.Сумма;
		КонецЕсли;
		
		Если Реквизиты.КорректировкаОбязательств Тогда // Ввод остатков по резерам
			
			Проводка.ЛицевойСчетДт 	= Реквизиты.Регистратор.СчетНачисленияДляКорректировкиОстатков;
			Проводка.СчетДт 		= Реквизиты.Регистратор.СчетНачисленияДляКорректировкиОстатков.Владелец;

		Иначе
			Если ЗначениеЗаполнено(СтрокаТаблицы.Счет) Тогда
				Проводка.ЛицевойСчетДт 	= СтрокаТаблицы.Счет;
				Проводка.СчетДт 		= СтрокаТаблицы.Счет.Владелец;
				
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТаблицы.Субконто1);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТаблицы.Субконто2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТаблицы.Субконто3);
			ИначеЕсли ЗначениеЗаполнено(СтрокаТаблицы.СчетНУ) Тогда
				Проводка.ЛицевойСчетДт 	= СтрокаТаблицы.СчетНУ;
				Проводка.СчетДт 		= СтрокаТаблицы.СчетНУ.Владелец;
				
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТаблицы.СубконтоНУ1);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТаблицы.СубконтоНУ2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТаблицы.СубконтоНУ3);
			КонецЕсли;
		КонецЕсли;

		СвойстваСчетаДт = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка.СчетДт);
		Если СвойстваСчетаДт.УчетПоПодразделениям Тогда
			Если МассивСчетРасчетовСПерсоналомПоОплатеТруда.Найти(Проводка.СчетДт) <> Неопределено  Тогда
				Проводка.ПодразделениеДт = СтрокаТаблицы.ПодразделениеУчетаНачислений;
			// СК [07.10.2022] (доходы/расходы ЗП по подразделениям)	
			ИначеЕсли МассивСчетовДоходовРасходов.Найти(Проводка.СчетДт) <> Неопределено  Тогда
				Проводка.ПодразделениеДт = СтрокаТаблицы.ПодразделениеДоходовРасходов;	
			// \	
			Иначе
				Проводка.ПодразделениеДт = СтрокаТаблицы.Подразделение;
			КонецЕсли;
		КонецЕсли;
		
		Если СвойстваСчетаДт.НалоговыйУчет Тогда
			Если ЗначениеЗаполнено(СтрокаТаблицы.Счет) Тогда
				Если ТипЗнч(СтрокаТаблицы.Субконто1) = Тип("СправочникСсылка.ПрочиеДоходыИРасходы") Тогда
					Если СтрокаТаблицы.Субконто1.ПринятиеКналоговомуУчету Тогда
						Проводка.СуммаНУДт = СтрокаТаблицы.Сумма;
					Иначе
						Проводка.СуммаВРДт = СтрокаТаблицы.Сумма;
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли ЗначениеЗаполнено(СтрокаТаблицы.СчетНУ) Тогда
				Если ТипЗнч(СтрокаТаблицы.СубконтоНУ1) = Тип("СправочникСсылка.ПрочиеДоходыИРасходы") Тогда
					Если СтрокаТаблицы.СубконтоНУ1.ПринятиеКналоговомуУчету Тогда
						Проводка.СуммаНУДт = СтрокаТаблицы.Сумма;
					Иначе
						Проводка.СуммаВРДт = СтрокаТаблицы.Сумма;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Проводка.ЛицевойСчетКт 	= СтрокаТаблицы.СчетУчетаПассивный; 
		Проводка.СчетКт 		= СтрокаТаблицы.СчетУчетаПассивный.Владелец;			
		
		Если СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.РасходыПоОплатеТрудаЗаСчетРезервовПоОтпускам
			Или СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтраховымВзносамЗаСчетРезервовПоОтпускам Тогда
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаТаблицы.СубконтоКт1);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаТаблицы.СубконтоКт2);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтрокаТаблицы.СубконтоКт3);
		Иначе
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "РаботникиОрганизаций", 		СтрокаТаблицы.ФизическоеЛицо);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ВидыПлатежейВГосБюджет", 	Перечисления.ВидыПлатежейВГосБюджет.Налог);
		КонецЕсли;
		
		СвойстваСчетаКт = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка.СчетКт);
		Если СвойстваСчетаКт.УчетПоПодразделениям Тогда			
			Если МассивСчетРасчетовСПерсоналомПоОплатеТруда.Найти(Проводка.СчетКт) <> Неопределено  Тогда
				Проводка.ПодразделениеКт = СтрокаТаблицы.ПодразделениеУчетаНачислений;
			// СК [07.10.2022] (доходы/расходы ЗП по подразделениям)	
			ИначеЕсли МассивСчетовДоходовРасходов.Найти(Проводка.СчетКт) <> Неопределено  Тогда
				Проводка.ПодразделениеКт = СтрокаТаблицы.ПодразделениеДоходовРасходов;	
			// \		
			Иначе
				Проводка.ПодразделениеКт = СтрокаТаблицы.Подразделение;
			КонецЕсли;
		КонецЕсли;
		
		Если СвойстваСчетаКт.НалоговыйУчет Тогда
			Проводка.СуммаВРКт = СтрокаТаблицы.Сумма;
		КонецЕсли;
		
	КонецЦикла;
	
	Движения.ЕПС.Записывать = Истина;
	
	Движения.ЕПС.ДополнительныеСвойства.Вставить("СуммыНалоговогоУчетаЗаполнены", Истина);
	
КонецПроцедуры

Процедура ПроверитьЗаполненностьСпособаОтраженияВУчетеРезервов(ТаблицаРезервов, Реквизиты)
	
	ТаблицаПроверки = ТаблицаРезервов.Скопировать(,"СпособОтраженияЗарплатыВБухУчете, Счет");	
	ТаблицаПроверки.Свернуть("СпособОтраженияЗарплатыВБухУчете, Счет",);
	
	Для Каждого СтрокаТаблицы Из ТаблицаПроверки Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.СпособОтраженияЗарплатыВБухУчете) Тогда
			Если Не ЗначениеЗаполнено(СтрокаТаблицы.Счет) Тогда
				ТекстСообщения = НСтр("ru = '%1. Не указаны счет и аналитика для способа отражения ""%2""!'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					ТекстСообщения,
					Реквизиты.Регистратор,
					СтрокаТаблицы.СпособОтраженияЗарплатыВБухУчете); 
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Реквизиты.Регистратор);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область Выплата

#Область ВыплатаЗарплаты

// Предназначена для генерации движений, связанных с отражением в регл. учете перечисления/выплаты зарплаты
//
// Параметры:
//	ТаблицаПеречислениеЗарплаты - таблица значений с колонками
//      Подразделение
//		ФизическоеЛицо
//      СуммаКВыплате
//      КомпенсацияЗаЗадержкуЗарплаты
//      СтатьяДвиженияДенежныхСредств
//      БанковскийСчет
//      СчетУчета
//      СчетУчетаКомпенсации
//      СубконтоУчетаКомпенсации1
//      СубконтоУчетаКомпенсации2
//      СубконтоУчетаКомпенсации3
//      ПодразделениеУчетаКомпенсации
//      Ведомость
//	ТаблицаРеквизиты  - таблица значений содержит реквизиты документа
//	Движения
//	Отказ
//
Процедура СформироватьДвиженияПеречислениеВыплатаЗарплаты(ДокументОбъект, ТаблицаПеречислениеЗарплаты, ТаблицаРеквизиты, Движения, Отказ) Экспорт

	ВедетсяУчетРасчетовПоЗарплатеПоРаботникам = ПолучитьФункциональнуюОпцию("ВедетсяУчетРасчетовПоЗарплатеПоРаботникам");
	Если Не ВедетсяУчетРасчетовПоЗарплатеПоРаботникам Тогда
		ОбщегоНазначения.СообщитьПользователю("В форме ""Настройки зарплаты"" не установлен флаг ""Ведется учет расчетов по зарплате по работникам""! Проводки не будут сформированы");
		Возврат;
	КонецЕсли;
	
	Параметры = ПодготовитьПараметрыВыплатыЗарплаты(ТаблицаПеречислениеЗарплаты, ТаблицаРеквизиты);
	
	Если Параметры.ВыплатаЗаработнойПлаты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Реквизиты = Параметры.Реквизиты[0];
		
	СформироватьПроводкиПоВыплатеЗарплаты(Параметры.ВыплатаЗаработнойПлаты, Реквизиты, Движения, Отказ);
	
	УчетЗарплатыИКадровВоВнешнейПрограмме    = ПолучитьФункциональнуюОпцию("УчетЗарплатыИКадровВоВнешнейПрограмме");
	ВедетсяУчетРасчетовПоЗарплатеСводно      = ПолучитьФункциональнуюОпцию("ВедетсяУчетРасчетовПоЗарплатеСводно");
	
	// Обращение к БЗКБ
	Если НЕ (УчетЗарплатыИКадровВоВнешнейПрограмме И ВедетсяУчетРасчетовПоЗарплатеСводно) Тогда
		МассивВедомостей    = ТаблицаПеречислениеЗарплаты.ВыгрузитьКолонку("Ведомость");
		МассивФизическихЛиц = ТаблицаПеречислениеЗарплаты.ВыгрузитьКолонку("ФизическоеЛицо");
		ЗарплатаКадры.ЗарегистрироватьОплатуВедомостей(ДокументОбъект, Реквизиты.Организация, МассивВедомостей, МассивФизическихЛиц,, Отказ);
	КонецЕсли;

КонецПроцедуры

Функция ПодготовитьПараметрыВыплатыЗарплаты(ТаблицаПеречислениеЗарплаты, ТаблицаРеквизиты)

	Параметры = Новый Структура;
	
	// Подготовка таблицы Параметры.Реквизиты
	
	СписокОбязательныхКолонок = ""
	+ "Период,"                    // <Дата> - период движений - дата документа
	+ "Регистратор,"               // <ДокументСсылка>
	+ "Содержание,"                // <Строка>
	+ "Организация";               // <СправочникСсылка.Организации>
	
	Параметры.Вставить("Реквизиты", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ТаблицаРеквизиты, СписокОбязательныхКолонок));
	
	// Подготовка таблицы Параметры.ВыплатаЗаработнойПлаты
	
	СписокОбязательныхКолонок = ""
	+ "Подразделение,"                 // <Ссылка на справочник подразделений>  - подразделение, задолженность по которому погашается
	+ "ФизическоеЛицо,"                // <СправочникСсылка.ФизическиеЛица> - физическое лико, которому выплачивается зарплата
	+ "СуммаКВыплате,"                 // <Число,15,2> - сумма выплаты в валюте документа
	+ "МатериальнаяПомощь,"            // <Число,15,2> - сумма выплаты материальной помощи в валюте документа
	+ "КомпенсацияЗаЗадержкуЗарплаты," // <Число,15,2> - сумма компенсации в валюте документа
	+ "СтатьяДвиженияДенежныхСредств," // <СправочникСсылка.СтатьиДвиженияДенежныхСредств>
	+ "БанковскийСчет,"                // <СправочникСсылка.БанковскиеСчета>
	+ "Касса,"                		   // <СправочникСсылка.Кассы>
	+ "СчетУчета,"                     // <СправочникСсылка.ЕПСЛицевыеСчета> - счет учета денежных средств
	+ "СчетУчетаКомпенсации,"          // <ПланСчетовСсылка.Хозрасчетный> - счет учета компенсации
	+ "СубконтоУчетаКомпенсации1,"     //<Характеристика.ВидыСубконтоХозрасчетные> - субконто 1 по счету учета комппенсации
	+ "СубконтоУчетаКомпенсации2,"     //<Характеристика.ВидыСубконтоХозрасчетные> - субконто 2 по счету учета комппенсации
	+ "СубконтоУчетаКомпенсации3,"     //<Характеристика.ВидыСубконтоХозрасчетные> - субконто 3 по счету учета комппенсации
	+ "ПодразделениеУчетаКомпенсации," // <Ссылка на справочник подразделений>  - подразделение, задолженность по депонентам которого погашается
	+ "ПодразделениеУчетаНачислений,"  // <Ссылка на справочник подразделений>  - подразделение, по которому происходит начисление	
	+ "Ведомость";                     // <ДокументСсылка.ВедомостьВКассу...ДокументСсылка.ВедомостьВБанк> - ведомости, по которым производится выплата
	
	Если Константы.УчетЗарплатыИКадровСредствамиБухгалтерии.Получить() Тогда
		СписокОбязательныхКолонок = СписокОбязательныхКолонок
		+ ",ИспользуетсяЭлектронныйОбмен"  // Булево - информация о том, что используется электронный обмен с банком
	КонецЕсли;
		
	Параметры.Вставить("ВыплатаЗаработнойПлаты", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ТаблицаПеречислениеЗарплаты, СписокОбязательныхКолонок));
	
	Возврат Параметры;

КонецФункции

Процедура СформироватьПроводкиПоВыплатеЗарплаты(ТаблицаВыплатыЗаработнойПлаты, Реквизиты, Движения, Отказ)
	
	ТаблицаВыплаты 		    = ТаблицаВыплатыЗаработнойПлаты.Скопировать();	
	ОтражатьВНалоговомУчете = УчетнаяПолитика.ПлательщикНалогаНаПрибыль(Реквизиты.Организация, Реквизиты.Период);	
	ВестиУчетПоРаботникам   = Константы.ВедетсяУчетРасчетовПоЗарплатеПоРаботникам.Получить();
	ВестиУчетНачисленияЗаработнойПлатыВРазрезеПодразделений	= ВестиУчетНачисленияЗаработнойПлатыВРазрезеПодразделений(Реквизиты.Организация, Реквизиты.Период);
		
	ДополнитьТаблицаВыплатыЗаработнойПлатыЛицевымиСчетами(ТаблицаВыплаты, Реквизиты, ВестиУчетПоРаботникам);
	
	Содержание = СокрЛП(Реквизиты.Содержание);
	ЕстьТекстЗаработнаяПлата = СтрНайти(Содержание, "Заработн") > 0 И СтрНайти(Содержание, "плат") > 0;
	
	Если НЕ ВестиУчетПоРаботникам Тогда
		Если НЕ ЕстьТекстЗаработнаяПлата Тогда
			Если Константы.УчетЗарплатыИКадровСредствамиБухгалтерии.Получить() Тогда
				
				Ведомости = ОбщегоНазначенияБПВызовСервера.УдалитьПовторяющиесяЭлементыМассива(
				ТаблицаВыплаты.ВыгрузитьКолонку("Ведомость"));
				Если Ведомости.ВГраница() > 0 Тогда
					НачалоСодержания = НСтр("ru = 'Выплата заработной платы по ведомостям:'");
				ИначеЕсли Ведомости.ВГраница() = 0 Тогда
					НачалоСодержания = НСтр("ru = 'Выплата заработной платы по ведомости'");
				Иначе
					Содержание = НСтр("ru = 'Выплата заработной платы без указания ведомости'");
				КонецЕсли;
				Для инд = 0 По Ведомости.ВГраница() Цикл
					Если ЗначениеЗаполнено(Ведомости[инд]) Тогда
						ДанныеВедомости = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ведомости[инд], "Дата, Номер");
						НомерВедомости  = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеВедомости.Номер, Истина, Истина);
						ДатаВедомости   = Формат(ДанныеВедомости.Дата,"ДЛФ=D");
					Иначе
						НомерВедомости  = НСтр("ru = 'б/н'");
						ДатаВедомости   = НСтр("ru = 'б/д'");
					КонецЕсли;
					Содержание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = '%1 № %2 от %3%4'"),
					?(инд = 0, НачалоСодержания, Содержание),
					НомерВедомости,
					ДатаВедомости,
					?(инд = Ведомости.ВГраница(), "", ",")); 
				КонецЦикла;
			Иначе
				Содержание = НСтр("ru = 'Выплата заработной платы без указания ведомости'");
			КонецЕсли;
			ЕстьТекстЗаработнаяПлата = Истина;
		КонецЕсли;
		
		ТаблицаВыплаты.Свернуть("Подразделение, СтатьяДвиженияДенежныхСредств, СчетУчета, БанковскийСчет, СчетУчетаКомпенсации,
		|СубконтоУчетаКомпенсации1, СубконтоУчетаКомпенсации2, СубконтоУчетаКомпенсации3, ПодразделениеУчетаКомпенсации", "СуммаКВыплате, КомпенсацияЗаЗадержкуЗарплаты");
	Иначе
		ШаблонСодержания = НСтр("ru = 'Выплата заработной платы по ведомости № %1 от %2'");
	КонецЕсли;
	
	ВалютаУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Для Каждого СтрокаТаблицы Из ТаблицаВыплаты Цикл
		
		Если СтрокаТаблицы.СуммаКВыплате + СтрокаТаблицы.КомпенсацияЗаЗадержкуЗарплаты = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Выплата заработной платы
		Если СтрокаТаблицы.СуммаКВыплате <> 0 Тогда
			
			Проводка = Движения.ЕПС.Добавить();
			
			Проводка.Период       = Реквизиты.Период;
			Проводка.Организация  = Реквизиты.Организация;
			
			Если ЕстьТекстЗаработнаяПлата Тогда
				Проводка.Содержание = Содержание;
			Иначе
				Если ВестиУчетПоРаботникам Тогда
					Если ЗначениеЗаполнено(СтрокаТаблицы.Ведомость) Тогда
						ДанныеВедомости = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТаблицы.Ведомость, "Дата, Номер");
						НомерВедомости  = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеВедомости.Номер, Истина, Истина);
						ДатаВедомости   = Формат(ДанныеВедомости.Дата,"ДЛФ=D");
						Проводка.Содержание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							ШаблонСодержания,
							НомерВедомости,
							ДатаВедомости); 
					Иначе
						Проводка.Содержание = НСтр("ru = 'Выплата заработной платы без указания ведомости'");
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Проводка.Сумма = СтрокаТаблицы.СуммаКВыплате;
			
			// Для выплаты аванса потребуется активный счет, в остальных случаях - пассивный
			Аванс = Ложь;
			Если ЗначениеЗаполнено(Реквизиты.Регистратор.ПлатежнаяВедомость) Тогда
				Если Реквизиты.Регистратор.ПлатежнаяВедомость.СпособВыплаты = Справочники.СпособыВыплатыЗарплаты.Аванс() Тогда
					Аванс = Истина;
				КонецЕсли;
			КонецЕсли;
			// При увольнении потребуется активный счет, чтобы закрыть его в конце месяца
			ВыплатаПриУвольнении = Ложь;
			Если ЗначениеЗаполнено(Реквизиты.Регистратор.ПлатежнаяВедомость) Тогда
				Если Реквизиты.Регистратор.ПлатежнаяВедомость.СпособВыплаты = Справочники.СпособыВыплатыЗарплаты.Увольнения() Тогда
					ВыплатаПриУвольнении = Истина;
				КонецЕсли;
			КонецЕсли;
			Если Аванс Или ВыплатаПриУвольнении Тогда
				Проводка.ЛицевойСчетДт 			= СтрокаТаблицы.СчетУчетаАктивный;
			Иначе
				Проводка.ЛицевойСчетДт 			= СтрокаТаблицы.СчетУчетаПассивный;
			КонецЕсли;
			Проводка.СчетДт  					= Проводка.ЛицевойСчетДт.Владелец;

			Если ВестиУчетПоРаботникам Тогда
				БухгалтерскийУчет.УстановитьСубконто(Проводка.ЛицевойСчетДт, Проводка.СубконтоДт, "РаботникиОрганизаций", СтрокаТаблицы.ФизическоеЛицо);
			КонецЕсли;
						
			СвойстваСчетаДт = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка.СчетДт);
			Если СвойстваСчетаДт.УчетПоПодразделениям Тогда
				Если ВестиУчетНачисленияЗаработнойПлатыВРазрезеПодразделений Тогда
					Проводка.ПодразделениеДт = СтрокаТаблицы.ПодразделениеУчетаНачислений;
				Иначе
					Проводка.ПодразделениеДт = СтрокаТаблицы.Подразделение;
				КонецЕсли;
			КонецЕсли;
			Если Проводка.СчетДт.Валютный Тогда
				Проводка.ВалютаДт        = ВалютаУчета;
				Проводка.ВалютнаяСуммаДт = Проводка.Сумма;
			КонецЕсли;

			Проводка.ЛицевойСчетКт 			    = СтрокаТаблицы.СчетУчета;
			Проводка.СчетКт 					= СтрокаТаблицы.СчетУчета.Владелец;
			
			БухгалтерскийУчет.УстановитьСубконто(Проводка.ЛицевойСчетКт, Проводка.СубконтоКт, "СтатьиДвиженияДенежныхСредств", СтрокаТаблицы.СтатьяДвиженияДенежныхСредств);
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.БанковскийСчет) Тогда
				БухгалтерскийУчет.УстановитьСубконто(Проводка.ЛицевойСчетКт, Проводка.СубконтоКт, "БанковскиеСчета", СтрокаТаблицы.БанковскийСчет);
			КонецЕсли;
			
			СвойстваСчетаКт = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка.СчетКт);
			
			Если СвойстваСчетаКт.УчетПоПодразделениям Тогда
				Проводка.ПодразделениеКт = СтрокаТаблицы.Подразделение;
			КонецЕсли;
			Если Проводка.СчетКт.Валютный Тогда
				Проводка.ВалютаКт        = ВалютаУчета;
				Проводка.ВалютнаяСуммаКт = Проводка.Сумма;
			КонецЕсли;

			Если ОтражатьВНалоговомУчете Тогда
				
				Если СвойстваСчетаДт.НалоговыйУчет Тогда
					Проводка.СуммаНУДт = СтрокаТаблицы.СуммаКВыплате;
				КонецЕсли;
				Если СвойстваСчетаКт.НалоговыйУчет Тогда
					Проводка.СуммаНУКт = СтрокаТаблицы.СуммаКВыплате;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
				
	КонецЦикла;
	
	Движения.ЕПС.Записывать = Истина;
	
КонецПроцедуры

Процедура ДополнитьТаблицаВыплатыЗаработнойПлатыЛицевымиСчетами(ТаблицаВыплатыЗаработнойПлаты, Реквизиты, ВестиУчетПоРаботникам)
		
	ТаблицаВыплатыЗаработнойПлаты.Колонки.Добавить("СчетУчетаПассивный", 	Новый ОписаниеТипов("СправочникСсылка.ЕПСЛицевыеСчета"));
	ТаблицаВыплатыЗаработнойПлаты.Колонки.Добавить("СчетУчетаАктивный",		Новый ОписаниеТипов("СправочникСсылка.ЕПСЛицевыеСчета"));

	ТаблицаДляПолученияСчетов = ТаблицаВыплатыЗаработнойПлаты.Скопировать(,"Подразделение, ФизическоеЛицо");
	Если Не ВестиУчетПоРаботникам Тогда
		ТаблицаДляПолученияСчетов.ЗаполнитьЗначения(Неопределено, "ФизическоеЛицо");	
	КонецЕсли;
	ТаблицаДляПолученияСчетов.Свернуть("Подразделение, ФизическоеЛицо");
	
	ВыплатаМатериальнойПомощи 	= Ложь;
	ОснованиеДляВыплаты 		= Реквизиты.Регистратор.ДокументОснование;
	Если ЗначениеЗаполнено(ОснованиеДляВыплаты) 
		И ТипЗнч(ОснованиеДляВыплаты) = Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплаты") Тогда
		Если ОснованиеДляВыплаты.СпособВыплаты = Справочники.СпособыВыплатыЗарплаты.МатериальнаяПомощь() Тогда
			ВыплатаМатериальнойПомощи = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Для каждого СтрокаТаблицы Из ТаблицаДляПолученияСчетов Цикл
			
		ИспользуемыеСчетаОплатаТруда = ЮС_СчетаУчетаВДокументах.ПолучитьСчетаРасчетовСРаботниками(Реквизиты.Организация, СтрокаТаблицы.ФизическоеЛицо,,
				Перечисления.ЮС_ВидыВыплатРаботникам.ОплатаТруда);
		ИспользуемыеСчетаСоциальныеВыплаты 	= ЮС_СчетаУчетаВДокументах.ПолучитьСчетаРасчетовСРаботниками(Реквизиты.Организация, СтрокаТаблицы.ФизическоеЛицо,,
				Перечисления.ЮС_ВидыВыплатРаботникам.СоциальныеВыплаты);
				
		Если ИспользуемыеСчетаОплатаТруда = Неопределено
			Или Не ЗначениеЗаполнено(ИспользуемыеСчетаОплатаТруда.СчетУчетаПассивный) Тогда
			// Счета не открыты
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По сотруднику " + СтрокаТаблицы.ФизическоеЛицо + " не найдены лицевые счета по виду выплаты ""Оплата труда""! Начисления по нему не будут сформированы");
			Продолжить;
		КонецЕсли;
		
		Если ВыплатаМатериальнойПомощи Тогда 
			Если ИспользуемыеСчетаСоциальныеВыплаты = Неопределено
				Или Не ЗначениеЗаполнено(ИспользуемыеСчетаСоциальныеВыплаты.СчетУчетаПассивный) Тогда
				// Счета не открыты
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По сотруднику " + СтрокаТаблицы.ФизическоеЛицо + " не найдены лицевые счета по виду выплаты ""Социальные выплаты""! Начисления по нему не будут сформированы");
				Продолжить;	
			КонецЕсли;
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура("Подразделение");
		Если ВестиУчетПоРаботникам Тогда
			СтруктураПоиска.Вставить("ФизическоеЛицо");
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТаблицы);
		
		СтрокиЗаработнойПлаты = ТаблицаВыплатыЗаработнойПлаты.НайтиСтроки(СтруктураПоиска);
		Для каждого СтрокаЗаработнойПлаты Из СтрокиЗаработнойПлаты Цикл
			
			Если ВыплатаМатериальнойПомощи Тогда
				Если ИспользуемыеСчетаСоциальныеВыплаты.Свойство("СчетУчетаПассивный") Тогда 
					СтрокаЗаработнойПлаты.СчетУчетаПассивный 	= ИспользуемыеСчетаСоциальныеВыплаты.СчетУчетаПассивный; 
				КонецЕсли;
				Если ИспользуемыеСчетаСоциальныеВыплаты.Свойство("СчетУчетаАктивный") Тогда
					СтрокаЗаработнойПлаты.СчетУчетаАктивный 	= ИспользуемыеСчетаСоциальныеВыплаты.СчетУчетаАктивный;
				КонецЕсли;
			Иначе
				Если ИспользуемыеСчетаОплатаТруда.Свойство("СчетУчетаПассивный") Тогда
					СтрокаЗаработнойПлаты.СчетУчетаПассивный 	= ИспользуемыеСчетаОплатаТруда.СчетУчетаПассивный;
				КонецЕсли;
				Если ИспользуемыеСчетаОплатаТруда.Свойство("СчетУчетаАктивный") Тогда
					СтрокаЗаработнойПлаты.СчетУчетаАктивный 	= ИспользуемыеСчетаОплатаТруда.СчетУчетаАктивный;
				КонецЕсли; 
			КонецЕсли;
			
			// Добавим доп. строку к выплате материальной помощи с другими счетами
			Если СтрокаЗаработнойПлаты.МатериальнаяПомощь <> 0 Тогда
				Если ИспользуемыеСчетаСоциальныеВыплаты = Неопределено
					Или Не ЗначениеЗаполнено(ИспользуемыеСчетаСоциальныеВыплаты.СчетУчетаПассивный) Тогда
					// Счета не открыты
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По сотруднику " + СтрокаТаблицы.ФизическоеЛицо + " не найдены лицевые счета по виду выплаты ""Социальные выплаты""! Начисления по нему не будут сформированы");
					Продолжить;					
				КонецЕсли;
				НоваяСтрокаВыплатаМатПомощи = ТаблицаВыплатыЗаработнойПлаты.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаВыплатаМатПомощи, СтрокаЗаработнойПлаты);
				НоваяСтрокаВыплатаМатПомощи.СуммаКВыплате 		= СтрокаЗаработнойПлаты.МатериальнаяПомощь;
				НоваяСтрокаВыплатаМатПомощи.МатериальнаяПомощь 	= 0;
				
				Если ИспользуемыеСчетаСоциальныеВыплаты.Свойство("СчетУчетаПассивный") Тогда
					НоваяСтрокаВыплатаМатПомощи.СчетУчетаПассивный 	= ИспользуемыеСчетаСоциальныеВыплаты.СчетУчетаПассивный;
				КонецЕсли;
				Если ИспользуемыеСчетаСоциальныеВыплаты.Свойство("СчетУчетаАктивный") Тогда
					НоваяСтрокаВыплатаМатПомощи.СчетУчетаАктивный 	= ИспользуемыеСчетаСоциальныеВыплаты.СчетУчетаАктивный;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Предназначена для генерации движений, связанных с отражением в регл. учете оплат по договорам подряда
//
// Параметры:
//	ТаблицаПеречислениеЗарплаты - таблица значений с колонками
//      Подразделение
//		ФизическоеЛицо
//      СуммаКВыплате
//      СтатьяДвиженияДенежныхСредств
//      БанковскийСчет
//      СчетУчета
//	ТаблицаРеквизиты  - таблица значений содержит реквизиты документа
//	Движения
//	Отказ
//
Процедура СформироватьДвиженияОплатаПоДоговорамПодряда(ДокументОбъект, ТаблицаОплатаПоДоговорамПодряда, ТаблицаРеквизиты, Движения, Отказ) Экспорт

	Параметры = ПодготовитьПараметрыОплатаПоДоговорамПодряда(ТаблицаОплатаПоДоговорамПодряда, ТаблицаРеквизиты);
	
	Если Параметры.ОплатаПоДоговорамПодряда.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Реквизиты = Параметры.Реквизиты[0];
	ТаблицаОплатаПоДоговорамПодряда = Параметры.ОплатаПоДоговорамПодряда;
	
	СформироватьПроводкиПоОплатеПоДоговорамПодряда(ТаблицаОплатаПоДоговорамПодряда, Реквизиты, Движения, Отказ);
	
КонецПроцедуры

Функция ПодготовитьПараметрыОплатаПоДоговорамПодряда(ТаблицаОплатаПоДоговорамПодряда, ТаблицаРеквизиты)

	Параметры = Новый Структура;
	
	// Подготовка таблицы Параметры.Реквизиты
	
	СписокОбязательныхКолонок = ""
	+ "Период,"                    // <Дата> - период движений - дата документа
	+ "Регистратор,"               // <ДокументСсылка>
	+ "Содержание,"                // <Строка>
	+ "Организация";               // <СправочникСсылка.Организации>
	
	
	Параметры.Вставить("Реквизиты", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ТаблицаРеквизиты, СписокОбязательныхКолонок));
	
	// Подготовка таблицы Параметры.ВыплатаЗаработнойПлаты
	
	СписокОбязательныхКолонок = ""
	+ "Подразделение,"                 // <Ссылка на справочник подразделений>  - подразделение, задолженность по которому погашается
	+ "ФизическоеЛицо,"                // <СправочникСсылка.ФизическиеЛица> - физическое лицо, которому выплачивается зарплата
	+ "СуммаКВыплате,"                 // <Число,15,2> - сумма выплаты в валюте документа
	+ "СтатьяДвиженияДенежныхСредств," // <СправочникСсылка.СтатьиДвиженияДенежныхСредств>
	+ "БанковскийСчет,"                // <СправочникСсылка.БанковскиеСчета>
	+ "СчетУчета";                     // <ПланСчетовСсылка.Хозрасчетный> - счет учета денежных средств
	
	Параметры.Вставить("ОплатаПоДоговорамПодряда", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ТаблицаОплатаПоДоговорамПодряда, СписокОбязательныхКолонок));
	
	Возврат Параметры;

КонецФункции

Процедура СформироватьПроводкиПоОплатеПоДоговорамПодряда(ТаблицаОплатаПоДоговорамПодряда, Реквизиты, Движения, Отказ)
	
	ТаблицаВыплаты = ТаблицаОплатаПоДоговорамПодряда.Скопировать();
	
	ОтражатьВНалоговомУчете = УчетнаяПолитика.ПлательщикНалогаНаПрибыль(Реквизиты.Организация, Реквизиты.Период);
	
	//СчетПрочихРасчетовСФизическимиЛицами = ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСФизическимиЛицами;
	
	Содержание = СокрЛП(Реквизиты.Содержание);
	
	Для Каждого СтрокаТаблицы Из ТаблицаВыплаты Цикл
		
		Если СтрокаТаблицы.СуммаКВыплате = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Оплата по договорам подряда
		
		Проводка = Движения.ЕПС.Добавить();
		
		Проводка.Период       = Реквизиты.Период;
		Проводка.Организация  = Реквизиты.Организация;
		Проводка.Содержание   = Содержание;
		
		Проводка.Сумма = СтрокаТаблицы.СуммаКВыплате;
		
		//Проводка.СчетДт = СчетПрочихРасчетовСФизическимиЛицами;
		
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "РаботникиОрганизаций", СтрокаТаблицы.ФизическоеЛицо);
		
		СвойстваСчетаДт = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка.СчетДт);
		Если СвойстваСчетаДт.УчетПоПодразделениям Тогда
			Проводка.ПодразделениеДт = СтрокаТаблицы.Подразделение;
		КонецЕсли;
		
		//Проводка.СчетКт = СтрокаТаблицы.СчетУчета;
		
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтатьиДвиженияДенежныхСредств", СтрокаТаблицы.СтатьяДвиженияДенежныхСредств);
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.БанковскийСчет) Тогда
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "БанковскиеСчета", СтрокаТаблицы.БанковскийСчет);
		КонецЕсли;
		
		СвойстваСчетаКт = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка.СчетКт);
		Если СвойстваСчетаКт.УчетПоПодразделениям Тогда
			Проводка.ПодразделениеКт = СтрокаТаблицы.Подразделение;
		КонецЕсли;
		
		Если ОтражатьВНалоговомУчете Тогда
			
			Если СвойстваСчетаДт.НалоговыйУчет Тогда
				Проводка.СуммаНУДт = СтрокаТаблицы.СуммаКВыплате;
			КонецЕсли;
			Если СвойстваСчетаКт.НалоговыйУчет Тогда
				Проводка.СуммаНУКт = СтрокаТаблицы.СуммаКВыплате;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Движения.ЕПС.Записывать = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ВыплатаДепонентов

// Предназначена для генерации движений, связанных с отражением в регл. учете выплаты депонентов
//
// Параметры:
//	ТаблицаПеречислениеЗарплаты - таблица значений с колонками
//      Подразделение
//		ФизическоеЛицо
//      СуммаКВыплате
//      СтатьяДвиженияДенежныхСредств
//      СчетУчета
//      Ведомость
//	ТаблицаРеквизиты  - таблица значений содержит реквизиты документа
//	Движения
//	Отказ
//
Процедура СформироватьДвиженияВыплатаДепонентов(ТаблицаВыплатаДепонентов, ТаблицаРеквизиты, Движения, Отказ) Экспорт
	
	Если ТаблицаВыплатаДепонентов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВедетсяУчетРасчетовПоЗарплатеПоРаботникам = ПолучитьФункциональнуюОпцию("ВедетсяУчетРасчетовПоЗарплатеПоРаботникам");
	Если Не ВедетсяУчетРасчетовПоЗарплатеПоРаботникам Тогда
		ОбщегоНазначения.СообщитьПользователю("В форме ""Настройки зарплаты"" не установлен флаг ""Ведется учет расчетов по зарплате по работникам""! Проводки не будут сформированы");
		Возврат;
	КонецЕсли;

	Параметры = ПодготовитьПараметрыВыплатыДепонентов(ТаблицаВыплатаДепонентов, ТаблицаРеквизиты);
	
	Реквизиты = Параметры.Реквизиты[0];
	
	СуммаДокумента = Реквизиты.СуммаДокумента;
		
	ВыплатаДепонентов 		= Параметры.ВыплатаДепонентов;
	СуммаПоПустойВедомости 	= Макс(0, СуммаДокумента - ВыплатаДепонентов.Итог("СуммаКВыплате"));
	
	Если СуммаПоПустойВедомости <> 0 Тогда
		НоваяСтрока = ВыплатаДепонентов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыплатаДепонентов[0]);
		НоваяСтрока.СуммаКВыплате 	= СуммаПоПустойВедомости;
		НоваяСтрока.Ведомость 		= Неопределено;
	КонецЕсли;
	
	СтрокиКУдалению = Новый Массив();
	Для Каждого СтрокаТаблицы Из ВыплатаДепонентов Цикл
		Если СтрокаТаблицы.СуммаКВыплате = 0 Тогда
			СтрокиКУдалению.Добавить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	
	Если СтрокиКУдалению.Количество() > 0 Тогда
		Для каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
			ВыплатаДепонентов.Удалить(СтрокаКУдалению);
		КонецЦикла;
	КонецЕсли;
	
	ОстаткиПоВыплатеДепонентов = УчетДепонированнойЗарплаты.ОстатокДепонированнойЗарплаты(Реквизиты.Регистратор, Реквизиты.Организация, Реквизиты.Период, ВыплатаДепонентов.ВыгрузитьКолонку("ФизическоеЛицо"), Реквизиты.Период); 
	ОстаткиПоВыплатеДепонентов.Колонки.Добавить("Подразделение");
	ОстаткиПоВыплатеДепонентов.Колонки.Добавить("ПодразделениеУчетаНачислений");
	ОстаткиПоВыплатеДепонентов.Колонки.Добавить("СтатьяДвиженияДенежныхСредств");
	ОстаткиПоВыплатеДепонентов.Колонки.Добавить("БанковскийСчет");
	ОстаткиПоВыплатеДепонентов.Колонки.Добавить("СчетУчета");

	Для Каждого СтрокаОстаткиПоВыплатеДепонентов Из ОстаткиПоВыплатеДепонентов Цикл
		
		ОтборСтрок = Новый Структура;
		ОтборСтрок.Вставить("ФизическоеЛицо", СтрокаОстаткиПоВыплатеДепонентов.ФизическоеЛицо);
		
		мСтрокТаблицаВыплатаДепонентов = ТаблицаВыплатаДепонентов.НайтиСтроки(ОтборСтрок);
		Если мСтрокТаблицаВыплатаДепонентов.Количество() Тогда
			ЗаполнитьЗначенияСвойств(СтрокаОстаткиПоВыплатеДепонентов, мСтрокТаблицаВыплатаДепонентов[0]);
			СтрокаОстаткиПоВыплатеДепонентов.ПодразделениеУчетаНачислений = Реквизиты.Регистратор.ПодразделениеДт;
		КонецЕсли;
		
	КонецЦикла;
	
	СформироватьПроводкиПоВыплатеДепонентов(ОстаткиПоВыплатеДепонентов, Реквизиты, Движения, Отказ);
	
	УчетЗарплатыИКадровВоВнешнейПрограмме = ПолучитьФункциональнуюОпцию("УчетЗарплатыИКадровВоВнешнейПрограмме");
	ВедетсяУчетРасчетовПоЗарплатеСводно   = ПолучитьФункциональнуюОпцию("ВедетсяУчетРасчетовПоЗарплатеСводно");
	// Обращение к БЗКБ
	Если НЕ (УчетЗарплатыИКадровВоВнешнейПрограмме И ВедетсяУчетРасчетовПоЗарплатеСводно) Тогда
		Параметры.ВыплатаДепонентов.Колонки.СуммаКВыплате.Имя = "Сумма";
		УчетДепонированнойЗарплаты.СписатьДепонированнуюЗарплату(Движения, Отказ, Реквизиты.Организация, Реквизиты.Период, ОстаткиПоВыплатеДепонентов, , Строка(Реквизиты.Регистратор));
	КонецЕсли;

КонецПроцедуры

Функция ПодготовитьПараметрыВыплатыДепонентов(ТаблицаВыплатаДепонентов, ТаблицаРеквизиты)

	Параметры = Новый Структура;
	
	// Подготовка таблицы Параметры.Реквизиты
	СписокОбязательныхКолонок = ""
	+ "Период,"                    // <Дата> - период движений - дата документа
	+ "Регистратор,"               // <ДокументСсылка>
	+ "СчетУчетаДенежныхСредств,"  // <СправочникСсылка.ЕПСЛицевыеСчета>
	+ "СуммаДокумента,"            // <Число,15,2> - сумма выплаты в валюте документа	
	+ "Организация";               // <СправочникСсылка.Организации>
	
	Параметры.Вставить("Реквизиты", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ТаблицаРеквизиты, СписокОбязательныхКолонок));
	
	// Подготовка таблицы Параметры.ВыплатаДепонентов
	СписокОбязательныхКолонок = ""
	+ "Подразделение,"                 // <Ссылка на справочник подразделений>  - подразделение, задолженность по которому погашается
	+ "ФизическоеЛицо,"                // <СправочникСсылка.ФизическиеЛица> - физическое лико, которому выплачивается зарплата
	+ "СуммаКВыплате,"                 // <Число,15,2> - сумма выплаты в валюте документа	
	+ "БанковскийСчет,"                // <СправочникСсылка.БанковскиеСчета>
	+ "СтатьяДвиженияДенежныхСредств," // <СправочникСсылка.СтатьиДвиженияДенежныхСредств>
	+ "СчетУчета,"                     // <ПланСчетовСсылка.Хозрасчетный> - счет учета денежных средств
	+ "Ведомость";                     // <ДокументСсылка.ВедомостьВКассу> - ведомость, по которым производится выплата
	
	Параметры.Вставить("ВыплатаДепонентов", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ТаблицаВыплатаДепонентов, СписокОбязательныхКолонок));
	
	Возврат Параметры;

КонецФункции

Процедура СформироватьПроводкиПоВыплатеДепонентов(ТаблицаВыплатаДепонентов, Реквизиты, Движения, Отказ)
	
	ТаблицаВыплаты 			= ТаблицаВыплатаДепонентов.Скопировать();
	ОтражатьВНалоговомУчете = УчетнаяПолитика.ПлательщикНалогаНаПрибыль(Реквизиты.Организация, Реквизиты.Период);
	ВестиУчетПоРаботникам 	= Константы.ВедетсяУчетРасчетовПоЗарплатеПоРаботникам.Получить();

	СтрокаСвертки = "Подразделение, ПодразделениеУчетаНачислений, СтатьяДвиженияДенежныхСредств, СчетУчета, БанковскийСчет";
	Если ВестиУчетПоРаботникам Тогда
		СтрокаСвертки = "ФизическоеЛицо, ЛицевойСчет, " + СтрокаСвертки;
	КонецЕсли;
	
	ТаблицаВыплаты.Свернуть(СтрокаСвертки, "Сумма");
	
	ВалютаУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	ВестиУчетНачисленияЗаработнойПлатыВРазрезеПодразделений	= ВестиУчетНачисленияЗаработнойПлатыВРазрезеПодразделений(Реквизиты.Организация, Реквизиты.Период);
	
	Для Каждого СтрокаТаблицы Из ТаблицаВыплаты Цикл
		
		Если СтрокаТаблицы.Сумма = 0 Тогда
			Продолжить;
		КонецЕсли;
				
		Если СтрокаТаблицы.Сумма <> 0 Тогда
			
			Проводка = Движения.ЕПС.Добавить();
			
			Проводка.Период       = Реквизиты.Период;
			Проводка.Организация  = Реквизиты.Организация;
			Проводка.Содержание   = НСтр("ru = 'Выплата депонентов'");
			
			Проводка.Сумма = СтрокаТаблицы.Сумма;
			
			Проводка.СчетДт = СтрокаТаблицы.ЛицевойСчет.Владелец;
			Проводка.ЛицевойСчетДт = СтрокаТаблицы.ЛицевойСчет;
			
			Если ВестиУчетПоРаботникам Тогда			
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "РаботникиОрганизаций", СтрокаТаблицы.ФизическоеЛицо);
			КонецЕсли;
			
			СвойстваСчетаДт = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка.СчетДт);
			Если СвойстваСчетаДт.УчетПоПодразделениям Тогда
				Если ВестиУчетНачисленияЗаработнойПлатыВРазрезеПодразделений Тогда
					Проводка.ПодразделениеДт = СтрокаТаблицы.ПодразделениеУчетаНачислений;
				Иначе
					Проводка.ПодразделениеДт = СтрокаТаблицы.Подразделение;
				КонецЕсли;
			КонецЕсли;
			Если Проводка.СчетДт.Валютный Тогда
				Проводка.ВалютаДт        = ВалютаУчета;
				Проводка.ВалютнаяСуммаДт = Проводка.Сумма;
			КонецЕсли;

			Проводка.СчетКт = СтрокаТаблицы.СчетУчета.Владелец;
			Проводка.ЛицевойСчетКт = СтрокаТаблицы.СчетУчета;

			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтатьиДвиженияДенежныхСредств", СтрокаТаблицы.СтатьяДвиженияДенежныхСредств);
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.БанковскийСчет) Тогда
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "БанковскиеСчета", СтрокаТаблицы.БанковскийСчет);
			КонецЕсли;
			
			СвойстваСчетаКт = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка.СчетКт);
			Если СвойстваСчетаКт.УчетПоПодразделениям Тогда
				Проводка.ПодразделениеКт = СтрокаТаблицы.Подразделение;
			КонецЕсли;
			Если Проводка.СчетКт.Валютный Тогда
				Проводка.ВалютаКт        = ВалютаУчета;
				Проводка.ВалютнаяСуммаКт = Проводка.Сумма;
			КонецЕсли;

			Если ОтражатьВНалоговомУчете Тогда
				
				Если СвойстваСчетаДт.НалоговыйУчет Тогда
					Проводка.СуммаНУДт = СтрокаТаблицы.Сумма;
				КонецЕсли;
				Если СвойстваСчетаКт.НалоговыйУчет Тогда
					Проводка.СуммаНУКт = СтрокаТаблицы.Сумма;
				КонецЕсли;
				
			КонецЕсли;
						
		КонецЕсли;
		
	КонецЦикла;
	
	Движения.ЕПС.Записывать = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СинхронизацияДокументовВыплаты

Процедура ОбработкаДокументовВыплаты(ОбъектОснование, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОснованиеСсылка = ОбъектОснование.Ссылка;
	
	Если ТипЗнч(ОбъектОснование) = Тип("ДокументОбъект.ВедомостьНаВыплатуЗарплаты") Тогда
		Проведение       = НЕ ОбъектОснование.ПометкаУдаления;
	Иначе
		Проведение       = ОбъектОснование.Проведен;
	КонецЕсли;
	ОтменаПроведения = НЕ Проведение И НЕ ОбъектОснование.ПометкаУдаления;
	ПометкаУдаления  = ОбъектОснование.ПометкаУдаления;
	
	Зарплата = ОбъектОснование.Зарплата.Выгрузить();
	
	ИмяРеквизитаСумма = "СуммаПоДокументу";
	Если Зарплата.Колонки.Найти("Сумма") <> Неопределено Тогда
		Зарплата.Колонки.Сумма.Имя = "КВыплате";
		ИмяРеквизитаСумма = "СуммаДокумента"
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ведомость", ОснованиеСсылка);
	Запрос.УстановитьПараметр("Зарплата",  Зарплата);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Зарплата.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Зарплата.КВыплате КАК КВыплате,
	|	Зарплата.КомпенсацияЗаЗадержкуЗарплаты КАК КомпенсацияЗаЗадержкуЗарплаты
	|ПОМЕСТИТЬ ВТ_Зарплата
	|ИЗ
	|	&Зарплата КАК Зарплата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Зарплата.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТ_Зарплата.КВыплате + ВТ_Зарплата.КомпенсацияЗаЗадержкуЗарплаты КАК КВыплате
	|ПОМЕСТИТЬ ВТ_ТекущаяВедомость
	|ИЗ
	|	ВТ_Зарплата КАК ВТ_Зарплата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ОплатаВедомостей.Регистратор КАК Ссылка,
	|	ОплатаВедомостей.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТ_Оплаты
	|ИЗ
	|	РегистрСведений.ОплатаВедомостейНаВыплатуЗарплаты КАК ОплатаВедомостей
	|ГДЕ
	|	ОплатаВедомостей.Ведомость = &Ведомость
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатаВедомостей.Регистратор,
	|	ОплатаВедомостей.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТекущаяВедомость.ФизическоеЛицо КАК ФизическоеЛицо_Ведомость,
	|	СУММА(ВТ_ТекущаяВедомость.КВыплате) КАК КВыплате,
	|	ВТ_Оплаты.Ссылка КАК Ссылка,
	|	ВТ_Оплаты.ФизическоеЛицо КАК ФизическоеЛицо_ДокументВыплаты
	|ИЗ
	|	ВТ_ТекущаяВедомость КАК ВТ_ТекущаяВедомость
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Оплаты КАК ВТ_Оплаты
	|		ПО ВТ_ТекущаяВедомость.ФизическоеЛицо = ВТ_Оплаты.ФизическоеЛицо
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Оплаты.ФизическоеЛицо,
	|	ВТ_Оплаты.Ссылка,
	|	ВТ_ТекущаяВедомость.ФизическоеЛицо";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДокументыПроведение       = Новый Соответствие;
	ДокументыПометкаУдаления  = Новый Соответствие;
	ДокументыОтменаПроведения = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			
			ДокументВыплаты = Выборка.Ссылка.ПолучитьОбъект();
			
			Если ТипЗнч(ДокументВыплаты) = Тип("ДокументОбъект.ДепонированиеЗарплаты") Тогда
				
				Если Не ПравоДоступа("Изменение", Метаданные.Документы.ДепонированиеЗарплаты) Тогда
					Продолжить;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(Выборка.ФизическоеЛицо_Ведомость) Тогда
					СтрокаКУдалению = ДокументВыплаты.Депоненты.Найти(Выборка.ФизическоеЛицо_ДокументВыплаты, "ФизическоеЛицо");
					Если СтрокаКУдалению <> Неопределено Тогда
						ДокументВыплаты.Депоненты.Удалить(СтрокаКУдалению);
					КонецЕсли;
				КонецЕсли;
				
				Если ДокументВыплаты.Депоненты.Количество() = 0 ИЛИ ПометкаУдаления Тогда
					ДокументыПометкаУдаления.Вставить(Выборка.Ссылка, ДокументВыплаты);
				ИначеЕсли ОтменаПроведения Тогда
					ДокументыОтменаПроведения.Вставить(Выборка.Ссылка, ДокументВыплаты);
				Иначе
					ДокументыПроведение.Вставить(Выборка.Ссылка, ДокументВыплаты);
				КонецЕсли;
				
			КонецЕсли;
			
			Если ТипЗнч(ДокументВыплаты) = Тип("ДокументОбъект.РасходныйКассовыйОрдер") Тогда
				
				Если Не ПравоДоступа("Изменение", Метаданные.Документы.РасходныйКассовыйОрдер) Тогда
					Продолжить;
				КонецЕсли;
				
				Если ДокументВыплаты.ВидОперации = Перечисления.ВидыОперацийРКО.ВыплатаЗаработнойПлатыРаботнику Тогда
					
					Если ЗначениеЗаполнено(Выборка.ФизическоеЛицо_Ведомость) Тогда
						Если ДокументВыплаты.СуммаДокумента <> Выборка.КВыплате Тогда
							ДокументВыплаты.СуммаДокумента = Выборка.КВыплате;
						КонецЕсли;
						Если ПометкаУдаления Тогда
							ДокументыПометкаУдаления.Вставить(Выборка.Ссылка, ДокументВыплаты);
						ИначеЕсли ОтменаПроведения Тогда
							ДокументыОтменаПроведения.Вставить(Выборка.Ссылка, ДокументВыплаты);
						Иначе
							ДокументыПроведение.Вставить(Выборка.Ссылка, ДокументВыплаты);
						КонецЕсли;
					Иначе
						ДокументыПометкаУдаления.Вставить(Выборка.Ссылка, ДокументВыплаты);
					КонецЕсли;
					
				ИначеЕсли ДокументВыплаты.ВидОперации = Перечисления.ВидыОперацийРКО.ВыплатаЗаработнойПлатыПоВедомостям Тогда
					
					Если ДокументыПометкаУдаления.Получить(Выборка.Ссылка) <> Неопределено
						ИЛИ ДокументыОтменаПроведения.Получить(Выборка.Ссылка) <> Неопределено
						ИЛИ ДокументыПроведение.Получить(Выборка.Ссылка) <> Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					Если ОтменаПроведения ИЛИ ПометкаУдаления Тогда
						СтрокаКУдалению = ДокументВыплаты.ВыплатаЗаработнойПлаты.Найти(ОснованиеСсылка, "Ведомость");
						Если СтрокаКУдалению <> Неопределено Тогда
							ДокументВыплаты.ВыплатаЗаработнойПлаты.Удалить(СтрокаКУдалению);
						КонецЕсли;
					Иначе
						СтрокаКОбновлению = ДокументВыплаты.ВыплатаЗаработнойПлаты.Найти(ОснованиеСсылка, "Ведомость");
						Если СтрокаКОбновлению <> Неопределено Тогда
							СтрокаКОбновлению.СуммаКВыплате = ОбъектОснование[ИмяРеквизитаСумма];
						КонецЕсли;
					КонецЕсли;
					ДокументВыплаты.СуммаДокумента = ДокументВыплаты.ВыплатаЗаработнойПлаты.Итог("СуммаКВыплате");
					
					Если ДокументВыплаты.ВыплатаЗаработнойПлаты.Количество() = 0 Тогда
						ДокументыПометкаУдаления.Вставить(Выборка.Ссылка, ДокументВыплаты);
					Иначе
						ДокументыПроведение.Вставить(Выборка.Ссылка, ДокументВыплаты);
					КонецЕсли;
					
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(ДокументВыплаты) = Тип("ДокументОбъект.СписаниеСРасчетногоСчета") Тогда
				
				Если Не ПравоДоступа("Изменение", Метаданные.Документы.СписаниеСРасчетногоСчета) Тогда
					Продолжить;
				КонецЕсли;
				
				Если ДокументВыплаты.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеЗаработнойПлатыРаботнику Тогда
					
					Если ЗначениеЗаполнено(Выборка.ФизическоеЛицо_Ведомость) Тогда
						Если ДокументВыплаты.СуммаДокумента <> Выборка.КВыплате Тогда
							ДокументВыплаты.СуммаДокумента = Выборка.КВыплате;
						КонецЕсли;
						Если ПометкаУдаления Тогда
							ДокументыПометкаУдаления.Вставить(Выборка.Ссылка, ДокументВыплаты);
						ИначеЕсли ОтменаПроведения Тогда
							ДокументыОтменаПроведения.Вставить(Выборка.Ссылка, ДокументВыплаты);
						Иначе
							ДокументыПроведение.Вставить(Выборка.Ссылка, ДокументВыплаты);
						КонецЕсли;
					Иначе
						ДокументыПометкаУдаления.Вставить(Выборка.Ссылка, ДокументВыплаты);
					КонецЕсли;
					
				ИначеЕсли ДокументВыплаты.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеЗП Тогда
					
					Если ДокументыПометкаУдаления.Получить(Выборка.Ссылка) <> Неопределено
						ИЛИ ДокументыОтменаПроведения.Получить(Выборка.Ссылка) <> Неопределено
						ИЛИ ДокументыПроведение.Получить(Выборка.Ссылка) <> Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					Если ОтменаПроведения ИЛИ ПометкаУдаления Тогда
						СтрокаКУдалению = ДокументВыплаты.ПеречислениеЗаработнойПлаты.Найти(ОснованиеСсылка, "Ведомость");
						Если СтрокаКУдалению <> Неопределено Тогда
							ДокументВыплаты.ПеречислениеЗаработнойПлаты.Удалить(СтрокаКУдалению);
						КонецЕсли;
					Иначе
						СтрокаКОбновлению = ДокументВыплаты.ПеречислениеЗаработнойПлаты.Найти(ОснованиеСсылка, "Ведомость");
						Если СтрокаКОбновлению <> Неопределено Тогда
							СтрокаКОбновлению.СуммаПлатежа = ОбъектОснование[ИмяРеквизитаСумма];
						КонецЕсли;
					КонецЕсли;
					ДокументВыплаты.СуммаДокумента = ДокументВыплаты.ПеречислениеЗаработнойПлаты.Итог("СуммаПлатежа");
					
					Если ДокументВыплаты.ПеречислениеЗаработнойПлаты.Количество() = 0 Тогда
						ДокументыПометкаУдаления.Вставить(Выборка.Ссылка, ДокументВыплаты);
					Иначе
						ДокументыПроведение.Вставить(Выборка.Ссылка, ДокументВыплаты);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстЖурналаВСлучаеОшибки = НСтр("ru = 'Синхронизация ведомостей и документов выплаты'",
		ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	
	Для Каждого ЗаписьСоответствия ИЗ ДокументыОтменаПроведения Цикл
		Попытка
			ЗаписьСоответствия.Значение.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		Исключение
			ТекстСообщенияВСлучаеОшибки = НСтр("ru = 'Не удалось отменить проведение документа %1'");
			ТекстСообщенияПользователю = СтрШаблон(ТекстСообщенияВСлучаеОшибки, ОснованиеСсылка);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияПользователю);
			
			ТекстСообщения = СтрШаблон(ТекстСообщенияВСлучаеОшибки,
				Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(
				ТекстЖурналаВСлучаеОшибки,
				УровеньЖурналаРегистрации.Ошибка,
				ОбъектОснование.Метаданные(),
				ОснованиеСсылка,
				ТекстСообщения);
			
			Отказ = Истина;
			Возврат;
			
		КонецПопытки;
	КонецЦикла;
	
	Для Каждого ЗаписьСоответствия ИЗ ДокументыПометкаУдаления Цикл
		Попытка
			ЗаписьСоответствия.Значение.ПометкаУдаления = Истина;
			ЗаписьСоответствия.Значение.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		Исключение
			ТекстСообщенияВСлучаеОшибки = НСтр("ru = 'Не удалось пометить на удаление документ %1'");
			ТекстСообщенияПользователю = СтрШаблон(ТекстСообщенияВСлучаеОшибки, ОснованиеСсылка);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияПользователю);
			
			ТекстСообщения = СтрШаблон(ТекстСообщенияВСлучаеОшибки,
				Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(
				ТекстЖурналаВСлучаеОшибки,
				УровеньЖурналаРегистрации.Ошибка,
				ОбъектОснование.Метаданные(),
				ОснованиеСсылка,
				ТекстСообщения);
			
			Отказ = Истина;
			Возврат;
			
		КонецПопытки;
	КонецЦикла;
	
	Для Каждого ЗаписьСоответствия ИЗ ДокументыПроведение Цикл
		Попытка
			ЗаписьСоответствия.Значение.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ТекстСообщенияВСлучаеОшибки = НСтр("ru = 'Не удалось провести документ %1'");
			ТекстСообщенияПользователю = СтрШаблон(ТекстСообщенияВСлучаеОшибки, ОснованиеСсылка);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияПользователю);
			
			ТекстСообщения = СтрШаблон(ТекстСообщенияВСлучаеОшибки,
				Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(
				ТекстЖурналаВСлучаеОшибки,
				УровеньЖурналаРегистрации.Ошибка,
				ОбъектОснование.Метаданные(),
				ОснованиеСсылка,
				ТекстСообщения);
			
			Отказ = Истина;
			Возврат;
			
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область РасчетыПоНалогамВзносам

#Область ПеречислениеНалоговВзносов

Функция ПодготовитьПараметрыПеречисленияНалоговИВзносовСФОТ(ТаблицаПеречислениеНалогов, ТаблицаРеквизиты)
	   
	Параметры = Новый Структура;
	
	// Подготовка таблицы Параметры.Реквизиты
	
	СписокОбязательныхКолонок = ""
	+ "Период,"                    // <Дата> - период движений - дата документа
	+ "Регистратор,"               // <ДокументСсылка>
	+ "ВидОперации,"               // <ПеречислениеСсылка.ВидыОперацийСписаниеДенежныхСредств>
	+ "ДатаВходящегоДокумента,"    // <Дата> - дата платежного поручения
	+ "НомерВходящегоДокумента,"   // Строка
	+ "Организация";               // <СправочникСсылка.Организации>
	
	
	Параметры.Вставить("Реквизиты", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ТаблицаРеквизиты, СписокОбязательныхКолонок));
	
	// Подготовка таблицы Параметры.ТаблицаПеречислениеНалогов
	
	СписокОбязательныхКолонок = ""
	+ "НалоговыйПериод,"             // <Дата> - период за который отражена уплата налога
	+ "Период,"                      // <Дата> - период движений - дата документа
	+ "СчетДт,"                      // <ПланСчетовСсылка.Хозрасчетный> - счет учета налогов и взносов с ФОТ
	+ "СубконтоДт1,"                 // <ПланВидовХарактеристик.ВидыСубконтоХозрасчетные>
	+ "СубконтоДт2,"                 // <ПланВидовХарактеристик.ВидыСубконтоХозрасчетные>
	+ "СубконтоДт3,"                 // <ПланВидовХарактеристик.ВидыСубконтоХозрасчетные>
	+ "ПодразделениеДт,"             // <СправочникСсылка.ПодразделенияОрганизации>
	+ "РегистрацияВНалоговомОргане," // <СправочникСсылка.РегистрацииВНалоговомОргане>
	+ "СуммаРуб";                    // <Число,15,2> - сумма налога, взноса
	
	Параметры.Вставить("ТаблицаПеречислениеНалогов", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ТаблицаПеречислениеНалогов, СписокОбязательныхКолонок));
	
	Возврат Параметры;

КонецФункции

Процедура СформироватьДвиженияПоНалогамИВзносамСФОТ(ТаблицаРеквизиты, ТаблицыУплатаНалогов, Движения, Отказ) Экспорт

	// Блок находится в разработке
	Параметры = ПодготовитьПараметрыПеречисленияНалоговИВзносовСФОТ(ТаблицаРеквизиты, ТаблицыУплатаНалогов);
		
	Если Параметры.ТаблицаПеречислениеНалогов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Реквизиты = Параметры.Реквизиты[0];
	
	Если Реквизиты.ВидОперации <> Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеНалога
		И Реквизиты.ВидОперации <> Перечисления.ВидыОперацийРКО.УплатаНалога Тогда
		Возврат;
	КонецЕсли;
	
	ПеречисленныйНалог = Параметры.ТаблицаПеречислениеНалогов.Итог("СуммаРуб");
	
	Если ПеречисленныйНалог = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИспользоватьНачислениеЗарплаты = ПолучитьФункциональнуюОпцию("ИспользоватьНачислениеЗарплаты");
	
	Если ИспользоватьНачислениеЗарплаты Тогда
		
		ТаблицаПеречислениеНалогов = Параметры.ТаблицаПеречислениеНалогов.Скопировать();
		
		СчетаУчетаНалоговВзносовСФОТ = Новый Соответствие;
		СчетаУчетаНалоговВзносовСФОТ.Вставить(ПланыСчетов.Хозрасчетный.ПФР_нак,              Перечисления.ВидыОбязательногоСтрахованияСотрудников.ПФРНакопительная);
		СчетаУчетаНалоговВзносовСФОТ.Вставить(ПланыСчетов.Хозрасчетный.ПФР_страх,            Перечисления.ВидыОбязательногоСтрахованияСотрудников.ПФРСтраховая);
		СчетаУчетаНалоговВзносовСФОТ.Вставить(ПланыСчетов.Хозрасчетный.ПФР_доп,              Перечисления.ВидыОбязательногоСтрахованияСотрудников.ДоплатаКПенсииЛетчикам);
		СчетаУчетаНалоговВзносовСФОТ.Вставить(ПланыСчетов.Хозрасчетный.ПФР_доп_шахтеры,      Перечисления.ВидыОбязательногоСтрахованияСотрудников.ДоплатаКПенсииШахтерам);
		СчетаУчетаНалоговВзносовСФОТ.Вставить(ПланыСчетов.Хозрасчетный.ПФР_доп_ВредныеУсловияТруда, Перечисления.ВидыОбязательногоСтрахованияСотрудников.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах);
		СчетаУчетаНалоговВзносовСФОТ.Вставить(ПланыСчетов.Хозрасчетный.ПФР_доп_ТяжелыеУсловияТруда, Перечисления.ВидыОбязательногоСтрахованияСотрудников.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах);
		СчетаУчетаНалоговВзносовСФОТ.Вставить(ПланыСчетов.Хозрасчетный.ФСС,                  Перечисления.ВидыОбязательногоСтрахованияСотрудников.ФСС);
		СчетаУчетаНалоговВзносовСФОТ.Вставить(ПланыСчетов.Хозрасчетный.ФСС_НСиПЗ,            Перечисления.ВидыОбязательногоСтрахованияСотрудников.ФССНесчастныеСлучаи);
		СчетаУчетаНалоговВзносовСФОТ.Вставить(ПланыСчетов.Хозрасчетный.ФФОМС,                Перечисления.ВидыОбязательногоСтрахованияСотрудников.ФФОМС);
		СчетаУчетаНалоговВзносовСФОТ.Вставить(ПланыСчетов.Хозрасчетный.ТФОМС,                Перечисления.ВидыОбязательногоСтрахованияСотрудников.ТФОМС);
		СчетаУчетаНалоговВзносовСФОТ.Вставить(ПланыСчетов.Хозрасчетный.ПФР_ОПС,              Перечисления.ВидыОбязательногоСтрахованияСотрудников.ПФРПоСуммарномуТарифу);
		
		ТаблицаПеречислениеНалогов.Колонки.Добавить("ВидОбязательногоСтрахованияСотрудников");
		ТаблицаПеречислениеНалогов.Колонки.Добавить("ЭтоСтраховыеВзносы");
		ТаблицаПеречислениеНалогов.Колонки.Добавить("ВидДвижения");
		ТаблицаПеречислениеНалогов.Колонки.Добавить("ПлатежноеПоручениеНомер");
		ТаблицаПеречислениеНалогов.Колонки.Добавить("ПлатежноеПоручениеДата");
		
		ТаблицаПеречислениеНалогов.ЗаполнитьЗначения(Реквизиты.НомерВходящегоДокумента, "ПлатежноеПоручениеНомер");
		ТаблицаПеречислениеНалогов.ЗаполнитьЗначения(Реквизиты.ДатаВходящегоДокумента, "ПлатежноеПоручениеДата");
		
		ТаблицаПеречислениеНалогов.Колонки.СуммаРуб.Имя = "Сумма";
		ТаблицаПеречислениеНалогов.Колонки.ПодразделениеДт.Имя = "Подразделение";
				
		Для Каждого СтрокаТаблицы ИЗ ТаблицаПеречислениеНалогов Цикл
			
			ВидОбязательногоСтрахованияСотрудников = СчетаУчетаНалоговВзносовСФОТ.Получить(ТаблицаПеречислениеНалогов[0].СчетДт);
			
			СтрокаТаблицы.ВидОбязательногоСтрахованияСотрудников = ВидОбязательногоСтрахованияСотрудников;
			СтрокаТаблицы.ЭтоСтраховыеВзносы = Истина;
			СтрокаТаблицы.ВидДвижения = ВидДвиженияНакопления.Расход;
			
		КонецЦикла;
		
		МассивНазначенийПлатежа = Новый Массив;
		МассивНазначенийПлатежа.Добавить(Перечисления.ВидыПлатежейВГосБюджет.Налог);
		МассивНазначенийПлатежа.Добавить(Перечисления.ВидыПлатежейВГосБюджет.НалогСам);
		МассивНазначенийПлатежа.Добавить(Перечисления.ВидыПлатежейВГосБюджет.НалогАкт);
				
		Если ТаблицаПеречислениеНалогов[0].СчетДт.Владелец = ПланыСчетов.Хозрасчетный.НДФЛ Тогда
						
			Если МассивНазначенийПлатежа.Найти(ТаблицаПеречислениеНалогов[0].СубконтоДт1) = Неопределено Тогда
				Возврат;
			КонецЕсли;
			
			МесяцНалоговогоПериода = ТаблицаПеречислениеНалогов[0].НалоговыйПериод;
			Если НЕ ЗначениеЗаполнено(МесяцНалоговогоПериода) Тогда
				Возврат;
			КонецЕсли;
			
			Если ПолучитьФункциональнуюОпцию("РасчетЗарплатыПоПодразделениямДляНебольшихОрганизаций")
				И ЗначениеЗаполнено(ТаблицаПеречислениеНалогов[0].РегистрацияВНалоговомОргане) Тогда
				РегистрацияВНалоговомОргане = ТаблицаПеречислениеНалогов[0].РегистрацияВНалоговомОргане;
			ИначеЕсли ЗначениеЗаполнено(ТаблицаПеречислениеНалогов[0].СубконтоДт2) Тогда
				РегистрацияВНалоговомОргане = ТаблицаПеречислениеНалогов[0].СубконтоДт2;
			Иначе
				РегистрацияВНалоговомОргане = Неопределено;
			КонецЕсли;
			
			ТаблицаПеречислениеНалогов.Колонки.НалоговыйПериод.Имя = "МесяцНалоговогоПериода";
			// НДФЛ
			
			ФизическиеЛица = Новый Массив;
			Если Параметры.ТаблицаПеречислениеНДФЛ <> Неопределено Тогда
				ФизическиеЛица = Параметры.ТаблицаПеречислениеНДФЛ.ВыгрузитьКолонку("ФизическоеЛицо");
			КонецЕсли;
			Если ФизическиеЛица.Количество() = 0 Тогда
				УчетНДФЛ.СформироватьПеречисленныйНалог(
					Реквизиты.Регистратор, Движения, Отказ, Реквизиты.Организация, Реквизиты.Период,
					ТаблицаПеречислениеНалогов, , РегистрацияВНалоговомОргане, Год(Реквизиты.Период) > 2014);
			Иначе
				
				Если РегистрацияВНалоговомОргане = Неопределено Тогда
					РегистрацияВНалоговомОргане = ЗарплатаКадры.РегистрацияВНалоговомОргане(Реквизиты.Организация, Реквизиты.Период);
				КонецЕсли;
				
				ВТПеречислениеНДФЛ = СформироватьВременнуюТаблицуПеречислениеНДФЛ(Параметры.ТаблицаПеречислениеНДФЛ, МесяцНалоговогоПериода, РегистрацияВНалоговомОргане,
					Реквизиты.ДатаВходящегоДокумента, Реквизиты.НомерВходящегоДокумента);
				
				УчетНДФЛ.СформироватьПеречисленныйНалогПоВременнойТаблице(Движения, Отказ, Реквизиты.Организация, Реквизиты.Период, ВТПеречислениеНДФЛ);
				
				СтрокаДанных = Новый Структура;
				Для Каждого Колонка ИЗ ТаблицаПеречислениеНалогов.Колонки Цикл
					СтрокаДанных.Вставить(Колонка.Имя);
				КонецЦикла;
				ЗаполнитьЗначенияСвойств(СтрокаДанных, ТаблицаПеречислениеНалогов[0]);
				СтрокаДанных.Сумма = ТаблицаПеречислениеНалогов.Итог("Сумма");
				
				РеквизитыПлатежногоПоручения = РеквизитыПлатежногоПорученияПоДатеНомеру(Реквизиты.ДатаВходящегоДокумента, Реквизиты.НомерВходящегоДокумента);
				
				СтрокаПриход = СтрокаУплатыНалоговогоАгента(Движения, Реквизиты.Организация, Реквизиты.Период, ВидДвиженияНакопления.Приход, СтрокаДанных);
				СтрокаПриход.РеквизитыПлатежногоПоручения = РеквизитыПлатежногоПоручения;
				СтрокаПриход.РегистрацияВНалоговомОргане = РегистрацияВНалоговомОргане;
				СтрокаПриход.ДатаПлатежа = Реквизиты.Период;
				
				СтрокаРасход = СтрокаУплатыНалоговогоАгента(Движения, Реквизиты.Организация, Реквизиты.Период, ВидДвиженияНакопления.Расход, СтрокаДанных);
				СтрокаРасход.РеквизитыПлатежногоПоручения = РеквизитыПлатежногоПоручения;
				СтрокаРасход.РегистрацияВНалоговомОргане = РегистрацияВНалоговомОргане;
				СтрокаРасход.ДатаПлатежа = Реквизиты.Период;
				
				Движения.УплатаНДФЛНалоговымиАгентамиКРаспределению.Записывать = Истина;
				
			КонецЕсли;
			
		ИначеЕсли СчетаУчетаНалоговВзносовСФОТ.Получить(ТаблицаПеречислениеНалогов[0].СчетДт) <> Неопределено Тогда 
			
			МассивНазначенийПлатежа.Добавить(Перечисления.ВидыПлатежейВГосБюджет.НеПринято);
			Если МассивНазначенийПлатежа.Найти(ТаблицаПеречислениеНалогов[0].СубконтоДт1) = Неопределено Тогда
				Возврат;
			КонецЕсли;
			
			//Взносы
			УчетСтраховыхВзносов.СформироватьУплатуВзносовВФонд(Движения, Отказ, Реквизиты.Организация, ТаблицаПеречислениеНалогов);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПеречисленныйНалогРегистратораПоФизическимЛицам(Регистратор) Экспорт
	
	Если Год(Регистратор.Дата) > 2014 Тогда
		Возврат УчетНДФЛ.ПеречисленныйНалогРегистратораПоФизическимЛицам(Регистратор);
	Иначе
		ПустаяТаблица = Новый ТаблицаЗначений;
		ПустаяТаблица.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
		ПустаяТаблица.Колонки.Добавить("Сумма",          ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
		Возврат ПустаяТаблица;
	КонецЕсли;
	
КонецФункции

Функция СтрокаУплатыНалоговогоАгента(Движения, Организация, ДатаОперации, ВидДвижения, ДанныеДокумента)
	
	НоваяСтрока = Движения.УплатаНДФЛНалоговымиАгентамиКРаспределению.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеДокумента);
	НоваяСтрока.ВидДвижения = ВидДвижения;
	НоваяСтрока.Организация = Организация;
	НоваяСтрока.Период = ДатаОперации;
	Если НоваяСтрока.МесяцНалоговогоПериода >= '20150101' Тогда
		НоваяСтрока.МесяцНалоговогоПериода = '00010101'
	КонецЕсли;
	
    Возврат НоваяСтрока
	
КонецФункции

#КонецОбласти

#Область ВозвратВозмещениеНалоговВзносов

Функция ПодготовитьПараметрыВозвратаНалоговИВзносовСФОТ(ТаблицаВозвратНалогов, ТаблицаРеквизиты)

	Параметры = Новый Структура;
	
	// Подготовка таблицы Параметры.Реквизиты
	
	СписокОбязательныхКолонок = ""
	+ "Период,"                    // <Дата> - период движений - дата документа
	+ "Регистратор,"               // <ДокументСсылка>
	+ "Организация";               // <СправочникСсылка.Организации>
	
	
	Параметры.Вставить("Реквизиты", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ТаблицаРеквизиты, СписокОбязательныхКолонок));
	
	// Подготовка таблицы Параметры.ТаблицаПеречислениеНалогов
	
	СписокОбязательныхКолонок = ""
	+ "СчетКт,"                 // <ПланСчетовСсылка.Хозрасчетный> - счет учета налогов и взносов с ФОТ
	+ "СубконтоКт1,"            // <ПланВидовХарактеристик.ВидыСубконтоХозрасчетные>
	+ "СубконтоКт2,"            // <ПланВидовХарактеристик.ВидыСубконтоХозрасчетные>     
	+ "СубконтоКт3,"            // <ПланВидовХарактеристик.ВидыСубконтоХозрасчетные>
	+ "СуммаРуб";               // <Число,15,2> - сумма налога, взноса
	
	Параметры.Вставить("ТаблицаВозвратНалогов", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ТаблицаВозвратНалогов, СписокОбязательныхКолонок));
	
	Возврат Параметры;

КонецФункции

Процедура СформироватьДвиженияПоВозвратамНалоговИВзносовСФОТ(ТаблицаВозвратНалогов, ТаблицаРеквизиты, Движения, Отказ) Экспорт
	
	// Блок находится в разработке
	
	Параметры = ПодготовитьПараметрыВозвратаНалоговИВзносовСФОТ(ТаблицаВозвратНалогов, ТаблицаРеквизиты);
	
	Реквизиты = Параметры.Реквизиты[0];
	
	Если Параметры.ТаблицаВозвратНалогов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СуммаНалога = Параметры.ТаблицаВозвратНалогов.Итог("СуммаРуб");
	
	Если СуммаНалога = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИспользоватьНачислениеЗарплаты = ПолучитьФункциональнуюОпцию("ИспользоватьНачислениеЗарплаты");
	
	СчетаУчетаРасчетовСФСС = Новый Соответствие;
	СчетаУчетаРасчетовСФСС.Вставить(ПланыСчетов.Хозрасчетный.ФСС,             Перечисления.ВидыОбязательногоСтрахованияСотрудников.ФСС);
	СчетаУчетаРасчетовСФСС.Вставить(ПланыСчетов.Хозрасчетный.ФСС_НСиПЗ,       Перечисления.ВидыОбязательногоСтрахованияСотрудников.ФССНесчастныеСлучаи);
	
	Если ИспользоватьНачислениеЗарплаты Тогда
		
		ПромежуточнаяТаблица   = Параметры.ТаблицаВозвратНалогов.Скопировать();
		
		ТаблицаВозвратНалогов = Новый ТаблицаЗначений;
		ТаблицаВозвратНалогов.Колонки.Добавить("Период");
		ТаблицаВозвратНалогов.Колонки.Добавить("ВидОбязательногоСтрахованияСотрудников");
		ТаблицаВозвратНалогов.Колонки.Добавить("ЭтоСтраховыеВзносы");
		ТаблицаВозвратНалогов.Колонки.Добавить("Сумма");
		
		// возмещение расходов по соц.страхованию
		Для Каждого СтрокаТаблицы ИЗ ПромежуточнаяТаблица Цикл
			ВидОбязательногоСтрахованияСотрудников = СчетаУчетаРасчетовСФСС.Получить(СтрокаТаблицы.СчетКт);
			Если ВидОбязательногоСтрахованияСотрудников <> Неопределено Тогда
				Если Реквизиты.Период < ДатаНачалаАдминистрированияСтраховыхВзносовФНС()
					И (СтрокаТаблицы.СубконтоКт1 = Перечисления.ВидыПлатежейВГосБюджет.ПолученоИзФонда
					ИЛИ СтрокаТаблицы.СубконтоКт1 = Перечисления.ВидыПлатежейВГосБюджет.РасходыПоСтрахованию) Тогда
					НоваяСтрока = ТаблицаВозвратНалогов.Добавить();
					НоваяСтрока.Период = Реквизиты.Период;
					НоваяСтрока.ВидОбязательногоСтрахованияСотрудников = ВидОбязательногоСтрахованияСотрудников;
					НоваяСтрока.ЭтоСтраховыеВзносы = Истина;
					НоваяСтрока.Сумма = СтрокаТаблицы.СуммаРуб;
				ИначеЕсли Реквизиты.Период >= ДатаНачалаАдминистрированияСтраховыхВзносовФНС()
					И СтрокаТаблицы.СубконтоКт1 = Перечисления.ВидыПлатежейВГосБюджет.Налог Тогда
					НоваяСтрока = ТаблицаВозвратНалогов.Добавить();
					НоваяСтрока.Период = Реквизиты.Период;
					НоваяСтрока.ВидОбязательногоСтрахованияСотрудников = ВидОбязательногоСтрахованияСотрудников;
					НоваяСтрока.ЭтоСтраховыеВзносы = Истина;
					НоваяСтрока.Сумма = СтрокаТаблицы.СуммаРуб;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
				
		Если ТаблицаВозвратНалогов.Количество() <> 0 Тогда
			УчетСтраховыхВзносов.СформироватьВозмещениеРасходовПоСоциальномуСтрахованию(Движения, Отказ, Реквизиты.Организация, ТаблицаВозвратНалогов);
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область РегистрацияРасчетовПоНалогамВзносамДокументами_ВНО_Операция_пр

Функция ПодготовитьПараметрыПроведенияОстатки_РасчетыПоНалогамИСборам(
			ТаблицаРасчетыПоНалогамИСборам,
			ТаблицаРеквизиты)

	Параметры = Новый Структура;

	// Подготовка таблицы Параметры.ТаблицаРасчетыПоНалогамИСборам

	СписокОбязательныхКолонок = ""
	+ "Период,"               // <Дата>
	+ "СчетУчета,"            // <План счетов бухгалтерского учета>
	+ "ВидПлатежаВБюджет,"    // <ПеречислениеСсылка.Виды платежей в бюджет (фонды)>
	+ "Сумма,"                // <Число (15,2)>
	+ "СуммаКт,"              // <Число (15,2)>
	+ "РегистрацияВНалоговомОргане";     // <СправочникСсылка.РегистрацииВНалоговомОргане>

	Параметры.Вставить("ТаблицаРасчетыПоНалогамИСборам",
		ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(ТаблицаРасчетыПоНалогамИСборам, СписокОбязательныхКолонок));

	// Подготовка таблицы Параметры.Реквизиты

	СписокОбязательныхКолонок = ""
	+ "Период,"                         // <Дата> - период движений - дата документа
	+ "Организация,"                    // <СправочникСсылка.Организации>
	+ "ПодразделениеОрганизации,"       // <СправочникСсылка.ПодразделенияОрганизации>
	+ "РазделУчета,"                    // <ПеречислениеСсылка.РазделыУчетаДляВводаОстатков>
	+ "ОтражатьВБухгалтерскомУчете,"    // <Булево>
	+ "ОтражатьВНалоговомУчете,"        // <Булево>
	+ "ОтражатьПоСпециальнымРегистрам"; // <Булево>

	Параметры.Вставить("Реквизиты",
		ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(ТаблицаРеквизиты, СписокОбязательныхКолонок));

	Возврат Параметры;

КонецФункции

Процедура СформироватьОстатки_РасчетыПоНалогамИСборам(ПараметрыПроведения, ТаблицаРеквизиты, Движения, Отказ) Экспорт
	
	// Блок находится в разработке
	Если ПараметрыПроведения.Реквизиты[0].РазделУчета <> Перечисления.РазделыУчетаДляВводаОстатков.РасчетыПоНалогамИСборам Тогда
		Возврат;
	КонецЕсли;
	
	Параметры = ПодготовитьПараметрыПроведенияОстатки_РасчетыПоНалогамИСборам(
		ПараметрыПроведения.ТаблицаРасчетыПоНалогамИСборам,
		ТаблицаРеквизиты);
		
	Реквизиты = Параметры.Реквизиты[0];
	
	Если НЕ Реквизиты.ОтражатьПоСпециальнымРегистрам Тогда
		Возврат;
	КонецЕсли;

    ПромежуточнаяТаблица = Параметры.ТаблицаРасчетыПоНалогамИСборам;
	
	Если ПромежуточнаяТаблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИспользоватьНачислениеЗарплаты = ПолучитьФункциональнуюОпцию("ИспользоватьНачислениеЗарплаты");
	
	Если ИспользоватьНачислениеЗарплаты Тогда
				
		// регистрация расчетов с фондами
				
		ТаблицаРасчетовСФондами = Новый ТаблицаЗначений;
		ТаблицаРасчетовСФондами.Колонки.Добавить("Период");
		ТаблицаРасчетовСФондами.Колонки.Добавить("ВидОбязательногоСтрахованияСотрудников");
		ТаблицаРасчетовСФондами.Колонки.Добавить("ЭтоСтраховыеВзносы");
		ТаблицаРасчетовСФондами.Колонки.Добавить("ГодЗадолженностиПоЕСН");
		ТаблицаРасчетовСФондами.Колонки.Добавить("ВидДвижения");
		ТаблицаРасчетовСФондами.Колонки.Добавить("РасчетыПоПособиям");
		ТаблицаРасчетовСФондами.Колонки.Добавить("Сумма");
		
		СчетаУчетаНалоговВзносовСФОТ = Новый Соответствие;
		СчетаУчетаНалоговВзносовСФОТ.Вставить(ПланыСчетов.Хозрасчетный.ПФР_нак,         Перечисления.ВидыОбязательногоСтрахованияСотрудников.ПФРНакопительная);
		СчетаУчетаНалоговВзносовСФОТ.Вставить(ПланыСчетов.Хозрасчетный.ПФР_страх,       Перечисления.ВидыОбязательногоСтрахованияСотрудников.ПФРСтраховая);
		СчетаУчетаНалоговВзносовСФОТ.Вставить(ПланыСчетов.Хозрасчетный.ПФР_доп,         Перечисления.ВидыОбязательногоСтрахованияСотрудников.ДоплатаКПенсииЛетчикам);
		СчетаУчетаНалоговВзносовСФОТ.Вставить(ПланыСчетов.Хозрасчетный.ПФР_доп_шахтеры, Перечисления.ВидыОбязательногоСтрахованияСотрудников.ДоплатаКПенсииШахтерам);
		СчетаУчетаНалоговВзносовСФОТ.Вставить(ПланыСчетов.Хозрасчетный.ФСС,             Перечисления.ВидыОбязательногоСтрахованияСотрудников.ФСС);
		СчетаУчетаНалоговВзносовСФОТ.Вставить(ПланыСчетов.Хозрасчетный.ФСС_НСиПЗ,       Перечисления.ВидыОбязательногоСтрахованияСотрудников.ФССНесчастныеСлучаи);
		СчетаУчетаНалоговВзносовСФОТ.Вставить(ПланыСчетов.Хозрасчетный.ФФОМС,           Перечисления.ВидыОбязательногоСтрахованияСотрудников.ФФОМС);
		СчетаУчетаНалоговВзносовСФОТ.Вставить(ПланыСчетов.Хозрасчетный.ТФОМС,           Перечисления.ВидыОбязательногоСтрахованияСотрудников.ТФОМС);
		СчетаУчетаНалоговВзносовСФОТ.Вставить(ПланыСчетов.Хозрасчетный.ПФР_ОПС,         Перечисления.ВидыОбязательногоСтрахованияСотрудников.ПФРПоСуммарномуТарифу);
		
		СчетаУчетаРасчетовСФСС = Новый Соответствие;
		СчетаУчетаРасчетовСФСС.Вставить(ПланыСчетов.Хозрасчетный.ФСС,       Перечисления.ВидыОбязательногоСтрахованияСотрудников.ФСС);
		СчетаУчетаРасчетовСФСС.Вставить(ПланыСчетов.Хозрасчетный.ФСС_НСиПЗ, Перечисления.ВидыОбязательногоСтрахованияСотрудников.ФССНесчастныеСлучаи);
		
		ВидыРасчетовПоСредствамФСС = Новый Соответствие;
		ВидыРасчетовПоСредствамФСС.Вставить(Перечисления.ВидыПлатежейВГосБюджет.РасходыПоСтрахованию, Перечисления.ВидыРасчетовПоСредствамФСС.РасходыПоСтрахованию);
		ВидыРасчетовПоСредствамФСС.Вставить(Перечисления.ВидыПлатежейВГосБюджет.ПолученоИзФонда,      Перечисления.ВидыРасчетовПоСредствамФСС.ПолученоИзФонда);
		ВидыРасчетовПоСредствамФСС.Вставить(Перечисления.ВидыПлатежейВГосБюджет.НеПринято,            Перечисления.ВидыРасчетовПоСредствамФСС.НеПринято);
		
		Для Каждого СтрокаТаблицы ИЗ ПромежуточнаяТаблица Цикл			
			ВидОбязательногоСтрахованияСотрудников = СчетаУчетаНалоговВзносовСФОТ.Получить(СтрокаТаблицы.СчетУчета);
			Если ВидОбязательногоСтрахованияСотрудников <> Неопределено Тогда
				Если (СтрокаТаблицы.ВидПлатежаВБюджет = Перечисления.ВидыПлатежейВГосБюджет.Налог)
					ИЛИ (СтрокаТаблицы.ВидПлатежаВБюджет = Перечисления.ВидыПлатежейВГосБюджет.НалогСам)
					ИЛИ (СтрокаТаблицы.ВидПлатежаВБюджет = Перечисления.ВидыПлатежейВГосБюджет.ПолученоИзФонда)
					ИЛИ (СтрокаТаблицы.ВидПлатежаВБюджет = Перечисления.ВидыПлатежейВГосБюджет.РасходыПоСтрахованию) Тогда
					
					НоваяСтрока = ТаблицаРасчетовСФондами.Добавить();
					НоваяСтрока.Период = СтрокаТаблицы.Период;
					НоваяСтрока.ВидОбязательногоСтрахованияСотрудников = ВидОбязательногоСтрахованияСотрудников;
					НоваяСтрока.ЭтоСтраховыеВзносы = ?(СтрокаТаблицы.Период >= Дата('20100101'),Истина, Ложь);				
					Если НЕ НоваяСтрока.ЭтоСтраховыеВзносы Тогда
						НоваяСтрока.ГодЗадолженностиПоЕСН = Год(СтрокаТаблицы.Период);
					КонецЕсли;					
					Если СтрокаТаблицы.СуммаКт <> 0 Тогда
						НоваяСтрока.Сумма = СтрокаТаблицы.СуммаКт;
						НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
					Иначе
						НоваяСтрока.Сумма = СтрокаТаблицы.Сумма;			
						НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
					КонецЕсли;
					
					Если СчетаУчетаНалоговВзносовСФОТ.Получить(СтрокаТаблицы.СчетУчета) <> Неопределено Тогда
						РасчетыПоПособиям = ВидыРасчетовПоСредствамФСС.Получить(СтрокаТаблицы.ВидПлатежаВБюджет);
						Если РасчетыПоПособиям <> Неопределено Тогда
							НоваяСтрока.РасчетыПоПособиям = РасчетыПоПособиям;
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если ТаблицаРасчетовСФондами.Количество() <> 0 Тогда
			УчетСтраховыхВзносов.СформироватьРасчетыСФондом(Движения, Отказ, Реквизиты.Организация, ТаблицаРасчетовСФондами);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ВспомогательныеДанныеДляОтраженияЗарплатыВУчете

// Процедура дополняет таблицу выплат, полученную из подсистемы учета зарплаты
// колконками, в которых будет храниться необходимая для формирования проводок 
// информация
//
// Параметры:
//	ВыплатаЗарплаты - таблица значений
//
Процедура ПодготовитьТаблицуВыплатыЗарплаты(ВыплатаЗарплаты) Экспорт
	
	//ВыплатаЗарплаты.Колонки.Добавить("Подразделение");	
	ВыплатаЗарплаты.Колонки.Добавить("СтатьяДвиженияДенежныхСредств");
	ВыплатаЗарплаты.Колонки.Добавить("БанковскийСчет");
	ВыплатаЗарплаты.Колонки.Добавить("Касса");
	ВыплатаЗарплаты.Колонки.Добавить("СчетУчета");
	ВыплатаЗарплаты.Колонки.Добавить("СчетУчетаКомпенсации");
	ВыплатаЗарплаты.Колонки.Добавить("СубконтоУчетаКомпенсации1");
	ВыплатаЗарплаты.Колонки.Добавить("СубконтоУчетаКомпенсации2");
	ВыплатаЗарплаты.Колонки.Добавить("СубконтоУчетаКомпенсации3");
	ВыплатаЗарплаты.Колонки.Добавить("ПодразделениеУчетаКомпенсации");	
	ВыплатаЗарплаты.Колонки.Добавить("ИспользуетсяЭлектронныйОбмен", Новый ОписаниеТипов("Булево"));	
	ВыплатаЗарплаты.Колонки.Добавить("ПодразделениеУчетаНачислений");
	
КонецПроцедуры

// Функция формирует таблицу выплаты зарплаты для передачи в подсистему УСН
//
Функция ПолучитьТаблицуВыплатыЗарплатыДляУСН(ВыплатаЗарплаты) Экспорт
	
	ВедетсяУчетРасчетовПоЗарплатеСводно   = Константы.ВедетсяУчетРасчетовПоЗарплатеСводно.Получить();
	УчетЗарплатыИКадровВоВнешнейПрограмме = Константы.УчетЗарплатыИКадровВоВнешнейПрограмме.Получить();
	

	ТаблицаВыплатаЗарплаты = Новый ТаблицаЗначений;
	ТаблицаВыплатаЗарплаты.Колонки.Добавить("Работник");	
	ТаблицаВыплатаЗарплаты.Колонки.Добавить("Сделка");
	ТаблицаВыплатаЗарплаты.Колонки.Добавить("КурсВзаиморасчетов");
	ТаблицаВыплатаЗарплаты.Колонки.Добавить("КратностьВзаиморасчетов");
	ТаблицаВыплатаЗарплаты.Колонки.Добавить("Сумма");
	
	Если ВедетсяУчетРасчетовПоЗарплатеСводно И УчетЗарплатыИКадровВоВнешнейПрограмме ИЛИ ВыплатаЗарплаты = Неопределено Тогда
		Возврат ТаблицаВыплатаЗарплаты;
	КонецЕсли;
		
	Для каждого СтрокаТаблицы Из ВыплатаЗарплаты Цикл
		
		НоваяСтрока = ТаблицаВыплатаЗарплаты.Добавить();
		НоваяСтрока.Работник                = СтрокаТаблицы.ФизическоеЛицо;
		НоваяСтрока.Сделка                  = Неопределено;
		НоваяСтрока.КурсВзаиморасчетов      = 1;
		НоваяСтрока.КратностьВзаиморасчетов = 1;
		НоваяСтрока.Сумма                   = СтрокаТаблицы.СуммаКВыплате;
		
	КонецЦикла;
	
	ТаблицаВыплатаЗарплаты.Свернуть("Работник, Сделка, КурсВзаиморасчетов, КратностьВзаиморасчетов", "Сумма");
	
	Возврат ТаблицаВыплатаЗарплаты;
	
КонецФункции

#КонецОбласти

#Область ДанныеДокументовПодсистемыЗарплата

Функция ПолучитьДанныеВедомостейДляОплатыТаблично(Регистратор = Неопределено, Ведомости, ФизическиеЛица = Неопределено, Оплаченные = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТаблицаВедомостей = ВзаиморасчетыССотрудниками.ДанныеВедомостейДляОплатыДокументом(Регистратор, Ведомости, ФизическиеЛица, Оплаченные);
	
	УчитыватьКомпенсациюЗаЗадержкуЗарплаты = Ложь;
	
	Если Константы.УчетЗарплатыИКадровВоВнешнейПрограмме.Получить() Тогда
		Если ЗначениеЗаполнено(Регистратор) Тогда
			Организация = Регистратор.Организация;
			Период		= Регистратор.Дата;
		Иначе
			Организация = Ведомости[0].Организация;
			Период		= Ведомости[0].Дата;
		КонецЕсли;
		УчитыватьКомпенсациюЗаЗадержкуЗарплаты = ПолучитьФункциональнуюОпцию("ИспользоватьФорматОбменаЗУП25", Новый Структура("Организация", Организация));
	КонецЕсли;
	
	Если НЕ УчитыватьКомпенсациюЗаЗадержкуЗарплаты Тогда
		Для Каждого СтрокаТаблицы Из ТаблицаВедомостей Цикл
			СтрокаТаблицы.СуммаКВыплате = СтрокаТаблицы.СуммаКВыплате + СтрокаТаблицы.КомпенсацияЗаЗадержкуЗарплаты;
			СтрокаТаблицы.КомпенсацияЗаЗадержкуЗарплаты = 0;
		КонецЦикла;
	КонецЕсли;
	
	ВестиУчетНачисленияЗаработнойПлатыВРазрезеПодразделений	= ВестиУчетНачисленияЗаработнойПлатыВРазрезеПодразделений(Организация, Период);
	Если НЕ ВестиУчетНачисленияЗаработнойПлатыВРазрезеПодразделений Тогда
		ОсновноеПодразделение = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновноеПодразделениеОрганизации");
		// СС 20.12.2022
		// Чтобы не подставлять подразделение от другой организации
		Если ЗначениеЗаполнено(ОсновноеПодразделение) И ОсновноеПодразделение.Владелец = Организация Тогда
			ТаблицаВедомостей.ЗаполнитьЗначения(ОсновноеПодразделение, 	"Подразделение");
		КонецЕсли;
		//\
	КонецЕсли;

	ТаблицаВедомостей.Свернуть("Ведомость, ФизическоеЛицо, Подразделение", "СуммаКВыплате, МатериальнаяПомощь, КомпенсацияЗаЗадержкуЗарплаты");
	
	Возврат ТаблицаВедомостей;
	
КонецФункции

Функция НевыплаченныеДепоненты(Регистратор, Организация, ДатаВыплаты, ФизическиеЛица = Неопределено, ДепонированоДо = Неопределено) Экспорт

	Возврат УчетДепонированнойЗарплаты.ОстатокДепонированнойЗарплаты(Регистратор, Организация, ДатаВыплаты, ФизическиеЛица, ДепонированоДо);		                
	
КонецФункции

Функция ВыплачиватьКомпенсациюЗаЗадержкуЗарплаты(Организация, ДокументВыплаты, Ведомости, ФизическоеЛицо = Неопределено) Экспорт
	
	Если Не Константы.УчетЗарплатыИКадровВоВнешнейПрограмме.Получить() Тогда
		// В 1С:Бухгалтерии компенсация не может быть рассчитана
		Возврат Ложь;
	КонецЕсли;
	
	ИспользуетсяЗУП25 = ПолучитьФункциональнуюОпцию("ИспользоватьФорматОбменаЗУП25", Новый Структура("Организация", Организация));
	Если Не ИспользуетсяЗУП25 Тогда
		// Расчет компенсации выполняется в ЗУП 2.5
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеВедомостей = ПолучитьДанныеВедомостейДляОплатыТаблично(ДокументВыплаты, Ведомости, ФизическоеЛицо, Неопределено);
		
	Возврат ДанныеВедомостей.Итог("КомпенсацияЗаЗадержкуЗарплаты") <> 0;
	
КонецФункции

// Проверяет оплаченность расчетного документа.
//
// Параметры:
//  РасчетныйДокумент - ДокументСсылка (Отпуск, БольничныйЛист, НачислениеЗарплаты).
//
Функция МожноСоздатьВедомостиПоРасчетномуДокументу(РасчетныйДокумент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РасчетныйДокумент", РасчетныйДокумент);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗарплатаКВыплатеОстатки.СуммаКВыплатеОстаток
	|ИЗ
	|	РегистрНакопления.ЗарплатаКВыплате.Остатки(, ДокументОснование = &РасчетныйДокумент) КАК ЗарплатаКВыплатеОстатки
	|ГДЕ
	|	ЗарплатаКВыплатеОстатки.СуммаКВыплатеОстаток > 0";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой()Тогда
		ТекстСообщения = НСтр("ru = 'По документу нет сумм к выплате'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь
	КонецЕсли;
	
	Возврат Истина
	
КонецФункции

#КонецОбласти

#Область УчетЗарплатыВоВнешнейПрограмме

// Формирует движения по отражению зарплаты в бух. учете
Процедура СформироватьДвиженияОтраженияЗарплаты(ТаблицаОтраженияВУчете, ТаблицаРеквизиты, Движения, Отказ) Экспорт
	
	Параметры = ПодготовитьПараметрыДвиженийОтраженияЗарплаты(ТаблицаОтраженияВУчете, ТаблицаРеквизиты);
	Реквизиты = Параметры.Реквизиты[0];
	
	Если Параметры.ТаблицаОтраженияВУчете.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОтражатьВНалоговомУчете = УчетнаяПолитика.ПлательщикНалогаНаПрибыль(Реквизиты.Организация, Реквизиты.Период);
	ПоддержкаПБУ18          = УчетнаяПолитика.ПоддержкаПБУ18(Реквизиты.Организация, Реквизиты.Период);
	
	ТаблицаОтраженияВУчете = Параметры.ТаблицаОтраженияВУчете;

	Для Каждого СтрокаТаблицы из ТаблицаОтраженияВУчете Цикл
		
		Проводка = Движения.ЕПС.Добавить();
		Проводка.Организация	= Реквизиты.Организация;
		Проводка.Период			= Реквизиты.Период;
		
		Проводка.СчетДт	= СтрокаТаблицы.СчетДт;
		
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТаблицы.СубконтоДт1);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТаблицы.СубконтоДт2);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТаблицы.СубконтоДт3);
		
		Если СтрокаТаблицы.УчетПоПодразделениямДт Тогда
			Проводка.ПодразделениеДт = СтрокаТаблицы.ПодразделениеДт;
		КонецЕсли;
		
		Проводка.СчетКт	= СтрокаТаблицы.СчетКт;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаТаблицы.СубконтоКт1);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаТаблицы.СубконтоКт2);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтрокаТаблицы.СубконтоКт3);
		
		Если СтрокаТаблицы.УчетПоПодразделениямКт Тогда
			Проводка.ПодразделениеКт = СтрокаТаблицы.ПодразделениеКт;
		КонецЕсли;
		
		Проводка.Сумма = СтрокаТаблицы.Сумма;
		
		Если ОтражатьВНалоговомУчете Тогда
			НалоговыйУчет.ЗаполнитьНалоговыеСуммыПроводки(СтрокаТаблицы.СуммаНУДт, СтрокаТаблицы.СуммаНУКт, СтрокаТаблицы.СуммаПРДт, СтрокаТаблицы.СуммаПРКт, СтрокаТаблицы.СуммаВРДт, СтрокаТаблицы.СуммаВРКт , Проводка, ПоддержкаПБУ18);
		КонецЕсли;
		
		Проводка.Содержание = СтрокаТаблицы.Содержание;
		
	КонецЦикла;
	
	Движения.ЕПС.Записывать = Истина;
	
КонецПроцедуры

Функция ПодготовитьПараметрыДвиженийОтраженияЗарплаты(ТаблицаОтраженияВУчете, ТаблицаРеквизиты)
	
	Параметры = Новый Структура;
	
	// Подготовка таблицы шапки документа
	СписокОбязательныхКолонок = ""
	+ "Период,"			// <Дата> - счет по дебету проводки (счет учета денежных средств)
	+ "Организация"		// <СправочникСсылка.Организации> - организация документа
	;
	
	Параметры.Вставить("Реквизиты", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(ТаблицаРеквизиты, СписокОбязательныхКолонок));
	
	
	// Подготовка таблицы по заработной плате:
	СписокОбязательныхКолонок = ""
	+ "СчетДт,"						// <ПланСчетовСсылка.Хозрасчетный>
	+ "ПодразделениеДт,"			// <Ссылка на справочник подразделений>
	+ "УчетПоПодразделениямДт,"		// Булево - признак учета по подразделениям счета Дт
	+ "СубконтоДт1,"				// <> - значение аналитики 
	+ "СубконтоДт2,"				// <> - значение аналитики 
	+ "СубконтоДт3,"				// <> - значение аналитики
	+ "СчетКт,"						// <ПланСчетовСсылка.Хозрасчетный>
	+ "УчетПоПодразделениямКт,"		// Булево - признак учета по подразделениям счета Кт
	+ "ПодразделениеКт,"			// <Ссылка на справочник подразделений>
	+ "СубконтоКт1,"				// <> - значение аналитики 
	+ "СубконтоКт2,"				// <> - значение аналитики 
	+ "СубконтоКт3,"				// <> - значение аналитики	
	+ "Содержание,"					// Строка - содержание проводки
	+ "Сумма,"						// <Число(15,2)>
	+ "СуммаНУДт,"					// <Число(15,2)>
	+ "СуммаПРДт,"					// <Число(15,2)>
	+ "СуммаВРДт,"					// <Число(15,2)>
	+ "СуммаНУКт,"					// <Число(15,2)>
	+ "СуммаПРКт,"					// <Число(15,2)>
	+ "СуммаВРКт"					// <Число(15,2)>
	;	
	
	Параметры.Вставить("ТаблицаОтраженияВУчете", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(ТаблицаОтраженияВУчете, СписокОбязательныхКолонок));

	Возврат Параметры;

КонецФункции

// Формирует движения по отражению зарплаты для ИП
Процедура СформироватьДвиженияОтраженияЗарплатыИП(ТаблицаОтраженияЗарплатыИП, ТаблицаРеквизиты, Движения, Отказ) Экспорт
	
	Параметры = ПодготовитьПараметрыДвиженийОтраженияЗарплатыИП(ТаблицаОтраженияЗарплатыИП, ТаблицаРеквизиты);
	Реквизиты = Параметры.Реквизиты[0];
	
	Если Параметры.ТаблицаОтраженияЗарплатыИП.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	ВедетсяУчетРасчетовПоЗарплатеСводно   = Константы.ВедетсяУчетРасчетовПоЗарплатеСводно.Получить();
	УчетЗарплатыИКадровВоВнешнейПрограмме = Константы.УчетЗарплатыИКадровВоВнешнейПрограмме.Получить();
	
	ТаблицаОтраженияЗарплатыИП = Параметры.ТаблицаОтраженияЗарплатыИП;
	
	Если  ВедетсяУчетРасчетовПоЗарплатеСводно И УчетЗарплатыИКадровВоВнешнейПрограмме Тогда
		СтрокиКУдалению = Новый Массив();
		Для Каждого СтрокаТаблицы ИЗ ТаблицаОтраженияЗарплатыИП	Цикл		
			Если СтрокаТаблицы.КорСчет = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда Тогда
				СтрокиКУдалению.Добавить(СтрокаТаблицы);				
			КонецЕсли;
		КонецЦикла;
		
		Если СтрокиКУдалению.Количество() > 0 Тогда
			Для каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
				ТаблицаОтраженияЗарплатыИП.Удалить(СтрокаКУдалению);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Реквизиты.Колонки.Найти("Удержания") = Неопределено Тогда
		Параметры.Реквизиты.Колонки.Добавить("Удержания");
		Параметры.Реквизиты.ЗаполнитьЗначения(Ложь, "Удержания");
	КонецЕсли;
	
	Параметры.Вставить("ТаблицаНачисленияУдержания", ТаблицаОтраженияЗарплатыИП);
	
	УчетДоходовИРасходовПредпринимателя.СформироватьДвиженияРасходовНаОплатуТруда(Параметры, Движения, Отказ);

КонецПроцедуры

Процедура ЗаполнитьНедостающиеРеквизитыЗагруженныхОбъектов(Элемент) Экспорт
	
	Если ТипЗнч(Элемент) = Тип("СправочникСсылка.СтатьиЗатрат")
		ИЛИ ТипЗнч(Элемент) = Тип("СправочникОбъект.СтатьиЗатрат") Тогда
		Если НЕ ЗначениеЗаполнено(Элемент.ВидДеятельностиДляНалоговогоУчетаЗатрат) Тогда
			Если ТипЗнч(Элемент) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
				Объект = Элемент.ПолучитьОбъект();
			Иначе
				Объект = Элемент;
			КонецЕсли;
			
			Если Объект.ЭтоГруппа Тогда
				Возврат;
			КонецЕсли;
			
			Объект.ВидДеятельностиДляНалоговогоУчетаЗатрат = Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения;
			Объект.ОбменДанными.Загрузка = Истина;
			Объект.Записать();
			Возврат;			
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(Элемент) = Тип("СправочникСсылка.ПрочиеДоходыИРасходы")
		ИЛИ ТипЗнч(Элемент) = Тип("СправочникОбъект.ПрочиеДоходыИРасходы") Тогда
		Если НЕ ЗначениеЗаполнено(Элемент.ВидДеятельностиДляНалоговогоУчетаЗатрат) Тогда
			Если ТипЗнч(Элемент) = Тип("СправочникСсылка.ПрочиеДоходыИРасходы") Тогда
				Объект = Элемент.ПолучитьОбъект();
			Иначе
				Объект = Элемент;
			КонецЕсли;
			                                          
			Если Объект.ЭтоГруппа Тогда
				Возврат;
			КонецЕсли;
						
			Объект.ВидДеятельностиДляНалоговогоУчетаЗатрат = Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения;
			Объект.ОбменДанными.Загрузка = Истина;
			Объект.Записать();
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиУчетЗарплаты

// Обработчик подписки на событие ПроверитьНеобходимостьИспользованияПодсистемыЗарплатаИКадры.
// Вызывается при записи элемента справочника "Организации".
//
Процедура ПроверитьНеобходимостьИспользованияПодсистемыЗарплатаИКадры(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;

	ТребуетсяСоздатьПоставляемыеВидыНалогов = Истина;
	Если Источник.ДополнительныеСвойства.Свойство("ТребуетсяСоздатьПоставляемыеВидыНалогов") Тогда
		ТребуетсяСоздатьПоставляемыеВидыНалогов = Источник.ДополнительныеСвойства.ТребуетсяСоздатьПоставляемыеВидыНалогов;
	КонецЕсли;
	
	Если Источник.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо 
		ИЛИ ИПИспользуетТрудНаемныхРаботников(Источник) Тогда
		Если НЕ ИспользуетсяПодсистемаУчетаЗарплатыИКадров() Тогда
			ВключитьПодсистемуУчетаЗарплатыИКадров(ТребуетсяСоздатьПоставляемыеВидыНалогов);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ИспользуетсяПодсистемаУчетаЗарплатыИКадров() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
		
	Если Константы.УчетЗарплатыИКадровВоВнешнейПрограмме.Получить()
		ИЛИ Константы.УчетЗарплатыИКадровСредствамиБухгалтерии.Получить() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
		
КонецФункции

// Отключается подсистема учета зарплаты и кадров при первом запуске
//
Процедура ОтключитьПодсистемуУчетаЗарплатыИКадров() Экспорт
		
	УстановитьПривилегированныйРежим(Истина);
	
	// Отключение подсистемы	
	Константы.ОтображатьПодсистемуСотрудникиИЗарплата82.Установить(Ложь);
	Константы.ОтображатьПодсистемуЗарплатаИКадры.Установить(Ложь);
	Константы.ОтображатьПодсистемуСотрудники.Установить(Ложь);
		
	МенеджерЗначенияКонстанты = Константы.УчетЗарплатыИКадровСредствамиБухгалтерии.СоздатьМенеджерЗначения();
	МенеджерЗначенияКонстанты.Значение = Ложь;
	МенеджерЗначенияКонстанты.ОбменДанными.Загрузка = Истина;
	МенеджерЗначенияКонстанты.Записать();
	
	МенеджерЗначенияКонстанты = Константы.УчетЗарплатыИКадровВоВнешнейПрограмме.СоздатьМенеджерЗначения();
	МенеджерЗначенияКонстанты.Значение = Ложь;
	МенеджерЗначенияКонстанты.ОбменДанными.Загрузка = Истина;
	МенеджерЗначенияКонстанты.Записать();
	
	Константы.ИспользоватьНачислениеЗарплаты.Установить(Ложь);
	Константы.ИспользоватьКадровыйУчет.Установить(Ложь);
	Константы.РасчетЗарплатыДляНебольшихОрганизаций.Установить(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Организация
	|ИЗ
	|	Справочник.Организации КАК Организации";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	Иначе
		Выборка = Результат.Выбрать();
	КонецЕсли;
	
	ОтражениеВРегламентированномУчетеНастройкиОрганизаций = РегистрыСведений.ОтражениеВРегламентированномУчетеНастройкиОрганизаций.СоздатьМенеджерЗаписи();
	УчетнаяПолитикаПоНДФЛ  = РегистрыСведений.УчетнаяПолитикаПоНДФЛ.СоздатьМенеджерЗаписи();
	
	НастройкиУчетаЗарплаты  = РегистрыСведений.НастройкиУчетаЗарплаты.СоздатьМенеджерЗаписи();
	
	Пока Выборка.Следующий() Цикл
		ОтражениеВРегламентированномУчетеНастройкиОрганизаций.Организация = Выборка.Организация;
		ОтражениеВРегламентированномУчетеНастройкиОрганизаций.Прочитать();
		ОтражениеВРегламентированномУчетеНастройкиОрганизаций.Организация = Выборка.Организация;
		ОтражениеВРегламентированномУчетеНастройкиОрганизаций.ФормироватьПроводкиВКонцеПериода = Ложь;
		ОтражениеВРегламентированномУчетеНастройкиОрганизаций.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ВключитьПодсистемуУчетаЗарплатыИКадров(ТребуетсяСоздатьПоставляемыеВидыНалогов = Истина) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Константы.ОтображатьПодсистемуСотрудникиИЗарплата82.Установить(Константы.ИнтерфейсВерсии82.Получить());
	Константы.ОтображатьПодсистемуЗарплатаИКадры.Установить(Константы.ИнтерфейсТакси.Получить());
	Константы.ОтображатьПодсистемуСотрудники.Установить(Константы.ИнтерфейсТаксиПростой.Получить());
	
	Константы.УчетЗарплатыИКадровСредствамиБухгалтерии.Установить(Истина);
	Если НЕ ОбщегоНазначенияБП.ДоступенПростойИнтерфейс() Тогда
		Константы.ИспользоватьКадровыйУчет.Установить(Истина);
		Константы.ПоддержкаСовместительства.Установить(Истина);
	КонецЕсли;
	УстановитьНастройкиУчетаЗарплаты(Ложь);
	Константы.РасчетЗарплатыДляНебольшихОрганизаций.Установить(Константы.ИспользоватьНачислениеЗарплаты.Получить());
	
	Справочники.ПрочиеДоходыИРасходы.СоздатьУстановитьПредопределенныеЭлементыДляУчетаЗарплаты();
	
	Если ТребуетсяСоздатьПоставляемыеВидыНалогов Тогда
		Справочники.ВидыНалоговИПлатежейВБюджет.СоздатьПоставляемыеЭлементы();
	КонецЕсли;
	
КонецПроцедуры

// Обработчик обновления
// Определеляет необходимость использования подсистемы учета зарплаты и кадров
// Если подсистема не требуется - она отключается
//
Процедура НастроитьПодсистемуЗарплатаИКадры() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Организации.Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
	|	И ВЫБОР
	|			КОГДА Организации.РегистрационныйНомерПФР = """"
	|					И Организации.КодОрганаПФР = """"
	|					И Организации.РегистрационныйНомерТФОМС = """"
	|					И Организации.РегистрационныйНомерФСС = """"
	|					И Организации.КодПодчиненностиФСС = """"
	|					И (ВЫРАЗИТЬ(Организации.НаименованиеТерриториальногоОрганаФСС КАК СТРОКА(1))) = """"
	|					И (ВЫРАЗИТЬ(Организации.НаименованиеТерриториальногоОрганаПФР КАК СТРОКА(1))) = """"
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Хозрасчетный.Организация
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Хозрасчетный.Организация
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ОтключитьПодсистемуУчетаЗарплатыИКадров();
	Иначе
		Константы.ОтображатьПодсистемуСотрудникиИЗарплата82.Установить(Константы.ИнтерфейсВерсии82.Получить());
		Константы.ОтображатьПодсистемуЗарплатаИКадры.Установить(Константы.ИнтерфейсТакси.Получить());
		Константы.ОтображатьПодсистемуСотрудники.Установить(Константы.ИнтерфейсТаксиПростой.Получить());
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьНастройкиУчетаЗарплаты(ВестиУчетЗарплатыИКадровВоВнешнейПрограмме) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Константы.ИспользоватьНачислениеЗарплаты.Установить(НЕ ВестиУчетЗарплатыИКадровВоВнешнейПрограмме);
	Если ВестиУчетЗарплатыИКадровВоВнешнейПрограмме Тогда
		Константы.ИспользоватьКадровыйУчет.Установить(Ложь);
		Константы.РасчетЗарплатыДляНебольшихОрганизаций.Установить(Ложь);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Организация
	|ИЗ
	|	Справочник.Организации КАК Организации";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	Иначе
		Выборка = Результат.Выбрать();
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		// Отражение в регламентированном учете.
		ОтражениеВРегламентированномУчетеНастройкиОрганизаций = РегистрыСведений.ОтражениеВРегламентированномУчетеНастройкиОрганизаций.СоздатьНаборЗаписей();
		ОтражениеВРегламентированномУчетеНастройкиОрганизаций.Отбор.Организация.Установить(Выборка.Организация);
		ОтражениеВРегламентированномУчетеНастройкиОрганизаций.Прочитать();
		
		Если ОтражениеВРегламентированномУчетеНастройкиОрганизаций.Количество() = 0 Тогда
			НоваяЗапись = ОтражениеВРегламентированномУчетеНастройкиОрганизаций.Добавить();
			НоваяЗапись.Организация = Выборка.Организация;
		КонецЕсли;
		
		Для Каждого Запись Из ОтражениеВРегламентированномУчетеНастройкиОрганизаций Цикл
			Запись.ФормироватьПроводкиВКонцеПериода = ВестиУчетЗарплатыИКадровВоВнешнейПрограмме;
		КонецЦикла;
		
		ОтражениеВРегламентированномУчетеНастройкиОрганизаций.Записать();
		
		Если НЕ ВестиУчетЗарплатыИКадровВоВнешнейПрограмме Тогда
			
			// Настройки учета зарплаты.
			НастройкиУчетаЗарплаты = РегистрыСведений.НастройкиУчетаЗарплаты.СоздатьНаборЗаписей();
			НастройкиУчетаЗарплаты.Отбор.Организация.Установить(Выборка.Организация);
			НастройкиУчетаЗарплаты.Прочитать();
			
			Если НастройкиУчетаЗарплаты.Количество() = 0 Тогда
				НоваяЗапись = НастройкиУчетаЗарплаты.Добавить();
				НоваяЗапись.Организация = Выборка.Организация;
				РегистрыСведений.НастройкиУчетаЗарплаты.ЗначенияНастройкиПоУмолчанию(НоваяЗапись);
			КонецЕсли;
			
			Для Каждого Запись Из НастройкиУчетаЗарплаты Цикл
				Запись.ИспользоватьФорматОбменаЗУП25 = Ложь;
			КонецЦикла;
				
			НастройкиУчетаЗарплаты.Записать();
			
			Если ОбщегоНазначенияБПВызовСервераПовтИсп.ГоловнаяОрганизация(Выборка.Организация) = Выборка.Организация Тогда
				
				// Учетная политика по НДФЛ.
				УчетнаяПолитикаПоНДФЛ = РегистрыСведений.УчетнаяПолитикаПоНДФЛ.СоздатьНаборЗаписей();
				УчетнаяПолитикаПоНДФЛ.Отбор.ГоловнаяОрганизация.Установить(Выборка.Организация);
				УчетнаяПолитикаПоНДФЛ.Прочитать();
				
				Если УчетнаяПолитикаПоНДФЛ.Количество() = 0 Тогда
					НоваяЗапись = УчетнаяПолитикаПоНДФЛ.Добавить();
					НоваяЗапись.ГоловнаяОрганизация = Выборка.Организация;
				КонецЕсли;
				
				Для Каждого Запись Из УчетнаяПолитикаПоНДФЛ Цикл
					Запись.ОсобенностиИсчисленияНДФЛ = Перечисления.ОсобенностиИсчисленияНДФЛ.СтандартныеВычетыНарастающимИтогом;
				КонецЦикла;
				
				УчетнаяПолитикаПоНДФЛ.Записать();
				
			КонецЕсли;
			
		Иначе
			
			// Учет страховых взносов.
			НастройкиУчетаСтраховыхВзносов = РегистрыСведений.НастройкиУчетаСтраховыхВзносов.СоздатьНаборЗаписей();
			НастройкиУчетаСтраховыхВзносов.Отбор.Организация.Установить(Выборка.Организация);
			НастройкиУчетаСтраховыхВзносов.Прочитать();
		
			Если НастройкиУчетаСтраховыхВзносов.Количество() = 0 Тогда
				НоваяЗапись = НастройкиУчетаСтраховыхВзносов.Добавить();
				НоваяЗапись.Организация = Выборка.Организация;
			КонецЕсли;
			
			Для Каждого Запись Из НастройкиУчетаСтраховыхВзносов Цикл
				Запись.ИспользуетсяТрудФармацевтов                        = Ложь;
				Запись.ИспользуетсяТрудЧленовЛетныхЭкипажей               = Ложь;
				Запись.ИспользуетсяТрудЧленовЭкипажейМорскихСудов         = Ложь;
				Запись.ИспользуетсяТрудШахтеров                           = Ложь;
				Запись.ИспользуютсяРаботыСДосрочнойПенсией                = Ложь;
				Запись.ПрименяютсяРезультатыСпециальнойОценкиУсловийТруда = Ложь;
			КонецЦикла;
			
			НастройкиУчетаСтраховыхВзносов.Записать();
			
			// Зарплата и кадры.
			НастройкиЗарплатаКадры = РегистрыСведений.НастройкиЗарплатаКадры.СоздатьНаборЗаписей();
			НастройкиЗарплатаКадры.Отбор.Организация.Установить(Выборка.Организация);
			НастройкиЗарплатаКадры.Прочитать();
		
			Если НастройкиЗарплатаКадры.Количество() = 0 Тогда
				НоваяЗапись = НастройкиЗарплатаКадры.Добавить();
				НоваяЗапись.Организация = Выборка.Организация;
			КонецЕсли;
			
			Для Каждого Запись Из НастройкиЗарплатаКадры Цикл
				Запись.ПрименятьСевернуюНадбавку                   = Ложь;
				Запись.ПрименятьРайонныйКоэффициент                = Ложь;
				Запись.ПрименятьСевернуюНадбавкуВПодразделениях    = Ложь;
				Запись.ПрименятьРайонныйКоэффициентВПодразделениях = Ложь;
			КонецЦикла;
			
			НастройкиЗарплатаКадры.Записать();
			
		КонецЕсли;
			
	КонецЦикла;
	
	
КонецПроцедуры

Процедура СоздатьПараметрыУчетаЗарплаты(Организация) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.НастройкиУчетаЗарплаты.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		Запись = НаборЗаписей.Добавить();
		Запись.Организация                   = Организация;
		РегистрыСведений.НастройкиУчетаЗарплаты.ЗначенияНастройкиПоУмолчанию(Запись);
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.БухучетЗарплатыОрганизаций.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		СпособОтраженияЗарплатыВБухучете = СпособОтраженияПоУмолчанию();
		
		Запись = НаборЗаписей.Добавить();
		Запись.Организация = Организация;
		Запись.Период = ДатаОтсчетаПериодическихСведений();
		Запись.СпособОтраженияЗарплатыВБухучете = СпособОтраженияЗарплатыВБухучете;
		Запись.ОтношениеКЕНВД = Перечисления.ОтношениеКЕНВДЗатратНаЗарплату.НеЕНВД;
		НаборЗаписей.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения", Истина);
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
	Если ОбщегоНазначенияБПВызовСервераПовтИсп.ГоловнаяОрганизация(Организация) = Организация Тогда
		НаборЗаписей = РегистрыСведений.УчетнаяПолитикаПоНДФЛ.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ГоловнаяОрганизация.Установить(Организация);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			
			Запись = НаборЗаписей.Добавить();
			Запись.ГоловнаяОрганизация = Организация;
			Запись.ОсобенностиИсчисленияНДФЛ = Перечисления.ОсобенностиИсчисленияНДФЛ.СтандартныеВычетыНарастающимИтогом;
			
			НаборЗаписей.Записать();
			
		КонецЕсли;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);	
	
КонецПроцедуры

Функция СпособОтраженияПоУмолчанию()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Наименование", "Отражение начислений по умолчанию");
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СпособыОтраженияЗарплатыВБухУчете.Ссылка
	|ИЗ
	|	Справочник.СпособыОтраженияЗарплатыВБухУчете КАК СпособыОтраженияЗарплатыВБухУчете
	|ГДЕ
	|	СпособыОтраженияЗарплатыВБухУчете.Наименование = &Наименование";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() <> 0 Тогда
		Выборка.Следующий();
		СпособОтраженияЗарплатыВБухучете = Выборка.Ссылка;
	Иначе
		НовыйСпособОтраженияЗарплатыВБухучете = Справочники.СпособыОтраженияЗарплатыВБухУчете.СоздатьЭлемент();
		НовыйСпособОтраженияЗарплатыВБухучете.Наименование = "Отражение начислений по умолчанию";
		НовыйСпособОтраженияЗарплатыВБухучете.Записать();
		
		СтатьяЗатратОплатаТруда 	= ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.СтатьиЗатрат.ОплатаТруда");
		СтатьяЗатратОплатаТрудаЕНВД = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.СтатьиЗатрат.ОплатаТрудаЕНВД");
		
		СпособОтраженияЗарплатыВБухучете = НовыйСпособОтраженияЗарплатыВБухучете.Ссылка;
		
		МенеджерЗаписи = РегистрыСведений.ПорядокОтраженияЗарплатыВБухУчете.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ЕНВД                             = Ложь;
		МенеджерЗаписи.СпособОтраженияЗарплатыВБухУчете = СпособОтраженияЗарплатыВБухучете;
		МенеджерЗаписи.Прочитать();		
		МенеджерЗаписи.СпособОтраженияЗарплатыВБухУчете = СпособОтраженияЗарплатыВБухучете;
		МенеджерЗаписи.ЕНВД                             = Ложь;
		МенеджерЗаписи.Счет                             = ПланыСчетов.Хозрасчетный.ОбщехозяйственныеРасходы;
		МенеджерЗаписи.Субконто1                        = СтатьяЗатратОплатаТруда;
		МенеджерЗаписи.ОтражениеВУСН                    = Перечисления.ОтражениеВУСН.Принимаются;
		МенеджерЗаписи.Записать();
		
		МенеджерЗаписи = РегистрыСведений.ПорядокОтраженияЗарплатыВБухУчете.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ЕНВД                             = Истина;
		МенеджерЗаписи.СпособОтраженияЗарплатыВБухУчете = СпособОтраженияЗарплатыВБухучете;
		МенеджерЗаписи.Прочитать();		
		МенеджерЗаписи.СпособОтраженияЗарплатыВБухУчете = СпособОтраженияЗарплатыВБухучете;
		МенеджерЗаписи.ЕНВД                             = Истина;
		МенеджерЗаписи.Счет                             = ПланыСчетов.Хозрасчетный.ОбщехозяйственныеРасходы;
		МенеджерЗаписи.Субконто1                        = СтатьяЗатратОплатаТрудаЕНВД;
		МенеджерЗаписи.ОтражениеВУСН                    = Перечисления.ОтражениеВУСН.НеПринимаются;
		МенеджерЗаписи.Записать();
		
	КонецЕсли;
	
	Возврат СпособОтраженияЗарплатыВБухучете;
	
КонецФункции

Процедура УточнитьОтношениеКЕНВД(Организация, Период, ПлательщикЕНВД, ПрименяетсяОсобыйПорядокНалогообложения) Экспорт
	
	НаборЗаписей = РегистрыСведений.БухучетЗарплатыОрганизаций.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(Период);
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		ДействующиеНастройки = РегистрыСведений.БухучетЗарплатыОрганизаций.СрезПервых(Период, Новый Структура("Организация", Организация));
		Если ДействующиеНастройки.Количество() = 0 Тогда
			ДействующиеНастройки = РегистрыСведений.БухучетЗарплатыОрганизаций.СрезПоследних(Период, Новый Структура("Организация", Организация));
		КонецЕсли;
		Запись = НаборЗаписей.Добавить();
		Если ДействующиеНастройки.Количество() <> 0 Тогда
			ЗаполнитьЗначенияСвойств(Запись, ДействующиеНастройки[0]);
		Иначе
			Запись.СпособОтраженияЗарплатыВБухучете = СпособОтраженияПоУмолчанию();
		КонецЕсли;
		Запись.Организация = Организация;
		Запись.Период = Период;
	Иначе
		Запись = НаборЗаписей[0];
	КонецЕсли;
	
	Если ПлательщикЕНВД И ПрименяетсяОсобыйПорядокНалогообложения Тогда
		Запись.ОтношениеКЕНВД = Перечисления.ОтношениеКЕНВДЗатратНаЗарплату.ЕНВД;
	ИначеЕсли НЕ ПлательщикЕНВД Тогда
		Запись.ОтношениеКЕНВД = Перечисления.ОтношениеКЕНВДЗатратНаЗарплату.НеЕНВД;
	Иначе
		Запись.ОтношениеКЕНВД = Перечисления.ОтношениеКЕНВДЗатратНаЗарплату.ОпределяетсяЕжемесячноПроцентом;
	КонецЕсли;
	
	НаборЗаписей.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения", Истина);
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция ВедетсяКадровыйУчет() Экспорт
	
	Возврат Константы.ИспользоватьКадровыйУчет.Получить();
		
КонецФункции

Процедура УстановитьНастройкиКадровогоУчета(КадровыйУчет = Неопределено, УчетЗарплатыИКадровСредствамиБухгалтерии = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если УчетЗарплатыИКадровСредствамиБухгалтерии = Неопределено Тогда
		УчетЗарплатыИКадровСредствамиБухгалтерии = Константы.УчетЗарплатыИКадровСредствамиБухгалтерии.Получить();
	КонецЕсли;
	
	Если УчетЗарплатыИКадровСредствамиБухгалтерии Тогда
		Константы.ИспользоватьКадровыйУчет.Установить(КадровыйУчет);
	Иначе
		Константы.ИспользоватьКадровыйУчет.Установить(Ложь);
	КонецЕсли;
		
КонецПроцедуры

Функция ИспользуетсяОбменСЗУП30(Организация) Экспорт
	
	//*********************************
	// Обслуживание обмена с ЗУП 3.0
	//*********************************
	Если ПолучитьФункциональнуюОпцию("ИспользоватьОбменЗарплата3Бухгалтерия3ПоВсемОрганизациямЗарплатаКадрыБазовая")
		ИЛИ ПолучитьФункциональнуюОпцию("ИспользоватьОбменЗарплата3Бухгалтерия3ПоОрганизацииЗарплатаКадрыБазовая", Новый Структура("Организация", Организация)) Тогда
		Если  ПолучитьФункциональнуюОпцию("ВедетсяУчетРасчетовПоЗарплатеСводно") Тогда
			Возврат Ложь;
		Иначе
			Возврат Истина;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
		
КонецФункции

Функция РегистрацияВНалоговомОргане(СтруктурнаяЕдиница) Экспорт
	
	ЗарплатаКадры.РегистрацияВНалоговомОргане(СтруктурнаяЕдиница);
	
КонецФункции

Процедура ПроверитьВозможностьИспользованияОбменаЗарплата3Бухгалтерия3ПередЗаписью(Источник, Отказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Источник.Ссылка <> ПланыОбмена.ОбменЗарплата3Бухгалтерия3.ЭтотУзел() Тогда
		Если Константы.УчетЗарплатыИКадровСредствамиБухгалтерии.Получить() Тогда			
			ТекстСообщения = НСтр("ru = 'В настройках параметров учета установлен учет зарплаты во внешней программе.'");			
			Константы.УчетЗарплатыИКадровВоВнешнейПрограмме.Установить(Истина);
			Константы.ИспользоватьНачислениеЗарплаты.Установить(НЕ Константы.УчетЗарплатыИКадровВоВнешнейПрограмме.Получить());
			Константы.УчетЗарплатыИКадровСредствамиБухгалтерии.Установить(НЕ Константы.УчетЗарплатыИКадровВоВнешнейПрограмме.Получить());
			УстановитьНастройкиУчетаЗарплаты(Константы.УчетЗарплатыИКадровВоВнешнейПрограмме.Получить());
			УстановитьНастройкиКадровогоУчета(Ложь);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция РегистрационныйНомерПФР(Организация, ДатаСведений) Экспорт
	
	Запрос = Новый Запрос;
	
	ИзмеренияДаты = Новый ТаблицаЗначений;
	ИзмеренияДаты.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ИзмеренияДаты.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	
	НоваяСтрока = ИзмеренияДаты.Добавить();
	НоваяСтрока.Организация = Организация;
	НоваяСтрока.Период = ?(ДатаСведений = Неопределено, ДатаОтсчетаПериодическихСведений(), ДатаСведений);
	
	Запрос.УстановитьПараметр("ВТИзмеренияДатыПараметр", ИзмеренияДаты);	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИзмеренияДаты.Период,
	|	ИзмеренияДаты.Организация,
	|	ИзмеренияДаты.Период КАК Период1
	|ПОМЕСТИТЬ ВТИзмеренияДаты
	|ИЗ
	|	&ВТИзмеренияДатыПараметр КАК ИзмеренияДаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИзмеренияДаты.Период КАК ЗаданныйПериод,
	|	ИзмеренияДаты.Организация КАК Организация,
	|	МАКСИМУМ(РегистрСведений.Период) КАК Период
	|ПОМЕСТИТЬ ВТМаксимальныеПериодыИсторияРегистрацийВОрганеПФР
	|{ВЫБРАТЬ
	|	ЗаданныйПериод,
	|	Организация}
	|ИЗ
	|	ВТИзмеренияДаты КАК ИзмеренияДаты
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВОрганеПФР КАК РегистрСведений
	|		ПО (РегистрСведений.Период <= ИзмеренияДаты.Период
	|				ИЛИ ИзмеренияДаты.Период = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|			И (РегистрСведений.Организация = ИзмеренияДаты.Организация)}
	|{ГДЕ
	|	РегистрСведений.Организация.*}
	|
	|СГРУППИРОВАТЬ ПО
	|	ИзмеренияДаты.Период,
	|	ИзмеренияДаты.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МаксимальныеПериоды.ЗаданныйПериод КАК Период,
	|	РегистрСведений.Период КАК ПериодЗаписи,
	|	МаксимальныеПериоды.Организация,
	|	РегистрСведений.РегистрационныйНомерПФР КАК РегистрационныйНомерПФР
	|ПОМЕСТИТЬ ВТИсторияРегистрацийВОрганеПФРСрезПоследних
	|{ВЫБРАТЬ
	|	Период,
	|	ПериодЗаписи,
	|	Организация,
	|	РегистрационныйНомерПФР}
	|ИЗ
	|	ВТМаксимальныеПериодыИсторияРегистрацийВОрганеПФР КАК МаксимальныеПериоды
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВОрганеПФР КАК РегистрСведений
	|		ПО (РегистрСведений.Период = МаксимальныеПериоды.Период)
	|			И (РегистрСведений.Организация = МаксимальныеПериоды.Организация)}
	|ГДЕ
	|	НЕ РегистрСведений.Период ЕСТЬ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсторияРегистрацийВОрганеПФР.РегистрационныйНомерПФР КАК РегистрационныйНомерПФР
	|ИЗ
	|	ВТИсторияРегистрацийВОрганеПФРСрезПоследних КАК ИсторияРегистрацийВОрганеПФР";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат "";
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.РегистрационныйНомерПФР;
		
КонецФункции

Функция ВедетсяУчетРезервовОтпусков(Организация, ДатаСведений) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВедетсяУчетРезервовОтпусков = Ложь;
	
	Если ИспользуетсяПодсистемаУчетаЗарплатыИКадров() Тогда
		НастройкиРезервовОтпусков = НастройкиРезервовОтпусков(Организация, ДатаСведений);
		ВедетсяУчетРезервовОтпусков = НастройкиРезервовОтпусков.ФормироватьРезервОтпусковБУ 
		ИЛИ НастройкиРезервовОтпусков.ФормироватьРезервОтпусковНУ;
	КонецЕсли;
	
	Возврат ВедетсяУчетРезервовОтпусков;
	
КонецФункции

Функция ВедетсяУчетРезервовОтпусковПоВидамУчета(Организация, ДатаСведений, ВидУчета = "БУ") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ВедетсяУчетРезервовОтпусков(Организация, ДатаСведений) Тогда
		Если Константы.УчетЗарплатыИКадровВоВнешнейПрограмме.Получить() Тогда
			НастройкиРезервовОтпусков = НастройкиРезервовОтпусков(Организация, ДатаСведений);
			Возврат НастройкиРезервовОтпусков["ФормироватьРезервОтпусков" + ВидУчета];
		Иначе
			Возврат Истина;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция РасчетЗарплатыДляНебольшихОрганизаций() Экспорт
	
	РасширеннаяЗарплата = Ложь;
	Если ПолучитьФункциональнуюОпцию("УчетЗарплатыИКадровСредствамиБухгалтерии") Тогда
		Если ПолучитьФункциональнуюОпцию("РасчетЗарплатыДляНебольшихОрганизаций") Тогда
			РасширеннаяЗарплата = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РасширеннаяЗарплата;
	
КонецФункции

Функция ДатаОтсчетаПериодическихСведений() Экспорт
	
	Возврат '18991231000000';
	
КонецФункции

Функция НастройкиРезервовОтпусков(Организация, ДатаСведений) Экспорт
	
	Возврат РезервОтпусков.НастройкиРезервовОтпусков(Организация, ДатаСведений);
	
КонецФункции

Функция ВестиУчетНачисленияЗаработнойПлатыВРазрезеПодразделений(Организация, Период) Экспорт

	Возврат УчетНачисленнойЗарплатыПовтИсп.ВестиУчетНачисленияЗаработнойПлатыВРазрезеПодразделений(Организация, НачалоМесяца(Период));
	
КонецФункции

Функция ВестиУчетНачисленияДоходовРасходовПоЗаработнойПлатеВРазрезеПодразделений(Организация, Период) Экспорт

	// СК [07.10.2022] (доходы/расходы ЗП по подразделениям)
	Возврат УчетНачисленнойЗарплатыПовтИсп.ВестиУчетНачисленияДоходовРасходовПоЗаработнойПлатеВРазрезеПодразделений(Организация, НачалоМесяца(Период));
	
КонецФункции

#КонецОбласти

#Область РолиПодсистемы

// Перечень ролей, предоставляющих доступ на просмотр данных подсистемы.
// 
// Возвращаемое значение:
//  Массив - содержит строки, имена ролей
//
Функция РолиПросмотраДанных() Экспорт
	
	Роли = Новый Массив;
	
	Роли.Добавить("БазовыеПраваЗарплатаКадры");
	
	Роли.Добавить("ЧтениеАнкетПерсУчета");
	Роли.Добавить("ЧтениеБухгалтерскогоУчетаЗарплаты");
	Роли.Добавить("ЧтениеВыплаченнойЗарплаты");
	Роли.Добавить("ЧтениеДанныхДляНачисленияЗарплаты");
	Роли.Добавить("ЧтениеДанныхСотрудников");
	Роли.Добавить("ЧтениеДанныхФизическихЛицЗарплатаКадры");
	Роли.Добавить("ЧтениеДепонированнойЗарплаты");
	Роли.Добавить("ЧтениеДокументовЗарплатаКадры");
	Роли.Добавить("ЧтениеДокументовПоПрямымВыплатамПособийСоциальногоСтрахования");
	Роли.Добавить("ЧтениеЗарплатныхПроектов");
	Роли.Добавить("ЧтениеИсходящейСправкиОЗаработке");
	Роли.Добавить("ЧтениеЛицевыхСчетовПоЗарплатнымПроектам");
	Роли.Добавить("ЧтениеНалоговИВзносов");
	Роли.Добавить("ЧтениеНачисленнойЗарплаты");
	Роли.Добавить("ЧтениеОбменаСБанкамиПоЗарплатнымПроектам");
	Роли.Добавить("ЧтениеПерсУчета");
	Роли.Добавить("ЧтениеДолжностей");
	
	Возврат Роли;
	
КонецФункции

// Перечень ролей, предоставляющих доступ на редактирование данных подсистемы.
// 
// Возвращаемое значение:
//  Массив - содержит строки, имена ролей
//
Функция РолиРедактированияДанных() Экспорт

	Роли = Новый Массив;
	
	Роли.Добавить("БазовыеПраваЗарплатаКадры");
	
	Роли.Добавить("НастройкаКлассовУсловийТрудаПоДолжностям");// Право на Должности включено в роль ДобавлениеИзменениеДанныхБухгалтерии
	Роли.Добавить("НастройкаПерсУчета");// Данные, которые используются при сдаче отчетности перс. учета
	
	Роли.Добавить("ДобавлениеИзменениеАнкетПерсУчета");
	Роли.Добавить("ДобавлениеИзменениеБухгалтерскогоУчетаЗарплаты");
	Роли.Добавить("ДобавлениеИзменениеВыплаченнойЗарплаты");
	Роли.Добавить("ДобавлениеИзменениеДанныхДляНачисленияЗарплаты");
	Роли.Добавить("ДобавлениеИзменениеДанныхСотрудников");
	Роли.Добавить("ДобавлениеИзменениеДанныхФизическихЛицЗарплатаКадры");
	Роли.Добавить("ДобавлениеИзменениеДепонированнойЗарплаты");
	Роли.Добавить("ДобавлениеИзменениеДокументовЗарплатаКадры");
	Роли.Добавить("ДобавлениеИзменениеДокументовПоПрямымВыплатамПособийСоциальногоСтрахования");
	Роли.Добавить("ДобавлениеИзменениеЗарплатныхПроектов");
	Роли.Добавить("ДобавлениеИзменениеИсходящейСправкиОЗаработке");
	Роли.Добавить("ДобавлениеИзменениеЛицевыхСчетовПоЗарплатнымПроектам");
	Роли.Добавить("ДобавлениеИзменениеНалоговИВзносов");
	Роли.Добавить("ДобавлениеИзменениеНачисленнойЗарплаты");
	Роли.Добавить("ДобавлениеИзменениеОбменаСБанкамиПоЗарплатнымПроектам");
	Роли.Добавить("ДобавлениеИзменениеПерсУчета");
	Роли.Добавить("ДобавлениеИзменениеДолжностей");
	Роли.Добавить("ДобавлениеИзменениеЗначенийСтроковыхРеквизитов");
	
	Роли.Добавить("ОтражениеЗарплатыВБухгалтерскомУчете");
	
	Роли.Добавить("ДобавлениеИзменениеМедицинскихОрганизаций");
	
	Возврат Роли;

КонецФункции

// Перечень ролей, предоставляющих доступ к настройке подсистемы.
// 
// Возвращаемое значение:
//  Массив - содержит строки, имена ролей
//
Функция РолиНастройки() Экспорт
	
	Роли = Новый Массив;
	
	Роли.Добавить("НастройкаБухгалтерскогоУчетаЗарплаты");
	Роли.Добавить("НастройкаКадровыхДанных");
	Роли.Добавить("НастройкаНалогиИВзносы");
	Роли.Добавить("НастройкаНачисленияЗарплаты");

	Возврат Роли;

КонецФункции

#КонецОбласти

#Область КадровыеДанные

Функция ПолучитьФизическоеЛицо(Объект) Экспорт
	
	ТипОбъекта = ТипЗнч(Объект);
	Если ТипОбъекта = Тип("СправочникСсылка.ФизическиеЛица") или ТипОбъекта = Тип("СправочникОбъект.ФизическиеЛица") Тогда
		ФизическоеЛицо = Объект;
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.Сотрудники") или ТипОбъекта = Тип("СправочникОбъект.Сотрудники") Тогда
		ФизическоеЛицо = Объект.ФизическоеЛицо;
	Иначе
		ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ФизическоеЛицо;
	
КонецФункции

// Возвращает представление физического лица.
// Может выполнятся под ограниченными правами.
//
// Параметры:
//  ФизическоеЛицо - Справочник.ФизическиеЛица - Физическое лицо, по которому следует получить представление
//  ДатаСреза - Дата - Дата на которую получаются данные по физическому лицу
//
// Возвращаемое значение:
//   Структура - Структура с представлением физического лица, с ключами:
// * Фамилия - Строка
// * Имя - Строка
// * Отчество - Строка
// * ФамилияИО - Строка
// * ФИОПолные - Строка
//
Функция ПредставлениеФизическогоЛица(ФизическоеЛицо, ДатаСреза) Экспорт
	
	СписокКадровыхДанных = "Фамилия, Имя, Отчество, ФамилияИО, ФИОПолные";
	
	КадровыеДанныеФизЛиц = КадровыйУчет.КадровыеДанныеФизическихЛиц(
		Истина,
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ФизическоеЛицо),
		СписокКадровыхДанных,
		ДатаСреза);
	
	Результат = Новый Структура(СписокКадровыхДанных);
	
	КадровыеДанные = КадровыеДанныеФизЛиц.Найти(ФизическоеЛицо, "ФизическоеЛицо");
	Если КадровыеДанные <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Результат, КадровыеДанные);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает должность физического лица.
// 
// Параметры:
//  ФизическоеЛицо - Справочник.ФизическиеЛица - Физическое лицо, по которому следует получить представление
//  Организация - Справочник.Организации - Организация, в которой работает сотрудник, связанный с физическим лицом
//  ДатаСреза - Дата - Дата на которую получаются данные по физическому лицу
//
// Возвращаемое значение:
//   Должность - Справочник.Должности
//
Функция ДолжностьФизическогоЛица(ФизическоеЛицо, Организация, ДатаСреза) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	// Получим соответствие физического лица и сотрудника
	ТаблицаСотрудников = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ФизическоеЛицо),
		Ложь,
		Организация,
		ДатаСреза);
		
	// Получим кадровые данные сотрудника
	СписокКадровыхДанных = "Должность";
	КадровыеДанныеСотрудников = КадровыйУчет.КадровыеДанныеСотрудников(
		Ложь,
		ТаблицаСотрудников.ВыгрузитьКолонку("Сотрудник"),
		СписокКадровыхДанных,
		ДатаСреза);
	УстановитьПривилегированныйРежим(Ложь);
	
	КадровыеДанные = КадровыеДанныеСотрудников.Найти(ФизическоеЛицо, "ФизическоеЛицо");
	Если КадровыеДанные <> Неопределено Тогда
		Должность = КадровыеДанные.Должность;
	Иначе
		Должность = Справочники.Должности.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Должность;
	
КонецФункции

Функция ДанныеФизическихЛиц(Организация = Неопределено, ФизическиеЛица, ДатаСреза, ФИОКратко = Истина, РезультатТаблично = Ложь) Экспорт
	
	ПоГруппе = Ложь;
	Если ТипЗнч(ФизическиеЛица) = Тип("Массив") Тогда
		ПоГруппе = Истина;
	КонецЕсли;
	
	СписокКадровыхДанных = "Фамилия, Имя, Отчество, Пол, ДатаРождения, МестоРождения, Страна, ФамилияИО, СтраховойНомерПФР, ИНН, ФИОПолные, ДокументВид, ДокументСерия, ДокументНомер, ДокументДатаВыдачи, ДокументКемВыдан, ДокументКодПодразделения, ДокументПредставление";
	
	КадровыеДанныеФизЛиц = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, ФизическиеЛица, СписокКадровыхДанных, ДатаСреза);
	
	Если Организация <> Неопределено Тогда
		ТаблицаСотрудников = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(ФизическиеЛица, Истина, Организация, ДатаСреза); 
		
		Если ТаблицаСотрудников.Количество() <> 0 Тогда
			
			Если ПоГруппе Тогда
				Сотрудники = ТаблицаСотрудников.ВыгрузитьКолонку("Сотрудник");
			Иначе
				Сотрудники = ТаблицаСотрудников[0].Сотрудник;
			КонецЕсли;
			
			СписокКадровыхДанных = "ТабельныйНомер, Подразделение, Должность, ФизическоеЛицо, ДатаПриема";
			КадровыеДанныеСотрудников = КадровыйУчет.КадровыеДанныеСотрудников(Истина, Сотрудники, СписокКадровыхДанных, ДатаСреза); 
		Иначе
			КадровыеДанныеСотрудников = Неопределено;
		КонецЕсли;
		
	Иначе
		КадровыеДанныеСотрудников = Неопределено;
	КонецЕсли;
	
	Если РезультатТаблично Тогда
		
		ТабРезультат = Новый ТаблицаЗначений();
		// Сведения физ.лица
		ТабРезультат.Колонки.Добавить("ФизическоеЛицо",           Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
		ТабРезультат.Колонки.Добавить("Фамилия",                  Метаданные.РегистрыСведений.ФИОФизическихЛиц.Ресурсы.Фамилия.Тип);
		ТабРезультат.Колонки.Добавить("Имя",                      Метаданные.РегистрыСведений.ФИОФизическихЛиц.Ресурсы.Имя.Тип);
		ТабРезультат.Колонки.Добавить("Отчество",                 Метаданные.РегистрыСведений.ФИОФизическихЛиц.Ресурсы.Отчество.Тип);
		ТабРезультат.Колонки.Добавить("Пол",                      Новый ОписаниеТипов("ПеречислениеСсылка.ПолФизическогоЛица"));
		ТабРезультат.Колонки.Добавить("ДатаРождения",             Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
		ТабРезультат.Колонки.Добавить("МестоРождения",            Метаданные.Справочники.ФизическиеЛица.Реквизиты.МестоРождения.Тип);
		ТабРезультат.Колонки.Добавить("Страна",                   Новый ОписаниеТипов("СправочникСсылка.СтраныМира"));
		ТабРезультат.Колонки.Добавить("Представление",            Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(250)));
		ТабРезультат.Колонки.Добавить("ИНН",                      Метаданные.Справочники.ФизическиеЛица.Реквизиты.ИНН.Тип);
		ТабРезультат.Колонки.Добавить("СтраховойНомерПФР",        Метаданные.Справочники.ФизическиеЛица.Реквизиты.СтраховойНомерПФР.Тип);
		ТабРезультат.Колонки.Добавить("ВидДокумента",             Новый ОписаниеТипов("СправочникСсылка.ВидыДокументовФизическихЛиц"));
		ТабРезультат.Колонки.Добавить("Серия",                    Метаданные.РегистрыСведений.ДокументыФизическихЛиц.Ресурсы.Серия.Тип);
		ТабРезультат.Колонки.Добавить("Номер",                    Метаданные.РегистрыСведений.ДокументыФизическихЛиц.Ресурсы.Номер.Тип);
		ТабРезультат.Колонки.Добавить("ДатаВыдачи",               Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
		ТабРезультат.Колонки.Добавить("КемВыдан",                 Метаданные.РегистрыСведений.ДокументыФизическихЛиц.Ресурсы.КемВыдан.Тип);
		ТабРезультат.Колонки.Добавить("КодПодразделения",         Метаданные.РегистрыСведений.ДокументыФизическихЛиц.Ресурсы.КодПодразделения.Тип);
		ТабРезультат.Колонки.Добавить("ПредставлениеДокумента",   Метаданные.РегистрыСведений.ДокументыФизическихЛиц.Ресурсы.Представление.Тип);
		// Сведения сотрудника
		ТабРезультат.Колонки.Добавить("ТабельныйНомер",           Метаданные.Справочники.Сотрудники.СтандартныеРеквизиты.Код.Тип);
		ТабРезультат.Колонки.Добавить("Должность",                Новый ОписаниеТипов("СправочникСсылка.Должности"));
		ТабРезультат.Колонки.Добавить("ПодразделениеОрганизации", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
		ТабРезультат.Колонки.Добавить("Сотрудник",                Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
		ТабРезультат.Колонки.Добавить("ДатаПриема",               Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
		
	Иначе
		
		Результат = Новый Структура("Фамилия, Имя, Отчество, Пол, ДатаРождения, МестоРождения, Страна, Представление, ИНН, СтраховойНомерПФР, ТабельныйНомер, Должность, ПодразделениеОрганизации, ВидДокумента, Серия, Номер, ДатаВыдачи, КемВыдан, КодПодразделения, ПредставлениеДокумента, Сотрудник, ДатаПриема");
		
	КонецЕсли;
	
	Для Каждого ДанныеФизЛиц Из КадровыеДанныеФизЛиц Цикл
		
		Если РезультатТаблично Тогда
			Результат = ТабРезультат.Добавить();
			Результат.ФизическоеЛицо= ДанныеФизЛиц.ФизическоеЛицо;
		Иначе
			Если КадровыеДанныеФизЛиц.Индекс(ДанныеФизЛиц) > 0 Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
		
		Результат.Фамилия       = ОбщегоНазначенияБП.ЕстьNull(ДанныеФизЛиц.Фамилия, "");
		Результат.Имя           = ОбщегоНазначенияБП.ЕстьNull(ДанныеФизЛиц.Имя, "");
		Результат.Отчество      = ОбщегоНазначенияБП.ЕстьNull(ДанныеФизЛиц.Отчество, "");
		Результат.Пол           = ОбщегоНазначенияБП.ЕстьNull(ДанныеФизЛиц.Пол, Перечисления.ПолФизическогоЛица.ПустаяСсылка());
		Результат.ДатаРождения  = ОбщегоНазначенияБП.ЕстьNull(ДанныеФизЛиц.ДатаРождения, Дата(1, 1, 1));
		Результат.МестоРождения = ОбщегоНазначенияБП.ЕстьNull(ДанныеФизЛиц.МестоРождения, "");
		Результат.Страна        = ОбщегоНазначенияБП.ЕстьNull(ДанныеФизЛиц.Страна, Справочники.СтраныМира.Россия);
		Если ФИОКратко Тогда
			Результат.Представление = ОбщегоНазначенияБП.ЕстьNull(ДанныеФизЛиц.ФамилияИО, "");
		Иначе
			Результат.Представление = ОбщегоНазначенияБП.ЕстьNull(ДанныеФизЛиц.ФИОПолные, "");
		КонецЕсли;
		Результат.ВидДокумента           = ОбщегоНазначенияБП.ЕстьNull(ДанныеФизЛиц.ДокументВид, "");
		Результат.Серия                  = ОбщегоНазначенияБП.ЕстьNull(ДанныеФизЛиц.ДокументСерия, "");
		Результат.Номер                  = ОбщегоНазначенияБП.ЕстьNull(ДанныеФизЛиц.ДокументНомер, "");
		Результат.ДатаВыдачи             = ОбщегоНазначенияБП.ЕстьNull(ДанныеФизЛиц.ДокументДатаВыдачи, "");
		Результат.КемВыдан               = ОбщегоНазначенияБП.ЕстьNull(ДанныеФизЛиц.ДокументКемВыдан, "");
		Результат.КодПодразделения       = ОбщегоНазначенияБП.ЕстьNull(ДанныеФизЛиц.ДокументКодПодразделения, "");
		Результат.ПредставлениеДокумента = ОбщегоНазначенияБП.ЕстьNull(ДанныеФизЛиц.ДокументПредставление, "");
		Результат.ИНН                    = ОбщегоНазначенияБП.ЕстьNull(ДанныеФизЛиц.ИНН, "");
		Результат.СтраховойНомерПФР      = ОбщегоНазначенияБП.ЕстьNull(ДанныеФизЛиц.СтраховойНомерПФР, "");
		
		Если КадровыеДанныеСотрудников <> Неопределено Тогда
			СтруктураОтбора = Новый Структура("ФизическоеЛицо", ДанныеФизЛиц.ФизическоеЛицо);
			МассивСведений = КадровыеДанныеСотрудников.НайтиСтроки(СтруктураОтбора);
			Если МассивСведений.Количество() <> 0 Тогда
				Результат.ТабельныйНомер           = ПрефиксацияОбъектовКлиентСервер.УдалитьПрефиксыИзНомераОбъекта(МассивСведений[0].ТабельныйНомер, Истина, Истина);
				Результат.Должность                = МассивСведений[0].Должность;
				Результат.ПодразделениеОрганизации = МассивСведений[0].Подразделение;
				Результат.Сотрудник                = МассивСведений[0].Сотрудник;
				Результат.ДатаПриема               = МассивСведений[0].ДатаПриема;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если РезультатТаблично Тогда
		Возврат ТабРезультат;
	Иначе
		Возврат Результат;
	КонецЕсли;
	
КонецФункции

Процедура ПолучитьТаблицуСотрудников(ТаблицаФизическихЛиц) Экспорт
	
	ТаблицаФизическихЛиц.Колонки.Добавить("Сотрудник",                            Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ТаблицаФизическихЛиц.Колонки.Добавить("СотрудникКод",                         Новый ОписаниеТипов("Строка"));
	ТаблицаФизическихЛиц.Колонки.Добавить("ПодразделениеСотрудника",              Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	ТаблицаФизическихЛиц.Колонки.Добавить("ПодразделениеСотрудникаКод",           Новый ОписаниеТипов("Строка"));
	ТаблицаФизическихЛиц.Колонки.Добавить("ПредставлениеПодразделенияСотрудника", Новый ОписаниеТипов("Строка"));
	
	СписокКадровыхДанных = "ТабельныйНомер, Подразделение";
	Для Каждого СтрокаТаблицы ИЗ ТаблицаФизическихЛиц Цикл
		ТаблицаСотрудников = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(СтрокаТаблицы.ФизическоеЛицо, Истина, СтрокаТаблицы.Организация, СтрокаТаблицы.Дата); 
		Если ТаблицаСотрудников.Количество() <> 0 Тогда			
			Сотрудник = ТаблицаСотрудников[0].Сотрудник;
			СтрокаТаблицы.Сотрудник = Сотрудник;
			КадровыеДанныеСотрудника = КадровыйУчет.КадровыеДанныеСотрудников(Истина, Сотрудник, СписокКадровыхДанных, СтрокаТаблицы.Дата); 
			Если КадровыеДанныеСотрудника <> Неопределено Тогда
				Подразделение = КадровыеДанныеСотрудника[0].Подразделение;
				СтрокаТаблицы.ПодразделениеСотрудника = Подразделение;				
				СтрокаТаблицы.СотрудникКод =  КадровыеДанныеСотрудника[0].ТабельныйНомер;
				Если ЗначениеЗаполнено(Подразделение) Тогда
					СтрокаТаблицы.ПодразделениеСотрудникаКод = Подразделение.Код;
					Если ЗначениеЗаполнено(Подразделение.НаименованиеПолное) Тогда
						СтрокаТаблицы.ПредставлениеПодразделенияСотрудника = Подразделение.НаименованиеПолное;
					Иначе
						СтрокаТаблицы.ПредставлениеПодразделенияСотрудника = Подразделение.Наименование;
					КонецЕсли;
				КонецЕсли;				
			КонецЕсли;			
		КонецЕсли;
	КонецЦикла
		
КонецПроцедуры

Функция ФизическиеЛицаРаботавшиеВОрганизации(ТолькоРазрешенные, Организация, НачалоПериода, ОкончаниеПериода, Подразделение = Неопределено) Экспорт
	
	Возврат КадровыйУчет.ФизическиеЛицаРаботавшиеВОрганизации(ТолькоРазрешенные, Организация, НачалоПериода, ОкончаниеПериода, Подразделение);
	
КонецФункции

// Возвращает признак необходимости начислять зарплату
// для данной организации в указанный период
//
// Параметры:
//		Организация - СправочникСсылка.Организации
//		Период      - Дата
//
// Возвращаемое значение:
//		Булево
//
Функция НеобходимоНачислятьЗарплату(Организация, Период) Экспорт
	
	ЭтоФизЛицо	= Организация.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
	
	УчетЗарплатыИКадровСредствамиБухгалтерии = ПолучитьФункциональнуюОпцию("УчетЗарплатыИКадровСредствамиБухгалтерии");
	Если НЕ УчетЗарплатыИКадровСредствамиБухгалтерии Тогда
		Возврат Ложь;
	ИначеЕсли ЭтоФизЛицо И НЕ ИПИспользуетТрудНаемныхРаботников(Организация) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПараметрыПолученияСотрудниковОрганизаций = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолученияСотрудниковОрганизаций.Вставить("Организация",                   Организация);
	ПараметрыПолученияСотрудниковОрганизаций.Вставить("КадровыеДанные",                "");
	ПараметрыПолученияСотрудниковОрганизаций.Вставить("ОтбиратьПоГоловнойОрганизации", Ложь);
	ПараметрыПолученияСотрудниковОрганизаций.Вставить("НачалоПериода",                 ?(ЭтоФизЛицо, НачалоМесяца(Период), '00010101'));
	ПараметрыПолученияСотрудниковОрганизаций.Вставить("ОкончаниеПериода",              КонецМесяца(Период));
	ПараметрыПолученияСотрудниковОрганизаций.Вставить("Отборы",                        Неопределено);
	
	ТаблицаСотрудников = КадровыйУчет.СотрудникиОрганизации(Истина, ПараметрыПолученияСотрудниковОрганизаций);
	
	Возврат ТаблицаСотрудников.Количество() > 0;
	
КонецФункции

Функция ИПИспользуетТрудНаемныхРаботников(Организация) Экспорт
	
	Если ТипЗнч(Организация) = Тип("СправочникОбъект.Организации")
		ИЛИ ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
		ОрганизацияСсылка = Организация.Ссылка;
	Иначе
		Возврат Ложь;
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(ОрганизацияСсылка) Тогда
		Возврат Ложь;
	Иначе
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОрганизацияСсылка, "ИПИспользуетТрудНаемныхРаботников");
	КонецЕсли;
		
КонецФункции

Функция ПолучитьДокументНачисленияЗарплаты(МесяцНачисления, Организация) Экспорт
	
	ДокументНачисленияЗарплаты = Неопределено;
	Попытка
		ДокументНачисленияЗарплаты = РасчетЗарплаты.ДокументНачисленияЗарплаты(МесяцНачисления, Организация);
	Исключение
		ШаблонСообщения = НСтр("ru = 'Не удалось записать документ'");		
		ОписаниеОшибки = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(ШаблонСообщения, УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки.Описание);
	КонецПопытки;
	
	Возврат ДокументНачисленияЗарплаты;
	
КонецФункции

Функция ЕстьДокументНачисленияЗарплаты(МесяцНачисления, Организация) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("МесяцНачисления", 	НачалоМесяца(МесяцНачисления));

	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НачислениеЗарплаты.Ссылка КАК Документ
	|ИЗ
	|	Документ.НачислениеЗарплаты КАК НачислениеЗарплаты
	|ГДЕ
	|	НачислениеЗарплаты.МесяцНачисления = &МесяцНачисления
	|	И НачислениеЗарплаты.Организация = &Организация
	|	И НачислениеЗарплаты.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	НачислениеЗарплаты.Дата,
	|	НачислениеЗарплаты.Ссылка";

	Возврат НЕ Запрос.Выполнить().Пустой();

КонецФункции

Функция ПолучитьДокументНачисленияРезерваОтпусков(МесяцНачисления, Организация) Экспорт
	
	ДокументНачисленияРезерваОтпусков = Неопределено;
	Попытка
		ДокументНачисленияРезерваОтпусков = РезервОтпусков.ДокументНачислениеОценочныхОбязательствПоОтпускам(МесяцНачисления, Организация);
	Исключение
		ШаблонСообщения = НСтр("ru = 'Не удалось записать документ'");		
		ОписаниеОшибки = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(ШаблонСообщения, УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки.Описание);
	КонецПопытки;
	
	Возврат ДокументНачисленияРезерваОтпусков;
	
КонецФункции

Функция ЕстьДокументНачисленияРезервовОтпусков(МесяцНачисления, Организация) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("МесяцНачисления", 	НачалоМесяца(МесяцНачисления));

	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НачислениеОценочныхОбязательствПоОтпускам.Ссылка КАК Документ
	|ИЗ
	|	Документ.НачислениеОценочныхОбязательствПоОтпускам КАК НачислениеОценочныхОбязательствПоОтпускам
	|ГДЕ
	|	НачислениеОценочныхОбязательствПоОтпускам.ПериодРегистрации = &МесяцНачисления
	|	И НачислениеОценочныхОбязательствПоОтпускам.Организация = &Организация
	|	И НачислениеОценочныхОбязательствПоОтпускам.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	НачислениеОценочныхОбязательствПоОтпускам.Дата,
	|	НачислениеОценочныхОбязательствПоОтпускам.Ссылка";

	Возврат НЕ Запрос.Выполнить().Пустой();

КонецФункции

Процедура СформироватьКадровыеПриказы() Экспорт
	
	КадровыйУчетБазовый.СформироватьКадровыеПриказы();
	
КонецПроцедуры

Функция СоздатьФизическоеЛицо(Наименование, ИНН, СсылкаНового = Неопределено) Экспорт

	ДанныеФизическогоЛица = Новый Структура;
	ДанныеФизическогоЛица.Вставить("ИНН", ИНН);
	Если СсылкаНового <> Неопределено Тогда
		ДанныеФизическогоЛица.Вставить("Ссылка", СсылкаНового);
	КонецЕсли;
	НовоеФизическоеЛицо = КадровыйУчет.НовоеФизическоеЛицо(Наименование, ДанныеФизическогоЛица);
	Возврат НовоеФизическоеЛицо.Ссылка;
	
КонецФункции

Функция СоздатьСчетФизическогоЛица(ФизическоеЛицо, СтруктураРеквизиовСчета) Экспорт
	
	НовыйЭлемент = Справочники.БанковскиеСчета.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, СтруктураРеквизиовСчета,
	"НомерСчета, Банк, БанкДляРасчетов, ВалютаДенежныхСредств, ВидСчета, ТекстКорреспондента, ТекстНазначения, МесяцПрописью, СуммаБезКопеек, ВсегдаУказыватьКПП");
	НовыйЭлемент.Владелец = ФизическоеЛицо;
	НовыйЭлемент.Наименование = Лев(СокрЛП(СтруктураРеквизиовСчета.НомерСчета) + ", " + СтруктураРеквизиовСчета.Банк, 100);
	
	Если НовыйЭлемент.ПолучитьСсылкуНового().Пустая() Тогда
		НовыйЭлемент.УстановитьСсылкуНового(Справочники.БанковскиеСчета.ПолучитьСсылку());
	КонецЕсли;
	НовыйЭлемент.Записать();
	
	Возврат НовыйЭлемент.Ссылка;
	
КонецФункции

Функция Просклонять(Знач ФИО, Знач Падеж, Результат, Знач Пол = Неопределено) Экспорт
	
	Возврат ФизическиеЛицаЗарплатаКадры.Просклонять(ФИО, Падеж, Результат, Пол);
	
КонецФункции

Функция ПолучитьСчетаУчетаСотрудников(ВестиУчетПоРаботникам, Реквизиты, СтрокаТаблицы, ТаблицаЗаработнойПлаты)		
	
	ТаблицаДляПолученияСчетов = ТаблицаЗаработнойПлаты.СкопироватьКолонки("ФизическоеЛицо, Подразделение, ВидОперации, СпособОтраженияЗарплатыВБухучете");			
	СтрокаТаб 				  = ТаблицаДляПолученияСчетов.Добавить();
	
	ЗаполнитьЗначенияСвойств(СтрокаТаб, СтрокаТаблицы);
	
	СоответствиеСчетовУчета = Новый Соответствие;				
	СоответствиеСчетовУчета.Вставить(Перечисления.ЕПСВидыСчетов.СчетУчетаПассивный, "СчетУчетаПассивный");
	СоответствиеСчетовУчета.Вставить(Перечисления.ЕПСВидыСчетов.СчетУчетаАктивный, 	"СчетУчетаАктивный");
	
	ТаблицаЕПСПараметрОтраженияВБУ = ДополнитьТаблицуНачисленийПараметрамиОтраженияВБУ(ПланыВидовХарактеристик.ЕПСПравилаОтраженияЗарплаты.Начисления, Реквизиты, ТаблицаДляПолученияСчетов);
	
	СтруктураПараметры = Новый Структура("Подразделение, ВидыОперацийПоЗарплате", СтрокаТаблицы.Подразделение, ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.НачисленоДоход"));			
	
	Если ВестиУчетПоРаботникам Тогда
		СтруктураПараметры.Вставить("Контрагент", СтрокаТаблицы.ФизическоеЛицо);
	КонецЕсли;		
	
	ЕПСПараметрОтраженияВБУ 	 = ТаблицаЕПСПараметрОтраженияВБУ[0].ЕПСПараметрОтраженияВБУ;			
	ИспользуемыеСчетаСотрудников = ЮС_СчетаУчетаВДокументах.ПолучитьИспользуемыеСчетаУчета();
	
	Возврат ИспользуемыеСчетаСотрудников;

КонецФункции

Функция ПолучитьСчетаУчетаВзносовСотрудников(ВестиУчетПоРаботникам, Реквизиты, СтрокаТаблицы, ТаблицаЗаработнойПлаты)		
	
	ТаблицаДляПолученияСчетов = ТаблицаЗаработнойПлаты.СкопироватьКолонки("ФизическоеЛицо, Подразделение, ВидОперации, СпособОтраженияЗарплатыВБухучете");		
	СтрокаТаб = ТаблицаДляПолученияСчетов.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаТаб, СтрокаТаблицы);
	СтрокаТаб.СпособОтраженияЗарплатыВБухучете = ПредопределенноеЗначение("Справочник.СпособыОтраженияЗарплатыВБухУчете.ВзносыСРезервовПоОтпускам");
	СтрокаТаб.ВидОперации = СтрокаТаблицы.ВедущийВидОперации;
	
	СоответствиеСчетовУчета = Новый Соответствие;				
	СоответствиеСчетовУчета.Вставить(Перечисления.ЕПСВидыСчетов.СчетУчетаПассивный, "СчетУчетаПассивный");
	СоответствиеСчетовУчета.Вставить(Перечисления.ЕПСВидыСчетов.СчетУчетаАктивный, 	"СчетУчетаАктивный");
	
	ТаблицаЕПСПараметрОтраженияВБУ = ДополнитьТаблицуНачисленийПараметрамиОтраженияВБУ(ПланыВидовХарактеристик.ЕПСПравилаОтраженияЗарплаты.Начисления, Реквизиты, ТаблицаДляПолученияСчетов);
	
	СтруктураПараметры = Новый Структура("Подразделение, ВидыОперацийПоЗарплате", СтрокаТаблицы.Подразделение, ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускРезервы"));			
	Если ВестиУчетПоРаботникам Тогда
		СтруктураПараметры.Вставить("Контрагент", СтрокаТаблицы.ФизическоеЛицо);
	КонецЕсли;	
	
	Если НЕ ТаблицаЕПСПараметрОтраженияВБУ.Количество() Тогда 
		Возврат Новый Структура;
	КонецЕсли;	
	
	ЕПСПараметрОтраженияВБУ 	 = ТаблицаЕПСПараметрОтраженияВБУ[0].ЕПСПараметрОтраженияВБУ;			
	ИспользуемыеСчетаСотрудников = ЮС_СчетаУчетаВДокументах.ПолучитьИспользуемыеСчетаУчета();
	
	Возврат ИспользуемыеСчетаСотрудников;

КонецФункции

Функция СписокСчетовАгентскогоНДФЛ(Организация) Экспорт
	
	СправочникНалогНДФЛ = Справочники.ВидыНалоговИПлатежейВБюджет.НайтиПоРеквизиту("КодБК", "18210102010011000110");

	МассивЛицевыхСчетов = Новый Массив();
	
	КоличествоИспользуемыхАналитик 	= ЮС_СчетаУчетаВДокументах.ПолучитьКоличествоИспользуемойАналитики();
	ТекстУсловиеАналитикиПоля 		= ""; 
	ТекстУсловиеАналитики 			= "";
	
	//Сформируем ТекстУсловиеАналитики и ТекстПоляАналитики
	Сч = 1;
	Пока Сч <= КоличествоИспользуемыхАналитик Цикл
		ТекстУсловиеАналитикиПоля = ТекстУсловиеАналитикиПоля + "ЕПСИспользуемыеЛицевыеСчета.Аналитика" + Сч + ",";  
		Сч = Сч + 1;
	КонецЦикла;
	
	//уберем лишние "," 
	Если ТекстУсловиеАналитикиПоля <> "" Тогда
		ТекстУсловиеАналитикиПоля = Лев(ТекстУсловиеАналитикиПоля,СтрДлина(ТекстУсловиеАналитикиПоля)-1);
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕПСИспользуемыеЛицевыеСчета.ЛицевойСчет КАК ЛицевойСчет
		|ИЗ
		|	РегистрСведений.ЕПСИспользуемыеЛицевыеСчета КАК ЕПСИспользуемыеЛицевыеСчета
		|ГДЕ
		|	&ОбъектАналитики В (&УсловияАналитикиПоля)
		|	И ЕПСИспользуемыеЛицевыеСчета.Организация = &Организация";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловияАналитикиПоля", 	ТекстУсловиеАналитикиПоля); 
	
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("ОбъектАналитики", 	СправочникНалогНДФЛ);
             
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 МассивЛицевыхСчетов.Добавить(ВыборкаДетальныеЗаписи.ЛицевойСчет);
	КонецЦикла;	
			
	СписокСчетовАгентскогоНДФЛ = Новый СписокЗначений;
	
	Для Каждого СтрокаМассивЛицевыхСчетов Из МассивЛицевыхСчетов Цикл
		СписокСчетовАгентскогоНДФЛ.Добавить(СтрокаМассивЛицевыхСчетов);
	КонецЦикла;	
	
	Возврат СписокСчетовАгентскогоНДФЛ;
	
КонецФункции

Функция ДатаПереходаНаПостояннуюПередачуЧастичныхУведомленийПоНДФЛ() Экспорт 
	
	Возврат '20240101'
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеОтчетности

//***********************************
// Среднесписочная численность

Процедура ПолучитьСведенияОПоказателяхОтчетаРегламентированныйОтчетСтатистикаФормаП4ФормаОтчета2012Кв1(ПоказателиОтчета) Экспорт
	
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П0001001В1", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П0001002В1", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П0001002А1", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П010000202", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П010000203", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П010000205", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П010000206", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П010000208", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П010000209", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П010000211", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П030001801", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П030002001", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П030002401", Истина, Ложь);

КонецПроцедуры

Процедура ЗаполнитьРегламентированныйОтчетСтатистикаФормаП4ФормаОтчета2012Кв1(ПараметрыОтчета, Контейнер) Экспорт
	
	П0001001В1 = "";
	П0001002В1 = "";
	П0001002А1 = "";
	
	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("Организация",    ПараметрыОтчета.Организация);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.КодОКВЭД КАК КодОКВЭД,
	|	Организации.НаименованиеОКВЭД КАК НаименованиеОКВЭД
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка = &Организация";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		П0001001В1 = Выборка.КодОКВЭД;
		П0001002В1 = Выборка.КодОКВЭД;
		П0001002А1 = Выборка.НаименованиеОКВЭД;
	КонецЕсли;		
	
	Запрос.УстановитьПараметр("НачалоГода", 		       НачалоГода(ПараметрыОтчета.ДатаКонцаПериодаОтчета));
	Запрос.УстановитьПараметр("ОкончаниеИнтервала", 	   КонецМесяца(ПараметрыОтчета.ДатаКонцаПериодаОтчета));
	Запрос.УстановитьПараметр("ОкончаниеПериодаИнтервала", КонецМесяца(ПараметрыОтчета.ДатаКонцаПериодаОтчета));
	Запрос.УстановитьПараметр("КонецКвартала", 		       КонецМесяца(ПараметрыОтчета.ДатаКонцаПериодаОтчета));	
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ТекущиеКадровыеДанныеСотрудников.Сотрудник) КАК КоличествоСотрудников
	|ИЗ
	|	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	|ГДЕ
	|	(ТекущиеКадровыеДанныеСотрудников.ТекущаяОрганизация = &Организация
	|			ИЛИ ТекущиеКадровыеДанныеСотрудников.ТекущаяОрганизация ЕСТЬ NULL )
	|	И (ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1)
	|			И ТекущиеКадровыеДанныеСотрудников.ДатаПриема <= &ОкончаниеПериодаИнтервала)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Возврат;
	Иначе
		ФормироватьСНачалаГода = Выборка.КоличествоСотрудников > 15;
	КонецЕсли;
	
	ВидыВыплатСоциальногоХарактера = Новый Массив;
	ВидыВыплатСоциальногоХарактера.Добавить(Перечисления.ВидыНачисленийОплатыТрудаДляНУ.пп9ст255);
	ВидыВыплатСоциальногоХарактера.Добавить(Перечисления.ВидыНачисленийОплатыТрудаДляНУ.пп12_1ст255);
	ВидыВыплатСоциальногоХарактера.Добавить(Перечисления.ВидыНачисленийОплатыТрудаДляНУ.пп13ст255);
	ВидыВыплатСоциальногоХарактера.Добавить(Перечисления.ВидыНачисленийОплатыТрудаДляНУ.пп16ст255);
	ВидыВыплатСоциальногоХарактера.Добавить("2710");		
	ВидыВыплатСоциальногоХарактера.Добавить("2720");
	ВидыВыплатСоциальногоХарактера.Добавить("2760");
	ВидыВыплатСоциальногоХарактера.Добавить("2762");
	ВидыВыплатСоциальногоХарактера.Добавить("2510");		
	
	Запрос.УстановитьПараметр("ВидыВыплатСоциальногоХарактера", ВидыВыплатСоциальногоХарактера);
	
	Если НЕ ФормироватьСНачалаГода Тогда
		Запрос.УстановитьПараметр("НачалоПериодаИнтервала",    НачалоМесяца(ПараметрыОтчета.ДатаНачалаПериодаОтчета));
		Запрос.УстановитьПараметр("НачалоИнтервала", 		   НачалоМесяца(ПараметрыОтчета.ДатаНачалаПериодаОтчета));
	Иначе
		Запрос.УстановитьПараметр("НачалоПериодаИнтервала",    НачалоГода(ПараметрыОтчета.ДатаНачалаПериодаОтчета));
		Запрос.УстановитьПараметр("НачалоИнтервала", 		   НачалоГода(ПараметрыОтчета.ДатаНачалаПериодаОтчета));
	КонецЕсли;
	
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	0 КАК Цифра
	 |ПОМЕСТИТЬ Цифры
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	1
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	2
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	3
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	4
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	5
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	6
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	7
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	8
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	9
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВЫБОР
	 |		КОГДА &НачалоПериодаИнтервала <> ДАТАВРЕМЯ(1, 1, 1)
	 |			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&НачалоПериодаИнтервала, ДЕНЬ, Цифры.Цифра + ЕСТЬNULL(Цифры10.Цифра, 0) * 10 + ЕСТЬNULL(Цифры100.Цифра, 0) * 100 + ЕСТЬNULL(Цифры1000.Цифра, 0) * 1000 + ЕСТЬNULL(Цифры10000.Цифра, 0) * 10000 + ЕСТЬNULL(Цифры100000.Цифра, 0) * 100000), ДЕНЬ)
	 |		ИНАЧЕ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1980, 1, 1), ДЕНЬ, Цифры.Цифра + ЕСТЬNULL(Цифры10.Цифра, 0) * 10 + ЕСТЬNULL(Цифры100.Цифра, 0) * 100 + ЕСТЬNULL(Цифры1000.Цифра, 0) * 1000 + ЕСТЬNULL(Цифры10000.Цифра, 0) * 10000 + ЕСТЬNULL(Цифры100000.Цифра, 0) * 100000), ДЕНЬ)
	 |	КОНЕЦ КАК Дата
	 |ПОМЕСТИТЬ Календарь
	 |ИЗ
	 |	Цифры КАК Цифры
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Цифры КАК Цифры10
	 |		ПО (РАЗНОСТЬДАТ(&НачалоПериодаИнтервала, &ОкончаниеПериодаИнтервала, ДЕНЬ) > 9)
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Цифры КАК Цифры100
	 |		ПО (РАЗНОСТЬДАТ(&НачалоПериодаИнтервала, &ОкончаниеПериодаИнтервала, ДЕНЬ) > 99)
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Цифры КАК Цифры1000
	 |		ПО (РАЗНОСТЬДАТ(&НачалоПериодаИнтервала, &ОкончаниеПериодаИнтервала, ДЕНЬ) > 999)
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Цифры КАК Цифры10000
	 |		ПО (РАЗНОСТЬДАТ(&НачалоПериодаИнтервала, &ОкончаниеПериодаИнтервала, ДЕНЬ) > 9999)
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Цифры КАК Цифры100000
	 |		ПО (РАЗНОСТЬДАТ(&НачалоПериодаИнтервала, &ОкончаниеПериодаИнтервала, ДЕНЬ) > 99999)
	 |ГДЕ
	 |	ВЫБОР
	 |			КОГДА &НачалоПериодаИнтервала <> ДАТАВРЕМЯ(1, 1, 1)
	 |				ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&НачалоПериодаИнтервала, ДЕНЬ, Цифры.Цифра + ЕСТЬNULL(Цифры10.Цифра, 0) * 10 + ЕСТЬNULL(Цифры100.Цифра, 0) * 100 + ЕСТЬNULL(Цифры1000.Цифра, 0) * 1000 + ЕСТЬNULL(Цифры10000.Цифра, 0) * 10000 + ЕСТЬNULL(Цифры100000.Цифра, 0) * 100000), ДЕНЬ)
	 |			ИНАЧЕ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1980, 1, 1), ДЕНЬ, Цифры.Цифра + ЕСТЬNULL(Цифры10.Цифра, 0) * 10 + ЕСТЬNULL(Цифры100.Цифра, 0) * 100 + ЕСТЬNULL(Цифры1000.Цифра, 0) * 1000 + ЕСТЬNULL(Цифры10000.Цифра, 0) * 10000 + ЕСТЬNULL(Цифры100000.Цифра, 0) * 100000), ДЕНЬ)
	 |		КОНЕЦ МЕЖДУ &НачалоИнтервала И &ОкончаниеИнтервала
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |УНИЧТОЖИТЬ Цифры
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	Календарь.Дата КАК Дата,
	 |	НАЧАЛОПЕРИОДА(Календарь.Дата, МЕСЯЦ) КАК Месяц
	 |ПОМЕСТИТЬ ВТСписокДат
	 |ИЗ
	 |	Календарь КАК Календарь
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ТекущиеКадровыеДанныеСотрудников.Сотрудник КАК Сотрудник,
	 |	СписокДат.Дата КАК Дата,
	 |	СписокДат.Месяц,
	 |	ЛОЖЬ КАК Совместитель
	 |ПОМЕСТИТЬ ВТДатыИСотрудники
	 |ИЗ
	 |	ВТСписокДат КАК СписокДат
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	 |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	 |			ПО ТекущиеКадровыеДанныеСотрудников.Сотрудник = Сотрудники.Ссылка
	 |				И (ТекущиеКадровыеДанныеСотрудников.ТекущийВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ОсновноеМестоРаботы))
	 |		ПО СписокДат.Дата >= ТекущиеКадровыеДанныеСотрудников.ДатаПриема
	 |			И (СписокДат.Дата <= ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения
	 |					И ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1)
	 |				ИЛИ ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1))
	 |ГДЕ
	 |	ТекущиеКадровыеДанныеСотрудников.ТекущаяОрганизация = &Организация
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	ТекущиеКадровыеДанныеСотрудников.Сотрудник,
	 |	СписокДат.Дата,
	 |	СписокДат.Месяц,
	 |	ИСТИНА
	 |ИЗ
	 |	ВТСписокДат КАК СписокДат
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	 |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	 |			ПО ТекущиеКадровыеДанныеСотрудников.Сотрудник = Сотрудники.Ссылка
	 |				И (ТекущиеКадровыеДанныеСотрудников.ТекущийВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.Совместительство))
	 |		ПО СписокДат.Дата >= ТекущиеКадровыеДанныеСотрудников.ДатаПриема
	 |			И (СписокДат.Дата <= ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения
	 |					И ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1)
	 |				ИЛИ ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1))
	 |ГДЕ
	 |	ТекущиеКадровыеДанныеСотрудников.ТекущаяОрганизация = &Организация
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	СУММА(ВЫБОР
	 |			КОГДА СписокДат.Сотрудник ЕСТЬ НЕ NULL 
	 |				ТОГДА 1
	 |			ИНАЧЕ 0
	 |		КОНЕЦ) КАК КоличествоСотрудников,
	 |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СписокДат.Дата) КАК ДнейВМесяце,
	 |	СписокДат.Месяц,
	 |	СписокДат.Совместитель
	 |ПОМЕСТИТЬ ВТСредняяЧисленностьПоМесяцам
	 |ИЗ
	 |	ВТДатыИСотрудники КАК СписокДат
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	СписокДат.Месяц,
	 |	СписокДат.Совместитель
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	НачислениеЗарплатыНачисления.Сотрудник,
	 |	НачислениеЗарплатыНачисления.ОтработаноЧасов,
	 |	НачислениеЗарплатыНачисления.Ссылка.МесяцНачисления,
	 |	НачислениеЗарплатыНачисления.Результат,
	 |	НачислениеЗарплатыНачисления.Начисление
	 |ПОМЕСТИТЬ ВТНачислениеЗарплаты
	 |ИЗ
	 |	Документ.НачислениеЗарплаты.Начисления КАК НачислениеЗарплатыНачисления
	 |ГДЕ
	 |	НачислениеЗарплатыНачисления.Ссылка.Организация = &Организация
	 |	И НачислениеЗарплатыНачисления.Ссылка.МесяцНачисления МЕЖДУ &НачалоИнтервала И &ОкончаниеИнтервала
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВТДатыИСотрудники.Сотрудник,
	 |	ВТДатыИСотрудники.Месяц,
	 |	ВТДатыИСотрудники.Совместитель
	 |ПОМЕСТИТЬ ВТСписокСотрудниковИДат
	 |ИЗ
	 |	ВТДатыИСотрудники КАК ВТДатыИСотрудники
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ВТДатыИСотрудники.Сотрудник,
	 |	ВТДатыИСотрудники.Месяц,
	 |	ВТДатыИСотрудники.Совместитель
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	Начисления.Ссылка КАК Начисление
	 |ПОМЕСТИТЬ ВТВидыНачисленийСоциальногоХарактера
	 |ИЗ
	 |	ПланВидовРасчета.Начисления КАК Начисления
	 |ГДЕ
	 |	(Начисления.ВидНачисленияДляНУ В (&ВидыВыплатСоциальногоХарактера)
	 |			ИЛИ Начисления.КодДоходаНДФЛ.Код В (&ВидыВыплатСоциальногоХарактера))
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВЫБОР
	 |		КОГДА СредняяЧисленностьПоМесяцам.Совместитель
	 |			ТОГДА 0
	 |		ИНАЧЕ ЕСТЬNULL(СУММА(ВЫРАЗИТЬ(СредняяЧисленностьПоМесяцам.КоличествоСотрудников / СредняяЧисленностьПоМесяцам.ДнейВМесяце КАК ЧИСЛО(15, 0))) / КОЛИЧЕСТВО(СредняяЧисленностьПоМесяцам.Месяц), 0)
	 |	КОНЕЦ КАК СреднесписочнаяЧисленность,
	 |	ВЫБОР
	 |		КОГДА СредняяЧисленностьПоМесяцам.Совместитель
	 |			ТОГДА ЕСТЬNULL(СУММА(ВЫРАЗИТЬ(СредняяЧисленностьПоМесяцам.КоличествоСотрудников / СредняяЧисленностьПоМесяцам.ДнейВМесяце КАК ЧИСЛО(15, 0))) / КОЛИЧЕСТВО(СредняяЧисленностьПоМесяцам.Месяц), 0)
	 |		ИНАЧЕ 0
	 |	КОНЕЦ КАК СреднесписочнаяЧисленностьСовместители
	 |ИЗ
	 |	ВТСредняяЧисленностьПоМесяцам КАК СредняяЧисленностьПоМесяцам
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	СредняяЧисленностьПоМесяцам.Совместитель
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВЫРАЗИТЬ(ЕСТЬNULL(НачислениеЗарплатыНачисления.Результат, 0) / 1000 КАК ЧИСЛО(15, 1)) КАК ВыплатыСоциальногоХарактера,
	 |	НачислениеЗарплатыНачисления.Сотрудник
	 |ИЗ
	 |	Документ.НачислениеЗарплаты.Начисления КАК НачислениеЗарплатыНачисления
	 |ГДЕ
	 |	НачислениеЗарплатыНачисления.Ссылка.Организация = &Организация
	 |	И НачислениеЗарплатыНачисления.Ссылка.МесяцНачисления МЕЖДУ &НачалоГода И &ОкончаниеИнтервала
	 |	И НачислениеЗарплатыНачисления.Начисление В
	 |			(ВЫБРАТЬ
	 |				ВидыНачисленийСоциальногоХарактера.Начисление КАК Начисление
	 |			ИЗ
	 |				ВТВидыНачисленийСоциальногоХарактера КАК ВидыНачисленийСоциальногоХарактера)
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВТСписокСотрудниковИДат.Сотрудник,
	 |	ВТСписокСотрудниковИДат.Месяц,
	 |	СУММА(ЕСТЬNULL(ВТНачислениеЗарплаты.ОтработаноЧасов, 0)) КАК ОтработаноЧасов,
	 |	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(ВТНачислениеЗарплаты.Результат, 0) / 1000 КАК ЧИСЛО(15, 1))) КАК Результат,
	 |	0 КАК ОтработаноЧасовСовместитель,
	 |	0 КАК РезультатСовместитель,
	 |	ВТСписокСотрудниковИДат.Совместитель
	 |ИЗ
	 |	ВТСписокСотрудниковИДат КАК ВТСписокСотрудниковИДат
	 |		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачислениеЗарплаты КАК ВТНачислениеЗарплаты
	 |		ПО ВТСписокСотрудниковИДат.Сотрудник = ВТНачислениеЗарплаты.Сотрудник
	 |			И ВТСписокСотрудниковИДат.Месяц = ВТНачислениеЗарплаты.МесяцНачисления
	 |ГДЕ
	 |	НЕ ВТСписокСотрудниковИДат.Совместитель
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ВТСписокСотрудниковИДат.Сотрудник,
	 |	ВТСписокСотрудниковИДат.Месяц,
	 |	ВТСписокСотрудниковИДат.Совместитель
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	ВТСписокСотрудниковИДат.Сотрудник,
	 |	ВТСписокСотрудниковИДат.Месяц,
	 |	0,
	 |	0,
	 |	СУММА(ЕСТЬNULL(ВТНачислениеЗарплаты.ОтработаноЧасов, 0)),
	 |	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(ВТНачислениеЗарплаты.Результат, 0) / 1000 КАК ЧИСЛО(15, 1))),
	 |	ВТСписокСотрудниковИДат.Совместитель
	 |ИЗ
	 |	ВТСписокСотрудниковИДат КАК ВТСписокСотрудниковИДат
	 |		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачислениеЗарплаты КАК ВТНачислениеЗарплаты
	 |		ПО ВТСписокСотрудниковИДат.Сотрудник = ВТНачислениеЗарплаты.Сотрудник
	 |			И ВТСписокСотрудниковИДат.Месяц = ВТНачислениеЗарплаты.МесяцНачисления
	 |ГДЕ
	 |	ВТСписокСотрудниковИДат.Совместитель
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ВТСписокСотрудниковИДат.Сотрудник,
	 |	ВТСписокСотрудниковИДат.Месяц,
	 |	ВТСписокСотрудниковИДат.Совместитель
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	КОЛИЧЕСТВО(ТекущиеКадровыеДанныеСотрудников.ДатаПриема) КАК Принятые,
	 |	0 КАК Уволенные
	 |ИЗ
	 |	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	 |		ПО ТекущиеКадровыеДанныеСотрудников.Сотрудник = Сотрудники.Ссылка
	 |			И (ТекущиеКадровыеДанныеСотрудников.ТекущийВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ОсновноеМестоРаботы))
	 |ГДЕ
	 |	ТекущиеКадровыеДанныеСотрудников.ДатаПриема >= &НачалоГода
	 |	И ТекущиеКадровыеДанныеСотрудников.ТекущаяОрганизация = &Организация
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	0,
	 |	КОЛИЧЕСТВО(ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения)
	 |ИЗ
	 |	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	 |		ПО ТекущиеКадровыеДанныеСотрудников.Сотрудник = Сотрудники.Ссылка
	 |			И (ТекущиеКадровыеДанныеСотрудников.ТекущийВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ОсновноеМестоРаботы))
	 |ГДЕ
	 |	ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения <= &ОкончаниеПериодаИнтервала
	 |	И ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1)
	 |	И ТекущиеКадровыеДанныеСотрудников.ТекущаяОрганизация = &Организация";
	 
	 Запрос.ВыполнитьПакет();
	 
	 Результаты = Запрос.ВыполнитьПакет();
	 КоличестовРезультатов = Результаты.Количество();
	 
	 СведенияОЧисленности           = Результаты[КоличестовРезультатов-4].Выбрать();
	 П010000202 = 0;
	 П010000203 = 0;
	 Пока СведенияОЧисленности.Следующий() Цикл
		 П010000202 = П010000202 + СведенияОЧисленности.СреднесписочнаяЧисленность;
		 П010000203 = П010000203 + СведенияОЧисленности.СреднесписочнаяЧисленностьСовместители;
	 КонецЦикла;
	 
	 СведенияОСоциальныхВыплатах    = Результаты[КоличестовРезультатов-3].Выбрать();
	 П010000211 = 0;
	 Пока СведенияОСоциальныхВыплатах.Следующий() Цикл
		 П010000211 = П010000211 + СведенияОСоциальныхВыплатах.ВыплатыСоциальногоХарактера;
	 КонецЦикла;
	 
	 СведенияОЗаработнойПлате       = Результаты[КоличестовРезультатов-2].Выбрать();
	 П010000205 = 0;
	 П010000206 = 0;
	 П010000208 = 0;
	 П010000209 = 0;
	 Пока СведенияОЗаработнойПлате.Следующий() Цикл
		 П010000205 = П010000205 + СведенияОЗаработнойПлате.ОтработаноЧасов;
		 П010000206 = П010000206 + СведенияОЗаработнойПлате.ОтработаноЧасовСовместитель;
		 П010000208 = П010000208 + СведенияОЗаработнойПлате.Результат;
		 П010000209 = П010000209 + СведенияОЗаработнойПлате.РезультатСовместитель;
	 КонецЦикла;
	 
	 СведенияОбИзмененииЧисленности = Результаты[КоличестовРезультатов-1].Выбрать();
	 П030001801 = 0;
	 П030002001 = 0;
	 Пока СведенияОбИзмененииЧисленности.Следующий() Цикл
		 П030001801 = П030001801 + СведенияОбИзмененииЧисленности.Принятые;
		 П030002001 = П030002001 + СведенияОбИзмененииЧисленности.Уволенные;
	 КонецЦикла;
	 
	 ПоляОтчета = Контейнер.ПолеТабличногоДокументаФормаОтчета;
	 
	 ПоляОтчета.П0001001В1 = П0001001В1;
	 ПоляОтчета.П0001002В1 = П0001002В1;
	 ПоляОтчета.П0001002А1 = П0001002А1;
	 
	 ПоляОтчета.П010000202 = П010000202;
	 ПоляОтчета.П010000203 = П010000203;
	 ПоляОтчета.П010000205 = П010000205;
	 ПоляОтчета.П010000206 = П010000206;
	 ПоляОтчета.П010000211 = П010000211;
	 ПоляОтчета.П010000205 = П010000205;
	 ПоляОтчета.П010000206 = П010000206;
	 ПоляОтчета.П010000208 = П010000208;
	 ПоляОтчета.П010000209 = П010000209;
	 ПоляОтчета.П030001801 = П030001801;
	 ПоляОтчета.П030002001 = П030002001;
	 ПоляОтчета.П030002401 = П010000202;
	 
КонецПроцедуры

Функция СведенияОЧисленностиИВыплатах(Знач Организация, Знач ДатаНачала, Знач ДатаКонца, Знач ФормироватьСНачалаГода) Экспорт
	
	ВидыВыплатСоциальногоХарактера = Новый Массив;
	ВидыВыплатСоциальногоХарактера.Добавить(Перечисления.ВидыНачисленийОплатыТрудаДляНУ.пп9ст255);
	ВидыВыплатСоциальногоХарактера.Добавить(Перечисления.ВидыНачисленийОплатыТрудаДляНУ.пп12_1ст255);
	ВидыВыплатСоциальногоХарактера.Добавить(Перечисления.ВидыНачисленийОплатыТрудаДляНУ.пп13ст255);
	ВидыВыплатСоциальногоХарактера.Добавить(Перечисления.ВидыНачисленийОплатыТрудаДляНУ.пп16ст255);
	ВидыВыплатСоциальногоХарактера.Добавить("2710");
	ВидыВыплатСоциальногоХарактера.Добавить("2720");
	ВидыВыплатСоциальногоХарактера.Добавить("2760");
	ВидыВыплатСоциальногоХарактера.Добавить("2762");
	ВидыВыплатСоциальногоХарактера.Добавить("2510");
	
	ВидыИсключаемыхВыплат = Новый Массив;
	ВидВыплаты = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыДоходовПоСтраховымВзносам.ПособияЗаСчетФСС");
	Если ВидВыплаты <> Неопределено Тогда
		ВидыИсключаемыхВыплат.Добавить(ВидВыплаты);
	КонецЕсли;
	ВидВыплаты = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыДоходовПоСтраховымВзносам.ПособияЗаСчетФСС_НС");
	Если ВидВыплаты <> Неопределено Тогда
		ВидыИсключаемыхВыплат.Добавить(ВидВыплаты);
	КонецЕсли;
	ВидыИсключаемыхВыплат.Добавить("2300");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидыВыплатСоциальногоХарактера",	ВидыВыплатСоциальногоХарактера);
	Запрос.УстановитьПараметр("ВидыИсключаемыхВыплат",			ВидыИсключаемыхВыплат);
	Запрос.УстановитьПараметр("НачалоГода",						НачалоГода(ДатаКонца));
	Запрос.УстановитьПараметр("ОкончаниеИнтервала",				КонецМесяца(ДатаКонца));
	Запрос.УстановитьПараметр("ОкончаниеПериодаИнтервала",		КонецМесяца(ДатаКонца));
	Запрос.УстановитьПараметр("КонецКвартала",					КонецМесяца(ДатаКонца));
	Запрос.УстановитьПараметр("Организация",					Организация);
	
	Если НЕ ФормироватьСНачалаГода Тогда
		Запрос.УстановитьПараметр("НачалоПериодаИнтервала",		НачалоМесяца(ДатаНачала));
		Запрос.УстановитьПараметр("НачалоИнтервала",			НачалоМесяца(ДатаНачала));
	Иначе
		Запрос.УстановитьПараметр("НачалоПериодаИнтервала",		НачалоГода(ДатаНачала));
		Запрос.УстановитьПараметр("НачалоИнтервала",			НачалоГода(ДатаНачала));
	КонецЕсли;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	0 КАК Цифра
		|ПОМЕСТИТЬ Цифры
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	3
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	4
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	5
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	6
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	7
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	8
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	9
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА &НачалоПериодаИнтервала <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&НачалоПериодаИнтервала, ДЕНЬ, Цифры.Цифра + ЕСТЬNULL(Цифры10.Цифра, 0) * 10 + ЕСТЬNULL(Цифры100.Цифра, 0) * 100 + ЕСТЬNULL(Цифры1000.Цифра, 0) * 1000 + ЕСТЬNULL(Цифры10000.Цифра, 0) * 10000 + ЕСТЬNULL(Цифры100000.Цифра, 0) * 100000), ДЕНЬ)
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1980, 1, 1), ДЕНЬ, Цифры.Цифра + ЕСТЬNULL(Цифры10.Цифра, 0) * 10 + ЕСТЬNULL(Цифры100.Цифра, 0) * 100 + ЕСТЬNULL(Цифры1000.Цифра, 0) * 1000 + ЕСТЬNULL(Цифры10000.Цифра, 0) * 10000 + ЕСТЬNULL(Цифры100000.Цифра, 0) * 100000), ДЕНЬ)
		|	КОНЕЦ КАК Дата
		|ПОМЕСТИТЬ Календарь
		|ИЗ
		|	Цифры КАК Цифры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Цифры КАК Цифры10
		|		ПО (РАЗНОСТЬДАТ(&НачалоПериодаИнтервала, &ОкончаниеПериодаИнтервала, ДЕНЬ) > 9)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Цифры КАК Цифры100
		|		ПО (РАЗНОСТЬДАТ(&НачалоПериодаИнтервала, &ОкончаниеПериодаИнтервала, ДЕНЬ) > 99)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Цифры КАК Цифры1000
		|		ПО (РАЗНОСТЬДАТ(&НачалоПериодаИнтервала, &ОкончаниеПериодаИнтервала, ДЕНЬ) > 999)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Цифры КАК Цифры10000
		|		ПО (РАЗНОСТЬДАТ(&НачалоПериодаИнтервала, &ОкончаниеПериодаИнтервала, ДЕНЬ) > 9999)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Цифры КАК Цифры100000
		|		ПО (РАЗНОСТЬДАТ(&НачалоПериодаИнтервала, &ОкончаниеПериодаИнтервала, ДЕНЬ) > 99999)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &НачалоПериодаИнтервала <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&НачалоПериодаИнтервала, ДЕНЬ, Цифры.Цифра + ЕСТЬNULL(Цифры10.Цифра, 0) * 10 + ЕСТЬNULL(Цифры100.Цифра, 0) * 100 + ЕСТЬNULL(Цифры1000.Цифра, 0) * 1000 + ЕСТЬNULL(Цифры10000.Цифра, 0) * 10000 + ЕСТЬNULL(Цифры100000.Цифра, 0) * 100000), ДЕНЬ)
		|			ИНАЧЕ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1980, 1, 1), ДЕНЬ, Цифры.Цифра + ЕСТЬNULL(Цифры10.Цифра, 0) * 10 + ЕСТЬNULL(Цифры100.Цифра, 0) * 100 + ЕСТЬNULL(Цифры1000.Цифра, 0) * 1000 + ЕСТЬNULL(Цифры10000.Цифра, 0) * 10000 + ЕСТЬNULL(Цифры100000.Цифра, 0) * 100000), ДЕНЬ)
		|		КОНЕЦ МЕЖДУ &НачалоИнтервала И &ОкончаниеИнтервала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Цифры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Календарь.Дата КАК Дата,
		|	НАЧАЛОПЕРИОДА(Календарь.Дата, МЕСЯЦ) КАК Месяц
		|ПОМЕСТИТЬ ВТСписокДат
		|ИЗ
		|	Календарь КАК Календарь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТекущиеКадровыеДанныеСотрудников.Сотрудник КАК Сотрудник,
		|	СписокДат.Дата КАК Дата,
		|	СписокДат.Месяц,
		|	ЛОЖЬ КАК Совместитель
		|ПОМЕСТИТЬ ВТДатыИСотрудники
		|ИЗ
		|	ВТСписокДат КАК СписокДат
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		|			ПО ТекущиеКадровыеДанныеСотрудников.Сотрудник = Сотрудники.Ссылка
		|				И (ТекущиеКадровыеДанныеСотрудников.ТекущийВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ОсновноеМестоРаботы))
		|		ПО СписокДат.Дата >= ТекущиеКадровыеДанныеСотрудников.ДатаПриема
		|			И (СписокДат.Дата <= ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения
		|					И ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1))
		|ГДЕ
		|	ТекущиеКадровыеДанныеСотрудников.ТекущаяОрганизация = &Организация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТекущиеКадровыеДанныеСотрудников.Сотрудник,
		|	СписокДат.Дата,
		|	СписокДат.Месяц,
		|	ИСТИНА
		|ИЗ
		|	ВТСписокДат КАК СписокДат
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		|			ПО ТекущиеКадровыеДанныеСотрудников.Сотрудник = Сотрудники.Ссылка
		|				И (ТекущиеКадровыеДанныеСотрудников.ТекущийВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.Совместительство))
		|		ПО СписокДат.Дата >= ТекущиеКадровыеДанныеСотрудников.ДатаПриема
		|			И (СписокДат.Дата <= ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения
		|					И ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1))
		|ГДЕ
		|	ТекущиеКадровыеДанныеСотрудников.ТекущаяОрганизация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА СписокДат.Сотрудник ЕСТЬ НЕ NULL 
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоСотрудников,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СписокДат.Дата) КАК ДнейВМесяце,
		|	СписокДат.Месяц,
		|	СписокДат.Совместитель
		|ПОМЕСТИТЬ ВТСредняяЧисленностьПоМесяцам
		|ИЗ
		|	ВТДатыИСотрудники КАК СписокДат
		|
		|СГРУППИРОВАТЬ ПО
		|	СписокДат.Месяц,
		|	СписокДат.Совместитель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Начисления.Ссылка КАК Начисление
		|ПОМЕСТИТЬ ВТВидыИсключаемыхВыплат
		|ИЗ
		|	ПланВидовРасчета.Начисления КАК Начисления
		|ГДЕ
		|	(Начисления.ВидНачисленияДляНУ В (&ВидыИсключаемыхВыплат)
		|			ИЛИ Начисления.КодДоходаНДФЛ.Код В (&ВидыИсключаемыхВыплат))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Начисления.Ссылка КАК Начисление
		|ПОМЕСТИТЬ ВТВидыНачисленийСоциальногоХарактера
		|ИЗ
		|	ПланВидовРасчета.Начисления КАК Начисления
		|ГДЕ
		|	(Начисления.ВидНачисленияДляНУ В (&ВидыВыплатСоциальногоХарактера)
		|			ИЛИ Начисления.КодДоходаНДФЛ.Код В (&ВидыВыплатСоциальногоХарактера))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачислениеЗарплатыНачисления.Сотрудник,
		|	НачислениеЗарплатыНачисления.ОтработаноЧасов,
		|	НачислениеЗарплатыНачисления.Ссылка.МесяцНачисления,
		|	НачислениеЗарплатыНачисления.Результат,
		|	НачислениеЗарплатыНачисления.Начисление
		|ПОМЕСТИТЬ ВТНачислениеЗарплаты
		|ИЗ
		|	Документ.НачислениеЗарплаты.Начисления КАК НачислениеЗарплатыНачисления
		|ГДЕ
		|	НачислениеЗарплатыНачисления.Ссылка.Организация = &Организация
		|	И НачислениеЗарплатыНачисления.Ссылка.МесяцНачисления МЕЖДУ &НачалоИнтервала И &ОкончаниеИнтервала
		|	И НЕ НачислениеЗарплатыНачисления.Начисление В
		|				(ВЫБРАТЬ
		|					ВТВидыИсключаемыхВыплат.Начисление
		|				ИЗ
		|					ВТВидыИсключаемыхВыплат КАК ВТВидыИсключаемыхВыплат)
		|	И НачислениеЗарплатыНачисления.Ссылка.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОтпускНачисления.Сотрудник,
		|	0,
		|	ОтпускНачисления.Ссылка.ПериодРегистрации,
		|	ОтпускНачисления.Результат,
		|	ОтпускНачисления.Начисление
		|ИЗ
		|	Документ.Отпуск.Начисления КАК ОтпускНачисления
		|ГДЕ
		|	ОтпускНачисления.Ссылка.Организация = &Организация
		|	И ОтпускНачисления.Ссылка.ПериодРегистрации МЕЖДУ &НачалоИнтервала И &ОкончаниеИнтервала
		|	И НЕ ОтпускНачисления.Начисление В
		|				(ВЫБРАТЬ
		|					ВТВидыИсключаемыхВыплат.Начисление
		|				ИЗ
		|					ВТВидыИсключаемыхВыплат КАК ВТВидыИсключаемыхВыплат)
		|	И ОтпускНачисления.Ссылка.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДатыИСотрудники.Сотрудник,
		|	ВТДатыИСотрудники.Месяц,
		|	ВТДатыИСотрудники.Совместитель
		|ПОМЕСТИТЬ ВТСписокСотрудниковИДат
		|ИЗ
		|	ВТДатыИСотрудники КАК ВТДатыИСотрудники
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТДатыИСотрудники.Сотрудник,
		|	ВТДатыИСотрудники.Месяц,
		|	ВТДатыИСотрудники.Совместитель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА СредняяЧисленностьПоМесяцам.Совместитель
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(СУММА(ВЫРАЗИТЬ(СредняяЧисленностьПоМесяцам.КоличествоСотрудников / СредняяЧисленностьПоМесяцам.ДнейВМесяце КАК ЧИСЛО(15, 0))) / КОЛИЧЕСТВО(СредняяЧисленностьПоМесяцам.Месяц), 0)
		|	КОНЕЦ КАК СреднесписочнаяЧисленность,
		|	ВЫБОР
		|		КОГДА СредняяЧисленностьПоМесяцам.Совместитель
		|			ТОГДА ЕСТЬNULL(СУММА(ВЫРАЗИТЬ(СредняяЧисленностьПоМесяцам.КоличествоСотрудников / СредняяЧисленностьПоМесяцам.ДнейВМесяце КАК ЧИСЛО(15, 0))) / КОЛИЧЕСТВО(СредняяЧисленностьПоМесяцам.Месяц), 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СреднесписочнаяЧисленностьСовместители
		|ИЗ
		|	ВТСредняяЧисленностьПоМесяцам КАК СредняяЧисленностьПоМесяцам
		|
		|СГРУППИРОВАТЬ ПО
		|	СредняяЧисленностьПоМесяцам.Совместитель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ЕСТЬNULL(НачислениеЗарплатыНачисления.Результат, 0) / 1000 КАК ЧИСЛО(15, 1)) КАК ВыплатыСоциальногоХарактера,
		|	НачислениеЗарплатыНачисления.Сотрудник
		|ИЗ
		|	Документ.НачислениеЗарплаты.Начисления КАК НачислениеЗарплатыНачисления
		|ГДЕ
		|	НачислениеЗарплатыНачисления.Ссылка.Организация = &Организация
		|	И НачислениеЗарплатыНачисления.Ссылка.МесяцНачисления МЕЖДУ &НачалоГода И &ОкончаниеИнтервала
		|	И НачислениеЗарплатыНачисления.Начисление В
		|			(ВЫБРАТЬ
		|				ВидыНачисленийСоциальногоХарактера.Начисление КАК Начисление
		|			ИЗ
		|				ВТВидыНачисленийСоциальногоХарактера КАК ВидыНачисленийСоциальногоХарактера)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСписокСотрудниковИДат.Сотрудник,
		|	ВТСписокСотрудниковИДат.Месяц,
		|	СУММА(ЕСТЬNULL(ВТНачислениеЗарплаты.ОтработаноЧасов, 0)) КАК ОтработаноЧасов,
		|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(ВТНачислениеЗарплаты.Результат, 0) / 1000 КАК ЧИСЛО(15, 1))) КАК Результат,
		|	0 КАК ОтработаноЧасовСовместитель,
		|	0 КАК РезультатСовместитель,
		|	ВТСписокСотрудниковИДат.Совместитель
		|ИЗ
		|	ВТСписокСотрудниковИДат КАК ВТСписокСотрудниковИДат
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачислениеЗарплаты КАК ВТНачислениеЗарплаты
		|		ПО ВТСписокСотрудниковИДат.Сотрудник = ВТНачислениеЗарплаты.Сотрудник
		|			И ВТСписокСотрудниковИДат.Месяц = ВТНачислениеЗарплаты.МесяцНачисления
		|ГДЕ
		|	НЕ ВТСписокСотрудниковИДат.Совместитель
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСписокСотрудниковИДат.Сотрудник,
		|	ВТСписокСотрудниковИДат.Месяц,
		|	ВТСписокСотрудниковИДат.Совместитель
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТСписокСотрудниковИДат.Сотрудник,
		|	ВТСписокСотрудниковИДат.Месяц,
		|	0,
		|	0,
		|	СУММА(ЕСТЬNULL(ВТНачислениеЗарплаты.ОтработаноЧасов, 0)),
		|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(ВТНачислениеЗарплаты.Результат, 0) / 1000 КАК ЧИСЛО(15, 1))),
		|	ВТСписокСотрудниковИДат.Совместитель
		|ИЗ
		|	ВТСписокСотрудниковИДат КАК ВТСписокСотрудниковИДат
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачислениеЗарплаты КАК ВТНачислениеЗарплаты
		|		ПО ВТСписокСотрудниковИДат.Сотрудник = ВТНачислениеЗарплаты.Сотрудник
		|			И ВТСписокСотрудниковИДат.Месяц = ВТНачислениеЗарплаты.МесяцНачисления
		|ГДЕ
		|	ВТСписокСотрудниковИДат.Совместитель
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСписокСотрудниковИДат.Сотрудник,
		|	ВТСписокСотрудниковИДат.Месяц,
		|	ВТСписокСотрудниковИДат.Совместитель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(ТекущиеКадровыеДанныеСотрудников.ДатаПриема) КАК Принятые,
		|	0 КАК Уволенные
		|ИЗ
		|	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		|		ПО ТекущиеКадровыеДанныеСотрудников.Сотрудник = Сотрудники.Ссылка
		|			И (ТекущиеКадровыеДанныеСотрудников.ТекущийВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ОсновноеМестоРаботы))
		|ГДЕ
		|	ТекущиеКадровыеДанныеСотрудников.ДатаПриема >= &НачалоГода
		|	И ТекущиеКадровыеДанныеСотрудников.ТекущаяОрганизация = &Организация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	КОЛИЧЕСТВО(ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения)
		|ИЗ
		|	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		|		ПО ТекущиеКадровыеДанныеСотрудников.Сотрудник = Сотрудники.Ссылка
		|			И (ТекущиеКадровыеДанныеСотрудников.ТекущийВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ОсновноеМестоРаботы))
		|ГДЕ
		|	ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения <= &ОкончаниеПериодаИнтервала
		|	И ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1)
		|	И ТекущиеКадровыеДанныеСотрудников.ТекущаяОрганизация = &Организация";
	
	Возврат Запрос.ВыполнитьПакет();

КонецФункции

//***********************************
// 4-ФСС

Функция ПолучитьСведенияОПоказателях4ФСС(ПоказателиОтчета) Экспорт
	
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000020016001", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000020016104", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000020016105", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000020016101", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000020016204", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000020016205", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000020016201", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000020016304", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000020016305", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000020016301", Истина, Истина);
	
	Возврат ПоказателиОтчета;
	
КонецФункции

Процедура ЗаполнитьРегламентированныйОтчет4ФСС(ПараметрыОтчета, Контейнер) Экспорт
	
	Организация = ПараметрыОтчета.Организация;
	ДатаКонцаПериодаОтчета = ПараметрыОтчета.ДатаКонцаПериодаОтчета;
	НачалоТекущегоКвартала = НачалоКвартала(ДатаКонцаПериодаОтчета);
	
	НачалоПериода = НачалоГода(ДатаКонцаПериодаОтчета);
	ОкончаниеПериода = КонецМесяца(ДатаКонцаПериодаОтчета);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",            Организация);
	Запрос.УстановитьПараметр("НачалоОтчетногоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецОтчетногоПериода",  КонецДня(ДатаКонцаПериодаОтчета));
	Запрос.УстановитьПараметр("НачалоТекущегоКвартала", НачалоТекущегоКвартала);
	Запрос.УстановитьПараметр("КонецПредыдущегоПериода", НачалоТекущегоКвартала-1);
	Запрос.УстановитьПараметр("Месяц1",                 Месяц(НачалоТекущегоКвартала));
	Запрос.УстановитьПараметр("Месяц2",                 Месяц(НачалоТекущегоКвартала) + 1);
	Запрос.УстановитьПараметр("Месяц3",                 Месяц(НачалоТекущегоКвартала) + 2);
	Запрос.УстановитьПараметр("ПустаяДата",             Дата(1,1,1));
	Запрос.УстановитьПараметр("Налог",                  Справочники.ВидыНалоговИПлатежейВБюджет.НалогПоВиду(
															Перечисления.ВидыНалогов.СтраховыеВзносы_ФСС_НСиПЗ, Истина));
	
	УплаченоТекст =
	"ВЫБРАТЬ
	|	СписаниеСРасчетногоСчета.НомерВходящегоДокумента КАК ПлатежноеПоручениеНомер,
	|	СписаниеСРасчетногоСчета.ДатаВходящегоДокумента КАК ПлатежноеПоручениеДата,
	|	СписаниеСРасчетногоСчета.СуммаДокумента КАК ФССНесчастныеСлучаиУплачено,
	|	ВЫБОР
	|		КОГДА СписаниеСРасчетногоСчета.ДатаВходящегоДокумента = &ПустаяДата
	|			ТОГДА НАЧАЛОПЕРИОДА(СписаниеСРасчетногоСчета.Дата, МЕСЯЦ)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(СписаниеСРасчетногоСчета.ДатаВходящегоДокумента, МЕСЯЦ)
	|	КОНЕЦ КАК Период
	|ПОМЕСТИТЬ ВТРасчетыСФондом
	|ИЗ
	|	Документ.СписаниеСРасчетногоСчета КАК СписаниеСРасчетногоСчета
	|ГДЕ
	|	СписаниеСРасчетногоСчета.Проведен
	|	И СписаниеСРасчетногоСчета.ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеНалога)
	|	И СписаниеСРасчетногоСчета.Налог = &Налог
	|	И СписаниеСРасчетногоСчета.ВидНалоговогоОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог)
	|	И СписаниеСРасчетногоСчета.Дата МЕЖДУ &НачалоТекущегоКвартала И &КонецОтчетногоПериода
	|	И СписаниеСРасчетногоСчета.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасходныйКассовыйОрдер.Номер,
	|	РасходныйКассовыйОрдер.Дата,
	|	РасходныйКассовыйОрдер.СуммаДокумента,
	|	НАЧАЛОПЕРИОДА(РасходныйКассовыйОрдер.Дата, МЕСЯЦ)
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	|ГДЕ
	|	РасходныйКассовыйОрдер.Проведен
	|	И РасходныйКассовыйОрдер.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.УплатаНалога)
	|	И РасходныйКассовыйОрдер.Налог = &Налог
	|	И РасходныйКассовыйОрдер.ВидНалоговогоОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог)
	|	И РасходныйКассовыйОрдер.Дата МЕЖДУ &НачалоТекущегоКвартала И &КонецОтчетногоПериода
	|	И РасходныйКассовыйОрдер.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц1
	|			ТОГДА РасчетыСФондом.ФССНесчастныеСлучаиУплачено
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК П000020016101,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц1
	|			ТОГДА РасчетыСФондом.ПлатежноеПоручениеДата
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК П000020016104,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц1
	|			ТОГДА РасчетыСФондом.ПлатежноеПоручениеНомер
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК П000020016105,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц2
	|			ТОГДА РасчетыСФондом.ФССНесчастныеСлучаиУплачено
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК П000020016201,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц2
	|			ТОГДА РасчетыСФондом.ПлатежноеПоручениеДата
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК П000020016204,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц2
	|			ТОГДА РасчетыСФондом.ПлатежноеПоручениеНомер
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК П000020016205,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц3
	|			ТОГДА РасчетыСФондом.ФССНесчастныеСлучаиУплачено
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК П000020016301,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц3
	|			ТОГДА РасчетыСФондом.ПлатежноеПоручениеДата
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК П000020016304,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц3
	|			ТОГДА РасчетыСФондом.ПлатежноеПоручениеНомер
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК П000020016305,
	|	МЕСЯЦ(РасчетыСФондом.Период) КАК МесяцПериода,
	|	РасчетыСФондом.ФССНесчастныеСлучаиУплачено КАК ФССНесчастныеСлучаиУплачено
	|ИЗ
	|	ВТРасчетыСФондом КАК РасчетыСФондом
	|ГДЕ
	|	РасчетыСФондом.ФССНесчастныеСлучаиУплачено <> 0
	|	И МЕСЯЦ(РасчетыСФондом.Период) МЕЖДУ &Месяц1 И &Месяц3
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетыСФондом.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписаниеСРасчетногоСчета.СуммаДокумента КАК П000020016001
	|ИЗ
	|	Документ.СписаниеСРасчетногоСчета КАК СписаниеСРасчетногоСчета
	|ГДЕ
	|	СписаниеСРасчетногоСчета.Проведен
	|	И СписаниеСРасчетногоСчета.ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеНалога)
	|	И СписаниеСРасчетногоСчета.Налог = &Налог
	|	И СписаниеСРасчетногоСчета.ВидНалоговогоОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог)
	|	И СписаниеСРасчетногоСчета.Дата МЕЖДУ &НачалоОтчетногоПериода И &КонецПредыдущегоПериода
	|	И СписаниеСРасчетногоСчета.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасходныйКассовыйОрдер.СуммаДокумента
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	|ГДЕ
	|	РасходныйКассовыйОрдер.Проведен
	|	И РасходныйКассовыйОрдер.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.УплатаНалога)
	|	И РасходныйКассовыйОрдер.Налог = &Налог
	|	И РасходныйКассовыйОрдер.ВидНалоговогоОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог)
	|	И РасходныйКассовыйОрдер.Дата МЕЖДУ &НачалоОтчетногоПериода И &КонецПредыдущегоПериода
	|	И РасходныйКассовыйОрдер.Организация = &Организация";
	
	ПоказателиОтчета = Новый Структура;
	ПолучитьСведенияОПоказателях4ФСС(ПоказателиОтчета);
	
	Контейнер.Таблица2_1_ДанныеДопСтрок.Очистить();
	Контейнер.Таблица2_2_ДанныеДопСтрок.Очистить();
	Контейнер.Таблица2_3_ДанныеДопСтрок.Очистить();
	
	Запрос.Текст = УплаченоТекст;
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Результат = РезультатЗапроса[1].Выгрузить();
	Для каждого СтрокаДанных Из Результат Цикл
		Если СтрокаДанных.ФССНесчастныеСлучаиУплачено <> 0 Тогда
			ИмяКоллекции = "Таблица2_" + (СтрокаДанных.МесяцПериода - Месяц(НачалоТекущегоКвартала) + 1) + "_ДанныеДопСтрок";
			ЗаполнитьЗначенияСвойств(Контейнер[ИмяКоллекции].Добавить(), СтрокаДанных);
		КонецЕсли;
	КонецЦикла;
	
	Результат = РезультатЗапроса[2].Выгрузить();
	Контейнер.Таблица2.П000020016001 = Результат.Итог("П000020016001");
	
КонецПроцедуры

#КонецОбласти

#Область ВариантыОтчетов

// Определяет разделы, в которых доступна панель отчетов.
//
// Параметры:
//   Разделы (Массив) из (ОбъектМетаданных)
//
// Описание:
//   В Разделы необходимо добавить метаданные подсистем тех разделов,
//   в которых размещены команды вызова панелей отчетов.
//
// Например:
//	Разделы.Добавить(Метаданные.Подсистемы.ИмяПодсистемы);
//
Процедура ОпределитьРазделыСВариантамиОтчетов(Разделы) Экспорт
	
	Разделы.Добавить(Метаданные.Подсистемы.ЗарплатаИКадры.Подсистемы.КадровыйУчет);
	Разделы.Добавить(Метаданные.Подсистемы.ЗарплатаИКадры.Подсистемы.Зарплата);
	Разделы.Добавить(Метаданные.Подсистемы.СотрудникиИЗарплата82.Подсистемы.КадровыйУчет);
	Разделы.Добавить(Метаданные.Подсистемы.СотрудникиИЗарплата82.Подсистемы.Зарплата);
	
	Разделы.Добавить(Метаданные.Подсистемы.Отчеты.Подсистемы.Сотрудники);
	
КонецПроцедуры

Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	ЗарплатаКадрыОтчеты.НастроитьВариантыОтчетов(Настройки);
	
КонецПроцедуры

Функция ИспользуетсяТрудЧленовЛетныхЭкипажей() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользуетсяТрудЧленовЛетныхЭкипажей");
	
КонецФункции

Функция ИспользуетсяТрудШахтеров() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользуетсяТрудШахтеров");
	
КонецФункции

Функция ИспользуютсяРаботыСДосрочнойПенсией() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользуютсяРаботыСДосрочнойПенсией");
	
КонецФункции

Функция УдерживаютсяДобровольныеВзносыВПФР() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	Удержания.Ссылка
	|ИЗ
	|	ПланВидовРасчета.Удержания КАК Удержания
	|ГДЕ
	|	Удержания.КатегорияУдержания = ЗНАЧЕНИЕ(Перечисление.КатегорииУдержаний.ДобровольныеВзносыВНПФ)";
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#Область ЗадачиКалендаряБухгалтера

Процедура СоздатьПравилоВыплатаЗарплатыУплатаНДФЛ(МенеджерВременныхТаблиц, Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ИдентификаторЗадачи",                     "НДФЛ_Агент_Уплата");
	Запрос.УстановитьПараметр("ИдентификаторПравилаЗарплата",            "НДФЛ_Уплата");
	Запрос.УстановитьПараметр("ИдентификаторПравилаАванс",               "Аванс");
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗадачиБухгалтера.Ссылка КАК Налог,
	|	ПравилаПредставленияОтчетовУплатыНалогов.Ссылка КАК Правило,
	|	НастройкиУчетаЗарплаты.ДатаВыплатыЗарплаты КАК СрокДней,
	|	0 КАК СрокМесяцев
	|ПОМЕСТИТЬ ПравилоУплатыНДФЛНалоговымАгентом
	|ИЗ
	|	Справочник.ЗадачиБухгалтера КАК ЗадачиБухгалтера
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПравилаПредставленияОтчетовУплатыНалогов КАК ПравилаПредставленияОтчетовУплатыНалогов
	|		ПО ЗадачиБухгалтера.Ссылка = ПравилаПредставленияОтчетовУплатыНалогов.Владелец
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаЗарплаты КАК НастройкиУчетаЗарплаты
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ЗадачиБухгалтера.Код = &ИдентификаторЗадачи
	|	И ПравилаПредставленияОтчетовУплатыНалогов.Код = &ИдентификаторПравилаЗарплата
	|	И НастройкиУчетаЗарплаты.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗадачиБухгалтера.Ссылка,
	|	ПравилаПредставленияОтчетовУплатыНалогов.Ссылка,
	|	НастройкиУчетаЗарплаты.ДатаВыплатыАванса,
	|	-1
	|ИЗ
	|	Справочник.ЗадачиБухгалтера КАК ЗадачиБухгалтера
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПравилаПредставленияОтчетовУплатыНалогов КАК ПравилаПредставленияОтчетовУплатыНалогов
	|		ПО ЗадачиБухгалтера.Ссылка = ПравилаПредставленияОтчетовУплатыНалогов.Владелец
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаЗарплаты КАК НастройкиУчетаЗарплаты
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ЗадачиБухгалтера.Код = &ИдентификаторЗадачи
	|	И ПравилаПредставленияОтчетовУплатыНалогов.Код = &ИдентификаторПравилаАванс
	|	И НастройкиУчетаЗарплаты.Организация = &Организация";
		
	Запрос.Выполнить();
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеМетоды

Функция НеобходимоСформироватьКадровыеПриказы() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ВложенныйЗапрос.КадровыеДокументы) КАК КоличествоКадровыехДокументов,
	|	КОЛИЧЕСТВО(ВложенныйЗапрос.Сотрудники) КАК КоличествоСотрудников
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1
	|		ПриемНаРаботу.Ссылка КАК КадровыеДокументы,
	|		NULL КАК Сотрудники
	|	ИЗ
	|		Документ.ПриемНаРаботу КАК ПриемНаРаботу
	|	ГДЕ
	|		ПриемНаРаботу.ПометкаУдаления = ЛОЖЬ
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ ПЕРВЫЕ 1
	|		КадровыйПеревод.Ссылка,
	|		NULL
	|	ИЗ
	|		Документ.КадровыйПеревод КАК КадровыйПеревод
	|	ГДЕ
	|		КадровыйПеревод.ПометкаУдаления = ЛОЖЬ
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ ПЕРВЫЕ 1
	|		Увольнение.Ссылка,
	|		NULL
	|	ИЗ
	|		Документ.Увольнение КАК Увольнение
	|	ГДЕ
	|		Увольнение.ПометкаУдаления = ЛОЖЬ
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ ПЕРВЫЕ 1
	|		NULL,
	|		Сотрудники.Ссылка
	|	ИЗ
	|		Справочник.Сотрудники КАК Сотрудники
	|	ГДЕ
	|		Сотрудники.ПометкаУдаления = ЛОЖЬ) КАК ВложенныйЗапрос";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Результат = Выборка.КоличествоСотрудников > 0 И Выборка.КоличествоКадровыехДокументов = 0;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

Процедура УстановкаНастроекПоУмолчанию(ИмяРегистра, Запись, ДанныеЗаполнения) Экспорт
	
	Если ИмяРегистра = "СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев" Тогда
		УстановкаНастроекПоУмолчаниюСтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев(Запись, ДанныеЗаполнения);
	ИначеЕсли ИмяРегистра = "ПрименяемыеТарифыСтраховыхВзносов" Тогда
		УстановкаНастроекПоУмолчаниюПрименяемыеТарифыСтраховыхВзносов(Запись, ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановкаНастроекПоУмолчаниюСтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев(Запись, ДанныеЗаполнения)
	
	НастройкиУчета.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"Период",
		НачалоГода(ТекущаяДатаСеанса()));
	
	НастройкиУчета.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"Ставка",
		0);
	
КонецПроцедуры

Процедура УстановкаНастроекПоУмолчаниюПрименяемыеТарифыСтраховыхВзносов(Запись, ДанныеЗаполнения)
	
	НастройкиУчета.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"Период",
		НачалоГода(ТекущаяДатаСеанса()));
	
	Если УчетнаяПолитика.ПрименяетсяУСН(Запись.ГоловнаяОрганизация, Запись.Период) Тогда
		ВидТарифа = Справочники.ВидыТарифовСтраховыхВзносов.УпрощенныйНалоговыйРежим;
	ИначеЕсли УчетнаяПолитика.ПлательщикНалогаНаПрибыль(Запись.ГоловнаяОрганизация, Запись.Период) Тогда
		ВидТарифа = Справочники.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим;
	ИначеЕсли УчетнаяПолитика.ПлательщикЕНВД(Запись.ГоловнаяОрганизация, Запись.Период) Тогда
		ВидТарифа = Справочники.ВидыТарифовСтраховыхВзносов.ЕНВД;
	ИначеЕсли УчетнаяПолитика.ПрименяетсяУСНПатент(Запись.ГоловнаяОрганизация, Запись.Период) Тогда
		ВидТарифа = Справочники.ВидыТарифовСтраховыхВзносов.ИндивидуальныйПредпринимательПрименяющийПатент;
	Иначе
		ВидТарифа = Справочники.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим;
	КонецЕсли;
	
	НастройкиУчета.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"ВидТарифа",
		ВидТарифа);
	
КонецПроцедуры

Функция СформироватьВременнуюТаблицуПеречислениеНДФЛ(ТаблицаПеречислениеНДФЛ, МесяцНалоговогоПериода, РегистрацияВНалоговомОргане,
			ПлатежноеПоручениеДата, ПлатежноеПоручениеНомер)
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТаблицаПеречислениеНДФЛ",      ТаблицаПеречислениеНДФЛ);
	Запрос.УстановитьПараметр("МесяцНалоговогоПериода",       МесяцНалоговогоПериода);
	Запрос.УстановитьПараметр("РеквизитыПлатежногоПоручения", РеквизитыПлатежногоПорученияПоДатеНомеру(ПлатежноеПоручениеДата, ПлатежноеПоручениеНомер));
	Запрос.УстановитьПараметр("РегистрацияВНалоговомОргане",  ?(РегистрацияВНалоговомОргане = Неопределено, Справочники.РегистрацииВНалоговомОргане.ПустаяСсылка(), РегистрацияВНалоговомОргане));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Налоги.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Налоги.Ставка КАК Ставка,
	|	&МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	Налоги.Сумма КАК Сумма,
	|	Налоги.ВключатьВДекларациюПоНалогуНаПрибыль КАК ВключатьВДекларациюПоНалогуНаПрибыль,
	|	Налоги.ИсчисленоПоДивидендам КАК ИсчисленоПоДивидендам,
	|	&РеквизитыПлатежногоПоручения КАК РеквизитыПлатежногоПоручения,
	|	&РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ПОМЕСТИТЬ ВТНалогПеречисленный
	|ИЗ
	|	&ТаблицаПеречислениеНДФЛ КАК Налоги";
	
	Результаты = Запрос.Выполнить();
	
	Возврат Запрос.МенеджерВременныхТаблиц;
	
КонецФункции

Функция РеквизитыПлатежногоПорученияПоДатеНомеру(ДатаПП, НомерПП)
	
	Возврат СтрШаблон(НСтр("ru = '№ %1 от %2'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()), НомерПП, Формат(ДатаПП, "ДФ=дд.ММ.гггг"));
	
КонецФункции

Функция СписокФизическихЛицДокументаВыплаты(Ведомость) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ведомость", Ведомость);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВедомостьНаВыплатуЗарплатыВБанкФизическиеЛица.ФизическоеЛицо
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплатыВБанк.ФизическиеЛица КАК ВедомостьНаВыплатуЗарплатыВБанкФизическиеЛица
	|ГДЕ
	|	ВедомостьНаВыплатуЗарплатыВБанкФизическиеЛица.Ссылка = &Ведомость
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВедомостьНаВыплатуЗарплатыВКассуФизическиеЛица.ФизическоеЛицо
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплатыВКассу.ФизическиеЛица КАК ВедомостьНаВыплатуЗарплатыВКассуФизическиеЛица
	|ГДЕ
	|	ВедомостьНаВыплатуЗарплатыВКассуФизическиеЛица.Ссылка = &Ведомость";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция СтавкиНДФЛФизическихЛиц(ФизическиеЛица, НалоговыйПериод) Экспорт
	
	ДанныеФизЛиц = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, ФизическиеЛица, "СтатусНалогоплательщика", КонецМесяца(НалоговыйПериод));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДанныеФизЛиц", ДанныеФизЛиц);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеФизЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеФизЛиц.СтатусНалогоплательщика КАК СтатусНалогоплательщика
	|ПОМЕСТИТЬ ВТ_ДанныеФизЛиц
	|ИЗ
	|	&ДанныеФизЛиц КАК ДанныеФизЛиц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеФизЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_ДанныеФизЛиц.СтатусНалогоплательщика, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Нерезидент)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|	КОНЕЦ КАК Ставка
	|ИЗ
	|	ВТ_ДанныеФизЛиц КАК ВТ_ДанныеФизЛиц";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ОтразитьРасчетыПоНачисленнымПособиямИП(Параметры, ТаблицаЗаработнойПлаты, ТаблицаИПНачислениеЗарплаты, ТаблицаПрочиеРасходы, Реквизиты, Движения, Отказ)
	
	Если Реквизиты.Период < ДатаНачалаАдминистрированияСтраховыхВзносовФНС() Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Реквизиты.Регистратор) <> Тип("ДокументСсылка.БольничныйЛист") Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаРасчетовПоНачисленнымПособиям = ПодготовитьТаблицуРасчетовПоНачисленнымПособиямИП(ТаблицаЗаработнойПлаты, Реквизиты);
	
	РеквизитыИПТаблица = Параметры.Реквизиты.Скопировать();
	РеквизитыИПТаблица.Колонки.Добавить("СчетУчета",   Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	РеквизитыИПТаблица.Колонки.Добавить("ВидОперации", Перечисления.ТипВсеСсылки());
	
	РеквизитыИПТаблица[0].Период = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Реквизиты.Регистратор, "Дата");
	
	ПеречислениеНалогаИПТаблица = Новый ТаблицаЗначений;
	ПеречислениеНалогаИПТаблица.Колонки.Добавить("ИмяСписка",     ОбщегоНазначения.ОписаниеТипаСтрока(1));
	ПеречислениеНалогаИПТаблица.Колонки.Добавить("СинонимСписка", ОбщегоНазначения.ОписаниеТипаСтрока(1));
	ПеречислениеНалогаИПТаблица.Колонки.Добавить("НомерСтроки",   ОбщегоНазначения.ОписаниеТипаЧисло(1));
	ПеречислениеНалогаИПТаблица.Колонки.Добавить("СчетДт",        Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	ПеречислениеНалогаИПТаблица.Колонки.Добавить("СубконтоДт1",   Новый ОписаниеТипов("ПеречислениеСсылка.ВидыПлатежейВГосБюджет"));
	ПеречислениеНалогаИПТаблица.Колонки.Добавить("СубконтоДт2",   Перечисления.ТипВсеСсылки());
	ПеречислениеНалогаИПТаблица.Колонки.Добавить("СубконтоДт3",   Перечисления.ТипВсеСсылки());
	ПеречислениеНалогаИПТаблица.Колонки.Добавить("СуммаРуб",      ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	
	НоваяСтрока = ПеречислениеНалогаИПТаблица.Добавить();
	НоваяСтрока.СубконтоДт1 = Перечисления.ВидыПлатежейВГосБюджет.Налог;
	
	Для Каждого СтрокаТаблицы ИЗ ТаблицаРасчетовПоНачисленнымПособиям Цикл
		
		СписокПереплат = УчетДоходовИРасходовПредпринимателя.ПолучитьПустуюТаблицуСписокПереплат();
		
		Если СтрокаТаблицы.СуммаПереплаты > 0 Тогда
			НоваяСтрока = СписокПереплат.Добавить();
			НоваяСтрока.Контрагент = Неопределено;
			НоваяСтрока.СчетУчета  = СтрокаТаблицы.СчетУчета;
			НоваяСтрока.Сумма = СтрокаТаблицы.СуммаПереплаты;
			
			РеквизитыИПТаблица[0].СчетУчета = СтрокаТаблицы.СчетУчета;
			
			УчетДоходовИРасходовПредпринимателя.СформироватьДвиженияУплатаВзносовФОТ(
				УчетДоходовИРасходовПредпринимателя.ПолучитьПустуюТаблицуСписокВзносов(),
				СписокПереплат,
				РеквизитыИПТаблица,
				Движения,
				Отказ);
		КонецЕсли;
		
		Если СтрокаТаблицы.СуммаКЗачету <> 0 Тогда
			
			РеквизитыИПТаблица[0].СчетУчета         = СтрокаТаблицы.СчетУчета;
			ПеречислениеНалогаИПТаблица[0].СчетДт   = СтрокаТаблицы.СчетУчета;
			ПеречислениеНалогаИПТаблица[0].СуммаРуб = СтрокаТаблицы.СуммаКЗачету;
			
			
			ТаблицыУплатыВзносовФОТИП = УчетДоходовИРасходовПредпринимателя.ПодготовитьТаблицыУплатыВзносовФОТ(
				ПеречислениеНалогаИПТаблица, РеквизитыИПТаблица);
			
			СтруктураОтбора = Новый Структура("Счет, Субконто1", СтрокаТаблицы.СчетУчета, Перечисления.ВидыПлатежейВГосБюджет.Налог);
			МассивСтрок = ТаблицаИПНачислениеЗарплаты.НайтиСтроки(СтруктураОтбора);
			
			Для Каждого СтрокаМассива ИЗ МассивСтрок Цикл
				СтруктураОтбора = Новый Структура("СчетУчета, СтатьяЗатрат", СтрокаТаблицы.СчетУчета, СтрокаМассива.Субконто1);
				МассивСтрокПрочиеРасходы = ТаблицаПрочиеРасходы.НайтиСтроки(СтруктураОтбора);
				Для Каждого СтрокаМассиваПрочиеРасходы ИЗ МассивСтрокПрочиеРасходы Цикл
					Если СтрокаТаблицы.СуммаКЗачету = 0 Тогда
						Прервать;
					КонецЕсли;
					НоваяСтрока = ТаблицыУплатыВзносовФОТИП.СписокВзносов.Добавить();
					НоваяСтрока.ДокументОплаты       = Реквизиты.Регистратор;
					НоваяСтрока.РасчетныйДокумент    = Реквизиты.Регистратор;
					НоваяСтрока.СтатьяЗатрат         = СтрокаМассиваПрочиеРасходы.СтатьяЗатрат;
					НоваяСтрока.НоменклатурнаяГруппа = СтрокаМассиваПрочиеРасходы.НоменклатурнаяГруппа;
					НоваяСтрока.ХарактерДеятельности = СтрокаМассиваПрочиеРасходы.ХарактерДеятельности;
					НоваяСтрока.СуммаОплаты          = Мин(СтрокаТаблицы.СуммаКЗачету, СтрокаМассива.Сумма);
					
					СтрокаТаблицы.СуммаКЗачету = СтрокаТаблицы.СуммаКЗачету - НоваяСтрока.СуммаОплаты;
					
				КонецЦикла;
			КонецЦикла;
			
			Если ТаблицыУплатыВзносовФОТИП.СписокВзносов.Количество() <> 0 Тогда
				СписокПереплат.Очистить();
				УчетДоходовИРасходовПредпринимателя.СформироватьДвиженияУплатаВзносовФОТ(
					ТаблицыУплатыВзносовФОТИП.СписокВзносов,
					СписокПереплат,
					РеквизитыИПТаблица,
					Движения,
					Отказ);
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

Функция ПодготовитьТаблицуРасчетовПоНачисленнымПособиямИП(ТаблицаЗаработнойПлаты, Реквизиты)
	
	СчетаУчетаВзносов = Новый Массив;
	СчетаУчетаВзносов.Добавить(ПланыСчетов.Хозрасчетный.ФСС);
	СчетаУчетаВзносов.Добавить(ПланыСчетов.Хозрасчетный.ФСС_НСиПЗ);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",       Реквизиты.Организация);
	Запрос.УстановитьПараметр("Период",            Новый Граница(Новый МоментВремени(Реквизиты.Регистратор.Дата, Реквизиты.Регистратор), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("СчетаУчетаВзносов", СчетаУчетаВзносов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПрочиеРасчетыОстатки.СчетУчета КАК СчетУчета,
	|	СУММА(ПрочиеРасчетыОстатки.СуммаОстаток) КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ПрочиеРасчеты.Остатки(
	|			&Период,
	|			Контрагент = НЕОПРЕДЕЛЕНО
	|				И СчетУчета В (&СчетаУчетаВзносов)
	|				И Организация = &Организация) КАК ПрочиеРасчетыОстатки
	|ГДЕ
	|	ПрочиеРасчетыОстатки.СуммаОстаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ПрочиеРасчетыОстатки.СчетУчета";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаВзносов = Новый ТаблицаЗначений;
	ТаблицаВзносов.Колонки.Добавить("СчетУчета",      Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	ТаблицаВзносов.Колонки.Добавить("СуммаКЗачету",   ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	ТаблицаВзносов.Колонки.Добавить("СуммаПереплаты", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	
	ТаблицаЗаработнойПлаты.Индексы.Добавить("ВидОперации");
	
	ТаблицаРасчетов    = ТаблицаЗаработнойПлаты.Скопировать(Новый Структура("ВидОперации", Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюФСС));
	СуммаРасчетовФСС   = ТаблицаРасчетов.Итог("Сумма");
	ТаблицаРасчетов    = ТаблицаЗаработнойПлаты.Скопировать(Новый Структура("ВидОперации", Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюФССНС));
	СуммаРасчетовФССНС = ТаблицаРасчетов.Итог("Сумма");
	
	Если РезультатЗапроса.Пустой() Тогда
		Если СуммаРасчетовФСС <> 0 Тогда
			НоваяСтрока = ТаблицаВзносов.Добавить();
			НоваяСтрока.СчетУчета      = ПланыСчетов.Хозрасчетный.ФСС;
			НоваяСтрока.СуммаПереплаты = СуммаРасчетовФСС;
		КонецЕсли;
		Если СуммаРасчетовФССНС <> 0 Тогда
			НоваяСтрока = ТаблицаВзносов.Добавить();
			НоваяСтрока.СчетУчета      = ПланыСчетов.Хозрасчетный.ФСС_НСиПЗ;
			НоваяСтрока.СуммаПереплаты = СуммаРасчетовФССНС;
		КонецЕсли;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ТаблицаВзносов.Добавить();
			НоваяСтрока.СчетУчета = Выборка.СчетУчета;
			Если Выборка.СчетУчета = ПланыСчетов.Хозрасчетный.ФСС Тогда
				СуммаРасчетов = СуммаРасчетовФСС;
			Иначе
				СуммаРасчетов = СуммаРасчетовФССНС;
			КонецЕсли;
			
			Если СуммаРасчетов < Выборка.СуммаОстаток Тогда
				НоваяСтрока.СуммаКЗачету = СуммаРасчетов;
			Иначе
				НоваяСтрока.СуммаКЗачету   = Выборка.СуммаОстаток;
				НоваяСтрока.СуммаПереплаты = СуммаРасчетов - Выборка.СуммаОстаток;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТаблицаВзносов;
	
КонецФункции

Функция ДатаНачалаАдминистрированияСтраховыхВзносовФНС() Экспорт
	
	Возврат '20170101';
	
КонецФункции

Процедура ПроверитьПоддержкуСовместительства(ВидЗанятости) Экспорт
	
	Если Константы.ПоддержкаСовместительства.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидЗанятости)
		И ВидЗанятости <> Перечисления.ВидыЗанятости.ОсновноеМестоРаботы Тогда
		УстановитьПривилегированныйРежим(Истина);
		Константы.ПоддержкаСовместительства.Установить(Истина);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПериодРегистрации(Регистратор, Знач ПериодРегистрации) Экспорт
	
	ПериодРегистрации = КонецМесяца(ПериодРегистрации);
	ДатаРегистратора  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Регистратор, "Дата");
		
	Если КонецМесяца(ДатаРегистратора) = ПериодРегистрации Тогда
		Если КонецДня(ДатаРегистратора) = ПериодРегистрации Тогда
			ПериодРегистрации = ДатаРегистратора;
		Иначе
			Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.Отпуск")
				Или ТипЗнч(Регистратор) = Тип("ДокументСсылка.БольничныйЛист")
				Или ТипЗнч(Регистратор) = Тип("ДокументСсылка.НачислениеАванса") 
				Или ТипЗнч(Регистратор) = Тип("ДокументСсылка.ДепонированиеЗарплаты") Тогда
				ПериодРегистрации = ДатаРегистратора;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПериодРегистрации;
	
КонецФункции

#КонецОбласти

#Область СозданиеДенежныхДокументов

Процедура СформироватьДокументыОплаты(Форма) Экспорт
	
	Основание = Форма.Объект.Ссылка;
	
	ТребуетсяЗапись     = НЕ ЗначениеЗаполнено(Форма.Параметры.Ключ) ИЛИ Форма.Модифицированность;
	ТребуетсяПроведение = НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "Проведен");
	
	Если ТребуетсяЗапись ИЛИ ТребуетсяПроведение Тогда
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплаты") Тогда
			ПараметрыЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись);
		Иначе
			ПараметрыЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		Форма.Записать(ПараметрыЗаписи);
	КонецЕсли;
	
	Построчно = Ложь;
	ИмяКолонкиВыплаты = "КВыплате";
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплаты") Тогда
		
		ИмяКолонкиВыплаты = "Сумма";
		
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "ВидМестаВыплаты") = Перечисления.ВидыМестВыплатыЗарплаты.ЗарплатныйПроект
			ИЛИ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "ВидМестаВыплаты") = Перечисления.ВидыМестВыплатыЗарплаты.БанковскийСчет Тогда
			ИмяДокументаВыплаты = "СписаниеСРасчетногоСчета";
			Построчно = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "ВидМестаВыплаты") = Перечисления.ВидыМестВыплатыЗарплаты.БанковскийСчет;
		Иначе
			ИмяДокументаВыплаты = "РасходныйКассовыйОрдер";
		КонецЕсли;

		СписокРеквизитовОснования = "Организация, ПодразделениеОрганизации, Дата, Проведен";
		РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, СписокРеквизитовОснования);
		
	Иначе
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыВКассу") Тогда
			ИмяДокументаВыплаты = "РасходныйКассовыйОрдер";
		Иначе
			ИмяДокументаВыплаты = "СписаниеСРасчетногоСчета";
			Построчно = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "ВидМестаВыплаты") = Перечисления.ВидыМестВыплатыЗарплаты.БанковскийСчет;
		КонецЕсли;
		СписокРеквизитовОснования = "Организация, Подразделение, Дата, Проведен";
		РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, СписокРеквизитовОснования);
		РеквизитыОснования.Вставить("ПодразделениеОрганизации", РеквизитыОснования.Подразделение);
	КонецЕсли;
	
	СтатьяДвиженияДенежныхСредств = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.СтатьиДвиженияДенежныхСредств.ОплатаТруда");
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплаты") Тогда
		РежимЗаписи = ?(НЕ Основание.ПометкаУдаления,
			РежимЗаписиДокумента.Проведение,
			РежимЗаписиДокумента.Запись);
	Иначе
		РежимЗаписи = ?(Основание.Проведен,
			РежимЗаписиДокумента.Проведение,
			РежимЗаписиДокумента.Запись);
	КонецЕсли;
		
	МассивДокументов= Новый Массив;
	МассивДокументов.Добавить(Основание);
	
	Если Построчно Тогда
		
		ТаблицаВыплат = Основание.Зарплата.Выгрузить();
		ТаблицаВыплат.Свернуть("ФизическоеЛицо", "КомпенсацияЗаЗадержкуЗарплаты, " + ИмяКолонкиВыплаты);
		
		Для Каждого СтрокаТаблицы ИЗ ТаблицаВыплат Цикл
			ДокументВыплаты = Документы[ИмяДокументаВыплаты].СоздатьДокумент();
			ДокументВыплаты.Заполнить(МассивДокументов);
			ДокументВыплаты.ПеречислениеЗаработнойПлаты.Очистить();
			ДокументВыплаты.ВидОперации                   = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеЗаработнойПлатыРаботнику;
			ДокументВыплаты.Контрагент                    = СтрокаТаблицы.ФизическоеЛицо;
			ДокументВыплаты.ПлатежнаяВедомость            = Основание;
			ДокументВыплаты.СуммаДокумента                = СтрокаТаблицы.КомпенсацияЗаЗадержкуЗарплаты + СтрокаТаблицы[ИмяКолонкиВыплаты];
			ДокументВыплаты.СтатьяДвиженияДенежныхСредств = СтатьяДвиженияДенежныхСредств;
			ДокументВыплаты.НазначениеПлатежа             = Документы.СписаниеСРасчетногоСчета.ПолучитьНазначениеПлатежа(ДокументВыплаты);
			Попытка
				ДокументВыплаты.Записать(РежимЗаписи);
			Исключение
				ДокументВыплаты.Записать(РежимЗаписиДокумента.Запись);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось провести документ " + ДокументВыплаты + ". Документ был записан. Проверьте правильность заполнения реквизитов.", , , , );
			КонецПопытки;	
		КонецЦикла;
		
	Иначе
		ДокументВыплаты = Документы[ИмяДокументаВыплаты].СоздатьДокумент();
		ДокументВыплаты.Заполнить(МассивДокументов);
		ДокументВыплаты.СтатьяДвиженияДенежныхСредств = СтатьяДвиженияДенежныхСредств;
		ДокументВыплаты.Дата                           = Основание.Дата;
		Попытка
			ДокументВыплаты.Записать(РежимЗаписи);
		Исключение
			ДокументВыплаты.Записать(РежимЗаписиДокумента.Запись);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось провести документ " + ДокументВыплаты + ". Документ был записан. Проверьте правильность заполнения реквизитов.", , , , );
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОбновления

Процедура ОбработатьРасчетныйПериодДокументов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НачислениеЗарплаты.Ссылка КАК Ссылка,
	|	""МесяцНачисления"" КАК ИмяРеквизита
	|ИЗ
	|	Документ.НачислениеЗарплаты КАК НачислениеЗарплаты
	|ГДЕ
	|	НачислениеЗарплаты.МесяцНачисления <> НАЧАЛОПЕРИОДА(НачислениеЗарплаты.МесяцНачисления, МЕСЯЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БольничныйЛист.Ссылка,
	|	""ПериодРегистрации""
	|ИЗ
	|	Документ.БольничныйЛист КАК БольничныйЛист
	|ГДЕ
	|	БольничныйЛист.ПериодРегистрации <> НАЧАЛОПЕРИОДА(БольничныйЛист.ПериодРегистрации, МЕСЯЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Отпуск.Ссылка,
	|	""ПериодРегистрации""
	|ИЗ
	|	Документ.Отпуск КАК Отпуск
	|ГДЕ
	|	Отпуск.ПериодРегистрации <> НАЧАЛОПЕРИОДА(Отпуск.ПериодРегистрации, МЕСЯЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВедомостьНаВыплатуЗарплатыВБанк.Ссылка,
	|	""ПериодРегистрации""
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплатыВБанк КАК ВедомостьНаВыплатуЗарплатыВБанк
	|ГДЕ
	|	ВедомостьНаВыплатуЗарплатыВБанк.ПериодРегистрации <> НАЧАЛОПЕРИОДА(ВедомостьНаВыплатуЗарплатыВБанк.ПериодРегистрации, МЕСЯЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВедомостьНаВыплатуЗарплатыВКассу.Ссылка,
	|	""ПериодРегистрации""
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплатыВКассу КАК ВедомостьНаВыплатуЗарплатыВКассу
	|ГДЕ
	|	ВедомостьНаВыплатуЗарплатыВКассу.ПериодРегистрации <> НАЧАЛОПЕРИОДА(ВедомостьНаВыплатуЗарплатыВКассу.ПериодРегистрации, МЕСЯЦ)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект[Выборка.ИмяРеквизита] = НачалоМесяца(ДокументОбъект[Выборка.ИмяРеквизита]);
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьРеквизитыБольничныхЛистов() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	БольничныйЛист.Ссылка КАК Ссылка,
	|	БольничныйЛист.ФизическоеЛицо КАК ФизическоеЛицо
	|ИЗ
	|	Документ.БольничныйЛист КАК БольничныйЛист
	|ГДЕ
	|	БольничныйЛист.Проведен";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		// Код нарушения режима
		Если ЗначениеЗаполнено(ДокументОбъект.ДатаНарушенияРежима)
			И НЕ ЗначениеЗаполнено(ДокументОбъект.КодНарушенияРежима) Тогда
			ДокументОбъект.КодНарушенияРежима = 24;
		КонецЕсли;
		
		// Стаж
		Если ДокументОбъект.СтажЛет = 0 И ДокументОбъект.СтажМесяцев = 0 Тогда
			Если (ДокументОбъект.ПрименятьЛьготыПриНачисленииПособия
					И ДокументОбъект.ОграничениеПособияБезЛьгот = Перечисления.ВидыОграниченияПособия.ОграничениеВРазмереММОТ)
				ИЛИ (НЕ ДокументОбъект.ПрименятьЛьготыПриНачисленииПособия
					И ДокументОбъект.ОграничениеПособия = Перечисления.ВидыОграниченияПособия.ОграничениеВРазмереММОТ) Тогда
				ДокументОбъект.СтажМесяцев = 1;
			ИначеЕсли ДокументОбъект.ПроцентОплаты > 0 И ДокументОбъект.ПроцентОплаты <= 60 Тогда
				ДокументОбъект.СтажЛет = 1;
			ИначеЕсли ДокументОбъект.ПроцентОплаты > 60 И ДокументОбъект.ПроцентОплаты <= 80 Тогда
				ДокументОбъект.СтажЛет = 5;
			Иначе
				ДокументОбъект.СтажЛет = 8;
			КонецЕсли;
		КонецЕсли;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
		
		// Льготы
		Если ДокументОбъект.ПрименятьЛьготыПриНачисленииПособия Тогда
			СправочникОбъект = Выборка.ФизическоеЛицо.ПолучитьОбъект();
			Если НЕ ЗначениеЗаполнено(СправочникОбъект.ЛьготаПриНачисленииПособий) Тогда
				СправочникОбъект.ЛьготаПриНачисленииПособий = ДокументОбъект.ФинансированиеФедеральнымБюджетом;
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьРеквизитыНачисленияЗарплаты() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачислениеЗарплаты.Ссылка КАК Ссылка,
	|	НачислениеЗарплаты.КорректироватьНДФЛ КАК КорректироватьНДФЛ,
	|	НачислениеЗарплаты.КорректироватьВзносы КАК КорректироватьВзносы
	|ИЗ
	|	Документ.НачислениеЗарплаты КАК НачислениеЗарплаты
	|ГДЕ
	|	(НачислениеЗарплаты.КорректироватьНДФЛ
	|			ИЛИ НачислениеЗарплаты.КорректироватьВзносы)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		Если Выборка.КорректироватьНДФЛ Тогда
			ВременнаяТаблица = ДокументОбъект.НДФЛ.Выгрузить();
			ВременнаяТаблица.ЗаполнитьЗначения(Истина, "ФиксСтрока");
			ВременнаяТаблица.ЗаполнитьЗначения(Истина, "ФиксРасчет");
			ДокументОбъект.НДФЛ.Загрузить(ВременнаяТаблица);
		КонецЕсли;
		
		Если Выборка.КорректироватьВзносы Тогда
			ВременнаяТаблица = ДокументОбъект.Взносы.Выгрузить();
			ВременнаяТаблица.ЗаполнитьЗначения(Истина, "ФиксРасчет");
			ДокументОбъект.Взносы.Загрузить(ВременнаяТаблица);
		КонецЕсли;
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
	
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьВидМестаВыплатыВедомостиВБанк() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВедомостьНаВыплатуЗарплатыВБанк.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплатыВБанк КАК ВедомостьНаВыплатуЗарплатыВБанк
	|ГДЕ
	|	ВедомостьНаВыплатуЗарплатыВБанк.ВидМестаВыплаты = ЗНАЧЕНИЕ(Перечисление.ВидыМестВыплатыЗарплаты.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		Если ЗначениеЗаполнено(ДокументОбъект.ЗарплатныйПроект) Тогда
			ДокументОбъект.ВидМестаВыплаты = Перечисления.ВидыМестВыплатыЗарплаты.ЗарплатныйПроект;
		Иначе
			ДокументОбъект.ВидМестаВыплаты = Перечисления.ВидыМестВыплатыЗарплаты.БанковскийСчет;
		КонецЕсли;
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьОкругление() Экспорт
	
	Справочники.СпособыВыплатыЗарплаты.ЗаполнитьОкругление();
	
КонецПроцедуры

Процедура ОбновитьНастройкиНачисленийУдержаний() Экспорт
	
	Начисления = РасчетЗарплаты.НачисленияПоКатегории(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоЛиста);
	Если Начисления.Количество()<> 0 Тогда
		НачислениеОбъект = Начисления[0].ПолучитьОбъект();
		НачислениеОбъект.Наименование = НСтр("ru = 'Больничный за счет ФСС'");
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НачислениеОбъект);
	КонецЕсли;
	
	ПланыВидовРасчета.Начисления.СоздатьНачисленияПоНастройкам();
	ПланыВидовРасчета.Удержания.СоздатьУдержанияПоНастройкам();
	
КонецПроцедуры

#КонецОбласти

// СК [07.06.2022] - требуется для подсистемы РегламентированнаяОтчетность (3.0.113.17)

Процедура ПереопределитьСтатусИСостояниеСдачиОтчетности(Ссылка, СтатусОтправки, СостояниеСдачиОтчетности) Экспорт
	
КонецПроцедуры

Функция ДатаНачалаПередачиЧастичныхУведомленийПоНДФЛ() Экспорт
	
	НачалоПередачиЧастичныхУведомлений = Дата(2023, 10, 1);
	
	Возврат НачалоПередачиЧастичныхУведомлений;
	
КонецФункции

Функция УдержанныйНДФЛПоДокументу(Организация, ДокументСсылка) Экспорт
	
	ПереноситьСрокУплаты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "Дата") >= НастройкиУчетаКлиентСервер.ДатаПереходаНаЕдиныйНалоговыйПлатеж();
	
	ТаблицаНДФЛ = НоваяТаблицаУдержанногоНДФЛ();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",    Организация);
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СведенияОбУдержанномНДФЛНДФЛ.КодБК КАК КодБК,
	|	СведенияОбУдержанномНДФЛНДФЛ.КодНалоговогоОргана КАК КодНалоговогоОргана,
	|	СведенияОбУдержанномНДФЛНДФЛ.КПП КАК КПП,
	|	СведенияОбУдержанномНДФЛНДФЛ.КодПоОКТМО КАК КодПоОКТМО,
	|	СведенияОбУдержанномНДФЛНДФЛ.СрокУплаты КАК СрокУплаты,
	|	СУММА(СведенияОбУдержанномНДФЛНДФЛ.Сумма) КАК Сумма
	|ИЗ
	|	Документ.СведенияОбУдержанномНДФЛ КАК СведенияОбУдержанномНДФЛ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СведенияОбУдержанномНДФЛ.НДФЛ КАК СведенияОбУдержанномНДФЛНДФЛ
	|		ПО СведенияОбУдержанномНДФЛ.Ссылка = СведенияОбУдержанномНДФЛНДФЛ.Ссылка
	|ГДЕ
	|	СведенияОбУдержанномНДФЛ.Организация = &Организация
	|	И СведенияОбУдержанномНДФЛ.Ссылка = &ДокументСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОбУдержанномНДФЛНДФЛ.КодБК,
	|	СведенияОбУдержанномНДФЛНДФЛ.КодПоОКТМО,
	|	СведенияОбУдержанномНДФЛНДФЛ.КодНалоговогоОргана,
	|	СведенияОбУдержанномНДФЛНДФЛ.КПП,
	|	СведенияОбУдержанномНДФЛНДФЛ.СрокУплаты";

	Результат = Запрос.Выполнить().Выгрузить();
		
	Для Каждого СтрокаТаблицы Из Результат Цикл
		
		Если СтрокаТаблицы.Сумма <> 0 Тогда
			НоваяСтрока = ТаблицаНДФЛ.Добавить();
			НоваяСтрока.Организация = Организация;
			НоваяСтрока.Налог                       = Справочники.ВидыНалоговИПлатежейВБюджет.НалогПоКБК(СтрокаТаблицы.КодБК);
			НоваяСтрока.ВидНалога                   = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.Налог, "ВидНалога");
			НоваяСтрока.КБК                         = СтрокаТаблицы.КодБК;
			НоваяСтрока.КодНалоговогоОргана         = СтрокаТаблицы.КодНалоговогоОргана;
			НоваяСтрока.КПП                         = СтрокаТаблицы.КПП;
			НоваяСтрока.ОКАТО                       = СтрокаТаблицы.КодПоОКТМО;
			НоваяСтрока.Сумма                       = СтрокаТаблицы.Сумма;
			НоваяСтрока.СрокУплаты                  = СтрокаТаблицы.СрокУплаты;
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаполнитьРегистрациюВНалоговомОрганеВКоллекцииСтрок(Организация, ТаблицаНДФЛ);
	
	Возврат ТаблицаНДФЛ;
	
КонецФункции

Функция НоваяТаблицаУдержанногоНДФЛ()
	
	ТаблицаНДФЛ = Новый ТаблицаЗначений;
	ТаблицаНДФЛ.Колонки.Добавить("Организация",                 Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаНДФЛ.Колонки.Добавить("РегистрацияВНалоговомОргане", Новый ОписаниеТипов("СправочникСсылка.РегистрацииВНалоговомОргане"));
	ТаблицаНДФЛ.Колонки.Добавить("КодНалоговогоОргана",         Новый ОписаниеТипов("Строка"));
	ТаблицаНДФЛ.Колонки.Добавить("Налог",                       Новый ОписаниеТипов("СправочникСсылка.ВидыНалоговИПлатежейВБюджет"));
	ТаблицаНДФЛ.Колонки.Добавить("ВидНалога",                   Новый ОписаниеТипов("ПеречислениеСсылка.ВидыНалогов"));
	ТаблицаНДФЛ.Колонки.Добавить("КБК",                         Новый ОписаниеТипов("Строка"));
	ТаблицаНДФЛ.Колонки.Добавить("КПП",                         Новый ОписаниеТипов("Строка"));
	ТаблицаНДФЛ.Колонки.Добавить("ОКАТО",                       Новый ОписаниеТипов("Строка"));
	ТаблицаНДФЛ.Колонки.Добавить("Сумма",                       Новый ОписаниеТипов("Число"));
	ТаблицаНДФЛ.Колонки.Добавить("СрокУплаты",                  Новый ОписаниеТипов("Дата"));
	
	Возврат ТаблицаНДФЛ;
	
КонецФункции

#Область РегламентныеОперации

// Формирование переноса остатков резервов по отпускам за прошлый год
//
// Параметры:
//  Движения	 - КоллекцияДвижений	 - коллекция движений документа, который выполняет перенос
//  Реквизиты	 - СтрокаТаблицыЗначений - строка таблицы параметров проведения
//  МассивОшибок - Массив - массив ошибок, которые могут возникнуть при выполнении переноса 
//
Процедура СформироватьПереносОстатковРезервовПоОтпускамЗаПрошлыйГод(Движения, Реквизиты, МассивОшибок) Экспорт
		
	МассивСчетаУчетаВознагражденияРаботникам = Новый Массив;
	МассивСчетаУчетаВознагражденияРаботникам.Добавить(ПланыСчетов.ЕПС.ОбязательстваПоВыплатеКраткосрочныхВознагражденийРаботникам); // 60305
	// 60306 не используем, т.к. нет базовых операций, когда резервы ведутся на этом счете
	
	МассивСчетаУчетаСтраховыхВзносовПоРезервамОтпусков = Новый Массив;
	МассивСчетаУчетаСтраховыхВзносовПоРезервамОтпусков.Добавить(ПланыСчетов.ЕПС.РасчетыПоСоциальномуСтрахованиюИОбеспечениюП); // 60335
	// 60336 не используем, т.к. нет базовых операций, когда резервы страховых взносов ведутся на этом счете

	МассивВидовРезервовПоОтпускам = Новый Массив;
	МассивВидовРезервовПоОтпускам.Добавить(Перечисления.ЮС_ВидыВыплатРаботникам.РезервыПоОтпускам);
	МассивВидовРезервовПоОтпускам.Добавить(Перечисления.ЮС_ВидыВыплатРаботникам.РезервыПоОтпускамДо2022Года);
	МассивВидовРезервовПоОтпускам.Добавить(Перечисления.ЮС_ВидыВыплатРаботникам.РезервыПоОтпускамЗаПрошлыеПериоды); 
	
	МассивВидовСтраховыхВзносов = Новый Массив;
	МассивВидовСтраховыхВзносов.Добавить(Перечисления.ЮС_ВидыСтраховыхВзносов.СтраховыеВзносыПоРезервамПоОтпускам);
	МассивВидовСтраховыхВзносов.Добавить(Перечисления.ЮС_ВидыСтраховыхВзносов.СтраховыеВзносыПоРезервамПоОтпускамДо2022Года);
	МассивВидовСтраховыхВзносов.Добавить(Перечисления.ЮС_ВидыСтраховыхВзносов.СтраховыеВзносыПоРезервамПоОтпускамЗаПрошлыеПериоды);

	ОсновноеПодразделение = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновноеПодразделениеОрганизации");
	// Чтобы не подставлять подразделение от другой организации
	Если ОсновноеПодразделение.Владелец <> Реквизиты.Организация Тогда
		ОсновноеПодразделение = Неопределено;
	КонецЕсли;
	
	// Собрать таблицы с остатками резервов
	// - по БУ, остатки по резервам (текущего года и прошлого)
	// - по управленческому учета, по регистру накопления (остатки общие)
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьЗапросДляПолученияОстатковПоРезервамПоОтпускам();
	
	Запрос.УстановитьПараметр("Период", 								Новый Граница(Реквизиты.Период, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", 							Реквизиты.Организация);
	Запрос.УстановитьПараметр("СчетаУчетаВознагражденияРаботникам", 	МассивСчетаУчетаВознагражденияРаботникам);
	Запрос.УстановитьПараметр("ВидыРезервовПоОтпускам", 				МассивВидовРезервовПоОтпускам);
	Запрос.УстановитьПараметр("СчетаУчетаСтраховыхВзносовПоОтпускам", 	МассивСчетаУчетаСтраховыхВзносовПоРезервамОтпусков);
	Запрос.УстановитьПараметр("ВидыСтраховыхВзносов", 					МассивВидовСтраховыхВзносов);

	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ОстаткиРезервовПоОтпускамСотрудникиБУ 	= РезультатЗапроса[1].Выбрать();
	ОстаткиРезервовПоОтпускамСотрудникиУпр 	= РезультатЗапроса[3].Выбрать();
	ОстаткиРезервовПоОтпускамВзносыБУ       = РезультатЗапроса[5].Выбрать();
	
	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ
	
	ТаблицаПроверкиБУИУпрУчета = Новый ТаблицаЗначений;
	ТаблицаПроверкиБУИУпрУчета.Колонки.Добавить("ФизическоеЛицо");
	ТаблицаПроверкиБУИУпрУчета.Колонки.Добавить("СуммаРезерва");
	
	Пока ОстаткиРезервовПоОтпускамСотрудникиБУ.Следующий() Цикл
		
		ТипВыплатыРаботникуРезервыЗаПрошлыеПериоды 			= Перечисления.ЮС_ВидыВыплатРаботникам.РезервыПоОтпускамЗаПрошлыеПериоды;
		ИспользуемыеСчетаПоРаботникуРезервыЗаПрошлыеПериоды	= ЮС_СчетаУчетаВДокументах.ПолучитьСчетаРасчетовСРаботниками(Реквизиты.Организация, 
		ОстаткиРезервовПоОтпускамСотрудникиБУ.Субконто1,, ТипВыплатыРаботникуРезервыЗаПрошлыеПериоды);
		
		Если ИспользуемыеСчетаПоРаботникуРезервыЗаПрошлыеПериоды = Неопределено
			Или Не ЗначениеЗаполнено(ИспользуемыеСчетаПоРаботникуРезервыЗаПрошлыеПериоды.СчетУчетаПассивный) Тогда
			
			ШаблонСообщения = НСтр("ru = 'По сотруднику %1 не найдены лицевые счета для учета резервов отпусков за прошлые периоды! Перенос не будет сформирован'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, ОстаткиРезервовПоОтпускамСотрудникиБУ.Субконто1);
			МассивОшибок.Добавить(ТекстСообщения);
			
			Продолжить;
			
		КонецЕсли;
		
		ЮС_УправлениеЛомбардом.СформироватьПроводкуЕПС(Движения.ЕПС, Реквизиты.Период, Реквизиты.Организация, 
			ОстаткиРезервовПоОтпускамСотрудникиБУ.СуммаРезерваБУ,,,,,,,
			,,
			"Перенос суммы сформированного резерва за прошлый период",,
			ОстаткиРезервовПоОтпускамСотрудникиБУ.ЛицевойСчет.Владелец, ИспользуемыеСчетаПоРаботникуРезервыЗаПрошлыеПериоды.СчетУчетаПассивный.Владелец,
			ОстаткиРезервовПоОтпускамСотрудникиБУ.ЛицевойСчет, ИспользуемыеСчетаПоРаботникуРезервыЗаПрошлыеПериоды.СчетУчетаПассивный,
			ОсновноеПодразделение, ОсновноеПодразделение, // резервы всегда на основном подразделении
			ОстаткиРезервовПоОтпускамСотрудникиБУ.Субконто1, ОстаткиРезервовПоОтпускамСотрудникиБУ.Субконто2,,
			ОстаткиРезервовПоОтпускамСотрудникиБУ.Субконто1, ОстаткиРезервовПоОтпускамСотрудникиБУ.Субконто2);
		
		СтрокаТаблицаПроверкиБУИУпрУчета = ТаблицаПроверкиБУИУпрУчета.Найти(ОстаткиРезервовПоОтпускамСотрудникиБУ.Субконто1, "ФизическоеЛицо");	
		Если СтрокаТаблицаПроверкиБУИУпрУчета = Неопределено Тогда
			НоваяСтрокаТаблицаПроверкиБУИУпрУчета = ТаблицаПроверкиБУИУпрУчета.Добавить();
			НоваяСтрокаТаблицаПроверкиБУИУпрУчета.ФизическоеЛицо 	= ОстаткиРезервовПоОтпускамСотрудникиБУ.Субконто1;
			НоваяСтрокаТаблицаПроверкиБУИУпрУчета.СуммаРезерва 		= ОстаткиРезервовПоОтпускамСотрудникиБУ.СуммаРезерваБУ;
		Иначе
			СтрокаТаблицаПроверкиБУИУпрУчета.СуммаРезерва = СтрокаТаблицаПроверкиБУИУпрУчета.СуммаРезерва + ОстаткиРезервовПоОтпускамСотрудникиБУ.СуммаРезерваБУ;
		КонецЕсли;
		
	КонецЦикла;
		
	Пока ОстаткиРезервовПоОтпускамСотрудникиУпр.Следующий() Цикл
		
		СтрокаТаблицаПроверкиБУИУпрУчета = ТаблицаПроверкиБУИУпрУчета.Найти(ОстаткиРезервовПоОтпускамСотрудникиУпр.ФизическоеЛицо, "ФизическоеЛицо");	
		Если СтрокаТаблицаПроверкиБУИУпрУчета = Неопределено Тогда
			СтрокаТаблицаПроверкиБУИУпрУчета = Новый Структура;
			СтрокаТаблицаПроверкиБУИУпрУчета.Вставить("ФизическоеЛицо", 	ОстаткиРезервовПоОтпускамСотрудникиУпр.ФизическоеЛицо);
			СтрокаТаблицаПроверкиБУИУпрУчета.Вставить("СуммаРезерва", 		0);
		КонецЕсли;	
		Если СтрокаТаблицаПроверкиБУИУпрУчета.СуммаРезерва <> ОстаткиРезервовПоОтпускамСотрудникиУпр.СуммаРезерваУпр Тогда
			
			ШаблонСообщения = НСтр("ru = 'По сотруднику %1 обнаружено расхождение бухгалтерского и управленческого учета по суммам резервов по отпускам!
				|Сумма по БУ %2, сумма по управленческому учету %3'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, 
				ОстаткиРезервовПоОтпускамСотрудникиУпр.ФизическоеЛицо, СтрокаТаблицаПроверкиБУИУпрУчета.СуммаРезерва, ОстаткиРезервовПоОтпускамСотрудникиУпр.СуммаРезерваУпр);
			МассивОшибок.Добавить(ТекстСообщения);
			
			Продолжить;
			
		КонецЕсли;
		
		СуммаРезерваДляОтражения = ОстаткиРезервовПоОтпускамСотрудникиУпр.СуммаРезерваУпр - ОстаткиРезервовПоОтпускамСотрудникиУпр.СуммаРезерваПрошлыйПериодУпр;
		СуммаРезерваВзносыДляОтражения = ОстаткиРезервовПоОтпускамСотрудникиУпр.СуммаРезерваВзносыУпр - ОстаткиРезервовПоОтпускамСотрудникиУпр.СуммаРезерваВзносыПрошлыйПериодУпр;
		
		Если СуммаРезерваДляОтражения <> 0 
			Или СуммаРезерваВзносыДляОтражения <> 0 Тогда
			НоваяСтрока = Движения.ОценочныеОбязательстваПоСотрудникамЗаПрошедшиеПериоды.ДобавитьПриход();
			НоваяСтрока.Организация    		= Реквизиты.Организация;
			НоваяСтрока.Период         		= Реквизиты.Период;
			НоваяСтрока.ФизическоеЛицо	 	= ОстаткиРезервовПоОтпускамСотрудникиУпр.ФизическоеЛицо;
			НоваяСтрока.СуммаРезерва        = СуммаРезерваДляОтражения;
			НоваяСтрока.СуммаРезерваВзносы 	= СуммаРезерваВзносыДляОтражения;
		КонецЕсли;
		
	КонецЦикла;
	
	Движения.ОценочныеОбязательстваПоСотрудникамЗаПрошедшиеПериоды.Записывать = Истина;

	ПараметрОтраженияВБУСтраховыеВзносы = ЮС_СчетаУчетаВДокументах.ПараметрОтраженияВБУСтраховыеВзносы();
	ВидСтраховогоВзносаПоРезервамПоОтпускамПрошлогоПериода 		= Перечисления.ЮС_ВидыСтраховыхВзносов.СтраховыеВзносыПоРезервамПоОтпускамЗаПрошлыеПериоды;
	ИспользуемыеСчетаВзносыПоРезервамПоОтпускамПрошлогоПериода	= ЮС_СчетаУчетаВДокументах.ПолучитьСчетаУчетаВидовСтраховыхВзносов(
		Реквизиты.Организация, 
		ВидСтраховогоВзносаПоРезервамПоОтпускамПрошлогоПериода,
		ПараметрОтраженияВБУСтраховыеВзносы);
	Если ИспользуемыеСчетаВзносыПоРезервамПоОтпускамПрошлогоПериода = Неопределено
		Или Не ЗначениеЗаполнено(ИспользуемыеСчетаВзносыПоРезервамПоОтпускамПрошлогоПериода.СчетУчетаПассивный) Тогда
		
		ТекстСообщения = НСтр("ru = 'По виду страхового взноса ""Страховые взносы по резервам по отпускам за прошлые периоды"" не найдены лицевые счета! Перенос не будет сформирован'");
		МассивОшибок.Добавить(ТекстСообщения);
		
		Возврат;
		
	КонецЕсли;

	Пока ОстаткиРезервовПоОтпускамВзносыБУ.Следующий() Цикл
		
		ЮС_УправлениеЛомбардом.СформироватьПроводкуЕПС(Движения.ЕПС, Реквизиты.Период, Реквизиты.Организация, 
			ОстаткиРезервовПоОтпускамВзносыБУ.СуммаРезерваВзносыБУ,,,,,,,
			,,
			"Перенос суммы сформированного резерва по страховым взносам за прошлый период",,
			ОстаткиРезервовПоОтпускамВзносыБУ.ЛицевойСчет.Владелец, ИспользуемыеСчетаВзносыПоРезервамПоОтпускамПрошлогоПериода.СчетУчетаПассивный.Владелец,
			ОстаткиРезервовПоОтпускамВзносыБУ.ЛицевойСчет, ИспользуемыеСчетаВзносыПоРезервамПоОтпускамПрошлогоПериода.СчетУчетаПассивный,
			ОсновноеПодразделение, ОсновноеПодразделение, // резервы по страховым взносам всегда на основном подразделении
			Перечисления.ВидыПлатежейВГосБюджет.Налог,,,
			Перечисления.ВидыПлатежейВГосБюджет.Налог);
				
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьЗапросДляПолученияОстатковПоРезервамПоОтпускам()
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ЕПСОстатки.Счет КАК Счет,
	               |	ЕПСОстатки.Субконто1 КАК Субконто1,
	               |	ЕПСОстатки.Субконто2 КАК Субконто2,
	               |	ЕПСОстатки.Организация КАК Организация,
	               |	ЕПСОстатки.ЛицевойСчет КАК ЛицевойСчет,
	               |	ЕПСОстатки.СуммаОстатокКт КАК СуммаРезерваБУ
	               |ПОМЕСТИТЬ ВрТ_ОстаткиБУ
	               |ИЗ
	               |	РегистрБухгалтерии.ЕПС.Остатки(&Период, Счет В (&СчетаУчетаВознагражденияРаботникам), , Организация = &Организация) КАК ЕПСОстатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВрТ_ОстаткиБУ.Счет КАК Счет,
	               |	ВрТ_ОстаткиБУ.Субконто1 КАК Субконто1,
	               |	ВрТ_ОстаткиБУ.Субконто2 КАК Субконто2,
	               |	ВрТ_ОстаткиБУ.Организация КАК Организация,
	               |	ВрТ_ОстаткиБУ.ЛицевойСчет КАК ЛицевойСчет,
	               |	ВрТ_ОстаткиБУ.СуммаРезерваБУ КАК СуммаРезерваБУ,
	               |	ЕПСИспользуемыеЛицевыеСчета.Аналитика2 КАК ВидВыплаты
	               |ИЗ
	               |	ВрТ_ОстаткиБУ КАК ВрТ_ОстаткиБУ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЕПСИспользуемыеЛицевыеСчета КАК ЕПСИспользуемыеЛицевыеСчета
	               |		ПО ВрТ_ОстаткиБУ.Счет = ЕПСИспользуемыеЛицевыеСчета.СчетУчета
	               |			И ВрТ_ОстаткиБУ.ЛицевойСчет = ЕПСИспользуемыеЛицевыеСчета.ЛицевойСчет
	               |ГДЕ
	               |	ЕПСИспользуемыеЛицевыеСчета.Аналитика2 В(&ВидыРезервовПоОтпускам)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОценочныеОбязательстваПоСотрудникамЗаПрошедшиеПериодыОстатки.Организация КАК Организация,
	               |	ОценочныеОбязательстваПоСотрудникамЗаПрошедшиеПериодыОстатки.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	ОценочныеОбязательстваПоСотрудникамЗаПрошедшиеПериодыОстатки.СуммаРезерваОстаток КАК СуммаРезерваОстаток,
	               |	ОценочныеОбязательстваПоСотрудникамЗаПрошедшиеПериодыОстатки.СуммаРезерваВзносыОстаток КАК СуммаРезерваВзносыОстаток
	               |ПОМЕСТИТЬ ВрТ_ОстаткиПоРезервамЗаПрошедшиеПериоды
	               |ИЗ
	               |	РегистрНакопления.ОценочныеОбязательстваПоСотрудникамЗаПрошедшиеПериоды.Остатки(&Период, Организация = &Организация) КАК ОценочныеОбязательстваПоСотрудникамЗаПрошедшиеПериодыОстатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОценочныеОбязательстваПоСотрудникамОстатки.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	ОценочныеОбязательстваПоСотрудникамОстатки.СуммаРезерваОстаток КАК СуммаРезерваУпр,
	               |	ОценочныеОбязательстваПоСотрудникамОстатки.СуммаРезерваСтраховыхВзносовОстаток + ОценочныеОбязательстваПоСотрудникамОстатки.СуммаРезерваФССНесчастныеСлучаиОстаток КАК СуммаРезерваВзносыУпр,
	               |	ЕСТЬNULL(ВрТ_ОстаткиПоРезервамЗаПрошедшиеПериоды.СуммаРезерваОстаток, 0) КАК СуммаРезерваПрошлыйПериодУпр,
	               |	ЕСТЬNULL(ВрТ_ОстаткиПоРезервамЗаПрошедшиеПериоды.СуммаРезерваВзносыОстаток, 0) КАК СуммаРезерваВзносыПрошлыйПериодУпр
	               |ИЗ
	               |	РегистрНакопления.ОценочныеОбязательстваПоСотрудникам.Остатки(&Период, Организация = &Организация) КАК ОценочныеОбязательстваПоСотрудникамОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВрТ_ОстаткиПоРезервамЗаПрошедшиеПериоды КАК ВрТ_ОстаткиПоРезервамЗаПрошедшиеПериоды
	               |		ПО ОценочныеОбязательстваПоСотрудникамОстатки.ФизическоеЛицо = ВрТ_ОстаткиПоРезервамЗаПрошедшиеПериоды.ФизическоеЛицо
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕПСОстатки.Счет КАК Счет,
	               |	ЕПСОстатки.Субконто1 КАК Субконто1,
	               |	ЕПСОстатки.Субконто2 КАК Субконто2,
	               |	ЕПСОстатки.Организация КАК Организация,
	               |	ЕПСОстатки.ЛицевойСчет КАК ЛицевойСчет,
	               |	ЕПСОстатки.СуммаОстатокКт КАК СуммаРезерваВзносыБУ
	               |ПОМЕСТИТЬ ВрТ_ОстаткиСтраховыеВзносыБУ
	               |ИЗ
	               |	РегистрБухгалтерии.ЕПС.Остатки(&Период, Счет В (&СчетаУчетаСтраховыхВзносовПоОтпускам), , Организация = &Организация) КАК ЕПСОстатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВрТ_ОстаткиСтраховыеВзносыБУ.Счет КАК Счет,
	               |	ВрТ_ОстаткиСтраховыеВзносыБУ.Субконто1 КАК Субконто1,
	               |	ВрТ_ОстаткиСтраховыеВзносыБУ.Субконто2 КАК Субконто2,
	               |	ВрТ_ОстаткиСтраховыеВзносыБУ.Организация КАК Организация,
	               |	ВрТ_ОстаткиСтраховыеВзносыБУ.ЛицевойСчет КАК ЛицевойСчет,
	               |	ВрТ_ОстаткиСтраховыеВзносыБУ.СуммаРезерваВзносыБУ КАК СуммаРезерваВзносыБУ,
	               |	ЕПСИспользуемыеЛицевыеСчета.Аналитика1 КАК ВидСтраховогоВзноса
	               |ИЗ
	               |	ВрТ_ОстаткиСтраховыеВзносыБУ КАК ВрТ_ОстаткиСтраховыеВзносыБУ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЕПСИспользуемыеЛицевыеСчета КАК ЕПСИспользуемыеЛицевыеСчета
	               |		ПО ВрТ_ОстаткиСтраховыеВзносыБУ.Счет = ЕПСИспользуемыеЛицевыеСчета.СчетУчета
	               |			И ВрТ_ОстаткиСтраховыеВзносыБУ.ЛицевойСчет = ЕПСИспользуемыеЛицевыеСчета.ЛицевойСчет
	               |ГДЕ
	               |	ЕПСИспользуемыеЛицевыеСчета.Аналитика1 В(&ВидыСтраховыхВзносов)";

	Возврат ТекстЗапроса;
	
КонецФункции	

#КонецОбласти
